{
  "source_file": "cvs-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.   Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”)\nOverview of Business\nCVS Health Corporation, together with its subsidiaries (collectively, “CVS Health,” the “Company,” “we,” “our” or “us”), is a leading health solutions company building a world of health around every consumer it serves and connecting care so that it works for people wherever they are. As of September 30, 2025, the Company had approximately 9,000 retail locations, more than 1,000 walk-in and primary care medical clinics and a leading pharmacy benefits manager with approximately 87 million plan members and expanding specialty pharmacy solutions. The Company also serves an estimated more than 37 million people through traditional, voluntary and consumer-directed health insurance products and related services, including expanding Medicare Advantage offerings and a leading standalone Medicare Part D prescription drug plan (“PDP”). The Company is creating new sources of value through its integrated model allowing it to expand into personalized, technology driven care delivery and health services, increasing access to quality care, delivering better health outcomes and lowering overall health care costs.\nThe Company has four reportable segments: Health Care Benefits, Health Services, Pharmacy & Consumer Wellness and Corporate/Other, which are described below.\nOverview of the Health Care Benefits Segment\nThe Health Care Benefits segment operates as one of the nation’s leading diversified health care benefits providers through its Aetna\n®\n operations. The Health Care Benefits segment has the information and resources to help members, in consultation with their health care professionals, make more informed decisions about their health care. The Health Care Benefits segment offers a broad range of traditional, voluntary and consumer-directed health insurance products and related services, including medical, pharmacy, dental and behavioral health plans, medical management capabilities, Medicare Advantage and Medicare Supplement plans, PDPs and Medicaid health care management services. The Health Care Benefits segment’s primary customers, its members, primarily access the segment’s products and services through employer groups, government-sponsored plans or individually. The Health Care Benefits segment also serves customers who purchase products and services that are ancillary to its health insurance products. The Company refers to insurance products (where it assumes all or a majority of the risk for medical and dental care costs) as “Insured” and administrative services contract products (where the plan sponsor assumes all or a majority of the risk for medical and dental care costs) as “ASC.” The Company also sells Insured plans directly to individual consumers through the individual public health insurance exchanges. The Company plans to exit the states in which Aetna operates on the individual public health insurance exchanges effective January 2026.\nOverview of the Health Services Segment\nThe Health Services segment provides a full range of pharmacy benefit management (“PBM”) solutions through its CVS Caremark\n®\n operations and delivers health care services in its medical clinics, virtually, and in the home. PBM solutions include plan design offerings and administration, formulary management, retail pharmacy network management services, and specialty and mail order pharmacy services. In addition, the Company provides clinical services, disease management services, medical spend management and pharmacy and/or other administrative services for providers and federal 340B drug pricing program covered entities (“Covered Entities”). The Company operates a group purchasing organization that negotiates pricing for the purchase of pharmaceuticals and rebates with pharmaceutical manufacturers on behalf of its participants and provides various administrative, management and reporting services to pharmaceutical manufacturers. The segment also works directly with pharmaceutical manufacturers to commercialize and/or co-produce high quality biosimilar products through its Cordavis\nTM\n subsidiary. The Health Services segment’s health care delivery assets include Signify Health, Inc. (“Signify Health”), a leader in health risk assessments and value-based care, and Oak Street Health, Inc. (“Oak Street Health”), a leading multi-payor operator of value-based primary care centers serving Medicare eligible patients. The Health Services segment’s clients and customers are primarily employers, insurance companies, unions, government employee groups, health plans, PDPs, Medicaid managed care plans, the U.S. Centers for Medicare & Medicaid Services (“\nCMS”), \nplans offered on public and private health insurance exchanges and other sponsors of health benefit plans throughout the U.S., patients who receive care in the Health Services segment’s medical clinics, virtually or in the home, as well as Covered Entities.\nOverview of the Pharmacy & Consumer Wellness Segment\nThe Pharmacy & Consumer Wellness segment dispenses prescriptions in its CVS Pharmacy\n®\n retail locations and through its infusion operations, provides ancillary pharmacy services including pharmacy patient care programs, diagnostic testing and vaccination administration, and sells a wide assortment of health and wellness products and general merchandise. The segment \n48\nalso provides pharmacy fulfillment services to support the Health Services segment’s specialty and mail order pharmacy offerings. As of September 30, 2025, the Pharmacy & Consumer Wellness segment operated approximately 9,000 retail locations, as well as online retail pharmacy websites, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services.\nOverview of the Corporate/Other Segment\nThe Company presents the remainder of its financial results in the Corporate/Other segment, which primarily consists of:\n•\nManagement and administrative expenses to support the Company’s overall operations, which include certain aspects of executive management and the corporate relations, legal, compliance, human resources and finance departments, information technology, digital, data and analytics, as well as acquisition-related integration costs; and\n•\nProducts for which the Company no longer solicits or accepts new customers, such as its large case pensions and long-term care insurance products.\n49\nOperating Results\nThe following discussion explains the material changes in the Company’s operating results for the three and nine months ended September 30, 2025 and 2024, and the significant developments affecting the Company’s financial condition since December 31, 2024. We strongly recommend that you read our audited consolidated financial statements and notes thereto and Management’s Discussion and Analysis of Financial Condition and Results of Operations, which are included in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 (the “2024 Form 10-K”).\nSummary of Consolidated Financial Results\nChange\nThree Months Ended \nSeptember 30,\nNine Months Ended\nSeptember 30,\nThree Months Ended\nSeptember 30,\n2025 vs 2024\nNine Months Ended\nSeptember 30,\n2025 vs 2024\nIn millions\n2025\n2024\n2025\n2024\n$\n%\n$\n%\nRevenues:\nProducts\n$\n64,590 \n$\n59,674 \n$\n182,866 \n$\n169,610 \n$\n4,916 \n8.2 \n%\n$\n13,256 \n7.8 \n%\nPremiums\n33,719 \n30,925 \n100,734 \n91,983 \n2,794 \n9.0 \n%\n8,751 \n9.5 \n%\nServices\n3,930 \n4,279 \n11,135 \n12,108 \n(349)\n(8.2)\n%\n(973)\n(8.0)\n%\nNet investment income\n632 \n550 \n1,639 \n1,398 \n82 \n14.9 \n%\n241 \n17.2 \n%\nTotal revenues\n102,871 \n95,428 \n296,374 \n275,099 \n7,443 \n7.8 \n%\n21,275 \n7.7 \n%\nOperating costs:\nCost of products sold\n57,045 \n52,948 \n162,107 \n151,019 \n4,097 \n7.7 \n%\n11,088 \n7.3 \n%\nHealth care costs\n32,020 \n29,922 \n92,472 \n85,578 \n2,098 \n7.0 \n%\n6,894 \n8.1 \n%\nOperating expenses\n11,288 \n10,557 \n33,522 \n31,185 \n731 \n6.9 \n%\n2,337 \n7.5 \n%\nGoodwill impairment\n5,725 \n— \n5,725 \n— \n5,725 \n100.0 \n%\n5,725 \n100.0 \n%\nRestructuring charges\n— \n1,169 \n— \n1,169 \n(1,169)\n(100.0)\n%\n(1,169)\n(100.0)\n%\nTotal operating costs\n106,078 \n94,596 \n293,826 \n268,951 \n11,482 \n12.1 \n%\n24,875 \n9.2 \n%\nOperating income (loss)\n(3,207)\n832 \n2,548 \n6,148 \n(4,039)\n(485.5)\n%\n(3,600)\n(58.6)\n%\nGain on deconsolidation of subsidiary\n483 \n— \n483 \n— \n483 \n100.0 \n%\n483 \n100.0 \n%\nInterest expense\n(784)\n(752)\n(2,332)\n(2,200)\n(32)\n(4.3)\n%\n(132)\n(6.0)\n%\nOther income\n26 \n25 \n83 \n74 \n1 \n4.0 \n%\n9 \n12.2 \n%\nIncome (loss) before income tax provision\n(3,482)\n105 \n782 \n4,022 \n(3,587)\n(3416.2)\n%\n(3,240)\n(80.6)\n%\nIncome tax provision\n508 \n34 \n1,977 \n1,059 \n474 \n1394.1 \n%\n918 \n86.7 \n%\nNet income (loss)\n(3,990)\n71 \n(1,195)\n2,963 \n(4,061)\n(5719.7)\n%\n(4,158)\n(140.3)\n%\nNet loss attributable to noncontrolling interests\n15 \n16 \n20 \n7 \n(1)\n(6.3)\n%\n13 \n185.7 \n%\nNet income (loss) attributable to CVS Health\n$\n(3,975)\n$\n87 \n$\n(1,175)\n$\n2,970 \n$\n(4,062)\n(4669.0)\n%\n$\n(4,145)\n(139.6)\n%\nCommentary - Three Months Ended September 30, 2025 vs. 2024 \nRevenues\n•\nTotal revenues increased $7.4 billion, or 7.8%, in the three months ended September 30, 2025 compared to the prior year driven by revenue growth across all operating segments.\n•\nPlease see “Segment Analysis” later in this report for additional information about the revenues of the Company’s segments.\nOperating expenses\n•\nOperating expenses increased $731 million, or 6.9%, in the three months ended September 30, 2025 compared to the prior year. The increase in operating expenses was primarily due to a $320 million opioid litigation charge related to a change in the Company’s accrual for ongoing opioid litigation matters recorded during the three months ended September 30, 2025, as well as increased investments in colleagues and capabilities.\n50\n•\nPlease see “Segment Analysis” later in this report for additional information about the operating expenses of the Company’s segments.\nOperating income (loss)\n•\nDuring the three months ended September 30, 2025, the Company incurred an operating loss of $3.2 billion compared to operating income of $832 million in the prior year. The difference was primarily driven by a $5.7 billion goodwill impairment charge related to the Health Care Delivery reporting unit, partially offset by improved operating performance in the Health Care Benefits segment and the absence of approximately $1.2 billion of restructuring charges recorded in the prior year.\n•\nPlease see “Segment Analysis” later in this report for additional information about the operating results of the Company’s segments.\nGain on deconsolidation of subsidiary\n•\nDuring the three months ended September 30, 2025, the gain on deconsolidation of subsidiary relates to Omnicare, LLC (“Omnicare”), a wholly-owned indirect subsidiary of CVS Health Corporation, and certain of its subsidiary entities (collectively, the “Omnicare Entities”). See Note 1 ‘‘Significant Accounting Policies’’ to the unaudited condensed consolidated financial statements for further information on the deconsolidation of the Omnicare Entities.\nInterest expense\n•\nInterest expense increased $32 million, or 4.3%, due to higher debt in the three months ended September 30, 2025, primarily as a result of long-term debt issued in December of 2024 and August of 2025.\nIncome tax provision\n•\nThe effective income tax rate was (14.6)% for the three months ended September 30, 2025 compared to 32.4% for the three months ended September 30, 2024. The change in the effective income tax rate was primarily due to the $5.7 billion goodwill impairment charge recorded in the three months ended September 30, 2025, which was not deductible for income tax purposes.\nCommentary - Nine Months Ended September 30, 2025 vs. 2024\nRevenues\n•\nTotal revenues increased $21.3 billion, or 7.7%, in the nine months ended September 30, 2025 compared to the prior year driven by revenue growth across all operating segments. \n•\nPlease see “Segment Analysis” later in this report for additional information about the revenues of the Company’s segments.\nOperating expenses\n•\nOperating expenses increased $2.3 billion, or 7.5%, in the nine months ended September 30, 2025 compared to the prior year. The increase in operating expenses was primarily due to $1.2 billion in legacy litigation charges related to two court decisions associated with the Company’s past business practices, the $320 million opioid litigation charge described above, as well as $288 million of pre-tax losses on Accountable Care assets, all recorded during the nine months ended September 30, 2025.\n•\nPlease see “Segment Analysis” later in this report for additional information about the operating expenses of the Company’s segments.\nOperating income\n•\nOperating income decreased $3.6 billion, or 58.6%, in the nine months ended September 30, 2025 compared to the prior year primarily due to the $5.7 billion goodwill impairment charge related to the Health Care Delivery reporting unit, the $1.2 billion of legacy litigation charges, the $320 million opioid litigation charge, as well as the pre-tax losses on Accountable Care assets, all recorded during the nine months ended September 30, 2025. These decreases were partially offset by improved operating performance in the Health Care Benefits segment and the absence of approximately $1.2 billion of restructuring charges recorded in the prior year.\n•\nPlease see “Segment Analysis” later in this report for additional information about the operating results of the Company’s segments.\nGain on deconsolidation of subsidiary\n•\nDuring the nine months ended September 30, 2025, the gain on deconsolidation of subsidiary relates to Omnicare and certain of its subsidiary entities.\n51\nInterest expense\n•\nInterest expense increased $132 million, or 6.0%, due to higher debt in the nine months ended September 30, 2025, primarily as a result of long-term debt issued in August of 2025 and May and December of 2024.\nIncome tax provision\n•\nThe effective income tax rate was 252.8% for the nine months ended September 30, 2025 compared to 26.3% for the nine months ended September 30, 2024. The increase in the effective income tax rate was primarily due to the impact of the goodwill impairment charge and the legacy litigation charges recorded in the nine months ended September 30, 2025 described above, both of which were not deductible for income tax purposes.\n52\nOutlook\nThe Company believes you should consider the following key business and regulatory trends and uncertainties:\nKey Business Trends and Uncertainties\n•\nThe Company’s medical membership declined in its Medicare and individual exchange products. The Company plans to exit the states in which Aetna operates on the individual public health insurance exchanges effective January 2026. Medical membership disruptions may result in volatility in the Company’s financial results.\n•\nUtilization persisted at elevated levels through the third quarter of 2025. Although the level of utilization is difficult to accurately predict, at this time, the Company expects that utilization will pressure its Health Care Benefits segment and its health care delivery assets in its Health Services segment for the remainder of the year. Further utilization pressure beyond current expectations could result in the future impairment of goodwill.\n•\nIncreases in utilization beyond the Company’s projections may result in the Company having to record additional premium deficiency reserves within the Health Care Benefits segment.\n•\nThe Company’s Medicaid business is experiencing medical cost pressures, largely driven by higher than expected acuity following the resumption of member redeterminations. While the Company continues to work closely with its state partners to ensure the underlying trends are reflected in its premium rates going forward, it is uncertain when these pressures will be fully offset by state rate updates.\n•\nThe Company’s individual exchange business is subject to a risk adjustment program whereby the Company estimates its ultimate risk adjustment receivable or payable based on the risk of its qualified plan members relative to the average risk of members of other qualified plans in comparable markets. Changes in the Company’s risk relative to the markets’ risk, including changes resulting from volatility in membership, could adversely impact the Company’s estimate of its risk adjustment receivable or payable.\n•\nThe Company continues to share with clients a larger portion of rebates, fees and/or discounts received from pharmaceutical manufacturers, and typically offers clients minimum pricing guarantees that cannot always be achieved. In addition, marketplace dynamics and regulatory changes have limited the Company’s ability to offer plan sponsors pricing that includes retail network “differential” or “spread.” The Company expects these trends to continue.\n•\nThe Company’s Pharmacy & Consumer Wellness segment is likely to benefit from incremental volume due to disruption across the retail pharmacy market, including the Company’s acquisition of the prescription files of certain Rite Aid pharmacies and certain Rite Aid stores.\n•\nRegulatory changes or consumer sentiment shift for immunizations may negatively impact national demand impacting financial results.\n•\nImplementation of new tariffs or changes in tariffs, including the impact of tariffs on trade relations between the U.S. and foreign countries, create exposure for increased costs and supply chain disruptions that can adversely impact consumer demand, the ability to deliver client savings or the Company’s financial results.\n•\nConsumer spend management and a decline in consumer discretionary spending, as well as a shift to value, grocery and digital retailers, could drive lower front store sales.\n•\nFuture financial performance will be influenced by a number of factors including competitive demand for products and services, legislative and regulatory considerations, and labor and other market dynamics, including inflation. The Company evaluates and adjusts its approach in each of the markets it serves, considering all relevant factors.\n•\nThe Company expects benefits from ongoing enterprise-wide cost savings initiatives and investments in efficiencies, which aim to reduce the Company’s operating cost structure in a way that improves the consumer experience and is sustainable. During the third quarter of 2024, the Company finalized an enterprise-wide restructuring plan intended to streamline and simplify the organization, improve efficiency and generate expected cost savings of over $500 million in 2025.\n•\nChanges in conditions in the U.S. and global capital markets can significantly and adversely affect interest rates and capital market conditions which could result in increased financing costs.\n•\nActions taken by ratings agencies, including changes in the Company’s debt ratings, could impact the Company’s future borrowing costs, access to capital markets and new store operating lease costs.\n53\nKey Regulatory Trends and Uncertainties\n•\nThe Company is exposed to funding and regulation of, and changes in government policy with respect to and/or funding or regulation of, the various Medicare programs in which the Company participates, including changes in the amounts payable to us under those programs and/or new reforms or surcharges on existing programs, including changes to applicable risk adjustment mechanisms.\n•\nLegislation and/or regulations seeking to regulate PBM activities in a comprehensive manner have been proposed or enacted in a majority of states and on the federal level. This legislative and regulatory activity could adversely affect the Company’s ability to conduct business on commercially reasonable terms and the Company’s ability to standardize its PBM products and services across state lines.\nFor additional information regarding these and other trends and uncertainties, see Item 1A, “Risk Factors” and Part I, Item 1 “Business - Government Regulation” included in the 2024 Form 10-K.\n54\nSegment Analysis\nThe following discussion of segment operating results is presented based on the Company’s reportable segments in accordance with the accounting guidance for segment reporting and is consistent with the segment disclosure in Note 12 ‘‘Segment Reporting’’ to the unaudited condensed consolidated financial statements.\nThe Company has four reportable segments: Health Care Benefits, Health Services, Pharmacy & Consumer Wellness and Corporate/Other. The Company’s segments maintain separate financial information, and the Chief Operating Decision Maker (the “CODM”) evaluates the segments’ operating results on a regular basis in deciding how to allocate resources among the segments and in assessing segment performance. The Company’s CODM is the Chief Executive Officer. The CODM evaluates the performance of the Company’s segments based on adjusted operating income (loss). Adjusted operating income is defined as operating income (loss) as measured by accounting principles generally accepted in the United States of America (“GAAP”) excluding the impact of amortization of intangible assets, net realized capital gains or losses and other items, if any, that neither relate to the ordinary course of the Company’s business nor reflect the Company’s underlying business performance. See the reconciliations of operating income (loss) (GAAP measure) to adjusted operating income (loss) below for further context regarding the items excluded from operating income (loss) in determining adjusted operating income. The CODM uses adjusted operating income as its principal measure of segment performance as it enhances the CODM’s ability to compare past financial performance with current performance and analyze underlying business performance and trends. Non-GAAP financial measures the Company discloses, such as consolidated adjusted operating income, should not be considered a substitute for, or superior to, financial measures determined or calculated in accordance with GAAP.\nThe following are reconciliations of financial measures of the Company’s segments to the consolidated totals:\nIn millions\nHealth Care\nBenefits\nHealth\nServices \n(1)\nPharmacy &\nConsumer\nWellness\nCorporate/\nOther\nIntersegment\nEliminations \n(2)\nConsolidated\nTotals\nThree Months Ended\nSeptember 30, 2025\nTotal revenues\n$\n35,993 \n$\n49,266 \n$\n36,214 \n$\n133 \n$\n(18,735)\n$\n102,871 \nAdjusted operating income (loss)\n314 \n2,050 \n1,478 \n(383)\n— \n3,459 \nSeptember 30, 2024\nTotal revenues\n$\n32,996 \n$\n44,129 \n$\n32,423 \n$\n142 \n$\n(14,262)\n$\n95,428 \nAdjusted operating income (loss)\n(924)\n2,204 \n1,596 \n(329)\n— \n2,547 \nNine Months Ended\nSeptember 30, 2025\nTotal revenues\n$\n107,061 \n$\n139,181 \n$\n101,707 \n$\n362 \n$\n(51,937)\n$\n296,374 \nAdjusted operating income (loss)\n3,615 \n5,228 \n4,129 \n(1,126)\n— \n11,846 \nSeptember 30, 2024\nTotal revenues\n$\n97,707 \n$\n126,585 \n$\n90,986 \n$\n368 \n$\n(40,547)\n$\n275,099 \nAdjusted operating income (loss)\n746 \n5,482 \n4,016 \n(996)\n— \n9,248 \n_____________________________________________\n(1)\nTotal revenues of the Health Services segment include approximately $2.4 billion and $2.7 billion of retail co-payments for the three months ended September 30, 2025 and 2024, respectively, and $8.8 billion and $8.9 billion of retail co-payments for the nine months ended September 30, 2025 and 2024, respectively.\n(2)\nIntersegment revenue eliminations relate to intersegment revenue generating activities that occur between the Health Care Benefits segment, the Health Services segment, and/or the Pharmacy & Consumer Wellness segment.\n55\nThe following are reconciliations of consolidated operating income (loss) (GAAP measure) to consolidated adjusted operating income, as well as reconciliations of segment GAAP operating income (loss) to segment adjusted operating income (loss):\nThree Months Ended September 30, 2025\nIn millions\nHealth Care\nBenefits\nHealth\nServices\nPharmacy &\nConsumer\nWellness\nCorporate/\nOther\nConsolidated\nTotals\nOperating income (loss) (GAAP measure)\n$\n53 \n$\n(3,899)\n$\n1,414 \n$\n(775)\n$\n(3,207)\nAmortization of intangible assets \n(1)\n294 \n141 \n64 \n1 \n500 \nNet realized capital (gains) losses \n(2)\n(33)\n— \n— \n44 \n11 \nAcquisition-related integration costs \n(3)\n— \n— \n— \n27 \n27 \nGoodwill impairment \n(4)\n— \n5,725 \n— \n— \n5,725 \nHealth Care Delivery clinic closure charge \n(5)\n— \n83 \n— \n— \n83 \nOpioid litigation charge \n(6)\n— \n— \n— \n320 \n320 \nAdjusted operating income (loss)\n$\n314 \n$\n2,050 \n$\n1,478 \n$\n(383)\n$\n3,459 \nThree Months Ended September 30, 2024\nIn millions\nHealth Care\nBenefits\nHealth\nServices\nPharmacy &\nConsumer\nWellness\nCorporate/\nOther\nConsolidated\nTotals\nOperating income (loss) (GAAP measure)\n$\n(1,229)\n$\n2,055 \n$\n784 \n$\n(778)\n$\n832 \nAmortization of intangible assets \n(1)\n294 \n149 \n64 \n— \n507 \nNet realized capital (gains) losses \n(2)\n1 \n— \n— \n(20)\n(19)\nAcquisition-related integration costs \n(3)\n— \n— \n— \n41 \n41 \nOffice real estate optimization charges \n(7)\n10 \n— \n1 \n6 \n17 \nRestructuring charges \n(8)\n— \n— \n747 \n422 \n1,169 \nAdjusted operating income (loss)\n$\n(924)\n$\n2,204 \n$\n1,596 \n$\n(329)\n$\n2,547 \nNine Months Ended September 30, 2025\nIn millions\nHealth Care\nBenefits\nHealth\nServices\nPharmacy &\nConsumer\nWellness\nCorporate/\nOther\nConsolidated\nTotals\nOperating income (loss) (GAAP measure)\n$\n2,729 \n$\n(1,570)\n$\n3,014 \n$\n(1,625)\n$\n2,548 \nAmortization of intangible assets \n(1)\n881 \n426 \n184 \n2 \n1,493 \nNet realized capital (gains) losses \n(2)\n1 \n(15)\n— \n73 \n59 \nAcquisition-related integration costs \n(3)\n— \n— \n— \n100 \n100 \nGoodwill impairment \n(4)\n— \n5,725 \n— \n— \n5,725 \nHealth Care Delivery clinic closure charge \n(5)\n— \n83 \n— \n— \n83 \nOpioid litigation charge \n(6)\n— \n— \n— \n320 \n320 \nOffice real estate optimization charges \n(7)\n4 \n— \n2 \n4 \n10 \nLegacy litigation charges \n(8)\n— \n291 \n929 \n— \n1,220 \nLoss on Accountable Care assets \n(9)\n— \n288 \n— \n— \n288 \nAdjusted operating income (loss)\n$\n3,615 \n$\n5,228 \n$\n4,129 \n$\n(1,126)\n$\n11,846 \n56\nNine Months Ended September 30, 2024\nIn millions\nHealth Care\nBenefits\nHealth\nServices\nPharmacy &\nConsumer\nWellness\nCorporate/\nOther\nConsolidated\nTotals\nOperating income (loss) (GAAP measure)\n$\n(227)\n$\n5,034 \n$\n3,076 \n$\n(1,735)\n$\n6,148 \nAmortization of intangible assets \n(1)\n881 \n448 \n192 \n1 \n1,522 \nNet realized capital losses \n(2)\n82 \n— \n— \n7 \n89 \nAcquisition-related integration costs \n(3)\n— \n— \n— \n203 \n203 \nOpioid litigation charge \n(6)\n— \n— \n— \n100 \n100 \nOffice real estate optimization charges \n(7)\n10 \n— \n1 \n6 \n17 \nRestructuring charges \n(10)\n— \n— \n747 \n422 \n1,169 \nAdjusted operating income (loss)\n$\n746 \n$\n5,482 \n$\n4,016 \n$\n(996)\n$\n9,248 \n_____________________________________________\n(1)\nThe Company’s acquisition activities have resulted in the recognition of intangible assets as required under the acquisition method of accounting which consist primarily of trademarks, customer contracts/relationships, covenants not to compete, technology, provider networks and value of business acquired. Definite-lived intangible assets are amortized over their estimated useful lives and are tested for impairment when events indicate that the carrying value may not be recoverable. The amortization of intangible assets is reflected in operating expenses within each segment. Although intangible assets contribute to the Company’s revenue generation, the amortization of intangible assets does not directly relate to the underwriting of the Company’s insurance products, the services performed for the Company’s customers or the sale of the Company’s products or services. Additionally, intangible asset amortization expense typically fluctuates based on the size and timing of the Company’s acquisition activity. Accordingly, the Company believes excluding the amortization of intangible assets enhances the Company’s and investors’ ability to compare the Company’s past financial performance with its current performance and to analyze underlying business performance and trends. Intangible asset amortization excluded from the related non-GAAP financial measure represents the entire amount recorded within the Company’s GAAP financial statements, and the revenue generated by the associated intangible assets has not been excluded from the related non-GAAP financial measure. Intangible asset amortization is excluded from the related non-GAAP financial measure because the amortization, unlike the related revenue, is not affected by operations of any particular period unless an intangible asset becomes impaired or the estimated useful life of an intangible asset is revised.\n(2)\nThe Company’s net realized capital gains and losses arise from various types of transactions, primarily in the course of managing a portfolio of assets that support the payment of insurance liabilities. Net realized capital gains and losses are reflected in net investment income (loss) within each segment. These capital gains and losses are the result of investment decisions, market conditions and other economic developments that are unrelated to the performance of the Company’s business, and the amount and timing of these capital gains and losses do not directly relate to the underwriting of the Company’s insurance products, the services performed for the Company’s customers or the sale of the Company’s products or services. Accordingly, the Company believes excluding net realized capital gains and losses enhances the Company’s and investors’ ability to compare the Company’s past financial performance with its current performance and to analyze underlying business performance and trends.\n(3)\nDuring the three and nine months ended September 30, 2025 and 2024, the acquisition-related integration costs relate to the acquisitions of Signify Health and Oak Street Health. The acquisition-related integration costs are reflected in operating expenses within the Corporate/Other segment.\n(4)\nDuring the three and nine months ended September 30, 2025, the goodwill impairment charge relates to the Health Care Delivery reporting unit within the Health Services segment.\n(5)\nDuring the three and nine months ended September 30, 2025, the Health Care Delivery clinic closure charge primarily relates to the write down of long-lived assets in connection with the planned closure of certain existing Oak Street Health clinics in 2026, as well as associated severance and employee-related costs expected to be incurred. The Health Care Delivery clinic closure charge is reflected in operating expenses within the Health Services segment.\n(6)\nDuring the three and nine months ended September 30, 2025 and the nine months ended September 30, 2024, the opioid litigation charges relate to changes in the Company’s accrual related to ongoing opioid litigation matters.\n(7)\nDuring the nine months ended September 30, 2025 and the three and nine months ended September 30, 2024, the office real estate optimization charges primarily relate to the abandonment of leased real estate and the related right-of-use assets and property and equipment in connection with the Company’s evaluation of corporate office real estate space in response to its ongoing flexible work arrangement. The office real estate optimization charges are reflected in operating expenses within each segment.\n(8)\nDuring the nine months ended September 30, 2025, the Company recorded legacy litigation charges related to two court decisions associated with its past business practices. \nIn April 2025, a jury found Omnicare and CVS Health Corporation liable in connection with alleged violations of the federal False Claims Act related to dispensing practices by Omnicare from 2010, prior to its acquisition by the Company in 2015, through 2018. Damages were found only with respect to Omnicare. Accordingly, the Company recorded a litigation charge of $387 million during the first quarter of 2025. During the second quarter of 2025, the Company recorded a charge of $542 million, reflecting penalties assessed under the False Claims Act. These litigation charges are reflected in operating expenses within the Pharmacy & Consumer Wellness segment.\nIn June 2025, a court found certain subsidiaries of CVS Health Corporation liable for damages in connection with a complaint filed in February 2014, in which the government declined to intervene, related to PBM direct and indirect remuneration reporting practices for two clients from 2010 through 2016, which the Company has since modified. In connection with this court decision, the Company recorded a litigation charge of $291 million during the second quarter of 2025. This litigation charge is reflected in operating expenses within the Health Services segment.\n(9)\nDuring the nine months ended September 30, 2025, the loss on the wind down and sale of Accountable Care assets represents the pre-tax loss on the divestiture of the Company’s Medicare Shared Savings Program (“MSSP”) operations, which the Company sold in March 2025, as well as costs incurred in connection with the process of winding down the Company’s Accountable Care Organization Realizing Equity, Access and Community Health (“ACO REACH”) operations. The loss on Accountable Care assets is reflected in operating expenses within the Health Services segment.\n(10)\nDuring the three and nine months ended September 30, 2024, the restructuring charges are primarily comprised of a store impairment charge, corporate workforce optimization costs, including severance and employee-related costs, and other asset impairment and related charges associated with the discontinuation of certain non-core assets. During the third quarter of 2024, the Company finalized an enterprise-wide restructuring plan intended to streamline and simplify the organization, improve efficiency and reduce costs. In connection with this restructuring plan, the Company completed a strategic review of its retail business and determined that it planned to close additional retail stores in 2025, and, accordingly, it recorded a store \n57\nimpairment charge to write down the associated lease right-of-use assets and property and equipment. In addition, during the third quarter of 2024, the Company also conducted a review of its various strategic assets and determined that it would discontinue the use of certain non-core assets, at which time impairment losses were recorded to write down the carrying value of these assets to the Company’s best estimate of their fair value. The restructuring charges associated with the store impairments are reflected within the Pharmacy & Consumer Wellness segment, other asset impairments and related charges are reflected within the Corporate/Other and Pharmacy & Consumer Wellness segments and corporate workforce optimization costs are reflected within the Corporate/Other segment.\n58\nHealth Care Benefits Segment\nThe following table summarizes the Health Care Benefits segment’s performance for the respective periods:\nChange\nThree Months Ended \nSeptember 30,\nNine Months Ended\nSeptember 30,\nThree Months Ended\nSeptember 30,\n2025 vs 2024\nNine Months Ended\nSeptember 30,\n2025 vs 2024\nIn millions, except percentages and basis points (“bps”)\n2025\n2024\n2025\n2024\n$\n%\n$\n%\nRevenues:\nPremiums\n$\n33,739\n$\n30,914\n$\n100,731\n$\n91,947\n$\n2,825 \n9.1 \n%\n$\n8,784 \n9.6 \n%\nServices\n1,741\n1,659\n5,023\n4,684\n82 \n4.9 \n%\n339 \n7.2 \n%\nNet investment income\n513\n423\n1,307\n1,076\n90 \n21.3 \n%\n231 \n21.5 \n%\nTotal revenues\n35,993\n32,996\n107,061\n97,707\n2,997 \n9.1 \n%\n9,354 \n9.6 \n%\nHealth care costs\n31,319\n29,443\n90,696\n84,359\n1,876 \n6.4 \n%\n6,337 \n7.5 \n%\nMBR (Health care costs as a % of premium revenues)\n92.8 \n%\n95.2 \n%\n90.0 \n%\n91.7 \n%\n(240)\nbps\n(170)\nbps\nOperating expenses\n$\n4,621\n$\n4,782\n$\n13,636\n$\n13,575\n$\n(161)\n(3.4)\n%\n$\n61 \n0.4 \n%\nOperating expenses as a % of total revenues\n12.8 \n%\n14.5 \n%\n12.7 \n%\n13.9 \n%\nOperating income (loss)\n$\n53\n$\n(1,229)\n$\n2,729\n$\n(227)\n$\n1,282 \n104.3 \n%\n$\n2,956 \n1,302.2 \n%\nOperating income (loss) as a % of total revenues\n0.1 \n%\n(3.7)\n%\n2.5 \n%\n(0.2)\n%\nAdjusted operating income (loss) \n(1)\n$\n314\n$\n(924)\n$\n3,615\n$\n746\n$\n1,238 \n134.0 \n%\n$\n2,869 \n384.6 \n%\nAdjusted operating income (loss) as a % of total revenues\n0.9 \n%\n(2.8)\n%\n3.4 \n%\n0.8 \n%\nPremium revenues (by business):\nGovernment\n$\n25,968\n$\n22,331\n$\n76,800\n$\n66,269\n$\n3,637 \n16.3 \n%\n$\n10,531 \n15.9 \n%\nCommercial\n7,771\n8,583\n23,931\n25,678\n(812)\n(9.5)\n%\n(1,747)\n(6.8)\n%\n_____________________________________________\n(1)\nSee “Segment Analysis” above in this report for a reconciliation of Health Care Benefits segment operating income (GAAP measure) to adjusted operating income, which represents the Company’s principal measure of segment performance.\nCommentary - Three Months Ended September 30, 2025 vs. 2024\nRevenues\n \n•\nTotal revenues increased $3.0 billion, or 9.1%, in the three months ended September 30, 2025 compared to the prior year primarily driven by increases in the Government business, largely due to the impact of the Inflation Reduction Act (“IRA”) on the Medicare Part D program.\nMedical Benefit Ratio (“MBR”)\n•\nMedical benefit ratio is calculated by dividing the Health Care Benefits segment’s health care costs by premium revenues and represents the percentage of premium revenues spent on medical benefits for the segment’s Insured members. Management uses MBR to assess the underlying business performance and underwriting of its insurance products, understand variances between actual results and expected results and identify trends in period-over-period results. MBR provides management and investors with information useful in assessing the operating results of the Health Care Benefits segment’s Insured products. \n•\nThe MBR decreased to 92.8% in the three months ended September 30, 2025 compared to 95.2% in the prior year driven by the favorable year-over-year impact of premium deficiency reserves recorded as health care costs, higher favorable prior period development and improved underlying performance in the Government business. These decreases were partially offset by changes in the seasonality of the Medicare Part D program due to the impact of the IRA and the impact of higher acuity in the individual exchange product line.\n59\nPremium Deficiency Reserves\n•\nDuring the three months ended September 30, 2025, the favorable impact of premium deficiency reserves included the absence of approximately $1.1 billion of premium deficiency reserves recorded during the third quarter of 2024, as well as the utilization of $174 million of premium deficiency reserves recorded during the first half of 2025.\nOperating expenses\n•\nOperating expenses in the Health Care Benefits segment include selling, general and administrative expenses and depreciation and amortization expenses.\n•\nOperating expenses decreased $161 million in the three months ended September 30, 2025 compared to the prior year primarily driven by the absence of the accelerated recognition of unamortized costs in connection with the premium deficiency reserves recorded in the third quarter of 2024.\nAdjusted operating income (loss)\n•\nDuring the three months ended September 30, 2025, the Health Care Benefits segment had adjusted operating income of $314 million compared to an adjusted operating loss of $924 million in the prior year. The change was primarily driven by the favorable year-over-year impact of premium deficiency reserves, higher favorable prior period development and improved underlying performance in the Government business. These increases were partially offset by changes in the seasonality of the Medicare Part D program due to the impact of the IRA and the impact of higher acuity in the individual exchange product line.\nCommentary - Nine Months Ended September 30, 2025 vs. 2024\nRevenues\n \n•\nTotal revenues increased $9.4 billion, or 9.6%, in the nine months ended September 30, 2025 compared to the prior year primarily driven by increases in the Government business, largely due to the impact of the Inflation Reduction Act on the Medicare Part D program.\nMedical Benefit Ratio \n•\nThe MBR decreased to 90.0% in the nine months ended September 30, 2025 compared to 91.7% in the prior year driven by improved underlying performance in the Government business and higher favorable prior period development.\nOperating expenses\n•\nOperating expenses remained relatively consistent in the nine months ended September 30, 2025 compared to the prior year.\nAdjusted operating income\n•\nAdjusted operating income increased $2.9 billion, or 384.6%, in the nine months ended September 30, 2025 compared to the prior year primarily driven by improved underlying performance in the Government business, higher favorable prior period development, as well as lower premium deficiency reserves recorded in the nine months ended September 30, 2025 compared to the prior year.\nThe following table summarizes the Health Care Benefits segment’s medical membership for the respective periods:\nSeptember 30, 2025\nJune 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\nIn thousands\nInsured\nASC\nTotal\nInsured\nASC\nTotal\nInsured\nASC\nTotal\nInsured\nASC\nTotal\nMedical membership:\nCommercial\n3,536 \n15,314 \n18,850 \n3,608 \n15,251 \n18,859 \n4,691 \n14,160 \n18,851 \n4,751 \n14,155 \n18,906 \nMedicare Advantage\n4,266 \n— \n4,266 \n4,240 \n— \n4,240 \n4,447 \n— \n4,447 \n4,438 \n— \n4,438 \nMedicare Supplement\n1,221 \n— \n1,221 \n1,236 \n— \n1,236 \n1,282 \n— \n1,282 \n1,291 \n— \n1,291 \nMedicaid\n1,978 \n388 \n2,366 \n1,985 \n401 \n2,386 \n2,094 \n421 \n2,515 \n2,077 \n436 \n2,513 \nTotal medical membership\n11,001 \n15,702 \n26,703 \n11,069 \n15,652 \n26,721 \n12,514 \n14,581 \n27,095 \n12,557 \n14,591 \n27,148 \nSupplemental membership information: \nMedicare Prescription Drug Plan (stand-alone)\n4,056 \n4,065 \n4,882 \n4,898 \nMedical Membership\n•\nMedical membership represents the number of members covered by the Health Care Benefits segment’s Insured and ASC medical products and related services at a specified point in time. Management uses this metric to understand variances \n60\nbetween actual medical membership and expected amounts as well as trends in period-over-period results. This metric provides management and investors with information useful in understanding the impact of medical membership on the Health Care Benefits segment’s total revenues and operating results. \n•\nMedical membership as of September 30, 2025 of 26.7 million remained consistent compared with June 30, 2025.\n•\nMedical membership as of September 30, 2025 of 26.7 million decreased 445,000 members compared with September 30, 2024, reflecting declines in the individual exchange product line, partially offset by an increase in Commercial ASC membership.\nMedicare Update\nOn April 7, 2025, CMS issued its final notice detailing final 2026 Medicare Advantage payment rates. Final 2026 Medicare Advantage rates resulted in an expected average increase in revenue for the Medicare Advantage industry of 5.06%, excluding the CMS estimate of Medicare Advantage risk score trend.\nThe Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010 (collectively, the “ACA”) ties a portion of each Medicare Advantage plan’s reimbursement to the plan’s “star ratings.” Plans must have a star rating of four or higher (out of five) to qualify for bonus payments. CMS released the Company’s 2026 star ratings in October 2025. The Company’s 2026 star ratings will be used to determine which of the Company’s Medicare Advantage plans have ratings of four stars or higher and qualify for bonus payments in 2027. Based on the Company’s membership as of September 2025, more than 81% of the Company’s Medicare Advantage members were in plans with 2026 star ratings of at least 4.0 stars, compared to 88% of the Company’s Medicare Advantage members being in plans with 2025 star ratings of at least 4.0 stars based on the Company’s membership as of September 2024.\n61\nHealth Services Segment\nThe following table summarizes the Health Services segment’s performance for the respective periods:\nChange\nThree Months Ended \nSeptember 30,\nNine Months Ended\nSeptember 30,\nThree Months Ended\nSeptember 30,\n2025 vs 2024\nNine Months Ended\nSeptember 30,\n2025 vs 2024\nIn millions, except percentages\n2025\n2024\n2025\n2024\n$\n%\n$\n%\nRevenues:\nProducts\n$\n46,767\n$\n41,208\n$\n132,125\n$\n118,417\n$\n5,559 \n13.5 \n%\n$\n13,708 \n11.6 \n%\nServices\n2,500\n2,922\n7,046\n8,171\n(422)\n(14.4)\n%\n(1,125)\n(13.8)\n%\nNet investment income (loss)\n(1)\n(1)\n10\n(3)\n— \n— \n%\n13 \n433.3 \n%\nTotal revenues\n49,266\n44,129\n139,181\n126,585\n5,137 \n11.6 \n%\n12,596 \n10.0 \n%\nCost of products sold\n45,230\n40,381\n128,425\n116,678\n4,849 \n12.0 \n%\n11,747 \n10.1 \n%\nHealth care costs\n1,291\n936\n3,439\n2,428\n355 \n37.9 \n%\n1,011 \n41.6 \n%\nOperating expenses\n919\n757\n3,162\n2,445\n162 \n21.4 \n%\n717 \n29.3 \n%\nOperating expenses as a % of total revenues\n1.9 \n%\n1.7 \n%\n2.3 \n%\n1.9 \n%\nGoodwill impairment\n$\n5,725\n$\n—\n$\n5,725\n$\n—\n$\n5,725 \n100.0 \n%\n$\n5,725 \n100.0 \n%\nOperating income (loss)\n(3,899)\n2,055\n(1,570)\n5,034\n(5,954)\n(289.7)\n%\n(6,604)\n(131.2)\n%\nOperating income (loss) as a % of total revenues\n(7.9)\n%\n4.7 \n%\n(1.1)\n%\n4.0 \n%\nAdjusted operating income \n(1)\n$\n2,050\n$\n2,204\n$\n5,228\n$\n5,482\n$\n(154)\n(7.0)\n%\n$\n(254)\n(4.6)\n%\nAdjusted operating income as a % of total revenues\n4.2 \n%\n5.0 \n%\n3.8 \n%\n4.3 \n%\nRevenues (by distribution channel): \nPharmacy network \n(2)\n$\n26,408\n$\n24,136\n$\n74,187\n$\n66,448\n$\n2,272 \n9.4 \n%\n$\n7,739 \n11.6 \n%\nMail & specialty\n (3)\n20,392\n17,214\n58,071\n52,127\n3,178 \n18.5 \n%\n5,944 \n11.4 \n%\nOther \n2,467\n2,780\n6,913\n8,013\n(313)\n(11.3)\n%\n(1,100)\n(13.7)\n%\nNet investment income (loss)\n(1)\n(1)\n10\n(3)\n— \n— \n%\n13 \n433.3 \n%\nPharmacy claims processed \n(4)\n475.6\n484.1\n1,408.8\n1,418.2\n(8.5)\n(1.8)\n%\n(9.4)\n(0.7)\n%\n_____________________________________________\n(1)\nSee “Segment Analysis” above in this report for a reconciliation of Health Services segment operating income (loss) (GAAP measure) to adjusted operating income, which represents the Company’s principal measure of segment performance.\n(2)\nPharmacy network revenues relate to claims filled at retail and specialty retail pharmacies, including pharmacies owned by the Company, as well as activity associated with Maintenance Choice, which permits eligible client plan members to fill their maintenance prescriptions through mail order delivery or at a CVS pharmacy retail store for the same price as mail order.\n(3)\nMail & specialty revenues relate to specialty mail claims inclusive of Specialty Connect\n®\n claims picked up at a retail pharmacy, as well as mail order and specialty claims fulfilled by the Pharmacy & Consumer Wellness segment.\n(4)\nIncludes an adjustment to convert 90-day prescriptions to the equivalent of three 30-day prescriptions. This adjustment reflects the fact that these prescriptions include approximately three times the amount of product days supplied compared to a normal prescription.\nCommentary - Three Months Ended September 30, 2025 vs. 2024 \nRevenues\n•\nTotal revenues increased $5.1 billion, or 11.6%, in the three months ended September 30, 2025 compared to the prior year primarily driven by pharmacy drug mix and brand inflation, partially offset by continued pharmacy client price improvements.\nOperating expenses\n•\nOperating expenses in the Health Services segment include selling, general and administrative expenses; and depreciation and amortization expense.\n•\nOperating expenses increased $162 million, or 21.4%, in the three months ended September 30, 2025 compared to the prior year. The increase was primarily driven by an $83 million Health Care Delivery clinic closure charge recorded in the three months ended September 30, 2025, primarily related to the write down of long-lived assets in connection with the planned \n62\nclosure of certain existing Oak Street Health clinics in 2026, as well as associated severance and employee-related costs expected to be incurred.\nGoodwill impairment\n•\nDuring the three months ended September 30, 2025, the Company recorded a $5.7 billion goodwill impairment charge related to the Health Care Delivery reporting unit within the Health Services segment. See Note 4 ‘‘Goodwill & Other Intangibles’’ to the unaudited condensed consolidated financial statements for further information.\nAdjusted operating income\n•\nAdjusted operating income decreased $154 million, or 7.0%, in the three months ended September 30, 2025 compared to the prior year primarily driven by continued pharmacy client price improvements, partially offset by improved purchasing economics.\n•\nAs you review the Health Services segment’s performance in this area, you should consider the following important information about the business:\n•\nThe Company’s efforts to (i) retain existing clients, (ii) obtain new business and (iii) maintain or improve the rebates, fees and/or discounts the Company receives from manufacturers, wholesalers and retail pharmacies continue to have an impact on adjusted operating income. In particular, the Company continues to share with clients a larger portion of rebates, fees and/or discounts received from pharmaceutical manufacturers. In addition, marketplace dynamics and regulatory changes have limited the Company’s ability to offer plan sponsors pricing that includes retail network “differential” or “spread,” and the Company expects these trends to continue. The “differential” or “spread” is any difference between the drug price charged to plan sponsors, including Medicare Part D plan sponsors, by a PBM and the price paid for the drug by the PBM to the dispensing provider. \nPharmacy claims processed\n•\nPharmacy claims processed represents the number of prescription claims processed through the Company’s pharmacy benefits manager and dispensed by either its retail network pharmacies or the Company’s mail and specialty pharmacies. Management uses this metric to understand variances between actual claims processed and expected amounts as well as trends in period-over-period results. This metric provides management and investors with information useful in understanding the impact of pharmacy claim volume on segment total revenues and operating results.\n•\nPharmacy claims processed decreased 1.8% on a 30-day equivalent basis in the three months ended September 30, 2025 compared to the prior year.\nCommentary - Nine Months Ended September 30, 2025 vs. 2024 \nRevenues\n•\nTotal revenues increased $12.6 billion, or 10.0%, in the nine months ended September 30, 2025 compared to the prior year primarily driven by pharmacy drug mix and brand inflation, partially offset by continued pharmacy client price improvements.\nOperating expenses\n•\nOperating expenses increased $717 million, or 29.3%, in the nine months ended September 30, 2025 compared to the prior year. The increase was primarily due to a $291 million litigation charge, $288 million in pre-tax losses on Accountable Care assets and the $83 million Health Care Delivery clinic closure charge described above, all recorded during the nine months ended September 30, 2025. \nGoodwill impairment\n•\nDuring the nine months ended September 30, 2025, the Company recorded a $5.7 billion goodwill impairment charge related to the Health Care Delivery reporting unit within the Health Services segment. \nAdjusted operating income\n•\nAdjusted operating income decreased $254 million, or 4.6%, in the nine months ended September 30, 2025 compared to the prior year primarily driven by continued pharmacy client price improvements and the impact of a higher medical benefit ratio in the Company’s health care delivery business, partially offset by improved purchasing economics and pharmacy drug mix.\nPharmacy claims processed\n•\nThe Company’s pharmacy claims processed decreased 0.7% on a 30-day equivalent basis in the nine months ended September 30, 2025 compared to the prior year.\n63\nPharmacy & Consumer Wellness Segment\nThe following table summarizes the Pharmacy & Consumer Wellness segment’s performance for the respective periods:\nChange\nThree Months Ended \nSeptember 30,\nNine Months Ended\nSeptember 30,\nThree Months Ended\nSeptember 30,\n2025 vs 2024\nNine Months Ended\nSeptember 30,\n2025 vs 2024\nIn millions, except percentages\n2025\n2024\n2025\n2024\n$\n%\n$\n%\nRevenues:\nProducts\n$\n35,503\n$\n31,823\n$\n99,730\n$\n89,195\n$\n3,680 \n11.6 \n%\n$\n10,535 \n11.8 \n%\nServices\n711\n600\n1,977\n1,791\n111 \n18.5 \n%\n186 \n10.4 \n%\nTotal revenues\n36,214\n32,423\n101,707\n90,986\n3,791 \n11.7 \n%\n10,721 \n11.8 \n%\nCost of products sold\n29,647\n26,032\n83,005\n72,627\n3,615 \n13.9 \n%\n10,378 \n14.3 \n%\nOperating expenses \n5,153\n4,860\n15,688\n14,536\n293 \n6.0 \n%\n1,152 \n7.9 \n%\nOperating expenses as a % of total revenues\n14.2 \n%\n15.0 \n%\n15.4 \n%\n16.0 \n%\nRestructuring charges\n$\n—\n$\n747\n$\n—\n$\n747\n$\n(747)\n(100.0)\n%\n$\n(747)\n(100.0)\n%\nOperating income\n1,414\n784\n3,014\n3,076\n630 \n80.4 \n%\n(62)\n(2.0)\n%\nOperating income as a % of total revenues\n3.9 \n%\n2.4 \n%\n3.0 \n%\n3.4 \n%\nAdjusted operating income \n(1)\n$\n1,478\n$\n1,596\n$\n4,129\n$\n4,016\n$\n(118)\n(7.4)\n%\n$\n113 \n2.8 \n%\nAdjusted operating income as a % of total revenues\n4.1 \n%\n4.9 \n%\n4.1 \n%\n4.4 \n%\nRevenues (by major goods/service lines):\nPharmacy\n$\n30,428\n$\n26,666\n$\n84,135\n$\n73,463\n$\n3,762 \n14.1 \n%\n$\n10,672 \n14.5 \n%\nFront Store \n5,192\n5,196\n15,803\n15,847\n(4)\n(0.1)\n%\n(44)\n(0.3)\n%\nOther\n594\n561\n1,769\n1,676\n33 \n5.9 \n%\n93 \n5.5 \n%\nPrescriptions filled \n(2)\n461.4\n431.6\n1,335.0\n1,269.6\n29.8 \n6.9 \n%\n65.4 \n5.2 \n%\nSame store sales increase (decrease): \n(3)\nTotal\n14.3 \n%\n15.5 \n%\n14.6 \n%\n9.1 \n%\nPharmacy\n16.8 \n%\n19.5 \n%\n17.5 \n%\n12.1 \n%\nFront Store\n1.5 \n%\n(1.1)\n%\n1.5 \n%\n(2.5)\n%\nPrescription volume \n(2)\n8.9 \n%\n9.1 \n%\n7.3 \n%\n7.1 \n%\n_____________________________________________\n(1)\nSee “Segment Analysis” above in this report for a reconciliation of Pharmacy & Consumer Wellness segment operating income (GAAP measure) to adjusted operating income, which represents the Company’s principal measure of segment performance.\n(2)\nIncludes an adjustment to convert 90-day prescriptions to the equivalent of three 30-day prescriptions. This adjustment reflects the fact that these prescriptions include approximately three times the amount of product days supplied compared to a normal prescription.\n(3)\nSame store sales and prescription volume represent the change in revenues and prescriptions filled in the Company’s retail pharmacy stores that have been operating for greater than one year and digital sales initiated online or through mobile applications and fulfilled through the Company’s distribution centers, expressed as a percentage that indicates the increase or decrease relative to the comparable prior period. Same store metrics exclude revenues and prescriptions from infusion services operations and long-term care pharmacies. Management uses these metrics to evaluate the performance of existing stores on a comparable basis and to inform future decisions regarding existing stores and new locations. Same-store metrics provide management and investors with information useful in understanding the portion of current revenues and prescriptions resulting from organic growth in existing locations versus the portion resulting from opening new stores.\nCommentary - Three Months Ended September 30, 2025 vs. 2024 \nRevenues\n \n•\nTotal revenues increased $3.8 billion, or 11.7%, in the three months ended September 30, 2025 compared to the prior year primarily driven by pharmacy drug mix and increased prescription volume, including incremental volume resulting from the Company’s Rite Aid prescription file acquisitions, partially offset by continued pharmacy reimbursement pressure.\n•\nPharmacy same store sales increased 16.8% in the three months ended September 30, 2025 compared to the prior year. The increase was primarily driven by pharmacy drug mix, including branded GLP-1 drugs, and the 8.9% increase in pharmacy \n64\nsame store prescription volume on a 30-day equivalent basis. These increases were partially offset by continued pharmacy reimbursement pressure. \n•\nFront store same store sales increased 1.5% in the three months ended September 30, 2025 compared to the prior year.\nOperating expenses\n•\nOperating expenses in the Pharmacy & Consumer Wellness segment include payroll, employee benefits and occupancy costs associated with the segment’s stores and pharmacy fulfillment operations; selling expenses; advertising expenses; depreciation and amortization expense and certain administrative expenses. \n•\nOperating expenses increased $293 million, or 6.0%, in the three months ended September 30, 2025 primarily due to increased investments in the segment’s colleagues and capabilities compared to the prior year.\nRestructuring charges\n•\nDuring the three months ended September 30, 2024, the Company recorded $747 million of restructuring charges related to the write-down of lease right-of-use assets and property and equipment in connection with the Company’s restructuring program.\nAdjusted operating income\n•\nAdjusted operating income decreased $118 million, or 7.4%, in the three months ended September 30, 2025 compared to the prior year primarily driven by continued pharmacy reimbursement pressure and increased investments in the segment’s colleagues and capabilities, partially offset by increased prescription volume.\n•\nAs you review the Pharmacy & Consumer Wellness segment’s performance in this area, you should consider the following important information about the business:\n•\nThe segment’s adjusted operating income has been adversely affected by the efforts of managed care organizations, PBMs and governmental and other third-party payors to reduce their prescription drug costs, including the use of restrictive networks, as well as changes in the mix of business within the pharmacy portion of the Pharmacy & Consumer Wellness segment. If the pharmacy reimbursement pressure accelerates, the segment may not be able to grow revenues, and its adjusted operating income could be adversely affected.\nPrescriptions filled\n•\nPrescriptions filled represents the number of prescriptions dispensed through the Pharmacy & Consumer Wellness segment’s retail pharmacies and infusion services operations, as well as through the Omnicare long-term care pharmacies prior to their deconsolidation in September 2025. Management uses this metric to understand variances between actual prescriptions dispensed and expected amounts as well as trends in period-over-period results. This metric provides management and investors with information useful in understanding the impact of prescription volume on segment total revenues and operating results.\n•\nPrescriptions filled increased 6.9% on a 30-day equivalent basis in the three months ended September 30, 2025 compared to the prior year primarily driven by increased utilization and incremental volume resulting from the Company’s Rite Aid prescription file acquisitions.\nCommentary - Nine Months Ended September 30, 2025 vs. 2024 \nRevenues\n \n•\nTotal revenues increased $10.7 billion, or 11.8%, in the nine months ended September 30, 2025 compared to the prior year primarily driven by pharmacy drug mix and increased prescription volume, including incremental volume resulting from the Company’s Rite Aid prescription file acquisitions, partially offset by continued pharmacy reimbursement pressure.\n•\nPharmacy same store sales increased 17.5% in the nine months ended September 30, 2025 compared to the prior year. The increase was primarily driven by pharmacy drug mix, including branded GLP-1 drugs, and the 7.3% increase in pharmacy same store prescription volume on a 30-day equivalent basis. These increases were partially offset by continued pharmacy reimbursement pressure. \n•\nFront store same store sales increased 1.5% in the nine months ended September 30, 2025 compared to the prior year.\nOperating expenses\n•\nOperating expenses increased $1.2 billion, or 7.9%, in the nine months ended September 30, 2025 compared to the prior year. The increase in operating expenses was primarily due to $929 million in litigation charges recorded during the nine months ended September 30, 2025 related to the Omnicare long-term care business and increased investments in the segment’s colleagues and capabilities compared to the prior year.\n65\nRestructuring charges\n•\nDuring the nine months ended September 30, 2024, the Company recorded $747 million of restructuring charges related to the write-down of lease right-of-use assets and property and equipment in connection with the Company’s restructuring program. \nAdjusted operating income\n•\nAdjusted operating income increased $113 million, or 2.8%, in the nine months ended September 30, 2025 compared to the prior year primarily driven by increased prescription volume, partially offset by continued pharmacy reimbursement pressure and increased investments in the segment’s colleagues and capabilities.\nPrescriptions filled\n•\nPrescriptions filled increased 5.2% on a 30-day equivalent basis in the nine months ended September 30, 2025 compared to the prior year primarily driven by increased utilization and incremental volume resulting from the Company’s Rite Aid prescription file acquisitions.\n66\nCorporate/Other Segment\nThe following table summarizes the Corporate/Other segment’s performance for the respective periods:\nChange\nThree Months Ended \nSeptember 30,\nNine Months Ended\nSeptember 30,\nThree Months Ended\nSeptember 30,\n2025 vs 2024\nNine Months Ended\nSeptember 30,\n2025 vs 2024\nIn millions, except percentages\n2025\n2024\n2025\n2024\n$\n%\n$\n%\nRevenues:\nPremiums \n$\n11 \n$\n11 \n$\n34 \n$\n36 \n$\n— \n— \n%\n$\n(2)\n(5.6)\n%\nServices\n2 \n3 \n6 \n7 \n(1)\n(33.3)\n%\n(1)\n(14.3)\n%\nNet investment income\n120 \n128 \n322 \n325 \n(8)\n(6.3)\n%\n(3)\n(0.9)\n%\nTotal revenues\n133 \n142 \n362 \n368 \n(9)\n(6.3)\n%\n(6)\n(1.6)\n%\nHealth care costs\n47 \n49 \n133 \n142 \n(2)\n(4.1)\n%\n(9)\n(6.3)\n%\nOperating expenses\n861 \n449 \n1,854 \n1,539 \n412 \n91.8 \n%\n315 \n20.5 \n%\nRestructuring charges\n— \n422 \n— \n422 \n(422)\n(100.0)\n%\n(422)\n(100.0)\n%\nOperating loss\n(775)\n(778)\n(1,625)\n(1,735)\n3 \n0.4 \n%\n110 \n6.3 \n%\nAdjusted operating loss \n(1)\n(383)\n(329)\n(1,126)\n(996)\n(54)\n(16.4)\n%\n(130)\n(13.1)\n%\n_____________________________________________\n(1)\nSee “Segment Analysis” above in this report for a reconciliation of Corporate/Other segment operating loss (GAAP measure) to adjusted operating loss, which represents the Company’s principal measure of segment performance.\nCommentary - Three Months Ended September 30, 2025 vs. 2024 \nRevenues\n•\nRevenues primarily relate to products for which the Company no longer solicits or accepts new customers, such as large case pensions and long-term care insurance products.\n•\nTotal revenues remained relatively consistent in the three months ended September 30, 2025 compared to the prior year.\nAdjusted operating loss\n•\nAdjusted operating loss increased $54 million, or 16.4%, in the three months ended September 30, 2025 compared to the prior year primarily driven by increased investments in colleagues and capabilities.\nCommentary - Nine Months Ended September 30, 2025 vs. 2024 \nRevenues\n•\nTotal revenues remained relatively consistent in the nine months ended September 30, 2025 compared to the prior year.\nAdjusted operating loss \n•\nAdjusted operating loss increased $130 million, or 13.1%, in the nine months ended September 30, 2025 compared to the prior year primarily driven by increased investments in colleagues and capabilities. \n67\nLiquidity and Capital Resources\nCash Flows\nThe Company maintains a level of liquidity sufficient to allow it to meet its cash needs in the short-term. Over the long term, the Company manages its cash and capital structure to maximize shareholder return, maintain its financial condition and maintain flexibility for future strategic initiatives. The Company continuously assesses its regulatory capital requirements, working capital needs, debt and leverage levels, debt maturity schedule, capital expenditure requirements, dividend payouts, potential share repurchases and future investments or acquisitions. The Company believes its operating cash flows, commercial paper program, credit facilities, as well as any potential future borrowings, will be sufficient to fund these future payments and long-term initiatives. As of September 30, 2025, the Company had approximately $9.1 billion in cash and cash equivalents, approximately $2.3 billion of which was held by the parent company or nonrestricted subsidiaries.\nThe net change in cash, cash equivalents and restricted cash during the nine months ended September 30, 2025 and 2024 was as follows:\nNine Months Ended\nSeptember 30,\nChange\nIn millions, except percentages\n2025\n2024\n$\n%\nNet cash provided by operating activities\n$\n7,249 \n$\n7,247 \n$\n2 \n— \n%\nNet cash used in investing activities\n(3,873)\n(7,066)\n3,193 \n45.2 \n%\nNet cash used in financing activities\n(2,908)\n(1,566)\n(1,342)\n(85.7)\n%\nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n468 \n$\n(1,385)\n$\n1,853 \n133.8 \n%\nCommentary \n•\nNet cash provided by operating activities\n remained consistent at $7.2 billion in the nine months ended September 30, 2025 compared to the prior year.\n•\nNet cash used in investing activities\n decreased by $3.2 billion in the nine months ended September 30, 2025 compared to the prior year primarily due to lower net purchases of investments in the nine months ended September 30, 2025 compared to the prior year, partially offset by cash paid to acquire the prescription files of certain Rite Aid pharmacies in the nine months ended September 30, 2025.\n•\nNet cash used in financing activities \nincreased by $1.3 billion in the nine months ended September 30, 2025 compared to the prior year primarily due to higher repayments of long-term debt and commercial paper, as well as lower proceeds from the issuance of long-term senior notes in the nine months ended September 30, 2025, partially offset by higher share repurchases in the prior year.\nShort-term Borrowings\nCommercial Paper and Back-up Credit Facilities\nThe Company had $1.2 billion of commercial paper outstanding at a weighted average interest rate of 4.64% as of September 30, 2025. In connection with its commercial paper program, the Company maintains a $2.5 billion, five-year unsecured back-up revolving credit facility, which expires on May 16, 2028, a $2.5 billion, five-year unsecured back-up revolving credit facility, which expires on May 16, 2029, and a $2.5 billion, five-year unsecured back-up revolving credit facility, which expires on May 16, 2030. The credit facilities allow for borrowings at various rates that are dependent, in part, on the Company’s public debt ratings and require the Company to pay a weighted average quarterly facility fee of approximately 0.03%, regardless of usage. As of September 30, 2025, there were no borrowings outstanding under any of the Company’s back-up credit facilities.\nFederal Home Loan Bank of Boston\nA subsidiary of the Company is a member of the Federal Home Loan Bank of Boston (the “FHLBB”). As a member, the subsidiary has the ability to obtain cash advances, subject to certain minimum collateral requirements. The maximum borrowing capacity available from the FHLBB as of September 30, 2025 was approximately $1.3 billion. As of September 30, 2025, there were no outstanding advances from the FHLBB.\n68\nLong-term Borrowings\n2025 Notes\nOn August 15, 2025, the Company issued $750 million aggregate principal amount of 5.0% senior notes due September 2032, $1.5 billion aggregate principal amount of 5.45% senior notes due September 2035, $1.25 billion aggregate principal amount of 6.2% senior notes due September 2055 and $500 million aggregate principal amount of 6.25% senior notes due September 2065 for total proceeds of approximately $4.0 billion, net of discounts and underwriting fees. The net proceeds of these offerings were used to repay existing indebtedness, including borrowings under the Company’s commercial paper program, as well as for general corporate purposes.\nDebt Covenants\nThe Company’s back-up revolving credit facilities, term loan agreement and unsecured senior notes contain customary restrictive financial and operating covenants. These covenants do not include an acceleration of the Company’s debt maturities in the event of a downgrade in the Company’s credit ratings. The Company does not believe the restrictions contained in these covenants materially affect its financial or operating flexibility. As of September 30, 2025, the Company was in compliance with all of its debt covenants.\nDebt Ratings\n \nAs of September 30, 2025, the Company’s long-term debt was rated “BBB” by Fitch Ratings, Inc. (“Fitch”), “Baa3” by Moody’s Investor Service, Inc. (“Moody’s”) and “BBB” by Standard & Poor’s Financial Services LLC (“S&P”), and its commercial paper program was rated “F2” by Fitch, “P-3” by Moody’s and “A-2” by S&P. The outlook on the Company’s long-term debt is “Negative” by both Fitch and S&P and “Stable” by Moody’s. In assessing the Company’s credit strength, the Company believes that Fitch, Moody’s and S&P considered, among other things, the Company’s capital structure and financial policies, as well as its consolidated balance sheet, its historical acquisition activity and other financial information, including the Company’s expectations for full year earnings and cash flows. Although the Company currently believes its long-term debt ratings will remain investment grade, it cannot predict the future actions of Moody’s, S&P and/or Fitch. The Company’s debt ratings have a direct impact on its future borrowing costs, access to capital markets and new store operating lease costs.\nShare Repurchase Programs\nThe following share repurchase programs have been authorized by CVS Health Corporation’s Board of Directors (the “Board”):\nIn billions\nAuthorization Date\nAuthorized\nRemaining as of\nSeptember 30, 2025\nNovember 17, 2022 (“2022 Repurchase Program”)\n$\n10.0 \n$\n10.0 \nDecember 9, 2021 (“2021 Repurchase Program”)\n10.0 \n1.5 \nEach of the share Repurchase Programs was effective immediately and permit the Company to effect repurchases from time to time through a combination of open market repurchases, privately negotiated transactions, accelerated share repurchase (“ASR”) transactions, and/or other derivative transactions. Both the 2022 and 2021 Repurchase Programs can be modified or terminated by the Board at any time. \n \nDuring the nine months ended September 30, 2025, the Company did not repurchase any shares of its common stock. During the nine months ended September 30, 2024, the Company repurchased an aggregate of 39.7 million shares of common stock for approximately $3.0 billion pursuant to the 2021 Repurchase Program. This activity includes the share repurchases under the ASR transaction described below.\nPursuant to the authorization under the 2021 Repurchase Program, the Company entered into a $3.0 billion fixed dollar ASR with Morgan Stanley & Co. LLC. Upon payment of the $3.0 billion purchase price on January 4, 2024, the Company received a number of shares of CVS Health Corporation’s common stock equal to 85% of the $3.0 billion notional amount of the ASR or approximately 31.4 million shares, which were placed into treasury stock in January 2024. The ASR was accounted for as an initial treasury stock transaction for $2.6 billion and a forward contract for $0.4 billion. The forward contract was classified as an equity instrument and was recorded within capital surplus. In March 2024, the Company received approximately 8.3 million shares of CVS Health Corporation’s common stock, representing the remaining 15% of the $3.0 billion notional amount of the ASR, thereby concluding the ASR. These shares were placed into treasury and the forward contract was reclassified from capital surplus to treasury stock in March 2024.\n69\nAt the time they were received, the initial and final receipt of shares resulted in an immediate reduction of the outstanding shares used to calculate the weighted average common shares outstanding for basic and diluted earnings per share.\nCritical Accounting Policies\nThe Company prepares the unaudited condensed consolidated financial statements in conformity with generally accepted accounting principles, which require management to make certain estimates and apply judgment. Estimates and judgments are based on historical experience, current trends and other factors that management believes to be important at the time the unaudited condensed consolidated financial statements are prepared. On a regular basis, the Company reviews its accounting policies and how they are applied and disclosed in the unaudited condensed consolidated financial statements. While the Company believes the historical experience, current trends and other factors considered by management support the preparation of the unaudited condensed consolidated financial statements in conformity with generally accepted accounting principles, actual results could differ from estimates, and such differences could be material.\nRecoverability of Goodwill\nDuring the fourth quarter of 2024, the Company performed its required annual impairment test of goodwill. The results of the impairment tests indicated that there was no impairment of goodwill as of the 2024 testing date. The fair values of the reporting units with goodwill exceeded their carrying values by significant margins, with the exception of the Government reporting unit and the Health Care Delivery reporting unit which exceeded their carrying values by approximately 4% and 8%, respectively.\nDuring 2025, the Health Care Delivery reporting unit continued to experience challenges, including the impact of persistent elevated utilization levels. In order to best respond to these challenges, the Company made a number of changes to its Health Care Delivery management team during 2025. During the third quarter of 2025, this new management team finalized certain strategic changes, including the determination that it would reduce the number of new primary care clinics it would open in 2026 and annually thereafter. The Company also determined that it would close certain existing Oak Street Health clinics in 2026. The strategy changes were presented to CVS Health Corporation’s Board of Directors in September 2025. \nThese changes are expected to impact management’s ability to grow the business at the rate that was originally estimated when the Company acquired the associated care delivery assets in 2023 and when the prior year annual goodwill impairment test was performed. Accordingly, the Health Care Delivery management team updated its financial projections to reflect these changes for 2026 and beyond. Based on these updated projections, management determined that there were indicators that the Health Care Delivery reporting unit’s goodwill may be impaired and, accordingly, an interim goodwill impairment test was performed during the third quarter of 2025. \nThe results of the impairment test showed that the fair value of the Health Care Delivery reporting unit was lower than its carrying value, resulting in a $5.7 billion goodwill impairment charge. The fair value of the Health Care Delivery reporting unit was determined using a combination of a discounted cash flow method and a market multiple method. In addition to the lower financial projections, lower market multiples of the peer group companies contributed to the amount of the goodwill impairment charge. As of September 30, 2025, the remaining goodwill balance in the Health Care Delivery reporting unit after recording the goodwill impairment was approximately $4.2 billion.\nThe fair value of the Company’s reporting units is estimated using a combination of a discounted cash flow method and a market multiple method. The determination of the fair value of the reporting units requires the Company to make significant assumptions and estimates. These assumptions and estimates primarily include the selection of appropriate peer group companies; control premiums and valuation multiples appropriate for acquisitions in the industries in which the Company competes; discount rates; terminal growth rates; and forecasts of revenue, operating income, depreciation and amortization, income taxes, capital expenditures and future working capital requirements. When determining these assumptions and preparing these estimates, the Company considers each reporting unit’s historical results and current operating trends; consolidated revenues, profitability and cash flow results and forecasts; and industry trends. The Company’s estimates can be affected by a number of factors, including general economic and regulatory conditions; the risk-free interest rate environment; the Company’s market capitalization; efforts of customers and payers to reduce costs, including their prescription drug costs, and/or increase member co-payments; the continued efforts of competitors to gain market share, consumer spending patterns and the Company’s ability to achieve its revenue growth projections and execute on its cost reduction initiatives.\nAlthough the Company believes the financial projections used to determine the fair value of the Health Care Delivery reporting unit were reasonable and achievable, continued utilization pressure and further reductions to the number of existing primary \n70\ncare centers or new primary care center openings may affect the Company’s ability to increase operating results in the Health Care Delivery reporting unit at the rate estimated when such goodwill impairment test was performed. Some of the key assumptions included in the Company’s financial projections to determine the estimated fair value of its Health Care Delivery reporting unit include future revenue growth rates, including the impact of annual new primary care center openings, and operating income. The estimated fair value of the Health Care Delivery reporting unit is also dependent on multiples of market participants in the care delivery industry, as well as the risk-free interest rate environment which impacts the discount rate used in the discounted cash flow method. If the Company does not achieve its forecasts, given that the fair value and the carrying value of the Health Care Delivery reporting unit were the same as of September 30, 2025, it is reasonably possible in the near term that the goodwill of the Health Care Delivery reporting unit could be deemed to be impaired again by a material amount.\nFor a full description of the Company’s other critical accounting policies, see “Critical Accounting Policies” in Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of the 2024 Form 10-K.\nCautionary Statement Concerning Forward-Looking Statements\nThe Private Securities Litigation Reform Act of 1995 (the “Reform Act”) provides a “safe harbor” for forward-looking statements, so long as (1) those statements are identified as forward-looking and (2) the statements are accompanied by meaningful cautionary statements that identify important factors that could cause actual results to differ materially from those discussed in the statement. We want to take advantage of these safe harbor provisions.\nCertain information contained in this Quarterly Report on Form 10-Q (this “report”) is forward-looking within the meaning of the Reform Act or Securities and Exchange Commission rules. This information includes, but is not limited to the forward-looking information in Management’s Discussion and Analysis of Financial Condition and Results of Operations included in Part I, Item 2 of this report. In addition, throughout this report and our other reports and communications, we use the following words or variations or negatives of these words and similar expressions when we intend to identify forward-looking statements:\n·\nAnticipates\n·\nBelieves\n·\nCan\n·\nContinue\n·\nCould\n·\nEstimates\n·\nEvaluate\n·\nExpects\n·\nExplore\n·\nForecast\n·\nGuidance\n·\nIntends\n·\nLikely\n·\nMay\n·\nMight\n·\nOutlook\n·\nPlans\n·\nPotential\n·\nPredict\n·\nProbable\n·\nProjects\n·\nSeeks\n·\nShould\n·\nView\n·\nWill\nAll statements addressing the future operating performance of CVS Health or any segment or any subsidiary and/or future events or developments, including, but not limited to, statements relating to the Company’s investment portfolio, operating results, cash flows and/or financial condition, statements relating to corporate strategy, statements relating to future revenue, operating income or adjusted operating income, earnings per share or adjusted earnings per share, Health Care Benefits segment business, sales results and/or trends, medical cost trends, medical membership, Medicare Part D membership, medical benefit ratios and/or operations, Health Services segment business, sales results and/or trends and/or operations, Pharmacy & Consumer Wellness segment business, sales results and/or trends and/or operations, incremental investment spending, interest expense, effective tax rate, weighted-average share count, cash flow from operations, net capital expenditures, cash available for debt repayment, statements related to possible, proposed, pending or completed acquisitions, joint ventures, investments or combinations that involve, among other things, the timing or likelihood of receipt of regulatory approvals, the timing of completion, integration synergies, net synergies and integration risks and other costs, enterprise modernization, transformation, leverage ratio, cash available for enhancing shareholder value, inventory reduction, turn rate and/or loss rate, debt ratings and actions taken by ratings agencies, the Company’s ability to attract or retain customers and clients, store development and/or relocations, new product development, and the impact of industry and regulatory developments as well as statements expressing optimism or pessimism about future operating results or events, are forward-looking statements within the meaning of the Reform Act.\nForward-looking statements rely on a number of estimates, assumptions and projections concerning future events, and are subject to a number of significant risks and uncertainties and other factors that could cause actual results to differ materially from those statements. Many of these risks and uncertainties and other factors are outside our control. \nCertain additional risks and uncertainties and other factors are described under “Risk Factors” included in Part I, Item 1A of the 2024 Form 10-K and under “Risk Factors” included in Part II, Item 1A of this report; these are not the only risks and uncertainties we face. There can be no assurance that the Company has identified all the risks that may affect it. Additional risks and uncertainties not presently known to the Company or that the Company currently believes to be immaterial also may adversely affect the Company’s businesses. If any of those risks or uncertainties develops into actual events, those events or \n71\nForm 10-Q Table of Contents\ncircumstances could have a material adverse effect on the Company’s businesses, operating results, cash flows, financial condition and/or stock price, among other effects.\nYou should not put undue reliance on forward-looking statements. Any forward-looking statement speaks only as of the date of this report, and we disclaim any intention or obligation to update or revise forward-looking statements, whether as a result of new information, future events, uncertainties or otherwise.\n72\nForm 10-Q Table of Contents"
}