{
  "source_file": "dash-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our condensed consolidated financial statements and related notes thereto included elsewhere in this Quarterly Report on Form 10-Q and our audited consolidated financial statements included in our Annual Report on Form 10-K for the year ended December 31, 2024. This discussion contains forward-looking statements that are based on current plans, expectations, and beliefs that involve risks and uncertainties. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of various factors, including, but not limited to, those identified below and those discussed in the section titled “Risk Factors” and other sections of this Quarterly Report on Form 10-Q. Our historical results are not necessarily indicative of the results that may be expected for any period in the future.\nOverview\nDoorDash, Inc. is incorporated in Delaware with headquarters in San Francisco, California. Our mission is to grow and empower local economies. We aim to do this by providing services that reduce friction in local commerce and help merchants better connect with consumers in their communities.\nAs of September 30, 2025, our primary offerings included the DoorDash Marketplace and the Wolt Marketplace (together with all other marketplaces that we operate from time to time, our \"Marketplaces\"), and our Commerce Platform. On October 2, 2025, we completed our acquisition of Deliveroo plc (\"Deliveroo\") in order to strengthen our position as a leading global platform in local commerce and enable us to better serve businesses, consumers and Dashers. Following the completion of the Deliveroo acquisition, our Marketplaces now operate in over 40 countries across the globe and provide an integrated suite of services that help merchants establish an online presence, connect with consumers in their communities, and solve mission-critical challenges, such as customer acquisition, demand generation, order fulfillment, merchandising, payment processing, and customer support. We also offer advertising as a value-added service through our Marketplaces to help merchants and consumer packaged goods companies increase consumer engagement and drive incremental revenue.\nOur Marketplaces compete for consumers based primarily on the selection, convenience, quality, affordability, and service we provide. Our Marketplaces also offer our consumer membership programs, DashPass and Wolt+, which aim to lower transactional friction by reducing the delivery and service fees we charge, while providing additional membership benefits.\nIn addition to our Marketplaces, we offer our Commerce Platform, which is a suite of services that help merchants grow, run, and operate their businesses on their own channels. DoorDash Drive On-Demand and Wolt Drive (together, \"Drive\") are white-label delivery fulfillment services that generate the majority of revenue within our Commerce Platform. In addition to Drive, we also provide software and services that help merchants establish online ordering, build branded mobile apps, manage reservations and tables, better connect with consumers through customer relationship management and marketing tools, enable tableside order and pay, and manage customer support.\n30\nTable of Contents\nFinancial and Operational Highlights\nWe use the following financial and operational metrics to help us evaluate our business, identify trends affecting our business, formulate business plans, and make strategic decisions:\nThree Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\nTotal Orders\n643 \n776 \nTotal Orders Y/Y growth\n18 \n%\n21 \n%\nMarketplace GOV\n$\n20,002 \n$\n25,015 \nMarketplace GOV Y/Y growth\n19 \n%\n25 \n%\nRevenue\n$\n2,706 \n$\n3,446 \nRevenue Y/Y growth\n25 \n%\n27 \n%\nNet Revenue Margin\n13.5 \n%\n13.8 \n%\nGAAP gross profit\n$\n1,283 \n$\n1,689 \nGAAP gross profit as a % of Marketplace GOV\n6.4 \n%\n6.8 \n%\nContribution Profit\n(1)\n$\n930 \n$\n1,268 \nContribution Profit as a % of Marketplace GOV\n4.6 \n%\n5.1 \n%\nGAAP net income attributable to DoorDash, Inc. common stockholders\n$\n162 \n$\n244 \nGAAP net income attributable to DoorDash, Inc. common stockholders as a % of Marketplace GOV\n0.8 \n%\n1.0 \n%\nAdjusted EBITDA\n(1)\n$\n533 \n$\n754 \nAdjusted EBITDA as a % of Marketplace GOV\n2.7 \n%\n3.0 \n%\nWeighted-average diluted shares outstanding\n428 \n442 \n(1)\nContribution Profit and Adjusted EBITDA are non-GAAP financial measures. For more information regarding our use of these measures and reconciliations to the most directly comparable financial measures calculated in accordance with GAAP, see the section titled “Non-GAAP Financial Measures.\"\nTotal Orders.\n We define Total Orders as all orders completed through our Marketplaces and Commerce Platform over the period of measurement.\nIn the third quarter of 2025, Total Orders increased to 776 million, or 21% growth compared to the same quarter of 2024. The increase in Total Orders was driven primarily by growth in the number of consumers and growth in average consumer engagement.\nMarketplace GOV.\n We define Marketplace GOV as the total dollar value of orders completed on our Marketplaces, including taxes, tips\n2\n, and any applicable consumer fees, including membership fees related to DashPass and Wolt+. Marketplace GOV does not include the dollar value of orders, taxes and tips, or fees charged to merchants, for orders fulfilled through our Commerce Platform.\nIn the third quarter of 2025, Marketplace GOV increased to $25.0 billion, or 25% growth compared to the same quarter of 2024, driven primarily by growth in Total Orders.\nNet Revenue Margin\n. We define Net Revenue Margin as revenue expressed as a percentage of Marketplace GOV. \nIn the third quarter of 2025, Net Revenue Margin increased to 13.8% from 13.5% in the same quarter of 2024, primarily due to increasing contribution from advertising revenue, a reduction in credits and refunds as a percentage of Marketplace GOV, and a reduction in Dasher costs as a percentage of Marketplace GOV.\nContribution Profit.\n We define Contribution Profit as our gross profit less sales and marketing expense plus (i) depreciation and amortization expense related to cost of revenue, (ii) stock-based compensation expense and certain payroll tax expense included in cost of revenue and sales and marketing expenses, (iii) allocated overhead included in cost of revenue and sales and marketing expenses, and (iv) inventory write-off related to restructuring. Gross profit is defined as revenue less (i) cost of revenue, exclusive of depreciation and amortization and (ii) depreciation and amortization related to cost of revenue.\n2\n \nDashers receive 100% of tips\n31\nTable of Contents\nWe use Contribution Profit to evaluate our operating performance and trends. We believe that Contribution Profit is a useful indicator of the economic impact of orders fulfilled through DoorDash as it takes into account the direct expenses associated with generating and fulfilling orders.\nIn the third quarter of 2025, Contribution Profit increased to $1.3 billion, compared to $930 million in the same quarter of 2024, driven primarily by growth in revenue, partially offset by increases in cost of revenue and sales and marketing expenses.\nAdjusted EBITDA.\n We define Adjusted EBITDA as net income (loss) attributable to DoorDash, Inc. common stockholders, adjusted to include net income (loss) attributable to redeemable non-controlling interests and exclude (i) certain legal, tax, and regulatory settlements, reserves, and expenses, (ii) loss on disposal of property and equipment, (iii) transaction-related costs (primarily consists of acquisition, integration, and investment related costs), (iv) impairment expenses, (v) restructuring charges, (vi) inventory write-off related to restructuring, (vii) provision for (benefit from) income taxes, (viii) interest income, net, (ix) other (income) expense, net, (x) stock-based compensation expense and certain payroll tax expense, and (xi) depreciation and amortization expense.\nAdjusted EBITDA is a performance measure that we use to assess our operating performance and the operating leverage in our business.\nIn the third quarter of 2025, Adjusted EBITDA increased to $754 million from $533 million in the same quarter of 2024, driven primarily by growth in Contribution Profit, partially offset by increases in adjusted research and development expense and adjusted general and administrative expense.\nFree Cash Flow.\n We define Free Cash Flow as cash flows from operating activities less purchases of property and equipment and capitalized software and website development costs.\nIn \nthe third quarter of 2025, we generated net cash provided by operating activities of $871 million and Free Cash Flow of $723 million, up from $531 million and $444 million, respectively, in the same quarter of 2024. The increase in Free Cash Flow was driven primarily by an increase in net cash provided by operating activities.\n32\nTable of Contents\nResults of Operations\nThe following table summarizes our historical condensed consolidated statements of operations data:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2024\n2025\n2024\n2025\nRevenue\n$\n2,706 \n$\n3,446 \n$\n7,849 \n$\n9,762 \nCosts and expenses:\n(1)\nCost of revenue, exclusive of depreciation and amortization shown separately below\n1,374 \n1,687 \n4,089 \n4,803 \nSales and marketing\n483 \n576 \n1,496 \n1,769 \nResearch and development\n289 \n355 \n871 \n1,012 \nGeneral and administrative\n315 \n400 \n1,128 \n1,120 \nDepreciation and amortization\n(2)\n138 \n169 \n420 \n480 \nRestructuring charges\n— \n1 \n— \n2 \nTotal costs and expenses\n2,599 \n3,188 \n8,004 \n9,186 \nIncome (loss) from operations\n107 \n258 \n(155)\n576 \nInterest income, net\n54 \n71 \n148 \n169 \nOther expense, net\n(6)\n(81)\n(13)\n(28)\nIncome (loss) before income taxes\n155 \n248 \n(20)\n717 \nProvision for (benefit from) income taxes\n(6)\n5 \n2 \n(2)\nNet income (loss) including redeemable non-controlling interests\n161 \n243 \n(22)\n719 \nLess: net loss attributable to redeemable non-controlling interests\n(1)\n(1)\n(4)\n(3)\nNet income (loss) attributable to DoorDash, Inc. common stockholders\n$\n162 \n$\n244 \n$\n(18)\n$\n722 \n(1)\nCosts and expenses included stock-based compensation expense as follows:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2024\n2025\n2024\n2025\nCost of revenue, exclusive of depreciation and amortization\n$\n36 \n$\n39 \n$\n109 \n$\n109 \nSales and marketing\n30 \n27 \n87 \n86 \nResearch and development\n126 \n132 \n379 \n389 \nGeneral and administrative\n82 \n60 \n253 \n191 \nTotal stock-based compensation expense\n$\n274 \n$\n258 \n$\n828 \n$\n775 \n(2)\nDepreciation and amortization related to the following:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2024\n2025\n2024\n2025\nCost of revenue\n$\n49 \n$\n70 \n$\n153 \n$\n184 \nSales and marketing\n30 \n27 \n90 \n83 \nResearch and development\n55 \n67 \n163 \n197 \nGeneral and administrative\n4 \n5 \n14 \n16 \nTotal depreciation and amortization\n$\n138 \n$\n169 \n$\n420 \n$\n480 \n33\nTable of Contents\nThe following table sets forth the components of our condensed consolidated statements of operations data as a percentage of revenue:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2024\n2025\n2024\n2025\nRevenue\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nCosts and expenses:\nCost of revenue, exclusive of depreciation and amortization shown separately below\n51 \n%\n49 \n%\n52 \n%\n49 \n%\nSales and marketing\n18 \n%\n17 \n%\n19 \n%\n18 \n%\nResearch and development\n11 \n%\n10 \n%\n11 \n%\n10 \n%\nGeneral and administrative\n11 \n%\n12 \n%\n15 \n%\n12 \n%\nDepreciation and amortization\n5 \n%\n5 \n%\n5 \n%\n5 \n%\nRestructuring charges\n— \n%\n— \n%\n— \n%\n— \n%\nTotal costs and expenses\n96 \n%\n93 \n%\n102 \n%\n94 \n%\nIncome (loss) from operations\n4 \n%\n7 \n%\n(2)\n%\n6 \n%\nInterest income, net\n2 \n%\n2 \n%\n2 \n%\n2 \n%\nOther expense, net\n— \n%\n(2)\n%\n— \n%\n— \n%\nIncome (loss) before income taxes\n6 \n%\n7 \n%\n— \n%\n8 \n%\nProvision for (benefit from) income taxes\n— \n%\n— \n%\n— \n%\n— \n%\nNet income (loss) including redeemable non-controlling interests\n6 \n%\n7 \n%\n— \n%\n8 \n%\nLess: net loss attributable to redeemable non-controlling interests\n— \n%\n— \n%\n— \n%\n— \n%\nNet income (loss) attributable to DoorDash, Inc. common stockholders\n6 \n%\n7 \n%\n— \n%\n8 \n%\nComparison of the Three and Nine Months Ended September 30, 2024 and 2025\nRevenue\nWe generate a substantial majority of our revenue from orders completed through our Marketplaces and the related commissions charged to partner merchants and fees charged to consumers. Commissions from partner merchants are based on an agreed-upon rate applied to the total dollar value of goods ordered in exchange for using our Marketplaces to sell the partner merchants’ products. Fees from consumers are for the use of our Marketplaces and to arrange for delivery services. Our revenue reflects commissions charged to partner merchants and fees charged to consumers less (i) Dasher payout and (ii) refunds, credits, and promotions, which includes certain discounts and incentives provided to consumers. \nWe also generate revenue from membership fees paid by consumers for DashPass and Wolt+, and our advertising products, which are recognized as part of our Marketplaces revenue. \nIn addition, we generate revenue from other sources, including our Commerce Platform. Drive generates the majority of revenue within our Commerce Platform. We generate revenue from Drive by collecting per-order fees from merchants to arrange for delivery services that fulfill demand generated through their own channels. \nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nRevenue\n$\n2,706 \n$\n3,446 \n27 \n%\n$\n7,849 \n$\n9,762 \n24 \n%\nRevenue increased by $740 million, or 27%, during the third quarter of 2025, compared to the same quarter of 2024. The increase was primarily driven by a 25% increase in Marketplace GOV. During the third quarter of 2025, revenue grew at a faster rate than Marketplace GOV during the same period primarily due to improved logistics efficiency, increasing contribution from advertising revenue, and a reduction in credits and refunds as a percentage of Marketplace GOV.\nRevenue increased by $1.9 billion, or 24%, during the first nine months of 2025, compared to the same period of 2024. The increase was primarily driven by a 23% increase in Marketplace GOV. For the first nine months of 2025, revenue grew at a faster rate than Marketplace GOV during the same period primarily due to improved logistics efficiency, \n34\nTable of Contents\nincreasing contribution from advertising revenue, and a reduction in credits and refunds as a percentage of Marketplace GOV.\nCost of Revenue, Exclusive of Depreciation and Amortization\nCost of revenue primarily consists of (i) order management costs, which include payment processing charges, net of rebates issued from payment processors, costs associated with cancelled orders, insurance expenses, costs related to placing orders with non-partner merchants, and costs related to first party product sales, for which we take control of inventory, (ii) platform costs, which include costs for onboarding merchants and Dashers, costs for providing support for consumers, merchants, and Dashers, and technology platform infrastructure costs, and (iii) personnel costs, which include personnel-related compensation expenses related to our local operations, support, and other teams, and allocated overhead. Personnel-related compensation expenses primarily include salary, bonus, benefits, and stock-based compensation expense. Allocated overhead is determined based on an allocation of shared costs, such as facilities (including rent and utilities) and information technology costs, among all departments based on employee headcount.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nCost of revenue, exclusive of depreciation and amortization\n$\n1,374 \n$\n1,687 \n23 \n%\n$\n4,089 \n$\n4,803 \n17 \n%\nCost of revenue, exclusive of depreciation and amortization, increased by $313 million, or 23%, for the third quarter of 2025, compared to the same quarter of 2024. The increase was primarily attributable to an increase of $220 million in order management costs and an increase of $90 million in platform costs, both driven primarily by growth in Total Orders.\nCost of revenue, exclusive of depreciation and amortization, increased by $714 million, or 17%, during the first nine months of 2025, compared to the same period of 2024. The increase was primarily attributable to an increase of $517 million in order management costs, driven primarily by growth in Total Orders, partially offset by a decrease in insurance expenses, and an increase of $217 million in platform costs, driven primarily by growth in Total Orders.\nSales and Marketing\nSales and marketing expenses primarily consist of advertising and other ancillary expenses related to merchant, consumer, and Dasher acquisition, including certain consumer referral credits and Dasher referral fees paid to the referrers to the extent they represent fair value of acquiring a new consumer or a new Dasher, brand marketing expenses, personnel-related compensation expenses for sales and marketing employees, and commissions expense including amortization of deferred contract costs, as well as allocated overhead.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nSales and marketing\n$\n483 \n$\n576 \n19 \n%\n$\n1,496 \n$\n1,769 \n18 \n%\nSales and marketing expenses increased by $93 million, or 19%, for the third quarter of 2025, compared to the same quarter of 2024. The increase was primarily driven by an increase of $54 million in advertising expenses and an increase of $35 million in personnel-related compensation expenses.\nSales and marketing expenses increased by $273 million, or 18%, during the first nine months of 2025, compared to the same period of 2024. The increase was primarily driven by an increase of $187 million in advertising expenses, and an increase of  $81 million in personnel-related compensation expenses.\nResearch and Development\n35\nTable of Contents\nResearch and development expenses primarily consist of personnel-related compensation expenses related to data analytics and the design of, product development of, and improvements to our platform, as well as expenses associated with the licensing of third-party software and allocated overhead.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nResearch and development\n$\n289 \n$\n355 \n23 \n%\n$\n871 \n$\n1,012 \n16 \n%\nResearch and development expenses increased by $66 million, or 23%, for the third quarter of 2025, compared to the same quarter of 2024. The increase was primarily driven by an increase of $79 million in personnel-related compensation expenses, partially offset by an increase in capitalized software and website development costs of $36 million.\nResearch and development expenses increased by $141 million, or 16%, during the first nine months of 2025, compared to the same period of 2024. The increase was primarily driven by an increase of $185 million in personnel-related compensation expenses, partially offset by an increase in capitalized software and website development costs of $88 million.\nGeneral and Administrative\nGeneral and administrative expenses primarily consist of legal, tax, and regulatory expenses, which include litigation settlement expenses and sales and indirect taxes, personnel-related compensation expenses related to administrative employees, which include finance and accounting, human resources and legal, chargebacks associated with fraudulent credit card transactions, professional services fees, transaction-related costs, impairment expenses, bad debt expense, and allocated overhead.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nGeneral and administrative\n$\n315 \n$\n400 \n27 \n%\n$\n1,128 \n$\n1,120 \n(1)\n%\nGeneral and administrative expenses increased by $85 million, or 27%, for the third quarter of 2025, compared to the same quarter of 2024. The increase was primarily driven by an increase of $41 million in legal, tax, and regulatory expenses and an increase of $17 million in transaction-related costs.\nGeneral and administrative expenses remained materially consistent during the first nine months of 2025, compared to the same period of 2024, except for a decrease of $76 million in office lease impairment expenses and an increase of $46 million in transaction-related costs.\nDepreciation and Amortization\nDepreciation and amortization expenses primarily consist of depreciation and amortization expenses associated with our property and equipment and intangible assets. Depreciation primarily includes expenses associated with equipment for merchants, computer equipment and software, office equipment, and leasehold improvements. Amortization includes expenses associated with our capitalized software and website development costs, as well as acquired intangible assets.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nDepreciation and amortization\n$\n138 \n$\n169 \n22 \n%\n$\n420 \n$\n480 \n14 \n%\nDepreciation and amortization expenses increased by $31 million, or 22%, for the third quarter of 2025, compared to the same quarter of 2024. The increase was primarily driven by an increase of $13 million in amortization expense related to increased capitalized software and website development costs and an increase of $12 million in depreciation expense related to equipment for merchants.\n36\nTable of Contents\nDepreciation and amortization expenses increased by $60 million, or 14%, during the first nine months of 2025, compared to the same period of 2024. The increase was primarily driven by an increase of $37 million in amortization expense related to increased capitalized software and website development costs and an increase of $19 million in depreciation expense related to equipment for merchants.\nRestructuring Charges\nRestructuring charges primarily consist of separation-related payments and other termination benefit costs associated with restructuring activities.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nRestructuring charges\n$\n— \n$\n1 \n*\n$\n— \n$\n2 \n*\n*Percentage not meaningful\nRestructuring charges were\n not material in the periods presented.\nInterest Income, Net\nInterest income, net primarily consists of interest earned on our cash, cash equivalents, and marketable securities, net of interest costs, as well as interest earned on cash held in escrow under the Escrow Agreement as defined in Note 9 - \"Commitments and Contingencies\" included in Part I, Item 1, \"Notes to Condensed Consolidated Financial Statements\" of this Quarterly Report on Form 10-Q.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nInterest income, net\n$\n54 \n$\n71 \n31 \n%\n$\n148 \n$\n169 \n14 \n%\nInterest income\n, net increased by $17 million, or 31%, for the third quarter of 2025, compared to the same quarter of 2024. The increase was primarily driven by interest earned on cash held in escrow under the Escrow Agreement, partially offset by decreases in investment balances and average interest rates.\nInterest income, net increased by $21 million, or 14%, for the first nine months of 2025, compared to the same period of 2024. The increase was primarily driven by interest earned on cash held in escrow under the Escrow Agreement, partially offset by a decrease in average interest rates.\nOther Expense, Net\nOther expense, net primarily consists of changes in fair value of the deal-contingent forward contract (the \"Deal-Contingent Forward\") that we entered into with Bank of America, N.A. on May 6, 2025 to manage the risk of variability in foreign exchange rates related to the Pounds Sterling (“GBP”)-denominated purchase price of our acquisition of Deliveroo. The Deal-Contingent Forward had a notional amount of £2.8 billion and was deliverable based on a variable forward rate, with settlement contingent upon the closing of the transaction. For further information on the Deal-Contingent Forward, see Note 14 - \"Derivative\", and for further information on the closing of the Deliveroo acquisition in October 2025, see Note 15 - “Subsequent Events”, each included in Part I, Item 1, \"Notes to Condensed Consolidated Financial Statements\" of this Quarterly Report on Form 10-Q. Other expense, net also includes adjustments to non-marketable equity securities, including impairment, as well as gains and losses from transactions denominated in a currency other than the functional currency.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nOther expense, net\n$\n(6)\n$\n(81)\n1,250 \n%\n$\n(13)\n$\n(28)\n115 \n%\nOther expense, net increased by $75 million for the third quarter of 2025, compared to the same quarter of 2024. The increase was primarily driven by a change in fair value of the Deal-Contingent Forward.\n37\nTable of Contents\nOther expense, net increased by $15 million for the first nine months of 2025, compared to the same period of 2024. The increase was primarily driven by a change in fair value of the Deal-Contingent Forward.\nProvision for (benefit from) Income Taxes\nWe are subject to income taxes in the U.S. and foreign jurisdictions in which we do business. Foreign jurisdictions have different statutory tax rates than those in the U.S. Additionally, certain of our foreign earnings may also be taxable in the U.S.\nAccordingly, our effective tax rate is subject to significant variation due to several factors, including variability in our pre-tax and taxable income and loss and the mix of jurisdictions to which they relate, changes in our stock price, intercompany transactions, changes in how we do business, acquisitions, investments, tax audit developments, changes in our deferred tax assets and liabilities and their valuation, foreign currency gains and losses, changes in statutes, regulations, case law, administrative practices, principles, and interpretations related to tax, including changes to the global tax framework, competition, and other laws and accounting rules in various jurisdictions, and relative changes of expenses or losses for which tax benefits are not recognized. Additionally, the impact of discrete items and non-deductible expenses varies depending on the amount of pre-tax income or loss. For example, the impact of any particular item is greater when the amount of our pre-tax income or loss is smaller.\nWe have a valuation allowance for our net deferred tax assets in the U.S. and Finland. We expect to maintain these valuation allowances until it becomes more-likely-than-not that the benefit of our deferred tax assets will be realized by way of expected future taxable income in the U.S. and Finland.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nProvision for (benefit from) income taxes\n$\n(6)\n$\n5 \n*\n$\n2 \n$\n(2)\n*\n*Percentage not meaningful\nThe provision for income taxes for the third quarter of 2025 was primarily attributable to state and foreign income tax expenses. The benefit from income taxes for the same quarter of 2024 was primarily driven by 2023 losses generated in non-U.S. jurisdictions for which a tax benefit can be realized.\nThe benefit from income taxes for the first nine months of 2025 was primarily attributable to a one-time tax benefit from the release of a portion of the U.S. valuation allowance in connection with the acquisitions that occurred during the year, offset by state and foreign income tax expenses. The provision for income taxes for the first nine months of 2024 was primarily driven by foreign tax expense, offset by the tax benefit associated with 2023 losses in non-U.S. jurisdictions for which a tax benefit can be realized.\nGiven our current earnings and anticipated future earnings, we believe that there is a reasonable possibility that sufficient positive evidence may become available in a future period to reach a conclusion that the U.S. valuation allowance will no longer be needed. Release of the valuation allowance would result in the recognition of U.S. federal and state deferred tax assets and a corresponding decrease to income tax expense in the period the release is recorded. The exact timing and amount of any potential valuation allowance release are subject to change on the basis of our level of sustained U.S. profitability, as well as the amount of our tax deductible stock-based compensation, which is dependent upon our publicly traded share price, and macroeconomic conditions, among other factors.\nOn July 4, 2025, the U.S. enacted tax reform legislation through the One Big Beautiful Bill Act. Included in this legislation are provisions that allow for the immediate expensing of domestic U.S. research and development expenses, immediate expensing of certain capital expenditures, and other changes to the U.S. taxation of profits derived from foreign operations. This new legislation has no material impact on our condensed consolidated financial statements.\nFor additional information, see Note 11 - \"Income Taxes\" included in Part I, Item 1, \"Notes to Condensed Consolidated Financial Statements\" of this Quarterly Report on Form 10-Q. \nNon-GAAP Financial Measures\nWe use adjusted cost of revenue, adjusted sales and marketing expense, adjusted research and development expense, adjusted general and administrative expense, Contribution Profit, Contribution Margin, Adjusted Gross Profit, Adjusted \n38\nTable of Contents\nGross Margin, Adjusted EBITDA, and Free Cash Flow in conjunction with GAAP measures as part of our overall assessment of our performance, including the preparation of our annual operating budget and quarterly forecasts, to evaluate the effectiveness of our business strategies and to communicate with our board of directors concerning our business and financial performance. We believe that these non-GAAP financial measures provide useful information to investors about our business and financial performance, enhance their overall understanding of our past performance and future prospects, and allow for greater transparency with respect to metrics used by our management in their financial and operational decision making. We are presenting these non-GAAP financial measures to assist investors in seeing our business and financial performance through the eyes of management, and because we believe that these non-GAAP financial measures provide an additional tool for investors to use in comparing results of operations of our business over multiple periods and with other companies in our industry.\nOur definitions may differ from the definitions used by other companies and therefore comparability may be limited. In addition, other companies may not publish these or similar metrics. Further, these metrics have certain limitations in that they do not include the impact of certain expenses that are reflected in our condensed consolidated statements of operations. Thus, our adjusted cost of revenue, adjusted sales and marketing expense, adjusted research and development expense, adjusted general and administrative expense, Contribution Profit, Contribution Margin, Adjusted Gross Profit, Adjusted Gross Margin, Adjusted EBITDA, and Free Cash Flow should be considered in addition to, not as substitutes for, or in isolation from, measures prepared in accordance with GAAP.\nWe compensate for these limitations by providing a reconciliation of adjusted cost of revenue, adjusted sales and marketing expense, adjusted research and development expense, adjusted general and administrative expense, Contribution Profit, Contribution Margin, Adjusted Gross Profit, Adjusted Gross Margin, Adjusted EBITDA, and Free Cash Flow to their respective related GAAP financial measures. We encourage investors and others to review our business, results of operations, and financial information in its entirety, not to rely on any single financial measure, and to view adjusted cost of revenue, adjusted sales and marketing expense, adjusted research and development expense, adjusted general and administrative expense, Contribution Profit, Contribution Margin, Adjusted Gross Profit, Adjusted Gross Margin, Adjusted EBITDA, and Free Cash Flow in conjunction with their respective related GAAP financial measures.\nAdjusted Cost of Revenue\nWe define adjusted cost of revenue as cost of revenue, exclusive of depreciation and amortization, excluding stock-based compensation expense and certain payroll tax expense, allocated overhead, and inventory write-off related to restructuring. We exclude stock-based compensation as it is non-cash in nature and we exclude allocated overhead as it is generally a fixed cost and is not directly impacted by Total Orders. We believe excluding such expenses provides a better period-to-period comparison of the core operating performance of our business.\nThe following table provides a reconciliation of cost of revenue, exclusive of depreciation and amortization, to adjusted cost of revenue:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2024\n2025\n2024\n2025\nCost of revenue, exclusive of depreciation and amortization\n$\n1,374 \n$\n1,687 \n$\n4,089 \n$\n4,803 \nAdjusted to exclude the following:\nStock-based compensation expense and certain payroll tax expense\n(36)\n(39)\n(110)\n(110)\nAllocated overhead\n(9)\n(12)\n(26)\n(30)\nAdjusted cost of revenue\n$\n1,329 \n$\n1,636 \n$\n3,953 \n$\n4,663 \nAdjusted Sales and Marketing Expense\nWe define adjusted sales and marketing expense as sales and marketing expenses excluding stock-based compensation expense and certain payroll tax expense, and allocated overhead. We exclude stock-based compensation as it is non-cash in nature and we exclude allocated overhead as it is generally a fixed cost and is not directly impacted by Total Orders. We believe excluding such expenses provides a better period-to-period comparison of the core operating performance of our business.\n39\nTable of Contents\nThe following table provides a reconciliation of sales and marketing expense to adjusted sales and marketing expense:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2024\n2025\n2024\n2025\nSales and marketing\n$\n483 \n$\n576 \n$\n1,496 \n$\n1,769 \nAdjusted to exclude the following:\nStock-based compensation expense and certain payroll tax expense\n(30)\n(28)\n(88)\n(87)\nAllocated overhead\n(6)\n(6)\n(18)\n(18)\nAdjusted sales and marketing\n$\n447 \n$\n542 \n$\n1,390 \n$\n1,664 \nAdjusted Research and Development Expense\nWe define adjusted research and development expense as research and development expenses excluding stock-based compensation expense and certain payroll tax expense, and allocated overhead. We exclude stock-based compensation as it is non-cash in nature and we exclude allocated overhead as it is generally a fixed cost and is not directly impacted by Total Orders. We believe excluding such expenses provides a better period-to-period comparison of the core operating performance of our business.\nThe following table provides a reconciliation of research and development expense to adjusted research and development expense:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2024\n2025\n2024\n2025\nResearch and development\n$\n289 \n$\n355 \n$\n871 \n$\n1,012 \nAdjusted to exclude the following:\nStock-based compensation expense and certain payroll tax expense\n(126)\n(133)\n(381)\n(390)\nAllocated overhead\n(7)\n(7)\n(18)\n(21)\nAdjusted research and development\n$\n156 \n$\n215 \n$\n472 \n$\n601 \nAdjusted General and Administrative Expense\nWe define adjusted general and administrative expense as general and administrative expenses excluding stock-based compensation expense and certain payroll tax expense, certain legal, tax, and regulatory settlements, reserves, and expenses, transaction-related costs (primarily consists of acquisition, integration, and investment related costs), impairment expenses, and including allocated overhead from cost of revenue, sales and marketing, and research and development. We exclude stock-based compensation as it is non-cash in nature and we exclude certain legal, tax, and regulatory settlements, reserves, and expenses, transaction-related costs, as well as impairment expenses, as these costs are not indicative of our operating performance. We believe excluding such expenses provides a better period-to-period comparison of the core operating performance of our business.\n40\nTable of Contents\nThe following table provides a reconciliation of general and administrative expense to adjusted general and administrative expense:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2024\n2025\n2024\n2025\nGeneral and administrative\n$\n315 \n$\n400 \n$\n1,128 \n$\n1,120 \nAdjusted to exclude the following:\nStock-based compensation expense and certain payroll tax expense\n(83)\n(61)\n(255)\n(193)\nCertain legal, tax, and regulatory settlements, reserves, and expenses\n(1)\n(13)\n(48)\n(150)\n(106)\nTransaction-related costs\n— \n(17)\n(2)\n(48)\nOffice lease impairment expenses\n— \n— \n(83)\n(7)\nAllocated overhead from cost of revenue, sales and marketing, and research and development\n22 \n25 \n62 \n69 \nAdjusted general and administrative\n$\n241 \n$\n299 \n$\n700 \n$\n835 \n(1)\nWe exclude certain costs and expenses from our calculation of adjusted general and administrative expense because management believes that these costs and expenses are not indicative of our core operating performance, do not reflect the underlying economics of our business, and are not necessary to operate our business. These excluded costs and expenses consist of (i) certain legal costs primarily related to worker classification matters, and our historical Dasher pay model and pay practices, (ii) reserves and settlements or other resolutions for or related to the collection of sales, indirect, and other taxes that we do not expect to incur on a recurring basis, and (iii) expenses related to supporting various policy matters, including those related to worker classification, other labor law matters, and price controls. We believe it is appropriate to exclude the foregoing matters from our calculation of adjusted general and administrative expense because (1) the timing and magnitude of such expenses are unpredictable and thus not part of management’s budgeting or forecasting process, and (2) with respect to worker classification matters, management currently expects such expenses will not be material to our results of operations over the long term as a result of increasing legislative and regulatory certainty in this area, including as a result of Proposition 22 in California and similar legislation.\nContribution Profit\nWe use Contribution Profit to evaluate our operating performance and trends. We believe that Contribution Profit is a useful indicator of the economic impact of orders fulfilled through DoorDash as it takes into account the direct expenses associated with generating and fulfilling orders. It is not a financial measure of total company profitability and it is neither intended to be used as a proxy for total company profitability nor imply profitability for our business. We define Contribution Profit as our gross profit less sales and marketing expense plus (i) depreciation and amortization expense related to cost of revenue, (ii) stock-based compensation expense and certain payroll tax expense included in cost of revenue and sales and marketing expenses, (iii) allocated overhead included in cost of revenue and sales and marketing expenses, and (iv) inventory write-off related to restructuring. We define gross margin as gross profit as a percentage of revenue for the same period and we define Contribution Margin as Contribution Profit as a percentage of revenue for the same period.\nGross profit is the most directly comparable financial measure to Contribution Profit. The following table provides a reconciliation of gross profit to Contribution Profit:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n2024\n2025\nRevenue\n$\n2,706 \n$\n3,446 \n$\n7,849 \n$\n9,762 \nLess: Cost of revenue, exclusive of depreciation and amortization\n(1,374)\n(1,687)\n(4,089)\n(4,803)\nLess: Depreciation and amortization related to cost of revenue\n(49)\n(70)\n(153)\n(184)\nGross profit\n$\n1,283 \n$\n1,689 \n$\n3,607 \n$\n4,775 \nGross Margin\n47.4 \n%\n49.0 \n%\n46.0 \n%\n48.9 \n%\nLess: Sales and marketing\n$\n(483)\n$\n(576)\n$\n(1,496)\n$\n(1,769)\nAdd: Depreciation and amortization related to cost of revenue\n49 \n70 \n153 \n184 \nAdd: Stock-based compensation expense and certain payroll tax expense included in cost of revenue and sales and marketing\n66 \n67 \n198 \n197 \nAdd: Allocated overhead included in cost of revenue and sales and marketing\n15 \n18 \n44 \n48 \nContribution Profit \n$\n930 \n$\n1,268 \n$\n2,506 \n$\n3,435 \nContribution Margin\n34.4 \n%\n36.8 \n%\n31.9 \n%\n35.2 \n%\n41\nTable of Contents\nAdjusted Gross Profit\nWe define Adjusted Gross Profit as gross profit plus (i) depreciation and amortization expense related to cost of revenue, (ii) stock-based compensation expense and certain payroll tax expense included in cost of revenue, (iii) allocated overhead included in cost of revenue, and (iv) inventory write-off related to restructuring. Gross profit is defined as revenue less (i) cost of revenue, exclusive of depreciation and amortization and (ii) depreciation and amortization related to cost of revenue. Adjusted Gross Margin is defined as Adjusted Gross Profit as a percentage of revenue for the same period. \nThe following table provides a reconciliation of gross profit to Adjusted Gross Profit:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except percentages)\n2024\n2025\n2024\n2025\nGross profit\n$\n1,283 \n$\n1,689 \n$\n3,607 \n$\n4,775 \nAdd: Depreciation and amortization related to cost of revenue\n49 \n70 \n153 \n184 \nAdd: Stock-based compensation expense and certain payroll tax expense included in cost of revenue\n36 \n39 \n110 \n110 \nAdd: Allocated overhead included in cost of revenue\n9 \n12 \n26 \n30 \nAdjusted Gross Profit\n$\n1,377 \n$\n1,810 \n$\n3,896 \n$\n5,099 \nAdjusted Gross Margin\n50.9 \n%\n52.5 \n%\n49.6 \n%\n52.2 \n%\nAdjusted EBITDA\nAdjusted EBITDA is a measure that we use to assess our operating performance and the operating leverage in our business. We define Adjusted EBITDA as net income (loss) attributable to DoorDash, Inc. common stockholders, adjusted to include net income (loss) attributable to redeemable non-controlling interests and exclude (i) certain legal, tax, and regulatory settlements, reserves, and expenses, (ii) loss on disposal of property and equipment, (iii) transaction-related costs (primarily consists of acquisition, integration, and investment related costs), (iv) impairment expenses, (v) restructuring charges, (vi) inventory write-off related to restructuring, (vii) provision for (benefit from) income taxes, (viii) interest income, net, (ix) other (income) expense, net, (x) stock-based compensation expense and certain payroll tax expense, and (xi) depreciation and amortization expense.\nThe following table provides a reconciliation of net income (loss) attributable to DoorDash, Inc. common stockholders to Adjusted EBITDA, and a reconciliation of net income (loss) including redeemable non-controlling interests to Adjusted EBITDA:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2024\n2025\n2024\n2025\nNet income (loss) attributable to DoorDash, Inc. common stockholders\n$\n162 \n$\n244 \n$\n(18)\n$\n722 \nAdd: Net loss attributable to redeemable non-controlling interests\n(1)\n(1)\n(4)\n(3)\nNet income (loss) including redeemable non-controlling interests\n$\n161 \n$\n243 \n$\n(22)\n$\n719 \nCertain legal, tax, and regulatory settlements, reserves, and expenses\n(1)\n13 \n48 \n150 \n106 \nTransaction-related costs\n— \n17 \n2 \n48 \nOffice lease impairment expenses\n— \n— \n83 \n7 \nRestructuring charges\n— \n1 \n— \n2 \nProvision for (benefit from) income taxes\n(6)\n5 \n2 \n(2)\nInterest income, net\n(54)\n(71)\n(148)\n(169)\nOther expense, net\n(2)\n6 \n81 \n13 \n28 \nStock-based compensation expense and certain payroll tax expense\n275 \n261 \n834 \n780 \nDepreciation and amortization expense\n138 \n169 \n420 \n480 \nAdjusted EBITDA\n$\n533 \n$\n754 \n$\n1,334 \n$\n1,999 \n(1)\nWe exclude certain costs and expenses from our calculation of Adjusted EBITDA because management believes that these costs and expenses are not indicative of our core operating performance, do not reflect the underlying economics of our business, and are not necessary to operate our business. These excluded costs and expenses consist of (i) certain legal costs primarily related to worker classification matters, and our \n42\nTable of Contents\nhistorical Dasher pay model and pay practices, (ii) reserves and settlements or other resolutions for or related to the collection of sales, indirect, and other taxes that we do not expect to incur on a recurring basis, and (iii) expenses related to supporting various policy matters, including those related to worker classification, other labor law matters, and price controls. We believe it is appropriate to exclude the foregoing matters from our calculation of Adjusted EBITDA because (1) the timing and magnitude of such expenses are unpredictable and thus not part of management’s budgeting or forecasting process, and (2) with respect to worker classification matters, management currently expects such expenses will not be material to our results of operations over the long term as a result of increasing legislative and regulatory certainty in this area, including as a result of Proposition 22 in California and similar legislation.\n(2)\nConsists primarily of a non-cash change in fair value of the Deal-Contingent Forward during the three months ended September 30, 2025.\nFree Cash Flow \nWe define Free Cash Flow as cash flows from operating activities less purchases of property and equipment and capitalized software and website development costs.\nThe following table provides a reconciliation of net cash provided by operating activities to Free Cash Flow:\nNine Months Ended September 30,\n(in millions)\n2024\n2025\nNet cash provided by operating activities\n$\n1,614 \n$\n2,010 \nPurchases of property and equipment\n(72)\n(203)\nCapitalized software and website development costs\n(160)\n(235)\nFree Cash Flow\n$\n1,382 \n$\n1,572 \nNet cash used in investing activities\n$\n(281)\n$\n(1,274)\nNet cash provided by (used in) financing activities\n$\n(211)\n$\n2,379 \nCredit Facility\nOn November 19, 2019, we entered into a revolving credit and guaranty agreement with certain lenders, which, as most recently amended and restated on April 26, 2024, provides for an $800 million unsecured revolving credit facility maturing on April 26, 2029, with a sublimit for the issuance of letters of credit in an aggregate face amount of up to $600 million. As of September 30, 2025, we were in compliance with the covenants under the revolving credit and guaranty agreement. As amended and restated, the credit agreement contains customary affirmative covenants, as well as customary negative covenants that restrict our ability and our subsidiaries’ ability to, among other things, incur subsidiary indebtedness, grant liens, declare cash dividends or make certain other distributions, repurchase stock, merge or consolidate with other companies or sell substantially all of our and our subsidiaries' assets, taken as a whole, make investments and loans, and engage in certain transactions with affiliates. The Company must also maintain compliance with a maximum senior net leverage ratio, measured quarterly, determined in accordance with the terms of the credit agreement. As of December 31, 2024 and September 30, 2025, no revolving loans were outstanding and $112 million and $61 million of letters of credit were issued under our revolving credit facility, respectively.\nLiquidity and Capital Resources\nAs of September 30, 2025, our principal sources of liquidity were cash, cash equivalents, and marketable securities of $5.1 billion, which consisted of cash and cash equivalents of $3.3 billion, short-term marketable securities of $964 million, and long-term marketable securities of $849 million. Additionally, funds held at payment processors of $377 million represent cash due from our payment processors for cleared transactions with merchants and consumers, as well as funds remitted to payment processors for Dasher payout. Cash and cash equivalents consisted of cash on deposit with banks, as well as institutional money market funds. Marketable securities consisted of certificates of deposit, commercial paper, corporate bonds, U.S. government agency securities, U.S. Treasury securities, and mutual funds.\nWe have generated significant operating losses from our operations as reflected in our accumulated deficit of $4.5 billion as of September 30, 2025. We have historically funded our operations from cash from operations as well as the issuance of equity securities, including in our initial public offering in December 2020. We have also completed debt financings, such as our recent issuance of $2.75 billion aggregate principal amount of 0% Convertible Senior Notes due 2030 (the “2030 Notes”) in May 2025. We intend to use the net proceeds from the 2030 Notes for general corporate purposes. For additional information regarding the 2030 Notes, see Note 8 - \"Convertible Notes, Net\" included in Part I, Item 1, \"Notes to Condensed Consolidated Financial Statements\" of this Quarterly Report on Form 10-Q.\n43\nTable of Contents\nTo execute on our strategic initiatives to continue to grow our business, we may incur operating losses and generate negative cash flows from operations in the future, and as a result, we may require additional capital resources. We believe our existing cash, cash equivalents, and marketable securities, along with the available borrowings under our revolving credit facility, will be sufficient to meet our working capital and capital expenditures needs for at least the next 12 months and beyond.\nIn February 2025, we announced the authorization of a share repurchase program for the repurchase of shares of our Class A common stock in an aggregate amount of up to $5.0 billion, which is inclusive of the remaining share repurchase authority of $876 million under the share repurchase program that we previously announced in February 2024. Repurchases may be made from time to time through open market purchases or through privately negotiated transactions subject to market conditions, applicable legal requirements, and other relevant factors. Open market repurchases may be structured to occur in accordance with the requirements of Rule 10b-18 of the Exchange Act. We have entered into, and may, from time to time, enter into, Rule 10b5-1 plans to facilitate repurchases of our Class A common stock under this authorization. We may or may not repurchase any portion of the total authorized amount, and the timing and actual number of shares repurchased may depend on a variety of factors, including price, general business and market conditions, and alternative investment opportunities. As of September 30, 2025, $5.0 billion remained available under the repurchase authorization.\nOur future capital requirements will depend on many factors, including, but not limited to, our growth, our ability to attract and retain merchants, consumers, and Dashers that utilize our platform, the continuing market acceptance of our offerings, the timing and extent of spending to support our efforts to develop our platform, the expansion of sales and marketing activities, the timing and extent of spending for policy and worker classification initiatives, and the occurrence of certain conditions triggering the 2030 Notes' conversion feature, which will be required to be settled partially or entirely in cash, or our repurchase of some or all of the 2030 Notes. Further, we have in the past entered into, and may in the future enter into additional, arrangements to acquire or invest in businesses, products, services, and technologies. For example, we recently closed our acquisition of Deliveroo for total cash consideration of approximately £2.8 billion (the \"Deliveroo Transaction\").. For additional information regarding the Deliveroo Transaction, see Note 9 - \"Commitments and Contingencies\" included in Part I, Item 1, \"Notes to Condensed Consolidated Financial Statements\" of this Quarterly Report on Form 10-Q. In addition, the 2030 Notes will mature on May 15, 2030, unless earlier repurchased, redeemed or converted. Before November 15, 2029, noteholders will have the right to convert the 2030 Notes only upon the occurrence of certain events. From and after November 15, 2029, noteholders may convert their 2030 Notes at any time at their election until the close of business on the second scheduled trading day immediately before the maturity date. We will have the right to elect to settle conversions either in cash or in a combination of cash and shares of our Class A common stock, provided that, at least the principal amount of the 2030 Notes being converted will be paid in cash, which could adversely affect our liquidity. We may be required to seek additional equity or debt financing. In the event that additional financing is required from outside sources, we may not be able to raise it on terms acceptable to us or at all. If we are unable to raise additional capital when desired, our business, financial condition, and results of operations could be adversely affected.\nThe following table summarizes our cash flows for the periods indicated:\nNine Months Ended September 30,\n(in millions)\n2024\n2025\nNet cash provided by operating activities\n$\n1,614 \n$\n2,010 \nNet cash used in investing activities\n(281)\n(1,274)\nNet cash provided by (used in) financing activities\n(211)\n2,379 \nForeign currency effect on cash, cash equivalents, and restricted cash\n4 \n63 \nNet increase in cash, cash equivalents, and restricted cash\n$\n1,126 \n$\n3,178 \nOperating Activities\nCash provided by operating activities was $2.0 billion for the first nine months of 2025. This consisted of net income including redeemable non-controlling interests of $719 million, adjusted for non-cash stock-based compensation expense of $775 million, non-cash depreciation and amortization expense of $480 million, non-cash reduction of operating lease right-of-use assets and accretion of operating lease liabilities of $83 million, amortization of deferred contract costs of $55 million, a $12 million change in fair value of our deal-contingent forward contract, non-cash office lease impairment expenses of $7 million, and other net non-cash expenses of $45 million, offset by $166 million net outflows from changes in operating assets and liabilities primarily driven by changes in prepaid expenses and other current assets, other assets \n44\nTable of Contents\nand accounts receivable, net, and payments for operating lease liabilities, partially offset by changes in accrued expenses and other current liabilities.\nCash provided by operating activities was $1.6 billion for the first nine months of 2024. This consisted of a net loss including redeemable non-controlling interests of $22 million and other net non-cash adjustments of $17 million, offset by non-cash stock-based compensation expense of $828 million, non-cash depreciation and amortization expense of $420 million, non-cash reduction of operating lease right-of-use assets and accretion of operating lease liabilities of $77 million, amortization of deferred contract costs of $43 million, and non-cash office lease impairment expenses of $83 million, as well as $202 million net inflows from changes in operating assets and liabilities primarily driven by an increase in accrued expenses and other current liabilities, partially offset by increases in prepaid expenses and other current assets and accounts receivable, net.\nInvesting Activities\nCash used in investing activities was $1.3 billion for the first nine months of 2025, which consisted of cash paid for acquisitions, net of cash acquired, of $1.2 billion, purchases of marketable securities of $1.1 billion, purchases of property and equipment of $203 million, cash outflows for capitalized software and website development costs of $235 million, and purchases of non-marketable equity securities of $5 million,\n \npartially offset by proceeds from maturities and sales of marketable securities of $1.5 billion.\nCash used in investing activities was $281 million for the first nine months of 2024, which primarily consisted of purchases of marketable securities of $1.5 billion, purchases of property and equipment of $72 million, and cash outflows for capitalized software and website development costs of $160 million, partially offset by proceeds from maturities and sales of marketable securities of $1.5 billion.\nFinancing Activities\nCash provided by financing activities was $2.4 billion for the first nine months of 2025, which primarily consisted of proceeds from issuance of the 2030 Notes of $2.7 billion, proceeds from issuance of warrants of $341 million, and proceeds from exercise of stock options of $8 million\n, \npartially offset by purchase of convertible note hedges of $680 million and other financing activities of $10 million.\nCash used in financing activities was $211 million for the first nine months of 2024, which consisted of repurchases of our Class A common stock of $224 million, partially offset by proceeds from exercise of stock options of $7 million and other financing activities of $6 million.\nCritical Accounting Estimates\nOur condensed consolidated financial statements and the related notes thereto included elsewhere in this Quarterly Report on Form 10-Q are prepared in accordance with GAAP. The preparation of condensed consolidated financial statements in accordance with GAAP requires us to make certain estimates, judgments, and assumptions that affect the reported amounts of assets and liabilities and the related disclosures at the date of the financial statements, as well as the reported amounts of revenue and expenses during the period presented. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances. Actual results could differ significantly from our estimates. To the extent that there are differences between our estimates and actual results, our future financial statement presentation, financial condition, results of operations, and cash flows could be affected.\nThere have been no material changes to our critical accounting estimates as described in our Annual Report on Form 10-K for the year ended December 31, 2024."
}