{
  "source_file": "day-20241231.htm",
  "form_type": "10-K",
  "item1": null,
  "item7": "Item 7. Management’s Discussion and Analysis o\nf Financial Condition and Results of Operations.\n \n\n\nThe following is a discussion and analysis of our financial condition and results of operations together with our consolidated financial statements and the related notes thereto included elsewhere in this report. This discussion and analysis contains forward-looking statements, including statements regarding industry outlook, our expectations for the future of our business, and our liquidity and capital resources as well as other non-historical statements. These statements are based on current expectations and are subject to numerous risks and uncertainties, including but not limited to the risks and uncertainties described in “Risk Factors” and “Cautionary Note Regarding Forward-Looking Statements.” Our actual results may differ materially from those contained in or implied by these forward-looking statements.\n \n\n\nThe following discussion and analysis of our financial condition and results of operations covers fiscal 2024 and fiscal 2023 items and year-over-year comparisons between fiscal 2024 and fiscal 2023. Discussions of fiscal 2022 items and year-over-year comparisons between fiscal 2023 and 2022 that are not included in this Form 10-K can be found in \n“Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31, 2023,\n that was filed with the SEC on February 28, 2024.\n\n\nOverview\n \n\n\nDayforce, Inc. is a global HCM software company. We categorize our solutions into three categories: Cloud recurring, other recurring, and professional services and other. Cloud recurring revenue is primarily generated from HCM solutions that are delivered via two Cloud offerings: Dayforce, our flagship Cloud HCM platform, and Powerpay, a Cloud HR and payroll solution for the Canadian small business market. We also continue to support customers using our legacy North America solutions and customers using our acquired solutions in APJ. We invest in maintenance and necessary updates to support our customers and continue to migrate them to Dayforce. Revenue from our Cloud recurring and other recurring solutions includes investment income generated from holding customer funds, also referred to as float revenue or float.\n\n\nDayforce provides global HR, payroll and tax, workforce management, benefits, and talent intelligence functionality. Our platform is used by organizations of all sizes, from small businesses to global organizations, regardless of industry, to optimize management of the entire employee lifecycle, including attracting, hiring, engaging, paying, and developing their people. Dayforce was built as a single application from the ground up that combines a modern, consumer-grade user experience with proprietary application architecture, including a single employee record and a rules engine spanning all areas of HCM. Dayforce provides continuous real-time calculations across all modules to enable, for example, payroll administrators access to data through the entire pay period, and managers access to real-time data to optimize work schedules. Our platform is designed to drive efficiencies for our customers and their employees by improving HCM decision-making processes, streamlining workflows, revealing strategic organizational insights, and simplifying legislative compliance. The platform is designed to ease administrative work for both employees and managers, creating opportunities for companies to increase employee engagement. We sell Dayforce through our direct sales force and partner ecosystem on a subscription PEPM basis. Our subscriptions are typically structured with an initial fixed term of between three and five years, with evergreen renewal thereafter.\n\n\nOur Business Model\n \n\n\nOur business model focuses on supporting the rapid growth of Dayforce and maximizing the lifetime value of our Dayforce customer relationships. Our ratable recognition of subscription revenues over the term of the subscription period combined with our high revenue retention rates yield a high level of visibility into our future revenues. The profitability of a customer depends, in large part, on how long they have been a customer. We estimate that it takes approximately two years before we are able to recover our implementation, customer acquisition, and other direct costs on a new Dayforce customer contract.\n\n\nOver the lifetime of the customer relationship, we have the opportunity to realize additional PEPM revenue, both as the customer grows or offers the Dayforce solution to additional employees, and also by selling additional functionality to existing customers that do not currently utilize all of the modules we offer. We also incur costs to manage the account, to retain customers, and to sell additional functionality, however, these costs are significantly less than the costs initially incurred to acquire and to take customers live.\n\n\n \n33\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nRevenues\n\n\nWe generate recurring revenues primarily from recurring fees charged for the use of our Cloud recurring solutions, Dayforce and Powerpay, as well as from our other recurring solutions. We also generate professional services and other revenue associated primarily with the work performed to assist customers with the planning, design, and implementation of their Cloud-based solution. Our solutions are typically provided through long-term customer relationships that result in a high level of recurring revenue. We also generate recurring revenue from investment income on our recurring customer funds before such funds are remitted to taxing authorities, customer employees, or other third parties. We refer to this investment income as float revenue.\n\n\nFor Dayforce, we primarily charge monthly recurring fees on a PEPM basis, generally one-month in advance of service, based on the number and type of solutions provided to the customer and the number of employees and other users at the customer. Our standard Dayforce contracts are generally for a three to five-year period. The average time it takes to implement Dayforce typically ranges from three months for smaller customers to twelve months for larger customers. We begin to generate recurring revenue when we provide a production instance to the customer.\n\n\nWe offer Powerpay for Canadian organizations with fewer than 100 employees. The majority of Powerpay revenue is generated from recurring fees charged on a PEPM basis. Typical processes include the customer’s payroll runs, year-end tax packages, and delivery of customers’ remittance advices or checks. Powerpay can typically be implemented on a remote basis within one to three days, at which point we start receiving recurring fees.\n\n\nFor our Other recurring solutions, we typically charge recurring fees on a per-process basis. Typical processes include the customer’s payroll runs, year-end tax packages, and delivery of customers’ remittance advices or checks. In addition to customers who use our payroll services, certain customers use our tax filing services on a stand-alone basis. We also perform individual services for customers, such as check printing, wage attachment and disbursement, and ACA management.\n\n\nFor our Dayforce and Other recurring customers, we also provide outsourced HR solutions, which are tailored to meet their individual needs, and entail performing the duties of a customer’s HR department, including payroll processing, time and labor management, performance management, and recruiting, as needed.\n \n\n\nHow We Ass\ness Our Performance\n\n\nIn assessing our performance, we consider a variety of performance indicators in addition to revenue, operating profit, and net income. Set forth below is a description of our key performance measures.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nLive Dayforce customers\n\n\n \n\n\n \n\n\n6,876\n\n\n \n\n\n \n\n\n \n\n\n6,393\n\n\n \n\n\n\n\n\n\nCloud annualized recurring revenue (ARR) (a) (in millions)\n\n\n \n\n\n$\n\n\n1,474.1\n\n\n \n\n\n \n\n\n$\n\n\n1,250.6\n\n\n \n\n\n\n\n\n\nAnnual Dayforce revenue retention rate (a)\n\n\n \n\n\n \n\n\n98.0\n\n\n%\n\n\n \n\n\n \n\n\n97.1\n\n\n%\n\n\n\n\n\n\nDayforce recurring revenue per customer (a)\n\n\n \n\n\n$\n\n\n163,101\n\n\n \n\n\n \n\n\n$\n\n\n146,771\n\n\n \n\n\n\n\n\n\nAdjusted operating profit (a) (in millions)\n\n\n \n\n\n$\n\n\n410.5\n\n\n \n\n\n \n\n\n$\n\n\n339.8\n\n\n \n\n\n\n\n\n\nAdjusted EBITDA (a) (in millions)\n\n\n \n\n\n$\n\n\n501.5\n\n\n \n\n\n \n\n\n$\n\n\n410.2\n\n\n \n\n\n\n\n\n\nAdjusted EBITDA margin (a)\n\n\n \n\n\n \n\n\n28.5\n\n\n%\n\n\n \n\n\n \n\n\n27.1\n\n\n%\n\n\n\n\n\n\nAdjusted Cloud recurring gross margin (a)\n\n\n \n\n\n \n\n\n79.8\n\n\n%\n\n\n \n\n\n \n\n\n78.3\n\n\n%\n\n\n\n\n\n\n(a)\nRefer below for further description and to the “\nNon-GAAP Financial Measures\n” section for the definition of this performance indicator which is considered a non-GAAP financial measure.\n\n\nLive Dayforce Customers\n\n\nWe use the number of live Dayforce customers as an indicator of future revenue and the overall performance of the business and to assess the performance of our implementation services. We market Dayforce to customers of all sizes, including small (under 500 employees), major (500 to 5,999 employees), and enterprise (6,000 or more employees).\n\n\n \n34\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nThe following table sets forth the number of live Dayforce customers at the end of the years presented:\n\n\n\n\nCloud ARR\n\n\nWe use Cloud ARR, a non-GAAP financial measure, to measure the size and growth of our recurring Cloud business, which we believe is useful to management and investors. We derive the majority of our Cloud revenues from recurring fees, primarily PEPM subscription charges. We also derive recurring revenue from fees related to the rental and maintenance of payroll time clocks, charges for once-a-year services, such as year-end tax statements, and float revenue on our customer funds before such funds are remitted to taxing authorities, customer employees, or other third parties. We set annual targets for Cloud ARR and monitor progress toward those targets on a quarterly basis.\n\n\nAnnual Dayforce Revenue Retention Rate\n\n\nWe use annual Dayforce revenue retention rate, a non-GAAP financial measure, to measure the percentage of revenues that we retain from our existing Dayforce customers, which we believe is useful to management and investors as an indicator of customer satisfaction and future revenues. Our annual Dayforce revenue retention rate was 98% for the year ended December 31, 2024, and above 97% for the years ended December 31, 2023, and 2022. We set annual targets for Dayforce revenue retention rate and monitor progress toward those targets on a quarterly basis by reviewing known and anticipated customer losses. Our Dayforce revenue retention rate may fluctuate as a result of a number of factors, including the mix of Dayforce solutions used by customers, the level of customer satisfaction, and changes in the number of employees live on our Dayforce solutions.\n\n\nDayforce Recurring \nRevenue Per Customer\n\n\nWe use Dayforce recurring revenue per customer, a non-GAAP financial measure, as an indicator of the average size of our Dayforce customer, which we believe is also useful to management and investors. We calculate and monitor Dayforce recurring revenue per customer on a quarterly basis. Our Dayforce recurring revenue per customer may fluctuate as a result of a number of factors, including the number of live Dayforce customers and the number of modules purchased by each customer.\n\n\n \n35\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nConstant Currency Revenue\n \n\n\nWe present percentage change in revenue on a constant currency basis to assess how our underlying business performed, excluding the effect of foreign currency rate fluctuations. We believe this non-GAAP financial measure is useful to management and investors. We have calculated percentage change in revenue on a constant currency basis by applying the average foreign exchange rate in effect during the comparable prior period. The average U.S. dollar to Canadian dollar foreign exchange rate was $1.37 and $1.35 for the years ended December 31, 2024 and 2023, respectively.\n\n\nAdjusted Operating Profit, Adjusted EBITDA, Adjusted EBITDA Margin, and Adjusted Cloud Recurring Gross Margin\n\n\nWe believe that Adjusted operating profit, Adjusted EBITDA, Adjusted EBITDA margin, and Adjusted Cloud recurring gross margin, non-GAAP financial measures, are useful to management and investors as supplemental measures to evaluate our overall operating performance. Adjusted EBITDA is a component of our management incentive plan and Adjusted operating profit and Adjusted Cloud recurring gross margin are components of certain performance based equity awards for our named executive officers, and these metrics are used by management to assess performance and to compare our operating performance to our competitors. Management believes that these non-GAAP financial measures are helpful in highlighting management performance trends because these metrics exclude the results of decisions that are outside the normal course of our business operations.\n\n\nResults o\nf Operations\n\n\n \n\n\nYear Ended December 31, 2024 Compared with Year Ended December 31, 2023\n \n\n\nThe following table sets forth our results of operations for the periods presented:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\nIncrease/(Decrease)\n\n\n \n\n\n \n\n\nPercentage of Revenue\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRecurring\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCloud\n\n\n \n\n\n$\n\n\n1,442.4\n\n\n \n\n\n \n\n\n$\n\n\n1,211.4\n\n\n \n\n\n \n\n\n$\n\n\n231.0\n\n\n \n\n\n \n\n\n \n\n\n19.1\n\n\n%\n\n\n \n\n\n \n\n\n82.0\n\n\n%\n\n\n \n\n\n \n\n\n80.0\n\n\n%\n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n74.9\n\n\n \n\n\n \n\n\n \n\n\n85.9\n\n\n \n\n\n \n\n\n \n\n\n(11.0\n\n\n)\n\n\n \n\n\n \n\n\n(12.8\n\n\n)%\n\n\n \n\n\n \n\n\n4.3\n\n\n%\n\n\n \n\n\n \n\n\n5.7\n\n\n%\n\n\n\n\n\n\nTotal recurring\n\n\n \n\n\n \n\n\n1,517.3\n\n\n \n\n\n \n\n\n \n\n\n1,297.3\n\n\n \n\n\n \n\n\n \n\n\n220.0\n\n\n \n\n\n \n\n\n \n\n\n17.0\n\n\n%\n\n\n \n\n\n \n\n\n86.2\n\n\n%\n\n\n \n\n\n \n\n\n85.7\n\n\n%\n\n\n\n\n\n\nProfessional services and other\n\n\n \n\n\n \n\n\n242.7\n\n\n \n\n\n \n\n\n \n\n\n216.4\n\n\n \n\n\n \n\n\n \n\n\n26.3\n\n\n \n\n\n \n\n\n \n\n\n12.2\n\n\n%\n\n\n \n\n\n \n\n\n13.8\n\n\n%\n\n\n \n\n\n \n\n\n14.3\n\n\n%\n\n\n\n\n\n\nTotal revenue\n\n\n \n\n\n \n\n\n1,760.0\n\n\n \n\n\n \n\n\n \n\n\n1,513.7\n\n\n \n\n\n \n\n\n \n\n\n246.3\n\n\n \n\n\n \n\n\n \n\n\n16.3\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\nCost of revenue:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRecurring\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCloud\n\n\n \n\n\n \n\n\n303.7\n\n\n \n\n\n \n\n\n \n\n\n278.5\n\n\n \n\n\n \n\n\n \n\n\n25.2\n\n\n \n\n\n \n\n\n \n\n\n9.0\n\n\n%\n\n\n \n\n\n \n\n\n17.3\n\n\n%\n\n\n \n\n\n \n\n\n18.4\n\n\n%\n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n49.0\n\n\n \n\n\n \n\n\n \n\n\n46.4\n\n\n \n\n\n \n\n\n \n\n\n2.6\n\n\n \n\n\n \n\n\n \n\n\n5.6\n\n\n%\n\n\n \n\n\n \n\n\n2.8\n\n\n%\n\n\n \n\n\n \n\n\n3.1\n\n\n%\n\n\n\n\n\n\nTotal recurring\n\n\n \n\n\n \n\n\n352.7\n\n\n \n\n\n \n\n\n \n\n\n324.9\n\n\n \n\n\n \n\n\n \n\n\n27.8\n\n\n \n\n\n \n\n\n \n\n\n8.6\n\n\n%\n\n\n \n\n\n \n\n\n20.0\n\n\n%\n\n\n \n\n\n \n\n\n21.5\n\n\n%\n\n\n\n\n\n\nProfessional services and other\n\n\n \n\n\n \n\n\n291.0\n\n\n \n\n\n \n\n\n \n\n\n265.6\n\n\n \n\n\n \n\n\n \n\n\n25.4\n\n\n \n\n\n \n\n\n \n\n\n9.6\n\n\n%\n\n\n \n\n\n \n\n\n16.5\n\n\n%\n\n\n \n\n\n \n\n\n17.5\n\n\n%\n\n\n\n\n\n\nProduct development and management\n\n\n \n\n\n \n\n\n223.8\n\n\n \n\n\n \n\n\n \n\n\n209.9\n\n\n \n\n\n \n\n\n \n\n\n13.9\n\n\n \n\n\n \n\n\n \n\n\n6.6\n\n\n%\n\n\n \n\n\n \n\n\n12.7\n\n\n%\n\n\n \n\n\n \n\n\n13.9\n\n\n%\n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n80.4\n\n\n \n\n\n \n\n\n \n\n\n66.8\n\n\n \n\n\n \n\n\n \n\n\n13.6\n\n\n \n\n\n \n\n\n \n\n\n20.4\n\n\n%\n\n\n \n\n\n \n\n\n4.6\n\n\n%\n\n\n \n\n\n \n\n\n4.4\n\n\n%\n\n\n\n\n\n\nTotal cost of revenue\n\n\n \n\n\n \n\n\n947.9\n\n\n \n\n\n \n\n\n \n\n\n867.2\n\n\n \n\n\n \n\n\n \n\n\n80.7\n\n\n \n\n\n \n\n\n \n\n\n9.3\n\n\n%\n\n\n \n\n\n \n\n\n53.9\n\n\n%\n\n\n \n\n\n \n\n\n57.3\n\n\n%\n\n\n\n\n\n\nGross profit\n\n\n \n\n\n \n\n\n812.1\n\n\n \n\n\n \n\n\n \n\n\n646.5\n\n\n \n\n\n \n\n\n \n\n\n165.6\n\n\n \n\n\n \n\n\n \n\n\n25.6\n\n\n%\n\n\n \n\n\n \n\n\n46.1\n\n\n%\n\n\n \n\n\n \n\n\n42.7\n\n\n%\n\n\n\n\n\n\nSelling and marketing\n\n\n \n\n\n \n\n\n342.0\n\n\n \n\n\n \n\n\n \n\n\n250.2\n\n\n \n\n\n \n\n\n \n\n\n91.8\n\n\n \n\n\n \n\n\n \n\n\n36.7\n\n\n%\n\n\n \n\n\n \n\n\n19.4\n\n\n%\n\n\n \n\n\n \n\n\n16.5\n\n\n%\n\n\n\n\n\n\nGeneral and administrative\n\n\n \n\n\n \n\n\n366.0\n\n\n \n\n\n \n\n\n \n\n\n263.2\n\n\n \n\n\n \n\n\n \n\n\n102.8\n\n\n \n\n\n \n\n\n \n\n\n39.1\n\n\n%\n\n\n \n\n\n \n\n\n20.8\n\n\n%\n\n\n \n\n\n \n\n\n17.4\n\n\n%\n\n\n\n\n\n\nOperating profit\n\n\n \n\n\n \n\n\n104.1\n\n\n \n\n\n \n\n\n \n\n\n133.1\n\n\n \n\n\n \n\n\n \n\n\n(29.0\n\n\n)\n\n\n \n\n\n \n\n\n(21.8\n\n\n)%\n\n\n \n\n\n \n\n\n5.9\n\n\n%\n\n\n \n\n\n \n\n\n8.8\n\n\n%\n\n\n\n\n\n\nInterest income\n\n\n \n\n\n \n\n\n(18.1\n\n\n)\n\n\n \n\n\n \n\n\n(20.2\n\n\n)\n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n \n\n\n \n\n\n(10.4\n\n\n)%\n\n\n \n\n\n \n\n\n(1.0\n\n\n)%\n\n\n \n\n\n \n\n\n(1.3\n\n\n)%\n\n\n\n\n\n\n     Interest expense\n\n\n \n\n\n \n\n\n58.7\n\n\n \n\n\n \n\n\n \n\n\n56.3\n\n\n \n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n \n\n\n \n\n\n4.3\n\n\n%\n\n\n \n\n\n \n\n\n3.3\n\n\n%\n\n\n \n\n\n \n\n\n3.7\n\n\n%\n\n\n\n\n\n\n     Other expense, net\n\n\n \n\n\n \n\n\n25.9\n\n\n \n\n\n \n\n\n \n\n\n1.0\n\n\n \n\n\n \n\n\n \n\n\n24.9\n\n\n \n\n\n \n\n\n \n\n\n2490.0\n\n\n%\n\n\n \n\n\n \n\n\n1.5\n\n\n%\n\n\n \n\n\n \n\n\n0.1\n\n\n%\n\n\n\n\n\n\nIncome before income taxes\n\n\n \n\n\n \n\n\n37.6\n\n\n \n\n\n \n\n\n \n\n\n96.0\n\n\n \n\n\n \n\n\n \n\n\n(58.4\n\n\n)\n\n\n \n\n\n \n\n\n(60.8\n\n\n)%\n\n\n \n\n\n \n\n\n2.1\n\n\n%\n\n\n \n\n\n \n\n\n6.3\n\n\n%\n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n \n\n\n19.5\n\n\n \n\n\n \n\n\n \n\n\n41.2\n\n\n \n\n\n \n\n\n \n\n\n(21.7\n\n\n)\n\n\n \n\n\n \n\n\n(52.7\n\n\n)%\n\n\n \n\n\n \n\n\n1.1\n\n\n%\n\n\n \n\n\n \n\n\n2.7\n\n\n%\n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n18.1\n\n\n \n\n\n \n\n\n$\n\n\n54.8\n\n\n \n\n\n \n\n\n$\n\n\n(36.7\n\n\n)\n\n\n \n\n\n \n\n\n(67.0\n\n\n)%\n\n\n \n\n\n \n\n\n1.0\n\n\n%\n\n\n \n\n\n \n\n\n3.6\n\n\n%\n\n\n\n\n\n\n \n\n\n \n36\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nRevenue\n. The following table sets forth certain information regarding our revenues for the periods presented:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\nPercentage change in revenue\n\n\n \n\n\n \n\n\nImpact of\nchanges in\nforeign\ncurrency (a)\n\n\n \n\n\n \n\n\nPercentage change in revenue on a constant currency basis (a)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2024 vs. 2023\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n2024 vs. 2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRecurring revenue:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDayforce recurring, excluding float\n\n\n \n\n\n$\n\n\n1,159.7\n\n\n \n\n\n \n\n\n$\n\n\n962.9\n\n\n \n\n\n \n\n\n \n\n\n20.4\n\n\n%\n\n\n \n\n\n \n\n\n(0.3\n\n\n)%\n\n\n \n\n\n \n\n\n20.7\n\n\n%\n\n\n\n\n\n\nDayforce float\n\n\n \n\n\n \n\n\n180.2\n\n\n \n\n\n \n\n\n \n\n\n148.2\n\n\n \n\n\n \n\n\n \n\n\n21.6\n\n\n%\n\n\n \n\n\n \n\n\n(0.3\n\n\n)%\n\n\n \n\n\n \n\n\n21.9\n\n\n%\n\n\n\n\n\n\nTotal Dayforce recurring\n\n\n \n\n\n \n\n\n1,339.9\n\n\n \n\n\n \n\n\n \n\n\n1,111.1\n\n\n \n\n\n \n\n\n \n\n\n20.6\n\n\n%\n\n\n \n\n\n \n\n\n(0.2\n\n\n)%\n\n\n \n\n\n \n\n\n20.8\n\n\n%\n\n\n\n\n\n\nPowerpay recurring, excluding float\n\n\n \n\n\n \n\n\n83.7\n\n\n \n\n\n \n\n\n \n\n\n81.9\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n%\n\n\n \n\n\n \n\n\n(1.6\n\n\n)%\n\n\n \n\n\n \n\n\n3.8\n\n\n%\n\n\n\n\n\n\nPowerpay float\n\n\n \n\n\n \n\n\n18.8\n\n\n \n\n\n \n\n\n \n\n\n18.4\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n%\n\n\n \n\n\n \n\n\n(1.6\n\n\n)%\n\n\n \n\n\n \n\n\n3.8\n\n\n%\n\n\n\n\n\n\nTotal Powerpay recurring\n\n\n \n\n\n \n\n\n102.5\n\n\n \n\n\n \n\n\n \n\n\n100.3\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n%\n\n\n \n\n\n \n\n\n(1.6\n\n\n)%\n\n\n \n\n\n \n\n\n3.8\n\n\n%\n\n\n\n\n\n\nTotal Cloud recurring\n\n\n \n\n\n \n\n\n1,442.4\n\n\n \n\n\n \n\n\n \n\n\n1,211.4\n\n\n \n\n\n \n\n\n \n\n\n19.1\n\n\n%\n\n\n \n\n\n \n\n\n(0.3\n\n\n)%\n\n\n \n\n\n \n\n\n19.4\n\n\n%\n\n\n\n\n\n\nOther recurring (b)\n\n\n \n\n\n \n\n\n74.9\n\n\n \n\n\n \n\n\n \n\n\n85.9\n\n\n \n\n\n \n\n\n \n\n\n(12.8\n\n\n)%\n\n\n \n\n\n \n\n\n(0.7\n\n\n)%\n\n\n \n\n\n \n\n\n(12.1\n\n\n)%\n\n\n\n\n\n\nTotal recurring revenue\n\n\n \n\n\n \n\n\n1,517.3\n\n\n \n\n\n \n\n\n \n\n\n1,297.3\n\n\n \n\n\n \n\n\n \n\n\n17.0\n\n\n%\n\n\n \n\n\n \n\n\n(0.3\n\n\n)%\n\n\n \n\n\n \n\n\n17.3\n\n\n%\n\n\n\n\n\n\nProfessional services and other (c)\n\n\n \n\n\n \n\n\n242.7\n\n\n \n\n\n \n\n\n \n\n\n216.4\n\n\n \n\n\n \n\n\n \n\n\n12.2\n\n\n%\n\n\n \n\n\n \n\n\n(0.3\n\n\n)%\n\n\n \n\n\n \n\n\n12.5\n\n\n%\n\n\n\n\n\n\nTotal revenue\n\n\n \n\n\n$\n\n\n1,760.0\n\n\n \n\n\n \n\n\n$\n\n\n1,513.7\n\n\n \n\n\n \n\n\n \n\n\n16.3\n\n\n%\n\n\n \n\n\n \n\n\n(0.4\n\n\n)%\n\n\n \n\n\n \n\n\n16.7\n\n\n%\n\n\n\n\n\n\n \n\n\n(a)\nWe have calculated the percentage change in revenue on a constant currency basis by applying the average foreign exchange rate in effect during the comparable prior period. Please refer to the \n\"Non-GAAP Financial Measures\"\n section for discussion of percentage change in revenue on a constant currency basis.\n\n\n(b)\nFloat attributable to Other recurring was $1.3 million and $2.1 million for the years ended December 31, 2024, and 2023, respectively. \n\n\n(c)\nFor the year ended December 31, 2024, Professional services and other consisted of $233.8 million, $8.5 million, and $0.4 million associated with Dayforce, Other, and Powerpay, respectively. For the year ended December 31, 2023, Professional services and other consisted of $202.1 million, $13.8 million, and $0.5 million associated with Dayforce, Other, and Powerpay, respectively.\n\n\nTotal revenue increased $246.3 million, or 16.3%, to $1,760.0 million for the year ended December 31, 2024, compared to $1,513.7 million for the year ended December 31, 2023. This increase was primarily driven by an increase in the number of live Dayforce customers, the increase in Dayforce recurring revenue per customer, and the increase in float revenue of $31.6 million. The number of live Dayforce customers increased 7.6% to 6,876 at December 31, 2024 from 6,393 at December 31, 2023, representing approximately 7.62 million global employees. Additionally for the trailing twelve months ended December 31, 2024, Dayforce recurring revenue per customer grew to $163,101 compared to $146,771 for the comparable period in 2023. \n \nPlease refer to the \n\"\nHow We Assess Performance\n\"\n and \n“\nNon-GAAP Financial Measures\n”\n section for discussion of and the definition of Dayforce recurring revenue per customer.\n\n\nThe increase in float revenue was driven by the 8.4% increase in average float balance for our customer funds for the year ended December 31, 2024, which increased to $4.88 billion, compared to $4.50 billion for the year ended December 31, 2023, in addition to an increase in average yield of 35 basis points compared to the year ended December 31, 2023.\n\n\nCost of revenue\n. Total cost of revenue for the year ended December 31, 2024, was $947.9 million, an increase of $80.7 million, or 9.3%, compared to the year ended December 31, 2023.\n\n\nRecurring cost of revenue increased by $27.8 million, or 8.6%, for the year ended December 31, 2024, compared to the year ended December 31, 2023. The increase was primarily due to $16.9 million of certain additional labor-related costs, including increases in consulting, contract labor, employee labor, and employee benefits, and $11.4 million of increased costs related to software fees and the cost of hosting our applications to support the growing Dayforce customer base globally. These increases were partially offset by a reduction of $3.4 million in share-based compensation expense.\n\n\n \n37\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nProfessional services and other cost of revenue increased $25.4 million, or 9.6%, for the year ended December 31, 2024, compared to the year ended December 31, 2023, primarily due to $24.0 million of additional labor-related costs, including increases in consulting, contract labor, employee labor, and employee benefits, incurred to implement new customers and additional modules.\n\n\nProduct development and management expense increased $13.9 million, or 6.6%, for the year ended December 31, 2024, compared to the year ended December 31, 2023. The increase reflects increased costs of $7.7 million in hosting our development applications, and an additional $5.1 million of additional labor-related costs.\n \n\n\nFor the years ended December 31, 2024, and 2023, our investment in software development was $213.1 million and $198.5 million, respectively, consisting of $123.0 million and $112.0 million of research and development expense, and $90.1 million and $86.5 million of capitalized software development, respectively. Please refer to \nPart II, Item 8, Note 2, “Summary of Significant Accounting Policies,”\n for further discussion of our accounting policy for capitalizing internally developed software costs.\n\n\nDepreciation and amortization expense associated with cost of revenue increased by $13.6 million, or 20.4%, for the year ended December 31, 2024, compared to the year ended December 31, 2023, as we continue to capitalize and subsequently amortize Dayforce-related and other development costs.\n \n\n\nGross profit and gross margin.\n The following table presents total gross margin and solution gross margins for the periods presented:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nTotal gross margin\n\n\n \n\n\n \n\n\n46.1\n\n\n%\n\n\n \n\n\n \n\n\n42.7\n\n\n%\n\n\n\n\n\n\nGross margin by solution:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCloud recurring\n\n\n \n\n\n \n\n\n78.9\n\n\n%\n\n\n \n\n\n \n\n\n77.0\n\n\n%\n\n\n\n\n\n\nOther recurring\n\n\n \n\n\n \n\n\n34.6\n\n\n%\n\n\n \n\n\n \n\n\n46.0\n\n\n%\n\n\n\n\n\n\nProfessional services and other\n\n\n \n\n\n \n\n\n(19.9\n\n\n)%\n\n\n \n\n\n \n\n\n(22.7\n\n\n)%\n\n\n\n\n\n\n \n\n\nTotal gross margin is defined as total gross profit as a percentage of total revenue, which is inclusive of product development and management costs, as well as depreciation and amortization associated with cost of revenue. Gross margin for each solution in the table above is defined as total revenue less cost of revenue for the applicable solution as a percentage of total revenue for that related solution, which is exclusive of any product development and management or depreciation and amortization cost allocations.\n\n\nTotal gross margin for the year ended December 31, 2024 increased 340 basis points compared to December 31, 2023, and gross profit increased by $165.6 million, or 25.6%, for the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase in gross margin and gross profit was primarily due to the increase in revenue, including float revenue, which outpaced the increase in cost of revenue.\n\n\nCloud recurring gross margin was 78.9% for the year ended December 31, 2024, compared to 77.0% for the year ended December 31, 2023. The increase in Cloud recurring gross margin was primarily due to the increase in revenue, including float revenue, and due to the growth of the proportion of Dayforce customers live for more than two years, which increased from 85% as of December 31, 2023 to 87% as of December 31, 2024.\n\n\nProfessional services and other gross margin improved to (19.9)% for the year ended December 31, 2024, compared to (22.7)% for the year ended December 31, 2023.\n\n\nSelling and marketing expense.\n Selling and marketing expense increased $91.8 million, or 36.7%, for the year ended December 31, 2024, compared to the year ended December 31, 2023. The increase in selling and marketing expense was mainly attributable to a $60.9 million increase in labor and benefit expenses, including shared-based compensation, commissions, severance, bonus and consulting and contract labor as well as an increase of $20.1 million in advertising expenses, travel, and meetings. The increase in advertising expenses was primarily related to the transition of the Company's name change to Dayforce, Inc. and the related branding campaign.\n\n\n \n38\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nGeneral and administrative expense.\n General and administrative expense increased $102.8 million, or 39.1%, for the year ended December 31, 2024, compared to the year ended December 31, 2023. The increase in general and administrative expense was primarily driven by an increase of $59.5 million in amortization of intangible assets, primarily related to the Ceridian trade name, and $41.4 million of increases in various expense categories, including share-based compensation, labor and benefits, external labor, the remeasurement of the DataFuzion contingent consideration, and bad debt expense, all of which were generally consistent with the overall growth of our business.\n\n\nOperating profit (loss).\n Operating profit for the year ended December 31, 2024, was $104.1 million, compared to $133.1 million for the year ended December 31, 2023. Operating profit decreased due to increases in amortization expense, personnel-related costs and selling and marketing expenses, partially offset by gross margin expansion.\n\n\nInterest income.\n Interest income was $18.1 million and $20.2 million for the year ended December 31, 2024, and 2023, respectively. The decrease was primarily due to lower invested balances during the period as a result of the use of cash for the acquisition of eloomi in 2024.\n\n\nInterest expense.\n Interest expense was $58.7 million and $56.3 million for the year ended December 31, 2024, and 2023, respectively. The increase was primarily due to a $4.3 million loss on debt extinguishment recognized during the year ended December 31, 2024 related to the refinancing of certain credit agreements. Please refer to \nPart I, Item 1, Note 10, \"Debt\"\n for additional information.\n\n\nOther expense, net.\n For the years ended December 31, 2024 and 2023, other expense, net of $25.9 million and $1.0 million, respectively, was primarily comprised of foreign currency translation losses (gains) of $14.1 million and ($0.5) million, respectively, and net periodic pension expense of $11.5 million and $1.5 million, respectively.\n\n\nIncome tax expense.\n For the years ended December 31, 2024 and 2023, income tax expense was $19.5 million and $41.2 million, respectively. The $21.7 million decrease in tax expense was primarily due to decreases of $18.3 million of valuation allowances and $12.3 million of current operations, partially offset by an increase of $10.8 million related to the U.S. Global Intangible Low Tax Income regime. We record a valuation allowance to reduce our deferred tax assets to reflect the net deferred tax assets that we believe will be realized. As of December 31, 2024, we will continue to record a valuation allowance against certain deferred tax assets including state net operating loss carryovers and tax basis intangibles.\n\n\nNet income.\n Net income was $18.1 million for the year ended December 31, 2024, compared to $54.8 million for the year ended December 31, 2023. Net income declined primarily due to a decrease in operating profit and an increase in other expense, net, partially offset by lower income tax expense.\n\n\n \n39\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nLiquidity and Capital Resources\n \n\n\nOur primary sources of liquidity are our existing cash and equivalents, cash provided by operating activities, availability under our 2024 Revolving Credit Facility and the Receivables Securitization Program, and proceeds from debt issuances and equity offerings. As of December 31, 2024, we had cash and equivalents of $579.7 million and our total debt balance was $1,228.3 million. Please refer to \nPart II, Item 8, Note 10, “Debt,”\n to our consolidated financial statements and \n“Our Indebtedness”\n section below for further information on our debt.\n\n\nOur primary liquidity needs are related to funding of general business requirements, including the payment of interest and principal on our debt, capital expenditures, fulfilling our contractual commitments, product development, funding Dayforce Wallet on-demand pay requests on behalf of our customers, and executing purchases under our share repurchase program. From time to time, we have made investments in businesses or acquisitions of companies, which are also liquidity needs.\n\n\nWe believe that our cash flow from operations, available cash and equivalents, and availability under our 2024 Revolving Credit Facility and the Receivables Securitization Program will be sufficient to meet our liquidity needs for the next twelve months and for the foreseeable future. Dayforce Wallet on-demand pay requests are currently funded from our operating cash balances and as needed, through our Receivables Securitization Program, until they are reimbursed by our customers through their normal payroll funding cycles. We evaluate the creditworthiness of each customer for the Dayforce Wallet feature. We anticipate that to the extent that we require additional liquidity, it will be funded through the issuance of equity, the incurrence of additional indebtedness, or a combination thereof. We cannot provide assurance that we will be able to obtain this additional liquidity on reasonable terms, or at all. Additionally, our liquidity and our ability to meet our obligations and to fund our capital requirements, Dayforce Wallet on-demand pay requests, and share repurchases are also dependent on our future financial performance, which is subject to general economic, financial, and other factors that are beyond our control. Accordingly, we cannot provide assurance that our business will generate sufficient cash flow from operations or that future borrowings will be available from additional indebtedness or otherwise to meet our liquidity needs. If we decide to pursue one or more significant acquisitions, we may incur additional debt or sell additional equity to finance such acquisitions, which would result in additional expenses and/or dilution.\n\n\nOur customer funds are held and invested with the primary objectives being to protect the principal balance and to ensure adequate liquidity to meet cash flow requirements. The customer assets are held in segregated accounts intended for the specific purpose of satisfying customer funding obligations and therefore are not freely available for our general business use. Please refer to \nPart II, Item 8, Note 5, \"Customer Funds,\"\n for further discussion of these funds.\n\n\nCash Flows\n\n\nChanges in cash flows due to purchases of customer fund marketable securities and proceeds from the sale or maturity of customer fund marketable securities, as well as the carrying value of customer fund accounts as of period end dates can vary significantly due to several factors, including the specific day of the week the period ends, which impacts the timing of funds collected from customers and payments made to satisfy customer obligations to employees, taxing authorities, and others. The customer funds are fully segregated from our operating cash accounts and are evaluated and tracked separately by management. The table below summarizes the activity within the consolidated statements of cash flows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nNet cash provided by operating activities\n\n\n \n\n\n$\n\n\n281.1\n\n\n \n\n\n \n\n\n$\n\n\n219.5\n\n\n \n\n\n\n\n\n\nNet cash used in investing activities\n\n\n \n\n\n \n\n\n(471.9\n\n\n)\n\n\n \n\n\n \n\n\n(202.8\n\n\n)\n\n\n\n\n\n\nNet cash provided by financing activities\n\n\n \n\n\n \n\n\n59.6\n\n\n \n\n\n \n\n\n \n\n\n242.0\n\n\n \n\n\n\n\n\n\nEffect of exchange rate changes on cash, restricted cash, and equivalents\n\n\n \n\n\n \n\n\n(36.3\n\n\n)\n\n\n \n\n\n \n\n\n11.5\n\n\n \n\n\n\n\n\n\nNet (decrease) increase in cash, restricted cash, and equivalents\n\n\n \n\n\n \n\n\n(167.5\n\n\n)\n\n\n \n\n\n \n\n\n270.2\n\n\n \n\n\n\n\n\n\nCash, restricted cash, and equivalents at beginning of period\n\n\n \n\n\n \n\n\n3,421.4\n\n\n \n\n\n \n\n\n \n\n\n3,151.2\n\n\n \n\n\n\n\n\n\nCash, restricted cash, and equivalents at end of period\n\n\n \n\n\n \n\n\n3,253.9\n\n\n \n\n\n \n\n\n \n\n\n3,421.4\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash and equivalents\n\n\n \n\n\n \n\n\n579.7\n\n\n \n\n\n \n\n\n \n\n\n570.3\n\n\n \n\n\n\n\n\n\nRestricted cash and equivalents\n\n\n \n\n\n \n\n\n2,674.2\n\n\n \n\n\n \n\n\n \n\n\n2,851.1\n\n\n \n\n\n\n\n\n\nTotal cash, restricted cash, and equivalents\n\n\n \n\n\n$\n\n\n3,253.9\n\n\n \n\n\n \n\n\n$\n\n\n3,421.4\n\n\n \n\n\n\n\n\n\n \n\n\n \n40\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nOperating Activities\n \n\n\nNet cash provided by operating activities was $281.1 million during the year ended December 31, 2024, compared to $219.5 million during the year ended December 31, 2023. For both periods, cash inflows from operating activities were primarily generated from the subscriptions of our solutions.\n \n\n\nCash outflows from operating activities for both periods are primarily comprised of personnel-related expenditures, including the payout of year-end employee compensation, and the renewals of prepaid annual contracts that are integral to our business operations. The net positive cash inflow in both periods is primarily due to our growing revenue, partially offset by our operating costs, mainly, investment in our sales force to support our growth initiatives and our product development and management costs which are not eligible for capitalization.\n\n\nInvesting Activities\n\n\nDuring the year ended December 31, 2024, net cash used in investing activities was $471.9 million, primarily consisting of  purchases of customer funds marketable securities of $541.1 million, acquisition costs, net of cash acquired, of $173.1 million, capital expenditures of $109.6 million, and purchases of marketable securities of $16.2 million, partially offset by proceeds from the sale and maturity of customer funds marketable securities of $353.4 million and proceeds from the sale and maturity of marketable securities of $14.7 million. Our capital expenditures included $95.3 million for software and technology and $14.3 million for property, plant and equipment.\n\n\nDuring the year ended December 31, 2023, net cash used in investing activities was $202.8 million, primarily consisting of purchases of customer funds marketable securities of $528.1 million, capital expenditures of $114.4 million, and purchases of marketable securities of $6.8 million, partially offset by proceeds from the sale and maturity of customer funds marketable securities of $445.5 million and proceeds from the sale and maturity of marketable securities of $2.0 million. Our capital expenditures included $95.4 million for software and technology and $19.0 million for property, plant and equipment.\n\n\nFinancing Activities\n \n\n\nNet cash provided by financing activities was $59.6 million during the year ended December 31, 2024. This cash inflow was primarily attributable to the increase in proceeds from our debt issuance of $650.0 million, proceeds from the issuance of common stock under our share-based compensation plans of $56.6 million, and the net increase in our customer funds obligations of $51.8 million, partially offset by payments on our long-term debt obligations of $648.3 million, repurchases of common stock of $36.1 million, payment of debt refinancing costs of $11.4 million, and payment of contingent consideration of $3.0 million.\n\n\nNet cash provided by financing activities was $242.0 million during the year ended December 31, 2023. This cash inflow was primarily attributable to the net increase in our customer funds obligations of $200.9 million and proceeds from the issuance of common stock under our share-based compensation plans of $49.0 million, partially offset by payments on our long-term debt obligations of $7.9 million.\n\n\nBacklog and Seasonality\n\n\nBacklog is equivalent to our remaining performance obligations, which represents contracted revenue for recurring and fixed price professional services, primarily implementation services, that has not yet been recognized, including deferred revenue and unbilled amounts that will be recognized as revenue in future periods. As of December 31, 2024, approximately $1.26 billion of revenue is expected to be recognized over the next three years from remaining performance obligations.\n\n\nFor a discussion of seasonality, please refer to \nPart 1, Item I, “Business”\n of this Form 10-K.\n \n\n\nOur In\ndebtedness\n\n\nOur primary liquidity needs are related to funding of general business requirements, including the payment of interest and principal on our debt, capital expenditures, fulfilling our contractual commitments, product development, funding Dayforce Wallet on-demand pay requests on behalf of our customers, and executing purchases under our share repurchase program. From time to time, we have made investments in businesses or acquisitions of companies, which are also liquidity needs. We believe our current sources of liquidity will be sufficient to meet our liquidity needs for the foreseeable future. We anticipate that to the extent that we require additional liquidity, it will be funded through the issuance of equity, the incurrence of additional indebtedness, or a combination thereof.\n\n\n \n41\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\n2024 Senior Secured Credit Facility\n\n\nOn February 29, 2024, we completed the refinancing of our 2018 Senior Secured Credit Facility by entering into a new credit agreement. Pursuant to the terms of the credit agreement, we became borrower of the 2024 Senior Secured Credit Facility, consisting of the 2024 Term Debt in the original principal amount of $650.0 million and the 2024 Revolving Credit Facility of $350.0 million. The 2024 Revolving Credit Facility may, at our option, be made available in U.S. Dollars, Canadian Dollars, Euros and/or Pounds Sterling; up to $100.0 million may, at our option, be made available for letters of credit and $100.0 million may, at our option, be made available for swingline loans (denominated in Canadian Dollars and/or U.S. Dollars).\n\n\nThe 2024 Term Debt and 2024 Revolving Credit Facility will mature on March 1, 2031 and March 1, 2029, respectively. We are required to make annual amortization payments in respect of the 2024 Term Debt, payable in equal quarterly installments of 0.25% of the aggregate principal amount of all initial term loans outstanding at closing. The 2024 Term Debt bears interest at rates based upon, at our option, either (i) a base rate plus an applicable percentage of 1.5% or (ii) a term Secured Overnight Financing Rate (\"SOFR\") plus an applicable percentage of 2.5%. In February 2025, we completed an amendment to the 2024 Senior Secured Credit Facility, which resulted in a reduction of the Term Debt base rate applicable percentage to 1.0% and the SOFR applicable percentage to 2.0%. The 2024 Revolving Credit Facility does not require amortization payments.\n\n\nConvertible Senior Notes\n\n\nIn March 2021, we issued $575.0 million in aggregate principal amount of 0.25% Convertible Senior Notes due in March 2026. The total net proceeds from the offering, after deducting initial purchase discounts and issuance costs, were $561.8 million. In connection with the Convertible Senior Notes, we entered into capped call transactions which are expected to reduce the potential dilution of our common stock upon any conversion of the Convertible Senior Notes and/or offset any cash payments we could be required to make in excess of the principal amount of converted Notes. We used an aggregate amount of $45.0 million of the net proceeds of the Convertible Senior Notes to purchase the Capped Calls. We used the remainder of the net proceeds from the offering (i) to repay $295.0 million principal amount under the 2018 Revolving Credit Facility and pay related accrued interest and (ii) for general corporate purposes. We expect to retire the Convertible Senior Notes upon maturity in March 2026 with cash and liquidity on hand.\n\n\nFor an additional description of the 2024 Senior Secured Credit Facility and the Senior Convertible Notes, please refer to \nPart II, Item 8, Note 10, “Debt,”\n to our consolidated financial statements.\n\n\nContractual Obligations\n\n\nOur future contractual obligations generally consist of long-term debt, leases, retirement plans, and vendor payments. Our long-term debt obligations are described in \nPart II, Item 8, Note 10, “Debt,”\n to our consolidated financial statements, and the \n“Our Indebtedness”\n section above.\n\n\nAs of December 31, 2024, all of our facilities are leased. Most of these leases contain renewal options and require payments for taxes, insurance, and maintenance. We also lease equipment for use in our business. Refer to \nPart II, Item 8, Note 7, \"Leases,\"\n to our consolidated financial statements for additional discussion of our leases.\n\n\nThe U.S. defined benefit plans were terminated with an effective date of September 30, 2024. We are in the process of finalizing the wind down of the plans, which includes transferring the associated liabilities to an insurance company, which we expect will be completed in 2025. These steps include settling all future obligations under our defined pension plans through a combination of lump sum payments to eligible, electing participants and the transfer of any remaining benefits to a third-party insurance company through a group annuity contract.\n\n\nPayments of retirement plan obligations include employer commitments to fund our defined benefit and postretirement plans and do not include estimated future benefit payments to participants expected to be made from liquidation of the assets in our defined benefit plan trusts. As of December 31, 2024, our defined benefit pension plans had a projected benefit obligation (\"PBO\") that exceeded the fair value of the plans’ assets by $24.5 million and our postretirement benefit plan had a PBO that exceeded the fair value of the plans’ assets by $6.9 million.\n\n\nRefer to \nPart II, Item 8, Note 11, \"Employee Benefit Plans,\"\n to our consolidated financial statements for additional discussion of our employee benefit plans.\n\n\nThe amount of our future contractual obligations to vendors as of December 31, 2024 was not material.\n\n\n \n42\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nCritical Accounting Policies and Estimates\n \n\n\nOur discussion and analysis of our financial condition and results of operations is based upon our consolidated financial statements and related notes, which have been prepared in accordance with GAAP. The preparation of these financial statements and related notes requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue, and expenses. Certain of our accounting policies require the application of significant judgment by management in selecting the appropriate assumptions for calculating financial estimates. By their nature, these judgments are subject to an inherent degree of uncertainty. These judgments are based on our historical experience, terms of existing contracts, our evaluation of trends in the industry, information provided by our customers, and information available from other outside sources, as appropriate. We evaluate our estimates and judgments on an on-going basis. Our actual results may differ from these estimates. We believe the following is our critical accounting estimate:\n\n\nRevenue Recognition\n\n\nDescription:\n We recognize revenue for professional services and Cloud subscription services performance obligations based on an allocation of the total transaction price to each performance obligation using the respective stand-alone selling prices (“SSP”). This can result in revenue being recognized in an amount that exceeds the amount we are contractually allowed to bill our customer as of a certain point in time, resulting in the recognition of a contract asset up until the period at which billings are equal to or exceed revenue recognition. We recognized $234.2 million of Cloud professional services revenue for the year ended December 31, 2024, and the related contract assets were $100.2 million as of December 31, 2024.\n\n\nJudgments and Uncertainties:\n The determination of our stand-alone selling price for the performance obligations requires us to make assumptions based on market conditions and observable inputs, as well as an estimate of the total professional service hours expected to be incurred in connection with each customer implementation.\n\n\nSensitivity of Estimate to Change: \nThe consideration allocated to professional services performed to activate a new customer is recognized as professional services revenues based on the proportion of total work performed to date compared to an estimation of total work expected to complete the implementation project for that customer account. To the extent this consideration exceeds the customer billings, a contract asset would be recognized, as professional services revenue related to implementation activities is generally recognized at the beginning of the contract.\n\n\nPlease refer to \nPart II, Item 8, Note 2, “Summary of Significant Accounting Policies,”\n for a description of our revenue recognition policy and our significant accounting policies.\n\n\nRecently Issued Accounting Pronouncements\n \n\n\nPlease refer to \nPart II, Item 8, Note 2, “Summary of Significant Accounting Policies,”\n for a full discussion of recent accounting pronouncements.\n \n\n\n \n43\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nNon-GA\nAP Financial Measures\n\n\nWe use certain non-GAAP financial measures in this document including:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNon-GAAP Financial Measure\n\n\n \n\n\nGAAP Financial Measure\n\n\n\n\n\n\nEBITDA\n\n\n \n\n\nNet income (loss)\n\n\n\n\n\n\nAdjusted EBITDA\n\n\n \n\n\nNet income (loss)\n\n\n\n\n\n\nAdjusted EBITDA margin\n\n\n \n\n\nNet profit margin\n\n\n\n\n\n\nAdjusted Cloud recurring gross margin\n\n\n \n\n\nCloud recurring gross margin\n\n\n\n\n\n\nAdjusted operating profit\n\n\n \n\n\nOperating profit\n\n\n\n\n\n\nAdjusted operating profit margin\n\n\n \n\n\nOperating profit margin\n\n\n\n\n\n\nAdjusted net income\n\n\n \n\n\nNet income (loss)\n\n\n\n\n\n\nAdjusted net profit margin\n\n\n \n\n\nNet profit margin\n\n\n\n\n\n\nAdjusted diluted net income per share\n\n\n \n\n\nDiluted net income (loss) per share\n\n\n\n\n\n\nFree cash flow\n\n\n \n\n\nNet cash provided by operating activities\n\n\n\n\n\n\nFree cash flow margin\n\n\n \n\n\nOperating cash flow margin\n\n\n\n\n\n\nPercentage change in revenue, including total revenue and revenue by solution, on a constant currency basis\n\n\n \n\n\nPercentage change in revenue, including total revenue and revenue by solution\n\n\n\n\n\n\nCloud annualized retention rate\n\n\n \n\n\nNo directly comparable GAAP measure\n\n\n\n\n\n\nDayforce revenue retention rate\n\n\n \n\n\nNo directly comparable GAAP measure\n\n\n\n\n\n\nDayforce recurring revenue per customer\n\n\n \n\n\nNo directly comparable GAAP measure\n\n\n\n\n\n\nWe believe that these non-GAAP financial measures are useful to management and investors as supplemental measures to evaluate our overall operating performance including comparison across periods and with competitors. Our management team uses these non-GAAP financial measures to assess operating performance because these financial measures exclude the results of decisions that are outside the normal course of our business operations, and are used for internal budgeting and forecasting purposes both for short- and long-term operating plans. Additionally, Adjusted EBITDA is a component of our management incentive plan and Adjusted operating profit and Adjusted Cloud recurring gross margin are components of certain performance based equity awards for our named executive officers. Additionally, we  believe that the non-GAAP financial measure free cash flow is meaningful to investors because it is a measure of liquidity that provides useful information in understanding and evaluating the strength of our liquidity and future ability to generate cash that can be used for strategic opportunities or investing in our business. The exclusion of capital expenditures facilitates comparisons of our liquidity on a period-to-period basis and excludes items that management does not consider to be indicative of our liquidity.\n\n\nThese non-GAAP financial measures are not required by, defined under, or presented in accordance with, GAAP, and should not be considered as alternatives to our results as reported under GAAP, have important limitations as analytical tools, and our use of these terms may not be comparable to similarly titled measures of other companies in our industry. Our presentation of non-GAAP financial measures should not be construed to imply that our future results will be unaffected by similar items to those eliminated in this presentation.\n\n\nWe define our non-GAAP financial measures as follows:\n \n\n\n•\nEBITDA is net income (loss) before interest, taxes, depreciation, and amortization, and Adjusted EBITDA is EBITDA, as adjusted to exclude share-based compensation expense and related employer taxes, and certain other items.\n\n\n•\nAdjusted EBITDA margin is determined by calculating the percentage that Adjusted EBITDA is of total revenue.\n\n\n•\nAdjusted Cloud recurring gross margin is defined as Cloud recurring gross margin, as adjusted to exclude share-based compensation and related employer taxes, and certain other items, as a percentage of total Cloud recurring revenue.\n\n\n•\nAdjusted operating profit is defined as operating profit (loss), as adjusted to exclude share-based compensation expense and related employer taxes, amortization of acquisition-related intangible assets, and certain other items.\n\n\n•\nAdjusted operating profit margin is determined by calculating the percentage that Adjusted operating profit is of total revenue.\n\n\n \n44\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\n•\nAdjusted net income is defined as net income (loss), as adjusted to exclude share-based compensation expense and related employer taxes, amortization of acquisition-related intangible assets, and certain other items, all of which are adjusted for the effect of income taxes.\n\n\n•\nAdjusted net profit margin is determined by calculating the percentage that Adjusted net income is of total revenue.\n\n\n•\nAdjusted diluted net income per share is calculated by dividing adjusted net income by diluted weighted average common shares outstanding. When adjusted diluted net income per share is positive, diluted weighted average common shares outstanding incorporate the effect of dilutive equity instruments.\n\n\n•\nFree cash flow is defined as net cash provided by operating activities, as adjusted to exclude capital expenditures.\n\n\n•\nFree cash flow margin is determined by calculating the percentage that free cash flow is of total revenue.\n\n\n•\nPercentage change in revenue, including total revenue and revenue by solution, on a constant currency basis is calculated by applying the average foreign exchange rate in effect during the comparable prior period.\n\n\n•\nCloud ARR is calculated by starting with recurring revenue at year end, excluding revenue from Ascender and eloomi, subtracting the once-a-year charges, annualizing the revenue for customers live for less than a full year to reflect the revenue that would have been realized if the customer had been live for a full year, and adding back the once-a-year charges. We have not reconciled Cloud ARR because there is no directly comparable GAAP financial measure.\n\n\n•\nAnnual Dayforce revenue retention rate is calculated as a percentage, excluding Ascender and eloomi, where the numerator is the Dayforce ARR for the prior year, less the Dayforce ARR from lost Dayforce customers during that year; and the denominator is the Dayforce ARR for the prior year. We have not reconciled Annual Dayforce revenue retention rate because there is no directly comparable GAAP financial measure.\n\n\n•\nDayforce recurring revenue per customer is an indicator of the average size of Dayforce recurring revenue customers. To calculate Dayforce recurring revenue per customer, we start with Dayforce recurring revenue on a constant currency basis by applying the same exchange rate to all comparable periods for the trailing twelve months and excludes float revenue, and Ascender, ADAM HCM, and eloomi revenue. This amount is divided by the number of live Dayforce customers at the end of the trailing twelve month period, excluding Ascender, ADAM HCM, and eloomi. We have not reconciled the Dayforce recurring revenue per customer because there is no directly comparable GAAP financial measure.\n\n\n \n45\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nThe following tables reconcile our reported results to our non-GAAP financial measures:\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31, 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAs reported\n\n\n \n\n\n \n\n\nAs reported margins (a)\n\n\n \n\n\n \n\n\nShare-based\ncompensation\n\n\n \n\n\n \n\n\nAmortization\n\n\n \n\n\n \n\n\nOther (b)\n\n\n \n\n\n \n\n\nAs adjusted (b)\n\n\n \n\n\n \n\n\nAs adjusted margins (a)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(Dollars in millions, except per share data)\n\n\n \n\n\n\n\n\n\nCost of Cloud recurring revenue\n\n\n \n\n\n$\n\n\n303.7\n\n\n \n\n\n \n\n\n \n\n\n78.9\n\n\n%\n\n\n \n\n\n$\n\n\n11.3\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n1.0\n\n\n \n\n\n \n\n\n$\n\n\n291.4\n\n\n \n\n\n \n\n\n \n\n\n79.8\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating profit\n\n\n \n\n\n$\n\n\n104.1\n\n\n \n\n\n \n\n\n \n\n\n5.9\n\n\n%\n\n\n \n\n\n$\n\n\n156.6\n\n\n \n\n\n \n\n\n$\n\n\n120.0\n\n\n \n\n\n \n\n\n$\n\n\n29.8\n\n\n \n\n\n \n\n\n$\n\n\n410.5\n\n\n \n\n\n \n\n\n \n\n\n23.3\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n18.1\n\n\n \n\n\n \n\n\n \n\n\n1.0\n\n\n%\n\n\n \n\n\n$\n\n\n156.6\n\n\n \n\n\n \n\n\n$\n\n\n120.0\n\n\n \n\n\n \n\n\n$\n\n\n21.1\n\n\n \n\n\n \n\n\n$\n\n\n315.8\n\n\n \n\n\n \n\n\n \n\n\n17.9\n\n\n%\n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n40.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n40.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome tax expense (c)\n\n\n \n\n\n \n\n\n19.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(35.8\n\n\n)\n\n\n \n\n\n \n\n\n55.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n209.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n120.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n89.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n$\n\n\n288.0\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n156.6\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n56.9\n\n\n \n\n\n \n\n\n$\n\n\n501.5\n\n\n \n\n\n \n\n\n \n\n\n28.5\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income per share - diluted\n\n\n \n\n\n$\n\n\n0.11\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n0.98\n\n\n \n\n\n \n\n\n$\n\n\n0.75\n\n\n \n\n\n \n\n\n$\n\n\n0.13\n\n\n \n\n\n \n\n\n$\n\n\n1.97\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n(a)\nCloud recurring gross margin is defined as total Cloud recurring revenue less cost of Cloud recurring revenue as a percentage of total Cloud recurring revenue. Operating profit margin and net profit margin are determined by calculating the percentage operating profit and net income are of total revenue. Please refer above for additional information on the as adjusted margins.\n\n\n(b)\nThe as adjusted column is a non-GAAP financial measure, adjusted to exclude share-based compensation expense and related employer taxes, amortization of acquisition-related intangible assets, and certain other items. The adjustments to operating profit consist of $19.8 million of restructuring expenses, $9.0 million related to the impact of the fair value adjustment for the DataFuzion contingent consideration, and $1.0 million of fees associated with initiating the receivables securitization program. The adjustments to net income also include $14.2 million of foreign exchange loss, $12.9 million of costs associated with the planned termination of our frozen U.S. pension plan, and a $35.8 million net adjustment for the effect of income taxes related to these items.\n\n\n(c)\nIncome tax effects have been calculated based on the statutory tax rates in effect in the U.S. and foreign jurisdictions during the period.\n\n\n \n\n\n \n46\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31, 2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAs reported\n\n\n \n\n\n \n\n\nAs reported margins (a)\n\n\n \n\n\n \n\n\nShare-based\ncompensation\n\n\n \n\n\n \n\n\nAmortization\n\n\n \n\n\n \n\n\nOther (b)\n\n\n \n\n\n \n\n\nAs adjusted (b)\n\n\n \n\n\n \n\n\nAs adjusted margins (a)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(Dollars in millions, except per share data)\n\n\n \n\n\n\n\n\n\nCost of Cloud recurring revenue\n\n\n \n\n\n$\n\n\n278.5\n\n\n \n\n\n \n\n\n \n\n\n77.0\n\n\n%\n\n\n \n\n\n$\n\n\n15.4\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n263.1\n\n\n \n\n\n \n\n\n \n\n\n78.3\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating profit\n\n\n \n\n\n$\n\n\n133.1\n\n\n \n\n\n \n\n\n \n\n\n8.8\n\n\n%\n\n\n \n\n\n$\n\n\n137.1\n\n\n \n\n\n \n\n\n$\n\n\n60.5\n\n\n \n\n\n \n\n\n$\n\n\n9.1\n\n\n \n\n\n \n\n\n$\n\n\n339.8\n\n\n \n\n\n \n\n\n \n\n\n22.4\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n54.8\n\n\n \n\n\n \n\n\n \n\n\n3.6\n\n\n%\n\n\n \n\n\n$\n\n\n137.1\n\n\n \n\n\n \n\n\n$\n\n\n60.5\n\n\n \n\n\n \n\n\n$\n\n\n(13.7\n\n\n)\n\n\n \n\n\n$\n\n\n238.7\n\n\n \n\n\n \n\n\n \n\n\n15.8\n\n\n%\n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n36.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n36.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome tax expense (c)\n\n\n \n\n\n \n\n\n41.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(22.2\n\n\n)\n\n\n \n\n\n \n\n\n63.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n132.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n60.5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n72.0\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n$\n\n\n264.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n137.1\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n8.5\n\n\n \n\n\n \n\n\n$\n\n\n410.2\n\n\n \n\n\n \n\n\n \n\n\n27.1\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income per share - diluted\n\n\n \n\n\n$\n\n\n0.35\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n0.86\n\n\n \n\n\n \n\n\n$\n\n\n0.38\n\n\n \n\n\n \n\n\n$\n\n\n(0.09\n\n\n)\n\n\n \n\n\n$\n\n\n1.51\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n(a)\nCloud recurring gross margin is defined as total Cloud recurring revenue less cost of Cloud recurring revenue as a percentage of total Cloud recurring revenue. Operating profit margin and net profit margin are determined by calculating the percentage operating profit and net income are of total revenue. Please refer above for additional information on the as adjusted margins.\n\n\n(b)\nThe as adjusted column is a non-GAAP financial measure, adjusted to exclude share-based compensation expense and related employer taxes, amortization of acquisition-related intangible assets, and certain other items. The adjustments to operating profit consist of $4.7 million of restructuring expenses, $4.3 million related to the impact of the fair value adjustment for the DataFuzion contingent consideration, and $0.1 million related to the net impact of the abandonment of certain leased facilities. The adjustments to net income also include $0.6 million of foreign exchange gain and a $22.2 million net adjustment for the effect of income taxes related to these items.\n\n\n(c)\nIncome tax effects have been calculated based on the statutory tax rates in effect in the U.S. and foreign jurisdictions during the period.\n\n\n \n\n\nThe following table reconciles net cash provided by operating activities and operating cash flow margin to the non-GAAP financial measures free cash flow and free cash flow margin:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\n Net cash provided by operating activities\n\n\n \n\n\n$\n\n\n281.1\n\n\n \n\n\n \n\n\n$\n\n\n219.5\n\n\n \n\n\n\n\n\n\n Capital expenditures\n\n\n \n\n\n \n\n\n(109.6\n\n\n)\n\n\n \n\n\n \n\n\n(114.4\n\n\n)\n\n\n\n\n\n\n Free cash flow\n\n\n \n\n\n$\n\n\n171.5\n\n\n \n\n\n \n\n\n$\n\n\n105.1\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n Operating cash flow margin (a)\n\n\n \n\n\n \n\n\n16.0\n\n\n%\n\n\n \n\n\n \n\n\n14.5\n\n\n%\n\n\n\n\n\n\n Free cash flow margin (b)\n\n\n \n\n\n \n\n\n9.7\n\n\n%\n\n\n \n\n\n \n\n\n6.9\n\n\n%\n\n\n\n\n\n\n \n\n\n(a)\nOperating cash flow margin is determined by calculating the percentage that free cash flow is of total revenue.\n\n\n(b)\nFree cash flow margin is determined by calculating the percentage that free cash flow is of total revenue.\n\n\n \n47\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements",
  "item2": null
}