{
  "source_file": "day-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF \nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \nThe following is a discussion and analysis of our financial condition and results of operations as of, and for, the periods presented and should be read in conjunction with our unaudited condensed consolidated financial statements and notes thereto included elsewhere in this report and with our audited consolidated financial statements and notes thereto in our \n2024 Form 10-K\n. This discussion and analysis contains forward-looking statements, including statements about the Thoma Bravo Transaction, statements regarding industry outlook, our expectations for the future of our business, and our liquidity and capital resources as well as other non-historical statements. These statements are based on current expectations and are subject to numerous risks and uncertainties, including but not limited to the risks and uncertainties described in \nPart II, Item 1A, “Risk Factors”\n and \n“Cautionary Note Regarding Forward-Looking Statements.”\n Our actual results may differ materially from those contained in or implied by these forward-looking statements. Any reference to a “Note” in this discussion relates to the accompanying notes to the unaudited condensed consolidated financial statements included elsewhere in this report unless otherwise indicated.\nOverview\n \nDayforce, Inc. is a global human capital management (“HCM”) software company. We categorize our solutions into two categories: recurring services and professional services. Recurring services are generated from HCM solutions that are primarily delivered via two offerings: Dayforce, our flagship HCM platform, and Powerpay, a human resources (“HR”) and payroll solution for the Canadian small business market. Revenue from our recurring services solutions include investment income generated from holding customer funds, also referred to as float revenue or float.\nDayforce provides HR, payroll and tax, benefits, workforce management, and talent management functionality. Our platform is used by organizations of all sizes, from small businesses to global organizations, regardless of industry, to optimize management of the entire employee lifecycle, including attracting, hiring, engaging, paying, and developing their people. Dayforce was built as a single application from the ground up that combines a modern, consumer-grade user experience with proprietary application architecture, including a single employee record and a rules engine spanning all areas of HCM. Dayforce provides continuous real-time calculations across all modules to enable, for example, payroll administrators access to data through the entire pay period, and managers access to real-time data to optimize work schedules. Our platform is designed to drive efficiencies for our customers and their employees by improving HCM decision-making processes, streamlining workflows, revealing strategic organizational insights, and simplifying legislative compliance. The platform is designed to ease administrative work for both employees and managers, creating opportunities for companies to increase employee engagement. We sell Dayforce through our direct sales force on a subscription per-employee, per-month (\"PEPM\") basis. Our subscriptions are typically structured with an initial fixed term of between three and five years, with evergreen renewal thereafter.\nOur Business Model\n \nOur business model focuses on supporting the rapid growth of Dayforce and maximizing the lifetime value of our Dayforce customer relationships. Our ratable recognition of subscription revenues over the term of the subscription period combined with our high revenue retention rates yield a high level of visibility into our future revenues. The profitability of a customer depends, in large part, on how long they have been a customer. We estimate that it takes approximately two years before we are able to recover our implementation, customer acquisition, and other direct costs on a new Dayforce customer contract.\nOver the lifetime of the customer relationship, we have the opportunity to realize additional PEPM revenue, both as the customer grows or offers the Dayforce solution to additional employees, and also by selling additional functionality to existing customers that do not currently utilize all of the modules we offer. We also incur costs to manage the account, to retain customers, and to sell additional functionality, however, these costs are significantly less than the costs initially incurred to acquire and to take customers live.\nPending Transaction with Thoma Bravo\n \nAs previously announced, on August 20, 2025, we entered into the Merger Agreement under which, on the terms and subject to the conditions thereof, certain affiliates of Thoma Bravo will acquire Dayforce for $70.00 in cash per share of Dayforce common stock for a total enterprise value of approximately $12.3 billion. We expect to complete the Thoma Bravo Transaction in late 2025 or early 2026, subject to fulfillment of customary closing conditions, including approval of Dayforce stockholders and receipt of required regulatory approvals.\n\n\n \n28\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nIn connection with the Thoma Bravo Transaction, we incurred non-recurring acquisition and transaction fees of $22.2 million for the three and nine months ended September 30, 2025, which are included in general and administrative expense in the condensed consolidated statements of operations. These costs primarily include legal and advisory fees, and other acquisition-related costs. The completion of the Thoma Bravo Transaction is subject to the satisfaction or waiver or certain customary mutual closing conditions. For more information on these conditions, refer to Part II, Item 1A, “\nRisk Factors\n” of this Form 10-Q.\nIf the Thoma Bravo Transaction is consummated, our common stock will no longer be publicly listed and traded on the New York Stock Exchange, the common stock will be deregistered under the Exchange Act, we will no longer file periodic reports with the SEC, and Dayforce will become a privately-held company.\nU.S. Defined Benefit Plans Termination\nThe U.S. defined benefit plans were terminated with an effective date of September 30, 2024. In the third quarter of 2025, we settled the majority of future obligations under our U.S. pension plan through a combination of lump sum payments to eligible, electing participants and the transfer of any remaining benefits to a third-party insurance company through a group annuity contract. The partial plan termination was funded with plan assets of approximately $299 million. In connection with the plan termination, a non-cash loss of $172.1 million was recorded to other expense (income), net in the condensed consolidated statements of operations for the three and nine months ended September 30, 2025. During the fourth quarter of 2025, we expect to finalize the group annuity purchase in connection with the termination of our U.S. pension plan. The transaction is expected to be funded with approximately $14 million of plan assets and $5 million of cash, and we anticipate incurring an additional settlement loss of approximately $11 million.\nWe are also in the process of finalizing the wind down of the nonqualified defined benefit plan, which we expect will be completed in 2025.\nGlobal Events\n \nWe are closely monitoring changes in international trade relations, economic policies, and legislation and regulations, which could adversely impact the global economy and our operating results. Currently, we are not experiencing any material impact to our operating results as a result of the direct impact of tariffs on goods to certain countries from which we export hardware for our time clocks. However, prolonged changes and uncertainty in interest rates and foreign exchange rates, and shifts in the overall macroeconomic demand for our services could adversely impact our operating results.\nAdditionally, in July 2025, U.S. Congress enacted the OBBBA, which includes significant provisions, including tax cut extensions and modifications to the international tax framework. While we continue to evaluate the impact of these legislative changes as additional guidance becomes available, uncertainty remains regarding the timing and interpretation by tax authorities in affected jurisdictions. These legislative changes are expected to impact our future cash tax remittances, resulting from changes to tax deductibility rules for domestic research and development costs.\nAdditional discussion of the ways in which adverse economic and market conditions could affect our business, operating results, or financial condition is referenced below and contained in \nPart II, Item 1A, “Risk Factors”\n in this Form 10-Q and in Part I, Item 1A. \"Risk Factors” in our \n2024 Form 10-K\n.\nH\now We Assess Our Performance\n \nIn assessing our performance, we consider a variety of annual and quarterly performance indicators in addition to revenue and net (loss) income. Set forth below are descriptions of our quarterly key performance measures. Additional information on our annual performance measures is described in Part II, Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" under the heading \"How We Assess Our Performance\" contained in our \n2024 Form 10-K\n. Please refer to the \n\"Non-GAAP Financial Measures\"\n and \n“Results of Operations”\n \nsections below for further description and definitions of certain performance indicators which are considered non-GAAP financial measures.\n \nLive Dayforce Customers\n \nWe use the number of live Dayforce customers as an indicator of future revenue and the overall performance of the business and to assess the performance of our implementation services.\n \n\n\n \n29\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nDayforce Recurring Revenue Per Customer\nWe use Dayforce recurring revenue per customer, a non-GAAP financial measure, as an indicator of the average size of our Dayforce customer, which we believe is also useful to management and investors. We calculate and monitor Dayforce recurring revenue per customer on a quarterly basis. Our Dayforce recurring revenue per customer may fluctuate as a result of a number of factors, including the number of live Dayforce customers and the number of modules purchased by each customer.\nConstant Currency Revenue\nWe present percentage change in revenue on a constant currency basis, a non-GAAP financial measure, to assess how our underlying business performed, excluding the effect of foreign currency rate fluctuations, which we believe is useful to management and investors. The average U.S. dollar to Canadian dollar, Australian dollar, and Great British pound foreign exchange rates were $1.38, $1.53, and $0.74 for the three months ended September 30, 2025, respectively, compared to $1.36, $1.49, and $0.77 for the three months ended September 30, 2024, respectively. The average U.S. dollar to Canadian dollar, Australian dollar, and Great British pound foreign exchange rates were $1.40, $1.56, and $0.76 for the nine months ended September 30, 2025, respectively, compared to $1.36, $1.51, and $0.78 for the nine months ended September 30, 2024, respectively.\nAdjusted Operating Profit, Adjusted EBITDA, Adjusted EBITDA Margin, Free Cash Flow, and Free Cash Flow Margin\nWe believe that Adjusted operating profit, Adjusted EBITDA, Adjusted EBITDA margin, free cash flow, and free cash flow margin, non-GAAP financial measures, are useful to management and investors as supplemental measures to evaluate our overall operating performance. Adjusted operating profit, free cash flow, and free cash flow margin are components of certain management compensation plans, and these metrics are used by management to assess performance and to compare our operating performance to our competitors. Management believes that these non-GAAP financial measures are helpful in highlighting management performance trends because these metrics exclude the results of decisions that are outside the normal course of our business operations. Additionally, we believe that the non-GAAP financial measure free cash flow and free cash flow margin are meaningful to investors because they are measures of liquidity that provide useful information in understanding and evaluating the strength of our liquidity and future ability to generate cash that can be used for strategic opportunities or investing in our business. The reduction of capital expenditures facilitates comparisons of our liquidity on a period-to-period basis and excludes items that management does not consider to be indicative of our liquidity.\n\n\n \n30\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nResult\ns of Operations\nThree Months Ended September 30, 2025 Compared With Three Months Ended September 30, 2024\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30,\n\n\n \n\n\n \n\n\nIncrease/(Decrease)\n\n\n \n\n\n \n\n\nPercentage of Revenue\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRecurring services\n\n\n \n\n\n$\n\n\n403.1\n\n\n \n\n\n \n\n\n$\n\n\n375.9\n\n\n \n\n\n \n\n\n$\n\n\n27.2\n\n\n \n\n\n \n\n\n \n\n\n7.2\n\n\n%\n\n\n \n\n\n \n\n\n83.7\n\n\n%\n\n\n \n\n\n \n\n\n85.4\n\n\n%\n\n\n\n\n\n\nProfessional services\n\n\n \n\n\n \n\n\n78.5\n\n\n \n\n\n \n\n\n \n\n\n64.1\n\n\n \n\n\n \n\n\n \n\n\n14.4\n\n\n \n\n\n \n\n\n \n\n\n22.5\n\n\n%\n\n\n \n\n\n \n\n\n16.3\n\n\n%\n\n\n \n\n\n \n\n\n14.6\n\n\n%\n\n\n\n\n\n\nTotal revenue\n\n\n \n\n\n \n\n\n481.6\n\n\n \n\n\n \n\n\n \n\n\n440.0\n\n\n \n\n\n \n\n\n \n\n\n41.6\n\n\n \n\n\n \n\n\n \n\n\n9.5\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\nCosts and expenses:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCosts of recurring services\n\n\n \n\n\n \n\n\n95.6\n\n\n \n\n\n \n\n\n \n\n\n87.4\n\n\n \n\n\n \n\n\n \n\n\n8.2\n\n\n \n\n\n \n\n\n \n\n\n9.4\n\n\n%\n\n\n \n\n\n \n\n\n19.9\n\n\n%\n\n\n \n\n\n \n\n\n19.9\n\n\n%\n\n\n\n\n\n\nCosts of professional services\n\n\n \n\n\n \n\n\n83.9\n\n\n \n\n\n \n\n\n \n\n\n75.1\n\n\n \n\n\n \n\n\n \n\n\n8.8\n\n\n \n\n\n \n\n\n \n\n\n11.7\n\n\n%\n\n\n \n\n\n \n\n\n17.4\n\n\n%\n\n\n \n\n\n \n\n\n17.1\n\n\n%\n\n\n\n\n\n\nProduct development and management\n\n\n \n\n\n \n\n\n59.3\n\n\n \n\n\n \n\n\n \n\n\n55.4\n\n\n \n\n\n \n\n\n \n\n\n3.9\n\n\n \n\n\n \n\n\n \n\n\n7.0\n\n\n%\n\n\n \n\n\n \n\n\n12.3\n\n\n%\n\n\n \n\n\n \n\n\n12.6\n\n\n%\n\n\n\n\n\n\nSelling and marketing\n\n\n \n\n\n \n\n\n86.8\n\n\n \n\n\n \n\n\n \n\n\n85.8\n\n\n \n\n\n \n\n\n \n\n\n1.0\n\n\n \n\n\n \n\n\n \n\n\n1.2\n\n\n%\n\n\n \n\n\n \n\n\n18.0\n\n\n%\n\n\n \n\n\n \n\n\n19.5\n\n\n%\n\n\n\n\n\n\nGeneral and administrative\n\n\n \n\n\n \n\n\n81.2\n\n\n \n\n\n \n\n\n \n\n\n63.4\n\n\n \n\n\n \n\n\n \n\n\n17.8\n\n\n \n\n\n \n\n\n \n\n\n28.1\n\n\n%\n\n\n \n\n\n \n\n\n16.9\n\n\n%\n\n\n \n\n\n \n\n\n14.4\n\n\n%\n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n44.3\n\n\n \n\n\n \n\n\n \n\n\n52.1\n\n\n \n\n\n \n\n\n \n\n\n(7.8\n\n\n)\n\n\n \n\n\n \n\n\n(15.0\n\n\n)%\n\n\n \n\n\n \n\n\n9.2\n\n\n%\n\n\n \n\n\n \n\n\n11.8\n\n\n%\n\n\n\n\n\n\nTotal costs and expenses\n\n\n \n\n\n \n\n\n451.1\n\n\n \n\n\n \n\n\n \n\n\n419.2\n\n\n \n\n\n \n\n\n \n\n\n31.9\n\n\n \n\n\n \n\n\n \n\n\n7.6\n\n\n%\n\n\n \n\n\n \n\n\n93.7\n\n\n%\n\n\n \n\n\n \n\n\n95.3\n\n\n%\n\n\n\n\n\n\nOperating profit\n\n\n \n\n\n \n\n\n30.5\n\n\n \n\n\n \n\n\n \n\n\n20.8\n\n\n \n\n\n \n\n\n \n\n\n9.7\n\n\n \n\n\n \n\n\n \n\n\n46.6\n\n\n%\n\n\n \n\n\n \n\n\n6.3\n\n\n%\n\n\n \n\n\n \n\n\n4.7\n\n\n%\n\n\n\n\n\n\nInterest income\n\n\n \n\n\n \n\n\n(5.1\n\n\n)\n\n\n \n\n\n \n\n\n(4.8\n\n\n)\n\n\n \n\n\n \n\n\n(0.3\n\n\n)\n\n\n \n\n\n \n\n\n(6.3\n\n\n)%\n\n\n \n\n\n \n\n\n(1.1\n\n\n)%\n\n\n \n\n\n \n\n\n(1.1\n\n\n)%\n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n11.8\n\n\n \n\n\n \n\n\n \n\n\n13.6\n\n\n \n\n\n \n\n\n \n\n\n(1.8\n\n\n)\n\n\n \n\n\n \n\n\n(13.2\n\n\n)%\n\n\n \n\n\n \n\n\n2.5\n\n\n%\n\n\n \n\n\n \n\n\n3.1\n\n\n%\n\n\n\n\n\n\nOther expense (income), net\n\n\n \n\n\n \n\n\n176.7\n\n\n \n\n\n \n\n\n \n\n\n(6.3\n\n\n)\n\n\n \n\n\n \n\n\n183.0\n\n\n \n\n\n \n\n\n \n\n\n2904.8\n\n\n%\n\n\n \n\n\n \n\n\n36.7\n\n\n%\n\n\n \n\n\n \n\n\n(1.4\n\n\n)%\n\n\n\n\n\n\n(Loss) income before income taxes\n\n\n \n\n\n \n\n\n(152.9\n\n\n)\n\n\n \n\n\n \n\n\n18.3\n\n\n \n\n\n \n\n\n \n\n\n(171.2\n\n\n)\n\n\n \n\n\n \n\n\n(935.5\n\n\n)%\n\n\n \n\n\n \n\n\n(31.7\n\n\n)%\n\n\n \n\n\n \n\n\n4.2\n\n\n%\n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n \n\n\n43.9\n\n\n \n\n\n \n\n\n \n\n\n16.3\n\n\n \n\n\n \n\n\n \n\n\n27.6\n\n\n \n\n\n \n\n\n \n\n\n169.3\n\n\n%\n\n\n \n\n\n \n\n\n9.1\n\n\n%\n\n\n \n\n\n \n\n\n3.7\n\n\n%\n\n\n\n\n\n\nNet (loss) income\n\n\n \n\n\n$\n\n\n(196.8\n\n\n)\n\n\n \n\n\n$\n\n\n2.0\n\n\n \n\n\n \n\n\n$\n\n\n(198.8\n\n\n)\n\n\n \n\n\n \n\n\n(9940.0\n\n\n)%\n\n\n \n\n\n \n\n\n(40.9\n\n\n)%\n\n\n \n\n\n \n\n\n0.5\n\n\n%\n\n\n\n\nRevenue.\n \nThe following table sets forth certain information regarding our revenues for the periods presented:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30,\n\n\n \n\n\n \n\n\nPercentage change in revenue\n\n\n \n\n\n \n\n\nImpact of\nchanges in\nforeign\ncurrency (a)\n\n\n \n\n\n \n\n\nPercentage change in revenue on a constant currency basis (a)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025 vs. 2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n2025 vs. 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRecurring services:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDayforce recurring\n\n\n \n\n\n$\n\n\n333.0\n\n\n \n\n\n \n\n\n$\n\n\n292.0\n\n\n \n\n\n \n\n\n \n\n\n14.0\n\n\n%\n\n\n \n\n\n \n\n\n(0.1\n\n\n)%\n\n\n \n\n\n \n\n\n14.1\n\n\n%\n\n\n\n\n\n\nPowerpay recurring\n\n\n \n\n\n \n\n\n19.7\n\n\n \n\n\n \n\n\n \n\n\n20.2\n\n\n \n\n\n \n\n\n \n\n\n(2.5\n\n\n)%\n\n\n \n\n\n \n\n\n(1.0\n\n\n)%\n\n\n \n\n\n \n\n\n(1.5\n\n\n)%\n\n\n\n\n\n\nOther recurring\n\n\n \n\n\n \n\n\n8.2\n\n\n \n\n\n \n\n\n \n\n\n18.1\n\n\n \n\n\n \n\n\n \n\n\n(54.7\n\n\n)%\n\n\n \n\n\n \n\n\n(0.6\n\n\n)%\n\n\n \n\n\n \n\n\n(54.1\n\n\n)%\n\n\n\n\n\n\nFloat\n\n\n \n\n\n \n\n\n42.2\n\n\n \n\n\n \n\n\n \n\n\n45.6\n\n\n \n\n\n \n\n\n \n\n\n(7.5\n\n\n)%\n\n\n \n\n\n \n\n\n(0.3\n\n\n)%\n\n\n \n\n\n \n\n\n(7.2\n\n\n)%\n\n\n\n\n\n\nTotal recurring services\n\n\n \n\n\n \n\n\n403.1\n\n\n \n\n\n \n\n\n \n\n\n375.9\n\n\n \n\n\n \n\n\n \n\n\n7.2\n\n\n%\n\n\n \n\n\n \n\n\n(0.2\n\n\n)%\n\n\n \n\n\n \n\n\n7.4\n\n\n%\n\n\n\n\n\n\nProfessional services\n\n\n \n\n\n \n\n\n78.5\n\n\n \n\n\n \n\n\n \n\n\n64.1\n\n\n \n\n\n \n\n\n \n\n\n22.5\n\n\n%\n\n\n \n\n\n \n\n\n(0.4\n\n\n)%\n\n\n \n\n\n \n\n\n22.9\n\n\n%\n\n\n\n\n\n\nTotal revenue\n\n\n \n\n\n$\n\n\n481.6\n\n\n \n\n\n \n\n\n$\n\n\n440.0\n\n\n \n\n\n \n\n\n \n\n\n9.5\n\n\n%\n\n\n \n\n\n \n\n\n(0.1\n\n\n)%\n\n\n \n\n\n \n\n\n9.6\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal revenue, excluding float\n\n\n \n\n\n$\n\n\n439.4\n\n\n \n\n\n \n\n\n$\n\n\n394.4\n\n\n \n\n\n \n\n\n \n\n\n11.4\n\n\n%\n\n\n \n\n\n \n\n\n(0.2\n\n\n)%\n\n\n \n\n\n \n\n\n11.6\n\n\n%\n\n\n\n\n(a)\nWe have calculated the percentage change in revenue on a constant currency basis by applying the average foreign exchange rate in effect during the comparable prior period. Please refer to the \n“Non-GAAP Financial Measures”\n section for discussion of percentage change in revenue on a constant currency basis.\n\n\n \n31\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nTotal revenue increased $41.6 million, or 9.5%, to $481.6 million for the three months ended September 30, 2025, compared to $440.0 million for the three months ended September 30, 2024. This increase was primarily attributable to the increase in the number of live Dayforce customers and the increase in Dayforce recurring revenue per customer. The number of live Dayforce customers increased 4.4% to 7,025 at September 30, 2025 from 6,730 at September 30, 2024. Additionally, for the trailing twelve months ended September 30, 2025, Dayforce recurring revenue per customer grew to $175,172 compared to $159,496 for the comparable period in 2024.\n \nPlease refer to the \n\"How We Assess Our Performance\"\n and \n“Non-GAAP Financial Measures”\n section for discussion of and the definition of Dayforce recurring revenue per customer.\nThe increase in total revenue was partially offset by a decrease in float revenue, which was driven by a decrease in average yield of 36 basis points compared to the three months ended September 30, 2024. This was partially offset by a 1.3% increase in average float balance for our customer funds for the three months ended September 30, 2025, which increased to $4.54 billion, compared to $4.48 billion for the three months ended September 30, 2024.\nCosts of recurring services.\n The increase of $8.2 million, or 9.4%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to a $3.8 million increase in consulting and contract labor and a $5.1 million increase in costs of hosting our applications and software fees to support the continued global growth of the Dayforce customer base. These increases were partially offset by a $0.7 million decrease in employee labor and benefits.\nCosts of professional services.\n The increase of $8.8 million, or 11.7%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to a $8.0 million increase in consulting and contract labor as well as employee labor and benefits incurred to implement new customers and additional modules.\nProduct development and management expense.\n The increase of $3.9 million, or 7.0%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to a $3.2 million increase in labor and benefit related expenses, including share-based compensation, consulting and contract labor, and severance, as well as a $0.8 million increase in costs associated with hosting development applications.\nFor the three months ended September 30, 2025, and 2024, our investment in software development was $58.1 million and $52.4 million, respectively, consisting of $33.8 million and $29.5 million of research and development expense, and $24.3 million and $22.9 million in capitalized software development costs, respectively.\nSelling and marketing expense.\n The increase of $1.0 million, or 1.2%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to a $2.5 million increase in labor and benefit related expenses, including commissions, share-based compensation, and incentives. These increases are partially offset by a $1.7 million decrease in consulting and contract labor and severance.\nGeneral and administrative expense.\n The increase of $17.8 million, or 28.1%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to $22.2 million in non-recurring acquisition and transactions fees associated with the Thoma Bravo Transaction, as well as increases of $3.1 million in bad debt expense, and $1.2 million in software fees. These increases were partially offset by a $9.0 million decrease related to the remeasurement of the DataFuzion contingent consideration in 2024, that did not recur in 2025.\nDepreciation and amortization expense.\n The decrease of $7.8 million, or 15.0%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was driven by a $13.5 million reduction in amortization of intangible assets primarily resulting from the Ceridian trade name reaching the end of its amortization period in August 2025. This decrease was partially offset by our continued capitalization and subsequent amortization of Dayforce related and other development costs.\nOperating profit.\n For the three months ended September 30, 2025, operating profit was $30.5 million, compared to $20.8 million for the three months ended September 30, 2024. Operating profit increased as a result of higher revenue and lower depreciation and amortization expense, partially offset by non-recurring acquisition and transaction fees associated with the Thoma Bravo Transaction.\nInterest income.\n The increase of $0.3 million for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to higher invested balances.\n\n\n \n32\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nInterest expense.\n The decrease of $1.8 million for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to lower applicable reference rates on our Term Debt, which resulted from the debt refinancing completed in February 2025.\nOther expense (income), net.\n We incurred other expense, net of $176.7 million for the three months ended September 30, 2025 and we realized other income, net of $6.3 million for the three months ended September 30, 2024. The change was primarily due to a $172.1 million non-cash loss on the partial settlement related to the pension plan termination in the three months ended September 30, 2025.\n \nIncome tax expense.\n The increase of $27.6 million for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to increases of $38.8 million of non-deductible items, and $25.7 million of share-based compensation and a decrease of $36.0 million related to current operations.\n \nNet (loss) income.\n We realized net loss of $196.8 million for the three months ended September 30, 2025, compared to net income of $2.0 million for the three months ended September 30, 2024. The change was primarily due to the non-cash loss on the partial settlement related to the pension plan termination, partially offset by an increase in revenue.\nNine Months Ended September 30, 2025 Compared With Nine Months Ended September 30, 2024\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n \n\n\nIncrease/(Decrease)\n\n\n \n\n\n \n\n\nPercentage of Revenue\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRecurring services\n\n\n \n\n\n$\n\n\n1,206.7\n\n\n \n\n\n \n\n\n$\n\n\n1,123.6\n\n\n \n\n\n \n\n\n$\n\n\n83.1\n\n\n \n\n\n \n\n\n \n\n\n7.4\n\n\n%\n\n\n \n\n\n \n\n\n84.5\n\n\n%\n\n\n \n\n\n \n\n\n86.8\n\n\n%\n\n\n\n\n\n\nProfessional services\n\n\n \n\n\n \n\n\n221.4\n\n\n \n\n\n \n\n\n \n\n\n171.2\n\n\n \n\n\n \n\n\n \n\n\n50.2\n\n\n \n\n\n \n\n\n \n\n\n29.3\n\n\n%\n\n\n \n\n\n \n\n\n15.5\n\n\n%\n\n\n \n\n\n \n\n\n13.2\n\n\n%\n\n\n\n\n\n\nTotal revenue\n\n\n \n\n\n \n\n\n1,428.1\n\n\n \n\n\n \n\n\n \n\n\n1,294.8\n\n\n \n\n\n \n\n\n \n\n\n133.3\n\n\n \n\n\n \n\n\n \n\n\n10.3\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\nCosts and expenses:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCosts of recurring services\n\n\n \n\n\n \n\n\n286.7\n\n\n \n\n\n \n\n\n \n\n\n265.1\n\n\n \n\n\n \n\n\n \n\n\n21.6\n\n\n \n\n\n \n\n\n \n\n\n8.1\n\n\n%\n\n\n \n\n\n \n\n\n20.1\n\n\n%\n\n\n \n\n\n \n\n\n20.5\n\n\n%\n\n\n\n\n\n\nCosts of professional services\n\n\n \n\n\n \n\n\n241.8\n\n\n \n\n\n \n\n\n \n\n\n210.8\n\n\n \n\n\n \n\n\n \n\n\n31.0\n\n\n \n\n\n \n\n\n \n\n\n14.7\n\n\n%\n\n\n \n\n\n \n\n\n16.9\n\n\n%\n\n\n \n\n\n \n\n\n16.3\n\n\n%\n\n\n\n\n\n\nProduct development and management\n\n\n \n\n\n \n\n\n175.9\n\n\n \n\n\n \n\n\n \n\n\n166.8\n\n\n \n\n\n \n\n\n \n\n\n9.1\n\n\n \n\n\n \n\n\n \n\n\n5.5\n\n\n%\n\n\n \n\n\n \n\n\n12.3\n\n\n%\n\n\n \n\n\n \n\n\n12.9\n\n\n%\n\n\n\n\n\n\nSelling and marketing\n\n\n \n\n\n \n\n\n257.3\n\n\n \n\n\n \n\n\n \n\n\n246.6\n\n\n \n\n\n \n\n\n \n\n\n10.7\n\n\n \n\n\n \n\n\n \n\n\n4.3\n\n\n%\n\n\n \n\n\n \n\n\n18.0\n\n\n%\n\n\n \n\n\n \n\n\n19.0\n\n\n%\n\n\n\n\n\n\nGeneral and administrative\n\n\n \n\n\n \n\n\n211.2\n\n\n \n\n\n \n\n\n \n\n\n178.4\n\n\n \n\n\n \n\n\n \n\n\n32.8\n\n\n \n\n\n \n\n\n \n\n\n18.4\n\n\n%\n\n\n \n\n\n \n\n\n14.8\n\n\n%\n\n\n \n\n\n \n\n\n13.8\n\n\n%\n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n151.4\n\n\n \n\n\n \n\n\n \n\n\n151.5\n\n\n \n\n\n \n\n\n \n\n\n(0.1\n\n\n)\n\n\n \n\n\n \n\n\n(0.1\n\n\n)%\n\n\n \n\n\n \n\n\n10.6\n\n\n%\n\n\n \n\n\n \n\n\n11.7\n\n\n%\n\n\n\n\n\n\nTotal costs and expenses\n\n\n \n\n\n \n\n\n1,324.3\n\n\n \n\n\n \n\n\n \n\n\n1,219.2\n\n\n \n\n\n \n\n\n \n\n\n105.1\n\n\n \n\n\n \n\n\n \n\n\n8.6\n\n\n%\n\n\n \n\n\n \n\n\n92.7\n\n\n%\n\n\n \n\n\n \n\n\n94.2\n\n\n%\n\n\n\n\n\n\nOperating profit\n\n\n \n\n\n \n\n\n103.8\n\n\n \n\n\n \n\n\n \n\n\n75.6\n\n\n \n\n\n \n\n\n \n\n\n28.2\n\n\n \n\n\n \n\n\n \n\n\n37.3\n\n\n%\n\n\n \n\n\n \n\n\n7.3\n\n\n%\n\n\n \n\n\n \n\n\n5.8\n\n\n%\n\n\n\n\n\n\nInterest income\n\n\n \n\n\n \n\n\n(14.7\n\n\n)\n\n\n \n\n\n \n\n\n(13.3\n\n\n)\n\n\n \n\n\n \n\n\n(1.4\n\n\n)\n\n\n \n\n\n \n\n\n(10.5\n\n\n)%\n\n\n \n\n\n \n\n\n(1.0\n\n\n)%\n\n\n \n\n\n \n\n\n(1.0\n\n\n)%\n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n36.4\n\n\n \n\n\n \n\n\n \n\n\n46.5\n\n\n \n\n\n \n\n\n \n\n\n(10.1\n\n\n)\n\n\n \n\n\n \n\n\n(21.7\n\n\n)%\n\n\n \n\n\n \n\n\n2.5\n\n\n%\n\n\n \n\n\n \n\n\n3.6\n\n\n%\n\n\n\n\n\n\nOther expense, net\n\n\n \n\n\n \n\n\n177.6\n\n\n \n\n\n \n\n\n \n\n\n5.7\n\n\n \n\n\n \n\n\n \n\n\n171.9\n\n\n \n\n\n \n\n\n \n\n\n3015.8\n\n\n%\n\n\n \n\n\n \n\n\n12.4\n\n\n%\n\n\n \n\n\n \n\n\n0.4\n\n\n%\n\n\n\n\n\n\n(Loss) income before income taxes\n\n\n \n\n\n \n\n\n(95.5\n\n\n)\n\n\n \n\n\n \n\n\n36.7\n\n\n \n\n\n \n\n\n \n\n\n(132.2\n\n\n)\n\n\n \n\n\n \n\n\n(360.2\n\n\n)%\n\n\n \n\n\n \n\n\n(6.7\n\n\n)%\n\n\n \n\n\n \n\n\n2.8\n\n\n%\n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n \n\n\n65.1\n\n\n \n\n\n \n\n\n \n\n\n29.4\n\n\n \n\n\n \n\n\n \n\n\n35.7\n\n\n \n\n\n \n\n\n \n\n\n121.4\n\n\n%\n\n\n \n\n\n \n\n\n4.6\n\n\n%\n\n\n \n\n\n \n\n\n2.3\n\n\n%\n\n\n\n\n\n\nNet (loss) income\n\n\n \n\n\n$\n\n\n(160.6\n\n\n)\n\n\n \n\n\n$\n\n\n7.3\n\n\n \n\n\n \n\n\n$\n\n\n(167.9\n\n\n)\n\n\n \n\n\n \n\n\n(2300.0\n\n\n)%\n\n\n \n\n\n \n\n\n(11.2\n\n\n)%\n\n\n \n\n\n \n\n\n0.6\n\n\n%\n\n\n\n\n \n \n\n\n \n33\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nRevenue.\n \nThe following table sets forth certain information regarding our revenues for the periods presented:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n \n\n\nPercentage change in revenue\n\n\n \n\n\n \n\n\nImpact of\nchanges in\nforeign\ncurrency (a)\n\n\n \n\n\n \n\n\nPercentage change in revenue on a constant currency basis (a)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025 vs. 2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n2025 vs. 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRecurring revenue:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDayforce recurring\n\n\n \n\n\n$\n\n\n971.6\n\n\n \n\n\n \n\n\n$\n\n\n852.1\n\n\n \n\n\n \n\n\n \n\n\n14.0\n\n\n%\n\n\n \n\n\n \n\n\n(0.5\n\n\n)%\n\n\n \n\n\n \n\n\n14.5\n\n\n%\n\n\n\n\n\n\nPowerpay recurring\n\n\n \n\n\n \n\n\n58.6\n\n\n \n\n\n \n\n\n \n\n\n60.6\n\n\n \n\n\n \n\n\n \n\n\n(3.3\n\n\n)%\n\n\n \n\n\n \n\n\n(2.8\n\n\n)%\n\n\n \n\n\n \n\n\n(0.5\n\n\n)%\n\n\n\n\n\n\nOther recurring\n\n\n \n\n\n \n\n\n31.6\n\n\n \n\n\n \n\n\n \n\n\n55.7\n\n\n \n\n\n \n\n\n \n\n\n(43.3\n\n\n)%\n\n\n \n\n\n \n\n\n(2.5\n\n\n)%\n\n\n \n\n\n \n\n\n(40.8\n\n\n)%\n\n\n\n\n\n\nFloat\n\n\n \n\n\n \n\n\n144.9\n\n\n \n\n\n \n\n\n \n\n\n155.2\n\n\n \n\n\n \n\n\n \n\n\n(6.6\n\n\n)%\n\n\n \n\n\n \n\n\n(0.7\n\n\n)%\n\n\n \n\n\n \n\n\n(5.9\n\n\n)%\n\n\n\n\n\n\nTotal recurring revenue\n\n\n \n\n\n \n\n\n1,206.7\n\n\n \n\n\n \n\n\n \n\n\n1,123.6\n\n\n \n\n\n \n\n\n \n\n\n7.4\n\n\n%\n\n\n \n\n\n \n\n\n(0.7\n\n\n)%\n\n\n \n\n\n \n\n\n8.1\n\n\n%\n\n\n\n\n\n\nProfessional services\n\n\n \n\n\n \n\n\n221.4\n\n\n \n\n\n \n\n\n \n\n\n171.2\n\n\n \n\n\n \n\n\n \n\n\n29.3\n\n\n%\n\n\n \n\n\n \n\n\n(1.3\n\n\n)%\n\n\n \n\n\n \n\n\n30.6\n\n\n%\n\n\n\n\n\n\nTotal revenue\n\n\n \n\n\n$\n\n\n1,428.1\n\n\n \n\n\n \n\n\n$\n\n\n1,294.8\n\n\n \n\n\n \n\n\n \n\n\n10.3\n\n\n%\n\n\n \n\n\n \n\n\n(0.7\n\n\n)%\n\n\n \n\n\n \n\n\n11.0\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal revenue, excluding float\n\n\n \n\n\n$\n\n\n1,283.2\n\n\n \n\n\n \n\n\n$\n\n\n1,139.6\n\n\n \n\n\n \n\n\n \n\n\n12.6\n\n\n%\n\n\n \n\n\n \n\n\n(0.7\n\n\n)%\n\n\n \n\n\n \n\n\n13.3\n\n\n%\n\n\n\n\na)\nWe have calculated the percentage change in revenue on a constant currency basis by applying the average foreign exchange rate in effect during the comparable prior period. Please refer to the \n“Non-GAAP Financial Measures”\n section for discussion of percentage change in revenue on a constant currency basis.\nTotal revenue increased $133.3 million, or 10.3%, to $1,428.1 million for the nine months ended September 30, 2025, compared to $1,294.8 million for the nine months ended September 30, 2024. This increase was primarily attributable to the increase in live Dayforce customers and the increase in Dayforce recurring revenue per customer. The number of live Dayforce customers increased 4.4% to 7,025 at September 30, 2025 from 6,730 at September 30, 2024. Additionally, for the trailing twelve months ended September 30, 2025, Dayforce recurring revenue per customer grew to $175,172 compared to $159,496 for the comparable period in 2024.\n \nPlease refer to the \n\"How We Assess Performance\"\n and \n“Non-GAAP Financial Measures”\n section for discussion of and the definition of Dayforce recurring revenue per customer.\nThe increase in revenue was partially offset by a decrease in float revenue. The decrease in float revenue was driven by a decrease in average yield of 43 basis points compared to the nine months ended September 30, 2024, partially offset by a 4.3% increase in average float balance for our customer funds for the nine months ended September 30, 2025, which increased to $5.15 billion, compared to $4.94 billion for the nine months ended September 30, 2024.\nCosts of recurring services.\n The increase of $21.6 million, or 8.1%, for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, was due to a $13.6 million increase in labor and benefit related expenses, including consulting and contract labor and severance as well as a $6.6 million increase in costs related to hosting our applications and product partnerships.\nCosts of professional services.\n The increase of $31.0 million, or 14.7%, for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, was primarily due to a $30.5 million increase in labor and benefit related expenses, including consulting and contract labor, severance, employee labor and benefits, and share-based compensation.\nProduct development and management expense.\n The increase of $9.1 million, or 5.5%, for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, was primarily due to an $8.9 million increase in labor and benefit related expenses, including share-based compensation, severance, and consulting and contract labor.\nFor the nine months ended September 30, 2025, and 2024, our investment in software development was $171.4 million and $158.3 million, respectively, consisting of $98.9 million and $90.2 million of research and development expense, and $72.5 million and $68.1 million in capitalized software development costs, respectively.\n\n\n \n34\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nSelling and marketing expense.\n The increase of $10.7 million, or 4.3%, for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, was primarily due to a $15.6 million increase in labor and benefit related expenses, including increases in share-based compensation, commissions, severance, employee labor and benefits, and incentives. These increases were partially offset by a reduction of $4.8 million in consulting and contract labor expenses.\nGeneral and administrative expense.\n The increase of $32.8 million, or 18.4%, for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, was primarily due to $22.2 million in non-recurring acquisition and transactions fees associated with the Thoma Bravo Transaction, as well as increases of $18.8 million in labor and benefit related expenses, including share-based compensation, severance, employee labor and benefits, and incentives, and $3.8 million in bad debt expense. These increases were partially offset by a $9.0 million decrease related to the remeasurement of the DataFuzion contingent consideration in 2024 that did not recur in 2025 and a reduction of $4.6 million in consulting and contract labor expenses.\nDepreciation and amortization expense.\n Expense for the nine months ended September 30, 2025 was consistent with the nine months ended September 30, 2024, as a $11.6 million reduction in amortization of intangible assets primarily resulting from  the Ceridian trade name reaching the end of its amortization period in August 2025, was essentially offset by increases related to our continued capitalization and subsequent amortization of Dayforce related and other development costs.\nOperating profit.\n For the nine months ended September 30, 2025, operating profit was $103.8 million, compared to $75.6 million for the nine months ended September 30, 2024. Operating profit increased as a result of the higher revenue, partially offset by increased labor and benefits expenses, primarily consulting and contract labor, share-based compensation, and severance, as well as non-recurring acquisition and transaction fees associated with the Thoma Bravo Transaction.\nInterest income.\n The increase of $1.4 million for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, was primarily due to higher invested balances during the period.\nInterest expense.\n The decrease of $10.1 million for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, was primarily due to a $4.3 million loss on debt extinguishment recognized during the nine months ended September 30, 2024 related to the refinancing of certain credit agreements and due to lower applicable reference rates on our Term Debt, which resulted from the debt refinancing completed in February 2025. Please refer to \nPart I, Item 1. Note 7, \"Debt\"\n for additional information.\nOther expense, net.\n We incurred other expense, net of $177.6 million for the nine months ended September 30, 2025 and we incurred other expense, net of $5.7 million for the nine months ended September 30, 2024. The change was primarily due to a $172.1 million non-cash loss on the partial settlement related to the pension plan termination in the nine months ended September 30, 2025.\n \nIncome tax expense.\n The increase of $35.7 million for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, was primarily due to increases of $40.8 million related to non-deductible items, and $25.0 related to share-based compensation and a decrease of $27.8 million related to current operations.\nNet (loss) income.\n We incurred a net loss of $160.6 million for the nine months ended September 30, 2025, compared to net income of $7.3 million for the nine months ended September 30, 2024. The change was primarily due to the non-cash loss on the partial settlement related to the pension plan termination and higher total costs and expenses, partially offset by an increase in revenue.\n \n\n\n \n35\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nLiquidity and Capital Resources\nOn August 20, 2025, we entered into the Merger Agreement pursuant to which affiliates of Thoma Bravo have agreed to acquire us for $70.00 per share of Dayforce common stock. In connection with the Merger Agreement, we have agreed to various operating covenants, including, among others, agreements to conduct our business in the ordinary course during the period between the execution of the Merger Agreement and the Effective Time. In addition, without the consent of Thoma Bravo, we may not take, authorize, agree or commit to do certain actions outside of the ordinary course of business, including making capital expenditures above specified thresholds and incurring additional debt in excess of specified amounts. If the Merger Agreement is terminated in certain circumstances, including by us in order to enter into a superior proposal, we are required to pay Parent a cash termination fee of $351 million. We do not believe these covenants or restrictions will prevent us from meeting our debt obligations, ongoing costs of operations, working capital needs or capital expenditure requirements.\nOur primary sources of liquidity are our existing cash and equivalents, cash provided by operating activities, availability under our Revolving Credit Facility and the Receivables Securitization Program, and proceeds from debt issuances and equity offerings. As of September 30, 2025, we had cash and equivalents of $627.6 million and our total debt was $1,222.9 million.\nOur primary liquidity needs are related to funding of general business requirements, including the payment of interest and principal on our debt, capital expenditures, fulfilling our contractual commitments, product development, and funding Dayforce Wallet on-demand pay requests on behalf of our customers. From time to time, we have made investments in businesses or acquisitions of companies, which are also liquidity needs.\nWe believe that our cash flow from operations, available cash and equivalents, and availability under our Revolving Credit Facility and the Receivables Securitization Program will be sufficient to meet our liquidity needs for the next twelve months and for the foreseeable future. Our liquidity and our ability to meet our obligations to fund our capital requirements and Dayforce Wallet on-demand pay requests are also dependent on our future financial performance, which is subject to general economic, financial, and other factors that are beyond our control. Accordingly, we cannot provide assurance that our business will generate sufficient cash flow from operations or that future borrowings will be available from additional indebtedness or otherwise to meet our liquidity needs. If we decide to pursue one or more significant acquisitions, we may incur additional debt or raise additional equity to finance such acquisitions, which would result in additional expenses and/or dilution.\nOur customer funds are held and invested with the primary objectives being to protect the principal balance and to ensure adequate liquidity to meet cash flow requirements. Our cash flows can vary significantly due to purchases of and proceeds from the sale and maturity of customer fund marketable securities, as well as the carrying value of customer fund accounts as of period end dates due to several factors, including the specific day of the week the period ends, which impacts the timing of funds collected from customers and payments made to satisfy customer obligations to employees, taxing authorities, and others. The customer assets are held in segregated accounts intended for the specific purpose of satisfying customer funding obligations and therefore are not freely available for our general business use, however, are evaluated and tracked separately by management. Please refer to \nPart 1, Item 1, Note 4, “Customer Funds”\n for further discussion of these funds.\n\n\n \n36\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nCash Flows\nThe table below summarizes the activity within the condensed consolidated statements of cash flows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nNet cash provided by operating activities\n\n\n \n\n\n$\n\n\n193.5\n\n\n \n\n\n \n\n\n$\n\n\n200.1\n\n\n \n\n\n\n\n\n\nNet cash used in investing activities\n\n\n \n\n\n \n\n\n(292.6\n\n\n)\n\n\n \n\n\n \n\n\n(458.1\n\n\n)\n\n\n\n\n\n\nNet cash used in financing activities\n\n\n \n\n\n \n\n\n(722.7\n\n\n)\n\n\n \n\n\n \n\n\n(1,067.6\n\n\n)\n\n\n\n\n\n\nEffect of exchange rate changes on cash, restricted cash, and equivalents\n\n\n \n\n\n \n\n\n12.6\n\n\n \n\n\n \n\n\n \n\n\n(18.2\n\n\n)\n\n\n\n\n\n\nNet decrease in cash, restricted cash, and equivalents\n\n\n \n\n\n \n\n\n(809.2\n\n\n)\n\n\n \n\n\n \n\n\n(1,343.8\n\n\n)\n\n\n\n\n\n\nCash, restricted cash, and equivalents at beginning of period\n\n\n \n\n\n \n\n\n3,253.9\n\n\n \n\n\n \n\n\n \n\n\n3,421.4\n\n\n \n\n\n\n\n\n\nCash, restricted cash, and equivalents at end of period\n\n\n \n\n\n \n\n\n2,444.7\n\n\n \n\n\n \n\n\n \n\n\n2,077.6\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash and equivalents\n\n\n \n\n\n \n\n\n627.6\n\n\n \n\n\n \n\n\n \n\n\n494.1\n\n\n \n\n\n\n\n\n\nRestricted cash and equivalents\n\n\n \n\n\n \n\n\n1,817.1\n\n\n \n\n\n \n\n\n \n\n\n1,583.5\n\n\n \n\n\n\n\n\n\nTotal cash, restricted cash, and equivalents\n\n\n \n\n\n$\n\n\n2,444.7\n\n\n \n\n\n \n\n\n$\n\n\n2,077.6\n\n\n \n\n\n\n\nOperating Activities\nNet cash provided by operating activities was $193.5 million for the nine months ended September 30, 2025 compared to $200.1 million for the nine months ended September 30, 2024. For both periods, cash inflows from operating activities are primarily generated from the subscriptions of our solutions. Cash outflows from operating activities for both periods are primarily comprised of personnel-related expenditures, including the payout of year-end employee compensation, and the renewals of prepaid annual contracts that are integral to our business operations. The positive cash inflows in both periods is primarily due to our growing revenue, partially offset by our operating costs, mainly, investment in our sales force to support our growth initiatives and those product development and management costs which are not eligible for capitalization as well as $22.2 million in non-recurring acquisition and transaction related fees in 2025 related to the Thoma Bravo transaction.\nInvesting Activities\n \nDuring the nine months ended September 30, 2025, net cash used in investing activities was $292.6 million, consisting of  purchases of customer funds marketable securities of $555.8 million, capital expenditures of $81.9 million, acquisition costs, net of cash acquired of $5.5 million, and purchases of marketable securities of $3.7 million, partially offset by proceeds from the sale and maturity of customer funds marketable securities of $342.8 million and proceeds from the sale and maturity of marketable securities of $11.5 million. Our capital expenditures included $72.0 million for software and technology and $9.9 million for property, plant, and equipment.\nDuring the nine months ended September 30, 2024, net cash used in investing activities was $458.1 million, consisting of  purchases of customer funds marketable securities of $483.2 million, acquisition costs, net of cash acquired, of $173.1 million, capital expenditures of $82.8 million, and purchases of marketable securities of $10.0 million, partially offset by proceeds from the sale and maturity of customer funds marketable securities of $283.4 million, and proceeds from the sale and maturity of marketable securities of $7.6 million. Our capital expenditures included $74.1 million for software and technology and $8.7 million for property, plant, and equipment.\nFinancing Activities\nNet cash used in financing activities was $722.7 million during the nine months ended September 30, 2025. This cash outflow is primarily attributable to a decrease in net customer fund obligations of $659.6 million, repurchases of common stock of $59.9 million, taxes paid related to the net share settlement of equity awards of $19.0 million, payments on our long-term debt obligations of $5.5 million, and payment of debt refinancing costs of $1.2 million, partially offset by proceeds from issuance of common stock under our share-based compensation plans of $22.5 million.\n\n\n \n37\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nNet cash used in financing activities was $1,067.6 million during the nine months ended September 30, 2024. This cash outflow is primarily attributable to a decrease in net customer fund obligations of $1,049.9 million, payments on our long-term debt obligations of $646.5 million, repurchases of common stock of $28.8 million, payment of debt refinancing costs of $11.4 million, taxes paid related to the net share settlement of equity awards of $10.7 million, and payment of contingent consideration of $3.0 million, partially offset by an increase in proceeds from our debt issuance of $650.0 million and proceeds from issuance of common stock under our share-based compensation plans of $32.7 million.\nBacklog\nBacklog is equivalent to our remaining performance obligations, which represents contracted revenue for recurring services and fixed price professional services, primarily implementation services, that has not yet been recognized, including deferred revenue and unbilled amounts that will be recognized as revenue in future periods. As of September 30, 2025, our remaining performance obligations were approximately $1.52 billion. Please refer to \nPart 1, Item 1, Note 10, “Revenue and Revenue-Related Activities”\n for further discussion of our remaining performance obligations.\n \nOff-Balance Sheet Arrangements\nAs of September 30, 2025, we did not have any “off-balance sheet arrangements” (as such term is defined in Item 303 of Regulation S-K).\nContractual Obligations\nDuring the nine months ended September 30, 2025, there were no significant changes to our contractual obligations as described in Part II, Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" under the heading \"Contractual Obligations\" contained in our \n2024 Form 10-K\n.\nCritical Accounting Policies and Estimates\n \nDuring the nine months ended September 30, 2025, there were no significant changes to our critical accounting policies and estimates as described in Part II, Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" under the heading \"Critical Accounting Policies and Estimates\" contained in our \n2024 Form 10-K\n.\nNon-G\nAAP Financial Measures\nWe use certain non-GAAP financial measures in this document including:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNon-GAAP Financial Measure\n\n\n \n\n\nGAAP Financial Measure\n\n\n\n\n\n\nEBITDA\n\n\n \n\n\nNet (loss) income\n\n\n\n\n\n\nAdjusted EBITDA\n\n\n \n\n\nNet (loss) income\n\n\n\n\n\n\nAdjusted EBITDA margin\n\n\n \n\n\nNet profit margin\n\n\n\n\n\n\nAdjusted operating profit\n\n\n \n\n\nOperating profit\n\n\n\n\n\n\nAdjusted operating profit margin\n\n\n \n\n\nOperating profit margin\n\n\n\n\n\n\nAdjusted net income\n\n\n \n\n\nNet (loss) income\n\n\n\n\n\n\nAdjusted net profit margin\n\n\n \n\n\nNet profit margin\n\n\n\n\n\n\nAdjusted diluted net income per share\n\n\n \n\n\nDiluted net (loss) income per share\n\n\n\n\n\n\nFree cash flow\n\n\n \n\n\nNet cash provided by operating activities\n\n\n\n\n\n\nFree cash flow margin\n\n\n \n\n\nNet cash provided by operating activities margin\n\n\n\n\n\n\nPercentage change in revenue, including total revenue and revenue by solution, on a constant currency basis\n\n\n \n\n\nPercentage change in revenue, including total revenue and revenue by solution\n\n\n\n\n\n\nDayforce recurring revenue per customer\n\n\n \n\n\nNo directly comparable GAAP measure\n\n\n\n\n \n\n\n \n38\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nWe believe that these non-GAAP financial measures are useful to management and investors as supplemental measures to evaluate our overall operating performance including comparison across periods and with competitors. Our management team uses these non-GAAP financial measures to assess operating performance because these financial measures exclude the results of decisions that are outside the normal course of our business operations, and are used for internal budgeting and forecasting purposes both for short- and long-term operating plans. Additionally, Adjusted operating profit, free cash flow, and free cash flow margin are components of certain management compensation plans. Additionally, we  believe that the non-GAAP financial measures free cash flow and free cash flow margin are meaningful to investors because they are measures of liquidity that provide useful information in understanding and evaluating the strength of our liquidity and future ability to generate cash that can be used for strategic opportunities or investing in our business. The reduction of capital expenditures facilitates comparisons of our liquidity on a period-to-period basis and excludes items that management does not consider to be indicative of our liquidity.\nThese non-GAAP financial measures are not required by, defined under, or presented in accordance with, GAAP, and should not be considered as alternatives to our results as reported under GAAP, have important limitations as analytical tools, and our use of these terms may not be comparable to similarly titled measures of other companies in our industry. Our presentation of non-GAAP financial measures should not be construed to imply that our future results will be unaffected by similar items to those eliminated in this presentation.\n \nWe define our non-GAAP financial measures as follows:\n•\nEBITDA is defined as net (loss) income before interest, taxes, depreciation, and amortization, and Adjusted EBITDA is EBITDA, as adjusted to exclude share-based compensation expense and related employer taxes, and certain other items. \n•\nAdjusted EBITDA margin is determined by calculating the percentage Adjusted EBITDA is of total revenue.\n•\nAdjusted operating profit is defined as operating profit, as adjusted to exclude share-based compensation expense and related employer taxes, amortization of acquisition-related intangible assets, and certain other items.\n•\nAdjusted operating profit margin is determined by calculating the percentage Adjusted operating profit is of total revenue.\n•\nAdjusted net income is defined as net (loss) income, as adjusted to exclude share-based compensation expense and related employer taxes, amortization of acquisition-related intangible assets, and certain other items, all of which are adjusted for the effect of income taxes. \n•\nAdjusted net profit margin is determined by calculating the percentage Adjusted net income is of total revenue.\n•\nAdjusted diluted net income per share is calculated by dividing adjusted net income by diluted weighted average shares outstanding. When adjusted net income is positive, diluted weighted average shares outstanding incorporate the effect of dilutive equity instruments.\n•\nFree cash flow is defined as net cash provided by operating activities, reduced by capital expenditures.\n•\nFree cash flow margin is determined by calculating the percentage that free cash flow is of total revenue.\n•\nPercentage change in revenue, including total revenue and revenue by solution, on a constant currency basis is calculated by applying the average foreign exchange rate in effect during the comparable prior period. \n•\nDayforce recurring revenue per customer is an indicator of the average size of Dayforce recurring revenue customers. To calculate Dayforce recurring revenue per customer, we start with Dayforce recurring revenue on a constant currency basis by applying the same exchange rate to all comparable periods for the trailing twelve months and excludes float revenue, and Ascender, ADAM HCM, and eloomi revenue. This amount is divided by the number of live Dayforce customers at the end of the trailing twelve month period, excluding Ascender, ADAM HCM, and eloomi. We have not reconciled Dayforce recurring revenue per customer to a GAAP financial measure because there is no directly comparable GAAP financial measure.\n \n \n \n \n \n \n\n\n \n39\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nThe following tables reconcile our reported results to our non-GAAP financial measures:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30, 2025\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAs reported\n\n\n \n\n\n \n\n\nAs reported margins (a)\n\n\n \n\n\n \n\n\nShare-based\ncompensation\n\n\n \n\n\n \n\n\nAmortization\n\n\n \n\n\n \n\n\nOther (b)\n\n\n \n\n\n \n\n\nAs adjusted (b)\n\n\n \n\n\n \n\n\nAs adjusted margins (a)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(Dollars in millions, except per share data)\n\n\n \n\n\n\n\n\n\nOperating profit\n\n\n \n\n\n$\n\n\n30.5\n\n\n \n\n\n \n\n\n \n\n\n6.3\n\n\n%\n\n\n \n\n\n$\n\n\n44.9\n\n\n \n\n\n \n\n\n$\n\n\n16.1\n\n\n \n\n\n \n\n\n$\n\n\n27.6\n\n\n \n\n\n \n\n\n$\n\n\n119.1\n\n\n \n\n\n \n\n\n \n\n\n24.7\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet (loss) income\n\n\n \n\n\n$\n\n\n(196.8\n\n\n)\n\n\n \n\n\n \n\n\n(40.9\n\n\n)%\n\n\n \n\n\n$\n\n\n44.9\n\n\n \n\n\n \n\n\n$\n\n\n16.1\n\n\n \n\n\n \n\n\n$\n\n\n196.3\n\n\n \n\n\n \n\n\n$\n\n\n60.5\n\n\n \n\n\n \n\n\n \n\n\n12.6\n\n\n%\n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n6.7\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n6.7\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome tax benefit (c)\n\n\n \n\n\n \n\n\n43.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(8.0\n\n\n)\n\n\n \n\n\n \n\n\n51.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n44.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n16.1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n28.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n$\n\n\n(101.9\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n44.9\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n204.3\n\n\n \n\n\n \n\n\n$\n\n\n147.3\n\n\n \n\n\n \n\n\n \n\n\n30.6\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet (loss) income per share - diluted (d)\n\n\n \n\n\n$\n\n\n(1.23\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n0.28\n\n\n \n\n\n \n\n\n$\n\n\n0.10\n\n\n \n\n\n \n\n\n$\n\n\n1.21\n\n\n \n\n\n \n\n\n$\n\n\n0.37\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30, 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAs reported\n\n\n \n\n\n \n\n\nAs reported margins (a)\n\n\n \n\n\n \n\n\nShare-based\ncompensation\n\n\n \n\n\n \n\n\nAmortization\n\n\n \n\n\n \n\n\nOther (b)\n\n\n \n\n\n \n\n\nAs adjusted (b)\n\n\n \n\n\n \n\n\nAs adjusted margins (a)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(Dollars in millions, except per share data)\n\n\n \n\n\n\n\n\n\nOperating profit\n\n\n \n\n\n$\n\n\n20.8\n\n\n \n\n\n \n\n\n \n\n\n4.7\n\n\n%\n\n\n \n\n\n$\n\n\n39.6\n\n\n \n\n\n \n\n\n$\n\n\n29.6\n\n\n \n\n\n \n\n\n$\n\n\n13.2\n\n\n \n\n\n \n\n\n$\n\n\n103.2\n\n\n \n\n\n \n\n\n \n\n\n23.5\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n2.0\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n%\n\n\n \n\n\n$\n\n\n39.6\n\n\n \n\n\n \n\n\n$\n\n\n29.6\n\n\n \n\n\n \n\n\n$\n\n\n3.3\n\n\n \n\n\n \n\n\n$\n\n\n74.5\n\n\n \n\n\n \n\n\n \n\n\n16.9\n\n\n%\n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n8.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n8.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome tax expense (c)\n\n\n \n\n\n \n\n\n16.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(4.0\n\n\n)\n\n\n \n\n\n \n\n\n20.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n52.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n29.6\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n22.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n$\n\n\n79.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n39.6\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n7.3\n\n\n \n\n\n \n\n\n$\n\n\n126.1\n\n\n \n\n\n \n\n\n \n\n\n28.7\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income per share - diluted\n\n\n \n\n\n$\n\n\n0.01\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n0.25\n\n\n \n\n\n \n\n\n$\n\n\n0.19\n\n\n \n\n\n \n\n\n$\n\n\n0.02\n\n\n \n\n\n \n\n\n$\n\n\n0.47\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \n(a)\nOperating profit margin and net profit margin are determined by calculating the percentage operating profit and net (loss) income are of total revenue. Please refer above for additional information on the as adjusted margins.\n(b)\nThe as adjusted column is a non-GAAP financial measure, adjusted to exclude share-based compensation expense and related employer taxes, amortization of acquisition-related intangible assets, and certain other items. For the three months ended September 30, 2025, the adjustments to operating profit consist of $27.6 million of restructuring expenses, primarily related to costs associated with the Thoma Bravo Transaction, and the adjustments to net loss also include $177.4 million of pension costs, primarily associated with the non-cash loss on the partial settlement related to the pension plan termination, $0.7 million of foreign exchange gain, and a $8.0 million net adjustment for the effect of income taxes related to these items. For the three months ended September 30, 2024, the adjustments to operating profit consist of $9.0 million related to the fair value adjustment for the DataFuzion contingent consideration, $3.2 million of restructuring expenses, and $1.0 million  of fees associated with initiating the receivables securitization program and the adjustments to net income also include $3.2 million of costs associated with the planned termination of its frozen U.S. pension plan, and $9.1 million of foreign exchange gain, along with a $4.0 million net adjustment for the effect of income taxes related to these items. Please refer below for additional information on the as adjusted metrics.\n(c)\nIncome tax effects have been calculated based on the statutory tax rates in effect in the U.S. and foreign jurisdictions during the period.\n(d)\nAdjusted diluted net income per share is calculated based upon 162.0 million weighted average shares of common stock for the three months ended September 30, 2025.\n\n\n \n40\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30, 2025\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAs reported\n\n\n \n\n\n \n\n\nAs reported margins (a)\n\n\n \n\n\n \n\n\nShare-based\ncompensation\n\n\n \n\n\n \n\n\nAmortization\n\n\n \n\n\n \n\n\nOther (b)\n\n\n \n\n\n \n\n\nAs adjusted (b)\n\n\n \n\n\n \n\n\nAs adjusted margins (a)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(Dollars in millions, except per share data)\n\n\n \n\n\n\n\n\n\nOperating profit\n\n\n \n\n\n$\n\n\n103.8\n\n\n \n\n\n \n\n\n \n\n\n7.3\n\n\n%\n\n\n \n\n\n$\n\n\n139.3\n\n\n \n\n\n \n\n\n$\n\n\n75.9\n\n\n \n\n\n \n\n\n$\n\n\n57.3\n\n\n \n\n\n \n\n\n$\n\n\n376.3\n\n\n \n\n\n \n\n\n \n\n\n26.3\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet (loss) income\n\n\n \n\n\n$\n\n\n(160.6\n\n\n)\n\n\n \n\n\n \n\n\n(11.2\n\n\n)%\n\n\n \n\n\n$\n\n\n139.3\n\n\n \n\n\n \n\n\n$\n\n\n75.9\n\n\n \n\n\n \n\n\n$\n\n\n198.0\n\n\n \n\n\n \n\n\n$\n\n\n252.6\n\n\n \n\n\n \n\n\n \n\n\n17.7\n\n\n%\n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n21.7\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n21.7\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome tax expense (c)\n\n\n \n\n\n \n\n\n65.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(36.3\n\n\n)\n\n\n \n\n\n \n\n\n101.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n151.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n75.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n75.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n$\n\n\n77.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n139.3\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n234.3\n\n\n \n\n\n \n\n\n$\n\n\n451.2\n\n\n \n\n\n \n\n\n \n\n\n31.6\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet (loss) income per share - diluted (d)\n\n\n \n\n\n$\n\n\n(1.01\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n0.86\n\n\n \n\n\n \n\n\n$\n\n\n0.47\n\n\n \n\n\n \n\n\n$\n\n\n1.22\n\n\n \n\n\n \n\n\n$\n\n\n1.56\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30, 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAs reported\n\n\n \n\n\n \n\n\nAs reported margins (a)\n\n\n \n\n\n \n\n\nShare-based\ncompensation\n\n\n \n\n\n \n\n\nAmortization\n\n\n \n\n\n \n\n\nOther (b)\n\n\n \n\n\n \n\n\nAs adjusted (b)\n\n\n \n\n\n \n\n\nAs adjusted margins (a)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(Dollars in millions, except per share data)\n\n\n \n\n\n\n\n\n\nOperating profit\n\n\n \n\n\n$\n\n\n75.6\n\n\n \n\n\n \n\n\n \n\n\n5.8\n\n\n%\n\n\n \n\n\n$\n\n\n118.4\n\n\n \n\n\n \n\n\n$\n\n\n87.5\n\n\n \n\n\n \n\n\n$\n\n\n25.7\n\n\n \n\n\n \n\n\n$\n\n\n307.2\n\n\n \n\n\n \n\n\n \n\n\n23.7\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n7.3\n\n\n \n\n\n \n\n\n \n\n\n0.6\n\n\n%\n\n\n \n\n\n$\n\n\n118.4\n\n\n \n\n\n \n\n\n$\n\n\n87.5\n\n\n \n\n\n \n\n\n$\n\n\n5.5\n\n\n \n\n\n \n\n\n$\n\n\n218.7\n\n\n \n\n\n \n\n\n \n\n\n16.9\n\n\n%\n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n33.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n33.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome tax expense (c)\n\n\n \n\n\n \n\n\n29.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(27.0\n\n\n)\n\n\n \n\n\n \n\n\n56.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n151.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n87.5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n64.0\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n$\n\n\n221.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n118.4\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n32.5\n\n\n \n\n\n \n\n\n$\n\n\n372.3\n\n\n \n\n\n \n\n\n \n\n\n28.8\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income per share - diluted\n\n\n \n\n\n$\n\n\n0.05\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n0.74\n\n\n \n\n\n \n\n\n$\n\n\n0.55\n\n\n \n\n\n \n\n\n$\n\n\n0.03\n\n\n \n\n\n \n\n\n$\n\n\n1.37\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \n(a)\nOperating profit margin and net profit margin are determined by calculating the percentage operating profit and net (loss) income are of total revenue. Please refer above for additional information on the as adjusted margins.\n(b)\nThe as adjusted column is a non-GAAP financial measure, adjusted to exclude share-based compensation expense and related employer taxes, amortization of acquisition-related intangible assets, and certain other items. For the nine months ended September 30, 2025, the adjustments to operating profit consist of $57.3 million of restructuring expenses, including costs associated with the Thoma Bravo Transaction, and the adjustments to net loss also include $187.9 million of pension costs, primarily associated with the non-cash loss on the partial settlement related to the pension plan termination, $10.9 million of foreign exchange gain, and a $36.3 million net adjustment for the effect of income taxes related to these items. For the nine months ended September 30, 2024, the adjustments to operating profit consist of $15.7 million of restructuring expenses, $9.0 million related to the fair value adjustment for the DataFuzion contingent consideration, and $1.0 million of fees associated with initiating the receivables securitization program and the adjustments to net income also include $9.7 million of costs associated with the planned termination of its frozen U.S. pension plan, and $2.9 million of foreign exchange gain, along with a $27.0 million net adjustment for the effect of income taxes related to these items. Please refer below for additional information on the as adjusted metrics.\n(c)\nIncome tax effects have been calculated based on the statutory tax rates in effect in the U.S. and foreign jurisdictions during the period.\n(d)\nAdjusted diluted net income per share is calculated based upon 162.0 million weighted average shares of common stock for the nine months ended September 30, 2025.\n \n\n\n \n41\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents\n\n\n \n \n\n\nThe following table reconciles our reported results to free cash flow and free cash flow margin:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30,\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nNet cash provided by operating activities\n\n\n \n\n\n$\n\n\n31.2\n\n\n \n\n\n \n\n\n$\n\n\n91.8\n\n\n \n\n\n \n\n\n$\n\n\n193.5\n\n\n \n\n\n \n\n\n$\n\n\n200.1\n\n\n \n\n\n\n\n\n\nCapital expenditures\n\n\n \n\n\n \n\n\n(26.2\n\n\n)\n\n\n \n\n\n \n\n\n(28.4\n\n\n)\n\n\n \n\n\n \n\n\n(81.9\n\n\n)\n\n\n \n\n\n \n\n\n(82.8\n\n\n)\n\n\n\n\n\n\nFree cash flow\n\n\n \n\n\n$\n\n\n5.0\n\n\n \n\n\n \n\n\n$\n\n\n63.4\n\n\n \n\n\n \n\n\n$\n\n\n111.6\n\n\n \n\n\n \n\n\n$\n\n\n117.3\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet cash provided by operating activities margin (a)\n\n\n \n\n\n \n\n\n6.5\n\n\n%\n\n\n \n\n\n \n\n\n20.9\n\n\n%\n\n\n \n\n\n \n\n\n13.5\n\n\n%\n\n\n \n\n\n \n\n\n15.5\n\n\n%\n\n\n\n\n\n\nFree cash flow margin\n\n\n \n\n\n \n\n\n1.0\n\n\n%\n\n\n \n\n\n \n\n\n14.4\n\n\n%\n\n\n \n\n\n \n\n\n7.8\n\n\n%\n\n\n \n\n\n \n\n\n9.1\n\n\n%\n\n\n\n\n \n(a)\nNet cash provided by operating activities margin is determined by calculating the percentage that net cash provided by operating activities is of total revenue.\n\n\n \n42\n   |     \n \nQ3 2025 Form 10-Q\n\n\n\n\nTable of Contents"
}