{
  "item1": "Major applications products listed below major product line: Applications / Market Segments Major Products / Technologies Industrial personnel protection, military emergency response, medical devices packaging, automotive, aerospace oil gas KEVLAR® fiber; NOMEX® fiber paper; TYVEK® protective materials; TYCHEM® protective suits Rigid spray foam insulation, weatherization, waterproofing air sealing, caulks sealants, roof coatings decorative surface materials STYROFOAM™ brand insulation products, THERMAX™ exterior insulation, XENERGY™ high performance insulation, LIQUIDARMOR™ flashing sealant, GREAT STUFF™ insulating foam sealants adhesives, CORIAN® design solid quartz surfaces, TYVEK® weather resistant barriers Water filtration purification technology residential, municipal industrial use. Key industries include municipal drinking water wastewater, power generation, microelectronics, pharmaceuticals, food beverage, industrial wastewater reuse, metals mining oil gas segments AMBERLITE™ ion exchange resins, FILMTEC™ reverse osmosis nanofiltration elements, INTEGRAFLUX™ ultrafiltration modules, FORTILIFE™ challenging water reverse osmosis membranes TAPTEC™ water filtration purification drinking water homes commercial buildings major commodities, raw materials supplies Water & Protection segment include: methyl methacrylate, alumina trihydrate, methyl pentanediol, styrene, polysulfone, Terephthaloyl- & Isophthaloyl- chloride, high-density polyethylene, polyethylene, aniline, calcium chloride, divinyl benzene monomers caustic sulfuric acid. Current Future Investments Company completed previously announced plans increase capacity manufacture TYVEK® nonwoven materials its Luxembourg site due growing global demand. new assets online operational early 2024 total investment approximately $400 million.",
  "item7": "2025 OUTLOOK full year 2025, Company anticipates ongoing strength within semiconductor markets well more normalized sales patterns China. Continued growth expected markets served Interconnect Solutions driven improved consumer electronics demand refresh cycles devices support AI adoption. Within healthcare markets, Company anticipates growth acceleration demand medical devices along continued demand stabilization medical packaging applications biopharma markets. markets served Water, Company expects increased demand drive year over year volume growth.",
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS Management’s discussion analysis financial condition results operations provided supplement to, should read conjunction with, interim Consolidated Financial Statements related notes enhance understanding Company’s operations present business environment. Components management’s discussion analysis financial condition results operations include: Result Operations Changes Financial Condition OVERVIEW DuPont global innovation leader, providing advanced solutions help transform industries improve everyday life across key markets including healthcare, water, construction, transportation, electronics. September 30, 2025, Company $3.5 billion working capital approximately $2.0 billion cash cash equivalents."
}