{
  "source_file": "dd-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nManagement’s discussion and analysis of financial condition and results of operations is provided as a supplement to, and should be read in conjunction with, the interim Consolidated Financial Statements and related notes to enhance the understanding of the Company’s operations and present business environment. Components of management’s discussion and analysis of financial condition and results of operations include:\n•\nOverview\n•\nResult of Operations\n•\nSegment Results\n•\nChanges in Financial Condition\nOVERVIEW\nDuPont is a global innovation leader, providing advanced solutions that help transform industries and improve everyday life across our key markets including healthcare, water, construction, transportation, and electronics. \nAs of September 30, 2025, the Company has $3.5 billion of working capital and approximately $2.0 billion in cash and cash equivalents. The Company expects its cash and cash equivalents, cash generated from operations, and ability to access the debt capital markets to provide sufficient liquidity and financial flexibility to meet the liquidity requirements associated with its continuing operations.\nOutlined below are recent developments and material historical transactions impacting this Quarterly Report on Form 10-Q.\nQnity Spin-Off\nSubsequent to quarter end, on November 1, 2024, DuPont completed the previously announced separation of its Electronics business, (the \"Electronics Separation\") by way of a pro rata distribution to holders of DuPont common stock as of the close of business on October 22, 2025, of all the issued and outstanding common stock of Qnity Electronics, Inc. (“Qnity” and the pro rata distribution, the \"Distribution\"). \nAramids Divestiture \nOn August 29, 2025, DuPont announced a definitive agreement to sell the Aramids business (Kevlar® and Nomex®), (the \"Aramids Business\") to TJC LP, (“TJC”), in a transaction valuing the Aramids Business at approximately $1.8 billion (the “Aramids Divestiture”), pursuant to which, subject to the satisfaction of customary closing conditions. \nRecent Developments \nNew Jersey Settlement Agreement\nIn August 2025, DuPont together with Chemours and Corteva agreed to a proposed Judicial Consent Order with the State of New Jersey (the “NJ Settlement”) to resolve all outstanding claims by the State of New Jersey pending against the companies related to legacy use of a wide variety of substances of concern, including, but not limited to DNAPL (dense non-aqueous phase liquids), chemical solvents, and PFAS. The NJ Settlement is subject to approval from the Federal District Court of New Jersey (Camden), (the “NJ Court”). See Note 14 to the interim Consolidated Financial Statement for additional information.\nMacroeconomic Conditions \nIn recent months, the U.S. government has announced various actions related to trade, such as the imposition of new or increased tariffs on product imports from certain countries, including Canada, Mexico and China. There is significant uncertainty about the ultimate extent and duration of the tariffs, responsive actions from other countries and the resulting impacts, including on general economic conditions and on the Company’s financial condition, liquidity, or results of operations. Ultimately, these trade disputes and policy changes, including actions taken in response, have the potential to reduce the competitiveness of DuPont products and cause sales to decline, which could adversely affect the Company’s business, financial condition and results of operations. \nSee Part II, Item 1A. Risk Factors for additional information.\n50\nTable of Contents\nQ1 2025 Segment Realignment\nEffective in the first quarter of 2025, in light of the Electronics Separation, the Company realigned its management and reporting structure. This realignment resulted in a change in reportable segments in the first quarter of 2025 which changed the manner in which the Company reports financial results by segment, (the \"Q1 2025 Segment Realignment\"). As a result, the businesses separated as part of the Electronics Separation are reported separately from the Industrials businesses of DuPont. The Consolidated Financial Statements have been recast for all periods presented to reflect the new two segment reporting structure as described below:\n•\nElectronicsCo includes the businesses within the Semiconductor Technologies and Interconnect Solutions lines of business, as well as the electronics-related product lines previously within Industrial Solutions, including electronics polymers and perfluoroeasltomer materials and parts (Kalrez®).\n•\nIndustrialsCo includes the businesses within the former Water & Protection segment, the healthcare and non-electronics businesses, including Vespel® parts and shapes, previously in Industrial Solutions and the Auto Adhesives & Fluids, Multibase\nTM\n and Tedlar® businesses, previously within Corporate & Other.\nBeginning in the fourth quarter of 2025, the financial results of the Electronics business will be reflected in the Consolidated Financial Statements as discontinued operations, along with comparative periods. \nDividends\nOn November 6, 2025, the Board of Directors declared a fourth quarter 2025 dividend for New DuPont of $0.20 per share, payable on December 15, 2025, to shareholders of record on November 28, 2025.\nOn June 25, 2025, the Company announced that its Board of Directors declared a third quarter 2025 dividend of $0.41 per share which was paid on September 15, 2025, to shareholders of record on August 29, 2025.\n51\nTable of Contents\nRESULTS OF OPERATIONS\nSummary of Sales Results\nThree Months Ended\n September 30,\nNine Months Ended \nSeptember 30,\nIn millions\n2025\n2024\n2025\n2024\nNet sales\n$\n3,072 \n$\n2,862 \n$\n8,720 \n$\n8,263 \nThe following table summarizes sales variances by segment and geographic region from the prior year:\nSales Variances by Segment and Geographic Region\nPercentage change from prior year\nThree Months Ended September 30, 2025\nNine Months Ended September 30, 2025\nLocal Price\n & Product Mix\nCurrency\nVolume\nPortfolio & Other\nTotal\nLocal Price\n & Product Mix\nCurrency\nVolume\nPortfolio & Other\nTotal\nIndustrialsCo\n(1)\n%\n1 \n%\n5 \n%\n— \n%\n5 \n%\n(1)\n%\n— \n%\n4 \n%\n— \n%\n3 \n%\nElectronicsCo\n(1)\n1 \n11 \n— \n11 \n(2)\n— \n12 \n— \n10 \nTotal\n(1)\n%\n1 \n%\n7 \n%\n— \n%\n7 \n%\n(1)\n%\n— \n%\n7 \n%\n— \n%\n6 \n%\nU.S. & Canada\n— \n%\n— \n%\n7 \n%\n— \n%\n7 \n%\n(1)\n%\n— \n%\n4 \n%\n1 \n%\n4 \n%\nEMEA \n1\n(1)\n5 \n7 \n— \n11 \n(1)\n2 \n5 \n1 \n7 \nAsia Pacific\n(1)\n— \n8 \n(1)\n6 \n(2)\n— \n10 \n(1)\n7 \nLatin America\n(1)\n1 \n7 \n— \n7 \n(2)\n— \n5 \n1 \n4 \nTotal\n(1)\n%\n1 \n%\n7 \n%\n— \n%\n7 \n%\n(1)\n%\n— \n%\n7 \n%\n— \n%\n6 \n%\n1.\nEurope, Middle East and Africa.\nThe Company reported net sales for the three months ended September 30, 2025 of $3.1 billion, up 7 percent from $2.9 billion for the three months ended September 30, 2024, due to a 7 percent increase in volume and a 1 percent favorable currency impact partially offset by a 1 percent decrease in local price and product mix. The volume increase was driven by ElectronicsCo (up 11 percent) and IndustrialsCo (up 5 percent). Local price and product mix decreased in ElectronicsCo and IndustrialsCo (both down 1 percent). The Company had an approximately $70 million benefit from order timing related to system cut-over activities in advance of the Electronics Separation.\nNet sales for the nine months ended September 30, 2025 were 8.7 billion, up 6 percent from $8.3 billion for the nine months ended September 30, 2024, due to\n \na 7 percent increase in volume partially offset by a 1 percent decrease in local price and product mix. The volume increase was primarily driven by ElectronicsCo (up 12 percent). Local price and product mix declined in ElectronicsCo (down 2 percent) and IndustrialsCo (down 1 percent).\nCost of Sales\nCost of sales was $1.9 billion for the three months ended September 30, 2025 up from $1.7 billion for the three months ended September 30, 2024\n. \nCost of sales increased for the three months ended September 30, 2025 primarily due to increased sales volume. \nCost of sales as a percentage of net sales remained flat at 61 percent for both the three months ended September 30, 2025 and 2024. \nCost of sales was $5.3 billion for the nine months ended September 30, 2025, up from $5.1 billion for the nine months ended September 30, 2024. Cost of sales increased for the nine months ended September 30, 2025 primarily due to increased sales volume. \nCost of sales as a percentage of net sales for the nine months ended September 30, 2025 was 61 percent compared with 62 percent for the nine months ended September 30, 2024. The slight decrease as a percentage of sales for the nine months ended September 30, 2025 compared to the prior period was primarily due lower raw material costs.\nResearch and Development Expenses (\"R&D\")\nR&D expenses totaled $140 million in the third quarter of 2025, up from $127 million in the third quarter of 2024. R&D as a percentage of net sales was relatively consistent period over period at 5 percent and 4 percent for the three months ended September 30, 2025 and 2024, respectively. The slight increase is driven by growth investments.\n52\nTable of Contents\nR&D expenses totaled $404 million in the first nine months of 2025, up from $370 million in the first nine months of 2024. R&D as a percentage of net sales was relatively consistent period over period at 5 percent and 4 percent for the nine months ended September 30, 2025 and 2024. The slight increase is driven by growth investments.\nSelling, General and Administrative Expenses (\"SG&A\")\nSG&A expenses were $387 million in the third quarter of 2025, up from $368 million in the third quarter of 2024. SG&A as a percentage of net sales was consistent period over period at 13 percent for the three months ended September 30, 2025 and 2024, respectively. The change for the three months ended September 30, 2025 as compared with the same period of the prior year was primarily due to an increase in legal expenses and personnel-related expenses. \nFor the first nine months of 2025, SG&A expenses were $1,127 million, down slightly from $1,134 million in the first nine months of 2024. SG&A as a percentage of net sales decreased slightly period over period at 13 percent compared to 14 percent for the nine months ended September 30, 2025 and 2024, respectively. The change for the nine months ended September 30, 2025 as compared with the same period of the prior year was primarily due to lower legal and personnel-related expenses. \nAmortization of Intangibles\nAmortization of intangibles was $121 million in the third quarter of 2025, down from $132 million in the third quarter of 2024. In the first nine months of 2025, amortization of intangibles was $375 million, down from $396 million in the same period of the prior year. The decrease for the three and nine months ended September 30, 2025 as compared with the same periods of the prior year was primarily due to the absence of amortization in the current period from fully amortized assets. \nRestructuring and Asset Related Charges - Net\nRestructuring and asset related charges - net were $20 million in the third quarter of 2025, down slightly from $21 million charges in the third quarter of 2024. In the first nine months of 2025, restructuring and asset-related charges - net were $67 million, up from $56 million charges in the same period last year. The activity for the three and nine months ended September 30, 2025 primarily related to the Transformational Separation-Related Restructuring Program. The activity for the three and nine months ended September 30, 2024 primarily related to\n \nthe 2023-2024 Restructuring Program. See Note 6 to the interim Consolidated Financial Statements for additional information.\nAcquisition, Integration and Separation Costs\nAcquisition, integration and separation costs primarily consist of financial advisory, information technology, legal, accounting, consulting and other professional advisory fees. The Company recorded $139 million and $43 million for the three months ended September 30, 2025 and 2024, respectively, and $383 million and $51 million for the nine months ended September 30, 2025 and 2024, respectively\n.\n These costs for all periods presented were associated with\n \nthe Electronics Separation.\nEquity in Earnings of Nonconsolidated Affiliates\nThe Company's share of the earnings of nonconsolidated affiliates was $14 million in the third quarter of 2025, up from $7 million in the third quarter of 2024. The increase for the three month period is due to higher equity earnings in an equity affiliate offset by the loss from equity earnings from Derby.\nIn the first nine months of 2025, the Company's share of earnings of nonconsolidated affiliates was $30 million, up from $27 million in the first nine months of 2024.The increase for the nine month period is due to higher equity earnings across affiliates offset by the loss from equity earnings from Derby.\nSee Note 11 to the interim Consolidated Financial Statements for additional information.\nSundry Income (Expense) - Net\nSundry income (expense) - net includes a variety of income and expense items such as foreign currency exchange gains or losses, interest income, dividends from investments, gains and losses on sales of investments, losses on debt extinguishments and assets, non-operating pension and other post-employment benefit plan credits or costs, interest rate swap mark-to-market adjustments, interest rate swap net interest settlement and certain litigation matters. Sundry income (expense) - net in the third quarter of 2025 was $24 million of income compared with $200 million in the third quarter of 2024.\n \nInterest rate swap impacts includes a loss of $3 million and a gain of $191 million for the three months ended September 30, 2025 and 2024, respectively, and included mark-to-market adjustments. Interest income was $27 million and $14 million for the three months ended September 30, 2025 and 2024, respectively, which includes $9 million for the three and nine months ended September 30, 2025 related to interest income earned from cash received associated with the Qnity Notes. The three months ended September 30, 2025 and 2024 included $11 million and $17 million, respectively, net foreign exchange loss.\n53\nTable of Contents\nIn the first nine months of 2025, sundry income (expense) - net was income of $112 million compared $147 million in the first nine months of 2024. The first nine months of 2025 included $48 million gain related to interest rate swap activity including mark-to-market adjustments and interest income of $68 million, partially offset by foreign exchange losses of $33 million. The first nine months of 2024 included a $152 million net gain related to interest rate swap activity including mark-to-market adjustments and $55 million of interest income partially offset by a $74 million loss on debt extinguishment and a $17 million loss on foreign exchange. \nSee Notes 7 and 19 to the interim Consolidated Financial Statements for additional information.\nInterest Expense\nInterest expense was $99 million and $87 million for the three months ended September 30, 2025 and 2024, respectively, and $266 million and $282 million for the nine months ended September 30, 2025 and 2024, respectively. The increase in interest expense during the three months ended September 30, 2025 compared to the same period the prior year is primarily due to $14 million of interest expense associated with the Qnity Notes partially offset by a reduction in capitalized interest.\nThe decrease in interest expense during the nine months ended September 30, 2025 compared to the same period the prior year is primarily due to the absence of interest expense on the partial redemption of $650 million aggregate principal amount of the 2038 notes and the dedesignation of 2022 Swaps partially offset by interest expense associated with the Qnity Notes. \nSee Note 19 to the interim Consolidated Financial Statements for further detail on the 2022 Swaps.\nProvision for Income Taxes on Continuing Operations \nThe Company's effective tax rate fluctuates based, among other factors, on where income is earned and the level of income relative to tax attributes. The effective tax rate on continuing operations for the third quarter of 2025 was 5.8 percent, compared with an effective tax rate of 17.9 percent for the third quarter of 2024. The lower effective tax rate for the third quarter of 2025 in comparison to the third quarter of 2024 was principally the result of the release of a valuation allowance on certain tax attributes in connection with the anticipated Aramids Divestiture. For the first nine months of 2025, the effective tax rate on continuing operations was 20.4 percent, compared with 27.7 percent for the first nine months of 2024. The decrease of the effective tax rate in 2025 included the previously mentioned valuation allowance release in comparison to 2024 which included certain discrete tax expenses, including an international statutory tax settlement for which the Company is partially indemnified.\n54\nTable of Contents\nSEGMENT RESULTS\nThe Company's measure of profit/loss for segment reporting purposes is Operating EBITDA as this is the manner in which the Company's chief operating decision maker (\"CODM\") assesses performance and allocates resources. The Company defines Operating EBITDA as earnings (i.e., “Income from continuing operations before income taxes\") before interest, depreciation, amortization, non-operating pension / other post-employment benefits (“OPEB”) / charges, and foreign exchange gains / losses, excluding future reimbursable indirect costs, and adjusted for significant items.\nINDUSTRIALSCO\nThe IndustrialsCo segment is a leading provider of engineered products and integrated solutions primarily serving medical, including packaging and specialty medical devices, water filtration, worker safety, automotive, including electric vehicles, aerospace and building product end markets. The segment satisfies the growing needs of our customers and delivers solutions that make life safer and healthier. By uniting market-driven innovation with the strength of highly regarded brands, the segment strives to bring new products and solutions to solve customers' needs on a global scale. \nOn July 28, 2024, DuPont completed the acquisition of Donatelle Plastics, LLC (\"Donatelle Plastics\"), (the \"Donatelle Plastics Acquisition\") and is included within this segment.\nIndustrialsCo\nThree Months Ended\nNine Months Ended\nIn millions\nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\nNet sales\n$\n1,797 \n$\n1,715 \n$\n5,157 \n$\n5,028 \nOperating EBITDA\n$\n465 \n$\n445 \n$\n1,320 \n$\n1,244 \nEquity in earnings of nonconsolidated affiliates\n$\n1 \n$\n(1)\n$\n1 \n$\n1 \nIndustrialsCo\nThree Months Ended\nNine Months Ended\nPercentage change from prior year\nSeptember 30, 2025\nSeptember 30, 2025\nChange in Net Sales from Prior Period due to:\nLocal price & product mix\n(1)\n%\n(1)\n%\nCurrency\n1 \n— \nVolume\n5 \n4 \nPortfolio & other\n— \n— \nTotal\n5 \n%\n3 \n%\nIndustrialsCo net sales were $1,797 million for the three months ended September 30, 2025, up 5 percent compared to $1,715 million for the three months ended September 30, 2024. Net sales increased due to a 5 percent increase in volume and 1 percent increase from favorable currency impacts, offset by a 1 percent decrease in local price and product mix. Volume gains in Healthcare & Water Technologies were driven by growth for medical packaging and biopharma and continued strength in reverse osmosis and ion exchange. Within Diversified Industrials, volume gains were driven by growth in Industrial Technologies, partially offset by declines in the construction markets. IndustrialsCo had an approximately $30 million benefit from order timing related to system cut-over activities in advance of the Electronics Separation. \nOperating EBITDA was $465 million for the three months ended September 30, 2025, up 4 percent compared with $445 million for the three months ended September 30, 2024, primarily due to the impact of volume growth and productivity, partially offset by growth investments. \nIndustrialsCo net sales were $5,157 million for the nine months ended September 30, 2025, up 3 percent compared to $5,028 million for the nine months ended September 30, 2024. Net sales increased due to a 4 percent increase in volume, offset by a 1 percent decrease in local price and product mix. Volume gains in Healthcare & Water Technologies were partially offset by a volume decline in Diversified Industrials. Healthcare & Water Technologies volume gains were driven by growth for medical packaging and biopharma and strength in reverse osmosis. Within Diversified Industrials, volume declines were primarily due to declines in construction and automotive end-markets. The decline in local price and product mix is within Diversified Industrials. Portfolio was flat reflecting sales activity associated with the acquisition of Donatelle which closed in July 2024, offset by the exit of a Tedlar® photovoltaic product line beginning in the fourth quarter of 2024. IndustrialsCo had an approximately $30 million benefit from order timing related to system cut-over activities in advance of the Electronics Separation. \n55\nTable of Contents\nOperating EBITDA was $1,320 million for the nine months ended September 30, 2025, up 6 percent compared with $1,244 million for the nine months ended September 30, 2024, primarily due to the impact of volume growth and productivity and savings from prior year restructuring actions, partially offset by lower pricing and growth investments.\nELECTRONICSCO\nElectronicsCo is a leading provider of materials and solutions for semiconductor and electronics industries. The segment empowers its customers’ technology roadmaps to enable advancements in megatrends such as artificial intelligence, advanced computing and advanced connectivity. ElectronicsCo partners with leading semiconductor and advanced device manufacturers to address complex challenges and develop solutions that facilitate next-generation technological innovations. The segment is a leading provider of semiconductor fabrication consumables such as CMP materials and microlithography. In addition, the segment provides leading solutions for advanced packaging of semiconductors, key materials such as metallization processes for printed circuit boards, and assembly technologies such as thermal management and electromagnetic shielding. ElectronicsCo is a leading provider of cutting-edge materials for the manufacturing of displays for organic light emitting diode (OLED) and innovative elastomer solutions and parts for semiconductor equipment and other critical industrial applications.\nElectronicsCo\nThree Months Ended\nNine Months Ended\nIn millions\nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\nNet sales\n$\n1,275 \n$\n1,147 \n$\n3,563 \n$\n3,235 \nOperating EBITDA\n$\n403 \n$\n379 \n$\n1,149 \n$\n1,002 \nEquity in earnings of nonconsolidated affiliates\n$\n14 \n$\n10 \n$\n37 \n$\n33 \nElectronicsCo\nThree Months Ended\nNine Months Ended\nPercentage change from prior year\nSeptember 30, 2025\nSeptember 30, 2025\nChange in Net Sales from Prior Period due to:\nLocal price & product mix\n(1)\n%\n(2)\n%\nCurrency\n1 \n— \nVolume\n11 \n12 \nPortfolio & other\n— \n— \nTotal\n11 \n%\n10 \n%\nElectronicsCo net sales were $1,275 million for the three months ended September 30, 2025, up 11 percent from $1,147 million for the three months ended September 30, 2024. Net sales increased due to a 11 percent increase in volume and 1 percent increase from favorable currency impacts, partially offset by a 1 percent decrease in local price and product mix. Volume growth in Interconnect Solutions was driven by continued demand strength from AI-driven technology ramps and benefits from content and share gains. Within Semiconductor Technologies, volume gains were driven by end-market demand, primarily due to advanced nodes and AI technology applications. ElectronicsCo had an approximately $40 million benefit from order timing related to system cut-over activities in advance of the Electronics Separation. \nOperating EBITDA was $403 million for the three months ended September 30, 2025, up 6 percent compared with $379 million for the three months ended September 30, 2024, primarily due to organic growth, partially offset by growth investments to support advanced node transitions and AI technology ramps. \nElectronicsCo net sales were $3,563 million for the nine months ended September 30, 2025, up 10 percent from $3,235 million for the nine months ended September 30, 2024. Net sales increased due to a 12 percent increase in volume, partially offset by a 2 percent decrease in local price and product mix. Volume growth in Interconnect Solutions was due to continued demand strength from AI-driven technology ramps, and benefits from content and share gains.\n \nWithin Semiconductor Technologies, volume gains were driven by end-market demand, primarily due to advanced nodes and AI technology application. ElectronicsCo had an approximately $40 million benefit from order timing related to system cut-over activities in advance of the Electronics Separation. \nOperating EBITDA was $1,149 million for the nine months ended September 30, 2025, up 15 percent compared with $1,002 million for the nine months ended September 30, 2024, primarily due to volume growth and lower legal costs, partially offset by strategic growth investments to support advanced node transitions and AI technology ramps.\n \n56\nTable of Contents\nCHANGES IN FINANCIAL CONDITION \nLiquidity & Capital Resources\nInformation related to the Company's liquidity and capital resources can be found in the Company's 2024 Annual Report, Part II, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations, Liquidity and Capital Resources. Discussion below provides the updates to this information for the nine months ended September 30, 2025.\nThe Company continually reviews its sources of liquidity and debt portfolio and may make adjustments to one or both to ensure adequate liquidity and increase the Company’s optionality and financing efficiency as it relates to financing cost and balancing terms/maturities. The Company’s primary source of incremental liquidity is cash flows from operating activities. Management expects the generation of cash from operations and the ability to access the debt capital markets and other sources of liquidity will continue to provide sufficient liquidity and financial flexibility to meet the Company’s and its subsidiaries' obligations as they come due. However, DuPont is unable to predict the extent of macroeconomic related impacts which depend on uncertain and unpredictable future developments. In light of this uncertainty, the Company has taken steps to further ensure liquidity and capital resources, as discussed below.\nIn millions\nSeptember 30, 2025\nDecember 31, 2024\nCash and cash equivalents\n$\n1,955 \n$\n1,843 \nTotal debt \n$\n8,899 \n$\n7,171 \nThe Company's cash and cash equivalents at September 30, 2025 and December 31, 2024 were $2.0 billion and $1.8 billion, respectively, of which approximately $1.2 billion and $1.1 billion at September 30, 2025 and December 31, 2024, respectively, were held by subsidiaries in foreign countries, including United States territories. For each of its foreign subsidiaries, the Company makes an assertion regarding the amount of earnings intended for permanent reinvestment, with the balance available to be repatriated to the United States. Due to the Electronics Separation, the Company reevaluated its permanent reinvestment assertion and determined that certain foreign earnings would be repatriated to the United States. Refer to subsequent paragraphs for drivers of the change in cash and cash equivalents.\nTotal debt at September 30, 2025 and December 31, 2024 was $8,899 million and $7,171 million, respectively. The increase was primarily due to the Qnity Notes Offering in August 2025. \nAs of September 30, 2025, the Company is contractually obligated to make future cash payments of $9.0 billion and $4.6 billion associated with principal and interest, respectively, on debt obligations. Related to the principal, $1.9 billion will be due in the next twelve months. The Company may address the maturity with cash on hand, issuance of commercial paper, utilizing existing credit facilities, accessing the debt capital markets or a combination of any of them. Related to interest, $422 million will be due in the next twelve months, and the remainder will be due subsequent to September 30, 2026. The majority of interest obligations will be due in 2030 or later. The information presented is inclusive of contractual obligations on the senior notes issued by Qnity in preparation for the Electronics Separation.\nIn relation to the Company’s 2024 fixed-to-floating interest rate swap agreements, there is a mandatory early termination date of December 15, 2025. The mark-to-market value on these swaps at September 30, 2025 is $75 million recorded in “Accrued and other current liabilities” in the interim Consolidated Statements of Operations. The final settlement amount will depend on movements in interest rates. Refer to Note 19 to the Consolidated Financial Statements for more information on the Company’s interest rate swap agreements.\nQnity Financing\nIn August 2025, Qnity, a wholly-owned subsidiary of DuPont, issued $1.0 billion aggregate principal amount of 5.750% senior secured notes due 2032 (the “ Qnity Secured Notes”) and $750 million aggregate principal amount of 6.250% senior unsecured notes due 2033 (the “Qnity Unsecured Notes,” and together with the Secured Notes, the “Qnity Notes”). Qnity also issued and fully allocated a senior secured revolving credit facility for $1.25 billion due 2030 and a senior secured term loan facility for $2.35 billion due 2032 in the second quarter 2025 (the “Qnity Credit Facilities”). The Qnity Credit Facilities became effective immediately prior to the Electronics Separation, but after September 30, 2025. On October 31, 2025, Qnity used the net proceeds from the Qnity Notes, together with borrowings under the Qnity Credit Facilities and cash on hand, to finance the payment of a cash distribution to DuPont of approximately $4.1 billion, inclusive of financing related fees plus the pre-funded accrued interest deposit in connection with the issuance of notes (and any investment returns thereon). \n57\nTable of Contents\nAt September 30, 2025 until October 31, 2025, the gross proceeds of the Qnity Notes and the pre-funded accrued interest deposit were held in escrow and reflected as “Restricted cash and cash equivalents” in the Consolidated Balance Sheets. Subsequent to the quarter ended September 30, 2025, the gross proceeds held in escrow were released in connection with the completion of the Qnity Spin-Off on November 1, 2025. The proceeds from the Qnity distribution have been primarily used to repay the Company’s Existing and/or New Notes. \nDebt Exchange\nIn September 2025, DuPont announced the commencement, in connection with the contemplated Qnity Spin-Off, of offers to exchange any and all of its outstanding (i) 4.725% Notes due 2028 , (ii) 5.319% Notes due 2038 and (iii) 5.419% Notes due 2048 (respectively, the “2028 Existing Notes”, the “2038 Existing Notes” and the “2048 Existing Notes” and collectively, the “Existing Notes”) for new notes to be issued by DuPont (respectively, the “2028 New Notes”, the “2038 New Notes” and the “2048 New Notes” and collectively the “New Notes”) concurrently with the offers to exchange the Existing Notes for New Notes (collectively, the “Exchange Offers”).\nThe Exchange Offers were completed and settled on October 2, 2025 and in connection with the settlement of the Exchange Offers, DuPont issued $1,584 million aggregate principal amount of the New 2028 Notes in exchange for the 2028 Notes tendered and accepted by DuPont, approximately $226 million aggregate principal amount of New 2038 Notes in exchange for the 2038 Notes tendered and accepted by DuPont and approximately $295 million aggregate principal amount of New 2048 Notes and (collectively with the New 2028 Notes and the New 2038 Notes, the “New Notes”) in exchange for the 2048 Notes tendered and accepted by DuPont. \nEach series of the New Notes provides for special mandatory redemption as discussed below. Each series of the New Notes has the same interest rate, interest payment dates, maturity date and optional redemption provisions as the applicable series of Existing Notes; provided that the methodology for calculating any make-whole redemption price for the New Notes reflects the Securities Industry and Financial Markets Association model provisions. Interest is payable on the New 2028 Notes on May 15 and November 15 of each year beginning on May 15, 2025, until its maturity date of November 15, 2028. Interest is payable on the New 2038 Notes on May 15 and November 15 of each year beginning on May 15, 2025, until its maturity date of November 15, 2038. Interest is payable on the New 2048 Notes on May 15 and November 15 of each year beginning on May 15, 2025, until its maturity date of November 15, 2048.\nUpon the completion of the Distribution, the special mandatory redemption event was triggered under each series of New Notes (the \"Special Mandatory Redemption Even\"). As a result, DuPont is required to redeem $900 million principal amount of the New 2028 Notes, approximately $226 million principal amount of the New 2038 Notes and approximately $295 million principal amount of the New 2048 Notes on the Special Mandatory Redemption Date (as defined below) (such redemption the \"Special Mandatory Redemption\"), at a redemption price (the “Special Mandatory Redemption Price”) equal to the greater of (1)(a) the sum of the present values of the remaining scheduled payments of principal and interest on each series of the New Notes discounted to the Special Mandatory Redemption Date (assuming each series of the New Notes matured on the applicable par call date) on a semi-annual basis (assuming a 360-day year consisting of twelve 30-day months) at the Treasury Rate plus (i) 25 basis points in the case of the New 2028 Notes and (ii) 30 basis points in the case of the New 2038 Notes and the New 2048 Notes, less (b) interest accrued to the Special Mandatory Redemption Date, and (2) 100% of the principal amount of the applicable series of the New Notes to be redeemed, plus, in either case, accrued and unpaid interest, if any, to, but excluding the Special Mandatory Redemption Date. \nThe Company has sent redemption notices to the holders of the New Notes on November 3, 2025 indicating a Special Mandatory Redemption Date of November 7, 2025.\nConsent Solicitation and Offer to Purchase\nOn November 3, 2025, DuPont entered into a transaction support agreement (the “Transaction Support Agreement”) with certain noteholders (the “Supporting Holders”) that beneficially own $649 million (or approximately 83.9%) of the 2038 Notes and $1,118 million (or approximately 60.25%) of the 2048 Notes, each issued pursuant to the Indenture, dated as of November 28, 2018, by and between DowDuPont Inc. (n/k/a DuPont de Nemours, Inc.) and U.S. Bank National Association, as trustee (the “Trustee”), as supplemented by the First Supplemental Indenture, dated as of November 28, 2018, by and between DowDuPont Inc. (n/k/a DuPont de Nemours, Inc.) and the Trustee (collectively, the “Indenture”). Pursuant to the Transaction Support Agreement, (i) DuPont has agreed to launch, and the Supporting Holders have agreed to provide their consents with respect to their 2038 Notes and 2048 Notes (as applicable) in support of a solicitation of consents (the “Consent Solicitations”) with respect to the adoption of certain proposed amendments (the “Proposed Amendments”) to the Indenture governing the applicable series of 2038 Notes and 2048 Notes to expressly permit DuPont to consummate the Electronics Separation and the proposed sale of its Aramids Business, and (ii) DuPont has agreed to launch and the Supporting Holders have agreed to tender $1,029 million aggregate principal amount of their 2048 Notes into a tender offer (the “Tender Offer”) to purchase for cash up \n58\nTable of Contents\nto $739 million aggregate principal amount of the 2048 Notes (the \"Tender Cap\") at a purchase price equal to $1,000 per $1,000 aggregate principal amount of 2048 Notes plus accrued and unpaid interest (if any) thereon to, but excluding, the applicable settlement date of the Tender Offer.\nFollowing successful consummation of the Tender Offer, repayment at maturity of DuPont’s 4.493% Notes due 2025 and payment of the Special Mandatory Redemption of the New Notes, DuPont will have successfully achieved its intended post-Electronics Separation capital structure by repaying approximately $4.0 billion aggregate principal amount of its senior notes, with total refinancing expenses of approximately $156 million (including redemption premiums and excluding swap termination expenses).\nRevolving Credit Facilities \nIn May 2025, the Company entered into a $1 billion 364-day revolving credit facility (the \"364-Day Revolving Credit Facility\"). Prior to entering the new facility, the Company held another $1 billion 364-day revolving credit facility. There were no drawdowns of either facility during the nine month period ended September 30, 2025. The new 364-Day Revolving Credit Facility will be used for general corporate purposes. \nIn May 2025, the Company amended its $2.5 billion 5-year revolving credit facility to extend the maturity date to April 2028. In addition, the amended facility decreased to $2.0 billion upon the occurrence of the Electronics Separation. \nThe amended 5-year revolving credit facility is generally expected to remain undrawn and serve as a backstop to the Company's commercial paper and letter of credit issuance. Upon occurrence of the Electronics Separation, the Company reduced its authorized commercial paper program to $2.0 billion.\nInterest Rate Swaps\nDuring the third quarter of 2025, the Company executed a partial termination to unwind approximately 30 percent of the swap related to the 2048 notes for about $20 million, representing the respective allocation of the fair value of the swap at the time of settlement. The partial termination was undertaken to better align the Company's hedge portfolio with its anticipated revised debt profile.\nNew Jersey Settlement Agreement\nIn connection with the NJ Settlement the Company will incur costs and undertake certain funding obligations. See Note 14 to the interim Consolidated Financial Statement for additional information.\nCredit Ratings\nThe Company's credit ratings impact its access to the debt capital markets and cost of capital. The Company remains committed to maintaining a strong financial position with a balanced financial policy focused on maintaining a strong investment-grade rating and driving shareholder value. At November 4, 2025, DuPont's credit ratings were as follows:\nCredit Ratings\nLong-Term Rating\nShort-Term Rating\nOutlook\nStandard & Poor’s\nBBB+\nA-2\nStable\nMoody’s Investors Service\nBaa1\nP-2\nNegative\nFitch Ratings\nBBB+\nF-2\nStable\nIn the second quarter of 2024, Standard & Poor’s (\"S&P\") and Fitch Ratings (\"Fitch\") placed the Company on credit watch negative and Moody’s Investors Service (\"Moody's\") placed the Company on outlook negative following the Company’s May 2024 separation announcement. In September 2025 and November 2025, Fitch and S&P, respectively, updated the Company’s outlook to stable.\nThe Company's indenture covenants include customary limitations on liens, sale and leaseback transactions, and mergers and consolidations, subject to certain limitations. The Five-Year Revolving Credit Facility and the 364-Day Revolving Credit Facility contain a financial covenant, typical for companies with similar credit ratings, requiring that the ratio of Total Indebtedness to Total Capitalization for the Company and its consolidated subsidiaries not exceed 0.60. At September 30, 2025, the Company was in compliance with this financial covenant.\nSummary of Cash Flows\nThe Company’s cash flows from operating, investing and financing activities from continuing operations and cash used in discontinued operations, as reflected in the interim Consolidated Statements of Cash Flows, are summarized in the following table.\n59\nTable of Contents\nCash Flow Summary\nNine Months Ended\nIn millions\nSeptember 30, 2025\nSeptember 30, 2024\nCash provided by (used for) from continuing operations:\nOperating activities\n$\n1,260 \n$\n1,517 \nInvesting activities\n$\n(540)\n$\n(683)\nFinancing activities\n$\n1,155 \n$\n(1,665)\nCash provided by (used in) discontinued operations\n$\n36 \n$\n(277)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n$\n23 \n$\n(9)\nCash Flows from Operating Activities - Continuing Operations\nIn the first nine months of 2025, cash provided by operating activities of continuing operations was $1,260 million, compared with $1,517 million in the same period last year.\n \nThe decrease in cash provided by operating activities of continuing operations is primarily from an increase in cash used by transaction costs related to the Electronics Separation, net working capital and net impact from changes in variable compensation.\nThe table below reflects net working capital on a continuing operations basis:\nNet Working Capital\nSeptember 30, 2025\nDecember 31, 2024\nIn millions (except ratio)\nCurrent assets\n$\n8,208 \n$\n5,750 \nCurrent liabilities\n4,754 \n4,612 \nNet working capital\n$\n3,454 \n$\n1,138 \nCurrent ratio\n1.73:1\n1.25:1\nCash Flows from Investing Activities - Continuing Operations\nIn the first nine months of 2025, cash used for investing activities of continuing operations was $540 million, compared with $683 million in the first nine months of 2024.\n \nThe decrease in cash used for investing activities of continuing operations is primarily attributable to a lower cash outflow from the Sinochem acquisition in 2025 compared to the Donatelle acquisition in 2024.This is partially offset by an increase in capital expenditures driven by timing of the projects.\nCash Flows from Financing Activities - Continuing Operations\nIn the first nine months of 2025, cash provided by financing activities of continuing operations was $1,155 million compared with cash used of $1,665 million in the same period last year. The increase in cash provided by financing activities of continuing operations is primarily attributable to the issuance of Qnity Notes in 2025, compared with the absence of share buyback activities and partial redemption of the 2038 notes in the first nine months of 2024.\nCash Flows from Discontinued Operations\nIn the first nine months of 2025 cash provided by discontinued operations was $36 million compared with cash used in discontinued operations of $277 million in the same period last year. The increase in cash provided by discontinued operations primarily relates to the absence of $408 million related to the Water District Settlement Fund that was removed from Restricted cash and cash equivalents in the second quarter 2024 upon final judgment and the receipt of an indemnification in the third quarter of 2025 related to a divested business. Refer to Notes 4 and 14 to the interim Consolidated Financial Statements for additional information.\nDividends\nOn February 21, 2025, the Board of Directors declared a first quarter 2025 dividend of $0.41 per share, paid on March 17, 2025, to shareholders of record on March 3, 2025.\nOn April 29, 2025, the Board of Directors declared a second quarter 2025 dividend of $0.41 per share, paid on June 16, 2025, to shareholders of record on May 30, 2025.\nOn June 25, 2025, the Company announced that its Board declared a third quarter 2025 dividend of $0.41 per share payable on September 15, 2025, to shareholders of record on August 29, 2025.\nOn November 6, 2025, the Company announced that its Board declared a fourth quarter dividend for New DuPont of $0.20 per share payable on December 15, 2025, to shareholders of record on November 28, 2025.\n60\nTable of Contents\nShare Buyback Programs\nIn the third quarter of 2023, DuPont entered into new accelerated share repurchase agreements with three intended financial counterparties to repurchase an aggregate of $2 billion of common stock (“$2B ASR Transaction”). In the first quarter of 2024, the $2B ASR Transaction was completed. In total, the Company repurchased 27.9 million shares at an average price of $71.67 per share under the $2B ASR Transaction. The completion of the $2B ASR Transaction effectively completed the $5B Share Buyback Program and the Company's stock repurchase authorization.\nIn the first quarter 2024, the Company’s Board of Directors approved a new share repurchase program authorizing the repurchase and retirement of up to $1 billion of common stock (“the $1B Share Buyback Program”). As described below, the Company repurchased and retired $500 million of common stock under the $1B Share Buyback Program prior to its expiration on June 30, 2025.\nIn the first quarter 2024, DuPont entered an ASR agreement with one counterparty for the repurchase of $500 million of common stock (“Q1 24 ASR Transaction”). In the second quarter 2024, the Q1 2024 ASR Transaction was completed. In total, the Company repurchased 6.9 million shares at an average price of $71.96 per share under the Q1 2024 ASR Transaction.\nOn November 6, 2025, the Company announced that its Board of Directors, post the Electronics Separation, approved a new share repurchase authorization of up to $2 billion of common stock (the “$2B Authorization”). Under the $2B Authorization, repurchases may be made from time to time on the open market at prevailing market prices or in privately negotiated transactions off market, which may include accelerated share repurchase transactions. The $2B Authorization will terminate once the authorized amount of shares have been repurchased and retired or when terminated by the Board of Directors. The timing and number of shares to be repurchased will depend on factors such as the share price, economic and market conditions, and corporate and regulatory requirements. The Company expects to launch an accelerated share repurchase transaction under the authorization to repurchase $500 million, in aggregate, of common stock.\nPension and Other Post-Employment Plans \nDuPont expects to make additional contributions in the aggregate of approximately $17 million by year-end 2025 to pension and other post-employment benefit plans, including plans held in discontinued operations. Any such contribution could be funded by existing cash balances and/or cash from other available sources of liquidity.\nRestructuring\nIn March 2025, the Company approved targeted restructuring actions to streamline, right-size and optimize specific organizational structures in preparation for the planned separation of the future Electronics company and the future New DuPont company, (the \"Transformational Separation-Related Restructuring Program\"). The Company recorded pre-tax restructuring charges of $67 million inception-to-date, consisting of severance and related benefit costs of $52 million, $6 million of asset related charges and $9 million of accelerated restricted stock compensation expense. Total liabilities related to the Transformational Separation-Related Restructuring Program were $47 million at September 30, 2025 recognized in \"Accrued and other current liabilities\" in the interim Condensed Consolidated Balance Sheets. The Company expects the program to be substantially complete by the end of 2026.\nIn December 2023, the Company approved targeted restructuring actions to capture near-term cost reductions due to macroeconomic factors as well as to further simplify certain organizational structures following the Spectrum Acquisition and Delrin® Divestiture (the \"2023-2024 Restructuring Program\"). As a result, the Company recorded pre-tax restructuring charges of $174 million inception-to-date, consisting of severance and related benefit costs of $101 million and asset related charges of $73 million. At September 30, 2025 and December 31, 2024, total liabilities related to the 2023-2024 Restructuring Program were $14 million and $36 million, respectively, for severance and related benefit costs, recognized in “Accrued and other current liabilities” in the interim Consolidated Balance Sheets. Inventory write-offs for plant line closures in connection with the 2023-2024 Restructuring Program were $26 million in “Cost of Sales” within the interim Consolidated Statements of Operations for the nine months ended September 30, 2024.\nSee Note 6 to the interim Consolidated Financial Statements for more information on the Company's restructuring programs.\n61\nTable of Contents"
}