{
  "source_file": "ddog-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our unaudited condensed consolidated financial statements and related notes appearing elsewhere in this Quarterly Report on Form 10-Q and our audited consolidated financial statements and the related notes and the discussion under the heading “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, or the Annual Report. This discussion, particularly information with respect to our future results of operations or financial condition, business strategy and plans and objectives of management for future operations, includes forward-looking statements that involve risks and uncertainties as described under the heading “Special Note Regarding Forward-Looking Statements” in this Quarterly Report on Form 10-Q. You should review the disclosure under the heading “Risk Factors” in this Quarterly Report on Form 10-Q for a discussion of important factors that could cause our actual results to differ materially from those anticipated in these forward-looking statements.\nOverview\nDatadog is the observability and security platform for cloud applications.\nOur SaaS platform integrates and automates infrastructure monitoring, application performance monitoring, log management, user experience monitoring, cloud security, and many other capabilities to provide unified, real-time observability and security for our customers’ entire technology stack. Datadog is used by organizations of all sizes and across a wide range of industries to enable digital transformation and cloud migration, drive collaboration among development, operations, security and business teams, accelerate time to market for applications, reduce time to problem resolution, secure applications and infrastructure, understand user behavior and track key business metrics.\nWe generate revenue from the sale of subscriptions to customers using our cloud-based platform. The terms of our subscription agreements are primarily monthly or annual. Customers also have the option to purchase additional products, such as additional containers to monitor, custom metrics packages, anomaly detection and app analytics. Professional services are generally not required for the implementation of our products and revenue from such services has been immaterial to date.\nWe employ a land-and-expand business model centered around offering products that are easy to adopt and have a very short time to value. Our customers can expand their footprint with us on a self-service basis. Our customers often significantly increase their usage of the products they initially buy from us and expand their usage to other products we offer on our platform. We grow with our customers as they expand their workloads in the public and private cloud.\nAs of September 30, 2025, we had $540.6 million in cash and cash equivalents and $3.6 billion in marketable securities. We generated revenue of $885.7 million and $690.0 million in the three months ended September 30, 2025 and 2024, respectively, representing year-over-year growth of 28%. For the nine months ended September 30, 2025 and 2024, our revenue was $2,474.0 million and $1,946.5 million, respectively, representing year-over-year growth of 27%. Substantially all of our revenue is from subscription software sales. While we have continued to make significant expenditures and investments, including in personnel-related costs, sales and marketing, infrastructure and operations, we generated net income of $33.9 million and $51.7 million for the three months ended September 30, 2025 and 2024, respectively, and $61.2 million and $138.2 million for the nine months ended September 30, 2025 and 2024, respectively. Our operating cash flow was $723.1 million and $605.4 million for the nine months ended September 30, 2025 and 2024, respectively. Our free cash flow was $623.7 million and $534.1 million for the nine months ended September 30, 2025 and 2024, respectively. See the section titled “—Liquidity and Capital Resources—Non-GAAP Free Cash Flow” below.\nUnfavorable conditions in the economy both in the United States and abroad may negatively affect the growth of our business and our results of operations. For example, macroeconomic events including changes in trade policies, such as trade wars, tariffs or other trade restrictions or the threat of such actions, fluctuating inflation and interest rates, and the conflicts in Ukraine and the Middle East have led to economic uncertainty. Historically, during periods of economic uncertainty and downturns, businesses may slow spending on information technology, which may impact our business and our customers’ businesses.\nDue to our subscription model, the effect of macroeconomic conditions may not be fully reflected in our results of operations until future periods. However, if economic uncertainty increases or the global economy worsens, our business, financial condition and results of operations may be harmed. For further discussion of the potential impacts of macroeconomic events on our business, financial condition, and operating results, see “Risk Factors” included in Part II, Item 1A of this report.\n26\nFactors Affecting Our Performance\nAcquiring New Customers\nWe believe there is substantial opportunity to continue to grow our customer base. We intend to drive new customer acquisition by continuing to invest significantly in sales and marketing to engage our prospective customers, increase brand awareness and drive adoption of our platform and products. We also plan to continue to invest in building brand awareness within the development and operations communities. As of September 30, 2025, we had approximately 32,000 customers spanning organizations of a broad range of sizes and industries, compared to approximately 29,200 as of September 30, 2024. Our ability to attract new customers will depend on a number of factors, including the effectiveness and pricing of our products, offerings of our competitors and the effectiveness of our marketing efforts.\nWe define the number of customers as the number of accounts with a unique account identifier for which we have an active subscription in the period indicated. Users of our free trials or tier are not included in our customer count. A single organization with multiple divisions, segments or subsidiaries is generally counted as a single customer. However, in some cases where they have separate billing terms, we may count separate divisions, segments or subsidiaries as multiple customers.\nExpanding Within Our Existing Customer Base\nOur base of customers represents a significant opportunity for further sales expansion. As of September 30, 2025, we had approximately 4,060 customers with annual run-rate revenue, or ARR, of $100,000 or more, representing 89% of our ARR, up from 3,490 customers as of September 30, 2024, representing 88% of our ARR. We monitor our number of customers with ARR of $100,000 or more, and believe it is useful to investors, as an indicator of our ability to grow the number of customers that are exceeding this ARR threshold. We define ARR as the annual run-rate revenue of subscription agreements from all customers at a point in time. We calculate ARR by taking the monthly run-rate revenue, or MRR, and multiplying it by 12. MRR for each month is calculated by aggregating, for all customers during that month, monthly revenue from committed contractual amounts, additional usage, usage from subscriptions for a committed contractual amount of usage that is delivered as used and monthly subscriptions. ARR and MRR should be viewed independently of revenue, and do not represent our revenue under GAAP on a monthly or annualized basis, as they are operating metrics that can be impacted by contract start and end dates and renewal rates. ARR and MRR are not intended to be replacements or forecasts of revenue.\nA further indication of the propensity of our customer relationships to expand over time is our dollar-based net retention rate, which compares our ARR from the same set of customers in one period, relative to the year-ago period. As of September 30, 2025, our trailing 12-month dollar-based net retention rate was about 120%. As of September 30, 2024, our trailing 12-month dollar-based net retention rate was mid-110%'s. The increase in our trailing 12-month dollar-based net retention rate was attributable to increased usage growth from existing customers. We calculate dollar-based net retention rate as of a period end by starting with the ARR from the cohort of all customers as of 12 months prior to such period-end, or the Prior Period ARR. We then calculate the ARR from these same customers as of the current period-end, or the Current Period ARR. Current Period ARR includes any expansion and is net of contraction or attrition over the last 12 months but excludes ARR from new customers in the current period. We then divide the total Current Period ARR by the total Prior Period ARR to arrive at the point-in-time dollar-based net retention rate. We then calculate the weighted average of the trailing 12-month point-in-time dollar-based net retention rates, to arrive at the trailing 12-month dollar-based net retention rate.\nWe believe that our land-and-expand business model allows us to efficiently increase revenue from our existing customer base. Our customers often expand the deployment of our platform across large teams and more broadly within the enterprise as they migrate more workloads to the cloud, find new use cases for our platform, and generally realize the benefits of our platform. We intend to continue to invest in enhancing awareness of our brand and developing more products, features and functionality, which we believe are important factors to achieve widespread adoption of our platform. Our ability to increase sales to existing customers will depend on a number of factors, including our customers’ satisfaction with our solution, competition, pricing and overall changes in our customers’ spending levels.\n27\nSustaining Innovation and Technology Leadership\nOur success is dependent on our ability to sustain innovation and technology leadership in order to maintain our competitive advantage. We believe that we have built a highly differentiated platform that will position us to further extend the adoption of our platform and products. Datadog is frequently deployed across a customer’s entire infrastructure, making it ubiquitous. Datadog is a daily part of the lives of developers, operations engineers and business leaders. We employ a land-and-expand business model centered around offering products that are easy to adopt and have a very short time to value. Our efficient go-to-market model enables us to prioritize significant investment in innovation. We have demonstrated the success of our platform approach, through expansion beyond our initial infrastructure monitoring solution to include over 20 products. Approximately 84% of our customers were using two or more products as of September 30, 2025, consistent with approximately 83% a year earlier. Additionally, as of September 30, 2025, approximately 54% of our customers were using four or more products, up from approximately 49% a year earlier, approximately 31% of our customers were using six or more products, up from 26% a year earlier, and approximately 16% of our customers were using eight or more products, up from 12% a year earlier. We believe these metrics indicate strong expansion of product adoption across our platform.\nWe intend to continue to invest in building additional products, features and functionality that expand our capabilities and facilitate the extension of our platform to new use cases. We also intend to continue to evaluate strategic acquisitions and investments in businesses and technologies to drive product and market expansion. Our future success is dependent on our ability to successfully develop, market and sell existing and new products to both new and existing customers.\nExpanding Internationally\nWe believe there is a significant opportunity to expand usage of our platform outside of North America. Revenue, as determined based on the billing address of our customers, from regions outside of North America was approximately 29% and  30% of our total revenue for the nine months ended September 30, 2025 and 2024, respectively. In addition, we have made and plan to continue to make significant investments to expand geographically, particularly in EMEA and APAC. Although these investments may adversely affect our operating results in the near term, we believe that they will contribute to our long-term growth. Beyond North America, we now have sales presence internationally, primarily in Amsterdam, Dublin, London, Paris, Seoul, Singapore, Sydney, and Tokyo.\nTax Law Changes\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the United States. The OBBBA makes permanent several provisions of the Tax Cuts and Jobs Act, including 100% bonus depreciation for certain qualified property, and reverses the requirement under the Tax Cuts and Jobs Act to capitalize and amortize domestic research and experimentation (“R&E”) expenses. Beginning with tax years after December 31, 2024, taxpayers may again deduct such expenses in the year incurred. The OBBBA also introduced an election to accelerate any unamortized domestic R&E expenditures over a one- or two-year period beginning with the 2025 tax year and includes modifications to the international tax framework.\nIn accordance with ASC 740, \nAccounting for Income Taxes\n, the impacts of the OBBBA are reflected in the Company’s results for the quarter ended September 30, 2025. The enactment of the OBBBA reduced the Company’s forecasted U.S. income tax expense for 2025. These changes did not affect the Company’s U.S. net deferred tax assets or liabilities, as the Company continues to maintain a full valuation allowance against those balances.\nComponents of Results of Operations\nRevenue\nWe generate revenue from the sale of subscriptions to customers using our cloud-based platform. The terms of our subscription agreements are primarily monthly, annual or multi-year, with the majority of our revenue coming from annual subscriptions. Our customers can enter into a subscription for a committed contractual amount of usage that is apportioned ratably on a monthly basis over the term of the subscription period, a subscription for a committed contractual amount of usage that is delivered as used, or a monthly subscription based on usage. To the extent that our customers’ usage exceeds the committed contracted amounts under their subscriptions, either on a monthly basis in the case of a ratable subscription or once the entire commitment is used in the case of a delivered-as-used subscription, they are charged for their incremental usage.\nUsage is measured primarily by the number of hosts or by the volume of data indexed. A host is generally defined as a server, either in the cloud or on-premise. Our infrastructure monitoring, APM and \nnetwork performance monitoring\n products are priced per host, our logs product is priced primarily per log events indexed and secondarily by events ingested. \nCustomers \n28\nalso have the option to purchase additional products, such as additional container or serverless monitoring, custom metrics packages, anomaly detection, synthetic monitoring and app analytics.\nIn the case of subscriptions for committed contractual amounts of usage, revenue is recognized ratably over the term of the subscription agreement, generally beginning on the date that our platform is made available to a customer. As a result, much of our revenue is generated from subscriptions entered into during previous periods. Consequently, any decreases in new subscriptions or renewals in any one period may not be immediately reflected as a decrease in revenue for that period, but could negatively affect our revenue in future quarters. This also makes it difficult for us to rapidly increase our revenue through the sale of additional subscriptions in any period, as revenue is recognized over the term of the subscription agreement. In the case of a subscription for a committed contractual amount of usage that is delivered as used, a monthly subscription based on usage, or usage in excess of a ratable subscription, we recognize revenue as the product is used, which may lead to fluctuations in our revenue and results of operations. In addition, historically, we have experienced seasonality in new customer bookings, as we typically enter into a higher percentage of subscription agreements with new customers in the fourth quarter of the year.\nDue to ease of implementation of our products, professional services generally are not required and revenue from such services has been immaterial to date.\nCost of Revenue\nCost of revenue primarily consists of expenses related to providing our products to customers, including payments to our third-party cloud infrastructure providers for hosting our software, personnel-related expenses for operations and global support, including salaries, benefits, bonuses and stock-based compensation, payment processing fees, information technology, depreciation and amortization related to the amortization of acquired intangibles and internal-use software and other overhead costs such as allocated facilities.\nWe intend to continue to invest additional resources in our platform infrastructure and our customer support and success organizations to expand the capability of our platform and ensure that our customers are realizing the full benefit of our platform and products. The level, timing and relative investment in our infrastructure could affect our cost of revenue in the future.\nGross Profit and Gross Margin\nGross profit represents revenue less cost of revenue. Gross margin is gross profit expressed as a percentage of revenue. Our gross margin may fluctuate from period to period as our revenue fluctuates, and as a result of the timing and amount of investments to expand our products and geographical coverage.\nOperating Expenses\nOur operating expenses consist of research and development, sales and marketing and general and administrative expenses. Personnel costs are the most significant component of operating expenses and consist of salaries, benefits, bonuses, stock-based compensation expense and sales commissions. Operating expenses also include overhead costs for facilities and shared IT-related expenses, including depreciation expense.\nResearch and Development\nResearch and development expense consists primarily of personnel costs for our engineering, service and design teams. Additionally, research and development expense includes contractor fees, depreciation and amortization and allocated overhead costs. Research and development costs are expensed as incurred, with the exception of certain software development costs which are eligible for capitalization. We expect that our research and development expense will increase in absolute dollars as our business grows, particularly as we incur additional costs related to continued investments in our platform.\nSales and Marketing\nSales and marketing expense consists primarily of personnel costs for our sales and marketing organization, costs of general marketing and promotional activities, including the free tier and free introductory trials of our products, travel-related expenses, amortization of acquired customer relationships, and allocated overhead costs. Sales commissions earned by our sales force are deferred and amortized on a straight-line basis over the expected period of benefit, which we have determined to be four years. We expect that our sales and marketing expense will increase in absolute dollars as we expand our sales and marketing efforts.\n29\nGeneral and Administrative\nGeneral and administrative expense consists primarily of personnel costs for finance, legal, human resources, and other administrative functions. In addition, general and administrative expense includes non-personnel costs, such as legal, accounting and other professional fees, hardware and software costs, certain tax, license and insurance-related expenses and allocated overhead costs. We expect that our general and administrative expense will increase in absolute dollars as our business grows. \nOther Income, Net\nOther income, net consists of interest income, primarily due to income earned on money market funds included in cash and cash equivalents and on marketable securities, partially offset by interest expense due on the Notes and amortization of premiums on our marketable securities.\nProvision for Income Taxes\nProvision for income taxes consists of U.S. federal and state income taxes and income taxes in certain foreign jurisdictions in which we conduct business. We recorded a full valuation allowance on our federal and state deferred tax assets as we have concluded that it is not more likely than not that the deferred tax assets will be realized.\nResults of Operations\nThe following table sets forth our consolidated statements of operations data for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in thousands)\nRevenue\n$\n885,651 \n$\n690,016 \n$\n2,473,964 \n$\n1,946,548 \nCost of revenue \n(1)(2)(3)\n176,457 \n137,756 \n500,063 \n371,353 \nGross profit\n709,194 \n552,260 \n1,973,901 \n1,575,195 \nOperating expenses\nResearch and development \n(1)(3)\n401,982 \n291,802 \n1,130,525 \n836,389 \nSales and marketing \n(1)(2)(3)\n238,729 \n187,772 \n692,046 \n548,658 \nGeneral and administrative \n(1)(3)(4)\n74,292 \n52,408 \n205,059 \n145,256 \nTotal operating expenses\n715,003 \n531,982 \n2,027,630 \n1,530,303 \nOperating (loss) income\n(5,809)\n20,278 \n(53,729)\n44,892 \nOther income:\nInterest expense \n(5)\n(2,421)\n(1,574)\n(8,459)\n(4,425)\nInterest income and other income, net\n43,897 \n37,432 \n135,739 \n109,647 \nOther income, net\n41,476 \n35,858 \n127,280 \n105,222 \nIncome before provision for income taxes\n35,667 \n56,136 \n73,551 \n150,114 \nProvision for income taxes\n1,782 \n4,439 \n12,377 \n11,962 \nNet income\n$\n33,885 \n$\n51,697 \n$\n61,174 \n$\n138,152 \n_________________\n(1)\nIncludes stock-based compensation expense as follows:\n30\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in thousands)\nCost of revenue\n$\n8,038 \n$\n6,249 \n$\n21,472 \n$\n18,169 \nResearch and development\n124,288 \n90,507 \n342,468 \n266,025 \nSales and marketing\n41,463 \n30,749 \n113,030 \n88,481 \nGeneral and administrative\n26,769 \n14,685 \n68,315 \n39,200 \nTotal\n$\n200,558 \n$\n142,190 \n$\n545,285 \n$\n411,875 \n_________________\n(2)\nIncludes amortization of acquired intangibles expense as follows:\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(in thousands)\nCost of revenue\n$\n1,451 \n$\n1,230 \n$\n3,863 \n$\n4,538 \nSales and marketing\n277 \n208 \n668 \n618 \nTotal\n$\n1,728 \n$\n1,438 \n$\n4,531 \n$\n5,156 \n_________________\n(3)    Includes employer payroll taxes on employee stock transactions as follows:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in thousands)\nCost of revenue\n$\n169 \n$\n118 \n$\n520 \n$\n378 \nResearch and development\n8,177 \n6,316 \n29,578 \n23,724 \nSales and marketing\n1,480 \n1,060 \n4,409 \n3,821 \nGeneral and administrative\n1,061 \n1,621 \n6,010 \n5,199 \nTotal\n$\n10,887 \n$\n9,115 \n$\n40,517 \n$\n33,122 \n_________________\n(4)    Includes M&A transaction costs as follows:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in thousands)\nGeneral and administrative\n$\n— \n$\n— \n$\n1,373 \n$\n— \n_________________\n(5)    Includes amortization of issuance costs as follows:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in thousands)\nInterest expense\n$\n1,046 \n$\n912 \n$\n4,556 \n$\n2,672 \n \n31\nThe following table sets forth our consolidated statements of operations data expressed as a percentage of revenue for the periods indicated:\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(as a percentage of total revenue\n(1)\n)\nRevenue\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nCost of revenue\n20 \n20 \n20 \n19 \nGross profit\n80 \n80 \n80 \n81 \nOperating expenses\nResearch and development\n45 \n42 \n46 \n43 \nSales and marketing\n27 \n27 \n28 \n28 \nGeneral and administrative\n8 \n8 \n8 \n7 \nTotal operating expenses\n81 \n77 \n82 \n78 \nOperating (loss) income\n(1)\n3 \n(2)\n3 \nOther income:\nInterest expense\n0 \n0 \n0 \n0 \nInterest income and other income, net\n5 \n5 \n5 \n5 \nOther income, net\n5 \n5 \n5 \n5 \nIncome before provision for income taxes\n4 \n8 \n3 \n8 \nProvision for income taxes\n0 \n1 \n1 \n1 \nNet income\n4 \n%\n7 \n%\n2 \n%\n7 \n%\n(1)\nCertain items may not total due to rounding.\nComparison of the Three Months Ended September 30, 2025 and 2024\nRevenue\nThree Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n% Change\n \n(dollars in thousands)\n \n \nRevenue\n$\n885,651 \n$\n690,016 \n$\n195,635 \n28 \n%\nRevenue increased by $195.6 million, or 28%, for the \nthree months ended September 30, 2025\n compared to the \nthree months ended September 30, 2024\n. Approximately 75% of the increase in revenue was attributable to growth from existing customers, and the remaining 25% was attributable to growth from new customers.\nCost of Revenue and Gross Margin\nThree Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(dollars in thousands)\nCost of revenue\n$\n176,457 \n$\n137,756 \n$\n38,701 \n28 \n%\nGross margin\n80 \n%\n80 \n%\n— \n%\nCost of revenue increased by $38.7 million, or 28%, for the \nthree months ended September 30, 2025 \ncompared to the\n three months ended September 30, 2024. \nThis increase was primarily due to an increase of $31.6 million in third-party cloud infrastructure hosting and software costs and an increase of $5.6 million in personnel costs including allocated overhead costs as a result of increased headcount.\nOur gross margin remained flat for the three months ended September 30, 2025 compared to the three months ended September 30, 2024, primarily as a result of revenue growing in proportion to the growth of our third-party cloud infrastructure provider costs.\n32\nResearch and Development\nThree Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(dollars in thousands)\nResearch and development\n$\n401,982\n$\n291,802\n$\n110,180 \n38 \n%\nPercentage of revenue\n45 \n%\n42 \n%\nResearch and development expense increased by $110.2 million, or 38%, for the \nthree months ended September 30, 2025\n compared to the\n three months ended September 30, 2024. \nThis increase was primarily due to an increase of $95.1 million in personnel costs including allocated overhead costs for our engineering, product and design teams as a result of increased headcount and an increase of $11.4 million in cloud infrastructure-related investments.\nSales and Marketing\nThree Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n% Change\n \n(dollars in thousands)\n \n \nSales and marketing\n$\n238,729\n$\n187,772\n$\n50,957 \n27 \n%\nPercentage of revenue\n27 \n%\n27 \n%\n \n \nSales and marketing expense increased by $51.0 million, or 27%, for the three months ended September 30, 2025 compared to the three months ended September 30, 2024. \nThis increase was primarily due to an increase of $43.2 million in personnel costs including allocated overhead costs for our sales and marketing organization as a result of increased headcount and increased variable compensation for our sales personnel and an increase of $4.3 million in advertising, sales, marketing and promotional activities.\nGeneral and Administrative\nThree Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n% Change\n \n(dollars in thousands)\nGeneral and administrative\n$\n74,292\n$\n52,408\n$\n21,884 \n42 \n%\nPercentage of revenue\n8 \n%\n8 \n%\nGeneral and administrative expense increased by $21.9 million, or 42%, for the three months ended September 30, 2025 compared to the three months ended September 30, 2024.\n This increase was primarily due to an increase of $16.6 million in personnel costs including allocated overhead costs as a result of increased headcount, and an increase of $3.9 million in legal and other professional services expenses.\nOther Income, Net\nThree Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(dollars in thousands)\nOther income, net\n$\n41,476 \n$\n35,858 \n$\n5,618 \n16 \n%\nPercentage of revenue\n5 \n%\n5 \n%\nOther income, net increased by $5.6 million, or 16%, for the \nthree months ended September 30, 2025\n compared to the\n three months ended September 30, 2024\n.\n \nThis increase was primarily driven by an increase of $5.5 million in interest income, mainly due to income earned from investments in marketable securities.\n33\nComparison of the Nine Months Ended September 30, 2025 and 2024\nRevenue\nNine Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(dollars in thousands)\nRevenue\n$\n2,473,964 \n$\n1,946,548 \n$\n527,416 \n27 \n%\nRevenue increased by $527.4 million, or 27%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\n. Approximately 80% of the increase in revenue was attributable to growth from existing customers, and the remaining 20% was attributable to growth from new customers.\nCost of Revenue and Gross Margin\nNine Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(dollars in thousands)\nCost of revenue\n$\n500,063\n$\n371,353\n$\n128,710 \n35 \n%\nGross margin\n80 \n%\n81 \n%\nCost of revenue increased by $128.7 million, or 35%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\n. This increase was primarily due to an increase of $112.7 million in third-party cloud infrastructure hosting and software costs and an increase of $14.4 million in personnel costs including allocated overhead costs as a result of increased headcount.\nOur gross margin decreased for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily as a result of increased spend with our third-party cloud infrastructure providers.\nResearch and Development\nNine Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(dollars in thousands)\nResearch and development\n$\n1,130,525\n$\n836,389\n$\n294,136 \n35 \n%\nPercentage of revenue\n46 \n%\n43 \n%\nResearch and development expense increased by $294.1 million, or 35%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. \nThis increase was primarily due to an increase of $240.0 million in personnel costs including allocated overhead costs for our engineering, product and design teams as a result of increased headcount and an increase of $46.6 million in cloud infrastructure-related investments.\nSales and Marketing\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n% Change\n \n(dollars in thousands)\nSales and marketing\n$\n692,046\n$\n548,658\n$\n143,388 \n26 \n%\nPercentage of revenue\n28 \n%\n28 \n%\nSales and marketing expense increased by $143.4 million, or 26%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. This increase was primarily due to an increase of $115.0 million in personnel costs including allocated overhead costs for our sales and marketing organization as a result of increased \n34\nheadcount and increased variable compensation for our sales personnel and an increase of $20.7 million in advertising, sales, marketing and promotional activities.\nGeneral and Administrative\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n% Change\n \n(dollars in thousands)\nGeneral and administrative\n$\n205,059\n$\n145,256\n$\n59,803 \n41 \n%\nPercentage of revenue\n8 \n%\n7 \n%\nGeneral and administrative expense increased by $59.8 million, or 41%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. \nThis increase was primarily due to an increase of $44.6 million in personnel costs including allocated overhead costs as a result of increased headcount, and an increase of $10.6 million in legal and other professional services expenses.\nOther Income, Net\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n% Change\n \n(dollars in thousands)\nOther income, net\n$\n127,280 \n$\n105,222 \n$\n22,058 \n21 \n%\nPercentage of revenue\n5 \n%\n5 \n%\nOther income, net increased by $22.1 million, or 21%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. \nThis increase was primarily driven by an increase of $34.3 million in interest income, mainly due to income earned from investments in marketable securities. This amount was partially offset by a decrease of $8.2 million in other income mainly due to fluctuations related to foreign currency exchange rates.\nLiquidity and Capital Resources\nOur largest source of operating cash is cash collection from sales of subscriptions to our customers. Our primary uses of cash from operating activities are for personnel expenses, hosting expenses, facility expenses, and marketing expenses. We generated positive cash flows from operations during the nine months ended September 30, 2025 and 2024. When assessing sources of liquidity, we also include cash and cash equivalents of $540.6 million and marketable securities of $3.6 billion as of September 30, 2025. We believe that our existing cash and cash equivalents, marketable securities and cash flow from operations will be sufficient to support our cash requirements for the next 12 months and beyond.\nOur working capital requirements principally consist of workforce salaries, bonuses, commissions, and benefits and, to a lesser extent, cancellable and non-cancelable licenses and services arrangements that are integral to our business operations, and operating lease obligations.\n Our principal commitments consist of \npurchase commitments for business operations, operating lease obligations\n, and obligations to pay the Notes’ coupons\n and \nprincipal\n. Purchase commitments for business operations are primarily related to cloud hosting and other software-based services. \nWe have also issued long-term debt to finance our business. In June 2020 and December 2024, we issued $747.5 million aggregate principal amount of the 2025 Notes and $1.0 billion aggregate principal amount of the 2029 Notes, respectively, in private placements to qual\nified institutional buyers pursuant to Rule 144A under the Securities Act. The total net proceeds from the sale of the 2025 Notes and the 2029 Notes, after deducting the initial purchasers’ discounts and debt issuance costs, were approximately $730.2 million and $979.1 million, respectively. We used $196.8 million of the net proceeds from the offering of the 2029 Notes to repurchase approximately $112.0 million in aggregate principal amount of the 2025 Notes, including accrued and unpaid interest, in privately negotiated transactions. In connection with the partial retirement of the 2025 Notes, we entered into a termination agreement relating to a number of options corresponding to the number of 2025 Notes retired. We received approximately $54.7 million in connection with such termination agreements. In addition, we may from time to time seek to retire or purchase the 2029 Notes, through cash purchases and/or exchanges for equity securities, in open market purchases, privately negotiated transactions or otherwise.\n35\nThe 2025 Notes matured on June 15, 2025. During the period from April 1, 2025 through the close of business on June 12, 2025, holders of the 2025 Notes elected to convert all outstanding aggregate principal amount of 2025 Notes in accordance with the terms of the indenture governing the 2025 Notes. We settled these conversions with aggregate cash payments totaling approximately $634.1 million and the issuance of approximately 1,354,569 shares of our Class A common stock. In June 2025, we received approximately 1,360,738 shares of Class A common stock from the settlement of the capped call transactions we entered into in connection with the issuance of the 2025 Notes with the relevant option counterparties, which we retired. \nDuring the nine months ended September 30, 2025, there have been no material changes outside the ordinary course of business to our contractual obligations and commitments, as disclosed in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of the Annual Report.\nCash Flows\nThe following table shows a summary of our cash flows for the periods presented:\nNine Months Ended\nSeptember 30,\n2025\n2024\n(in thousands)\nCash provided by operating activities\n$\n723,066 \n$\n605,375 \nCash used in investing activities\n(836,626)\n(627,476)\nCash (used in) provided by financing activities\n(602,530)\n27,659 \nOperating Activities\nNet cash provided by operating activities for the nine months ended September 30, 2025 increased by $117.7 million compared to the nine months ended September 30, 2024, primarily driven by an \nincrease in non-cash charges of $162.9 million, an increase in accrued expenses and other liabilities of $38.1 million, and an increase in accounts receivable of  $27.0 million. The increase in non-cash charges related primarily to an increase of $133.4 million in stock-based compensation as we continued to increase headcount to support the growth of the business. The increase in cash provided by operating activities was partially offset by a decrease in net income of $77.0 million and a decrease in deferred contract costs of $27.2 million.\nInvesting Activities\nNet cash used in investing activities for the nine months ended September 30, 2025 increased by $209.2 million compared to the nine months ended September 30, 2024, primarily driven by an increase of $371.4 million in the purchases of marketable securities and an increase of $116.6 million in cash paid for the acquisition of businesses net of cash acquired. The increase in cash used in investing activities was partially offset by an increase of $293.9 million in proceeds from maturities of marketable securities.\nFinancing Activities\nNet cash (used in) provided by financing activities for the nine months ended September 30, 2025 decreased $630.2 million compared to the nine months ended September 30, 2024, primarily due to the repayment of the 2025 Notes for $635.5 million.\nNon-GAAP Free Cash Flow\nWe report our financial results in accordance with GAAP. To supplement our condensed consolidated financial statements, we provide investors with the amount of free cash flow, which is a non-GAAP financial measure. Free cash flow represents net cash provided by operating activities, reduced by capital expenditures and capitalized software development costs, if any. Free cash flow is a measure used by management to understand and evaluate the strength of our liquidity and future ability to generate cash that can be used for strategic opportunities or investing in our business. The reduction of capital expenditures and amounts capitalized for software development facilitates comparisons of our liquidity on a period-to-period basis and excludes items that we do not consider to be indicative of our liquidity. Nevertheless, our use of free cash flow has limitations as an analytical tool, and you should not consider it in isolation or as a substitute for analysis of our financial results as reported under GAAP. Further, our definition of free cash flow may differ from the definitions used by other companies and \n36\ntherefore comparability may be limited. You should consider free cash flow alongside our other GAAP-based financial performance measures, such as net cash used in operating activities, and our other GAAP financial results.\nThe following table presents a reconciliation of free cash flow to net cash provided by operating activities, the most directly comparable financial measure calculated in accordance with GAAP, for each of the periods indicated:\nNine Months Ended\nSeptember 30,\n2025\n2024\n(in thousands)\nNet cash provided by operating activities\n$\n723,066 \n$\n605,375 \nLess: Purchases of property and equipment\n(40,686)\n(26,958)\nLess: Capitalized software development costs\n(58,684)\n(44,286)\nFree cash flow\n$\n623,696 \n$\n534,131 \nCritical Accounting Estimates\nOur condensed consolidated financial statements are prepared in accordance with GAAP. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, expenses and related disclosures. We evaluate our estimates and assumptions on an ongoing basis. Our estimates are based on historical experience and various other assumptions that we believe to be reasonable under the circumstances. Our actual results could differ from these estimates.\nThere have been no material changes to our critical accounting policies from those disclosed in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of the Annual Report, except as noted below.\nChange in Accounting Estimate\nIn January 2025, we completed an assessment of the useful life of our capitalized software development costs, resulting in an increase in the estimated useful life of capitalized software development costs from two to three years. This change in accounting estimate was effective beginning fiscal year 2025. \nRecently Adopted Accounting Pronouncements\nSee Note 2, \nBasis of Presentation and Summary of Significant Accounting Policies\n, in our Notes to Unaudited Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q for a discussion of recent accounting pronouncements."
}