{
  "source_file": "deck-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of our financial condition and results of operations should be read together with our condensed consolidated financial statements and the related notes included in Part I, Item 1, “Financial Statements,” within this Quarterly Report, and the audited consolidated financial statements included in Part II, Item 8, “Financial Statements and Supplementary Data,” of our 2025 Annual Report, filed with the SEC on May 23, 2025, which is available free of charge on the SEC’s website at \nwww.sec.gov\n and our website at \nir.deckers.com\n.\nCertain statements made in this section constitute “forward-looking statements,” which are subject to numerous risks and uncertainties. Our actual results of operations may differ materially from those expressed or implied by these forward-looking statements as a result of many factors, including those set forth in the section titled “Cautionary Note Regarding Forward-Looking Statements” and Part II, Item 1A, “Risk Factors,” within this Quarterly Report. \nOVERVIEW\nWe are a global leader in designing, marketing, and distributing innovative footwear, apparel, and accessories developed for both everyday casual lifestyle use and high-performance activities. We market our products primarily under five proprietary brands: HOKA, UGG, Teva, Koolaburra, and AHNU. Our brands compete across the fashion and casual lifestyle, performance, running, and outdoor markets. We believe our products are distinctive and appeal to a broad demographic. Our brands sell our products through quality domestic and international retailers and international distributors in our wholesale channel, and directly to global consumers through our DTC channel, which is comprised of an e-commerce and retail store presence. We seek to differentiate our brands and products by offering diverse lines that emphasize fashion, authenticity, functionality, quality, and comfort, and products tailored to a variety of activities, seasons, and demographic groups. Independent third-party contractors manufacture all of our products.\nFINANCIAL HIGHLIGHTS\nConsolidated financial performance highlights for the six months ended September 30, 2025, compared to the prior period, were as follows:\n•\nNet sales increased 12.1% to $2,395,378.\n◦\nBrand\n▪\nHOKA brand net sales increased 15.3% to $1,287,205.\n▪\nUGG brand net sales increased 12.3% to $1,024,679.\n▪\nOther brands net sales decreased 22.5% to $83,494.\n◦\nChannel\n▪\nWholesale channel net sales increased 18.2% to $1,688,593. \n▪\nDTC channel net sales decreased 0.2% to $706,785.\n◦\nGeography\n▪\nDomestic net sales decreased 2.1% to $1,340,788.\n▪\nInternational net sales increased 37.5% to $1,054,590.\n•\nGross margin decreased 30 basis points to 56.0%.\n•\nSG&A expenses increased 11.0% to $849,920.\n•\nIncome from operations increased 12.3% to $491,808.\n•\nOperating margin remained flat at 20.5%.\n•\nDiluted earnings per share increased 17.1% to $2.74 per share. \n23\nTable of Contents\nTRENDS AND UNCERTAINTIES IMPACTING OUR BUSINESS AND INDUSTRY\nWe expect our business and industry will continue to be impacted by several important trends and uncertainties, which have not materially changed from those described in our 2025 Annual Report. Refer to Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” of our 2025 Annual Report for further discussion. Refer to Part I, Item 1A, “Risk Factors,” of our 2025 Annual Report for detailed information on the risks and uncertainties that may cause our actual results to differ materially from our expectations.\nREPORTABLE OPERATING SEGMENTS OVERVIEW\nAs of September 30, 2025, our three reportable operating segments include the worldwide operations of the HOKA brand, UGG brand, and Other brands. \nHOKA Brand.\n The HOKA brand is an authentic premium line of year-round performance footwear, which offers enhanced cushioning and inherent stability with minimal weight. Originally designed for ultra-runners, the brand now appeals to world champions, taste makers, and everyday athletes. Expanded marketing and strategic marketplace presence have fueled both domestic and international sales growth of the HOKA brand, which has quickly become a leading brand within run and outdoor specialty wholesale accounts and is growing across its global marketplace. The HOKA brand’s product line includes running, trail, hiking, fitness, and lifestyle footwear offerings, as well as select apparel and accessories.\nUGG Brand.\n The UGG brand is one of the most iconic and recognized footwear brands in our industry, which highlights our successful track record of building niche brands into lifestyle and fashion market leaders. With loyal consumers around the world, the UGG brand has proven to be a highly resilient consumer-focused line of premium footwear, apparel, and accessories with year-round product offerings that appeal to a growing global audience and a broad demographic.\nOther Brands.\n Other brands consist primarily of the Teva brand, Koolaburra brand, and AHNU brand. The Teva brand’s products are built for a range of outdoor pursuits and include a variety of footwear options, from classic sandals and shoes to boots. \n The Other brands reportable operating segment includes current and historical results of the Koolaburra and AHNU brands that are being phased out for standalone operations, as well as the Sanuk brand that was previously sold. Refer to the section titled “Reportable Operating Segments,” in Note 1, “General,” of our condensed consolidated financial statements in Part I, Item 1 within this Quarterly Report, for further information. \nRefer to the section titled “Reportable Operating Segment Overview,” in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” of our 2025 Annual Report for further discussion of our reportable operating segments.\nUSE OF NON-GAAP FINANCIAL MEASURES\nWe disclose supplemental financial measures calculated and presented in accordance with US GAAP; however, throughout this Quarterly Report we provide certain financial information on a non-GAAP basis (non-GAAP financial measures). We provide non-GAAP financial measures to provide information that may assist investors in understanding our results of operations and assessing our prospects for future performance, which consist of constant currency measures. We believe evaluating certain financial and operating measures on a constant currency basis is important as it excludes the impact of foreign currency exchange rate fluctuations that are not indicative of our core results of operations and are largely outside of our control. However, our non-GAAP financial measures are not intended to represent and should not be considered more meaningful measures than, or alternatives to, measures of financial or operating performance as determined in accordance with US GAAP.\n24\nTable of Contents\nWe calculate our constant currency non-GAAP financial measures for current period financial information, such as total net sales using the foreign currency exchange rates that were in effect during the previous comparable period, excluding the effects of foreign currency exchange rate hedges and remeasurements in the condensed consolidated financial statements. We also report comparable DTC sales on a constant currency basis for DTC operations that were open throughout the current and prior reporting periods, and we may adjust prior reporting periods to conform to current year accounting policies. The information presented on a constant currency basis, as we present such information, may not necessarily be comparable to similarly titled information presented by other companies, and may not be appropriate measures for comparing our performance relative to other companies. Constant currency measures should not be considered in isolation as an alternative to US dollar measures that reflect current period foreign currency exchange rates or to other financial or operating measures presented in accordance with US GAAP.\nSEASONALITY\nRefer to Note 1, “General,” of our condensed consolidated financial statements in Part I, Item 1 within this Quarterly Report and to Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” of our 2025 Annual Report for additional information regarding the impacts of seasonality on our business.\nRESULTS OF OPERATIONS\nThree Months Ended September 30, 2025, Compared to Three Months Ended September 30, 2024\n. Results of operations were as follows:\n \nThree Months Ended September 30,\n \n2025\n2024\nChange\n \nAmount\n% \n(1)\nAmount\n% \n(1)\nAmount\n%\nNet sales\n$\n1,430,840\n \n100.0\n \n%\n$\n1,311,320\n \n100.0\n \n%\n$\n119,520\n \n9.1\n \n%\nCost of sales\n627,018 \n43.8 \n578,048 \n44.1 \n(48,970)\n(8.5)\nGross profit\n803,822\n \n56.2\n \n733,272\n \n55.9\n \n70,550\n \n9.6\n \nSelling, general, and administrative expenses\n477,301 \n33.4 \n428,186 \n32.7 \n(49,115)\n(11.5)\nIncome from operations\n326,521\n \n22.8\n \n305,086\n \n23.2\n \n21,435\n \n7.0\n \nTotal other income, net\n(15,835)\n(1.1)\n(13,826)\n(1.1)\n2,009 \n14.5 \nIncome before income taxes\n342,356\n \n23.9\n \n318,912\n \n24.3\n \n23,444\n \n7.4\n \nIncome tax expense\n74,204 \n5.2 \n76,591 \n5.8 \n2,387 \n3.1 \nNet income\n268,152\n \n18.7\n \n242,321\n \n18.5\n \n25,831\n \n10.7\n \nTotal other comprehensive income, net of tax\n8,978 \n0.7 \n10,775 \n0.8 \n(1,797)\n(16.7)\nComprehensive income\n$\n277,130\n \n19.4\n \n%\n$\n253,096\n \n19.3\n \n%\n$\n24,034\n \n9.5\n \n%\nNet income per share\nBasic\n$\n1.82 \n$\n1.59 \n$\n0.23 \n14.5 \n%\nDiluted\n$\n1.82 \n$\n1.59 \n$\n0.23 \n14.5 \n%\n(1) \nMay not calculate on rounded amounts.\n25\nTable of Contents\nNet Sales.\n Net sales by brand, channel, and geography were as follows:\nThree Months Ended September 30,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\nNet sales by brand\n \n \n \nHOKA brand\nWholesale\n$\n408,891 \n$\n362,344 \n$\n46,547 \n12.8 \n%\nDirect-to-Consumer\n225,195 \n208,552 \n16,643 \n8.0 \nTotal\n634,086 \n570,896 \n63,190 \n11.1 \nUGG brand\n \n \n \nWholesale\n600,604 \n512,401 \n88,203 \n17.2 \nDirect-to-Consumer\n158,983 \n177,464 \n(18,481)\n(10.4)\nTotal\n759,587 \n689,865 \n69,722 \n10.1 \nOther brands \n(1)\nWholesale\n26,734 \n38,908 \n(12,174)\n(31.3)\nDirect-to-Consumer\n10,433 \n11,651 \n(1,218)\n(10.5)\nTotal\n37,167 \n50,559 \n(13,392)\n(26.5)\nTotal \n(1)\n$\n1,430,840\n \n$\n1,311,320\n \n$\n119,520\n \n9.1\n \n%\nNet sales by channel\nTotal Wholesale\n$\n1,036,229 \n$\n913,653 \n$\n122,576 \n13.4 \n%\nTotal Direct-to-Consumer\n394,611 \n397,667 \n(3,056)\n(0.8)\nTotal \n(1)\n$\n1,430,840\n \n$\n1,311,320\n \n$\n119,520\n \n9.1\n \n%\nNet sales by geography\nDomestic\n$\n839,530 \n$\n853,910 \n$\n(14,380)\n(1.7)\n%\nInternational\n591,310 \n457,410 \n133,900 \n29.3 \nTotal \n(1)\n$\n1,430,840\n \n$\n1,311,320\n \n$\n119,520\n \n9.1\n \n%\n(1)\n Includes Sanuk brand financial results from July 1, 2024 through the Sanuk Brand Sale Date for the three months ended September 30, 2024, which are presented in the Other brands reportable operating segment.\nTotal net sales increased primarily due to higher net sales for the UGG and HOKA brands, partially offset by lower net sales for Other brands. Drivers of significant changes in net sales, compared to the prior period, were as follows:\n•\nNet sales of the UGG brand increased primarily due to higher global net sales from the wholesale channel, as a result of higher sell-in of key product franchises, compared to the prior period, as well as earlier shipments primarily related to the transition of our European 3PL. These impacts were partially offset by lower net sales in the DTC channel, which has been pressured by earlier wholesale channel shipments, particularly with consumer preferences shifting toward multi-brand shopping experiences.\n•\nNet sales of the HOKA brand increased primarily due to higher international net sales across all channels, particularly in the wholesale channel driven by higher sell-in and re-orders, as well as higher sales in the DTC channel, collectively reflecting a positive consumer response to key franchise upgrades.\n•\nNet sales of the Other brands decreased primarily due to lower US net sales in the wholesale channel driven by the phase-out of standalone operations of the Koolaburra brand.\nSupplemental Disclosure\n•\nOn a constant currency basis, net sales increased by 8.3%, compared to the prior period.\n26\nTable of Contents\n•\nComparable DTC channel net sales for the 13 weeks ended September 28, 2025, decreased by 2.9%, compared to the prior period.\n•\nWe experienced an increase of 6.6% in the total volume of units sold to 22,700 from 21,300, compared to the prior period. Units sold include all categories such as footwear, apparel, accessories, home goods, and care kits.\nGross Profit.\n Gross margin increased to 56.2% from 55.9%, compared to the prior period, primarily due to benefits from price increases, favorable product mix shifts, favorable foreign currency exchange rate fluctuations, and tariff-related cost sharing arrangements, partially offset by incremental tariffs on US goods and unfavorable channel mix as wholesale revenue growth outpaced DTC revenue growth. The net impact of tariff-related variables was not material in the current period due to the timing of the implementation of our mitigation strategies, including price increases and earlier inventory shipments in advance of the incremental tariffs. \nSelling, General, and Administrative Expenses\n. Drivers of significant net changes in SG&A expenses, compared to the prior period, were as follows:\n•\nIncreased rent and occupancy of approximately $13,200, primarily due to higher operating expenses for our owned warehouses and DCs, as well as higher rent expenses for investments in our global retail store footprint, primarily to support the HOKA brand.\n•\nIncreased advertising, marketing, and promotion expenses of approximately $11,400, primarily due to higher promotional marketing expenses for the UGG and HOKA brands to drive global brand awareness and market share gains, highlight new product categories, and provide localized marketing.\n•\nDecreased net foreign currency-related remeasurement gains of approximately $10,000, primarily due to less favorable changes in Asian and Canadian exchange rates against the US dollar.\n•\nIncreased other SG&A expenses of approximately $9,600, primarily due to higher other variable operating expenses for our brands of approximately $17,700, partially offset by lower legal expenses, travel expenses, and other miscellaneous expenses. Higher other variable operating expenses was primarily driven by the UGG brand as a result of sales commissions and bad debt expense of approximately $8,500, the HOKA brand as a result of sales commissions and other miscellaneous expenses of approximately $8,200, and Other brands for bad debt expense of approximately $1,000.\n•\nIncreased payroll and related costs of approximately $4,700, primarily due to higher headcount from investments in talent for the HOKA and UGG brands, partially offset by lower variable payroll costs for our owned warehouses and DCs.\nIncome from Operations.\n Income (loss) from operations by reportable operating segment was as follows:\nThree Months Ended September 30,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\nIncome (loss) from operations\nHOKA brand\n$\n221,297 \n$\n214,561 \n$\n6,736 \n3.1 \n%\nUGG brand\n272,273 \n252,347 \n19,926 \n7.9 \nOther brands \n(1)\n2,703 \n834 \n1,869 \n224.1 \nUnallocated enterprise and shared brand expenses \n(2)\n(169,752)\n(162,656)\n(7,096)\n(4.4)\nTotal\n$\n326,521\n \n$\n305,086\n \n$\n21,435\n \n7.0\n \n%\n(1)\n Includes Sanuk brand financial results from July 1, 2024 through the Sanuk Brand Sale Date for the three months ended September 30, 2024, which are presented in the Other brands reportable operating segment.\n27\nTable of Contents\n(2) \nThe change in reportable operating segments had an impact on segment income from operations, a measure of segment profitability, and a clarification was made that certain prior unallocated overhead costs are defined as unallocated enterprise and shared brand expenses and are excluded from the measure of segment profitability.\nThe increase in total income from operations, compared to the prior period, was primarily due to higher net sales at higher gross margins, partially offset by higher SG&A expenses as a percentage of net sales. Drivers of significant net changes in total income from operations, compared to the prior period, were as follows:\n•\nThe increase in income from operations of UGG brand was due to higher net sales at higher gross margins, partially offset by higher SG&A expenses as a percentage of net sales primarily driven by advertising, marketing, and promotion expenses, and other SG&A expenses. \n•\nThe increase in income from operations of HOKA brand was due to higher net sales, partially offset by lower gross margins, as well as higher SG&A expenses as a percentage of net sales primarily driven by payroll and related costs, rent and occupancy, and other SG&A expenses. \n•\nThe increase in unallocated enterprise and shared brand expenses was due to lower net foreign currency-related remeasurement gains, higher rent and occupancy for our owned warehouses and DC's, and higher costs for infrastructure investments and related depreciation, partially offset by lower variable payroll costs for our owned warehouses and DCs and lower other SG&A expenses for travel expenses, legal expenses, and other miscellaneous expenses.\nIncome Tax Expense.\n Income tax expense and our effective income tax rate were as follows:\nThree Months Ended September 30,\n2025\n2024\nIncome tax expense\n$\n74,204 \n$\n76,591 \nEffective income tax rate\n21.7 \n%\n24.0 \n%\nThe net decrease in our effective income tax rate, compared to the prior period, was primarily due to non-recurring changes in valuation allowances on tax attributes, net discrete tax benefits for audit settlements and adjustments to income taxes payable, and changes in jurisdictional mix of worldwide income before income taxes, partially offset by reduced tax benefits for stock-based compensation.\nNet Income.\n The increase in net income, compared to the prior period, was due to higher net sales at higher gross margins, partially offset by higher SG&A expenses as a percentage of net sales. Net income per share increased, compared to the prior period, due to higher net income and lower weighted-average common shares outstanding driven by stock repurchases.\n28\nTable of Contents\nSix Months Ended September 30, 2025, Compared to Six Months Ended September 30, 2024\n. Results of operations were as follows:\n \nSix Months Ended September 30,\n \n2025\n2024\nChange\n \nAmount\n% \n(1)\nAmount\n% \n(1)\nAmount\n%\nNet sales\n$\n2,395,378\n \n100.0\n \n%\n$\n2,136,667\n \n100.0\n \n%\n$\n258,711\n \n12.1\n \n%\nCost of sales\n1,053,650 \n44.0 \n933,395 \n43.7 \n(120,255)\n(12.9)\nGross profit\n1,341,728\n \n56.0\n \n1,203,272\n \n56.3\n \n138,456\n \n11.5\n \nSelling, general, and administrative expenses\n849,920 \n35.5 \n765,379 \n35.8 \n(84,541)\n(11.0)\nIncome from operations\n491,808\n \n20.5\n \n437,893\n \n20.5\n \n53,915\n \n12.3\n \nTotal other income, net\n(33,614)\n(1.4)\n(30,172)\n(1.4)\n3,442 \n11.4 \nIncome before income taxes\n525,422\n \n21.9\n \n468,065\n \n21.9\n \n57,357\n \n12.3\n \nIncome tax expense\n118,067 \n4.9 \n110,119 \n5.1 \n(7,948)\n(7.2)\nNet income\n407,355\n \n17.0\n \n357,946\n \n16.8\n \n49,409\n \n13.8\n \nTotal other comprehensive income, net of tax\n543 \n— \n6,975 \n0.3 \n(6,432)\n(92.2)\nComprehensive income\n$\n407,898\n \n17.0\n \n%\n$\n364,921\n \n17.1\n \n%\n$\n42,977\n \n11.8\n \n%\nNet income per share\nBasic\n$\n2.75 \n$\n2.35 \n$\n0.40 \n17.0 \n%\nDiluted\n$\n2.74 \n$\n2.34 \n$\n0.40 \n17.1 \n%\n(1) \nMay not calculate on rounded amounts.\nNet Sales.\n Net sales by brand, channel, and geography were as follows:\n \nSix Months Ended September 30,\n2025\n2024\nChange\n \nAmount\nAmount\nAmount\n%\nNet sales by brand\n \n \n \n \nHOKA brand\nWholesale\n$\n843,097 \n$\n695,076 \n$\n148,021 \n21.3 \n%\nDirect-to-Consumer\n444,108 \n420,998 \n23,110 \n5.5 \nTotal\n1,287,205 \n1,116,074 \n171,131 \n15.3 \nUGG brand\n \n \n \n \nWholesale\n786,421 \n654,954 \n131,467 \n20.1 \nDirect-to-Consumer\n238,258 \n257,862 \n(19,604)\n(7.6)\nTotal\n1,024,679 \n912,816 \n111,863 \n12.3 \nOther brands \n(1)\nWholesale\n59,075 \n78,405 \n(19,330)\n(24.7)\nDirect-to-Consumer\n24,419 \n29,372 \n(4,953)\n(16.9)\nTotal\n83,494 \n107,777 \n(24,283)\n(22.5)\nTotal \n(1)\n$\n2,395,378\n \n$\n2,136,667\n \n$\n258,711\n \n12.1\n \n%\n29\nTable of Contents\n \nSix Months Ended September 30,\n2025\n2024\nChange\n \nAmount\nAmount\nAmount\n%\nNet sales by channel\nTotal Wholesale\n$\n1,688,593 \n$\n1,428,435 \n$\n260,158 \n18.2 \n%\nTotal Direct-to-Consumer\n706,785 \n708,232 \n(1,447)\n(0.2)\nTotal \n(1)\n$\n2,395,378\n \n$\n2,136,667\n \n$\n258,711\n \n12.1\n \n%\nNet sales by geography\nDomestic\n$\n1,340,788 \n$\n1,369,766 \n$\n(28,978)\n(2.1)\n%\nInternational\n1,054,590 \n766,901 \n287,689 \n37.5 \nTotal \n(1)\n$\n2,395,378\n \n$\n2,136,667\n \n$\n258,711\n \n12.1\n \n%\n(1)\n Includes Sanuk brand financial results from April 1, 2024 through the Sanuk Brand Sale Date for the six months ended September 30, 2024, which are presented in the Other brands reportable operating segment.\nTotal net sales increased primarily due to higher net sales for the HOKA and UGG brands, partially offset by lower net sales for Other brands. Drivers of significant changes in net sales, compared to the prior period, were as follows:\n•\nNet sales of the HOKA brand increased primarily due to higher international net sales across all channels, particularly in the wholesale channel driven by higher sell-in and re-orders, as well as higher sales in the DTC channel, collectively reflecting a positive consumer response to key franchise upgrades.\n•\nNet sales of the UGG brand increased primarily due to higher global net sales in the wholesale channel, as a result of increased demand for key product franchises, as well as earlier shipments primarily related to the transition of our European 3PL. These impacts were partially offset by lower net sales in the DTC channel which has been pressured by earlier wholesale channel shipments, particularly with consumer preferences shifting toward multi-brand shopping experiences. \n•\nNet sales of the Other brands decreased primarily due to lower US net sales in the wholesale channel driven by the phase-out of standalone operations of the Koolaburra brand and the sale of the Sanuk brand in August 2024.\nSupplemental Disclosure\n•\nOn a constant currency basis, net sales increased by 11.4% compared to the prior period.\n•\nComparable DTC channel net sales for the 26 weeks ended September 28, 2025, decreased by 2.6%, compared to the prior period.\n•\nWe experienced an increase of 10.0% in the total volume of units sold to 37,400 from 34,000, compared to the prior period. Units sold include all categories such as footwear, apparel, accessories, home goods, and care kits.\n•\nAs of September 30, 2025, we have a total of 200 global Company-owned retail stores (including 145 UGG brand retail stores and 55 HOKA brand retail stores).\nGross Profit.\n Gross margin decreased to 56.0% from 56.3% compared to the prior period, primarily due to unfavorable channel mix as wholesale revenue growth outpaced DTC revenue growth, higher promotional activity for the HOKA brand, as well as incremental tariffs on US goods impacting the current fiscal quarter, partially offset by favorable product mix shifts, benefits from price increases, and favorable foreign currency exchange rate fluctuations. The net impact of tariff-related variables was not material in the current period due to the timing of the implementation of our mitigation strategies, including price increases and earlier inventory shipments in advance of the incremental tariffs.\n30\nTable of Contents\nSelling, General, and Administrative Expenses.\n Drivers of significant net changes in SG&A expenses, compared to the prior period, were as follows:\n•\nIncreased advertising, marketing, and promotion expenses of approximately $24,700, primarily due to higher promotional marketing expenses for the HOKA and UGG brands to drive global brand awareness and market share gains, highlight new product categories, and provide localized marketing.\n•\nIncreased other SG&A expenses of approximately $24,600, primarily due to higher other variable operating expenses for our brands of approximately $28,100. Higher other variable operating expenses was primarily driven by the HOKA brand as a result of sales commissions and other miscellaneous expenses of approximately $16,700, the UGG brand as a result of sales commissions and bad debt expense of approximately $9,800, and Other brands for bad debt expense of approximately $1,600.\n•\nIncreased rent and occupancy of approximately $18,300, primarily due to higher operating expenses for our owned warehouses and DCs, as well as higher rent expenses for investments in our global retail store footprint, primarily to support the HOKA brand.\n•\nIncreased payroll and related costs of approximately $13,600, primarily due to higher headcount from investments in talent for the HOKA and UGG brands, partially offset by lower variable payroll costs for our owned warehouses and DCs.\nIncome from Operations.\n Income (loss) from operations by reportable operating segment was as follows:\nSix Months Ended September 30,\n \n2025\n2024\nChange\n \nAmount\nAmount\nAmount\n%\nIncome (loss) from operations\nHOKA brand\n$\n474,825 \n$\n445,479 \n$\n29,346 \n6.6 \n%\nUGG brand\n326,256 \n298,233 \n28,023 \n9.4 \nOther brands \n(1)\n10,456 \n13,520 \n(3,064)\n(22.7)\nUnallocated enterprise and shared brand expenses \n(2)\n(319,729)\n(319,339)\n(390)\n(0.1)\nTotal\n$\n491,808\n \n$\n437,893\n \n$\n53,915\n \n12.3\n \n%\n(1)\n Includes Sanuk brand financial results from April 1, 2024 through the Sanuk Brand Sale Date for the six months ended September 30, 2024, which are presented in the Other brands reportable operating segment.\n(2)\n The change in reportable operating segments had an impact on segment income from operations, a measure of segment profitability, and a clarification was made that certain prior unallocated overhead costs are defined as unallocated enterprise and shared brand expenses and are excluded from the measure of segment profitability.\nThe increase in total income from operations, compared to the prior period, was primarily due to higher net sales and lower SG&A expenses as a percentage of net sales, partially offset by lower gross margins. Drivers of significant net changes in total income from operations, compared to the prior period, were as follows:\n•\nThe increase in income from operations of the HOKA brand was due to higher net sales, partially offset by lower gross margins and higher SG&A expenses as a percentage of net sales, primarily driven by payroll and related costs, rent and occupancy, and other SG&A expenses.\n•\nThe increase in income from operations of the UGG brand was due to higher net sales at higher gross margins, partially offset by higher SG&A expenses as a percentage of net sales, primarily driven by advertising, marketing, and promotion expenses, and other SG&A expenses. \n31\nTable of Contents\nIncome Tax Expense.\n Income tax expense and our effective income tax rate were as follows:\nSix Months Ended September 30,\n2025\n2024\nIncome tax expense\n$\n118,067 \n$\n110,119 \nEffective income tax rate\n22.5 \n%\n23.5 \n%\nThe net decrease in our effective income tax rate, compared to the prior period, was primarily due to non-recurring changes in valuation allowances on tax attributes, net discrete tax benefits for audit settlements and adjustments to income taxes payable, and changes in jurisdictional mix of worldwide income before income taxes, partially offset by reduced tax benefits for stock-based compensation and reserve adjustments.\nNet Income.\n The increase in net income, compared to the prior period, was due to higher net sales and lower SG&A expenses as a percentage of net sales, partially offset by lower gross margins. Net income per share increased, compared to the prior period, due to higher net income and lower weighted-average common shares outstanding driven by stock repurchases.\nLIQUIDITY AND CAPITAL RESOURCES \nOur liquidity may be impacted by a number of factors, risks and uncertainties described in the section titled “Liquidity” in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” as well as in Part I, Item 1A, “Risk Factors,” of our 2025 Annual Report.\nSources of Liquidity.\n We finance our working capital and operating requirements using a combination of cash and cash equivalents balances, including cash from our repatriation strategy, and cash provided from ongoing operating activities. We also have available borrowing capacity under our revolving credit facilities. Refer to the section titled “Cash Flows” below for further discussion on cash flows from ongoing operating activities.\nCash and Cash Equivalents.\n As of September 30, 2025 and March 31, 2025, our cash and cash equivalents balance is $1,414,479 and $1,889,188, respectively, the majority of which is held in highly rated money market funds and interest-bearing bank deposit accounts with established national and global financial institutions. We believe our cash and cash equivalents balances, cash provided by operating activities, and available borrowing capacity under our revolving credit facilities, will provide sufficient liquidity to enable us to meet our working capital requirements and contractual obligations for at least the next 12 months and will be sufficient to allow us to pursue our business strategies and plans. However, there can be no assurance that sufficient capital will continue to be available or that it will be available on terms acceptable to us.\nRepatriation of Cash.\n Our cash repatriation strategy, and by extension, our liquidity, may be impacted by several additional considerations, which include future changes to or interpretations of global tax law and regulations, and our actual earnings in future periods. During the six months ended September 30, 2025, and 2024, no cash and cash equivalents were repatriated from a foreign subsidiary that were subject to income taxes. As of September 30, 2025, and March 31, 2025, we have $366,296 and $481,836, respectively, of cash and cash equivalents held by foreign subsidiaries, a portion of which may be subject to additional foreign withholding taxes if it were to be repatriated. We continue to evaluate our cash repatriation strategy and currently anticipate repatriating current and future unremitted earnings of non-US subsidiaries to the extent they have been subject to US income tax if such cash is not required to fund ongoing foreign operations. Refer to Note 5, “Income Taxes,” of our consolidated financial statements in Part IV of our 2025 Annual Report for further information regarding our cash repatriation strategy.\nRevolving Credit Facilities.\n Information about our revolving credit facilities available as of September 30, 2025, is as follows:\n•\nPrimary Credit Facility.\n During the six months ended September 30, 2025, we made no borrowings or repayments and there were no material changes to the terms, to the outstanding letters of credit, or to the borrowing availability under our unsecured revolving credit facility disclosed in our 2025 Annual Report.\n32\nTable of Contents\n•\nChina Credit Facility.\n During the six months ended September 30, 2025, we made no borrowings or repayments and there were no material changes to the terms or to the outstanding bank guarantees under our credit facility in China disclosed in our 2025 Annual Report.\n•\nDebt Covenants.\n As of September 30, 2025, we are in compliance with all financial covenants under our revolving credit facilities.\nRefer to Note 6, “Revolving Credit Facilities,” of our consolidated financial statements in Part IV of our 2025 Annual Report for further information regarding the terms of our revolving credit facilities.\nMaterial Cash Requirements.\n Our material cash requirements include working capital, payments to fulfill contractual obligations, capital expenditures, and stock repurchases. Our working capital requirements begin when we purchase raw and other materials and inventories and continue until we ultimately collect the resulting trade accounts receivable. Given the historical seasonality of the UGG brand, our working capital requirements fluctuate significantly throughout our fiscal year, and we utilize available cash to build inventory levels during certain quarters to support higher selling seasons. While the impact of seasonality has been mitigated to some extent, we expect our working capital requirements will continue to fluctuate from period to period.\n3PL Agreements.\n During the six months ended September 30, 2025, we entered into a 3PL service agreement with a non-cancellable minimum commitment of approximately $93,611 through March 31, 2029, related to the transition of one of our international 3PLs to a new partner with an upgraded warehouse management system which we expect to be operational in the first quarter of our next fiscal year. \nOperating Lease Obligations\n. During the six months ended September 30, 2025, we entered into various operating leases agreements in the ordinary course of business to continue the investment in our global retail store footprint, which are recorded on a discounted basis in our condensed consolidated financial statements. Refer to Part I, Item 1, Note 5, \"Commitment and Contingencies,\" for further information on our operating lease obligations. \nContractual Obligations and Capital Expenditures.\n Except for the above, as of September 30, 2025, there were no material changes outside the ordinary course of business to the contractual obligations or capital expenditures as disclosed in the sections titled “Contractual Obligations” and “Capital Expenditures” in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” of our 2025 Annual Report.\nStock Repurchase Program.\n As of September 30, 2025, the aggregate remaining approved amount under our stock repurchase program is $2,159,714. Our stock repurchase program does not obligate us to acquire any amount of common stock and may be suspended at any time at our discretion.\nRefer to Note 8, “Stockholders’ Equity,” of our condensed consolidated financial statements in Part I, Item 1 and to Part II, Item 2, “Unregistered Sales of Equity Securities and Use of Proceeds,” within this Quarterly Report for further information regarding our stock repurchase program and capital allocation strategy.\nCASH FLOWS\nThe following table summarizes the major components of our condensed consolidated statements of cash flows for the periods presented:\nSix Months Ended September 30,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\nNet cash provided by operating activities\n$\n44,233 \n$\n22,100 \n$\n22,133 \n100.1 \n%\nNet cash used in investing activities\n(45,932)\n(34,442)\n(11,490)\n(33.4)\nNet cash used in financing activities\n(475,475)\n(267,014)\n(208,461)\n(78.1)\nEffect of foreign currency exchange rates on cash and cash equivalents\n2,465 \n2,986 \n(521)\n(17.4)\nNet change in cash and cash equivalents\n$\n(474,709)\n$\n(276,370)\n$\n(198,339)\n(71.8)\n%\n33\nTable of Contents\nOperating Activities.\n Our primary source of liquidity was net cash provided by operating activities, which was driven by our net income after non-cash adjustments and changes in operating assets and liabilities.\nThe increase in net cash provided by operating activities during the six months ended September 30, 2025, compared to the prior period, was due to $51,227 of favorable net income after non-cash adjustments partially offset by $29,094 of unfavorable changes in operating assets and liabilities. Changes in operating assets and liabilities were primarily due to unfavorable impacts from (1) timing of derivative contract cash settlements, (2) higher cost and earlier purchases of inventory to support elevated demand for our products and the transition to our European 3PL, partially offset by favorable impacts from (3) net trade accounts receivable from timing of sales and respective receipts, (4) net trade accounts payable from timing of receipts of goods and services and related disbursements, and (5) timing of tax payments and receipts.\nInvesting Activities.\n The increase in net cash used in investing activities during the six months ended September 30, 2025, compared to the prior period, was primarily due to cash proceeds from the sale of assets during the prior period. The purchases of property and equipment relate to investments in our global retail store footprint, partially offset by lower expenditures for the completed build-out of an owned US warehouse and DC.\nFinancing Activities.\n The increase in net cash used in financing activities during the six months ended September 30, 2025, compared to the prior period, was due to a higher dollar value of stock repurchases, inclusive of excise taxes.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nPreparation of our condensed consolidated financial statements in accordance with US GAAP requires management to make estimates and assumptions that affect the amounts reported. Management bases these estimates and assumptions upon historical experience, existing and known circumstances, authoritative accounting pronouncements, and other factors that it believes to be reasonable. In addition, management has considered the potential impact of macroeconomic factors, including changes in tariff rates, inflation, foreign currency exchange rate volatility, changes in interest rates, changes in commodity pricing, changes in consumer discretionary spending, and recessionary concerns, on our business and operations. Although the full impact of these factors is unknown, management believes it has made appropriate accounting estimates and assumptions based on the facts and circumstances available as of the reporting date. However, actual results could differ materially from these estimates and assumptions, which may result in material effects on our financial condition, results of operations and liquidity. Refer to the sections titled “Use of Estimates” and “Recent Accounting Pronouncements” within Note 1, “General,” of our condensed consolidated financial statements in Part I, Item 1 within this Quarterly Report, for additional information regarding applicable key estimates and assumptions, as well as the expected impact of recent accounting pronouncements.\nThere have been no material changes to the critical accounting policies or to the key estimates and assumptions, disclosed in the section titled “Critical Accounting Policies and Estimates” in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” within our 2025 Annual Report."
}