{
  "source_file": "dell-20250131.htm",
  "form_type": "10-K",
  "item1": "ITEM 1 — BUSINESS\nCompany Overview\nDell Technologies is a leader in the global technology industry focused on providing broad and innovative technology solutions for the data and artificial intelligence (“AI”) era. These solutions range from client devices and peripherals to infrastructure solutions across servers, networking, and storage to meet the evolving needs of our customers and drive better business outcomes. With our extensive portfolio and our commitment to innovation, we offer secure, integrated solutions that extend from the edge to the core to the cloud, and we are at the forefront of AI, software-defined, and cloud native infrastructure solutions. Our differentiated and holistic information technology (“IT”) solutions enable us to provide value and capture growth as customer spending priorities evolve.\nDell Technologies operates globally in over 170 countries, supported by a world-class organization across key functional areas, including technology and product development, marketing, sales, services, and financing. We have a number of operational advantages that provide a critical foundation for our success. We provide leading end-to-end solutions across our portfolio of products and services. Our go-to-market operations include an extensive direct sales force, with the ability to build deep customer relationships, and a global network of channel partners. Our global services footprint consists of service and support professionals and vendor-managed service centers that support customers across the world. Our world-class supply chain operates at a significant scale with the ability to remain agile in a variety of environments.\nWe offer customers choice in how they acquire our solutions, including traditional purchasing and a portfolio of offerings that provide both payment and consumption solutions, including as-a-Service, subscription, utility, leases, and loans. These options allow our customers to pay over time and provide them with operational and financial flexibility.\nOur Vision and Strategy\nOur vision is to become the most essential technology partner. We help customers address their IT needs and digital transformation objectives as they embrace today’s changing technology landscape. We intend to realize our vision by executing our strategy of leveraging our strengths to extend our leadership positions and capture new growth.\nWe believe we are uniquely positioned in our industry and that our results will continue to benefit from our operational advantages, which position our Company for long-term growth and value creation while keeping our purpose at the forefront of our decision-making: to create technologies that drive human progress. \nTechnology is rapidly evolving with demand for simple and holistic solutions as companies navigate an increasingly complex IT environment. To meet our customers’ needs, we invest in research and development, sales, and other key areas of our business to deliver superior products and solutions capabilities and to drive sustainable long-term growth.\nThe impacts of technological advancement and data expansion continue to be a force for progress as artificial intelligence and generative AI have become the next wave of technological innovation. Through each wave of technological progress, we look to advance our capabilities to change the way we work and make decisions, improve business outcomes and the customer experience, and reduce costs by leveraging new technology to optimize business processes. We believe our unique operating advantages, our leadership, and our way of doing business provide a foundation to foster growth, drive efficiencies, and capitalize on each successive wave of innovation in a dynamic industry.\n5\nTable of \nConte\nnts\nProducts and Services\nWe design, develop, manufacture, market, sell, and support a wide range of comprehensive and integrated solutions, products, and services. We are organized into two business units which are also our reportable segments: Infrastructure Solutions Group and Client Solutions Group.\n•\nInfrastructure Solutions Group (“ISG”)\n — ISG enables our customers’ digital transformations with solutions that address AI, machine learning, data analytics, and multicloud environments. ISG helps customers simplify, streamline, and automate IT operations. ISG solutions are built for multicloud environments and are optimized to run workloads in both public and private clouds, as well as on-premises. Our major product categories within ISG are our servers and networking offerings and storage offerings.\nOur server portfolio includes high-performance general-purpose and AI-optimized servers able to run workloads across customers’ IT environments, on-premises, and in multicloud and edge environments. Our AI-optimized servers are designed to run high-value workloads, including AI model training, fine-tuning, and inferencing. Our networking portfolio helps our business customers transform and modernize their infrastructure, complementing our server and storage solutions. Our comprehensive storage portfolio includes modern and traditional storage solutions, including all-flash arrays, scale-out file, object platforms, hyper-converged infrastructure, and software-defined storage. ISG also offers software, peripherals, and services, including consulting, configuration, and support and deployment.\nApproximately 60% of ISG revenue is generated by sales to customers in the Americas, with the remaining portion derived from sales to customers in the Europe, Middle East, and Africa region (“EMEA”) and the Asia-Pacific and Japan region (“APJ”).\n•\nClient Solutions Group (“CSG”)\n — CSG offers branded PCs, including notebooks, desktops, and workstations and branded peripherals that include displays, docking stations, keyboards, mice, and webcam and audio devices, as well as third-party software and peripherals. CSG also includes services offerings, such as configuration, support and deployment, and extended warranties. Our major product categories within CSG are our commercial offerings and consumer offerings.\nOur CSG offerings are designed to optimize performance, reliability, manageability, design, and security for our customers and include on-device AI for greater end-user creativity and productivity. Our commercial portfolio provides our customers with solutions centered on flexibility to address their complex needs such as IT modernization, hybrid work transformation, and other critical areas. Our consumer portfolio primarily focuses on high-end consumer and gaming offerings, providing our customers with powerful performance, processing, and end-user experiences.\nApproximately 60% of CSG revenue is generated by sales to customers in the Americas, with the remaining portion derived from sales to customers in EMEA and APJ.\nOur other businesses, described below, primarily consist of our resale of standalone offerings of VMware LLC (formerly VMware, Inc. and individually and together with its subsidiaries, “VMware”), referred to as “VMware Resale,” and offerings of SecureWorks Corp. (“Secureworks”). These businesses are divested businesses or their offerings are no longer actively sold, and are not classified as reportable segments, either individually or collectively. Their operating results are reported within Corporate and other.\n•\nVMware Resale\n includes our sale of standalone VMware offerings. On November 22, 2023, VMware was acquired by Broadcom, and subsequently announced changes to its go-to-market approach for VMware offerings that impacted our commercial relationship with VMware. On March 25, 2024, we terminated our Commercial Framework Agreement with VMware, which provided the framework under which we and VMware continued our commercial relationship following our spin-off of VMware on November 1, 2021. We no longer act as a distributor of Broadcom’s VMware standalone products and services, although we will continue to support customers that have purchased resale offerings sold in prior periods. \nWe continue to integrate and embed certain VMware products and services with selected Dell Technologies’ offerings to end-users. The results of such offerings are reflected within CSG or ISG, depending upon the nature of the underlying offering sold. See Note 19 of the Notes to the Consolidated Financial Statements included in this report for more information regarding the impact of Broadcom’s acquisition of VMware.\n6\nTable of \nConte\nnts\n•\nSecureworks\n (NASDAQ: SCWX) is a global cybersecurity provider of technology-driven security solutions singularly focused on protecting its customers by outpacing and outmaneuvering the adversary. The solutions offered by Secureworks enable organizations of varying size and complexity to prevent security breaches, detect malicious activity, respond rapidly when a security breach occurs, and identify emerging threats. On October 21, 2024, Secureworks announced that it had entered into a definitive agreement providing for its sale to Sophos Inc., an affiliate of Thoma Bravo, L.P., a private equity and growth capital firm. The transaction was completed on February 3, 2025, subsequent to the close of the Company’s fiscal year ended January 31, 2025, in an all-cash transaction for a purchase price of approximately $0.9 billion.\nFor further discussion regarding our current reportable segments, see “Part II — Item 7 — Management’s Discussion and Analysis of Financial Condition and Results of Operations — Results of Operations — Business Unit Results” and Note 18 of the Notes to the Consolidated Financial Statements included in this report. \nDell Payment Solutions\nOur customers seek choice in how they acquire our solutions and look to remove cost and complexity, align offerings with their business needs, and provide consistent, high-quality operations throughout their IT enterprise. The Dell Payment Solutions portfolio offers a wide range of payment and consumption options to enable our customers globally to deploy the technology solutions they need now with predictability, flexibility, and choice. \nWe offer our customers choices that include as-a-Service, subscription, utility, leases, loans and immediate pay models designed to match customers’ consumption and financing preferences. We believe these options provide operational and financial flexibility and strengthen our customer relationships. Additionally, these offerings typically result in multiyear agreements which generate recurring revenue streams over the term of the arrangement. We expect that these offerings will provide a foundation for growth in recurring revenue. We define recurring revenue as revenue recognized that is primarily related to hardware and software maintenance as well as to subscription, as-a-Service, usage-based offerings, and operating leases. \nTo support financing solutions and services as part of the portfolio, Dell Financial Services and its affiliates (“DFS”) originate, collect, and service customer receivables primarily related to the purchase or use of our product, software, and services offerings. \nDFS funded \n$8.4 billion of originations in Fiscal 2025 and as of January 31, 2025 maintains an $11.2 billion global portfolio of financing receivables with a strong credit quality. The results of these operations are allocated to our segments based on the underlying product or service financed and may be impacted by, among other factors, changes in the interest rate environment and the translation of those changes to pricing. For additional information about our financing arrangements, see Note 5 of the Notes to the Consolidated Financial Statements included in this report. \nResearch and Development\nWe focus on developing innovative solutions that incorporate desirable features and capabilities at competitive prices. We employ a collaborative approach to design and development in which our engineers, with direct customer input, design solutions and work with a global network of technology partners to architect new system designs, influence the direction of future development, and integrate new technologies into our products and solutions. We strive to deliver new and relevant products to the market quickly and efficiently. \nOur software engineers are focused on developing the next generation of innovative solutions.\n \nOur embedded software simplifies the complex through automation, increasingly leveraging artificial intelligence and machine-learning technology. Most of our research and development (“R&D”) expenditures represent costs to develop the software that powers these solutions. \nWe manage our R&D expenses by concentrating on solutions that we believe are most valuable to our customers and by leveraging the capabilities of our strategic partnerships. We have a global R&D presence, with total R&D expenses of $3.1 billion for Fiscal 2025, and $2.8 billion\n \nfor both Fiscal 2024 and Fiscal 2023. These investments reflect our commitment to innovation that aim to create the right solutions to help our customers build their digital future and transform their businesses.\n7\nTable of \nConte\nnts\nStrategic Investments and Acquisitions\nAs part of our strategy, we will continue to evaluate opportunities for strategic investments through our venture capital investment arm, Dell Technologies Capital, with a focus on emerging technology areas that are relevant to our business and that will complement our existing portfolio of solutions. We target investments in areas such as storage, software-defined networking, management and orchestration, security, machine learning and AI, Big Data and analytics, cloud, edge computing, and software development operations. The technologies or products these companies have under development are typically in the early stages and may never have commercial value, which could result in a loss of a substantial part of our investment in the companies. \nWe held strategic investments in non-marketable securities of $1.5 billion and $1.3 billion as of January 31, 2025 and February 2, 2024, respectively. See Note 4 of the Notes to the Consolidated Financial Statements included in this report for additional information.\nIn addition to these investments, we may also make disciplined acquisitions of businesses that advance our strategic objectives and accelerate our innovation agenda.\nManufacturing and Materials\nWe own manufacturing facilities located in the United States, Malaysia, China, Brazil, India, Poland, and Ireland. See “Item 2 — Properties” for information about our manufacturing and distribution facilities. \nWe also utilize contract manufacturers throughout the world to manufacture or assemble our products under the Dell Technologies brand to provide operational flexibility, achieve cost efficiencies, deliver products faster, better serve our customers, and enhance our supply chain. When using contract manufacturers, we purchase components from suppliers and subsequently sell those components to the manufacturer. Our manufacturing process consists of assembly, software installation, functional testing, and quality control. We conduct operations utilizing a formal, documented quality management system to ensure that our products and services satisfy customer needs and expectations. Testing and quality control are also applied to components, parts, sub-assemblies, and systems obtained from third-party suppliers.\nOur quality management system is maintained through the testing of components, sub-assemblies, software, and systems at various stages in the manufacturing process. Quality control procedures also include a burn-in period for completed units after assembly, ongoing production reliability audits, failure tracking for early identification of production and component problems, and processing of information from customers obtained through services and support programs. This system is certified to the ISO 9001 International Standard that includes our global sites and organizations that design, manufacture, and service our products. \nOur order fulfillment, manufacturing, and test facilities are also certified to the ISO 9001 International Standard for quality management systems, the ISO 14001 International Standard for environmental management systems, the ISO 45001 International Standard for health and safety management systems, and the ISO 50001 International Standard for energy management systems. These internationally-recognized endorsements of ongoing quality, environmental, health and safety, and energy management are among the highest levels of certifications available. We also have implemented programs and methodologies to ensure that the quality of our designs, manufacturing, test processes, and supplier relationships are continually improved. \nWe maintain a Supplier Code of Conduct, actively manage recycling processes for our returned products, and are certified by the Environmental Protection Agency as a Smartway Transport Partner.\nWe purchase materials, supplies, product components, and products from a large number of qualified suppliers. In some cases, where multiple sources of supply are not available, we rely on a single source or a limited number of sources of supply if we believe it is advantageous to do so because of performance, quality, support, delivery, capacity, or price considerations. We believe that any disruption that may occur because of our dependence on single- or limited-source vendors would not disproportionately disadvantage us relative to our competitors. See “Item 1A — Risk Factors — Risks Relating to Our Business and Our Industry — Our use of single-source or limited-source suppliers may adversely affect the availability or timely delivery of some critical products or components.” for information about the risks associated with Dell Technologies’ use of single- or limited-source suppliers.\n8\nTable of \nConte\nnts\nProduct Backlog\nProduct backlog represents the value of unfulfilled manufacturing orders and is included as a component of remaining performance obligations to the extent we determine that the manufacturing orders are non-cancelable. Our business model generally gives us the flexibility to optimize product backlog including by expediting shipping or prioritizing customer orders for products that have shorter lead times. During Fiscal 2024, while our supply chain operated efficiently at standard lead times, demand for AI-optimized servers outpaced the supply of graphics processing units (“GPUs”), resulting in elevated backlog levels for such offerings as we exited the fiscal year. During Fiscal 2025, backlog levels for our AI-optimized servers remained elevated as we exited the fiscal year due to continued strong demand for these offerings.\nGeographic Operations\nOur corporate headquarters is located in Round Rock, Texas. We have operations and conduct business in many countries located in the Americas, Europe, the Middle East, Asia, and other geographic regions. We continue to view emerging markets outside of the United States, Western Europe, Canada, and Japan, which include the vast majority of the world’s population, as a long-term growth opportunity. Accordingly, we pursue the development of technology solutions that meet the needs of these markets. For information about the amount of net revenue we generated from our operations outside of the United States during the last three fiscal years, see Note 18 of the Notes to the Consolidated Financial Statements included in this report.\nSeasonality\nOur sales can be affected by seasonal trends. Within ISG, our storage sales are typically stronger in our fourth fiscal quarter. Our sales within the Americas are typically stronger in the second and fourth fiscal quarters, while our sales in EMEA are typically stronger during the fourth fiscal quarter. Historical seasonal patterns have been impacted by the changing macroeconomic environment and our mix of business, and may not continue in the future.\nCompetition \nWe operate in an industry in which there are rapid technological advances in hardware, software, and services offerings, including AI, cloud, and security-related offerings. We face ongoing product and price competition in all areas of our business from both branded and generic competitors, including companies that specialize in one or more of our product or service lines. We compete based on our ability to offer customers competitive, scalable, and integrated solutions that provide the most current and desired product and services features at a competitive price. We closely monitor market pricing, including the effect of foreign exchange rate movements, in an effort to provide the best value for our customers. We also closely monitor changing demand to keep pace with the demands of current and prospective customers. We believe that our strong relationships with our customers and channel partners allow us to respond quickly to changing customer needs and other macroeconomic factors.\nWe also face competition from non-traditional IT companies, including large Infrastructure-as-a-Service providers, that often buy their infrastructure directly from original design manufacturers. Competitive pressures could increase if customers choose to move existing workloads to these Infrastructure-as-a-Service providers.\nThe markets in which we compete span countries around the world with customers that range from the world’s largest corporations to small and medium-sized businesses to consumers and also include government and not-for-profit organizations. We believe that new businesses will continue to enter these markets and develop technologies that, if successfully commercialized, may compete with our products and services. Moreover, current competitors may enter into new strategic relationships with new or existing competitors, which may further increase competitive pressures. See “Item 1A — Risk Factors — Risks Relating to Our Business and Our Industry” for information about our competitive risks. \nSales and Marketing\nOur sales and marketing efforts are organized around our customers. Our global sales and marketing team has created a go-to-market model that is collaborative and customer-focused. We generally organize our go-to-market operations with a focus on geographic and customer segments which encompass large g\nlobal and national enterprises, governmental agencies and other public institutions, educational institutions, healthc\nare organizations, small and medium-sized businesses, and consumers. \n9\nTable of \nConte\nnts\nGo-to-market strategy\n — We sell products and services directly to customers and through other sales channels, which include value-added resellers, system integrators, distributors, and retailers. We manage our direct sales team and channel partners to offer a unified customer experience.\nWe believe our direct sales channel is a significant competitive advantage and emphasizes direct communication with customers, allowing us to refine our products and marketing programs while providing insight to better navigate through supply chain challenges and complexity. \nIn addition to our direct sales channel, we use our network of channel partners to sell our products and services, enabling us to efficiently reach and serve a greater number of customers. The Dell Technologies partner program provides partners with appropriate incentives to encourage sales generation. We also facilitate access to third-party financing to help our channel partners manage their working capital. We believe that building long-term relationships with our channel partners enhances our ability to deliver a high-quality customer experience. During Fiscal 2025, our other sales channels generated approximately 50% of our net revenue. \nLarge enterprises and public institutions \n— We maintain a field sales force across the world to serve our largest customers, including large enterprises and public institutions. Dedicated account teams, which include technical sales specialists, form long-term relationships with and support our largest customers, develop tailored solutions to meet their needs, position the capabilities of Dell Technologies, and provide us with customer feedback. For these customers, we offer several programs designed to provide single points of contact and accountability with dedicated account managers, special pricing, and consistent service and support programs. We also maintain specific sales and marketing programs customized to the needs of each specific segment we serve.\nSmall and medium-sized business and consumers\n — We have a direct sales force of dedicated account teams for small and medium-sized businesses focused on delivering outcomes tailored to customers’ specific needs. For consumers, we offer robust online and channel engagement. We market our products and services to customers in these segments through various campaigns and advertising media, aligning with customer preferences. To react quickly to our customers’ needs, we track our Net Promoter Score, a customer loyalty metric that is widely used across various industries. Net Promoter Score is a trademark of Satmetrix Systems, Inc., Bain & Company, Inc., and Fred Reichheld. We also engage with customers through social media.\nPatents, Trademarks, and Licenses\nAs of January 31, 2025, we held a worldwide portfolio of 24,351 granted patents and 8,424 pending patent applications. We continue to obtain new patents through our ongoing research and development activities. The inventions claimed in our patents and patent applications cover aspects of our current and possible future offerings, computer systems, software products, manufacturing processes, and related technologies. We also hold licenses to use numerous third-party patents. Although we use our patented inventions and license some of them to others, we are not substantially dependent on any single patent or group of related patents. Our product and process patents may establish barriers to entry, and we anticipate that our worldwide patent portfolio will continue to be of value in negotiating intellectual property rights with others in the industry.\nWe have used, registered, or applied to register certain trademarks and copyrights in the United States and in other countries. We believe that the Dell Technologies, DELL, and Alienware word marks and logo marks in the United States are material to our operations.\nWe have entered into software licensing agreements with other companies. We also license certain technologies and intellectual property from third parties for use in our offerings and processes, and license some of our technologies and intellectual property to third parties. \n10\nTable of \nConte\nnts\nGovernment Regulation\nOur business is subject to regulation by various U.S. federal and state governmental agencies and other governmental agencies. Such regulation includes the activities of the U.S. Federal Communications Commission; the anti-trust regulatory activities of the U.S. Federal Trade Commission, the U.S. Department of Justice, and the European Union; the consumer protection laws and financial services regulation of the U.S. Federal Trade Commission and various U.S. governmental agencies; the export regulatory activities of the U.S. Department of Commerce and the U.S. Department of the Treasury; the import regulatory activities of the U.S. Customs and Border Protection; the product safety regulatory activities of the U.S. Consumer Product Safety Commission and the U.S. Department of Transportation; the health information privacy and security requirements of the U.S. Department of Health and Human Services; and the environmental, employment and labor, and other regulatory activities of a variety of governmental authorities in each of the countries in which we conduct business. \nOur operations are subject to a variety of environmental, performance, and safety regulations in all aspects of our operations. Product design and procurement operations must comply with requirements relating to materials composition, sourcing, radiated emissions, energy efficiency and collection, recycling, treatment, transportation, and disposal of electronics products, including restrictions on mercury, lead, cadmium, lithium metal, lithium ion, and other substances. Our operations may also become subject to new or emergent standards relating to climate change laws and regulations. The amount and timing of costs under environmental and safety laws are difficult to predict. We were not assessed any material environmental fines, nor did we have any material environmental remediation or other environmental costs, during Fiscal 2025.\nWe and our subsidiaries are subject to various anti-corruption laws that prohibit improper payments or offers of payments to foreign governments and their officials for the purpose of obtaining or retaining business, and are also subject to export controls, customs regulations, economic sanctions laws and embargoes imposed by the U.S. government. Violations of the U.S. Foreign Corrupt Practices Act or other anti-corruption laws or export controls, customs regulations, or economic sanctions laws may result in severe criminal or civil sanctions and penalties.\nWe are subject to provisions of the Dodd-Frank Wall Street Reform and Consumer Protection Act intended to improve transparency and accountability concerning the supply of minerals originating from the conflict zones of the Democratic Republic of the Congo or adjoining countries. We incur costs to comply with the disclosure requirements of this law and other costs relating to the sourcing and availability of minerals used in our products.\nSustainability and Environmental, Social, and Governance Activities\nAt Dell Technologies, we are committed to driving human progress by putting our technology and expertise to work where we believe it can do the most good for both people and the planet. We recognize that all of our stakeholders — shareholders, customers, suppliers, employees, and communities — are essential to our business. \nDell Technologies is committed to progressing towards the goals set forth in our plan for 2030 and beyond, which we refer to as our 2030 goals. We are using these goals to help build our business, promote long-term shareholder value creation, and guide our societal impact strategies over the next decade. Our environmental, social, and governance (“ESG”) commitments focus on six key areas:\n•\nCircular Economy\n — We embed circularity principles throughout our value chain. By integrating sustainable practices with suppliers, customers, and stakeholders, we advance a circular economy that improves resource efficiency and environmental benefits, reinforcing our leadership in sustainability.\n•\nClimate Action \n— We are committed to understanding the impact our business has on the environment. We are taking action to mitigate climate change, and we offer innovative products and solutions to customers to help them reduce their emissions, reach their reduction targets and operate more efficiently.\n \nWe are actively addressing climate change by managing greenhouse gas emissions across our operations, supply chain, and product lifecycle, with a goal to achieve net zero emissions across scopes 1, 2, and 3 by 2050.\n•\nDigital Inclusion \n—\n \nWe endeavor to harness the power of technology, our scale, and our expertise to create a digital future that works for all. We are working to close the digital divide by providing access to connectivity and technology solutions that improve quality of life such as access to healthcare, education, and job opportunities. \n11\nTable of \nConte\nnts\n•\nHuman Rights \n—\n \nWe respect the fundamental human rights of all people. This respect is core to our commitment to drive human progress. Dell endeavors to ensure we are not complicit in human rights violations, and we seek to hold our suppliers and other business partners to this same standard.\n•\nInclusive Workforce \n—\n \nWe believe our people are key to our success. We are committed to creating an inclusive culture and fostering a strong pipeline of skilled talent. By focusing on equal opportunities, ethical practices, and integrity, we implement inclusive practices and policies that support diversity.\n•\nTrust \n— We work to ensure that trust underpins all we do. We prioritize security, privacy, and ethics in all aspects of business. From the integrity of our products to transparency in our processes, we are dedicated to fostering trust with our stakeholders.\nDell Technologies continuously measures and shares updates on our progress in our annually released reports. For a more comprehensive view into our approach, commitments, and key initiatives, see our ESG annual report available on our website. \nHuman Capital Management\nWe are a diverse team with unique perspectives united in our purpose, strategy, and culture. Our goal is to ensure that all employees feel valued, engaged, and inspired to do their best work. We aim to attract, develop, and retain an inclusive workforce through our ongoing inclusion efforts, training and development offerings, and competitive and comprehensive benefits that include health and wellness resources. We believe the success of our commitment is demonstrated through our consistent market recognition as a best-in-class employer.\nAs of January 31, 2025, we had approximately 108,000 employees. Throughout Fiscal 2025, we remained committed to disciplined cost management in coordination with our ongoing business modernization initiatives and continued to take certain measures to reduce costs, including limitation of external hiring, employee reorganizations, and other actions to align our investments with our announced strategic and customer priorities. These actions resulted in a reduction in our overall headcount. Despite these difficult decisions, we continue focused efforts to empower our employees and attract, develop, and retain talent. \nWe seek to support our culture in four key focus areas: \nDiversity and Inclusion \n— At Dell Technologies, we believe wide-ranging perspectives are powerful. Our pillar on cultivating inclusion highlights how our human capital resources are vital to serving our customer base, our societal impact, and long-term business success. We believe that a workforce diverse in experience and background drives innovation and growth — not only is it our competitive advantage, it is critical to meeting future business needs and ensuring that diverse perspectives reflect our global customer base. \nWe are committed to equal employment opportunity and continuing to implement inclusive policies that enable Dell Technologies to achieve these goals. Additional information on our aspirational 2030 goals and workforce demographics is included in our annual ESG report.\nAchievement Through Learning, Development, and Competitive Compensation and Rewards \n— We have designed market competitive compensation programs to inspire employees to do their best work for our customers and the growth of our business. These merit, bonus, and long-term incentive programs help us foster our culture of high performance while attracting and retaining critical talent and skill sets. Through our comprehensive rewards programs, we are committed to equal pay. We believe people should be fairly compensated for the value they deliver to our customers and other stakeholders.\nWe provide centralized programs to support employees’ career growth and development. We offer formal training options, individualized development programs, tools for 360-degree feedback, mentoring, networking, stretch assignments, and growth opportunities. Our tools and resources are designed to empower and inspire employees to direct their own career paths and build a portfolio of transferable skills for success in the technology industry. Our internal Career Hub supports employee growth by providing personalized development suggestions, such as mentorship and internal opportunities, that align with their skills and development goals. We are committed to building a leadership pipeline with a broad spectrum of skills, including the ability to act with integrity and inspire others. \n12\nTable of \nConte\nnts\nBalance and Wellness \n— We offer a competitive and comprehensive benefits package and strive to provide the best choice and value at the best cost. Through our benefits package, we support our employees’ overall health and well-being through a comprehensive approach which provides programs and resources focused on mental, physical, emotional and financial well-being, while reinforcing work-life balance. We strive to provide innovative and inclusive offerings, such as virtual live and on-demand educational sessions, counseling and support services, fitness and wellness challenges, voluntary progress tracking, and other incentives.\nConnection and Engagement \n— We believe employee feedback is an important part of our culture and a key strategy to foster connection and engagement. For example, through our annual Tell Dell survey, employees can confidentially voice their perceptions of the Company and our leadership, culture, and inclusiveness so we can continue to improve the employee experience. We promote further employee connection and engagement through a variety of initiatives, including, among others, our broader team member listening strategy and our Employee Resource Groups (“ERGs”). We have 13 unique ERGs, which are open to all team members, that foster connection and design experiences focused on team member engagement, professional development, and community involvement.\nSupply Chain Resources\nWe manage our responsible business practices in one of the world’s largest supply chains, which involves hundreds of thousands of people around the world. We seek to drive responsible manufacturing through robust assurance practices, including human rights due diligence and environmental stewardship. We recognize that looking after the well-being of people in our supply chain is important and have various objectives for our work in this area, including:\n•\nproviding healthy work environments;\n•\ndelivering future-ready skills development for employees in our supply chain; and\n•\ncontinuing our engagement with the people who make our products.\nWe support workers in the value chain with training on key topics, including forced labor and health and safety, and we continue to work with suppliers to deliver training directly to employees via their mobile phones. Through this initiative, Dell Technologies covers the cost of developing training modules and shares training costs with suppliers who deliver them. \nDell Technologies works to ensure that we and our suppliers manufacture our products responsibly, in part through our social and environmental responsibility assurance program. Through risk assessments and audits conducted under this program, we seek to monitor factories’ adherence to the Responsible Business Alliance (“RBA”) Code of Conduct. Audits are conducted by third-party auditors that have been trained and certified by the RBA. The audits cover topics across five areas: labor, including risks of forced labor and weekly working hours; employee health and safety; environment; ethics; and management systems. Through our audit program, we aim to identify and solve concerns in our supply chain, and seek continual improvements to address issues and enable suppliers to build their own in-house capabilities. We supplement our audits with targeted assessments of suppliers when we identify opportunities to drive further improvements.\nInformation about our supply chain sustainability progress is available through annual reporting on our website.\nHuman Rights\n \nAt Dell Technologies, upholding and advancing respect for the fundamental human rights of all people is core to our business strategy, purpose, and commitment to drive human progress and create a positive and lasting societal impact. We believe everyone deserves to be treated fairly with dignity and respect, and we are committed to responsible, ethical, inclusive, and sustainable business practices. Our policies and practices are grounded in expectations set out in the United Nations Guiding Principles on Business and Human Rights and the OECD Guidelines on Responsible Business Conduct. We endeavor to ensure that we are not complicit in human rights violations, and we seek to hold our suppliers and other business partners to this same standard. We believe in winning with integrity, and we use training and technology to assist our team members in applying the principles of integrity and compliance as part of everyday business transactions, activities, and decisions. \n13\nTable of \nConte\nnts\nCorporate Information \nWe are a holding company that conducts our operations through subsidiaries.\nThe mailing address of our principal executive offices is One Dell Way, Round Rock, Texas 78682. Our telephone number is 1-800-289-3355.\nOur website address is www.delltechnologies.com. We make available free of charge through our website our annual report on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K, and all amendments to those reports, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. The information on, or accessible through, our website referred to above or any other website we refer to in this report is not part of, and is not incorporated by reference into, this report.\nInformation about our Executive Officers\nThe following table sets forth, as of March 17, 2025, information about our executive officers, who are appointed by our Board of Directors.\nName\nAge\nPosition\nMichael S. Dell\n60\nChief Executive Officer and Chairman\nJeffrey W. Clarke\n62\nVice Chairman and Chief Operating Officer \nYvonne McGill\n58\nChief Financial Officer\nRichard J. Rothberg\n61\nGeneral Counsel\nJennifer D. Saavedra, Ph.D.\n55\nChief Human Resources Officer\nWilliam F. Scannell\n62\nPresident, Global Sales and Customer Operations\nGeraldine Tunnell\n49\nChief Marketing Officer\nMichael S. Dell\n — Mr. Dell serves as Chairman of the Board and Chief Executive Officer of Dell Technologies. Mr. Dell served as Chief Executive Officer of Dell Inc., a wholly-owned subsidiary of Dell Technologies, from 1984 until July 2004 and resumed that role in January 2007. In 1998, Mr. Dell formed MSD Capital, L.P., now DFO Management, LLC, a private investment firm, that exclusively manages the capital for the Dell family. In 1999, he established his family foundation, the Michael & Susan Dell Foundation, with the mission of building pathways that change lives throughout the world. Mr. Dell is an honorary member of the Foundation Board of the World Economic Forum and is an executive committee member of the International Business Council. He serves as a member of the Technology CEO Council and is a member of the Business Roundtable. He also serves on the advisory board of Tsinghua University’s School of Economics and Management in Beijing, China, and on the governing board of the Indian School of Business in Hyderabad, India. Mr. Dell is chairman of the BDT & MSD Advisory Board. In June 2014, Mr. Dell was named the United Nations Foundation’s first Global Advocate for Entrepreneurship. Mr. Dell served as Non-Executive Chairman of SecureWorks Corp., formerly a public majority-owned subsidiary of Dell Technologies and a global provider of intelligence-driven information security solutions, from December 2015 until it was acquired by Sophos Inc. in February 2025; as Chairman of the Board of Directors of VMware, Inc., a cloud infrastructure and digital workspace technology company that was formerly a public majority-owned subsidiary of Dell Technologies, from September 2016 until it was acquired by Broadcom Inc. in November 2023; and as a member of the board of directors of Pivotal Software, Inc., formerly a public majority-owned subsidiary of Dell Technologies that provided a leading cloud-native platform, from September 2016 until it was acquired by VMware, Inc. in December 2019.\n14\nTable of \nConte\nnts\nJeffrey W. Clarke\n — Mr. Clarke serves as Vice Chairman and Chief Operating Officer of Dell Technologies, responsible for running day-to-day business operations, shaping the Company’s strategic agenda, and setting priorities across the Dell Technologies executive leadership team. Mr. Clarke directs the Infrastructure Solutions Group and the Client Solutions Group and manages Global Operations, including manufacturing, procurement, and supply chain. He is also responsible for setting the long-term strategy and leads planning for emerging technology areas such as Cloud, Edge, Telecom, and as-a-Service. Mr. Clarke served as Chief Operating Officer from December 2019 to August 2021 before resuming that role in August 2023 and as Co-Chief Operating Officer from August 2021 until August 2023, and has served as Vice Chairman since September 2017, before which he served as Vice Chairman and President, Operations and Client Solutions with Dell Technologies and, previously, Dell, since January 2009. From January 2003 until January 2009, Mr. Clarke served as Senior Vice President, Business Product Group. From November 2001 to January 2003, Mr. Clarke served as Vice President and General Manager, Relationship Product Group. In 1995, Mr. Clarke became the director of desktop development. Mr. Clarke joined Dell in 1987 as a quality engineer and has served in a variety of other engineering and management roles. Before joining Dell, Mr. Clarke served as a reliability and product engineer at Motorola, Inc, a global technology company.\nYvonne McGill\n — Ms. McGill serves as Chief Financial Officer of Dell Technologies. In this role, in which she has served since August 2023, she is responsible for all aspects of the Company’s finance function, including accounting, financial planning and analysis, tax, treasury, and investor relations, as well as corporate development, global business operations and Dell Financial Services. She also partners closely with the office of the CEO to develop and execute a long-term strategy that creates value for Dell Technologies stakeholders. From August 2015 to August 2023, Ms. McGill served in a variety of finance leadership roles at Dell, including Corporate Controller, where she had responsibility for accounting, tax, treasury, and investor relations, Chief Financial Officer and Senior Vice President, Infrastructure Solutions Group, and Senior Vice President, Global Financial Planning and Analysis. Since joining Dell in 1997, Ms. McGill has served in various other finance leadership roles, including Chief Financial Officer for the Company’s Asia-Pacific, Japan and China region and Chief Accounting Officer. Before beginning her service with Dell, Ms. McGill worked at ManTech International Corporation, a company providing technology solutions and services to U.S. intelligence, defense and federal civilian agencies, and Price Waterhouse LLP (now PricewaterhouseCoopers LLP), a firm specializing in accounting, assurance, tax, and consulting services. Ms. McGill serves on the board of directors of Applied Materials, Inc., an international materials engineering company.\nRichard J. Rothberg\n — Mr. Rothberg serves as General Counsel and Secretary for Dell Technologies. In this role, in which he has served since November 2013, Mr. Rothberg oversees the global legal department and manages government affairs, compliance, and ethics. He is also responsible for global security. Mr. Rothberg joined Dell in 1999 and has served in critical leadership roles throughout the legal department. He served as Vice President of Legal, supporting Dell’s businesses in the Europe, Middle East, and Africa region before moving to Singapore in 2008 as Vice President of Legal for the Asia-Pacific and Japan region. Mr. Rothberg returned to the United States in 2010 to serve as Vice President of Legal for the North America and Latin America regions. In this role, he was lead counsel for sales and operations in the Americas and for the enterprise solutions, software, and end-user computing business units. He also led the government affairs organization worldwide. Before joining Dell, Mr. Rothberg served nearly eight years at Caterpillar Inc., an equipment manufacturing company, in senior legal roles in Nashville, Tennessee and Geneva, Switzerland. Mr. Rothberg was also an attorney for IBM Credit Corporation and at Rogers & Wells, a law firm.\nJennifer D. Saavedra, Ph.D.\n — Dr. Saavedra is Dell Technologies' Chief Human Resources Officer. In this role, Dr. Saavedra leads Dell’s Global Human Resources and Facilities function and accelerates the performance and growth of the Company through its culture and its people. Dr. Saavedra previously served as Dell Technologies’ Senior Vice President, Human Resources – Sales from December 2019 to March 2021 and as its Senior Vice President, Human Resources – Talent and Culture from November 2017 to December 2019. Dr. Saavedra joined Dell in 2005 and has served in many key leadership roles throughout the Human Resources organization, including talent development and culture, business partner, strategy, and learning and development. Before joining Dell in 2005, Dr. Saavedra served as a Human Resources consultant to private and public companies.\n15\nTable of \nConte\nnts\nWilliam F. Scannell\n — Mr. Scannell serves as President, Global Sales and Customer Operations for Dell Technologies, overseeing Sales, Presales, Specialty Sales, OEM and the Global Alliances and Channel operations. In this role, in which he has served since February 2020, Mr. Scannell is responsible for go-to-market strategy and driving global growth by delivering Dell Technologies’ solutions to organizations in established and new markets globally. Mr. Scannell previously served as President, Global Enterprise Sales and Customer Operations for Dell Technologies from September 2017 to January 2020, leading the sales teams to deliver innovative and practical technology solutions to large enterprises and public institutions worldwide. Prior to joining Dell Technologies, Mr. Scannell served as President, Global Sales and Customer Operations at EMC until EMC was acquired by Dell Technologies in September 2016. In this role, to which he was appointed in July 2012 after overseeing customer operations in the Americas and EMEA, Mr. Scannell focused on driving coordination and teamwork among EMC’s business unit sales forces, as well as building and maintaining relationships with EMC’s largest global accounts, global alliance partners, and global channel partners. Mr. Scannell began his career as an EMC sales representative in 1986, becoming country manager of Canada in 1988. Shortly thereafter, his responsibilities expanded to include the United States and Latin America. In 1999, Mr. Scannell moved to London to oversee EMC’s business across all of Europe, Middle East, and Africa. He then managed worldwide sales in 2001 and 2002 before being appointed Executive Vice President in 2007. Mr. Scannell serves on the board of directors of IonQ, Inc., a quantum computing company. \nGeraldine Tunnell\n — Ms. Tunnell serves as the Chief Marketing Officer for Dell Technologies. In this role, which she has held since March 2024, she is directly responsible for the global marketing organization strategy and all aspects of Dell Technologies’ marketing efforts, which include brand, creative, media, product and field marketing, corporate communications and environmental, social, and governance initiatives. Since joining Dell in 2005, Ms. Tunnell has been instrumental in driving transformation and customer-focused strategies across all of Dell Technologies’ businesses and product lines in various marketing capacities. Ms. Tunnell previously served as Senior Vice President of Global Field and Partner Marketing from 2018 to March 2024. Prior to joining Dell, Ms. Tunnell was a management consultant at CapGemini Ernst & Young, a multinational IT services and consulting company, and worked in Silicon Valley at a start-up enterprise focused on supply chain management. \n16\nTable of \nConte\nnts",
  "item7": "ITEM 7 \n— \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis management’s discussion and analysis should be read in conjunction with the audited Consolidated Financial Statements and accompanying Notes included in this Annual Report on Form 10-K. This section of this Annual Report on Form 10-K generally discusses Fiscal 2025 and Fiscal 2024 items. This section also discusses Fiscal 2024 and Fiscal 2023 results, as the Company revised its Fiscal 2024 items to correct for a misstatement in its financial statements discovered during the fourth quarter of Fiscal 2025. The revisions ensure comparability across all periods reflected herein. For additional information, see Note 1 and Note 22 of the Notes to the Consolidated Financial Statements included in this report.\nIn addition to historical financial information, the following discussion contains forward-looking statements that reflect our plans, estimates, and beliefs, and that are subject to numerous risks and uncertainties. Our actual results may differ materially from those expressed or implied in any forward-looking statements.\nUnless otherwise indicated, all results presented are prepared in a manner that complies, in all material respects, with generally accepted accounting principles in the United States of America (“GAAP”). Unless otherwise indicated, all changes identified for the current-period results represent comparisons to results for the prior corresponding fiscal period.\nUnless the context indicates otherwise, references in this report to “we,” “us,” “our,” the “Company,” and “Dell Technologies” mean Dell Technologies Inc. and its consolidated subsidiaries, references to “Dell” mean Dell Inc. and Dell Inc.’s consolidated subsidiaries, and references to “EMC” mean EMC Corporation and EMC Corporation’s consolidated subsidiaries.\nOur fiscal year is the 52- or 53-week period ending on the Friday nearest January 31. We refer to our fiscal years ended January 31, 2025, February 2, 2024, and February 3, 2023 as “Fiscal 2025,” “Fiscal 2024,” and “Fiscal 2023,” respectively. Both Fiscal 2025 and Fiscal 2024 included 52 weeks, while Fiscal 2023 included 53 weeks.\nINTRODUCTION\nCompany Overview\nDell Technologies is a leader in the global technology industry focused on providing broad and innovative technology solutions for the data and artificial intelligence (“AI”) era. We build and offer solutions ranging from client devices and peripherals to infrastructure solutions across servers, networking, and storage to meet the evolving needs of our customers and drive better business outcomes. With our extensive portfolio and our commitment to innovation, we offer secure, integrated solutions that extend from the edge to the core to the cloud, and we are at the forefront of AI, software-defined, and cloud native infrastructure solutions. Our vision is to become the most essential technology partner. We intend to realize our vision by executing our strategy of leveraging our strengths to extend our leadership positions and capture new growth.\nWe are organized into two business units which are also our reportable segments: Infrastructure Solutions Group and Client Solutions Group.\n•\nInfrastructure Solutions Group (“ISG”)\n — ISG includes our servers and networking offerings and our storage offerings. Our server portfolio includes high-performance general-purpose and AI-optimized servers. Our networking portfolio includes wide area network infrastructure, data center and edge networking switches, and cables and optics. Our comprehensive storage portfolio includes modern and traditional storage solutions, including all-flash arrays, scale-out file, object platforms, hyper-converged infrastructure, and software-defined storage. ISG also offers software, peripherals, and services, including consulting and support and deployment.\n•\nClient Solutions Group (“CSG”)\n — CSG includes offerings designed for commercial and consumer customers. Our CSG portfolio includes branded PCs, including notebooks, desktops, and workstations, branded peripherals, and third-party software and peripherals. CSG also includes services offerings, such as configuration, support and deployment, and extended warranties. \n39\nTable of Contents\nOur other businesses primarily consist of our resale of standalone offerings of VMware LLC (formerly VMware, Inc. and individually and together with its subsidiaries, “VMware”), referred to as “VMware Resale,” and offerings of SecureWorks Corp. (“Secureworks”). These businesses are divested businesses or their offerings are no longer actively sold, and are not classified as reportable segments, either individually or collectively. Their operating results are reported within Corporate and other. On October 21, 2024, Secureworks announced that it had entered into a definitive agreement providing for its sale to Sophos Inc., an affiliate of Thoma Bravo, L.P., a private equity and growth capital firm. The transaction was completed on February 3, 2025, subsequent to the close of the Company’s fiscal year ended January 31, 2025, in an all-cash transaction for a purchase price of approximately $0.9 billion.\nFor further discussion regarding our current reportable segments, see “Results of Operations — Business Unit Results” and Note 18 of the Notes to the Consolidated Financial Statements included in this report.\nWe offer customers choice in how they acquire our solutions, including traditional purchasing and offerings under the Dell Payment Solutions portfolio. These offerings provide both payment and consumption solutions, including as-a-Service, subscription, utility, leases, and loans, which allow our customers to pay over time and provide them with operational and financial flexibility. Dell Financial Services and its affiliates (“DFS”) support financing solutions and services as part of the portfolio. For additional information about our financing arrangements, see Note 5 of the Notes to the Consolidated Financial Statements included in this report. \nBusiness Trends and Challenges\nFiscal 2025 Significant Developments\n — During Fiscal 2025, we executed our strategy with strong operating results, generating net revenue and operating income growth. The following trends and conditions affected the environment in which we operated: \n•\nMacroeconomic environment:\n The demand environment was strong for our servers and networking offerings, which contributed to overall net revenue growth. Additionally, we saw modest demand improvement in our commercial offerings within CSG. Given the demand dynamics for the year, we experienced a shift in the mix of the business towards our ISG offerings.\n•\nDemand for AI-optimized solutions:\n Our ISG business continued to benefit from increased demand for AI-optimized solutions as customers continue to adopt and further integrate AI into their operations. As a result of the continued strong demand for our AI-optimized servers, backlog levels for such offerings remained elevated as we exited the fiscal year. \n•\nSupply chain: \nNotwithstanding the increased demand for AI-optimized solutions, our supply chain continued to operate efficiently. We experienced a modest increase in input costs, primarily driven by both component and logistics costs.\n•\nBroadcom’s acquisition of VMware:\n On November 22, 2023, Broadcom Inc. (“Broadcom”) completed its acquisition of VMware, leading to changes to our relationship with VMware as described below.\nWe expect demand growth across our servers and networking offerings and, to a lesser extent, our storage offerings, which we expect will result in ISG net revenue growth in Fiscal 2026. We expect modest CSG net revenue growth for the full fiscal year, driven in part by the anticipated PC refresh cycle in the latter part of Fiscal 2026. Additionally, we expect a continued reduction of our Corporate and other net revenue as we no longer act as a distributor of VMware’s standalone products and services.\nWe expect a modest decline in input costs during the first half of Fiscal 2026. Input cost trends are dependent on the strength or weakness of actual end-user demand and supply dynamics, which will continue to fluctuate and ultimately impact our costs, pricing, and operating results.\nWe remain focused on executing our key strategic priorities, building long-term value creation for our stakeholders, and addressing our customers’ needs while continuing to make prudent decisions in response to the environment. We expect margin rate pressure resulting from a continuing shift in mix towards our AI-optimized servers and a competitive environment. We look to balance profitability and growth while maintaining disciplined pricing as we navigate through competitive pricing pressures. \n40\nTable of Contents\nWe continue to advance our own capabilities to change the way we work and make decisions, improve business outcomes and the customer experience, and reduce costs by leveraging new technology and optimizing business processes. We remain committed to disciplined cost management in coordination with our ongoing business modernization initiatives and expect continued reductions in operating expenses as we take certain measures to reduce costs, including limitation of external hiring, employee reorganizations, and other actions to align our investments with our strategic priorities and customer needs. We anticipate these actions will result in additional reductions in our overall headcount. We believe our unique operating advantages provide a foundation to foster growth, drive efficiencies, and continue to position us for long-term success.\nRelationship with VMware\n \n— On November 22, 2023, VMware was acquired by Broadcom, and subsequently announced changes to its go-to-market approach for VMware offerings that impacted our commercial relationship with VMware. On March 25, 2024, we terminated our Commercial Framework Agreement with VMware, which provided the framework under which we and VMware continued our commercial relationship following our spin-off of VMware on November 1, 2021. We no longer act as a distributor of Broadcom’s VMware standalone products and services, although we will continue to support customers that have purchased resale offerings sold in prior periods. We continue to integrate and embed certain VMware products and services with selected Dell Technologies’ offerings to end-users, such as through our VxRail solution. The results of such offerings are reflected within CSG or ISG, depending upon the nature of the underlying offering sold.\nVMware was a related party until the date of its acquisition by Broadcom. The acquisition terminated the preexisting related party relationship with VMware such that no related party relationship exists with either Broadcom or VMware effective as of November 22, 2023. For more information regarding the impact of the Broadcom acquisition of VMware and our prior related party transactions with VMware, see Note 19 of the Notes to the Consolidated Financial Statements included in this report.\nISG\n \n—\n We expect ISG will continue to be impacted by the evolving nature of the IT infrastructure market and competitive environment. With our scale and market-leading solutions portfolio, we believe we are well-positioned to address the ongoing competitive dynamics and trends in technology and customer needs. Through our collaborative, customer-focused approach to innovation, we strive to deliver new and relevant solutions and software to our customers quickly and efficiently. We continue to focus on customer base expansion and the lifetime value of customer relationships. \nWe anticipate ISG will continue to benefit from technology advancements and interest in AI as customers continue to adopt and integrate AI into their operations. The timing of customer purchases reflects the varying stages of adoption of AI by different customer segments and drives variability in our revenue. To meet the growing demand and increasing complexity of our AI-optimized offerings, we have increased our purchases of certain components with suppliers, which has resulted in increased inventory levels, higher purchase obligations, and new working capital dynamics. Additionally, frequent component part updates or transitions create additional challenges in managing demand and supply levels. While we have seen lead times shorten, we anticipate the next-generation of these components will be subject to supply constraints as demand for these components remains high. \nWe expect that growth in data will continue to generate long-term demand for our storage solutions and services. Cloud native applications are expected to continue to be a key trend in the infrastructure market. We continue to expand our offerings in external storage arrays, which incorporate flexible, cloud-based functionality. We benefit from offering solutions that address software-defined storage, hyper-converged infrastructure, and modular solutions based on server-centric architectures. Our storage business is subject to seasonal trends, which may continue to impact ISG results.\nCSG\n — \nWe participate in all segments of the PC market with a focus on commercial and high-end consumer computing devices, which we believe represent the most stable and profitable markets. We anticipate that CSG will benefit from advances in AI over the long-term as customers will require PCs with the ability to run their complex AI workloads. \nCompetitive dynamics remain an important factor in our CSG business and continue to impact pricing and operating results. We are committed to our long-term CSG strategy and will continue to make investments to innovate across the portfolio. We expect that the CSG demand environment will be subject to seasonal trends and influenced by the timing and scale of the anticipated PC refresh cycle.\nRecurring Revenue and Consumption Models\n \n— We expect that our flexible consumption models will further strengthen our customer relationships and provide a foundation for growth in recurring revenue. We define recurring revenue as revenue recognized that is primarily related to hardware and software maintenance, as well as operating leases, subscription, as-a-Service, and usage-based offerings.\n41\nTable of Contents\nStrategic Investments and Acquisitions\n \n— As part of our strategy, we will continue to evaluate opportunities for strategic investments through our venture capital investment arm, Dell Technologies Capital, with a focus on emerging technology areas that are relevant to our business and that will complement our existing portfolio of solutions. The technologies or products these companies have under development are typically in the early stages and may never have commercial value, which could result in a loss of a substantial part of our investment in the companies. In addition to these investments, we may also make targeted acquisitions of businesses that advance our strategic objectives and accelerate our innovation agenda.\nForeign Currency Exposure\n — We manage our business on a U.S. Dollar basis. However, we have a large global presence, generating approximately half of our net revenue from sales to customers outside of the United States during Fiscal 2025 and Fiscal 2024. As a result, our operating results can be, and particularly in recent periods have been, impacted by fluctuations in foreign currency exchange rates. We utilize a comprehensive hedging strategy intended to mitigate the impact of foreign currency volatility over time, and we adjust pricing when possible to further minimize foreign currency impacts. \nOther Macroeconomic Risks and Uncertainties\n — The impacts of trade protection measures, including increases in tariffs and trade barriers, changes in government policies and international trade arrangements, geopolitical volatility, and global macroeconomic conditions (including those in China) may affect our ability to conduct business in some non-U.S. markets. We monitor and seek to mitigate these risks with adjustments to our manufacturing, supply chain, and distribution networks.\n42\nTable of Contents\nNON-GAAP FINANCIAL MEASURES\nIn this management’s discussion and analysis, we use supplemental measures of our performance which are derived from our consolidated financial information but which are not presented in our consolidated financial statements prepared in accordance with GAAP. These non-GAAP financial measures include non-GAAP product gross margin; non-GAAP services gross margin; non-GAAP gross margin; non-GAAP operating expenses; non-GAAP operating income; non-GAAP net income; non-GAAP earnings per share attributable to Dell Technologies Inc. - diluted; free cash flow; and adjusted free cash flow. These non-GAAP financial measures are not meant to be considered as indicators of performance or liquidity in isolation from or as a substitute for gross margin, operating expenses, operating income, net income, diluted earnings per share, or cash flows from operating activities prepared in accordance with GAAP, and should be read only in conjunction with financial information presented on a GAAP basis.\nWe use non-GAAP financial measures to supplement financial information presented on a GAAP basis. Management uses these non-GAAP measures in financial planning and forecasting and when evaluating our financial results and operating trends and performance. We believe, when used supplementally with GAAP financial measures, these non-GAAP financial measures provide our investors with useful and transparent information to help them evaluate our results by facilitating an enhanced understanding of our results of operations and enabling them to make period to period comparisons. There are limitations to the use of the non-GAAP financial measures presented in this report. Our non-GAAP financial measures may not be comparable to similarly titled measures of other companies. Other companies, including companies in our industry, may calculate non-GAAP financial measures differently than we do, limiting the usefulness of those measures for comparative purposes.\nNon-GAAP product gross margin, non-GAAP services gross margin, non-GAAP gross margin, non-GAAP operating expenses, non-GAAP operating income, non-GAAP net income, and non-GAAP earnings per share attributable to Dell Technologies Inc. - diluted, as defined by us, exclude amortization of intangible assets, stock-based compensation expense, other corporate expenses and, for non-GAAP net income and non-GAAP earnings per share attributable to Dell Technologies Inc. - diluted, fair value adjustments on equity investments and an aggregate adjustment for income taxes. As the excluded items may have a material impact on our financial results, our management compensates for this limitation by relying primarily on our GAAP results and using non-GAAP financial measures supplementally or for projections when comparable GAAP financial measures are not available. \nReconciliations of each non-GAAP financial measure to its most directly comparable GAAP financial measure are presented below. We encourage you to review the reconciliations in conjunction with the presentation of the non-GAAP financial measures for each of the periods presented. The discussion below includes information on each of the excluded items as well as our reasons for excluding them from our non-GAAP results. In future fiscal periods, we may exclude such items and may incur income and expenses similar to these excluded items. Accordingly, the exclusion of these items and other similar items in our non-GAAP presentation should not be interpreted as implying that these items are non-recurring, infrequent, or unusual.\nThe following is a summary of the items excluded from the most comparable GAAP financial measures to calculate our non-GAAP financial measures.\n•\nAmortization of Intangible Assets\n \n—\n \nAmortization of intangible assets primarily consists of the amortization of customer relationships, developed technology, and trade names. In connection with our acquisition by merger of EMC, referred to as the “EMC merger transaction,” and the acquisition of Dell by Dell Technologies Inc., referred to as the “going-private transaction,” all of the tangible and intangible assets and liabilities of EMC and Dell, respectively, were accounted for and recognized at fair value on the transaction dates. We exclude amortization charges for the amortization of intangible assets as they do not reflect our current operating performance and charges are significantly impacted by the timing and magnitude of our acquisitions and, as a result, may vary in amount from period to period.\n•\nStock-based Compensation Expense\n \n— Stock-based compensation expense consists of equity awards granted based on the estimated fair value of those awards at grant date. To estimate the fair value of performance-based awards containing a market condition, we use the Monte Carlo valuation model. For other share-based awards, the fair value is generally based on the closing price of the Class C Common Stock as reported on the New York Stock Exchange on the date of grant. Although stock-based compensation is an important aspect of the compensation of our employees and executives, we exclude such expense because the fair value of the stock-based awards may fluctuate based on factors unrelated to the operating performance of the business and may bear little resemblance to the actual value realized upon the vesting or future exercise of the related stock-based awards.\n43\nTable of Contents\n•\nOther Corporate Expenses\n \n— Other corporate expenses consist primarily of severance expenses, payroll taxes associated with stock-based compensation, incentive charges related to equity investments, facility action costs, transaction-related expenses, and impairment charges. Severance costs are primarily related to severance and benefits for employees terminated pursuant to cost management initiatives. During Fiscal 2025, Fiscal 2024, and Fiscal 2023, we recognized $0.7 billion, $0.6 billion, and $0.5 billion, respectively, of severance expense related to workforce reduction activities. During Fiscal 2023, other corporate expenses also included $0.9 billion of net expense recognized within interest and other, net, in connection with an agreement to settle the Class V transaction litigation. See Note 11 of the Notes to the Consolidated Financial Statements included in this report for information about this matter. Transaction-related expenses typically consist of acquisition, integration, and divestitures related costs, primarily representing costs for legal, banking, consulting, and advisory services, and are expensed as incurred. Although we may incur these types of expenses in the future, we exclude other corporate expenses as they can vary from period to period, are significantly impacted by the timing and nature of these events, and are not used by management in assessing operating performance of the business.\n•\nFair Value Adjustments on Equity Investments\n — Fair value adjustments on equity investments primarily consist of the gain (loss) on strategic investments, which includes recurring fair value adjustments of investments in publicly-traded companies, as well as those in privately-held companies, which are adjusted for observable price changes and any potential impairments. See Note 4 of the Notes to the Consolidated Financial Statements included in this report for additional information on our strategic investment activity. We exclude fair value adjustments on equity investments given the volatility in ongoing adjustments to the valuation of these strategic investments and because such adjustments are unrelated to the operating performance of our business.\n•\nAggregate Adjustment for Income Taxes\n \n—\n \nThe aggregate adjustment for income taxes is the estimated combined income tax effect for the adjustments described above and determined based on the tax jurisdictions where those adjustments were incurred, as well as an adjustment for discrete tax items. During Fiscal 2025, the aggregate adjustment for income taxes included discrete tax benefits of $0.4 billion related to changes in uncertain tax benefits resulting from the expiration of certain U.S. statutes of limitations and $0.2 billion related to stock-based compensation. We exclude these benefits or charges for purposes of calculating non-GAAP net income due to the variability in recognition of discrete tax items from period to period. The tax effects are determined based on the tax jurisdictions where the above items were incurred. See Note 12 of the Notes to the Consolidated Financial Statements included in this report for additional information about our income taxes. Beginning in Fiscal 2025, our non-GAAP income tax was calculated using a fixed estimated annual tax rate that is determined based on historical trends and projections for the current fiscal year. We may adjust our estimated annual tax rate during the fiscal year to take into account events that would significantly impact our income tax expense, including significant changes resulting from tax legislation, material changes in geographic mix of revenue and expenses, changes to our corporate structure, and other significant events.\n44\nTable of Contents\nThe following table presents a reconciliation of each non-GAAP financial measure to the most directly comparable GAAP measure for \nthe \nperiods indicated:\nFiscal Year Ended\n \nJanuary 31, 2025\n% Change\nFebruary 2, 2024\n% Change\nFebruary 3, 2023\n(in millions, except percentages)\nProduct gross margin\n$\n11,258 \n— \n%\n$\n11,237 \n(15)\n%\n$\n13,221 \nNon-GAAP adjustments:\nAmortization of intangibles\n238 \n331 \n416 \nStock-based compensation expense\n56 \n51 \n52 \nOther corporate expenses\n22 \n23 \n32 \nNon-GAAP product gross margin \n$\n11,574 \n(1)\n%\n$\n11,642 \n(15)\n%\n$\n13,721 \nServices gross margin \n$\n9,992 \n2 \n%\n$\n9,832 \n4 \n%\n$\n9,465 \nNon-GAAP adjustments:\nStock-based compensation expense\n96 \n98 \n100 \nOther corporate expenses\n148 \n72 \n141 \nNon-GAAP services gross margin\n$\n10,236 \n2 \n%\n$\n10,002 \n3 \n%\n$\n9,706 \nGross margin\n$\n21,250 \n1 \n%\n$\n21,069 \n(7)\n%\n$\n22,686 \nNon-GAAP adjustments:\nAmortization of intangibles\n238 \n331 \n416 \nStock-based compensation expense\n152 \n149 \n152 \nOther corporate expenses\n170 \n95 \n173 \nNon-GAAP gross margin\n$\n21,810 \n1 \n%\n$\n21,644 \n(8)\n%\n$\n23,427 \nOperating expenses\n$\n15,013 \n(4)\n%\n$\n15,658 \n(7)\n%\n$\n16,915 \nNon-GAAP adjustments:\nAmortization of intangibles\n(429)\n(502)\n(598)\nStock-based compensation expense\n(633)\n(729)\n(779)\nOther corporate expenses\n(670)\n(661)\n(748)\nNon-GAAP operating expenses\n$\n13,281 \n(4)\n%\n$\n13,766 \n(7)\n%\n$\n14,790 \n45\nTable of Contents\nFiscal Year Ended\n \nJanuary 31, 2025\n% Change\nFebruary 2, 2024\n% Change\nFebruary 3, 2023\n(in millions, except percentages and per share amounts)\nOperating income\n$\n6,237 \n15 \n%\n$\n5,411 \n(6)\n%\n$\n5,771 \nNon-GAAP adjustments:\nAmortization of intangibles\n667 \n833 \n1,014 \nStock-based compensation expense\n785 \n878 \n931 \nOther corporate expenses\n840 \n756 \n921 \nNon-GAAP operating income\n$\n8,529 \n8 \n%\n$\n7,878 \n(9)\n%\n$\n8,637 \nNet income\n$\n4,576 \n36 \n%\n$\n3,372 \n39 \n%\n$\n2,422 \nNon-GAAP adjustments:\nAmortization of intangibles\n667 \n833 \n1,014 \nStock-based compensation expense\n785 \n878 \n931 \nOther corporate expenses\n830 \n793 \n1,796 \nFair value adjustments on equity investments\n(177)\n(47)\n206 \nAggregate adjustment for income taxes\n(816)\n(407)\n(642)\nNon-GAAP net income\n$\n5,865 \n8 \n%\n$\n5,422 \n(5)\n%\n$\n5,727 \nEarnings per share attributable to Dell Technologies Inc. — diluted\n$\n6.38 \n39 \n%\n$\n4.60 \n42 \n%\n$\n3.24 \nNon-GAAP adjustments:\nAmortization of intangibles\n0.93 \n1.13 \n1.35 \nStock-based compensation expense\n1.09 \n1.19 \n1.24 \nOther corporate expenses\n1.16 \n1.08 \n2.39 \nFair value adjustments on equity investments\n(0.25)\n(0.06)\n0.27 \nAggregate adjustment for income taxes\n(1.15)\n(0.55)\n(0.86)\nTotal non-GAAP adjustments attributable to non-controlling interests\n(0.02)\n(0.02)\n(0.02)\nNon-GAAP earnings per share attributable to Dell Technologies Inc. — diluted\n$\n8.14 \n10 \n%\n$\n7.37 \n(3)\n%\n$\n7.61 \n46\nTable of Contents\nIn addition to the above measures, we use free cash flow and adjusted free cash flow as non-GAAP liquidity measures to evaluate our performance. As presented in the following table, we define free cash flow as cash flow from operations after excluding capital expenditures and capitalized software costs, net. To measure adjusted free cash flow, we exclude the impact of financing receivables and equipment under operating leases from free cash flow, as the initial funding of these DFS offerings at the time of origination is largely subsequently replaced with cash inflows from our DFS debt, the majority of which is asset-backed. \nFree cash flow and adjusted free cash flow provide useful information to management and investors in part because we use these metrics in our long-term capital allocation framework. Further, we believe free cash flow and adjusted free cash flow are useful measures to management and investors because they reflect cash that we can use, among other purposes, to repurchase common stock, pay dividends on our common stock, invest in our business, pay down debt, and make strategic acquisitions.\nAs is the case with the other non-GAAP measures presented above, users should consider the limitations of using free cash flow and adjusted free cash flow, including the fact that those measures do not provide a complete measure of our cash flows for any period. Free cash flow and adjusted free cash flow do not purport to be alternatives to cash flows from operating activities as a measure of liquidity. In particular, free cash flow and adjusted free cash flow are not intended to be a measure of cash flow available for management’s discretionary use, as these measures do not reflect certain cash requirements, such as debt service requirements and other contractual commitments.\nThe following table presents a reconciliation of free cash flow and adjusted free cash flow to cash flow from operations for the periods indicated:\nFiscal Year Ended\nJanuary 31, 2025\n% Change\nFebruary 2, 2024\n% Change\nFebruary 3, 2023\n(in millions, except percentages)\nCash flow from operations\n$\n4,521 \n(48)\n%\n$\n8,676 \n143 \n%\n$\n3,565 \nNon-GAAP adjustments:\nCapital expenditures and capitalized software development costs, net (a)\n(2,563)\n(2,753)\n(2,993)\nFree cash flow\n$\n1,958 \n(67)\n%\n$\n5,923 \n935 \n%\n$\n572 \nFree cash flow\n$\n1,958 \n(67)\n%\n$\n5,923 \n935 \n%\n$\n572 \nNon-GAAP adjustments:\nFinancing receivables (b)\n951 \n(309)\n461 \nEquipment under operating leases (c)\n188 \n(7)\n500 \nAdjusted free cash flow\n$\n3,097 \n(45)\n%\n$\n5,607 \n266 \n%\n$\n1,533 \n____________________\n(a)\nCapital expenditures and capitalized software development costs, net includes proceeds from sales of facilities, land, and other assets.\n(b)\nFinancing receivables represent the operating cash flow impact from the change in financing receivables.\n(c)\nEquipment under operating leases represents the net impact of capital expenditures and depreciation expense for leases and contractually embedded leases identified within flexible consumption arrangements.\n47\nTable of Contents\nRESULTS OF OPERATIONS\nConsolidated Results\nThe following table summarizes our consolidated results for the periods indicated. Unless otherwise indicated, all changes identified for the current-period results represent comparisons to results for the prior corresponding fiscal period. \nFiscal Year Ended\n \nJanuary 31, 2025\nFebruary 2, 2024\nFebruary 3, 2023\n \nDollars\n% of Net Revenue\n% Change\nDollars\n% of Net Revenue\n% Change\nDollars\n% of Net Revenue\n(in millions, except percentages and per share amounts)\nNet revenue:\nProducts\n$\n71,420 \n74.7 \n%\n11 \n%\n$\n64,353 \n72.8 \n%\n(19)\n%\n$\n79,250 \n77.5 \n%\nServices\n24,147 \n25.3 \n%\n— \n%\n24,072 \n27.2 \n%\n4 \n%\n23,051 \n22.5 \n%\nTotal net revenue\n$\n95,567 \n100.0 \n%\n8 \n%\n$\n88,425 \n100.0 \n%\n(14)\n%\n$\n102,301 \n100.0 \n%\nGross margin:\nProducts\n$\n11,258 \n15.8 \n%\n— \n%\n$\n11,237 \n17.5 \n%\n(15)\n%\n$\n13,221 \n16.7 \n%\nServices\n9,992 \n41.4 \n%\n2 \n%\n9,832 \n40.8 \n%\n4 \n%\n9,465 \n41.1 \n%\nTotal gross margin\n$\n21,250 \n22.2 \n%\n1 \n%\n$\n21,069 \n23.8 \n%\n(7)\n%\n$\n22,686 \n22.2 \n%\nOperating expenses\n$\n15,013 \n15.7 \n%\n(4)\n%\n$\n15,658 \n17.7 \n%\n(7)\n%\n$\n16,915 \n16.6 \n%\nOperating income\n$\n6,237 \n6.5 \n%\n15 \n%\n$\n5,411 \n6.1 \n%\n(6)\n%\n$\n5,771 \n5.6 \n%\nNet income\n$\n4,576 \n4.8 \n%\n36 \n%\n$\n3,372 \n3.8 \n%\n39 \n%\n$\n2,422 \n2.4 \n%\nEarnings per share attributable to Dell Technologies — diluted\n$\n6.38 \n39 \n%\n$\n4.60 \n42 \n%\n$\n3.24 \nCash flow from operations\n$\n4,521 \n(48)\n%\n$\n8,676 \n143 \n%\n$\n3,565 \nNon-GAAP Financial Information\nFiscal Year Ended\nJanuary 31, 2025\nFebruary 2, 2024\nFebruary 3, 2023\nDollars\n% of Net Revenue\n% Change\nDollars\n% of Net Revenue\n% Change\nDollars\n% of Net Revenue\n(in millions, except percentages and per share amounts)\nNon-GAAP gross margin:\nProducts\n$\n11,574 \n16.2 \n%\n(1)\n%\n$\n11,642 \n18.1 \n%\n(15)\n%\n$\n13,721 \n17.3 \n%\nServices\n10,236 \n42.4 \n%\n2 \n%\n10,002 \n41.6 \n%\n3 \n%\n9,706 \n42.1 \n%\nTotal non-GAAP gross margin\n$\n21,810 \n22.8 \n%\n1 \n%\n$\n21,644 \n24.5 \n%\n(8)\n%\n$\n23,427 \n22.9 \n%\nNon-GAAP operating expenses\n$\n13,281 \n13.9 \n%\n(4)\n%\n$\n13,766 \n15.6 \n%\n(7)\n%\n$\n14,790 \n14.5 \n%\nNon-GAAP operating income\n$\n8,529 \n8.9 \n%\n8 \n%\n$\n7,878 \n8.9 \n%\n(9)\n%\n$\n8,637 \n8.4 \n%\nNon-GAAP net income\n$\n5,865 \n6.1 \n%\n8 \n%\n$\n5,422 \n6.1 \n%\n(5)\n%\n$\n5,727 \n5.6 \n%\nNon-GAAP earnings per share attributable to Dell Technologies — diluted\n$\n8.14 \n10 \n%\n$\n7.37 \n(3)\n%\n$\n7.61 \nFree cash flow\n$\n1,958 \n(67)\n%\n$\n5,923 \n935 \n%\n$\n572 \nAdjusted free cash flow\n$\n3,097 \n(45)\n%\n$\n5,607 \n266 \n%\n$\n1,533 \nNon-GAAP product gross margin, non-GAAP services gross margin, non-GAAP gross margin, non-GAAP operating expenses, non-GAAP operating income, non-GAAP net income, non-GAAP earnings per share attributable to Dell Technologies - diluted, free cash flow, and adjusted free cash flow are not measurements of financial performance prepared in accordance with GAAP. See “Non‑GAAP Financial Measures” for additional information about these non-GAAP financial measures, including our reasons for including these measures, material limitations with respect to the usefulness of the measures, and a reconciliation of each non-GAAP financial measure to the most directly comparable GAAP financial measure.\n48\nTable of Contents\nOverview\nDuring Fiscal 2025, net revenue increased by 8%, driven by an increase in ISG net revenue that was partially offset by a decrease in Corporate and other net revenue and, to a lesser extent, CSG net revenue. The increase in ISG net revenue was driven by growth in our servers and networking offerings. Corporate and other net revenue declined primarily due to a decrease in VMware Resale revenue as we no longer act as a distributor of standalone VMware offerings. The decline in CSG net revenue was attributable to a decrease in sales of our consumer offerings.\nDuring Fiscal 2025, operating income and non-GAAP operating income increased by 15% to $6.2 billion and 8% to $8.5 billion, respectively. During Fiscal 2025, the increases in operating income and non-GAAP operating income were primarily attributable to an increase in ISG operating income that was driven by our servers and networking offerings and, to a lesser extent, our storage offerings, which was partially offset by a decrease in CSG operating income.\nDuring Fiscal 2025, operating income and non-GAAP operating income as a percentage of net revenue increased 40 basis points to 6.5% and remained flat at 8.9%, respectively. The operating income and non-GAAP operating income rates during the current year were affected by the favorable impact of a decrease in operating expense rate that was driven by strong ISG net revenue growth coupled with continued disciplined cost management. The favorable impact of a decrease in operating expense rate was offset by a decline in gross margin as a percentage of net revenue due to a shift in mix towards AI-optimized server offerings and a competitive CSG pricing environment.\nCash provided by operating activities was $4.5 billion during Fiscal 2025, and was driven by profitability, partially offset by working capital dynamics. Working capital was primarily impacted by AI, which led to higher inventory, accounts receivable, and accounts payable levels. During Fiscal 2024, cash provided by operating activities was $8.7 billion, which was primarily driven by profitability coupled with strong inventory management and cash collections performance. Cash provided by operating activities during Fiscal 2024 also reflected the impact of the $0.9 billion net payment to settle the Class V transaction litigation and $0.4 billion in proceeds from the sale of our U.S. consumer revolving customer receivables portfolio. See “Liquidity, Cash Requirements, and Market Conditions” for additional information about our cash flow metrics.\nWe continue to see opportunities to create value and grow as we respond to long-term demand for our IT solutions driven by a data- and AI-enabled world. We have demonstrated our ability to adjust to changing market conditions with complementary solutions and innovation across both segments of our business, an agile workforce, and the strength of our global supply chain. As we continue to innovate and modernize our offerings, we believe that Dell Technologies is well-positioned for long-term profitable growth.\nNet Revenue\nFiscal 2025 compared to Fiscal 2024\nDuring Fiscal 2025, net revenue increased 8%, primarily driven by an increase in ISG net revenue that was partially offset by a decrease in Corporate and other net revenue and, to a lesser extent, CSG net revenue. See “Business Unit Results” for further information.\n•\nProduct Net Revenue\n — Product net revenue includes revenue from the sale of hardware products and software licenses. During Fiscal 2025, product net revenue increased 11% due to an increase in ISG product net revenue driven by growth in our servers and networking offerings. The increase was partially offset by a decrease in CSG product net revenue as a result of a decrease in the average selling prices of our CSG offerings and, to a lesser extent, a decline in units sold within our consumer offerings, as well as a decline in Corporate and other product net revenue as we no longer act as a distributor of standalone VMware offerings.\n•\nServices Net Revenue\n \n— Services net revenue includes revenue from our services offerings and support services related to hardware products and software licenses. During Fiscal 2025, services net revenue was flat as the growth within CSG services net revenue and, to a lesser extent, ISG services net revenue was offset by a decline in Corporate and other services net revenue. The increase in CSG services net revenue was primarily due to CSG third-party software support and maintenance as well as support and maintenance associated with products sold in prior periods. The increase in ISG services net revenue was primarily due to support and maintenance associated with products sold in prior periods. Corporate and other services net revenue declined as we no longer act as a distributor of standalone VMware offerings.\n49\nTable of Contents\nA substantial portion of services net revenue is derived from offerings that have been deferred over a period of time, and, as a result, reported growth rates for services net revenue will be different than reported growth rates for product net revenue. \nFrom a geographical perspective, net revenue increased during Fiscal 2025 in the Americas and, to a lesser extent, APJ and remained flat in EMEA.\nFiscal 2024 compared to Fiscal 2023\nDuring Fiscal 2024, net revenue decreased 14%, primarily driven by declines in CSG net revenue and, to a lesser extent, ISG net revenue. See “Business Unit Results” for further information.\n•\nProduct Net Revenue\n — During Fiscal 2024, product net revenue decreased 19% due to declines in CSG product net revenue and, to a lesser extent, ISG product net revenue. CSG product net revenue decreased primarily as a result of a decline in units sold, which impacted both our commercial and consumer offerings. The decline in ISG product net revenue was primarily attributable to a decrease in product net revenue attributable to our servers and networking offerings that was driven by a decrease in units sold and, to a lesser extent, a decline in our product net revenue attributable to storage offerings. \n•\nServices Net Revenue\n \n— During Fiscal 2024, services net revenue increased 4%, driven primarily by growth within services net revenue attributable to CSG and Corporate and other. The increase in services net revenue attributable to CSG was driven primarily by third-party software support and maintenance and hardware support and maintenance. The increase in services net revenue attributable to Corporate and other was driven primarily by VMware software maintenance arrangements. See “Introduction” for additional information about the impact of Broadcom’s acquisition of VMware on our relationship with VMware. \nFrom a geographical perspective, net revenue decreased in the Americas, EMEA, and APJ during Fiscal 2024, most notably within APJ.\nGross Margin\nFiscal 2025 compared to Fiscal 2024\nDuring Fiscal 2025, both gross margin and non-GAAP gross margin increased 1%, to $21.3 billion and $21.8 billion, respectively, driven by an increase in ISG gross margin that was largely offset by a decrease in CSG gross margin. The increase in ISG gross margin was primarily attributable to growth in our AI-optimized server offerings and, to a lesser extent, our storage offerings. The decrease in CSG gross margin was primarily attributable to a competitive pricing environment.\nDuring Fiscal 2025, gross margin and non-GAAP gross margin percentage decreased 160 basis points to 22.2% and 170 basis points to 22.8%, respectively. The decreases in gross margin percentage and non-GAAP gross margin percentage were primarily driven by a shift in mix towards AI-optimized server offerings and a competitive CSG pricing environment.\n•\nProduct Gross Margin\n — During Fiscal 2025, product gross margin and non-GAAP product gross margin remained flat at $11.3 billion and decreased 1% to $11.6 billion, respectively, as the decrease in CSG product gross margin was largely offset by an increase in ISG product gross margin. The decline in CSG product gross margin was primarily attributable to a competitive pricing environment. The increase in ISG product gross margin was primarily due to growth in our AI-optimized server offerings and, to a lesser extent, our storage offerings. \nDuring Fiscal 2025, product gross margin percentage and non-GAAP product gross margin percentage decreased 170 basis points to 15.8% and 190 basis points to 16.2%, respectively. The declines were primarily attributable to a shift in mix towards our AI-optimized server offerings and a competitive CSG pricing environment.\n50\nTable of Contents\n•\nServices Gross Margin\n — During Fiscal 2025, both services gross margin and non-GAAP services gross margin increased 2%, to $10.0 billion and $10.2 billion, respectively. Services gross margin and non-GAAP services gross margin benefited from an increase in support and maintenance associated with products sold in prior periods within both ISG and CSG and, to a lesser extent, an increase in CSG third-party software support and maintenance.\nDuring Fiscal 2025, services gross margin percentage and non-GAAP services gross margin percentage increased 60 basis points to 41.4% and 80 basis points to 42.4%, respectively. The increases in services gross margin percentage and non-GAAP services gross margin percentage were primarily driven by a shift in mix as we no longer act as a distributor of standalone VMware offerings.\nFiscal 2024 compared to Fiscal 2023\nDuring Fiscal 2024, gross margin and non-GAAP gross margin decreased 7% to $21.1 billion and 8% to $21.6 billion, respectively. The declines were driven by decreases in both ISG and CSG gross margin that were primarily attributable to a decrease in net revenue, the effect of which was partially offset by lower input costs.\nBoth gross margin and non-GAAP gross margin percentage increased 160 basis points, to 23.8% and 24.5%, respectively, during Fiscal 2024. The increases were primarily attributable to the impacts of an overall decline in input costs coupled with an increase in average selling prices across many of our offerings as we continued to exercise disciplined pricing in an increasingly competitive environment.\n•\nProduct Gross Margin\n — During Fiscal 2024, product gross margin and non-GAAP product gross margin both decreased 15%, to $11.2 billion and $11.6 billion, respectively. The decreases were primarily driven by declines in both ISG and CSG product gross margin, which were largely attributable to declines in product net revenue, partially offset by lower input costs.\nDuring Fiscal 2024, product gross margin percentage and non-GAAP product gross margin percentage both increased 80 basis points, to 17.5% and 18.1%, respectively, primarily due to an increase in CSG product gross margin percentage. CSG product gross margin percentage increased primarily as a result of the impacts of an overall decline in input costs coupled with an increase in average selling prices across many of our product offerings.\n•\nServices Gross Margin\n — During Fiscal 2024, services gross margin and non-GAAP services gross margin increased 4% to $9.8 billion and 3% to $10.0 billion, respectively. The increases were primarily attributable to growth within ISG services gross margin and, to a lesser extent, CSG services gross margin that were driven by support and maintenance associated with products sold in prior periods.\nDuring Fiscal 2024, services gross margin percentage decreased 30 basis points to 40.8% and non-GAAP services gross margin percentage decreased 50 basis points to 41.6%. The decreases were driven primarily by a shift in mix of services delivered.\nVendor Programs\nOur gross margin is affected by our ability to achieve competitive pricing with our vendors and contract manufacturers, including through our negotiation of a variety of vendor rebate programs to achieve lower net costs for the various components we include in our products. Under these programs, vendors provide us with rebates or other discounts from the list prices for the components, which are generally elements of their pricing strategy. We account for vendor rebates and other discounts as a reduction in cost of net revenue. We manage our costs on a total net cost basis, which includes supplier list prices reduced by vendor rebates and other discounts.\nThe terms and conditions of our vendor rebate programs are largely based on product volumes and are generally negotiated either at the beginning of the annual or quarterly period, depending on the program. The timing and amount of vendor rebates and other discounts we receive under the programs may vary from period to period, reflecting changes in the competitive environment. We monitor our component costs and seek to address the effects of any changes to terms that might arise under our vendor rebate programs. Our gross margins for Fiscal 2025 and Fiscal 2024 were not materially affected by any changes to the terms of our vendor rebate programs, as the amounts we received under these programs were generally stable relative to our total net cost. We are not aware of any significant changes to our vendor rebate programs that will materially impact our results in the near term.\n51\nTable of Contents\nOperating Expenses\nThe following table presents information regarding our operating expenses for the periods indicated:\nFiscal Year Ended\nJanuary 31, 2025\nFebruary 2, 2024\nFebruary 3, 2023\nDollars\n% of Net Revenue\n% Change\nDollars\n% of Net Revenue\n% Change\nDollars\n% of Net Revenue\n(in millions, except percentages)\nOperating expenses:\nSelling, general, and administrative\n$\n11,952 \n12.5 \n%\n(7)\n%\n$\n12,857 \n14.5 \n%\n(9)\n%\n$\n14,136 \n13.9 \n%\nResearch and development\n3,061 \n3.2 \n%\n9 \n%\n2,801 \n3.2 \n%\n1 \n%\n2,779 \n2.7 \n%\nTotal operating expenses\n$\n15,013 \n15.7 \n%\n(4)\n%\n$\n15,658 \n17.7 \n%\n(7)\n%\n$\n16,915 \n16.6 \n%\nFiscal Year Ended\nJanuary 31, 2025\nFebruary 2, 2024\nFebruary 3, 2023\nDollars\n% of Net Revenue\n% Change\nDollars\n% of Net Revenue\n% Change\nDollars\n% of Net Revenue\n(in millions, except percentages)\nNon-GAAP operating expenses\n$\n13,281 \n13.9 \n%\n(4)\n%\n$\n13,766 \n15.6 \n%\n(7)\n%\n$\n14,790 \n14.5 \n%\nFiscal 2025 compared to Fiscal 2024\nDuring Fiscal 2025, total operating expenses decreased 4%, due to a decline in selling, general, and administrative (“SG&A”) expenses.\n•\nSelling, General, and Administrative\n — During Fiscal 2025, SG&A expenses decreased 7%, driven by a decrease in employee compensation and benefits expense, principally due to a decline in overall headcount.\n•\nResearch and Development\n — \nResearch and development (“R&D”) expenses are primarily composed of personnel-related expenses incurred in connection with product development. R&D expenses increased 9% during Fiscal 2025, principally due to an increase in R&D-related employee compensation and benefits expense.\nAs a percentage of net revenue, R&D expenses for both Fiscal 2025 and Fiscal 2024 were 3.2%. We continue to support R&D initiatives to innovate and introduce new and enhanced solutions into the market.\nDuring Fiscal 2025, non-GAAP operating expenses decreased 4%, driven by a decline in employee compensation and benefits expense, primarily resulting from a decline in overall headcount. The decline in employee compensation and benefits expense was partially offset by continued support of R&D initiatives.\nWe continue to make strategic investments designed to enable growth and innovation, while balancing our efforts to drive cost efficiencies in the business. We also expect to continue making investments in support of our own digital transformation, which aims to streamline and optimize our business processes. \nFiscal 2024 compared to Fiscal 2023\nDuring Fiscal 2024, total operating expenses decreased 7% due to a decline in SG&A expenses.\n•\nSelling, General, and Administrative\n — During Fiscal 2024, SG&A expenses decreased 9%, driven by a decrease in employee compensation and benefits expense, principally due to a decline in overall headcount and, to a lesser extent, a decrease in advertising and outside services expense as a result of continued disciplined cost management.\n•\nResearch and Development\n —\n R&D expenses increased 1% during Fiscal 2024 principally due to an increase in R&D-related employee compensation and benefits expense, partially offset by a decrease in outside services as a result of continued disciplined cost management. \n52\nTable of Contents\nAs a percentage of net revenue, R&D expenses for Fiscal 2024 and Fiscal 2023 were 3.2% and 2.7%, respectively. The increases in R&D expenses as a percentage of net revenue were attributable to continued R&D investments as we support R&D initiatives to innovate and introduce new and enhanced solutions into the market.\nDuring Fiscal 2024, non-GAAP operating expenses decreased 7% principally due to continued disciplined cost management, which resulted in a decline in employee compensation and benefits, outside services, and advertising expenses, among other items. \nOperating Income\nFiscal 2025 compared to Fiscal 2024\nDuring Fiscal 2025, operating income and non-GAAP operating income increased by 15% to $6.2 billion and 8% to $8.5 billion, respectively. During Fiscal 2025, the increases in operating income and non-GAAP operating income were primarily attributable to an increase in ISG operating income that was driven by our servers and networking offerings and, to a lesser extent, our storage offerings, which was partially offset by a decrease in CSG operating income.\nDuring Fiscal 2025, operating income and non-GAAP operating income as a percentage of net revenue increased 40 basis points to 6.5% and remained flat at 8.9%, respectively. The operating income and non-GAAP operating income rates during the current year were affected by the favorable impact of a decrease in operating expense rate that was driven by strong ISG net revenue growth coupled with continued disciplined cost management. The favorable impact of a decrease in operating expense rate was offset by a decline in gross margin as a percentage of net revenue due to a shift in mix towards AI-optimized server offerings and a competitive CSG pricing environment.\nFiscal 2024 compared to Fiscal 2023\nOperating income and non-GAAP operating income decreased by 6% to $5.4 billion and 9% to $7.9 billion, respectively, during Fiscal 2024. The decreases were driven by a decrease in ISG operating income, which declined primarily as a result of a decrease in net revenue that outpaced the favorable impacts of a decline in input costs and cost management measures. The decline in ISG operating income was primarily attributable to decreases in our servers and networking offerings and, to a lesser extent, our storage offerings. The decline in operating income was partially offset by decreases in other corporate expenses and amortization of intangibles.\nDuring Fiscal 2024, both operating income and non-GAAP operating income as a percentage of net revenue increased 50 basis points, to 6.1% and 8.9%, respectively. The increases were due to an increase in gross margin as a percentage of net revenue, which was principally driven by a decline in input costs. The increase in operating income and non-GAAP operating income as a percentage of net revenue was offset by an increase in operating expense rate, principally within ISG, that was attributable to a decrease in net revenue which outpaced the impact of continued cost management measures.\n53\nTable of Contents\nInterest and Other, Net\nThe following table presents \ninformation regarding\n interest and other, net for the periods indicated: \nFiscal Year Ended\n \nJanuary 31, 2025\nFebruary 2, 2024\nFebruary 3, 2023\n \n(in millions)\nInterest and other, net:\n \n \nInvestment income, primarily interest\n$\n160 \n$\n305 \n$\n100 \nGain (loss) on investments, net\n177 \n47 \n(206)\nInterest expense\n(1,394)\n(1,501)\n(1,222)\nForeign exchange\n(112)\n(199)\n(265)\nLegal settlement, net\n— \n— \n(894)\nOther\n(20)\n24 \n(59)\nTotal interest and other, net\n$\n(1,189)\n$\n(1,324)\n$\n(2,546)\nFiscal 2025 compared to Fiscal 2024\nDuring Fiscal 2025, the change in interest and other, net was favorable primarily due to gains recognized within our strategic investments portfolio and a reduction in interest expense, partially offset by a decline in interest income on investments.\nFiscal 2024 compared to Fiscal 2023\nThe change in interest and other, net was favorable primarily as a result of $0.9 billion of expense recognized in Fiscal 2023 in connection with an agreement to settle the Class V transaction litigation, coupled with a gain on investments and an increase in investment income during Fiscal 2024. Favorable impacts within interest and other, net were partially offset by an increase in interest expense primarily associated with DFS securitization and structured financing programs. See Note 11 to the Notes to the Consolidated Financial Statements for additional information about the settlement of the Class V transaction litigation.\nIncome and Other Taxes\nThe following table presents information regarding our income and other taxes for the periods indicated:\nFiscal Year Ended\nJanuary 31, 2025\nFebruary 2, 2024\nFebruary 3, 2023\n(in millions, except percentages)\nIncome before income taxes\n$\n5,048 \n$\n4,087 \n$\n3,225 \nIncome tax expense\n$\n472 \n$\n715 \n$\n803 \nEffective income tax rate\n9.4 \n%\n17.5 \n%\n24.9 \n%\nFiscal 2025 compared to Fiscal 2024\nFor Fiscal 2025 and Fiscal 2024, our effective income tax rates were 9.4% and 17.5%, respectively. The change in our effective tax rates for Fiscal 2025 as compared to Fiscal 2024 was primarily attributable to discrete tax items. For Fiscal 2025, we recorded discrete tax benefits of $0.4 billion related to changes in uncertain tax benefits resulting from the expiration of certain U.S. statutes of limitations and $0.2 billion related to stock-based compensation. \n54\nTable of Contents\nOur effective income tax rate can fluctuate depending on the geographic distribution of our worldwide earnings, as our foreign earnings are generally taxed at lower rates than in the United States. The differences between our effective income tax rates and the U.S. federal statutory rate of 21% principally result from the geographical distribution of income, differences between the book and tax treatment of certain items, and discrete tax items. In certain jurisdictions, our tax rate is significantly less than the applicable statutory rate as a result of tax holidays. The majority of our foreign income subject to these tax holidays is attributable to Singapore and China. A significant portion of these income tax benefits relates to a tax holiday that will be effective until January 31, 2029. Most of our other tax holidays will expire in whole or in part during Fiscal 2030 and Fiscal 2031. Many of these tax holidays and reduced tax rates may be extended when certain conditions are met or may be terminated early if certain conditions are not met or as a result of changes in tax legislation. As of January 31, 2025, we were not aware of any matters of non-compliance. Our income tax benefits attributable to tax holidays and incentives of the affected subsidiaries were immaterial to our provision for income taxes and earnings per share for Fiscal 2025 and Fiscal 2024.\nMany countries, including Singapore, a country in which we have a tax holiday, have enacted or are in the process of enacting laws based on the Pillar Two proposal relating to a global minimum tax issued by the Organisation for Economic Co-operation and Development (“OECD”). While we expect our effective income tax rate and cash income tax payments may increase in future years as a result of the global minimum tax, the tax did not have a material impact on our Fiscal 2025 consolidated results of operations and we do not expect a material impact for Fiscal 2026. Our assessment could be affected by legislative guidance and future enactment of additional provisions within the Pillar Two framework. \nFor further discussion regarding tax matters, including the status of income tax audits, see Note 12 of the Notes to the Consolidated Financial Statements included in this report. \nFiscal 2024 compared to Fiscal 2023\nFor Fiscal 2024 and Fiscal 2023, our effective income tax rates were 17.5% and 24.9%, respectively. The change related to our effective income tax rates for Fiscal 2024 as compared to Fiscal 2023 was primarily attributable to the tax impact of foreign operations and benefits from U.S. research and development tax credits. In addition, our effective tax rate for Fiscal 2023 included the impact of an expense recognized in connection with the agreement to settle the Class V transaction litigation described in Note 11 of the Notes to the Consolidated Financial Statements included in this report.\nNet Income \nFiscal 2025 compared to Fiscal 2024\nDuring Fiscal 2025, net income and non-GAAP net income increased 36% to $4.6 billion and 8% to $5.9 billion, respectively. Net income increased primarily due to an increase in operating income and, to a lesser extent, lower income tax expense. Non-GAAP net income increased primarily due to an increase in operating income.\nFiscal 2024 compared to Fiscal 2023\nDuring Fiscal 2024, net income increased 39% to $3.4 billion, driven primarily by a favorable change in interest and other, net, partially offset by a decline in operating income. During Fiscal 2024, non-GAAP net income decreased 5% to $5.4 billion, driven by a decline in operating income, partially offset by a decline in income tax expense.\n55\nTable of Contents\nBusiness Unit Results\nOur reportable segments are based on the ISG and CSG business units. A description of our business units is provided under “Introduction.” See Note 18 of the Notes to the Consolidated Financial Statements included in this report for a reconciliation of net revenue and operating income by reportable segment to consolidated net revenue and consolidated operating income, respectively.\nInfrastructure Solutions Group\nThe following table presents net revenue and operating income attributable to ISG for the periods indicated:\nFiscal Year Ended\n \nJanuary 31, 2025\n% Change\nFebruary 2, 2024\n% Change\nFebruary 3, 2023\n(in millions, except percentages)\nNet revenue:\nServers and networking\n$\n27,136\n54 \n%\n$\n17,624\n(14)\n%\n$\n20,398\nStorage\n16,457\n1 \n%\n16,261\n(9)\n%\n17,958\nTotal ISG net revenue\n$\n43,593\n29 \n%\n$\n33,885\n(12)\n%\n$\n38,356\nOperating income:\nISG operating income\n$\n5,579\n30 \n%\n$\n4,286\n(15)\n%\n$\n5,045\n% of segment net revenue\n12.8 \n%\n12.6 \n%\n13.2 \n%\nFiscal 2025 compared to Fiscal 2024\nNet Revenue\n \n— \nDuring Fiscal 2025, ISG net revenue increased 29%, driven primarily by strength in our servers and networking offerings. \nNet revenue from sales of servers and networking increased 54% during Fiscal 2025. The increase in servers and networking net revenue was driven by growth in our AI-optimized server offerings and, to a lesser extent, our traditional server and networking offerings. \nStorage net revenue increased 1% during Fiscal 2025 primarily due to an increase in our core storage offerings.\nFrom a geographical perspective, net revenue attributable to ISG increased across all regions during Fiscal 2025, most notably in the Americas.\nOperating Income\n \n— \nDuring Fiscal 2025, ISG operating income as a percentage of net revenue increased 20 basis points to 12.8% due to a decline in operating expense as a percentage of revenue that outpaced the decline in gross margin rate. Operating expense as a percentage of net revenue declined primarily due to strong ISG net revenue growth coupled with continued disciplined cost management. Gross margin rate decreased primarily as the result of a shift in mix towards AI-optimized server offerings.\nFiscal 2024 compared to Fiscal 2023\nNet Revenue\n \n— \nDuring Fiscal 2024, ISG net revenue decreased 12%, driven primarily by servers and networking net revenue and, to a lesser extent, storage net revenue as global macroeconomic conditions continued to impact demand. \nRevenue from sales of servers and networking decreased 14% during Fiscal 2024, driven by a decrease in units sold, the effect of which was partially offset by an increase in the average selling prices of our server offerings. The average selling prices of our server offerings increased as a result of the impact of attached offerings and richer configurations.\nDuring Fiscal 2024, storage net revenue decreased 9%, driven by a decline in net revenue across the majority of our storage offerings. \n56\nTable of Contents\nFrom a geographical perspective, net revenue attributable to ISG decreased in the Americas, EMEA, and APJ during Fiscal 2024.\nOperating Income\n \n— \nDuring Fiscal 2024, ISG operating income as a percentage of net revenue decreased 60 basis points to 12.6% principally due to an increase in operating expenses as a percentage of net revenue. Operating expenses as a percentage of net revenue increased as a result of a decline in revenue that outpaced the impact of continued cost management measures coupled with continued investment in research and development. The impact of an increase in operating expenses as a percentage of net revenue was partially offset by an overall decline in input costs coupled with an increase in average selling prices.\n57\nTable of Contents\nClient Solutions Group\nThe following table presents net revenue and operating income attributable to CSG for the periods indicated:\nFiscal Year Ended\nJanuary 31, 2025\n% Change\nFebruary 2, 2024\n% Change\nFebruary 3, 2023\n \n(in millions, except percentages)\nNet revenue:\nCommercial\n$\n40,844\n3 \n%\n$\n39,814\n(13)\n%\n$\n45,556\nConsumer\n7,549\n(17)\n%\n9,102\n(28)\n%\n12,657\nTotal CSG net revenue\n$\n48,393\n(1)\n%\n$\n48,916\n(16)\n%\n$\n58,213\nOperating income:\nCSG operating income\n$\n2,972\n(20)\n%\n$\n3,712\n(3)\n%\n$\n3,824\n% of segment net revenue\n6.1 \n%\n7.6 \n%\n6.6 \n%\nFiscal 2025 compared to Fiscal 2024\nNet Revenue\n \n— \nDuring Fiscal 2025, CSG net revenue declined 1% primarily due to a decrease in units sold and, to a lesser extent, a decline in the average selling prices of our offerings.\nCommercial net revenue increased 3% during Fiscal 2025 primarily due to an increase in units sold. Consumer net revenue decreased 17% during Fiscal 2025, primarily as the result of a decline in units sold and, to a lesser extent, a decline in the average selling prices of our consumer offerings. \nFrom a geographical perspective, net revenue attributable to CSG decreased in APJ and the Americas and increased in EMEA during Fiscal 2025.\nOperating Income\n \n—\n During Fiscal 2025, CSG operating income as a percentage of net revenue decreased 150 basis points to 6.1% primarily due to a decline in gross margin rate, which was partially offset by a decrease in operating expenses as a percentage of net revenue. The decline in gross margin rate was primarily the result of a competitive pricing environment. The decline in operating expenses as a percentage of net revenue was due to continued disciplined cost management.\nFiscal 2024 compared to Fiscal 2023\nNet Revenue\n \n— \nDuring Fiscal 2024, CSG net revenue decreased 16% driven by a decline in units sold as global macroeconomic conditions continued to impact demand.\nCommercial net revenue decreased 13% during Fiscal 2024. The decline was primarily due to a decrease in units sold, which was partially offset by the effect of an increase in the average selling prices of our commercial offerings. Average selling prices of our commercial offerings increased primarily as a result of richer configurations and the mix of offerings sold. Consumer net revenue decreased 28% during Fiscal 2024 principally due to a decrease in units sold and, to a lesser extent, a decline in the average selling prices of our consumer offerings. \nFrom a geographical perspective, net revenue attributable to CSG decreased primarily in APJ and, to a lesser extent, in the Americas and EMEA during Fiscal 2024.\nOperating Income\n \n—\n During Fiscal 2024, CSG operating income as a percentage of net revenue increased 100 basis points to 7.6% primarily due to the impact of an overall decrease in input costs coupled with an increase in the average selling prices of our commercial offerings, as described above. The impact of these factors was partially offset by an increase in operating expenses as a percentage of net revenue, which increased as a result of a decline in CSG net revenue that outpaced the impact of continued cost management measures.\n58\nTable of Contents\nOTHER BALANCE SHEET ITEMS\nAccounts Receivable \nWe sell products and services directly to customers and through a variety of sales channels, including retail distribution. Our accounts receivable, net was $10.3 billion and $9.3 billion as of January 31, 2025 and February 2, 2024, respectively. Accounts receivable, net was up due to growth in our AI-optimized server offerings and the timing of cash receipts. We maintain an allowance for expected credit losses to cover receivables that may be deemed uncollectible. The allowance for expected credit losses is an estimate based on an analysis of historical loss experience, current receivables aging, and management’s assessment of current conditions and its reasonable and supportable expectation of future conditions, as well as specific identifiable customer accounts that are deemed at risk. As of January 31, 2025 and February 2, 2024, the allowance for expected credit losses was $63 million and $71 million, respectively. Based on our assessment, we believe that we are adequately reserved for expected credit losses. \nDell Financial Services and Financing Receivables\nWe offer or arrange a portfolio of payment and consumption solutions and services for our customers globally, including as-a-Service, subscription, utility, leases, and loans designed to match customers' consumption and financing preferences. We believe these options provide operational and financial flexibility and strengthen our customer relationships. To support financing solutions and services as part of the portfolio, DFS originates, collects, and services customer receivables primarily related to the purchase of our product and services solutions. New financing originations were $8.4 billion for both Fiscal 2025 and Fiscal 2024 and $9.7 billion for Fiscal 2023.\nOur leases are generally classified as sales-type leases or operating leases. On commencement of sales-type leases, we recognize profit up-front, and recognize amounts due from the customer under the lease contract as financing receivables. Interest income is recognized as net product revenue over the term of the lease. Upon origination of operating leases, we record equipment under operating leases, classified as property, plant, and equipment, net. We recognize product revenue and depreciation expense, classified as cost of net revenue, over the contract term.\nAs of January 31, 2025 and February 2, 2024, our financing receivables, net were $11.2 billion and $10.5 billion, respectively\n. \nWe maintain an allowance to cover expected financing receivables credit losses and evaluate credit loss expectations based on our total portfolio. The principal charge-off rate for our financing receivables portfolio was 0.6% for Fiscal 2025 and 0.5% for both Fiscal 2024 and Fiscal 2023. The credit quality of our financing receivables remains strong due to the mix of high-quality commercial accounts in our portfolio. We continue to monitor broader economic indicators and their potential impact on future credit loss performance. We have an extensive process to manage our exposure to customer credit risk that includes active management of credit lines and collection activities. We also sell selected fixed-term financing receivables without recourse to unrelated third parties on a periodic basis, primarily to manage certain concentrations of customer credit exposure. Based on our assessment of the customer financing receivables, we believe that we are adequately reserved.\nWe retain a residual interest in equipment leased under our lease programs. As of January 31, 2025 and February 2, 2024, the residual interest recorded as part of financing receivables was $168 million and $157 million, respectively. The amount of the residual interest is established at the inception of the lease based upon estimates of the value of the equipment at the end of the lease term using historical studies, industry data, and future value-at-risk demand valuation methods. On a quarterly basis, we assess the carrying amount of our recorded residual values for expected losses. Generally, expected losses as a result of residual value risk on equipment under lease are not considered to be significant primarily because of the existence of a secondary market with respect to the equipment. Further, the lease agreement defines applicable return conditions and remedies for non-compliance to ensure that the leased equipment will be in good operating condition upon return. No expected losses were recorded related to residual assets during Fiscal 2025 and Fiscal 2024.\nAs of both January 31, 2025 and February 2, 2024, equipment under operating leases, net was $2.2 billion. We assess the carrying amount of the equipment under operating leases for impairment whenever events or circumstances may indicate that an impairment has occurred. No material impairment losses were recorded related to such equipment during Fiscal 2025, Fiscal 2024, and Fiscal 2023.\n59\nTable of Contents\nDFS offerings are initially funded through cash on hand at the time of origination, most of which is subsequently replaced with asset-backed financing. For offerings that qualify as sales-type leases, the initial funding of financing receivables is reflected as an impact to cash flows from operations and is largely subsequently offset by cash proceeds from financing. For offerings that qualify as operating leases, the initial funding is classified as a capital expenditure and reflected as an impact to cash flows used in investing activities.\nSee Note 5 of the Notes to the Consolidated Financial Statements included in this report for additional information about our financing receivables and the associated allowances, and equipment under operating leases.\n60\nTable of Contents\nLIQUIDITY, CASH REQUIREMENTS, AND MARKET CONDITIONS\nLiquidity and Capital Resources\nWe rely on operating cash flows, which are impacted by trends in the demand environment, as our primary source of liquidity for our ongoing business operations. We monitor the efficiency of our balance sheet to ensure that we have adequate liquidity to support our business and strategic initiatives. \nIn addition to internally generated cash, we have access to other capital sources to finance our strategic initiatives and fund growth in our financing operations. Our strategy is to deploy capital from any potential source, whether internally generated cash or debt, depending on the adequacy and availability of that source of capital and whether it can be accessed in a cost-effective manner. \nWe believe that our current cash and cash equivalents, together with cash that will be provided by future operations and borrowings and issuances expected to be available under our revolving credit facility and commercial paper program, will be sufficient over the next twelve months and for the foreseeable future thereafter to meet our material cash requirements, including funding of our operations, debt-related payments, capital expenditures, and other corporate needs. \nAs part of our overall capital allocation strategy, we intend to return capital to our stockholders through both share repurchase programs and dividend payments and use the remaining available cash to drive growth and maintain our investment grade credit rating. \nThe following table presents our cash and cash equivalents as well as our available borrowings as of the dates indicated: \nJanuary 31, 2025\nFebruary 2, 2024\n(in millions)\nCash and cash equivalents, and available borrowings:\nCash and cash equivalents\n$\n3,633 \n$\n7,366 \nRemaining available borrowings under the revolving credit facility\n5,999 \n5,999 \nTotal cash and cash equivalents, and available borrowings\n$\n9,632 \n$\n13,365 \nDuring Fiscal 2025, cash and cash equivalents decreased by $3.7 billion primarily due to the return of capital to our stockholders, capital expenditures, net repayment of DFS debt and Senior Notes, and payments to settle employee tax withholdings on stock-based compensation, the effects of which were partially offset by cash flows from operations.\nAs of January 31, 2025, our revolving credit facility had a maximum capacity of $6.0 billion. Available borrowings under this facility are reduced by draws on the facility and outstanding letters of credit. As of January 31, 2025, there were no borrowings outstanding under the facility and remaining available borrowings totaled approximately $6.0 billion. The revolving credit facility also acts as a backstop to provide liquidity support for our commercial paper program.\nWe maintain a commercial paper program under which we may issue unsecured notes in a maximum aggregate face amount of $5.0 billion outstanding at any time, with maturities of up to 397 days from the date of issue. As of January 31, 2025, we had no outstanding issuances under the program. \nWe may regularly use our available borrowings from the revolving credit facility and issuances under the commercial paper program, generally on a short-term basis, for general corporate purposes. See the following discussion for additional information about our debt.\n \n61\nTable of Contents\nDebt\nThe following table presents our outstanding debt as of the dates indicated:\nJanuary 31, 2025\nChange\nFebruary 2, 2024\n(in millions)\nCore debt\nSenior Notes\n$\n15,073 \n$\n(534)\n$\n15,607 \nLegacy Notes\n952 \n— \n952 \nDFS allocated debt\n(3,028)\n(1,388)\n(1,640)\nTotal core debt \n12,997 \n(1,922)\n14,919 \nDFS related debt\nDFS debt\n8,711 \n(781)\n9,492 \nDFS allocated debt\n3,028 \n1,388 \n1,640 \nTotal DFS related debt\n11,739 \n607 \n11,132 \nOther\n52 \n(119)\n171 \nTotal debt, principal amount\n24,788 \n(1,434)\n26,222 \nCarrying value adjustments\n(221)\n7 \n(228)\nTotal debt, carrying value\n$\n24,567 \n$\n(1,427)\n$\n25,994 \nThe outstanding principal amount of our debt decreased $1.4 billion to $24.8 billion as of January 31, 2025, driven primarily by net repayments of our DFS debt and Senior Notes.\nWe define core debt as the total principal amount of our debt, less DFS related debt and other debt. Our core debt was $13.0 billion and $14.9 billion as of January 31, 2025 and February 2, 2024, respectively. See Note 7 of the Notes to the Consolidated Financial Statements included in this report for additional information about our debt.\nDFS related debt primarily represents debt from our securitization and structured financing programs. Our risk of loss under these programs is limited to transferred lease and loan payments and associated equipment, as the credit holders have no recourse to Dell Technologies.\nTo fund the expansion of our DFS business, we balance the use of the securitization and structured financing programs with other sources of liquidity. We approximate the amount of our core debt used to fund the DFS business by applying a 7:1 debt-to-equity ratio to the sum of our financing receivables balance and equipment under operating leases, net, also referred to as DFS owned assets. The debt-to-equity ratio is based on the underlying credit quality of the assets. See Note 5 of the Notes to the Consolidated Financial Statements included in this report for additional information about our DFS debt.\nThe following table presents DFS owned assets as of the dates indicated:\nJanuary 31, 2025\nFebruary 2, 2024\n(in millions)\nFinancing receivables, net\n$\n11,231 \n$\n10,520 \nEquipment under operating leases, net\n2,185 \n2,202 \nDFS owned assets\n$\n13,416 \n$\n12,722 \nWe believe we will continue to be able to make our debt principal and interest payments, including payment of short-term maturities, from existing and expected sources of cash, primarily from operating cash flows. Cash used for debt principal and interest payments may include short-term borrowings under our commercial paper program, our revolving credit facility, or other borrowings. Under our variable-rate debt, we could experience variations in our future interest expense from potential fluctuations in applicable reference rates, or from possible fluctuations in the level of DFS debt required to meet future demand for customer financing. \n62\nTable of Contents\nAt our sole discretion, we may purchase, redeem, prepay, refinance, or otherwise retire any amount of our outstanding indebtedness under the terms of such indebtedness at any time and from time to time, in open market or negotiated transactions with the holders of such indebtedness or otherwise, as we consider appropriate in light of market conditions and other relevant factors.\nCash Flows\nThe following table presents a summary of our \nConsolidated Statements of Cash Flows\n for the periods indicated:\nFiscal Year Ended\n \nJanuary 31, 2025\nFebruary 2, 2024\nFebruary 3, 2023\n(in millions)\nNet change in cash from:\nOperating activities\n$\n4,521 \n$\n8,676 \n$\n3,565 \nInvesting activities\n(2,215)\n(2,783)\n(3,024)\nFinancing activities\n(5,815)\n(7,094)\n(1,625)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n(179)\n(186)\n(104)\nChange in cash, cash equivalents, and restricted cash\n$\n(3,688)\n$\n(1,387)\n$\n(1,188)\nOperating Activities\n — Cash provided by operating activities was $4.5 billion during Fiscal 2025 and was driven by profitability, partially offset by working capital dynamics. Working capital was primarily impacted by AI, which led to higher inventory, accounts receivable, and accounts payable levels. During Fiscal 2024, cash provided by operating activities was $8.7 billion, which was primarily driven by profitability coupled with strong inventory management and cash collections performance. Cash provided by operating activities during Fiscal 2024 also reflected the impact of the $0.9 billion net payment to settle the Class V transaction litigation and $0.4 billion in proceeds from the sale of our U.S. consumer revolving customer receivables portfolio.\nInvesting Activities\n —\n Investing activities primarily consist of cash used to fund capital expenditures for property, plant, and equipment inclusive of equipment under operating leases and equipment used to support our as-a-Service offerings, which we refer to collectively as assets in a customer contract. Additional activities may include capitalized software development costs, the maturities, sales, and purchases of investments, and acquisitions and divestitures. Cash used in investing activities was $2.2 billion and $2.8 billion during Fiscal 2025 and Fiscal 2024, respectively, and was primarily applied to capital expenditures. \n \nFinancing Activities\n — Financing activities primarily consist of the proceeds and repayments of debt and return of capital to our stockholders. Cash used in financing activities was $5.8 billion during Fiscal 2025 and primarily consisted of repurchases of common stock, inclusive of payments to settle employee tax withholdings on stock-based compensation, net repayments of our DFS debt and Senior Notes, and the payment of quarterly dividends. During Fiscal 2024, cash used in financing activities was $7.1 billion and primarily consisted of principal repayments of our Senior Notes, repurchases of common stock, inclusive of payments to settle employee tax withholdings on stock-based compensation, and the payment of quarterly dividends.\nDFS Cash Flow Impacts\n \n— DFS offerings are initially funded through cash on hand at the time of origination, most of which is subsequently replaced with asset-backed financing. For offerings that qualify as sales-type leases, the initial funding of financing receivables is reflected as an impact to cash flows from operations and is largely subsequently offset by cash proceeds from financing. For offerings that qualify as operating leases, the initial funding is classified as a capital expenditure and reflected as cash flows used in investing activities. DFS new financing originations were $8.4 billion during both Fiscal 2025 and Fiscal 2024 and $9.7 billion during Fiscal 2023. As of January 31, 2025, we had $11.2 billion of total net financing receivables and $2.2 billion of equipment under operating leases, net.\n63\nTable of Contents\nSupply Chain Finance Program\n \n— We maintain a Supply Chain Finance Program (the “SCF Program”) that enables eligible suppliers to sell receivables due from us to a third-party financial institution at the suppliers’ sole discretion. The SCF Program does not impact our liquidity, as payments by us to participating suppliers are remitted to the financial institution on the original invoice due date. Further, we negotiate payment terms with our suppliers regardless of their decision to participate in the SCF Program. Payments made under the SCF Program are included in cash flows from operating activities on the Consolidated Statements of Cash Flows. See Note 20 of the Notes to the Consolidated Financial Statements included in this report for more information regarding the SCF Program.\nMaterial Capital Commitments and Cash Requirements\nThe Company’s material capital commitments include the following:\nCapital Expenditures\n \n— We spent $2.7 billion and $2.8 billion during Fiscal 2025 and Fiscal 2024, respectively, on property, plant, and equipment and capitalized software development costs. Of total expenditures incurred, funding of assets in a customer contract totaled $1.3 billion and $1.2 billion during Fiscal 2025 and Fiscal 2024, respectively. Product demand, product mix, the use of contract manufacturers, and ongoing investments in operating and information technology infrastructure influence the level and prioritization of our capital expenditures.\nRepurchases of Common Stock\n \n— On September 23, 2021, our Board of Directors approved a stock repurchase program with no fixed expiration date under which we may repurchase up to $5 billion of shares of Class C Common Stock, exclusive of any fees, commissions, or other expenses related to such repurchases. On October 5, 2023 and February 27, 2025, subsequent to the close of Fiscal 2025, our Board of Directors authorized additional shares for repurchase under the stock repurchase program of $5 billion and $10 billion, respectively. Following the February 27, 2025 approval, we had approximately $11.5 billion of authorized shares remaining under the program.\nDuring Fiscal 2025, we repurchased approximately 22 million shares of Class C Common Stock for a total purchase price of approximately $2.6 billion. During Fiscal 2024, we repurchased approximately 34 million shares of Class C Common Stock for a total purchase price of approximately $2.1 billion.\nDividend Payments\n \n— During Fiscal 2025 and Fiscal 2024, the Company paid $1.3 billion and $1.1 billion in dividends and dividend equivalents at a rate of $0.445 and $0.37 per share per fiscal quarter, respectively. \nOn February 27, 2025, we announced that the Board of Directors approved an 18% increase in the dividend rate to $0.525 per share per fiscal quarter beginning in the first quarter of Fiscal 2026.\nAdditionally, the Company’s material cash requirements include the following contractual obligations:\nDebt\n — Our expected principal cash payments on borrowings are exclusive of discounts and premiums. As of January 31, 2025, the Company had outstanding debt for an aggregate principal amount of $24.8 billion, with $5.2 billion payable within 12 months. Included within the aggregate principal amount was $16.1 billion of corporate and other debt with varying maturities, with an immaterial amount payable within 12 months, and $8.7 billion of DFS debt, with $5.2 billion payable within 12 months. \nAs of January 31, 2025, future interest payments associated with outstanding debt were $7.4 billion, with $1.2 billion payable within 12 months. Included within total future interest payments is $6.9 billion of payments related to corporate and other debt, with $0.9 billion payable within 12 months, and $0.5 billion of payments related to DFS debt, with $0.3 billion payable within 12 months.\nPurchase Obligations\n \n—\n Purchase obligations are defined as contractual obligations to purchase goods or services that are enforceable and legally binding on us. These obligations specify all significant terms, including fixed or minimum quantities to be purchased; fixed, minimum, or variable price provisions; and the approximate timing of the transaction. Purchase obligations do not include contracts that may be canceled without penalty.\n64\nTable of Contents\nWe utilize several suppliers to manufacture sub-assemblies for our products. Our efficient supply chain management allows us to enter into flexible and mutually beneficial purchase arrangements with our suppliers in order to minimize inventory risk. Consistent with industry practice, we acquire raw materials or other goods and services, including product components, by issuing to suppliers authorizations to purchase based on our projected demand and manufacturing needs. Additionally, to meet the growing demand and increasing complexity of our AI-optimized offerings, we have increased our purchases of certain components with suppliers, which has resulted in increased purchase obligations. These purchase orders are typically fulfilled within 30 days and are entered into during the ordinary course of business in order to establish best pricing and continuity of supply for our production. Purchase orders are not included in purchase obligations, as they typically represent our authorization to purchase rather than binding purchase obligations.\nAs of January 31, 2025, the Company had purchase obligations of $6.5 billion, of which $5.0 billion was payable within 12 months.\nOperating Leases\n — We lease property and equipment, manufacturing facilities, and office space under non-cancelable leases. Certain of these leases obligate us to pay taxes, maintenance, and repair costs. As of January 31, 2025, the Company had operating lease obligations of $0.8 billion, with $0.2 billion payable within 12 months. See Note 6 of the Notes to the Consolidated Financial Statements included in this report for additional information about our leasing transactions in which we are the lessee.\nTax Obligations\n — Tax obligations represent a one-time mandatory deemed repatriation tax on undistributed earnings of foreign subsidiaries. As of January 31, 2025, the balance of tax obligations was $60 million, with the full amount payable within 12 months. Excluded from the amounts above are $0.9 billion in additional liabilities associated with uncertain tax positions as of January 31, 2025. We are unable to reliably estimate the expected payment dates for any liabilities for uncertain tax positions. See Note 12 of the Notes to the Consolidated Financial Statements included in this report for more information regarding these tax matters.\nMarket Conditions\nWe regularly monitor economic conditions and associated impacts on the financial markets and our business. We consistently evaluate the financial health of our supplier base, carefully manage customer credit, diversify counterparty risk, and monitor the concentration risk of our cash and cash equivalents balances globally. We routinely monitor our financial exposure to borrowers and counterparties.\nWe monitor credit risk associated with our financial counterparties using various market credit risk indicators such as credit ratings issued by nationally recognized credit rating agencies and changes in market credit default swap levels. Our AI solutions to date have been purchased primarily by a small number of larger customers and cloud service providers. Such purchases generally involve larger amounts of credit, and could impact overall credit risk in trade and financing receivables. We perform periodic evaluations of our positions with counterparties and may limit exposure to any one counterparty in accordance with our policies. We monitor and manage our positions based on current and expected market developments. \nWe use derivative instruments to hedge certain foreign currency exposures. We use forward contracts and purchased options designated as cash flow hedges to protect against the foreign currency exchange rate risks inherent in our forecasted transactions denominated in currencies other than the U.S. dollar. In addition, we primarily use forward contracts and may use purchased options to hedge monetary assets and liabilities denominated in a foreign currency. See Note 8 of the Notes to the Consolidated Financial Statements included in this report for additional information about our use of derivative instruments.\nWe are exposed to interest rate risk related to our variable-rate debt portfolio. In the normal course of business we follow established policies and procedures to manage this risk, including monitoring of our asset and liability mix and the use of derivative instruments. As a result, we do not anticipate any material losses from interest rate risk.\n65\nTable of Contents\nSummarized Guarantor Financial Information\nThe Company’s outstanding senior notes (“Senior Notes”) are registered, unsecured, and issued by Dell International L.L.C. and EMC Corporation (the “Issuers”), both of which are wholly-owned subsidiaries of Dell Technologies Inc. The Senior Notes are guaranteed on a joint and several unsecured basis by Dell Technologies Inc. and its wholly-owned subsidiaries, Denali Intermediate, Inc. and Dell Inc. (collectively, the “Guarantors”). \nBasis of Preparation of the Summarized Financial Information\n — The tables below are summarized financial information provided in conformity with Rule 13-01 of the SEC’s Regulation S-X. The summarized financial information of the Issuers and Guarantors (collectively, the “Obligor Group”) is presented on a combined basis, excluding intercompany balances and transactions between entities in the Obligor Group. The Obligor Group’s investment balances in Non-Obligor Subsidiaries have been excluded. The Obligor Group’s amounts due from, amounts due to, and transactions with Non-Obligor Subsidiaries have been presented separately. \nThe following table presents summarized results of operations information for the Obligor Group for the period indicated:\nFiscal Year Ended\nJanuary 31, 2025\n(in millions)\nNet revenue\n$\n8,507 \nGross margin\n4,328 \nOperating income\n908 \nInterest and other, net\n(4,021)\nLoss before income taxes\n$\n(3,113)\nNet loss attributable to Obligor Group (a)\n$\n(2,167)\n____________________\n(a)\nIncludes net loss from intercompany transactions with Non-Obligor Subsidiaries of $4,268 million, which primarily consists of interest expense, shared services, and the resale of solutions.\n66\nTable of Contents\nThe following table presents summarized balance sheet information for the Obligor Group as of the dates indicated:\nJanuary 31, 2025\nFebruary 2, 2024\n(in millions)\nASSETS\nCurrent assets\n$\n3,132 \n$\n2,631 \nIntercompany receivables\n175 \n281 \nShort-term intercompany loan receivables\n— \n92 \nTotal current assets\n3,307 \n3,004 \nGoodwill and intangible assets\n14,073 \n14,447 \nOther non-current assets\n3,412 \n3,437 \nTotal assets\n$\n20,792 \n$\n20,888 \nLIABILITIES\nCurrent liabilities\n$\n4,097 \n$\n5,255 \nLong-term debt\n15,824 \n15,353 \nLong-term intercompany loan payables\n44,516 \n41,617 \nOther non-current liabilities\n3,339 \n3,473 \nTotal liabilities\n$\n67,776 \n$\n65,698 \n67\nTable of Contents\nCritical Accounting Estimates\nWe prepare our financial statements in conformity with GAAP, which requires certain estimates, assumptions, and judgments to be made that may affect our Consolidated Statements of Financial Position and Consolidated Statements of Income. Accounting policies that have a significant impact on our Consolidated Financial Statements are described in Note 2 of the Notes to the Consolidated Financial Statements included in this report. The accounting estimates and assumptions discussed in this section are those that we consider to be the most critical. We consider an accounting policy to be critical if the nature of the estimate or assumption is subject to a material level of judgment and if changes in those estimates or assumptions are reasonably likely to materially impact our Consolidated Financial Statements. We have discussed the development, selection, and disclosure of our critical accounting policies with the Audit Committee of our Board of Directors.\nRevenue Recognition\n — We sell a wide portfolio of products and services offerings to our customers. Our agreements have varying terms and conditions depending on the goods and services being sold, the rights and obligations conveyed, and the legal jurisdiction of the arrangement. While most of our agreements have standard terms and conditions, more complex agreements may contain nonstandard terms and conditions. There are significant judgments in interpreting agreements to determine the appropriate accounting for nonstandard terms and conditions.\nOur contracts with customers often include multiple performance obligations for various distinct goods and services such as hardware, software licenses, support and maintenance agreements, and other service offerings and solutions. We use significant judgment to assess whether these promises are distinct performance obligations that should be accounted for separately. In certain hardware solutions, the hardware is highly interdependent on, and interrelated with, the embedded software. In these offerings, the hardware and software licenses are accounted for as a single performance obligation.\nThe transaction price reflects the amount of consideration to which we expect to be entitled in exchange for transferring goods or services to the customer. If the consideration promised in a contract includes a variable amount, we estimate the amount to which we expect to be entitled using either the expected value or most likely amount method. Estimates are updated each reporting period as the variability is resolved or if additional information becomes available. Generally, volume discounts, rebates, and sales returns reduce the transaction price. When we determine the transaction price, we only include amounts that are not subject to significant future reversal.\nWhen a contract includes multiple performance obligations, the transaction price is allocated to each performance obligation in proportion to the standalone selling price (“SSP”) of each performance obligation. \nJudgment is required when determining the SSP of our performance obligations. If the observable price is available, we utilize that price for the SSP. If the observable price is not available, the SSP must be estimated. We estimate SSP by considering multiple factors, including, but not limited to, pricing practices, internal costs, and profit objectives as well as overall market conditions, which include geographic or regional specific factors, competitive positioning, and competitor actions. Our SSP estimates rely, in part, on company pricing trends. Market conditions could impact the selling price in the current period which may not be reflective of trends, and could lead to revenue timing, classification, and segment differences when compared to similar contracts in other periods. SSP for our performance obligations is periodically reassessed.\nFor transactions that involve a third party, the Company evaluates whether it is acting as the principal or the agent in the transaction. This determination requires significant judgment and impacts the amount and timing of revenue recognized. If the Company determines that it controls a good or service before it is transferred to the customer, the Company is acting as the principal and recognizes revenue at the gross amount of consideration it is entitled to from the customer. Indicators that the Company controls a good or service before transferring to a customer include, but are not limited to, the Company being the primary obligor to the customer, establishing its own pricing, and having inventory and credit risks.\nGoodwill and Indefinite-Lived Intangible Assets Impairment Assessments \n— Goodwill and indefinite-lived intangible assets are tested for impairment annually during the third fiscal quarter and whenever events or circumstances may indicate that an impairment has occurred.\nTo determine whether goodwill is impaired, we first assess certain qualitative factors. Qualitative factors that may be assessed include, but are not limited to, macroeconomic conditions, industry and market considerations, cost factors, overall financial performance, or other relevant company-specific events. Based on this assessment, if it is determined to be more likely than not that the fair value of a goodwill reporting unit is less than its carrying amount, we perform a quantitative analysis of the goodwill impairment test. Alternatively, we may bypass the qualitative assessment and perform a quantitative impairment test. \n68\nTable of Contents\nSignificant judgment is exercised in the identification of goodwill reporting units, assignment of assets and liabilities to goodwill reporting units, assignment of goodwill to reporting units, and determination of the fair value of each goodwill reporting unit. The fair value of each of our goodwill reporting units is generally estimated using a combination of public company multiples and discounted cash flow methodologies, which is then compared to the carrying value of each goodwill reporting unit. The discounted cash flow and public company multiples methodologies require significant judgment, including estimation of future revenues, gross margins, and operating expenses, which are dependent on internal forecasts, current and anticipated economic conditions and trends, selection of market multiples through assessment of the reporting unit’s performance relative to peer competitors, the estimation of the long-term revenue growth rate and discount rate of our business, and the determination of our weighted average cost of capital. Changes in these estimates and assumptions could materially affect the fair value of the goodwill reporting unit, potentially resulting in a non-cash impairment charge. \nThe fair value of the indefinite-lived intangible assets is generally estimated using discounted cash flow methodologies. The discounted cash flow methodologies require significant judgment, including estimation of future revenue, the estimation of the long-term revenue growth rate of our business, and the determination of the weighted average cost of capital and royalty rates. Changes in these estimates and assumptions could materially affect the fair value of the indefinite-lived intangible assets, potentially resulting in a non-cash impairment charge.\nFor our annual impairment test during the third fiscal quarter of Fiscal 2025, during which the Company elected to quantitatively test the Infrastructure Solutions Group and Client Solutions Group reporting units, we determined that the fair value of each of these reporting units substantially exceeded its carrying amount. For more information about our goodwill and intangible assets, see Note 9 of the Notes to the Consolidated Financial Statements included in this report.\nIncome Taxes \n— We are subject to income tax in the United States and numerous foreign jurisdictions. Significant judgments are required in determining the consolidated provision for income taxes. We calculate a provision for income taxes using the asset and liability method, under which deferred tax assets and liabilities are recognized by identifying the temporary differences arising from the different treatment of items for tax and accounting purposes. We account for the tax impact of including Global Intangible Low-Taxed Income (GILTI) in U.S. taxable income as a period cost. We provide related valuation allowances for deferred tax assets, where appropriate. Significant judgment is required in determining any valuation allowance against deferred tax assets. In assessing the need for a valuation allowance, we consider all available evidence for each jurisdiction, including past operating results, estimates of future taxable income, and the feasibility of ongoing tax planning strategies. In the event we determine that all or part of the net deferred tax assets are not realizable in the future, we will make an adjustment to the valuation allowance that would be charged to earnings in the period such determination is made.\nSignificant judgment is also required in evaluating our uncertain tax positions. Although we believe our tax return positions are sustainable, we recognize tax benefits from uncertain tax positions in the financial statements only when it is more likely than not that the positions will be sustained upon examination, including resolution of any related appeals or litigation processes, based on the technical merits and a consideration of the relevant taxing authority’s administrative practices and precedents. To the extent that the final tax outcome of these matters is different from the amounts recorded, such differences will impact the provision for income taxes in the period in which such determination is made. The provision for income taxes includes the impact of reserve provisions and changes to reserves that are considered appropriate, as well as the related net interest and penalties. We believe we have provided adequate reserves for all uncertain tax positions.\nLegal and Other Contingencies \n— The outcomes of legal proceedings and claims brought against us are subject to significant uncertainty. An estimated loss from a loss contingency such as a legal proceeding or claim is accrued by a charge to income if it is probable that an asset has been impaired or a liability has been incurred and the amount of the loss can be reasonably estimated. In determining whether a loss should be accrued, we evaluate, among other factors, the degree of probability of an unfavorable outcome and the ability to make a reasonable estimate of the amount of loss. Significant judgment is required in determining whether a loss should be accrued, and changes in these factors could materially impact our Consolidated Financial Statements.\n69\nTable of Contents\nInventories \n— We state our inventory at the lower of cost or net realizable value. We record a write-down for inventories of components and products, including third-party products held for resale, which have become obsolete or are in excess of anticipated demand or net realizable value. We perform a detailed review of inventory each fiscal\n \nquarter that considers multiple factors, including demand forecasts, product life cycle status, product development plans, current sales levels, product pricing, and component cost trends. The industries in which we compete are subject to demand changes. If future demand or market conditions for our products are less favorable than\n \nforecasted, or if unforeseen technological changes negatively impact the utility of component inventory, we may be required to record additional write-downs, which would adversely affect our gross margin.\nRecently Issued Accounting Pronouncements\nSee Note 2 of the Notes to the Consolidated Financial Statements included in this report for a summary of recently issued accounting pronouncements that are applicable to our Consolidated Financial Statements.\n70\nTable of Contents",
  "item2": null
}