{
  "source_file": "dg-20250131x10k.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\n​\nGeneral\n​\nWe are the largest discount retailer in the United States by number of stores, with 20,662 stores located in 48 U.S. states and Mexico as of February 28, 2025, with the greatest concentration of stores in the southern, southwestern, midwestern and eastern United States. Our first stores in Mexico opened in 2023. We offer a broad selection of merchandise, including consumable items, seasonal items, home products and apparel. Our merchandise includes national brands from leading manufacturers, as well as our own private brand selections with prices at substantial discounts to national brands. We offer our customers these national brand and private brand products at everyday low prices (typically $10 or less) in our convenient small-box locations.\n​\nOur History\n​\nJ.L. Turner founded our Company in 1939 as J.L. Turner and Son, Wholesale. We were incorporated as a Kentucky corporation under the name J.L. Turner & Son, Inc. in 1955, when we opened our first Dollar General store. We changed our name to Dollar General Corporation in 1968 and reincorporated in 1998 as a Tennessee corporation. Our common stock was publicly traded from 1968 until July 2007, when we merged with an entity controlled by investment funds affiliated with Kohlberg Kravis Roberts & Co. L.P., or KKR. In November 2009 our common stock again became publicly traded on the New York Stock Exchange under the symbol “DG”, and in December 2013 the entity controlled by investment funds affiliated with KKR sold its remaining shares of our common stock. \n​\nOur Business Model\n​\nOur long history of profitable growth is founded on a commitment to a relatively simple business model: providing a broad base of customers with their basic everyday and household needs, supplemented with a variety of general merchandise items, at everyday low prices in conveniently located, small-box stores. We continually evaluate the needs and demands of our customers and modify our merchandise selections and pricing accordingly, while remaining focused on increasing profitability, cash generation and returns for our shareholders.\n​\nOur long-term operating priorities are: 1) driving profitable sales growth, 2) capturing growth opportunities, 3) enhancing our position as a low-cost operator, and 4) investing in the growth and development of our teams. For more information on these operating priorities, see the “Executive Overview” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations, included in Part II, Item 7 of this report. \n​\nWe have achieved positive same-store sales growth each year since 1990, with the exception of 2021 which followed unusually high sales results in 2020 during the height of the COVID pandemic. We believe that this consistent growth over many years, which has taken place in a variety of economic conditions, is a result of our compelling value and convenience proposition, although no assurances can be given that we will achieve positive same-store sales growth in any given year. \n​\nCompelling Value and Convenience Proposition.\n  Our ability to deliver highly competitive prices in convenient locations and our easy “in and out” shopping format create a compelling shopping experience that we believe distinguishes us from other discount retailers as well as convenience, drug, grocery, online and mass merchant retailers. Our slogan “Save time. Save money. Every day!”\n® summarizes our appeal to customers. We believe our ability to effectively deliver both value and convenience allows us to succeed in small markets with limited shopping alternatives, as well as in larger and more competitive markets. Our value and convenience proposition is evidenced by the following attributes of our business model:\n​\n●\nEveryday Low Prices on Quality Merchandise.  \nOur research indicates that we offer a price advantage over most food and drug retailers and that our prices are competitive with even the \n5\n\n\nTable of Contents\nlargest discount retailers. Our ability to offer everyday low prices on quality merchandise is supported by our low-cost operating approach and our strategy to maintain a limited number of items per merchandise category, which we believe helps us maintain strong purchasing power. We offer nationally advertised brands at these everyday low prices in addition to offering our own private brands, often at substantially lower prices.\n​\n●\nConvenient Locations.  \nOur stores are conveniently located in a variety of rural, suburban and urban communities. We seek to locate our stores in close proximity to our customers, which helps drive customer loyalty and trip frequency and makes us an attractive alternative to large discount and other large-box retail and grocery stores.\n​\n●\nTime-Saving Shopping Experience.  \nWe strive to provide customers with a highly convenient, easy to navigate shopping experience. Our small-box stores are designed to make it easier to get in and out quickly, and our digital tools and offerings help drive even greater convenience and additional access points. Our product offering includes most necessities, such as basic packaged and refrigerated or frozen food products, dairy products, cleaning supplies, paper products, health and beauty care items, greeting cards and other stationery items, basic apparel, housewares, hardware and automotive supplies, among others. Our convenient hours and broad merchandise offering allow our customers to fulfill their requirements for basic goods and minimize their need to shop elsewhere.\n​\nSubstantial Growth Opportunities.\n  We believe we have substantial long-term growth potential in the U.S., and we have identified significant opportunities to add new Dollar General stores in both existing and new markets. In addition, we have opportunities to relocate, remodel or convert locations within our existing store base to better serve our customers. Our attractive store economics, including a relatively low initial investment and simple, low-cost operating approach, and our variety of store formats have allowed us to grow our store base to current levels and provide us significant opportunities to continue our profitable store growth strategy. We recently made the decision to close 45 pOpshelf stores, our unique small-box retail concept that focuses primarily on non-consumables, and to convert an additional six pOpshelf stores to Dollar General stores, and we have paused expansion of this concept while we evaluate and evolve its go-forward strategy and performance. We have also identified international expansion, with an initial focus on Mexico, as an opportunity for growth. We opened our first Mi Súper Dollar General stores in Mexico in 2023 and believe there is additional growth potential in Mexico in the years ahead. \n​\nOur Merchandise\n​\nWe offer a focused assortment of everyday necessities, which we believe helps to drive frequent customer visits, and key items in a broad range of general merchandise categories. Our product assortment provides the opportunity for our customers to address most of their basic shopping needs with one trip. We offer a wide selection of nationally advertised brands from leading manufacturers. Additionally, our private brand products offer even greater value with options to purchase both products that are of comparable quality to national brands as well as opening price point items, each often at substantial discounts to the national brands.\n​\nConsumables is our largest merchandise category and includes paper and cleaning products (such as paper towels, bath tissue, paper dinnerware, trash and storage bags, disinfectants, and laundry); packaged food (such as cereals, pasta, canned soups, canned meats, fruits and vegetables, condiments, spices, sugar and flour); perishables (such as milk, eggs, bread, refrigerated and frozen food, beer, wine and produce); snacks (such as candy, cookies, crackers, salty snacks and carbonated beverages); health and beauty (such as over-the-counter medicines and personal care products including soap, body wash, shampoo, cosmetics, dental hygiene and foot care products); pet (such as pet supplies and pet food); and tobacco products.\n​\nSeasonal products include holiday items, toys, batteries, small electronics, greeting cards, stationery, prepaid phones and accessories, gardening supplies, hardware, automotive and home office supplies.\n​\n6\n\n\nTable of Contents\nHome products include kitchen supplies, cookware, small appliances, light bulbs, storage containers, frames, candles, craft supplies and kitchen, bed and bath soft goods.\n​\nApparel includes basic items for infants, toddlers, girls, boys, women and men, as well as socks, underwear, disposable diapers, shoes and accessories.\n​\nThe percentage of net sales of each of our four categories of merchandise for the fiscal years indicated below was as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n2022\n \nConsumables\n \n 82.2\n%  \n 81.0\n%  \n 79.7\n%\nSeasonal\n \n 10.0\n%  \n 10.6\n%  \n 11.0\n%\nHome products\n \n 5.1\n%  \n 5.6\n%  \n 6.2\n%\nApparel\n \n 2.7\n%  \n 2.8\n%  \n 3.1\n%\n​\nOur seasonal and home products categories typically account for the highest gross profit margins, and the consumables category typically accounts for the lowest gross profit margin.\n​\nThe Dollar General Store\n​\nThe typical Dollar General store staff includes a store manager, one or more assistant store managers, and three or more sales associates. Our stores generally feature a low-cost, no frills building with limited capital requirements, a low operating cost approach, and a focused merchandise offering within a broad range of categories, allowing us to deliver competitive retail prices while generating strong cash flows and capital investment returns. Our stores currently average approximately 7,500 square feet of selling space, and approximately 80% of our stores are located in towns of 20,000 or fewer people. Our primary new store format currently averages selling space of approximately 8,500 square feet. We generally have had good success in locating suitable store sites in the past, and we believe that there is ample opportunity for new store growth in existing and new markets. In addition, we believe we have significant opportunities available for our relocation and remodel programs.\n​\nOur store growth over the past three years is summarized in the following table:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nStores at\n    \n​\n    \n​\n    \nNet\n    \n​\n \n​\n​\nBeginning\n​\nStores\n​\nStores\n​\nStore\n​\nStores at\n \nYear\n​\nof Year\n​\nOpened\n​\nClosed\n​\nIncrease\n​\nEnd of Year\n \n2022\n \n 18,130\n \n 1,039\n \n 65\n \n 974\n \n 19,104\n​\n2023\n \n 19,104\n \n 987\n \n 105\n \n 882\n \n 19,986\n​\n2024\n \n 19,986\n \n 725\n \n 117\n \n 608\n \n 20,594\n​\n​\nOur Customers\n​\nOur customers seek value and convenience. Depending on their financial situation and geographic proximity, customers’ reliance on Dollar General varies from fill-in shopping, to making periodic trips to stock up on household items, to making weekly or more frequent trips to meet most essential needs. We generally locate our stores and plan our merchandise selections to best serve the needs of our core customers, the low and fixed income households often underserved by other retailers (including grocers), and we are focused on helping them make the most of their spending dollars. At the same time, however, Dollar General shoppers from a wide range of income brackets and life stages appreciate our quality merchandise as well as our attractive value and convenience proposition.\n​\nOur Suppliers\n​\nWe purchase merchandise from a wide variety of suppliers and maintain direct buying relationships with many producers of national brand merchandise. Despite our broad offering, we maintain a relatively limited number of items per category, which supports our low average cost. Our two largest suppliers accounted for approximately \n7\n\n\nTable of Contents\n11% and 8%, respectively, of our purchases in 2024. Our private brands come from a wide variety of suppliers. We directly imported approximately 4% of our purchases at cost in 2024. \n​\nDistribution and Transportation\n​\nOur stores are currently supported by distribution centers for frozen, refrigerated and non-refrigerated merchandise located strategically throughout our geographic footprint. In addition to our traditional distribution centers, we operate multiple temperature-controlled distribution facilities in support of our self-distribution of frozen and refrigerated goods, such as dairy, deli and frozen products. We lease additional temporary warehouse space as necessary to support our distribution needs. We regularly analyze and rebalance the distribution network with a goal of ensuring that it remains efficient and provides the service levels our stores require. See “—Properties” below for additional information pertaining to our distribution centers.\n​\nMost of our merchandise flows through our distribution centers and is delivered to our stores by our private fleet and by third-party trucking firms, utilizing our trailers. In addition, vendors or third-party distributors deliver or ship certain food items and other merchandise directly to our stores.\n​\nSeasonality\n​\nThe nature of our business is somewhat seasonal. Generally, our operating profit is greater in the fourth quarter, which includes the Christmas selling season, as compared with operating profit in each of the first three quarters of our fiscal year. In addition, our quarterly results can be affected by the timing of certain holidays, new store openings, remodels, relocations, store closings, and weather patterns. See “Item 7. Management’s Discussion & Analysis of Financial Condition and Results of Operation” for further discussion of seasonality.\n​\nOur Competition\n​\nWe operate in the basic discount consumer goods market, which is highly competitive with respect to price, customers, store location, merchandise quality, assortment and presentation, service offerings, in-stock consistency, customer service, promotional activity, employees, and market share. We compete with discount stores and many other retailers, including mass merchandise, warehouse club, grocery, drug, convenience, variety, online, and certain specialty stores. These other retail companies operate stores in many of the areas where we operate, and many of them engage in extensive advertising and marketing efforts. Our direct competitors include Family Dollar, Dollar Tree, and various local, independent operators, as well as Walmart, Target, Kroger, Aldi, Costco, Sams Club, BJ’s Wholesale Club, Walgreens, CVS, and Rite Aid, among others. Certain of our competitors have greater financial, distribution, marketing and other resources than we do and may be able to secure better arrangements from suppliers than we can. Competition is intense and we believe it will continue to be so, with certain competitors reducing their store locations while others move into or increase their presence in our geographic and product markets and increase the availability of mobile, web-based and other digital technology to facilitate a more convenient and competitive online and in-store customer shopping experience.\n​\nWe believe that we differentiate ourselves from other forms of retailing by offering competitive prices in a convenient, small-store format. We are able to maintain competitive prices due in part to our low-cost operating approach and the relatively limited assortment of products offered. Purchasing large volumes of merchandise within our focused assortment in each merchandise category allows us to keep our average product costs low, contributing to our ability to offer competitive everyday prices to our customers. See “Item 1A. Risk Factors” for further discussion of our competitive situation.\n​\nOur Intellectual Property\n​\nWe own marks that are registered with the United States Patent and Trademark Office and are protected under applicable intellectual property laws, including, without limitation, Dollar General®, DG®, Clover Valley®, trueliving®, pOpshelf®, and Mi Super Dollar General® along with variations and formatives of these trademarks. We attempt to obtain registration of our trademarks whenever practicable and to pursue vigorously any infringement of those marks. Our trademark registrations have various expiration dates; however, assuming that the trademark \n8\n\n\nTable of Contents\nregistrations are properly renewed, they have a perpetual duration. We also hold an exclusive license to the Rexall brand through at least March 5, 2032.\n​\nHuman Capital Resources\n​\nAt Dollar General, a foundational element in how we operate is exemplified in our fourth operating priority – Investing in the growth and development of our teams.  Building on our core value of respecting the dignity and differences of others, our goal is to create a work environment where each employee is encouraged and empowered to bring their unique perspective and voice to work each day. Based on a talent philosophy of “Attract, Develop, and Retain”, whether an individual works in a store, a distribution center, our store support center or our international offices, over the last 85+ years, we have helped millions of individuals start and progress in their careers, providing employees with numerous opportunities to gain new skills and develop their talents, supported by our award-winning training and development programs. \n​\nAttract\n​\nWe seek to provide market competitive compensation and benefits packages that attract talent to the organization and then retain and incent employees for performance. Although eligibility for and the level of benefits vary depending on the employee’s full-time or part-time status, compensation level, date of hire, and/or length of service, the broad range of benefits we provide or make available may include: medical, prescription, telemedicine, dental and vision plans; flexible spending accounts; disability insurance; 401(k) plan; paid vacation; employee assistance programs with access to legal assistance and counseling; healthy lifestyle and disease management programs; education assistance benefits; parental leave; adoption assistance; service award recognition; and a broad range of discounts for other products and services. To help measure the success of our overall employee compensation and benefits programs, we monitor employee applicant flow and staffing levels across the organization, as well as employee turnover, particularly at the store manager level. In addition, we conduct regular employee surveys to assess engagement and identify opportunities for improvement.\n​\nDevelop\n​\nAs a testament to our employee development efforts, we were inducted into Training magazine’s Hall of Fame, following two consecutive years as the magazine’s top training and development program and rounding out 10 consecutive years among its Top 100 list. In 2024, we estimate we invested over four million training hours in our employees to promote their education and development. \n​\nWe enhance our development programs each year based on the current needs of our employees and the business. We offer a variety of differentiated programs, including mentorship, cohorts, and leader-led and experiential opportunities to ensure there is a path of development for all employees.\n​\nOur internal placement rate helps us measure the success of our development programs. As of February 28, 2025, we employed approximately 194,200 full-time and part-time employees, including divisional and regional managers, district managers, store managers, other store employees, and distribution center, fleet and administrative employees. As of the end of 2024, more than 70% of store managers and thousands of additional employees, including the majority of our senior leadership, have been placed from within our organization.\n​\nRetain\n​\nWe strive to create an environment where our employees feel respected, safe, empowered, and valued. We regularly monitor retention and engagement levels across the organization through a variety of means, working to understand what is important to our employees and how we can best continue to meet their evolving needs.  \n​\nCompliance with Governmental Regulations\n​\nOur operations are subject to the applicable federal, state, local and foreign laws, rules, and regulations of the jurisdictions in which we operate or conduct business. These laws, rules and regulations relate to, among other \n9\n\n\nTable of Contents\nthings, the sale of products, including without limitation, product and food safety, marketing and labeling; information security and privacy; labor and employment; employee wages and benefits; health and safety; real property; public accommodations; anti-bribery; financial reporting and disclosure, including disclosures related to environmental, social and governance matters; pricing; antitrust and fair competition; anti-money laundering; distribution; transportation; imports and customs; intellectual property; taxes; and environmental compliance.\n​\nWe routinely incur significant compliance-related costs, both direct and indirect, including those related to store standards and labor. Although we may incur additional material compliance-related costs in the future, to date, other than the expenses referenced above, compliance with these laws, rules and regulations has not had a material effect on our capital expenditures, earnings or competitive position. Many of our entry-level store employees are paid at rates in line with the applicable state minimum wage, and consequently, in certain situations, increases to such wage rates have increased our labor costs. If federal, state and/or local minimum wage rates/salary levels were to further increase significantly and/or rapidly, compliance with such increases could adversely affect our earnings. Additionally, if significant changes in the federal, state or foreign corporate tax rates occur in the future, such change could adversely affect our overall effective tax rate and earnings. See “Item 1A. Risk Factors” for additional information regarding government regulations that could impact our business. \n​\nAvailable Information\n​\nOur Internet website address is www.dollargeneral.com. The information on our website is not incorporated by reference into, and is not a part of, this Form 10-K. We file with or furnish to the Securities and Exchange Commission (the “SEC”) annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports, as well as proxy statements and annual reports to shareholders, and, from time to time, registration statements and other documents pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). These documents are available free of charge to investors on or through the Investor Information section of our website (https://investor.dollargeneral.com) as soon as reasonably practicable after we electronically file them with or furnish them to the SEC. The SEC also maintains an internet site that contains reports, proxy and information statements and other information regarding issuers, such as Dollar General, that file electronically with the SEC. The address of that website is http://www.sec.gov.\n​\n10\n\n\nTable of Contents",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND\n RESULTS OF OPERATIONS\n​\nThis discussion and analysis should be read with, and is qualified in its entirety by, the Consolidated Financial Statements and the notes thereto. It also should be read in conjunction with the Cautionary Disclosure Regarding Forward-Looking Statements and the Risk Factors disclosures set forth in the Introduction and in Item 1A of this report, respectively.\n​\nExecutive Overview\n​\nWe are the largest discount retailer in the United States by number of stores, with 20,662 stores located in 48 U.S. states and Mexico as of February 28, 2025, with the greatest concentration of stores in the southern, southwestern, midwestern and eastern United States. Our first stores in Mexico opened in 2023. We offer a broad selection of merchandise, including consumable products such as food, paper and cleaning products, health and beauty products and pet supplies, and non-consumable products such as seasonal merchandise, home decor and domestics, and basic apparel. Our merchandise includes national brands from leading manufacturers, as well as our own private brand selections with prices often at substantial discounts to national brands. We offer our customers these national brand and private brand products at everyday low prices (typically $10 or less) in our convenient small-box locations. \n​\nWe believe our convenient store formats, locations, and broad selection of high-quality products at compelling values have driven our substantial growth and financial success over the years and through a variety of economic cycles. We are mindful that the majority of our customers are value-conscious, and many have low and/or fixed incomes. As a result, we are intensely focused on helping our customers make the most of their spending dollars. The primary macroeconomic factors that affect our core customers include unemployment and underemployment rates, inflation, wage growth, changes in U.S. and global trade policy, and changes in U.S. government policy and assistance programs (including cost of living adjustments), such as SNAP, unemployment benefits, and economic stimulus programs. Finally, significant unseasonable or unusual weather patterns or extreme weather can impact customer shopping behaviors.\n​\nOur core customers are often among the first to be affected by negative or uncertain economic conditions and among the last to feel the effects of improving economic conditions, particularly when trends are inconsistent and of an uncertain duration. Our customers continue to feel constrained in the current macroeconomic environment and to experience elevated expenses that generally comprise a large portion of their household budgets, such as rent, healthcare, energy and fuel prices, as well as cost inflation in frequently purchased household products (including food), which we expect will continue to pressure our customers’ spending overall and particularly in our non-consumables categories. This pressure contributed to a heavier promotional environment in the second half of 2024 compared to the prior year, and we expect a promotional environment in 2025 similar to that in 2024.\n​\nWe remain committed to our long-term operating priorities as we consistently strive to improve our performance while retaining our customer-centric focus. These priorities include: 1) driving profitable sales growth, 2) capturing growth opportunities, 3) enhancing our position as a low-cost operator, and 4) investing in the growth and development of our teams. \n​\nWe seek to drive profitable sales growth through initiatives aimed at increasing customer traffic and average transaction amount. Historically, sales in our consumables category, which tend to have lower gross margins, have been the key drivers of net sales and customer traffic, while sales in our non-consumables categories, which tend to have higher gross margins, have been the key drivers of more profitable sales growth and average transaction amount. Our sales mix has continued to shift toward consumables, which currently constitutes a historically high proportion of our sales mix. Certain of our initiatives are intended to address this sales mix trend; however, there can be no assurances that these efforts will be successful.\n​\nAs we work to provide everyday low prices and meet our customers’ affordability needs, we remain focused on enhancing our margins through inventory shrink and damage reduction initiatives, as well as pricing and markdown optimization, effective category management and inventory reduction efforts, distribution and \n28\n\n\nTable of Contents\ntransportation efficiencies, private brands penetration and global sourcing. Several of our strategic and other sales-driving initiatives are also designed to capture growth opportunities and are discussed in more detail below.\n​\nThroughout 2024, we continued to experience significant levels of inventory shrink and damages. While we anticipate that both shrink and damages will remain elevated in 2025, particularly when compared to fiscal years immediately preceding fiscal year 2023, we continue to take actions designed to reduce their impact and believe we will make progress in reducing our shrink and damages levels in 2025.\n​\nWe continue to implement and invest in certain strategic initiatives that we believe will help drive profitable sales growth with both new and existing customers and capture long-term growth opportunities. Such opportunities include providing our customers with a variety of shopping access points and even greater value and convenience by leveraging and developing digital tools and technology, such as our Dollar General app, which contains a variety of tools to enhance the in-store shopping experience. We remain focused on enhancing both the in-store and digital shopping experience, while driving operational efficiency. Our partnership with a third-party delivery service is available in the majority of our stores, providing added convenience and incremental sales. Additionally, in September 2024, we partnered with the same third-party provider to fully execute a same-day home delivery offering through our DG app and website in a limited number of stores. We believe we can significantly expand this offering to additional stores in 2025. Furthermore, we believe these efforts will contribute to the continued to growth of our DG Media Network, our platform that connects brand partners with our customers. \n​\nIn 2025, we are expanding our efforts to improve the performance and profitability of our mature stores through the rollout of an incremental remodel program, Project Elevate. This partial-remodel initiative is designed to refresh and optimize the merchandising in our stores, and in turn, enhance the shopping experience for our customers, while also mitigating future repairs and maintenance expense. Project Elevate remodels are incremental to our full-remodel program, Project Renovate.\n​\nWe also remain focused on capturing growth opportunities. In 2024, we opened a total of 725 new stores, including five stores in Mexico, remodeled 1,621 stores, and relocated 85 stores. In 2025, we plan to open approximately 575 new stores (as well as up to 15 stores in Mexico), fully remodel approximately 2,000 stores through Project Renovate, partially remodel 2,250 stores through Project Elevate, and relocate approximately 45 stores, for a total of 4,885 real estate projects.\n​\nDuring the fourth quarter of 2024, we initiated a store portfolio optimization review of our Dollar General and pOpshelf bannered stores, which involved identifying stores for closure or re-bannering based on an evaluation of individual store performance, expected future performance, and operating conditions, among other factors. As a result of this review, we plan to close 96 Dollar General stores and 45 pOpshelf stores, and convert an additional six pOpshelf stores to Dollar General stores in the first quarter of 2025. See Note 12 to the consolidated financial statements for more detail on the store portfolio optimization, impairment and related charges.\n​\npOpshelf is a unique retail concept focused on categories such as seasonal and home décor, health and beauty, home cleaning supplies, and party and entertainment goods. In light of the softer discretionary sales environment, we previously converted certain pOpshelf stores to Dollar General stores, and do not believe opening new stores in 2025 is a prudent use of capital. At the end of 2024, we operated 231 standalone pOpshelf stores. Following the completion of the pOpshelf store closures and conversions discussed above, we will operate 180 pOpshelf stores. In addition, we recorded a significant impairment expense to reflect the updated fair value of pOpshelf assets. We are taking focused action in 2025 to improve the performance of pOpshelf stores, and will continue to evaluate the brand and whether we are seeing the desired impact of these activities and optimization, although there can be no assurances that our efforts will be successful.\n​\nWe expect store format innovation to allow us to capture additional growth opportunities as we continue to utilize the most productive of our various Dollar General store formats based on the specific market opportunity. In 2025 we expect the significant majority of the stores to be predominantly in one of our 8,500 square foot formats. This format allows for expanded high-capacity-cooler counts, an extended queue line, and a broader product assortment, including an enhanced non-consumable offering, a larger health and beauty section, and produce in select stores.\n29\n\n\nTable of Contents\n​\nWe are always seeking ways to reduce or control costs that do not affect our customers’ shopping experiences. We plan to continue enhancing this position over time while employing ongoing cost discipline to reduce certain expenses as a percentage of sales. Nonetheless, we seek to maintain flexibility to invest in the business as necessary to enhance our long-term competitiveness and profitability. From time to time, our strategic initiatives, including without limitation those discussed above, have required and may continue to require us to incur upfront expenses for which there may not be an immediate return in terms of sales or enhanced profitability.\n​\nCertain of our operating expenses, such as wage rates, occupancy costs and depreciation and amortization, have continued to increase in recent years, due primarily to market forces such as labor availability, increases in minimum wage rates, inflation and increases in property rents and interest rates. Significant or rapid increases to federal, state or local minimum wage rates or salary levels could significantly adversely affect our earnings if we are not able to otherwise offset these increased labor costs elsewhere in our business.\n​\nWhile the overall growth rate of inflation moderated over the second half of 2024, we believe ongoing inflationary pressures could continue to affect our operating results and our vendors and customers. Moreover, increases in market interest rates have had a negative impact on our interest expense. Both inflation and higher interest rates have significantly increased new store opening costs and occupancy costs, and while we continue to have strong new store returns and plan to grow our store base significantly in 2025, these increased costs have negatively impacted our projected new store returns and influenced our new store growth plans.\n​\nOur teams are a competitive advantage, and we proactively seek ways to continue investing in their development. Our goal is to create an environment that attracts, develops, and retains talented personnel, particularly at the store manager level, as employees who are promoted from within our company generally have longer tenures and are greater contributors to improvements in our financial performance. We are taking actions designed to reduce our higher than targeted store manager turnover, including through budgeting and allocation of labor hours, simplifying in-store activities, and reducing excess inventory.\n​\nTo further enhance shareholder returns, we pay a quarterly cash dividend. The declaration and amount of future dividends are subject to Board discretion and approval, although we currently expect to continue paying quarterly cash dividends. As planned, to preserve our investment grade credit rating and maintain financial flexibility, we did not repurchase any shares during 2024 under our share repurchase program and do not plan to repurchase shares during 2025. \n​\nWe utilize key performance indicators, which are defined below, in the management of our business including same-store sales, average sales per square foot, and inventory turnover. We use these measures to maximize profitability and for decisions about the allocation of resources. Each of these measures is commonly used by investors in retail companies to measure the health of the business. \n​\nSame-store sales.\n Same-store sales are calculated based upon our stores that were open at least 13 full fiscal months and remain open at the end of the reporting period. We include stores that have been remodeled, expanded or relocated in our same-store sales calculation. Changes in same-store sales are calculated based on the comparable 52 calendar weeks in the current and prior years. The method of calculating same-store sales varies across the retail industry. As a result, our calculation of same-store sales is not necessarily comparable to similarly titled measures reported by other companies. \n​\nAverage sales per square foot.\n  Average sales per square foot is calculated based on total sales for the preceding 12 months as of the ending date of the reporting period divided by the average selling square footage during the period, including the end of the fiscal year, the beginning of the fiscal year, and the end of each of our three interim fiscal quarters. \n​\nInventory turnover\n.\n  Inventory turnover is calculated based on total cost of goods sold for the preceding four quarters divided by the average inventory balance as of the ending date of the reporting period, including the end of the fiscal year, the beginning of the fiscal year, and the end of each of our three interim fiscal quarters. \n30\n\n\nTable of Contents\n​\nA continued focus on our four operating priorities as discussed above, and other impacts as discussed below, resulted in the following overall operating and financial performance in 2024 as compared to 2023. Basis points, as referred to below, are equal to 0.01% as a percentage of net sales.\n​\n●\nNet sales in 2024 increased 5.0%. Sales in same-stores increased 1.4%, primarily due to an increase in customer traffic. Average sales per square foot in 2024 and 2023 were $263 and $264, respectively\n.\n​\n●\nThe gross profit rate decreased by 70 basis points due primarily to increased inventory markdowns, a greater proportion of sales coming from the consumables category and increased inventory damages. \n​\n●\nSG&A as a percentage of sales increased by 140 basis points primarily \ndue to impairment charges totaling $214.2 million related to the store portfolio optimization review and increases in retail labor, depreciation and amortization and store occupancy costs.\n​\n●\nOperating profit decreased 29.9% to $1.71 billion in 2024 compared to $2.45 billion in 2023.\n​\n●\nInterest expense, net decreased by $52.5 million in 2024 primarily due to higher average cash balances and the repayment of long-term debt. \n​\n●\nThe change in the effective income tax rate to 21.8% in 2024 from 21.6% in 2023 was primarily due to a higher state effective tax rate and a decreased benefit from stock-based compensation partially offset by the effect of certain rate-impacting items on lower earnings before taxes compared to 2023.\n​\n●\nWe reported net income of $1.13 billion, or $5.11 per diluted share, for 2024 compared to net income of $1.66 billion, or $7.55 per diluted share, for 2023. \n​\n●\nWe generated approximately $2.996 billion of cash flows from operating activities in 2024, an increase of 25.3% compared to 2023. \n​\n●\nInventory turnover was 4.1 times, and inventories decreased 6.9% on a per store basis compared to 2023.\n​\nReaders should refer to the detailed discussion of our operating results below for additional comments on financial performance in the current year as compared with the prior years presented.\n​\nResults of Operations\n​\nAccounting Periods. \nThe following text contains references to years 2024, 2023, and 2022, which represent fiscal years ended January 31, 2025, February 2, 2024, and February 3, 2023, respectively. Our fiscal year ends on the Friday closest to January 31. Fiscal years 2024 and 2023 were 52-week accounting periods and fiscal year 2022 was a 53-week accounting period.\n​\nSeasonality\n. The nature of our business is somewhat seasonal. Primarily because of sales of Christmas-related merchandise, operating profit in our fourth quarter (November, December and January) has historically been higher than operating profit achieved in each of the first three quarters of the fiscal year. However, more recently, and in particular fiscal years 2023 and 2024, this has not been the case. Expenses, and to a greater extent operating profit, vary by quarter. Results of a period shorter than a full year may not be indicative of results expected for the entire year. Furthermore, the seasonal nature of our business may affect comparisons between periods.\n​\n31\n\n\nTable of Contents\nThe following table contains results of operations data for fiscal years 2024, 2023, and 2022, and the dollar and percentage variances among those years.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024 vs. 2023\n \n2023 vs. 2022\n​\n(amounts in millions, except\n​\n  \n​\n​\n  \n​\n​\n  \n​\n​\n  \nAmount\n  \n%\n  \nAmount\n  \n%\n​\nper share amounts)\n​\n​\n2024\n​\n2023\n​\n2022\n​\nChange\n​\nChange\n \nChange\n​\nChange\n​\nNet sales by category:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nConsumables\n​\n​\n$\n 33,370.9\n​\n$\n 31,342.6\n​\n$\n 30,155.2\n​\n$\n 2,028.3\n​\n 6.5\n%  \n$\n 1,187.4\n​\n 3.9\n% \n% of net sales\n​\n​\n \n 82.17\n%  \n \n 81.01\n%  \n \n 79.68\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nSeasonal\n​\n​\n \n 4,073.3\n​\n \n 4,083.8\n​\n \n 4,182.8\n​\n \n (10.5)\n​\n (0.3)\n​\n \n (99.0)\n​\n (2.4)\n​\n% of net sales\n​\n​\n \n 10.03\n%  \n \n 10.55\n%  \n \n 11.05\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nHome products\n​\n​\n \n 2,074.4\n​\n \n 2,163.8\n​\n \n 2,332.4\n​\n \n (89.4)\n​\n (4.1)\n​\n \n (168.6)\n​\n (7.2)\n​\n% of net sales\n​\n​\n \n 5.11\n%  \n \n 5.59\n%  \n \n 6.16\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nApparel\n​\n​\n \n 1,093.7\n​\n \n 1,101.4\n​\n \n 1,174.4\n​\n \n (7.7)\n​\n (0.7)\n​\n \n (73.0)\n​\n (6.2)\n​\n% of net sales\n​\n​\n \n 2.69\n%  \n \n 2.85\n%  \n \n 3.10\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nNet sales\n​\n​\n$\n 40,612.3\n​\n$\n 38,691.6\n​\n$\n 37,844.9\n​\n$\n 1,920.7\n​\n 5.0\n%  \n$\n 846.7\n​\n 2.2\n% \nCost of goods sold\n​\n​\n \n 28,594.8\n​\n \n 26,972.6\n​\n \n 26,024.8\n​\n \n 1,622.2\n​\n 6.0\n​\n \n 947.8\n​\n 3.6\n​\n% of net sales\n​\n​\n \n 70.41\n%  \n \n 69.71\n%  \n \n 68.77\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nGross profit\n​\n​\n \n 12,017.5\n​\n \n 11,719.0\n​\n \n 11,820.1\n​\n \n 298.5\n​\n 2.5\n​\n \n (101.1)\n​\n (0.9)\n​\n% of net sales\n​\n​\n \n 29.59\n%  \n \n 30.29\n%  \n \n 31.23\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nSelling, general and administrative expenses\n​\n​\n \n 10,303.4\n​\n \n 9,272.7\n​\n \n 8,491.8\n​\n \n 1,030.7\n​\n 11.1\n​\n \n 780.9\n​\n 9.2\n​\n% of net sales\n​\n​\n \n 25.37\n%  \n \n 23.97\n%  \n \n 22.44\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nOperating profit\n​\n​\n \n 1,714.1\n​\n \n 2,446.3\n​\n \n 3,328.3\n​\n \n (732.2)\n​\n (29.9)\n​\n \n (882.0)\n​\n (26.5)\n​\n% of net sales\n​\n​\n \n 4.22\n%  \n \n 6.32\n%  \n \n 8.79\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nInterest expense, net\n​\n​\n \n 274.3\n​\n \n 326.8\n​\n \n 211.3\n​\n \n (52.5)\n​\n (16.1)\n​\n \n 115.5\n​\n 54.7\n​\n% of net sales\n​\n​\n \n 0.68\n%  \n \n 0.84\n%  \n \n 0.56\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nOther (income) expense\n​\n​\n \n —\n​\n \n —\n​\n \n 0.4\n​\n \n —\n​\n —\n​\n \n (0.4)\n​\n —\n​\n% of net sales\n​\n​\n \n 0.00\n%  \n \n 0.00\n%  \n \n 0.00\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nIncome before income taxes\n​\n​\n \n 1,439.8\n​\n \n 2,119.5\n​\n \n 3,116.6\n​\n \n (679.8)\n​\n (32.1)\n​\n \n (997.1)\n​\n (32.0)\n​\n% of net sales\n​\n​\n \n 3.55\n%  \n \n 5.48\n%  \n \n 8.24\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nIncome tax expense\n​\n​\n \n 314.5\n​\n \n 458.2\n​\n \n 700.6\n​\n \n (143.7)\n​\n (31.4)\n​\n \n (242.4)\n​\n (34.6)\n​\n% of net sales\n​\n​\n \n 0.77\n%  \n \n 1.18\n%  \n \n 1.85\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nNet income\n​\n​\n$\n 1,125.3\n​\n$\n 1,661.3\n​\n$\n 2,416.0\n​\n$\n (536.0)\n​\n (32.3)\n%  \n$\n (754.7)\n​\n (31.2)\n% \n% of net sales\n​\n​\n \n 2.77\n%  \n \n 4.29\n%  \n \n 6.38\n%  \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\nDiluted earnings per share\n​\n​\n$\n 5.11\n​\n$\n 7.55\n​\n$\n 10.68\n​\n$\n (2.44)\n​\n (32.3)\n%  \n$\n (3.13)\n​\n (29.3)\n% \n​\nNet Sales\n. The net sales increase in 2024 was primarily due to sales from new stores and an increase in same-store sales of 1.4% compared to 2023, partially offset by the impact of store closures. The increase in same-store sales reflects a 1.1% increase in customer traffic and a 0.3% increase in average transaction amount. The increase in average transaction amount was driven by higher average item retail prices and an increase in items per transaction. Same-store sales increased in the consumables category and declined in the home products, seasonal and apparel categories. In 2024, our 19,633 same-stores accounted for sales of $38.8 billion.\n​\nThe net sales increase in 2023 was primarily due to sales from new stores and an increase in same-store sales of 0.2% compared to 2022, partially offset by the impact of store closures. Net sales for the 53rd week of fiscal 2022 were $678.1 million. The increase in same-store sales reflects an increase in customer traffic, partially offset by a decrease in the average transaction amount. The decrease in average transaction amount was driven by a decline in items per transaction, partially offset by higher average item retail prices. Same-store sales increased in the consumables category, and declined in the home products, seasonal and apparel categories. In 2023, our 18,763 same-stores accounted for sales of $36.9 billion.\n​\nGross Profit. \nIn 2024, gross profit increased by 2.5%, and as a percentage of net sales decreased by 70 basis points to 29.6% compared to 2023, primarily driven by increased markdowns, a greater proportion of sales coming from the consumables category and increased inventory damages, partially offset by decreased transportation costs. \n​\nIn 2023, gross profit decreased by 0.9%, and as a percentage of net sales decreased by 94 basis points to \n32\n\n\nTable of Contents\n30.3% compared to 2022, primarily driven by increased shrink and inventory markdowns, lower inventory markups, a higher proportion of lower margin consumables sales, and increased damages. Partially offsetting the factors which decreased our overall gross profit rate were a lower LIFO provision and decreased transportation costs.\n​\nSG&A. \nSG&A as a percentage of net sales was 25.4% in 2024 compared to 24.0% in 2023, an increase of 140 basis points. The increase reflects fourth quarter impairment charges totaling $214.2 million related to the store portfolio optimization review as discussed above in the Executive Summary and Note 12 to the consolidated financial statements. Other expenses that were higher as a percentage of net sales in 2024 were retail labor, depreciation and amortization, store occupancy costs and incentive compensation. \n​\nSG&A as a percentage of net sales was 24.0% in 2023 compared to 22.4% in 2022, an increase of 153 basis points. The primary expenses that were higher as a percentage of net sales in 2023 were retail labor, store occupancy costs, depreciation and amortization, repairs and maintenance, and other services purchased, including debt and credit card transaction fees, which were partially offset by a decrease in incentive compensation.\n​\nInterest Expense, net\n. Interest expense, net decreased $52.5 million to $274.3 million in 2024 compared to 2023 due to higher average cash balances and the repayment of long-term debt. Interest expense, net increased $115.5 million to $326.8 million in 2023 compared to 2022, primarily due to higher outstanding borrowings and higher interest rates. See the detailed discussion under “Liquidity and Capital Resources” regarding the financing of various long-term obligations.\n​\nIncome Taxes\n. The effective income tax rate for 2024 was 21.8% compared to a rate of 21.6% for 2023 which represents a net increase of 0.2 percentage points. The effective tax rate was higher in 2024 primarily due to a higher state effective tax rate and a decreased benefit from stock-based compensation partially offset by the effect of certain rate-impacting items on lower earnings before taxes.\n​\nThe effective income tax rate for 2023 was 21.6% compared to a rate of 22.5% for 2022 which represents a net decrease of 0.9 percentage points. The effective tax rate was lower in 2023 primarily due to the effect of certain rate-impacting items (such as federal tax credits) on lower earnings before taxes and a lower state effective rate resulting from increased recognition of state tax credits.\n​\nEffects of Inflation\n​\nIn 2024 and 2023, we experienced moderate increases in product costs due to lower rates of inflation. In addition, we continued to experience elevated but relatively stable costs of building materials and certain of our other capital costs. In 2022, we experienced higher rates of inflation affecting product costs, the costs of building materials and certain of our other capital costs. \n​\nLiquidity and Capital Resources\n​\nCurrent Financial Condition and Recent Developments\n​\nDuring the past three years, we have generated an aggregate of approximately $7.4 billion in cash flows from operating activities and incurred approximately $4.6 billion in capital expenditures. During that period, we expanded the number of stores we operate by 2,464, representing store growth of approximately 14%, and we remodeled or relocated 5,764 stores, or approximately 32% of the stores we operated as of the beginning of the three-year period. In 2025, we intend to pursue accelerated growth in remodels, including Project Elevate, with slower growth for new stores and fewer relocations.\n​\nAt January 31, 2025, we had a $2.375 billion unsecured revolving credit agreement (the “Revolving Facility”), $6.2 billion aggregate principal amount of senior notes, and a commercial paper program that may provide borrowing availability of up to $2.0 billion. At January 31, 2025, we had total consolidated outstanding debt (including the current portion of long-term obligations) of $6.2 billion, most of which was in the form of senior notes. All of our material borrowing arrangements are described in greater detail below. Our borrowing availability under the Revolving Facility may be effectively limited by our commercial paper notes (“CP Notes”) as further \n33\n\n\nTable of Contents\ndescribed below. The information contained in Note 5 to the consolidated financial statements contained in Part II, Item 8 of this report is incorporated herein by reference. \n​\nWe believe our cash flow from operations, and our existing cash balances, combined with availability under the Revolving Facility, CP Notes and access to the debt markets, will provide sufficient liquidity to fund our current obligations, projected working capital requirements, capital spending and anticipated dividend payments for a period that includes the next twelve months as well as the next several years. However, our ability to maintain sufficient liquidity may be affected by numerous factors, many of which are outside of our control. Depending on our liquidity levels, conditions in the capital markets and other factors, we may from time to time consider the issuance of debt, equity or other securities, the proceeds of which could provide additional liquidity for our operations.\n​\nFor fiscal 2025, we anticipate potential combined borrowings under the Revolving Facility and CP Notes to be a maximum of approximately $400 million outstanding at any one time.\n​\nRevolving Facility\n​\nOn September 3, 2024, we entered into an amended and restated credit agreement which provides for a $2.375 billion unsecured five-year revolving credit facility (the “Revolving Facility”) and allows for a subfacility for letters of credit of up to $100 million, of which $70 million is currently committed and $30 million is currently uncommitted. The Revolving Facility also includes a subfacility with an available borrowing capacity of up to $50 million for short-term borrowings referred to as swingline loans. The Revolving Facility is scheduled to mature on September 3, 2029.\n​\nBorrowings under the Revolving Facility bear interest at a rate equal to an applicable interest rate margin plus, at our option, either (a) Adjusted Term SOFR (which is Term SOFR (as published by CME Group Benchmark Administration Limited) plus a credit spread adjustment of 0.10%) or (b) a base rate (which is usually equal to the prime rate). The applicable interest rate margin for borrowings as of January 31, 2025 was 1.015% for Adjusted Term SOFR borrowings and 0.015% for base-rate borrowings. We must also pay a facility fee, payable on any used and unused commitment amounts of the Revolving Facility, and customary fees on letters of credit issued under the Revolving Facility. As of January 31, 2025, the facility fee rate was 0.11%. The applicable interest rate margins for borrowings, the facility fees and the letter of credit fees under the Revolving Facility are subject to adjustment from time to time based on our long-term senior unsecured debt ratings. \n​\nThe credit agreement governing the Revolving Facility contains a number of customary affirmative and negative covenants that, among other things, restrict, subject to certain exceptions, our (and our subsidiaries’) ability to: incur additional liens; sell all or substantially all of our assets; consummate certain fundamental changes or change in our lines of business; and incur additional subsidiary indebtedness. The credit agreement governing the Revolving Facility also contains financial covenants which require the maintenance of a minimum fixed charge coverage ratio and a maximum leverage ratio. As of January 31, 2025, we were in compliance with all such covenants. \nOn March 11, 2025, we amended the credit agreement governing the Revolving Facility to increase the maximum leverage ratio and decrease the minimum fixed charge ratio until January 30, 2026, or earlier at our option upon achieving certain financial covenant milestones (“Covenant Relief Period”).  During the Covenant Relief Period, we are restricted from repurchasing shares of our common stock and the ability to incur certain additional liens and subsidiary debt is reduced. The credit agreement governing the Revolving Facility also contains customary events of default.  \n​\nAs of January 31, 2025, we had no outstanding borrowings, no outstanding letters of credit, and borrowing availability of $2.375 billion under the Revolving Facility that, due to our intention to maintain borrowing availability related to the commercial paper program described below, could contribute liquidity of $2.18 billion. In addition, we had outstanding letters of credit of $50.9 million which were issued pursuant to separate agreements.\n​\n364-Day Revolving Facility\n​\nThe Company had a 364-day $750 million unsecured revolving credit facility (the “364-Day Revolving \n34\n\n\nTable of Contents\nFacility”) which expired on January 30, 2024.\n​\nCommercial Paper\n​\nWe may issue the CP Notes from time to time in an aggregate amount not to exceed $2.0 billion outstanding at any time. The CP Notes may have maturities of up to 364 days from the date of issue and rank equal in right of payment with all of our other unsecured and unsubordinated indebtedness. We intend to maintain available commitments under the Revolving Facility in an amount at least equal to the amount of CP Notes outstanding at any time. As of January 31, 2025, our consolidated balance sheet reflected no outstanding unsecured CP Notes. CP Notes totaling $195.0 million were held by a wholly-owned subsidiary and therefore are not reflected in the consolidated balance sheets.\n​\nSenior Notes\n​\nOur Senior Notes consist of the following issuances:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n(In millions)\n​\n​\n​\nAnnual\n​\n​\n​\nInterest\n​\n​\n​\nAggregate\n​\n​\n​\n​\nIssuance\n​\nInterest\n​\nMaturity\n​\nRate\n​\n​\n​\nPrincipal\n​\n​\nDiscount\n​\nDate\n​\nSchedule\n​\nNovember 2025\n​\n4.150\n%\n​\n$\n 500.0\n​\n$\n 0.8\n​\nOctober 2015\n​\nMay 1 and November 1\n​\nApril 2027\n​\n3.875\n​\n​\n​\n 600.0\n​\n​\n 0.4\n​\nApril 2017\n​\nApril 15 and October 15\n​\nNovember 2027\n​\n4.625\n​\n​\n​\n 550.0\n​\n​\n 0.5\n​\nSeptember 2022\n​\nMay 1 and November 1\n​\nMay 2028\n​\n4.125\n​\n​\n​\n 500.0\n​\n​\n 0.5\n​\nApril 2018\n​\nMay 1 and November 1\n​\nJuly 2028\n​\n5.200\n​\n​\n​\n 500.0\n​\n​\n 0.1\n​\nJune 2023\n​\nJanuary 5 and July 5\n​\nApril 2030\n​\n3.500\n​\n​\n​\n 1,000.0\n​\n​\n 0.7\n​\nApril 2020\n​\nApril 3 and October 3\n​\nNovember 2032\n​\n5.000\n​\n​\n​\n 700.0\n​\n​\n 2.4\n​\nSeptember 2022\n​\nMay 1 and November 1\n​\nJuly 2033\n​\n5.450\n​\n​\n​\n 1,000.0\n​\n​\n 1.6\n​\nJune 2023\n​\nJanuary 5 and July 5\n​\nApril 2050\n​\n4.125\n​\n​\n​\n 500.0\n​\n​\n 5.0\n​\nApril 2020\n​\nApril 3 and October 3\n​\nNovember 2052\n​\n5.500\n​\n​\n​\n 300.0\n​\n​\n 0.3\n​\nSeptember 2022\n​\nMay 1 and November 1\n​\n​\nThe table above is comprised of what is collectively referred to as the Senior Notes, each of which were issued pursuant to an indenture as supplemented and amended by supplemental indentures relating to each series of Senior Notes (as so supplemented and amended, the “Senior Indenture”).\n​\nWe may redeem some or all of the Senior Notes at any time at redemption prices set forth in the Senior Indenture. Upon the occurrence of a change of control triggering event, which is defined in the Senior Indenture, each holder of our Senior Notes has the right to require us to repurchase some or all of such holder’s Senior Notes at a purchase price in cash equal to 101% of the principal amount thereof, plus accrued and unpaid interest, if any, to, but excluding, the repurchase date. We have provided notice to the trustees of our $500.0 million senior unsecured notes scheduled to mature on November 1, 2025, that we intend to redeem the entire principal amount of such notes on April 29, 2025. We expect to use cash on hand for the redemption.\n​\nThe Senior Indenture contains covenants limiting, among other things, our ability (subject to certain exceptions) to consolidate, merge, or sell or otherwise dispose of all or substantially all of our assets; and our ability and the ability of our subsidiaries to incur or guarantee indebtedness secured by liens on any shares of voting stock of significant subsidiaries.\n​\nThe Senior Indenture also provides for events of default which, if any of them occurs, would permit or require the principal of and accrued interest on our Senior Notes to become or to be declared due and payable, as applicable.\n​\n35\n\n\nTable of Contents\nRating Agencies\n​\nOur credit ratings, as well as future rating agency actions, could (i) impact our ability to finance our operations on satisfactory terms; (ii) affect our financing costs; and (iii) affect our insurance premiums and collateral requirements necessary for our self-insured programs. There can be no assurance that we will maintain or improve our current credit ratings, particularly, if we are unable to lower our leverage ratios to levels and within time frames deemed acceptable to the rating agencies. The credit ratings for our borrowings are as follows:\n​\n​\n​\n​\nRating Agency\n​\nSenior unsecured debt rating\n​\nCommercial paper rating\n​\nOutlook\nMoody’s\n​\nBaa2\n​\nP-2\n​\nNegative outlook\nStandard & Poor’s\n​\nBBB\n​\nA-2\n​\nNegative outlook\n​\nFuture Cash Requirements\n​\nThe following table summarizes significant estimated future cash requirements under our various contractual obligations and other commitments at January 31, 2025, in total and disaggregated into current (<1 year) and long-term (1 or more years) obligations (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPayments Due by Period\n \nContractual obligations\n    \nTotal\n    \n< 1 year\n    \n1 - 3 years\n    \n3 - 5 years\n    \n5+ years\n \nLong-term debt obligations\n​\n$\n 6,331,076\n​\n$\n 519,463\n​\n$\n 1,183,315\n​\n$\n 1,023,667\n​\n$\n 3,604,631\n​\nInterest(a)\n​\n \n 2,460,357\n​\n \n 294,311\n​\n \n 533,208\n​\n \n 398,432\n​\n \n 1,234,406\n​\nSelf-insurance liabilities(b)\n​\n \n 334,425\n​\n \n 165,085\n​\n​\n 121,100\n​\n​\n 45,790\n​\n​\n 2,450\n​\nOperating lease obligations\n​\n \n 13,761,782\n​\n \n 1,921,426\n​\n​\n 3,521,529\n​\n​\n 2,846,911\n​\n​\n 5,471,916\n​\nSubtotal\n​\n$\n 22,887,640\n​\n$\n 2,900,285\n​\n$\n 5,359,152\n​\n$\n 4,314,800\n​\n$\n 10,313,403\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCommitments Expiring by Period\n \nCommercial commitments(c)\n    \nTotal\n    \n< 1 year\n    \n1 - 3 years\n    \n3 - 5 years\n    \n5+ years\n \nLetters of credit\n​\n$\n 10,458\n​\n$\n 10,458\n​\n$\n —\n​\n$\n —\n​\n$\n —\n​\nPurchase obligations(d)\n​\n \n 1,295,661\n​\n \n 1,153,619\n​\n \n 134,975\n​\n \n 7,067\n​\n \n —\n​\nSubtotal\n​\n$\n 1,306,119\n​\n$\n 1,164,077\n​\n$\n 134,975\n​\n$\n 7,067\n​\n$\n —\n​\nTotal contractual obligations and commercial commitments\n​\n$\n 24,193,759\n​\n$\n 4,064,362\n​\n$\n 5,494,127\n​\n$\n 4,321,867\n​\n$\n 10,313,403\n​\n(a)\nRepresents obligations for interest payments on long-term debt and includes projected interest on variable rate long-term debt using 2024 year-end rates and balances. Variable rate long-term debt includes the Revolving Facility (although such facility had a balance of zero as of January 31, 2025), the CP Notes (which had a balance of zero as of January 31, 2025, and which amount is net of $195.0 million held by a wholly-owned subsidiary), and \ninterest rate swaps being accounted for as fair value hedges.\n​\n(b)\nWe retain a significant portion of the risk for our workers’ compensation, employee health, general liability, property loss, auto liability, and certain third-party landlord claims exposures. As these obligations do not have scheduled maturities, these amounts represent undiscounted estimates based upon actuarial assumptions. Substantially all amounts are reflected on an undiscounted basis in our consolidated balance sheets.\n​\n(c)\nCommercial commitments include information technology license and support agreements, supplies, fixtures, letters of credit for import merchandise, and other inventory purchase obligations.\n​\n(d)\nPurchase obligations include legally binding agreements for software licenses and support, supplies, fixtures, and merchandise purchases (excluding such purchases subject to letters of credit).\n​\n36\n\n\nTable of Contents\nShare Repurchase Program\n​\nOur common stock repurchase program had a total remaining authorization of approximately $1.38 billion at January 31, 2025. The authorization allows repurchases from time to time in open market transactions, including pursuant to trading plans adopted in accordance with Rule 10b5-1 of the Securities Exchange Act of 1934, as amended, or in privately negotiated transactions. The repurchase authorization has no expiration date, and future repurchases will depend on a variety of factors, including price, market conditions, compliance with the covenants and restrictions under our debt agreements, cash requirements, excess debt capacity, results of operations, financial condition and other factors. The repurchase program may be modified or terminated from time to time at the discretion of our Board of Directors. To preserve our investment grade credit rating and maintain financial flexibility, we did not repurchase any shares under this program in 2024 and do not plan to repurchase shares during fiscal 2025. For more detail, see Note 11 to the consolidated financial statements.\n​\nOther Considerations\n​\nIn March 2025, the Board of Directors declared a quarterly cash dividend of $0.59 per share which is payable on or before April 22, 2025 to shareholders of record of our common stock on April 8, 2025. We paid quarterly cash dividends of $0.59 per share in 2024. Although the Board currently expects to continue regular quarterly cash dividends, the declaration and amount of future cash dividends are subject to the Board’s sole discretion and will depend upon, among other factors, our results of operations, cash requirements, financial condition, contractual restrictions, excess debt capacity and other factors that our Board may deem relevant in its sole discretion.\n​\nOur inventory balance represented approximately 47% of our total assets exclusive of operating lease assets, goodwill, and other intangible assets as of January 31, 2025. Our ability to effectively manage our inventory balances can have a significant impact on our cash flows from operations during a given fiscal year as discussed further below. Inventory purchases are often somewhat seasonal in nature, such as the purchase of warm-weather or Christmas-related merchandise. Efficient management of our inventory has been and continues to be an area of focus for us. \n​\nAs described in Note 7 to the consolidated financial statements, we are involved in a number of legal actions and claims, some of which could potentially result in material cash payments. Adverse developments in those actions could materially and adversely affect our liquidity. \n​\nCash Flows\n​\nCash flows from operating activities. \nCash flows from operating activities were $2.996 billion in 2024, which represents a $604.3 million increase compared to 2023. Changes in merchandise inventories resulted in a $230.2 million increase in our working capital in 2024 compared to the decrease of $299.1 million in 2023 as described in greater detail below. Changes in accounts payable resulted in a $302.9 million increase in our working capital in 2024 compared to a $36.9 million increase in 2023, due primarily to the timing of inventory receipts and related payments. Changes in accrued expenses resulted in a $91.8 million increase in 2024 compared to a $39.2 million decrease in 2023. Net income decreased to $1.1 billion in 2024 as compared to $1.7 billion in 2023. Changes in other noncash losses resulted in a $296.2 million increase as compared to a $89.0 million increase in 2023 primarily due to impairment charges in 2024. Changes in income taxes paid in 2024 compared to 2023 are primarily due to the decrease in pre-tax earnings in 2024 and the timing of payments for income taxes.\n​\nCash flows from operating activities were $2.4 billion in 2023, which represents a $407.2 million increase compared to 2022. Changes in merchandise inventories resulted in a $299.1 million decrease in our working capital in 2023 compared to the decrease of $1.7 billion in 2022 as described in greater detail below. Changes in accounts payable resulted in a $36.9 million increase in our working capital in 2023 compared to a $194.7 million decrease in 2022, due primarily to the timing of inventory receipts and related payments. Net income decreased to $1.7 billion in 2023 as compared to $2.4 billion in 2022. Changes in other noncash losses resulted in a $89.0 million increase as compared to a $530.5 million increase in 2022 primarily due to a lower LIFO provision in 2023. Changes in income \n37\n\n\nTable of Contents\ntaxes including a decrease in cash paid for income taxes in 2023 compared to 2022 are primarily due to the decrease in pre-tax earnings in 2023.\n​\nOn an ongoing basis, we closely monitor and manage our inventory balances, and they may fluctuate from period to period based on new store openings, the timing of purchases, and other factors. Merchandise inventories decreased by 4% in 2024 and increased by 3% in 2023 and 20% in 2022. The decrease in the 2024 period primarily reflects a decrease in the consumables and home products categories due to inventory reduction efforts and core SKU reductions. Offsetting the inventory decrease in consumables and home products were increases in the seasonal and apparel categories primarily due to an increase in overall store count. Percent and dollar changes in our four inventory categories for the past three years were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the Year Ended\n​\n​\nJanuary 31,\n​\n​\nFebruary 2,\n​\n​\nFebruary 3,\n​\nIncrease (decrease)\n​\n2025\n​\n​\n2024\n \n​\n2023\n \nConsumables\n​\n$\n (287.4)\n​\n (6)\n%\n​\n$\n 744.5\n​\n 20\n%\n​\n$\n 367.8\n​\n 11\n%\nSeasonal\n​\n​\n 14.7\n​\n 1\n​\n​\n​\n (207.1)\n​\n (13)\n​\n​\n​\n 455.5\n​\n 42\n​\nHome products\n​\n​\n (18.3)\n​\n (2)\n​\n​\n​\n (291.3)\n​\n (28)\n​\n​\n​\n 315.4\n​\n 43\n​\nApparel\n​\n​\n 8.0\n​\n 2\n​\n​\n​\n (12.6)\n​\n (4)\n​\n​\n​\n 7.8\n​\n 2\n​\n​\nCash flows from investing activities\n. Significant components of property and equipment purchases included the following approximate amounts:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the Year Ended\n​\n​\n​\nJanuary 31,\n​\nFebruary 2,\n​\nFebruary 3,\n​\n(amounts in millions, except store count amounts)\n    \n2025\n​\n2024\n​\n2023\n \nExisting stores improvements, upgrades, remodels, and relocations\n​\n$\n 605.3\n​\n$\n 683.4\n​\n$\n 588.5\n​\nDistribution and transportation-related capital expenditures\n​\n​\n 342.9\n​\n​\n 542.4\n​\n​\n 478.7\n​\nNew stores primarily for leasehold improvements, fixtures and equipment\n​\n \n 295.9\n​\n \n 390.2\n​\n \n 372.6\n​\nInformation systems upgrades and technology-related projects\n​\n \n 52.2\n​\n \n 67.1\n​\n \n 62.2\n​\nOther\n​\n \n 13.6\n​\n \n 17.1\n​\n \n 58.6\n​\nTotal purchases of property and equipment\n​\n$\n 1,309.9\n​\n$\n 1,700.2\n​\n$\n 1,560.6\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nStore Counts\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNew stores\n​\n​\n 725\n​\n​\n 987\n​\n​\n 1,039\n​\nRemodeled or relocated\n​\n​\n 1,706\n​\n​\n 2,136\n​\n​\n 1,922\n​\n​\nCapital expenditures during 2025 are projected to be in the range of $1.3 billion to $1.4 billion. We anticipate funding 2025 capital requirements with a combination of some or all of the following: existing cash balances, cash flows from operations, availability under our Revolving Facility and/or the issuance of additional CP Notes. We plan to continue to invest in store growth and development with approximately 575 new stores in the United States and up to 15 new stores in Mexico and approximately 4,295 remodels or relocations, including fully remodeling approximately 2,000 stores through Project Renovate, remodeling approximately 2,250 through Project Elevate, and relocating approximately 45 stores. Capital expenditures in 2025 are anticipated to support our store growth as well as our remodel and relocation initiatives, including capital outlays for leasehold improvements, fixtures and equipment; the construction of new stores; costs to support and enhance our supply chain initiatives for existing distribution center facilities and replacement of certain transportation related assets; technology initiatives; as well as routine and ongoing capital requirements.\n​\nCash flows from financing activities\n. During the 2024 period we had repayments of long-term obligations of $770.2 million. We paid cash dividends of $519.0 million and did not repurchase shares of our common stock. \n​\nIn 2023, we received proceeds from the issuance of long-term debt of $1.5 billion. Net commercial paper borrowings decreased by $1.5 billion, and we received and repaid $500.0 million under the 364-Day Revolving Facility. We paid cash dividends of $518.0 million and did not repurchase shares of our common stock.\n​\n38\n\n\nTable of Contents\nIn 2022, we received proceeds from the issuance of long-term debt of $2.3 billion, and our repayments of long-term debt totaled $911.3 million. Net commercial paper borrowings increased by $1.4 billion, and we had no borrowings or repayments under the Revolving Facility or the 364-Day Revolving Facility. We repurchased 11.6 million shares of our common stock at a total cost of $2.7 billion and paid cash dividends of $493.7 million.\n​\nCritical Accounting Policies and Estimates\n​\nThe preparation of financial statements in accordance with generally accepted accounting principles in the United States (“U.S. GAAP”) requires management to make estimates and assumptions that affect reported amounts and related disclosures. In addition to the estimates presented below, there are other items within our financial statements that require estimation but are not deemed critical as defined below. We believe these estimates are reasonable and appropriate. However, if actual experience differs from the assumptions and other considerations used, the resulting changes could have a material effect on the financial statements taken as a whole.\n​\nManagement believes the following policies and estimates are critical because they involve significant judgments, assumptions, and estimates. Management has discussed the development and selection of the critical accounting estimates with the Audit Committee of our Board of Directors, and the Audit Committee has reviewed the disclosures presented below relating to those policies and estimates. See Note 1 to the consolidated financial statements for a detailed discussion of our principal accounting policies.\n​\nMerchandise Inventories\n. Merchandise inventories are stated at the lower of cost or market (“LCM”) with cost determined using the retail last in, first out (“LIFO”) method. We use the retail inventory method (“RIM”) to calculate gross profit and the resulting valuation of inventories at cost, which are computed utilizing a calculated cost-to-retail inventory ratio to the retail value of sales at an inventory department level. We apply the RIM to these departments, which are groups of products that are fairly uniform in terms of cost, selling price relationship and turnover. The RIM will result in valuing inventories at LCM if permanent markdowns are recorded timely as a reduction of the retail value of inventories. Inherent in the RIM calculation are certain management judgments and estimates that may impact the ending inventory valuation at cost, as well as the gross profit recognized. These judgments include ensuring departments consist of similar products, recording estimated shrinkage between physical inventories, and timely recording of markdowns needed to sell inventory.  \n​\nFactors considered in the determination of markdowns include current and anticipated demand based on changes in competitors’ practices, consumer preferences, consumer spending, significant weather events and unseasonable weather patterns. Certain of these factors are outside of our control and may result in greater than estimated markdowns to entice consumer purchases of excess inventory. The amount and timing of markdowns may vary significantly from year to year.\n​\nWe perform physical inventories in a significant majority of our stores on an annual basis. We calculate our shrink provision based on actual physical inventory results during the fiscal period and an accrual for estimated shrink occurring subsequent to a physical inventory through the end of the fiscal reporting period. This accrual is calculated as a percentage of sales at each retail store, at a department level, based on the store’s most recent historical shrink rate. From time to time as circumstances may warrant, we consider more recent shrink experience in the calculation of our shrink accrual. The impact of doing so has not been material. To the extent that subsequent physical inventories yield different results than the estimated accrual, our effective shrink rate for a given reporting period will include the impact of adjusting to the actual results. \n​\nWe believe our estimates and assumptions related to the application of the RIM results in a merchandise inventory valuation that reasonably approximates cost on a consistent basis. \n​\nWe perform an annual LIFO analysis whereby all merchandise units are considered for inclusion in the index formulation. An actual valuation of inventory under the LIFO method is made at the end of each year based on the inventory levels and costs at that time. In contrast, interim LIFO calculations are based on management’s annual estimates of sales, the rate of inflation or deflation, and year-end inventory levels. We also perform analyses for determining obsolete inventory, adjusting inventory on a quarterly basis to an LCM value based on various \n39\n\n\nTable of Contents\nmanagement assumptions including estimated below cost markdowns not yet recorded, but required to liquidate such inventory in future periods.\n​\n​\nImpairment of Long-lived Assets. \nLong-lived assets, including right of use assets, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable. The evaluation is performed primarily at the store level, which is the lowest level of identifiable cash flows that are largely independent of cash flows of other assets and liabilities\n.\n Impairment of long-lived assets results when the carrying value of the assets exceeds the estimated undiscounted future cash flows generated by the assets. Our estimate of undiscounted future store cash flows is based upon historical operations of the stores and estimates of future profitability which encompasses many factors that are subject to variability and are difficult to predict. If a long-lived asset is found to be impaired, the amount recognized for impairment is equal to the difference between the carrying value and the asset’s estimated fair value. The fair value is estimated based primarily upon projected future cash flows (discounted at our credit adjusted risk-free rate) or other reasonable estimates of fair market value. Changes in these estimates, assumptions or projections could materially affect the determination of fair value or impairment.\n​\nInsurance Liabilities\n. We retain a significant portion of the risk for our workers’ compensation, employee health, general liability, property loss, auto liability and certain third-party landlord claim exposures. These represent significant costs primarily due to our large employee base and number of stores. Provisions are made for these liabilities on an undiscounted basis. Certain of these liabilities are based on actual claim data and estimates of incurred but not reported claims developed using actuarial methodologies based on historical claim trends, which have been and are anticipated to continue to be materially accurate. If future claim trends deviate from recent historical patterns, or other unanticipated events affect the number and significance of future claims, we may be required to record additional expenses or expense reductions, which could be material to our future financial results.\n​\nContingent Liabilities – Income Taxes.\n Income tax reserves are determined using the methodology established by accounting standards relating to uncertainty in income taxes. These standards require companies to assess each income tax position taken using a two-step process. A determination is first made as to whether it is more likely than not that the position will be sustained, based upon the technical merits, upon examination by the taxing authorities. If the tax position is expected to meet the more likely than not criteria, the benefit recorded for the tax position equals the largest amount that is greater than 50% likely to be realized upon ultimate settlement of the respective tax position. Uncertain tax positions require determinations and liabilities to be estimated based on provisions of the tax law which may be subject to change or varying interpretation. If our determinations and estimates prove to be inaccurate, the resulting adjustments could be material to our future financial results.\n​\nLease Accounting\n. Lease liabilities are recorded at a discount based upon our estimated collateralized incremental borrowing rate which involves significant judgments and estimates. Factors incorporated into the calculation of lease discount rates include the valuations and yields of our senior notes, their credit spread over comparable U.S. Treasury rates, and an index of the credit spreads for all North American investment grade companies by rating. To determine an indicative secured rate, we use the estimated credit spread improvement that would result from an upgrade of one ratings classification by tenor. Many of our stores typically carry a primary lease term of up to 15 years with multiple renewal options. We also have stores subject to shorter-term leases and many of these leases also have renewal options. We record single lease expense on a straight-line basis over the lease term including any option periods that are reasonably certain to be renewed, commencing on the date that we take physical possession of the property from the landlord. Tenant allowances, to the extent received, are recorded as a reduction of the right of use asset. Improvements of leased properties are amortized over the shorter of the life of the applicable lease term or the estimated useful life of the asset. \n​\nShare-Based Payments\n. Our stock option awards are valued on an individual grant basis using the Black-Scholes-Merton closed form option pricing model. We believe that this model fairly estimates the value of our stock option awards. The application of this valuation model involves assumptions that are judgmental in the valuation of stock options, which affects compensation expense related to these options. These assumptions include the term that the options are expected to be outstanding, the historical volatility of our stock price, applicable interest rates and the dividend yield of our stock. Other factors involving judgments that affect the expensing of share-based payments include estimated forfeiture rates of share-based awards. Historically, these estimates have been materially accurate; \n40\n\n\nTable of Contents\nhowever, if our estimates differ materially from actual experience, we may be required to record additional expense or reductions of expense, which could be material to our future financial results.\n​\n​",
  "item2": null
}