{
  "source_file": "dg-20250801x10q.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\n​\nGeneral\n​\nThis discussion and analysis is based on, should be read with, and is qualified in its entirety by, the accompanying unaudited consolidated financial statements and related notes, as well as our consolidated financial statements and the related Management’s Discussion and Analysis of Financial Condition and Results of Operations as contained in our Annual Report on Form 10-K for the fiscal year ended January 31, 2025. It also should be read in conjunction with the disclosure under “Cautionary Disclosure Regarding Forward-Looking Statements” in this report.\n​\nExecutive Overview\n​\nWe are the largest discount retailer in the United States by number of stores, with 20,746 stores located in 48 U.S. states and Mexico as of August 1, 2025, with the greatest concentration of stores in the southern, southwestern, midwestern and eastern United States. We offer a broad selection of merchandise, including consumable products such as food, paper and cleaning products, health and beauty products and pet supplies, and non-consumable products such as seasonal merchandise, home decor and domestics, and basic apparel. Our merchandise includes national brands from leading manufacturers, as well as our own private brand selections with prices often at substantial discounts to national brands. We offer our customers these national brand and private brand products at everyday low prices (typically $10 or less) in our convenient small-box locations.\n​\nWe believe our convenient store formats, locations, and broad selection of high-quality products at compelling values have driven our substantial growth and financial success over the years and through a variety of economic cycles. We are mindful that the majority of our customers are value-conscious, and many have low and/or fixed incomes. As a result, we are intensely focused on helping our customers make the most of their spending dollars. The primary macroeconomic factors that affect our core customers include unemployment and underemployment rates, inflation, wage growth, changes in federal and state tax policies, interest rates, changes in U.S. and global trade policy (including price increases resulting from tariffs), and changes in U.S. government policy and assistance programs (including cost of living adjustments), such as SNAP, unemployment benefits, and economic stimulus programs. In May 2025, the federal government reinstated collections on defaulted student loans, and the impact on our customers and consequently on our business is uncertain at this time, and we can make no assurance that it will not be material. Finally, significant unseasonable or unusual weather patterns or extreme weather can impact customer shopping behaviors. \n​\nUncertainty remains regarding the potential impact of tariffs on consumer behavior and our business. Tariff rates on both direct imports and domestic purchases did not materially impact our financial results for the first two quarters of 2025. Currently announced tariff rates, including those that have been announced but delayed, as well as any increases or expansions of tariff coverage affecting the products that we sell, could have a more significant impact on our business and on our customers’ budgets. However, the tariff environment remains dynamic, and the specific tariffs applicable to goods imported by us and our suppliers into the U.S. may continue to evolve. We continue to monitor developments and to evaluate and implement mitigation strategies to address the potential sales and margin impact of current and potential future tariffs, as well as to take various actions designed to minimize price increases for our customers. There can be no assurance we will be successful in our efforts, or that price increases will not adversely affect customer behavior. \n​\nOur core customers are often among the first to be affected by negative or uncertain economic conditions and among the last to feel the effects of improving economic conditions, particularly when trends are inconsistent and of an uncertain duration. Our customers continue to feel constrained in the current macroeconomic environment and to experience elevated expenses that generally comprise a large portion of their household budgets, such as rent, healthcare, energy and fuel prices, as well as cost inflation in frequently purchased household products (including food), which we expect will continue to pressure our customers’ spending overall and particularly in our non-consumables categories. We expect a promotional environment in 2025 similar to that in 2024. \n​\nWe remain committed to our long-term operating priorities as we consistently strive to improve our performance while retaining our customer-centric focus. These priorities include: 1) driving profitable sales growth, 2) capturing growth opportunities, 3) enhancing our position as a low-cost operator, and 4) investing in the growth and development of our teams. \n21\n\n\n​\n​\nWe seek to drive profitable sales growth through initiatives aimed at increasing customer traffic and average transaction amount. Historically, sales in our consumables category, which tend to have lower gross margins, have been the key drivers of net sales and customer traffic, while sales in our non-consumables categories, which tend to have higher gross margins, have been the key drivers of more profitable sales growth and average transaction amount. Our sales mix remains heavily weighted towards consumables, although we saw slight improvement to our sales mix in the second quarter as compared to last year’s second quarter. Certain of our initiatives are intended to better optimize our sales mix; however, there can be no assurances that these efforts will be successful. \n​\nAs we work to provide everyday low prices and meet our customers’ affordability needs, we remain focused on enhancing our margins through inventory shrink and damage reduction initiatives, as well as pricing and markdown optimization, effective category management and inventory reduction efforts, distribution and transportation efficiencies, private brands penetration and global sourcing strategies. Several of our strategic and other sales-driving initiatives are also designed to capture growth opportunities and are discussed in more detail below. \n​\nWe continue to experience significant levels of inventory shrink and damages. However, we have made progress in reducing shrink for four consecutive quarters, and we began to see improvement in damages during the first two quarters of 2025. We continue to take actions designed to address shrink and damage levels.\n​\nWe continue to implement and invest in certain strategic initiatives that we believe will help drive profitable sales growth with both new and existing customers and capture long-term growth opportunities. Such opportunities include providing our customers with a variety of shopping access points and even greater value and convenience by leveraging and developing digital tools and technology, such as our Dollar General app, which contains a variety of tools to enhance the shopping experience. We remain focused on enhancing both the in-store and digital shopping experience, while driving operational efficiency. Partnerships with third-party delivery services are available in the majority of our stores, providing added convenience and incremental sales. Additionally, in September 2024, we partnered with a third-party provider to fully execute a same-day home delivery offering through our DG app and website in select stores. We plan to significantly expand this offering to additional stores throughout 2025. Furthermore, we believe these efforts will contribute to the continued growth of our DG Media Network, our platform that connects brand partners with our customers. \n​\nWe are expanding our efforts to improve the performance and profitability of our mature stores through the rollout of an incremental remodel program, Project Elevate. This partial-remodel initiative is designed to refresh and optimize the merchandising in our stores, and in turn, enhance the shopping experience for our customers, while also mitigating future repairs and maintenance expense. Project Elevate remodels are incremental to our full-remodel program, Project Renovate.\n​\nWe also remain focused on capturing growth opportunities. In the second quarter of 2025, we opened a total of 204 new stores, remodeled 729 stores through Project Elevate and 592 stores through Project Renovate, relocated 15 stores and closed 40 stores. In 2025, we plan to open approximately 575 new stores (as well as up to 15 stores in Mexico), fully remodel approximately 2,000 stores through Project Renovate, partially remodel 2,250 stores through Project Elevate, and relocate approximately 45 stores, for a total of 4,885 real estate projects. \n​\npOpshelf is a unique retail concept focused on categories such as seasonal and home décor, health and beauty, home cleaning supplies, and party and entertainment goods. In light of the softer discretionary sales environment, we previously converted certain pOpshelf stores to Dollar General stores, and do not believe opening new pOpshelf stores in 2025 is a prudent use of capital. At the end of the second quarter of 2025, we operated 180 standalone pOpshelf stores. We are taking focused actions in 2025 designed to improve the performance of pOpshelf stores, although there can be no assurances that our efforts will be successful. \n​\nWe expect store format innovation to allow us to capture additional growth opportunities as we continue to utilize the most productive of our various Dollar General store formats based on the specific market opportunity. In 2025 we expect the significant majority of the stores to be in one of our 8,500 square foot formats. These formats allow for expanded high-capacity-cooler counts, an extended queue line, and a broader product assortment, including an enhanced non-consumable offering, a larger health and beauty section, and produce in select stores.\n​\n22\n\n\n​\nWe are always seeking ways to reduce or control costs that do not affect our customers’ shopping experiences. We plan to continue enhancing our position as a low-cost operator over time while employing ongoing cost discipline to reduce certain expenses as a percentage of sales. Nonetheless, we seek to maintain flexibility to invest in the business as necessary to enhance our long-term competitiveness and profitability. From time to time, our strategic initiatives, including without limitation those discussed above, have required and may continue to require us to incur upfront expenses for which there may not be an immediate return in terms of sales or enhanced profitability. \n​\nCertain of our operating expenses, such as wage rates, occupancy costs and depreciation and amortization, have continued to increase in recent years, due primarily to market forces such as labor availability, increases in minimum wage rates, inflation and increases in property rents and interest rates. Significant or rapid increases to federal, state or local minimum wage rates or salary levels could significantly adversely affect our earnings if we are not able to otherwise offset these increased labor costs elsewhere in our business. \n​\nWe believe ongoing inflationary pressures could continue to affect our vendors and customers and our operating results. Both inflation and higher interest rates have significantly increased new store opening costs and occupancy costs in recent years, and while we continue to have strong new store returns and plan to grow our store base significantly in 2025, these increased costs have negatively impacted our projected new store returns and influenced our new store growth plans. \n​\nOur teams are a competitive advantage, and we proactively seek ways to continue investing in their development. Our goal is to create an environment that attracts, develops, and retains talented personnel, particularly at the store manager level, as employees who are promoted from within our company generally have longer tenures and are greater contributors to improvements in our financial performance. We are taking actions designed to continue reducing our higher than targeted store manager turnover, including through budgeting and allocation of labor hours, simplifying in-store activities, and reducing excess inventory. \n​\nTo further enhance shareholder returns, we pay a quarterly cash dividend. The declaration and amount of future dividends are subject to Board discretion and approval, although we currently expect to continue paying quarterly cash dividends. As planned, to preserve our investment grade credit rating and maintain financial flexibility, we do not intend to repurchase shares during 2025. \n​\nKey Performance Indicators\n​\nWe utilize key performance indicators, which are defined below, in the management of our business including same-store sales, average sales per square foot, and inventory turnover. We use these measures to maximize profitability and for decisions about the allocation of resources. Each of these measures is commonly used by investors in retail companies to measure the health of the business. \n​\nSame-store sales are calculated based upon our stores that were open at least 13 full fiscal months and remain open at the end of the reporting period. We include stores that have been remodeled, expanded or relocated in our same-store sales calculation. Changes in same-store sales are calculated based on the comparable 52 calendar weeks in the current and prior years. The method of calculating same-store sales varies across the retail industry. As a result, our calculation of same-store sales is not necessarily comparable to similarly titled measures reported by other companies. \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n13 Weeks Ended\n​\n26 Weeks Ended\n​\n​\n​\nAugust 1,\n​\nAugust 2,\n​\nAugust 1,\n​\nAugust 2,\n​\n​\n    \n2025\n​\n2024\n​\n2025\n​\n2024\n​\nSame-store sales\n​\n 2.8\n%\n    \n 0.5\n%\n    \n 2.6\n%\n    \n 1.4\n%\n​\n​\nAverage sales per square foot is calculated based on total sales for the preceding four quarters as of the ending date of the reporting period divided by the average selling square footage as of the end of the most recent five quarters. \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAugust 1,\n​\nAugust 2,\n​\n​\n    \n2025\n​\n2024\n​\nAverage sales per square foot\n​\n$\n266\n    \n$\n263\n​\n​\n23\n\n\n​\nInventory turnover is calculated based on total cost of goods sold for the preceding four quarters as of the ending date of the reporting period divided by the average inventory balance as of the end of the most recent five quarters.\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAugust 1,\n​\nAugust 2,\n​\n​\n    \n2025\n​\n2024\n​\nInventory turnover\n​\n 4.3\n    \n 3.9\n​\n​\nResults of Operations\n​\nAccounting Periods\n. We utilize a 52-53 week fiscal year convention that ends on the Friday nearest to January 31. The following text contains references to years 2025 and 2024, which represent the 52-week fiscal years ending or ended January 30, 2026 and January 31, 2025, respectively. References to the second quarter accounting periods for 2025 and 2024 contained herein refer to the 13-week accounting periods ended August 1, 2025 and August 2, 2024, respectively. \n​\nSeasonality.\n The nature of our business is somewhat seasonal. Primarily because of sales of Christmas-related merchandise, operating profit in our fourth quarter (November, December and January) has historically been higher than operating profit achieved in each of the first three quarters of the fiscal year. However, this was not the case in our two most recently completed fiscal years. Expenses, and to a greater extent operating profit, vary by quarter. Results of a period shorter than a full year may not be indicative of results expected for the entire year. Furthermore, the seasonal nature of our business may affect comparisons between periods.\n​\nThe following tables contain results of operations data for the second 13-week periods and the 26-week periods of 2025 and 2024, and the dollar and percentage variances among those periods. Basis point amounts referred to below are equal to 0.01% as a percentage of net sales: \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n13 Weeks Ended\n​\n26 Weeks Ended\n \n(amounts in millions, except\n​\nAugust 1,\n    \nAugust 2,\n    \n%\n    \nAugust 1,\n    \nAugust 2,\n    \n%\n \nper share amounts)\n​\n2025\n​\n2024\n​\nChange\n​\n2025\n​\n2024\n​\nChange\n \nNet sales\n​\n$\n 10,727.7\n​\n$\n 10,210.4\n​\n 5.1\n%  \n$\n 21,163.7\n​\n$\n 20,124.4\n​\n 5.2\n%\nCost of goods sold\n​\n \n 7,366.1\n​\n \n 7,150.9\n​\n 3.0\n​\n \n 14,570.8\n​\n​\n 14,072.8\n​\n 3.5\n​\nGross profit\n​\n \n 3,361.7\n​\n \n 3,059.5\n​\n 9.9\n​\n \n 6,593.0\n​\n​\n 6,051.6\n​\n 8.9\n​\nSelling, general and administrative expenses\n​\n \n 2,766.2\n​\n \n 2,509.5\n​\n 10.2\n​\n \n 5,421.4\n​\n​\n 4,955.6\n​\n 9.4\n​\nOperating profit\n​\n \n 595.4\n​\n \n 550.0\n​\n 8.3\n​\n \n 1,171.5\n​\n​\n 1,096.1\n​\n 6.9\n​\nInterest expense, net\n​\n \n 57.7\n​\n \n 68.1\n​\n (15.3)\n​\n \n 122.3\n​\n​\n 140.6\n​\n (13.0)\n​\nIncome before income taxes\n​\n \n 537.7\n​\n \n 481.8\n​\n 11.6\n​\n \n 1,049.2\n​\n​\n 955.5\n​\n 9.8\n​\nIncome tax expense\n​\n \n 126.3\n​\n \n 107.6\n​\n 17.3\n​\n \n 245.9\n​\n​\n 218.0\n​\n 12.8\n​\nNet income\n​\n$\n 411.4\n​\n$\n 374.2\n​\n 10.0\n%  \n$\n 803.4\n​\n$\n 737.5\n​\n 8.9\n%\nDiluted earnings per share\n​\n$\n 1.86\n​\n$\n 1.70\n​\n 9.4\n%  \n$\n 3.64\n​\n$\n 3.35\n​\n 8.7\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n13 Weeks Ended\n​\n26 Weeks Ended\n \n​\n​\nAugust 1,\n    \nAugust 2,\n    \nBasis Point\n    \nAugust 1,\n    \nAugust 2,\n    \nBasis Point\n \n(Percent of Net Sales)\n​\n2025\n​\n2024\n​\nChange\n​\n2025\n​\n2024\n​\nChange\n \nNet sales\n​\n 100.00\n%  \n 100.00\n%  \n​\n​\n 100.0\n%  \n 100.0\n%  \n​\n​\nCost of goods sold\n​\n 68.66\n​\n 70.04\n​\n (137)\n​\n 68.85\n​\n 69.93\n​\n (108)\n​\nGross profit\n​\n 31.34\n​\n 29.96\n​\n 137\n​\n 31.15\n​\n 30.07\n​\n 108\n​\nSelling, general and administrative expenses\n​\n 25.79\n​\n 24.58\n​\n 121\n​\n 25.62\n​\n 24.62\n​\n 99\n​\nOperating profit\n​\n 5.55\n​\n 5.39\n​\n 16\n​\n 5.54\n​\n 5.45\n​\n 9\n​\nInterest expense, net\n​\n 0.54\n​\n 0.67\n​\n (13)\n​\n 0.58\n​\n 0.70\n​\n (12)\n​\nIncome before income taxes\n​\n 5.01\n​\n 4.72\n​\n 29\n​\n 4.96\n​\n 4.75\n​\n 21\n​\nIncome tax expense\n​\n 1.18\n​\n 1.05\n​\n 12\n​\n 1.16\n​\n 1.08\n​\n 8\n​\nNet income\n​\n 3.84\n%  \n 3.66\n%  \n 17\n​\n 3.80\n%  \n 3.66\n%  \n 13\n​\n​\n​\n24\n\n\n​\n13 WEEKS ENDED AUGUST 1, 2025 AND AUGUST 2, 2024\n​\nNet Sales\n. For the 2025 period, net sales increased 5.1% to $10.73 billion. The net sales increase in the 2025 period was primarily due to sales from new stores and a same-store sales increase of 2.8% compared to the 2024 period, partially offset by the impact of store closures. The increase in same-store sales reflects a 1.5% increase in customer traffic and a 1.2% increase in average transaction amount. The increase in average transaction amount was driven by higher average retail prices and an increase in items per transaction. Same-store sales increased in the consumables, seasonal, home products and apparel categories. For the 2025 period, there were 19,916 same-stores, which accounted for sales of $10.37 billion. \n​\nThe amount of net sales represented by each of our product categories for the 13 weeks ended August 1, 2025, and August 2, 2024, as well as the percentage change between such periods, were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n13 Weeks Ended\n​\n​\n​\n​\nAugust 1,\n    \nAugust 2,\n    \n%\n    \n  \n(amounts in millions)\n​\n2025\n​\n2024\n​\nChange\n​\n​\nNet sales by category:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nConsumables\n​\n$\n 8,819.9\n​\n$\n 8,397.2\n​\n 5.0\n%  \n​\nSeasonal\n​\n \n 1,106.1\n​\n \n 1,054.8\n​\n 4.9\n​\n​\nHome products\n​\n \n 511.8\n​\n \n 480.2\n​\n 6.6\n​\n​\nApparel\n​\n \n 289.9\n​\n \n 278.2\n​\n 4.2\n​\n​\nNet sales\n​\n$\n 10,727.7\n​\n$\n 10,210.4\n​\n 5.1\n%  \n​\n​\nThe percentage of net sales represented by each of our product categories for the 13 weeks ended August 1, 2025, and August 2, 2024, were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n13 Weeks Ended\n​\n​\n​\n​\nAugust 1,\n    \nAugust 2,\n    \n  \n​\n​\n2025\n​\n2024\n​\n​\nNet sales by category:\n​\n​\n​\n​\n​\n​\nConsumables\n​\n 82.22\n%  \n 82.25\n%  \n​\nSeasonal\n​\n 10.31\n​\n 10.33\n​\n​\nHome products\n​\n 4.77\n​\n 4.70\n​\n​\nApparel\n​\n 2.70\n​\n 2.72\n​\n​\nNet sales\n​\n 100.00\n%\n 100.00\n%\n​\n​\nGross Profit.\n For the 2025 period, gross profit increased by 9.9%, and as a percentage of net sales increased by 137 basis points to 31.3%, compared to the 2024 period. The increase in the gross profit rate was driven primarily by lower shrink, higher inventory markups and lower inventory damages, partially offset by an increased LIFO provision, increased markdowns and increased distribution costs.\n​\nSelling, General & Administrative \nExpenses (“SG&A”). \nSG&A was 25.8% as a percentage of net sales in the 2025 period compared to 24.6% in the comparable 2024 period, an increase of 121 basis points. \nThe primary expenses that were a higher percentage of net sales in the current year period were incentive compensation, repairs and maintenance and benefits.\n​\nInterest Expense, net\n. Interest expense, net decreased by $10.4 million to $57.7 million in the 2025 period primarily due to lower average outstanding borrowings.\n​\nIncome Taxes. \nThe effective income tax rate for the 2025 period was 23.5% compared to a rate of 22.3% for the 2024 period. The tax rate for the 2025 period was higher than the comparable 2024 period primarily due to the enactment of Pillar Two minimum tax in a certain jurisdiction.\n​\n25\n\n\n​\n26 WEEKS ENDED AUGUST 1, 2025 AND AUGUST 2, 2024\n​\nNet Sales.\n For the 2025 period, net sales increased 5.2% to $21.16 billion. The net sales increase in the 2025 period was primarily due to sales from new stores\n \nand a same-store sales increase of 2.6% compared to the 2024 period, partially offset by the impact of store closures. The increase in same-store sales reflects a 1.9% increase in average transaction amount and a 0.6% increase in customer traffic. The increase in average transaction amount was driven by higher average retail prices and an increase in items per transaction. Same-store sales increased in the consumables, seasonal, home products and apparel categories. For the 2025 period, there were 19,916 same-stores which accounted for sales of $20.39 billion.\n​\nThe amount of net sales represented by each of our product categories for the 26 weeks ended August 1, 2025, and August 2, 2024, as well as the percentage change between such periods, were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n26 Weeks Ended\n \n​\n​\nAugust 1,\n    \nAugust 2,\n    \n%\n \n(amounts in millions)\n​\n2025\n​\n2024\n​\nChange\n \nNet sales by category:\n​\n​\n​\n​\n​\n​\n​\n​\n​\nConsumables\n​\n$\n 17,456.6\n \n$\n 16,608.1\n \n 5.1\n%\nSeasonal\n​\n \n 2,129.0\n​\n​\n 2,018.3\n​\n 5.5\n​\nHome products\n​\n \n 1,019.0\n​\n​\n 959.0\n​\n 6.3\n​\nApparel\n​\n \n 559.1\n​\n​\n 539.0\n​\n 3.7\n​\nNet sales\n​\n$\n 21,163.7\n​\n$\n 20,124.4\n​\n 5.2\n%\n​\nThe percentage of net sales represented by each of our product categories for the 26 weeks ended August 1, 2025, and August 2, 2024, were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n26 Weeks Ended\n​\n​\n​\nAugust 1,\n    \nAugust 2,\n    \n​\n​\n2025\n​\n2024\n​\nNet sales by category:\n​\n​\n​\n​\n​\nConsumables\n​\n 82.49\n%  \n 82.52\n%  \nSeasonal\n​\n 10.06\n​\n 10.03\n​\nHome products\n​\n 4.81\n​\n 4.77\n​\nApparel\n​\n 2.64\n​\n 2.68\n​\nNet sales\n​\n 100.0\n%\n 100.0\n%\n​\nGross Profit.\n For the 2025 period, gross profit increased by 8.9%, and as a percentage of net sales increased by 108 basis points to 31.2%, compared to the 2024 period. The increase in the gross profit rate was driven primarily by lower shrink, higher inventory markups and lower inventory damages, partially offset by an increased LIFO provision and increased markdowns.\n​\nSelling, General & Administrative Expenses.\n SG&A was 25.6% as a percentage of net sales in the 2025 period compared to 24.6% in the comparable 2024 period, an increase of 99 basis points. The primary expenses that were a higher percentage of net sales in the current year period were incentive compensation, repairs and maintenance and retail labor.\n​\nInterest Expense, net\n. Interest expense, net decreased by $18.2 million to $122.3 million in the 2025 period primarily due to lower average outstanding borrowings. \n​\nIncome Taxes.\n The effective income tax rate for the 2025 period was 23.4% compared to a rate of 22.8% for the 2024 period. The tax rate for the 2025 period was higher than the comparable 2024 period primarily due the enactment of Pillar Two minimum tax in a certain jurisdiction. \n​\n​\nLiquidity and Capital Resources\n​\nWe believe our cash flow from operations and existing cash balances, combined with availability under the unsecured revolving credit facility (the “Revolving Facility”), the unsecured commercial paper notes (the “CP Notes”) and access to the debt markets, will provide sufficient liquidity to fund our current obligations, projected working capital \n26\n\n\n​\nrequirements, capital spending, and anticipated dividend payments for a period that includes the next twelve months as well as the next several years. However, our ability to maintain sufficient liquidity may be affected by numerous factors, many of which are outside of our control. Depending on our liquidity levels, conditions in the capital markets and other factors, we may from time to time consider the issuance of debt, equity or other securities, the proceeds of which could provide additional liquidity for our operations. All of our material borrowing arrangements are described in greater detail in Note 5 to the unaudited consolidated financial statements.\n​\nIn April 2025, we redeemed the $500.0 million aggregate principal amount of outstanding 4.15% senior notes due November 2025. In addition, we have provided notice to the trustee of our $600.0 million aggregate principal amount of outstanding 3.875% senior notes due April 2027, that we intend to redeem the entire principal amount of such notes in the third quarter. We expect to use cash on hand for this redemption.\n​\nOur borrowing availability under the Revolving Facility may be effectively limited by our CP Notes as further described in Note 5 to the unaudited consolidated financial statements. For the remainder of fiscal 2025, we anticipate potential combined borrowings under the Revolving Facility and our CP Notes to be a maximum of approximately $400 million outstanding at any one time.\n​\nCurrent Financial Condition / Recent Developments\n​\nOur inventory balance represented approximately 45% of our total assets, exclusive of operating lease assets, goodwill and other intangible assets, as of August 1, 2025. Our ability to effectively manage our inventory balances can have a significant impact on our cash flows from operations during a given fiscal year, as discussed below. Inventory purchases are often somewhat seasonal in nature, such as the purchase of warm-weather or Christmas-related merchandise. Efficient management of our inventory has been and continues to be an area of focus for us.\n​\nFrom time to time, we are involved in various legal matters as discussed in Note 7 to the unaudited consolidated financial statements, some of which could potentially result in material cash payments. Adverse developments in these matters could materially and adversely affect our liquidity. \n​\nOur current credit ratings, as well as future rating agency actions, could (i) impact our ability to finance our operations on satisfactory terms; (ii) affect our financing costs; and (iii) affect our insurance premiums and collateral requirements necessary for our self-insured programs. There can be no assurance that we will maintain or improve our current credit ratings, particularly, if we are unable to lower our leverage ratios to levels and within time frames deemed acceptable to the rating agencies. The credit ratings for our borrowings are as follows:\n​\n​\n​\n​\nRating Agency\n​\nSenior unsecured debt rating\n​\nCommercial paper rating\n​\nOutlook\nMoody’s\n​\nBaa3\n​\nP-3\n​\nStable outlook\nStandard & Poor’s\n​\nBBB\n​\nA-2\n​\nNegative outlook\n​\nChanges in Cash Flows\n​\nUnless otherwise noted, all references to the 2025 and 2024 periods in the discussion of cash flows from operating, investing and financing activities below refer to the 26-week periods ended August 1, 2025 and August 2, 2024, respectively.\n \n​\nCash flows from operating activities.  \nCash flows from operating activities were $1.8 billion in the 2025 period, which represents a $162.1 million increase compared to the 2024 period. Changes in merchandise inventories resulted in a $44.7 million increase in the 2025 period as compared to a decrease of $23.4 million in the 2024 period as further discussed below. Net income increased $65.8 million in the 2025 period compared to the 2024 period. Changes in accrued expenses resulted in a $167.3 million increase in the 2025 period compared to $109.8 million increase in the 2024 period, due primarily to the timing of accruals and payments for incentive compensation and property taxes. Changes in accounts payable resulted in a $111.2 million increase in the 2025 period compared to a $306.3 million increase in the 2024 period, due primarily to the timing of inventory receipts and related payments. Changes in income taxes in the 2025 period compared to the 2024 period are primarily due to the amount of income tax accrued and timing of payments.\n​\n27\n\n\n​\nOn an ongoing basis, we closely monitor and manage our inventory balances, which may fluctuate from period to period based on new store openings, the timing of purchases, and other factors. Total merchandise inventories decreased 2% in the 2025 period compared to flat in the 2024 period. Percent changes in our four inventory categories for the 2025 period compared to the 2024 period were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n26 Weeks Ended\n​\n​\n​\nAugust 1,\n​\n​\nAugust 2,\n​\nIncrease (decrease)\n    \n2025\n​\n​\n2024\n \nConsumables\n​\n (1)\n%\n​\n -\n%\nSeasonal\n​\n (2)\n​\n​\n 1\n​\nHome products\n​\n (3)\n​\n​\n 2\n​\nApparel\n​\n (4)\n​\n​\n -\n​\n​\nOn a per store basis, inventories at August 1, 2025, decreased by 7.4% compared to the balances at August 2, 2024.\n​\nCash flows from investing activities\n.  Significant components of property and equipment purchases included the following approximate amounts:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n26 Weeks Ended\n​\n​\n​\nAugust 1,\n​\nAugust 2,\n​\n(amounts in millions, except store count amounts)\n    \n2025\n​\n2024\n \nExisting stores improvements, upgrades, remodels, and relocations\n​\n$\n 365.4\n​\n$\n 255.0\n​\nDistribution and transportation-related capital expenditures\n​\n​\n 151.1\n​\n​\n 198.7\n​\nNew stores primarily for leasehold improvements, fixtures and equipment\n​\n \n 142.8\n​\n \n 216.1\n​\nInformation systems upgrades and technology-related projects\n​\n \n 32.2\n​\n \n 19.6\n​\nOther\n​\n \n 2.4\n​\n \n 6.2\n​\nTotal purchases of property and equipment\n​\n$\n 693.9\n​\n$\n 695.6\n​\n​\n​\n​\n​\n​\n​\n​\n​\nStore Counts\n​\n​\n​\n​\n​\n​\n​\nNew stores\n​\n​\n 360\n​\n​\n 410\n​\nRemodeled or relocated (a)\n​\n​\n 2,586\n​\n​\n 987\n​\n​\n(a) Remodeled store counts include 1,151 stores through Project Renovate and 1,397 stores through Project Elevate.\n​\nThe timing of new, remodeled and relocated store openings along with other factors may affect the relationship between such openings and the related property and equipment purchases in any given period. \n​\nCapital expenditures for 2025 are projected to be approximately $1.3 billion to $1.4 billion. We anticipate funding 2025 capital requirements with a combination of some or all of the following: existing cash balances, cash flows from operations, availability under our Revolving Facility and/or the issuance of additional CP Notes. We plan to continue to invest in store growth and development of new stores and the remodel or relocation of existing stores, including remodeling stores through Project Renovate and Project Elevate. Capital expenditures in 2025 are anticipated to support our store growth as well as our remodel and relocation initiatives, including capital outlays for leasehold improvements, fixtures and equipment; the construction of new stores; costs to support and enhance our supply chain initiatives for existing distribution center facilities and replacement of certain transportation related assets; technology initiatives; as well as routine and ongoing capital requirements.\n​\nCash flows from financing activities\n. During the 2025 period, we had repayments of long-term obligations of $509.6 million. During the 2025 and 2024 periods, we paid cash dividends of $259.7 million and $259.5 million, respectively. \n​\nShare Repurchase Program\n​\nAs of August 1, 2025, our common stock repurchase program had a total remaining authorization of approximately $1.38 billion. The authorization allows repurchases from time to time in open market transactions, including pursuant to trading plans adopted in accordance with Rule 10b5-1 of the Securities Exchange Act of 1934, as amended, or in privately negotiated transactions. To preserve our investment grade credit rating and maintain financial \n28\n\n\n​\nflexibility, we did not repurchase any shares under this program in the first quarter of 2025 and do not plan to repurchase shares during the remainder of the year. The repurchase authorization has no expiration date, and future repurchases will depend on a variety of factors, including price, market conditions, compliance with the covenants and restrictions under our debt agreements, cash requirements, excess debt capacity, results of operations, financial condition and other factors. The repurchase program may be modified or terminated from time to time at the discretion of our Board of Directors. For more about our share repurchase program, see Note 9 to the unaudited consolidated financial statements contained in Part I, Item 1 of this report.\n​"
}