{
  "source_file": "dhi-20250630.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and related notes included in this quarterly report and with our annual report on Form 10-K for the fiscal year ended September 30, 2024. Some of the information contained in this discussion and analysis constitutes forward-looking statements that involve risks and uncertainties. Actual results could differ materially from those discussed in these forward-looking statements. Factors that could cause or contribute to these differences include, but are not limited to, those described in the “Forward-Looking Statements” section following this discussion.\nBUSINESS\nD.R. Horton, Inc. is the largest homebuilding company in the United States as measured by number of homes closed. We construct and sell homes through our operating divisions in 126 markets across 36 states. Our common stock is included in the S&P 500 Index and listed on the New York Stock Exchange and NYSE Texas under the ticker symbol “DHI.” Our listing on NYSE Texas became effective in June 2025. Unless the context otherwise requires, the terms “D.R. Horton,” the “Company,” “we” and “our” used herein refer to D.R. Horton, Inc., a Delaware corporation, and its predecessors and subsidiaries.\nOur business operations consist of homebuilding, rental, a majority-owned residential lot development company, financial services and other activities. Our homebuilding operations are our core business and primarily include the construction and sale of single-family homes with sales prices generally ranging from $250,000 to more than $1,000,000, with an average closing price of $372,200 during the nine months ended June 30, 2025. Approximately 84% of our home sales revenue in the nine months ended June 30, 2025 was generated from the sale of single-family detached homes, with the remainder from the sale of attached homes, such as townhomes and duplexes.\nWe have closed more than 1.2 million homes during our 46-year history, and we have been the largest volume homebuilder in the United States every year since 2002. Our product offerings include a broad range of homes for entry-level, move-up, active adult and luxury buyers. \nOur rental segment consists of single-family and multi-family rental operations. The single-family rental operations construct and lease single-family homes within a community and then generally market each community for a bulk sale of rental homes. The multi-family rental operations develop, construct, lease and sell residential rental properties, the majority of which are apartment communities.\nAt June 30, 2025, we owned 62% of the outstanding shares of Forestar Group Inc. (Forestar), a publicly traded residential lot development company listed on the New York Stock Exchange and NYSE Texas under the ticker symbol “FOR.” Forestar operates across many of our homebuilding operating markets and is a key part of our homebuilding strategy to maintain relationships with land developers and to control a large portion of our land and lot position through land purchase contracts.\nOur financial services operations provide mortgage financing and title agency services to homebuyers in many of our homebuilding markets. DHI Mortgage, our wholly owned subsidiary, provides mortgage financing services primarily to our homebuyers and sells substantially all of the mortgages it originates and the related servicing rights to third-party purchasers after origination. Our wholly owned subsidiary title companies serve as title insurance agents by providing title insurance policies, examination, underwriting and closing services primarily to our homebuilding customers.\nIn addition to our homebuilding, rental, Forestar and financial services operations, we engage in other business activities through our subsidiaries. We conduct insurance-related operations, own water rights and other water-related assets and own non-residential real estate including ranch land and improvements. The results of these operations are immaterial for separate reporting and therefore are grouped together and presented as other.\n28\nTable of Contents\nOVERVIEW\nDuring the nine months ended June 30, 2025, our number of homes closed and our home sales revenues decreased 7% and 8%, respectively, compared to the prior year period, and our consolidated revenues decreased 8% to $24.6 billion compared to $26.8 billion. Our pre-tax income was $3.5 billion in the nine months ended June 30, 2025 compared to $4.6 billion in the prior year period, and our pre-tax operating margin was 14.4% compared to 17.1%. Net income was $2.7 billion in the nine months ended June 30, 2025 compared to $3.5 billion in the prior year period, and our diluted earnings per share were $8.53 compared to $10.43.\nIn the trailing twelve months ended June 30, 2025, our return on equity (ROE) was 16.1% compared to 21.5% in the prior year period, and our return on assets (ROA) was 11.1% compared to 14.8%. ROE is calculated as net income attributable to D.R. Horton for the trailing twelve months divided by average stockholders’ equity, where average stockholders’ equity is the sum of ending stockholders’ equity balances for the trailing five quarters divided by five. ROA is calculated as net income attributable to D.R. Horton for the trailing twelve months divided by average consolidated assets, where average consolidated assets is the sum of total asset balances for the trailing five quarters divided by five.\nDuring the third quarter, new home demand continued to be impacted by uncertainty among potential homebuyers due to ongoing affordability constraints and cautious consumer sentiment. As a result, the value of our net sales orders and homebuilding revenues in the third quarter decreased 3% and 7%, respectively, from the prior year quarter, and our home sales gross margin decreased to 21.8% as we increased sales incentives such as buydowns of mortgage rates for our homebuyers. We strive to remain well-positioned with affordable product offerings and a flexible lot supply and will continue to manage our home pricing, sales incentives and number of homes in inventory based on the level of new home demand in each of our local markets. We expect to maintain an elevated level of incentives to support demand and may increase them further, depending on market conditions and changes in mortgage interest rates.\nWe remain focused on our relationships with land developers across the country in order to maximize returns and capital efficiency\n. \nWithin our homebuilding land and lot portfolio, lots controlled through purchase contracts represented 76% of the lots owned and controlled at June 30, 2025, September 30, 2024 and June 30, 2024. We continue to prioritize the purchase of finished lots from Forestar and other land developers when possible. During the nine months ended June 30, 2025, 65% of the homes we closed were on lots developed by either Forestar or a third party. \nWe believe our strong balance sheet and liquidity provide us with the flexibility to operate effectively through changing economic conditions. We plan to generate strong cash flows from our operations and manage our product offerings, incentives, home pricing, sales pace and inventory levels to optimize the return on our inventory investments in each of our communities based on local housing market conditions.\n29\nTable of Contents\nSTRATEGY\nOur operating strategy focuses on consistently enhancing long-term value to our shareholders by leveraging our financial and competitive positions to maximize the returns on our inventory investments and generate strong profits and cash flows from operations, while managing risk and maintaining financial flexibility to navigate changing economic conditions. Our strategy includes the following initiatives:\n•\nDeveloping and retaining highly experienced and productive teams of personnel throughout our company that are aligned and focused on continuous improvement in our operational execution and financial performance.\n•\nMaintaining a significant cash balance and strong overall liquidity position while controlling our level of debt.\n•\nAllocating and actively managing our inventory investments across our operating markets to diversify our geographic risk.\n•\nOffering new home communities that appeal to a broad range of entry-level, move-up, active adult and luxury homebuyers based on consumer demand in each market.\n•\nModifying product offerings, sales pace, home prices and incentives as necessary in each of our markets to meet consumer demand and maintain affordability.\n•\nDelivering high quality homes and a positive experience to our customers both during and after the sale.\n•\nManaging our inventory of homes under construction relative to demand in each of our markets, including starting construction on unsold homes to capture new home demand and actively controlling the number of unsold, completed homes in inventory.\n•\nInvesting in lots, land and land development in desirable markets, while controlling the level of land and lots we own in each market relative to the local new home demand.\n•\nControlling a significant portion of our land and finished lot position through purchase contracts and prioritizing the purchase of finished lots from Forestar and other land developers when possible.\n•\nControlling the cost of labor and goods provided by subcontractors and vendors.\n•\nImproving the efficiency of our land development, construction, sales and other key operational activities.\n•\nControlling our selling, general and administrative (SG&A) expense infrastructure to match production levels.\n•\nEnsuring that our financial services business provides high quality mortgage and title services to homebuyers efficiently and effectively.\n•\nInvesting in our rental operations to meet rental demand in high growth suburban markets and selling these properties profitably.\n•\nOpportunistically evaluating potential acquisitions to enhance our operating platform.\nWe believe our operating strategy, which has produced positive results in recent years, will allow us to successfully operate through changing economic conditions and maintain our strong financial performance and competitive position. However, we cannot provide any assurances that the initiatives listed above will continue to be successful, and we may need to adjust parts of our strategy to meet future market conditions.\n30\nTable of Contents\nKEY RESULTS\nKey financial results as of and for the three months ended June 30, 2025, as compared to the same period of 2024 unless otherwise indicated, were as follows:\nConsolidated Results:\n•\nConsolidated revenues decreased 7% to $9.2 billion compared to $10.0 billion.\n•\nConsolidated pre-tax income decreased 25% to $1.4 billion compared to $1.8 billion.\n•\nConsolidated pre-tax income was 14.7% of consolidated revenues compared to 18.1%.\n•\nIncome tax expense was $325.0 million compared to $432.2 million, and our effective tax rate was 23.9% compared to 24.0%.\n•\nNet income attributable to D.R. Horton decreased 24% to $1.0 billion compared to $1.4 billion.\n•\nDiluted net income per common share attributable to D.R. Horton decreased 18% to $3.36 compared to $4.10.\n•\nStockholders’ equity was $24.1 billion compared to $25.3 billion and $24.7 billion at September 30, 2024 and June 30, 2024, respectively.\n•\nBook value per common share increased to $80.46 compared to $78.12 and $75.32 at September 30, 2024 and June 30, 2024, respectively.\n•\nDebt to total capital was 23.2% compared to 18.9% and 18.8% at September 30, 2024 and June 30, 2024, respectively. Net debt to total capital was 16.2% compared to 5.2% and 9.9% at September 30, 2024 and June 30, 2024, respectively.\nHomebuilding:\n•\nHomebuilding revenues decreased 7% to $8.6 billion compared to $9.2 billion.\n•\nHomes closed decreased 4% to 23,160 homes, and the average closing price of those homes decreased 3% to $369,600.\n•\nNet sales orders of 23,071 homes were essentially flat, and the value of net sales orders decreased 3% to $8.4 billion.\n•\nSales order backlog decreased 16% to 14,075 homes, and the value of sales order backlog decreased 19% to $5.3 billion.\n•\nHome sales gross margin was 21.8% compared to 24.0%.\n•\nHomebuilding SG&A expense was 7.8% of homebuilding revenues compared to 7.1%.\n•\nHomebuilding pre-tax income decreased 25% to $1.2 billion compared to $1.6 billion.\n•\nHomebuilding pre-tax income was 13.8% of homebuilding revenues compared to 17.0%.\n•\nHomebuilding cash and cash equivalents totaled $2.0 billion compared to $3.6 billion and $2.2 billion at September 30, 2024 and June 30, 2024, respectively.\n•\nHomebuilding inventories totaled $21.1 billion compared to $20.0 billion and $20.5 billion at September 30, 2024 and June 30, 2024, respectively.\n•\nHomes in inventory totaled 38,400 compared to 37,400 and 42,600 at September 30, 2024 and June 30, 2024, respectively.\n31\nTable of Contents\n•\nOwned lots totaled 145,900 compared to 152,500 and 150,900 at September 30, 2024 and June 30, 2024, respectively. Lots controlled through purchase contracts totaled 455,500 compared to 480,400 and 479,300 at September 30, 2024 and June 30, 2024, respectively.\n•\nHomebuilding debt was $3.7 billion compared to $2.9 billion and $2.3 billion at September 30, 2024 and June 30, 2024, respectively.\nRental:\n•\nRental revenues were $380.7 million compared to $413.7 million.\n•\nRental pre-tax income was $54.8 million compared to $64.2 million.\n•\nRental inventory totaled $3.1 billion compared to $2.9 billion and $3.1 billion at September 30, 2024 and June 30, 2024, respectively.\n•\nSingle-family rental homes closed totaled 1,065 compared to 790.\n•\nMulti-family rental units closed totaled 328 compared to 610.\nForestar:\n•\nForestar’s revenues increased 23% to $390.5 million compared to $318.4 million. Revenues in the current and prior year quarters included $323.7 million and $267.4 million, respectively, of revenue from land and lot sales to our homebuilding segment.\n•\nForestar’s lots sold increased 11% to 3,605 compared to 3,255. Lots sold to D.R. Horton totaled 3,075 compared to 2,903.\n•\nForestar’s pre-tax income was $43.6 million compared to $51.6 million.\n•\nForestar’s pre-tax income was 11.2% of revenues compared to 16.2%.\n•\nForestar’s cash and cash equivalents totaled $189.2 million compared to $481.2 million and $359.2 million at September 30, 2024 and June 30, 2024, respectively.\n•\nForestar’s inventories totaled $2.8 billion compared to $2.3 billion and $2.2 billion at September 30, 2024 and June 30, 2024, respectively.\n•\nForestar’s owned and controlled lots totaled 102,300 compared to 95,100 and 102,100 at September 30, 2024 and June 30, 2024, respectively. Of these lots, 42,700 were under contract to sell to or subject to a right of first offer with D.R. Horton compared to 37,700 and 36,200 at September 30, 2024 and June 30, 2024, respectively.\n•\nForestar’s debt was $872.8 million compared to $706.4 million and $706.1 million at September 30, 2024 and June 30, 2024, respectively.\nFinancial Services:\n•\nFinancial services revenues decreased 6% to $227.8 million compared to $242.3 million.\n•\nFinancial services pre-tax income was $81.3 million compared to $91.3 million.\n•\nFinancial services pre-tax income was 35.7% of financial services revenues compared to 37.7%.\n32\nTable of Contents\nKey financial results for the nine months ended June 30, 2025, as compared to the same period of 2024, were as follows:\nConsolidated Results:\n•\nConsolidated revenues decreased 8% to $24.6 billion compared to $26.8 billion.\n•\nConsolidated pre-tax income decreased 23% to $3.5 billion compared to $4.6 billion.\n•\nConsolidated pre-tax income was 14.4% of consolidated revenues compared to 17.1%.\n•\nIncome tax expense was $831.0 million compared to $1.1 billion, and our effective tax rate was 23.5% compared to 23.4%.\n•\nNet income attributable to D.R. Horton decreased 23% to $2.7 billion compared to $3.5 billion.\n•\nDiluted net income per common share attributable to D.R. Horton decreased 18% to $8.53 compared to $10.43.\n•\nNet cash provided by operations was $949.1 million compared to $228.2 million.\nHomebuilding:\n•\nHomebuilding revenues decreased 8% to $23.0 billion compared to $25.0 billion.\n•\nHomes closed decreased 7% to 61,495 homes, and the average closing price of those homes decreased 2% to $372,200.\n•\nNet sales orders decreased 6% to 63,345 homes, and the value of net sales orders decreased 8% to $23.4 billion.\n•\nHome sales gross margin was 22.1% compared to 23.4%.\n•\nHomebuilding SG&A expense was 8.5% of homebuilding revenues compared to 7.5%.\n•\nHomebuilding pre-tax income decreased 22% to $3.1 billion compared to $4.0 billion.\n•\nHomebuilding pre-tax income was 13.7% of homebuilding revenues compared to 16.1%.\n•\nNet cash provided by homebuilding operations was $1.7 billion compared to $971.9 million.\nRental:\n•\nRental revenues were $835.0 million compared to $980.2 million.\n•\nRental pre-tax income was $89.4 million compared to $128.8 million.\n•\nSingle-family rental homes closed totaled 1,895 compared to 2,278.\n•\nMulti-family rental units closed totaled 1,132 compared to 1,334.\nForestar:\n•\nForestar’s revenues increased 4% to $991.9 million compared to $958.0 million. Revenues in the current and prior year periods included $810.0 million and $851.3 million, respectively, of revenue from land and lot sales to our homebuilding segment.\n•\nForestar’s lots sold decreased 4% to 9,349 compared to 9,694. Lots sold to D.R. Horton totaled 7,688 compared to 8,842.\n•\nForestar’s pre-tax income decreased 34% to $106.2 million compared to $161.6 million.\n•\nForestar’s pre-tax income was 10.7% of revenues compared to 16.9%.\nFinancial Services:\n•\nFinancial services revenues decreased 6% to $623.0 million compared to $660.5 million.\n•\nFinancial services pre-tax income decreased 14% to $203.0 million compared to $235.3 million.\n•\nFinancial services pre-tax income was 32.6% of financial services revenues compared to 35.6%.\n33\nTable of Contents\nRESULTS OF OPERATIONS - HOMEBUILDING\nWe conduct our homebuilding operations in the geographic regions, states and markets listed below. Our homebuilding operating divisions are aggregated into six reporting segments, also referred to as reporting regions, which comprise the markets below. Our financial statements and the notes thereto contain additional information regarding segment performance.\nState\nReporting Region/Market\nState\nReporting Region/Market\nState\nReporting Region/Market\nNorthwest Region\nSoutheast Region\nNorth Region\nColorado\nColorado Springs\nAlabama\nBaldwin County\nDelaware\nNorthern Delaware\nDenver\nBirmingham\nSouthern Delaware\nFort Collins\nHuntsville\nIllinois\nChicago\nOregon\nBend\nMobile\nIndiana\nFort Wayne\nEugene/Springfield\nMontgomery\nIndianapolis\nMedford\nTuscaloosa\nNorthwest Indiana\nPortland/Salem\nFlorida\nFort Myers/Naples\nIowa\nDes Moines\nUtah\nSalt Lake City/Provo/Ogden\nGainesville\nIowa City/Cedar Rapids\nSt. George\nJacksonville\nKansas/Missouri\nKansas City\nWashington\nBremerton\nLakeland\nKentucky\nLouisville\nCentral Washington\nMelbourne/Vero Beach\nMaryland\nBaltimore\nKennewick/Pasco/Richland\nMiami/Fort Lauderdale\nEastern Maryland\nSeattle/Tacoma/Everett/Olympia\nOcala\nSuburban Washington, D.C.\nSpokane\nOrlando\nWestern Maryland\nVancouver\nPanama City\nMinnesota\nMinneapolis/St. Paul\nPensacola\nNebraska\nOmaha\nSouthwest Region\nPort St. Lucie\nNew Jersey\nNorthern New Jersey\nArizona\nPhoenix\nTallahassee\nSouthern New Jersey\nTucson\nTampa/Sarasota\nOhio\nCincinnati/Dayton\nCalifornia\nBakersfield\nVolusia County\nColumbus\nBay Area\nWest Palm Beach\nPennsylvania\nCentral Pennsylvania\nFresno/Tulare\nLouisiana\nBaton Rouge\nPhiladelphia\nLos Angeles County\nLake Charles/Lafayette\nPittsburgh\nModesto/Merced/Stockton\nMississippi\nGulf Coast\nVirginia\nNorthern Virginia\nRedding/Chico/Yuba City\nHattiesburg\nRichmond\nRiverside County\nJackson\nVirginia Beach/Williamsburg\nSacramento\nWestern Virginia\nSan Bernardino County\nEast Region\nWest Virginia\nEastern West Virginia\nHawaii\nOahu\nGeorgia\nAtlanta\nNorthern West Virginia\nNevada\nLas Vegas\nAugusta\nWisconsin\nSoutheast Wisconsin\nReno\nCentral Georgia\nNew Mexico\nAlbuquerque\nSavannah/Brunswick\nSanta Fe\nValdosta\nNorth Carolina\nAsheville\nSouth Central Region\nCharlotte\nArkansas\nLittle Rock\nGreensboro/Winston-Salem\nNorthwest Arkansas\nNew Bern/Greenville\nOklahoma\nOklahoma City\nRaleigh/Durham/Fayetteville\nTulsa\nWilmington\nTexas\nAbilene\nSouth Carolina\nCharleston\nAustin\nColumbia\nBeaumont\nGreenville/Spartanburg\nBryan/College Station\nHilton Head\nCorpus Christi\nMyrtle Beach\nDallas\nTennessee\nChattanooga\nEast Texas\nKnoxville\nFort Worth\nMemphis\nHouston\nNashville\nKilleen/Temple/Waco\nNortheast Tennessee\nLubbock\nMidland/Odessa\nNew Braunfels/San Marcos\nSan Antonio\n34\nTable of Contents\nThe following tables and related discussion set forth key operating and financial data for our homebuilding operations by reporting segment as of and for the three and nine months ended June 30, 2025 and 2024.\nNet Sales Orders (1)\nThree Months Ended June 30,\n \nNet Homes Sold\nValue (In millions)\nAverage Selling Price\n \n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nNorthwest\n1,294\n1,458\n(11)\n%\n$\n683.6 \n$\n729.5 \n(6)\n%\n$\n528,300 \n$\n500,300 \n6 \n%\nSouthwest\n2,396\n2,488\n(4)\n%\n1,129.3 \n1,215.3 \n(7)\n%\n471,300 \n488,500 \n(4)\n%\nSouth Central\n6,131\n5,880\n4 \n%\n1,868.0 \n1,917.8 \n(3)\n%\n304,700 \n326,200 \n(7)\n%\nSoutheast\n5,475\n6,089\n(10)\n%\n1,830.1 \n2,165.1 \n(15)\n%\n334,300 \n355,600 \n(6)\n%\nEast\n4,887\n4,546\n8 \n%\n1,696.5 \n1,614.6 \n5 \n%\n347,100 \n355,200 \n(2)\n%\nNorth\n2,888\n2,540\n14 \n%\n1,214.8 \n1,073.4 \n13 \n%\n420,600 \n422,600 \n— \n%\n23,071\n23,001\n— \n%\n$\n8,422.3 \n$\n8,715.7 \n(3)\n%\n$\n365,100 \n$\n378,900 \n(4)\n%\nNine Months Ended June 30,\n \nNet Homes Sold\nValue (In millions)\nAverage Selling Price\n \n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nNorthwest\n3,703\n4,254\n(13)\n%\n$\n1,980.1 \n$\n2,158.4 \n(8)\n%\n$\n534,700 \n$\n507,400 \n5 \n%\nSouthwest\n6,941\n7,719\n(10)\n%\n3,322.4 \n3,762.5 \n(12)\n%\n478,700 \n487,400 \n(2)\n%\nSouth Central\n16,648\n17,733\n(6)\n%\n5,152.2 \n5,759.6 \n(11)\n%\n309,500 \n324,800 \n(5)\n%\nSoutheast\n15,077\n17,875\n(16)\n%\n5,094.2 \n6,360.1 \n(20)\n%\n337,900 \n355,800 \n(5)\n%\nEast\n13,228\n12,825\n3 \n%\n4,579.8 \n4,574.9 \n— \n%\n346,200 \n356,700 \n(3)\n%\nNorth\n7,748\n7,120\n9 \n%\n3,305.8 \n2,952.9 \n12 \n%\n426,700 \n414,700 \n3 \n%\n63,345\n67,526\n(6)\n%\n$\n23,434.5 \n$\n25,568.4 \n(8)\n%\n$\n370,000 \n$\n378,600 \n(2)\n%\nSales Order Cancellations\nThree Months Ended June 30,\n \nCancelled Sales Orders \nValue (In millions)\nCancellation Rate (2)\n \n2025\n2024\n2025\n2024\n2025\n2024\nNorthwest\n220\n223\n$\n127.0 \n$\n122.0 \n15 \n%\n13 \n%\nSouthwest\n435\n449\n216.5 \n214.6 \n15 \n%\n15 \n%\nSouth Central\n1,206\n1,188\n399.0 \n399.7 \n16 \n%\n17 \n%\nSoutheast\n1,307\n1,530\n450.7 \n554.9 \n19 \n%\n20 \n%\nEast\n1,051\n1,010\n367.4 \n358.0 \n18 \n%\n18 \n%\nNorth\n618\n623\n259.1 \n256.5 \n18 \n%\n20 \n%\n4,837\n5,023\n$\n1,819.7 \n$\n1,905.7 \n17 \n%\n18 \n%\nNine Months Ended June 30,\n \nCancelled Sales Orders \nValue (In millions)\nCancellation Rate (2)\n \n2025\n2024\n2025\n2024\n2025\n2024\nNorthwest\n582\n656\n$\n336.2 \n$\n344.3 \n14 \n%\n13 \n%\nSouthwest\n1,212\n1,326\n612.0 \n637.7 \n15 \n%\n15 \n%\nSouth Central\n3,227\n3,456\n1,057.4 \n1,158.4 \n16 \n%\n16 \n%\nSoutheast\n3,482\n4,111\n1,201.8 \n1,492.0 \n19 \n%\n19 \n%\nEast\n2,759\n2,759\n974.4 \n979.3 \n17 \n%\n18 \n%\nNorth\n1,759\n1,574\n739.7 \n643.7 \n19 \n%\n18 \n%\n13,021\n13,882\n$\n4,921.5 \n$\n5,255.4 \n17 \n%\n17 \n%\n ________________________\n(1)\nNet sales orders represent the number and dollar value of new sales contracts executed with customers (gross sales orders), net of cancelled sales orders.\n(2)\nCancellation rate represents the number of cancelled sales orders divided by gross sales orders.\n35\nTable of Contents\nNet Sales Orders\nThe value of net sales orders was $8.4 billion (23,071 homes) and $23.4 billion (63,345 homes) for the three and nine months ended June 30, 2025, respectively, compared to $8.7 billion (23,001 homes) and $25.6 billion (67,526 homes) in the prior year periods. The decrease in value in the three month period was attributable to a 4% decrease in the average selling price, while sales order volume increased slightly. The decrease in value in the nine month period was primarily attributable to a 6% decrease in sales order volume, along with a 2% decrease in the average selling price.\nIn regions where sales order volume decreased, the markets contributing most to the decrease in the three month period were the Salt Lake City market in the Northwest, the Phoenix market in the Southwest and the Florida markets in the Southeast. In regions where sales order volume increased, the markets contributing most to the increase were the Houston market in the South Central, the North Carolina markets in the East and the New Jersey and Chicago markets in the North.\nIn regions where sales order volume decreased, the markets contributing most to the decrease in the nine month period were the Salt Lake City market in the Northwest, the Phoenix and California markets in the Southwest, the Dallas and Fort Worth markets in the South Central and the Florida markets (particularly Tampa and Jacksonville) in the Southeast. In regions where sales order volume increased, the markets contributing most to the increase were the North Carolina markets in the East and the New Jersey and Chicago markets in the North.\nDuring the third quarter, new home demand continued to be impacted by uncertainty among potential homebuyers due to ongoing affordability constraints and cautious consumer sentiment. We remain well-positioned with affordable product offerings and a flexible lot supply and will continue to manage our home pricing, sales incentives and number of homes in inventory based on the level of new home demand in each of our local markets.\nSales Order Backlog\nAs of June 30,\n \nHomes in Backlog\nValue (In millions)\nAverage Selling Price\n \n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nNorthwest\n689\n764\n(10)\n%\n$\n372.0 \n$\n402.2 \n(8)\n%\n$\n539,900 \n$\n526,400 \n3 \n%\nSouthwest\n1,218\n1,570\n(22)\n%\n576.3 \n795.9 \n(28)\n%\n473,200 \n506,900 \n(7)\n%\nSouth Central\n3,459\n4,037\n(14)\n%\n1,091.2 \n1,354.8 \n(19)\n%\n315,500 \n335,600 \n(6)\n%\nSoutheast\n2,833\n4,410\n(36)\n%\n974.1 \n1,642.4 \n(41)\n%\n343,800 \n372,400 \n(8)\n%\nEast\n3,465\n3,817\n(9)\n%\n1,255.7 \n1,409.2 \n(11)\n%\n362,400 \n369,200 \n(2)\n%\nNorth\n2,411\n2,194\n10 \n%\n1,068.8 \n949.5 \n13 \n%\n443,300 \n432,800 \n2 \n%\n14,075\n16,792\n(16)\n%\n$\n5,338.1 \n$\n6,554.0 \n(19)\n%\n$\n379,300 \n$\n390,300 \n(3)\n%\nSales Order Backlog\nSales order backlog represents homes under contract but not yet closed at the end of the period. Many of the contracts in our sales order backlog are subject to contingencies, including mortgage loan approval and buyers selling their existing homes, which can result in cancellations. A portion of the contracts in backlog will not result in closings due to cancellations.\n36\nTable of Contents\nHomes Closed and Home Sales Revenue\nThree Months Ended June 30,\n \nHomes Closed\nValue (In millions)\nAverage Selling Price\n \n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nNorthwest\n1,270\n1,427\n(11)\n%\n$\n698.8 \n$\n720.7 \n(3)\n%\n$\n550,200 \n$\n505,000 \n9 \n%\nSouthwest\n2,396\n2,673\n(10)\n%\n1,166.2 \n1,313.7 \n(11)\n%\n486,700 \n491,500 \n(1)\n%\nSouth Central\n6,239\n6,104\n2 \n%\n1,938.2 \n2,009.0 \n(4)\n%\n310,700 \n329,100 \n(6)\n%\nSoutheast\n5,682\n6,669\n(15)\n%\n1,923.2 \n2,415.9 \n(20)\n%\n338,500 \n362,300 \n(7)\n%\nEast\n4,835\n4,748\n2 \n%\n1,668.3 \n1,709.0 \n(2)\n%\n345,000 \n359,900 \n(4)\n%\nNorth\n2,738\n2,534\n8 \n%\n1,166.3 \n1,062.9 \n10 \n%\n426,000 \n419,500 \n2 \n%\n23,160\n24,155\n(4)\n%\n$\n8,561.0 \n$\n9,231.2 \n(7)\n%\n$\n369,600 \n$\n382,200 \n(3)\n%\nNine Months Ended June 30,\n \nHomes Closed\nValue (In millions)\nAverage Selling Price\n \n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nNorthwest\n3,549\n4,037\n(12)\n%\n$\n1,892.3 \n$\n2,034.3 \n(7)\n%\n$\n533,200 \n$\n503,900 \n6 \n%\nSouthwest\n6,937\n7,556\n(8)\n%\n3,369.7 \n3,647.8 \n(8)\n%\n485,800 \n482,800 \n1 \n%\nSouth Central\n15,943\n17,323\n(8)\n%\n4,954.7 \n5,631.4 \n(12)\n%\n310,800 \n325,100 \n(4)\n%\nSoutheast\n15,339\n18,281\n(16)\n%\n5,255.5 \n6,591.3 \n(20)\n%\n342,600 \n360,600 \n(5)\n%\nEast\n12,507\n12,389\n1 \n%\n4,336.5 \n4,418.1 \n(2)\n%\n346,700 \n356,600 \n(3)\n%\nNorth\n7,220\n6,457\n12 \n%\n3,079.2 \n2,651.3 \n16 \n%\n426,500 \n410,600 \n4 \n%\n61,495\n66,043\n(7)\n%\n$\n22,887.9 \n$\n24,974.2 \n(8)\n%\n$\n372,200 \n$\n378,200 \n(2)\n%\nHome Sales Revenue\nRevenues from home sales were $8.6 billion (23,160 homes closed) and $22.9 billion (61,495 homes closed) for the three and nine months ended June 30, 2025, respectively, compared to $9.2 billion (24,155 homes closed) and $25.0 billion (66,043 homes closed) in the prior year periods. The decrease in revenues in both periods was primarily attributable to a decrease in the number of homes closed and a decrease in the average selling price.\nThe number of homes closed decreased 4% and 7% in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods. In regions where home closings volume decreased, the markets contributing most were the Salt Lake City market in the Northwest, the Phoenix and California markets in the Southwest, the Dallas, Fort Worth and Austin markets in the South Central and the Florida markets (particularly Tampa and Jacksonville) in the Southeast. The markets contributing most to the increase in closings volume in the North were the suburban Washington, D.C., Chicago and New Jersey markets.\n37\nTable of Contents\nHomebuilding Operating Margin Analysis\n \nPercentages of Related Revenues\n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n \n2025\n2024\n2025\n2024\nGross profit – home sales\n21.8 \n%\n24.0 \n%\n22.1 \n%\n23.4 \n%\nGross profit – land/lot sales and other\n14.1 \n%\n45.6 \n%\n46.6 \n%\n38.8 \n%\nInventory and land option charges\n(0.6)\n%\n(0.1)\n%\n(0.4)\n%\n(0.1)\n%\nGross profit – total homebuilding\n21.2 \n%\n23.9 \n%\n21.8 \n%\n23.3 \n%\nSelling, general and administrative expense\n7.8 \n%\n7.1 \n%\n8.5 \n%\n7.5 \n%\nOther (income) expense\n(0.4)\n%\n(0.2)\n%\n(0.4)\n%\n(0.3)\n%\nHomebuilding pre-tax income\n13.8 \n%\n17.0 \n%\n13.7 \n%\n16.1 \n%\nHome Sales Gross Profit\nGross profit from home sales decreased to $1.9 billion in the three months ended June 30, 2025 from $2.2 billion in the prior year period and decreased 220 basis points to 21.8% as a percentage of home sales revenues. The 220 basis point decrease was primarily due to the average cost of our homes closed increasing along with a decrease in the average selling price of those homes.\nGross profit from home sales decreased to $5.1 billion in the nine months ended June 30, 2025 from $5.8 billion in the prior year period and decreased 130 basis points to 22.1% as a percentage of home sales revenues. The 130 basis point decrease was primarily due to the average cost of our homes closed increasing along with a decrease in the average selling price of those homes.\nWe remain focused on managing the pricing, incentives and sales pace in each of our communities to optimize the returns on our inventory investments and adjust to local market conditions and new home demand. To adjust to changes in market conditions during recent years, we have used a higher level of incentives and reduced home prices and sizes of our home offerings where necessary to provide better affordability to homebuyers. We expect our incentive levels to stay elevated and increase further, depending on market conditions and changes in mortgage interest rates.\nLand/Lot Sales and Other Revenues\nLand/lot sales and other revenues from our homebuilding operations were $19.8 million and $63.1 million in the three and nine months ended June 30, 2025, respectively, and $10.3 million and $37.6 million in the prior year periods. \nWe continually evaluate our land and lot supply, and fluctuations in revenues and profitability from land sales occur based on how we manage our inventory levels in various markets. We generally purchase land and lots with the intent to build and sell homes on them. However, some of the land that we purchase includes commercially zoned parcels that we may sell to commercial developers. We may also sell residential lots or land parcels to manage our supply or for other strategic reasons. As of June 30, 2025, our homebuilding operations had $29.8 million of land held for sale that we expect to sell in the next twelve months.\nInventory and Land Option Charges\nAt the end of each quarter, we review the performance and outlook for all of our communities and land inventories for indicators of potential impairment and perform detailed impairment evaluations and analyses when necessary. As a result of this review, there were $15.9 million and $23.3 million of impairment charges recorded in our homebuilding segment during the three and nine months ended June 30, 2025, respectively. There were no impairment charges recorded in the prior year quarter and $5.6 million of impairment charges recorded in the nine months ended June 30, 2024.\n38\nTable of Contents\nAs we manage our inventory investments across our operating markets to optimize returns and cash flows, we may modify our pricing and incentives, construction and development plans or land sale strategies in individual active communities and land held for development, which could result in the affected communities being evaluated for potential impairment. If the housing market or economic conditions are adversely affected for a prolonged period, we may be required to evaluate additional communities for potential impairment. These evaluations could result in impairment charges, which could be significant.\nDuring the three and nine months ended June 30, 2025, earnest money and pre-acquisition cost write-offs related to our homebuilding segment’s land purchase contracts that we have terminated or expect to terminate were $36.0 million and $69.9 million, respectively, compared to $12.6 million and $25.6 million in the prior year periods.\nSelling, General and Administrative (SG&A) Expense\nSG&A expense from homebuilding activities increased 2% to $670.0 million and 4% to $1.94 billion in the three and nine months ended June 30, 2025, respectively, from $656.5 million and $1.87 billion in the prior year periods. SG&A expense as a percentage of homebuilding revenues was 7.8% and 8.5% in the three and nine months ended June 30, 2025, respectively, compared to 7.1% and 7.5% in the prior year periods.\nEmployee compensation and related costs were $532.3 million and $1.5 billion in the three and nine months ended June 30, 2025, respectively, compared to $538.6 million and $1.5 billion in the prior year periods. Employee compensation and related costs represented 79% and 78% of SG&A costs in the three and nine months ended June 30, 2025, respectively, compared to 82% in the prior year periods. Our homebuilding operations employed 10,190 and 10,099 people at June 30, 2025 and 2024, respectively.\nWe attempt to control our homebuilding SG&A costs while ensuring that our infrastructure adequately supports our operations; however, we cannot make assurances that we will be able to maintain or improve upon the current SG&A expense as a percentage of revenues.\nInterest Incurred\nWe capitalize interest costs incurred to inventory during active development and construction (active inventory). Capitalized interest is charged to cost of sales as the related inventory is delivered to the buyer. Interest incurred by our homebuilding operations increased 170% to $31.0 million and 104% to $69.8 million in the three and nine months ended June 30, 2025, respectively, compared to $11.5 million and $34.2 million in the prior year periods. The increase was primarily due to increases of 54% and 30% in the average amount of homebuilding debt outstanding in the three and nine months ended June 30, 2025, respectively, as well as increases in the weighted average interest rate of that debt. Interest charged to cost of sales was 0.4% of homebuilding cost of sales (excluding inventory and land option charges) in both the three and nine months ended June 30, 2025 compared to 0.3% and 0.4% in the prior year periods.\nOther Income\nOther income, net of other expenses, included in our homebuilding operations was $36.0 million and $83.0 million in the three and nine months ended June 30, 2025, respectively, compared to $22.7 million and $73.2 million in the prior year periods. Other income consists of interest income and various other types of ancillary income, gains, expenses and losses not directly associated with sales of homes, land and lots. The activities that result in this ancillary income are not significant, either individually or in the aggregate.\n39\nTable of Contents\nHomebuilding Results by Reporting Region\n \n \nThree Months Ended June 30,\n \n2025\n2024\n \nHomebuilding\nRevenues\nHomebuilding\nPre-tax\nIncome (1)\n% of\nRevenues\nHomebuilding\nRevenues\nHomebuilding\nPre-tax\nIncome (1)\n% of\nRevenues\n \n(In millions)\nNorthwest\n$\n698.9 \n$\n116.4 \n16.7 \n%\n$\n725.0 \n$\n121.2 \n16.7 \n%\nSouthwest\n1,182.4 \n152.7 \n12.9 \n%\n1,313.7 \n209.4 \n15.9 \n%\nSouth Central\n1,940.8 \n290.2 \n15.0 \n%\n2,013.0 \n368.7 \n18.3 \n%\nSoutheast\n1,923.5 \n224.6 \n11.7 \n%\n2,417.2 \n404.1 \n16.7 \n%\nEast\n1,668.5 \n230.4 \n13.8 \n%\n1,709.6 \n314.9 \n18.4 \n%\nNorth\n1,166.7 \n172.0 \n14.7 \n%\n1,063.0 \n153.9 \n14.5 \n%\n$\n8,580.8 \n$\n1,186.3 \n13.8 \n%\n$\n9,241.5 \n$\n1,572.2 \n17.0 \n%\n \nNine Months Ended June 30,\n \n2025\n2024\n \nHomebuilding\nRevenues\nHomebuilding\nPre-tax\nIncome (1)\n% of\nRevenues\nHomebuilding\nRevenues\nHomebuilding\nPre-tax\nIncome (1)\n% of\nRevenues\n \n(In millions)\nNorthwest\n$\n1,892.5 \n$\n286.3 \n15.1 \n%\n$\n2,045.0 \n$\n300.0 \n14.7 \n%\nSouthwest\n3,386.2 \n444.4 \n13.1 \n%\n3,648.5 \n515.3 \n14.1 \n%\nSouth Central\n4,958.4 \n719.9 \n14.5 \n%\n5,643.3 \n986.9 \n17.5 \n%\nSoutheast\n5,287.1 \n658.7 \n12.5 \n%\n6,602.6 \n1,095.0 \n16.6 \n%\nEast\n4,343.1 \n596.6 \n13.7 \n%\n4,419.7 \n774.0 \n17.5 \n%\nNorth\n3,083.7 \n428.3 \n13.9 \n%\n2,652.7 \n354.7 \n13.4 \n%\n$\n22,951.0 \n$\n3,134.2 \n13.7 \n%\n$\n25,011.8 \n$\n4,025.9 \n16.1 \n%\n \n____________________\n(1)\nExpenses maintained at the corporate level consist primarily of interest and property taxes, which are capitalized and amortized to cost of sales or expensed directly, and the expenses related to operating our corporate office. The amortization of capitalized interest and property taxes is allocated to each segment based on the segment’s cost of sales, while expenses associated with the corporate office are allocated to each segment based on the segment’s inventory balances.\nNorthwest Region\n — Homebuilding revenues decreased 4% and 7% in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods due to decreases in the number of homes closed, particularly in our Salt Lake City market. The region generated pre-tax income of $116.4 million and $286.3 million in the three and nine months ended June 30, 2025, respectively, compared to $121.2 million and $300.0 million in the prior year periods. Gross profit from home sales as a percentage of home sales revenue (home sales gross profit percentage) decreased by 10 basis points and increased by 160 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods. The increase in the nine month period was primarily due to the average selling price of homes closed increasing by more than the average cost of those homes. As a percentage of homebuilding revenues, SG&A expenses increased by 40 and 110 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to the decrease in homebuilding revenues.\nSouthwest Region\n — Homebuilding revenues decreased 10% and 7% in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to decreases in the number of homes closed, particularly in our Phoenix and California markets. The region generated pre-tax income of $152.7 million and $444.4 million in the three and nine months ended June 30, 2025, respectively, compared to $209.4 million and $515.3 million in the prior year periods. Home sales gross profit percentage decreased by 170 basis points and increased by 10 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods. The decrease in the three month period was primarily due to the average selling price of homes closed decreasing while the average cost of those homes increased slightly. As a percentage of homebuilding revenues, SG&A expenses increased by 90 basis points in both the three and nine months ended June 30, 2025 compared to the prior year periods, primarily due to the decrease in homebuilding revenues.\n40\nTable of Contents\nSouth Central Region\n — Homebuilding revenues decreased 4% and 12% in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to decreases in the number of homes closed in our Dallas, Fort Worth and Austin markets. The region generated pre-tax income of $290.2 million and $719.9 million in the three and nine months ended June 30, 2025, respectively, compared to $368.7 million and $986.9 million in the prior year periods. Home sales gross profit percentage decreased by 260 and 190 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to the average selling price of homes closed decreasing by more than the average cost of those homes. As a percentage of homebuilding revenues, SG&A expenses increased by 50 and 100 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to the decrease in homebuilding revenues.\nSoutheast Region\n — Homebuilding revenues decreased 20% in both the three and nine months ended June 30, 2025 compared to the prior year periods, primarily due to decreases in the number of homes closed, particularly in our Florida markets. The region generated pre-tax income of $224.6 million and $658.7 million in the three and nine months ended June 30, 2025, respectively, compared to $404.1 million and $1.1 billion in the prior year periods. Home sales gross profit percentage decreased by 300 and 260 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to the average selling price of homes closed decreasing by more than the average cost of those homes. As a percentage of homebuilding revenues, SG&A expenses increased by 110 and 130 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to the decrease in homebuilding revenues.\nEast Region\n — Homebuilding revenues decreased 2% in both the three and nine months ended June 30, 2025 compared to the prior year periods. The region generated pre-tax income of $230.4 million and $596.6 million in the three and nine months ended June 30, 2025, respectively, compared to $314.9 million and $774.0 million in the prior year periods. Home sales gross profit percentage decreased by 390 and 280 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to the average selling price of homes closed decreasing while the average cost of those homes increased slightly. As a percentage of homebuilding revenues, SG&A expenses increased by 50 and 80 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to an increase in employee compensation costs.\nNorth Region\n — Homebuilding revenues increased 10% and 16% in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to increases in the number of homes closed, particularly in our suburban Washington, D.C., Chicago and New Jersey markets. The region generated pre-tax income of $172.0 million and $428.3 million in the three and nine months ended June 30, 2025, respectively, compared to $153.9 million and $354.7 million in the prior year periods. Home sales gross profit percentage increased by 60 and 90 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to the average selling price of homes closed increasing by more than the average cost of those homes. As a percentage of homebuilding revenues, SG&A expenses increased by 40 and 50 basis points in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods, primarily due to an increase in employee compensation costs.\n41\nTable of Contents\nHOMEBUILDING INVENTORIES, LAND AND LOT POSITION AND HOMES IN INVENTORY\nWe routinely enter into contracts to purchase land or developed residential lots at predetermined prices on a defined schedule commensurate with planned development or anticipated new home demand. At the time of purchase, the undeveloped land is generally vested with the rights to begin development or construction work, and we plan and coordinate the development of our land into residential lots for use in our homebuilding business. We manage our inventory of owned land and lots and homes under construction relative to demand in each of our markets, including starting construction on unsold homes to capture new home demand and actively controlling the number of unsold, completed homes in inventory.\nOur homebuilding segment’s inventories at June 30, 2025 and September 30, 2024 are summarized as follows:\n \nJune 30, 2025\nConstruction in Progress and \nFinished Homes\nResidential Land/Lots\nDeveloped and Under\nDevelopment\nLand Held \nfor Development\nLand Held \nfor Sale\nTotal Inventory\n(In millions)\nNorthwest\n$\n849.9 \n$\n1,061.8 \n$\n16.0 \n$\n1.2 \n$\n1,928.9 \nSouthwest\n1,174.0 \n2,025.2 \n8.6 \n18.8 \n3,226.6 \nSouth Central\n1,984.2 \n2,228.6 \n0.3 \n— \n4,213.1 \nSoutheast\n1,822.9 \n2,338.0 \n12.6 \n9.2 \n4,182.7 \nEast\n1,891.4 \n2,710.3 \n— \n— \n4,601.7 \nNorth\n1,283.4 \n1,353.5 \n— \n0.2 \n2,637.1 \nCorporate and unallocated \n(1)\n136.6 \n170.6 \n0.5 \n0.4 \n308.1 \n \n$\n9,142.4 \n$\n11,888.0 \n$\n38.0 \n$\n29.8 \n$\n21,098.2 \nSeptember 30, 2024\nConstruction in Progress and \nFinished Homes\nResidential Land/Lots\nDeveloped and Under\nDevelopment\nLand Held \nfor Development\nLand Held \nfor Sale\nTotal Inventory\n(In millions)\nNorthwest\n$\n719.6 \n$\n1,215.6 \n$\n— \n$\n— \n$\n1,935.2 \nSouthwest\n1,378.1 \n1,889.3 \n6.8 \n4.7 \n3,278.9 \nSouth Central\n1,701.5 \n2,024.5 \n0.3 \n1.7 \n3,728.0 \nSoutheast\n2,146.9 \n2,124.3 \n13.1 \n0.2 \n4,284.5 \nEast\n1,626.4 \n2,347.3 \n— \n4.5 \n3,978.2 \nNorth\n1,287.6 \n1,262.2 \n— \n1.4 \n2,551.2 \nCorporate and unallocated \n(1)\n126.0 \n148.5 \n0.3 \n0.2 \n275.0 \n \n$\n8,986.1 \n$\n11,011.7 \n$\n20.5 \n$\n12.7 \n$\n20,031.0 \n__________\n(1)\nCorporate and unallocated inventory consists primarily of capitalized interest and property taxes.\n42\nTable of Contents\nOur land and lot position and homes in inventory at June 30, 2025 and September 30, 2024 are summarized as follows:\n \nJune 30, 2025\n \nLand/Lots\nOwned (1)\nLots Controlled\nThrough\nLand and Lot\nPurchase\nContracts (2)(3)\nTotal\nLand/Lots\nOwned and\nControlled\nHomes\nin\nInventory (4)\nNorthwest\n11,100\n17,800\n28,900\n2,300\nSouthwest\n20,300\n30,800\n51,100\n4,000\nSouth Central\n36,400\n116,000\n152,400\n10,500\nSoutheast\n30,400\n114,800\n145,200\n8,100\nEast\n31,500\n116,100\n147,600\n8,500\nNorth\n16,200\n60,000\n76,200\n5,000\n145,900\n455,500\n601,400\n38,400\n24 \n%\n76 \n%\n100 \n%\nSeptember 30, 2024\nLand/Lots\nOwned (1)\nLots Controlled\nThrough\nLand and Lot\nPurchase\nContracts (2)(3)\nTotal\nLand/Lots\nOwned and\nControlled\nHomes\nin\nInventory (4)\nNorthwest\n13,000\n18,600\n31,600\n2,100\nSouthwest\n22,200\n29,200\n51,400\n4,200\nSouth Central\n39,000\n109,600\n148,600\n9,000\nSoutheast\n29,500\n134,300\n163,800\n9,700\nEast\n32,500\n129,300\n161,800\n7,500\nNorth\n16,300\n59,400\n75,700\n4,900\n152,500\n480,400\n632,900\n37,400\n24 \n%\n76 \n%\n100 \n%\n___________________\n(1)\nLand/lots owned included approximately 71,700 and 64,400 owned lots that are fully developed and ready for home construction at June 30, 2025 and September 30, 2024, respectively.\n(2)\nThe total remaining purchase price of lots controlled through land and lot purchase contracts at June 30, 2025 and September 30, 2024 was $25.7 billion and $25.2 billion, respectively, secured by earnest money deposits of $2.3 billion and $2.2 billion, respectively. The total remaining purchase price of lots controlled through land and lot purchase contracts at June 30, 2025 and September 30, 2024 included $2.2 billion and $1.9 billion, respectively, related to lot purchase contracts with Forestar, secured by $223.2 million and $193.3 million, respectively, of earnest money. \n(3)\nLots controlled at June 30, 2025 included approximately 42,700 lots owned by Forestar, 24,200 of which our homebuilding divisions had under contract to purchase and 18,500 of which our homebuilding divisions had a right of first offer to purchase. Of these, approximately 10,500 lots were in our Southeast region, 10,200 lots were in our East region, 8,500 lots were in our South Central region, 6,800 lots were in our North region, 4,200 lots were in our Southwest region and 2,500 lots were in our Northwest region. Lots controlled at September 30, 2024 included approximately 37,700 lots owned by Forestar, 20,500 of which our homebuilding divisions had under contract to purchase and 17,200 of which our homebuilding divisions had a right of first offer to purchase.\n(4)\nApproximately 25,000 and 25,700 of our homes in inventory were unsold at June 30, 2025 and September 30, 2024, respectively. At June 30, 2025, approximately 7,300 of our unsold homes were completed, of which approximately 800 homes had been completed for more than six months. At September 30, 2024, approximately 10,300 of our unsold homes were completed, of which approximately 1,100 homes had been completed for more than six months. Homes in inventory exclude approximately 2,700 and 2,400 model homes at June 30, 2025 and September 30, 2024, respectively.\n43\nTable of Contents\nRESULTS OF OPERATIONS - RENTAL\nOur rental segment consists of single-family and multi-family rental operations. The single-family rental operations construct and lease single-family homes within a community and then generally market each community for a bulk sale of rental homes. The multi-family rental operations develop, construct, lease and sell residential rental properties, with a primary focus on constructing garden style apartment communities in high growth suburban markets. Single-family and multi-family rental property sales are recognized as revenues, and rental income is recognized as other income. The following tables provide further information regarding our rental operations as of and for the three and nine months ended June 30, 2025 and 2024.\nRental Homes/Units Closed and Revenue\nThree Months Ended June 30,\nHomes/Units Closed\nRental Revenue (In millions)\nAverage Selling Price\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nSingle-family\n1,065\n790\n35 \n%\n$\n313.5 \n$\n258.5 \n21 \n%\n294,400\n327,200\n(10)\n%\nMulti-family\n328\n610\n(46)\n%\n66.1 \n155.2 \n(57)\n%\n201,500\n254,400\n(21)\n%\n1,393\n1,400\n(1)\n%\n$\n379.6 \n$\n413.7 \n(8)\n%\n272,500\n295,500\n(8)\n%\nNine Months Ended June 30,\nHomes/Units Closed\nRental Revenue (In millions)\nAverage Selling Price\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nSingle-family\n1,895\n2,278\n(17)\n%\n$\n545.8 \n$\n675.9 \n(19)\n%\n288,000\n296,700\n(3)\n%\nMulti-family\n1,132\n1,334\n(15)\n%\n280.1 \n304.3 \n(8)\n%\n247,400\n228,100\n8 \n%\n3,027\n3,612\n(16)\n%\n$\n825.9 \n$\n980.2 \n(16)\n%\n272,800\n271,400\n1 \n%\nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n2025\n2024\n2025\n2024\n(In millions)\nRevenues\nSingle-family rental\n$\n313.5 \n$\n258.5 \n$\n545.8 \n$\n675.9 \nMulti-family rental and other\n67.2 \n155.2 \n289.2 \n304.3 \nTotal revenues\n380.7 \n413.7 \n835.0 \n980.2 \nCost of sales\nSingle-family rental\n245.2 \n201.0 \n430.1 \n532.6 \nMulti-family rental and other\n50.4 \n118.3 \n227.7 \n230.8 \nInventory and land option charges\n0.4 \n1.5 \n4.3 \n2.2 \nTotal cost of sales\n296.0 \n320.8 \n662.1 \n765.6 \nSelling, general and administrative expense\n61.4 \n55.0 \n165.8 \n163.8 \nOther (income) expense\n(31.5)\n(26.3)\n(82.3)\n(78.0)\nIncome before income taxes\n$\n54.8 \n$\n64.2 \n$\n89.4 \n$\n128.8 \nRental Operating Margin Analysis\nPercentages of Related Revenues\nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n2025\n2024\n2025\n2024\nGross profit — rental\n22.2 \n%\n22.5 \n%\n20.7 \n%\n21.9 \n%\nSelling, general and administrative expense\n16.1 \n%\n13.3 \n%\n19.9 \n%\n16.7 \n%\nOther (income) expense\n(8.3)\n%\n(6.4)\n%\n(9.9)\n%\n(8.0)\n%\nRental pre-tax income\n14.4 \n%\n15.5 \n%\n10.7 \n%\n13.1 \n%\n44\nTable of Contents\nRevenues from our rental operations decreased to $380.7 million and $835.0 million during the three and nine months ended June 30, 2025, respectively, from $413.7 million and $980.2 million in the prior year periods.\nPre-tax income was $54.8 million and $89.4 million during the three and nine months ended June 30, 2025, respectively, compared to $64.2 million and $128.8 million in the prior year periods. The decline in pre-tax income in both periods was primarily due to a decrease in revenues compared to the prior year periods. In the three month period, the revenue decrease was due to fewer multi-family unit closings, combined with a lower average selling price. In the nine month period, the decrease was primarily due to a reduction in overall home and multi-family unit closings.\nAt June 30, 2025, our rental property inventory of $3.1 billion included $667.8 million of inventory related to our single-family rental operations and $2.5 billion of inventory related to our multi-family rental operations. At September 30, 2024, our rental property inventory of $2.9 billion included $800.3 million of inventory related to our single-family rental operations and $2.1 billion of inventory related to our multi-family rental operations. Single-family rental homes and lots and multi-family rental units at June 30, 2025 and September 30, 2024 consisted of the following:\nRental Inventory\nJune 30,\n2025\nSeptember 30,\n2024\nSingle-family rental homes (1)\n2,770\n3,140\nSingle-family rental lots (2)\n1,050\n1,910\nMulti-family rental units (3)\n13,190\n11,960\n__________\n(1)\nSingle-family rental homes at June 30, 2025 consist of 470 homes under construction and 2,300 completed homes compared to 340 homes under construction and 2,800 completed homes at September 30, 2024.\n(2)\nSingle-family rental lots at June 30, 2025 consist of 435 undeveloped lots and 615 finished lots compared to 910 undeveloped lots and 1,000 finished lots at September 30, 2024.\n(3)\nMulti-family rental units at June 30, 2025 consist of 5,560 units under construction and 7,630 units that were substantially complete and in the lease-up phase compared to 7,900 units under construction and 4,060 units that were substantially complete at September 30, 2024.\n45\nTable of Contents\nRESULTS OF OPERATIONS – FORESTAR\nAt June 30, 2025, we owned 62% of the outstanding shares of Forestar. Forestar is a publicly traded residential lot development company with operations in 64 markets across 23 states as of June 30, 2025. (See Note B to the accompanying financial statements for additional Forestar segment information.)\nResults of operations for the Forestar segment for the three and nine months ended June 30, 2025 and 2024 were as follows:\nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n2025\n2024\n2025\n2024\n(In millions)\nTotal revenues\n$\n390.5 \n$\n318.4 \n$\n991.9 \n$\n958.0 \nCost of land/lot sales and other\n308.9 \n246.2 \n774.1 \n729.6 \nInventory and land option charges\n1.9 \n0.7 \n3.9 \n1.0 \nTotal cost of sales\n310.8 \n246.9 \n778.0 \n730.6 \nSelling, general and administrative expense\n37.4 \n29.3 \n111.8 \n86.5 \nOther (income) expense\n(1.3)\n(9.4)\n(4.1)\n(20.7)\nIncome before income taxes\n$\n43.6 \n$\n51.6 \n$\n106.2 \n$\n161.6 \nForestar’s revenues are primarily derived from sales of single-family residential lots to local, regional and national homebuilders and land bankers for homebuilders. The following tables provide further information regarding Forestar’s revenues and lot position as of and for the three and nine months ended June 30, 2025 and 2024:\nThree Months Ended June 30,\nLots Sold\nValue (In millions)\n2025\n2024\n2025\n2024\nResidential single-family lots sold\nLots sold to D.R. Horton\n3,075\n2,903\n$\n323.7 \n$\n265.3 \nTotal lots sold\n3,605\n3,255\n$\n383.0 \n$\n305.8 \nTract acres sold to D.R. Horton\n— \n32\n$\n— \n$\n2.1 \nNine Months Ended June 30,\nLots Sold\nValue (In millions)\n2025\n2024\n2025\n2024\nResidential single-family lots sold\nLots sold to D.R. Horton\n7,688\n8,842\n$\n810.0 \n$\n849.2 \nTotal lots sold\n9,349\n9,694\n$\n977.3 \n$\n935.9 \nTract acres sold to D.R. Horton\n— \n32\n$\n— \n$\n2.1 \nJune 30,\n2025\nSeptember 30,\n2024\nResidential single-family lots in inventory and under contract\nLots owned\n68,300\n57,800\nLots controlled through land purchase contracts\n34,000\n37,300\nTotal lots owned and controlled\n102,300\n95,100\nOwned lots under contract to sell to D.R. Horton\n24,200\n20,500\nOwned lots under contract to customers other than D.R. Horton\n1,500\n500\nTotal owned lots under contract\n25,700\n21,000\nOwned lots subject to right of first offer with D.R. Horton\n18,500\n17,200\nOwned lots fully developed\n10,000\n6,300\n46\nTable of Contents\nAt June 30, 2025 and September 30, 2024, Forestar’s inventory, which includes land and lots developed, under development and held for development, totaled $2.8 billion and $2.3 billion, respectively.\nForestar’s inventory and land option charges consisted of $1.9 million and $3.9 million of earnest money and pre-acquisition cost write-offs in the three and nine months ended June 30, 2025, respectively, compared to $0.7 million and $1.0 million in the prior year periods. There were no impairment charges recorded in the current or prior year periods. \nSG&A expense for the three and nine months ended June 30, 2025 included charges of $1.8 million and $5.4 million, respectively, related to the shared services agreement between Forestar and D.R. Horton whereby D.R. Horton provides Forestar with certain administrative, compliance, operational and procurement services. Shared services charges were $1.4 million and $4.1 million, respectively, in the prior year periods.\nOther expense in the nine months ended June 30, 2025 includes a loss on extinguishment of debt of $1.1 million due to Forestar’s repurchase of $329.4 million of its $400 million principal amount of 3.85% senior notes due 2026 in March 2025.\nThe decline in Forestar’s pre-tax income was primarily due to lower gross margins on lot sales and higher SG&A costs as a percentage of revenues.\n47\nTable of Contents\nRESULTS OF OPERATIONS – FINANCIAL SERVICES\nThe following tables and related discussion set forth key operating and financial data for our financial services operations, comprising DHI Mortgage and our subsidiary title companies, for the three and nine months ended June 30, 2025 and 2024.\n \nThree Months Ended June 30,\nNine Months Ended June 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nNumber of first-lien loans originated or brokered by DHI Mortgage for D.R. Horton homebuyers\n18,855 \n18,807 \n— \n%\n49,488 \n51,990 \n(5)\n%\nNumber of homes closed by D.R. Horton\n23,160 \n24,155 \n(4)\n%\n61,495 \n66,043 \n(7)\n%\nPercentage of D.R. Horton homes financed by DHI Mortgage\n81 \n%\n78 \n%\n80 \n%\n79 \n%\nTotal number of loans originated or brokered by DHI Mortgage\n18,978 \n18,922 \n— \n%\n49,776 \n52,264 \n(5)\n%\nLoans sold by DHI Mortgage to third parties\n18,107 \n19,203 \n(6)\n%\n48,842 \n52,159 \n(6)\n%\n \nThree Months Ended June 30,\nNine Months Ended June 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\n \n(In millions)\nLoan origination and other fees\n$\n23.7 \n$\n26.5 \n(11)\n%\n$\n62.7 \n$\n65.4 \n(4)\n%\nGains on sale of mortgage loans and mortgage servicing rights\n152.8 \n162.6 \n(6)\n%\n423.9 \n444.0 \n(5)\n%\nServicing income\n0.7 \n0.2 \n250 \n%\n1.5 \n3.0 \n(50)\n%\nTotal mortgage operations revenues\n177.2 \n189.3 \n(6)\n%\n488.1 \n512.4 \n(5)\n%\nTitle policy premiums\n50.6 \n53.0 \n(5)\n%\n134.9 \n148.1 \n(9)\n%\nTotal revenues\n227.8 \n242.3 \n(6)\n%\n623.0 \n660.5 \n(6)\n%\nGeneral and administrative expense\n171.0 \n178.0 \n(4)\n%\n485.4 \n500.6 \n(3)\n%\nOther (income) expense\n(24.5)\n(27.0)\n(9)\n%\n(65.4)\n(75.4)\n(13)\n%\nFinancial services pre-tax income\n$\n81.3 \n$\n91.3 \n(11)\n%\n$\n203.0 \n$\n235.3 \n(14)\n%\nFinancial Services Operating Margin Analysis\n \nPercentages of \nFinancial Services Revenues\n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n \n2025\n2024\n2025\n2024\nGeneral and administrative expense\n75.1 \n%\n73.5 \n%\n77.9 \n%\n75.8 \n%\nOther (income) expense\n(10.8)\n%\n(11.1)\n%\n(10.5)\n%\n(11.4)\n%\nFinancial services pre-tax income\n35.7 \n%\n37.7 \n%\n32.6 \n%\n35.6 \n%\n48\nTable of Contents\nMortgage Loan Activity\nDHI Mortgage’s primary focus is to originate loans for our homebuilding operations, and those loan originations account for virtually all of its total loan volume. In the three and nine months ended June 30, 2025, the volume of first-lien loans originated or brokered by DHI Mortgage for our homebuyers was essentially flat in the three month period and decreased 5% in the nine month period, corresponding to the 7% decrease in the number of homes closed by our homebuilding operations. The percentage of homes closed for which DHI Mortgage handled our homebuyers’ financing was 81% and 80% in the three and nine months ended June 30, 2025, respectively, up from 78% and 79% in the prior year periods. These percentages reflect DHI Mortgage’s ongoing efforts to align their business with our homebuilding operations by offering competitive products and pricing.\nThe number of loans sold decreased 6% in both the three and nine months ended June 30, 2025 compared to the respective prior year periods. Virtually all of the mortgage loans held for sale on June 30, 2025 were eligible for sale to the Federal National Mortgage Association (Fannie Mae), the Federal Home Loan Mortgage Corporation (Freddie Mac) or the Government National Mortgage Association (Ginnie Mae). During the nine months ended June 30, 2025, approximately 72% of our mortgage loans were sold directly to Fannie Mae, Freddie Mac or into securities backed by Ginnie Mae, and 26% were sold to one other major financial entity. Changes in market conditions could result in a greater concentration of our mortgage sales in future periods to fewer financial entities and directly to Fannie Mae, Freddie Mac or Ginnie Mae, and we may need to make other adjustments to our mortgage operations.\nFinancial Services Revenues and Expenses\nTotal loan origination volume was essentially flat and decreased 5% in the three and nine months ended June 30, 2025, respectively, compared to the prior year periods. Revenues from our mortgage operations decreased 6% to $177.2 million and 5% to $488.1 million in the three and nine months ended June 30, 2025, respectively, from $189.3 million and $512.4 million in the prior year periods. Revenues from our title operations decreased 5% to $50.6 million and 9% to $134.9 million in the three and nine months ended June 30, 2025, respectively, from $53.0 million and $148.1 million in the prior year periods, due to a decrease in transactions closed through our title operations.\nGeneral and administrative (G&A) expense related to our financial services operations decreased 4% to $171.0 million and 3% to $485.4 million in the three and nine months ended June 30, 2025, respectively, from $178.0 million and $500.6 million in the prior year periods. As a percentage of financial services revenues, G&A expense was 75.1% and 77.9% in the three and nine months ended June 30, 2025, respectively, compared to 73.5% and 75.8% in the prior year periods. Fluctuations in financial services G&A expense as a percentage of revenues can occur because some components of revenue fluctuate differently than loan volumes, and some expenses are not directly related to mortgage loan volume or to changes in the amount of revenue earned. Our financial services operations employed 2,989 and 3,112 people at June 30, 2025 and 2024, respectively.\nOther income, net of other expense, included in our financial services operations consists primarily of the interest income of our mortgage subsidiary. Other income decreased 9% to $24.5 million and 13% to $65.4 million in the three and nine months ended June 30, 2025, respectively, from $27.0 million and $75.4 million in the prior year periods, primarily due to a decrease in interest income on our loan origination volume.\n49\nTable of Contents\nRESULTS OF OPERATIONS - OTHER BUSINESSES\nIn addition to our homebuilding, rental, Forestar and financial services operations, we engage in other business activities through our subsidiaries. We conduct insurance-related operations, own water rights and other water-related assets and own non-residential real estate including ranch land and improvements. The pre-tax income of all of our subsidiaries engaged in other business activities was $5.9 million and $28.6 million in the three and nine months ended June 30, 2025, respectively, compared to $13.7 million and $32.8 million in the prior year periods.\nRESULTS OF OPERATIONS - CONSOLIDATED\nIncome before Income Taxes\nPre-tax income for the three and nine months ended June 30, 2025 was $1.4 billion and $3.5 billion, respectively, compared to $1.8 billion and $4.6 billion in the prior year periods. The decreases were primarily due to a decrease in the pre-tax income of our homebuilding operations.\nIncome Taxes\nOur income tax expense for the three and nine months ended June 30, 2025 was $325.0 million and $831.0 million, respectively, compared to $432.2 million and $1.1 billion in the prior year periods. Our effective tax rate was 23.9% and 23.5% for the three and nine months ended June 30, 2025, respectively, compared to 24.0% and 23.4% in the prior year periods. The effective tax rates for all periods include an expense for state income taxes and tax benefits related to stock-based compensation and federal energy efficient home tax credits.\nOur deferred tax assets, net of deferred tax liabilities, were $81.3 million at June 30, 2025 compared to $182.4 million at September 30, 2024. We have a valuation allowance of $14.8 million and $14.9 million at June 30, 2025 and September 30, 2024, respectively, related to deferred tax assets for state net operating loss (NOL) and tax credit carryforwards that are expected to expire before being realized. We will continue to evaluate both the positive and negative evidence in determining the need for a valuation allowance with respect to our remaining state NOL and tax credit carryforwards. Any reversal of the valuation allowance in future periods will impact our effective tax rate.\nOn July 4, 2025, the One Big Beautiful Bill Act was signed into law (the new law). The new law terminates the energy efficient home tax credit for homes closing after June 30, 2026 and enacts certain other tax provisions that will impact our financial statements. The termination of the energy efficient home tax credit will result in a reduced tax benefit beginning in fiscal 2026. We recognized a tax benefit related to the energy efficient home tax credit of $70.4 million in fiscal 2024 and $30.8 million in the nine months ended June 30, 2025. We are evaluating the impact of other tax provisions within the new law; however, none of the other tax provisions are expected to have a significant impact on our financial statements.\n50\nTable of Contents\nCAPITAL RESOURCES AND LIQUIDITY\nWe have historically funded our operations with cash flows from operating activities, borrowings under bank credit facilities and the issuance of new debt securities. Our current levels of cash, borrowing capacity and balance sheet leverage provide us with the operational flexibility to adjust to changes in economic and market conditions.\nWe continue to invest in our homebuilding and rental inventories to expand our operations and consolidate market share. We are also returning capital to shareholders through repurchases of our common stock and dividend payments. We are maintaining significant homebuilding cash balances and liquidity to support the scale and level of activity in our business and to provide flexibility to adjust to changing market conditions and opportunities.\nAt June 30, 2025, we had outstanding notes payable with varying maturities totaling an aggregate principal amount of $7.3 billion. $2.4 billion was payable within 12 months, including $1.7 billion which is outstanding under our mortgage repurchase facilities, $500 million principal amount of 2.6% homebuilding senior notes maturing in October 2025 and $70.6 million principal amount of 3.85% Forestar senior notes maturing in May 2026. \nAt June 30, 2025, our ratio of debt to total capital (notes payable divided by stockholders’ equity plus notes payable) was 23.2% compared to 18.9% at September 30, 2024 and 18.8% at June 30, 2024. Our net debt to total capital (notes payable net of cash divided by stockholders’ equity plus notes payable net of cash) was 16.2% at June 30, 2025 compared to 5.2% at September 30, 2024 and 9.9% at June 30, 2024. Over the long term, we intend to maintain our ratio of debt to total capital around 20%.\nAt June 30, 2025, we had outstanding letters of credit of $281.5 million and surety bonds of $3.4 billion issued by third parties to secure performance under various contracts. We expect that our performance obligations secured by these letters of credit and bonds will generally be completed in the ordinary course of business and in accordance with the applicable contractual terms. When we complete our performance obligations, the related letters of credit and bonds are generally released shortly thereafter, leaving us with no continuing obligations. We have no material third-party guarantees.\nWe regularly assess our projected capital requirements to fund growth in our business, repay debt obligations, pay dividends, repurchase our common stock and maintain sufficient cash and liquidity levels to support our other operational needs, and we regularly evaluate our opportunities to raise additional capital. D.R. Horton has an automatically effective universal shelf registration statement filed with the Securities and Exchange Commission (SEC) in July 2024, registering debt and equity securities that may be issued from time to time in amounts to be determined. Forestar also has an effective shelf registration statement filed with the SEC in September 2024, registering $750 million of equity securities, of which $300 million is reserved for sales under its at-the-market equity offering (ATM) program that was entered into in November 2024. As market conditions permit, we may issue new debt or equity securities through the capital markets or obtain additional bank financing to fund our projected capital requirements or provide additional liquidity. We believe that our existing cash resources, revolving credit facilities, mortgage repurchase facilities and ability to access the capital markets or obtain additional bank financing will provide sufficient liquidity to fund our near-term working capital needs and debt obligations for the next 12 months and for the foreseeable future thereafter.\nCapital Resources - Homebuilding\nCash and Cash Equivalents\n — At June 30, 2025, cash and cash equivalents of our homebuilding segment totaled $2.0 billion.\nBank Credit Facility\n — We have a senior unsecured homebuilding revolving credit facility that was amended in December 2024 to increase its capacity from $2.19 billion to $2.23 billion. The facility includes an uncommitted accordion feature that allows for an increase in its size to $3.0 billion, subject to certain conditions and availability of additional bank commitments. In June 2025, we utilized this accordion feature, increasing the facility’s size to $2.305 billion through an additional commitment. Of the total commitments, $2.04 billion mature on December 18, 2029, and $265 million mature on October 28, 2027. The facility also provides for the issuance of letters of credit with a sublimit equal to 100% of the total revolving credit commitments. Letters of credit issued under the facility reduce the available borrowing capacity. At June 30, 2025, there were no borrowings outstanding and $244.3 million of letters of credit issued under the revolving credit facility, resulting in available capacity of $2.06 billion.\n51\nTable of Contents\nOur homebuilding revolving credit facility imposes restrictions on our operations and activities, including requiring the maintenance of a maximum allowable leverage ratio and a borrowing base restriction if our leverage ratio exceeds a certain level. These covenants are measured as defined in the credit agreement governing the facility and are reported to the lenders quarterly. A failure to comply with these financial covenants could allow the lending banks to terminate the availability of funds under the revolving credit facility or cause any outstanding borrowings to become due and payable prior to maturity. The credit agreement governing the facility imposes restrictions on the creation of secured debt and liens.\nPublic Unsecured Debt\n — At June 30, 2025, we had $3.5 billion principal amount of homebuilding senior notes outstanding that mature from October 2025 through October 2035. In October 2024, we repaid $500 million principal amount of our 2.5% senior notes at maturity. In February 2025, we issued $700 million principal amount of 5.5% senior notes due October 15, 2035, with interest payable semi-annually. The annual effective interest rate of these notes after giving effect to the amortization of the discount and financing costs is 5.6%. In May 2025, we issued $500 million principal amount of 4.85% senior notes due October 15, 2030, with interest payable semi-annually. The annual effective interest rate of these notes after giving effect to the amortization of the discount and financing costs is 5.1%. The indenture governing our senior notes imposes restrictions on the creation of secured debt and liens.\nAt June 30, 2025, we were in compliance with all of the covenants, limitations and restrictions of our homebuilding revolving credit facility and public debt obligations. Our homebuilding revolving credit facility and homebuilding senior notes are guaranteed by D.R. Horton, Inc.’s significant wholly owned homebuilding subsidiaries.\nDebt and Stock Repurchase Authorizations \n— In July 2024, our Board of Directors authorized the repurchase of up to $500 million of our debt securities. In April 2025, the Board authorized the repurchase of up to $5.0 billion of our common stock, replacing the previous authorization. During the nine months ended June 30, 2025, we repurchased 26.2 million shares at a total cost, including commissions and excise taxes, of $3.6 billion, of which $2.6 billion was repurchased under the previous authorization. At June 30, 2025, the full amount of the debt repurchase authorization was remaining, and $4.0 billion of the stock repurchase authorization was remaining. The debt and stock repurchase authorizations have no expiration date.\nCapital Resources - Rental\nDuring the past few years, we have made significant investments in our rental operations. The inventory in our rental segment totaled $3.1 billion at June 30, 2025 compared to $2.9 billion at September 30, 2024 and $3.1 billion at June 30, 2024.\nCash and Cash Equivalents\n — At June 30, 2025, cash and cash equivalents of our rental segment totaled $160.3 million.\nBank Credit Facility\n — Our rental subsidiary, DRH Rental, has a $1.05 billion senior unsecured revolving credit facility with an uncommitted accordion feature that could increase the size of the facility to $2.0 billion, subject to certain conditions and availability of additional bank commitments. Availability under the rental revolving credit facility is subject to a borrowing base calculation based on the book value of DRH Rental’s real estate assets and unrestricted cash. The facility also provides for the issuance of letters of credit with a sublimit equal to the greater of $100 million and 50% of the total revolving credit commitments. The maturity date of the facility is October 10, 2027. At June 30, 2025, there were $1.02 billion of borrowings outstanding at a 6.4% annual interest rate and no letters of credit issued under the facility, resulting in available capacity of $30 million.\nThe rental revolving credit facility includes customary affirmative and negative covenants, events of default and financial covenants. The financial covenants require DRH Rental to maintain a minimum level of tangible net worth, a minimum level of liquidity and a maximum allowable leverage ratio. These covenants are measured as defined in the credit agreement governing the facility and are reported to the lenders quarterly. A failure to comply with these financial covenants could allow the lending banks to terminate the availability of funds under the revolving credit facility or cause any outstanding borrowings to become due and payable prior to maturity. At June 30, 2025, DRH Rental was in compliance with all of the covenants, limitations and restrictions of its revolving credit facility.\n52\nTable of Contents\nThe rental revolving credit facility is guaranteed by DRH Rental’s wholly owned subsidiaries that are not immaterial subsidiaries and have not been designated as unrestricted subsidiaries. The rental revolving credit facility is not guaranteed by D.R. Horton, Inc. or any of the subsidiaries that guarantee the debt of our homebuilding, Forestar or financial services operations.\nCapital Resources - Forestar\nForestar’s achievement of its long-term growth objectives will depend on its ability to obtain financing and generate sufficient cash flows from operations. As market conditions permit, Forestar may issue new debt or equity securities through the capital markets or obtain additional bank financing to provide capital for future growth and additional liquidity. At June 30, 2025, Forestar’s ratio of debt to total capital (notes payable divided by stockholders’ equity plus notes payable) was 34.2% compared to 30.7% at September 30, 2024 and 31.8% at June 30, 2024. Forestar’s ratio of net debt to total capital (notes payable net of cash divided by stockholders’ equity plus notes payable net of cash) was 28.9% compared to 12.4% at September 30, 2024 and 18.7% at June 30, 2024.\nCash and Cash Equivalents\n — At June 30, 2025, Forestar had cash and cash equivalents of $189.2 million. \nBank Credit Facility\n — Forestar has a senior unsecured revolving credit facility that was amended in December 2024 to increase its capacity from $410 million to $640 million and to raise the uncommitted accordion feature that could increase the size of the facility to $1.0 billion, subject to certain conditions and availability of additional bank commitments. The amendment also extended the maturity date of the facility. Of the total commitments, $575 million mature on December 18, 2029, and $65 million mature on October 28, 2026. The facility also provides for the issuance of letters of credit with a sublimit equal to the greater of $100 million and 50% of the total revolving credit commitments. Borrowings under the revolving credit facility are subject to a borrowing base calculation based on the book value of Forestar’s real estate assets and unrestricted cash. Letters of credit issued under the facility reduce the available borrowing capacity. At June 30, 2025, there were no borrowings outstanding and $37.2 million of letters of credit issued under the revolving credit facility, resulting in available capacity of $602.8 million.\nThe Forestar revolving credit facility includes customary affirmative and negative covenants, events of default and financial covenants. The financial covenants require Forestar to maintain a minimum level of tangible net worth, a minimum level of liquidity and a maximum allowable leverage ratio. These covenants are measured as defined in the credit agreement governing the facility and are reported to the lenders quarterly. A failure to comply with these financial covenants could allow the lending banks to terminate the availability of funds under the revolving credit facility or cause any outstanding borrowings to become due and payable prior to maturity.\nUnsecured Debt\n — As of June 30, 2025, Forestar had $870.6 million principal amount of senior notes issued pursuant to Rule 144A and Regulation S under the Securities Act of 1933, as amended, which mature from May 2026 through March 2033 and represent unsecured obligations of Forestar. In March 2025, Forestar issued $500 million principal amount of 6.5% senior notes due March 15, 2033, with interest payable semi-annually. The annual effective interest rate of these notes after giving effect to the amortization of financing costs is 6.7%. The net proceeds from this issuance were primarily used to fund Forestar’s tender offer to purchase any and all of its outstanding $400 million principal amount of 3.85% senior notes due 2026 (of which $329.4 million aggregate principal amount was tendered). The repurchase price of $333.4 million included accrued and unpaid interest of $4.2 million. Forestar recognized a $1.1 million loss on extinguishment of debt upon repurchase of the notes.\nAt June 30, 2025, Forestar was in compliance with all of the covenants, limitations and restrictions of its revolving credit facility and senior note obligations. Forestar’s revolving credit facility and its senior notes are guaranteed by Forestar’s wholly owned subsidiaries that are not immaterial subsidiaries and have not been designated as unrestricted subsidiaries. They are not guaranteed by D.R. Horton, Inc. or any of the subsidiaries that guarantee the debt of our homebuilding, rental or financial services operations.\nDebt Repurchase Authorization\n — In April 2020, Forestar’s Board of Directors authorized the repurchase of up to $30 million of Forestar’s debt securities. All of the $30 million authorization was remaining at June 30, 2025, and the authorization has no expiration date. \n53\nTable of Contents\nIssuance of Common Stock\n — During the nine months ended June 30, 2025, there were no shares issued under Forestar’s ATM program. At June 30, 2025, $750 million remained available for issuance under Forestar’s shelf registration statement, with $300 million reserved for sales under the ATM program.\nCapital Resources - Financial Services\nCash and Cash Equivalents\n — At June 30, 2025, cash and cash equivalents of our financial services segment totaled $268.0 million.\nMortgage Repurchase Facilities\n — Our mortgage subsidiary, DHI Mortgage, has two mortgage repurchase facilities, one of which is committed and the other of which is uncommitted, that provide financing and liquidity to DHI Mortgage by facilitating purchase transactions in which DHI Mortgage transfers eligible loans to counterparties upon receipt of funds from the counterparties. DHI Mortgage then has the right and obligation to repurchase the loans upon their sale to third-party purchasers in the secondary market or within specified time frames in accordance with the terms of the mortgage repurchase facilities.\nIn May 2025, the committed mortgage repurchase facility was amended to reduce its capacity to $1.4 billion and extend its maturity date to May 6, 2026. The capacity of the facility can be increased to $2.0 billion subject to the availability of additional commitments. At June 30, 2025, DHI Mortgage had an obligation of $1.3 billion under the committed mortgage repurchase facility at a 6.0% annual interest rate.\nAt June 30, 2025, the uncommitted mortgage repurchase facility had a borrowing capacity of $500 million, of which DHI Mortgage had an obligation of $451.7 million at a 5.6% annual interest rate. \nAt June 30, 2025, $2.22 billion of mortgage loans held for sale with a collateral value of $2.17 billion were pledged under the committed mortgage repurchase facility, and $535.9 million of mortgage loans held for sale with a collateral value of $501.1 million were pledged under the uncommitted mortgage repurchase facility.\nThe facilities contain financial covenants as to the mortgage subsidiary’s minimum required tangible net worth, its maximum allowable indebtedness to tangible net worth ratio and its minimum required liquidity. At June 30, 2025, DHI Mortgage was in compliance with all of the conditions and covenants of the mortgage repurchase facilities. These mortgage repurchase facilities are not guaranteed by D.R. Horton, Inc. or any of the subsidiaries that guarantee the debt of our homebuilding, rental or Forestar operations.\nIn the past, DHI Mortgage has been able to renew or extend its committed mortgage repurchase facility at a sufficient capacity and on satisfactory terms prior to its maturity and obtain temporary additional commitments through amendments to the facility during periods of higher than normal volumes of mortgages held for sale. The liquidity of our financial services business depends upon its continued ability to renew and extend the committed mortgage repurchase facility, utilize the uncommitted mortgage repurchase facility or obtain other additional financing in sufficient capacities.\nOperating Cash Flow Activities\nIn the nine months ended June 30, 2025, net cash provided by operating activities was $949.1 million compared to $228.2 million in the prior year period. Cash provided by operating activities in the current year period primarily consisted of $1.7 billion of cash provided by our homebuilding segment, partially offset by $453.9 million, $294.5 million and $20.1 million of cash used in our Forestar, rental and financial services segments, respectively.\nCash used to increase construction in progress and finished home inventory was $146.1 million in the current year period, reflecting an increase in our homes in inventory in the current period. Cash used to increase residential land and lots was $1.5 billion in the current year period compared to $2.0 billion in the prior year period.\nInvesting Cash Flow Activities\nIn the nine months ended June 30, 2025, net cash used in investing activities was $123.5 million compared to $161.1 million in the prior year period. In the current year period, uses of cash included purchases of property and equipment totaling $93.6 million and the payment of $53.1 million related to a business acquisition in our South Central region. In the prior year period, uses of cash included purchases of property and equipment totaling $133.3 million.\n54\nTable of Contents\nFinancing Cash Flow Activities\nWe expect the short-term financing needs of our operations will be funded with existing cash, cash generated from operations and borrowings under our credit facilities. Long-term financing needs for our operations may be funded with the issuance of senior unsecured debt securities or equity securities through the capital markets.\nDuring the nine months ended June 30, 2025, net cash used in financing activities was $2.7 billion, consisting primarily of cash used to repurchase shares of our common stock of $3.6 billion, repayment of $500 million principal amount of our 2.5% homebuilding senior notes at maturity, the early repurchase of $329.4 million of Forestar’s $400 million principal amount 3.85% senior notes and payment of cash dividends totaling $376.4 million. These uses of cash were partially offset by note proceeds from our issuances of $700 million principal amount of 5.5% homebuilding senior notes and $500 million principal amount of 4.85% homebuilding senior notes, Forestar’s issuance of $500 million principal amount of 6.5% senior notes and net borrowings on our rental revolving credit facility and mortgage repurchase facilities of $275 million and $170.4 million, respectively.\nDuring the nine months ended June 30, 2024, net cash used in financing activities was $947.2 million, consisting primarily of cash used to repurchase shares of our common stock of $1.2 billion and payment of cash dividends totaling $297.5 million. These uses of cash were partially offset by net borrowings on our rental revolving credit facility of $630 million.\nDuring each of the first three quarters of fiscal 2025, our Board of Directors approved a quarterly cash dividend of $0.40 per common share, the most recent of which was paid on May 9, 2025 to stockholders of record on May 2, 2025. Cash dividends declared and paid in the three and nine months ended June 30, 2025 totaled $122.4 million and $376.4 million, respectively. In July 2025, our Board of Directors approved a quarterly cash dividend of $0.40 per common share, payable on August 14, 2025 to stockholders of record on August 7, 2025. Cash dividends of $0.30 per common share were approved and paid in each quarter of fiscal 2024. The declaration of future cash dividends is at the discretion of our Board of Directors and will depend upon, among other things, our future earnings, cash flows, capital requirements, financial condition and general business conditions.\n55\nTable of Contents\nSUPPLEMENTAL GUARANTOR FINANCIAL INFORMATION\nAs of June 30, 2025, D.R. Horton, Inc. had $3.5 billion principal amount of homebuilding senior notes outstanding due through October 2035 and no amounts outstanding on its homebuilding revolving credit facility.\nAll of the homebuilding senior notes and the homebuilding revolving credit facility are fully and unconditionally guaranteed, on a joint and several basis, by certain subsidiaries of D.R. Horton, Inc. (Guarantors or Guarantor Subsidiaries). Each of the Guarantor Subsidiaries is 100% owned, directly or indirectly, by D.R. Horton, Inc. Our subsidiaries associated with the single-family and multi-family rental operations, Forestar lot development operations, financial services operations and certain other subsidiaries do not guarantee the homebuilding senior notes or the homebuilding revolving credit facility (collectively, Non-Guarantor Subsidiaries). The guarantees are senior unsecured obligations of each Guarantor and rank equal with all existing and future senior debt of such Guarantor and senior to all subordinated debt of such Guarantor. The guarantees are effectively subordinated to any secured debt of such Guarantor to the extent of the value of the assets securing such debt. The guarantees will be structurally subordinated to indebtedness and other liabilities of Non-Guarantor Subsidiaries of the Guarantors.\nThe guarantees by a Guarantor Subsidiary will be automatically and unconditionally released and discharged upon: (1) the sale or other disposition of its common stock whereby it is no longer a subsidiary of ours; (2) the sale or other disposition of all or substantially all of its assets (other than to us or another Guarantor); (3) its merger or consolidation with an entity other than us or another Guarantor; or (4) its ceasing to guarantee any of our publicly traded debt securities and ceasing to guarantee any of our obligations under our homebuilding revolving credit facility.\nThe enforceability of the obligations of the Guarantor Subsidiaries under their guarantees may be subject to review under applicable federal or state laws relating to fraudulent conveyance or transfer, voidable preference and similar laws affecting the rights of creditors generally. In certain circumstances, a court could void the guarantees, subordinate amounts owing under the guarantees or order other relief detrimental to the holders of our guaranteed obligations. The indenture governing our homebuilding senior notes contains a “savings clause,” which limits the liability of each Guarantor on its guarantee to the maximum amount that such Guarantor can incur without risk that its guarantee will be subject to avoidance as a fraudulent transfer. This provision may not be effective to protect such guarantees from fraudulent transfer challenges or, if it does, it may reduce such Guarantor’s obligation such that the remaining amount due and collectible under the guarantees would not suffice, if necessary, to pay the notes in full when due.\n56\nTable of Contents\nThe following tables present summarized financial information for D.R. Horton, Inc. and the Guarantor Subsidiaries on a combined basis after intercompany transactions and balances have been eliminated among D.R. Horton, Inc. and the Guarantor Subsidiaries, as well as their investment in, and equity in earnings from the Non-Guarantor Subsidiaries.\nD.R. Horton, Inc. and Guarantor Subsidiaries\nSummarized Balance Sheet Data\nJune 30,\n2025\nSeptember 30,\n2024\n \n(In millions)\nAssets\nCash\n$\n1,896.6 \n$\n3,542.4 \nInventories\n21,110.7 \n20,152.9 \nAmount due from Non-Guarantor Subsidiaries\n1,453.9 \n1,393.2 \nTotal assets\n28,371.6 \n28,865.7 \nLiabilities & Stockholders’ Equity\nNotes payable\n$\n3,651.7 \n$\n2,926.8 \nTotal liabilities\n7,497.5 \n6,455.0 \nStockholders’ equity\n20,874.1 \n22,410.7 \nSummarized Statement of Operations Data\nNine Months Ended\nJune 30, 2025\nYear Ended\nSeptember 30, 2024\n(In millions)\nRevenues\n$\n22,770.0 \n$\n33,756.1 \nCost of sales\n17,805.7 \n25,896.3 \nSelling, general and administrative expense\n1,903.3 \n2,497.2 \nIncome before income taxes\n3,123.5 \n5,423.0 \nNet income\n2,389.6 \n4,148.9 \n57\nTable of Contents\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nAs disclosed in our annual report on Form 10-K for the fiscal year ended September 30, 2024, our most critical accounting policies relate to revenue recognition, inventories and cost of sales, warranty and legal claims and insurance. Since September 30, 2024, there have been no significant changes to those critical accounting policies.\nAs disclosed in our critical accounting policies in our Form 10-K for the fiscal year ended September 30, 2024, our reserves for construction defect claims include the estimated costs of both known claims and anticipated future claims. At June 30, 2025 and September 30, 2024, we had reserves for approximately 940 and 825 pending construction defect claims, respectively, and no individual existing claim was material to our financial statements. During the nine months ended June 30, 2025, we were notified of approximately 380 new construction defect claims and resolved 265 construction defect claims for a total cost of $25.1 million. At June 30, 2024 and September 30, 2023, we had reserves for approximately 570 and 600 pending construction defect claims, respectively, and no individual existing claim was material to our financial statements. During the nine months ended June 30, 2024, we were notified of approximately 240 new construction defect claims and resolved 270 construction defect claims for a total cost of $49.6 million.\nSEASONALITY\nAlthough significant changes in market conditions have impacted our seasonal patterns in the past and could do so again in the future, we generally close more homes and generate greater revenues and pre-tax income in the third and fourth quarters of our fiscal year. The seasonal nature of our business can also cause significant variations in the working capital requirements for our homebuilding, rental, lot development and financial services operations. As a result of seasonal activity, our quarterly results of operations and financial position at the end of a particular fiscal quarter are not necessarily representative of the balance of our fiscal year.\n58\nTable of Contents\nForward-Looking Statements\nSome of the statements contained in this report, as well as in other materials we have filed or will file with the SEC, statements made by us in periodic press releases and oral statements we make to analysts, stockholders and the press in the course of presentations about us, may be construed as “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934 and the Private Securities Litigation Reform Act of 1995. Forward-looking statements are based on management’s beliefs as well as assumptions made by, and information currently available to, management. These forward-looking statements typically include the words “anticipate,” “believe,” “consider,” “continue,” “could,” “estimate,” “expect,” “forecast,” “goal,” “intend,” “likely,” “may,” “outlook,” “plan,” “possible,” “potential,” “predict,” “projection,” “seek,” “should,” “strategy,” “target,” “will,” “would” or other words of similar meaning. Any or all of the forward-looking statements included in this report and in any other of our reports or public statements may not approximate actual experience, and the expectations derived from them may not be realized, due to risks, uncertainties and other factors. As a result, actual results may differ materially from the expectations or results we discuss in the forward-looking statements. These risks, uncertainties and other factors include, but are not limited to:\n•\nthe cyclical nature of the homebuilding, rental and lot development industries and changes in economic, real estate or other conditions;\n•\nadverse developments affecting the capital markets and financial institutions, which could limit our ability to access capital, increase our cost of capital and impact our liquidity and capital resources;\n•\nreductions in the availability of mortgage financing provided by government agencies, changes in government financing programs, a decrease in our ability to sell mortgage loans on attractive terms or an increase in mortgage interest rates;\n•\nthe risks associated with our land, lot and rental inventory;\n•\nour ability to effect our growth strategies, acquisitions, investments or other strategic initiatives successfully;\n•\nthe impact of an inflationary, deflationary or higher interest rate environment;\n•\nrisks of acquiring land, building materials and skilled labor and challenges obtaining regulatory approvals;\n•\nthe effects of public health issues such as a major epidemic or pandemic on the economy and our businesses;\n•\nthe effects of weather conditions and natural disasters on our business and financial results;\n•\nhome warranty and construction defect claims;\n•\nthe effects of health and safety incidents;\n•\nreductions in the availability of performance bonds;\n•\nincreases in the costs of owning a home;\n•\nthe effects of information technology failures, data security breaches, and the failure to satisfy privacy and data protection laws and regulations;\n•\nthe effects of governmental regulations and environmental matters on our land development and housing operations;\n•\nthe effects of governmental regulations on our financial services operations;\n•\nthe effects of competitive conditions within the industries in which we operate;\n•\nour ability to manage and service our debt and comply with related debt covenants, restrictions and limitations;\n•\nthe effects of negative publicity;\n•\nthe effects of the loss of key personnel; and\n•\nthe effects of actions by activist stockholders.\nWe undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. However, any further disclosures made on related subjects in subsequent reports on Forms 10-K, 10-Q and 8-K should be consulted. Additional information about issues that could lead to material changes in performance and risk factors that have the potential to affect us is contained in our annual report on Form 10-K for the fiscal year ended September 30, 2024, including the section entitled “Risk Factors,” which is filed with the SEC.\n59\nTable of Contents"
}