{
  "source_file": "dhr-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.  BUSINESS\nGeneral\nDanaher is a global science and technology innovator committed to accelerating the power of science and technology to improve human health.  Danaher is comprised of more than 15 operating companies with leadership positions in the biotechnology, life sciences and diagnostics sectors, organized under three segments (Biotechnology, Life Sciences and Diagnostics).  United by the DANAHER BUSINESS SYSTEM (“DBS”), our businesses are also typically characterized by a high level of products and services that are sold on a recurring basis, primarily through a direct sales model and to a geographically diverse customer base.  Our business’ research and development, manufacturing, sales, distribution, service and administrative facilities are located in more than 50 countries.  \nDanaher strives to create shareholder value primarily through three strategic priorities:\n•\nstrengthening our competitive advantage through consistent application of DBS tools and culture; \n•\nenhancing our portfolio in attractive science and technology markets through strategic capital allocation; and\n•\nconsistently attracting and retaining exceptional talent.\nDanaher measures its progress against these strategic priorities over the long-term based primarily on financial metrics relating to revenue growth, profitability, cash flow and capital returns, as well as certain non-financial metrics.  To further the strategic objectives set forth above, the Company also acquires businesses and makes investments that either complement its existing business portfolio or expand its portfolio into new markets the Company deems attractive.  Given the rapid pace of technological development and the specialized expertise typical of Danaher’s served markets, acquisitions as well as strategic alliances and investments can provide the Company access to important new technologies and domain expertise, and Danaher continues to pursue acquisition and investment opportunities within its targeted markets.  The extent to which we identify, consummate and effectively integrate appropriate acquisitions and consummate appropriate investments affects our overall growth and operating results.  Danaher also continually assesses the strategic fit of its existing businesses and may separate or otherwise dispose businesses based on strategic and other considerations.\nDBS is not only the set of business processes and tools our operating companies use on a daily basis in the pursuit of continuous improvement, but also represents our culture, which is guided by the following core values (the “Core Values”):\n1.\nThe Best Team Wins\n2.\nCustomers Talk, We Listen\n3.\nKaizen is our Way of Life\n4.\nInnovation Defines our Future\n5.\nWe Compete for Shareholders\n3\nUnderpinned by these five Core Values, the DBS tools are organized into four pillars that are designed to apply to every aspect of our business: Growth, Lean, Leadership and the DBS Fundamentals.  \nThe idea for Danaher originated in the early 1980s when the Company’s founders, Steven M. and Mitchell P. Rales, envisioned a business that would generate sustainable long-term value for customers, associates and shareholders.  Through a series of acquisitions and divestitures, Danaher has evolved over time into the science and technology innovator it is today.  While the operating companies that make up Danaher have changed, DBS continues to be the guiding philosophy for the Company.\nSales in 2024 by geographic destination (geographic destination refers to the geographic area where the final sale to the Company’s unaffiliated customer is made) as a percentage of total 2024 sales were: North America, 43% (including 42% in the United States); Western Europe, 23%; other developed markets, 5%; and high-growth markets, 29%.  The Company defines North America as the United States and Canada.  The Company defines high-growth markets as Eastern Europe, the Middle East, Africa, Latin America (including Mexico) and Asia (with the exception of Japan, Australia and New Zealand).  The Company defines developed markets as all markets of the world that are not high-growth markets.\nBIOTECHNOLOGY\nThe Biotechnology segment includes the bioprocessing and discovery and medical businesses and offers a broad range of equipment, consumables and services that are primarily used by customers to advance and accelerate the research, development, manufacture and delivery of biological medicines.  The Company’s solutions support a broad range of biotherapeutics including monoclonal antibodies, recombinant proteins, replacement therapies such as insulin and vaccines, as well as novel cell, gene, mRNA and other nucleic acid therapies.  Sales in 2024 for this segment by geographic destination (as a percentage of total 2024 sales) were: North America, 33%; Western Europe, 34%; other developed markets, 5%; and high-growth markets, 28%.\nDanaher established the Biotechnology segment through the acquisition of Pall in 2015, and expanded the business through the acquisition of Cytiva in 2020.  \n4\nThe Biotechnology segment consists of the following businesses:\nBioprocessing\n—The bioprocessing business is a leading provider of technologies, consumables, services and solutions that advance, accelerate and integrate the development and manufacture of therapeutics.  These therapeutics include protein-based and other biological therapies as well as a new emerging class of highly-targeted therapies such as cell and gene therapies and nucleic acid-based therapies.  The business offers tools, solutions and services to support biomanufacturers across their workflows from the earliest stages of process development to large scale commercial and turn-key manufacturing.  The bioprocessing business’ offering includes cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish, as well as single-use hardware and consumables and services such as the design and installation of full manufacturing suites.  The bioprocessing business’ offerings in data connectivity and automation, advanced process training, process development services and equipment services are designed to help customers develop more optimized, compliant processes and ensure continuous performance.  Typical users of these products and services include pharmaceutical and biopharmaceutical companies, translational medicine institutions, biotechnology companies and contract manufacturing organizations.\nDiscovery and Medical\n—The discovery and medical business is a leading provider of solutions to accelerate biotherapeutic research and discovery through high quality sample preparation and reliable diagnostic assays in addition to ensuring sterility and safety in medical liquids and gases.  The business provides solutions and technologies for: lab filtration, separation and purification; lab-scale protein purification and analytical tools to support bio-molecular analysis, identification and characterization; reagents, membranes and services for diagnostic and assay development; and healthcare filtration solutions for drug delivery and patient care.  Typical users of these products include professionals in the areas of academic, translational and commercial research, medical diagnostics, clinical care and biopharmaceutical development.\nCustomers served by the Biotechnology segment select products based on several factors, including product quality and reliability, the product’s capacity to enhance productivity and flexibility, innovation (particularly productivity and sensitivity improvements), product performance and ergonomics, access to an advanced technical expertise, service and support network and the other factors described under the heading “Competition” below.  The businesses in Danaher’s Biotechnology segment market their products and services under several key brands including CYTIVA and PALL.  Manufacturing facilities are located in North America, Europe and Asia.  The business sells to customers through direct sales personnel and independent distributors.\nLIFE SCIENCES\nThe Life Sciences segment offers a broad range of instruments, consumables, services and software that are primarily used by customers to study the basic building blocks of life, including DNA and RNA, nucleic acid, proteins, metabolites and cells, in order to understand the causes of disease, identify new therapies, and test and manufacture new drugs, vaccines and gene editing technologies.  Additionally, the segment provides products and consumables used to filter and remove contaminants from a variety of liquids and gases in many end-market applications.  Sales in 2024 for this segment by geographic destination (as a percentage of total 2024 sales) were: North America, 44%; Western Europe, 21%; other developed markets, 7%; and high-growth markets, 28%.\nDanaher established the life sciences business in 2005 through the acquisition of Leica Microsystems and has expanded the business through numerous subsequent acquisitions, including the acquisitions of AB Sciex and Molecular Devices in 2010, Beckman Coulter in 2011, Pall in 2015, Phenomenex in 2016, IDT in 2018, Aldevron in 2021 and Abcam in 2023.  \nThe Life Sciences segment consists of the following businesses:  \nFlow Cytometry and Lab Automation Solutions\n—The flow cytometry and lab automation solutions business offers workflow instruments and consumables that help researchers analyze genomic, protein and cellular information.  Key product areas include sample preparation equipment such as centrifugation and consumables; liquid handling automation instruments and associated consumables; flow cytometry instrumentation and associated antibodies and reagents; particle counting and characterization instrumentation; and genomic sample preparation.  Researchers use these products to study biological function in the pursuit of basic research, as well as therapeutic and diagnostic development.  Typical users include pharmaceutical and biotechnology companies, universities, medical schools and research institutions and in some cases industrial manufacturers.\nMass Spectrometry\n—The mass spectrometry business is a leading global provider of high-end mass spectrometers, bioanalytical measurement systems, as well as related consumables, software and services.  Mass spectrometry is a technique for identifying, analyzing and quantifying elements, chemical compounds and biological molecules, individually or in complex mixtures.  The business’ mass spectrometer systems and related products are used in numerous applications such as drug discovery and clinical development of therapeutics as well as in basic research, clinical testing, food and beverage quality testing and environmental testing.  Typical users of these mass spectrometry and related products include molecular biologists, bioanalytical chemists, toxicologists and forensic scientists as well as quality assurance and quality control technicians.\n5\nMicroscopy\n—The microscopy business is a leading global provider of professional microscopes designed to capture, manipulate and preserve images and enhance the user’s visualization and analysis of microscopic structures.  The Company’s microscopy products include laser scanning (confocal) microscopes, compound microscopes and related equipment, surgical and other stereo microscopes and specimen preparation products for electron microscopy.  Typical users of these products include research, medical and surgical professionals operating in research and pathology laboratories, academic settings and surgical theaters.\nProtein Consumables\n—The protein consumables business, which is a leading supplier in the proteomics market, provides highly validated antibodies, reagents, biomarkers and assays to address targets in biological pathways that are critical for advancing drug discovery, life sciences research, diagnostics and drug discovery.  Researchers use these products to study biological pathways critical for scientific research, diagnostics and drug discovery.  Typical users of these products include scientists and researchers in academic institutions, research institutes and in pharmaceutical, biotechnology and diagnostics companies.\nFiltration\n—The filtration, separation and purification technologies business is a leading provider of products used to remove solid, liquid and gaseous contaminants from a variety of liquids and gases, primarily through the sale of filtration consumables and associated hardware.  The business’ technologies enhance the quality and efficiency of manufacturing processes and prolong equipment life in applications such as microelectronics, aircraft, oil refineries, power generation turbines and petrochemical plants.  The business also serves the filtration needs of the food and beverage markets, helping customers ensure the quality and safety of their products while lowering operating costs and minimizing waste.  \nGenomic Medicines\n—The genomic medicines businesses are leading providers of custom nucleic acid products for the life sciences industry, primarily through the manufacture of custom DNA and RNA oligonucleotides and gene fragments utilizing a proprietary manufacturing ecosystem.  The businesses have developed proprietary technologies for genomics applications such as next generation sequencing, CRISPR genome editing, qPCR, and RNA interference.  Additionally, the businesses are a leading manufacturer of high-quality plasmid DNA, RNA and proteins.  These products are used in the research, development and manufacture of gene and cell therapies, DNA and RNA vaccines and gene editing technologies.  Typical users of these products include professionals in the areas of academic and commercial research, agriculture, medical diagnostics, pharmaceutical development, biotechnology companies and research institutions across discovery, clinical and commercial applications.\nCustomers served by the Life Sciences segment select products based on a number of factors, including product quality and reliability, the product’s capacity to enhance productivity, innovation (particularly productivity and sensitivity improvements), product performance and ergonomics, access to a qualified service and support network and the other factors described under the heading “Competition” below.  The businesses in Danaher’s Life Sciences segment market their products and services under key brands including ABCAM, ALDEVRON, BECKMAN COULTER, GENEDATA, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX.  Manufacturing facilities are located in North America, Europe and Asia.  The business sells to customers through direct sales personnel and independent distributors.\nDIAGNOSTICS\nThe Diagnostics segment offers clinical instruments, consumables, software and services that hospitals, physicians’ offices, reference laboratories and other critical care settings use to diagnose disease and make treatment decisions.  Sales in 2024 for this segment by geographic destination (as a percentage of total 2024 sales) were: North America, 50%; Western Europe, 16%; other developed markets, 4%; and high-growth markets, 30%. \nDanaher established the diagnostics business in 2004 through the acquisition of Radiometer and expanded the business through numerous subsequent acquisitions, including the acquisitions of Vision Systems in 2006, Beckman Coulter in 2011, Iris International and Aperio Technologies in 2012, HemoCue in 2013, Devicor Medical Products in 2014, the clinical microbiology business of Siemens Healthcare Diagnostics in 2015 and Cepheid in 2016.  The Diagnostics segment consists of the clinical diagnostics businesses (consisting of the core lab - clinical, acute care diagnostics and pathology diagnostics businesses) and the molecular diagnostics business: \nCore Lab - Clinical\n—The clinical lab business is a leading manufacturer and marketer of biomedical testing instruments, systems and related consumables that are used to evaluate and analyze samples made up of body fluids and cells.  The information generated is used to diagnose disease, guide and monitor treatment and therapy, assist in managing chronic disease and assess patient status in hospital, outpatient and physicians’ office settings.  The business offers instrumentation, services and related consumables in the areas of clinical chemistry, immunoassay, hematology, and microbiology.  The business also offers automation systems that reduce manual operation and associated cost and errors from the pre-analytical through post-analytical stages, including sample barcoding/information tracking, centrifugation, aliquoting, storage and conveyance.  These systems, along with the instruments the business provides, are controlled through laboratory-level software that enables laboratory managers to monitor samples, results and lab efficiency.  Typical users of the segment’s core lab products include hospitals, physicians’ offices, reference laboratories and pharmaceutical clinical trial laboratories.\n6\nMolecular Diagnostics\n—The molecular diagnostics business is a leading provider of biomedical testing instruments, systems, software and related consumables that enable DNA-based testing for organisms and genetic-based diseases.  These products integrate and automate the complicated and time-intensive steps associated with DNA-based testing (including sample preparation and DNA amplification and detection) to allow the testing to be performed in both laboratory and non-laboratory environments with minimal training and infrastructure.  These products also include systems which commonly test for healthcare-associated infections, respiratory disease, sexual health and virology.\nAcute Care Diagnostics\n—The acute care diagnostics business is a leading worldwide provider of instruments, software and related consumables and services that are used in both laboratory and point-of-care environments to rapidly measure critical parameters, including blood gases, electrolytes, metabolites and cardiac markers, as well as for anemia and high-sensitivity glucose testing.  Typical users of these products include hospital central laboratories, intensive care units, hospital operating rooms, hospital emergency rooms, physicians’ office laboratories and blood banks.\nPathology Diagnostics\n—The pathology diagnostics business is a leader in the anatomical pathology industry, offering a comprehensive suite of instrumentation and related consumables used across the entire workflow of a pathology laboratory.  The anatomical pathology diagnostics products include chemical and immuno-staining instruments, reagents, antibodies and consumables; tissue embedding, processing and slicing (microtomes) instruments and related reagents and consumables; slide cover-slipping and slide/cassette marking instruments; imaging instrumentation including slide scanners, microscopes and cameras; software solutions to store, share and analyze pathology images digitally; and minimally invasive, vacuum-assisted breast biopsy and lesion excision instruments and breast surgery localization solutions.  Typical users of these products include pathologists, lab managers and researchers.\nCustomers served by the Diagnostics segment select products based on a number of factors, including product quality and reliability, the scope of tests that can be performed, the accuracy and speed of the product, the product’s ability to enhance productivity, ease of use, total cost of ownership and access to a highly qualified service and support network as well as the other factors described under the heading “Competition” below.  The businesses in Danaher’s Diagnostics segment market their products and services under key brands including BECKMAN COULTER, CEPHEID, HEMOCUE, LEICA BIOSYSTEMS, MAMMOTOME and RADIOMETER.  Manufacturing facilities are located in North America, Europe, Asia and Australia.  The business sells to customers primarily through direct sales personnel and, to a lesser extent, through independent distributors.\n************************************\nThe following discussion includes information common to all of Danaher’s segments.\nMaterials\nThe Company’s manufacturing operations employ a wide variety of raw materials, including metallic-based components, electronic components, chemistries, original equipment manufacturers (“OEM”) products, plastics and other petroleum-based products.  Prices of oil and gas also affect the Company’s costs for freight and utilities and have an indirect impact on the cost of other purchased materials.  The Company purchases raw materials from a large number of sources around the world.  No single supplier is material to the Company.  For some components that require particular specifications or regulatory or other qualifications only a single supplier or a limited number of suppliers can readily provide such components.  The Company utilizes a number of techniques to address potential disruption in and other risks relating to its supply chain, including in certain cases the use of safety stock, alternative materials and qualification of multiple supply sources.  \nDuring 2024, there were no material effects on the business related to the availability of raw materials.  For a further discussion of risks related to the materials and components required for the Company’s operations, refer to “Item 1A. Risk Factors.”\nIntellectual Property\nThe Company owns numerous patents, trademarks, copyrights, trade secrets and licenses to intellectual property owned by others.  Although in aggregate the Company’s intellectual property is important to its operations, the Company does not consider any single patent, trademark, copyright, trade secret or license (or any related group of any such items) to be of material importance to any segment or to the business as a whole.  From time to time the Company engages in litigation to protect its intellectual property rights.  For a discussion of risks related to the Company’s intellectual property, refer to “Item 1A. Risk Factors.”  All capitalized brands and product names throughout this document are trademarks owned by, or licensed to, Danaher.\n7\nCompetition\nAlthough the Company’s businesses generally operate in highly competitive markets, the Company’s competitive position cannot be determined accurately in the aggregate or by segment since none of its competitors offer all of the same product and service lines or serve all of the same markets as the Company or any of its segments.  Because of the range of the products and services the Company sells and the variety of markets it serves, the Company encounters a wide variety of competitors, including well-established regional competitors, competitors who are more specialized than it is in particular markets, as well as large companies or divisions of large companies with substantial sales, marketing, research and financial capabilities.  The Company is facing increased competition in a number of its served markets as a result of the entry of well-resourced companies into certain markets, the entry of competitors based in low-cost manufacturing locations, the development of competitive technologies by early-stage, emerging and other companies and increasing consolidation in particular markets.  The number of competitors varies by product and service line.  Management believes that the Company has a leadership position in many of the markets it serves.  Key competitive factors vary among the Company’s businesses and product and service lines, but include the specific factors noted above with respect to each particular business and typically also include price, quality and safety, performance, delivery speed, application expertise, service and support, technology and innovation, distribution network, breadth of product, service and software offerings and brand name recognition.  For a discussion of risks related to competition, refer to “Item 1A. Risk Factors.”\nHuman Capital\nAs of December 31, 2024, the Company had approximately 63,000 employees (whom we refer to as “associates”), of whom approximately 24,000 were employed in the North America, 20,000 in Western Europe, 3,000 in other developed markets and 16,000 in high-growth markets.  Approximately 61,000 of the Company’s total employees were full-time and 2,000 were part-time employees.  Of the United States employees, 250 were hourly-rated, unionized employees.  Outside the United States, the Company has government-mandated collective bargaining arrangements and union contracts in certain countries, particularly in Europe where many of the Company’s employees are represented by unions and/or works councils.  \nDanaher is committed to attracting, developing, engaging and retaining the best people from around the world to sustain and grow our science and technology leadership.  As noted above, “Consistently attracting and retaining exceptional talent” is one of our three strategic priorities and “The Best Team Wins” is one of our five Core Values, reflecting the critical role our human capital plays in supporting our strategy.  Our human capital strategy spans multiple, key dimensions, including the following:\n•\nCulture and Governance\n◦\nOur culture is rooted in DBS and in our commitment to “Innovation at the Speed of Life.”  At its core, DBS reflects a commitment to use process to continuously improve every aspect of our business, and our dedication to improving human life through innovation gives meaning and direction to our continuous improvement.\n◦\nDanaher’s Board of Directors reviews the Company’s human capital strategy both annually as well as in connection with significant initiatives and acquisitions, supported by the Compensation Committee’s oversight of our executive and equity compensation programs.  At the management level, our Senior Vice President of Human Resources, who reports directly to our President and CEO, is responsible for the development and execution of the Company’s human capital strategy. \n•\nRecruitment  \n◦\nAs part of our commitment to the Core Value “The Best Team Wins”, we focus on identifying, attracting and recruiting talented individuals to meet our current and future business needs.  We have invested in comprehensive talent acquisition capabilities across all levels of recruitment (including robust branding, labor market analytics, advanced sourcing tools, leading technology and streamlined processes).\n•\nEngagement\n \n◦\nOur engagement strategy focuses on developing the best workplace and best people leaders to meet our associates’ needs every day.  Further, we believe that better associate engagement helps enable better retention and better business performance.  We assess our engagement performance multiple times per year through our associate engagement surveys, which address topics such as engagement, direct supervisor effectiveness, behavior change and performance enablement, as well as through our voluntary turnover rate.\n8\n•\nRetention\n◦\nCompensation and Benefits\n.  We are committed to offering competitive compensation and benefits, tailored in form and amount to geography, industry, experience and performance and designed to attract associates, motivate and reward performance, drive growth and support retention.  We have a common job architecture across our businesses to provide a standardized framework for defining jobs, job families, and career levels, and set market-aligned pay structures for each career level (adjusted as appropriate for the particular job family, industry and geography) based on a range of compensation surveys.\n◦\nPerformance Management\n.\n \nPerformance for Growth (“P4G”), our annual performance management program, supports our high-performance culture by seeking to ensure that high-performing associates are recognized and rewarded for their contributions.  P4G guides associates and their managers in setting clear personal performance goals aligned to our strategic priorities.  Annual reviews under the program assess performance against these formal, annual objectives and against our Core Behaviors.  \n◦\nTalent Development and Career Mobility\n.  Our talent development program (which is generally structured to consist of 70% on-the-job learning, 20% coaching and mentoring and 10% formal training) strives to provide every associate with appropriate development opportunities.  In particular, we make training, coaching and developmental resources available to people leaders at every level to help them be effective leaders and advance their careers.  We further encourage internal promotion and mobility through our Danaher Go program, which makes open positions throughout the organization visible to associates and proactively encourages our associates to seek promotional opportunities.  We assess our performance in this area using metrics including internal fill rate (which tracks the percentages of open roles at particular levels filled by our own associates) as well as the percentage of eligible associates with completed talent assessments/career plans.\n◦\nSafety and Risk Management.\n  Associate safety is deeply embedded in our culture.  Our Environment, Health and Safety (“EHS”) Policy establishes the core principles upon which our EHS management programs are built, and associates use our DBS-based “4E” toolkit to identify, assess and control hazards related to ergonomics, energetics, exposures and environment.  In addition, we evaluate and manage risks relating to our human capital strategy as part of Danaher’s enterprise risk management program.  Key quantitative measures that we use to assess performance in this category include total recordable incident rate (defined as the number of work-related injuries or illness cases serious enough to require treatment beyond first aid, per 100 associates) and days away, restricted or transferred (defined as the number of work-related injuries or illness cases that result in an employee working with physical restrictions, being away from work or unable to do their job or transferring to other work, per 100 associates).\n◦\nHealth and Well-Being.\n  The health and well-being of our associates is a critical element of our human capital program.  We maintain a global Employee Assistance Program to help ensure a consistent support structure for mental health and well-being across the Company. \nResearch and Development\nThe Company conducts R&D activities for the purpose of developing new products, enhancing the functionality, effectiveness, ease of use and reliability of its existing products and expanding the applications for which uses of its products are appropriate.  The Company’s R&D efforts include internal initiatives and those that use licensed or acquired technology, and we work with a number of leading research institutions, universities and clinicians around the world to develop, evaluate and clinically test our products.  The Company conducts R&D activities primarily in North America, Europe and Asia and generally on a business-by-business basis.  The Company anticipates that it will continue to make significant expenditures for R&D as it seeks to provide a continuing flow of innovative products and services to maintain and improve its competitive position.  For a discussion of the risks related to the need to develop and commercialize new products and product enhancements, refer to “Item 1A. Risk Factors.” \nGovernment Contracts\nAlthough the substantial majority of the Company’s revenue in 2024 was from customers other than governmental entities, each of Danaher’s segments has agreements relating to the sale of products to government entities.  As a result, the Company is subject to various statutes and regulations that apply to companies doing business with governments.  For a discussion of risks related to government contracting requirements, refer to “Item 1A. Risk Factors.”  No material portion of Danaher’s business is subject to renegotiation of profits or termination of contracts at the election of a government entity. \n9\nRegulatory Matters\nThe Company faces extensive government regulation both within and outside the United States relating to its operations, including the development, manufacture, marketing, sale and distribution of its products and services.  The following sections describe certain significant regulations that the Company is subject to.  These are not the only regulations that the Company’s businesses must comply with.  For a description of the risks related to the regulations that the Company’s businesses are subject to, refer to “Item 1A. Risk Factors.”\nMedical Device Regulations\nMany of our products are classified as medical devices and are subject to restrictions under domestic and foreign laws, rules, regulations, self-regulatory codes, circulars and orders, including, but not limited to, the U.S. Food, Drug, and Cosmetic Act (the “FDCA”).  The FDCA requires these products, when sold in the United States, to be safe and effective for their intended uses and to comply with the regulations administered by the U.S. Food and Drug Administration (“FDA”).  The FDA regulates the design, development, research, preclinical and clinical testing, introduction, manufacture, advertising, labeling, packaging, marketing, distribution, import and export and record keeping for such products.  Many medical device products are also regulated by comparable agencies in non-U.S. countries in which they are produced or sold.\nUnless an exemption applies, the FDA requires that a manufacturer introducing a new medical device or a new indication for use of an existing medical device obtain either a Section 510(k) premarket notification clearance or a premarket approval (“PMA”) before introducing it into the U.S. market.  The type of marketing authorization is generally linked to the classification of the device.  The FDA classifies medical devices into one of three classes (Class I, II or III) based on the degree of risk the FDA determines to be associated with a device and the level of regulatory control deemed necessary to ensure the device’s safety and effectiveness.\nThe process of obtaining a Section 510(k) clearance generally requires the submission of performance data and clinical data, which in some cases can be extensive, to demonstrate that the device is “substantially equivalent” to a device that was on the market before 1976 or to a device that has been found by the FDA to be “substantially equivalent” to such a pre-1976 device.  As a result, FDA clearance requirements may extend the development process for a considerable length of time.\nMedical devices can be marketed only for the indications for which they are cleared or approved.  After a device has received 510(k) clearance for a specific intended use, any change or modification that could significantly affect its safety or effectiveness, such as a significant change in the design, materials, method of manufacture or intended use, may require a new 510(k) clearance or PMA approval and payment of an FDA user fee.  The determination as to whether or not a modification could significantly affect the device’s safety or effectiveness is initially left to the manufacturer using available FDA guidance; however, the FDA may review this determination to evaluate the regulatory status of the modified product at any time and may require the manufacturer to cease marketing and recall the modified device until the required 510(k) clearance or PMA approval is obtained.\nAny medical devices we manufacture and distribute are subject to pervasive and continuing regulation by the FDA and certain state and non-U.S. agencies.  These include product listing and establishment registration requirements, which help facilitate inspections and other regulatory actions.  As a medical device manufacturer, our manufacturing facilities are subject to inspection on a routine basis by the FDA.  We are required to adhere to the Current Good Manufacturing Practices (“CGMP”) requirements, as set forth in the Quality Systems Regulation (“QSR”), which require manufacturers, including third-party manufacturers, to follow stringent design, testing, control, documentation and other quality assurance procedures during all phases of the design and manufacturing process.\nWe must also comply with post-market surveillance regulations, including medical device reporting (“MDR”) requirements which require that we review and report to the FDA any incident in which our products may have caused or contributed to a death or serious injury.  We must also report any incident in which our product has malfunctioned if that malfunction would likely cause or contribute to a death or serious injury if it were to recur.\nLabeling and promotional activities are subject to scrutiny by the FDA and, in certain circumstances, by the Federal Trade Commission (“FTC”) (and similar regulators in other jurisdictions).  Medical devices approved or cleared by the FDA may not be promoted for unapproved or uncleared uses, otherwise known as “off-label” promotion.  The FDA and other agencies actively enforce the laws and regulations prohibiting the promotion of off-label uses.\nIn the European Union (“EU”), our products are subject to the medical device and in vitro medical device laws of the various member states, which for many years were based on Directives of the European Commission.  However, in May 2017, the EU adopted new, formal regulations to replace such Directives; specifically, the EU Medical Device Regulation (the “MDR”) and In Vitro Diagnostic Regulation (the “IVDR”), each of which imposes stricter requirements for the marketing and sale of medical devices and in vitro devices, including in the area of clinical evaluation requirements, \n10\nquality systems and post-market surveillance.  The EU regulations were adopted with staggered transitional periods that have since been updated.  In March 2023, the European Commission issued an amended regulation to eliminate the previous “selloff” periods and extend the original transitional compliance dates for both the MDR and IVDR regulations.  The amended MDR and IVDR timelines for becoming fully effective are now from May 2026 to December 2028 for MDR devices and May 2026 to May 2028 for IVDR devices, depending on product classifications.  Regulatory requirements in the United Kingdom (“UK”) are also changing as a result of Brexit (the UK’s withdrawal from the EU), and regulatory requirements in Switzerland are changing as a result of the country’s withdrawal from its Mutual Recognition Agreement with the EU Commission.  Complying with the EU MDR, EU IVDR and the evolving regulatory regimes in the UK and Switzerland requires modifications to our quality management systems, additional resources in certain functions and updates to technical files, among other changes, which has not and is not expected to have a material impact on the Company’s financial results.\nOther Healthcare Laws\nWe are also subject to the U.S. Foreign Corrupt Practices Act and various healthcare related laws regulating fraud and abuse, research and development, pricing and sales and marketing practices, and the privacy and security of health information, including the U.S. federal regulations described below.  Many states, foreign countries and supranational bodies have also adopted laws and regulations similar to, and in some cases more stringent than, the U.S. federal regulations discussed above and below, including the UK Bribery Act and similar anti-bribery laws.\n•\nMany of our healthcare-related products are purchased by healthcare providers that typically bill various third-party payers, such as governmental healthcare programs (e.g., Medicare, Medicaid and comparable non-U.S. programs), private insurance plans and managed care plans, for the healthcare services provided to their patients.  The ability of our customers to obtain appropriate reimbursement for products and services from third-party payers is critical because it affects which products customers purchase and the prices they are willing to pay.  As a result, many of our healthcare-related products are subject to regulation regarding quality and cost by the U.S. Department of Health and Human Services (“HHS”), including the Centers for Medicare & Medicaid Services (“CMS”), as well as comparable state and non-U.S. agencies responsible for reimbursement and regulation of healthcare goods and services, including laws and regulations related to kickbacks, false claims, self-referrals and healthcare fraud.  Third-party payers are increasingly reducing reimbursements for medical products and services and, in international markets, many countries have instituted price ceilings on specific products and therapies (for further discussion of governmental initiatives to reduce healthcare costs, please see “—Healthcare Reform” below).  Price ceilings, decreases in third-party reimbursement for any product or a decision by a third-party payor not to cover a product may reduce usage and patient demand for the product.\n•\nThe U.S. Federal Anti-Kickback Statute prohibits persons or entities from knowingly and willfully soliciting, offering, receiving or providing remuneration (including any kickback or bribe), directly or indirectly, in exchange for or to induce either the referral of an individual, or the furnishing or arranging for a good or service, for which payment may be made in whole or in part under a federal healthcare program, such as Medicare or Medicaid.  A person or entity does not need to have actual knowledge of the statute or specific intent to violate it in order to have committed a violation.\n•\nThe Health Insurance Portability and Accountability Act of 1996 (“HIPAA”) prohibits knowingly and willfully (1) executing, or attempting to execute, a scheme to defraud any healthcare benefit program, including private payors, or (2) falsifying, concealing or covering up a material fact or making any materially false, fictitious or fraudulent statement in connection with the delivery of or payment for healthcare benefits, items or services.  In addition, HIPAA, as amended by the Health Information Technology for Economic and Clinical Health Act of 2009, restricts the use and disclosure of patient identifiable health information, mandates the adoption of standards relating to the privacy and security of patient identifiable health information and requires the reporting of certain security breaches with respect to such information.  Similar to the U.S. Federal Anti-Kickback Statute, a person or entity does not need to have actual knowledge of the healthcare fraud statute implemented under HIPAA or specific intent to violate it in order to have committed a violation.\n•\nThe False Claims Act imposes liability on any person or entity that, among other things, knowingly presents, or causes to be presented, a false or fraudulent claim for payment by a federal healthcare program, knowingly makes, uses or causes to be made or used, a false record or statement material to a false or fraudulent claim, or knowingly makes a false statement to avoid, decrease or conceal an obligation to pay money to the U.S. federal government.  The qui tam provisions of the False Claims Act allow a private individual to bring actions on behalf of the federal government alleging that the defendant has submitted a false claim to the federal government, and to share in any monetary recovery.  In addition, the government may assert that a claim including items and services resulting from a violation of the U.S. Federal Anti-Kickback Statute constitutes a false or fraudulent claim for purposes of the civil False Claims Act.\n11\n•\nThe federal Civil Monetary Penalties Law prohibits, among other things, the offering or transferring of remuneration to a Medicare or Medicaid beneficiary that the person knows or should know is likely to influence the beneficiary’s selection of a particular supplier of Medicare or Medicaid payable items or services.\n•\nThe Open Payments Act requires manufacturers of medical devices covered under Medicare, Medicaid or the Children’s Health Insurance Program (subject to certain exceptions) to record payments and other transfers of value to a broad range of healthcare providers and teaching hospitals and to report this data as well as ownership and investment interests held by the physicians described above and their immediate family members to HHS for subsequent public disclosure.  Similar reporting requirements have also been enacted on the state level, and an increasing number of countries either have adopted or are considering similar laws requiring transparency of interactions with healthcare professionals.\nIn addition, some of the in vitro diagnostic drugs-of-abuse assays and reagents sold by the Company’s subsidiaries contain small amounts of controlled substances, and as a result some of the Company’s facilities are inspected periodically by the United States Drug Enforcement Administration to assess whether the Company properly handles, stores and disposes of controlled substances in the manufacture of those products.\nFederal consumer protection and unfair competition laws broadly regulate marketplace activities and activities that potentially harm consumers.  Analogous U.S. state laws and regulations, such as state anti-kickback and false claims laws, also may apply to our business practices, including but not limited to, research, distribution, sales and marketing arrangements and claims involving healthcare items or services reimbursed by any third-party payor, including private insurers.  Further, there are state laws that require medical device manufacturers to comply with the voluntary compliance guidelines and the relevant compliance guidance promulgated by the U.S. federal government, or otherwise restrict payments that may be made to healthcare providers and other potential referral sources; state laws and regulations that require manufacturers to file reports relating to pricing and marketing information, which requires tracking gifts and other remuneration and items of value provided to healthcare professionals and entities; state and local laws requiring the registration of sales representatives; and state laws governing the privacy and security of health information in certain circumstances, many of which differ from each other in significant ways and often are not preempted by HIPAA.\nFor a discussion of risks related to regulation by the FDA and comparable agencies of other countries, and the other regulatory regimes referenced above, please refer to “Item 1A. Risk Factors.”\nHealthcare Reform\nIn the U.S. and certain non-U.S. jurisdictions, there have been, and we expect there will continue to be, a number of legislative and regulatory changes to the healthcare system.  There is significant interest in promoting changes in healthcare systems with the stated goals of containing healthcare costs, improving quality or expanding access.  For example, in the United States, in March 2010, the U.S. Patient Protection and Affordable Care Act (as amended by the Health Care and Education Affordability Reconciliation Act) (collectively, the “PPACA”) was signed into law, which substantially changed the way healthcare is financed by both governmental and private insurers and significantly affected the healthcare industry.  Since its enactment, there have been judicial, Congressional and executive challenges to certain aspects of the PPACA, and there may be additional challenges and amendments to the PPACA in the future.\nMoreover, there has recently been heightened governmental scrutiny over the manner in which manufacturers set prices for their marketed products, which has resulted in several Congressional inquiries and proposed and enacted legislation designed, among other things, to bring more transparency to product pricing, review the relationship between pricing and manufacturer patient programs and reform government program reimbursement methodologies for medical products.  Individual states in the U.S. have also become increasingly active in implementing regulations designed to control product pricing, including price or patient reimbursement constraints, discounts, restrictions on certain product access and marketing cost disclosure and transparency measures and, in some cases, mechanisms to encourage importation from other countries and bulk purchasing.  Other countries, including China, have also introduced similar measures with the stated goals of containing healthcare costs, improving quality and/or expanding access.\nData Privacy and Security Laws\nAs a global organization, we are subject to data privacy and security laws, regulations, and customer-imposed controls in numerous jurisdictions as a result of having access to and processing confidential, personal and/or sensitive data in the course of our business.  For example, the European Union’s General Data Protection Regulation (“GDPR”) imposes significant restrictions on how we collect, transmit, process and retain personal data, including, among other things, in certain circumstances a requirement for almost immediate notice of data breaches to supervisory authorities with significant fines for non-compliance.  In the U.S., HIPAA privacy and security rules require certain of our operations to maintain controls to protect the availability and confidentiality of patient health information, individual states regulate data breach and security requirements, and multiple governmental bodies assert authority over aspects of the protection of personal privacy.  State privacy laws in California impose some of the same features as the GDPR and have prompted an \n12\nincreasing number of other states to enact their own privacy laws.  Additionally, a bipartisan bill under consideration in Congress would, if adopted, impose broad privacy requirements at the federal level.  Several other countries such as China and Russia have passed, and other countries are considering passing, privacy laws that require personal data relating to their citizens to be maintained on local servers or impose significant restrictions on data transfer.  For a discussion of risks related to these laws, refer to “Item 1A. Risk Factors.”\nEnvironmental Laws and Regulations\nFor a discussion of the environmental laws and regulations that the Company’s operations, products and services are subject to and other environmental contingencies, refer to Note 17 to the Consolidated Financial Statements included in this Annual Report.  For a discussion of risks related to compliance with environmental and health and safety laws and risks related to past or future releases of, or exposures to, hazardous substances, refer to “Item 1A. Risk Factors.”\nAntitrust Laws\nThe U.S. federal government, most U.S. states and many other countries have laws that prohibit certain types of conduct deemed to be anti-competitive.  Violations of these laws can result in various sanctions, including criminal and civil penalties.  Private plaintiffs also could bring civil lawsuits against us in the United States for alleged antitrust law violations, including claims for treble damages.\nExport/Import Compliance\nThe Company is required to comply with various U.S. export/import control and economic sanctions laws, including:\n•\nthe International Traffic in Arms Regulations administered by the U.S. Department of State, Directorate of Defense Trade Controls, which, among other things, imposes license requirements on the export from the United States of defense articles and defense services listed on the U.S. Munitions List;\n•\nthe Export Administration Regulations administered by the U.S. Department of Commerce, Bureau of Industry and Security, which, among other things, impose licensing requirements on the export, in-country transfer and re-export of certain dual-use goods, technology and software (which are items that have both commercial and military, or proliferation applications);\n•\nthe regulations administered by the U.S. Department of Treasury, Office of Foreign Assets Control, which implement economic sanctions imposed against designated countries, governments and persons based on United States foreign policy and national security considerations; and\n•\nthe import regulatory activities of the U.S. Customs and Border Protection and other U.S. government agencies.\nOther nations’ governments have implemented similar export/import control and economic sanction regulations, which may affect the Company’s operations or transactions subject to their jurisdictions.  \nIn addition, under U.S. laws and regulations, U.S. companies and their subsidiaries and affiliates outside the U.S. are prohibited from participating or agreeing to participate in unsanctioned foreign boycotts in connection with certain business activities, including the sale, purchase, transfer, shipping or financing of goods or services within the U.S. or between the U.S. and other countries.  If we, or third parties through which we sell or provide goods or services, violate anti-boycott laws and regulations, we may be subject to civil or criminal enforcement actions and varying degrees of liability.\nFor a discussion of risks related to export/import control and economic sanctions laws, refer to “Item 1A. Risk Factors.”\nInternational Operations\nThe Company’s products and services are available worldwide, and its principal markets outside the U.S. are in Europe and Asia.  The Company also has operations around the world, and this geographic diversity allows the Company to draw on the skills of a worldwide workforce, provides greater stability to its operations, allows the Company to drive economies of scale, provides revenue streams that may help offset economic trends that are specific to individual economies and offers the Company an opportunity to access new markets for products.  In addition, the Company believes that future growth depends in part on its ability to continue developing products and sales models that successfully target high-growth markets.\nThe manner in which the Company’s products and services are sold outside the U.S. differs by business and by region.  Most of the Company’s sales in non-U.S. markets are made by its subsidiaries located outside the U.S., though the Company also sells from the U.S. into non-U.S. markets through various representatives and distributors and, in some cases, directly.  In countries with low sales volumes, the Company generally sells through representatives and distributors.\n13\nInformation about the effects of foreign currency fluctuations on the Company’s business is set forth in “Item 7.  Management’s Discussion and Analysis of Financial Condition and Results of Operations” (“MD&A”) included in this Annual Report.  For a discussion of risks related to the Company’s non-U.S. operations and foreign currency exchange, refer to “Item 1A. Risk Factors.”\nSustainability\nThe Company views sustainability as a fundamental responsibility and a strategic priority.  Our sustainability strategy is to help generations of our stakeholders by innovating products that improve lives and our planet, building the best team and protecting our environment.  This strategy aligns with Danaher’s commitment to “Innovation at the Speed of Life,” our Core Values, as well as key UN Sustainable Development Goals (UN SDGs) under the United Nations 2030 Agenda for Sustainable Development.  Our sustainability strategy is also informed by and grounded in the feedback we continually solicit from our stakeholders, including our regular sustainability prioritization assessments.  Within each of the strategic elements of our sustainability program referenced above, where feasible and appropriate, we seek to quantify our performance and set goals to encourage continuous improvement.  \nAvailable Information\nThe Company maintains an internet website at www.danaher.com.  The Company makes available free of charge on the website its annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K and amendments to those reports, filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (“the Exchange Act”), as soon as reasonably practicable after filing such material with, or furnishing such material to, the SEC.  Danaher’s internet site and the information contained on or connected to that site are not incorporated by reference into this Form 10-K.",
  "item7": "ITEM 7.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is designed to provide material information relevant to an assessment of Danaher’s financial condition and results of operations, including an evaluation of the amounts and certainty of cash flows from operations and from outside sources.  The MD&A is designed to focus specifically on material events and uncertainties known to management that are reasonably likely to cause reported financial information not to be necessarily indicative of future operating results or of future financial condition.  This includes descriptions and amounts of matters that have had a material impact on reported operations, as well as matters that are reasonably likely based on management’s assessment to have a material impact on future operations.  The Company’s MD&A is divided into five sections:\n•\nOverview\n•\nResults of Operations\n•\nLiquidity and Capital Resources\n•\nCritical Accounting Estimates\n•\nNew Accounting Standards\nThis discussion and analysis should be read together with Danaher’s audited financial statements and related Notes thereto as of December 31, 2024 and 2023 and for each of the three years in the period ended December 31, 2024 included in this Annual Report.  Management's discussion and analysis of financial condition and results of operations for 2022 is included in Item 7 of the Company’s Annual Report on Form 10-K with respect to the year ended December 31, 2023 filed with the Securities and Exchange Commission, and should be referred to for information regarding that period. \nUnless otherwise indicated, all financial results in this report refer to continuing operations.\nOVERVIEW\nGeneral\nRefer to “Item 1. Business—General” for a discussion of Danaher’s strategic objectives and methodologies for delivering long-term shareholder value.  Danaher is a multinational business with global operations.  During 2024, approximately 58% of Danaher’s sales were derived from customers outside the United States.  As a diversified, global business, Danaher’s operations are affected by worldwide, regional and industry-specific economic, political and geopolitical factors.  Danaher’s geographic and industry diversity, as well as the range of its products and services, help mitigate the impact of any one industry or the economy of any single country, other than the United States, on its consolidated operating results.  The Company’s individual businesses monitor key competitors and customers, including to the extent possible their sales, to gauge relative performance and the outlook for the future.\nAs a result of the Company’s geographic and industry diversity, the Company faces a variety of opportunities and challenges, including rapid technological development (particularly with respect to computing, automation, artificial intelligence, mobile connectivity and digitization) in most of the Company’s served markets, the expansion and evolution of opportunities in high-growth markets, trends and costs associated with a global labor force, consolidation of the Company’s competitors and regulatory changes.  The Company operates in a highly competitive business environment in most markets, and the Company’s long-term growth and profitability will depend in particular on its ability to expand its business in high-growth geographies and higher-growth market segments, identify, consummate and integrate appropriate acquisitions and identify and consummate appropriate investments and strategic partnerships, develop innovative and differentiated new products and services with higher gross profit margins, expand and improve the effectiveness of the Company’s sales force, continue to reduce costs and improve operating efficiency and quality, and effectively address the demands of an increasingly regulated global environment.  The Company is making significant investments, organically and through acquisitions and investments, to address the rapid pace of technological change in its served markets and to globalize its manufacturing, research and development and customer-facing resources (particularly in high-growth markets) in order to be responsive to the Company’s customers throughout the world and improve the efficiency of the Company’s operations.\nBusiness Performance\nConsolidated revenues for the year ended December 31, 2024 were flat and core sales decreased 1.5% as compared to 2023.  Acquisitions contributed 2.0% to sales in 2024 compared to 2023, and were largely offset by core revenue declines led by the Biotechnology segment, and to a lesser extent the Life Sciences segment, partially offset by higher core sales in the Diagnostics segment.  The impact of currency translation decreased reported sales by 0.5% in 2024 compared to 2023.  For the definition of “core sales” refer to “—Results of Operations” below.\n35\nTable of Contents\nGeographically, the Company’s sales in developed markets in 2024 increased 2% compared to 2023 driven primarily by increased sales in North America.  For the same period, core sales in developed markets were essentially flat, primarily due to increased core sales in North America offset by decreased core sales in Western Europe.  Increased demand in the Diagnostics segment, offset by decreased demand in the Biotechnology and Life Sciences segments, contributed to the year-over-year flat core sales growth in developed markets.  For the same period, sales in high-growth markets decreased year-over-year by 4% and core sales in high-growth markets decreased at a mid-single digit rate, due primarily to low double-digit core revenue declines in China.  The decline in core sales in high-growth markets was primarily driven by lower demand across all segments, due to weakness in capital spending and generally lower underlying activity levels.  High-growth markets represented approximately 29% of the Company’s total sales in 2024.\nThe Company’s net earnings from continuing operations for the year ended December 31, 2024 totaled approximately $3.9 billion, compared to approximately $4.2 billion for the year ended December 31, 2023.  Net earnings attributable to common stockholders for the year ended December 31, 2024 totaled approximately $3.9 billion or $5.29 per diluted common share compared to approximately $4.7 billion or $6.38 per diluted common share for the year ended December 31, 2023.  2024 intangible asset impairments and increased operating expenses, net of increased other income, drove the year-over-year decline in net earnings from continuing operations and diluted net earnings per common share from continuing operations.  In addition to the above factors, net earnings from discontinued operations for 2024 compared with 2023 contributed to the lower net earnings attributable to common stockholders in 2024.  Refer to “—Results of Operations” for further discussion of the year-over-year changes in net earnings and diluted net earnings per common share for the years ended December 31, 2024 and 2023.  In response to current economic conditions, the Company expects to review and adjust its cost structure.  In the first quarter of 2025, the Company commenced an initiative to identify productivity improvement and cost savings opportunities that we anticipate would generate annual pre-tax savings of at least $150 million.  The Company expects these opportunities to be broad-based, including opportunities within China and the Diagnostics segment.\nAcquisitions \nDuring 2024, the Company acquired 3 businesses for total consideration of $558 million in cash, net of cash acquired.  The businesses acquired complement existing units of the Company’s Life Sciences segment.  The Company preliminarily recorded an aggregate of $305 million of goodwill related to these acquisitions.  \nRefer to Note 2 to the Consolidated Financial Statements for discussion regarding the Company’s acquisitions. \nVeralto Corporation Separation\nOn September 30, 2023 (the “Distribution Date”), the Company completed the separation (the “Separation”) of its former Environmental & Applied Solutions business by distributing to Danaher stockholders on a pro rata basis all of the issued and outstanding common stock of Veralto Corporation (“Veralto”), the entity Danaher incorporated to hold such businesses.  To effect the Separation, Danaher distributed to its stockholders one share of Veralto common stock for every three shares of Danaher common stock outstanding as of September 13, 2023, the record date for the distribution.  Fractional shares of Veralto common stock that otherwise would have been distributed were aggregated and sold into the public market and the proceeds distributed to Danaher stockholders who otherwise would have received fractional shares of Veralto common stock.\nThe accounting requirements for reporting the Separation as a discontinued operation were met when the Separation was completed.  Refer to Note 3 to the Consolidated Financial Statements for further discussion.  \nRESULTS OF OPERATIONS\nIn this report, references to the non-GAAP measure of core sales (also referred to as core revenues or sales/revenues from existing businesses) refer to sales from continuing operations calculated according to generally accepted accounting principles in the United States (“GAAP”) but excluding:\n•\nsales from acquired businesses (as defined below); and\n•\nthe impact of currency translation.\nReferences to sales or operating profit attributable to acquisitions or acquired businesses refer to sales or operating profit, as applicable, from acquired businesses recorded prior to the first anniversary of the acquisition less any sales and operating profit, during the applicable period, attributable to divested product lines not considered discontinued operations.  The portion of revenue attributable to currency translation is calculated as the difference between:\n•\nthe period-to-period change in revenue (as defined above); and\n•\nthe period-to-period change in revenue (as defined above) after applying current period foreign exchange rates to the prior year period.\n36\nTable of Contents\nCore sales growth (decline) should be considered in addition to, and not as a replacement for or superior to, sales, and may not be comparable to similarly titled measures reported by other companies.  Management believes that reporting this non-GAAP financial measure provides useful information to investors by helping identify underlying growth trends in Danaher’s business and facilitating comparisons of Danaher’s revenue performance with its performance in prior and future periods and to Danaher’s peers.  Management also uses this non-GAAP financial measure to measure the Company’s operating and financial performance and as one of the performance measures in the Company’s executive short-term cash incentive program.  The Company excludes the effect of currency translation from this measure because currency translation is not under management’s control, is subject to volatility and can obscure underlying business trends, and excludes the effect of acquisitions and divestiture-related items because the nature, size, timing and number of acquisitions and divestitures can vary dramatically from period-to-period and between the Company and its peers and can also obscure underlying business trends and make comparisons of long-term performance difficult.\nThroughout this discussion, references to sales growth or decline refer to the impact of both price and unit sales and references to productivity improvements generally refer to improved cost efficiencies resulting from the ongoing application of DBS.\nThe Company deems acquisition-related transaction costs incurred in a given period to be significant (generally relating to the Company’s larger acquisitions) if it determines that such costs exceed the range of acquisition-related transaction costs typical for Danaher in a given period.\nSales Growth (Decline) and Core Sales Decline \n2024 vs. 2023\n2023 vs. 2022\nTotal sales growth (decline) (GAAP)\n— \n%\n(10.5)\n%\nImpact of:\nAcquisitions\n(2.0)\n%\n(0.5)\n%\nCurrency exchange rates \n0.5 \n%\n1.0 \n%\nCore sales decline (non-GAAP)\n(1.5)\n%\n(10.0)\n%\n2024 Sales Compared to 2023\nTotal sales were flat on a year-over-year basis in 2024 as sales from acquired businesses, which increased reported sales by 2.0%, were largely offset by a 1.5% decrease in core sales resulting from the factors discussed below by segment.  The impact of changes in currency exchange rates decreased reported sales by 0.5% on a year-over-year basis in 2024 primarily due to the impact of the strengthening of the U.S. dollar against most other major currencies in 2024.  Price increases contributed 1.0% to sales growth on a year-over-year basis and are reflected as a component of core sales decline above.\nOperating Profit Performance\nOperating profit margins decreased 140 basis points from 21.8% for the year ended December 31, 2023 to 20.4% for the year ended December 31, 2024.  The following factors impacted year-over-year operating profit margin comparisons.\n2024 vs. 2023 operating profit margin comparisons were unfavorably impacted by:\n•\nThe incremental dilutive effect in 2024 of acquired businesses - 85 basis points\n•\n2024 impairment charges related to a trade name in each of the Life Sciences and Diagnostics segments, net of 2023 impairment charges related to technology-based intangible assets in the Diagnostics segment and technology-based intangible assets and other assets in the Biotechnology segment.  Refer to Note 10 to the accompanying Consolidated Financial Statements for additional information regarding the impairments - 75 basis points\n•\nFull year 2024 loss on the termination of a commercial arrangement in the Diagnostics segment - 25 basis points\n•\n2023 gain from the resolution of a litigation contingency in the Life Sciences segment - 5 basis points\n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\nAcquisition-related transaction costs deemed significant, settlement of pre-acquisition share-based payment awards and fair value adjustments to inventory in 2023, net of acquisition-related fair value adjustment to inventory in 2024, in each case related to the acquisition of Abcam plc (“Abcam”) - 30 basis points\n•\nIncreased leverage and productivity in the Company’s operational and administrative cost structure, net of lower 2024 core sales and the impact of product mix - 20 basis points\n37\nTable of Contents\nBusiness Segments\nSales by business segment for the years ended December 31 are as follows ($ in millions):\n \n2024\n2023\n2022\nBiotechnology\n$\n6,759 \n$\n7,172 \n$\n8,758 \nLife Sciences\n7,329 \n7,141 \n7,036 \nDiagnostics\n9,787 \n9,577 \n10,849 \nTotal\n$\n23,875 \n$\n23,890 \n$\n26,643 \nFor information regarding the Company’s sales by geographical region, refer to Note 5 to the Consolidated Financial Statements.\nBIOTECHNOLOGY\nThe Biotechnology segment includes the bioprocessing and discovery and medical businesses and offers a broad range of equipment, consumables and services that are primarily used by customers to advance and accelerate the research, development, manufacture and delivery of biological medicines.  The Company’s solutions support a broad range of biotherapeutics including monoclonal antibodies, recombinant proteins, replacement therapies such as insulin and vaccines, as well as novel cell, gene, mRNA and other nucleic acid therapies. \nBiotechnology Selected Financial Data \n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n6,759 \n$\n7,172 \n$\n8,758 \nOperating profit\n1,685 \n1,909 \n3,008 \nDepreciation \n151 \n162 \n190 \nAmortization of intangible assets\n863 \n864 \n812 \nOperating profit as a % of sales\n24.9 \n%\n26.6 \n%\n34.3 \n%\nDepreciation as a % of sales\n2.2 \n%\n2.3 \n%\n2.2 \n%\nAmortization as a % of sales\n12.8 \n%\n12.0 \n%\n9.3 \n%\nSales Decline and Core Sales Decline\n2024 vs. 2023\n2023 vs. 2022\nTotal sales decline (GAAP)\n(6.0)\n%\n(18.0)\n%\nImpact of:\nCurrency exchange rates \n1.5 \n%\n— \n%\nCore sales decline (non-GAAP)\n(4.5)\n%\n(18.0)\n%\n2024 Sales Compared to 2023 \nPrice increases in the segment contributed 2.5% to sales growth on a year-over-year basis during 2024 as compared with 2023 and are reflected as a component of core sales above. \nDuring 2024, total Biotechnology segment sales decreased 6.0% primarily as a result of decreased core sales in the bioprocessing business, and to a lesser extent the impact of currency exchange rates.  Total segment core sales decreased across most major geographic regions, including weak demand in China as customers were cautious with their investments.  Year-over-year core sales in the bioprocessing business decreased as core sales declines in the first half of the year more than offset core sales growth in the second half.  The revenue decline in the first half of the year was primarily due to lower demand as customers reduced their inventory levels.  The bioprocessing business returned to core growth in the second half of 2024 primarily driven by improved consumables demand, primarily in North America and Europe.  Core sales in the discovery and medical business decreased year-over-year due primarily to lower demand for equipment, partially offset by an increase in demand for consumables.  \n38\nTable of Contents\nOperating Profit Performance\nOperating profit margins declined 170 basis points during 2024 as compared to 2023.  The following factors impacted year-over-year operating profit margin comparisons.\n2024 vs. 2023 operating profit margin comparisons were unfavorably impacted by:\n•\nLower 2024 core sales, reduced leverage in the segment’s operational and administrative cost structure and the impact of product mix, net of 2023 inventory write-offs - 245 basis points\n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\n2023 impairment charges related to technology-based intangible assets and other assets - 75 basis points\nAmortization of intangible assets as a percentage of sales increased in 2024 as compared with 2023 due to the decrease in sales and relatively consistent amortization expense year-over-year.  \nLIFE SCIENCES\nThe Life Sciences segment offers a broad range of instruments, consumables, services and software that are primarily used by customers to study the basic building blocks of life, including DNA and RNA, nucleic acid, proteins, metabolites and cells, in order to understand the causes of disease, identify new therapies, and test and manufacture new drugs, vaccines and gene editing technologies.  Additionally, the segment provides products and consumables used to filter and remove contaminants from a variety of liquids and gases in many end-market applications. \nLife Sciences Selected Financial Data \n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n7,329 \n$\n7,141 \n$\n7,036 \nOperating profit\n879 \n1,209 \n1,414 \nDepreciation \n167 \n129 \n112 \nAmortization of intangible assets\n576 \n429 \n419 \nOperating profit as a % of sales\n12.0 \n%\n16.9 \n%\n20.1 \n%\nDepreciation as a % of sales\n2.3 \n%\n1.8 \n%\n1.6 \n%\nAmortization as a % of sales\n7.9 \n%\n6.0 \n%\n6.0 \n%\nSales Growth and Core Sales (Decline) Growth\n2024 vs. 2023\n2023 vs. 2022\nTotal sales growth (GAAP)\n2.5 \n%\n1.5 \n%\nImpact of:\nAcquisitions\n(6.0)\n%\n(1.5)\n%\nCurrency exchange rates \n1.5 \n%\n1.0 \n%\nCore sales (decline) growth (non-GAAP)\n(2.0)\n%\n1.0 \n%\n2024 Sales Compared to 2023 \nPrice increases in the segment contributed 1.0% to sales growth on a year-over-year basis during 2024 as compared with 2023 and are reflected as a component of core sales above. \nDuring 2024, total Life Sciences segment sales increased 2.5% primarily as a result of acquisitions, partially offset by decreased core sales and to a lesser extent the impact of currency exchange rates.  The decrease in core sales was led by China and Western Europe.  Core sales declined year-over-year in the mass spectrometry and flow cytometry and lab automation solutions businesses primarily as a result of weaker demand for equipment, partially offset by increased demand for consumables and service.  Core sales declined year-over-year in the microscopy business across most major end-markets.  Core sales in the filtration business increased year-over-year driven by increased core sales from aerospace customers, partially offset by decreased core sales from food and beverage customers.  Core sales declined year-over-year in the genomics consumables business across most product lines, led by lower core sales in the gene reading and plasmids product lines.\n39\nTable of Contents\nOperating Profit Performance\nOperating profit margins declined 490 basis points during 2024 as compared to 2023.  The following factors impacted year-over-year operating profit margin comparisons.\n2024 vs. 2023 operating profit margin comparisons were unfavorably impacted by:\n•\n2024 impairment charge related to a trade name.  Refer to Note 10 to the accompanying Consolidated Financial Statements for additional information regarding the impairment - 305 basis points\n•\nThe incremental dilutive effect in 2024 of acquired businesses - 245 basis points\n•\nLower 2024 core sales and the impact of product mix, net of improvements in the segment’s operational and administrative cost structure - 25 basis points\n•\n2023 gain from the resolution of a litigation contingency - 15 basis points\n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\nAcquisition-related transaction costs deemed significant, settlement of pre-acquisition share-based payment awards and fair value adjustments to inventory in 2023, net of acquisition-related fair value adjustment to inventory in 2024, in each case related to the acquisition of Abcam - 100 basis points\nDepreciation and amortization of intangible assets increased as a percentage of sales during 2024 as compared with 2023, primarily as a result of acquisitions.\nDIAGNOSTICS\nThe Diagnostics segment offers clinical instruments, consumables, software and services that hospitals, physicians’ offices, reference laboratories and other critical care settings use to diagnose disease and make treatment decisions. \nDiagnostics Selected Financial Data\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n9,787 \n$\n9,577 \n$\n10,849 \nOperating profit\n2,625 \n2,406 \n3,436 \nDepreciation \n394 \n379 \n387 \nAmortization of intangible assets\n192 \n198 \n203 \nOperating profit as a % of sales\n26.8 \n%\n25.1 \n%\n31.7 \n%\nDepreciation as a % of sales\n4.0 \n%\n4.0 \n%\n3.6 \n%\nAmortization as a % of sales\n2.0 \n%\n2.1 \n%\n1.9 \n%\nSales Growth (Decline) and Core Sales Growth (Decline)\n2024 vs. 2023\n2023 vs. 2022\nTotal sales growth (decline) (GAAP)\n2.0 \n%\n(11.5)\n%\nImpact of:\nCurrency exchange rates \n1.0 \n%\n1.0 \n%\nCore sales growth (decline) (non-GAAP)\n3.0 \n%\n(10.5)\n%\n2024 Sales Compared to 2023 \nPrice increases in the segment did not have a significant impact on sales growth on a year-over-year basis during 2024 as compared with 2023.\nDuring 2024, total segment sales increased 2.0% primarily as a result of increased core sales resulting from the factors discussed below.  Changes in currency exchange rates negatively impacted sales year-over-year.  Overall segment core sales growth was driven primarily by North America, partially offset by lower year-over-year demand in high-growth markets.  During the year, core sales in the molecular diagnostics business grew on a year-over-year basis primarily driven by increased sales of both respiratory and non-respiratory disease tests in North America.  In the segment’s clinical diagnostics businesses, core sales grew on a year-over-year basis led by the clinical lab business, and to a lesser extent by the pathology and acute care businesses.  The increased core sales in the clinical diagnostics businesses were driven by core sales growth in developed markets.  \n40\nTable of Contents\nOperating Profit Performance\nOperating profit margins increased 170 basis points during 2024 as compared to 2023.  The following factors impacted year-over-year operating profit margin comparisons.       \n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\nHigher 2024 core sales, improvements in the segment’s operational and administrative cost structure and the impact of product mix - 250 basis points\n2024 vs. 2023 operating profit margin comparisons were unfavorably impacted by:\n•\n2024 loss on the termination of a commercial arrangement - 60 basis points\n•\n2024 impairment charge related to a trade name, net of a 2023 impairment charge related to a technology-based intangible asset - 20 basis points\nCOST OF SALES AND GROSS PROFIT\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n23,875 \n$\n23,890 \n$\n26,643 \nCost of sales\n(9,669)\n(9,856)\n(10,455)\nGross profit\n$\n14,206 \n$\n14,034 \n$\n16,188 \nGross profit margin\n59.5 \n%\n58.7 \n%\n60.8 \n%\nThe year-over-year decrease in cost of sales during 2024 as compared with 2023 was due primarily to the impact of lower year-over-year sales volumes and $87 million of charges incurred in the second quarter of 2023, primarily related to inventory in the Biotechnology segment.  The decrease in cost of sales was partially offset by an acquisition-related charge of $25 million incurred in 2024 associated with the fair value adjustment to inventory recorded in connection with the acquisition of Abcam.\nThe year-over-year increase in gross profit margin during 2024 as compared with 2023 was favorably impacted by the 2023 inventory charges referenced above, the net positive impact from the gross profit margin of recent acquisitions, and incremental year-over-year cost savings associated with productivity improvement actions, net of the impact of product mix and an acquisition-related charge in 2024.\nOPERATING EXPENSES\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n23,875 \n$\n23,890 \n$\n26,643 \nSelling, general and administrative (“SG&A”) expenses\n(7,759)\n(7,329)\n(7,124)\nResearch and development (“R&D”) expenses\n(1,584)\n(1,503)\n(1,528)\nSG&A as a % of sales\n32.5 \n%\n30.7 \n%\n26.7 \n%\nR&D as a % of sales\n6.6 \n%\n6.3 \n%\n5.7 \n%\nSG&A expenses as a percentage of sales increased 180 basis points on a year-over-year basis for 2024 compared with 2023.  The year-over-year increase was primarily driven by $265 million of intangible asset impairment charges recorded in 2024 and the impact of recent acquisitions, including the associated amortization expenses, and the 2024 loss on the termination of a commercial arrangement of $56 million.  These increases were partially offset by acquisition-related costs for the acquisition of Abcam of $87 million and intangible asset impairment charges of $64 million in 2023.  Refer to Note 10 to the accompanying Consolidated Financial Statements for additional information regarding the impairments.\nR&D expenses (consisting principally of internal and contract engineering personnel costs) as a percentage of sales increased in 2024 as compared with 2023, primarily due to increased spending on R&D activities, including the impact of recent acquisitions.  \nNONOPERATING INCOME (EXPENSE) \nNonoperating income (expense) consists primarily of net unrealized and realized gains and losses resulting from changes in the fair value of the Company’s investments in equity securities and investments in partnerships, the non-service cost components of net periodic benefit costs, gains on the sale of product lines and impairments of equity method investments.  Refer to Note 8 to the Consolidated Financial Statements. \n41\nTable of Contents\nINTEREST COSTS\nInterest expense of $278 million for 2024 was $8 million lower than in 2023, due to lower balances on borrowings in 2024 compared to 2023, partially offset by higher average interest rates on the Company’s commercial paper borrowings.  Interest income of $117 million for 2024 was $186 million lower than in 2023, due to lower average cash balances in 2024 primarily as a result of the use of cash for share repurchases and acquisitions.\nFor a further description of the Company’s debt and cross-currency swap derivative contracts related to the debt as of December 31, 2024 refer to Notes 13 and 14 to the Consolidated Financial Statements. \nINCOME TAXES\nGeneral\nIncome tax expense and deferred tax assets and liabilities reflect management’s assessment of future taxes expected to be paid on items reflected in the Company’s Consolidated Financial Statements.  The Company records the tax effect of discrete items and items that are reported net of their tax effects in the period in which they occur.\nThe Company’s effective tax rate can be affected by changes in the mix of earnings in countries with different statutory tax rates (including as a result of business acquisitions and dispositions), changes in the valuation of deferred tax assets and liabilities, accruals related to contingent tax liabilities and period-to-period changes in such accruals, the results of audits and examinations of previously filed tax returns (as further discussed below), the expiration of statutes of limitations, the implementation of tax planning strategies, tax rulings, court decisions, settlements with tax authorities, changes in tax laws and regulations, and legislative policy changes that may result from the OECD’s initiative on Base Erosion and Profit Shifting.  For a description of the tax treatment of earnings that are planned to be reinvested indefinitely outside the United States, refer to “—Liquidity and Capital Resources—Cash and Cash Requirements” below.\nThe amount of income taxes the Company pays is subject to ongoing audits by federal, state and non-U.S. tax authorities, which often result in proposed assessments.  Management performs a comprehensive review of its global tax positions on a quarterly basis.  Based on these reviews, which take into account the results of discussions and resolutions of matters with certain tax authorities and the other factors referenced in the prior paragraph, reserves for contingent tax liabilities are accrued or adjusted as necessary.  For a discussion of risks related to these and other tax matters, refer to “Item 1A. Risk Factors”.\nYear-Over-Year Changes in the Tax Provision and Effective Tax Rate\nYear Ended December 31\n2024\n2023\n2022\nEffective tax rate from continuing operations\n16.1 \n%\n16.3 \n%\n11.4 \n%\nThe Company operates globally, including in certain jurisdictions with lower tax rates than the U.S. federal statutory rate.  Therefore, the impact of Danaher’s global operations and benefits from tax credits and incentives contributes to a lower effective tax rate compared to the U.S. federal statutory tax rate.  For each period presented, the effective tax rate differs from the U.S. federal statutory rate of 21.0% principally due to the impact of the Company’s global operations, research tax credits, foreign-derived intangible income and aggregate net discrete benefits or charges. \nFor the year ended December 31, 2024, the effective tax rate included the tax effect from intangible asset impairments in a jurisdiction with a higher statutory tax rate than the Company’s effective tax rate and discrete tax benefits from excess tax benefits from stock-based compensation, the release of reserves for uncertain tax positions due to the expiration of statutes of limitation and changes in estimates related to prior year tax filing positions, net of charges related to changes in estimates associated with prior period uncertain tax positions.  These items decreased the reported rate on a net basis by 1.4%.\nFor the year ended December 31, 2023, the effective tax rate included discrete tax benefits from changes in estimates related to prior year tax filing positions, the release of reserves for uncertain tax positions due to the expiration of statutes of limitation and excess tax benefits from stock-based compensation, net of charges related to tax costs related to the Separation, tax costs from legal and operational actions undertaken to realign certain of its businesses and changes in estimates associated with prior period uncertain tax positions.  These items decreased the reported rate on a net basis by 0.9%.  \nThe Company conducts business globally and files numerous consolidated and separate income tax returns in the U.S. federal and state and non-U.S. jurisdictions.  The non-U.S. countries in which the Company has a significant presence include China, Denmark, Germany, Singapore, Sweden, Switzerland and the United Kingdom.  Excluding these jurisdictions, the Company believes that a change in the statutory tax rate of any individual non-U.S. country would not have a material effect on the Company’s Consolidated Financial Statements given the geographic dispersion of the Company’s taxable income. \n42\nTable of Contents\nThe Company and its subsidiaries are routinely examined by various U.S. and non-U.S. taxing authorities.  The IRS has completed substantially all of the examinations of the Company’s federal income tax returns through 2015 and is currently examining certain of the Company’s federal income tax returns for 2016 through 2022.  In addition, the Company has subsidiaries in Canada, China, Denmark, France, Germany, India, Italy, Switzerland, the United Kingdom and various other countries, states and provinces that are currently under audit for years ranging from 2004 through 2023. \nIn the fourth quarter of 2022, the IRS proposed significant adjustments to the Company’s taxable income for the years 2016 through 2018 with respect to the deferral of tax on certain premium income related to the Company’s self-insurance programs.  For income tax purposes, the recognition of premium income has been deferred in accordance with U.S. tax laws related to insurance.  The proposed adjustments would have increased the Company’s taxable income over the 2016 through 2018 periods by approximately $2.5 billion.  In the first quarter of 2023, the Company settled these proposed adjustments with the IRS, although the audit is still open with respect to other matters for the 2016 through 2018 period.  The impact of the settlement with respect to the Company’s self-insurance policies was not material to the Company’s financial statements, including cash flows and the effective tax rate.  As the settlement with the IRS was specific to the audit period, the settlement does not preclude the IRS from proposing similar adjustments to the Company’s self-insurance programs with respect to periods after 2018.  Management believes the positions the Company has taken in its U.S. tax returns are in accordance with the relevant tax laws.\nTax authorities in Denmark have issued tax assessments related to interest accrued by certain of the Company’s subsidiaries for the years 2004 through 2015, totaling approximately DKK 2.1 billion including applicable accrued interest (approximately $288 million based on the exchange rate as of December 31, 2024). Management believes the positions the Company has taken in Denmark are in accordance with the relevant tax laws and is actively defending them under appeal to the Danish National Tax Tribunal.  The Company intends on pursuing this matter to the Danish High Court and Danish Supreme Court should the current appeal be unsuccessful.  While the ultimate resolution is uncertain and may take years to resolve, taking into account the provisions and payments the Company has previously made related to these assessments to mitigate further interest accrual claims, the Company does not expect the resolution of this matter to have a future material adverse impact on the Company’s financial statements, including its cash flow and effective tax rate.\nThe Company expects its 2025 effective tax rate to be approximately 17.5% which is higher than the 2024 rate due primarily to the impact of net discrete tax benefits on the 2024 effective tax rate.  \nThe OECD introduced Global Anti-Base Erosion and Profit Shifting (“BEPS”) Pillar 2 rules with new taxing mechanisms under which multi-national entities would pay a minimum level of tax.  Numerous countries, including European Union member states, have enacted or are expected to enact related legislation, with general implementation of a global minimum tax as of January 1, 2025.  The Company continues to monitor the impact of these new rules but does not anticipate that they will have a material impact on the Company’s effective tax rate.\nAny future legislative changes in the United States and/or potential tax reform in other jurisdictions could cause the Company’s effective tax rate to differ from this estimate.  Refer to Note 7 to the Consolidated Financial Statements for additional information related to income taxes.\nDISCONTINUED OPERATIONS\nAs further discussed in Note 3 to the Consolidated Financial Statements, discontinued operations includes the results of the Veralto business which was disposed on the first day of the fourth quarter of 2023.\nIn 2023, earnings from discontinued operations, net of income taxes, were $543 million and reflected the operating results of the Veralto businesses prior to the Separation, net of certain costs associated with the Separation including costs related to establishing Veralto as a stand-alone entity and related legal, accounting and investment banking fees.  In 2022, earnings from discontinued operations, net of income taxes, were $881 million and reflect the operations of Veralto. \nCOMPREHENSIVE INCOME\nComprehensive income decreased by approximately $2.5 billion in 2024 as compared to 2023, primarily driven by the impact of losses from foreign currency translation adjustments in 2024 compared to gains in 2023 and lower net earnings in 2024 compared to 2023, partially offset by an increase in income from pension and postretirement plan benefit adjustments in 2024 compared to 2023.  The Company recorded a foreign currency translation loss of approximately $1.5 billion for 2024 compared to a gain of $215 million for 2023.  The foreign currency translation losses recorded in 2024 were primarily driven by the change in the exchange rates between the U.S. dollar and the Swedish krona.  Foreign currency translation adjustments reflect the gain or loss resulting from the impact of the change in currency exchange rates on the Company’s foreign operations as they are translated to the Company’s reporting currency, the U.S. dollar.  The Company recorded a pension and postretirement plan benefit gain of $101 million for 2024 compared to a loss of $51 million for 2023.  The Company recorded losses from cash flow hedge adjustments related to the Company’s derivative contracts in 2024 of $113 million compared to $14 million in 2023.\n43\nTable of Contents\nFINANCIAL INSTRUMENTS AND RISK MANAGEMENT\nThe Company is exposed to market risk from changes in interest rates, currency exchange rates, equity prices and commodity prices as well as credit risk, each of which could impact its Consolidated Financial Statements.  The Company generally addresses its exposure to these risks through its normal operating and financing activities.  The Company also periodically uses derivative financial instruments to manage currency exchange risks and interest rate risks.  In addition, the Company’s broad-based business activities help to reduce the impact that volatility in any particular area or related areas may have on its financial statements as a whole.\nInterest Rate Risk\nThe Company manages interest cost using a mixture of fixed-rate and at times variable-rate debt.  A change in interest rates on fixed-rate debt impacts the fair value of the debt but not the Company’s earnings or cash flow because the interest on such debt is fixed.  Generally, the fair market value of fixed-rate debt will increase as interest rates fall and decrease as interest rates rise.  As of December 31, 2024, an increase of 100 basis points in interest rates would have decreased the fair value of the Company’s fixed-rate long-term debt by approximately $1.2 billion.\nAs of December 31, 2024, the Company had no variable-rate debt obligations, however, the interest rates of the Company’s euro-based commercial paper borrowings are fixed based on short-term market rates at the time of issuance (refer to Note 13 to the Consolidated Financial Statements for information regarding the Company’s outstanding commercial paper balances as of December 31, 2024).  As these shorter duration obligations mature, the Company expects to issue additional short-term commercial paper obligations to refinance all or part of these borrowings, to the extent commercial paper markets are available.  As a result, the Company’s primary interest rate exposure results from changes in short-term interest rates.  In 2024, the average annual interest rate associated with the Company’s outstanding commercial paper borrowings was approximately 4.0%.  A hypothetical increase of this average by 100 basis points would have increased the Company’s 2024 interest expense by approximately $11 million.\nRefer to Note 14 for discussion of the Company’s cross-currency swap derivative contracts and interest rate swap agreements.\nCurrency Exchange Rate Risk\nThe Company faces transactional exchange rate risk from transactions with customers in countries outside the United States and from intercompany transactions between affiliates.  Transactional exchange rate risk arises from the purchase and sale of goods and services in currencies other than Danaher’s functional currency or the functional currency of its applicable subsidiary.  The Company also faces translational exchange rate risk related to the translation of financial statements of its foreign operations into U.S. dollars, Danaher’s functional currency.  Costs incurred and sales recorded by subsidiaries operating outside of the United States are translated into U.S. dollars using exchange rates effective during the respective period.  As a result, the Company is exposed to movements in the exchange rates of various currencies against the U.S. dollar.  In particular, the Company has more sales in European currencies than it has expenses in those currencies.  Therefore, when European currencies strengthen or weaken against the U.S. dollar, operating profits are increased or decreased, respectively.  The effect of a change in currency exchange rates on the Company’s net investment in non-U.S. subsidiaries is reflected in the accumulated other comprehensive income (loss) component of stockholders’ equity. \nCurrency exchange rates negatively impacted 2024 reported sales on a year-over-year basis primarily due to the strengthening of the U.S. dollar against most major currencies during 2024.  Strengthening of the U.S. dollar against other major currencies in 2025 compared to the exchange rates in effect as of December 31, 2024 would adversely impact the Company’s sales and results of operations on an overall basis.  Any weakening of the U.S. dollar against other major currencies in 2025 compared to the exchange rates in effect as of December 31, 2024 would positively impact the Company’s sales and results of operations.\nThe Company has generally accepted the exposure to exchange rate movements without using derivative financial instruments to manage this transactional exchange risk, although the Company has used foreign currency-denominated debt and cross-currency swaps to hedge a portion of its net investments in non-U.S. operations against adverse movements in exchange rates.  Both positive and negative movements in currency exchange rates against the U.S. dollar will continue to affect the reported amount of sales and net earnings in the Company’s Consolidated Financial Statements.  In addition, the Company has assets and liabilities held in foreign currencies.  A 10% depreciation in major currencies relative to the U.S. dollar as of December 31, 2024 would have reduced foreign currency-denominated net assets and stockholders’ equity by approximately $1.6 billion.  Refer to Note 14 to the Consolidated Financial Statements for information regarding the Company’s hedging of a portion of its net investment in non-U.S. operations.  \n44\nTable of Contents\nEquity Price Risk\nThe Company’s investment portfolio from time to time includes publicly-traded equity securities that are sensitive to fluctuations in market price.  As of December 31, 2024, the Company held $3 million of publicly-traded equity securities, excluding equity-method investments.  Additionally, the Company holds non-marketable equity investments in privately held companies that may be impacted by equity price risks.  These non-marketable equity investments are accounted for under the Fair Value Alternative method with changes in fair value recorded in earnings.  Volatility in the equity markets or other fair value considerations could affect the value of these investments and require losses or gains to be recognized in earnings.  R\nefer to \nNote 11\n to the Consolidated Financial Statements for additional information regarding the Company’s equity investments.\nCommodity Price Risk\nFor a discussion of risks relating to commodity prices, refer to “Item 1A. Risk Factors.”\nCredit Risk\nThe Company is exposed to potential credit losses in the event of nonperformance by counterparties to its financial instruments.  Financial instruments that potentially subject the Company to credit risk consist of cash and temporary investments, receivables from customers and derivatives.  The Company places cash and temporary investments with various high-quality financial institutions throughout the world and exposure is limited at any one institution.  Although the Company typically does not obtain collateral or other security to secure these obligations, it does regularly monitor the third-party depository institutions that hold its cash and cash equivalents.  The Company’s emphasis is primarily on safety and liquidity of principal and secondarily on maximizing yield on those funds.\nIn addition, concentrations of credit risk arising from receivables from customers are limited due to the diversity of the Company’s customers.  The Company’s businesses perform credit evaluations of their customers’ financial conditions as deemed appropriate and also obtain collateral or other security when deemed appropriate.\nThe Company enters into derivative transactions infrequently and typically with high-quality financial institutions, so that exposure at any one institution is limited.\nLIQUIDITY AND CAPITAL RESOURCES\nManagement assesses the Company’s liquidity in terms of its ability to generate cash to fund its operating, investing and financing activities.  The Company continues to generate substantial cash from operating activities and believes that its operating cash flow, cash on hand and other sources of liquidity will be sufficient to allow it to continue investing in existing businesses (including capital expenditures), consummating strategic acquisitions and investments, paying interest and servicing debt, paying dividends and funding restructuring activities, as well as to repurchase common stock when deemed appropriate and manage its capital structure on a short-term and long-term basis.\nThe Company has relied primarily on borrowings under its commercial paper program to address liquidity requirements that exceed the capacity provided by its operating cash flows and cash on hand, while also accessing the capital markets from time to time including to secure financing for more significant acquisitions.  Subject to any limitations that may result from market disruptions, the Company anticipates following the same approach in the future.\n45\nTable of Contents\nOverview of Cash Flows and Liquidity\nFollowing is an overview of the Company’s cash flows and liquidity for the years ended December 31:\n($ in millions)\n2024\n2023\n2022\nTotal operating cash flows provided by continuing operations\n$\n6,688 \n$\n6,490 \n$\n7,613 \nCash paid for acquisitions\n$\n(558)\n$\n(5,610)\n$\n(582)\nPayments for additions to property, plant and equipment\n(1,392)\n(1,383)\n(1,118)\nProceeds from sales of property, plant and equipment\n13 \n12 \n9 \nPayments for purchases of investments\n(331)\n(172)\n(523)\nProceeds from sales of investments\n253 \n61 \n18 \nAll other investing activities\n34 \n44 \n51 \nTotal cash used in investing activities from continuing operations\n(1,981)\n(7,048)\n(2,145)\nTotal investing cash used in discontinued operations\n— \n(33)\n(89)\nNet cash used in investing activities\n$\n(1,981)\n$\n(7,081)\n$\n(2,234)\nProceeds from the issuance of common stock in connection with stock-based compensation\n$\n162 \n$\n68 \n$\n31 \nPayment of dividends\n(768)\n(821)\n(818)\nNet proceeds from (repayments of) borrowings (maturities of 90 days or less)\n5 \n(1,006)\n(723)\nRepayments of borrowings (maturities longer than 90 days)\n(1,674)\n(620)\n(965)\nDistribution from discontinued operations\n— \n2,600 \n— \nPayments for repurchase of common stock\n(5,979)\n— \n— \nAll other financing activities\n(131)\n(67)\n(95)\nNet cash (used in) provided by financing activities for continuing operations\n(8,385)\n154 \n(2,570)\nCash distributions to Veralto Corporation, net\n— \n(427)\n— \nNet cash used in financing activities\n$\n(8,385)\n$\n(273)\n$\n(2,570)\n \nAs of December 31, 2024, the Company held approximately $2.1 billion of cash and cash equivalents.  \nOperating Activities\nCash flows from operating activities can fluctuate significantly from period-to-period as working capital needs and the timing of payments for income taxes, restructuring activities and productivity improvement initiatives, pension funding and other items impact reported cash flows.\nOperating cash flows from continuing operations were approximately $6.7 billion for 2024, an increase of $198 million, or 3%, as compared to 2023.  The year-over-year change in operating cash flows from 2023 to 2024 was primarily attributable to the following factors:\n•\n2024 operating cash flows from continuing operations reflected a decrease of $322 million in net earnings from continuing operations in 2024 as compared to 2023.  \n•\nNet earnings from continuing operations for 2024 also included $248 million higher noncash charges for impairments, intangible asset amortization, depreciation and amortization of an acquisition-related inventory step-up compared to 2023, net of a decrease in unrealized investment gains/losses and stock compensation expense in 2024 as compared to 2023.  Amortization expense primarily relates to the amortization of intangible assets and inventory fair value adjustments.  Depreciation expense relates to both the Company’s manufacturing and operating facilities as well as instrumentation leased to customers under operating-type lease (“OTL”) arrangements.  Depreciation, amortization, impairments and stock compensation are noncash expenses that decrease earnings without a corresponding impact to operating cash flows.  Unrealized investment gains/losses impact net earnings from continuing operations without immediately impacting cash flows as the cash flow impact from investments occurs when the invested capital is returned to the Company.  \n46\nTable of Contents\n•\nThe aggregate of trade accounts receivable, inventories and trade accounts payable provided $497 million in operating cash flows from continuing operations during 2024, compared to $358 million of operating cash flows generated in 2023.  The amount of cash flow generated from or used by the aggregate of trade accounts receivable, inventories and trade accounts payable depends upon how effectively the Company manages the cash conversion cycle, which effectively represents the number of days that elapse from the day it pays for the purchase of raw materials and components to the collection of cash from its customers and can be significantly impacted by the timing of collections and payments in a period.\n•\nThe aggregate of prepaid expenses and other assets, deferred income taxes and accrued expenses and other liabilities used $695 million in operating cash flows during 2024, compared to $828 million used in 2023.  The timing of cash payments and refunds for taxes and the impact of deferred tax benefits and charges, various employee-related liabilities, customer funding and accrued expenses drove the majority of this change.\nInvesting Activities\nCash flows relating to investing activities consist primarily of cash used for capital expenditures, including instruments leased to customers, acquisitions, investments and cash proceeds from divestitures of businesses or assets.\nNet cash used in investing activities was approximately $2.0 billion during 2024 compared to approximately $7.1 billion of net cash used in 2023.\nAcquisitions, Divestitures and Sale of Investments\nFor a discussion of the Company’s acquisitions and divestitures refer to “—Overview” and Notes 2 and 3 to the Consolidated Financial Statements.  In addition, in 2024 and 2023, the Company invested $331 million and $172 million, respectively, in non-marketable equity securities and partnerships. \nCapital Expenditures\nThough the relative significance of particular categories of capital investment can change from period to period, capital expenditures are typically made for increasing manufacturing capacity, the manufacture of instruments that are used in OTL arrangements, purchases of buildings, replacing equipment, supporting new product development and improving information technology systems.  Capital expenditures totaled approximately $1.4 billion in both 2024 and 2023.  \nDuring 2021, certain agencies of the U.S. government, including the Biomedical Advanced Research and Development Authority (“BARDA”) within the U.S. Department of Health and Human Services, agreed to finance an expansion of production capacity related to chromatography, liquid cell culture media, buffers and cell culture powder media and single-use consumables at certain of the Company’s Biotechnology businesses and the development of diagnostics testing technologies and the expansion of testing production capacity at certain of the Company’s Diagnostics businesses.  The Company’s businesses may enter into similar agreements in the future.  In consideration of this financing, the U.S. government has certain rights, including rights with respect to the allocation of certain of the incremental production capacity associated with such expansion and/or rights in intellectual property produced with its financial assistance.  The amount awarded pursuant to these grants in 2021 totaled $568 million and is being paid over periods ranging from one year to four years.  In 2024 and 2023, the Company recorded amounts related to these grants and other government assistance that offset operating expenses of $43 million and $51 million, respectively, and purchases of property, plant and equipment of $198 million and $136 million, respectively.  Property, plant and equipment purchased using funds provided by governments are recorded net of government assistance. \nFinancing Activities\nCash flows from financing activities consist primarily of cash flows associated with the issuance and repayments of commercial paper, issuance and repayment of long-term debt, borrowings under committed credit facilities, issuance and repurchases of common stock, issuance of preferred stock, payments of cash dividends to shareholders and proceeds from the Separation.  Financing activities used cash of approximately $8.4 billion during 2024 compared to $273 million of cash used during 2023.  The year-over-year increase in cash used by financing activities was due primarily to the repurchase of approximately $6.0 billion of the Company’s common stock in 2024, compared to the approximately $2.6 billion Veralto Distribution received in 2023 in connection with the Separation.  In 2025, the Company anticipates paying approximately $60 million of excise tax related to the 2024 share repurchases. \nTotal debt was approximately $16.0 billion and $18.4 billion as of December 31, 2024 and 2023, respectively, including notes payable and current portion of long-term debt of $505 million and approximately $1.7 billion as of December 31, 2024 and 2023, respectively.  As of December 31, 2024, the Company had the ability to incur approximately $4.0 billion of additional indebtedness in direct borrowings or under the outstanding commercial paper facilities based on the amounts available under the Company’s $5.0 billion unsecured, multiyear revolving credit facility (“Credit Facility”) which were not being used to backstop outstanding commercial paper balances.  As of December 31, 2024, the Company has classified \n47\nTable of Contents\napproximately $1.0 billion of its borrowings outstanding under the euro-denominated commercial paper program as long-term debt in the Consolidated Balance Sheet as the Company has the intent and ability, as supported by availability under the Credit Facility, to refinance these borrowings for at least one year from the balance sheet date.  As commercial paper obligations mature, the Company expects to issue additional short-term commercial paper obligations to refinance all or part of these borrowings, to the extent commercial paper markets are available.  \nUnder the Company’s U.S. dollar and euro-denominated commercial paper program, the notes are typically issued at a discount from par, generally based on the ratings assigned to the Company by credit rating agencies at the time of the issuance and prevailing market rates measured by reference to the Secured Overnight Financing Rate or Euro Interbank Offer Rate, depending on the applicable currency of the borrowing.  \nR\nefer to \nNote 13\n to the Consolidated Financial Statements for additional information regarding the Company’s financing activities and indebtedness, including the Company’s outstanding debt as of December\n 31, 2024, and the \nCompany’s commercial paper program and Credit\n Facility\n.\nShelf Registration Statement\nThe Company has filed a “well-known seasoned issuer” shelf registration statement on Form S-3 with the SEC that registers an indeterminate amount of debt securities, common stock, preferred stock, warrants, depositary shares, purchase contracts and units for future issuance.  The Company expects to use net proceeds realized by the Company from future securities sales off this shelf registration statement for general corporate purposes, including without limitation repayment or refinancing of debt or other corporate obligations, acquisitions, capital expenditures, share repurchases, dividends and/or working capital.\nStock Repurchase Program\nPlease see Note 18 to the Consolidated Financial Statements for a description of the Company’s stock repurchase program and repurchases of common stock.\nDividends\nThe Company declared a regular quarterly cash dividend of $0.27 per share of Company common stock that was paid on January 31, 2025 to holders of record on December 27, 2024.  Aggregate 2024 and 2023 cash payments for dividends on Company common stock were $768 million and $778 million, respectively, and 2023 cash payments for the dividends on the Company’s MCPS were $43 million.  The year-over-year decrease in dividend payments in 2024 primarily related to lower dividends paid on the MCPS Series B as a result of their conversion into common shares in April 2023 and lower average common stock outstanding, partially offset by an increase in the quarterly dividend rate on common stock beginning with the dividend paid in the second quarter of 2024.\nCash and Cash Requirements\nAs of December 31, 2024, the Company held approximately $2.1 billion of cash and cash equivalents that were on deposit with financial institutions or invested in highly liquid investment-grade debt instruments with a maturity of 90 days or less with an approximate weighted average annual interest rate of 2.2%.  Of the cash and cash equivalents, $631 million was held within the U.S. and approximately $1.5 billion was held outside of the U.S.  The Company will continue to have cash requirements to support general corporate purposes, which may include working capital needs, capital expenditures, acquisitions and investments, paying interest and servicing debt, paying taxes and any related interest or penalties, funding its restructuring activities and pension plans as required, paying dividends to shareholders, repurchasing shares of the Company’s common stock and supporting other business needs.  \nThe Company generally intends to use available cash and internally generated funds to meet these cash requirements, but in the event that additional liquidity is required, the Company may also borrow under its commercial paper programs (if available) or borrow under the Company’s Credit Facility, enter into new credit facilities and either borrow directly thereunder or use such credit facilities to backstop additional borrowing capacity under its commercial paper programs (if available) and/or access the capital markets.  The Company also may from time to time seek to access the capital markets to take advantage of favorable interest rate environments or other market conditions.  \nWhile repatriation of some cash held outside the U.S. may be restricted by local laws, most of the Company’s foreign cash could be repatriated to the U.S.  Following enactment of the TCJA, in general, repatriation of cash to the U.S. can be completed with no incremental U.S. tax; however, repatriation of cash could subject the Company to non-U.S. taxes on distributions.  The cash that the Company’s non-U.S. subsidiaries hold for indefinite reinvestment is generally used to finance non-U.S. operations and investments, including acquisitions.  The income taxes, if any, that would be applicable to the repatriation of such earnings (including basis differences in our non-U.S. subsidiaries) are not readily determinable.  As of December 31, 2024, management believes that it has sufficient sources of liquidity to satisfy its cash needs, including its cash needs in the U.S.\n48\nTable of Contents\nDuring 2024, the Company contributed $8 million to its U.S. defined benefit pension plans and $37 million to its non-U.S. defined benefit pension plans.  During 2025, the Company’s cash contribution requirements for its U.S. and its non-U.S. defined benefit pension plans are forecasted to be approximately $8 million and $35 million, respectively.  The ultimate amounts to be contributed depend upon, among other things, legal requirements, underlying asset returns, the plan’s funded status, the anticipated tax deductibility of the contribution, local practices, market conditions, interest rates and other factors.\nContractual and Other Obligations\nFor a description of the Company’s debt and lease obligations, commitments, and litigation and contingencies, refer to Notes 9, 13, 16 and 17 to the Consolidated Financial Statements.\nLegal Proceedings\nRefer to Note 17 to the Consolidated Financial Statements for information regarding legal proceedings and contingencies, and for a discussion of risks related to legal proceedings and contingencies, refer to “Item 1A. Risk Factors.”\nCRITICAL ACCOUNTING ESTIMATES\nManagement’s discussion and analysis of the Company’s financial condition and results of operations is based upon the Company’s Consolidated Financial Statements, which have been prepared in accordance with GAAP.  The preparation of these financial statements requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities.  The Company bases these estimates and judgments on historical experience, the current economic environment and on various other assumptions that are believed to be reasonable under the circumstances.  Actual results may differ materially from these estimates and judgments.\nThe Company believes the following accounting estimates are most critical to an understanding of its financial statements.  Estimates are considered to be critical if they meet both of the following criteria: (1) the estimate requires assumptions about material matters that are uncertain at the time the estimate is made, and (2) material changes in the estimate are reasonably likely from period-to-period.  For a detailed discussion on the application of these and other accounting estimates, refer to Note 1 to the Consolidated Financial Statements.\nAcquired Intangibles\n—The Company’s business acquisitions typically result in the recognition of goodwill, developed technology and other intangible assets, which affect the amount of future period amortization expense and possible impairment charges that the Company may incur.  The fair values of acquired intangibles are determined using information available near the acquisition date based on estimates and assumptions that are deemed reasonable by the Company.  Significant assumptions include the discount rates and certain assumptions that form the basis of the forecasted results of the acquired business including earnings before interest, taxes, depreciation and amortization (“EBITDA”), revenue, revenue growth rates, royalty rates and technology obsolescence rates.  These assumptions are forward looking and could be affected by future economic and market conditions.  The Company engages third-party valuation specialists who review the Company’s critical assumptions and calculations of the fair value of acquired intangible assets in connection with significant acquisitions.  In connection with the acquisitions that occurred during the year ended December 31, 2024, the Company recognized aggregate goodwill of $305 million and intangible assets of $419 million.  Refer to Notes 1, 2 and 10 to the Consolidated Financial Statements for a description of the Company’s policies relating to goodwill, acquired intangibles and acquisitions.\nIn performing its goodwill impairment testing, the Company estimates the fair value of its reporting units primarily using a market-based approach which relies on current trading multiples of forecasted EBITDA for companies operating in businesses similar to each of the Company’s reporting units to calculate an estimated fair value of each reporting unit.  In evaluating the estimates derived by the market-based approach, management makes judgments about the relevance and reliability of the multiples by considering factors unique to its reporting units, including operating results, business plans, economic projections, anticipated future cash flows, and transactions and marketplace data as well as judgments about the comparability of the market proxies selected.  There are inherent uncertainties related to these assumptions and management’s judgment in applying them to the analysis of goodwill impairment. \nAs of December 31, 2024, the Company had five reporting units for goodwill impairment testing.  Reporting units resulting from recent acquisitions generally present the highest risk of impairment.  Management believes the impairment risk associated with these reporting units generally decreases as these businesses are integrated into the Company and better positioned for potential future earnings growth.  The Company’s annual goodwill impairment analysis in 2024 indicated that in all instances, the fair values of the Company’s reporting units exceeded their carrying values and consequently did not result in an impairment charge.  The excess of the estimated fair value over carrying value (expressed as a percentage of carrying value for the respective reporting unit) for each of the Company’s reporting units as of the annual testing date ranged from approximately 70% to approximately 450%.  To evaluate the sensitivity of the \n49\nTable of Contents\nfair value calculations used in the goodwill impairment test, the Company applied a hypothetical 10% decrease to the fair values of each reporting unit and compared those hypothetical values to the reporting unit carrying values.  Based on this hypothetical 10% decrease, the excess of the estimated fair value over carrying value (expressed as a percentage of carrying value for the respective reporting unit) for each of the Company’s reporting units ranged from approximately 55% to approximately 395%.\nThe Company reviews identified intangible assets for impairment whenever events or changes in circumstances indicate that the related carrying amounts may not be recoverable.  Determining whether an impairment loss occurred for finite-lived intangibles requires a comparison of the carrying amount to the sum of undiscounted cash flows expected to be generated by the asset.  These analyses require management to make judgments and estimates about future revenues, expenses, market conditions and discount rates related to these assets.  Indefinite-lived intangibles are subject to impairment testing at least annually or more frequently if events or changes in circumstances indicate that potential impairment exists.  Determining whether an impairment loss occurred for indefinite-lived intangible assets involves calculating the fair value of the indefinite-lived intangible assets and comparing the fair value to their carrying value.  If the fair value is less than the carrying value, the difference is recorded as an impairment loss.  \nIf actual results are not consistent with management’s estimates and assumptions, goodwill and other intangible assets may be overstated and a charge would need to be taken against net earnings which would adversely affect the Company’s financial statements. \nThe Company estimates the fair value of acquired trade names through the use of a relief from royalty method, which values an indefinite-lived intangible asset by estimating the royalties saved through the ownership of an asset.  Under this method, an owner of an indefinite-lived intangible asset determines the arm’s length royalty that likely would have been charged if the owner had to license the asset from a third party.  The royalty rate, which is based on the estimated rate applied against forecasted sales, is tax-effected and discounted at present value using a discount rate commensurate with the relative risk of achieving the cash flow attributable to the asset.  Management judgment is necessary to determine key assumptions, including revenue growth rates, perpetual revenue growth rates, royalty rates and discount rates.  As further described in Note 10 to the accompanying Consolidated Financial Statements, the Company recorded noncash impairment charges of $265 million pretax ($201 million after-tax) for the year ended December 31, 2024 related to an indefinite-lived trade name within the genomics consumable business included in the Life Sciences segment and an indefinite-lived trade name in the Diagnostics segment, which are included in selling, general and administrative expenses in the Consolidated Statement of Earnings.  Following these impacts, if the fair values of the trade names declined by 10%, the Company estimates it would record additional impairment charges of $59 million. \nContingent Liabilities\n—As discussed in “Item 3.  Legal Proceedings” and Note 17 to the Consolidated Financial Statements, the Company is, from time to time, subject to a variety of litigation and similar contingent liabilities incidental to its business (or the business operations of previously owned entities).  The Company recognizes a liability for any legal contingency or contract settlement expense that is known or probable of occurrence and reasonably estimable.  These assessments require judgments concerning matters such as litigation developments and outcomes, the anticipated outcome of negotiations, the number of future claims and the cost of both pending and future claims.  In addition, because most contingencies are resolved over long periods of time, liabilities may change in the future due to various factors, including those discussed in Note 17 to the Consolidated Financial Statements.  If the reserves established by the Company with respect to these contingent liabilities are inadequate, the Company would be required to incur an expense equal to the amount of the loss incurred in excess of the reserves, which would adversely affect the Company’s financial statements.  \nIncome Taxes\n—For a description of the Company’s income tax accounting policies, refer to Notes 1 and 7 to the Consolidated Financial Statements.  The Company establishes valuation allowances for its deferred tax assets if it is more likely than not that some or all of the deferred tax asset will not be realized.  This requires management to make judgments and estimates regarding: (1) the timing and amount of the reversal of taxable temporary differences, (2) expected future taxable income and (3) the impact of tax planning strategies.  Future changes to tax rates would also impact the amounts of deferred tax assets and liabilities and could have an adverse impact on the Company’s financial statements. \nThe Company provides for unrecognized tax benefits when, based upon the technical merits, it is “more likely than not” that an uncertain tax position will not be sustained upon examination.  Judgment is required in evaluating tax positions and determining income tax provisions.  The Company re-evaluates the technical merits of its tax positions and may recognize an uncertain tax benefit in certain circumstances, including when: (1) a tax audit is completed; (2) applicable tax laws change, including a tax case ruling or legislative guidance; or (3) the applicable statute of limitations expires.\n50\nTable of Contents\nIn addition, certain of the Company’s tax returns are currently under review by tax authorities including in Denmark and the United States (refer to “—Results of Operations—Income Taxes” and Note 7 to the Consolidated Financial Statements).  Management believes the positions taken in these returns are in accordance with the relevant tax laws and does not expect the resolution of these matters to have a future material adverse impact to the Company’s financial statements, including its cash flows and effective tax rate.  However, the outcome of these audits is uncertain.\nAn increase of 1.0% in the Company’s 2024 nominal tax rate would have resulted in an additional income tax provision for continuing operations for the year ended December 31, 2024 of $46 million.\nValuation of Investments in Equity Securities\n—For a description of the Company’s investments in equity securities and partnerships refer to Notes 1, 8 and 11 to the Consolidated Financial Statements.  The Company invests in publicly-traded securities, non-marketable securities of early-stage companies and equity method investments, including partnerships that invest primarily in early-stage companies.  \nInvestments in early-stage companies have significant risks, including uncertainty regarding the investee company’s ability to successfully develop new technologies and services, bring these new technologies and services to market and gain market acceptance, maintain adequate capitalization and access to cash or other forms of liquidity, and retain critical management personnel.  Refer to “Item 1A. Risk Factors” for a further discussion of the risks related to investing in early-stage companies. \nThe Company’s investments in publicly traded securities are measured at fair value based on quotes in active markets.  For investments in non-marketable equity securities where the Company does not have influence over the investee, the Company has elected the measurement alternative and records these investments at cost and adjusts the carrying value for impairments and observable price changes with a same or similar security from the same issuer adjusted to reflect the specific rights and preferences of the securities, if applicable.  Valuations of non-marketable equity securities are complex and require judgment due to the absence of market prices, lack of liquidity and the risks inherent in early-stage companies.  The uncertainty in the process of valuing securities for which a ready market does not exist may cause our estimated values of these securities to differ significantly from the values that would have been derived had a ready market for the securities existed, and those differences could be material.\nThe Company accounts for its investments in the partnerships using the equity method.  Accordingly, the investments are initially recorded at cost and adjusted each period for the Company’s share of the partnership’s income or loss and distributions received.  The partnerships’ investments are recorded by the partnerships on an estimated fair value basis and pose the same risks and require the same valuation judgments discussed above.  As a result, changes in the value of investments in the partnership will have a direct impact on the Company’s earnings.  Impairment losses for the partnerships are recognized to reduce the investment’s carrying value to its fair value if there is a decline in fair value below carrying value that is considered to be other-than-temporary.  To determine whether there is an other-than-temporary impairment, the Company uses qualitative and quantitative valuation methods.\nRealized and unrealized gains and losses for these investments in equity securities and partnerships are recorded in other income (expense), net, in the Consolidated Statements of Earnings.  A 10% decrease in the carrying value of the Company’s investments in equity securities and partnerships as of December 31, 2024 would result in a loss of approximately $156 million.\nNEW ACCOUNTING STANDARDS\nFor a discussion of the new accounting standards impacting the Company, refer to Note 1 to the Consolidated Financial Statements.",
  "item2": null
}