{
  "source_file": "dis-20250628.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nORGANIZATION OF INFORMATION\nManagement’s Discussion and Analysis provides a narrative of the Company’s financial performance and condition that should be read in conjunction with the accompanying financial statements. It includes the following sections:\n•\nConsolidated Results\n•\nCurrent Quarter Results Compared to Prior-Year Quarter\n•\nCurrent Nine-Month Period Results Compared to Prior-Year Nine-Month Period\n•\nSeasonality\n•\nBusiness Segment Results\n•\nCorporate and Unallocated Shared Expenses\n•\nFinancial Condition\n•\nMarket Risk\n•\nCommitments and Contingencies\n•\nOther Matters\n•\nDTC Product Descriptions, Key Definitions and Supplemental Information\n•\nSupplemental Guarantor Financial Information\nCONSOLIDATED RESULTS\nQuarter Ended\n% Change\nBetter\n(Worse)\nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions, except per share data)\nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nRevenues:\nServices\n$\n21,214\n \n$\n20,836\n \n2  %\n$\n64,520\n \n$\n61,568\n \n5  %\nProducts\n2,436\n \n2,319\n \n5  %\n7,441\n \n7,219\n \n3  %\nTotal revenues\n23,650\n \n23,155 \n2  %\n71,961\n \n68,787 \n5  %\nCosts and expenses:\nCost of services (exclusive of depreciation and amortization)\n(\n13,034\n)\n(\n13,236\n)\n2  %\n(\n40,201\n)\n(\n39,821\n)\n(1) %\nCost of products (exclusive of depreciation and amortization)\n(\n1,498\n)\n(\n1,473\n)\n(2) %\n(\n4,547\n)\n(\n4,647\n)\n2  %\nSelling, general, administrative and other\n(\n4,141\n)\n(\n3,872\n)\n(7) %\n(\n12,052\n)\n(\n11,445\n)\n(5) %\nDepreciation and amortization\n(\n1,332\n)\n(\n1,220\n)\n(9) %\n(\n3,932\n)\n(\n3,705\n)\n(6) %\nTotal costs and expenses\n(20,005)\n(19,801)\n(1) %\n(60,732)\n(59,618)\n(2) %\nRestructuring and impairment charges\n(\n185\n)\n—\n \nnm\n(\n437\n)\n(\n2,052\n)\n79  %\nOther expense\n—\n \n(\n65\n)\n100  %\n—\n \n(\n65\n)\n100  %\nInterest expense, net\n(\n324\n)\n(\n342\n)\n5  %\n(\n1,037\n)\n(\n899\n)\n(15) %\nEquity in the income of investees\n75\n \n146\n \n(49) %\n203\n \n   \n468\n \n   \n(57) %\nIncome before income taxes\n3,211\n \n3,093 \n4  %\n9,958\n \n6,621 \n50  %\nIncome taxes\n2,732\n \n(\n251\n)\nnm\n2,030\n \n(\n1,412\n)\nnm\nNet income\n5,943\n \n2,842 \n>100  %\n11,988\n \n5,209 \n>100  %\nNet income attributable to noncontrolling interests\n(\n681\n)\n(\n221\n)\n>(100) %\n(\n897\n)\n(\n697\n)\n(29) %\nNet income attributable to Disney\n$\n5,262\n \n$\n2,621 \n>100  %\n$\n11,091\n \n$\n4,512 \n>100  %\nDiluted earnings per share attributable to Disney\n$\n2.92\n \n$\n1.43 \n>100  %\n$\n6.12\n \n$\n2.46 \n>100  %\nStar India Transaction\nOn November 14, 2024, the Company and RIL completed the Star India Transaction (see Note 4 to the Condensed Consolidated Financial Statements) following which the Company began recognizing its 37% share of the India joint venture’s \n34\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nresults in “Equity in the income of investees.” Star India results through November 14, 2024 were consolidated in the Company’s financial results and reported in the Entertainment and Sports segments.\nCURRENT QUARTER RESULTS COMPARED TO PRIOR-YEAR QUARTER\nRevenues for the quarter increased 2%, or $0.5 billion, to $23.7 billion; net income attributable to Disney increased to $5.3 billion compared to $2.6 billion in the prior-year quarter; and diluted earnings per share (EPS) attributable to Disney increased to $2.92 compared to $1.43 in the prior-year quarter. The net income and EPS increases were due to a lower effective tax rate in the current quarter due to a non-cash tax benefit recognized upon the change in Hulu’s U.S. income tax classification, partially offset by an incremental payment to acquire Hulu. In addition, the increases in net income and EPS were due to higher operating income at Experiences and Sports, partially offset by lower operating income at Entertainment.\nRevenues\nService revenues for the quarter increased 2%, or $0.4 billion, to $21.2 billion, which included an approximate 3 percentage point decrease from the Star India Transaction. Aside from this impact, service revenues increased due to higher subscription revenue and growth at our parks and experiences businesses.\nProduct revenues for the quarter increased 5%, or $0.1 billion, to $2.4 billion due to growth at our parks and experiences businesses.\nCosts and expenses\nCost of services for the quarter decreased 2%, or $0.2 billion, to $13.0 billion, which included an approximate 7 percentage point decrease due to the Star India Transaction. This decrease was partially offset by higher programming and production costs and, to a lesser extent, the impact of inflation and increased volumes at our parks and experiences businesses.\nSelling, general, administrative and other costs increased 7%, or $0.3 billion, to $4.1 billion, which included an approximate 2 percentage point decrease due to the Star India Transaction. Aside from this impact, selling, general, administrative and other costs increased driven by higher marketing costs.\nDepreciation and amortization increased 9%, or $0.1 billion, to $1.3 billion driven by higher depreciation at our parks and experiences businesses.\nRestructuring and impairment charges\nCharges in the current quarter were $185 million primarily for an impairment of an equity investment.\nOther expense\nIn the prior-year quarter, the Company recorded a charge of $65 million related to a legal ruling.\nInterest expense, net \nInterest expense, net is as follows:\nQuarter Ended\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\n% Change\nBetter (Worse)\nInterest expense\n$\n(438)\n$\n(509)\n14  %\nInterest income, investment income and other\n114\n \n   \n167 \n   \n(32) %\nInterest expense, net\n$\n(324)\n$\n(342)\n5  %\nThe decrease in interest expense was due to lower average debt balances and rates, partially offset by a decrease in capitalized interest.\nThe decrease in interest income, investment income and other was due to an unfavorable comparison related to pension and postretirement benefit costs, other than service cost.\nEquity in the Income of Investees\nIncome from equity investees decreased $71 million, to $75 million from $146 million, primarily due to a loss from the India joint venture in the current quarter. \n35\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nIncome Taxes\nQuarter Ended\nJune 28,\n2025\nJune 29,\n2024\nIncome before income taxes\n$\n3,211\n \n      \n$\n3,093 \n      \nIncome tax (benefit) expense\n(2,732)\n      \n251 \n      \nEffective income tax rate\n(85.1)\n%  \n8.1\n%\nThe effective income tax rate was negative 85.1% in the current quarter compared to a positive effective income tax rate of 8.1% in the prior-year quarter. The current quarter included a $3.3 billion non-cash tax benefit recognized upon the change in Hulu’s U.S. income tax classification. Aside from the $3.3 billion benefit, both the current and prior-year quarters reflected favorable adjustments related to prior year tax matters.\nNoncontrolling Interests\nQuarter Ended\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\n% Change\nBetter (Worse) \nNet income attributable to noncontrolling interests\n$\n(681)\n$\n(221)\n>(100) %\nThe increase in net income attributable to noncontrolling interests was due to an incremental payment to acquire Hulu.\nNet income attributable to noncontrolling interests is determined on income after royalties and management fees, financing costs and income taxes, as applicable.\nCertain Items Impacting Results in the Quarter\nResults for the quarter ended June 28, 2025 were impacted by the following:\n•\nA $3,277 million non-cash tax benefit recognized upon the change in Hulu’s U.S. income tax classification recognized in “Income taxes” and $477 million recognized in “Net income attributable to noncontrolling interests” related to the acquisition of Hulu (Hulu Transaction Impacts) (see Note 4 to the Condensed Consolidated Financial Statements)\n•\nTFCF and Hulu Acquisition Amortization of $395 million\n•\nRestructuring and impairment charges of $185 million \nResults for the quarter ended June 29, 2024 were impacted by the following:\n•\nIncome tax reserve adjustments of $418 million\n•\nTFCF and Hulu Acquisition Amortization of $397 million\n•\nOther expense of $65 million related to a legal ruling\nA summary of the impact of these items on EPS is as follows:\n(in millions, except per share data)\nPre-Tax Income (Loss)\nTax Benefit (Expense)\n(1)\nAfter-Tax Income (Loss)\nEPS Favorable (Adverse)\n(2)\nQuarter Ended June 28, 2025:\nHulu Transaction Impacts\n$\n— \n   \n$\n3,277 \n \n$\n3,277 \n$\n1.56 \n   \nTFCF and Hulu Acquisition Amortization\n(395)\n   \n92 \n   \n(303)\n(0.16)\nRestructuring and impairment charges\n(185)\n   \n43 \n   \n(142)\n(0.08)\nTotal\n$\n(580)\n$\n3,412 \n \n$\n2,832 \n$\n1.31 \nQuarter Ended June 29, 2024:\nIncome tax reserve adjustments\n$\n— \n$\n418 \n \n$\n418 \n$\n0.23 \n   \nTFCF and Hulu Acquisition Amortization\n(397)\n   \n93 \n   \n(304)\n(0.16)\nOther expense\n(65)\n11 \n \n(54)\n(0.03)\n   \nTotal\n$\n(462)\n$\n522 \n$\n60 \n$\n0.04 \n(1)\nTax benefit (expense) amounts are determined using the tax rate applicable to the individual item.\n(2)\nEPS is net of noncontrolling interest share, where applicable. Total may not equal the sum of the column due to rounding.\n36\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nCURRENT NINE-MONTH PERIOD RESULTS COMPARED TO PRIOR-YEAR NINE-MONTH PERIOD\nRevenues for the current period increased $3.2 billion, to $72.0 billion; net income attributable to Disney increased $6.6 billion, to $11.1 billion; and EPS increased to $6.12 from $2.46 in the prior-year period. The net income and EPS increases were due to a lower effective tax rate in the current period compared to the prior-year period and the comparison to goodwill impairments in the prior-year period. In addition, the increases in net income and EPS were due to higher operating income at Entertainment, partially offset by an incremental payment to acquire Hulu. The lower effective tax rate was due to a non-cash tax benefit recognized in the current period upon the change in Hulu’s U.S. income tax classification.\nRevenues\nService revenues for the current period increased 5%, or $3.0 billion to $64.5 billion, which included an approximate 3 percentage point unfavorable impact from the Star India Transaction. Aside from this impact, service revenues increased due to higher subscription revenue, growth at our parks and experiences businesses, an increase in theatrical distribution revenue, and, to a lesser extent, higher advertising revenue.\nProduct revenues for the current period increased 3%, or $0.2 billion, to $7.4 billion, due to growth at our parks and experiences businesses.\nCosts and expenses\nCost of services for the current period increased 1%, or $0.4 billion, to $40.2 billion, which included an approximate 5 percentage point decrease due to the Star India Transaction. Aside from this impact, cost of services increased due to higher programming and production costs and, to a lesser extent, the impact of inflation and increased volumes at our parks and experiences businesses.\nSelling, general, administrative and other costs increased 5%, or $0.6 billion, to $12.1 billion, which included an approximate 2 percentage point decrease due to the Star India Transaction. Aside from this impact, selling, general, administrative and other costs increased primarily due to higher marketing costs.\nDepreciation and amortization increased 6%, or $0.2 billion, to $3.9 billion due to higher depreciation at our parks and experiences businesses.\nRestructuring and impairment charges\nCharges in the current period were \n$185 million\n primarily for an impairment of an equity investment, \n$143 million for impairment of goodwill related to Star India and $109 million for content impairments\n. Charges in t\nhe prior-year period were $2,052 million primarily for goodwill impairments related to Star India and entertainment linear networks.\nOther expense\nIn the prior-year period, the Company recorded a charge of $65 million related to a legal ruling.\nInterest expense, net \nInterest expense, net is as follows:\nNine Months Ended\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\n% Change\nBetter (Worse)\nInterest expense\n$\n(1,396)\n$\n(1,538)\n9  %\nInterest income, investment income and other\n359\n \n   \n639 \n   \n(44) %\nInterest expense, net\n$\n(1,037)\n$\n(899)\n(15) %\nThe decrease in interest expense was due to lower average rates and debt balances, partially offset by a decrease in capitalized interest.\nThe decrease in interest income, investment income and other reflected the impact of lower cash and cash equivalent balances, an unfavorable comparison of pension and postretirement benefit costs, other than service cost, and a net investment loss in the current period compared to a net investment gain in the prior-year period.\nEquity in the Income of Investees\nIncome from equity investees decreased $265 million, to $203 million from $468 million, due to losses from the India joint venture in the current period and lower income from A+E.\n37\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nIncome Taxes\nNine Months Ended\nJune 28,\n2025\nJune 29,\n2024\nIncome before income taxes\n$\n9,958\n \n  \n$\n6,621 \n    \nIncome tax (benefit) expense\n(2,030)\n  \n1,412 \n    \nEffective income tax rate\n(20.4)\n% \n21.3\n%\nThe effective income tax rate was negative 20.4% in the current period compared to a positive effective income tax rate of 21.3% in the prior-year period. The current period included a $3.3 billion non-cash tax benefit recognized upon the change in Hulu’s U.S. income tax classification. Aside from the $3.3 billion benefit, both the current and prior-year periods reflected favorable adjustments related to prior year tax matters. The effective income tax rate in the prior-year period also reflected an unfavorable impact of approximately 5 percentage points from goodwill impairments, which are not tax deductible.\nNoncontrolling Interests\nNine Months Ended\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\n% Change\nBetter (Worse) \nNet income attributable to noncontrolling interests\n$\n(897)\n$\n(697)\n(29) %\nThe increase in net income attributable to noncontrolling interests was due to an incremental payment to acquire Hulu, partially offset by the accretion of NBC Universal’s interest in Hulu in the prior-year period and, to a lesser extent, lower results at ESPN, Hong Kong Disneyland Resort and Shanghai Disney Resort.\nCertain Items Impacting Results in the Nine Month Period\nResults for the nine months ended June 28, 2025 were impacted by the following:\n•\nHulu Transaction Impacts of $3,277 million recognized in “Income taxes” and $477 million recognized in “Net income attributable to noncontrolling interests”\n•\nResolution of a prior-year tax matter of $1,016 million\n•\nTFCF and Hulu Acquisition Amortization of $1,188 million\n•\nRestructuring and impairment charges of $437 million and a non-cash tax expense of $244 million \nResults for the nine months ended June 29, 2024 were impacted by the following:\n•\nRestructuring and impairment charges of $2,052 million and a non-cash tax benefit of $113 million\n•\nTFCF and Hulu Acquisition Amortization of $1,282 million\n•\nOther expense of $65 million related to a legal ruling\n•\nIncome tax reserve adjustments of $418 million\n38\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nA summary of the impact of these items on EPS is as follows:\n(in millions, except per share data)\nPre-Tax Income (Loss)\nTax Benefit\n(Expense)\n(1)\nAfter-Tax Income (Loss)\nEPS Favorable\n(Adverse)\n(2)\nNine Months Ended June 28, 2025:\nHulu Transaction Impacts\n$\n— \n  \n$\n3,277 \n   \n$\n3,277 \n   \n$\n1.55 \nResolution of a prior-year tax matter\n— \n  \n1,016 \n \n1,016 \n \n0.56 \nTFCF and Hulu Acquisition Amortization\n(1,188)\n  \n276 \n \n(912)\n \n(0.49)\nRestructuring and impairment charges\n(437)\n  \n(145)\n \n(582)\n \n(0.32)\nTotal\n$\n(1,625)\n  \n$\n4,424 \n  \n$\n2,799 \n  \n$\n1.30 \n   \nNine Months Ended June 29, 2024:\nRestructuring and impairment charges\n$\n(2,052)\n  \n$\n121 \n   \n$\n(1,931)\n   \n$\n(1.05)\nTFCF and Hulu Acquisition Amortization\n(1,282)\n  \n299 \n(983)\n(0.52)\nOther expense\n(65)\n  \n11 \n(54)\n(0.03)\nIncome Tax Reserve Adjustments\n— \n  \n418 \n   \n418 \n   \n0.23 \nTotal\n$\n(3,399)\n  \n$\n849 \n \n$\n(2,550)\n \n$\n(1.37)\n   \n(1)\nTax benefit (expense) amounts are determined using the tax rate applicable to the individual item.\n(2)\nEPS is net of noncontrolling interest share, where applicable. Total may not equal the sum of the column due to rounding.\nSEASONALITY\nThe Company’s businesses are subject to the effects of seasonality. Consequently, the operating results for the nine months ended June 28, 2025 for each business segment, and for the Company as a whole, are not necessarily indicative of results to be expected for the full year.\nEntertainment revenues are subject to seasonal advertising patterns, changes in viewership and subscriber levels, timing and performance of film releases in the theatrical and home entertainment markets, and the timing of and demand for film and television programs. In general, domestic advertising revenues are typically somewhat higher during the fall and somewhat lower during the summer months. Affiliate revenues vary with the subscriber trends of multi-channel video programming distributors (i.e. cable, satellite telecommunications and digital over-the-top service providers). Theatrical release dates are determined by several factors, including competition and the timing of vacation and holiday periods.\nSports revenues are subject to seasonal advertising patterns, changes in viewership and subscriber levels, and the availability of and demand for sports programming. In addition, advertising revenues generated from sports programming are impacted by the timing of sports seasons and events, which varies throughout the year or may take place periodically (e.g. biannually, quadrennially).\nExperiences revenues fluctuate with changes in theme park attendance and resort occupancy resulting from the seasonal nature of vacation travel and leisure activities, which generally results in higher revenues during the Company’s first and fourth fiscal quarters, the opening of new guest offerings and pricing and promotional offers. Peak attendance and resort occupancy generally occur during the summer months when school vacations occur and during early winter and spring holiday periods. In addition, theme park and resort revenues may be higher during significant celebrations such as theme park or character anniversaries and lower in the periods following such celebrations. Consumer products revenue fluctuates with consumer purchasing behavior, which generally results in higher revenues during the Company’s first fiscal quarter due to the winter holiday season. In addition, licensing revenues fluctuate with the timing and performance of our film and television content.\n39\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nBUSINESS SEGMENT RESULTS\nThe Company evaluates the performance of its operating businesses based on segment revenue and segment operating income.\nThe following table presents revenues from our operating segments:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nEntertainment\n$\n10,704\n \n \n$\n10,580 \n \n1  %\n$\n32,258\n \n$\n30,357 \n6  %\nSports\n4,308\n \n \n4,558 \n \n(5) %\n13,692\n \n13,705 \n—  %\nExperiences\n9,086\n \n \n8,386 \n \n8  %\n27,390\n \n25,911 \n6  %\nEliminations \n(1)\n(448)\n \n(369)\n \n(21) %\n(1,379)\n(1,186)\n(16) %\nRevenues\n$\n23,650\n \n \n$\n23,155 \n \n2  %\n$\n71,961\n \n$\n68,787 \n5  %\n(1)\nReflects fees paid by (a) Hulu to ESPN and the Entertainment linear networks business for the right to air their networks on Hulu Live and (b) ABC Network and Disney+ to ESPN to program certain sports content on ABC Network and Disney+.\nThe following table presents income from our operating segments and other components of income before income taxes:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nEntertainment operating income\n$\n1,022\n \n$\n1,201 \n(15) %\n$\n3,983\n \n$\n2,856 \n39  %\nSports operating income\n1,037\n \n802 \n29  %\n1,971\n \n1,477 \n33  %\nExperiences operating income\n2,516\n \n2,222 \n13  %\n8,117\n \n7,613 \n7  %\nCorporate and unallocated shared expenses\n(410)\n(328)\n(25) %\n(1,265)\n(1,027)\n(23) %\nEquity in the loss of India joint venture\n(50)\n— \nnm\n(186)\n— \nnm\nRestructuring and impairment charges\n(185)\n— \nnm\n(437)\n(2,052)\n79  %\nOther expense\n—\n \n(65)\n100  %\n—\n \n(65)\n100  %\nInterest expense, net\n(324)\n(342)\n5  %\n(1,037)\n(899)\n(15) %\nTFCF and Hulu Acquisition Amortization\n(395)\n  \n(397)\n  \n1  %\n(1,188)\n  \n(1,282)\n  \n7  %\nIncome before income taxes\n$\n3,211\n \n$\n3,093 \n4  %\n$\n9,958\n \n$\n6,621 \n50  %\nDepreciation expense is as follows:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nEntertainment\n$\n185\n \n$\n171 \n(8) %\n$\n540\n \n$\n503 \n(7) %\nSports\n13\n \n  \n7 \n  \n(86) %\n34\n \n  \n29 \n  \n(17) %\nExperiences\nDomestic\n487\n \n  \n437 \n  \n(11) %\n1,438\n \n  \n1,287 \n  \n(12) %\nInternational\n197\n \n185 \n(6) %\n576\n \n538 \n(7) %\nTotal Experiences\n684\n \n622 \n(10) %\n2,014\n \n1,825 \n(10) %\nCorporate\n84\n \n54 \n(56) %\n244\n \n159 \n(53) %\nTotal depreciation expense\n$\n966\n \n$\n854 \n(13) %\n$\n2,832\n \n$\n2,516 \n(13) %\n40\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nAmortization of intangible assets is as follows:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nEntertainment\n$\n13\n$\n13\n—  %\n$\n39\n$\n40\n3  %\nExperiences\n27\n27\n—  %\n81\n81\n—  %\nTFCF and Hulu intangible assets\n326\n326\n—  %\n980\n1,068\n8  %\nTotal amortization of intangible assets\n$\n366\n$\n366\n—  %\n$\n1,100\n$\n1,189\n7  %\nBUSINESS SEGMENT RESULTS - Current Quarter Results Compared to Prior-Year Quarter\nEntertainment\nRevenue and operating results for the Entertainment segment are as follows:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues:\nLinear Networks\n$\n2,271\n \n  \n$\n2,663 \n  \n(15) %\nDirect-to-Consumer\n6,176\n \n5,805 \n6  %\nContent Sales/Licensing and Other\n2,257\n \n2,112 \n7  %\n$\n10,704\n \n$\n10,580 \n1  %\nSegment operating income (loss):\nLinear Networks\n$\n697\n \n$\n966 \n(28) %\nDirect-to-Consumer\n346\n \n \n(19)\nnm\nContent Sales/Licensing and Other\n(21)\n254 \nnm\n$\n1,022\n \n$\n1,201 \n(15) %\nRevenues\nThe increase in Entertainment revenues in the current quarter compared to the prior-year quarter was due to DTC subscription revenue growth and higher distribution revenues at Content Sales/Licensing and Other. These increases were partially offset by decreases in affiliate and advertising revenue primarily due to the Star India Transaction.\nOperating income\nThe decrease in Entertainment operating income in the current quarter compared to the prior-year quarter was due to lower results at Content Sales/Licensing and Other and Linear Networks, partially offset by an improvement at Direct-to-Consumer.\n41\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nLinear Networks\nOperating results for Linear Networks are as follows:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues\nAffiliate fees\n$\n1,550\n \n$\n1,726 \n(10) %\nAdvertising\n677\n \n  \n907 \n  \n(25) %\nOther\n44\n \n  \n30 \n  \n47  %\nTotal revenues\n2,271\n \n  \n2,663 \n  \n(15) %\nOperating expenses\n(1,059)\n  \n(1,209)\n  \n12  %\nSelling, general, administrative and other\n(594)\n  \n(604)\n  \n2  %\nDepreciation and amortization\n(19)\n  \n(11)\n  \n(73) %\nEquity in the income of investees\n98\n \n  \n127 \n  \n(23) %\nOperating Income\n$\n697\n \n$\n966 \n(28) %\nRevenues - Affiliate fees\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nDomestic \n$\n1,416 \n$\n1,451 \n(2) %\nInternational\n134 \n275 \n(51) %\n$\n1,550 \n$\n1,726 \n  \n(10) %\nThe decrease in domestic affiliate revenue was due to a decline of 9% from fewer subscribers, partially offset by an increase of 7% from higher effective rates.\nLower international affiliate revenue was attributable to decreases of 39% from the Star India Transaction, 7% from lower effective rates and 3% from fewer subscribers. \nRevenues - Advertising\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nDomestic\n$\n604 \n$\n672 \n(10) %\nInternational\n73 \n235 \n(69) %\n$\n677 \n$\n907 \n(25) %\nThe decline in domestic advertising revenue was due to decreases of 8% from lower average viewership and 5% from a decrease in rates.\nLower international advertising revenue reflected a decrease of 63% from the Star India Transaction.\n42\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nOperating expenses\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nProgramming and production costs\nDomestic\n$\n(813) \n$\n(811) \n—  %\nInternational \n(90) \n(173) \n48  %\nTotal programming and production costs\n(903) \n(984) \n8  %\nOther operating expenses\n(156) \n(225) \n31  %\n$\n(1,059) \n$\n(1,209) \n12  %\nDomestic programming and production costs were comparable to the prior-year quarter as higher fees paid to the Sports segment to program sports content on ABC were offset by lower costs for non-sports programming.\nInternational programming and production costs decreased due to the Star India Transaction.\nThe decrease in other operating expenses was driven by lower technology costs and the Star India Transaction.\nEquity in the Income of Investees\nIncome from equity investees decreased $29 million, to $98 million from $127 million, due to lower income from A+E attributable to decreases in affiliate and advertising revenue, partially offset by lower marketing costs. \nOperating Income from Linear Networks\nOperating income from Linear Networks decreased $269 million, to $697 million from $966 million, due to lower results at our international business as a result of the Star India Transaction and at our domestic business. \nSupplemental revenue and operating income\nThe following table provides supplemental revenue and operating income detail for Linear Networks:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nSupplemental revenue detail\nDomestic\n$\n2,052 \n$\n2,145 \n(4) %\nInternational\n219 \n518 \n(58) %\n$\n2,271 \n$\n2,663 \n(15) %\nSupplemental operating income detail\nDomestic\n$\n587 \n$\n682 \n(14) %\nInternational\n12 \n157 \n(92) %\nEquity in the income of investees\n98 \n127 \n(23) %\n$\n697 \n$\n966 \n(28) %\n43\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nDirect-to-Consumer\nOperating results for Direct-to-Consumer are as follows:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues\nSubscription fees\n$\n5,215\n \n$\n4,729 \n10  %\nAdvertising\n932\n \n  \n1,004 \n  \n(7) %\nOther\n29\n \n72 \n(60) %\nTotal revenues\n6,176\n \n5,805 \n6  %\nOperating expenses\n(4,578)\n(4,542)\n(1) %\nSelling, general, administrative and other\n(1,158)\n(1,197)\n3  %\nDepreciation and amortization\n(94)\n(85)\n(11) %\nOperating Income (Loss)\n$\n346\n \n$\n(19)\nnm\nRevenues - Subscription fees\nGrowth in subscription fees reflected increases of 8% from higher effective rates attributable to increases in pricing and 4% from more subscribers, partially offset by decreases of 1% from the Star India Transaction and 1% from an unfavorable movement of the U.S. dollar against major currencies (Foreign Exchange Impact).\nRevenues - Advertising\nLower advertising revenue was attributable to decreases of 10% from lower rates and 9% from the Star India Transaction, partially offset by an increase of 11% from growth in impressions.\nRevenues - Other\nThe decrease in other revenue was primarily due to an unfavorable Foreign Exchange Impact and a decrease in recognition of minimum guarantee shortfalls from wholesale distributors.\nKey metrics\n(1)\n Paid subscribers at:\n% Change Better (Worse)\n(in millions)\nJune 28,\n2025\nMarch 29,\n2025\nJune 29,\n2024\nJune 28, 2025 vs. \nMar. 29, 2025\nJune 28, 2025 vs. \nJune 29, 2024\nDisney+\nDomestic (U.S. and Canada)\n57.8\n \n  \n57.8 \n  \n54.8 \n  \n—  %\n5  %\nInternational\n(2)\n69.9\n \n  \n68.2 \n  \n66.0 \n  \n2  %\n6  %\nDisney+\n(2)(3)\n127.8\n \n  \n126.0 \n  \n120.8 \n  \n1  %\n6  %\nHulu\nSVOD Only\n51.2\n \n50.3 \n46.7 \n2  %\n10  %\nLive TV + SVOD\n4.3\n \n4.4 \n4.4 \n(2) %\n(2) %\nTotal Hulu\n(3)\n55.5\n \n54.7 \n51.1 \n1  %\n9  %\n44\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nAverage Monthly Revenue Per Paid Subscriber:\n \nQuarter Ended\n% Change Better (Worse)\nJune 28,\n2025\nMarch 29,\n2025\nJune 29,\n2024\nJune 28, 2025 vs. \nMar. 29, 2025\nJune 28, 2025 vs. \nJune 29, 2024\nDisney+\nDomestic (U.S. and Canada)\n$\n8.09 \n$\n8.06 \n$\n7.74 \n—  %\n5  %\nInternational\n(2)\n7.67 \n7.52 \n6.56 \n2  %\n17  %\nDisney+\n(2)\n7.86 \n7.77 \n7.09 \n1  %\n11  %\nHulu\nSVOD Only\n12.40 \n12.36 \n12.73 \n— %\n(3) %\nLive TV + SVOD\n100.27 \n99.94 \n96.11 \n—  %\n4  %\n(1)\nSee discussion on pages \n71\n and \n72\n — DTC Product Descriptions, Key Definitions and Supplemental Information and Planned Reporting Changes\n(2)\nThe prior-year quarter Paid Subscribers and Average Monthly Revenue per Paid Subscriber have been adjusted to include Disney+ subscribers in Southeast Asia. These subscribers were previously reported with Disney+ Hotstar, which is no longer presented as this business was included in the Star India Transaction. \n(3)\nTotal may not equal the sum of the column due to rounding.\nAverage Monthly Revenue Per Paid Subscriber - Third Quarter of Fiscal 2025 Comparison to Second Quarter of Fiscal 2025\nDomestic Disney+ average monthly revenue per paid subscriber increased from $8.06 to $8.09 as higher advertising revenue was largely offset by the impact of subscriber mix shifts.\nInternational Disney+ average monthly revenue per paid subscriber increased from $7.52 to $7.67 due to a favorable Foreign Exchange Impact and increases in pricing, partially offset by the impact of subscriber mix shifts. \nHulu SVOD Only average monthly revenue per paid subscriber increased from $12.36 to $12.40 as higher advertising revenue was largely offset by the impact of subscriber mix shifts. \nHulu Live TV + SVOD average monthly revenue per paid subscriber increased from $99.94 to $100.27 due to higher advertising revenue.\nAverage Monthly Revenue Per Paid Subscriber - Third Quarter of Fiscal 2025 Comparison to Third Quarter of Fiscal 2024\nDomestic Disney+ average monthly revenue per paid subscriber increased from $7.74 to $8.09 due to increases in pricing and higher advertising revenue, partially offset by the impact of subscriber mix shifts.  \nInternational Disney+ average monthly revenue per paid subscriber increased from $6.56 to $7.67 due to increases in pricing, partially offset by the impact of subscriber mix shifts.\nHulu SVOD Only average monthly revenue per paid subscriber decreased from $12.73 to $12.40 due to lower advertising revenue, partially offset by increases in pricing and the impact of subscriber mix shifts.\nHulu Live TV + SVOD average monthly revenue per paid subscriber increased from $96.11 to $100.27 due to increases in pricing, partially offset by the impact of subscriber mix shifts and lower advertising revenue.\nOperating expenses\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nProgramming and production costs\nHulu\n$\n(2,230) \n$\n(2,142) \n(4) %\nDisney+\n(1,356) \n(1,508) \n10  %\nTotal programming and production costs\n(3,586) \n(3,650) \n2  %\nOther operating expense\n(992) \n(892) \n(11) %\n$\n(4,578) \n$\n(4,542) \n(1) %\n45\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nThe increase in programming and production costs at Hulu was due to higher subscriber-based license fees attributable to more subscribers to bundles with third-party offerings.\nThe decrease in programming and production costs at Disney+ was due to the Star India Transaction, reflecting the comparison to International Cricket Council (ICC) programming, which was carried on Disney+ Hotstar in the prior-year quarter, partially offset by costs for more hours of content available on the service.\nThe increase in other operating expense was due to higher technology and distribution costs.\nSelling, general, administrative and other\nSelling, general, administrative and other costs decreased $39 million, to $1,158 million from $1,197 million, due to lower marketing costs.\nOperating Income (Loss) from Direct-to-Consumer\nOperating results from Direct-to-Consumer increased $365 million, to income of $346 million from a loss of $19 million, due to increases at Disney+ and Hulu.\nContent Sales/Licensing and Other\nOperating results for Content Sales/Licensing and Other are as follows:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues\nTV/VOD and home entertainment distribution\n$\n875\n \n$\n806 \n9  %\nTheatrical distribution\n820\n \n  \n724 \n  \n13  %\nOther\n562\n \n582 \n(3) %\nTotal revenues\n2,257\n \n2,112 \n7  %\nOperating expenses\n(1,461)\n(1,204)\n(21) %\nSelling, general, administrative and other\n(736)\n(562)\n(31) %\nDepreciation and amortization\n(85)\n(88)\n3  %\nEquity in the loss of investees\n4\n \n(4)\nnm\nOperating Income (Loss)\n$\n(21)\n$\n254 \nnm\nRevenues - TV/VOD and home entertainment distribution\nThe increase in TV/VOD and home entertainment distribution revenue was due to the timing of revenue recognized on TV/VOD episodic content sales and an increase in home entertainment distribution revenue. \nRevenues - Theatrical distribution \nHigher theatrical distribution revenue was attributable to more titles in release in the current quarter compared to the prior-year quarter. The current quarter included the release of \nLilo & Stitch\n, \nThunderbolts*,\n \nThe Amateur\n and \nElio\n, and the ongoing performance of \nSnow White. \nThe prior-year quarter included the release of \nInside Out 2\n and \nKingdom of the Planet of the Apes\n.\nOperating expenses\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nProgramming and production costs\n$\n(1,283) \n$\n(1,017)\n(26) %\nOther operating expenses\n(178) \n(187)\n5  %\n$\n(1,461) \n$\n(1,204)\n(21) %\nThe increase in programming and production costs was due to higher production cost amortization attributable to increased distribution revenue and higher film cost impairments.\n46\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nSelling, general, administrative and other\nSelling, general, administrative and other costs increased $174 million, to $736 million from $562 million, due to higher theatrical marketing costs reflecting more significant releases in the current quarter.\nOperating Income (Loss) from Content Sales/Licensing and Other\nOperating results from Content Sales/Licensing and Other decreased $275 million, to a loss of $21 million from income of $254 million due to lower theatrical distribution results and higher film cost impairments.\nItems Excluded from Segment Operating Income Related to Entertainment \nThe following table presents supplemental information for items related to the Entertainment segment that are excluded from segment operating income:\nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nTFCF and Hulu Acquisition Amortization\n(1)\n$\n(320)\n$\n(322)\n1  %\nRestructuring and impairment charges \n(2)\n(185)\n— \nnm\n(1)\nIn the current quarter, amortization of intangible assets was $251 million and amortization of step-up on film and television costs was $66 million. In the prior-year quarter, amortization of intangible assets was $251 million and amortization of step-up on film and television costs was $68 million.\n(2)\nCharges in the current quarter were primarily for an impairment of an equity investment.\nSports\nOperating results for Sports are as follows:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues\nAffiliate fees\n$\n2,484\n \n$\n2,571 \n(3) %\nAdvertising\n1,148\n \n  \n1,339 \n  \n(14) %\nSubscription fees\n415\n \n414 \n—  %\nOther\n261\n \n234 \n12  %\nTotal revenues\n4,308\n \n4,558 \n(5) %\nOperating expenses\n(3,008)\n(3,482)\n14  %\nSelling, general, administrative and other\n(276)\n(293)\n6  %\nDepreciation and amortization\n(13)\n(7)\n(86) %\nEquity in the income of investees\n26\n \n26 \n—  %\nOperating Income\n$\n1,037\n \n$\n802 \n29  %\nRevenues - Affiliate fees\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nESPN\nDomestic \n$\n2,214 \n$\n2,239 \n(1) %\nInternational\n270 \n272 \n(1) %\n2,484\n \n  \n2,511 \n  \n(1) %\nStar India\n— \n60 \n(100) %\n$\n2,484 \n$\n2,571 \n(3) %\n47\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nDomestic ESPN affiliate revenue reflected a decrease of 8% from fewer subscribers, largely offset by an increase of 7% from higher effective rates.\nInternational ESPN affiliate revenue reflected an unfavorable Foreign Exchange Impact and fewer subscribers, largely offset by higher effective rates.\nRevenues - Advertising\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nESPN\nDomestic\n$\n1,104 \n$\n1,071 \n3  %\nInternational\n44 \n51 \n(14) %\n1,148 \n1,122 \n2  %\nStar India\n— \n217 \n(100) %\n$\n1,148 \n$\n1,339 \n(14) %\nDomestic ESPN advertising revenue growth was due to an increase of 14% from higher rates, partially offset by a decrease of 9% from lower average viewership.\nRevenues - Subscription fees\nSubscription fees were comparable to the prior-year quarter as an increase of 5% from higher effective rates was largely offset by a decrease of 4% from fewer subscribers.\nRevenues - Other\nOther revenue increased $27 million, to $261 million from $234 million, primarily due to higher fees received from the Entertainment segment to program sports content on ABC, partially offset by lower Ultimate Fighting Championship pay-per-view fees attributable to lower average buys.\nKey metrics\n(1)\n% Change Better (Worse)\nJune 28, 2025\nMarch 29, 2025\nJune 29, 2024\nJune 28, 2025 vs. \nMar. 29, 2025\nJune 28, 2025 vs. \nJune 29, 2024\nPaid subscribers\n(1)\n at (in millions)\n24.1\n \n \n24.1 \n \n24.9 \n \n— %\n(3) %\nAverage Monthly Revenue per Paid Subscriber\n(1)\n for the quarter ended\n$\n6.40\n \n \n$\n6.58 \n \n$\n6.23 \n \n(3)  %\n3  %\n(1)\nSee discussion on page \n71\n and \n72\n — DTC Product Descriptions, Key Definitions and Supplemental Information and Planned Reporting Changes\nAverage Monthly Revenue Per Paid Subscriber - Third Quarter of Fiscal 2025 Comparison to Second Quarter of Fiscal 2025\nESPN+ average monthly revenue per paid subscriber decreased from $6.58 to $6.40 due to lower advertising revenue.\nAverage Monthly Revenue Per Paid Subscriber -Third Quarter of Fiscal 2025 Comparison to Third Quarter of Fiscal 2024\nESPN+ average monthly revenue per paid subscriber increased from $6.23 to $6.40 due to increases in pricing, partially offset by the impact of subscriber mix shifts.\n48\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nOperating expenses\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nProgramming and production costs\nESPN\nDomestic\n$\n(2,451) \n$\n(2,381) \n(3) %\nInternational \n(311) \n(308) \n(1) %\n(2,762) \n(2,689) \n(3) %\nStar India\n— \n(555) \n100  %\n(2,762) \n(3,244) \n15  %\nOther operating expenses\n(246) \n(238) \n(3) %\n$\n(3,008) \n$\n(3,482) \n14  %\nDomestic ESPN programming and production costs increased in the current quarter compared to the prior-year quarter primarily due to higher NBA and college sports rights costs, reflecting contractual rate increases, partially offset by the absence of NHL Stanley Cup Finals rights in the current quarter. We have the rights to air the Stanley Cup Finals every other year.\nSelling, general, administrative and other\nSelling, general, administrative and other costs decreased $17 million, to $276 million from $293 million, due to the Star India Transaction.\nOperating Income from Sports\nSegment operating income increased $235 million, to $1,037 million from $802 million, due to the Star India Transaction,     partially offset by a decrease at domestic ESPN.\nSupplemental revenue and operating income (loss)\nThe following table provides supplemental revenue and operating income (loss) detail for the Sports segment:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nSupplemental revenue detail\nESPN\nDomestic\n$\n3,929\n \n  \n$\n3,908 \n  \n1  %\nInternational\n379\n \n  \n371 \n  \n2  %\n4,308\n \n  \n4,279 \n  \n1  %\nStar India\n—\n \n  \n279 \n  \n(100) %\n$\n4,308\n \n  \n$\n4,558 \n  \n(5) %\nSupplemental operating income (loss) detail\nESPN\nDomestic\n$\n1,014\n \n   \n$\n1,085 \n   \n(7) %\nInternational\n(3)\n   \n5 \n   \nnm\n1,011\n \n   \n1,090 \n   \n(7) %\nStar India\n—\n \n   \n(314)\n   \n100  %\nEquity in the income of investees\n26\n \n   \n26 \n   \n—  %\n$\n1,037\n \n   \n$\n802 \n   \n29  %\n49\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nItems Excluded from Segment Operating Income Related to Sports\nThe following table presents supplemental information for items related to the Sports segment that are excluded from segment operating income:\nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nTFCF Acquisition Amortization\n(1)\n$\n(74)\n  \n$\n(74)\n  \n—  %\n(1)\nRepresents amortization of intangible assets.\nExperiences\nOperating results for the Experiences segment are as follows:\n \nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues\nTheme park admissions\n$\n2,996\n \n$\n2,780 \n8  %\nResorts and vacations\n2,373\n \n2,115 \n12  %\nParks & Experiences merchandise, food and beverage\n2,143\n \n  \n1,994 \n  \n7  %\nMerchandise licensing and retail\n979\n \n954 \n3  %\nParks licensing and other\n595\n \n543 \n10  %\nTotal revenues\n9,086\n \n8,386 \n8  %\nOperating expenses\n(4,808)\n \n(4,573)\n(5) %\nSelling, general, administrative and other\n(1,051)\n(942)\n(12) %\nDepreciation and amortization\n(711)\n(649)\n(10) %\nOperating Income\n$\n2,516\n \n$\n2,222 \n13  %\nRevenues - Theme park admissions\nTheme park admissions revenue growth was due to an increase of 7% from higher average per capita ticket revenue.\nRevenues - Resorts and vacations\nHigher resorts and vacations revenue was attributable to increases of 7% from additional passenger cruise days and 3% from higher occupied hotel room nights. The increase in passenger cruise days reflected the launch of the \nDisney Treasure \nin the first quarter of the current year.\nRevenues - Park & Experiences merchandise, food and beverage\nParks & Experiences merchandise, food and beverage revenue growth was primarily due to increases of 4% from higher average guest spending and 2% from volume growth.\nRevenues - Merchandise licensing and retail\nHigher merchandise licensing and retail revenue was due to an increase of 3% from merchandise licensing, partially offset by a decrease of 1% from an unfavorable Foreign Exchange Impact. \nRevenues - Parks licensing and other\nParks licensing and other revenue growth includes the benefit of a rebate received in the current quarter and an increase in co-branding revenue, partially offset by an unfavorable Foreign Exchange Impact. \n50\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nKey Metrics \nIn addition to revenue, costs and operating income, management uses the following key metrics to analyze trends and evaluate the overall performance of our theme parks and resorts, and we believe these metrics are useful to investors in analyzing the business:\n \nDomestic\nInternational\n(1)\n \nQuarter Ended\nQuarter Ended\n \nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nParks\nIncrease (decrease)\nAttendance\n(2)\n—  %\n—  %\n1  %\n4  %\nPer Capita Guest Spending\n(3)\n8  %\n1  %\n2  %\n(1) %\nHotels\nOccupancy\n(4)\n86  %\n83  %\n87  %\n82  %\nAvailable Hotel Room Nights (in thousands)\n(5)\n2,566\n2,543\n791\n791\nChange in Per Room Guest Spending\n(6)\n2  %\n4  %\n(3) %\n7  %\n(1)\nPer capita guest spending growth rate and per room guest spending growth rate exclude the impact of changes in foreign exchange rates.\n(2)\nAttendance is used to analyze volume trends at our theme parks and is based on the number of unique daily entries, i.e. a person visiting multiple theme parks in a single day is counted only once. Our attendance count includes complimentary entries but excludes entries by children under the age of three.\n(3)\nPer capita guest spending is used to analyze guest spending trends and is defined as total revenue from ticket sales and sales of food, beverage and merchandise in our theme parks, divided by total theme park attendance.\n(4)\nOccupancy is used to analyze the usage of available capacity at hotels and is defined as the number of room nights occupied by guests as a percentage of available hotel room nights.\n(5)\nAvailable hotel room nights is defined as the total number of room nights that are available at our hotels and at Disney Vacation Club (DVC) properties located at our theme parks and resorts that are not utilized by DVC members. Available hotel room nights include rooms temporarily taken out of service.\n(6)\nPer room guest spending is used to analyze guest spending at our hotels and is defined as total revenue from room rentals and sales of food, beverage and merchandise at our hotels, divided by total occupied hotel room nights. \nOperating expenses\nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nOperating labor\n$\n(2,284)\n$\n(2,154)\n(6) %\nInfrastructure costs\n(870)\n(823)\n(6) %\nCost of goods sold and distribution costs\n(779)\n(780)\n—  %\nOther operating expense\n(875)\n(816)\n(7) %\n$\n(4,808)\n$\n(4,573)\n(5) %\nHigher operating labor was due to inflation, increased volumes and new guest offerings. The increase in infrastructure costs was attributable to higher operations support costs and an increase in technology spending. Higher other operating expense was due to new guest offerings and volume growth.\nSelling, general, administrative and other\nSelling, general, administrative and other costs increased $109 million, to $1,051 million from $942 million, driven by higher marketing costs.\n51\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nDepreciation and amortization\nDepreciation and amortization increased $62 million, to $711 million from $649 million, primarily attributable to higher depreciation at our domestic parks and experiences driven by an increase at Disney Cruise Line.\nOperating Income from Experiences\nSegment operating income increased $294 million, to $2,516 million from $2,222 million due to growth at domestic parks and experiences.\nSupplemental revenue and operating income\nThe following table presents supplemental revenue and operating income detail for the Experiences segment:\nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nSupplemental revenue detail\nParks & Experiences\nDomestic\n$\n6,403\n \n$\n5,820 \n10  %\nInternational\n1,691\n \n  \n1,602 \n  \n6  %\nConsumer Products\n992\n \n964 \n3  %\n$\n9,086\n \n$\n8,386 \n8  %\nSupplemental operating income detail\nParks & Experiences\nDomestic\n$\n1,650\n \n$\n1,347 \n22  %\nInternational\n422\n \n435 \n(3) %\nConsumer Products\n444\n \n440 \n1  %\n$\n2,516\n \n$\n2,222 \n13  %\nItems Excluded from Segment Operating Income Related to Experiences\nThe following table presents supplemental information for items related to the Experiences segment that are excluded from segment operating income:\nQuarter Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nTFCF Acquisition Amortization\n$\n(1)\n$\n(1)\n—  %\nCharge related to a legal ruling\n—\n \n  \n(65)\n100  %\n52\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nBUSINESS SEGMENT RESULTS - Current Period Nine-Month\n \nResults Compared to the Prior-Year Nine-Month\n \nPeriod \nEntertainment\nRevenue and operating results for the Entertainment segment are as follows:\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues:\nLinear Networks\n$\n7,306\n \n  \n$\n8,231 \n  \n(11) %\nDirect-to-Consumer\n18,366\n \n16,993 \n8  %\nContent Sales/Licensing and Other\n6,586\n \n5,133 \n28  %\n$\n32,258\n \n$\n30,357 \n6  %\nSegment operating income (loss):\nLinear Networks\n$\n2,564\n \n$\n2,954 \n(13) %\nDirect-to-Consumer\n975\n \n \n(110)\nnm\nContent Sales/Licensing and Other\n444\n \n12 \n>100  %\n$\n3,983\n \n$\n2,856 \n39  %\nRevenues\nThe increase in Entertainment revenues in the current period compared to the prior-year period was due to DTC subscription revenue growth and higher distribution revenues at Content Sales/Licensing and Other. These increases were partially offset by lower advertising and affiliate revenue due to the Star India Transaction.\nOperating income\nThe increase in Entertainment operating income in the current period compared to the prior-year period was due to improved results at Direct-to-Consumer and, to a lesser extent, Content Sales/Licensing and Other, partially offset by a decline at Linear Networks primarily due to the Star India Transaction.\nLinear Networks\nOperating results for Linear Networks are as follows:\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues\nAffiliate fees\n$\n4,848\n \n$\n5,251 \n(8) %\nAdvertising\n2,328\n \n  \n2,875 \n  \n(19) %\nOther\n130\n \n  \n105 \n  \n24  %\nTotal revenues\n7,306\n \n  \n8,231 \n  \n(11) %\nOperating expenses\n(3,404)\n  \n(3,838)\n  \n11  %\nSelling, general, administrative and other\n(1,637)\n  \n(1,845)\n  \n11  %\nDepreciation and amortization\n(51)\n  \n(34)\n  \n(50) %\nEquity in the income of investees\n350\n \n  \n440 \n  \n(20) %\nOperating Income\n$\n2,564\n \n$\n2,954 \n(13) %\n53\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nRevenues - Affiliate fees\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nDomestic\n$\n4,377 \n$\n4,437 \n(1) %\nInternational\n471 \n814 \n(42) %\n$\n4,848 \n$\n5,251 \n  \n(8) %\nThe decrease in domestic affiliate revenue was due to a decline of 9% from fewer subscribers, partially offset by an increase of 7% from higher effective rates.\nLower international affiliate revenue was attributable to decreases of 28% from the Star India Transaction, 8% from lower effective rates and 3% from fewer subscribers.\nRevenues - Advertising\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nDomestic\n$\n1,989 \n$\n2,121 \n(6) %\nInternational\n339 \n754 \n(55) %\n$\n2,328 \n$\n2,875 \n(19) %\nThe decline in domestic advertising revenue was due to a decrease of 7% from fewer impressions attributable to lower average viewership.\nLower international advertising revenue reflected a decrease of 51% from the Star India Transaction.\nOperating expenses\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nProgramming and production costs\nDomestic \n$\n(2,576) \n$\n(2,619) \n2  %\nInternational \n(319) \n(534) \n40  %\nTotal programming and production costs\n(2,895) \n(3,153) \n8  %\nOther operating expenses\n(509) \n(685) \n26  %\n$\n(3,404) \n$\n(3,838) \n11  %\nThe decrease in domestic programming and production costs was due to lower average cost programming at our cable channels, partially offset by a higher cost mix of programming at ABC driven by higher fees paid to the Sports segment to program sports content.\nInternational programming and production costs decreased primarily due to the Star India Transaction.\nThe decrease in other operating expenses was driven by lower technology costs and a decrease from the Star India Transaction.\nSelling, general, administrative and other\nSelling, general, administrative and other costs decreased $208 million to $1,637 million from $1,845 million, due to the Star India Transaction, lower marketing costs and a favorable Foreign Exchange Impact.\nEquity in the Income of Investees\nIncome from equity investees decreased $90 million, to $350 million from $440 million, due to lower income from A+E attributable to decreases in affiliate and advertising revenue.\n54\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nOperating Income from Linear Networks\nOperating income from Linear Networks decreased $390 million, to $2,564 million from $2,954 million, due to a decrease at our international business as a result of the Star India Transaction and lower income from equity investees.\nSupplemental revenue and operating income\nThe following table provides supplemental revenue and operating income detail for Linear Networks:\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nSupplemental revenue detail\nDomestic\n$\n6,453 \n$\n6,624 \n(3) %\nInternational\n853 \n1,607 \n(47) %\n$\n7,306 \n$\n8,231 \n(11) %\nSupplemental operating income detail\nDomestic\n$\n2,049 \n$\n2,040 \n—  %\nInternational\n165 \n474 \n(65) %\nEquity in the income of investees\n350 \n440 \n(20) %\n$\n2,564 \n$\n2,954 \n(13) %\nDirect-to-Consumer\nOperating results for Direct-to-Consumer are as follows: \n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues\nSubscription fees\n$\n15,495 \n$\n14,041 \n10  %\nAdvertising\n2,712 \n2,740 \n(1) %\nOther\n159 \n212 \n(25) %\nTotal revenues\n18,366 \n16,993 \n8  %\nOperating expenses\n(13,726)\n(13,449)\n(2) %\nSelling, general, administrative and other\n(3,403)\n(3,424)\n1  %\nDepreciation and amortization\n(262)\n(230)\n(14) %\nOperating Income (Loss)\n$\n975 \n$\n(110)\nnm\nRevenues - Subscription fees\nGrowth in subscription fees reflected increases of 9% from higher effective rates attributable to increases in pricing and 4% from more subscribers, partially offset by decreases of 2% from an unfavorable Foreign Exchange Impact and 1% from the Star India Transaction.\nRevenues - Advertising\nLower advertising revenue was attributable to decreases of 12% from lower rates and 9% from the Star India Transaction, partially offset by an increase of 19% from higher impressions. The decrease from the Star India Transaction reflected ICC programming on Disney+ Hotstar in the prior-year period.\nRevenues - Other\nThe decrease in other revenue was due to lower recognition of minimum guarantee shortfalls from wholesale distributors. \n55\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nKey metrics\nAverage Monthly Revenue Per Paid Subscriber:\n \nNine Months Ended\n% Change\nBetter\n(Worse)\nJune 28,\n2025\nJune 29,\n2024\nDisney+\nDomestic (U.S. and Canada)\n$\n8.05\n \n$\n7.96 \n1  %\nInternational \n(1)\n7.46\n \n6.23 \n20  %\nDisney+ \n(1)\n7.73\n \n6.98 \n11  %\nHulu\nSVOD Only\n12.42\n \n12.29 \n1  %\nLive TV + SVOD\n99.80\n \n94.89 \n5  %\n(1)\nThe prior-year period Average Monthly Revenue per Paid Subscriber has been adjusted to include Disney+ subscribers in Southeast Asia. These subscribers were previously reported with Disney+ Hotstar, which is no longer presented as this business was included in the Star India Transaction. \nDomestic Disney+ average monthly revenue per paid subscriber increased from $7.96 to $8.05 due to increases in pricing, partially offset by the impact of subscriber mix shifts.\nInternational Disney+ average monthly revenue per paid subscriber increased from $6.23 to $7.46 due to increases in pricing, partially offset by the impact of subscriber mix shifts.\nHulu SVOD Only average monthly revenue per paid subscriber increased from $12.29 to $12.42 due to increases in pricing, partially offset by lower advertising revenue.\nHulu Live TV + SVOD average monthly revenue per paid subscriber increased from $94.89 to $99.80 due to increases in pricing, partially offset by lower advertising revenue.\nOperating expenses\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nProgramming and production costs\nHulu\n$\n(6,759)\n \n$\n(6,437)\n(5) %\nDisney+\n(3,968)\n(4,275)\n7  %\nTotal programming and production costs\n(10,727)\n \n(10,712)\n \n—  %\nOther operating expense\n(2,999)\n \n(2,737)\n(10) %\n$\n(13,726)\n \n$\n(13,449)\n \n(2)  %\nThe increase in programming and production costs at Hulu was due to higher subscriber-based license fees attributable to rate increases for programming the Hulu Live TV service and more subscribers to bundles with third-party offerings.\nThe decrease in programming and production costs at Disney+ was primarily due to the Star India Transaction, reflecting the comparison to ICC programming in the prior-year period, partially offset by more hours of content available on the service. \nOther operating expenses increased due to higher technology and distribution costs.\nOperating Income (Loss) from Direct-to-Consumer\nOperating results from Direct-to-Consumer improved $1,085 million, to income of $975 million from a loss of $110 million, due to increases at Disney+ and, to a lesser extent, Hulu.\n56\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nContent Sales/Licensing and Other\nOperating results for Content Sales/Licensing and Other are as follows:\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues\nTV/VOD and home entertainment distribution\n$\n2,727\n \n$\n2,196 \n24  %\nTheatrical distribution\n2,108\n \n  \n1,098 \n  \n92  %\nOther\n1,751\n \n1,839 \n(5) %\nTotal revenues\n6,586\n \n5,133 \n28  %\nOperating expenses\n(3,835)\n(3,305)\n(16) %\nSelling, general, administrative and other\n(2,035)\n(1,529)\n(33) %\nDepreciation and amortization\n(266)\n(279)\n5  %\nEquity in the loss of investees\n(6)\n(8)\n25  %\nOperating Income\n$\n444\n \n$\n12 \n>100  %\nRevenues - TV/VOD and home entertainment distribution\nThe increase in TV/VOD and home entertainment distribution revenue was primarily due to higher TV/VOD sales of episodic content and an increase in home entertainment distribution revenue. \nRevenues - Theatrical distribution \nThe increase in theatrical distribution revenue was due to the comparison of five live-action titles in the current period to two live-action titles in the prior-year period, partially offset by lower revenue from animated titles. Live-action titles in the current period included \nLilo & Stitch\n, \nMufasa: The Lion King\n, \nCaptain America: Brave New World\n, \nThunderbolts*\n and \nSnow White\n. Live-action titles in the prior-year period included \nKingdom of the Planet of the Apes\n and \nThe Marvels\n. Animated titles in the current period included \nMoana 2\n and \nElio\n compared to \nInside Out 2\n and \nWish\n in the prior-year period.\nRevenues - Other\nOther revenue decreased $88 million to $1,751 million from $1,839 million due to lower revenue from stage plays as a result of fewer performances.\nOperating expenses\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nProgramming and production costs\n$\n(3,316)\n$\n(2,769)\n(20) %\nOther operating expenses\n(519)\n(536)\n3  %\n$\n(3,835)\n$\n(3,305)\n(16) %\nThe increase in programming and production costs was due to higher production cost amortization attributable to the increases in distribution revenues, partially offset by fewer stage play performances. \nSelling, general, administrative and other\nSelling, general, administrative and other costs increased $506 million, to $2,035 million from $1,529 million, due to higher theatrical marketing costs. \nOperating Income from Content Sales/Licensing and Other\nOperating income from Content Sales/Licensing and Other increased $432 million, from $12 million to $444 million, due to higher theatrical, TV/VOD and home entertainment distribution results.\n57\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nItems Excluded from Segment Operating Income Related to Entertainment\nThe following table presents supplemental information for items related to the Entertainment segment that are excluded from segment operating income:\nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nTFCF and Hulu Acquisition Amortization\n(1)\n$\n(961)\n$\n(1,018)\n6  %\nRestructuring and impairment charges\n(2)\n(294)\n  \n(717)\n  \n59  %\n(1)\nIn the current period, amortization of intangible assets was $753 million and amortization of step-up on film and television costs was $199 million. In the prior-year period, amortization of intangible assets was $804 million and amortization of step-up on film and television costs was $205 million.\n(2)\nCharges in the current period were primarily for an impairment of an equity investment and \ncontent impairments\n. Charges in the prior-year period were primarily for a goodwill impairment related to linear networks. \nSports\nOperating results for Sports are as follows:\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues\nAffiliate fees\n$\n7,766\n \n$\n7,918 \n(2) %\nAdvertising\n3,647\n \n  \n3,640 \n  \n—  %\nSubscription fees\n1,270\n \n1,246 \n2  %\nOther\n1,009\n \n901 \n12  %\nTotal revenues\n13,692\n \n13,705 \n—  %\nOperating expenses\n(10,808)\n(11,295)\n4  %\nSelling, general, administrative and other\n(933)\n(949)\n2  %\nDepreciation and amortization\n(34)\n(29)\n(17) %\nEquity in the income of investees\n54\n \n45 \n20  %\nOperating Income\n$\n1,971\n \n$\n1,477 \n33  %\nRevenues - Affiliate fees\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nESPN\nDomestic \n$\n6,951 \n$\n6,947 \n—  %\nInternational\n784 \n783 \n—  %\n7,735\n \n  \n7,730 \n  \n—  %\nStar India\n31 \n188 \n(84) %\n$\n7,766 \n$\n7,918 \n(2) %\nDomestic ESPN affiliate revenue was comparable to the prior-year period as an increase of 7% from higher effective rates was offset by a decrease of 7% from fewer subscribers.\nInternational ESPN affiliate revenue was comparable to the prior-year period as higher effective rates were offset by an unfavorable Foreign Exchange Impact and fewer subscribers.\nThe decrease in Star India affiliate revenue was due to the Star India Transaction.\n58\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nRevenues - Advertising\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nESPN\nDomestic\n$\n3,513 \n$\n3,059 \n15  %\nInternational\n130 \n143 \n(9) %\n3,643 \n3,202 \n14  %\nStar India\n4 \n438 \n(99) %\n$\n3,647 \n$\n3,640 \n—  %\nThe increase in domestic ESPN advertising revenue was due to an increase of 14% from higher rates. The increase in advertising revenue reflected the benefit of expanded college football programming including four additional College Football Playoff (CFP) games.\nThe decrease in Star India advertising revenue was attributable to the comparison to ICC and Indian Premier League (IPL) cricket programming in the prior-year period. There were no significant cricket events in the current period prior to the Star India Transaction.\nRevenues - Subscription fees\nThe increase in subscription fees was due to an increase of 5% from higher effective rates, partially offset by a decrease of 3% from fewer subscribers.\nRevenues - Other\nOther revenue increased $108 million, to $1,009 million from $901 million, due to higher fees received from the Entertainment segment to program certain sports content on Disney+ and ABC, partially offset by lower sub-licensing fees. The decrease in sub-licensing fees was attributable to the comparison to Star India sub-licensing of ICC programming in the prior-year period, partially offset by fees from sub-licensing CFP programming rights for two games in the current period.\nKey Metrics\nNine Months Ended\n% Change\nBetter\n(Worse)\nJune 28,\n2025\nJune 29,\n2024\nAverage Monthly Revenue per Paid Subscriber for the period\n$\n6.44\n \n$\n6.21 \n4  %\nESPN+ average monthly revenue per paid subscriber increased from $6.21 to $6.44 due to increases in pricing, partially offset by the impact of subscriber mix shifts.\nOperating expenses\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nProgramming and production costs\nESPN\nDomestic\n$\n(9,143) \n$\n(8,386) \n(9) %\nInternational \n(912) \n(874) \n(4) %\n(10,055) \n(9,260) \n(9) %\nStar India\n(17) \n(1,341) \n99  %\n(10,072) \n(10,601) \n5  %\nOther operating expenses\n(736) \n(694) \n(6) %\n$\n(10,808) \n$\n(11,295) \n4  %\n59\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nDomestic ESPN programming and production costs increased primarily due to expanded college football programming rights, one additional NFL game due to timing and higher NBA rights costs reflecting contractual rate increases.\nThe increase in international ESPN programming and production costs was attributable to higher soccer rights costs.\nStar India programming and production costs decreased due to the comparison to ICC and IPL cricket programming in the prior-year period.\nThe increase in other operating expense was attributable to higher technology costs.\nSelling, general, administrative and other\nSelling, general, administrative and other costs decreased due to the Star India Transaction, partially offset by the write-off of an investment.\nOperating Income from Sports\nSegment operating income increased $494 million, to $1,971 million from $1,477 million, due to the comparison to ICC and IPL cricket programming in the prior-year period at Star India, partially offset by a decrease at domestic ESPN.\nSupplemental revenue and operating income\nThe following table provides supplemental revenue and operating income (loss) detail for the Sports segment:\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nSupplemental revenue detail\nESPN\nDomestic\n$\n12,506 \n$\n11,847 \n6  %\nInternational\n1,147 \n1,075 \n7  %\n13,653 \n12,922 \n6  %\nStar India\n39 \n783 \n(95) %\n$\n13,692 \n$\n13,705 \n—  %\nSupplemental operating income (loss) detail\nESPN\nDomestic\n$\n1,893 \n$\n2,120 \n(11) %\nInternational\n15 \n(32)\nnm\n1,908 \n2,088 \n(9) %\nStar India\n9 \n(656)\nnm\nEquity in the income of investees\n54 \n45 \n20  %\n$\n1,971 \n$\n1,477 \n33  %\nItems Excluded from Segment Operating Income Related to Sports\nThe following table presents supplemental information for items related to the Sports segment that are excluded from segment operating income:\nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nTFCF Acquisition Amortization\n(1)\n$\n(222)\n$\n(259)\n14  %\n(1)\nRepresents amortization of intangible assets.\n60\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nExperiences\nOperating results for the Experiences segment are as follows:\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nRevenues\nTheme park admissions\n$\n9,002 \n$\n8,568 \n5  %\nResorts and vacations\n6,953 \n6,334 \n10  %\nParks & Experiences merchandise, food and beverage\n6,425 \n6,126 \n5  %\nMerchandise licensing and retail\n3,234 \n3,184 \n2  %\nParks licensing and other\n1,776 \n1,699 \n5  %\nTotal revenues\n27,390 \n25,911 \n6  %\nOperating expenses\n(14,155)\n(13,562)\n(4) %\nSelling, general, administrative and other\n(3,023)\n(2,830)\n(7) %\nDepreciation and amortization\n(2,095)\n(1,906)\n(10) %\nOperating Income\n$\n8,117\n \n  \n$\n7,613 \n  \n7  %\nRevenues - Theme park admissions\nTheme park admissions revenue growth was due to an increase of 5% from higher average per capita ticket revenue. \nRevenues - Resorts and vacations\nHigher resorts and vacations revenue was primarily due to increases of 4% from additional passenger cruise days, 2% from an increase in occupied hotel room nights, 1% from higher unit sales at Disney Vacation Club and 1% from an increase in average daily hotel room rates. The increase in passenger cruise days reflected the launch of the \nDisney Treasure \nin the first quarter of the current year.\nRevenues - Park & Experiences merchandise, food and beverage\nParks & Experiences merchandise, food and beverage revenue growth was attributable to increases of 3% from higher average guest spending and 1% from volume growth.\nRevenues - Merchandise licensing and retail\nHigher merchandise licensing and retail revenue was due to increases of 2% from merchandise licensing and 1% from retail, partially offset by a decrease of 2% from an unfavorable Foreign Exchange Impact.\nRevenues - Parks licensing and other\nThe increase in parks licensing and other revenue was due to the benefit of a rebate received in the current period, an increase in royalties from Tokyo Disney Resort, higher real estate sales and increases in co-branding and sponsorship revenue, partially offset by an unfavorable Foreign Exchange Impact.\n61\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nKey metrics\n \nDomestic\nInternational\n \nNine Months Ended\nNine Months Ended\n \nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nParks\nIncrease (decrease)\nAttendance\n—  %\n1  %\n— %\n15  %\nPer Capita Guest Spending\n5  %\n3  %\n— %\n7  %\nHotels\nOccupancy\n88  %\n86  %\n87  %\n83  %\nAvailable Hotel Room Nights (in thousands)\n7,653\n7,640\n2,376\n2,381\nChange in Per Room Guest Spending\n4  %\n3  %\n5  %\n8  %\nOperating expenses\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nOperating labor\n$\n(6,661)\n  \n$\n(6,222)\n(7) %\nInfrastructure costs\n(2,527)\n(2,432)\n(4) %\nCost of goods sold and distribution costs\n(2,431)\n(2,482)\n2  %\nOther operating expense\n(2,536)\n(2,426)\n(5) %\n$\n(14,155)\n$\n(13,562)\n  \n(4) %\nThe increase in operating labor was due to inflation and, to a lesser extent, new guest offerings and higher volumes. Higher infrastructure costs were attributable to an increase in technology spending, new guest offerings and higher operations support costs, partially offset by cost management initiatives. Lower cost of goods sold and distribution costs were driven by a decrease in operations support costs and cost management initiatives, partially offset by higher volumes. Other operating expense increased primarily due to new guest offerings, higher volumes and increased operations support costs, partially offset by cost management initiatives.\nSelling, general, administrative and other\nSelling, general, administrative and other costs increased $193 million, to $3,023 million from $2,830 million, primarily due to higher marketing costs.\nDepreciation and amortization\nDepreciation and amortization increased $189 million, to $2,095 million from $1,906 million, due to higher depreciation at our domestic parks and experiences driven by an increase at Disney Cruise Line.\nOperating Income from Experiences\nSegment operating income increased $504 million from $7,613 million to $8,117 million due to growth at domestic parks and experiences.\n62\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nSupplemental revenue and operating income\nThe following table presents supplemental revenue and operating income detail for the Experiences segment:\nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nSupplemental revenue detail\nParks & Experiences\nDomestic\n$\n19,334\n \n$\n18,075 \n7  %\nInternational\n4,778\n \n  \n4,600 \n  \n4  %\nConsumer Products\n3,278\n \n3,236 \n1  %\n$\n27,390\n \n$\n25,911 \n6  %\nSupplemental operating income detail\nParks & Experiences\nDomestic\n$\n5,455\n \n$\n5,031 \n8  %\nInternational\n1,067\n \n1,055 \n1  %\nConsumer Products\n1,595\n \n1,527 \n4  %\n$\n8,117\n \n$\n7,613 \n7  %\nItems Excluded from Segment Operating Income Related to Experiences\nThe following table presents supplemental information for items related to the Experiences segment that are excluded from segment operating income:\nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nTFCF Acquisition Amortization\n$\n(5)\n$\n(5)\n—  %\nCharge related to a legal ruling\n— \n(65)\n100  %\nCORPORATE AND UNALLOCATED SHARED EXPENSES\n \nQuarter Ended\n% Change\nBetter\n(Worse)\nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nCorporate and unallocated shared expenses\n$\n(410)\n$\n(328)\n(25) %\n$\n(1,265)\n$\n(1,027)\n(23) %\nCorporate and unallocated shared expenses increased $82 million for the quarter, from $328 million to $410 million, primarily due to a legal settlement, timing of allocations to the segments and higher compensation costs, partially offset by a gain on a land sale. Corporate and unallocated shared expenses for the nine-month period increased $238 million, from $1,027 million to $1,265 million, primarily due to legal settlements, higher compensation and human resource-related costs and timing of allocations to the segments, partially offset by a gain on a land sale. \n63\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nFINANCIAL CONDITION\nThe change in cash and cash equivalents is as follows:\n \nNine Months Ended\n% Change\nBetter\n(Worse)\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nCash provided by operations\n$\n13,627\n \n$\n8,453 \n61  %\nCash used in investing activities\n(6,193)\n(4,903)\n(26) %\nCash used in financing activities\n(8,090)\n   \n(11,722)\n   \n31  %\nImpact of exchange rates on cash, cash equivalents and restricted cash\n31\n \n(14)\nnm\nChange in cash, cash equivalents and restricted cash\n$\n(625)\n$\n(8,186)\n92  %\nOperating Activities\nCash provided by operations increased $5.2 billion from $8.5 billion in the prior-year period to $13.6 billion for the current period. The increase was due to lower tax payments in the current period compared to the prior-year period and higher operating cash flows at Entertainment and, to a lesser extent, Experiences. Tax payments in the prior-year period reflected the payment of fiscal 2023 U.S. federal and California state income taxes that had been deferred pursuant to relief related to 2023 winter storms in California. In addition, fiscal 2025 U.S. federal and California state income tax payments have been deferred until October 2025 pursuant to relief related to the 2025 wildfires in California. The increase in operating cash flows at Entertainment was primarily due to higher cash receipts primarily attributable to higher revenue and, to a lesser extent, lower spending on content including the impact of the Star India Transaction, partially offset by higher operating cash disbursements primarily due to higher operating expenses. The increase in operating cash flows at Experiences was due to higher cash receipts attributable to higher revenue, partially offset by higher operating cash disbursements due to higher operating expenses.\nProduced and licensed programming costs\nThe Entertainment and Sports segments incur costs to produce and license film, episodic, sports and other content. Production costs include spend on content internally produced at our studios such as live-action and animated films and episodic series. Production costs also include original content commissioned from third-party studios. Programming costs include content rights licensed from third parties for use on the Company’s sports and general entertainment networks and DTC streaming services. Programming assets are generally recorded when the programming becomes available to us with a corresponding increase in programming liabilities.\n64\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nThe Company’s film and television production and programming activity for the nine months ended June 28, 2025 and June 29, 2024 are as follows:\n \nNine Months Ended\n(in millions)\nJune 28,\n2025\nJune 29,\n2024\nBeginning balances:\nProduced and licensed programming assets\n$\n34,409\n \n$\n36,593 \nProgramming liabilities\n(3,692)\n  \n(3,792)\n  \n30,717\n \n32,801 \nSpending:\nProgramming licenses and rights\n10,492\n \n10,773 \nProduced film and television content\n7,116\n \n7,184 \n17,608\n \n17,957 \nAmortization:\nProgramming licenses and rights\n(10,431)\n(11,565)\nProduced film and television content\n(7,996)\n(7,513)\n(18,427)\n(19,078)\nChange in produced and licensed content costs\n(819)\n(1,121)\nContent Impairment (see Note 16 to the Condensed Consolidated Financial Statements)\n(109)\n— \nProduced and licensed content costs contributed to joint venture\n—\n \n(978)\nOther non-cash activity\n92\n \n382 \nEnding balances:\nProduced and licensed programming assets\n33,034\n \n34,791 \nProgramming liabilities\n(3,153)\n(3,707)\n$\n29,881\n \n$\n31,084 \nThe Company currently expects its fiscal 2025 spend on produced and licensed content, including sports rights, to be comparable to fiscal 2024 spend of $23 billion.\nInvesting Activities\nInvesting activities consist principally of investments in parks, resorts and other property and acquisition and divestiture activity. The Company’s investing activities for the nine months ended June 28, 2025 and June 29, 2024 are as follows:\nNine Months Ended\n(provided by (used in) in millions)\nJune 28,\n2025\nJune 29,\n2024\nInvestments in parks, resorts and other property:\nEntertainment\n$\n(835)\n  \n$\n(750)\n  \nSports\n—\n \n(2)\nExperiences\nDomestic\n(4,068)\n(1,953)\nInternational\n(865)\n(706)\nTotal Experiences\n(4,933)\n(2,659)\nCorporate\n(340)\n(512)\nTotal investments in parks, resorts and other property\n(6,108)\n(3,923)\nOther investing activities, net\n(85)\n(980)\nCash used in investing activities\n$\n(6,193)\n$\n(4,903)\nCapital expenditures at the Entertainment segment primarily reflect investments in technology and in facilities and equipment for expanding and upgrading broadcast centers, production facilities and television station facilities.\n65\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nCapital expenditures at the Experiences segment are principally for theme park and resort expansion, new attractions, cruise ships, capital improvements and technology.\n \nThe increase in the current period compared to the prior-year period was due to higher spend on cruise ship fleet expansion.\nCapital expenditures at Corporate primarily reflect investments in corporate facilities, technology and equipment. The decrease in the current period compared to the prior-year period was due to lower spend on facilities.\nThe Company currently expects its fiscal 2025 capital expenditures to be approximately $8 billion compared to fiscal 2024 capital expenditures of $5 billion. \nOther Investing Activities\nOther investing activities in the prior-year period reflected an investment in Epic Games.\nFinancing Activities\nFinancing activities for the nine months ended June 28, 2025 and June 29, 2024 are as follows:\nNine Months Ended\n(provided by (used in) in millions)\nJune 28,\n2025\nJune 29,\n2024\nChange in borrowings\n$\n(3,410)\n  \n$\n780 \n  \nDividends\n(905)\n(549)\nRepurchases of common stock\n(2,496)\n(2,523)\nAcquisition of redeemable noncontrolling interest\n(439)\n(8,610)\nOther financing activities, net\n(1)\n(840)\n(820)\nCash used in financing activities\n$\n(8,090)\n$\n(11,722)\n(1)\nPrimarily consists of dividends to noncontrolling interest holders and equity award activity.\nSee Note 5 to the Condensed Consolidated Financial Statements for a summary of the Company’s borrowing activities during the nine months ended June 28, 2025 and information regarding the Company’s bank facilities. The Company may use cash balances, operating cash flows, commercial paper borrowings up to the amount of its unused $12.25 billion bank facilities and incremental term debt issuances to retire or refinance other borrowings before or as they come due.\nSee Note 11 to the Condensed Consolidated Financial Statements for a summary of dividends and share repurchases. The Company is targeting approximately $3 billion in share repurchases in fiscal 2025.\nThe redeemable noncontrolling interest activity in the current and prior-year period was attributable to the acquisition of NBCU’s interest in Hulu. In June 2025, the Company paid an incremental amount for Hulu based on a final appraisal of Hulu’s fair value (see Note 4 to the Condensed Consolidated Financial Statements).\nThe Company’s operating cash flow and access to the capital markets can be impacted by factors outside of its control. We believe that the Company’s financial condition is strong and that its cash balances, other liquid assets, operating cash flows, access to debt and equity capital markets and borrowing capacity under current bank facilities, taken together, provide adequate resources to fund ongoing operating requirements, contractual obligations, upcoming debt maturities, as well as future capital expenditures related to the expansion of existing businesses and development of new projects. In addition, the Company could undertake other measures to ensure sufficient liquidity, such as raising additional financing, reducing or not declaring future dividends; reducing or stopping share repurchases; reducing capital spending; reducing film and episodic content investments; or implementing further cost-saving initiatives.\nThe Company’s borrowing costs can also be impacted by short- and long-term debt ratings assigned by nationally recognized rating agencies, which are based, in significant part, on the Company’s performance as measured by certain credit metrics such as leverage and interest coverage ratios. As of June 28, 2025, Moody’s Ratings’ long- and short-term debt ratings for the Company were A2 and P-1 (Stable), respectively, S&P Global Ratings’ long- and short-term debt ratings for the Company were A and A-1 (Stable), respectively, and Fitch Rating’s long- and short-term debt ratings for the Company were A- and F2 (Stable), respectively. The Company’s bank facilities contain only one financial covenant, relating to interest coverage of three times earnings before interest, taxes, depreciation and amortization, including both intangible amortization and amortization of our film and television production and programming costs. On June 28, 2025, the Company met this covenant by a significant margin. The Company’s bank facilities also specifically exclude certain entities, including the Asia Theme Parks, from any representations, covenants or events of default.\n66\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nMARKET RISK\nThe Company is exposed to the impact of interest rate changes, foreign currency fluctuations, commodity fluctuations and changes in the market values of its investments.\nPolicies and Procedures\nIn the normal course of business, we employ established policies and procedures to manage the Company’s exposure to changes in interest rates, foreign currencies and commodities using a variety of financial instruments.\nOur objectives in managing exposure to interest rate changes are to limit the impact of interest rate volatility on earnings and cash flows and to lower overall borrowing costs. To achieve these objectives, we primarily use interest rate swaps to manage net exposure to interest rate changes related to the Company’s portfolio of borrowings. By policy, the Company targets fixed-rate debt as a percentage of its net debt between minimum and maximum percentages.\nOur objective in managing exposure to foreign currency fluctuations is to reduce volatility of earnings and cash flows in order to allow management to focus on core business issues and challenges. Accordingly, the Company enters into various contracts that change in value as foreign exchange rates change to protect the U.S. dollar equivalent value of its existing foreign currency assets, liabilities, commitments and forecasted foreign currency revenues and expenses. The Company utilizes option strategies and forward contracts that provide for the purchase or sale of foreign currencies to hedge probable, but not firmly committed, transactions. The Company also uses forward and option contracts to hedge foreign currency assets and liabilities. The principal foreign currencies hedged are the euro, British pound, Japanese yen, Chinese yuan and Canadian dollar. Cross-currency swaps are used to effectively convert foreign currency denominated borrowings to U.S. dollar denominated borrowings. By policy, the Company maintains hedge coverage between minimum and maximum percentages of its forecasted foreign exchange exposures generally for periods not to exceed four years. The gains and losses on these contracts are intended to offset changes in the U.S. dollar equivalent value of the related exposures. The economic or political conditions in a country have reduced and in the future could reduce our ability to hedge exposure to currency fluctuations in the country or our ability to repatriate revenue from the country.\nOur objectives in managing exposure to commodity fluctuations are to use commodity derivatives to reduce volatility of earnings and cash flows arising from commodity price changes. The amounts hedged using commodity swap contracts are based on forecasted levels of consumption of certain commodities, such as fuel oil and gasoline.\nOur objectives in managing exposures to market-based fluctuations in certain retirement liabilities are to use total return swap contracts to reduce the volatility of earnings arising from changes in these retirement liabilities. The amounts hedged using total return swap contracts are based on estimated liability balances.\nIt is the Company’s policy to enter into foreign currency and interest rate derivative transactions and other financial instruments only to the extent considered necessary to meet its objectives as stated above. The Company does not enter into these transactions or any other hedging transactions for speculative purposes.\nCOMMITMENTS AND CONTINGENCIES\nLegal Matters\nAs disclosed in Note 13 to the Condensed Consolidated Financial Statements, the Company has exposure for certain legal matters.\nGuarantees\nSee Note 5 to the Condensed Consolidated Financial Statements.\nTax Matters\nAs disclosed in Note 9 to the Consolidated Financial Statements in the 2024 Annual Report on Form 10-K, the Company has exposure for certain tax matters.\nContractual Commitments\nSee Note 14 to the Consolidated Financial Statements in the 2024 Annual Report on Form 10-K.\nUNCERTAINTIES \nThe future effects of the evolving macroeconomic, trade and travel conditions, including as a result of evolving international political developments, trade policies and consumer spending dynamics are unknown and, depending on how these conditions develop, could adversely affect demand for and availability of our products and services, increase our costs to provide products and services and have a negative impact on our results of operations. See also “Risk Factors” in our 2024 Annual Report on Form 10-K and this Quarterly Report on Form 10-Q.\n67\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nOTHER MATTERS\nAccounting Policies and Estimates\nWe believe that the application of the following accounting policies, which are important to our financial position and results of operations, require significant judgments and estimates on the part of management. For a summary of our significant accounting policies, including the accounting policies discussed below, see Note 2 to the Consolidated Financial Statements in the 2024 Annual Report on Form 10-K.\nProduced and Acquired/Licensed Content Costs\nWe amortize and test for impairment of capitalized film and television production costs based on whether the content is predominantly monetized individually or as a group. See Note 7 to the Condensed Consolidated Financial Statements for further discussion.\nProduction costs that are classified as individual are amortized based upon the ratio of the current period’s revenues to the estimated remaining total revenues (Ultimate Revenues).\nWith respect to produced films intended for theatrical release, the most sensitive factor affecting our estimate of Ultimate Revenues is theatrical performance. Revenues derived from other markets subsequent to the theatrical release are generally highly correlated with theatrical performance. Theatrical performance varies primarily based upon the public interest and demand for a particular film, the popularity of competing films at the time of release and the level of marketing effort. Upon a film’s release and determination of the theatrical performance, the Company’s estimates of revenues from succeeding windows and markets, which may include imputed license fees for content that is used on our DTC streaming services, are revised based on historical relationships and an analysis of current market trends.\nWith respect to capitalized television production costs that are classified as individual, the most sensitive factor affecting estimates of Ultimate Revenues is program ratings of the content on our licensees’ platforms. Program ratings, which are an indication of market acceptance, directly affect the program’s ability to generate advertising and subscriber revenues and are correlated with the license fees we can charge for the content in subsequent windows and for subsequent seasons.\nUltimate Revenues are reassessed each reporting period and the impact of any changes on amortization of production cost is accounted for as if the change occurred at the beginning of the current fiscal year. If our estimate of Ultimate Revenues decreases, amortization of costs may be accelerated or result in an impairment. Conversely, if our estimate of Ultimate Revenues increases, cost amortization may be slowed.\nProduction costs classified as individual are tested for impairment at the individual title level by comparing that title’s unamortized costs to the present value of discounted cash flows directly attributable to the title. To the extent the title’s unamortized costs exceed the present value of discounted cash flows, an impairment charge is recorded for the excess.\nProduced content costs that are part of a group and acquired/licensed content costs are amortized based on projected usage, typically resulting in an accelerated or straight-line amortization pattern. The determination of projected usage requires judgment and is reviewed on a regular basis for changes. Adjustments to projected usage are applied prospectively in the period of the change. Historical viewing patterns are the most significant input into determining the projected usage, and significant judgment is required in using historical viewing patterns to derive projected usage. If projected usage changes we may need to accelerate or slow the recognition of amortization expense.\nCost of content that is predominantly monetized as a group is tested for impairment by comparing the present value of the discounted cash flows of the group to the aggregate unamortized costs of the group. The group is established by identifying the lowest level for which cash flows are independent of the cash flows of other produced and licensed content. If the unamortized costs exceed the present value of discounted cash flows, an impairment charge is recorded for the excess and allocated to individual titles based on the relative carrying value of each title in the group. If there are no plans to continue to use an individual film or television program that is part of a group, the unamortized cost of the individual title is written down to its estimated fair value. Licensed content is included as part of the group within which it is monetized for purposes of impairment testing.\nThe amortization of multi-year sports rights is based on projections of revenues for each season relative to projections of total revenues over the contract period (estimated relative value). Projected revenues include advertising revenue and an allocation of affiliate revenue. If the annual contractual payments related to each season approximate each season’s estimated relative value, we expense the related contractual payments during the applicable season. If estimated relative values by year were to change significantly, amortization of our sports rights costs may be accelerated or slowed.\n68\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nRevenue Recognition\nThe Company has revenue recognition policies for its various operating segments that are appropriate to the circumstances of each business. Refer to Note 2 to the Consolidated Financial Statements in the 2024 Annual Report on Form 10-K for our revenue recognition policies. \nPension and Postretirement Medical Plan Actuarial Assumptions\nThe Company’s pension and postretirement medical benefit obligations and related costs are calculated using a number of actuarial assumptions. Two critical assumptions, the discount rate and the expected return on plan assets, are important elements of expense and/or liability measurement, which we evaluate annually. See Note 10 to the Consolidated Financial Statements in the 2024 Annual Report on Form 10-K for estimated impacts of changes in these assumptions. Other assumptions include the healthcare cost trend rate and employee demographic factors such as retirement patterns, mortality, turnover and rate of compensation increase.\nThe discount rate enables us to state expected future cash payments for benefits as a present value on the measurement date. A lower discount rate increases the present value of benefit obligations and increases pension and postretirement medical expense. The guideline for setting this rate is a high-quality long-term corporate bond rate. The Company’s discount rate was determined by considering yield curves constructed of a large population of high-quality corporate bonds and reflects the matching of the plans’ liability cash flows to the yield curves.\nTo determine the expected long-term rate of return on the plan assets, we consider the current and expected asset allocation, as well as historical and expected returns on each plan asset class. A lower expected rate of return on plan assets will increase pension and postretirement medical expense.\nGoodwill, Other Intangible Assets, Long-Lived Assets and Investments\nThe Company is required to test goodwill and other indefinite-lived intangible assets for impairment on an annual basis and if current events or circumstances require, on an interim basis. The Company performs its annual test of goodwill and indefinite-lived intangible assets for impairment in its fiscal fourth quarter.\nGoodwill is allocated to various reporting units, which are an operating segment or one level below the operating segment. To test goodwill for impairment, the Company first performs a qualitative assessment to determine if it is more likely than not that the carrying amount of a reporting unit exceeds its fair value. If it is, a quantitative assessment is required. Alternatively, the Company may bypass the qualitative assessment and perform a quantitative impairment test.\nThe qualitative assessment requires the consideration of factors such as recent market transactions, macroeconomic conditions and changes in projected future cash flows of the reporting unit.\nThe quantitative assessment compares the fair value of each reporting unit to its carrying amount, and to the extent the carrying amount exceeds the fair value, an impairment of goodwill is recognized for the excess up to the amount of goodwill allocated to the reporting unit.\nThe impairment test for goodwill requires judgment related to the identification of reporting units, the determination of whether reporting units should be aggregated, the assignment of assets and liabilities including goodwill to reporting units, and the determination of fair value of the reporting units.\nTo determine the fair value of our reporting units, we generally use a present value technique (discounted cash flows) corroborated by market multiples when available and as appropriate. The discounted cash flow analyses are sensitive to our estimated projected future cash flows as well as the discount rates used to calculate their present value. Our future cash flows are based on internal forecasts for each reporting unit, which consider projected inflation and other economic indicators, as well as industry growth projections. Discount rates are determined based on the inherent risks of the underlying operations. Significant judgments and assumptions in the discounted cash flow model used to determine fair value include future revenues and certain operating expenses, operating margins, terminal growth rates and discount rates. We believe our estimates are consistent with how a marketplace participant would value our businesses.\nThe majority of the Company’s recorded goodwill is assigned to the entertainment reporting unit (approximately $51 billion). Based on our annual assessment performed in the fourth quarter of fiscal 2024, the fair value of the entertainment reporting unit exceeded its carrying amount by less than 10%, and an approximate 40 basis point increase in the discount rate or an approximate 6% reduction in projected annual cash flows used to determine the fair value of the entertainment reporting unit would effectively eliminate the excess fair value over carrying amount.\nTo test other indefinite-lived intangible assets for impairment, the Company first performs a qualitative assessment to determine if it is more likely than not that the carrying amount of each of its indefinite-lived intangible assets exceeds its fair value. If it is, a quantitative assessment is required. Alternatively, the Company may bypass the qualitative assessment and perform a quantitative impairment test.\n69\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nThe qualitative assessment requires the consideration of factors such as recent market transactions, macroeconomic conditions and changes in projected future cash flows.\nThe quantitative assessment compares the fair value of an indefinite-lived intangible asset to its carrying amount. If the carrying amount of an indefinite-lived intangible asset exceeds its fair value, an impairment loss is recognized for the excess. Fair values of indefinite-lived intangible assets are determined based on discounted cash flows or appraised values, as appropriate.\nThe Company tests long-lived assets, including amortizable intangible assets, for impairment whenever events or changes in circumstances (triggering events) indicate that the carrying amount may not be recoverable. Once a triggering event has occurred, the impairment test employed is based on whether the Company’s intent is to hold the asset for continued use or to hold the asset for sale. The impairment test for assets held for use requires a comparison of the estimated undiscounted future cash flows expected to be generated over the useful life of the significant assets of an asset group to the carrying amount of the asset group. An asset group is generally established by identifying the lowest level of cash flows generated by a group of assets that are largely independent of the cash flows of other assets and could include assets used across multiple businesses. If the carrying amount of an asset group exceeds the estimated undiscounted future cash flows, an impairment would be measured as the difference between the fair value of the asset group and the carrying amount of the asset group. For assets held for sale, to the extent the carrying amount is greater than the asset’s fair value less costs to sell, an impairment loss is recognized for the difference. Determining whether a long-lived asset is impaired requires various estimates and assumptions, including whether a triggering event has occurred, the identification of asset groups, estimates of future cash flows and the discount rate used to determine fair values.\nThe Company has investments in equity securities, including equity method investments. For equity securities that do not have a readily determinable fair value, we consider forecasted financial performance of the investee companies, as well as volatility inherent in the external markets for these investments. If these forecasts are not met, impairment charges may be recorded.\nSee Note 16 to the Condensed Consolidated Financial Statements for information regarding significant impairment charges recorded in the periods presented.\nAllowance for Credit Losses\nWe evaluate our allowance for credit losses and estimate collectability of accounts receivable based on historical bad debt experience, our assessment of the financial condition of individual companies with which we do business, current market conditions and reasonable and supportable forecasts of future economic conditions. In times of economic turmoil, such as during the COVID-19 pandemic, our estimates and judgments with respect to the collectability of our receivables are subject to greater uncertainty than in more stable periods. If our estimate of uncollectible accounts is too low, costs and expenses may increase in future periods, and if it is too high, costs and expenses may decrease in future periods. See Note 3 to the Condensed Consolidated Financial Statements for additional discussion.\nContingencies and Litigation\nWe are currently involved in certain legal proceedings and, as required, have accrued estimates of the probable and estimable losses for the resolution of these proceedings. These estimates are based upon an analysis of potential results, assuming a combination of litigation and settlement strategies and have been developed in consultation with outside counsel as appropriate. From time to time, we are also involved in other contingent matters for which we accrue estimates for a probable and estimable loss. It is possible, however, that future results of operations for any particular quarterly or annual period could be materially affected by changes in our assumptions or the effectiveness of our strategies related to legal proceedings or our assumptions regarding other contingent matters. See Note 13 to the Condensed Consolidated Financial Statements for more detailed information on litigation exposure.\nIncome Tax \nAs a matter of course, the Company is regularly audited by federal, state and foreign tax authorities. From time to time, these audits result in proposed assessments. Our determinations regarding the recognition of income tax benefits are made in consultation with outside tax and legal counsel, where appropriate, and are based upon the technical merits of our tax positions in consideration of applicable tax statutes and related interpretations and precedents and upon the expected outcome of proceedings (or negotiations) with taxing and legal authorities. The tax benefits ultimately realized by the Company may differ from those recognized in our future financial statements based on a number of factors, including the Company’s decision to settle rather than litigate a matter, relevant legal precedent related to similar matters and the Company’s success in supporting its filing positions with taxing authorities.\n70\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nNew Accounting Pronouncements\nSee Note 17 to the Condensed Consolidated Financial Statements for information regarding new accounting pronouncements.\nDTC PRODUCT DESCRIPTIONS,  KEY DEFINITIONS AND SUPPLEMENTAL INFORMATION\nProduct Offerings\nIn the U.S., Disney+, ESPN+ and Hulu SVOD Only are each offered as a standalone service or as part of various multi-product offerings. Hulu Live TV + SVOD includes Disney+ and ESPN+. Disney+ is available in more than 150 countries and territories outside the U.S. Depending on the market, our services can be purchased on our websites or through third-party platforms/apps or are available via wholesale arrangements. \nPaid Subscribers\nPaid subscribers reflect subscribers for which we recognized subscription revenue. Certain product offerings provide the option for an extra member to be added to an account (extra member add-on). These extra members are not counted as paid subscribers. Subscribers cease to be a paid subscriber as of their effective cancellation date or as a result of a failed payment method. Subscribers to multi-product offerings in the U.S. are counted as a paid subscriber for each of the Company's services included in the multi-product offering, and subscribers to Hulu Live TV + SVOD are counted as one paid subscriber for each of the Hulu Live TV + SVOD, Disney+ and ESPN+ services. Subscribers include those who receive an entitlement to a service through wholesale arrangements, including those for which the service is available to each subscriber of an existing content distribution tier. When we aggregate the total number of paid subscribers across our DTC streaming services, we refer to them as paid subscriptions.\nInternational Disney+\nInternational Disney+ includes the Disney+ service outside the U.S. and Canada.\nAverage Monthly Revenue Per Paid Subscriber\nHulu and ESPN+ average monthly revenue per paid subscriber is calculated based on the average of the monthly average paid subscribers for each month in the period. The monthly average paid subscribers is calculated as the sum of the beginning of the month and end of the month paid subscriber count, divided by two. Disney+ average monthly revenue per paid subscriber is calculated using a daily average of paid subscribers for the period. Revenue includes subscription fees, advertising (excluding revenue earned from selling advertising spots to other Company businesses), premium and feature add-on revenue and extra member add-on revenue but excludes Pay-Per-View revenue. Advertising revenue generated by content on one DTC streaming service that is accessed through another DTC streaming service by subscribers to both streaming services is allocated between both streaming services. The average revenue per paid subscriber is net of discounts on offerings that carry more than one service. Revenue is allocated to each service based on the relative retail or wholesale price of each service on a standalone basis. Hulu Live TV + SVOD revenue is allocated to the SVOD services based on the wholesale price of the Hulu SVOD Only, Disney+ and ESPN+ multi-product offering. In general, wholesale arrangements have a lower average monthly revenue per paid subscriber than subscribers that we acquire directly or through third-party platforms.\nSupplemental information about paid subscribers:\n(in millions)\nJune 28,\n2025\nMarch 29,\n2025\nJune 29,\n2024\nDomestic (U.S. and Canada) standalone\n53.1\n54.7\n60.6\nDomestic (U.S.) multi-product\n(1)\n33.2\n31.7\n25.3\nDomestic (U.S. and Canada)\n(3)\n86.3\n86.4\n85.9\nInternational\n(2)\n69.9\n68.2\n66.0\nTotal\n(3)\n156.2\n154.6\n151.9\n(1)\nAt June 28, 2025, there were 15.4 million and 17.8 million paid subscribers to two-service and three-service multi-product offerings, respectively. At March 29, 2025, there were 13.3 million and 18.4 million paid subscribers to two-service and three-service multi-product offerings, respectively. At June 29, 2024, there were 5.8 million and 19.5 million paid subscribers to two-service and three-service multi-product offerings, respectively.\n(2)\nThe prior-year quarter paid subscribers have been adjusted to include Disney+ paid subscribers in Southeast Asia, which were previously reported with Disney+ Hotstar. Disney+ Hotstar was included in the Star India Transaction. \n(3)\nTotal may not equal the sum of the column due to rounding.\n71\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nPLANNED REPORTING CHANGES\nSince we began reporting the number of paid subscribers and average monthly revenue per paid subscriber, our DTC strategy and the DTC marketplace have evolved. Given this evolution, we plan to implement changes to our Entertainment and Sports financial disclosures. Among our planned changes, because we believe quarterly updates on the number of paid subscribers and average monthly revenue per paid subscriber have become less meaningful to evaluating the performance of our businesses, we will no longer report these metrics starting the first quarter of fiscal 2026 for Disney+ and Hulu and the fourth quarter of fiscal 2025 for ESPN+. We will also consolidate the lines of business in our Entertainment reporting, though will provide information on Entertainment Direct-to-Consumer profitability.\nSUPPLEMENTAL GUARANTOR FINANCIAL INFORMATION\nOn March 20, 2019 as part of the acquisition of TFCF, The Walt Disney Company (“TWDC”) became the ultimate parent of TWDC Enterprises 18 Corp. (formerly known as The Walt Disney Company) (“Legacy Disney”). Legacy Disney and TWDC are collectively referred to as “Obligor Group”, and individually, as a “Guarantor”. Concurrent with the close of the TFCF acquisition, $16.8 billion of TFCF’s assumed public debt (which then constituted 96% of such debt) was exchanged for senior notes of TWDC (the “exchange notes”) issued pursuant to an exemption from registration under the Securities Act of 1933, as amended (the “Securities Act”), pursuant to an Indenture, dated as of March 20, 2019, between TWDC, Legacy Disney, as guarantor, and Citibank, N.A., as trustee (the “TWDC Indenture”) and guaranteed by Legacy Disney. On November 26, 2019, $14.0 billion of the outstanding exchange notes were exchanged for new senior notes of TWDC registered under the Securities Act, issued pursuant to the TWDC Indenture and guaranteed by Legacy Disney. In addition, contemporaneously with the closing of the March 20, 2019 exchange offer, TWDC entered into a guarantee of the registered debt securities issued by Legacy Disney under the Indenture dated as of September 24, 2001 between Legacy Disney and Wells Fargo Bank, National Association, as trustee (the “2001 Trustee”) (as amended by the first supplemental indenture among Legacy Disney, as issuer, TWDC, as guarantor, and the 2001 Trustee, as trustee).\nOther subsidiaries of the Company do not guarantee the registered debt securities of either TWDC or Legacy Disney (such subsidiaries are referred to as the “non-Guarantors”). The par value and carrying value of total outstanding and guaranteed registered debt securities of the Obligor Group at June 28, 2025 was as follows:\nTWDC\nLegacy Disney\n(in millions)\nPar Value\nCarrying Value\nPar Value\nCarrying Value\nRegistered debt with unconditional guarantee\n$\n30,411\n$\n31,207\n$\n7,200\n$\n7,122\nThe guarantees by TWDC and Legacy Disney are full and unconditional and cover all payment obligations arising under the guaranteed registered debt securities. The guarantees may be released and discharged upon (i) as a general matter, the indebtedness for borrowed money of the consolidated subsidiaries of TWDC in aggregate constituting no more than 10% of all consolidated indebtedness for borrowed money of TWDC and its subsidiaries (subject to certain exclusions), (ii) upon the sale, transfer or disposition of all or substantially all of the equity interests or all or substantially all, or substantially as an entirety, the assets of Legacy Disney to a third party, and (iii) other customary events constituting a discharge of a guarantor’s obligations. In addition, in the case of Legacy Disney’s guarantee of registered debt securities issued by TWDC, Legacy Disney may be released and discharged from its guarantee at any time Legacy Disney is not a borrower, issuer or guarantor under certain material bank facilities or any debt securities.\nOperations are conducted almost entirely through the Company’s subsidiaries. Accordingly, the Obligor Group’s cash flow and ability to service its debt, including the public debt, are dependent upon the earnings of the Company’s subsidiaries and the distribution of those earnings to the Obligor Group, whether by dividends, loans or otherwise. Holders of the guaranteed registered debt securities have a direct claim only against the Obligor Group.\n72\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nSet forth below is summarized financial information for the Obligor Group on a combined basis after elimination of (i) intercompany transactions and balances between TWDC and Legacy Disney and (ii) equity in the earnings from and investments in any subsidiary that is a non-Guarantor. This summarized financial information has been prepared and presented pursuant to the Securities and Exchange Commission Regulation S-X Rule 13-01, “Financial Disclosures about Guarantors and Issuers of Guaranteed Securities” and is not intended to present the financial position or results of operations of the Obligor Group in accordance with GAAP.\nResults of operations (in millions)\nNine Months Ended June 28, 2025\nRevenues\n$\n—\nCosts and expenses\n—\nNet income (loss)\n(2,010)\nNet income (loss) attributable to TWDC shareholders\n(2,010)\nBalance Sheet (in millions)\nJune 28,\n2025\nSeptember 28,\n2024\nCurrent assets\n$\n1,543\n$\n2,767\nNoncurrent assets\n3,410\n3,336\nCurrent liabilities\n7,388\n7,640\nNoncurrent liabilities (excluding intercompany to non-Guarantors)\n37,452\n40,608\nIntercompany payables to non-Guarantors\n166,064\n157,925\n73"
}