{
  "source_file": "dlr-20241231x10k.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.     BUSINESS\nThe Company\nDigital Realty Trust, Inc., through its controlling interest in Digital Realty Trust, L.P. and the subsidiaries of the Operating Partnership, is a leading global provider of data center, colocation and interconnection solutions for customers across a variety of industry verticals. The Parent operates as a REIT for U.S. federal income tax purposes. The Operating Partnership is the entity through which the Parent conducts its business of owning, acquiring, developing and operating data centers. The Parent was incorporated in the state of Maryland on March 9, 2004. The Operating Partnership was organized as a limited partnership in the state of Maryland on July 21, 2004.\nAs of December 31, 2024, our portfolio consisted of 308 data centers (including 78 data centers held as investments in unconsolidated entities), of which 121 are located in the United States, 112 are located in Europe, 36 are located in Latin America, 16 are located in Africa, 16 are located in Asia, six are located in Australia and three are located in Canada.\nOur principal executive offices are located at 2323 Bryan Street, Suite 1800, Dallas, Texas 75201. Our telephone number is (214) 231-1350. Our website is www.digitalrealty.com. The information found on, or otherwise accessible through, our website is not incorporated by reference into, nor does it form a part of, this Annual Report on Form 10-K.\nIndustry Background\nThe digital economy continues to grow and change how enterprises across all industries create and deliver value. Companies increasingly need to operate ubiquitously, on-demand and with real-time intelligence serving customers, partners and employees across multiple channels, business functions and points of business presence. Computational processing power requirements continue to advance, data traffic is growing, and the volume of data that enterprises generate, transmit, process, analyze, monitor and manage is expanding dramatically. The Internet of Things, 5G, autonomous vehicles and artificial intelligence, among other technological advancements, are driving this digital transformation.\nWe believe that enterprise data growth is accelerating due to the growing digital economy and emerging technological advances. As enterprises analyze and process this accelerating data mass, they create more data. As this mass of data continues to grow, it needs to be analyzed and processed: a task which we believe is becoming increasingly challenging to replicate and relocate. This phenomenon is called Data Gravity. We believe that enterprise decisionmakers will need to increasingly consider how Data Gravity impacts their enterprise IT architectures and, accordingly, we have developed the Data Gravity Index: a global forecast that measures the intensity and gravitational force of enterprise data growth.\nAs the largest global provider of cloud- and carrier-neutral data center, colocation and interconnection solutions, we believe the data center industry is poised for sustainable growth. The demand for data center infrastructure is being driven by this digital transformation which is contributing to the explosive growth of data, rapid growth of cloud adoption and greater demand for IT outsourcing. The power requirements and financial costs to support this growth in data, traffic and storage are substantial and growing accordingly. We believe data centers will continue to play a critical role in the digital economy and enabling business transformation strategies.\nWe believe cloud solutions and hybrid cloud solutions will remain significant drivers of demand for data center infrastructure. The hybrid cloud, which combines public and private cloud solutions, has gained traction because it enables corporate enterprises to achieve efficiencies and contain costs, as well as scale and secure their most sensitive information. In addition, the leading cloud service providers are generally mature, well-capitalized technology companies, and cloud platforms are among the fastest-growing business segments. Data center providers that can solve global coverage, capacity and connectivity needs, and coordinate and aggregate diverse customer and application demand, are poised to benefit from these cloud-specific industry drivers.\n1\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nThese diverse and secular industry dynamics are driving greater demand for data center capacity not only from global cloud service providers, but also from businesses across other industries, including IT service firms, social media, content providers and the financial services sector. As companies focus on their core competencies and rely on outsourcing to meet their IT infrastructure needs, they are prioritizing colocation for their data center solutions for various reasons, including to reduce latency in data transfer and increase global presence and connectivity. New technologies need a fast, reliable and flexible foundation to operate, and the importance of offering a full spectrum of power, space and connectivity solutions on a global platform continues to grow.\nOur Business\nWe provide a global data center platform that supports our customers’ digital infrastructure and enables our customers to interconnect with their customers and partners. We solve global coverage, capacity and connectivity needs for companies of all sizes, including the world’s leading enterprises and services providers, through PlatformDIGITAL®, a global data center platform for scaling digital business which enables customers to deploy their critical infrastructure with a global data center provider.\nPlatformDIGITAL® combines our global presence with our Pervasive Data Center Architecture (PDx®) solution methodology for scaling digital business and efficiently managing data gravity challenges. Digital Realty gives its customers access to the connected communities that matter to them with a global data center footprint of over 300 facilities with over 227,000 cross connects in over 50 metros across more than 25 countries on six continents. \nFundamentally, we bring together foundational real estate and innovative technology expertise around the world to deliver a comprehensive, dedicated product suite to meet customers’ data and connectivity needs. We represent an important part of the digital economy that we believe will benefit from powerful, long-term growth drivers.\nWe believe that the growth trends in the data center market, technology, the cloud, internet traffic and internet-based services, combined with cost advantages in outsourcing data center requirements, provide attractive growth opportunities for us as a data center solutions provider. Leveraging deep expertise in technology and real estate, we have an expansive global footprint, impressive scale and a full-spectrum fit-for-purpose product offering in key metropolitan areas around the world. These advantages simplify the contracting process for multinational enterprises, eliminating their need to negotiate with multiple local data center solutions providers. In addition, in areas where high data center construction and operating costs and long time-to-market prohibit many of our customers from building their own data centers, our global footprint and scale allow us to meet our customers’ needs quickly and efficiently.\n2\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nOur Data Center Portfolio\nOur portfolio of high-quality data centers provides secure, highly connected and continuously available environments for the exchange, processing and storage of critical data. Data centers are used for digital communication, disaster recovery purposes, transaction processing and housing mission-critical corporate IT applications. Our internet gateway data centers are highly connected, network-dense facilities that serve as hubs for internet and data communications within and between major metropolitan areas. We believe internet gateways are extremely valuable, and a high-quality, highly interconnected global portfolio such as ours could not be easily replicated today on a cost-competitive basis.\nWe are diversified across major metropolitan areas characterized by a high concentration of connected end-users and technology companies. At December 31, 2024, we owned or had investments in properties, on a wholly-owned basis or through unconsolidated entities, in the following geographies:\n​\nAs of December 31, 2024, our portfolio, including investments in unconsolidated entities, contained a total of approximately 54.9 million rentable square feet, including approximately 8.9 million square feet of space under active development and 4.7 million square feet of space held for development. As of December 31, 2024, the 78 data centers held as investments in unconsolidated entities had an aggregate of approximately 9.2 million rentable square feet. In addition, as of December 31, 2024, we estimate that our land and other space held for, or actively under, construction could accommodate over 3,500 megawatts of additional data center capacity, including more than 1,000 additional megawatts developable in Northern Virginia. From time to time, we may look to sell individual assets or portfolios that we do not consider to be core to our business and growth strategy.\nA significant component of our current and future growth is expected to be generated through the development of our existing space held for future development and acquisition of new properties. As of December 31, 2024, our portfolio, including the 78 data centers held as investments in unconsolidated entities, was approximately 84.1% leased. From time to time, we may look to sell individual assets or portfolios that we do not consider to be core to our business and growth strategy.\n3\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nThrough strategic investments, we have expanded our footprint into Latin America, enhanced our data center offerings in strategic and complementary U.S. metropolitan areas, established our colocation and interconnection platform in the U.S. and expanded our colocation and interconnection platform in Europe and Africa, with each transaction enhancing our presence in top-tier locations throughout North America, Europe, Latin America and Africa. In addition, on August 1, 2022, we completed our acquisition \nof a majority interest in Teraco, the largest and most densely interconnected data center platform in South Africa, with an in-service portfolio of seven state-of-the-art data centers strategically located in the key South African metro areas of Johannesburg, Cape Town and Durban. In addition, we are investing in our consolidated and unconsolidated portfolio to organically expand our capacity. As of December 31, 2024, we had 644 megawatts of projects underway across multiple metropolitan areas around the world, and 70% percent of this data center activity was pre-leased.\nThe locations of and improvements to our data centers, the network density, interconnection infrastructure and connectivity-centric customers in certain of our facilities, and our comprehensive product offerings are critical to our customers’ businesses, which we believe results in high occupancy levels, longer average lease terms and customer relationships, as well as lower turnover. In addition, many of our data centers contain significant improvements that have been installed at our customers’ expense. The tenant improvements in our data centers are generally readily adaptable for use by similar customers.\nOur data centers are physically secure, network-rich and equipped to meet the power and cooling requirements of smaller footprints up to the most demanding IT applications. Many of our data centers are located on major aggregation points formed by the physical presence of multiple major telecommunications service providers, which reduces our customers’ costs and operational risks and enhances the attractiveness of our properties. In addition, our strategically located global data center campuses offer our customers the ability to expand their global footprint as their businesses grow, while our connectivity offerings on our campuses enhance the capabilities and attractiveness of these facilities. Further, the network density, interconnection infrastructure and connectivity-centric customers in certain of our data centers have led to the organic formation of densely connected data communities that are difficult for competitors to replicate and deliver added value to our customers.\nOur Product Offerings\nWe provide a flexible, global data center platform that allows our customers to achieve infrastructure deployments and controls matched to their business needs. Our data centers and comprehensive suite of product offerings are conceived to scale, from a single cabinet up to multi-megawatt data halls, complemented by connectivity and partnered solutions to support their requirements. We strive to provide a product mix that appeals to leading technology companies and enterprises, especially those seeking to support a greater portion of their data center requirements through a single provider. Our Critical Facilities Management® services and team of engineers and data center operations experts provide 24/7 support for these mission-critical facilities.\n​\nPlatformDIGITAL® Solution Model\n.\n The PlatformDIGITAL® solution model is based on our patented Pervasive Data Center Architecture (PDx®) methodology, which brings users, networks, clouds, controls and systems to the data, removing barriers, creating centers of data exchange to accommodate distributed workflows and scaling digital business. PlatformDIGITAL® offers solutions for service providers and enterprises supporting their IT architecture requirements with features such as:\nNetwork \n \nConsolidates and localizes traffic into ingress/egress points to optimize network performance and cost\nControl \n \nHosts adjacent security and IT controls to improve security posture and Hybrid-IT operations\nData \n \nLocalizes data aggregation, staging, analytics, streaming and data management to optimize data exchange and Private AI workloads\n​\nHigh Density\n​\nSupports advances in mechanical cooling for next generation chipsets / infrastructure, maximizing performance of customer data center infrastructure \n4\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nCapacity\n​\nProduct Types \n \nDescription\n0 to 1 MW \n(Colocation)\n​\n \nSmall (one cabinet) to medium (150 cabinets) deployments\nProvides agility to quickly deploy in days\nContract length generally 2-5 years\nConsistent designs, operational environment, power expenses\n> 1 MW\n(Scale & Hyperscale\nPowered Base Building\n®\n)\n \nScale from medium to very large deployments\nSolution can be executed in weeks\nContract length generally 5-10+ years\nCustomized data center environment for specific deployment needs\n​\nThe PlatformDIGITAL\n®\n solution model is available in our colocation and scale data centers, which are move-in ready, physically secure facilities with the power, cooling and interconnection capabilities to support customers requiring a cabinet, cage, suite or entire hall or building. We believe our colocation facilities are effective solutions for customers who may lack the bandwidth, capital budget, expertise or desire to provide their own extensive data center infrastructure, management and security. We believe our offerings are also well-suited for those customers who seek to efficiently exchange data with others in our connected data communities lowering their costs and creating value for their business. For customers who possess the ability to build and operate their own facility, our Powered Base Building® solution provides the physical location, requisite power and network access necessary to support a state-of-the-art data center.\n​\nAdditionally, our data center campuses offer our customers the opportunity to expand in or near their existing deployments within our data center campuses.\n​\nConnectivity\n​\nProduct\n \nDescription\nCross Connect\n \nA physical connection between two customer defined end points in a Digital Realty facility enabling customers to directly exchange data traffic\nCampus Connect\n \nLocal, dedicated connectivity solution within Digital Realty campus environments located in hyperconnected metros around the world enabling multiple facilities on a single campus to exchange data traffic and therefore operate as a virtual single data center\nMetro Connect\n \nDedicated connection between multiple Digital Realty facilities located in the same metro area enabling fast connectivity for data traffic between them\nServiceFabric™\n \nA global open orchestration platform enabling customers to easily provision global connectivity and orchestrate connected services across Digital Realty’s worldwide data center footprint and in third party locations\nIP Bandwidth\n \nDedicated Internet Access using blend of ISPs. Provides customer with highly resilient customer dedicated connections including Fixed and Burstable Service options\nPathway\n \nConduit based access to support bulk fiber interconnection, typically terminating into the POP or Meet Me Room within a given facility\n​\n5\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nThrough investments and strategic partnerships, we have significantly expanded our capabilities as a leading provider of interconnection and cloud-enablement services globally. We believe interconnection is an attractive line of business that would be difficult to build organically and enhances the overall value proposition of our data center product offerings. Through product offerings such as our ServiceFabric™ and partnerships with cloud service providers, we can support our customers’ hybrid cloud architecture requirements.\nOur Global Customers\nOur portfolio has attracted a high-quality, diversified mix of customers. We have more than 5,000 customers, and no single customer represented more than approximately 11.5% of the aggregate annualized recurring revenue of our portfolio as of December 31, 2024.\nGlobal Customer Base across a Wide Variety of Industry Sectors\n. \nWe use our in-depth knowledge of requirements for trends impacting cloud and information technology service providers, content providers, network and communications providers, and other data center users, including enterprise customers, to market our data centers to meet these customers’ specific technology needs. Our customers are increasingly launching multi-regional deployments and growing with us globally. Our largest customer accounted for approximately 11.5% of our aggregate annualized recurring revenue as of December 31, 2024. No other single customer accounted for more than approximately 6.4% of the aggregate annualized recurring revenue of our portfolio. Our customers represent a variety of industry verticals, ranging from cloud and information technology services, communications and social networking to financial services, manufacturing, energy, gaming, life sciences and consumer products.\n​\n​\n​\n​\n​\nCloud and IT Services\n​\nDigital Content Providers and Financial Companies\n​\nNetwork and Mobile Services\nFortune 50 Software Company\n​\nFortune 25 Investment Grade-Rated Company\n​\nAT&T\nGlobal Cloud Provider\n​\nJPMorgan Chase & Co.\n​\nComcast Corporation\nIBM\n​\nLinkedIn Corporation\n​\nLumen Technologies, Inc.\nOracle Corporation\n​\nMeta Platforms, Inc.\n​\nVerizon\n​\nProven Experience Attracting and Retaining Customers\n.\n Our specialized data center salesforce, which is aligned to meet our customers’ needs for global, enterprise and network solutions, provides a robust pipeline of new customers, while existing customers continue to grow and expand their utilization of our technology-enabled services to support a greater portion of their IT needs.\nOur Design, Engineering and Construction Program\nOur extensive development activity, operating scale and process-based approach to data center design and construction result in significant cost savings and added value for our customers. We have leveraged our purchasing power by securing global purchasing agreements and developing relationships with major equipment manufacturers, reducing costs and shortening delivery timeframes on key components, including major mechanical and electrical equipment. See \"We and our customers may experience supply chain or procurement disruptions, or increased supply chain costs, which may lead to delays.\" in Item 1A. Risk Factors for further discussion. Utilizing our innovative modular data center design, we deliver what we believe to be a technically superior data center environment at significant cost savings and reduced time frames. Our access to capital and investment-grade ratings allow us to provide data center solutions for customers who do not want to invest their own capital.\n6\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nOur Investment Approach\nWe have developed detailed, standardized procedures for evaluating acquisitions and investments, including income-producing properties as well as vacant buildings and land suitable for development, to ensure that they meet our strategic, financial, technical and other criteria. These procedures, together with our in-depth knowledge of the technology, data center and real estate industries, allow us to identify strategically located properties and evaluate investment opportunities efficiently and, as appropriate, commit and close quickly. Our investment-grade ratings, along with our broad network of contacts within the data center industry, enable us to effectively capitalize on acquisition and investment opportunities.\nOur Management Team and Organization\nOur senior management team has many years of experience in the technology and/or real estate industries, including experience as investors in and advisors to technology companies. We believe that our senior management team’s extensive knowledge of both the technology and the real estate industries provides us with a key competitive advantage. Further, a significant portion of compensation for our senior management team and directors is in the form of common equity interests in our Company. We also maintain minimum stock ownership requirements for our senior management team and directors, further aligning their interests with those of external stockholders, as well as an employee stock purchase plan, which encourages our employees to have ownership in the Company.\nOur Business and Growth Strategies\nOur primary business objectives are to maximize: (i) sustainable long-term growth in earnings and funds from operations per share and unit, (ii) cash flow and returns to our stockholders and our Operating Partnership’s unitholders through the payment of dividends and distributions and (iii) return on invested capital. We expect to accomplish these objectives by achieving superior risk-adjusted returns, prudently allocating capital, diversifying our product offerings, accelerating our global reach and scale, and driving revenue growth and operating efficiencies.\nSuperior Risk-Adjusted Returns\n.\n \nWe believe that achieving appropriate risk-adjusted returns on our business, including on our development pipeline and leasing transactions, will deliver superior stockholder returns. We may continue to build out our development pipeline when justified by anticipated returns. We have established robust internal guidelines for reviewing and approving leasing transactions, which we believe will drive risk-adjusted returns. We also believe that providing an even stronger value proposition to our customers, including new and more comprehensive product offerings, as well as continuing to improve operational efficiencies, will further drive improved returns for our business.\nPrudently Allocate Capital\n. We believe that the strategic deployment of capital at sufficiently positive spreads above our cost of capital enables us to increase cash flow and create long-term stockholder value.\nStrategic and Complementary Investments.\n We have developed significant expertise at underwriting, financing and executing data center investment opportunities. We employ a collaborative approach to deal analysis, risk management and asset allocation, focusing on key elements, such as market fundamentals, accessibility to fiber and power, and the local regulatory environment. In addition, the specialized nature of data centers makes these investment opportunities more difficult for traditional real estate investors to underwrite, resulting in reduced competition for investments relative to other property types. We believe this dynamic creates an opportunity for us to generate attractive risk-adjusted returns on our capital.\n7\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nPreserve the Flexibility of Our Balance Sheet.\n We are committed to maintaining a conservative capital structure. Our goal is to average through business cycles the following financial ratios: 1) a debt-to-Adjusted EBITDA ratio around 5.5x, 2) a fixed charge coverage of greater than three times, and 3) floating rate debt at less than 20% of total outstanding debt. In addition, we strive to maintain a well-laddered debt maturity schedule, and we seek to maximize the menu of our available sources of capital, while minimizing the cost. Since Digital Realty Trust, Inc.’s initial public offering in 2004, we have raised approximately $74 billion of capital through common (excluding forward contracts), preferred and convertible preferred equity offerings, exchangeable debt offerings, non-exchangeable bond offerings, our Global Revolving Credit Facilities, our term loan facilities, a senior notes shelf facility, secured mortgage financings and re-financings, joint venture partnerships and the sale of non-core assets. We endeavor to maintain financial flexibility while using our liquidity and access to capital to support operations, our acquisition, investment, leasing and development programs and global campus expansion, which are important sources of our growth.\nLeverage Technology to Develop Comprehensive and Diverse Products. \nWe believe we have one of the most comprehensive suites of global data center solutions available to customers from a single provider.\nGlobal Service Infrastructure Platform\n. With our acquisitions, which extended our footprint further across Latin America, Europe and Africa, enhanced our portfolio of scale and hyper-scale data centers in the U.S. and furthered our position as a leading provider of colocation, interconnection and cloud-enablement services globally, we are able to offer one of the industry’s broadest range of data center solutions to meet our customers’ needs, from a single rack or cabinet to multi-megawatt deployments. We believe our products like ServiceFabric™ and our partnerships with managed services and cloud service providers further enhance the attractiveness of our data centers.\nProvide Foundational Services to Enable Customers and Partners.\n We believe that the platform, through which we offer the foundational services of space, power and connectivity, will enable our customers and partners to serve their customers and grow their businesses. We believe our Internet gateway data centers, individual data centers and data center campuses are attractive to a wide variety of customers and partners of all sizes. Furthermore, we believe our colocation and interconnection offerings, as well as the densely connected data communities that have developed within our facilities, and the availability and scalability of our comprehensive suite of products are valuable and critical to our customers and partners.\nAccelerate Global Reach and Scale. \nWe have strategically pursued international expansion since our IPO in 2004 and now operate across six continents. We believe that our global multi-product data center portfolio is a foundational element of our strategy and our scale and global platform represent key competitive advantages difficult to replicate. Customers and competitors are recognizing the value of interconnected scale, which aligns with our connected campus strategy that enables customers to “land and expand” with us. We expect to continue to source and execute strategic and complementary transactions to strengthen our data center portfolio, expand our global footprint and product mix, and enhance our scale. \nDrive Revenue Growth and Operating Efficiencies. \nWe aggressively manage our properties to maximize cash flow and control costs by leveraging our scale to drive operating efficiencies.\nLeverage Strong Industry Relationships.\n Our global market leadership position and strong industry relationships provide us with a unique vantage point to detect and capitalize on secular trends as they emerge globally. We focus our industry relationship efforts towards market sensing, market shaping and helping to set open standards that benefit companies of all types to derive value from digital infrastructure and multi-tenant datacenters. Industry collaboration includes engagements with industry associations, IT industry analysts, venture capitalists, technology incubators, technology service providers, telecommunications providers, systems integrators and large multi-national companies across segments including manufacturing, transportation and logistics, financial services, healthcare, pharmaceutical and digital media. These relationships help us forge new product capabilities, inform investment decisions, develop new routes to market and create differentiated value for customers and drive long-term growth and yield for stockholders.\n8\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nMaximize Cash Flow.\n We often acquire operating properties with substantial in-place cash flow and some vacancy, which enables us to create upside through lease-up. We control our costs by negotiating expense pass-through provisions in customer agreements for operating expenses, including power costs and certain capital expenditure. We have also focused on centralizing functions and optimizing operations as well as improving processes and technologies. We believe that expanding our global data center campuses will also contribute to operating efficiencies because we expect to achieve economies of scale on our campus environments.\nSustainability. \nWe believe that addressing sustainability by driving environmental efficiency through the implementation of cost-effective design features and the use of carbon-free and renewable energy serves as a key differentiator enabling us to deliver products that help attract and retain customers, generate cash flow, and manage operational risks. In 2024, for the eighth consecutive year, we received the Nareit “Leader in the Light” award for data centers, recognizing our sustainability and energy-efficiency achievements.\nThe Real Estate Sustainability Accounting Standard guidance, issued by the Sustainability Accounting Standards Board, outlines proposed disclosure topics and accounting metrics for the real estate industry. We provide data on energy and water management metrics that we believe best correlate with our business and industry as indicated in the following sections. Energy and water data receive third party assurance as part of our annual environmental, social, and governance (“ESG”) report development process.\nEnergy Management\na) 2023 Energy Data \n(1)\na\nEnergy Consumption Data Coverage as % of Floor Area\nTotal Energy Consumed by Portfolio Area with Data Coverage (MWh)\n(2)\nGrid electricity consumption as a % of Energy Consumption\nRenewable Energy as a % of Energy Consumption\n(3)\nLike-for-Like Change in Energy Consumption for Portfolio Area with Data Coverage\n(4)\n97%\n11,368,215\n97%\n64%\n9%\n​\n(1)\nThe most recent full year for which energy data is available is 2023. The scope of data coverage includes managed and non-managed assets. In 2023, 99% of the Company’s portfolio consisted of data center space along with limited accessory uses, predominantly office space. These secondary space types are not broken out by subsector. \n(2)\nThe scope of energy includes energy purchased from sources external to the Company and its customers; energy produced by the Company and its customers (i.e., self-generated); and energy from other sources, including direct fuel usage.\n(3)\nProvided as a percent of energy consumption for managed assets. Excludes renewable energy delivered as part of the standard utility fuel mix. Includes above-baseline utility renewables (e.g., green tariffs), Energy Attribute Certificate (“EAC”) purchases, customer-sourced renewable energy and EACs generated by the Company. \n(4)\nScope of data is aligned with the 2023 GRESB Real Estate Assessment Reference Guide (“Like-for-like Comparison”).\n​\n9\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nb) Sustainable Data Center Ratings\nWe seek to certify new construction and major redevelopment projects in accordance with recognized sustainable building standards including the U.S. Green Building Council LEED rating system and the BREEAM rating scheme. We may also certify certain properties in accordance with recognized sustainable operations standards. Our data center space receiving third-party sustainable ratings in 2024 totaled 1.2 million square feet. We received the following sustainable data center ratings for the following sites:\n​\nData Center\nMetropolitan Area\nRating System\nLevel Achieved\n22588 Relocation Drive\nAshburn\nLEED \n(1)\nGold\n5870 NE Schaaf Street\nPortland\nLEED \n(1)\nSilver\nCalle Alfonso Gomez 4\nMadrid\nLEED \n(1)\nGold\nEnceinte Portuaire—Building 4\nMarseille\nBREEAM \n(2)\nVery Good\nIfestoy Street 72-74\nAthens\nLEED \n(1)\nGold\n​\n(1)\nLEED\nTM\n: Leadership in Energy and Environmental Design\n(2)\nBREEAM: Building Research Establishment Environmental Assessment Method\n​\nFor existing buildings, we seek to benchmark 100% of applicable U.S. properties in ENERGY STAR Portfolio Manager and pursue EPA ENERGY STAR certification for eligible U.S. properties. In 2024, we achieved ENERGY STAR for Data Centers recognition for 39 data centers, representing 52% of our U.S. managed data center portfolio by square feet. We may also certify certain properties outside the U.S. in accordance with regionally recognized energy performance rating standards, such as the NABERS rating scheme in Australia, the Switzerland Data Center Efficiency Association rating scheme and others. In total, 37% of our total global managed portfolio by square feet had an energy rating as of December 31, 2024, excluding Powered Base Building\n®\n space, space under active development, space held for development and non-managed assets.\n​\nc) Energy management considerations \n​\nEnergy and resource management considerations are integrated into our business decisions and strategy. For our operating portfolio, annual capital expense investment planning identifies and evaluates resource efficiency project opportunities alongside non-resource-impacting capital investments. For acquisitions and new development activity, resiliency risks, resource availability, and renewable energy access are considered. Our design and construction process incorporates sustainable features that support resource efficiency during construction as well as during the operational lifecycle of the sites.\n​\nWe seek to proactively identify and support opportunities to efficiently utilize resources, such as energy and water, throughout our operating portfolio. We set annual power usage effectiveness targets for assets. Forty-six of our data centers in EMEA participate in the European Union’s Code of Conduct for Energy Efficiency in Data Centers, a voluntary initiative which addresses airflow management, cooling system efficiency and capital plant replacement. \n​\nGlobally, we conduct external technical building assessments as well as utilize ENERGY STAR Portfolio Manager scores to prioritize efficiency opportunities. Energy efficiency measures typically affect building management systems, operational practices, HVAC and lighting improvements and building commissioning. In 2023, energy efficiency measures implemented totaled over 19,800MWh in projected energy saving. \n​\n10\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nWe set a global carbon reduction target that has been validated by the Science-Based Target Initiative to reduce our Scope 1 and 2 emissions 68% per square foot and Scope 3 emissions from purchased goods and services and fuel- and energy-related activities 24% per square foot by 2030, from a 2018 baseline. In 2023, we showed a 38% reduction in Scope 1 and 2 emissions and 58% reduction in Scope 3 emissions against our baseline. Additionally, we are a signatory to the EU Climate Neutral Data Centre Pact, a Self-Regulatory Initiative committing to climate neutrality by 2030 and setting additional goals around energy efficiency, carbon-free energy sourcing, water conservation and waste heat recycling. We continue to match the energy consumption of our European portfolio and the U.S. colocation business unit with renewable energy. Our six operational U.S. renewable energy purchase agreements produced 1,209 GWh of renewable energy credits in 2023.\n​\nWe implement ISO 14001 (Environmental Management) and ISO 50001 (Energy Management) to measure, manage and improve the energy and environmental performance of our data centers. In 2023, 49% of our global portfolio had ISO 14001 certifications and 31% of our global portfolio was covered under ISO 50001. Additionally, 100% of our Singapore portfolio was certified under the SS564 Green Data Centres standard for Energy and Environmental Management Systems.\n​\nWater Management\n​\na) 2023 Water Data\n \n(1)\n​\n​\nWater Withdrawal Data Coverage as % of Floor Area\n% of Floor Area with 40% or Greater Baseline Water Stress \n(2)\nTotal Water Withdrawn by Portfolio Area with Data Coverage (cubic meters, in thousands) \n(3)\n% of Water Withdrawn with 40% or Greater Baseline Water Stress \n(2)\nLike-for-Like Change in Water Withdrawals\n (4)\n92%\n15%\n5,685 \n12%\n18%\n(1)\nThe most recent full year for which water data is available is 2023. The scope of data coverage includes managed and non-managed assets. The scope of water withdrawals is aligned with the 2023 GRESB Real Estate Assessment Reference Guide. In 2023, 99% of the Company’s portfolio consisted of data center space along with limited accessory uses, predominantly office. These secondary space types are not broken out by subsector.\n(2)\nBased on properties classified as High or Extremely High Baseline Water Stress determined by the World Resources Institute’s Water Risk Atlas tool, Aqueduct. Includes properties that have complete water withdrawal data coverage. \n(3)\nThe scope of water consumed includes potable water and non-potable water purchased from third-party suppliers and water reused.\n(4)\nScope of data is aligned with the 2023 GRESB Real Estate Assessment Reference Guide (“Like-for-like Comparison”).\n​\nb) Water Management Risks and Mitigation Strategies\n​\nOur global water strategy addresses the strategic role that water plays in our operations and regions where water quality and scarcity pose the greatest interruption risk to our business.  Some of our assets are in regions of high or extremely high baseline water stress and may face future risk of water scarcity, higher water costs, and regulatory constraints on water consumption. We consider water availability, cost, and alternate supply solutions to potable water such as municipally supplied non-potable water, which accounted for 43% of our total water usage in 2024. We also consider cooling system designs to maximize ‘free cooling’ and reduce or eliminate reliance on water for cooling.\n​\nClimate Change Adaptation\n​\na) Properties exposed in 100-Year Flood Plains\n​\nTwo U.S. data centers totaling approximately 0.5 million square feet are exposed to 100-year flood zones designated by the U.S. Federal Emergency Management Agency as special flood hazard areas. An additional three properties in Europe totaling approximately 0.1 million square feet are exposed to 100-year flood zones. \n​\n11\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nb) Climate Change Risks and Mitigation Strategies\n​\nWe evaluate potential risks and opportunities as a result of climate change and have implemented strategies to mitigate risks and capitalize on opportunities. Climate change risks that we have identified include acute and chronic physical risks, as well as transition risks such as market, policy, reputational, and technology risks. Management of climate-related risks and opportunities is a company-wide effort, delivered through an interdisciplinary effort with contributions from our global operations team, risk management, environmental occupational health and safety, compliance, information security, physical security and other functions, with oversight by our executive management team and governed by our Board of Directors. We manage potential risks first via our siting and design standards, then by implementing recommendations to proactively mitigate losses related to short-term acute weather events as well as long-term climate-related changes. Climate resilience measures include maintaining appropriate levels of insurance for each asset, performing climate risk scenario analyses for a selection of our global portfolio, and implementing operational risk reduction measures at the site level. We continue to align our ESG Report with the recommendations of the Task Force on Climate-related Financial Disclosures to disclose specific climate-related financial risks and opportunities, mitigation strategies, and associated metrics and targets.\n​\nCompetition\nWe compete with numerous data center providers globally, many of whom own or operate properties similar to ours in some of the same metropolitan areas where our data centers are located, including Equinix, Inc. and NTT; various private operators in the U.S.; as well as Global Switch Holdings Limited and various regional operators in Europe, Asia, Latin America, Africa and Australia. See \"We face significant competition, which may adversely affect the occupancy and rental rates of our data centers.\" in Item 1A. Risk Factors.\nRegulation\nGeneral\nOur properties are subject to various laws, ordinances and regulations, including regulations relating to common areas. We believe each of our properties as of December 31, 2024 has the necessary permits and approvals to operate. \nAmericans with Disabilities Act\nOur properties must comply with Title III of the Americans with Disabilities Act of 1990, or the ADA, to the extent that such properties are “public accommodations” as defined by the ADA. We believe our properties are in substantial compliance with the ADA and that we will not be required to make substantial capital expenditures to address the requirements of the ADA. However, non-compliance with the ADA could result in imposition of fines or an award of damages to private litigants. The obligation to make accommodations in accordance with the ADA, as well as other applicable laws and regulations is an ongoing one, and we will continue to assess our properties and make alterations as appropriate in this respect. See “We may incur significant costs complying with applicable laws and governmental regulations, including the Americans with Disabilities Act.” in Item 1A. Risk Factors.\nEnvironmental Matters\nWe are exposed to various environmental risks that may result in unanticipated losses and could affect our operating results and financial condition. Either the previous owners or we have conducted environmental reviews on a majority of the properties we have acquired, including land. While some of these assessments have led to further investigation and sampling, none of the environmental assessments have revealed an environmental liability that we believe would have a material adverse effect on our business, financial condition or results of operations. See \"We could incur significant costs related to environmental matters, including from government regulation, private litigation, and existing conditions at some of our properties.\" in Item 1A. Risk Factors for further discussion.\n12\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nClimate Change Legislation\nThere continue to be numerous international, U.S. federal and state-level initiatives and proposals to address domestic and global climate issues. Climate change effects, if they occur, and governmental initiatives, laws and regulations to address potential climate concerns, could increase our costs and have a long-term adverse effect on our business and results of operations. Future legislation or regulatory activity in this area remains uncertain, and its effect on our operations is unclear at this time. See \"We could incur significant costs related to environmental matters, including from government regulation, private litigation, and existing conditions at some of our properties.\" in Item 1A. Risk Factors for further discussion.\nInsurance\nWe carry commercial general liability, property and business interruption insurance, and other insurance coverage on all of the properties in our portfolio. We select coverages, policy specifications and insured limits which we believe to be appropriate given the relative risk of loss, the cost of coverage, and industry practice. Insurance is maintained through a combination of commercial insurance, self-insurance and wholly-owned captive insurance entity. We believe the properties in our portfolio are adequately insured. We do not carry insurance for generally uninsured exposures such as loss from war or nuclear reaction. In addition, we carry earthquake insurance on our properties in an amount and with deductibles we believe are commercially reasonable.  See “Potential losses may not be covered by insurance.” in Item 1A. Risk Factors.\nHuman Capital Resource Management\n​\nAs of December 31, 2024, we had 3,936 full-time employees. The geographic distribution of our global employee base as of December 31, 2024 is summarized in the following table.\n​\n​\n​\n​\nRegion\n    \n​\nNorth America\n \n 1,781\nEMEA\n \n 1,922\nAsia Pacific\n \n 233\nTotal\n \n 3,936\n​\nCompensation, Benefits and Employee Wellbeing\n​\nTo attract and retain the best-qualified talent and to help our employees maintain healthy and balanced lives, and meet their financial and retirement goals, we offer market-competitive compensation and competitive benefits, including healthcare, vacation benefits, parental leave, 401(k)/pension company match, an employee stock purchase plan, fitness reimbursement program, commuter benefits, tuition reimbursement, employee skills development and leadership development. Employee surveys are conducted annually to solicit feedback and to help prioritize and improve employee engagement.\n​\nWe also encourage our employees to give back to the community by matching their contributions to eligible charitable organizations through our Matching Gifts Program. Additionally, our Donate 8 Program grants paid time off each year to employees for the purpose of volunteering for eligible organizations.\n​\nWe prioritize providing programs and benefits that promote healthy and productive lifestyles. We offer a company-wide wellness program that invests in the health, fitness, financial wellness and overall quality of life for our employees through education, challenges, incentives and reimbursements. \n​\nDuring 2024, we sought to play an active role in supporting the communities we operate in across North America, EMEA and APAC. This included companywide giving focused on our areas of philanthropic focus (disaster relief, STEM education and sustainability).\n​\n13\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nWorkplace Belonging\n​\nIt is our Company’s policy to recruit talent based on merit, without discrimination on the basis of any legally protected characteristic. Digital Realty’s Together@Digital workplace program aims to unlock innovation, enhance decision-making, attract top talent and better serve our customers.  Together@Digital also runs a philanthropic program with charitable giving to non-profit groups that support a range of programs from veterans to cultural institutions.   \n​\nIn 2023, we published our EEO-1 report, providing transparency on the racial and gender composition of our U.S. workforce. We disclose our inclusion strategy and initiatives annually in our ESG Report.\n​\nAvailable Information\nAll reports we file with the SEC are available free of charge via EDGAR through the SEC website at www.sec.gov. We will also provide copies of our Forms 8-K, Forms 10-K, Forms 10-Q, Proxy Statements and amendments to those documents at no charge to investors upon request and make electronic copies of such reports available through our website at www.digitalrealty.com as soon as reasonably practicable after filing such material with the SEC. The information found on, or otherwise accessible through, our website is not incorporated by reference into, nor does it form a part of, this report or any other document that we file with the SEC.\nOffices\nWe have regional U.S. offices in Boston, Chicago, Dallas, Los Angeles, New York, Northern Virginia and San Francisco and regional international offices in Amsterdam, Dublin, London, Singapore, Sydney, Tokyo and Hong Kong.\nReports to Security Holders\nDigital Realty Trust, Inc. is required to send an annual report to its securityholders and to our Operating Partnership’s unitholders.\n​",
  "item7": "ITEM 7.      MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with the Consolidated Financial Statements and notes thereto included in Item 8. of this report and the matters described under Item 1A. Risk Factors. We make statements in this section that are forward-looking statements within the meaning of the federal securities laws. For a complete discussion of forward-looking statements, see the section in this report entitled “Forward-Looking Statements.”\nA discussion regarding our financial condition and results of operations for 2024 as compared to 2023 is presented herein. Information on 2022 is presented in graphs and other tables only to show year-over-year trends in our results of operations and operating metrics. Our financial condition for 2022 and results of operations for 2022 – and also 2022 as compared to 2023 – can be found under Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations, of our Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on February 23, 2024.\nBusiness Overview and Strategy\nDigital Realty Trust, Inc., through its controlling interest in Digital Realty Trust, L.P. and its subsidiaries, delivers comprehensive space, power, and interconnection solutions that enable its customers and partners to connect with each other and service their own customers on a global technology and real estate platform. We are a leading global provider of data center, colocation and interconnection solutions for customers across a variety of industry verticals. Digital Realty Trust, Inc. operates as a REIT for U.S. federal income tax purposes, and our Operating Partnership is the entity through which we conduct our business and own our assets.\nOur primary business objectives are to maximize: \n(i)\nsustainable long-term growth in earnings and funds from operations per share and unit;\n(ii)\ncash flow and returns to our stockholders and Digital Realty Trust, L.P.’s unitholders through the payment of distributions; and\n(iii)\nreturn on invested capital. \nWe expect to accomplish our objectives by achieving superior risk-adjusted returns, prudently allocating capital, diversifying our product offerings, accelerating our global reach and scale, and driving revenue growth and operating efficiencies. A significant component of our current and future internal growth is anticipated through the development of our existing space held for development, acquisition of land for future development, and acquisition of new properties. \nWe target high-quality, strategically located properties containing the physical and connectivity infrastructure that supports the applications and operations of data center and technology industry customers and properties that may be developed for such use. Most of our data center properties contain fully redundant electrical supply systems, multiple power feeds, above-standard cooling systems, raised floor areas, extensive in-building communications cabling and high-level security systems. Fundamentally, we bring together foundational real estate and innovative technology expertise around the world to deliver a comprehensive, dedicated product suite to meet customers’ data and connectivity needs. We represent an important part of the digital economy that we believe will benefit from powerful, long-term growth drivers.\nWe have developed detailed, standardized procedures for evaluating new real estate investments to ensure that they meet our financial, technical and other criteria. We expect to continue to acquire additional assets as part of our growth strategy. We intend to aggressively manage and lease our assets to increase their cash flow. We may continue to build out our development portfolio when justified by anticipated demand and returns.\n56\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nWe may acquire properties subject to existing mortgage financing and other indebtedness or we may incur new indebtedness in connection with acquiring or refinancing these properties. Debt service on such indebtedness will have a priority over any cash dividends with respect to Digital Realty Trust, Inc.’s common stock and preferred stock. We are committed to maintaining a conservative capital structure. Our goal is to average through business cycles the following financial ratios: 1) a debt-to-Adjusted EBITDA ratio around 5.5x, 2) a fixed charge coverage of greater than three times, and 3) floating rate debt at less than 20% of total outstanding debt. In addition, we strive to maintain a well-laddered debt maturity schedule, and we seek to maximize the menu of our available sources of capital, while minimizing the cost.\nSummary of 2024 Significant Activities\nWe completed the following significant activities in 2024 as described in the Notes to the Consolidated Financial Statements:\n●\nIn January 2024, we:\no\nformed a joint venture with Blackstone Inc. to develop four hyperscale data center campuses across Frankfurt, Paris and Northern Virginia. We received approximately $231 million of net proceeds from the contribution of our data centers to the first phase of the joint venture and retained a 20% interest in the joint venture. As a result of transferring control, we derecognized the data centers and recognized a loss on disposition of approximately $0.3 million. We perform the day-to-day accounting and property management functions for the joint ventures and, as such, will earn management fees; and\no\nclosed on the sale of our interest in four data centers to Brookfield Infrastructure Partners L.P., or Brookfield, for approximately $271 million. The sale was completed subsequent to Brookfield’s November 2023 acquisition of one of our customers, Cyxtera Technologies. As a result of the sale, we recognized a total gain on disposition of approximately $200.5 million, of which $191.6 million is included within Gain on disposition of properties, net and $8.9 million is included within Equity in (loss) earnings of unconsolidated entities on our condensed consolidated income statements.\n●\nIn March 2024, we formed a joint venture with Mitsubishi Corporation, or Mitsubishi, to support the development of two data centers in the Dallas metro area. The facilities were 100% pre-leased prior to construction. We contributed the two data center buildings at a contribution value of approximately $261 million. We received approximately $153 million of gross proceeds from the contribution of our data centers to the joint venture and retained a 35% interest in the joint venture. Mitsubishi contributed such cash in exchange for a 65% interest in the joint venture. As a result of transferring control, we derecognized the data centers and recognized a gain on disposition of approximately $7.0 million. We perform the day-to-day accounting and property management functions for the joint venture and, as such, will earn a management fee.\n●\nIn April 2024, we:\no\nexpanded our existing joint venture with GI Partners with the sale to GI Partners of a 75% interest in a third facility on the same hyperscale data center campus in Chicago. We contributed the data center at a value of approximately $453 million. We received approximately $386 million of net proceeds from the contribution of our data center to the joint venture and the associated financing and retained a 25% interest in the joint venture. As a result of transferring control, we derecognized the data center and recognized a gain on disposition of approximately $172 million; and\no\ncompleted the sale of an additional 24.9% interest in a data center facility in Frankfurt, Germany to DCREIT for total consideration of approximately $126 million, and DCREIT then had a 49.9% interest in the Frankfurt data center. Because the Company still controlled this asset, no gain or loss was recorded on this 49.9% interest. In connection with this transaction, DCREIT loaned the consolidated subsidiary that owns the data center approximately $80 million. In December 2024, we \n57\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nclosed on the sale to DCREIT of an additional 15.1% interest in a data center located in Frankfurt, Germany for approximately $77 million. The transaction valued the Frankfurt facility at €470 million or $498 million (at 100% share). Including two prior investments, DCREIT now owns a 65% interest in this Frankfurt data center. We have retained a 35% interest in the Frankfurt facility. As a result of transferring control, we derecognized the Frankfurt facility and recognized a gain on disposition of approximately $101 million; and\n​\n●\nIn May 2024, Digital Realty Trust, Inc. and Digital Realty Trust, L.P. entered into an underwriting agreement with BofA Securities, Inc., Citigroup Global Markets Inc. and J.P. Morgan Securities LLC, as representatives of the several underwriters relating to the sale of up to approximately 12.1 million shares of common stock (including approximately 1.6 million shares that the underwriters had the option to purchase, and which option was exercised in full on May 8, 2024), at a purchase price to the underwriters of $136.66 per share. The offering closed on May 10, 2024, and we received net proceeds of approximately $1.7 billion.\n●\nIn September 2024:\no\nDigital Dutch Finco B.V., an indirect wholly owned finance subsidiary of the Operating Partnership, issued and sold €850 million aggregate principal amount of 3.875% Guaranteed Notes due 2033 (the “2033 Notes”). Net proceeds from the offering were approximately €843 million (approximately $933 million based on the exchange rate on September 13, 2024) after deducting managers’ discounts and estimated offering expenses; and\no\nwe refinanced our Global Revolving Credit Facility and Yen Revolving Credit Facility. The Global Revolving Credit Facilities provide for borrowings up to $4.4 billion (including approximately $0.3 billion available to be drawn on the Yen Revolving Credit Facility) based on currency commitments and foreign exchange rates as of December 31, 2024. The Global Revolving Credit Facility provides for borrowings in a variety of currencies and can be increased by an additional $1.8 billion, subject to receipt of lender commitments and other conditions precedent. Both facilities mature on January 24, 2029, with two six-month extension options available.\n●\nIn November 2024, Digital Realty Trust, L.P. issued $1,150,000,000 principal amount of its 1.875% Exchangeable Senior Notes due 2029 (the “Exchangeable Notes”). Net proceeds from the offering were approximately $1.13 billion after deducting managers’ discounts and offering expenses.\n●\nIn December 2024, the second phase of the Blackstone Inc. joint venture closed on hyperscale data center campuses in Frankfurt and Northern Virginia. We received approximately $385 million of net proceeds from the contribution of our data centers to the second phase of the joint venture and retained a 20% interest in the joint venture. As a result of transferring control, we derecognized the data centers and recognized a gain on disposition of approximately $44.5 million.\n​\n58\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nRevenue Base\nMost of our revenue consists of rental income generated by the data centers in our portfolio. Our ability to generate and grow revenue depends on several factors, including our ability to maintain or improve occupancy rates. A summary of our data center portfolio and related square feet (in thousands) occupied (excluding space under development or held for development) is shown below. Unconsolidated portfolios shown below consist of assets owned by unconsolidated entities in which we have invested. We often provide management services for these entities under management agreements and receive management fees. These are shown as Managed Unconsolidated Portfolio. Entities for which we do not provide such services are shown as Non-Managed Unconsolidated Portfolio.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAs of December 31, 2024\n​\nAs of December 31, 2023\nRegion\n​\nData Center Buildings\nNet Rentable Square Feet \n(1)\nSpace Under Active Development \n(2)\nSpace Held for Development \n(3)\nOccupancy\n​\nData Center Buildings\nNet Rentable Square Feet \n(1)\nSpace Under Active Development \n(2)\nSpace Held for Development \n(3)\nOccupancy\nNorth America\n​\n 101\n 20,004\n 2,775\n 1,025\n 85.5\n%\n​\n 107\n 20,150\n 2,590\n 1,335\n 83.8\n%\nEurope\n​\n 106\n 8,836\n 2,833\n 717\n 77.3\n%\n​\n 112\n 8,873\n 3,291\n 319\n 75.8\n%\nAsia Pacific\n​\n 11\n 1,577\n 66\n 289\n 81.2\n%\n​\n 11\n 1,652\n 73\n 207\n 76.7\n%\nAfrica\n​\n 12\n 1,704\n 1,422\n 21\n 82.8\n%\n​\n 12\n 1,528\n 1,581\n 23\n 71.0\n%\nConsolidated Portfolio\n​\n 230\n 32,120\n 7,096\n 2,052\n 82.9\n%\n​\n 242\n 32,203\n 7,535\n 1,884\n 79.8\n%\nManaged Unconsolidated Portfolio\n​\n 31\n 5,552\n 1,022\n 400\n 91.8\n%\n​\n 22\n 3,843\n 364\n —\n 93.7\n%\nNon-Managed Unconsolidated Portfolio\n​\n 47\n 3,654\n 787\n 2,234\n 83.0\n%\n​\n 45\n 3,641\n 571\n 2,246\n 85.3\n%\nTotal Portfolio\n​\n 308\n 41,326\n 8,904\n 4,686\n 84.1\n%\n​\n 309\n 39,688\n 8,470\n 4,130\n 81.7\n%\nNote: Table excludes data centers held for sale. Individual items may not add up to total due to rounding.\n(1)\nNet rentable square feet represent the current square feet under lease as specified in the applicable lease agreement plus management’s estimate of space available for lease based on engineering drawings. The amount includes customers’ proportional share of common areas but excludes space held for the intent of or under active development.\n(2)\nSpace under active development includes current base building and data center projects in progress, and excludes space held for development. For additional information on the current and future investment for space under active development, see “Liquidity and Capital Resources—Development Projects”.\n(3)\nSpace held for development includes space held for future data center development and excludes space under active development. For additional information on the current investment for space held for development, see “Liquidity and Capital Resources—Development Projects”.\n​\nLeasing Activities\nDue to the capital-intensive and long-term nature of the operations we support, our lease terms with customers are generally longer than standard commercial leases. As of December 31, 2024, our average remaining lease term was approximately five years.\nOur ability to re-lease expiring space at rental rates equal to or in excess of current rental rates will impact our results of operations. The subsequent table summarizes our leasing activity in the year ended December 31, 2024 (square feet in thousands):\n59\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n​\n    \n​\n​\n    \n​\n​\n    \n​\n    \n​\nTI’s/Lease\n    \nWeighted\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCommissions \n​\nAverage Lease \n​\n​\nRentable\n​\nExpiring \n​\nNew\n​\nRental Rate\n​\nPer Square \n​\nTerms \n​\n​\nSquare Feet \n(1)\n​\nRates \n(2)\n​\nRates \n(2)\n​\nChanges\n​\nFoot\n​\n(years)\nLeasing Activity \n(3)(4)\n \n  \n \n​\n  \n \n​\n  \n \n  \n \n​\n​\n  \n \n  \nRenewals Signed\n \n  \n \n​\n  \n \n​\n  \n \n  \n \n​\n​\n  \n \n  \n0 \n—\n 1 MW\n \n 2,082\n​\n$\n 251\n​\n$\n 264\n \n 5.0\n%  \n​\n$\n 1\n \n 1.5\n> 1 MW\n \n 2,513\n​\n$\n 129\n​\n$\n 164\n \n 27.4\n%  \n​\n$\n 1\n \n 5.5\nOther \n(6)\n \n 404\n​\n$\n 46\n​\n$\n 68\n \n 47.1\n%  \n​\n$\n 2\n \n 5.4\nNew Leases Signed \n(5)\n \n​\n​\n \n​\n​\n \n​\n \n​\n​\n​\n \n​\n \n​\n0 \n—\n 1 MW\n \n 649\n​\n \n —\n​\n$\n 294\n \n —\n​\n​\n$\n 10\n \n 3.9\n> 1 MW\n \n 2,581\n​\n \n —\n​\n$\n 302\n \n —\n​\n​\n$\n —\n \n 11.6\nOther \n(6)\n \n 105\n​\n \n —\n​\n$\n 63\n \n —\n​\n​\n$\n 10\n \n 12.2\nLeasing Activity Summary\n \n​\n​\n \n  \n​\n \n​\n \n​\n​\n​\n \n  \n \n  \n0 \n—\n 1 MW\n \n 2,731\n​\n \n​\n​\n$\n 271\n \n​\n​\n​\n \n​\n \n  \n> 1 MW\n \n 5,094\n​\n \n​\n​\n$\n 234\n \n​\n​\n​\n \n​\n \n  \nOther \n(6)\n \n 509\n​\n \n​\n​\n$\n 67\n \n​\n​\n​\n \n​\n \n  \n(1)\nFor some of our properties, we calculate square footage based on factors in addition to contractually leased square feet, including power, required support space and common area.\n(2)\nRental rates represent average annual estimated base cash rent per rentable square foot – calculated for each contract based on total cash base rent divided by the total number of years in the contract (including any tenant concessions). All rates were calculated in the local currency of each contract and then converted to USD based on average exchange rates for the period December 31, 2024.\n(3)\nExcludes short-term leases (less than 12 months).\n(4)\nCommencement dates for the leases signed range from 2024 to 2025.\n(5)\nIncludes leases signed for new and re-leased space.\n(6)\nOther includes Powered Base Building shell capacity as well as storage and office space within fully improved data center facilities.\n​\nWe continue to see strong demand in most of our key metropolitan areas for data center space and, subject to the supply of available data center space in these metropolitan areas, we expect average aggregate rental rates on renewed data center leases for 2025 expirations to be positive as compared with the rates currently being paid for the same space on a GAAP basis and on a cash basis. Our past performance may not be indicative of future results, and we cannot assure you that leases will be renewed or that our data centers will be re-leased at all or at rental rates equal to or above the current average rental rates. Further, re-leased/renewed rental rates in a particular metropolitan area may not be consistent with rental rates across our portfolio as a whole and may fluctuate from one period to another due to a number of factors, including local economic conditions, local supply and demand for data center space, competition from other data center developers or operators, the condition of the property and whether the property, or space within the property, has been developed.\n60\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nGeographic concentration\n​\nWe depend on the market for data centers in specific geographic regions and significant changes in these regional or metropolitan areas can impact our future results. The following table shows the geographic concentration based on annualized rent from our portfolio, including data centers held as investments in unconsolidated entities.\n​\n​\n​\n​\n​\n​\n    \nPercentage of\n​\n​\nDecember 31, 2024\nMetropolitan Area\n​\nTotal annualized rent\n (1)\nNorthern Virginia\n \n 19.6\n%\nChicago\n \n 7.7\n%\nFrankfurt\n \n 5.9\n%\nDallas\n \n 5.3\n%\nLondon\n \n 5.0\n%\nSingapore\n \n 4.6\n%\nNew York\n​\n 4.4\n%\nAmsterdam\n \n 4.0\n%\nSilicon Valley\n \n 4.0\n%\nSao Paulo\n \n 3.9\n%\nPortland\n \n 3.4\n%\nJohannesburg\n \n 3.2\n%\nParis\n \n 2.9\n%\nTokyo\n \n 2.0\n%\nPhoenix\n​\n 1.7\n%\nOther\n \n 22.4\n%\nTotal\n \n 100.0\n%\n(1)\nAnnualized rent is monthly contractual rent (defined as cash base rent before abatements) under existing leases as of the end of the period presented multiplied by 12. Includes consolidated portfolio and unconsolidated entities at the entities’ 100% ownership level. The aggregate amount of abatements for the year ended December 31, 2024 was approximately $44.3 million.\n​\nOperating Expenses\nOperating expenses primarily consist of utilities, property and ad valorem taxes, property management fees, insurance and site maintenance costs, and rental expenses on our ground and building leases. Our buildings require significant power to support data center operations and the cost of electric power and other utilities is a significant component of operating expenses.\nMany of our leases contain provisions under which tenants reimburse us for all or a portion of property operating expenses and real estate taxes incurred by us. However, in some cases we are not entitled to reimbursement of property operating expenses, other than utility expense, and real estate taxes under our leases for Turn-Key Flex® facilities. We expect to incur additional operating expenses as we continue to expand. \nCosts pertaining to our asset management function, legal, accounting, corporate governance, reporting and compliance are categorized as general and administrative costs within operating expenses. \nOther key components of operating expenses include: depreciation of our fixed assets, amortization of intangible assets, and transaction and integration costs.\n61\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nOther Income / (Expenses)\nEquity in earnings of unconsolidated entities, gain on disposition of properties, interest expense, and income tax expense make up the majority of Other income/(expenses). Equity in earnings of unconsolidated entities represents our share of the income/(loss) of entities in which we invest, but do not consolidate under U.S. GAAP. The largest of these investments is currently our investment in Ascenty, which is located primarily in Latin America. Our second-largest equity-method investment is Digital Core REIT, which is publicly traded on the Singapore Exchange (“SGX”) and which owns a portfolio of 10 properties operating in the United States, Canada, Germany and Japan. Refer to additional discussion of Digital Core REIT and Ascenty in the Notes to the Consolidated Financial Statements.\nResults of Operations\nAs a result of the consistent and significant growth in our business since the first property acquisition in 2002, we evaluate period-to-period results for revenue and property level operating expenses on a stabilized versus non-stabilized portfolio basis.\n​\nStabilized:\n The stabilized portfolio includes properties owned as of the beginning of all periods presented with less than 5% of total rentable square feet under development. \nNon-stabilized:\n The non-stabilized portfolio includes: (1) properties that were undergoing, or were expected to undergo, development activities during any of the periods presented; (2) any properties contributed to joint ventures, sold, or held for sale during the periods presented; and (3) any properties that were acquired or delivered at any point during the periods presented.\nA roll forward showing changes in the stabilized and non-stabilized portfolios for the year ended December 31, 2024 as compared to December 31, 2023 is shown below (in thousands).\n​\n​\n​\n​\n​\n​\n​\nNet Rentable Square Feet\n    \nStabilized\n    \nNon-Stabilized\n    \nTotal\nAs of December 31, 2023\n​\n 22,600\n​\n 9,603\n​\n 32,203\nNew development and space reconfigurations\n​\n (458)\n​\n 1,195\n​\n 737\nTransfers to stabilized from non-stabilized\n​\n 2,369\n​\n (2,431)\n​\n (62)\nTransfers to non-stabilized from stabilized\n​\n (170)\n​\n 73\n​\n (97)\nDispositions / Sales\n​\n (475)\n​\n (544)\n​\n (1,019)\nAcquisitions\n​\n —\n​\n 360\n​\n 360\nAs of December 31, 2024\n​\n 23,866\n​\n 8,256\n​\n 32,122\n​\n62\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nComparison of the Year Ended December 31, 2024 to the Year Ended December 31, 2023 \nRevenues \nTotal operating revenues as shown on our consolidated income statements was as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n $ Change\n​\n% Change\nStabilized\n​\n​\n 4,170,449\n​\n$\n 4,233,212\n​\n$\n (62,763)\n​\n (1.5)\n%\nNon-Stabilized\n​\n​\n 1,312,023\n​\n​\n 1,196,961\n​\n​\n 115,062\n​\n 9.6\n%\nRental and other services\n​\n​\n 5,482,472\n​\n​\n 5,430,173\n​\n​\n 52,299\n​\n 1.0\n%\nFee income and other\n​\n \n 72,496\n​\n \n 46,888\n​\n​\n 25,608\n​\n 54.6\n%\nTotal operating revenues\n​\n$\n 5,554,968\n​\n$\n 5,477,061\n​\n$\n 77,907\n​\n 1.4\n%\n​\nTotal operating revenues increased by approximately $77.9 million for the year ended December 31, 2024 compared to the same period in 2023. \n​\nStabilized rental and other services revenue decreased by $62.8 million for the year ended December 31, 2024 compared to the same period in 2023 primarily due to:\n(i)\na decrease of $161.0 million in utility reimbursement largely driven by power price decreases, mainly in EMEA and APAC; and\n(ii)\noffset by an increase of $98.2 million in new leasing and renewals across all regions.\n​\nNon-stabilized rental and other services revenue increased $115.1 million for the year ended December 31, 2024, compared to the same period in 2023, driven primarily by: \n(i)\nan increase of $375.9 million \ndue to the completion of our global development pipeline and related lease up operating activities\n (with the biggest contributions in Northern Virginia, Portland, Johannesburg, Paris, New York, and Toronto); and\n(ii)\noffset by a decrease of $260.8 million related to \nproperties sold and contributed in 2023 and 2024.\n63\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nOperating Expenses — Property Level\nProperty level operating expenses as shown in our consolidated income statements were as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n$ Change\n​\n% Change\nStabilized\n​\n$\n 1,020,379\n​\n$\n 1,203,719\n​\n$\n (183,340)\n​\n (15.2)\n%\nNon-Stabilized\n​\n \n 313,037\n​\n \n 268,117\n​\n​\n 44,920\n​\n 16.8\n%\nTotal Utilities\n​\n​\n 1,333,416\n​\n​\n 1,471,836\n​\n​\n (138,420)\n​\n (9.4)\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nStabilized\n​\n​\n 712,962\n​\n​\n 662,061\n​\n​\n 50,901\n​\n 7.7\n%\nNon-Stabilized\n​\n \n 271,959\n​\n \n 247,769\n​\n​\n 24,190\n​\n 9.8\n%\nTotal Rental property operating and maintenance (excluding utilities)\n​\n​\n 984,921\n​\n​\n 909,830\n​\n​\n 75,091\n​\n 8.3\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal Rental property operating and maintenance\n​\n​\n 2,318,337\n​\n​\n 2,381,666\n​\n​\n (63,329)\n​\n (2.7)\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nStabilized\n​\n \n 159,339\n​\n \n 138,141\n​\n​\n 21,198\n​\n 15.3\n%\nNon-Stabilized\n​\n \n 41,439\n​\n \n 78,264\n​\n​\n (36,825)\n​\n (47.1)\n%\nTotal Property taxes and insurance\n​\n \n 200,778\n​\n \n 216,405\n​\n​\n (15,627)\n​\n (7.2)\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal property level operating expenses\n​\n$\n 2,519,115\n​\n$\n 2,598,071\n​\n$\n (78,956)\n​\n (3.0)\n%\n​\nProperty level operating expenses include costs to operate and maintain the properties in our portfolio as well as taxes and insurance. \n​\nTotal Utilities\nTotal stabilized utilities expenses decreased by approximately $183.3 million compared to the same period in 2023 primarily due to lower power pricing at certain properties in the stabilized portfolio, mainly in EMEA and APAC.\nTotal non-stabilized utilities expenses increased by approximately $44.9 million compared to the same period in 2023 primarily due to:\n(i)\nan increase of approximately $75.9 million due to higher utility consumption in a growing portfolio of recently completed development sites (with the biggest contributions in Northern Virginia, Portland, Zurich, Cape Town and Johannesburg); the markets with the biggest contributions were Northern Virginia, Portland, Frankfurt, London and Paris); \n(ii)\na decrease in power agreement credits by $28.7 million; and\n(iii)\noffset by a decrease of $59.7 million related to properties sold or contributed in 2023 and 2024.\n​\nThe cost of electric power comprises a significant component of our operating expenses. Any additional taxation or regulation of energy use, including as a result of (i) new legislation that the U.S. Congress may pass, (ii) the regulations that the U.S. EPA has proposed or finalized, (iii) regulations under legislation that states have passed or may pass, or (iv) any further legislation or regulations in EMEA, APAC or other regions where we operate could significantly increase our costs, and we may not be able to effectively pass all of these costs on to our customers. These matters could adversely impact our business, results of operations, or financial condition.\nTotal Rental Property Operating and Maintenance (Excluding Utilities)\nTotal stabilized rental property operating and maintenance expenses (excluding utilities) increased by approximately $50.9 million compared to the same period in 2023 primarily due to an increase in data center labor and common area maintenance expense. \n64\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nTotal non-stabilized rental property operating and maintenance expenses (excluding utilities) increased by approximately $24.2 million compared to the same period in 2023 primarily due to higher lease and common area maintenance expense in a growing portfolio of recently completed development sites.\nTotal Property Taxes and Insurance\nTotal stabilized property taxes and insurance increased by approximately $21.2 million compared to the same period in 2023 due to a favorable property tax assessment at one of our North American properties realized in early 2023.\nTotal non-stabilized property taxes and insurance decreased $36.8 million compared to the same period in 2023 primarily related to properties sold or contributed after December 31, 2023.\nProvision for Impairment\nDuring the year ended December 31, 2024, we recognized impairment charges of approximately $191.2 million, which is recorded as provision for impairment on the consolidated income statement. We determined that certain non-core properties in secondary U.S. markets had carrying amounts that may not be fully recoverable as we determined that we no longer intend to hold these properties long-term. Accordingly, the recorded amounts were reduced to reflect management’s estimate of fair value principally based on sales of similar properties and ongoing negotiations with third parties.\nDuring the year ended December 31, 2023, we recognized impairment charges of approximately $118.4 million, primarily due to the decline in fair value of our equity investment in DCRU, which was considered other than temporary due to the length of time and extent to which the fair value of our investment has been less than the carrying value.\nOther Operating Expenses\nOther operating expenses include costs which are either non-cash in nature (such as depreciation and amortization) or which do not directly pertain to operation of data center properties. A comparison of other operating expenses for the respective period is shown below (in thousands). \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n​\n$ Change\n​\n% Change\nDepreciation and amortization\n \n$\n 1,771,797\n​\n$\n 1,694,859\n​\n$\n 76,938\n​\n 4.5\n%\nGeneral and administrative\n​\n​\n 480,023\n​\n​\n 449,056\n​\n​\n 30,967\n​\n 6.9\n%\nTransaction, integration and other expense\n​\n \n 93,902\n​\n​\n 84,722\n​\n​\n 9,180\n​\n 10.8\n%\nProvision for impairment\n​\n​\n 191,184\n​\n​\n 118,363\n​\n​\n 72,821\n​\n 61.5\n%\nOther\n​\n \n 27,083\n​\n \n 7,529\n​\n \n 19,554\n​\nn/m\n%\nTotal other operating expenses\n​\n​\n 2,563,989\n​\n​\n 2,354,529\n​\n​\n 209,460\n​\n 8.9\n%\nTotal property level operating expenses\n​\n​\n 2,519,115\n​\n​\n 2,598,071\n​\n​\n (78,956)\n​\n (3.0)\n%\nTotal operating expenses\n​\n$\n 5,083,104\n​\n$\n 4,952,600\n​\n$\n 130,504\n​\n 2.6\n%\nn/m – not meaningful\n​\nEquity in Earnings (Loss) of Unconsolidated Entities\nEquity in earnings (loss) of unconsolidated entities decreased approximately $90.3 million compared to the same period in 2023. The foreign exchange remeasurement of debt associated with our unconsolidated Ascenty entity creates volatility in our equity in earnings and drove this fluctuation.\n65\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nGain on Disposition of Properties, net\nGain on disposition of properties, net decreased approximately $304.7 million as compared to the same period in 2023.\n​\nIn January 2024, we closed on the sale of our interest in four data centers to Brookfield Infrastructure Partners L.P., or Brookfield, for approximately $271 million. As a result of the sale, we recognized a total gain on disposition of approximately $191.6 million.\nIn March 2024, we formed a joint venture with Mitsubishi Corporation, or Mitsubishi, to support the development of two data centers in the Dallas metro area. We received approximately $153 million of gross proceeds from the contribution of our data centers to the joint venture. As a result of transferring control, we derecognized the data centers and recognized a gain on disposition of approximately $7.0 million. \nIn March 2024, we also recognized a total gain of $74.4 million from the sale of an easement to a local power provider in Northern Virginia.\nIn April 2024, we expanded our existing joint venture with GI Partners with the sale to GI Partners of a 75% interest in a third facility on the same hyperscale data center campus in Chicago. We contributed the data center at a value of approximately $453 million. We received approximately $386 million of net proceeds from the contribution of our data center to the joint venture and the associated financing and retained a 25% interest in the joint venture. As a result of transferring control, we derecognized the data center and recognized a gain on disposition of approximately $172 million.\nIn December 2024, the second phase of the Blackstone Inc. joint venture closed on hyperscale data center campuses in Frankfurt and Northern Virginia. We received approximately $385 million of net proceeds from the contribution of our data centers to the second phase of the joint venture and retained a 20% interest in the joint venture. As a result of transferring control, we derecognized the data centers and recognized a gain on disposition of approximately $44.5 million. \nIn December 2024, we also closed on the sale to DCREIT of an additional 15.1% interest in a data center located in Frankfurt, Germany for approximately $77 million. As a result of transferring control, we derecognized the Frankfurt facility and recognized a gain on disposition of approximately $101 million.\nIn May 2023, we disposed of a non-core asset, resulting in a net gain on sale of $87 million. In July 2023, we received approximately $0.7 billion of gross proceeds from the contribution of our data centers to the joint venture with GI Partners for a net gain on sale of approximately $238 million and we received approximately $1.4 billion of gross proceeds from the contribution of our data centers to the joint venture with TPG Real Estate for a net gain on sale of approximately $576 million. \n​\nLoss from Early Extinguishment of Debt\nLoss on debt extinguishment and modifications was approximately $5.9 million for the year ended December 31, \n2024. In January 2024, we paid down $240 million on the U.S. term loan facility. The paydown resulted in an early extinguishment charge of approximately $1.0 million. In September 2024, we paid down €375 million on the Euro Term Loan Facilities, leaving €375 million outstanding. The paydown resulted in an early extinguishment charge of approximately $1.6 million. We also refinanced our Global Revolving Credit Facilities and wrote off deferred loan costs of approximately $1.1 million. In November 2024, we paid off the remaining $500 million on the U.S. term loan facility.  As a result, approximately $2.2 million of deferred financing costs was written off.\nWe had no extinguishment of debt in 2023. \n​\n​\n66\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nInterest Expense\n​\nInterest expense increased approximately $15.1 million compared to the same period in 2023 driven primarily by increased borrowings at Teraco.\n​\nIncome Tax Expense\n​\nIncome tax expense decreased by approximately $20.8 million as compared to the same period in 2023 due to jurisdictional rate mix in foreign jurisdictions and internal restructurings within the global group.\nLiquidity and Capital Resources\nThe sections “Analysis of Liquidity and Capital Resources — Parent” and “Analysis of Liquidity and Capital Resources — Operating Partnership” should be read in conjunction with one another to understand our liquidity and capital resources on a consolidated basis. The term “Parent” refers to Digital Realty Trust, Inc. on an unconsolidated basis, excluding our Operating Partnership. The term “Operating Partnership” or “OP” refers to Digital Realty Trust, L.P. on a consolidated basis.\nAnalysis of Liquidity and Capital Resources — Parent\nOur Parent does not conduct business itself, other than acting as the sole general partner of the Operating Partnership, issuing public equity from time to time, incurring certain expenses in operating as a public company (which are fully reimbursed by the Operating Partnership) and guaranteeing certain unsecured debt of the Operating Partnership and certain of its subsidiaries and affiliates. If our Operating Partnership or such subsidiaries fail to fulfill their debt requirements, which trigger Parent guarantee obligations, then our Parent will be required to fulfill its cash payment commitments under such guarantees. Our Parent’s only material asset is its investment in our Operating Partnership.\nOur Parent’s principal funding requirement is the payment of dividends on its common and preferred stock. Our Parent’s principal source of funding is the distributions it receives from our Operating Partnership.\nAs the sole general partner of our Operating Partnership, our Parent has the full, exclusive and complete responsibility for our Operating Partnership’s day-to-day management and control. Our Parent causes our Operating Partnership to distribute such portion of its available cash as our Parent may in its discretion determine, in the manner provided in our Operating Partnership’s partnership agreement. \nAs circumstances warrant, our Parent may issue equity from time to time on an opportunistic basis, dependent upon market conditions and available pricing. Any proceeds from such equity issuances would generally be contributed to our Operating Partnership in exchange for additional equity interests in our Operating Partnership. Our Operating Partnership may use the proceeds to acquire additional properties, to fund development opportunities and for general working capital purposes, including potentially for the repurchase, redemption or retirement of outstanding debt or equity securities.\nDigital Realty Trust, Inc. and Digital Realty Trust, L.P. were parties to an ATM Equity Offering\nSM\n Sales Agreement dated August 4, 2023 (the “2023 Sales Agreement”). Pursuant to the 2023 Sales Agreement, Digital Realty Trust, Inc. could issue and sell common stock having an aggregate offering price of up to $1.5 billion through various named agents from time to time. From January 1, 2024 through February 23, 2024, Digital Realty Trust, Inc. generated net proceeds of approximately $99 million from the issuance of approximately 0.6 million common shares under the 2023 Sales Agreement at an average price of $133.43 per share after payment of approximately $0.6 million of commissions to the agents. The proceeds from the issuances under the 2023 Sales Agreement for the year ended December 31, 2024, were contributed to our Operating Partnership in exchange for the issuance of approximately 0.6 million common units to our Parent Company.\n67\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nThe 2023 Sales Agreement was amended on February 23, 2024 (the “Sales Agreement Amendment”). At the time of the amendment, $258.3 million remained unsold under the 2023 Sales Agreement. Following the Sales Agreement Amendment, Digital Realty Trust, Inc. could issue and sell common stock having an aggregate offering price of up to $2.0 billion through various named agents from time to time pursuant to the 2023 Sales Agreement. During the year ended December 31, 2024, Digital Realty Trust, Inc. generated net proceeds of approximately $1.9 billion from the issuance of approximately 11.4 million common shares under the 2023 Sales Agreement at an average price, net of commissions, of $166.85 per share. Commissions to the agents amounted to approximately $17.4 million. The proceeds from the issuances under the 2023 Sales Agreement for the year ended December 31, 2024, were contributed to our Operating Partnership in exchange for the issuance of approximately 11.4 million common units to our Parent Company.\nOn December 23, 2024, our Parent and our Operating Partnership entered into a new an ATM Equity Offering\nSM\n Sales Agreement (the “2024 Sales Agreement”), pursuant to which, Digital Realty Trust, Inc. can issue and sell common stock having an aggregate offering price of up to $3.0 billion through various named agents from time to time. The 2023 Sales Agreement was terminated in connection with entry into the 2024 Sales Agreement, and at the time of such termination, $76.5 million remained unsold under the 2024 Sales Agreement. As of December 31, 2024, $3.0 billion remains available for future sales under the 2024 Sales Agreement. \nThe sales of common stock made under the 2024 Sales Agreement will be made in “at the market” offerings as defined in Rule 415 of the Securities Act. Our Parent has used and intends to use the net proceeds from the program to temporarily repay borrowings under our Operating Partnership’s Global Revolving Credit Facilities, to acquire additional properties or businesses, to fund development opportunities and for working capital and other general corporate purposes, including potentially for the repayment of other debt or the repurchase, redemption or retirement of outstanding debt securities.\nFor the year ended December 31, 2023, Digital Realty Trust, Inc. generated net proceeds of approximately $1.1 billion from the issuance of approximately 8.7 million common shares under the 2023 Sales Agreement at an average price of $133.21 per share after payment of approximately $11.4 million of commissions to the agents. As of December 31, 2023, approximately $343.4 million remained available for future sales under the 2023 Sales Agreement. The proceeds from the issuances under the 2023 Sales Agreement for the year ended December 31, 2023 were contributed to our Operating Partnership in exchange for the issuance of approximately 8.7 million common units to our Parent Company.\nOn May 7, 2024, our Parent and our Operating Partnership entered into an underwriting agreement with BofA Securities, Inc., Citigroup Global Markets Inc. and J.P. Morgan Securities LLC, as representatives of the several underwriters relating to the sale of up to approximately 12.1 million shares of common stock (including approximately 1.6 million additional shares that the underwriters had the option to purchase, and which option was exercised in full on May 8, 2024), at a purchase price to the underwriters of $136.66 per share. The offering closed on May 10, 2024, and we received net proceeds of approximately $1.7 billion.\n​\nWe believe our Operating Partnership’s sources of working capital, specifically its cash flow from operations, and funds available under its Global Revolving Credit Facility are adequate for it to make its distribution payments to our Parent and, in turn, for our Parent to make its dividend payments to its stockholders. However, we cannot assure you that our Operating Partnership’s sources of capital will continue to be available at all or in amounts sufficient to meet its needs, including making distribution payments to our Parent. The lack of availability of capital could adversely affect our Operating Partnership’s ability to pay its distributions to our Parent, which would in turn, adversely affect our Parent’s ability to pay cash dividends to its stockholders.\nFuture Uses of Cash — Parent\nOur Parent may from time to time seek to retire, redeem or repurchase its equity or the debt securities of our Operating Partnership or its subsidiaries through cash purchases and/or exchanges for equity securities in open market purchases, privately negotiated transactions or otherwise. Such repurchases, redemptions or exchanges, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions or other factors. The amounts involved may be material.\n68\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nDividends and Distributions — Parent\nOur Parent is required to distribute 90% of its taxable income (excluding capital gains) on an annual basis to continue to qualify as a REIT for U.S. federal income tax purposes. Our Parent intends to make, but is not contractually bound to make, regular quarterly distributions to its common stockholders from cash flow from our Operating Partnership’s operating activities. While historically our Parent has satisfied this distribution requirement by making cash distributions to its stockholders, it may choose to satisfy this requirement by making distributions of cash or other property. All such distributions are at the discretion of our Parent’s Board of Directors. Our Parent considers market factors and our Operating Partnership’s performance in addition to REIT requirements in determining distribution levels. Our Parent has distributed at least 100% of its taxable income annually since inception to minimize corporate level federal and state income taxes. Amounts accumulated for distribution to stockholders are invested primarily in interest-bearing accounts and short-term interest-bearing securities, which are consistent with our intention to maintain our Parent’s status as a REIT.\nAs a result of this distribution requirement, our Operating Partnership cannot rely on retained earnings to fund its ongoing operations to the same extent that other companies whose parent companies are not REITs can. Our Parent may need to continue to raise capital in the debt and equity markets to fund our Operating Partnership’s working capital needs, as well as potential developments at new or existing properties, acquisitions or investments in existing or newly created joint ventures. In addition, our Parent may be required to use borrowings under the Operating Partnership’s Global Revolving Credit Facility (which is guaranteed by our Parent), if necessary, to meet REIT distribution requirements and maintain our Parent’s REIT status.\nDistributions out of our Parent’s current or accumulated earnings and profits are generally classified as ordinary income whereas distributions in excess of our Parent’s current and accumulated earnings and profits, to the extent of a stockholder’s U.S. federal income tax basis in our Parent’s stock, are generally classified as a return of capital. Distributions in excess of a stockholder’s U.S. federal income tax basis in our Parent’s stock are generally characterized as capital gain. Cash provided by operating activities has been generally sufficient to fund distributions on an annual basis. However, we may also need to utilize borrowings under the Global Revolving Credit Facility to fund distributions.\nThe expected tax treatment of distributions on our Parent’s common stock and preferred stock paid in 2024 is as follows: approximately 77% ordinary income and 23% as capital gain distribution. The tax treatment of distributions on our Parent’s common stock and preferred stock paid in 2023 was as follows: approximately 40% ordinary income and 60% as capital gain distribution. The tax treatment of distributions on our Parent’s common stock paid in 2022 was as follows: approximately 59% ordinary income, 16% as capital gain distribution, and 25% as nondividend distribution. \nFor additional information regarding dividends declared and paid by our Parent on its common and preferred stock for the years ended December 31, 2024, 2023 and 2022, see Item 8, Note 14. “Equity and Capital” in the Notes to the Consolidated Financial Statements contained herein.\n69\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nAnalysis of Liquidity and Capital Resources — Operating Partnership\nAs of December 31, 2024, we had $3,870.9 million of cash and cash equivalents, excluding $5.8 million of restricted cash. Restricted cash primarily consists of contractual capital expenditures plus other deposits and is included in Other assets on our Consolidated Balance Sheets. As circumstances warrant, our Operating Partnership may dispose of stabilized assets or enter into joint venture arrangements with institutional investors or strategic partners, on an opportunistic basis dependent upon market conditions. Our Operating Partnership may use the proceeds from such dispositions to acquire additional properties, to fund development opportunities and for general working capital purposes, including the repayment of indebtedness. Our liquidity requirements primarily consist of:\n●\noperating expenses;\n●\ndevelopment costs and other expenditures associated with our properties, including joint ventures;\n●\ndistributions to our Parent to enable it to make dividend payments;\n●\ndistributions to unitholders of common limited partnership interests in Digital Realty Trust, L.P.,\n●\ndebt service; and,\n●\npotentially, acquisitions.\n​\nOn September 24, 2024, we refinanced our Global Revolving Credit Facility and Yen Revolving Credit Facility. The Global Revolving Credit Facilities provide for borrowings up to $4.4 billion (including approximately $0.3 billion available to be drawn on the Yen Revolving Credit Facility) based on currency commitments and foreign exchange rates as of December 31, 2024. The Global Revolving Credit Facility provides for borrowings in a variety of currencies and can be increased by an additional $1.8 billion, subject to receipt of lender commitments and other conditions precedent. Both facilities mature on January 24, 2029, with two six-month extension options available. \nThese facilities also feature a sustainability-linked pricing component, with pricing subject to adjustment based on annual performance targets, further demonstrating our continued leadership and commitment to sustainable business practices.\nThe Global Revolving Credit Facility provides for borrowings in a variety of currencies and includes the ability to add additional currencies in the future. We have used and intend to use available borrowings under the Global Revolving Credit Facilities to acquire additional properties, fund development opportunities and for general working capital and other corporate purposes, including potentially for the repurchase, redemption or retirement of outstanding debt or equity securities. For additional information regarding our Global Revolving Credit Facilities, see Item 8, Note 11. “Debt of the Operating Partnership” in the Notes to the Consolidated Financial Statements.\nFuture Uses of Cash\nOur properties require periodic investments of capital for customer-related capital expenditures and for general capital improvements. Depending upon customer demand, we expect to incur significant improvement costs to build out and develop additional capacity. At December 31, 2024, we had open commitments, related to construction contracts of approximately $2.0 billion, including amounts reimbursable of approximately $102.5 million.\nDuring the year ending December 31, 2025, we expect to incur approximately $3.0 billion to $3.5 billion of capital expenditures, which includes our share of joint venture contributions and is net of partner contributions for our development programs. This amount could go up or down, potentially materially, based on numerous factors, including changes in demand, leasing results and availability of debt or equity capital.\n70\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nDevelopment Projects\nThe costs we incur to develop our properties is a key component of our liquidity requirements. The following table summarizes our cumulative investments in current development projects as well as expected future investments in these projects as of the periods presented, excluding square feet held in and costs incurred or to be incurred by unconsolidated entities.\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nConstruction Projects in Progress\n​\nAs of December 31, 2024\n​\nAs of December 31, 2023\n​\n​\nCurrent \n​\nFuture \n​\n​\n​\nCurrent \n​\nFuture \n​\n​\n​\n(in thousands)\n    \nInvestment \n(1)\n    \nInvestment \n(2)\n    \nTotal Cost\n    \nInvestment \n(3)\n    \nInvestment\n (2)\n    \nTotal Cost\nFuture Development Capacity\n (4)\n \n$\n 2,129,342\n​\n$\n 1,550,645\n \n$\n 3,679,987\n \n$\n 2,222,062\n​\n$\n 337,681\n​\n$\n 2,559,743\nData Center Construction\n \n​\n 2,610,305\n​\n \n 2,857,313\n \n​\n 5,467,618\n \n \n 2,116,335\n​\n \n 2,231,747\n​\n \n 4,348,082\nEquipment Pool and Other Inventory \n(5)\n \n​\n 192,429\n​\n \n —\n \n​\n 192,429\n \n \n 203,821\n​\n \n —\n​\n \n 203,821\nCampus, Tenant Improvements and Other \n(6)\n \n​\n 271,042\n​\n \n 157,976\n \n​\n 429,018\n \n \n 211,187\n​\n \n 130,260\n​\n \n 341,447\nConsolidated Land Held and Development Construction in Progress\n \n$\n 5,203,119\n​\n$\n 4,565,934\n​\n$\n 9,769,053\n \n$\n 4,753,405\n​\n$\n 2,699,688\n​\n$\n 7,453,093\n(1)\nRepresents costs incurred through December 31, 2024.\n(2)\nRepresents estimated cost to complete scope of work pursuant to approved development budget.\n(3)\nRepresents costs incurred through December 31, 2023.\n(4)\nIncludes land and space held or actively under construction in preparation for future data center fit-out.\n(5)\nRepresents long-lead equipment and materials required for timely deployment and delivery of data center fit-out.\n(6)\nRepresents improvements in progress, which benefit space recently converted to our operating portfolio and is composed primarily of shared infrastructure projects and first-generation tenant improvements. Includes approximately $2.8 million included in our condensed consolidated balance sheet related to fair value adjustments on Teraco portfolio projects that were partially constructed as of August 1, 2022.\n​\nFuture development reflects cumulative cost spent pending future development and includes ongoing improvements to building infrastructure in preparation for future data center fit-out. We expect to deliver the space within 12 months; however, lease commencement dates may significantly impact final delivery schedules.\nCapital Expenditures (Cash Basis)\nThe table below summarizes our capital expenditure activity for the year ended December 31, 2024 and 2023 (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\nDevelopment projects\n​\n$\n 2,260,692\n​\n$\n 2,966,898\nEnhancement and improvements\n​\n \n 35,243\n​\n \n 15,705\nRecurring capital expenditures\n​\n \n 305,712\n​\n \n 327,022\nTotal capital expenditures (excluding indirect costs)\n​\n$\n 2,601,647\n​\n$\n 3,309,625\n​\nFor the year ended December 31, 2024, total capital expenditures decreased approximately $0.7 billion as compared to the same period in 2023. Capital expenditures on our development projects plus our enhancement and improvements projects for the year ended December 31, 2024 were approximately $2.3 billion, which reflects a decrease of approximately 23% from the same period in 2023. Our development capital expenditures are generally funded by our available cash and equity and debt capital.\n​\nIndirect costs, including interest, capitalized in the years ended December 31, 2024 and 2023 were $230.1 million and $216.0 million, respectively. Capitalized interest comprised approximately $118.9 million and $116.8 million of the total indirect costs capitalized for the years ended December 31, 2024 and 2023, respectively. Capitalized interest in the year ended December 31, 2024 increased compared to the same period in 2023 due to an increase in qualifying activities and higher interest rates.\n71\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nExcluding capitalized interest, indirect costs in the year ended December 31, 2024 increased compared to the same period in 2023 due primarily to capitalized amounts relating to compensation expense of employees directly engaged in construction activities. \nConsistent with our growth strategy, we actively pursue potential acquisition opportunities, with due diligence and negotiations often at different stages at different times. The dollar value of acquisitions for the year ending December 31, 2025 will depend upon numerous factors, including customer demand, leasing results, availability of debt or equity capital and acquisition opportunities. Further, the growing acceptance by private institutional investors of the data center asset class has generally pushed capitalization rates lower, as such private investors may often have lower return expectations than us. As a result, we anticipate near-term single asset acquisitions activity to comprise a smaller percentage of our growth while this market dynamic persists.\nWe may from time to time seek to retire or repurchase our outstanding debt or the equity of our Parent through cash purchases and/or exchanges for equity securities of our Parent in open market purchases, privately negotiated transactions or otherwise. Such repurchases or exchanges, if any, will depend upon prevailing market conditions, our liquidity requirements, contractual restrictions or other factors. The amounts involved may be material.\nSources of Cash\nWe expect to meet our short-term and long-term liquidity requirements, including payment of scheduled debt maturities and funding of acquisitions and non-recurring capital improvements, with net cash from operations, future long-term secured and unsecured indebtedness and the issuance of equity and debt securities and the proceeds of equity issuances by our Parent. We also may fund future short-term and long-term liquidity requirements, including acquisitions and non-recurring capital improvements, using our Global Revolving Credit Facilities pending permanent financing. As of February 18, 2025, we had approximately $3.4 billion of borrowings available under our Global Revolving Credit Facilities. \nOur Global Revolving Credit Facilities provides for borrowings up to $4.4 billion (including approximately $0.3 billion available to be drawn on the Yen Revolving Credit Facility). We have the ability from time to time to increase the size of the Global Revolving Credit Facility by up to $1.8 billion, subject to the receipt of lender commitments and other conditions precedent. Both facilities mature on January 24, 2029, with two six-month extension options available. These facilities also feature a sustainability-linked pricing component, with pricing subject to adjustment based on annual performance targets, further demonstrating our continued leadership and commitment to sustainable business practices. We have used and intend to use available borrowings under the Global Revolving Credit Facilities to fund our liquidity requirements from time to time. For additional information regarding our Global Revolving Credit Facility, see Note 11. “Debt of the Operating Partnership” to Consolidated Financial Statements contained herein.\nIn addition, the 2025-27 Term Facility provides for a €375,000,000 five-year senior unsecured term loan facility,  comprised of €125,000,000 of initial term loans, and €250,000,000 of delayed draw term loan commitments that were funded on September 9, 2023. Such facility provides for borrowings in Euros. The 2025-27 Term Facility matures on August 11, 2025, subject to two maturity extension options of one year each; provided that the Operating Partnership must pay a 0.125% extension fee based on the then-outstanding principal amount of the 2025-27 Term Facility commitments then outstanding. For additional information regarding the 2025-27 Term Facility and the defined terms used above, see Note 11. “Debt of the Operating Partnership” to Consolidated Financial Statements contained herein.\n​\nOn September 13, 2024, Digital Dutch Finco B.V., an indirect wholly owned finance subsidiary of the Operating Partnership, issued and sold €850 million aggregate principal amount of 3.875% Guaranteed Notes due 2033. Net proceeds from the offering were approximately €843 million (approximately $933 million based on the exchange rate on September 13, 2024) after deducting managers’ discounts and estimated offering expenses. We used the net proceeds from the offering to pay down a portion of our Euro Term Loan Facilities, temporarily repay borrowings under our Global Revolving Credit Facility and for general corporate purposes.\n72\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nOn July 13, 2023, we formed a joint venture with GI Partners, and GI Partners acquired a 65% interest in two stabilized hyperscale data center buildings in the Chicago metro area that we contributed. We retained a 35% interest in the joint venture. As a result of transferring control, we derecognized the data centers. In addition, GI Partners had a call option to increase their ownership interest in the joint venture from 65% to 80%. The call option top-up election notice was delivered to the Company on December 21, 2023. On January 12, 2024, GI Partners made an additional cash capital contribution, pursuant to the exercise of such call option, in the amount of $68 million, resulting in such additional 15% ownership in the joint venture. Currently, GI Partners has an 80% interest in the joint venture, and we have retained a 20% interest.\nWe also granted GI Partners an option to purchase an interest in the third facility on the same hyperscale data center campus in Chicago. On April 16, 2024, we expanded our existing joint venture with GI Partners with the sale to GI Partners of a 75% interest in a third facility. We received approximately $386 million of net proceeds from the contribution of our data center to the joint venture and the associated financing and retained a 25% interest in the joint venture.\nOn January 11, 2024, we formed a joint venture with Blackstone Inc. to develop four hyperscale data center campuses across Frankfurt, Paris and Northern Virginia. The campuses are planned to support the construction of 10 data centers with approximately 500 megawatts of potential IT load capacity. The first phase of the joint venture closed on hyperscale data center campuses in Paris and Northern Virginia, while the second phase closed in the fourth quarter of 2024. We received approximately $231 million of net proceeds from the contribution of our data centers to the first phase of the joint venture and retained a 20% interest in the joint venture. Each partner funded its pro rata share of the remaining $3.0 billion estimated development cost for the first phase of the joint venture, which is slated for completion in various stages, contingent on customer demand, which began in the first quarter of 2024. In the fourth quarter, the second phase of the joint venture closed on hyperscale data center campuses in Frankfurt and Northern Virginia. We received approximately $385 million of net proceeds from the contribution of our data centers to the second phase of the joint venture and retained a 20% interest in the joint venture. As a result of transferring control, we derecognized the data centers and recognized a gain on disposition of approximately $44.5 million.\nIn January 2024, we closed on the sale of our interest in four data centers to Brookfield Infrastructure Partners L.P., or Brookfield, for approximately $271 million.  Two of the data centers were consolidated by us; while two of the data centers were owned by Digital Core REIT. The sale was completed subsequent to Brookfield’s November 2023 acquisition of one of our customers, Cyxtera Technologies.  The acquisition was part of Cyxtera’s plan of reorganization under its Chapter 11 bankruptcy proceedings. In conjunction with the sale, we bought out Cyxtera’s leases in three data centers located in Singapore and Frankfurt for approximately $57 million.  In addition, Brookfield assumed the leases on three facilities previously leased to Cyxtera and amended the leases on three additional data centers in North America, accelerating the expiration date to September 2024.  As a result of the sale, we recognized a total gain on disposition of approximately $200.5 million, of which $191.6 million is included within Gain on disposition of properties, net and $8.9 million is included within Equity in (loss) earnings of unconsolidated entities on our condensed consolidated income statements.\nOn March 1, 2024, we formed a joint venture with Mitsubishi Corporation, or Mitsubishi, to support the development of two data centers in the Dallas metro area. The facilities were 100% pre-leased prior to construction. We contributed the two data center buildings at a contribution value of approximately $261 million. We received approximately $153 million of gross proceeds from the contribution of our data centers to the joint venture and retained a 35% interest in the joint venture. Mitsubishi contributed such cash in exchange for a 65% interest in the joint venture. Each partner funded its pro rata share of the remaining $140 million estimated development cost for the first phase of the project, of which one project has been completed in June 2024 and another has been completed in October 2024.\n​\nDistributions\nAll distributions on our units are at the discretion of our Parent’s Board of Directors. For additional information regarding distributions paid on our common and preferred units for the years ended December 31, 2024 and 2023, see Item 8, Note 14. “Equity and Capital” in the Notes to the Consolidated Financial Statements.\n73\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\n​\nOutstanding Consolidated Indebtedness\nThe tables below summarize our outstanding debt, and also our contractual debt maturities and principal payments as of December 31, 2024 (in thousands):\n​\nOutstanding Debt\n​\n​\n​\n​\n​\n​\nDebt Summary:\n    \n​\n    \n​\nFixed rate\n​\n$\n 12,160\n​\nVariable rate debt subject to interest rate swaps\n​\n \n 3,103\n​\nTotal fixed rate debt (including interest rate swaps)\n​\n \n 15,263\n​\nVariable rate—unhedged\n​\n \n 1,584\n​\nTotal\n​\n$\n 16,847\n​\nPercent of Total Debt:\n​\n \n  \n​\nFixed rate (including swapped debt)\n​\n \n 90.6\n%\nVariable rate\n​\n \n 9.4\n%\nTotal\n​\n \n 100.0\n%\n​\n​\n​\n​\n​\nEffective Interest Rate as of December 31, 2024 \n​\n \n  \n​\nFixed rate (including hedged variable rate debt)\n​\n \n 2.58\n%\nVariable rate\n​\n \n 4.07\n%\nEffective interest rate\n​\n \n 2.72\n%\n​\nContractual Debt Maturities and Principal Payments\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nGlobal Revolving \n​\nUnsecured\n​\nUnsecured\n​\nSecured and \n​\n​\n​\n​\n    \nCredit Facilities \n(1)(2)\n    \n Term Loans\n(3)\n    \nSenior Notes\n(4)\n    \nOther Debt\n    \nTotal Debt\n2025\n​\n$\n —\n​\n$\n 388,275\n​\n$\n 1,173,650\n​\n$\n 782\n​\n$\n 1,562,707\n2026\n​\n​\n —\n​\n​\n —\n​\n​\n 1,416,042\n​\n​\n 114,505\n​\n​\n 1,530,547\n2027\n​\n​\n —\n​\n​\n —\n​\n​\n 1,165,265\n​\n​\n 234,023\n​\n​\n 1,399,288\n2028\n \n​\n —\n \n​\n —\n \n​\n 2,067,700\n \n​\n 354,999\n \n​\n 2,422,699\n2029\n \n​\n 1,637,922\n \n​\n —\n \n​\n 2,785,538\n \n​\n 13,946\n \n​\n 4,437,406\nThereafter\n \n​\n —\n \n​\n —\n \n​\n 5,451,220\n \n​\n 43,008\n \n​\n 5,494,228\nSubtotal\n​\n$\n 1,637,922\n​\n$\n 388,275\n​\n$\n 14,059,415\n​\n$\n 761,263\n​\n$\n 16,846,875\nUnamortized net discounts\n​\n \n —\n​\n \n —\n​\n \n (27,476)\n​\n \n (3,658)\n​\n \n (31,134)\nUnamortized deferred financing costs\n​\n​\n (26,614)\n​\n​\n (1,372)\n​\n​\n (69,087)\n​\n​\n (4,291)\n​\n​\n (101,364)\nTotal\n​\n$\n 1,611,308\n​\n$\n 386,903\n​\n$\n 13,962,852\n​\n$\n 753,314\n​\n$\n 16,714,377\n(1)\nIncludes amounts outstanding under the Global Revolving Credit Facilities.\n(2)\nThe Global Revolving Credit Facilities are subject to two six-month extension options exercisable by us; provided that the Operating Partnership must pay a 0.0625% extension fee based on each lender’s revolving commitments then outstanding (whether funded or unfunded).\n(3)\nThe €375.0 million 2025-27 Term Facility is subject to two maturity extension options of one year each, provided that the Operating Partnership must pay a 0.125% extension fee based on the then-outstanding principal amount of such facility commitments then outstanding.\n(4)\nThe £400 million 4.250% unsecured senior note was paid at maturity on January 17, 2025.\n​\n74\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nOur ratio of debt to total enterprise value was approximately 21.4% (based on the closing price of Digital Realty Trust, Inc.’s common stock on December 31, 2024 of $177.33). For this purpose, our total enterprise value is defined as the sum of the market value of Digital Realty Trust, Inc.’s outstanding common stock (which may decrease, thereby increasing our debt to total enterprise value ratio), plus the liquidation value of Digital Realty Trust, Inc.’s preferred stock, plus the aggregate value of our Operating Partnership’s units not held by Digital Realty Trust, Inc. (with the per unit value equal to the market value of one share of Digital Realty Trust, Inc.’s common stock and excluding long-term incentive units, Class C units and Class D units), plus the book value of our total consolidated indebtedness.\nThe variable rate debt shown above bears interest based on various one-month SOFR, EURIBOR, HIBOR, TIBOR, Base CD Rate, CDOR and JIBAR rates, depending on the respective agreement governing the debt, including our Global Revolving Credit Facilities, unsecured term loans, Teraco loans and ICN10 Facilities. As of December 31, 2023, our debt had a weighted average term to initial maturity of approximately 4.2 years (or approximately 4.4 years assuming exercise of extension options).\nOff-Balance Sheet Arrangements\nAs of December 31, 2024, our pro-rata share of secured debt of unconsolidated entities was approximately $1.4 billion.\nCash Flows\nThe following summary discussion of our cash flows is based on the consolidated statements of cash flows and is not meant to be an all-inclusive discussion of the changes in our cash flows for the periods presented below.\nComparison of Year Ended December 31, 2024 to Year Ended December 31, 2023\nThe following table shows cash flows and ending cash, cash equivalents and restricted cash balances for the respective periods (in thousands).\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n2024\n    \n2023\n    \nChange\nNet cash provided by operating activities\n$\n 2,261,477\n​\n$\n 1,634,780\n​\n$\n 626,697\nNet cash used in investing activities\n \n (1,906,157)\n​\n \n (1,115,111)\n​\n \n (791,046)\nNet cash provided by financing activities\n \n 2,063,433\n​\n \n 963,474\n​\n \n 1,099,959\nNet increase in cash, cash equivalents and restricted cash\n$\n 2,418,753\n​\n$\n 1,483,143\n​\n$\n 935,610\n​\n​\nCash provided by operating activities in 2024 increased $626.7 million over 2023. The year-over-year increase was driven by:\n(i)\nan increase in revenues due to the completion of our global development pipeline and related lease up operating activities;\n(ii)\nan increase in interest income as a result of carrying higher cash balances;\n(iii)\na decrease in property level operating expenses; \n(iv)\noffset by the net impact of properties sold and contributed in 2023 and 2024.\n​\n75\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\n​\nThe changes in the activities that comprise net cash used in investing activities for the year ended December 31, 2024 as compared to the year ended December 31, 2023 consisted of the following amounts (in thousands).\n​\n​\n​\n​\n​\nChange\n​\n2024 vs 2023\nIncrease in net cash used in business combinations / asset acquisitions\n$\n (455,704)\nDecrease in cash used for improvements to investments in real estate\n​\n 693,858\nDecrease in cash distributed from investments in unconsolidated entities, net\n​\n (121,287)\nDecrease in net cash provided by proceeds from sale of real estate\n​\n (854,943)\nOther changes\n \n (52,970)\nIncrease in net cash used in investing activities\n$\n (791,046)\n​\nThe increase in net cash used in investing activities as compared to the same period in 2023 was primarily due to:\n​\n(i)\nan increase in spend due to acquisitions of land parcels in Paris and Charlotte and two data centers located in the Slough Trading Estate; \n(ii)\na decrease in spend on development projects of approximately $694 million;\n(iii)\nan increase in cash contributed to various investments in unconsolidated entities;\n(iv)\na decrease in cash provided by the sale or contributions of data centers in 2024 compared to 2023 as follows:\na.\n$2.6 billion from 2023 transactions comprised mainly of:\ni.\ncontributions of data centers to our joint ventures with GI Partners and TPG Real Estate for gross proceeds of approximately $0.7 billion and $1.4 billion, respectively;\nii.\nthe sale of three non-core assets for gross proceeds of approximately $341 million; offset by \n●\n$1.8 billion from 2024 transactions consisting of:\ni.\nthe sale to GI Partners of a 75% interest in a third facility in Chicago. We received approximately $386 million of net proceeds and retained a 25% interest in the joint venture;\nii.\ncash provided by the contribution of data centers to our joint ventures with Blackstone and Mitsubishi, for gross proceeds of approximately $707 million and $153 million, respectively; and\niii.\nthe sale of four data centers to Brookfield for gross proceeds of approximately $271 million, the sale of non-core assets for gross proceeds of approximately $91 million, the sale to DCREIT of an additional 15.1% interest in a data center located in Frankfurt, Germany for approximately $77 million and the sale of a land parcel in Sydney for gross proceeds of approximately $68 million.\n​\nThe changes in the activities that comprise net cash provided by financing activities for the year ended December 31, 2024 as compared to the year ended December 31, 2023 consisted of the following amounts (in thousands).\n​\n​\n​\n​\n​\nChange\n​\n2024 vs 2023\nIncrease in cash provided by short-term borrowings\n$\n 344,110\nIncrease in cash provided by proceeds from secured / unsecured debt\n​\n 1,365,867\nIncrease in cash used for repayment on secured / unsecured debt\n​\n (2,007,028)\nIncrease in cash provided by proceeds from issuance of common stock, net of costs\n​\n 1,443,512\nIncrease in cash used for dividend and distribution payments\n \n (112,603)\nOther changes, net\n​\n 66,101\nIncrease in net cash provided by financing activities\n$\n 1,099,959\n​\nThe increase in net cash provided by financing activities as compared to the same period in 2023 was primarily due to:\n​\n(i)\na decrease in cash payments on short-term borrowings;\n(ii)\nan increase in cash provided by proceeds from secured / unsecured debt:\n76\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\na.\n$933 million on the issuance of the 3.875% Guaranteed Notes due 2033 in September 2024;\nb.\n$1.1 billion on the issuance of the 1.875% Exchangeable Notes due 2029 in November 2024;\nc.\noffset by $740 million on the closing of the U.S. term loan facility in January 2023;\n(iii)\nan increase in cash used for repayment on secured / unsecured debt:\na.\n$740 million on the U.S. term loan facility;\nb.\n$637 million on the Euro notes (2.625% notes due 2024);\nc.\n$323 million on the 2.750% notes due 2024;\nd.\n$415 million on the Euro Term Loan Facilities;\n(iv)\nan increase in cash provided by proceeds from the issuance of:\na.\napproximately 12.0 million shares of common stock, net of costs, for approximately $2.0 billion under our ATM program; \nb.\napproximately 12.1 million shares of common stock, net of costs, for approximately $1.7 billion from our equity offering;\nc.\noffset by the issuance of approximately 20.0 million shares of common stock, net of costs, for approximately $2.2 billion under our ATM program in 2023; and\n(v)\nan increase in dividend and distribution payments due to an increased number of common shares and common units outstanding.\n​\nNoncontrolling Interests in Operating Partnership\nNoncontrolling interests relate to the common units in our Operating Partnership that are not owned by Digital Realty Trust, Inc., which, as of December 31, 2024, amounted to 1.8% of our Operating Partnership common units. Historically, our Operating Partnership has issued common units to third party sellers in connection with our acquisition of real estate interests from such third parties.\nLimited partners have the right to require the Operating Partnership to redeem part or all of their common units for cash based on the fair market value of an equivalent number of shares of Digital Realty Trust, Inc. common stock at the time of redemption. Alternatively, Digital Realty Trust, Inc. may elect to acquire those common units in exchange for shares of its common stock on a one-for-one basis, subject to adjustment in the event of stock splits, stock dividends, issuance of stock rights, specified extraordinary distributions and similar events. As of December 31, 2024, approximately 0.2 million common units and incentive units of the Operating Partnership are classified within equity, except for certain common units issued to certain former DuPont Fabros Technology, L.P. unitholders in the Company’s acquisition of DuPont Fabros Technology, Inc., which are subject to certain restrictions and, accordingly, are not presented as permanent equity in the consolidated balance sheet.\nInflation\nMany of our leases provide for separate real estate tax and operating expense escalations. In addition, many of the leases provide for fixed base rent increases. We believe that inflationary increases may be at least partially offset by the contractual rent increases and expense escalations described above. A period of inflation, however, could cause an increase in the cost of our variable-rate borrowings, including borrowings under our Global Revolving Credit Facilities, borrowings under our Euro Term Loan Facilities and USD Term Loan Facility and issuances of unsecured senior notes.\nIn addition, refer to “Item 1A. Risk Factors” in this Annual Report on Form 10-K for a discussion about risks that inflation directly or indirectly may pose to our business.\nCritical Accounting Policies\nA critical accounting policy is one that involves management’s use of judgement regarding expected outcomes of uncertain events in order to make estimates and assumptions that are material to an entity’s financial condition and results of operations. Though we base our estimates and assumptions regarding these matters on historical and current conditions as well as future expectations, these estimates and assumptions are subjective in nature. Changes to the estimates and assumptions we make regarding these matters could affect our financial position and specific items in our \n77\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nresults of operations used by stockholders, potential investors, industry analysts and lenders in the evaluation of our performance. Of the significant accounting policies described in Note 2 to the Consolidated Financial Statements, the subsequent items have been identified by us as meeting the criteria to be considered critical accounting policies. Refer to Note 2 for more information on these critical accounting policies. \nFair Value Measurements. \nFair value is intended to reflect the price that would be received for the sale of an asset or paid for the transfer of a liability in an orderly transaction between market participants at the measurement date (the exit price). We use fair value measurements to enable us to determine the fair value of a variety of items. Fair value measurements are most significant to our financial statements in the following areas: 1) evaluation of recoverability of real estate and intangible assets (which involves comparison of fair value of the assets to net book value to quantify any potential impairments), 2) accounting for assets held for sale (which involves recording assets qualifying for held for sale treatment at the lower of book value or fair value less costs to sell), and 3) determination of fair value of assets and liabilities acquired in connection with business combinations or asset acquisitions as well as certain equity interests in unconsolidated entities.\nWe estimate fair value using available market information and valuation methods we believe to be appropriate for these purposes. Given the significant amount of judgement and subjectivity involved in the determination of fair value, estimated fair value is not necessarily indicative of amounts that would be realized on disposition. Refer to Note 2. “Summary of Significant Accounting Policies” the Consolidated Financial Statements for additional information. \nRecoverability of Real Estate Assets. \nWe assess the carrying value of our properties whenever events or circumstances indicate carrying amounts of these assets may not be fully recoverable (“triggering events\"). Triggering events typically relate to a change in the expected holding period of a property, an adverse change in expected future cash flows of the property, or a trend of past cash flow losses that is expected to continue in the future. If our assessment of triggering events indicates the carrying value of a property or asset group might not be recoverable, we estimate the future undiscounted net cash flows expected to be generated by the assets and compare that amount to the book value of the assets. If our future undiscounted net cash flow evaluation indicates we are unable to recover the carrying value of a property or asset group, we record an impairment loss to the extent the carrying value of the property or asset group exceeds fair value. Refer to Note 2. “Summary of Significant Accounting Policies” of the Consolidated Financial Statements for additional information.\nConsolidation. \nWe consolidate all entities that are wholly owned as well as all partially-owned entities that we control. In addition, we consolidate any variable interest entities (“VIEs”) for which we are the primary beneficiary. We evaluate whether or not an entity is a VIE (and we are the primary beneficiary) through consideration of substantive terms in the arrangement to identify which enterprise has the power to direct the activities of the entity that most significantly impact the entity’s economic performance and the obligation to absorb losses/receive benefits from the entity. \n78\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nFor entities that do not meet the definition of VIEs, we first consider if we are the general partner or a limited partner (or the equivalent in investments not structured as partnerships). We consolidate entities in which we are the general partner and the limited partners do not have rights that would preclude control. For entities in which we are the general partner, but the limited partners hold substantive participating or kick-out rights that prohibit our ability to control the entity, we apply the equity method of accounting since, as the general partner, we have the ability to exercise significant influence over the operating and financial policies of the entities. For entities in which we are a limited partner, or that are not structured similar to a partnership, we consider factors such as ownership interest, voting control, authority to make decisions and contractual and substantive participating rights of the partners. When factors indicate we have a controlling financial interest in an entity, we consolidate the entity. Refer to Note 8. “Investments in Unconsolidated Entities” of the Consolidated Financial Statements for additional information.\nRevenue Recognition. \nWe generate the majority of our revenue by leasing our properties to customers under operating lease agreements, which are accounted for under Accounting Standards Codification 842, Leases (“ASC 842”). We recognize the total minimum lease payments provided for under the leases on a straight-line basis over the lease term if we determine it is probable that substantially all of the lease payments will be collected over the lease term. \nWe estimate the probability of collection of lease payments based on customer creditworthiness, outstanding accounts receivable balances, and historical bad debts – as well as current economic trends. If collection of substantially all lease payments over the lease term is not probable, rental revenue is recognized when payment is received, and we record a reduction to rental revenue equal to the balance of any deferred rent and rent receivable, less the balance of any security deposits or letters of credit. If collection is subsequently determined to be probable, we: 1) resume recognizing rental revenue on a straight-line basis, 2) record incremental revenue such that the cumulative amount recognized is equal to the amount that would have been recorded on a straight-line basis since inception of the lease, and 3) reverse the allowance for bad debt recorded on outstanding receivables.\nNew Accounting Pronouncements\nSee Note 2. “Summary of Significant Accounting Policies” of the Consolidated Financial Statements.\nFunds From Operations\nWe calculate funds from operations, or FFO, in accordance with the standards established by the National Association of Real Estate Investment Trusts (Nareit) in the Nareit Funds From Operations White Paper - 2018 Restatement. FFO is a non-GAAP financial measure and represents net income (loss) (computed in accordance with GAAP), excluding gain (loss) from the disposition of real estate assets, provision for impairment, real estate related depreciation and amortization (excluding amortization of deferred financing costs), our share of unconsolidated JV real estate related depreciation & amortization, net income attributable to noncontrolling interests in operating partnership and, reconciling items related to noncontrolling interests. Management uses FFO as a supplemental performance measure because, in excluding real estate related depreciation and amortization and gains and losses from property dispositions and after adjustments for unconsolidated partnerships and joint ventures, it provides a performance measure that, when compared year over year, captures trends in occupancy rates, rental rates and operating costs. We also believe that, as a widely recognized measure of the performance of REITs, FFO will be used by investors as a basis to compare our operating performance with that of other REITs. However, because FFO excludes depreciation and amortization and captures neither the changes in the value of our data centers that result from use or market conditions, nor the level of capital expenditures and capitalized leasing commissions necessary to maintain the operating performance of our data centers, all of which have real economic effect and could materially impact our financial condition and results from operations, the utility of FFO as a measure of our performance is limited. Other REITs may not calculate FFO in accordance with the Nareit definition and, accordingly, our FFO may not be comparable to other REITs’ FFO. FFO should be considered only as a supplement to net income computed in accordance with GAAP as a measure of our performance.\n79\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nReconciliation of Net Income Available to Common Stockholders to Funds From Operations (FFO)\n(in thousands, except per share and unit data)\n(unaudited)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n​\n2024\n    \n2023\n    \n2022\nGAAP Net Income Available to Common Stockholders\n​\n$\n 561,766\n​\n$\n 908,114\n​\n$\n 336,960\nNon-GAAP Adjustments:\n​\n \n  \n​\n \n  \n​\n \n  \nNet income attributable to non-controlling interests in operating partnership\n​\n \n 12,700\n​\n \n 20,710\n​\n \n 7,914\nReal estate related depreciation and amortization \n(1)\n​\n \n 1,730,058\n​\n \n 1,657,240\n​\n \n 1,547,865\nDepreciation related to non-controlling interests\n​\n​\n (64,612)\n​\n​\n (57,477)\n​\n​\n (22,110)\nUnconsolidated JV real estate related depreciation and amortization\n​\n​\n 192,931\n​\n​\n 177,153\n​\n​\n 123,099\nGain from the disposition of real estate assets\n​\n​\n (596,904)\n​\n​\n (908,356)\n​\n​\n (177,332)\nProvision for impairment\n​\n​\n 191,185\n​\n​\n 118,363\n​\n​\n 3,000\nFFO available to common stockholders and unitholders \n(2)\n​\n$\n 2,027,124\n​\n$\n 1,915,747\n​\n$\n 1,819,395\nBasic FFO per share and unit\n​\n$\n 6.15\n​\n$\n 6.29\n​\n$\n 6.23\nDiluted FFO per share and unit \n(2)(3)\n​\n$\n 6.14\n​\n$\n 6.20\n​\n$\n 6.03\nWeighted average common stock and units outstanding\n​\n \n  \n​\n \n  \n​\n \n  \nBasic\n​\n \n 329,485\n​\n \n 304,651\n​\n \n 292,123\nDiluted \n(2)(3)\n​\n \n 337,696\n​\n \n 315,113\n​\n \n 303,708\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n(1) Real estate related depreciation and amortization was computed as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n      Depreciation and amortization per income statement\n​\n$\n 1,771,797\n    \n$\n 1,694,859\n    \n$\n 1,577,933\n      Non-real estate depreciation\n​\n​\n (41,739)\n​\n​\n (37,619)\n​\n​\n (30,068)\n​\n​\n$\n 1,730,058\n​\n$\n 1,657,240\n​\n$\n 1,547,865\n​\n(2)\nAs part of the acquisition of Teraco in 2022, certain of Teraco's minority indirect shareholders have the right to put their shares in an upstream parent company of Teraco to the Company in exchange for cash or the equivalent value of shares of the Company common stock, or a combination thereof. U.S. GAAP requires the Company to assume the put right is settled in shares for purposes of calculating diluted EPS. This same approach was utilized to calculate FFO per share. When calculating diluted FFO, Teraco related minority interest is added back to the FFO numerator as the denominator assumes all shares have been put back to the Company. The Teraco noncontrolling share of FFO was $46,953, $39,386, and $11,919 for the years ended December 31, 2024, 2023 and 2022, respectively.\n(3)\nFor all periods presented, we have excluded the effect of the series J, series K and series L preferred stock, as applicable, that may be converted into common stock upon the occurrence of specified change in control transactions as described in the articles supplementary governing the series J, series K and series L preferred stock, as applicable, as they would be anti-dilutive.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nWeighted average common stock and units outstanding\n \n 329,485\n \n 304,651\n \n 292,123\nAdd: Effect of dilutive securities\n \n 8,211\n \n 10,462\n \n 11,585\nWeighted average common stock and units outstanding—diluted\n \n 337,696\n \n 315,113\n \n 303,708\n​\n​\n​\n​\n80\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​",
  "item2": null
}