{
  "source_file": "peak-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    Business\nGeneral Overview\nHealthpeak Properties, Inc. is a Standard & Poor’s (“S&P”) 500 company that owns, operates, and develops high-quality real estate focused on healthcare discovery and delivery in the United States (“U.S.”). Our company was originally founded in 1985. In 2023, we completed our corporate reorganization (the “Reorganization”) into an umbrella partnership REIT (“UPREIT”). We hold substantially all of our assets and conduct our operations through our operating subsidiary, Healthpeak OP, a consolidated subsidiary of which we are the managing member. We are a Maryland corporation and qualify as a self-administered REIT. We are headquartered in Denver, Colorado, with additional corporate offices in California, Tennessee, Wisconsin, and Massachusetts and property management offices in several locations throughout the U.S.\nWe have a diversified portfolio of high-quality healthcare properties across three core asset classes of outpatient medical, lab, and continuing care retirement community (“CCRC”) real estate. Under the outpatient medical and lab segments, we own, operate, and develop outpatient medical buildings, hospitals, and lab buildings. Under the CCRC segment, our properties are operated through RIDEA structures. \nWe have other non-reportable segments that are comprised primarily of: (i) an interest in an unconsolidated joint venture that owns 19 senior housing assets (our “SWF SH JV”) and (ii) loans receivable. These non-reportable segments have been p\nresented on a combined basis herein.\nThe Merger\nOn March 1, 2024 (the “Closing Date”), pursuant to the Agreement and Plan of Merger dated October 29, 2023 (the “Merger Agreement”), by and among us, DOC DR Holdco, LLC, one of our wholly owned subsidiaries (“DOC DR Holdco”), DOC DR, LLC, a wholly owned subsidiary of Healthpeak OP (“DOC DR OP Sub”), Physicians Realty Trust, Physicians Realty L.P. (the “Physicians Partnership”): (i) Physicians Realty Trust merged with and into DOC DR Holdco (the “Company Merger”), with DOC DR Holdco surviving as our wholly owned subsidiary (the “Company Surviving Entity”); (ii) immediately following the effectiveness of the Company Merger, we contributed all of the outstanding equity interests in the Company Surviving Entity to Healthpeak OP (the “Contribution”); and (iii) immediately following the Contribution, Physicians Partnership merged with and into DOC DR OP Sub (the “Partnership Merger” and, together with the Company Merger, the “Merger”), with DOC DR OP Sub surviving as a subsidiary of Healthpeak OP. Subsequent to the Closing Date, the “Combined Company” means Healthpeak and its subsidiaries.\nOn the Closing Date, each outstanding common share of Physicians Realty Trust (other than Physicians Realty Trust common shares that were canceled in accordance with the Merger Agreement) were converted into the right to receive 0.674 (the “Exchange Ratio”) shares of our common stock, and each outstanding common unit of the Physicians Partnership was converted into common units in the successor entity to the Physicians Partnership equal to the Exchange Ratio.\nAs a result of the Merger, we acquired 299 outpatient medical buildings. See Note 3 to the Consolidated Financial Statements for additional information.\nAt December 31, 2024, our portfolio of investments, including properties in certain of our unconsolidated joint ventures, consisted of interests in 697 properties: (i) Outpatient medical – 524 properties; (ii) Lab – 139 properties; (iii) CCRC – 15 properties; and (iv) Other non-reportable – 19 properties. The following table summarizes information for our reportable segments for the year ended December 31, 2024 (dollars in thousands):\nSegment\nAdjusted NOI by Reportable Segment\n(1)\nOutpatient medical\n$\n748,730 \nLab\n590,606 \nCCRC\n136,104 \n_______________________________________\n(1)\nOur Adjusted NOI for our reportable segments, which we also refer to as Total Portfolio Adjusted NOI for our reportable segments, includes results of operations from disposed properties through the disposition date. See Note 16 to the Consolidated Financial Statements for a reconciliation of Adjusted NOI by reportable segment to income (loss) before income taxes and equity income (loss) from unconsolidated joint ventures. See our Segment Analysis below for additional information.\nFor a description of our significant activities during 2024, see “Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations—Company Highlights” in this report.\n4\nTable of Contents\nBusiness Strategy\nOur strategy is to own, operate, and develop high-quality real estate focused on healthcare discovery and delivery. We manage our real estate portfolio for the long-term to maximize risk-adjusted returns and support the growth of our dividends. Our strategy consists of four core elements: \n(i)\nOur \nreal estate\n: Our portfolio consists of high-quality properties in desirable locations. Our portfolio is focused on outpatient medical and lab buildings, favorable sectors that benefit from the universal desire for improved health. We have built scale and fostered deep industry relationships, two unique factors that provide us with a competitive advantage.\n(ii)\nOur \nfinancials\n: We maintain a strong investment-grade balance sheet with ample liquidity as well as long-term fixed-rate debt financing with staggered maturities to reduce our exposure to interest rate volatility and refinancing risk.\n(iii)\nOur \npartnerships\n: We work with leading pharmaceutical, biotechnology, and medical device companies, as well as healthcare delivery systems, specialty physician groups, and other healthcare service providers, to meet their real estate needs. We provide high-quality property management services to encourage tenants to renew, expand, and relocate into our properties, which drives increased occupancy, rental rates, and property values.\n(iv)\nOur\n platform\n: We have a people-first culture that we believe attracts, develops, and retains top talent. We continually strive to create and maintain an industry-leading platform, with systems and tools that allow us to effectively and efficiently manage our assets and investment activity.\nInternal Growth Strategies\nWe believe our real estate portfolio holds the potential for increased future cash flows as it is well-maintained and in desirable locations. Our strategy for maximizing the benefits from these opportunities is to: (i) work with new or existing tenants to address their space and capital needs and (ii) provide high-quality property management services in order to motivate tenants to renew, expand, or relocate into our properties.\nWe expect to continue our internal growth as a result of our ability to:\n•\nBuild and maintain long-term leasing and management relationships with quality tenants. In choosing locations for our properties, we focus on the physical environment, adjacency to established businesses (e.g., hospital systems or life science submarkets) and educational centers, proximity to sources of business growth, and other local demographic factors.\n•\nReplace tenants at the best available market terms and lowest possible transaction costs. We believe we are well-positioned to attract new tenants and achieve attractive rental rates and operating cash flow as a result of the location, design, and maintenance of our properties, together with our reputation for high-quality building services, responsiveness to tenants, and our ability to offer space alternatives within our portfolio.\n•\nExtend and modify terms of existing leases prior to expiration. We selectively structure lease extensions, early renewals, or modifications, which reduce the cost associated with lease downtime, while securing the tenancy and relationship of our high-quality tenants on a long-term basis.\nInvestment Strategies\nThe discovery and delivery of healthcare services requires real estate and, as a result, tenants depend on our real estate, in part, to maintain and grow their businesses. We believe the healthcare real estate market provides investment opportunities due to the: (i) compelling long-term demographics driving the demand for healthcare services; (ii) specialized nature of healthcare real estate investing; and (iii) ongoing consolidation of the fragmented healthcare real estate sector.\nWhile we emphasize healthcare real estate ownership, we may also provide real estate secured financing to, or invest in equity or debt securities of, healthcare operators or other entities engaged in healthcare real estate ownership. We may also acquire all or substantially all of the securities or assets of other REITs, operating companies, or similar entities where such investments would be consistent with our investment strategies. We may co-invest alongside institutional or development investors through partnerships or limited liability companies.\n5\nTable of Contents\nWe monitor our investments based on the percentage of our total assets that may be invested in any one property type, investment vehicle, or geographic location, the number of properties that may be leased to a single tenant or operator, or loans that may be made to a single borrower. In allocating capital, we target opportunities with the most attractive risk/reward profile for our portfolio as a whole. We may take additional measures to mitigate risk, including diversifying our investments (by sector, geography, and tenant), structuring transactions as master leases, requiring tenant or operator insurance and indemnifications, and/or obtaining credit enhancements in the form of guarantees, letters of credit, or security deposits.\nWe believe we are well-positioned to achieve external growth through acquisitions, development, and redevelopment. Other factors that contribute to our competitive position include:\n•\nour reputation gained through decades of successful operations and the strength of our existing portfolio of properties;\n•\nour relationships with leading pharmaceutical and biotechnology tenants, healthcare operators and systems, investment banks and other market intermediaries, corporations, private equity firms, not-for-profit organizations, and companies seeking to monetize existing assets or develop new facilities;\n•\nour relationships with institutional buyers and sellers of high-quality healthcare real estate;\n•\nour track record and reputation for executing acquisitions responsively and efficiently, which provides confidence to domestic and foreign institutions and private investors who seek to sell healthcare real estate in our market areas;\n•\nour relationships with nationally recognized financial institutions that provide capital to the healthcare and real estate industries; and\n•\nour control of land sites held for future development.\nFinancing Strategies\nOur REIT qualification requires us to distribute at least 90% of our REIT taxable income (excluding net capital gains); therefore, we do not retain a significant amount of earnings. As a result, we regularly access the public equity and debt markets to raise the funds necessary to finance acquisitions and debt investments, develop and redevelop properties, and refinance maturing debt. \nWe may finance acquisitions and other investments in a variety of ways, including:\n•\ncash flow from operations;\n•\nsale or exchange of ownership interests in properties or other investments;\n•\nborrowings under our credit facility or commercial paper program;\n•\nissuance of additional debt, including unsecured notes, term loans, and mortgage debt; and/or\n•\nissuance of common stock or preferred stock or its equivalent.\nWe maintain a disciplined investment-grade balance sheet by actively managing our debt to equity levels and maintaining access to multiple sources of liquidity. Our debt obligations are primarily long-term fixed rate with staggered maturities.\nWe finance our investments based on our evaluation of available sources of funding. For short-term purposes, we may utilize our revolving line of credit facility or commercial paper program, arrange for other short-term borrowings from banks or other sources, or issue equity securities pursuant to our at-the-market equity offering program. We arrange for longer-term financing by offering debt and equity, placing mortgage debt, and obtaining capital from institutional lenders and joint venture partners.\nIn addition, capital recycling through dispositions and redeployment through acquisitions, developments, and redevelopments is an important facet of our investment and financing strategies. We routinely have multiple transactions involving both individual properties and portfolios under consideration that are in varying stages of evaluation, underwriting, negotiation, and due diligence review, some of which, if consummated or completed, may have a material effect on our liquidity, results of operations, and financial condition.\n6\nTable of Contents\nSegments\nOutpatient Medical\nOur outpatient medical segment includes outpatient medical buildings and hospitals. Outpatient medical buildings typically contain physicians’ offices and examination rooms, and may also include pharmacies, hospital ancillary service space, and outpatient services such as diagnostic centers, rehabilitation clinics, and day-surgery operating rooms. While these facilities have certain similarities to commercial office buildings, they require additional plumbing, electrical, and mechanical systems to accommodate multiple exam rooms that may require sinks in every room and specialized equipment such as x-ray machines and MRIs. Outpatient medical buildings are often built to accommodate higher structural loads for such specialized equipment and may contain vaults or other unique construction. Our outpatient medical buildings are typically multi-tenant properties leased to healthcare providers (hospitals and physician practices), with approximately 78% of our outpatient medical buildings located on or adjacent to hospital campuses and 96% affiliated with hospital systems as of December 31, 2024 (based on total square feet). Occasionally, we invest in outpatient medical buildings located on hospital campuses subject to ground leases. At December 31, 2024, approximately\n \n76% of our outpatient medical buildings were triple-net leased (based on leased square feet) with the remaining leased under gross or modified gross leases.\nThe following table provides information about our most significant outpatient medical tenant concentration for the year ended December 31, 2024:\nTenant\nPercentage of\nSegment Revenues\nPercentage of\nTotal Revenues\nHCA Healthcare, Inc. (HCA)\n15 \n%\n7 \n%\nCommonSpirit Health\n6 \n%\n3 \n%\nDuring the year ended December 31, 2024, we had various other outpatient medical tenants that each represented 1% or less of total revenues. \nOur outpatient medical segment also includes nine\n \nhospitals. Services provided by our tenants and operators in hospitals are paid for by private sources, third-party payors (e.g., insurance and HMOs), or through Medicare and Medicaid programs. Our hospital property types include acute care, long-term acute care, and specialty and rehabilitation hospitals. All of our hospitals are triple-net leased.\nLab\nOur lab properties, which contain laboratory and office space, are leased primarily to biotechnology, medical device and pharmaceutical companies, scientific research institutions, government agencies, and other organizations involved in the life science industry. While these properties have certain characteristics similar to commercial office buildings, they generally accommodate heavier floor loads and contain more advanced electrical, mechanical, heating, ventilating, and air conditioning systems. The facilities generally have specialty equipment including emergency generators, fume hoods, lab bench tops, and related amenities. In addition to improvements funded by us as the landlord, many of our lab tenants make significant investments to improve their leased space to accommodate biology, chemistry, or medical device research initiatives.\nLab properties are primarily configured in business park or campus settings and include multiple buildings. The business park and campus settings allow us the opportunity to provide flexible, contiguous/adjacent expansion to accommodate the growth of existing tenants. Our properties are located in well-established geographical markets known for scientific research and drug discovery, including San Francisco (53%) and San Diego (17%), California, and Boston, Massachusetts (28%) (based on total square feet). At December 31, 2024,\n \n88% of our lab properties were triple-net leased (based on leased square feet).\nDuring the year ended December 31, 2024, we had various lab tenants that each represented 1% or less of total revenues. \nContinuing care retirement community, or CCRC\nCCRCs are retirement communities that include independent living, assisted living, memory care, and skilled nursing units to provide a continuum of care in an integrated campus. Our CCRCs are owned through RIDEA structures, which is permitted by the Housing and Economic Recovery Act of 2008, and includes most of the provisions previously proposed in the REIT Investment Diversification and Empowerment Act of 2007. The services provided by our third-party manager-operators under a RIDEA structure at our properties are primarily paid for by the residents directly or through private insurance and are less reliant on government reimbursement programs such as Medicare and Medicaid.\n7\nTable of Contents\nA RIDEA structure allows us, through a taxable REIT subsidiary (“TRS”), to receive cash flow from the operations of a healthcare facility in compliance with REIT tax requirements. The criteria for operating a healthcare facility through a RIDEA structure require us to lease the facility to an affiliate TRS and for such affiliate TRS to engage an independent qualifying management company (also known as an eligible independent contractor or third-party operator) to manage and operate the day-to-day business of the facility in exchange for a management fee. As a result, under a RIDEA structure, we are required to rely on a third-party operator to hire and train all facility employees, enter into third-party contracts for the benefit of the facility, including resident/patient agreements, comply with laws, including healthcare laws, and provide resident care. We are substantially limited in our ability to control or influence day-to-day operations under a RIDEA structure, and thus rely on the third-party operator to manage and operate the business. \nThrough our TRS entities, we bear all operational risks and liabilities associated with the operation of these properties, with limited exceptions, such as a third-party operator’s gross negligence or willful misconduct. These operational risks and liabilities include those relating to any employment matters of our operator, compliance with healthcare and other laws, liabilities relating to personal injury-tort matters, resident-patient quality of care claims, and any governmental reimbursement matters, even though we have limited ability to control or influence our third-party operators’ management of these risks. \nThe management agreements we have in RIDEA structures related to CCRCs have original terms ranging from 10 to 15 years, with mutual renewal options. There are base management fees and incentive management fees payable to our third-party operators if operating results of the RIDEA properties exceed pre-established thresholds. Conversely, there are also provisions in the management agreements that reduce management fees payable to our third-party operators if operating results do not meet certain pre-established thresholds.\nCCRCs are different from other housing and care options for seniors because they typically provide written agreements or long-term contracts between residents and the communities (frequently lasting the term of the resident’s lifetime), which offer a continuum of housing, services, and healthcare on one campus or site. CCRCs are appealing as they allow residents to “age in place” and typically the individual is independent and in relatively good health upon entry. \nAs third-party operators manage our RIDEA properties in exchange for the receipt of a management fee, we are not directly exposed to the credit risk of these operators in the same manner or to the same extent as a triple-net tenant.\nOther non-reportable segment\nAt December 31, 2024, we had the following investments in our other non-reportable segments: (i) our unconsolidated joint venture with a sovereign wealth fund that owns 19 senior housing assets (which we refer to as our SWF SH JV) and (ii) loans receivable. \nThe properties in our SWF SH JV are owned through RIDEA structures and include independent living facilities and assisted living facilities, which cater to different segments of the elderly population based upon their personal needs. These facilities are often in apartment-like buildings with private residences ranging from single rooms to large apartments.\nCompetition\nInvesting in real estate serving the healthcare industry is highly competitive. We face competition from other REITs, investment companies, pension funds, private equity investors, sovereign funds, healthcare operators, lenders, developers, and other institutional investors, some of whom may have greater flexibility (e.g., non-REIT competitors), greater resources, and lower costs of capital than we do. Increased competition and resulting capitalization rate compression, as well as the impacts of inflation and higher interest rates, make it more challenging for us to identify and successfully capitalize on opportunities that meet our objectives. Our ability to compete may also be impacted by global, national, and local economic trends, availability of investment alternatives, availability and cost of capital, construction and renovation costs, existing laws and regulations, new legislation, and population trends.\nIncome from our investments depends on our tenants’ and operators’ ability to compete with other companies on multiple levels, including: (i) the quality of care provided, (ii) reputation, (iii) success of product or drug development, (iv) price, (v) the range of services offered, (vi) the physical appearance of a property, (vii) alternatives for healthcare delivery, (viii) the supply of competing properties, (ix) physicians, (x) staff, (xi) referral sources, (xii) location, (xiii) the size and demographics of the population in surrounding areas, and (xiv) the financial condition of our tenants and operators. For a discussion of the risks associated with competitive conditions affecting our business, see “Item 1A, Risk Factors” in this report.\n8\nTable of Contents\nGovernment Regulation, Licensing, and Enforcement\nOverview\nOur healthcare facility operators (which include our TRS entities when we use a RIDEA structure) and tenants are subject to extensive and complex federal, state, and local healthcare laws and regulations relating to quality of care, licensure and certificate of need, resident rights (including abuse and neglect), consumer protection, government reimbursement, fraud and abuse practices, and similar laws governing the operation of healthcare facilities. We expect the healthcare industry, in general, will continue to face increased regulation and pressure in the areas of fraud, waste and abuse, cost control, healthcare management, and provision of services, among others. Federal, state, and local officials are increasingly focusing their efforts on enforcement of these laws and regulations. In addition, our operators are subject to a variety of laws, regulations, and executive orders, including those relating to operators’ response to Covid and other infectious diseases, which can vary based on the provider type and jurisdiction, complicating compliance efforts. These regulations are wide ranging and can subject our tenants and operators to civil, criminal, and administrative sanctions, including enhanced or additional penalties, sanctions, and other adverse actions that may arise under new regulations adopted in response to Covid. Affected tenants and operators may find it increasingly difficult to comply with this complex and evolving regulatory environment because of a relative lack of guidance in many areas as certain of our healthcare properties are subject to oversight from several government agencies, and the laws may vary from one jurisdiction to another. Changes in laws, regulations, reimbursement enforcement activity, and regulatory non-compliance by our tenants and operators can all have a significant effect on their operations and financial condition, which in turn may adversely impact us, as detailed below and set forth under “Item 1A, Risk Factors” in this report.\nThe following is a discussion of certain laws and regulations generally applicable to our operators, and in certain cases, to us.\nFraud and Abuse Enforcement\nThere are various extremely complex U.S. federal and state laws and regulations governing healthcare providers’ referrals, relationships and arrangements and prohibiting fraudulent and abusive practices by such providers. These laws include: (i) U.S. federal and state false claims acts, which, among other things, prohibit providers from filing false claims or making false statements to receive payment from Medicare, Medicaid, or other U.S. federal or state\n \nhealthcare programs; (ii) U.S. federal and state anti-kickback and fee-splitting statutes, including the Medicare and Medicaid anti-kickback statute, which prohibit or restrict the payment or receipt of remuneration to induce referrals or recommendations of healthcare items or services; (iii) U.S. federal and state physician self-referral laws (commonly referred to as the “Stark Law”), which, subject to certain exceptions, generally prohibit referrals of specifically designated health services by physicians to entities with which the physician or an immediate family member has a financial relationship; and (iv) the federal Civil Monetary Penalties Law, which prohibits, among other things, the knowing presentation of a false or fraudulent claim for certain healthcare services and which authorizes the U.S. Department of Health and Human Services to impose monetary penalties for certain fraudulent acts. Violations of U.S. healthcare fraud and abuse laws carry civil, criminal, and administrative sanctions, including punitive sanctions, monetary penalties, imprisonment, denial of Medicare and Medicaid reimbursement, payment suspensions, and potential exclusion from Medicare, Medicaid, or other federal or state healthcare programs. These laws are enforced by a variety of federal, state, and local agencies and in the U.S. can also be enforced by private litigants through, among other things, federal and state false claims acts, which allow private litigants to bring \nqui tam\n or “whistleblower” actions, in which individuals have tremendous financial gain in bringing a whistleblower claim as federal and state false claim acts provide that individuals receive between 15% and 30% of the money recouped. Additionally, violations of false claims acts can result in treble damages. Our tenants and operators that participate in government reimbursement programs are subject to these laws and may become the subject of governmental enforcement actions or whistleblower actions if they fail to comply with applicable laws. Additionally,\n \nthe licensed operators of our U.S. long-term care facilities that participate in government reimbursement programs are required to have compliance and ethics programs that meet the requirements of federal laws and regulations relating to the Social Security Act. Where we have used a RIDEA structure, we are dependent on management companies to fulfill our compliance obligations, and we have developed a program to periodically monitor compliance with such obligations. Investigation by a federal or state governmental body for violation of fraud and abuse laws or imposition of any of these penalties upon one of our operators could jeopardize that operator’s business, reputation, and ability to operate.\n9\nTable of Contents\nLaws and Regulations Governing Privacy and Security\nThere are various U.S. federal and state privacy laws and regulations, including the privacy and security rules contained in the Health Insurance Portability and Accountability Act of 1996 (commonly referred to as “HIPAA”), that provide for the privacy and security of personal health information. An increasing focus of the U. S. Federal Trade Commission’s (“FTC’s”) consumer protection regulation is the impact of technological change on protection of consumer privacy. The FTC, as well as state attorneys general, have taken enforcement action against companies that do not abide by their representations to consumers regarding electronic security and privacy. To the extent we or our affiliated operating entities are a covered entity or business associate under HIPAA and the Health Information Technology for Economic and Clinical Health Act (the “HITECH Act”), compliance with those requirements require us to, among other things, conduct a risk analysis, implement a risk management plan, implement policies and procedures, and conduct employee training. In most cases, we are dependent on our tenants and management companies to fulfill our compliance obligations, and we have developed a program to periodically monitor compliance with such obligations. Because of the far reaching nature of these laws, there can be no assurance we would not be required to alter one or more of our systems and data security procedures to be in compliance with these laws. Our failure to protect health information could subject us to civil or criminal liability and adverse publicity, and could harm our business and impair our ability to attract new customers and residents. We may be required to notify individuals, as well as government agencies and the media, if we experience a data breach.\nFurther, as reliance on technology has increased, so have the risks posed to those systems. Parties that provide us with services essential to our operations must continuously monitor and develop their networks and information technology to prevent, detect, address, and mitigate the risk of unauthorized access, misuse, computer viruses, and social engineering, such as phishing. Our tenants and management companies are continuously working, including with the aid of third-party service providers, to install new, and to upgrade existing, network and information technology systems, to create processes for risk assessment, testing, prioritization, remediation, risk acceptance, and reporting, and to provide awareness training around phishing, malware, and other cyber risks to ensure that our partners that provide us with services essential to our operations are protected against cyber risks and security breaches and that we are also therefore so protected. However, these upgrades, processes, new technology, and training may not be sufficient to protect us from all risks. Even the most well protected information, networks, systems, and facilities remain potentially vulnerable because the techniques and technologies used in attempted attacks and intrusions evolve and generally are not recognized until launched against a target. In some cases, attempted attacks and intrusions are designed not to be detected and, in fact, may not be detected.\nReimbursement\nSources of revenue for some of our tenants and operators include, among others, governmental healthcare programs, such as the federal Medicare programs and state Medicaid programs, and non-governmental third-party payors, such as insurance carriers and HMOs. Our tenants and operators who participate in governmental healthcare programs are subject to government reviews, audits, and investigations to verify compliance with these programs and applicable laws and regulations. As federal and state governments focus on healthcare reform initiatives, and as the federal government and many states face significant current and future budget deficits, efforts to reduce costs by these payors will likely continue, which may result in reduced or slower growth in reimbursement for certain services provided by some of our tenants and operators. Governmental healthcare programs are highly regulated and are subject to frequent and substantial legislative, regulatory, and interpretive changes, which could adversely affect reimbursement rates and the method and timing of payment under these programs. Additionally, new and evolving payor and provider programs in the U.S., including Medicare Advantage, Dual Eligible, Accountable Care Organizations, Post-Acute Care Payment Models, SNF Value-Based Purchasing Programs, and Bundled Payments could adversely impact our tenants’ and operators’ liquidity, financial condition, or results of operations.\nEffective January 16, 2024, Medicare and Medicaid nursing facilities are required to disclose new data about the facility’s ownership, management, and the owners of real property lessors upon initial enrollment and revalidation. In addition, the nursing facilities are required to timely report any changes, including in connection with any change of ownership. The Centers for Medicare and Medicaid Services (“CMS”) defines the new disclosable parties to include members of the facility’s governing body, persons, or entities who are an officer, director, member, partner, trustee, or managing employee of the facility, persons, or entities that exercise operational, financial, or managerial control, lease or sublease real property to the facility, own a direct or indirect interest of five percent or greater of the real property, or provide management or administrative services to the facility. Additionally, facilities are required to disclose whether any entity on the enrollment form is a private equity company or REIT. CMS makes the information publicly available. This new disclosure requirement involves reporting extensive information and may complicate our healthcare facility operators’ efforts to comply with Medicare and Medicaid requirements. Failure to comply with the new disclosure requirements could negatively affect our healthcare facility operators’ participation in Medicare and state Medicaid programs.\n10\nTable of Contents\nHealthcare Licensure and Certificate of Need\nCertain healthcare facilities in our portfolio are subject to extensive national, federal, state, and local licensure, certification, and inspection laws and regulations. A healthcare facility’s failure to comply with these laws and regulations could result in a revocation, suspension, restriction, or non-renewal of the facility’s license and loss of a certificate of need, which could adversely affect the facility’s operations and ability to bill for items and services provided at the facility. In addition, various licenses and permits are required to handle controlled substances (including narcotics), operate pharmacies, handle radioactive materials, and operate equipment. Many states in the U.S. require certain healthcare providers to obtain a certificate of need, which requires prior approval for the construction, expansion, or closure of certain healthcare facilities. The approval process related to state certificate of need laws may impact the ability of some of our tenants and operators to expand or change their businesses. Changes in these laws and regulations could negatively affect the ability of our tenants to make lease payments to us.\nIn some states, healthcare facilities are subject to various state certificate of need (“CON”) laws requiring governmental approval prior to the development or expansion of healthcare facilities and services. State CON laws often materially impact the ability of competitors to enter into the marketplace of our facilities and the repeal of CON laws could allow competitors to freely operate in previously closed markets.\nProduct Approvals\nWhile our lab tenants include some well-established companies, other tenants are less established and, in some cases, may not yet have a product approved by the Food and Drug Administration, or other regulatory authorities, for commercial sale. Creating a new pharmaceutical product or medical device requires substantial investments of time and capital, in part because of the extensive regulation of the healthcare industry. It also entails considerable risk of failure in demonstrating that the product is safe and effective and in gaining regulatory approval and market acceptance.\nEntrance Fee Communities\nOur CCRCs are operated as entrance fee communities. Generally, an entrance fee is an upfront fee or consideration paid by a resident, a portion of which may be refundable, in exchange for some form of long-term benefit, typically consisting of a right to receive certain personal or health care services. In certain states (including the ones in which we operate) entrance fee communities are subject to significant state regulatory oversight, including, for example, oversight of each facility’s financial condition, establishment and monitoring of reserve requirements and other financial restrictions, the right of residents to cancel their contracts within a specified period of time, the right of residents to receive a refund of their entrance fees, lien rights in favor of the residents, restrictions on change of ownership, and similar matters.\nAmericans with Disabilities Act (“ADA”)\nOur properties must comply with the ADA and any similar state or local laws to the extent that such properties are “public accommodations” as defined in those statutes. The ADA may require removal of barriers to access by persons with disabilities in certain public areas of our properties where such removal is readily achievable. To date, we have not received any notices of noncompliance with the ADA that have caused us to incur substantial capital expenditures to address ADA concerns. Should barriers to access by persons with disabilities be discovered at any of our properties, we may be directly or indirectly responsible for additional costs that may be required to make facilities ADA-compliant. Noncompliance with the ADA could result in the imposition of fines or an award of damages to private litigants. The obligation to make readily achievable accommodations pursuant to the ADA is an ongoing one, and we continue to assess our properties and make modifications as appropriate in this respect.\nEnvironmental Matters\nA wide variety of federal, state, and local environmental and occupational health and safety laws and regulations affect healthcare facility operations. These complex federal and state statutes, and their enforcement, involve a myriad of regulations, many of which involve strict liability on the part of the potential offender. Some of these federal and state statutes may directly impact us. Under various federal, state, and local environmental laws, ordinances, and regulations, an owner of real property or a secured lender, such as us, may be liable for the costs of removal or remediation of hazardous or toxic substances at, under or disposed of in connection with such property, as well as other potential costs relating to hazardous or toxic substances (including government fines and damages for injuries to persons and adjacent property). The cost of any required remediation, removal, fines, personal or property damages, and any related liability therefore could exceed or impair the value of the property and/or the assets. In addition, the presence of such substances, or the failure to properly dispose of or remediate such substances, may adversely affect the value of such property and the owner’s ability to sell or rent such property or to borrow using such property as collateral, which, in turn, could reduce our earnings. For a description of the risks associated with environmental matters, see “Item 1A, Risk Factors” in this report.\n11\nTable of Contents\nInsurance\nWe obtain various types of insurance to mitigate the impact of property, business interruption, liability, flood, windstorm, earthquake, fire, environmental, and terrorism-related losses. We attempt to obtain appropriate policy terms, conditions, limits, and deductibles considering the relative risk of loss, the cost of such coverage, and current industry practice. There are, however, certain types of extraordinary losses, such as those due to acts of war or other events, that may be either uninsurable or not economically insurable. In addition, we have a large number of properties that are exposed to earthquake, flood, and windstorm occurrences, which carry higher deductibles.\nWe maintain property insurance for all of our properties. Tenants under triple-net leases are required to provide primary property, business interruption, and liability insurance. We maintain separate general and professional liability insurance for our CCRCs and the senior housing facilities owned by our SWF SH JV. Additionally, our corporate general liability insurance program also extends coverage for all of our properties beyond the aforementioned. We periodically review whether we or our RIDEA operators will bear responsibility for maintaining the required insurance coverage for the applicable CCRCs and senior housing facilities owned by our SWF SH JV, but the costs of such insurance are facility expenses paid from the revenues of those properties, regardless of who maintains the insurance.\nWe also maintain directors and officers liability insurance, which provides protection for claims against our directors and officers arising from their responsibilities as directors and officers. Such insurance also extends to us in certain situations. \nSustainability and Corporate Impact\nWe believe that corporate impact initiatives are a vital part of corporate responsibility, which supports our primary goal of increasing stockholder value through profitable growth. We continue to advance our commitment to sustainability, with a focus on achieving goals in each of the corporate impact dimensions. Our Board of Directors oversees corporate impact matters, with the Nominating and Corporate Governance Committee overseeing sustainability and corporate governance matters, the Audit Committee overseeing risk management, and the Compensation and Human Capital Committee overseeing human capital management. We use an integrated approach to corporate impact throughout our business to identify risks and opportunities, capture efficiencies and cost savings, and report on the issues most relevant to stakeholders.\nEnvironment:\n Our environmental management programs strive to make our buildings more sustainable and capture cost efficiencies that ultimately benefit our investors, employees, tenants, business partners, and other stakeholders, while reducing our carbon footprint and providing a positive impact on the communities in which we operate. We regularly assess the risks and financial impacts to our business posed by climate change, including transition risks, physical climate risks, potential business disruption, and regulatory requirements, and work with our property managers, operators, and tenants to implement projects to mitigate these risks and impacts. For a description of the risks associated with climate risk matters, see “Item 1A, Risk Factors” in this report.\nSocial:\n See “—Human Capital Matters” below. \nGovernance: \nOur transparent corporate governance initiatives incorporate sustainability as a critical component in achieving our business objectives and properly managing risks.\nOur recent corporate impact highlights include:\n•\nReported a reduction of 2.1% in Scope 1 and Scope 2 greenhouse gas emissions (“GHG”) in 2023 compared to 2022 on a like-for-like comparative basis (as defined below)\n•\nObtained 6 new LEED certifications, 19 new ENERGY STAR certifications, and 150 ENERGY STAR recertifications in 2024\n•\nNamed an ENERGY STAR Partner of the Year for Sustained Excellence in 2024, marking our fourth time receiving the Partner of the Year award and first time being recognized for Sustained Excellence\n•\nReceived a Green Star rating from the Global Real Estate Sustainability Benchmark (“GRESB”) for the thirteenth  consecutive year, recognizing leading sustainability performance in our sector\n•\nNamed to \nNewsweek\n’s America’s Most Responsible Companies list for the sixth consecutive year\n•\nNamed a constituent in the FTSE4Good Index for the thirteenth consecutive year \n•\nNamed a constituent in the S&P Global Dow Jones Sustainability World Index for the fifth time and S&P Global North America Dow Jones Sustainability Index for the twelfth consecutive year\n•\nNamed to the S&P Global Sustainability Yearbook for the ninth consecutive year\n12\nTable of Contents\nUnder our “like-for-like” methodology, direct and indirect GHG emissions are compared on a year-over-year rolling basis using Scope 1 and Scope 2 GHG emissions for the properties that we have owned for two full consecutive calendar years, excluding non-stabilized developments and redevelopments in each year of the calculation. Base data utilized in the calculation of Scope 1 and Scope 2 GHG emissions is obtained from third-party invoices or estimates.\nFor additional information regarding our corporate impact initiatives, methodologies, and approach to climate change, please visit our website at www.healthpeak.com/corporate-impact.\nHuman Capital Matters\nOur employees represent our greatest asset, and as of December 31, 2024, we had 387\n \nfull-time employees. Our Board of Directors, through its Compensation and Human Capital Committee, retains oversight of human capital management, including corporate culture, diversity, inclusion, talent acquisition, retention, employee satisfaction, engagement, and succession planning. We report on human capital matters at each regularly scheduled Board of Directors meeting and periodically throughout the year. The most significant human capital measures or objectives that we focus on in managing our business and our related human capital initiatives include the following: \n•\nWorkforce Diversity:\n We believe we are a stronger organization when our workforce represents a diversity of ideas and experiences. We value and embrace such diversity in our employee recruiting, hiring, and development practices. Our workforce was made up of 59% female employees and 35% racially or ethnically diverse employees as of December 31, 2024.\n•\nInclusion and Belonging:\n We promote a work environment that emphasizes respect, fairness, inclusion, and dignity. We are committed to providing equal opportunity and fair treatment to all individuals based on merit, without discrimination based on race, color, religion, national origin, citizenship, marital status, gender (including pregnancy), gender identity, gender expression, sexual orientation, age, disability, veteran status, or other characteristics protected by law. We do not tolerate discrimination or harassment. All employees are required to attend a biennial training on unconscious bias.\n•\nEngagement: \nHigh employee engagement and satisfaction are both critical to attracting and retaining top talent and benefit our business in many ways. We conduct a regular employee engagement survey through an independent third party, measuring our progress on important employee issues and identifying opportunities for growth and improvement.\n•\nTraining and Development:\n We conduct at least annual employee training on our Code of Business Conduct and Ethics, as well as annual training on \nharassment prevention or unconscious bias.\n \nWe also provide training and development to all employees, focusing on career development, professional development, and REIT essentials.\n•\nCompensation and Benefits:\n We aim to ensure merit-based, equitable compensation practices to attract, retain, and recognize talent. We provide competitive compensation and benefit packages to our employees.\n•\nHealth, Safety, and Wellness:\n The health, safety, and wellness of our employees are vital to our success. We are committed to protecting the well-being and safety of employees through special training and other measures. We maintain a hybrid work model, which we believe maximizes company-wide productivity, and provide employees with resources, including virtual tools and ergonomic equipment, to maximize work-from-home efficiency. \n•\nCommunity Partnership:\n Our Social Responsibility Committee is responsible for oversight of our charitable and volunteer activities. We partner with organizations that share our desire to support research, education, and other activities related to healthcare.\nFor additional information on human capital matters, please see our most recent proxy statement or corporate impact report, each of which is available on our website at www.healthpeak.com.\nAvailable Information\nOur website address is www.healthpeak.com. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act are available on our website, free of charge, as soon as reasonably practicable after we electronically file such materials with, or furnish them to, the SEC. Additionally, the SEC maintains a website that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, including us, at www.sec.gov. References to our website throughout this Annual Report on Form 10-K are provided for convenience only and the content on our website does not constitute a part of this Annual Report on Form 10-K. \n13\nTable of Contents",
  "item7": "ITEM 7.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe information set forth in this Item 7 is intended to provide readers with an understanding of our financial condition, changes in financial condition, and results of operations. This section generally discusses the results of our operations for the year ended December 31, 2024 compared to the year ended December 31, 2023. For a discussion of the year ended December 31, 2023 compared to the year ended December 31, 2022, please refer to Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed with the SEC on February 9, 2024.\nThe discussion below contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in these forward-looking statements as a result of various factors, including those which are discussed in “Item 1A, Risk Factors.” See also “Cautionary Language Regarding Forward-Looking Statements” preceding Part I.\nThe following discussion and analysis should be read in conjunction with our accompanying, consolidated financial statements and the notes thereto.\nWe will discuss and provide our analysis in the following order: \n•\nMarket Trends and Uncertainties\n•\nCompany Highlights\n•\nDividends\n•\nResults of Operations\n•\nLiquidity and Capital Resources\n•\nNon-GAAP Financial Measures Reconciliations\n•\nCritical Accounting Estimates\n•\nRecent Accounting Pronouncements\nMarket Trends and Uncertainties\nOur operating results have been and will continue to be impacted by global and national economic and market conditions generally and by the local economic conditions where our properties are located.\nIncreased interest rates, ongoing geopolitical tensions, and volatility in public and private equity and fixed income markets have led to increased costs and limitations on the availability of capital. In addition, increased interest rates have and could continue to adversely impact our borrowing costs, the fair value of our fixed rate instruments, transaction volume, and real estate values generally, including our real estate.\nTo the extent our tenants and/or operators have also experienced increased costs, liquidity constraints, and financing difficulties due to the foregoing macroeconomic and market conditions, they may be unable or unwilling to make payments or perform their obligations when due.\nWe have also been affected by increased costs relating to tenant improvements and construction, which, together with higher costs of capital, have adversely affected, and in the future may adversely affect, the expected yields on our development and redevelopment projects. While there have been signs that cost pressures are moderating, there can be no assurance that this will continue to be the case.\nWe continuously monitor the effects of domestic and global events on our operations and financial position, and on the operations and financial position of our tenants, operators, and borrowers, to enable us to remain responsive and adaptable to the dynamic changes in our operating environment. These events include but are not limited to inflation; interest rates; challenges in the financial markets; and changes in the U.S. political administration, which could affect healthcare policy, labor supply, procurement and construction costs, and economic conditions, among other things.\nSee “Item 1A, Risk Factors” in this report for additional discussion of the risks posed by macroeconomic conditions, as well as the uncertainties we and our tenants, operators, and borrowers may face as a result.\n46\nTable of Contents\nCompany Highlights\nOn March 1, 2024, we completed the Merger with Physicians Realty Trust, which resulted in the acquisition of 299 outpatient medical buildings.\nReal Estate Transactions\n•\nIn January 2024, we sold a 65% interest in two lab buildings in San Diego, California (the “Callan Ridge JV”) to a third-party for net proceeds of $128 million.\n•\nIn April 2024, we exercised our option to buy out four redeemable noncontrolling interests, made aggregate cash payments for the total redemption value of $53 million to the related noncontrolling interest holders, and acquired the redeemable noncontrolling interests associated with these entities.\n•\nDuring the year ended December 31, 2024, we sold: (i) a portfolio of 61 outpatient medical buildings for $697 million and provided the buyer with a mortgage loan secured by the real estate sold for $419 million, (ii) 14 outpatient medical buildings for $220 million, (iii) a portfolio of seven lab buildings for $180 million, and (iv) a portfolio comprised of a land parcel and various vacant buildings on certain of our CCRC campuses for $12 million.\nDevelopment and Redevelopment Activities \n•\nDuring the year\n \nended December 31, 2024, the following projects were placed in service: (i) a portion of two lab development projects with total project costs of $83 million, (ii) two outpatient medical development projects with total project costs of $62 million, (iii) one outpatient medical development project held in a consolidated joint venture of which our share of total project costs was $22 million, (iv) one lab redevelopment building held in one of our unconsolidated South San Francisco JVs of which our share of total project costs was $15 million, (v) one lab redevelopment project with total project costs of $14 million, (vi) a portion of one lab redevelopment project with total project costs of $13 million, and (vii) a portion of one lab redevelopment building held in one of our unconsolidated South San Francisco JVs of which our share of total project costs was $9 million.\nFinancing Activities\n•\nIn March 2024, we executed a $750 million five year unsecured term loan (the “2029 Term Loan”) as an incremental facility under the term loan agreement. In January 2024, we entered into forward-starting interest rate swap instruments on the 2029 Term Loan which are designated as cash flow hedges and establish a blended fixed effective interest rate of 4.66%.\n•\nDuring the year ended December 31, 2024, we repurchased 10.5 million shares of our common stock under our 2022 Share Repurchase Program (as defined below) at a weighted average price of $17.98 per share for a total of $188 million.\n•\nIn February 2025, we repaid $348 million aggregate principal amount of 3.40% senior unsecured notes at maturity.\nOther Activities\n•\nDuring the year ended December 31, 2024, we refinanced one of our existing seller financing loans receivable, extended the maturity date to August 2027, and received aggregate partial principal repayments of $74 million. \n•\nDuring the year ended December 31, 2024, we executed an early lease renewal for approximately 2 million square feet leased by CommonSpirit Health, which is subject to a master agreement, which extended the weighted average lease term of existing leases from July 2027 to December 2035, amended the contractual rents to current market rates, and increased the annual contractual lease escalations from 2.5% to 3.0%.\n•\nIn January 2025, we received full repayment of: (i) the $48 million outstanding balance of one of our seller financing loans receivable and (ii) the $15 million outstanding balance of one secured loan with an original maturity of July 2027.\nDividends\nQuarterly common stock cash dividends paid during 2024 aggregated to $1.20 per share. On February 3, 2025, our Board of Directors declared a quarterly common stock cash dividend of $0.305 per share, reflecting an increase from $0.30 to $0.305 per share. The dividend will be paid on February 26, 2025 to stockholders of record as of the close of business on February 14, 2025.\n47\nTable of Contents\nResults of Operations\nWe evaluate our business and allocate resources among our operating segments: (i) outpatient medical, (ii) lab, (iii) CCRC, (iv) an interest in our unconsolidated SWF SH JV, and (v) loans receivable. Our operating segments are aggregated into the following reportable segments: (i) outpatient medical, (ii) lab, and (iii) CCRC. Under the outpatient medical and lab segments, we own, operate, and develop outpatient medical buildings, hospitals, and lab buildings. Our CCRCs are operated through RIDEA structures. The SWF SH JV and loans receivable are non-reportable segments that have been presented on a combined basis herein. We evaluate performance based upon property adjusted net operating income (“Adjusted NOI” or “Cash NOI”) in each segment. The accounting policies of the segments are the same as those described in the summary of significant accounting policies in Note 2 to the Consolidated Financial Statements.\nNon-GAAP Financial Measures\nAdjusted NOI\nAdjusted NOI is a non-U.S. generally accepted accounting principles (“GAAP”) supplemental financial measure used to evaluate the operating performance of real estate. Adjusted NOI represents real estate revenues (inclusive of rental and related revenues, resident fees and services, and government grant income and exclusive of interest income), less property level operating expenses; Adjusted NOI excludes all other financial statement amounts included in net income (loss) as presented in Note 16 to the Consolidated Financial Statements. Adjusted NOI eliminates the effects of straight-line rents, amortization of market lease intangibles, termination fees, actuarial reserves for insurance claims that have been incurred but not reported, and the impact of deferred community fee income and expense. Adjusted NOI is calculated as Adjusted NOI from consolidated properties, plus our share of Adjusted NOI from unconsolidated joint ventures (calculated by applying our actual ownership percentage for the period), less noncontrolling interests’ share of Adjusted NOI from consolidated joint ventures (calculated by applying our actual ownership percentage for the period). We utilize our share of Adjusted NOI in assessing our performance as we have various joint ventures that contribute to our performance. Our share of Adjusted NOI should not be considered a substitute for, and should only be considered together with and as a supplement to, our financial information presented in accordance with GAAP.\nAdjusted NOI is oftentimes referred to as “Cash NOI.” Management believes Adjusted NOI is an important supplemental measure because it provides relevant and useful information by reflecting only income and operating expense items that are incurred at the property level and presents them on an unlevered basis. We use Adjusted NOI to make decisions about resource allocations, to assess and compare property level performance, and to evaluate our Merger-Combined Same-Store (“Merger-Combined SS”) performance, as described below. We believe that net income (loss) is the most directly comparable GAAP measure to Adjusted NOI. Adjusted NOI should not be viewed as an alternative measure of operating performance to net income (loss) as defined by GAAP since it does not reflect various excluded items. Further, our definition of Adjusted NOI may not be comparable to the definitions used by other REITs or real estate companies, as they may use different methodologies for calculating Adjusted NOI. \nAs described in Note 16 to the Consolidated Financial Statements, our chief operating decision maker (“CODM”) evaluates the performance of our operating segments based on Adjusted NOI. Our operating segments are aggregated into reportable segments for which we disclose Total Portfolio Adjusted NOI for our reportable segments. For further information, including information reconciling our Adjusted NOI for reportable segments to our income (loss) before income taxes and equity income (loss) from unconsolidated joint ventures, refer to Note 16 to the Consolidated Financial Statements. \nOperating expenses generally relate to leased outpatient medical and lab buildings, as well as CCRC facilities. We generally recover all or a portion of our leased outpatient medical and lab property expenses through tenant recoveries, which are recognized within rental and related revenues.\nMerger-Combined Same-Store Adjusted NOI\nMerger-Combined Same-Store Adjusted NOI includes legacy Physicians Realty Trust properties that met the same-store criteria as if they were owned by the Company for the full analysis period. This information allows our investors, analysts, and us to evaluate the performance of our property portfolio under a consistent population by eliminating changes in the composition of our portfolio of properties, excluding properties within the other non-reportable segments. We include properties from our consolidated portfolio, as well as properties owned by our unconsolidated joint ventures in Adjusted NOI (see Adjusted NOI definition above for further discussion regarding our use of pro-rata share information and its limitations). Merger-Combined Same-Store Adjusted NOI excludes government grant income under the CARES Act, amortization of deferred revenue from tenant-funded improvements, and certain non-property specific operating expenses that are allocated to each operating segment on a consolidated basis.\n48\nTable of Contents\nProperties are included in Merger-Combined Same-Store once they are fully operating for the entirety of the comparative periods presented. A property is removed from Merger-Combined Same-Store when it is classified as held for sale, sold, placed into redevelopment, experiences a casualty event that significantly impacts operations, or a significant tenant relocates from a Merger-Combined Same-Store property to a Merger-Combined non Same-Store property and that change results in a corresponding increase in revenue. We do not report Merger-Combined Same-Store metrics for our other non-reportable segments. \nManagement believes that continued reporting of the same-store portfolio for only pre-merger Healthpeak Properties, Inc. offers minimal value to investors who are seeking to understand the operating performance and growth potential of the Combined Company. The Company was provided access to the underlying financial statements of legacy Physicians Realty Trust (which financial statements have been audited or, in the case of interim periods, reviewed) and other detailed information about each property, such as the acquisition date. Based on this available information, the Company was able to consistently apply its same-store definition across the combined portfolio. As a result of the Merger, approximately 97% of the combined portfolio is represented in the Merger-Combined Same-Store presentation for the outpatient medical segment for the year ended December 31, 2024.\nFor a reconciliation of Merger-Combined Same-Store to total portfolio Adjusted NOI and other relevant disclosures by segment, refer to our Segment Analysis below.\nNareit FFO\n.  Funds from Operations (“FFO”), as defined by the National Association of Real Estate Investment Trusts (“Nareit”), is net income (loss) applicable to common shares (computed in accordance with GAAP), excluding gains or losses from sales of depreciable property, including any current and deferred taxes directly associated with sales of depreciable property, impairments of, or related to, depreciable real estate, plus real estate-related depreciation and amortization, and adjustments to compute our share of Nareit FFO from joint ventures. Adjustments for joint ventures are calculated to reflect our pro rata share of both our consolidated and unconsolidated joint ventures. We reflect our share of Nareit FFO for unconsolidated joint ventures by applying our actual ownership percentage for the period to the applicable reconciling items on an entity by entity basis. For consolidated joint ventures in which we do not own 100%, we reflect our share of the equity by adjusting our Nareit FFO to remove the third-party ownership share of the applicable reconciling items based on actual ownership percentage for the applicable periods. Our pro rata share information is prepared on a basis consistent with the comparable consolidated amounts, is intended to reflect our proportionate economic interest in the operating results of properties in our portfolio and is calculated by applying our actual ownership percentage for the period. We do not control the unconsolidated joint ventures, and the pro rata presentations of reconciling items included in Nareit FFO do not represent our legal claim to such items. The joint venture members or partners are entitled to profit or loss allocations and distributions of cash flows according to the joint venture agreements, which provide for such allocations generally according to their invested capital.\nThe presentation of pro rata information has limitations, which include, but are not limited to, the following: (i) the amounts shown on the individual line items were derived by applying our overall economic ownership interest percentage determined when applying the equity method of accounting and do not necessarily represent our legal claim to the assets and liabilities, or the revenues and expenses and (ii) other companies in our industry may calculate their pro rata interest differently, limiting the usefulness as a comparative measure. Because of these limitations, the pro rata financial information should not be considered independently or as a substitute for our financial statements as reported under GAAP. We compensate for these limitations by relying primarily on our GAAP financial statements, using the pro rata financial information as a supplement.\nWe believe Nareit FFO applicable to common shares and diluted Nareit FFO applicable to common shares are important supplemental non-GAAP measures of operating performance for a REIT. Because the historical cost accounting convention used for real estate assets utilizes straight-line depreciation (except on land), such accounting presentation implies that the value of real estate assets diminishes predictably over time. Since real estate values instead have historically risen and fallen with market conditions, presentations of operating results for a REIT that use historical cost accounting for depreciation could be less informative. The term Nareit FFO was designed by the REIT industry to address this issue.\nNareit FFO does not represent cash generated from operating activities in accordance with GAAP, is not necessarily indicative of cash available to fund cash needs and should not be considered an alternative to net income (loss). We compute Nareit FFO in accordance with the current Nareit definition; however, other REITs may report Nareit FFO differently or have a different interpretation of the current Nareit definition from ours. For a reconciliation of net income (loss) to Nareit FFO and other relevant disclosures, refer to “Non-GAAP Financial Measures Reconciliations” below. \nFFO as Adjusted.\n  In addition, we present Nareit FFO on an adjusted basis before the impact of non-comparable items including, but not limited to, transaction and merger-related items, other impairments (recoveries) and other losses (gains), restructuring and severance-related charges, prepayment costs (benefits) associated with early retirement or payment of debt, litigation costs (recoveries), casualty-related charges (recoveries), deferred tax asset valuation allowances, and changes in tax legislation (“FFO as Adjusted”). These adjustments are net of tax, when applicable, and are reflective of our share of our joint \n49\nTable of Contents\nventures. Adjustments for joint ventures are calculated to reflect our pro rata share of both our consolidated and unconsolidated joint ventures. We reflect our share of FFO as Adjusted for unconsolidated joint ventures by applying our actual ownership percentage for the period to the applicable reconciling items on an entity by entity basis. We reflect our share for consolidated joint ventures in which we do not own 100% of the equity by adjusting our FFO as Adjusted to remove the third-party ownership share of the applicable reconciling items based on actual ownership percentage for the applicable periods. See “Nareit FFO” above for further disclosures regarding our use of pro rata share information and its limitations. Transaction and merger-related items include transaction expenses and gains/charges incurred as a result of mergers and acquisitions and lease amendment or termination activities. Prepayment costs (benefits) associated with early retirement of debt include the write-off of unamortized deferred financing fees, or additional costs, expenses, discounts, make-whole payments, penalties or premiums incurred as a result of early retirement or payment of debt. Other impairments (recoveries) and other losses (gains) include interest income associated with early and partial repayments of loans receivable and other losses or gains associated with non-depreciable assets including goodwill, undeveloped land parcels, and loans receivable. Management believes that FFO as Adjusted provides a meaningful supplemental measurement of our FFO run-rate and is frequently used by analysts, investors, and other interested parties in the evaluation of our performance as a REIT. At the same time that Nareit created and defined its FFO measure for the REIT industry, it also recognized that “management of each of its member companies has the responsibility and authority to publish financial information that it regards as useful to the financial community.” We believe stockholders, potential investors, and financial analysts who review our operating performance are best served by an FFO run-rate earnings measure that includes certain other adjustments to net income (loss), in addition to adjustments made to arrive at the Nareit defined measure of FFO. FFO as Adjusted is used by management in analyzing our business and the performance of our properties and we believe it is important that stockholders, potential investors, and financial analysts understand this measure used by management. We use FFO as Adjusted to: (i) evaluate our performance in comparison with expected results and results of previous periods, relative to resource allocation decisions, (ii) evaluate the performance of our management, (iii) budget and forecast future results to assist in the allocation of resources, (iv) assess our performance as compared with similar real estate companies and the industry in general, and (v) evaluate how a specific potential investment will impact our future results. Other REITs or real estate companies may use different methodologies for calculating an adjusted FFO measure, and accordingly, our FFO as Adjusted may not be comparable to those reported by other REITs. For a reconciliation of net income (loss) to FFO as Adjusted and other relevant disclosure, refer to “Non-GAAP Financial Measures Reconciliations” below.\nAdjusted FFO (“AFFO”). \nAFFO is defined as FFO as Adjusted after excluding the impact of the following: (i) stock-based compensation amortization expense, (ii) amortization of deferred financing costs and debt discounts (premiums), (iii) straight-line rents, (iv) deferred income taxes, (v) amortization of above (below) market lease intangibles, net, (vi) non-refundable entrance fees collected in excess of (less than) the related amortization, and (vii) other AFFO adjustments, which include: (a) lease incentive amortization (reduction of straight-line rents), (b) actuarial reserves for insurance claims that have been incurred but not reported, and (c) amortization of deferred revenues, excluding amounts amortized into rental income that are associated with tenant funded improvements owned/recognized by us and up-front cash payments made by tenants to reduce their contractual rents. Also, AFFO is computed after deducting recurring capital expenditures, including second generation leasing costs and second generation tenant and capital improvements (“AFFO capital expenditures”). All adjustments are reflective of our pro rata share of both our consolidated and unconsolidated joint ventures (reported in “other AFFO adjustments”). We reflect our share of AFFO for unconsolidated joint ventures by applying our actual ownership percentage for the period to the applicable reconciling items on an entity by entity basis. We reflect our share for consolidated joint ventures in which we do not own 100% of the equity by adjusting our AFFO to remove the third-party ownership share of the applicable reconciling items based on actual ownership percentage for the applicable periods. See “Nareit FFO” above for further disclosures regarding our use of pro rata share information and its limitations. We believe AFFO is an alternative run-rate performance measure that improves the understanding of our operating results among investors and makes comparisons with: (i) expected results, (ii) results of previous periods, and (iii) results among REITs more meaningful. AFFO does not represent cash generated from operating activities determined in accordance with GAAP and is not indicative of cash available to fund cash needs as it excludes the following items which generally flow through our cash flows from operating activities: (i) adjustments for changes in working capital or the actual timing of the payment of income or expense items that are accrued in the period, (ii) transaction-related costs, (iii) litigation settlement expenses, and (iv) restructuring and severance-related charges. Furthermore, AFFO is adjusted for recurring capital expenditures, which are generally not considered when determining cash flows from operations or liquidity. Other REITs or real estate companies may use different methodologies for calculating AFFO, and accordingly, our AFFO may not be comparable to those reported by other REITs. Management believes AFFO provides a meaningful supplemental measure of our performance and is frequently used by analysts, investors, and other interested parties in the evaluation of our performance as a REIT, and by presenting AFFO, we are assisting these parties in their evaluation. AFFO is a non-GAAP supplemental financial measure and should not be considered as an alternative to net income (loss) determined in accordance with GAAP and should only be considered together with and as a supplement to our financial information prepared in accordance with GAAP. For a reconciliation of net income (loss) to AFFO and other relevant disclosures, refer to “Non-GAAP Financial Measures Reconciliations” below.\n50\nTable of Contents\nComparison of the Year Ended December 31, 2024 to the Year Ended December 31, 2023\nOverview\nThe following table summarizes results for the years ended December 31, 2024 and 2023\n(1)\n (in thousands):\nYear Ended December 31,\n2024\n2023\nChange\nNet income (loss) applicable to common shares\n$\n242,384 \n$\n304,284 \n$\n(61,900)\nNareit FFO\n1,092,730 \n985,180 \n107,550 \nFFO as Adjusted\n1,231,868 \n978,306 \n253,562 \nAFFO\n1,140,665 \n884,230 \n256,435 \n_______________________________________\n(1)\nFor the reconciliation of non-GAAP financial measures, see “Non-GAAP Financial Measures Reconciliations” below.\nNet income (loss) applicable to common shares decreased primarily as a result of the following:\n•\nan increase in depreciation, primarily as a result of: (i) assets acquired as part of the Merger and (ii) development and redevelopment projects placed in service during 2023 and 2024;\n•\nan increase in transaction and merger-related costs, primarily as a result of costs incurred in connection with the Merger;\n•\nan increase in interest expense, primarily as a result of: (i) debt assumed as part of the Merger, including $1.25 billion aggregate principal amount of senior unsecured notes, $400 million aggregate principal amount of senior unsecured term loans assumed as part of the Merger (the “2028 Term Loan”), and $128 million aggregate principal amount of mortgage debt and (ii) borrowings under the 2029 Term Loan, which closed in March 2024; \n•\nan increase in impairments and loan loss reserves (recoveries), net, primarily as a result of: (i) impairment charges associated with an asset impaired under the held for sale model and (ii) an increase in loan loss reserves recognized on secured loans and mezzanine loans receivable acquired as part of the Merger;\n•\nan increase in casualty-related losses from Hurricane Milton during the fourth quarter of 2024; and\n•\nan increase in income tax expense primarily as a result of an income tax expense incurred in connection with the sale of a 65% interest in two lab buildings in San Diego, California to a third-party in January 2024.\nThe decrease in net income (loss) applicable to common shares was partially offset by:\n•\nan increase in Adjusted NOI generated from our lab and outpatient medical segments related to: (i) assets acquired as part of the Merger, (ii) development and redevelopment projects placed in service during 2023 and 2024, and (iii) new leasing activity during 2023 and 2024 (including the impact to straight-line rents);\n•\nan increase in gain on sales of depreciable real estate sales during 2024 as compared to 2023;\n•\na gain upon change of control related to the sale of a 65% interest in two lab buildings in San Diego, California to a third-party in January 2024; and\n•\nan increase in interest income related to mezzanine and secured loans receivable acquired as part of the Merger and seller financing provided in connection with the disposition of 61 outpatient medical buildings in 2024.\nNareit FFO increased primarily as a result of the aforementioned events impacting net income (loss) applicable to common shares, except for the following, which are excluded from Nareit FFO:\n•\ndepreciation and amortization expense;\n•\ngain on sales of depreciable real estate; \n•\ngain upon change of control; \n•\nimpairments of depreciable real estate; and\n•\ntaxes associated with real estate dispositions.\n51\nTable of Contents\nFFO as Adjusted increased primarily as a result of the aforementioned events impacting Nareit FFO, except the following, which are excluded from FFO as Adjusted:\n•\ntransaction and merger-related items;\n•\ncasualty-related losses; and\n•\nloan loss reserves (recoveries).\nAFFO increased primarily as a result of higher cash collections of non-refundable entrance fees at our CCRCs, and the aforementioned events impacting FFO as Adjusted, except for the impact of straight-line rents and amortization of deferred financing costs, deferred income taxes, and debt discounts (premiums) on amounts recognized in connection with the Merger, which are excluded from AFFO, partially offset by higher AFFO capital expenditures during the period.\nSegment Analysis\nThe following tables provide selected operating information for our Merger-Combined Same-Store and total property portfolio for each of our reportable segments. For the year ended December 31, 2024, our Merger-Combined Same-Store consists of 625 properties representing properties fully operating on or prior to January 1, 2023 and that remained in operation through December 31, 2024. Legacy Physicians Realty Trust properties that met the definition of Merger-Combined Same-Store are included in both periods presented as if they were owned by the Company for the full analysis period. See “Non-GAAP Financial Measures” above for additional information. Our total property portfolio consisted of 697 and 477 properties at December 31, 2024 and 2023, respectively.\n52\nTable of Contents\nOutpatient Medical\nThe following table summarizes results at and for the years ended December 31, 2024 and 2023 (dollars and square feet in thousands, except per square foot data):\nMerger-Combined SS\n(1)\nTotal Portfolio\n(2)\nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\nChange\n2024\n2023\nChange\nRental and related revenues\n$\n1,197,264\n$\n1,138,437\n$\n58,827\n$\n1,205,744\n$\n753,479\n$\n452,265 \nHealthpeak’s share of unconsolidated joint venture total revenues\n26,092\n24,091\n2,001\n24,041\n3,033\n21,008 \nNoncontrolling interests’ share of consolidated joint venture total revenues\n(36,083)\n(35,365)\n(718)\n(37,643)\n(35,073)\n(2,570)\nOperating expenses\n(395,079)\n(382,748)\n(12,331)\n(405,993)\n(263,132)\n(142,861)\nHealthpeak’s share of unconsolidated joint venture operating expenses\n(10,007)\n(8,986)\n(1,021)\n(9,034)\n(1,189)\n(7,845)\nNoncontrolling interests’ share of consolidated joint venture operating expenses\n10,071\n10,149\n(78)\n10,582\n9,921\n661 \nAdjustments to NOI\n(3)\n(37,396)\n(14,468)\n(22,928)\n(38,967)\n(14,314)\n(24,653)\nAdjusted NOI\n$\n754,862\n$\n731,110\n$\n23,752\n748,730\n452,725\n296,005 \nPre-Merger legacy Physicians Realty Trust Adjusted NOI\n(4)\n61,398\n309,000\n(247,602)\nLess: Merger-Combined Non-SS Adjusted NOI\n(55,266)\n(30,615)\n(24,651)\nMerger-Combined SS Adjusted NOI\n$\n754,862\n$\n731,110\n$\n23,752 \nAdjusted NOI % change\n3.2 \n%\nProperty count\n(5)\n506 \n506 \n524 \n297 \nEnd of period occupancy\n(6)\n92.3 \n%\n92.4 \n%\n92.2 \n%\n90.7 \n%\nAverage occupancy\n(6)\n92.3 \n%\n92.1 \n%\n92.1 \n%\n90.1 \n%\nAverage occupied square feet\n33,407 \n33,320 \n35,726 \n21,531 \nAverage annual total revenues per occupied square foot\n(7)\n$\n36 \n$\n35 \n$\n36 \n$\n35 \nAverage annual base rent per occupied square foot\n(8)\n$\n28 \n$\n27 \n$\n29 \n$\n29 \n_______________________________________\n(1)\nMerger-Combined Same-Store includes legacy Physicians Realty Trust properties that met the definition of Merger-Combined Same-Store as if they were owned by the Company for the full analysis period. Refer to “Non-GAAP Financial Measures” above for the definition of Merger-Combined Same-Store.\n(2)\nTotal Portfolio includes results of operations from disposed properties through the disposition date. 2024 Total Portfolio includes results of operations for legacy Healthpeak prior to the Closing Date and results of operations for the Combined Company after the Closing Date.\n(3)\nRepresents adjustments we make to calculate Adjusted NOI in accordance with our definition of Adjusted NOI, which is used by our CODM to evaluate performance of our reportable segments. See Note 16 to the Consolidated Financial Statements for further information, including information reconciling our Adjusted NOI for reportable segments to income (loss) before income taxes and equity income (loss) from unconsolidated joint ventures. Refer also to “Non-GAAP Financial Measures” above for the definition of Adjusted NOI.\n(4)\nRepresents Adjusted NOI for legacy Physicians Realty Trust properties prior to the Closing Date. \n(5)\nFrom our 2023 presentation of Same-Store, we added: (i) 290 properties acquired as part of the Merger, (ii) 8 stabilized developments placed in service, (iii) 5 stabilized redevelopments placed in service, and (iv) 4 stabilized acquisitions, and we removed: (i) 72 assets that were sold and (ii) 1 asset that was classified as held for sale.\n(6)\nTotal Portfolio occupancy excludes any of the following: (i) developments, (ii) significant redevelopments, (iii) newly completed properties under lease-up, and (iv) properties held for sale.\n(7)\nAverage annual total revenues does not include non-cash revenue adjustments (i.e., straight-line rents, amortization of market lease intangibles, and deferred revenues).\n(8)\nBase rent does not include tenant recoveries, additional rents in excess of floors, and non-cash revenue adjustments (i.e., straight-line rents, amortization of market lease intangibles, and deferred revenues).\nMerger-Combined\n \nSame-Store Adjusted NOI increased primarily as a result of the following:\n•\nmark-to-market lease renewals;\n•\nhigher average occupancy; and\n•\nannual rent escalations; partially offset by\n•\nhigher operating expenses, net of savings from our internalization of property management.\nTotal Portfolio Adjusted NOI increased primarily as a result of the aforementioned impacts to Merger-Combined Same-Store and the following Merger-Combined Non-Same-Store impacts:\n•\nAdjusted NOI from the outpatient medical buildings acquired as part of the Merger in 2024;\n•\nincreased occupancy in former redevelopment and development properties that have been placed into service; partially offset by\n•\nbusiness interruption proceeds received in 2023 related to a demolished asset; and \n•\ndecreased Adjusted NOI from our 2023 and 2024 dispositions.\n53\nTable of Contents\nLab\nThe following table summarizes results at and for the years ended December 31, 2024 and 2023 (dollars and square feet in thousands, except per square foot data):\nMerger-Combined SS\nTotal Portfolio\n(1)\nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\nChange\n2024\n2023\nChange\nRental and related revenues\n$\n671,796\n$\n644,775\n$\n27,021\n$\n881,452\n$\n878,326\n$\n3,126 \nHealthpeak’s share of unconsolidated joint venture total revenues\n3,229\n3,347\n(118)\n19,733\n9,924\n9,809 \nNoncontrolling interests’ share of consolidated joint venture total revenues\n—\n—\n—\n(196)\n(619)\n423 \nOperating expenses\n(184,839)\n(176,142)\n(8,697)\n(239,620)\n(229,630)\n(9,990)\nHealthpeak’s share of unconsolidated joint venture operating expenses\n(1,800)\n(1,878)\n78\n(6,366)\n(4,092)\n(2,274)\nNoncontrolling interests’ share of consolidated joint venture operating expenses\n—\n—\n—\n52\n156\n(104)\nAdjustments to NOI\n(2)\n(31,101)\n(34,665)\n3,564\n(64,449)\n(36,524)\n(27,925)\nAdjusted NOI\n$\n457,285\n$\n435,437\n$\n21,848\n590,606\n617,541\n(26,935)\nLess: Merger-Combined Non-SS Adjusted NOI\n(133,321)\n(182,104)\n48,783 \nMerger-Combined SS Adjusted NOI\n$\n457,285\n$\n435,437\n$\n21,848 \nAdjusted NOI % change\n5.0 \n%\nProperty count\n(3)\n104 \n104 \n139 \n146 \nEnd of period occupancy\n(4)\n97.6 \n%\n97.4 \n%\n97.5 \n%\n96.9 \n%\nAverage occupancy\n(4)\n97.7 \n%\n98.2 \n%\n96.0 \n%\n97.8 \n%\nAverage occupied square feet\n7,719 \n7,759 \n9,665 \n10,524 \nAverage annual total revenues per occupied square foot\n(5)\n$\n84 \n$\n79 \n$\n87 \n$\n81 \nAverage annual base rent per occupied square foot\n(6)\n$\n61 \n$\n59 \n$\n66 \n$\n63 \n_______________________________________\n(1)\nTotal Portfolio includes results of operations from disposed properties through the disposition date.\n(2)\nRepresents adjustments we make to calculate Adjusted NOI in accordance with our definition of Adjusted NOI, which is used by our CODM to evaluate performance of our reportable segments. See Note 16 to the Consolidated Financial Statements for further information, including information reconciling our Adjusted NOI for reportable segments to income (loss) before income taxes and equity income (loss) from unconsolidated joint ventures. Refer also to “Non-GAAP Financial Measures” above for the definition of Adjusted NOI.\n(3)\nFrom our 2023 presentation of Same-Store, we added:\n \n(i) 6 stabilized developments placed in service, (ii) 2 stabilized redevelopments placed in service, and (iii) 2 buildings that previously experienced a significant tenant relocation, and we removed: (i) 15 buildings that were placed into redevelopment and (ii) 7 assets that were sold.\n(4)\nRefer to “Non-GAAP Financial Measures” above for the definition of Merger-Combined Same-Store. Total Portfolio occupancy excludes any of the following: (i) developments, (ii) significant redevelopments, (iii) newly completed properties under lease-up, and (iv) properties held for sale.\n(5)\nAverage annual total revenues does not include non-cash revenue adjustments (i.e., straight-line rents, amortization of market lease intangibles, and deferred revenues).\n(6)\nBase rent does not include tenant recoveries, additional rents in excess of floors, and non-cash revenue adjustments (i.e., straight-line rents, amortization of market lease intangibles, and deferred revenues).\nMerger-Combined\n \nSame-Store Adjusted NOI increased primarily as a result of the following:\n•\nannual rent escalations; partially offset by\n•\nhigher operating expenses, net of savings from our internalization of property management; and\n•\nlower average occupancy.\nTotal Portfolio Adjusted NOI decreased primarily as a result of the aforementioned impacts to Merger-Combined\n \nSame-Store and the following Merger-Combined\n \nNon-Same-Store impacts:\n•\ndecreased Adjusted NOI from our 2023 and 2024 dispositions; and\n•\ndecreased Adjusted NOI from buildings placed into development and redevelopment in 2023 and 2024.\n54\nTable of Contents\nContinuing Care Retirement Community\nThe following table summarizes results at and for the years ended December 31, 2024 and 2023 (dollars in thousands, except per unit data):\nMerger-Combined SS\nTotal Portfolio\nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\nChange\n2024\n2023\nChange\nResident fees and services\n$\n567,261\n$\n526,769\n$\n40,492\n$\n568,475\n$\n527,417\n$\n41,058 \nGovernment grant income\n(1)\n—\n—\n—\n—\n184\n(184)\nOperating expenses\n(426,922)\n(411,539)\n(15,383)\n(429,248)\n(413,472)\n(15,776)\nAdjustments to NOI\n(2)\n(3,122)\n(1,618)\n(1,504)\n(3,123)\n(1,618)\n(1,505)\nAdjusted NOI\n$\n137,217\n$\n113,612\n$\n23,605\n136,104\n112,511\n23,593 \nPlus (less): Merger-Combined Non-SS adjustments\n1,113\n1,101\n12 \nMerger-Combined SS Adjusted NOI\n$\n137,217\n$\n113,612\n$\n23,605 \nAdjusted NOI % change\n20.8 \n%\nProperty count\n(3)\n15 \n15 \n15 \n15 \nAverage occupancy\n(4)\n85.4 \n%\n83.8 \n%\n85.4 \n%\n83.9 \n%\nAverage occupied units\n(5)\n6,029 \n5,952 \n6,041 \n5,960 \nAverage annual rent per occupied unit\n$\n94,089 \n$\n88,503 \n$\n94,103 \n$\n88,524 \n_______________________________________\n(1)\nRepresents government grant income received under the CARES Act, which is recorded in other income (expense), net in the Consolidated Statements of Operations.\n(2)\nRepresents adjustments we make to calculate Adjusted NOI in accordance with our definition of Adjusted NOI, which is used by our CODM to evaluate performance of our reportable segments. See Note 16 to the Consolidated Financial Statements for further information, including information reconciling our Adjusted NOI for reportable segments to income (loss) before income taxes and equity income (loss) from unconsolidated joint ventures. Refer also to “Non-GAAP Financial Measures” above for the definition of Adjusted NOI.\n(3)\nFrom our 2023 presentation of Same-Store, no properties were added or removed.\n(4)\nRefer to “Non-GAAP Financial Measures” above for the definition of Merger-Combined Same-Store. Total Portfolio occupancy excludes any of the following: (i) developments, (ii) significant redevelopments, (iii) newly completed properties under lease-up, and (iv) properties held for sale.\n(5)\nRepresents average occupied units as reported by the operators for the twelve-month period.\nMerger-Combined\n \nSame-Store Adjusted NOI and Total Portfolio Adjusted NOI increased primarily as a result of the following:\n•\nincreased rates for resident fees; and\n•\nhigher occupancy; partially offset by\n•\nhigher costs of compensation and property management, food, and other operating expenses.\n55\nTable of Contents\nOther Income and Expense Items\nThe following table summarizes the results of our other income and expense items for the years ended December 31, 2024 and 2023 (in thousands):\nYear Ended December 31,\n2024\n2023\nChange\nInterest income and other\n$\n44,778 \n$\n21,781 \n$\n22,997 \nInterest expense\n280,430 \n200,331 \n80,099 \nDepreciation and amortization\n1,057,205 \n749,901 \n307,304 \nGeneral and administrative\n97,162 \n95,132 \n2,030 \nTransaction and merger-related costs\n132,685 \n17,515 \n115,170 \nImpairments and loan loss reserves (recoveries), net\n22,978 \n(5,601)\n28,579 \nGain (loss) on sales of real estate, net\n178,695 \n86,463 \n92,232 \nOther income (expense), net\n59,345 \n6,808 \n52,537 \nIncome tax benefit (expense)\n(4,350)\n9,617 \n(13,967)\nEquity income (loss) from unconsolidated joint ventures\n(1,515)\n10,204 \n(11,719)\nNoncontrolling interests’ share in continuing operations\n(24,161)\n(28,748)\n4,587 \nInterest income and other\nInterest income and other increased for the year ended December 31, 2024 primarily as a result of: (i) mezzanine and secured loans receivable acquired as part of the Merger and (ii) seller financing provided in connection with the disposition of 61 outpatient medical buildings during 2024, partially offset by principal repayments on loans receivable in 2023 and 2024.\nInterest expense\nInterest expense increased for the year ended December 31, 2024 primarily as a result of: (i) debt assumed as part of the Merger, including $1.25 billion aggregate principal amount of senior unsecured notes, $400 million aggregate principal amount of the 2028 Term Loan, and $128 million aggregate principal amount of mortgage debt, (ii) borrowings under the 2029 Term Loan, which closed in March 2024, and (iii) senior unsecured notes issued in January and May 2023, partially offset by lower borrowings on the commercial paper program.\nDepreciation and amortization\nDepreciation and amortization expense increased for the year ended December 31, 2024 primarily as a result of: (i) assets acquired as part of the Merger and (ii) development and redevelopment projects placed in service during 2023 and 2024, partially offset by: (i) assets placed into development and redevelopment in 2023 and 2024 and (ii) dispositions of real estate in 2023 and 2024.\nGeneral and administrative\nGeneral and administrative expenses increased for the year ended December 31, 2024 primarily as a result of increased compensation, travel, information technology, and other costs incurred as a result of a higher headcount, partially offset by merger-related synergies and lower corporate office rent expense.\nTransaction and merger-related costs\nTransaction and merger-related costs increased for the year ended December 31, 2024 primarily as a result of advisory, legal, accounting, tax, post-combination severance and stock compensation expense, and other costs of combining operations with Physicians Realty Trust that were incurred in connection with the Merger, partially offset by: (i) merger-related costs incurred during the year ended December 31, 2023 and (ii) expenses incurred in connection with our reorganization to an UPREIT structure in 2023.\nImpairments and loan loss reserves (recoveries), net\nImpairments and loan loss reserves (recoveries), net increased for the year ended December 31, 2024 primarily as a result of: (i) impairment charges associated with an asset impaired under the held for sale model and (ii) an increase in loan loss reserves under the current expected credit losses model, which is primarily due to reserves recognized on secured loans and mezzanine loans receivable acquired as part of the Merger.\n56\nTable of Contents\nGain (loss) on sales of real estate, net\nGain on sales of real estate, net increased during the year ended December 31, 2024 primarily as a result of the $179 million gain on sales from: (i) a portfolio of 61 outpatient medical buildings sold for proceeds of $697 million, (ii) 14 outpatient medical buildings sold for proceeds of $220 million, (iii) a portfolio of seven lab buildings sold for proceeds of $180 million, and (vi) a portfolio comprised of a land parcel and various vacant buildings on certain of the Company’s CCRC campuses sold for proceeds of $12 million, which were sold during the year ended December 31, 2024, as compared to the $81 million gain on sales from: (i) two lab buildings in Durham, North Carolina sold for proceeds of $113 million and (ii) two outpatient medical buildings sold for proceeds of $32 million, which were sold during the year ended December 31, 2023. Refer to Note 5 to the Consolidated Financial Statements for additional information regarding dispositions of real estate and the associated gain (loss) on sales recognized.\nOther income (expense), net\nOther income increased for the year ended December 31, 2024 primarily due to a gain upon change of control related to the sale of a 65% interest in two lab buildings in San Diego, California to a third-party in January 2024, partially offset by casualty-related losses from Hurricane Milton during the fourth quarter of 2024.\nIncome tax benefit (expense)\nIncome tax expense increased for the year ended December 31, 2024 primarily as a result of: (i) income tax expense incurred in connection with the sale of a 65% interest in two lab buildings in San Diego, California to a third-party in January 2024 and (ii) an increase in operating income associated with our CCRCs, partially offset by the tax impact of casualty-related losses from Hurricane Milton.\nEquity income (loss) from unconsolidated joint ventures\nEquity income from unconsolidated joint ventures decreased for the year ended December 31, 2024 primarily as a result of losses on unconsolidated joint ventures acquired as part of the Merger, partially offset by increased income from the South San Francisco JVs.\nNoncontrolling interests’ share in continuing operations\nNoncontrolling interests’ share in continuing operations decreased for the year ended December 31, 2024 primarily as a result of a gain on sale of an outpatient medical building in a consolidated joint venture in the first quarter of 2023, partially offset by increased income from consolidated joint ventures acquired as part of the Merger.\nLiquidity and Capital Resources\nWe anticipate that our cash flows from operations, available cash balances, and cash from our various financing activities will be adequate for the next 12 months and for the foreseeable future for purposes of: (i) funding recurring operating expenses; (ii) meeting debt service requirements; and (iii) satisfying funding of distributions to our stockholders and non-controlling interest members. Distributions are made using a combination of cash flows from operations, funds available under our bank line of credit (the “Revolving Facility”) and commercial paper program, proceeds from the sale of properties, and other sources of cash available to us.\nIn addition to funding the activities above, our principal liquidity needs for the next 12 months are to:\n•\nfund capital expenditures, including tenant improvements and leasing costs; and\n•\nfund future acquisition, transactional, and development and redevelopment activities.\nOur longer term liquidity needs include the items listed above as well as meeting debt service requirements.\nWe anticipate satisfying these future needs using one or more of the following:\n•\ncash flows from operations; \n•\nsale of, or exchange of ownership interests in, properties or other investments;\n•\nborrowings under our Revolving Facility and commercial paper program;\n•\nissuance of additional debt, including unsecured notes, term loans, and mortgage debt; and/or\n•\nissuance of common or preferred stock or its equivalent, including sales of common stock under the ATM Program (as defined below).\n57\nTable of Contents\nOur ability to access the capital markets impacts our cost of capital and ability to refinance maturing indebtedness, as well as our ability to fund future acquisitions and development through the issuance of additional securities or secured debt. Credit ratings impact our ability to access capital and directly impact our cost of capital as well. Our 2029 Term Loan, our two senior unsecured delayed draw term loans with an aggregate principal amount of $500 million (the “2027 Term Loans”), our 2028 Term Loan, and our Revolving Facility accrue interest at the Secured Overnight Financing Rate (“SOFR”) plus a margin that depends on the credit ratings of our senior unsecured long-term debt.\n \nWe also pay a facility fee on the entire commitment under our Revolving Facility that depends upon our credit ratings. As of January 31, 2025, we had long-term credit ratings of Baa1 from Moody’s and BBB+ from S&P Global, and short-term credit ratings of P-2 from Moody’s and A-2 from S&P Global.\nA downgrade in credit ratings by Moody’s or S&P Global may have a negative impact on (i) the interest rates of our Revolving Facility, 2027 Term Loans, 2028 Term Loan, and 2029 Term Loan, (ii) facility fees for our Revolving Facility, and (iii) the pricing of notes issued under our commercial paper program and senior unsecured notes. While a downgrade in our credit ratings would adversely impact our cost of borrowing, we believe we would continue to have access to the unsecured debt markets, and we could also seek to enter into one or more secured debt financings, issue additional securities, including under our ATM Program, or dispose of certain assets to fund future operating costs, capital expenditures, or acquisitions, although no assurances can be made in this regard. Refer to “Market Trends and Uncertainties” above for a more comprehensive discussion of the potential impact of economic and market conditions on our business.\nMaterial Cash Requirements\nOur material cash requirements include the below contractual and other obligations.\nDebt.  \nAs of December 31, 2024, we had total debt of $8.7 billion, including notes outstanding under our commercial paper program, senior unsecured notes, term loans, and mortgage debt. Of our total debt, the total amount payable within twelve months is comprised of $800 million of senior unsecured notes and $7 million of mortgage debt. Commercial paper borrowings are backstopped by the availability under our Revolving Facility. As such, we calculate the weighted average remaining term of our commercial paper borrowings using the maturity date of our Revolving Facility. Future interest payments associated with borrowings under our senior unsecured notes, term loans, and mortgage debt total $1.5 billion, $304 million of which are payable within twelve months. Future interest payments associated with commercial paper borrowings payable within the next twelve months total $7 million, assuming no change in interest rates and borrowings remain outstanding for the next twelve months. \nDevelopment and redevelopment commitments. \n Our development and redevelopment commitments represent construction and other commitments for development and redevelopment projects in progress and includes certain allowances for Company-owned tenant improvements that we have provided as a lessor. As of December 31, 2024, we had $199 million of development and redevelopment commitments, all of which we expect to spend within the next twelve months.\nLease and other contractual commitments. \n Our lease and other contractual commitments represent our commitments, as lessor, under signed leases and contracts for operating properties and include allowances for Company-owned tenant improvements and leasing commissions. These commitments exclude allowances for Company-owned tenant improvements related to developments and redevelopments in progress for which we have executed an agreement with a general contractor to complete the tenant improvements, which are recognized as development and redevelopment commitments and are discussed further above. As of December 31, 2024, we had total lease and other contractual commitments of $85 million, $83 million of which we expect to spend within the next twelve months. \nConstruction loan commitments.  \nAs of December 31, 2024, we are obligated to provide additional loans up to $85 million\n \nto fund outpatient medical capital expenditure projects, which extend through 2028. As a result of the repayment of a secured loan in January 2025, this remaining commitment was reduced to $67 million. See Note 8 to the Consolidated Financial Statements for additional information.\nGround and other operating lease commitments. \n Our ground and other operating lease commitments represent our commitments as lessee under signed operating leases. As of December 31, 2024, we had total ground and other operating lease commitments of $834 million, $22 million of which are payable within twelve months. See Note 7 to the Consolidated Financial Statements for additional information.\nRedeemable noncontrolling interests.\n \nAs of December 31, 2024, we have one redeemable noncontrolling interest and the redemption value of our redeemable noncontrolling interest was $3 million. Our noncontrolling interest holder has the ability to put their equity interest to us beginning in September 2025. The put option is subject to changes in redemption value in the event that the underlying property generates specified returns for us and meets certain promote thresholds pursuant to the respective agreement. See Note 13 to the Consolidated Financial Statements for additional information.\n58\nTable of Contents\nDistribution and Dividend Requirements.\n  Our dividend policy on our common stock is to distribute a percentage of our cash flow to ensure that we meet the dividend requirements of the Code, relative to maintaining our REIT status, while still allowing us to retain cash to fund capital improvements and other investment activities. Under the Code, REITs may be subject to certain federal income and excise taxes on undistributed taxable income. We paid quarterly common stock cash dividends of $0.30 per share in 2024. In February 2025, our Board of Directors declared an increase in the quarterly common stock cash dividend, from $0.30 to $0.305 per share. Our future common stock cash dividends, if and as declared, may vary and will be determined by the Board based upon the circumstances prevailing at the time, including our financial condition. \nOff-Balance Sheet Arrangements \nWe own interests in certain unconsolidated joint ventures as described in Note 9 to the Consolidated Financial Statements. Four of these joint ventures have aggregate mortgage debt of $845 million, of which our share is $187 million. Except in limited circumstances, our risk of loss is limited to our investment in the applicable joint venture. Additionally, as of December 31, 2024, we had 15 outstanding letter of credit obligations totaling $12 million expiring in 2025 and one outstanding letter of credit obligation of $100 thousand expiring in 2026. We have no other material off-balance sheet arrangements that we expect would materially affect our liquidity and capital resources.\nInflation\nA significant portion of our revenues are derived from leases that generally provide for fixed rental rates, subject to annual escalations. A period of high inflation could result in increases in the Consumer Price Index in excess of our fixed annual escalations. Certain of our leases provide that annual rent is modified based on changes in the Consumer Price Index or other thresholds. \nMost of our outpatient medical leases require the tenant to pay a share of property operating costs such as real estate taxes, insurance, and utilities. Substantially all of our lab leases require the tenant or operator to pay all of the property operating costs or reimburse us for all such costs. \nLabor costs, costs of construction materials, interest, utilities, and other operating costs may increase during periods of inflation. Inflationary increases in expenses will generally be offset, in whole or in part, by the tenant expense reimbursements and contractual rent increases described above. \nCash Flow Summary\nThe following summary discussion of our cash flows is based on the Consolidated Statements of Cash Flows and is not meant to be an all-inclusive discussion of the changes in our cash flows for the periods presented below. \nThe following table sets forth changes in cash flows (in thousands):\nYear Ended December 31,\n2024\n2023\nChange\nNet cash provided by (used in) operating activities\n$\n1,070,497 \n$\n956,242 \n$\n114,255 \nNet cash provided by (used in) investing activities\n(113,799)\n(576,754)\n462,955 \nNet cash provided by (used in) financing activities\n(941,416)\n(337,299)\n(604,117)\nOperating Cash Flows\nOur cash flows from operations are dependent upon the occupancy levels of our buildings, rental rates on leases, our tenants’ performance on their lease obligations, the level of operating expenses, and other factors. Our net cash provided by operating activities increased $114 million for the year ended December 31, 2024 compared to the year ended December 31, 2023 primarily as a result of: (i) an increase in Adjusted NOI from properties acquired as part of the Merger, (ii) developments and redevelopments placed in service during 2023 and 2024, (iii) annual rent increases, and (iv) new leasing and renewal activity. The increase in net cash provided by operating activities was partially offset by: (i) an increase in merger-related costs and (ii) an increase in cash paid for interest.\n59\nTable of Contents\nInvesting Cash Flows\nOur cash flows from investing activities are generally used to fund acquisitions, developments, and redevelopments of real estate, net of proceeds received from sales of real estate, and repayments on loans receivable. Our net cash used in investing activities decreased $463 million for the year ended December 31, 2024 compared to the year ended December 31, 2023 primarily as a result of the following: (i) an increase in proceeds from sales of real estate, (ii) a reduction in cash used for development and redevelopment of real estate, (iii) proceeds received from the Callan Ridge JV transaction, (iv) a reduction in investments in unconsolidated joint ventures, and (v) a reduction in cash used for acquisitions of real estate. The decrease in cash used in investing activities was partially offset by: (i) cash paid in connection with the Merger, (ii) a decrease in proceeds from principal repayments on loans receivable and marketable debt securities, (iii) an increase in fundings of loans receivable, and (iv) a decrease in proceeds received from insurance recoveries.\nFinancing Cash Flows\nOur cash flows from financing activities are generally impacted by issuances and/or repurchases of equity, borrowings and repayments under our bank line of credit and commercial paper program, senior unsecured notes, term loans, and mortgage debt, net of dividends paid to common shareholders. Our net cash used in financing activities increased $604 million for the year ended December 31, 2024 compared to the year ended December 31, 2023 primarily as a result of the following: (i) higher net repayments under the commercial paper program, (ii) repurchases of common stock under our 2022 Share Repurchase Program, (iii) an increase in dividends paid on common stock, (iv) cash used to buy out four redeemable noncontrolling interests in April 2024, and (v) an increase in payments for deferred financing costs. The increase in cash used in financing activities was partially offset by lower repayments of mortgage debt.\nDiscontinued Operations\nOperating, investing, and financing cash flows in our Consolidated Statements of Cash Flows are reported inclusive of both cash flows from continuing operations and cash flows from discontinued operations. Certain significant cash flows from discontinued operations are disclosed in Note 18 to the Consolidated Financial Statements.\nDebt\nIn December 2024, we amended our Revolving Facility to extend the maturity date to January 2029, which may be further extended pursuant to two six-month extension options, subject to certain customary conditions.\nOn March 1, 2024, concurrently with the consummation of the Merger, we assumed the following debt instruments: (i) $1.25 billion\n \naggregate principal of senior unsecured notes, (ii) the $400 million\n \n2028 Term Loan, and (iii) $128 million aggregate principal of mortgage debt. Additionally, on March 1, 2024, concurrently with the consummation of the Merger, we executed the $750 million 2029 Term Loan, which is an incremental facility under our existing term loan agreement.\nIn January 2024, we entered into forward-starting interest rate swap instruments that are designated as cash flow hedges that effectively established a fixed interest rate for the 2029 Term Loan at a blended effective interest rate of\n \n4.66%.\n \nAdditionally, on March 1, 2024, in connection with the consummation of the Merger, we acquired: (i) three interest rate swap instruments that are designated as cash flow hedges that effectively establish a fixed interest rate for the 2028 Term Loan at a blended effective interest rate of 4.44%\n \nand (ii) one\n \ninterest rate swap instrument on $36 million of variable rate mortgage debt that was designated as a cash flow hedge prior to the maturity of the interest rate swap instrument in October 2024. \nSee Note 11 to the Consolidated Financial Statements for additional information about our outstanding debt.\nApproximately 97% and 90% of our consolidated debt was fixed rate debt as of December 31, 2024 and 2023, respectively. At December 31, 2024, our fixed rate debt and variable rate debt had weighted average effective interest rates of 4.04% and 5.56%, respectively. At December 31, 2023, our fixed rate debt and variable rate debt had weighted average effective interest rates of 3.70% and 5.72%, respectively. As of December 31, 2024, we had the following swapped to fixed rates through interest rate swap instruments: (i) the $750 million 2029 Term Loan, (ii) the $500 million 2027 Term Loans, (iii) the $400 million 2028 Term Loan, and (iv) $142 million of variable rate mortgage debt. These interest rate swap instruments are designated as cash flow hedges. For purposes of classification of the amounts above, variable rate debt with a derivative financial instrument designated as a cash flow hedge is reported as fixed rate debt due to us having effectively established a fixed interest rate for the underlying debt instrument. For a more detailed discussion of our interest rate risk, see “Item 7A, Quantitative and Qualitative Disclosures About Market Risk” below.\n60\nTable of Contents\nSupplemental Guarantor Information\nHealthpeak OP has issued the senior unsecured notes issued by Healthpeak prior to the consummation of the Merger as described in Note 11 to the Consolidated Financial Statements. The obligations of Healthpeak OP to pay principal, premiums, if any, and interest on such senior unsecured notes are guaranteed on a full and unconditional basis by the Company, DOC DR Holdco, and DOC DR OP Sub. Additionally, DOC DR OP Sub is the issuer, as successor to the Physicians Partnership upon the Merger, of the senior unsecured notes issued by the Physicians Partnership prior to, and assumed by Healthpeak as part of, the Merger as described in Note 11 to the Consolidated Financial Statements. The obligations of DOC DR OP Sub to pay principal, premiums, if any, and interest on such senior unsecured notes are guaranteed on a full and unconditional basis by the Company, Healthpeak OP, and DOC DR Holdco. \nSubsidiary issuers of obligations guaranteed by the parent are not required to provide separate financial statements, provided that the parent guarantee is “full and unconditional”, the subsidiary obligor is a consolidated subsidiary of the parent company, the guaranteed security is debt or debt-like, and consolidated financial statements of the parent company have been filed. Accordingly, separate consolidated financial statements of Healthpeak OP, DOC DR Holdco, and DOC DR OP Sub have not been presented.\nAs permitted under Rule 13-01 of Regulation S-X, we have excluded the summarized financial information for the Company, Healthpeak OP, DOC DR Holdco, and DOC DR OP because the Company, Healthpeak OP, DOC DR Holdco, and DOC DR OP have no material assets, liabilities, or operations other than the debt financing activities described in the first paragraph of Note 11 to the Consolidated Financial Statements and their investments in non-guarantor subsidiaries, and management believes such summarized financial information would be repetitive and would not provide incremental value to investors.\nEquity\nAt December 31, 2024, we had 699 million shares of common stock outstanding, equity totaled $9.1 billion, and our equity securities had a market value of $14.5 billion.\nThe Merger\nPursuant to the terms set forth in the Merger Agreement, on the Closing Date, each outstanding share of Physicians Realty Trust (other than Physicians Realty Trust common shares that were canceled in accordance with the Merger Agreement) automatically converted into the right to receive 0.674 shares of our common stock. Based on the number of outstanding Physicians Realty Trust common shares as of the Closing Date, we issued 162 million shares of our common stock. Refer to Note 3 to the Consolidated Financial Statements for additional information regarding the Merger.\nAt-The-Market Program\nIn February 2023, in connection with the Reorganization, we terminated our previous at-the-market equity offering program and established a new at-the-market equity offering program (the “ATM Program”) that allows for the sale of shares of common stock having an aggregate gross sales price of up to $1.5 billion. The ATM Program was amended in March 2024 to contemplate the sale of the remaining shares of common stock pursuant to the Company’s Registration Statement on Form S-3 filed with the SEC on February 8, 2024. In addition to the issuance and sale of shares of our common stock, we may also enter into one or more forward sales agreements (each, an “ATM forward contract”) with sales agents for the sale of our shares of common stock under our ATM Program.\nDuring the \nyear ended December 31, 2024\n, we did \nnot\n issue any shares of our common stock under any ATM program.\nAt December 31, 2024, $1.5 billion\n \nof our common stock remained available for sale under the ATM Program. Actual future sales of our common stock will depend upon a variety of factors, including but not limited to market conditions, the trading price of our common stock, and our capital needs. We have no obligation to sell any shares under our ATM Program. \nSee Note 13 to the Consolidated Financial Statements for additional information about our ATM Program.\n61\nTable of Contents\nNoncontrolling Interests\nHealthpeak OP\n.  Immediately following the Reorganization, Healthpeak Properties, Inc. was the initial sole member and 100% owner of Healthpeak OP. Subsequent to the Reorganization, certain of our employees (“OP Unitholders”) have been issued noncontrolling, non-managing member units in Healthpeak OP (“OP Units”). During the three months ended March 31, 2024, OP Unitholders were issued approximately\n \n2 million\n \nOP Units. When certain conditions are met, the OP Unitholders have the right to require redemption of part or all of their OP Units for cash or shares of our common stock, at our option as managing member of Healthpeak OP. The per unit redemption amount is equal to either one share of our common stock or cash equal to the fair value of a share of common stock at the time of redemption. We classify the OP Units in permanent equity because we may elect, in our sole discretion, to issue shares of our common stock to OP Unitholders who choose to redeem their OP Units rather than using cash. As of December 31, 2024, there were approximately\n \n3 million OP Units outstanding, 76 thousand of which had met the criteria for redemption.\nDownREITs.\n  During the year ended December 31, 2024, in connection with the Merger, Physicians Partnership merged with and into DOC DR OP Sub with DOC DR OP Sub surviving as the Partnership Surviving Entity. As of December 31, 2024, approximately 6 million DownREIT units in the Partnership Surviving Entity were outstanding (6 million shares of Healthpeak common stock are issuable upon conversion). Refer to Note 3 to the Consolidated Financial Statements for additional information regarding the Merger.\nAt December 31, 2024, non-managing members held an aggregate of approximately 11 million units in eight limited liability companies for which we hold controlling interests and/or are the managing member. The DownREIT units are exchangeable for an amount of cash approximating the then-current market value of shares of our common stock or, at our option, shares of our common stock (subject to certain adjustments, such as stock splits and reclassifications). At December 31, 2024, the outstanding DownREIT units were convertible into approximately 14 million shares of our common stock.\nShare Repurchase Programs\nOn August 1, 2022, our Board of Directors approved a share repurchase program under which we could acquire shares of our common stock in the open market up to an aggregate purchase price of $500 million (the “2022 Share Repurchase Program”). Purchases of common stock under the 2022 Share Repurchase Program could be exercised at our discretion with the timing and number of shares repurchased depending on a variety of factors, including price, corporate and regulatory requirements, and other corporate liquidity requirements and priorities. Through July 24, 2024, we repurchased 10.5 million shares of our common stock under the 2022 Share Repurchase Program at a weighted average price of $17.98 per share for a total of $188 million.\nOn July 24, 2024, our Board of Directors approved a new share repurchase program (the “2024 Share Repurchase Program”) to supersede and replace the 2022 Share Repurchase Program. Upon adoption of the 2024 Share Repurchase Program, no further share repurchases may be made pursuant to the 2022 Share Repurchase Program. Under the 2024 Share Repurchase Program, we may acquire shares of our common stock in the open market or other similar purchase techniques (including in compliance with the safe harbor provisions of Rule 10b-18 under the Exchange Act or pursuant to one or more plans adopted under Rule 10b5-1 promulgated under the Exchange Act), up to an aggregate purchase price of $500 million. Purchases of common stock under the 2024 Share Repurchase Program may be exercised at our discretion with the timing and number of shares repurchased depending on a variety of factors, including price, corporate and regulatory requirements, and other corporate liquidity requirements and priorities. The 2024 Share Repurchase Program expires in July 2026 and may be suspended or terminated at any time without prior notice. As of December 31, 2024, no\n \nshares have been repurchased under the 2024 Share Repurchase Program. Therefore, at December 31, 2024, $500 million of the Company’s common stock remained available for repurchase under the 2024 Share Repurchase Program.\nShelf Registration\nOn February 8, 2024, the Company and Healthpeak OP jointly filed a prospectus with the SEC as part of a registration statement on Form S-3, using an automatic shelf registration process. This shelf registration statement expires on February 8, 2027 and at or prior to such time, we expect to file a new shelf registration statement. Under the “shelf” process, we may sell any combination of the securities described in the prospectus through one or more offerings. The securities described in the prospectus include future offerings of: (i) the Company’s common stock, preferred stock, depositary shares, warrants, debt securities, and guarantees by the Company of debt securities issued by Healthpeak OP and/or by the Company’s existing and future subsidiaries, and (ii) Healthpeak OP’s debt securities and guarantees by Healthpeak OP of debt securities issued by the Company and/or by Healthpeak OP’s existing and future subsidiaries.\n62\nTable of Contents\nNon-GAAP Financial Measures Reconciliations\nThe following is a reconciliation from net income (loss) applicable to common shares, the most directly comparable financial measure calculated and presented in accordance with GAAP, to Nareit FFO, FFO as Adjusted, and AFFO (in thousands):\nYear Ended December 31,\n2024\n2023\n2022\nNet income (loss) applicable to common shares\n$\n242,384 \n$\n304,284 \n$\n497,792 \nReal estate related depreciation and amortization\n1,057,205 \n749,901 \n710,569 \nHealthpeak’s share of real estate related depreciation and amortization from unconsolidated joint ventures \n44,961 \n24,800 \n27,691 \nNoncontrolling interests’ share of real estate related depreciation and amortization\n(18,328)\n(18,654)\n(19,201)\nLoss (gain) on sales of depreciable real estate, net\n(178,695)\n(86,463)\n(10,422)\nHealthpeak’s share of loss (gain) on sales of depreciable real estate, net, from unconsolidated joint ventures\n— \n— \n134 \nNoncontrolling interests’ share of gain (loss) on sales of depreciable real estate, net\n— \n11,546 \n12 \nLoss (gain) upon change of control, net\n(1)\n(77,548)\n(234)\n(311,438)\nTaxes associated with real estate dispositions\n(2)\n9,633 \n— \n29 \nImpairments (recoveries) of depreciable real estate, net\n13,118 \n— \n— \nNareit FFO applicable to common shares\n1,092,730 \n985,180 \n895,166 \nDistributions on dilutive convertible units and other\n16,211 \n9,394 \n9,407 \nDiluted Nareit FFO applicable to common shares\n$\n1,108,941 \n$\n994,574 \n$\n904,573 \nImpact of adjustments to Nareit FFO:\nTransaction and merger-related items\n(3)\n$\n115,105 \n$\n13,835 \n$\n4,788 \nOther impairments (recoveries) and other losses (gains), net\n(4)\n9,381 \n(3,850)\n3,829 \nRestructuring and severance-related charges\n(5)\n— \n1,368 \n32,749 \nCasualty-related charges (recoveries), net\n(6)\n25,848 \n(4,033)\n4,401 \nRecognition (reversal) of valuation allowance on deferred tax assets\n(7)\n(11,196)\n(14,194)\n— \nTotal adjustments\n$\n139,138 \n$\n(6,874)\n$\n45,767 \nFFO as Adjusted applicable to common shares\n$\n1,231,868 \n$\n978,306 \n$\n940,933 \nDistributions on dilutive convertible units and other\n16,061 \n9,402 \n9,326 \nDiluted FFO as Adjusted applicable to common shares\n$\n1,247,929 \n$\n987,708 \n$\n950,259 \nFFO as Adjusted applicable to common shares\n$\n1,231,868 \n$\n978,306 \n$\n940,933 \nStock-based compensation amortization expense\n15,543 \n14,480 \n16,537 \nAmortization of deferred financing costs and debt discounts (premiums)\n28,974 \n11,916 \n10,881 \nStraight-line rents\n(8)\n(41,276)\n(14,387)\n(49,183)\nAFFO capital expenditures\n(115,784)\n(113,596)\n(108,510)\nCCRC entrance fees\n(9)\n53,697 \n43,453 \n22,095 \nDeferred income taxes\n6,176 \n(816)\n(4,096)\nAmortization of above (below) market lease intangibles, net\n(30,755)\n(25,791)\n(23,380)\nOther AFFO adjustments\n(7,778)\n(9,335)\n520 \nAFFO applicable to common shares\n1,140,665 \n884,230 \n805,797 \nDistributions on dilutive convertible units and other\n16,211 \n6,581 \n6,594 \nDiluted AFFO applicable to common shares\n(9)\n$\n1,156,876 \n$\n890,811 \n$\n812,391 \nRefer to footnotes on the next page.\n63\nTable of Contents\n________________________________\n(1)\nThe year ended December 31, 2024 includes a gain upon change of control related to the sale of a 65% interest in two lab buildings in San Diego, California. The year ended December 31, 2022 includes a gain upon change of control related to the sale of a 30% interest to a sovereign wealth fund and deconsolidation of seven previously consolidated lab buildings in South San Francisco, California. Gains upon change of control are included in other income (expense), net in the Consolidated Statements of Operations.\n(2)\nThe year ended December 31, 2024 includes non-cash income tax expense related to the sale of a 65% interest in two lab buildings in San Diego, California, partially offset by income tax benefit related to the disposition of a portfolio comprised of a land parcel and various vacant buildings on certain of our CCRC campuses.\n(3)\nThe years ended December 31, 2024 and 2023 include costs related to the Merger, which are primarily comprised of advisory, legal, accounting, tax, post-combination severance and stock compensation expense, and other costs of combining operations with Physicians Realty Trust that were incurred during the years then ended. These costs were partially offset by termination fee income during the years ended December 31, 2024 and 2023 associated with Graphite Bio, Inc., which later merged with LENZ Therapeutics, Inc. in March 2024, for which the lease terms were modified to accelerate expiration of the lease to December 2024. Termination fee income is included in rental and related revenues on the Consolidated Statements of Operations, but is excluded from FFO as Adjusted.\n(4)\nThe year ended December 31, 2022 includes the following: (i) $7 million of charges incurred in connection with the downsizing of our corporate headquarters in Denver, Colorado, which are included in general and administrative expenses in the Consolidated Statements of Operations, (ii) $14 million of expenses incurred for tenant relocation and other costs associated with the demolition of an outpatient medical building, which are included in other income (expense), net in the Consolidated Statements of Operations, and (iii) a $23 million gain on sale of a hospital under a DFL, which is included in other income (expense), net in the Consolidated Statements of Operations. The years ended December 31, 2024, 2023, and 2022 include reserves and (recoveries) for expected loan losses recognized in impairments and loan loss reserves (recoveries), net in the Consolidated Statements of Operations.\n(5)\nThe year ended December 31, 2022 includes $32 million of severance-related charges associated with the departures of our former Chief Executive Officer and former Chief Legal Officer and General Counsel in the fourth quarter of 2022. These expenses are included in general and administrative expenses in the Consolidated Statements of Operations.\n(6)\nDuring the year ended December 31, 2024, we incurred casualty-related charges associated with Hurricane Milton. Casualty-related charges (recoveries), net are recognized in other income (expense), net, equity income (loss) from unconsolidated joint ventures, and noncontrolling interests’ share in earnings in the Consolidated Statements of Operations.\n(7)\nThe year ended December 31, 2024 includes the release of a valuation allowance and recognition of a corresponding income tax benefit in connection with a merger of certain taxable REIT subsidiaries. During the year ended December 31, 2023, in conjunction with classifying the assets related to the Callan Ridge JV (see Note 9 to the Consolidated Financial Statements) as held for sale as of December 31, 2023, we concluded it was more likely than not that we would realize the future value of certain deferred tax assets generated by the net operating losses of taxable REIT subsidiaries. Accordingly, during the year ended December 31, 2023, we recognized the reversal of a portion of the associated valuation allowance and recognized a corresponding income tax benefit. See Note 17 to the Consolidated Financial Statements for additional information.\n(8)\nThe year ended December 31, 2023 includes a $9 million write-off of straight-line rent receivable associated with Sorrento Therapeutics, Inc., which commenced voluntary reorganization proceedings under Chapter 11 of the U.S. Bankruptcy Code. This activity is reflected as a reduction of rental and related revenues in the Consolidated Statements of Operations.\n(9)\nDuring the year ended December 31, 2024, we changed our definition of AFFO to adjust for the non-refundable entrance fees collected in excess of (less than) the related amortization as we believe the cash collection of these fees is a more meaningful representation of the performance of the CCRC reportable segment in the determination of AFFO. Diluted AFFO applicable to common shares utilizing the prior definition for the years ended December 31, 2024, 2023, and 2022 was $1.10 billion, $847.4 million, and $790.3 million, respectively.\nCritical Accounting Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires our management to use judgment in the application of critical accounting estimates and assumptions. We base estimates on the best information available to us at the time, our experience, and on various other assumptions believed to be reasonable under the circumstances. These estimates could affect our financial position or results of operations. If our judgment or interpretation of the facts and circumstances relating to various transactions or other matters had been different, it is possible that different accounting would have been applied, resulting in a different presentation of our consolidated financial statements. From time to time, we re-evaluate our estimates and assumptions. In the event estimates or assumptions prove to be different from actual results, adjustments are made in subsequent periods to reflect more current estimates and assumptions about matters that are inherently uncertain. Below is a discussion of accounting estimates that we consider critical in that they may require complex judgment in their application or require estimates about matters that are inherently uncertain. For a more detailed discussion of our significant accounting policies, including those related to critical accounting estimates further discussed below, see Note 2 to the Consolidated Financial Statements.\nBusiness Combinations\nFor a real estate acquisition accounted for as a business combination, we allocate the acquisition consideration (excluding acquisition costs) to the assets acquired, liabilities assumed, and noncontrolling interests at fair value as of the acquisition date. Any excess of the consideration transferred relative to the fair value of the net assets acquired is accounted for as goodwill. Acquisition costs related to business combinations are expensed as incurred.\n64\nTable of Contents\nWe make estimates as part of our process for allocating acquisition consideration to the various identifiable assets, liabilities, and noncontrolling interests based upon the relative fair value of each asset, liability, or noncontrolling interest. These fair values are determined using standard valuation methodologies, such as the cost, market, and income approach. These methodologies require various assumptions, including those of a market participant. We utilize available market information in our assessment, such as capitalization and discount rates and comparable sale transactions. The most significant components of our allocations are typically buildings as-if-vacant, land, and lease intangibles. In the case of allocating fair value to buildings and intangibles, our fair value estimates will affect the amount of depreciation and amortization we record over the estimated useful life of each asset acquired. In the case of allocating fair value to in-place leases, we make our best estimates based on our evaluation of the specific characteristics of each tenant’s lease. Factors considered include estimates of carrying costs during hypothetical expected lease-up periods, market conditions, and costs to execute similar leases. Our assumptions affect the amount of future revenue and/or depreciation and amortization expense that we will recognize over the remaining useful life for the acquired in-place leases. \nOur fair value estimates for loans receivable and debt consider market-based information, such as quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active (markets with few transactions), inputs other than quoted prices that are observable for the asset or liability (i.e., interest rates, yield curves, etc.) and inputs that are derived principally from or corroborated by observable market data correlation or other means (market corroborated inputs). Our fair value estimates for joint ventures consider ownership interests, subordination characteristics, redemption values, discounts for lack of control (as applicable), and hypothetical liquidation waterfalls.\nImpairment of Long-Lived Assets\nWe assess the carrying value of our real estate assets and related intangibles (“real estate assets”) when events or changes in circumstances indicate that the carrying value may not be recoverable. Recoverability of real estate assets is measured by comparing the carrying amount of the real estate assets to the respective estimated future undiscounted cash flows. The expected future undiscounted cash flows reflect external market factors, and based on the specific facts and circumstances, may be probability-weighted to reflect multiple possible cash-flow scenarios, including selling the assets at various points in the future. Additionally, the estimated future undiscounted cash flows are calculated utilizing the lowest level of identifiable cash flows that are largely independent of the cash flows of other assets and liabilities. In order to review our real estate assets for recoverability, we make assumptions regarding external market conditions (including capitalization rates and growth rates), forecasted cash flows and sales prices, and our intent with respect to holding or disposing of the asset. If our analysis indicates that the carrying value of the real estate assets is not recoverable on an undiscounted cash flow basis, we recognize an impairment charge for the amount by which the carrying value exceeds the fair value of the real estate assets.\nDetermining the fair value of real estate assets, including assets classified as held for sale, involves significant judgment and generally utilizes market capitalization rates, comparable market transactions, estimated per unit or per square foot prices, negotiations with prospective buyers, and forecasted cash flows (primarily lease revenue rates, expense rates, and growth rates). Our ability to accurately predict future operating results and resulting cash flows, and estimate fair values, impacts the timing and recognition of impairments. While we believe our assumptions are reasonable, changes in these assumptions may have a material impact on our consolidated financial statements. \nRecent Accounting Pronouncements\nSee Note 2 to the Consolidated Financial Statements for the impact of new accounting standards.",
  "item2": null
}