{
  "source_file": "dow-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nTHE COMPANY\nDow Inc. was incorporated on August 30, 2018, under Delaware law, to serve as a holding company for The Dow Chemical Company and its consolidated subsidiaries (\"TDCC\" and together with Dow Inc., \"Dow\" or the \"Company\"). Dow Inc. operates all of its businesses through TDCC, a wholly owned subsidiary, which was incorporated in 1947 under Delaware law and is the successor to a Michigan corporation, of the same name, organized in 1897. The Company's principal executive offices are located at 2211 H.H. Dow Way, Midland, Michigan 48674.\nAvailable Information\nThe Company's Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, are available free of charge at \nwww.dow.com/investors\n, as soon as reasonably practicable after the reports are electronically filed or furnished with the U.S. Securities and Exchange Commission (\"SEC\"). The SEC maintains a website that contains these reports as well as proxy statements and other information regarding issuers that file electronically. The SEC's website is \nwww.sec.gov\n. Dow's website and its content are not deemed incorporated by reference into this report.\nExcept as otherwise indicated by the context, the term \"Union Carbide\" means Union Carbide Corporation and the term \"Dow Silicones\" means Dow Silicones Corporation, both wholly owned subsidiaries of the Company.\nABOUT DOW\nDow is one of the world’s leading materials science companies, serving customers in high-growth markets such as packaging, infrastructure, mobility and consumer applications. The Company's global breadth, asset integration and scale, focused innovation, leading business positions and commitment to sustainability enables the Company to achieve profitable growth and help deliver a sustainable future. Dow operates manufacturing sites in 30 countries and employs approximately 36,000 people. In 2024, Dow delivered sales of approximately $43 billion. Learn more about Dow's ambition to be the most innovative, customer-centric, inclusive and sustainable materials science company in the world by visiting \nwww.dow.com\n. \nBUSINESS SEGMENTS AND PRODUCTS\nThe Company conducts its worldwide operations through six global businesses which are organized into the following operating segments: Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure and Performance Materials & Coatings. Corporate contains the reconciliation between the totals for the operating segments and the Company's totals. The Company did not aggregate any operating segments when determining its reportable segments. See Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations and Note 25 to the Consolidated Financial Statements for additional information concerning the Company’s operating segments.\nPACKAGING & SPECIALTY PLASTICS \nThe Packaging & Specialty Plastics operating segment consists of two highly integrated global businesses: Hydrocarbons & Energy and Packaging and Specialty Plastics. The segment employs the industry’s broadest polyolefin product portfolio, supported by the Company’s proprietary catalyst and manufacturing process technologies. These differentiators, plus collaboration at the customer’s design table, enable the segment to deliver more reliable, durable, higher-performing solutions designed for recyclability and enhanced plastics circularity and sustainability. The segment serves customers, brand owners and ultimately consumers in key markets including food and specialty packaging; industrial and consumer packaging; health and hygiene; caps, closures and pipe applications; consumer durables; mobility; and infrastructure.\n5\nTable of Contents\nThe Company’s unique advantages compared with its competitors include extensive low-cost feedstock positions around the world; unparalleled scale, global footprint and market reach; world-class manufacturing sites in every geographic region; deep customer and brand owner understanding; portfolio of higher-value functional polymers, such as polyolefin elastomers, semiconductive and jacketing compound solutions and wire and cable insulation; and market-driven application development and technical support.\nThe segment remains agile by participating in the entire ethylene-to-polyethylene chain integration, enabling the Company to manage market swings with industry-leading feedstock and derivative flexibility, and therefore optimize returns while reducing long-term earnings volatility. The Company’s unrivaled value chain ownership is further strengthened by its Pack Studio locations in every geographic region, which help customers and brand owners deliver faster and more efficient packaging product commercialization through a global network of laboratories, technical experts and testing equipment.\nHydrocarbons & Energy\nHydrocarbons & Energy is a leading global producer of ethylene, a key chemical building block that the Company consumes primarily within the Packaging & Specialty Plastics segment. Ethylene is transferred to downstream derivative businesses at market-based prices, which are generally equivalent to prevailing market prices for large volume purchases. In addition to ethylene, the business is a leading producer of propylene and aromatics products that are used to manufacture materials consumers use every day. The business also produces and procures the power, steam and feedstocks used by the Company’s manufacturing sites.\nPackaging and Specialty Plastics \nPackaging and Specialty Plastics serves growing, high-value sectors using world-class technology, broad existing product lines, and a rich product pipeline that creates competitive advantages for the entire packaging value chain. The business is a recognized leader in the production, marketing and innovation of polyethylene. The business is also a leader in other ethylene derivatives, such as polyolefin elastomers, ethylene vinyl acetate and ethylene propylene diene monomer (\"EPDM\") rubber serving mobility; consumer; wire and cable; and construction end-markets. Market growth is expected to be driven by major shifts in population demographics; improving socioeconomic status in emerging geographic regions; consumer and brand owner demand for increased functionality including sustainable offerings through lower-carbon and circular solutions; global efforts to reduce food waste; growth in telecommunications networks; global development of electrical transmission and distribution infrastructure; and renewable energy applications such as wind power and solar (photovoltaic).\nDetails on Packaging & Specialty Plastics' 2024 net sales, by business and geographic region, are as follows:\n \n \n* Europe, Middle East, Africa and India (\"EMEAI\")\n6\nTable of Contents\nProducts\nMajor applications/market segments and products are listed below by business:\nBusiness\nApplications/Market Segments\nMajor Products\nKey Raw Materials\nKey Competitors\nHydrocarbons & Energy\nPurchaser of feedstocks; production of cost competitive hydrocarbon monomers utilized by Dow's derivative businesses; and energy, principally for use in Dow’s global operations\nEthylene, propylene, benzene, butadiene, octene, aromatics co-products, power, steam, other utilities\nButane, condensate, ethane, naphtha, natural gas, propane\nChevron Phillips Chemical, ExxonMobil, INEOS, LyondellBasell, SABIC, Shell, Sinopec\nPackaging and Specialty Plastics\nAdhesives; automotive; caps, closures and pipe applications; construction; cosmetics; electrical transmission and distribution; food and supply chain packaging; footwear; health and hygiene; housewares; industrial specialty applications using polyolefin elastomers, ethylene copolymers, and EPDM; irrigation pipe; mobility; photovoltaic encapsulants; sporting goods; telecommunications infrastructure; toys and infant products\nAcrylics, bio-based plasticizers, copolymer, elastomers, ethylene copolymer resins, EPDM, ethylene vinyl acetate (\"EVA\"), methacrylic acid copolymer resins, polyethylene (\"PE\"), high-density polyethylene (\"HDPE\"), low-density polyethylene (\"LDPE\"), linear low-density polyethylene (\"LLDPE\"), polyolefin plastomers, resin additives and modifiers, semiconductive and jacketing compound solutions and wire and cable insulation\nAliphatic solvent, butene, ethylene, hexene, octene, propylene\nBorealis, ExxonMobil, INEOS, Lanxess, LyondellBasell, Nova, SABIC\nJoint Ventures\n:\nThis segment includes a portion of the Company's share of the results of the following joint ventures:\n•\nEQUATE Petrochemical Company K.S.C.C. (“EQUATE”) - a Kuwait-based company that manufactures ethylene, polyethylene and ethylene glycol, and manufactures and markets monoethylene glycol, diethylene glycol and polyethylene terephthalate resins; owned 42.5 percent by the Company.\n•\nThe Kuwait Olefins Company K.S.C.C. (“TKOC”) - a Kuwait-based company that manufactures ethylene and ethylene glycol; owned 42.5 percent by the Company.\n•\nMap Ta Phut Olefins Company Limited (“Map Ta Phut”) - a Thailand-based company that manufactures propylene and ethylene; the Company has an effective ownership of 32.77 percent (of which 20.27 percent is owned directly by the Company and aligned with the Industrial Intermediates & Infrastructure segment and 12.5 percent is owned indirectly through the Company’s equity interest in Siam Polyethylene Company Limited, an entity that is part of The SCGC-Dow Group and aligned with the Packaging & Specialty Plastics segment).\n•\nSadara Chemical Company (\"Sadara\") - a Saudi Arabian company that manufactures chlorine, ethylene, propylene and aromatics for internal consumption and manufactures and sells polyethylene, ethylene oxide and propylene oxide derivative products, and isocyanates; owned 35 percent by the Company. The Company continues to be responsible for marketing a significant portion of Sadara’s products through the Company’s established sales channels. In 2021, Dow and the Saudi Arabian Oil Company agreed to a marketing rights transition plan. Execution of the transition plan is ongoing and progressing towards aligning marketing rights and responsibilities to levels more consistent with each partner's equity ownership. This transition will not impact equity earnings, but is expected to reduce the Company's sales of Sadara products over the transition period.\nThis segment also includes the Company's share of the results of the following joint ventures:\n•\nThe Kuwait Styrene Company K.S.C.C. - a Kuwait-based company that manufactures styrene monomer; owned 42.5 percent by the Company.\n•\nThe SCGC-Dow Group - a group of Thailand-based companies (consisting of Siam Polyethylene Company Limited; Siam Polystyrene Company Limited; Siam Styrene Monomer Company Limited; and Siam Synthetic Latex Company Limited) that manufactures polyethylene, polystyrene, styrene, latex and specialty elastomers; owned 50 percent by the Company.\n7\nTable of Contents\nCurrent and Future Investments\nThe Company has announced investments that are being progressed over the next several years and are expected to enhance competitiveness. These include:\n•\nConstruction of the world's first net-zero Scope 1 and 2 carbon dioxide equivalent (\"CO\n2\ne\") emissions integrated ethylene and derivatives complex in Alberta, Canada. This project is expected to deliver 2 million metric tons of organic growth in attractive, high-end markets while decarbonizing 20 percent of Dow's global ethylene capacity.\n•\nConstruction of a world-scale polyethylene unit on the U.S. Gulf Coast, based on Dow’s proprietary process technologies, to meet consumer-driven demand in specialty packaging, health and hygiene, and industrial and consumer packaging applications.\n•\nOngoing collaboration with Mura Technology (“Mura”) to help solve the global plastics waste challenge and advance circularity via circular feedstocks, which are converted into recycled plastics. \nThe Company's ambition includes becoming the most sustainable materials science company, with a strategy to advance the well-being of humanity by helping lead the transition to a sustainable planet and society. This includes lowering energy and greenhouse gas (\"GHG\") emissions and further enabling a shift to a circular economy for plastics by focusing on resource efficiency and integrating recycled content and renewable feedstocks into its production processes. Additionally, the Company's Transform the Waste target aims to transform plastic waste and other forms of alternative feedstock to commercialize 3 million metric tons of circular and renewable solutions annually by 2030. As part of that strategy, Dow completed or progressed the following investments in 2024:\n•\nDow acquired Circulus Holdings, LLC, a U.S. mechanical recycling company that converts plastic waste into post-consumer resin. This acquisition includes two facilities in the United States with a total recycling capacity of 50,000 metric tons per year and supports Dow's efforts towards the Transform the Waste target.\n•\nDow completed the sale of its flexible packaging laminating adhesives business in 2024 to Arkema, S.A. The completion of this sale exemplifies Dow's commitment to aligning the Company's portfolio with its growth strategy and circularity platforms.\n•\nDow signed a Memorandum of Understanding (\"MOU\") with Ambipar, a Brazilian multinational and global leader in environmental solutions, to expand the strategic alliance between Dow and Ambipar and help drive transformation of the plastic recycling market in Brazil. By 2030, Dow and Ambipar target leading polyethylene recycling in Brazil, increasing operations from 2,000 metric tons per year to 60,000 metric tons per year. \n•\nDow signed an additional MOU with SCG Chemicals in 2024 to expand its circularity partnership and transform 200,000 metric tons per year of plastic waste into circular products by 2030 in the Asia Pacific geographic region. The partnership supports Dow's efforts towards the Transform the Waste target.\n•\nThe first Mura plant in the United Kingdom commenced commissioning of its 20,000 metric ton advanced recycling facility in the fourth quarter of 2024 and will begin feedstock production in 2025. Dow will be the main recipient of the product produced at this site.\n•\nDow continued to collaborate with X-energy, a nuclear energy innovation company, to advance the design of the previously announced advanced small modular reactor nuclear project at the Seadrift Operations manufacturing site in Texas, which includes developing a construction permit application for submittal to the Nuclear Regulatory Commission. The project is expected to be funded 50 percent by the U.S. Department of Energy under the Advanced Reactor Demonstration Program and will be operated by a subsidiary of NextEra Energy, one of the nation’s major nuclear operators.\n•\nDow continued its collaboration with Hanseatic Energy Hub GmbH (\"HEH\") as a minority stakeholder and is working with HEH's current members to advance Germany's capabilities to import supplies of liquified natural gas, bio-liquified natural gas and synthetic natural gas through the construction of an import terminal. HEH and its shareholders approved the final investment decision for this project on March 4, 2024. The HEH consortium plans to build, own, and operate an import terminal for liquified gases onsite at Dow's Stade, Germany industrial park. The zero-emission terminal will be co-located with Dow's facilities in Stade. Dow is making land available for the construction of the terminal as well as infrastructure services, off-gas heat, site services and mutual harbor use rights.\n•\nDow and privately-held New Energy Blue reached a long-term supply agreement to produce bio-based ethylene from renewable agricultural residues. This is the first agreement in North America to generate plastic sourced materials from corn stover (stalks and leaves), and is the Company's first agreement in North America to utilize agriculture residues for plastic production. Under the terms of the supply agreement, Dow will support the \n8\nTable of Contents\ndesign of New Energy Freedom, a new facility in the United States that is expected to process corn stover and produce commercial quantities of second-generation ethanol and clean lignin, with nearly half of the ethanol to be turned into bio-based ethylene feedstock reducing CO\n2\ne emissions from plastic production, and using it in recyclable applications across transportation, footwear, and packaging.\n•\nDow and Reciclar S.A. joined forces to build an efficient model for plastic recycling in Argentina that will produce more than 6,500 metric tons of post-consumer plastic resin. This collaboration agreement with Reciclar S.A. spans three years and aims to improve the capacity of Reciclar S.A. to process waste on a larger scale and produce high-quality post-consumer plastic materials under the REVOLOOP\nTM\n brand.\n•\nDow has several renewable power agreements in place globally that continue to support progress toward its goal to reduce net annual Scope 1 and 2 CO\n2\ne emissions by 5 million metric tons by 2030.\nINDUSTRIAL INTERMEDIATES & INFRASTRUCTURE \nThe Industrial Intermediates & Infrastructure operating segment consists of two customer-centric global businesses - Industrial Solutions and Polyurethanes & Construction Chemicals - that develop important intermediate chemicals that are essential to manufacturing processes, as well as downstream, customized materials and formulations that use advanced development technologies. These businesses primarily produce and market ethylene oxide and propylene oxide derivatives that are aligned to market segments as diverse as appliances; coatings; furniture and bedding; building and construction; mobility; electronics; surfactants for cleaning and sanitization; infrastructure; and oil and gas. The businesses' global scale and reach, world-class technology, research and development capabilities and materials science expertise enable the Company to be a premier solutions provider offering customers value-added sustainable solutions to enhance comfort, energy efficiency, product effectiveness and durability.\nIndustrial Solutions\nIndustrial Solutions provides a broad portfolio of solutions that enable and improve the manufacture of consumer and industrial goods and services. The business’ solutions minimize friction and heat in mechanical processes; manage the oil and water interface; deliver ingredients for maximum effectiveness; facilitate dissolvability; enable product identification; decarbonize oil and gas products; reduce energy intensity, water use and increase efficacy in broad washing applications; and provide the foundational building blocks for the development of chemical technologies. The business supports manufacturers across a large variety of end-markets, notably coatings; detergents and cleaners; crop protection; consumer health; electronics; oil and gas; inks; lubricants and fluids. The business is a leading producer of purified ethylene oxide, amines, solvents and glycol ethers.\nPolyurethanes & Construction Chemicals\nPolyurethanes & Construction Chemicals consists of three businesses: Polyurethanes, Chlor-Alkali & Vinyl (“CAV”) and Construction Chemicals. The Polyurethanes business is the world’s largest producer of propylene oxide, propylene glycol and polyether polyols, a leading producer of aromatic isocyanates and fully formulated polyurethane systems for rigid, semi-rigid and flexible foams, as well as a leading producer of coatings, adhesives, sealants, elastomers and composites that serve consumers; industrial; building and construction; and mobility end-markets. This includes applications for appliances; furniture; bedding; refrigerated transport; building insulation panels; automotive seat cushions and acoustics; and aircraft deicing fluids. The CAV business provides chlorine and caustic soda supply and markets caustic soda, a valuable co-product of the chlor-alkali manufacturing process, ethylene dichloride and vinyl chloride monomer. The CAV business' assets are predominantly in Western Europe and Latin America and largely produce materials for internal consumption. The Construction Chemicals business provides cellulose ethers, redispersible latex powders, and acrylic emulsions used as key building blocks for differentiated building and construction materials across many market segments and applications ranging from roofing and flooring to gypsum-, cement-, concrete- and dispersion-based building materials. Both Polyurethanes and Construction Chemicals deliver sustainable products aligned toward green building markets yielding reduced environmental impacts and lower product intensity compared to traditional offerings.\n9\nTable of Contents\nDetails on Industrial Intermediates & Infrastructure's 2024 net sales, by business and geographic region, are as follows:\n \n \nProducts\nMajor applications/market segments and products are listed below by business:\nBusiness\nApplications/Market Segments\nMajor Products\nKey Raw Materials\nKey Competitors\nIndustrial Solutions\nBroad range of products for specialty applications including consumer health; agriculture crop protection offerings; aircraft deicing fluids; solvents for coatings; heat transfer fluids for concentrated solar power and data center cooling applications; solvents for electronics processing; food preservation; fuel markers; industrial and institutional cleaning; infrastructure applications; lubricant additives; products and services for energy markets including exploration, production, transmission, refining, mining, gas processing and carbon capture to optimize supply, improve efficiencies and manage emissions\nButyl glycol ethers, VERSENE\n™\n Chelants, UCAR\n™\n Deicing Fluids, UCARSOL\n™ \nAmines and related technology for carbon capture and gas treating, ethanolamines, ethylene oxide (\"EO\"), ethyleneamines, ELEVATE\n™\n Additives for enhanced oil recovery, UCON\n™\n Fluids, DOWANOL\n™ \nGlycol Ethers, DOWTHERM\n™\n Heat Transfer Fluids, DOWFROST\n™\n Fluids for data center cooling; higher glycols, isopropanolamines, low-VOC solvents, methoxypolyethylene glycol, methyl isobutyl, polyalkylene glycol, CARBOWAX\n™\n SENTRY\n™\n Polyethylene Glycol, TERGITOL\n™\nand\n \nTRITON\n™\n brand surfactants, demulsifiers, drilling and completion fluids, rheology modifiers, scale inhibitors, shale inhibitors, specialty amine solvents, surfactants, water clarifiers, frothing separating agents\nAmmonia, butene, ethylene, phenol, propylene\nBASF, Eastman, Hexion, Huntsman, INEOS, LyondellBasell, SABIC, Sasol, Shell\nPolyurethanes & Construction Chemicals\nAircraft deicing fluids; alumina; pulp and paper; appliances; automotive; bedding; building and construction; flooring; footwear; heat transfer fluids; hydraulic fluids; infrastructure; mobility; packaging; textiles and transportation; caulks and sealants; cement-based tile adhesives; concrete solutions; elastomeric roof coatings; industrial non-wovens; plasters and renders; roof tiles and siding; sport grounds and tape joint compounds\nAniline, caustic soda, ethylene dichloride (\"EDC\"), methylene diphenyl diisocyanate (“MDI”), polyether polyols, propylene glycol (\"PG\"), propylene oxide (\"PO\"), polyurethane systems, vinyl chloride monomer (\"VCM\"), AQUASET\n™\n Acrylic Thermosetting Resins, DOW\n™\n Latex Powder, RHOPLEX\n™\n and PRIMAL\n™\n Acrylic Emulsion Polymers, WALOCEL\n™\n Cellulose Ethers\nAniline, benzene, carbon monoxide, caustic soda, cell effluent, cellulose, chlorine, electric power, ethylene, hydrogen peroxide, propylene\nArkema, Ashland, BASF, Covestro, Eastman, Huntsman, Wanhua\nJoint Ventures \nThis segment includes a portion of the Company's share of the results of EQUATE, TKOC, Map Ta Phut and Sadara. \n10\nTable of Contents\nCurrent and Future Investments\nThe Company expects to make investments over the next several years to enhance competitiveness and increase underlying mid-cycle earnings in its Polyurethanes & Construction Chemicals and Industrial Solutions businesses. The investments will include alkoxylation capacity expansions and finishing capabilities, investments to support growth in polyurethane systems and efficiency improvements around the world.\nIn 2024, the Company benefited from the completion of an integrated MDI distillation and prepolymers facility along the U.S. Gulf Coast to increase distillation capabilities by 30 percent versus prior levels, which is expected to improve integrated margins for the portfolio. In addition, the Company completed the expansion of propylene glycol capacity at the existing joint venture facility in Map Ta Phut, Thailand by 80,000 metric tons per year, bringing total capacity to 250,000 metric tons per year, the largest propylene glycol plant in the region. This additional capacity came online in March 2024 and will support customer growth for food and pharma applications.\nIn 2024, the Industrial Solutions business continued to ramp up previously completed investments on the U.S. Gulf Coast and in Europe to expand capacity of specialty amines and alkoxylation chemistries to serve fast growing energy transition, pharmaceutical, home care, cleaning, and agriculture end-markets. The Company also further advanced applications in data center cooling with DOWFROST\nTM\n LC Heat Transfer Fluid, which is specifically formulated for liquid-cooled, direct-to-chip applications and provides exceptional corrosion protection, freeze protection and ensures a long life-span of the system. The Company also announced its intent to invest in a new world-scale carbonate solvents facility in the United States to support domestic electric vehicle and energy storage markets in collaboration with the U.S. Department of Energy Office of Clean Energy Demonstrations.\nIn 2024, the Company also progressed the following:\n•\nThe Industrial Solutions business advanced investments to expand alkoxylation capacity in the United States and Europe. These investments build on previously announced capacity expansions, collectively increasing the Company's global alkoxylation capacity by 70 percent versus the 2020 baseline. The additional capacity is needed to support increasing demand across a wide range of fast-growing end-markets where the Company is delivering 10 percent to 15 percent annual growth rates, from home and personal care to industrial and institutional cleaning solutions and pharmaceuticals. The investments are backed by supply agreements with customers, including leading consumer brands, and are expected to come online in the United States and Europe within the next year.\n•\nThe Polyurethanes & Construction Chemicals business made significant progress in scaling key projects aligned with its long-term sustainability goals. Together with key industry partners and selected customers, Dow has created an innovative industry ecosystem, which pioneers the RENUVA\nTM\n end-of-life mattress recycling program at an industrial scale, covering everything from collection and dismantling to re-polyol production and mattress manufacturing. Also, as part of its circular strategy, the Polyurethanes & Construction Chemicals business commercializes mass-balanced circular feedstock solutions, SPECFLEX\nTM \nCIR, for mobility applications. \n•\nIn support of customer requests to reduce Scope 3 emissions, the Polyurethanes & Construction Chemicals business successfully launched propylene glycol and CAV low-carbon offerings under Dow's DECARBIA\nTM \nportfolio of reduced carbon materials, in which the decarbonization potential reaches from more than 40 percent to well above 90 percent depending on product grades.\n•\nDow announced a strategic review of select assets in Europe, primarily certain polyurethanes assets within the Industrial Intermediates & Infrastructure segment, as part of an effort to continue to optimize its global asset footprint. The strategic review is expected to be completed in 2025.\n11\nTable of Contents\nPERFORMANCE MATERIALS & COATINGS \nThe Performance Materials & Coatings operating segment includes industry-leading franchises that deliver a wide array of solutions into consumer, infrastructure and mobility end-markets. The segment consists of two global businesses: Coatings & Performance Monomers and Consumer Solutions. These businesses primarily utilize the Company's acrylics-, cellulosics- and silicone-based technology platforms to serve the needs of the architectural and industrial coatings; home and personal care; consumer and electronics; mobility; industrial and chemical processing; and infrastructure (including residential and commercial buildings) end-markets. Both businesses employ materials science capabilities, global reach and unique products and technology combining chemistry platforms to deliver differentiated, market-driven and sustainable innovations to customers. \nCoatings & Performance Monomers\n \nCoatings & Performance Monomers consists of two businesses: Coating Materials and Performance Monomers. The Coating Materials business makes critical ingredients and additives that help advance the performance of paints and coatings. The business offers innovative and sustainable products to accelerate paint and coatings performance across diverse market segments, including architectural paints and coatings, as well as industrial coatings applications used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper and leather. These products enhance coatings by improving hiding and coverage characteristics, enhancing durability against nature and the elements, lowering or eliminating volatile organic compounds content, reducing maintenance and improving ease of application. The Performance Monomers business manufactures acrylics-based building blocks needed for the production of coatings, textiles, adhesives and home and personal care products. \nConsumer Solutions\nConsumer Solutions consists of two businesses: Performance Silicones & Specialty Materials and Silicone Feedstocks & Intermediates. The Performance Silicones & Specialty Materials business delivers an unmatched portfolio of performance-enhancing materials to meet the diverse needs of customers in fast-growing markets, including infrastructure; consumer and electronics; industrial and chemical processing; mobility; and home and personal care. It focuses resources on delivering valuable differentiation via market-driven innovations and sustainable solutions, which address lower-carbon footprint and circularity goals while enabling continued growth. The Silicone Feedstocks & Intermediates business focuses on maximizing productivity and optimizing margins by leveraging Dow’s scale and global reach. It is charged with producing silicon metal, siloxanes and intermediates, which are key materials to manufacture differentiated downstream silicone products. \nDetails on Performance Materials & Coatings' 2024 net sales, by business and geographic region, are as follows:\n \n \n \n12\nTable of Contents\nProducts\nMajor applications/market segments and products are listed below by business:\nBusiness\nApplications/Market Segments\nMajor Products\nKey Raw Materials\nKey Competitors\nCoatings & Performance Monomers\nAcrylic binders for architectural paints and coatings, industrial coatings and paper; adhesives; dispersants; impact modifiers; inks and paints; opacifiers and surfactants for both architectural and industrial applications; plastics additives; processing aids; protective and functional coatings; rheology modifiers\nACOUSTICRYL\n™\n Liquid-Applied Sound Damping Technology; acrylates; ACRYSOL\n™\n Rheology Modifiers; AVANSE\n™\n Acrylic Binders; EVOQUE\n™\n Pre-Composite Polymer; foam cell promoters; FORMASHIELD\n™\n Acrylic Binder; high-quality impact modifiers; MAINCOTE\n™\n Acrylic Epoxy Hybrid; methacrylates; processing aids; RHOPLEX\n™\n Acrylic Resin; TAMOL\n™\n Dispersants; FASTRACK\n™\n Road Marking Resins; vinyl acetate monomers; weatherable acrylic capstock compounds for thermoplastic and thermosetting materials\nAcetic acid, acetone, acrylic acid, ammonia, butanol, butyl acrylate, methanol, methyl methacrylate, propylene, styrene\nArkema, BASF, Celanese, Evonik, LyondellBasell, Wacker Chemie\nConsumer Solutions\nPersonal and home care; mobility; infrastructure; consumer and electronics; industrial and chemical processing\nAdhesives and sealants; antifoams and surfactants; coatings and controlled release; coupling agents and crosslinkers; fluids, emulsions and dispersions; formulating and processing aids; granulation and binders; oils; polymers and emollients; opacifiers; reagents; resins, gels and powders; rheology modifiers; rubber; solubility enhancers; aerospace composites; surfactants and solvents; encapsulants for solar photovoltaic applications; ACUSOL\n™\n Prime 1 Polymer; AMPLIFY\n™ \nSi PE 1000 Polymer System; bio-based, readily biodegradable SunSpheres\n™\n BIO SPF Booster; DOWSIL\n™\n Silicone Products; SILASTIC™ Silicone Elastomers; SYL-OFF\n™ \nSilicone Release Coatings\nMethanol, platinum, silica, silicon metal \nElkem, Momentive, Shin-Etsu, Wacker Chemie\nCurrent and Future Investments\nIn 2024, key growth capital projects in every major geographic region were brought online to meet customer needs in fast-growing markets. These include:\n•\nCapacity expansions of silicone key intermediates enabling downstream growth globally across multiple end-markets, such as infrastructure; consumer and electronics; and mobility. \n•\nCapacity expansions in Europe, Middle East, Africa and India (\"EMEAI\") to meet demand growth for sustainable silicone solutions in the personal care end-markets.\n•\nCapacity expansions in Asia Pacific to meet growing demand for mobility, infrastructure, consumer and electronics end-markets.\n•\nCapacity expansions in U.S. & Canada to accelerate growth in targeted applications within mobility, personal care, and infrastructure end-markets.\nThe Company continues to make targeted incremental investments strategically focused on higher-return and faster-payback projects that will require lower levels of capital investment in both the Coatings & Performance Monomers and Consumer Solutions businesses. These investments aim to expand manufacturing capacity, capabilities and efficiency, which further enhance competitiveness across end-markets.\nGrowth investments drive realization of the Company's broad product innovation portfolio where over 90 percent of projects deliver sustainability benefits. As part of this portfolio, the Coatings & Performance Monomers business continues to make significant strides in advancing architectural coatings innovations that provide both performance and sustainability benefits. The Company's capital strategy is aligned with industry trends to further expand investments focused on accelerating end-markets, including electronics, infrastructure and mobility. Debottlenecking investments allow the Company to fully leverage its global footprint and world-scale facilities to increase supply chain flexibility.\n13\nTable of Contents\nBy leveraging global scale and a broad innovation portfolio, the Company is well-positioned to deliver differentiated solutions and sustainable materials in key end-markets, including infrastructure, electronics, industrial, mobility, and home and personal care.\nCORPORATE\nCorporate includes certain enterprise and governance activities (including insurance operations, environmental operations, etc.); non-business aligned joint ventures; non-business aligned litigation expenses; and discontinued or non-aligned businesses. \nRAW MATERIALS\nThe Company operates in an integrated manufacturing environment. Basic raw materials are processed through many stages to produce a number of products that are sold as finished goods at various points in those processes. Hydrocarbon-based raw materials are the major raw material streams that feed the production of the Company's finished goods. The Company purchases hydrocarbon-based raw materials including ethane, propane, butane, naphtha and condensate as feedstocks. These raw materials are used in the production of both saleable products and energy. The Company also purchases and sells certain monomers, primarily ethylene and propylene, to balance internal production and internal consumption. The Company purchases natural gas, primarily to generate electricity, and purchases electric power to supplement internal generation. In addition, the Company produces a portion of its electricity needs in Louisiana and Texas; Alberta, Canada; The Netherlands; the United Kingdom; and Germany. \nThe Company's primary source of these raw materials are natural gas liquids (\"NGLs\"), which are derived from natural gas and crude oil production, and naphtha, which is produced during the processing and refining of crude oil. Given recent advancements in shale gas, shale oil and conventional drilling techniques, the Company expects these raw materials to be in abundant supply. The Company's suppliers of these raw materials include regional, international and national oil and gas companies.\nThe Company purchases raw materials on both short- and long-term contracts. The Company had adequate supplies of raw materials in 2024 and expects to continue to have adequate supplies of raw materials in 2025.\nINDUSTRY SEGMENTS AND GEOGRAPHIC REGION RESULTS\nSee Note 25 to the Consolidated Financial Statements for information regarding Dow's chief operating decision maker, net sales, significant segment expenses, Operating EBIT and total assets by segment, as well as net sales and long-lived assets by geographic region.\nSIGNIFICANT CUSTOMERS AND PRODUCTS\nAll products and services are marketed primarily through the Company’s sales force, although in some instances more emphasis is placed on sales through distributors. In 2024, no significant portion of the Company's sales was dependent upon a single customer.\nPATENTS, LICENSES AND TRADEMARKS\nThe Company continually applies for and obtains U.S. and foreign patents and has a substantial number of pending patent applications throughout the world. At December 31, 2024, the Company owned approximately 4,000 active U.S. patents and 27,000 active foreign patents as follows:\n \nRemaining Life of Patents Owned at Dec 31, 2024\nUnited States\nRest of World\nWithin 5 years\n700 \n4,200 \n6 to 10 years\n1,400 \n9,200 \n11 to 15 years\n1,500 \n12,200 \n16 to 20 years\n400 \n1,400 \nTotal\n4,000 \n27,000 \nThe Company’s primary purpose in obtaining patents is to protect the results of its research for use in operations and licensing. The Company is party to a substantial number of patent licenses, including intellectual property cross-license agreements and other technology agreements, and also has a substantial number of trademarks and \n14\nTable of Contents\ntrademark registrations in the United States and in other countries, including the “Dow in Diamond” trademark. Although the Company considers that its patents, licenses and trademarks in the aggregate constitute a valuable asset, it does not regard its business as being materially dependent on any single or group of related patents, licenses or trademarks.\nPRINCIPAL PARTLY OWNED COMPANIES\nThe Company’s principal nonconsolidated affiliates at December 31, 2024, including direct and indirect ownership interest for each, are listed below:\nPrincipal Nonconsolidated Affiliate\nCountry\nOwnership Interest\nBusiness Description\nEQUATE Petrochemical Company K.S.C.C. \nKuwait\n42.50 \n%\nManufactures ethylene, polyethylene and ethylene glycol, and manufactures and markets monoethylene glycol, diethylene glycol and polyethylene terephthalate resins\nThe Kuwait Olefins Company K.S.C.C. \nKuwait\n42.50 \n%\nManufactures ethylene and ethylene glycol\nThe Kuwait Styrene Company K.S.C.C.\nKuwait\n42.50 \n%\nManufactures styrene monomer\nMap Ta Phut Olefins Company Limited \n1\nThailand\n32.77 \n%\nManufactures propylene and ethylene\nSadara Chemical Company \n2\nSaudi Arabia\n35.00 \n%\nManufactures chlorine, ethylene, propylene and aromatics for internal consumption and manufactures and sells polyethylene, ethylene oxide and propylene oxide derivative products, and isocyanates\nThe SCGC-Dow Group:\nSiam Polyethylene Company Limited\nThailand\n50.00 \n%\nManufactures polyethylene\nSiam Polystyrene Company Limited\nThailand\n50.00 \n%\nManufactures polystyrene\nSiam Styrene Monomer Company Limited\nThailand\n50.00 \n%\nManufactures styrene monomer\nSiam Synthetic Latex Company Limited\nThailand\n50.00 \n%\nManufactures latex and specialty elastomers\n1.\nThe Company's effective ownership of Map Ta Phut is 32.77 percent, of which the Company directly owns 20.27 percent and indirectly owns 12.50 percent through its equity interest in Siam Polyethylene Company Limited.\n2.\nThe Company is responsible for marketing a significant portion of Sadara products outside of the Middle East zone through the Company's established sales channels. Under this arrangement, the Company purchases and sells Sadara products for a marketing fee. In 2021, Dow and the Saudi Arabian Oil Company agreed to a marketing rights transition plan. Execution of the transition plan is ongoing and progressing towards aligning marketing rights and responsibilities to levels more consistent with each partner's equity ownership. \nSee Note 11 to the Consolidated Financial Statements for additional information regarding nonconsolidated affiliates.\nCOMMITMENT TO SUSTAINABILITY\nDow believes its purpose is to deliver a sustainable future through its materials science and collaboration with its partners. That is why Dow is actively aligning its business and sustainability strategy, operational footprint, product offerings and technologies to unlock new sustainable growth opportunities within the markets it serves and deliver long-term value to its stakeholders.\nThe following four areas are critical for Dow to consistently deliver responsible, best-in-class performance and value growth:\nProtecting the Climate\nClimate change is a critical challenge to the world and Dow’s business. Dow embraces its responsibility to help reduce global GHG emissions and the impacts of climate change on natural ecosystems. Dow’s approach to climate protection includes efforts to both mitigate and adapt to climate change.\nAdvancing a Circular Economy and Safer Materials\nDow is continuously looking for better ways to make, use and reuse materials, to help keep them out of the environment and retain their value for as long as possible in support of a sustainable future. Dow believes in considering the total impact of a product over its life cycle, including factors such as demands and impacts on nature, GHG, performance, longevity and end of life, while also working to extend the lifespan of materials.\n15\nTable of Contents\nDow is focused on utilizing its strong innovation pipeline to develop safer materials or reduce or eliminate priority substances in its products. The Company also invests in upstream manufacturing technologies to reduce facility emissions and, where necessary, restricts downstream uses of some substances.\nCultivating a Thriving Team and Community\nDow is committed to lead with inclusion, elevate its focus on diversity and embed equity into its practices, policies and processes for breakthrough results. The Company supports an innovative, sustainable and inclusive future where its communities can thrive, everyone has equitable access to careers in science, technology, engineering and math and skilled trades, and employees are empowered to accelerate change.\nDriving Accountability and Best-in-Class Performance\nDow exercises strong corporate governance through transparency, risk management, effective leadership, ethical compliance and behavior, and stakeholder feedback and management. Dow’s approach to corporate governance is centered on its core values and helps create and maintain a culture that supports long-term success, strengthens decision-making and builds trust in the Company. Dow’s leadership starts with its experienced and highly skilled Board of Directors (\"Board\"). Among other duties, the Board oversees and guides the Company’s strategy, environmental, social and governance priorities, and risk management to help promote the creation of long-term value for its shareholders.\nDow has implemented and continues to expand on its multi-decade targets intended to put the Company on a path to achieve a sustainable future, which include the following:\n•\nBy 2030:\n◦\nDow will reduce its net annual Scope 1 and 2 CO\n2\ne emissions by 5 million metric tons compared with its 2020 baseline, representing a 15 percent reduction from 2020 and a 30 percent reduction in GHG emissions since 2005.\n◦\nDow will implement a robust land management strategy. Its top 20 water-dependent sites will have water stewardship plans, and 10 of those sites will be water-resilient. \n◦\nDow will transform plastic waste and other forms of alternative feedstock to commercialize 3 million metric tons of circular and renewable solutions annually.\n•\nBy 2035:\n◦\nAll Dow sites will have water stewardship plans.\n•\nBy 2050:\n◦\nDow intends to be carbon neutral (Scopes 1+2+3, plus product benefits).\n◦\nDow will partner to conserve 50,000 acres of habitat and its top 20 water-dependent sites will be water-resilient.\nThe Company's progress in achieving these targets is reviewed regularly by management and with the Environment, Health, Safety & Technology (\"EHS&T\") Committee of the Board.\nAdditional discussion of matters pertaining to sustainability, including the Company's actions related to sustainability, is included in Part I, Item 1A. Risk Factors; Part II, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations; and Notes 1, 4 and 15 to the Consolidated Financial Statements. In addition, detailed information on the Company's performance regarding sustainability matters and goals, including the Company's annual INtersections Report, is accessible through Dow's Investors webpage at \nwww.dow.com/investors\n. Dow's website and its content are not deemed incorporated by reference into this report.\nHUMAN CAPITAL\nDow’s ambition – to be the most innovative, customer-centric, inclusive and sustainable materials science company in the world – starts with people. Dow employees create innovative and sustainable materials science solutions to advance the world. Every answer starts with asking the right questions, which is why the diverse, dedicated Dow team collaborates with customers and other stakeholders to find solutions to the world's toughest challenges. The Company's values of Respect for People, Integrity and Protecting Our Planet are fundamental beliefs that are ingrained in each action taken, can never be compromised and are the foundation of the Company's Code of Conduct.\n16\nTable of Contents\nThe Company is dedicated to employee health and safety and is invested in fostering a culture of inclusion and continuous learning while supporting its employees through its Total Rewards plans and programs to ensure all Dow employees are respected, valued and encouraged to make their fullest contribution. \nSafety, Employee Health and Well-Being\nA commitment to safety and employee health is ingrained in Dow’s culture and central to how the Dow team works. Dow uses a comprehensive, integrated operating discipline management system that includes policies, requirements, best practices and procedures associated with health and safety. In 2024, the Company achieved an Occupational Safety and Health Administration Total Recordable Injury and Illness Rate of 0.18, based upon the number of incidents per 200,000 work hours for employees and contractors globally. This measure, along with a consistent set of globally applied, as well as locally defined, leading indicators of safety performance, are cornerstones of Dow's worker protection program. The Company maintains a robust, globally tracked near-miss program for situations that did not result in an injury, but could have been high consequence had circumstances been slightly different. This data is reviewed regularly by management and the EHS&T Committee of the Board, is visible to all employees and is built into digital dashboards that include actual injury information for every Dow location around the world. \nAs part of the Company’s total worker health strategy, employees have access to occupational health services at no cost through on-site, Company-managed clinics at its manufacturing locations or an offsite provider overseen by Dow Occupational Health. In addition to access for occupational health needs, the Company also has a comprehensive well-being strategy, which is framed across four dimensions – physical, mental, community and financial well-being – for an approach that is holistic, global, employee centered and outcome-driven. Key ambitions across the four dimensions focus on elements such as workplace stress, psychological safety, resiliency, workload, healthy eating and activities, and social community and inclusion opportunities.\nDow maintains active Crisis Management Teams at the corporate level and in each region where the Company operates to ensure appropriate plans are in place in the event of natural disasters or other emergencies.\nInclusion, Diversity & Equity\nAt Dow, inclusion, diversity and equity (“ID&E”) is a business imperative evidenced by inclusion serving as a core pillar of the Company's ambition statement. A strategic and intentional focus on ID&E not only enhances the employee experience and satisfaction, but it also supports innovation, customer experience and understanding of the communities the Company serves. In 2024, Dow advanced to #3 on the Fair360 Top 50 Companies list, remaining in the top 10 for the second consecutive year. Additionally, for the fourth year in a row, Dow was recognized on the \nFortune\n 100 Best Companies to Work For\n®\n list. These are significant accomplishments that represent only two of the many awards the Company received related to its efforts in ID&E. \nDow's strategic ID&E efforts are directed by its Chief Inclusion Officer and Office of Inclusion, which supports implementation throughout Dow’s businesses, functions and regions. Three Inclusion Councils drive the ID&E strategy from the top of the Company down and across the enterprise:\n•\nThe President’s Inclusion Council defines and supports Dow's ID&E strategy from the top.\n•\nA Senior Leaders’ Inclusion Council influences change through senior and mid-level business, geographic and functional leaders.\n•\nA Joint Inclusion Council collaborates to drive maximum employee engagement through Employee Resource Group (“ERG”) leadership. \nDow’s 10 ERGs represent a workforce rich in diversity of thought, perspectives and backgrounds. Dow’s ERGs help develop a high-performance workplace culture and cultivate a positive employee experience that supports business growth. ERG participation is voluntary and open to the Company's total workforce with strong allyship representation. Senior leaders serve as executive sponsors for each ERG. In addition, Dow has a Paid Time Off Policy which provides employees time off to volunteer and engage in ERG activities. In 2024, 61 percent of Dow’s workforce and 97 percent of Dow people leaders participated in at least one ERG. \nInclusion and diversity metrics, including global spend with certified diverse suppliers, global representation of women and U.S. ethnic minority representation, are embedded in the performance award bonus program for over 3,000 leaders. The results are published internally on a quarterly basis and reviewed regularly by management with the Compensation and Leadership Development Committee of the Board.\n17\nTable of Contents\nGlobal pay disparity studies have been conducted at Dow for over 20 years to assess fair treatment between genders and between U.S. ethnic minorities and non-minorities and to ensure Dow’s pay practices are being implemented as intended. The results have been publicly disclosed within the Company's annual INtersections Report. As part of Dow’s ID&E efforts, the Company will continue to conduct annual pay gap studies and actively engage with an external partner to further develop and continue to apply best practices.\nTotal Rewards\nTo achieve Dow’s ambition, the Company invests in its people, who are at the heart of the Company, through its Total Rewards plans and programs. The Total Rewards plans and programs are structured to attract, retain and motivate Dow’s employees. Dow’s Total Rewards are designed to support all aspects of its employees – their compensation, future, health, life and career. The Company is committed to aligning its strategy and culture with the needs of its employees and optimizing the investment Dow makes in Total Rewards. \nAs a global company with a diverse team, Dow aims to ensure employees have access to resources that allow them to meet their unique needs. That is why Dow has established three guiding principles that define its Total Rewards strategy: 1) ensuring programs are market competitive; 2) providing employees with offerings that align with their preferences to promote their financial, mental and physical well-being; and 3) offering programs that drive a performance-oriented, results-based culture that enables long-term shareholder value creation. Dow adapts its programs for geography-specific requirements, as well as cultural standards and expectations.\nEmployee Engagement, Learning and Development\nThroughout an employee’s career, the Company supports development through a blend of learning approaches including in-person and virtual trainings, digital learning platforms, on-the-job training and a series of leadership development programs. The Company launched a new skills framework in 2024. The skills framework is aligned to enterprise competencies that support Dow's ambition. Additionally, the skills-valued focus increases the transparency of skills needed for current and future jobs and is embedded in talent practices to support employee growth, development and skill building for evolving business needs.\nAnnually, all employees have the opportunity to provide feedback on employee experience and offer insights into how to improve Dow’s working culture through a global employee opinion survey. A key component of the survey is an opportunity for employees to provide feedback on the effectiveness of their direct leader. In 2024, 73 percent of employees responded to the annual survey. The feedback received through this annual survey and additional quarterly checkpoint surveys is used to drive actions to improve the overall Dow experience for employees across the Company, as well as to support continuous improvement in leader effectiveness.\n18\nTable of Contents\nAt December 31, 2024, the Company permanently employed approximately 36,000 people on a full-time basis. \n \n \n*\nU.S. ethnic minorities include employees who self-identify as American Indian or Alaskan Native, Asian, Black or African American, Hispanic or Latino, Native Hawaiian or other Pacific Islander, or two or more races. Employees who self-identify as White are considered U.S. Non-Minority.\nAdditional information regarding Dow’s human capital measures can be found in the Company's annual INtersections Report, as well as Dow's U.S. Equal Employment Opportunity Report (EEO-1), accessible through the Inclusion and Diversity webpage at \nwww.dow.com/diversity\n. Dow’s website and its content are not deemed incorporated by reference into this report. \nOTHER ACTIVITIES\nThe Company engages in property and casualty insurance and reinsurance primarily through its Liana Limited subsidiaries.\n19\nTable of Contents\nEXECUTIVE OFFICERS OF THE REGISTRANT\nSet forth below is information related to the Company's executive officers as of February 4, 2025:\nName, Age\nPresent Position with Registrant\nYear Elected as Executive Officer of Dow Inc.\nOther Business Experience since January 1, 2020\nMarco ten Bruggencate, 51 \nPresident, Industrial Intermediates & Infrastructure\n2024\nDOW INC.:\n President, Industrial Intermediates & Infrastructure since December 2024.  \nTDCC:\n President, Industrial Intermediates & Infrastructure since December 2024.  \nDOW EUROPE GMBH:\n President, EMEAI\n1\n from July 2024 to December 2024; Commercial Vice President for Packaging & Specialty Plastics for Europe, Middle East, and Africa from November 2019 to July 2024. \nLisa Bryant, 49\nChief Human Resources Officer\n2022\nDOW INC.:\n Chief Human Resources Officer since November 2022.\nTDCC:\n Chief Human Resources Officer since November 2022; Senior Global Human Resources Director for Finance, Legal, Public Affairs, and Government Affairs from May 2020 to November 2022; North America Human Resources Director from February 2019 to May 2020.\nKaren S. Carter, 54\nChief Operating Officer\n2019\nDOW INC.:\n \nChief Operating Officer since December 2024;\n \nPresident, Packaging & Specialty Plastics from November 2022 to December 2024; Chief Human Resources Officer and Chief Inclusion Officer from April 2019 to November 2022.\nTDCC:\n \nChief Operating Officer since December 2024; President, Packaging & Specialty Plastics from November 2022 to December 2024; Chief Human Resources Officer from October 2018 to November 2022; Chief Inclusion Officer from July 2017 to November 2022.\nKeith Cleason, 58\nPresident, Packaging & Specialty Plastics\n2024\nDOW INC.:\n President, Packaging & Specialty Plastics since December 2024.       \nTDCC:\n President, Packaging & Specialty Plastics since December 2024; Business Vice President for Olefins, Aromatics & Alternatives and Univation Technologies from July 2018 to December 2024.\nAndrea L. Dominowski, 50\nController and Vice President of Controllers\n2024\nDOW INC.:\n Controller and Vice President of Controllers since February 2024.\nTDCC:\n \nController and Vice President of Controllers since February 2024; Global Business Director for Silicone Feedstocks & Intermediates from August 2020 to February 2024; Regional Finance Director for North America from January 2018 to August 2020.\nJim Fitterling, 63\nChair and Chief Executive Officer\n2018\nDOW INC.:\n Chair since April 2020; Chief Executive Officer since August 2018.\nTDCC:\n \nChair since April 2020; Chief Executive Officer since July 2018.\nBrendy Lange, 41\nPresident, Performance Materials & Coatings\n2024\nDOW INC.:\n President, Performance Materials & Coatings since April 2024.\nTDCC:\n President, Performance Materials & Coatings since April 2024; Business Vice President, Dow Industrial Solutions from February 2020 to April 2024; Global Business Director, Dow Industrial Solutions from January 2017 to February 2020.\nJohn M. Sampson, 64\nSenior Vice President, Operations, Manufacturing & Engineering\n2021\nDOW INC.:\n \nSenior Vice President, Operations, Manufacturing & Engineering since October 2020.\nOLIN CORPORATION:\n \nExecutive Vice President, Business Operations from April 2019 to September 2020.\nA. N. Sreeram, 57\nSenior Vice President of Research & Development and Chief Technology Officer\n2019\nDOW INC.:\n Senior Vice President of Research & Development and Chief Technology Officer since April 2019.\nTDCC:\n Chief Technology Officer since October 2015; Senior Vice President of Research & Development since August 2013.\nJeffrey L. Tate, 55\nChief Financial Officer \n2023\nDOW INC.:\n Chief Financial Officer since November 2023.\nTDCC:\n Chief Financial Officer since November 2023.\nLEGGETT & PLATT INCORPORATED:\n Executive Vice President and Chief Financial Officer from September 2019 to June 2023.\nAmy E. Wilson, 54\nGeneral Counsel and Corporate Secretary\n2018\nDOW INC.:\n General Counsel and Corporate Secretary since April 2019.\nTDCC:\n General Counsel since October 2018; Corporate Secretary since February 2015.\n1.\nEurope, Middle East, Africa and India.\n20\nTable of Contents",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nSTATEMENT ON CURRENCY EXCHANGE RATES\nThe Company's global business operations give rise to market risk exposure related to changes in foreign currency exchange rates and international capital flows that may be affected by extensive regulations and controls, especially in developing or highly inflationary countries such as Argentina. The Company continues to monitor these situations and take appropriate actions as necessary to manage the financial impact pursuant to established guidelines and policies. If the Company is unable to manage certain exposures in a cost-effective manner it could have a significant negative impact on its future results of operations and cash flows. A detailed discussion of these and other principal risks and uncertainties, which may negatively impact the future results of the Company, are included in Part I, Item 1A. Risk Factors.\nTable of Contents\nPage\nAbout Dow\n32\nOverview\n33\nResults of Operations\n35\nSegment Results\n38\nPackaging & Specialty Plastics\n39\nIndustrial Intermediates & Infrastructure\n39\nPerformance Materials & Coatings\n40\nCorporate\n40\nOutlook\n41\nLiquidity and Capital Resources\n42\nOther Matters\n50\nCritical Accounting Estimates\n50\nEnvironmental Matters\n53\nAsbestos-Related Matters of Union Carbide Corporation\n60\nABOUT DOW\nDow is one of the world’s leading materials science companies, serving customers in high-growth markets such as packaging, infrastructure, mobility and consumer applications. The Company's global breadth, asset integration and scale, focused innovation, leading business positions and commitment to sustainability enables the Company to achieve profitable growth and help deliver a sustainable future. Dow operates manufacturing sites in 30 countries and employs approximately 36,000 people. \nIn 2024, the Company had net sales of $43 billion, of which 38 percent were to customers in the U.S. & Canada; 33 percent were in Europe, Middle East, Africa and India (\"EMEAI\"); while the remaining 29 percent were to customers in Asia Pacific and Latin America.\nIn 2024, the Company and its consolidated subsidiaries did not operate in countries subject to U.S. economic sanctions and export controls as imposed by the U.S. State Department or in countries designated by the U.S. State Department as state sponsors of terrorism, including Cuba, Iran, the Democratic People's Republic of Korea (North Korea) and Syria. The Company has policies and procedures in place designed to ensure that it and its consolidated subsidiaries remain in compliance with applicable U.S. laws and regulations. \n32\nTable of Contents\nOVERVIEW\nThe following is a summary of the results for the Company for the year ended December 31, 2024:\nThe Company reported net sales in 2024 of $43 billion, down 4 percent from $45 billion in 2023, with decreases across all geographic regions, and driven by a decrease in local price of 4 percent. Net sales decreased in Packaging & Specialty Plastics (down 6 percent) and Industrial Intermediates & Infrastructure (down 5 percent), partially offset by an increase in Performance Materials & Coatings (up 1 percent).\nLocal price decreased 4 percent compared with 2023, with decreases in all operating segments and geographic regions. Local price decreased in Packaging & Specialty Plastics (down 4 percent), Industrial Intermediates & Infrastructure (down 6 percent) and Performance Materials & Coatings (down 3 percent).\nVolume was flat compared with 2023 and mixed by operating segment, with a decrease in Packaging & Specialty Plastics (down 2 percent) offset by increases in Industrial Intermediates & Infrastructure (up 1 percent) and Performance Materials & Coatings (up 5 percent). Volume increased in the U.S. & Canada (up 2 percent), decreased in Latin America (down 1 percent), and was flat in EMEAI and Asia Pacific. \nThe impact of currency on net sales was flat compared with 2023.\nRestructuring and asset related charges - net were $103 million in 2024 compared with $528 million in 2023, primarily reflecting restructuring actions approved by the Board in January 2023. The restructuring charges recognized in 2024 consisted of severance and related benefit costs of $41 million, asset write-downs and write-offs of $16 million and costs associated with exit and disposal activities of $9 million. In addition, the Company recognized pretax impairment charges of $37 million related to assets included in the divestiture of the Company's flexible packaging laminating adhesives business.\nEquity in losses of nonconsolidated affiliates was $6 million in 2024, compared with losses of $119 million in 2023, primarily driven by improved equity earnings at the Kuwait joint ventures driven from higher prices and volumes, improved results at the Sadara joint venture, partially offset by continued margin compression at the Thai joint ventures.\nSundry income (expense) - net for Dow Inc. and TDCC was income of $415 million and $404 million, respectively, in 2024, compared with expense of $280 million and $327 million, respectively, in 2023. Sundry income (expense) - net increased primarily due to lower foreign currency exchange losses and the absence of a one-time non-cash settlement charge related to the Company's pension de-risking activities in 2023. \nNet income available for Dow Inc. and TDCC common stockholder(s) was $1,116 million and $1,127 million, respectively, in 2024, compared with $589 million and $556 million, respectively, in 2023. Earnings per share for Dow Inc. was $1.57 per share in 2024, compared with $0.82 per share in 2023.\nIn 2024, Dow Inc. declared and paid dividends to common stockholders of $2.80 per share ($1,966 million).\nIn 2024, Dow Inc. repurchased $494 million of the Company's common stock.\nOther notable events and highlights from the year ended December 31, 2024 include: \n•\nOn January 25, 2024, the Company published its Green Finance Framework and related Second Party Opinion on its website, to support the execution of its sustainability strategy.\n•\nOn February 1, 2024, Andrea L. Dominowski became Controller and Vice President of Controllers.\n•\nOn February 9, 2024, TDCC issued $1.25 billion of senior unsecured notes in connection with the Company's Green Finance Framework.\n•\nOn April 2, 2024, the Company announced that Mauro Gregorio, President of Performance Materials & Coatings, elected to retire in the third quarter of 2024 after 40 years of service.\n•\nOn April 2, 2024, the Company announced that Brendy Lange, business vice president of Dow Industrial Solutions, was named President of Performance Materials & Coatings. \n33\nTable of Contents\n•\nOn May 16, 2024, the Company announced it will expand its Protect the Climate targets by setting distinct milestones for climate change mitigation that focus on water and nature conservation. Additional information can be found on the Company's website. \n•\nOn June 18, 2024, Dow Inc. released its INtersections Report, highlighting how the Company is advancing its ambition to be the most innovative, customer-centric, inclusive and sustainable materials science company in the world. Additional information can be found on the Company's website. \n•\nOn July 1, 2024, Ronald C. Edmonds, former Controller and Vice President of Controllers and Tax, elected to retire after 31 years of service.\n•\nOn July 1, 2024, Fitch Ratings affirmed TDCC's BBB+ and F1 rating, and its outlook of stable. Additionally, on July 1, 2024, Standard & Poor's affirmed TDCC's BBB and A-2 rating, and its outlook of stable.\n•\nOn August 1, 2024, the Company acquired Circulus Holdings, LLC, a U.S. mechanical recycling company that converts plastic waste into post-consumer resin, for approximately $130 million.\n•\nOn August 6, 2024, Moody's Ratings affirmed TDCC's Baa1 and P-2 rating, and its outlook of stable.\n•\nOn October 24, 2024, the Company announced that it will complete a strategic review of select assets in Europe, primarily certain polyurethanes assets within the Industrial Intermediates & Infrastructure segment, as part of an effort to continue to optimize its global asset footprint.\n•\nOn October 28, 2024, Moody's Ratings re-affirmed TDCC's Baa1 and P-2 rating and revised its outlook to negative from stable.\n•\nOn December 2, 2024, the Company completed the sale of its flexible packaging laminating adhesives business, within the Packaging & Specialty Plastics segment, to Arkema S.A. for cash proceeds of $115 million, net of working capital adjustments, costs to sell and other transaction expenses and subject to customary post-closing adjustments.\n•\nOn December 3, 2024, the Company announced that Karen Carter, President of Packaging & Specialty Plastics, had been named Chief Operating Officer.\n•\nOn December 4, 2024, the Company announced that Keith Cleason had been named President of Packaging & Specialty Plastics.\n•\nOn December 4, 2024, the Company announced that Jane Palmieri, President of Industrial Intermediates & Infrastructure, had elected to retire in March 2025 after 30 years of service with Dow.\n•\nOn December 4, 2024, the Company announced that Marco ten Bruggencate had been named President of Industrial Intermediates & Infrastructure.\n•\nOn December 8, 2024, the Company entered into a definitive agreement to sell a 40 percent equity stake in select U.S. Gulf Coast infrastructure assets to a fund managed by Macquarie Asset Management in exchange for cash proceeds of approximately $2.4 billion. Under the terms of the agreement, Macquarie Asset Management has the option to purchase up to an additional 9 percent equity stake in exchange for additional cash proceeds of up to $600 million.\n•\nOn December 9, 2024, Standard & Poor's re-affirmed TDCC's BBB and A-2 rating, and its outlook of stable. \n•\nDow was named on the Top 100 Global Innovators\n™\n list\n for the 13th consecutive year.\n•\nDow received a record-setting 12 2024 Edison Awards\n™\n (three gold, five silver and four bronze), once again earning more awards than any other organization for the seventh consecutive year. \n•\nDow was named to the JUST 100 list, placing 35th overall, a 20-place improvement from last year, and securing the top spot for Customers in the Chemicals sector. \n•\nDow earned a spot in the S&P Global Sustainability Yearbook, recognizing the Company as a top industry performer.\n•\nDow received six 2024 BIG Innovation Awards from the Business Intelligence Group\n™\n, the most received in a single Business Intelligence Group\n™\n Awards program by the Company.\n•\nDow was recognized with a 2024 CIO 100 Award, for the third consecutive year, for the Company's Integrated Data Hub.\n34\nTable of Contents\n•\nDow advanced to third place on the 2024 Fair360, formerly DiversityInc, Top 50 Companies for Diversity list making it the seventh consecutive year on the list. Dow was also included on 12 of Fair360's Specialty Lists including: Top Companies for Executive Fairness Councils, Top Companies for Board of Directors, Top Companies for Environmental, Social & Governance, Top Companies for Philanthropy, Top Companies for Supplier Fairness, Top Companies for Employee Resource Groups, Top Companies for Mentoring, Top Companies for Sponsorship, Top Companies for People with Disabilities, Top Companies for Latino Executives, Top Companies for Asian American Executives and Top Companies for LGBTQ+ Employees.\n•\nDow received six prestigious 2024 SEAL (Sustainability, Environmental Achievement and Leadership) Business Sustainability Awards. Dow's DOWSIL\n™\n ACP-3089 Antifoam Compound and Dow's SILASTIC\n™\n STT 2650 Self Sealing Silicone each received a SEAL Sustainable Innovation Award. Dow's DOWSIL\n™\n 2080, DOWSIL\n™\n IE-9100, DOWSIL\n™\n 991 and SILASTIC\n™\n STT 2650 each received a SEAL Sustainable Product Award.\n•\nFor the eighth consecutive year, Dow received a top score on the Disability Equality Index\n®\n, placing the Company among the Best Places to Work for Disability Inclusion\n®\n for 2024.\n•\nDow was named one of the 2024 PEOPLE\n®\n Companies that Care by Great Place to Work\n®\n and PEOPLE\n®\n for the fifth consecutive year.\n•\nDow was honored by Great Place to Work\n®\n and Fortune as one of the World's Best Workplaces. Dow was also certified as a Great Place to Work\n®\n in 15 countries and ranked on eight national Best Workplaces lists, including the Fortune 100 Best Companies to Work For\n®\n list in the United States for the fourth consecutive year.\n•\nDow was named to the Dow Jones Sustainability World Index by S&P Dow Jones Indices, the world's leading index provider focused on providing essential sustainability intelligence. This is the 24th year Dow has achieved this prestigious ranking.\n•\nDow received the first place spot on the Best Workplace in Manufacturing and Production list by Great Place to Work\n®\n and Fortune. This is the fourth consecutive year Dow has been named to this prestigious list and the first time atop the ranking.\nIn addition to the highlights above, the following events occurred subsequent to December 31, 2024:\n•\nOn January 27, 2025, the Dow Inc. Board approved targeted actions to further achieve the Company's cost reduction initiatives in response to ongoing macroeconomic uncertainty, including a workforce reduction of approximately 1,500 roles.\nRESULTS OF OPERATIONS\nFor comparison of results of operations for the fiscal years ended December 31, 2023 and 2022, see Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on January 31, 2024.\nNet Sales\nThe following tables summarize net sales and sales variances by operating segment and geographic region from the prior year:\nSummary of Sales Results\n \nIn millions\n2024\n2023\nNet sales\n$\n42,964 \n$\n44,622 \n35\nTable of Contents\nSales Variances by Operating Segment and Geographic Region\n2024\n2023\nPercentage change from prior year\nLocal Price & Product Mix\nCurrency\nVolume\nTotal\nLocal Price & Product Mix\nCurrency\nVolume\n \nTotal\nPackaging & Specialty Plastics\n(4)\n%\n— \n%\n(2)\n%\n(6)\n%\n(16)\n%\n— \n%\n(5)\n%\n(21)\n%\nIndustrial Intermediates & Infrastructure\n(6)\n— \n1 \n(5)\n(14)\n(1)\n(9)\n(24)\nPerformance Materials & Coatings\n(3)\n(1)\n5 \n1 \n(15)\n(1)\n(5)\n(21)\nTotal\n(4)\n%\n— \n%\n— \n%\n(4)\n%\n(16)\n%\n— \n%\n(6)\n%\n(22)\n%\nTotal, excluding the Hydrocarbons & Energy business\n(5)\n%\n— \n%\n3 \n%\n(2)\n%\n(15)\n%\n(1)\n%\n(4)\n%\n(20)\n%\nU.S. & Canada\n(3)\n%\n— \n%\n2 \n%\n(1)\n%\n(15)\n%\n— \n%\n(6)\n%\n(21)\n%\nEMEAI\n(4)\n— \n— \n(4)\n(17)\n— \n(9)\n(26)\nAsia Pacific\n(6)\n(1)\n— \n(7)\n(14)\n(2)\n(4)\n(20)\nLatin America\n(5)\n— \n(1)\n(6)\n(17)\n— \n4 \n(13)\nTotal\n(4)\n%\n— \n%\n— \n%\n(4)\n%\n(16)\n%\n— \n%\n(6)\n%\n(22)\n%\n2024 Versus 2023\nThe Company reported net sales of $43.0 billion in 2024, down 4 percent from $44.6 billion in 2023, with local price down 4 percent, and volume and currency both flat. Net sales decreased across all operating segments except Performance Materials & Coatings, and across all geographic regions. Local price decreased in all operating segments and across all geographic regions driven by industry supply and demand dynamics and lower global energy and feedstock costs. Local price decreased in Packaging & Specialty Plastics (down 4 percent), Industrial Intermediates & Infrastructure (down 6 percent) and Performance Materials & Coatings (down 3 percent). Volume increased 2 percent in the U.S. & Canada, decreased 1 percent in Latin America and was flat in EMEAI and Asia Pacific. Volume decreased in Packaging & Specialty Plastics (down 2 percent) and increased in Industrial Intermediates & Infrastructure (up 1 percent) and Performance Materials & Coatings (up 5 percent). Excluding the Hydrocarbons & Energy business, sales decreased 2 percent.\nCost of Sales\nCost of sales (\"COS\") was $38.4 billion in 2024, compared with $39.7 billion in 2023. COS decreased in 2024 primarily due to lower raw material costs, lower global energy and feedstock costs, and the impact of structural cost improvements, partially offset by increased planned maintenance turnaround spending. COS as a percentage of net sales was 89.3 percent in 2024, compared with 89.1 percent in 2023. The increase in COS as a percentage of net sales was driven by the impact of lower local price on flat net sales volume.\nResearch and Development Expenses\nResearch and development (\"R&D\") expenses were $810 million in 2024, compared with $829 million in 2023. R&D expenses decreased in 2024 primarily due to lower performance-based compensation costs.\nSelling, General and Administrative Expenses\nSelling, general and administrative (\"SG&A\") expenses were $1,581 million in 2024, compared with $1,627 million in 2023. SG&A expenses decreased in 2024 primarily due to lower performance-based compensation costs, as well as lower fringe benefit expenses resulting from the U.S. pension plan freeze, which more than offset an increase in bad debt expense, including expense incurred as a result of a resolution of a customer dispute.\nAmortization of Intangibles\nAmortization of intangibles was $310 million in 2024, compared with $324 million in 2023. Amortization of intangibles decreased primarily due to the reduction in the intangible asset base, resulting primarily from the write-off of an intangible asset, certain intangible asset write-offs related to the divestiture of the Company's flexible packaging laminating adhesives business and certain intangible assets becoming fully amortized in 2024. See Note 12 to the Consolidated Financial Statements for additional information on intangible assets.\n36\nTable of Contents\nRestructuring and Asset Related Charges - Net \n2023 Restructuring Program\nOn January 25, 2023, the Board approved restructuring actions to achieve the Company's structural cost improvement initiatives in response to the continued economic impact from the global recessionary environment and to enhance its agility and long-term competitiveness across the economic cycle. These actions are expected to be substantially complete by the end of the first quarter of 2025.\nAs a result of these actions, in 2023 the Company recorded pretax restructuring charges of $535 million, consisting of severance and related benefit costs of $344 million and asset write-downs and write-offs of $191 million. The restructuring charges by segment were as follows: $1 million in Packaging & Specialty Plastics, $50 million in Industrial Intermediates & Infrastructure, $49 million in Performance Materials & Coatings and $435 million in Corporate. These charges were partially offset by other asset related credit adjustments of $7 million in Corporate related to a prior restructuring program. See Note 5 to the Consolidated Financial Statements for additional information.\nIn 2024, the Company recorded pretax restructuring charges of $66 million, consisting of severance and related benefit costs of $41 million, asset write-downs and write-offs of $16 million and costs associated with exit and disposal activities of $9 million. The restructuring charges by segment were as follows: $8 million in Industrial Intermediates & Infrastructure, $7 million in Performance Materials & Coatings and $51 million in Corporate. In addition, the Company recognized pretax impairment charges of $37 million related to assets included in the divestiture of the Company's flexible packaging laminating adhesives business and related to Packaging & Specialty Plastics. See Note 5 to the Consolidated Financial Statements for additional information.\nEquity in Earnings (Losses) of Nonconsolidated Affiliates\nThe Company’s share of equity in losses of nonconsolidated affiliates was $6 million in 2024, compared with losses of $119 million in 2023, driven primarily by improved equity earnings at the Kuwait joint ventures from higher prices and volumes and improved results at the Sadara joint venture, partially offset by margin compression from softer demand at the Thai joint ventures.\nSundry Income (Expense) - Net\nSundry income (expense) – net includes a variety of income and expense items such as foreign currency exchange gains and losses, dividends from investments, gains and losses on sales of investments and assets, non-operating pension and other postretirement benefit plan credits or costs, losses on early extinguishment of debt and certain litigation matters. \nSundry income (expense) - net for 2024 was income of $415 million and $404 million for Dow Inc. and TDCC, respectively, compared with expense of $280 million and $327 million for Dow Inc. and TDCC, respectively, in 2023. In 2024, sundry income (expense) - net included non-operating pension and postretirement benefit plan credits and gains on the sales of assets and investments, which were partially offset by foreign currency exchange losses. In 2023, sundry income (expense) - net included a $642 million non-cash settlement charge related to the purchase of nonparticipating group annuity contracts for certain pension plans (related to Corporate) and foreign currency exchange losses, including $109 million related to the December 2023 devaluation of the Argentine peso (related to Corporate), which were partially offset by non-operating pension and postretirement benefit plan credits, a $106 million gain associated with a legal matter with Nova Chemicals Corporation (related to Packaging & Specialty Plastics), and gains on the sales of assets and investments. See Notes 6, 15, 19 and 25, to the Consolidated Financial Statements for additional information.\nIn 2024 and 2023, in addition to the amounts previously discussed above for TDCC, sundry income (expense) - net for Dow Inc. included net gains of $13 million and $42 million, respectively, associated with agreements and matters with DuPont de Nemours, Inc. (\"DuPont\") and Corteva, Inc. (\"Corteva\") (related to Corporate).\nInterest Expense and Amortization of Debt Discount\nInterest expense and amortization of debt discount was $811 million in 2024, compared with $746 million in 2023. The increase in interest expense is primarily due to $1.25 billion of senior unsecured notes issued in connection with the Green Finance Framework in the first quarter of 2024 and borrowings outside of the United States. See Liquidity and Capital Resources in Management's Discussion and Analysis of Financial Condition and Results of Operations and Note 14 to the Consolidated Financial Statements for additional information related to debt financing activity.\n37\nTable of Contents\nProvision (Credit) for Income Taxes\nThe Company's effective tax rate fluctuates based on, among other factors, where income is earned, the level of income relative to tax attributes and the level of equity earnings, since most earnings from the Company's equity method investments are taxed at the joint venture level. The underlying factors affecting the Company's overall tax rate are summarized in Note 7 to the Consolidated Financial Statements.\nThe Company reported a tax provision of $399 million in 2024, resulting in an effective tax rate of 24.9 percent, compared with a tax credit of $4 million in 2023, resulting in an effective tax rate of negative 0.6 percent. The provision for income taxes and higher effective tax rate for 2024 was primarily due to the geographic mix of earnings, partially offset by adjustments and the reassessment of interest and penalties on a tax matter in foreign jurisdictions.\nThe credit for income taxes and lower effective tax rate in 2023 were primarily due to low pretax income, the geographic mix of earnings and increases in tax basis in assets located in foreign jurisdictions, partially offset by changes in uncertain tax positions in various jurisdictions.\nThe Company continues to monitor and evaluate legislative developments related to the Global Anti-Base Erosion Proposal (\"GloBE\") established by the Organization of Economic Cooperation and Development’s (\"OECD\") Pillar Two framework. Several countries in which the Company operates have adopted those rules into their legislation and several others are expected to implement in the future. To date, such legislation has not materially impacted the Company's effective tax rate. The Company continues to evaluate impacts as further guidance is released. \nNet Income Attributable to Noncontrolling Interests \nNet income attributable to noncontrolling interests was $85 million in 2024, compared with $71 million in 2023. See Notes 18 and 23 to the Consolidated Financial Statements for additional information. \nNet Income Available for Common Stockholder(s)\nDow Inc.\nNet income available for Dow Inc. common stockholders was $1,116 million in 2024, compared with $589 million in 2023. Earnings per share of Dow Inc. was $1.57 per share in 2024, compared with $0.82 per share in 2023. See Note 8 to the Consolidated Financial Statements for details on Dow Inc.'s earnings per share calculations.\nTDCC\nNet income available for the TDCC common stockholder was $1,127 million in 2024, compared with $556 million in 2023. TDCC's common shares are owned solely by Dow Inc.\nSEGMENT RESULTS\nThe Company conducts its worldwide operations through six global businesses which are organized into the following operating segments: Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure and Performance Materials & Coatings. Corporate contains the reconciliation between the totals for the operating segments and the Company's totals. The Company did not aggregate any operating segments when determining its reportable segments. The Company reports geographic information for the following regions: U.S. & Canada, EMEAI, Asia Pacific and Latin America. The Company transfers ethylene to its downstream derivative businesses at market prices. See Part I, Item 1. Business for further discussion of the Company's segments.\nDow’s measure of profit/loss for segment reporting purposes is Operating EBIT as this is the manner in which the chief executive officer, chief operating officer, chief financial officer, general counsel and corporate secretary, and senior vice president of corporate development, together the \"executive committee\" and chief operating decision maker (\"CODM\"), assesses performance and allocates resources. The CODM compares quarterly results to both the year-ago and sequential periods to assess performance and allocate resources to each segment. The Company defines Operating EBIT as earnings (i.e., \"Income before income taxes\") before interest, excluding the impact of significant items. Operating EBIT by segment includes all operating items relating to the businesses; items that principally apply to Dow as a whole are assigned to Corporate. See Note 25 to the Consolidated Financial Statements for reconciliations of these measures.\n38\nTable of Contents\nFor comparison of segment results for the fiscal years ended December 31, 2023 and 2022, see Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on January 31, 2024\n.\nPACKAGING & SPECIALTY PLASTICS\nPackaging & Specialty Plastics\nIn millions\n2024\n2023\nNet sales\n$\n21,776 \n$\n23,149 \nOperating EBIT\n$\n2,373 \n$\n2,700 \nEquity earnings\n$\n81 \n$\n130 \nPackaging & Specialty Plastics\nPercentage change from prior year\n2024\n2023\nChange in Net Sales from Prior Period due to:\nLocal price & product mix\n(4)\n%\n(16)\n%\nCurrency\n— \n— \nVolume\n(2)\n(5)\nTotal\n(6)\n%\n(21)\n%\n2024 Versus 2023\nPackaging & Specialty Plastics net sales were $21,776 million in 2024, down 6 percent from net sales of $23,149 million in 2023, with local price down 4 percent, volume down 2 percent and currency flat. Local price decreased in Packaging and Specialty Plastics in all geographic regions, primarily driven by lower pricing of downstream polymers. Local price was flat in Hydrocarbons & Energy. Volume increased in Packaging and Specialty Plastics, primarily in EMEAI and the U.S. & Canada, due to higher downstream polymers and polyethylene demand. Volume decreased in Hydrocarbons & Energy in all geographic regions, led by EMEAI, primarily driven by higher internal derivative demand and lighter feedslate cracking. \nOperating EBIT was $2,373 million in 2024, down $327 million from Operating EBIT of $2,700 million in 2023. Operating EBIT decreased primarily due to lower selling prices, lower volumes in Hydrocarbons & Energy, higher planned maintenance costs, and the impact of an unplanned ethylene facility outage, which were partially offset by lower raw material, energy and feedstock costs.\nINDUSTRIAL INTERMEDIATES & INFRASTRUCTURE\nIndustrial Intermediates & Infrastructure\nIn millions\n2024\n2023\nNet sales\n$\n11,869 \n$\n12,538 \nOperating EBIT\n$\n125 \n$\n124 \nEquity losses\n$\n(102)\n$\n(276)\nIndustrial Intermediates & Infrastructure\nPercentage change from prior year\n2024\n2023\nChange in Net Sales from Prior Period due to:\nLocal price & product mix\n(6)\n%\n(14)\n%\nCurrency\n— \n(1)\nVolume\n1 \n(9)\nTotal\n(5)\n%\n(24)\n%\n2024 Versus 2023\nIndustrial Intermediates & Infrastructure net sales were $11,869 million in 2024, down 5 percent from $12,538 million in 2023, with local price down 6 percent, volume up 1 percent and currency flat. Local price \n39\nTable of Contents\ndecreased in both businesses and across all geographic regions, led by industrial and building and construction applications. Volume in Industrial Solutions increased, led by industrial and coatings applications, and in all geographic regions except the U.S. & Canada, which was flat, reflecting the impacts of an outage in 2023 at the Louisiana Operations Glycol-2 unit in Plaquemine, Louisiana, which successfully restarted in June 2024. Volume in Polyurethanes & Construction Chemicals decreased in all geographic regions, except EMEAI, driven by lower demand, particularly in consumer durables and industrial applications, which were partially offset by an increase in building and construction applications. \nOperating EBIT was $125 million in 2024, up $1 million from Operating EBIT of $124 million in 2023. Operating EBIT increased primarily due to lower raw material and feedstock costs and improved results at the EQUATE and Sadara joint ventures, which were offset by lower selling prices in both businesses and the impact of an outage in 2023 at the Louisiana Operations Glycol-2 unit in Plaquemine, Louisiana, which successfully restarted in June 2024.\nPERFORMANCE MATERIALS & COATINGS\nPerformance Materials & Coatings\nIn millions\n2024\n2023\nNet sales\n$\n8,574 \n$\n8,497 \nOperating EBIT\n$\n318 \n$\n219 \nEquity earnings\n$\n11 \n$\n20 \nPerformance Materials & Coatings\nPercentage change from prior year\n2024\n2023\nChange in Net Sales from Prior Period due to:\nLocal price & product mix\n(3)\n%\n(15)\n%\nCurrency\n(1)\n(1)\nVolume\n5 \n(5)\nTotal\n1 \n%\n(21)\n%\n2024 Versus 2023\nPerformance Materials & Coatings net sales were $8,574 million in 2024, up 1 percent from net sales of $8,497 million in 2023, with volume up 5 percent, local price down 3 percent and an unfavorable currency impact of 1 percent. Volume increased in both businesses. In Coatings & Performance Monomers, volume increased in all geographic regions except EMEAI, led by acrylic monomers. Volume increased in Consumer Solutions in all geographic regions, primarily in downstream silicones, led by consumer and electronics and home and personal care applications. Local price decreased in both businesses and was broad-based. In Coatings & Performance Monomers, local price decreased in all geographic regions except Asia Pacific, and in Consumer Solutions local price decreased in all geographic regions. Currency was flat in Coatings & Performance Monomers and had an unfavorable impact on sales in Consumer Solutions, driven by Asia Pacific.\nOperating EBIT was $318 million in 2024, up $99 million from Operating EBIT of $219 million in 2023. Operating EBIT increased primarily due to improved demand and higher operating rates, which were partially offset by lower selling prices and higher raw material costs.\nCORPORATE\nCorporate\nIn millions\n2024\n2023\nNet sales\n$\n745 \n$\n438 \nOperating EBIT\n$\n(228)\n$\n(265)\nEquity earnings\n$\n4 \n$\n7 \n40\nTable of Contents\n2024 Versus 2023\nNet sales for Corporate, which primarily relate to the Company's insurance operations, were $745 million in 2024, up from net sales of $438 million in 2023, largely driven by premiums received for insurance policies covering third parties.\nOperating EBIT was a loss of $228 million in 2024, compared with a loss of $265 million in 2023. Operating EBIT improved primarily due to lower environmental costs and increased income from insurance operations.\nOUTLOOK\nOperating Segments & End-Market Expectations\nThe Company remains confident that it will benefit from the completion of its near-term incremental growth projects and an enhanced focus on operational discipline in 2025. In addition, the Company is optimistic that it will see further demand growth in attractive end-markets such as packaging, energy and electronics. Dow's differentiated portfolio and strong balance sheet enables it to deliver on all of its capital allocation priorities, including an industry-leading dividend. Until there are more definitive indications of a true recovery taking hold, and in order to deliver improved margins, the Company is taking actions to reduce its costs by approximately $1 billion and capital expenditures plan by $300 million to $500 million. Dow will complete these actions while staying the course on its long-term strategic priorities. The Company's proactive interventions are necessary for it to continue to successfully navigate this economic downcycle.\nIn Packaging & Specialty Plastics, supply improvements driven by new polyethylene capacity coming online during 2025, combined with improved reliability, will allow the Company to continue to drive volume growth and improve margins. Local prices are expected to be impacted by market supply and demand dynamics as well as volatility in feedstocks due to sensitivity to external economic and geopolitical factors. The Company’s feedstock flexibility and advantaged regional footprint will continue to position the segment well to navigate market dynamics throughout the year. In-region presence and superior derivative flexibility will allow the segment to continue to optimize price and volume mix.\nIn Industrial Intermediates & Infrastructure, improved demand is expected based on improving fiscal conditions resulting from interest rate cuts across several regions. The Company will benefit from the full-year impact of resumed production at the Louisiana Operations Glycol-2 unit in Plaquemine, Louisiana, which successfully restarted in June 2024. Recent and in-flight growth investments in specialty amines and alkoxylation capacity are expected to support long-term, above GDP volume growth in key markets including energy transition, pharmaceuticals and consumer health, and sustainable surfactants.\nIn Performance Materials & Coatings, the Company will continue to prioritize key end-markets in performance silicones in which its innovation and footprint can drive value and volume growth above GDP. Pricing for specialty products is expected to remain relatively stable, with anticipated modest but steady economic expansion. Volume growth is expected in feedstocks and intermediates on improved regional supply and demand dynamics, and while competitive pressures in the market impacting local price persist, lower interest rates are expected to drive improved demand and local price. Market conditions impacting sales of coatings are expected to improve compared with recent years based on lower interest rates and an increase in residential spending.\nProjected Sources and Uses of Cash\nItems that may impact the consolidated statements of cash flows in 2025 include:\n•\nCapital expenditures are expected to be approximately $3 billion to $3.2 billion.\n•\nCash inflows related to the Company's sale of a 40 percent ownership stake in its Dow InfraCo, LLC subsidiary are expected to be approximately $2.4 billion.\n•\nCash dividends from equity companies are expected to be approximately $300 million. \n•\nCash contributions to pension plans are expected to be approximately $175 million.\n \n•\nCash outflows related to the Company's 2023 Restructuring Program, including restructuring implementation costs, are expected to be approximately $100 million.\n•\nCash outflows related to the Company's targeted actions to further achieve its cost reduction initiatives, including implementation costs, are expected to be $100 million to $150 million.\n41\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nThe Company had cash and cash equivalents of $2,189 million at December 31, 2024 and $2,987 million at December 31, 2023, of which $1,427 million at December 31, 2024 and $1,984 million at December 31, 2023, was held by subsidiaries in foreign countries, including U.S. territories. For each of its foreign subsidiaries, the Company makes an assertion regarding the amount of earnings intended for permanent reinvestment, with the balance available to be repatriated to the United States. \nCash held by foreign subsidiaries for permanent reinvestment is generally used to finance the subsidiaries' operational activities and future foreign investments. Dow has the ability to repatriate additional funds to the United States, which could result in an adjustment to the tax liability for foreign withholding taxes, foreign and/or U.S. state income taxes and the impact of foreign currency movements. At December 31, 2024, management believed that sufficient liquidity was available in the United States. The Company has and expects to continue repatriating certain funds from its non-U.S. subsidiaries that are not needed to finance local operations; however, these particular repatriation activities have not and are not expected to result in a significant incremental tax liability to the Company.\nFor comparison of cash flows for the fiscal years ended December 31, 2023 and 2022, see Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on January 31, 2024.\nThe Company’s cash flows from operating, investing and financing activities, as reflected in the consolidated statements of cash flows, are summarized in the following table:\nCash Flow Summary\nDow Inc.\nTDCC\nIn millions\n2024\n2023\n2024\n2023\nCash provided by (used for):\nOperating activities - continuing operations\n$\n2,903 \n$\n5,164 \n$\n2,939 \n$\n5,109 \nOperating activities - discontinued operations\n11 \n32 \n— \n— \nOperating activities\n$\n2,914 \n$\n5,196 \n$\n2,939 \n$\n5,109 \nInvesting activities\n$\n(2,368)\n$\n(2,928)\n$\n(2,368)\n$\n(2,928)\nFinancing activities\n$\n(1,168)\n$\n(3,115)\n$\n(1,193)\n$\n(3,028)\nCash Flows from Operating Activities\nCash provided by operating activities from continuing operations in 2024 was primarily driven by the Company's cash earnings and dividends from equity method investments, which were partially offset by cash used for working capital, performance-based compensation payments, pension contributions and severance payments related to the 2023 Restructuring Program. Cash provided by operating activities from continuing operations in 2023 was primarily driven by the Company's cash earnings, dividends from equity method investments and cash provided by working capital, which were partially offset by performance-based compensation payments, severance payments related to the 2023 Restructuring Program and pension contributions.\nNet Working Capital and Current Ratio at Dec 31\nDow Inc.\nTDCC\nIn millions\n2024\n2023\n2024\n2023\nCurrent assets\n$\n16,590 \n$\n17,614 \n$\n16,565 \n$\n17,676 \nCurrent liabilities\n10,288 \n9,957 \n10,210 \n9,849 \nNet working capital\n$\n6,302 \n$\n7,657 \n$\n6,355 \n$\n7,827 \nCurrent ratio\n1.61:1\n1.77:1\n1.62:1\n1.79:1\nWorking Capital Metrics\nTwelve Months Ended\nDec 31, 2024\nDec 31, 2023\nDays sales outstanding in trade receivables\n40 \n42 \nDays sales in inventory\n60 \n60 \nDays payables outstanding\n60 \n64 \n42\nTable of Contents\nCash provided by operating activities from discontinued operations reflected cash payments and receipts for certain agreements and matters related to the Company's separation from DowDuPont Inc.\nCash Flows from Investing Activities\nCash used for investing activities in 2024 and 2023 was primarily for capital expenditures and purchases of investments, which were partially offset by proceeds from sales and maturities of investments. In addition, 2024 included a cash inflow for the sale of the flexible packaging laminating adhesives business and a cash outflow for the acquisition of Circulus Holdings, LLC, a U.S. mechanical recycling company.\nThe Company's capital expenditures were $2,940 million in 2024 and $2,356 million in 2023. Capital spending was higher in 2024 as the Company continued the ramp up of investments in its higher return, lower risk and quicker payback incremental growth projects, and also included ramp up of the construction of the Fort Saskatchewan Path2Zero project aligned to the Company's Decarbonize & Grow strategy. The Company expects capital spending in 2025 to be approximately $3 billion to $3.2 billion, which includes construction of the Fort Saskatchewan Path2Zero project. The Company expects capital spending for this key growth project to average approximately $1 billion annually through 2029. Enterprise-wide capital spending is expected to exceed depreciation and amortization through 2027, during the first phase of the project, and average depreciation and amortization over the economic cycle. As evidenced across prior economic cycles, the Company will adjust its spending as economic conditions evolve.\nCapital spending in recent years has included the addition of an integrated methylene diphenyl diisocyanate distillation and prepolymers facility in Freeport, Texas, which was completed in 2023; construction of a world-scale polyethylene unit on the U.S. Gulf Coast, which is expected to be completed in 2025; and construction of the world's first net-zero Scope 1 and 2 carbon dioxide equivalent (\"CO\n2\ne\") emissions integrated ethylene and derivatives complex in Alberta, Canada.\nCash Flows from Financing Activities\nCash used for financing activities in 2024 for Dow Inc. was primarily related to dividends paid to stockholders, purchases of treasury stock and payments on long-term debt, which were partially offset by proceeds from the issuance of long-term debt. TDCC included cash outflows for dividends paid to Dow Inc. Cash used for financing activities in 2023 was primarily for debt related activities. In addition, Dow Inc. included cash outflows for dividends paid to stockholders and purchases of treasury stock. TDCC included cash outflows for dividends paid to Dow Inc. See Notes 14 and 17 to the Consolidated Financial Statements for additional information related to the issuance and retirement of debt and the Company's share repurchases and dividends.\nNon-GAAP Cash Flow Measures\nFree Cash Flow \nDow defines Free Cash Flow as \"Cash provided by operating activities - continuing operations,\" less capital expenditures. Under this definition, Free Cash Flow represents the cash generated by Dow from operations after investing in its asset base. Free Cash Flow, combined with cash balances and other sources of liquidity, represents the cash available to fund obligations and provide returns to shareholders. Free Cash Flow is an integral financial measure used in the Company's financial planning process.\nOperating EBITDA\nDow defines Operating EBITDA as earnings (i.e., \"Income before income taxes\") before interest, depreciation and amortization, excluding the impact of significant items.\nCash Flow Conversion (Cash Flow From Operations to Operating EBITDA)\nDow defines Cash Flow Conversion (Cash flow from operations to Operating EBITDA) as \"Cash provided by operating activities - continuing operations,\" divided by Operating EBITDA. Management believes Cash Flow Conversion is an important financial metric as it helps the Company determine how efficiently it is converting its earnings into cash flow.\nThese financial measures are not recognized in accordance with accounting principles generally accepted in the United States of America (\"GAAP\") and should not be viewed as alternatives to GAAP financial measures of performance. All companies do not calculate non-GAAP financial measures in the same manner and, accordingly, Dow's definitions may not be consistent with the methodologies used by other companies. \n43\nTable of Contents\nReconciliation of Non-GAAP Cash Flow Measures\nDow Inc.\nIn millions\n2024\n2023\nCash provided by operating activities - continuing operations (GAAP)\n$\n2,903 \n$\n5,164 \nCapital expenditures\n(2,940)\n(2,356)\nFree Cash Flow (non-GAAP)\n$\n(37)\n$\n2,808 \nReconciliation of Cash Flow Conversion (Cash Flow From Operations to Operating EBITDA)\nDow Inc.\nIn millions\n2024\n2023\nNet income (GAAP)\n$\n1,201\n$\n660\n + Provision (credit) for income taxes\n399\n(4)\nIncome before income taxes\n$\n1,600\n$\n656\n -  Interest income\n200\n229\n + Interest expense and amortization of debt discount\n811\n746\n -  Significant items \n1\n(377)\n(1,605)\nOperating EBIT (non-GAAP)\n$\n2,588\n$\n2,778\n + Depreciation and amortization\n2,894\n2,611\nOperating EBITDA (non-GAAP)\n$\n5,482\n$\n5,389\nCash provided by operating activities - continuing operations (GAAP)\n$\n2,903\n$\n5,164\nCash flow from operations to net income (GAAP)\n241.7 \n%\n782.4 \n%\nCash Flow Conversion (Cash flow from operations to Operating EBITDA) (non-GAAP)\n53.0 \n%\n95.8 \n%\n1.\nThe year ended December 31, 2024, includes restructuring charges and implementation and efficiency costs associated with the Company's 2023 Restructuring Program, gains associated with a previously impaired equity investment, impairment charges related to the write-down of certain manufacturing assets, a charge related to an arbitration settlement agreement for historical product claims from a divested business and activity related to the separation from DowDuPont. The year ended December 31, 2023, includes restructuring charges and implementation and efficiency costs associated with the Company's 2023 Restructuring Program, certain gains and losses associated with previously impaired equity investments, a loss associated with legacy agricultural products groundwater contamination matters, a gain associated with a legal matter with Nova Chemicals Corporation, foreign currency losses and inventory valuation impacts related to the devaluation of the Argentine peso, non-cash settlement charges related to the purchase of nonparticipating group annuity contracts for certain Company pension plans in the United States and Canada and activity related to the separation from DowDuPont. See Note 25 to the Consolidated Financial Statements for additional information.\nLiquidity & Financial Flexibility \nThe Company’s primary source of incremental liquidity is cash flows from operating activities. The generation of cash from operations and the Company's ability to access capital markets is expected to meet the Company’s cash requirements for working capital, capital expenditures, debt maturities, contributions to pension plans, dividend distributions to stockholders, share repurchases and other needs. In addition to cash from operating activities, the Company’s current liquidity sources also include TDCC's U.S. and Euromarket commercial paper programs, committed and uncommitted credit facilities, committed and uncommitted accounts receivable facilities, a medium-term notes program, a U.S. retail note program (“InterNotes\n®\n”) and other debt markets.\nThe Company continues to maintain a strong financial position with all of its committed credit facilities undrawn and fully available at December 31, 2024. Cash and committed and available forms of liquidity were $12.0 billion at December 31, 2024, a decrease of $800 million from December 31, 2023. The Company also has no substantive long-term debt maturities due until 2027. Additional details on sources of liquidity are as follows:\nCommercial Paper\nTDCC issues promissory notes under its U.S. and Euromarket commercial paper programs. TDCC had no commercial paper outstanding at December 31, 2024 and 2023. TDCC maintains access to the commercial paper market at competitive rates. Amounts outstanding under TDCC's commercial paper programs during the period may be greater or less than the amount reported at the end of the period. Subsequent to December 31, 2024, TDCC issued commercial paper and had approximately $2.1 billion of commercial paper outstanding at February 4, 2025.\n44\nTable of Contents\nCommitted Credit Facilities\nThe Company also has the ability to access liquidity through TDCC's committed and available credit facilities. At December 31, 2024, TDCC had total committed and available credit facilities of $8.4 billion. See Note 14 to the Consolidated Financial Statements for additional information on committed and available credit facilities.\nUncommitted Credit Facilities\nThe Company has entered into various uncommitted bilateral credit arrangements as a potential source of excess liquidity. These lines can be used to support short-term liquidity needs and for general purposes. The Company had no drawdowns outstanding at December 31, 2024.\nAccounts Receivable Securitization Facilities\nIn addition to the above credit facilities, the Company maintains a committed accounts receivable facility in the United States where eligible trade accounts receivable, up to $900 million, may be sold at any point in time. The Company also maintains a committed accounts receivable facility in Europe where eligible trade accounts receivable, up to €500 million, may be sold at any point in time. In 2024, there were $290 million in sales of receivables under the U.S. and Europe committed accounts receivable facilities ($39 million in sales of receivables in 2023). At December 31, 2024, no material balances of sold receivables remained outstanding ($5 million remained outstanding at December 31, 2023). \nIn addition, the Company has an uncommitted accounts receivable facility in the United States providing additional liquidity. In 2024, sales of receivables under this facility were $378 million ($73 million in sales of receivables in 2023). At December 31, 2024, no material balances of sold receivables remained outstanding ($73 million remained outstanding at December 31, 2023). See Note 13 to the Consolidated Financial Statements for additional information\n. \nEarly Settlement of Letters of Credit\nThe Company utilizes, from time-to-time, letters of credit discounting programs to manage and expedite the settlement of letters of credit in certain regions. These letters of credit are associated with accounts receivable and the Company retains no interest in the transferred letters of credit or receivables once sold.\nAccounts Receivable Discounting Facilities\nThe Company has access to accounts receivable discounting facilities, under which receivables are transferred with limited recourse. The Company retains no interest in the transferred receivables once sold. In 2024, sales of receivables under these facilities were $865 million ($91 million in sales of receivables in 2023). At December 31, 2024, approximately $287 million of sold receivables were outstanding ($91 million remained outstanding at December 31, 2023). See Note 13 to the Consolidated Financial Statements for additional information\n.\nThe Company maintains these facilities and also participates in certain customers’ supply chain financing and other early pay programs as a routine source of working capital. \nLetters of Credit\nTDCC utilizes letters of credit to support commitments made in the ordinary course of business. While the terms and amounts of letters of credit change, TDCC generally has approximately $600 million of outstanding letters of credit at any given time.\nCompany-Owned Life Insurance\nThe Company has investments in company-owned life insurance (\"COLI\") policies, which are recorded at their cash surrender value as of each balance sheet date. The Company has the ability to monetize its investment in its COLI policies as an additional source of liquidity. The Company had no outstanding monetization of its existing COLI policies' surrender value at December 31, 2024 ($97 million at December 31, 2023). See Note 6 to the Consolidated Financial Statements for additional information.\nShelf Registration - United States\nOn June 13, 2022, Dow Inc. and TDCC filed a shelf registration statement with the U.S. Securities and Exchange Commission. The shelf indicates that Dow Inc. may offer common stock; preferred stock; depositary shares; debt securities; guarantees; warrants to purchase common stock, preferred stock and debt securities; and stock purchase contracts and stock purchase units, with pricing and availability of any such offerings depending on market conditions. The shelf also indicates that TDCC may offer debt securities, guarantees and warrants to purchase debt securities, with pricing and availability of any such offerings depending on market conditions. \n45\nTable of Contents\nIn 2022, TDCC filed a prospectus supplement under this shelf registration to register an undetermined amount of securities for issuance under InterNotes\n®\n. Also, in 2022, TDCC filed a prospectus supplement under this shelf registration to register an undetermined amount of securities for issuance under a medium-term notes program. In 2024, TDCC filed a prospectus supplement under this shelf registration to register $1.25 billion of securities for issuance in connection with its Green Finance Framework. The shelf registration expires on June 13, 2025. The Company expects to renew the shelf registration.\nDebt\nAs the Company continues to maintain its strong balance sheet and financial flexibility, management is focused on net debt (a non-GAAP financial measure), as the Company believes this is the best representation of its financial leverage at this point in time. As shown in the following table, net debt is equal to total gross debt minus \"Cash and cash equivalents\" and \"Marketable securities.\"\nTotal Debt at Dec 31\nDow Inc.\nTDCC\nIn millions\n2024\n2023\n2024\n2023\nNotes payable\n$\n135\n$\n62\n$\n135\n$\n62\nLong-term debt due within one year\n497\n117\n497\n117\nLong-term debt\n15,711\n14,907\n15,711\n14,907\nGross debt\n$\n16,343\n$\n15,086\n$\n16,343\n$\n15,086\n - Cash and cash equivalents\n2,189\n2,987\n2,189\n2,987\n - Marketable securities \n1\n383\n1,300\n383\n1,300\nNet debt (non-GAAP)\n$\n13,771\n$\n10,799\n$\n13,771\n$\n10,799\nTotal equity\n$\n17,851\n$\n19,108\n$\n18,032\n$\n19,406\nGross debt as a percentage of total capitalization\n47.8 \n%\n44.1 \n%\n47.5 \n%\n43.7 \n%\nNet debt as a percentage of total capitalization (non-GAAP)\n43.5 \n%\n36.1 \n%\n43.3 \n%\n35.8 \n%\n1.\nIncluded in \"Other current assets\" in the consolidated balance sheets.\nIn the first quarter of 2024, the Company issued $1.25 billion of senior unsecured notes. This offering included $600 million aggregate principal amount of 5.150 percent notes due 2034 and $650 million aggregate principal amount of 5.600 percent notes due 2054. The issuance was completed in connection with the Company's Green Finance Framework. The Company distributed the proceeds toward projects that support the execution of its sustainability strategy and achieve its targets focused on climate protection and a circular economy, including applicable expenditures and investments related to the Company's Fort Saskatchewan Path2Zero project.\nIn the second quarter of 2024, the Company redeemed $10 million aggregate principal amount of 2.100 percent\n \nnotes due November 2030, $30 million aggregate principal amount of 4.250 percent notes due October 2034, $8 million aggregate principal amount of 5.250 percent notes due November 2041 and $12 million aggregate principal amount of 4.375 percent\n \nnotes due November 2042. As a result of the redemption, the Company recognized a pretax gain on the early extinguishment of debt of $5 million, included in \"Sundry income (expense) - net\" in the consolidated statements of income and related to Corporate.\nIn 2024, the Company issued an aggregate principal amount of $94 million of InterNotes\n®\n. The Company also issued $122 million of foreign currency loans. Additionally, the Company repaid $83 million of long-term debt at maturity.\nThe Company may at any time repurchase certain debt securities in the open market or in privately negotiated transactions subject to: the applicable terms under which any such debt securities were issued, certain internal approvals of the Company, and applicable laws and regulations of the relevant jurisdiction in which any such potential transactions might take place. This in no way obligates the Company to make any such repurchases nor should it be considered an offer to do so.\nTDCC’s public debt instruments and primary, private credit agreements contain, among other provisions, certain customary restrictive covenant and default provisions. TDCC’s most significant debt covenant with regard to its financial position is the obligation to maintain the ratio of its consolidated indebtedness to consolidated capitalization at no greater than 0.70 to 1.00 at any time the aggregate outstanding amount of loans under the Five Year Competitive Advance and Revolving Credit Facility Agreement (\"Revolving Credit Agreement\") equals or exceeds \n46\nTable of Contents\n$500 million. The ratio of TDCC’s consolidated indebtedness as defined in the Revolving Credit Agreement was 0.45 to 1.00 at December 31, 2024. Management believes TDCC was in compliance with all of its covenants and default provisions at December 31, 2024. For information on TDCC's debt covenants and default provisions, see Note 14. There were no material changes to the debt covenants and default provisions related to TDCC’s outstanding long-term debt and primary, private credit agreements in 2024. \nDow Inc. is obligated, substantially concurrently with the issuance of any guarantee in respect of outstanding or committed indebtedness under the Revolving Credit Agreement, to enter into a supplemental indenture with TDCC and the trustee under TDCC’s existing 2008 base indenture governing certain notes issued by TDCC. Under such supplemental indenture, Dow Inc. will guarantee all outstanding debt securities and all amounts due under such existing base indenture and will become subject to certain covenants and events of default under the existing base indenture. \nIn addition, the Revolving Credit Agreement includes an event of default which would be triggered in the event Dow Inc. incurs or guarantees third party indebtedness for borrowed money in excess of $250 million or engages in any material activity or directly owns any material assets, in each case, subject to certain conditions and exceptions. Dow Inc. may, at its option, cure the event of default by delivering an unconditional and irrevocable guarantee to the administrative agent within thirty days of the event or events giving rise to such event of default.\nNo such events have occurred or have been triggered at the time of the filing of this Annual Report on Form 10-K. See Note 14 to the Consolidated Financial Statements for information related to TDCC’s notes payable and long-term debt activity and information on TDCC’s debt covenants and default provisions.\nWhile taking into consideration the current economic environment, management expects that the Company will continue to have sufficient liquidity and financial flexibility to meet all of its business obligations.\nCredit Ratings\nTDCC's credit ratings at January 31, 2025 were as follows:\nCredit Ratings\nLong-Term Rating\nShort-Term Rating\nOutlook\nFitch Ratings\nBBB+\nF1\nStable\nMoody’s Ratings\nBaa1\nP-2\nNegative\nStandard & Poor’s\nBBB\nA-2\nStable\nFitch Ratings affirmed TDCC's BBB+ and F1 rating and its outlook of stable on July 1, 2024. Standard & Poor's affirmed TDCC's BBB and A-2 rating and its outlook of stable on July 1, 2024 and December 9, 2024. Moody's Ratings affirmed TDCC's Baa1 and P-2 rating and its outlook of stable on August 6, 2024, and re-affirmed TDCC's Baa1 and P-2 rating and revised its outlook to negative from stable on October 28, 2024. These credit agencies' decisions were made as part of their annual review process and reflect the Company's supportive financial policies, scale, liquidity and cost-advantaged footprint.\nDividends\nDow Inc.\nDow Inc. has paid dividends on a quarterly basis and expects to continue to do so, subject to approval by the Board. The dividends declared by the Board align to the Company's strategy announced in 2018 of returning approximately 45 percent of Operating Net Income to shareholders through dividends and total shareholder remuneration of approximately 65 percent, when including share repurchases, over the economic cycle. The Company defines Operating Net Income, a non-GAAP measure, as \"Net income available for Dow Inc. common stockholders,\" excluding the impact of significant items. The following tables provide information on dividends declared and paid to common stockholders: \nDividends Paid for the Years Ended Dec 31\n2024\n2023\nIn millions, except per share amounts\nDividends paid, per common share\n$\n2.80 \n$\n2.80 \nDividends paid to common stockholders\n$\n1,966 \n$\n1,972 \n47\nTable of Contents\nDow Inc. Cash Dividends Declared and Paid\nDeclaration Date\nRecord Date\nPayment Date\nAmount (per share)\nFebruary 15, 2024\nFebruary 29, 2024\nMarch 8, 2024\n$\n0.70 \nApril 11, 2024\nMay 31, 2024\nJune 14, 2024\n$\n0.70 \nAugust 14, 2024\nAugust 30, 2024\nSeptember 13, 2024\n$\n0.70 \nOctober 10, 2024\nNovember 29, 2024\nDecember 13, 2024\n$\n0.70 \nTDCC\nTDCC has committed to fund Dow Inc.'s dividends paid to common stockholders and share repurchases, as approved by the Board from time to time, as well as certain governance expenses. Funding is accomplished through intercompany loans. TDCC's Board of Directors reviews and determines a dividend distribution to Dow Inc. to settle the intercompany loans. For the year ended December 31, 2024, TDCC declared $2,578 million of dividends to Dow Inc. and paid $2,485 million of dividends to Dow, Inc. ($2,510 million for the year ended December 31, 2023). At December 31, 2024, TDCC's intercompany loan balance with Dow Inc. was insignificant. See Note 24 to the Consolidated Financial Statements for additional information.\nShare Repurchase Program \nOn April 13, 2022, the Board approved a share repurchase program authorizing up to $3 billion for the repurchase of the Company's common stock, with no expiration date. The Company repurchased $494 million of its common stock in 2024. At December 31, 2024, approximately $931 million of the share repurchase program authorization remained available for repurchases. As previously announced, the Company intends to repurchase shares at a minimum to cover dilution over the economic cycle. The Company may from time to time expand its share repurchases beyond dilution, based on a number of factors including macroeconomic conditions, free cash flow generation, and the Dow share price. Any share repurchases, when coupled with the Company's dividends, are intended to implement the long-term strategy of targeting shareholder remuneration of approximately 65 percent over the economic cycle.\nPension Plans \nThe Company has both funded and unfunded defined benefit pension plans in the United States and a number of other countries. The Company’s funding policy is to contribute to funded plans when pension laws and/or economics either require or encourage funding. In 2024 and 2023, the Company contributed $121 million and $142 million to its pension plans, respectively, including contributions to fund benefit payments for its unfunded pension plans. Additionally, in the second quarter of 2024, the Company received a pension plan reversion of approximately $70 million (approximately $90 million in the second quarter of 2023) for a portion of the excess funding of one of its plans in Europe, included in \"Other assets and liabilities, net\" in the consolidated statements of cash flows. The Company expects to contribute approximately $175 million to its pension plans in 2025, inclusive of a plan contribution previously expected to be made in 2024, now expected to be contributed in 2025. \nAs announced in 2021, all U.S. pension plans were frozen for substantially all employees who participated in the U.S. defined benefit pension programs ef\nfective December 31, 2023. In the fourth quarter of 2023, the Company spun off a portion of each of the Company’s existing tax-qualified U.S defined benefit pension plans into new tax-qualified pension plans, which include the tax-qualified benefit obligations for substantially all employees hired after January 1, 2008. These employees earned benefits based on a set percentage of annual pay, plus interest, and the spin of these plans provides the Company the ability to separately manage the assets and obligations of these plans with like benefits. In the second quarter of 2024, as part of its ongoing pension de-risking initiatives, the Company initiated the termination of the new tax-qualified pension plans. As part of the plan termination process, the Company will offer participants of these plans annuity or lump sum distribution options. Final asset distributions are expected to be paid from plan assets in the fourth quarter of 2025. The Company anticipates that these asset distributions will result in pension settlement charges, with the amounts dependent on various factors, including interest rates, plan asset returns, annuity pricing and participant distribution elections.\nSee Note 19 to the Consolidated Financial Statements for additional information related to the Company’s pension plans.\n48\nTable of Contents\nRestructuring\nThe actions related to the 2023 Restructuring Program are expected to result in additional cash expenditures of $60 million, primarily through the first quarter of 2025 and consist primarily of severance and related benefit costs. Restructuring implementation and efficiency costs, primarily decommissioning and demolition activities related to asset actions, and costs associated with the Company's productivity and efficiency actions, are expected to result in additional cash expenditures of approximately $40 million, primarily through the first quarter of 2025. Restructuring implementation and efficiency costs totaled $230 million for the year ended December 31, 2024 ($243 million for the year ended December 31, 2023).\nThe Company expects to incur additional costs in the future related to its restructuring activities, which will be recognized as incurred. The Company also expects to incur additional employee-related costs, including involuntary termination benefits related to its other optimization activities. These costs cannot be reasonably estimated at this time. See Note 5 to the Consolidated Financial Statements for additional information on the Company's restructuring activities.\nContractual Obligations\nThe following table summarizes the Company’s contractual obligations, commercial commitments and expected cash requirements for interest at December 31, 2024. Additional information related to these obligations can be found in Notes 14, 15, 16 and 19 to the Consolidated Financial Statements.\nContractual Obligations at Dec 31, 2024\nPayments Due In\nIn millions\n2025\n2026-2027\n2028-2029\n2030 and beyond\nTotal\nDow Inc.\nLong-term debt obligations \n1\n$\n495 \n$\n1,384 \n$\n2,156 \n$\n12,417 \n$\n16,452 \nExpected cash requirements for interest \n2\n804 \n1,472 \n1,380 \n8,608 \n12,264 \nPension and other postretirement benefits\n223 \n398 \n404 \n3,402 \n4,427 \nOperating leases \n3\n365 \n511 \n284 \n388 \n1,548 \nPurchase obligations \n4\n2,520 \n3,167 \n2,003 \n6,345 \n14,035 \nOther noncurrent obligations \n5\n— \n687 \n509 \n1,931 \n3,127 \nTotal\n$\n4,407 \n$\n7,619 \n$\n6,736 \n$\n33,091 \n$\n51,853 \nTDCC\nLong-term debt obligations \n1\n$\n495 \n$\n1,384 \n$\n2,156 \n$\n12,417 \n$\n16,452 \nExpected cash requirements for interest \n2\n804 \n1,472 \n1,380 \n8,608 \n12,264 \nPension and other postretirement benefits\n223 \n398 \n404 \n3,402 \n4,427 \nOperating leases \n3\n365 \n511 \n284 \n388 \n1,548 \nPurchase obligations \n4\n2,520 \n3,167 \n2,003 \n6,345 \n14,035 \nOther noncurrent obligations \n5\n— \n686 \n509 \n1,798 \n2,993 \nTotal\n$\n4,407 \n$\n7,618 \n$\n6,736 \n$\n32,958 \n$\n51,719 \n1.\nExcludes unamortized debt discount and issuance costs of $244 million. Includes finance lease obligations of $939 million.\n2.\nCash requirements for interest on long-term debt was calculated using current interest rates at December 31, 2024, and includes $165 million of various floating rate notes.\n3.\nIncludes imputed interest of $246 million.\n4.\nIncludes a $1.3 billion purchase commitment for the use of a water supply reservoir asset expected to commence in 2028, as discussed in Note 15 to the Consolidated Financial Statements, and outstanding purchase orders and other commitments greater than $1 million obtained through a survey conducted within the Company.\n5.\nIncludes liabilities related to asbestos litigation, environmental remediation, legal matters and other noncurrent liabilities. In addition to these items, Dow Inc. includes liabilities related to noncurrent obligations with DuPont and Corteva. The table excludes uncertain tax positions due to uncertainties in the timing of the effective settlement of tax positions with the respective taxing authorities and deferred tax liabilities as it is impractical to determine whether there will be a cash impact related to these liabilities. The table also excludes deferred revenue as it does not represent future cash requirements arising from contractual payment obligations.\nThe Company expects to meet its contractual obligations through its normal sources of liquidity and believes it has the financial resources to satisfy these contractual obligations.\n49\nTable of Contents\nOff-Balance Sheet Arrangements\nOff-balance sheet arrangements are obligations the Company has with nonconsolidated entities related to transactions, agreements or other contractual arrangements. The Company holds variable interests in joint ventures accounted for under the equity method of accounting. The Company is not the primary beneficiary of these joint ventures and therefore is not required to consolidate these entities (see Note 23 to the Consolidated Financial Statements). In addition, see Note 13 to the Consolidated Financial Statements for information regarding the transfer of financial assets.\nGuarantees arise during the ordinary course of business from relationships with customers, committed accounts receivable facilities and nonconsolidated affiliates when the Company undertakes an obligation to guarantee the performance of others if specific triggering events occur. Additional information related to guarantees can be found in the “Guarantees” section of Note 15 to the Consolidated Financial Statements. \nFair Value Measurements \nSee Note 19 to the Consolidated Financial Statements for information related to fair value measurements of pension and other postretirement benefit plan assets; see Note 21 for information related to other-than-temporary impairments; and, see Note 22 for additional information concerning fair value measurements. \nOTHER MATTERS\nRecent Accounting Guidance\nSee Note 2 to the Consolidated Financial Statements for a summary of recent accounting guidance.\nCritical Accounting Estimates\nThe preparation of financial statements and related disclosures in accordance with U.S. GAAP requires management to make judgments, assumptions and estimates that affect the amounts reported in the consolidated financial statements and accompanying notes. Note 1 to the Consolidated Financial Statements describes the significant accounting policies and methods used in the preparation of the consolidated financial statements. Following are the Company’s accounting policies impacted by judgments, assumptions and estimates:\nAsbestos-Related Matters of Union Carbide Corporation\nUnion Carbide is and has been involved in a large number of asbestos-related suits filed primarily in state courts during the past several decades. These suits principally allege personal injury resulting from exposure to asbestos-containing products and frequently seek both actual and punitive damages. The alleged claims primarily relate to products that Union Carbide sold in the past, alleged exposure to asbestos-containing products located on Union Carbide’s premises, and Union Carbide’s responsibility for asbestos suits filed against a former Union Carbide subsidiary, Amchem Products, Inc. (\"Amchem\"). Each year, Ankura Consulting Group, LLC (\"Ankura\") performs a review for Union Carbide based upon historical asbestos claims, resolution and asbestos-related defense and processing costs, through the terminal year of 2049. Union Carbide compares current asbestos claim and resolution activity, including asbestos-related defense and processing costs, to the results of the most recent Ankura study at each balance sheet date to determine whether the asbestos-related liability continues to be appropriate.\nFor additional information, see Part I, Item 3. Legal Proceedings; Asbestos-Related Matters of Union Carbide Corporation in Management’s Discussion and Analysis of Financial Condition and Results of Operations; and Notes 1 and 15 to the Consolidated Financial Statements.\nEnvironmental Matters\nThe Company determines the costs of environmental remediation of its facilities and formerly owned facilities based on evaluations of current law and existing technologies. Inherent uncertainties exist in such evaluations primarily due to unknown environmental conditions, changing governmental regulations and legal standards regarding liability, and emerging remediation technologies. The recorded liabilities are adjusted periodically as remediation efforts progress, or as additional technical or legal information becomes available. At December 31, 2024, the Company had accrued obligations of $1,113 million for probable environmental remediation and restoration costs, including $234 million for the remediation of Superfund sites. This is management’s best estimate of the costs for remediation and restoration with respect to environmental matters for which the Company has accrued liabilities, although it is reasonably possible that the ultimate cost with respect to these particular matters could range up to approximately two times that amount. For further discussion, see Environmental Matters in Management’s Discussion and Analysis of Financial Condition and Results of Operations and Notes 1 and 15 to the Consolidated Financial Statements.\n50\nTable of Contents\nPension and Other Postretirement Benefits\nThe amounts recognized in the consolidated financial statements related to pension and other postretirement benefits are determined from actuarial valuations. Inherent in these valuations are assumptions including expected return on plan assets, discount rates at which the liabilities could have been settled at December 31, 2024, rate of increase in future compensation levels, mortality rates and health care cost trend rates. These assumptions are updated annually and are disclosed in Note 19 to the Consolidated Financial Statements. In accordance with U.S. GAAP, actual results that differ from the assumptions are accumulated and amortized over future periods and, therefore, affect expense recognized and obligations recorded in future periods. The U.S. pension plans represent 73 percent of the Company’s pension plan assets and 70 percent of the pension obligations. The U.S. pension plans were frozen effective December 31, 2023, and therefore, participants do not accrue additional benefits for future service and compensation.\nThe Company uses the spot rate approach to determine the discount rate utilized to measure the service cost and interest cost components of net periodic pension and other postretirement benefit costs for the United States and other selected countries, as applicable. Under the spot rate approach, the Company calculates service cost and interest cost by applying individual spot rates from the Willis Towers Watson RATE:Link yield curve (based on high-quality corporate bond yields) for each selected country to the separate expected cash flow components of service cost and interest cost; service cost and interest cost for all other plans are determined on the basis of the single equivalent discount rates derived in determining those plan obligations.\nThe following information relates to the U.S. plans only; a similar approach is used for the Company’s non-U.S. plans.\nThe Company determines the expected long-term rate of return on assets by performing a detailed analysis of historical and expected returns based on the strategic asset allocation approved by the Company's Investment Committee and the underlying return fundamentals of each asset class. The Company’s historical experience with the pension fund asset performance is also considered. The expected return of each asset class is derived from a forecasted future return confirmed by historical experience. The expected long-term rate of return is an assumption and not what is expected to be earned in any one particular year. The weighted-average long-term rate of return assumption used for determining net periodic pension expense for 2024 was 7.07 percent. The weighted-average assumption to be used for determining 2025 net periodic pension expense is 7.04 percent. Future actual pension expense will depend on future investment performance, changes in future discount rates and various other factors related to the population of participants in the Company’s pension plans.\nThe discount rates utilized to measure the pension and other postretirement obligations of the U.S. plans are based on the yield on high-quality corporate fixed income investments at the measurement date. Future expected actuarially determined cash flows for the Company’s U.S. plans are individually discounted at the spot rates under the Willis Towers Watson U.S. RATE:Link 60-90 corporate yield curve (based on 60th to 90th percentile high-quality corporate bond yields) to arrive at the plan’s obligations as of the measurement date. The weighted average discount rate utilized to measure pension obligations increased to 5.74 percent at December 31, 2024, from 5.30 percent at December 31, 2023.\nAt December 31, 2024, the net underfunded status of the U.S. tax-qualified plans on a projected benefit obligation basis was $1,360 million. The net underfunded amount increased $168 million compared with December 31, 2023. The increase in the net underfunded amount in 2024 was primarily due to the unfavorable returns on plan assets partially offset by the market-related impact of higher discount rates. The Company uses a generational mortality table to determine the duration of its pension and other postretirement obligations.\nThe following discussion relates to the Company’s significant pension plans.\nThe Company bases the determination of pension expense on a market-related valuation of plan assets that reduces year-to-year volatility. This market-related valuation recognizes investment gains or losses over a five-year period from the year in which they occur. Investment gains or losses for this purpose represent the difference between the expected return calculated using the market-related value of plan assets and the actual return based on the market value of plan assets. Since the market-related value of plan assets recognizes gains or losses over a five-year period, the future value will be impacted when previously deferred gains or losses are recorded. Over the life of the plans, both gains and losses have been recognized and amortized. At December 31, 2024, net losses of $2,899 million remain to be recognized in the calculation of the market-related value of plan assets. These net \n51\nTable of Contents\nlosses will result in increases in future pension expense as they are recognized in the market-related value of assets. \nThe net decrease in the market-related value of assets due to the recognition of prior losses is presented in the following table:\nNet Decrease in Market-Related Asset Value Due to Recognition of Prior Losses\nIn millions\n2025\n$\n1,126 \n2026\n1,264 \n2027\n266 \n2028\n243 \nTotal\n$\n2,899 \nExcluding the impact of the Company's 2024 one-time pension events, the Company expects net periodic benefit cost (\"NPBC\") credit to decrease in 2025 by approximately $88 million compared with 2024. The reduction in the NPBC credit is due to a smaller expected increase in assets and increased amortization, partially offset by reduced interest and service cost.\nA 25 basis point increase or decrease in the long-term return on assets assumption would change the Company’s NPBC credit for 2025 by $48 million. A 25 basis point increase in the discount rate assumption would increase the Company's NPBC credit for 2025 by $9 million. A 25 basis point decrease in the discount rate assumption would decrease the Company's NPBC credit for 2025 by $8 million. \nIncome Taxes\nDeferred tax assets and liabilities are determined based on temporary differences between the financial reporting and tax bases of assets and liabilities, applying enacted tax rates expected to be in effect for the year in which the differences are expected to reverse. Based on the evaluation of available evidence, both positive and negative, the Company recognizes future tax benefits, such as net operating loss carryforwards and tax credit carryforwards, to the extent that realizing these benefits is considered to be more likely than not.\nAt December 31, 2024, the Company had a net deferred tax asset balance of $865 million, after valuation allowances of $2,748 million.\nIn evaluating the ability to realize the deferred tax assets, the Company relies on, in order of increasing subjectivity, taxable income in prior carryback years, the future reversals of existing taxable temporary differences, tax planning strategies and forecasted taxable income using historical and projected future operating results.\nThe Company files tax returns in multiple jurisdictions and is subject to examination by taxing authorities throughout the world. Tax authorities have the ability to review and challenge matters that could be subject to differing interpretation of applicable tax laws and regulations as they relate to the amount, character, timing or inclusion of revenue and expenses or the sustainability of tax attributes. The ultimate resolution of such uncertainties could last several years. When an uncertain tax position is identified, the Company considers and interprets complex tax laws and regulations    in order to determine the need for recognizing a provision in its financial statements. Significant judgment is required in determining the timing and measurement of uncertain tax positions. The Company utilizes internal and external expertise in interpreting tax laws to support the Company's tax positions. The Company recognizes the financial statement effects of an uncertain income tax position when it is more likely than not, based on technical merits, that the position will be sustained upon examination. At December 31, 2024, the Company had uncertain tax positions for both domestic and foreign issues of $422 million and $327 million for interest and penalties.\nGoodwill\nThe Company performs goodwill impairment testing at the reporting unit level. Reporting units are the level at which discrete financial information is available and reviewed by business management on a regular basis. The Company tests goodwill for impairment annually (in the fourth quarter), or more frequently when events or changes in circumstances indicate it is more likely than not that the fair value of a reporting unit has declined below its carrying value. Goodwill is evaluated for impairment using qualitative and/or quantitative testing procedures. At December 31, 2024, goodwill was carried by five out of six of the Company's reporting units.\n52\nTable of Contents\nThe Company has the option to first perform qualitative testing to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value. Qualitative factors assessed at the Company level include, but are not limited to, GDP growth rates, long-term hydrocarbon and energy prices, equity and credit market activity, discount rates, foreign exchange rates and overall financial performance. Qualitative factors assessed at the reporting unit level include, but are not limited to, changes in industry and market structure, competitive environments, planned capacity and new product launches, cost factors such as raw material prices, and financial performance of the reporting unit. If the Company chooses not to complete a qualitative assessment for a given reporting unit or if the initial assessment indicates that it is more likely than not that the estimated fair value of a reporting unit is less than its carrying value, additional quantitative testing is required.\nQuantitative testing requires the fair value of the reporting unit to be compared with its carrying value. If the reporting unit's carrying value exceeds its fair value, an impairment charge is recognized for the difference. The Company utilizes a discounted cash flow methodology to calculate the fair value of its reporting units. This valuation technique has been selected by management as the most meaningful valuation method due to the limited number of market comparables for the Company's reporting units. However, where market comparables are available, the Company includes EBIT/EBITDA multiples as part of the reporting unit valuation analysis. The discounted cash flow valuations are completed using the following key assumptions: projected revenue growth rates or compounded annual growth rates, discount rates, tax rates, terminal values, currency exchange rates, and forecasted long-term hydrocarbon and energy prices, by geographic region and by year, which include the Company's key feedstocks as well as natural gas and crude oil (due to its correlation to naphtha). Currency exchange rates and long-term hydrocarbon and energy prices are established for the Company as a whole and applied consistently to all reporting units, while revenue growth rates, discount rates and tax rates are established by reporting unit to account for differences in business fundamentals and industry risk. These key assumptions drive projected EBIT/EBITDA and EBIT/EBITDA margins, which are key elements of management’s internal control over the reporting unit valuation analysis.\n2024 Goodwill Impairment Testing\n \nIn 2024, there were no events or changes in circumstances that warranted interim goodwill impairment testing. In the fourth quarter of 2024, qualitative testing was performed for all reporting units carrying goodwill. Based on the results of the qualitative testing, quantitative testing was performed on one reporting unit. For the qualitative assessments, management considered factors at both the Company level and the reporting unit level. Based on the qualitative assessments for the reporting units, management concluded it is more likely than not that the carrying value of the reporting unit is less than the fair value of the reporting unit. For the quantitative testing, the fair value exceeded the carrying value of the reporting unit. \nEnvironmental Matters\nEnvironmental Policies\nDow is committed to world-class environmental, health and safety (“EH&S”) performance, as demonstrated by industry-leading results, a long-standing commitment to the American Chemistry Council's Responsible Care\n®\n program, a strong commitment to achieve the Company's 2025 Sustainability Goals and Dow's drive to deliver against its targets around a circular economy and climate protection. These goals and targets set the standard for sustainability in the chemical industry, focusing on improvements in the Company’s local corporate citizenship and product stewardship, and by actively pursuing methods to reduce the Company's environmental impact.\nTo meet the Company’s public commitments, as well as the stringent laws and government regulations related to environmental protection and remediation to which its global operations are subject, the Company has well-defined policies, requirements and management systems. The Company's EH&S Management System (“EMS”) defines the “who, what, when and how” needed for the businesses to implement the Company’s policies and requirements and meet performance objectives, leadership expectations and public commitments. To ensure effective utilization, the EMS is integrated into a company-wide management system for EH&S, Operations, Quality and Human Resources.\nThe Company believes third-party verification and transparent public reporting are cornerstones of world-class EH&S performance and building public trust. Numerous Dow sites in EMEAI, Latin America, Asia Pacific and the U.S. & Canada have received third-party verification of the Company’s compliance with Responsible Care\n®\n and with outside specifications such as ISO-14001. The Company continues to be a global champion of Responsible Care\n®\n and has worked to broaden the application and impact of Responsible Care\n®\n around the world through engagement with peer companies, suppliers, customers and joint venture partners.\n53\nTable of Contents\nDow manages environmental data for reporting with a waste, water and emissions inventory system. All emitting manufacturing sites globally record their emissions and water use in the system. The data is reviewed at the facility level and then by global coordinators before being aggregated for corporate environmental reporting purposes.\nDow's EH&S policies help to ensure the Company achieves its annual health and safety performance targets and the Company seeks to continuously improve on these targets through process and personal safety project implementations. Improvement in these areas, as well as environmental compliance, remains a top management priority, as the Company continues to implement its 2025 Sustainability Goals and progressive, multi-decade sustainability targets that include advancing a circular economy and climate protection. Progress is reviewed annually by management and with the Environment, Health, Safety & Technology (\"EHS&T\") Committee of the Board.\nDetailed information on Dow’s performance regarding environmental matters and goals is accessible through the Company's Science & Sustainability webpage at \nwww.dow.com/sustainability\n. Dow's website and its content are not deemed incorporated by reference into this report.\nChemical Security\nPublic and political attention continues to be placed on the protection of critical infrastructure, including the chemical industry, from security threats. Sabotage, terrorism, war, natural disasters and cybersecurity incidents have increased global concerns about the security and safety of chemical production and distribution. Many, including the Company and the American Chemistry Council, have called for uniform risk-based and performance-based national standards for securing the U.S. chemical industry. The Company is subject to U.S. regulations with established risk-based and performance-based standards that must be met at U.S. Coast Guard-regulated facilities promulgated by the U.S. Department of Homeland Security. The Company is also subject to the requirements of the Rail Transportation Security Rule issued by the U.S. Transportation Security Administration. The Company continues to support uniform risk-based national standards for securing the chemical industry.\nThe Company maintains a comprehensive, multi-level security plan that focuses on security, emergency planning, preparedness and response. This plan, which has been activated in response to significant world and national events, is reviewed on an annual basis. The Company continues to improve its security plans, placing emphasis on the safety of Dow communities and people by being prepared to meet risks at any level and to address both internal and external identifiable risks. The security plan includes regular vulnerability assessments, security audits, mitigation efforts and physical security upgrades designed to reduce vulnerability. The Company’s security plans are also designed to avert interruptions of normal business operations that could materially and adversely affect the Company’s results of operations, financial condition and cash flows.\nThe Company played a key role in the development and implementation of the American Chemistry Council’s Responsible Care\n®\n Security Code (\"Security Code\"), which requires that all aspects of security – including facility, transportation and cyberspace – be assessed and gaps addressed. Through the global implementation of the Security Code, the Company has permanently heightened the level of security – not just in the United States, but worldwide. The Company employs several hundred employees and contractors in its Emergency Services and Security department worldwide. In 2019, the Company established its Global Security Operations Center (\"GSOC\") to provide 24-hour/day, 365-day/year real-time monitoring of global risks to Dow assets and people. The GSOC employs state-of-the-art social media monitoring, threat reporting and geo-fencing capabilities to analyze global risks and report those risks, facilitating decision-making and actions to prevent Dow crises.\nThrough the implementation of the Security Code, including voluntary security enhancements and upgrades, the Company is well-positioned to comply with U.S. chemical facility regulations and other regulatory security frameworks. The Company participates with the American Chemistry Council to periodically review and update the Security Code.\nThe Company continues to work collaboratively across the supply chain on Responsible Care\n®\n, supply chain design, emergency preparedness, shipment visibility and transportation of hazardous materials. The Company cooperated with public and private entities to lead the implementation of advanced tank car design, and track and trace technologies. Further, the Company’s Distribution Risk Review process addresses potential threats in all modes of transportation across the Company’s supply chain. To reduce vulnerabilities, the Company maintains security measures that meet or exceed regulatory and industry security standards in all areas in which they operate.\n54\nTable of Contents\nThe Company's initiatives relative to chemical security, emergency preparedness and response, Community Awareness and Emergency Response and crisis management are implemented consistently at all Dow sites on a global basis. Each Dow site has established outreach programs designed to engage community stakeholders with objectives centered around awareness of Dow operations, products, and efforts to protect worker and community health and the environment. These programs also educate community members on emergency planning and response, emissions and waste, future site plans to reduce waste and emissions, and process safety systems. Finally, these outreach efforts establish an opportunity for Dow site leaders to hear about community stakeholder expectations and address questions and concerns about safety, health, environmental or other issues. The Company participates with chemical associations globally and participates as an active member of the Global Congress on Chemical Security and Emerging Threats and in positions of leadership in the U.S. Chemical Sector Coordinating Council.\nClimate Protection \nEvaluation of climate-related risks and opportunities continues to be a catalyst for the development of the Company’s Decarbonize & Grow strategy (Dow’s climate transition plan), its broad water stewardship efforts and its new nature goal. Dow's science-based strategy includes a phased approach to decarbonize while meeting the growing demand for Dow's products and contributing to a low-emissions future through continued investment in new products, technologies and processes. \nIn 2020, Dow set a target to be carbon neutral by 2050 across Scopes 1, 2 and 3, as defined by the Greenhouse Gas Protocol Corporate Accounting and Reporting Standard, plus product benefits. Dow’s Protect the Climate goals include reducing net annual GHG emissions by 5 million metric tons by 2030 versus its 2020 baseline, representing approximately a 15 percent reduction versus 2020 and a nearly 30 percent reduction since 2005. In 2021, Dow outlined a path to decarbonize its production processes (Scope 1 and 2 CO\n2\ne emissions), utilizing a phased approach in which end-of-life capacity is replaced with higher-efficiency, lower GHG emitting assets. In 2024, Dow continued near-term progression in its Decarbonize & Grow strategy by starting construction of its Fort Saskatchewan Path2Zero project which will be the world’s first net-zero Scope 1 and 2 emissions ethylene complex, when completed, and will decarbonize approximately 20 percent of Dow’s global ethylene production capacity. Dow also continued to advance a project with X-energy, a nuclear energy innovation company, to commercialize an advanced small modular nuclear reactor that will generate GHG emissions-free process heat and energy at its site in Seadrift, Texas. In the near term, energy reduction and optimization projects will provide continuous progress toward Dow’s carbon-neutral ambitions.\nDow is also committed to advancing water stewardship within the Company's operations and supply chain and with downstream customers and to working collaboratively to enhance water management at the watershed level. In addition to Dow's target to reduce freshwater intake intensity at six key water-stressed sites by 20 percent from its 2015 baseline by the end of 2025, Dow announced in 2024 a robust new 2050 water resilience strategy as well as a 50,000 acre habitat conservation target to address these key elements of climate adaptation.\nDespite these commitments, climate change-related risks and uncertainties, legal or regulatory responses to climate change, and failure to meet climate change commitments could negatively impact Dow’s results of operations, financial condition and/or reputation. Climate-related risks include both physical and transition risks.\nPhysical Risks\nClimate-related physical risks include more frequent severe weather events, potential changes in precipitation patterns, water scarcity and extreme variability in weather patterns, which can disrupt the operations of the Company as well as those of its customers, partners and vendors.\nTo evaluate physical risks, Dow partnered with S&P Global Trucost (“Trucost”) to assess the Company’s exposure to physical risks based on the geographic location of its manufacturing operations. The risks assessed included water stress, flood, heat waves, cold waves, hurricanes, wildfires and sea level rise. The analysis included an assessment of the physical risks using a baseline year of 2020 with time periods for medium- (year 2030) and long-term (year 2050) using the Intergovernmental Panel on Climate Change representative concentration pathways. These pathways represent varying degrees of global atmospheric GHG concentrations (low, medium and high), and thus different expectations on global temperature rise. Results will be incorporated into Dow’s long-term assessments of its manufacturing sites, which is a key input into Dow’s capital approval process.\n55\nTable of Contents\nTransition Risks\nClimate-related transition risks include the availability, development and affordability of lower GHG emissions technology, the effects of CO\n2\ne pricing, and changes in public sentiment, regulations, taxes, public mandates or requirements as they relate to CO\n2\ne, water or land use.\nClimate-related risks, including both physical and transition risks, are assessed with input from internal and external sources including corporate, business, function and geographic leaders; subject matter experts; investors; and other stakeholders. The evaluation of climate-related risks and opportunities is integrated into an annual company-wide risk management process, known as enterprise risk management (“ERM”). ERM identifies significant or major risks to the Company and develops action plans to modify or mitigate risks.\nEvery few years, Dow also utilizes a robust scenario analysis to assess the long-term materiality and impact of climate-related risks and opportunities. Scenario analysis is used to challenge business-as-usual assumptions and strengthen the resiliency of the Company’s Decarbonize & Grow strategy. Scenarios are used to evaluate both physical and transition risk and are particularly useful in evaluating the potential and impact of emerging risks.\nManaging Climate Risks\nManagement of climate risk is assigned to Dow’s Climate Steering Team (“CST”), which is accountable for developing and implementing plans to mitigate risk and for tracking actions and progress against those plans. With oversight and accountability by the CST, specific carbon-related risks are managed by Dow’s Climate Program Management Office (“PMO”). The PMO partners with subject matter experts to develop and implement strategies to mitigate or eliminate climate-related risks. The team develops specific action plans and ensures owners are assigned to drive forward progress in order to reduce Dow’s risk exposure. Risk mitigation status updates are provided to executive leaders on a regular basis and discussions include risk time horizons and/or magnitude of impact to confirm that the strategy remains solid.\nDecarbonize & Grow\nDow’s Decarbonize & Grow strategy involves specific actions to mitigate identified climate-related physical and transition risks, while also advancing opportunities in several key areas. These include:\n•\nOptimizing Manufacturing Facilities and Processes for Sustainability: In addition to implementing near-term growth and efficiency investments, Dow is phasing out inefficient assets, decarbonizing remaining assets and building best-in-class, net-zero assets, as well as investing in innovative technologies such as clean hydrogen, advanced nuclear and carbon capture and storage. Dow has committed to investing approximately $1 billion in annual capital across the economic cycle to decarbonize assets in a phased approach, while growing capacity.\n•\nIncreasing Use of Clean Energy and Steam: As a major user and producer of energy, Dow is committed to reducing the use of fossil fuels for energy production and increasing consumption of clean energy, including both renewable and net-zero-emissions sources.\n•\nDeveloping Low-Emissions Products, Technologies and Services: As a leading materials science company, Dow products are capable of making important contributions to the reduction of GHG emissions, including products that facilitate energy efficiency, lightweighting, fuel transition, circularity, increased operational efficiency and resource reductions.\n•\nDeveloping Next Generation, Low-Carbon Manufacturing Technologies: Dow is investing in longer-term, future-focused manufacturing technologies that will be critical in the decarbonization of the Company's manufacturing.\n•\nBuilding a Value-Generating Scope 3 Decarbonization Pathway: Approximately 70 percent of Dow’s emissions footprint fall into Scope 3 categories and more than half of those emissions derive from the raw materials, transportation and other services purchased as a company. Dow is actively validating and developing Scope 3 emissions reduction and mitigation efforts. Collaboration with the Company’s partners along the entire value chain is key to lowering Scope 3 carbon emissions.\nWater Stewardship\nWater is Dow’s largest dependency on nature. Water-related risk considers water availability (too much, too little), water quality (intake and effluents), access to safe drinking water, health of ecosystems and reputational and regulatory challenges. Dow’s approach to identifying water-related risks and impacts includes identification of \n56\nTable of Contents\nphysical, regulatory and reputational risks. Dow’s methodology uses scientifically robust external tools such as WRI Aqueduct and the World Wildlife Fund water risk filter tool. Dow’s actions are also informed by the Trucost physical risk assessment, wherein water scarcity is recognized and addressed as the biggest climate-related threat to corporate assets with potential substantive financial or strategic impact on business.\nDow’s water risk management approach recognizes that every site and every business is accountable for water and certain watersheds require additional measures to address specific water stress challenges. Many Dow locations have specific water action plans to address local challenges, and Dow's new water strategy calls for water stewardship plans at its 20 water-dependent sites by 2030 and for all manufacturing sites by 2035. These action plans include mitigations for local water scarcity or quality issues and consider the needs of other local users for freshwater. Additionally, in 2015 Dow identified six sites, located in Texas (2); Bahia Blanca, Argentina; Terneuzen, The Netherlands; Böhlen, Germany; and Tarragona, Spain; where its operations are located in a water-stressed watershed, have local water quality issues, have competition among local users for water, or have some local knowledge of watershed challenges, and these six sites have since been the focus of Company actions. In 2024, the Company secured the use of a reservoir asset at one of its main U.S. Gulf Coast manufacturing sites, with a 35-year contract period that is expected to commence upon completion of construction in 2028. \nIn addition to site water stewardship efforts, Dow will work with suppliers to understand and mitigate water and biodiversity impacts and dependencies in its supply chain and will continue to innovate products that enable society to have reduced impacts on water bodies and other ecosystems.\nAccountability for operational water stewardship begins at the site level where the operating permits exist. The Company's progress against its broader water and nature targets is reviewed regularly by management and with the EHS&T Committee of the Board. \nAdvancing a Circular Economy\nSince Dow is only one part of the materials ecosystem, Dow advocates for the adoption of policies to accelerate the broader pathway to circularity. Circularity-enabling policies such as recycling mandates; mandates for recycled content in products; extended producer responsibility systems to finance state-of-the-art local access to collection, sorting and recycling; and policies to incentivize investments in innovative circular technologies are all critical to ensure that post-use products are diverted away from landfilling, incineration, open dumps and open burning and instead enter the circular economy. To accelerate the materials ecosystem, Dow is working toward its Transform the Waste target collectively with partners. The goal is to boost recycling rates for materials by developing the associated ecosystems to increase collection, sorting and recycling. As part of Dow’s sustainability targets, Dow intends to transform waste and alternative feedstocks to commercialize 3 million metric tons per year of circular and renewable solutions by 2030.\nAlthough the volume base is fairly small today, circular products are seeing increasing promise with commercially attractive growth rates, and Dow expects this market to gain an increasingly larger market share over the coming decades, as supporting policies, technology and economics improve. Dow is partnering to build industrial ecosystems to collect, reuse or recycle waste and expand its portfolio to meet rapidly growing demand for circular solutions. Further, Dow is redesigning product formulations in order to use circular feedstocks such as waste and renewable materials, thereby reducing the reliance on virgin fossil feedstocks.\nA circular economy requires embedding circularity in all parts of the value chains downstream from Dow. This includes product design for recyclability, accessible collection, sorting and recycling facilities, and appropriate economic incentives to make recycling economically viable. Through innovative developments, combined with partnerships and value chain collaboration, Dow is assisting its customers to design downstream applications for recyclability.\nDeveloping Safer Materials\nChemistry-based products provide many benefits to society. Like any product, they must be managed responsibly to minimize any potential adverse effects on humans or the environment. Dow takes this responsibility seriously and works hard to ensure that its products are designed, stored, transported, used, disposed of, or recycled in a manner that shows high regard for human health, safety and environmental stewardship.\nDow utilizes the Company’s strong innovation pipeline to develop safer materials or reduce or eliminate priority substances in its products. Dow also invests in clean upstream manufacturing technologies to reduce facility emissions and, where necessary, restricts downstream uses of some substances.\n57\nTable of Contents\nAt Dow, material safety is a continuous journey made possible through innovation, design and more predictive, enabling technologies. Dow works to offer products that – if used properly and in the manner intended – pose low risk to the environment, health and safety, and seeks to optimize products so they use resources more efficiently and sustainably.\nDow is working to deliver a sustainable future through its materials science expertise and collaboration with its customers. By constantly innovating how it sources, manufactures and delivers material solutions, Dow helps customers achieve their goals and create a better tomorrow. Dow also transparently communicates information on substances to customers via safety data sheets, regulatory data sheets and, in some cases, product handling guides.\nDow is committed to demonstrating the value of chemistry and materials science to society and improving the way the world understands and considers science in decision-making to maximize benefits to businesses, society and the planet. Through Dow’s 2025 Safe Materials for a Sustainable Planet goal, the Company has made progress toward this vision by innovating sustainable materials of tomorrow, leading candid conversations about product safety and committing to the advancement of open and transparent chemistry with value chain partners, customers and the public.\nEnvironmental Remediation\nFor comparison of environmental remediation-related matters for the fiscal years ended December 31, 2023 and 2022, see Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on January 31, 2024.\nThe Company accrues the costs of remediation of its facilities and formerly owned facilities based on current law and regulatory requirements. The nature of such remediation can include management of soil and groundwater contamination. The accounting policies adopted to properly reflect the monetary impacts of environmental matters are discussed in Note 1 to the Consolidated Financial Statements. To assess the impact on the financial statements, environmental experts review currently available facts to evaluate the probability and scope of potential liabilities. Inherent uncertainties exist in such evaluations primarily due to unknown environmental conditions, changing governmental regulations and legal standards regarding liability, and the ability to apply remediation technologies. These liabilities are adjusted periodically as remediation efforts progress or as additional technical or legal information becomes available. The Company had an accrued liability of $879 million at December 31, 2024, related to the remediation of current or former Dow-owned sites. At December 31, 2023, the liability related to remediation was $939 million.\nIn addition to current and former Dow-owned sites, under the federal Comprehensive Environmental Response, Compensation and Liability Act (\"CERCLA\") and equivalent state laws (hereafter referred to collectively as \"Superfund Law\"), the Company is liable for remediation of other hazardous waste sites where the Company allegedly disposed of, or arranged for the treatment or disposal of, hazardous substances. Because Superfund Law imposes joint and several liability upon each party at a site, the Company has evaluated its potential liability in light of the number of other companies that have also been named potentially responsible parties (“PRPs”) at each site, the estimated apportionment of costs among all PRPs, and the financial ability and commitment of each to pay its expected share. The Company’s remaining liability for the remediation of Superfund sites was $234 million at December 31, 2024 ($241 million at December 31, 2023). The Company has not recorded any third-party recovery related to these sites as a receivable.\n58\nTable of Contents\nInformation regarding environmental sites is provided below:\nEnvironmental Sites\nDow-owned Sites \n1\nSuperfund Sites \n2\n2024\n2023\n2024\n2023\nNumber of sites at Jan 1\n154 \n171 \n133 \n130 \nSites added during year\n2 \n6 \n1 \n4 \nSites closed during year\n— \n(23)\n(3)\n(1)\nNumber of sites at Dec 31\n156 \n154 \n131 \n133 \n1.\nDow-owned sites are sites currently or formerly owned by the Company. In the United States, remediation obligations are imposed by the Resource Conservation and Recovery Act or analogous state law. At December 31, 2024, 25 of these sites (24 sites at December 31, 2023) were formerly owned by Dowell Schlumberger, Inc., a group of companies in which the Company previously owned a 50 percent interest. The Company sold its interest in Dowell Schlumberger in 1992.\n2.\nSuperfund sites are sites, including sites not owned by the Company, where remediation obligations are imposed by Superfund Law.\nAdditional information is provided below for the Company’s Midland, Michigan, manufacturing site and Midland off-site locations (collectively, the \"Midland sites\"), as well as a Superfund site in Wood-Ridge, New Jersey, the locations for which the Company has the largest potential environmental liabilities.\nIn the early days of operations at the Midland manufacturing site, wastes were usually disposed of on-site, resulting in soil and groundwater contamination, which has been contained and managed on-site under a series of Resource Conservation and Recovery Act permits and regulatory agreements\n.\n The Hazardous Waste Operating License for the Midland manufacturing site, issued in 2003, and renewed and replaced in September 2015, also included provisions for the Company to conduct an investigation to determine the nature and extent of off-site contamination from historic Midland manufacturing site operations. In January 2010, the Company, the U.S. Environmental Protection Agency (\"EPA\") and the State of Michigan (\"State\") entered into an Administrative Order on Consent that requires the Company to conduct a remedial investigation, a feasibility study and a remedial design for the Tittabawassee River, the Saginaw River and the Saginaw Bay, and pay the oversight costs of the EPA and the State under the authority of CERCLA. See Note 15 to the Consolidated Financial Statements for further information relating to Midland off-site environmental matters.\nRohm and Haas, a wholly owned subsidiary of the Company, is a PRP at the Wood-Ridge, New Jersey, Ventron/Velsicol Superfund Site, and the adjacent Berry’s Creek Study Area (\"BCSA\") (collectively, the \"Wood-Ridge sites\"). Rohm and Haas is a successor in interest to a company that owned and operated a mercury processing facility, where wastewater and waste handling resulted in contamination of soils and adjacent creek sediments. In 2018, the Berry’s Creek Study Area Potentially Responsible Party Group (“PRP Group”), consisting of over 100 PRPs, completed a Remedial Investigation/Feasibility Study for the BCSA. During that time, the EPA concluded that an “iterative or adaptive approach” was appropriate for cleaning up the BCSA. Thus, each phase of remediation will be followed by a period of monitoring to assess its effectiveness and determine if there is a need for more work. In September 2018, the EPA signed a Record of Decision (\"ROD 1\") which describes the initial phase of the EPA’s plan to clean-up the BCSA. ROD 1 will remediate waterways and major tributaries in the most contaminated part of the BCSA. The PRP Group has signed agreements with the EPA to design the selected remedy. Although there is currently much uncertainty as to what will ultimately be required to remediate the BCSA and Rohm and Haas's share of these costs has yet to be determined, the range of activities that are required in the interim Record of Decision is known in general terms. The PRP Group has been approached by the EPA to convene discussions for the Remedial Action Consent Decree the EPA is preparing for the Berry’s Creek Site. The group submitted the 95 percent design for EPA review and has identified and contracted with a Remedial Action contractor to support completion of the 100 percent design. Allocation remains incomplete.\nAt December 31, 2024, the Company had accrued liabilities totaling $303 million ($319 million at December 31, 2023) for environmental remediation at the Midland and Wood-Ridge sites. In 2024, the Company spent $45 million ($48 million in 2023) for environmental remediation at the Midland and Wood-Ridge sites.\nIn total, the Company’s accrued liability for probable environmental remediation and restoration costs was $1,113 million at December 31, 2024, compared with $1,180 million at December 31, 2023. This is management’s best estimate of the costs for remediation and restoration with respect to environmental matters for which the Company has accrued liabilities, although it is reasonably possible that the ultimate cost with respect to these particular matters could range up to approximately two times that amount. Consequently, it is reasonably possible that environmental remediation and restoration costs in excess of amounts accrued could have a material impact on \n59\nTable of Contents\nthe Company’s results of operations, financial condition and cash flows. It is the opinion of the Company’s management, however, that the possibility is remote that costs in excess of the range disclosed will have a material impact on the Company’s results of operations, financial condition and cash flows.\nThe amounts charged to income on a pretax basis related to environmental remediation totaled $197 million in 2024 and $203 million in 2023. The amounts charged to income on a pretax basis related to operating the Company's current pollution abatement facilities, excluding internal recharges, totaled $823 million in 2024 and $758 million in 2023. Capital expenditures for environmental protection were $208 million in 2024 and $228 million in 2023. \nAsbestos-Related Matters of Union Carbide Corporation\nUnion Carbide is and has been involved in a large number of asbestos-related suits filed primarily in state courts during the past several decades. These suits principally allege personal injury resulting from exposure to asbestos-containing products and frequently seek both actual and punitive damages. The alleged claims primarily relate to products that Union Carbide sold in the past, alleged exposure to asbestos-containing products located on Union Carbide’s premises, and Union Carbide’s responsibility for asbestos suits filed against a former Union Carbide subsidiary, Amchem. In many cases, plaintiffs are unable to demonstrate that they have suffered any compensable loss as a result of such exposure, or that injuries incurred in fact resulted from exposure to Union Carbide’s products.\nFor comparison of asbestos-related matters of Union Carbide Corporation for the fiscal years ended December 31, 2023 and 2022, see Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on January 31, 2024.\nThe table below provides information regarding asbestos-related claims pending against Union Carbide and Amchem based on criteria developed by Union Carbide and its external consultants:\nAsbestos-Related Claim Activity\n2024\n2023\nClaims unresolved at Jan 1\n6,367 \n6,873 \nClaims filed\n4,568 \n4,199 \nClaims settled, dismissed or otherwise resolved\n(5,122)\n(4,705)\nClaims unresolved at Dec 31\n5,813 \n6,367 \nClaimants with claims against both Union Carbide and Amchem\n(1,005)\n(1,236)\nIndividual claimants at Dec 31\n4,808 \n5,131 \nPlaintiffs’ lawyers often sue numerous defendants in individual lawsuits or on behalf of numerous claimants. As a result, the damages alleged are not expressly identified as to Union Carbide, Amchem or any other particular defendant, even when specific damages are alleged with respect to a specific disease or injury. For these reasons and based upon Union Carbide’s litigation and settlement experience, Union Carbide does not consider the damages alleged against Union Carbide and Amchem to be a meaningful factor in its determination of any potential asbestos-related liability.\nFor additional information see Part I, Item 3. Legal Proceedings and Asbestos-Related Matters of Union Carbide Corporation in Note 15 to the Consolidated Financial Statements. \n60\nTable of Contents",
  "item2": null
}