{
  "item1": "* Europe, Middle East, Africa India (\"EMEAI\") Major applications/market segments products listed below business: Applications/Market Segments Hydrocarbons & Energy Purchaser feedstocks; production cost competitive hydrocarbon monomers utilized Dow's derivative businesses; energy, principally use Dow’s global operations Ethylene, propylene, benzene, butadiene, octene, aromatics co-products, power, steam, other utilities Butane, condensate, ethane, naphtha, natural gas, propane Chevron Phillips Chemical, ExxonMobil, INEOS, LyondellBasell, SABIC, Shell, Sinopec Packaging Specialty Plastics Adhesives; automotive; caps, closures pipe applications; construction; cosmetics; electrical transmission distribution; food supply chain packaging; footwear; health hygiene; housewares; industrial specialty applications using polyolefin elastomers, ethylene copolymers, EPDM; irrigation pipe; mobility; photovoltaic encapsulants; sporting goods; telecommunications infrastructure; toys infant products Acrylics, bio-based plasticizers, copolymer, elastomers, ethylene copolymer resins, EPDM, ethylene vinyl acetate (\"EVA\"), methacrylic acid copolymer resins, polyethylene (\"PE\"), high-density polyethylene (\"HDPE\"), low-density polyethylene (\"LDPE\"), linear low-density polyethylene (\"LLDPE\"), polyolefin plastomers, resin additives modifiers, semiconductive jacketing compound solutions wire cable insulation Aliphatic solvent, butene, ethylene, hexene, octene, propylene Borealis, ExxonMobil, INEOS, Lanxess, LyondellBasell, Nova, SABIC segment includes portion Company's share results following joint ventures: EQUATE Petrochemical Company K.S.C.C. (“EQUATE”) - Kuwait-based company manufactures ethylene, polyethylene ethylene glycol, manufactures markets monoethylene glycol, diethylene glycol polyethylene terephthalate resins; owned 42.5 percent Company. Kuwait Olefins Company K.S.C.C. (“TKOC”) - Kuwait-based company manufactures ethylene ethylene glycol; owned 42.5 percent Company.",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS STATEMENT CURRENCY EXCHANGE RATES Company's global business operations give rise market risk exposure related changes foreign currency exchange rates international capital flows may affected extensive regulations controls, especially developing highly inflationary countries such Argentina. Company continues monitor these situations take appropriate actions necessary manage financial impact pursuant established guidelines policies. If Company unable manage certain exposures cost-effective manner could significant negative impact its future results operations cash flows.",
  "item2": "sold receivables outstanding. See Note 12 Consolidated Financial Statements additional information. Company maintains these facilities also participates certain customers’ supply chain financing other early pay programs routine source working capital. Company-Owned Life Insurance Company investments company-owned life insurance (\"COLI\") policies, which recorded cash surrender value each balance sheet date."
}