{
  "source_file": "dri-20250824.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe discussion and analysis below for the Company, which contains forward-looking statements, should be read in conjunction with the unaudited consolidated financial statements and the notes to such financial statements included elsewhere in this quarterly report on Form 10-Q (Form 10-Q) and the audited consolidated financial statements and the notes thereto included in our Form 10-K for the fiscal year ended May 25, 2025 (Form 10-K). In addition to historical consolidated financial information, this discussion contains forward-looking statements that reflect our plans, estimates, and beliefs and involve numerous risks and uncertainties, including but not limited to those described in the “Item 1A. Risk Factors” section of the Form 10-K. Actual results may differ materially from those contained in any forward-looking statements. You should carefully read “Forward-Looking Statements” included below in this Form 10-Q. \nTo facilitate review of our discussion and analysis, the following table sets forth our financial results for the periods indicated. All information is derived from the unaudited consolidated statements of earnings for the three months ended August 24, 2025 and August 25, 2024.\n \n \n \nThree Months Ended\n(in millions)\nAugust 24,\n2025\nAugust 25,\n2024\n% Chg\nSales\n$\n3,044.7 \n$\n2,757.0 \n10.4%\nCosts and expenses:\nFood and beverage\n929.1 \n846.7 \n9.7\nRestaurant labor\n988.0 \n889.3 \n11.1\nRestaurant expenses\n504.2 \n453.7 \n11.1\nPre-opening costs\n5.9 \n4.5 \n31.1\nMarketing expenses\n49.1 \n44.7 \n9.8\nGeneral and administrative expenses\n136.1 \n126.4 \n7.7\nDepreciation and amortization\n135.1 \n121.5 \n11.2\nImpairments and (gain) loss on disposal of assets, net\n(42.0)\n1.0 \nNM\nTotal costs and expenses\n$\n2,705.5 \n$\n2,487.8 \n8.8\nOperating income \n339.2 \n269.2 \n26.0\nInterest, net\n45.4 \n37.1 \n22.4\nEarnings before income taxes\n$\n293.8 \n$\n232.1 \n26.6\nIncome tax expense (1)\n35.9 \n24.5 \n46.5\nEarnings from continuing operations\n$\n257.9 \n$\n207.6 \n24.2\nLosses from discontinued operations, net of tax\n(0.1)\n(0.4)\n(75.0)\nNet earnings \n$\n257.8 \n$\n207.2 \n24.4%\nDiluted net earnings per share:\nEarnings from continuing operations\n$\n2.19 \n$\n1.74 \n25.9%\nLosses from discontinued operations\n— \n— \nNM\nNet earnings \n$\n2.19 \n$\n1.74 \n25.9%\n(1) Effective tax rate\n12.2 \n%\n10.6 \n%\nNM- Percentage not considered meaningful.\n24\nTable of Contents\nThe following table details the number of company-owned restaurants currently reported in continuing operations that were open at the end of the first quarter of fiscal 2026, compared with the number open at the end of fiscal 2025 and the end of the first quarter of fiscal 2025.\n \nAugust 24,\n2025\nMay 25,\n2025\nAugust 25,\n2024\nOlive Garden\n1\n933 \n935 \n923 \nLongHorn Steakhouse\n595 \n591 \n577 \nCheddar’s Scratch Kitchen\n182 \n181 \n181 \nChuy’s\n2\n108 \n108 \n— \nYard House\n89 \n88 \n88 \nRuth’s Chris\n82 \n82 \n82 \nThe Capital Grille\n73 \n71 \n68 \nSeasons 52\n43 \n43 \n44 \nEddie V’s\n29 \n29 \n29 \nBahama Breeze\n28 \n28 \n44 \nThe Capital Burger\n3 \n3 \n4 \nTotal\n2,165 \n2,159 \n2,040 \n          \n1 \nDuring the first quarter of fiscal 2026, we sold eight Olive Garden Canada locations.\n2 \nIncludes 103 Chuy’s locations acquired during the second quarter of fiscal 2025.\nOVERVIEW OF OPERATIONS\nOur business operates in the full-service dining segment of the restaurant industry. At August 24, 2025, through subsidiaries, we owned and operated 2,165 restaurants in the United States under the Olive Garden®, LongHorn Steakhouse®, Cheddar’s Scratch Kitchen®, Chuy’s®, Yard House®, Ruth’s Chris Steak House® (Ruth’s Chris), The Capital Grille®, Seasons 52®, Eddie V’s Prime Seafood® (Eddie V’s), Bahama Breeze®, and The Capital Burger® trademarks. We own and operate all of our restaurants in the United States, except for 5 restaurants we manage through joint venture or other contractual agreements and 85 franchised restaurants. We also have 77 franchised restaurants in operation located in Canada, Latin America, the Caribbean, Asia, and the Middle East\nOn our June 2025 earnings call, we announced the decision to explore strategic alternatives for the Bahama Breeze brand, which includes 28 locations owned and operated by Darden and one franchise location. We are exploring a sale of the brand or conversions of some or all locations to other Darden brands. \nDuring the second quarter of fiscal 2025, we entered into an exclusive multi-year delivery arrangement with Uber Technologies, Inc. (Uber), which enables our guests to order delivery via Darden restaurant channels, with delivery handled by Uber. During fiscal 2025 and the first quarter of 2026, we rolled the program out to nearly all Olive Garden and Cheddar’s Scratch Kitchen locations.\nFinancial Highlights - Consolidated                                                                                        \n•\nTotal sales increased 10.4 percent to $3.04 billion for the first three months of fiscal 2026 compared to $2.76 billion for the first three months of fiscal 2025 driven by sales from 125 net new restaurants, including the acquisition of 103 Chuy’s restaurants on October 11, 2024, and a blended same-restaurant sales increase of 4.7 percent.\n1\n•\nOur net earnings from continuing operations were $257.9 million for the first three months of fiscal 2026 compared to $207.6 million for the first three months of fiscal 2025.\n•\nReported diluted net earnings per share from continuing operations were $2.19 for the first three months of fiscal 2026 compared to $1.74 for the first three months of fiscal 2025.\nOutlook\nOn July 14, 2025, we closed on the sale of eight Olive Garden locations in Canada to Recipe Unlimited Corporation (Recipe). All gains and losses on disposition have been aggregated in impairments and (gain) loss on disposal of assets, net on our consolidated statement of earnings. See Note 8 to our unaudited consolidated financial statements in Part I, Item 1 of Form \n25\nTable of Contents\n10-Q for additional information. At closing, Darden and Recipe entered into an area development and franchise agreement, pursuant to which Recipe will operate under the Olive Garden tradename and will pay royalties for use of the tradename.\nWe expect sales growth for fiscal 2026 to be between 7.5 and 8.5 percent, driven by growth of 2.0 percent related to the fifty-third week, same-restaurant sales growth to be between 2.5 and 3.5 percent\n2\n and approximately 65 new restaurant openings. Additionally, we expect capital expenditures incurred to build new restaurants, remodel and maintain existing restaurants and for technology initiatives to be between $700 and $750 million.  These amounts all include the addition of Chuy’s and our expectations for Chuy’s results from the date of acquisition forward.\n1\n Will not include Chuy's until they have been owned and operated by Darden for a 16-month period (Q4 fiscal 2026), and does not include Bahama Breeze as they are not expected to be operated by Darden for the entirety of the fiscal year.\n2\n Annual same-restaurant sales is a 52-week metric and excludes the impact of Chuy’s, which will not have been owned and operated by Darden for a 16-month period prior to the beginning of fiscal 2026, and does not include Bahama Breeze as they are not expected to be operated by Darden for the entirety of the fiscal year.\n SALES\nThe following table presents our sales by segment for the periods indicated.\nThree Months Ended\n(in millions)\nAugust 24, 2025\nAugust 25, 2024\n% Chg\nSRS \n(1)\nOlive Garden\n$\n1,301.1 \n$\n1,209.1 \n7.6 \n%\n5.9 \n%\nLongHorn Steakhouse\n$\n776.4 \n$\n713.5 \n8.8 \n%\n5.5 \n%\nFine Dining\n$\n286.5 \n$\n278.9 \n2.7 \n%\n(0.2)\n%\nOther Business\n$\n680.7 \n$\n555.5 \n22.5 \n%\n3.3 \n%\n(1)\nSame-restaurant sales is a year-over-year comparison of each period’s sales volumes for a 52 week year and is limited to restaurants that have been open, and operated by Darden, for at least 16 months.  Accordingly, Chuy’s results will not be included in this calculation until the fourth quarter of fiscal 2026.  Additionally, results from Bahama Breeze are excluded as they are not expected to be operated by Darden for the entirety of the fiscal year.\nOlive Garden’s sales increase for the first quarter of fiscal 2026 was primarily driven by same-restaurant sales increases, as well as revenue from new restaurants, partially offset by the sale of eight Olive Garden Canada locations. The increase in U.S. same-restaurant sales for the first quarter of fiscal 2026 resulted from a 2.8 percent increase in same-restaurant guest counts, combined with a 3.1 percent increase in average check, which includes a 0.8 increase in off premise catering sales.\nLongHorn Steakhouse’s sales increase for the first quarter of fiscal 2026 was primarily driven by same-restaurant sales increases combined with revenue from new restaurants. The increase in same-restaurant sales for the first quarter of fiscal 2026 resulted from a 2.3 percent increase in average check combined with a 3.2 percent increase in same-restaurant guest counts.\nFine Dining’s sales increase for the first quarter of fiscal 2026 was primarily driven by an increase in average check combined with revenue from new restaurants. The decrease in same-restaurant sales for the first quarter of fiscal 2026 resulted from a 1.0 percent decrease in same-restaurant guest counts, offset by a 0.8 percent increase in average check.\nOther Business’ sales increase for the first quarter of fiscal 2026 was primarily driven by the addition of Chuy’s operating results and revenue from new restaurants. The increase in same-restaurant sales for the first quarter of fiscal 2026 resulted from a 0.9 percent increase in same-restaurant guest counts, combined with a 2.4 percent increase in average check. \n26\nTable of Contents\nCOSTS AND EXPENSES\nThe following table sets forth selected operating data as a percent of sales for the periods indicated. All information is derived from the unaudited consolidated statements of earnings for the quarters ended August 24, 2025 and August 25, 2024.\n \n \n \nThree Months Ended\n \nAugust 24, 2025\nAugust 25, 2024\nSales\n100.0 \n%\n100.0 \n%\nCosts and expenses:\nFood and beverage\n30.5 \n30.7 \nRestaurant labor\n32.4 \n32.3 \nRestaurant expenses\n16.6 \n16.5 \nPre-opening costs\n0.2 \n0.2 \nMarketing expenses\n1.6 \n1.6 \nGeneral and administrative expenses\n4.5 \n4.6 \nDepreciation and amortization\n4.4 \n4.4 \nImpairments and (gain) loss on disposal of assets, net\n(1.4)\n— \nTotal operating costs and expenses\n88.9 \n%\n90.2 \n%\nOperating income \n11.1 \n9.8 \nInterest, net\n1.5 \n1.3 \nEarnings before income taxes\n9.6 \n8.4 \nIncome tax expense\n1.2 \n0.9 \nEarnings from continuing operations\n8.5 \n%\n7.5 \n%\nThree Months Ended August 24, 2025 Compared to Three Months Ended August 25, 2024\n \n•\nFood and beverage costs decreased as a percent of sales primarily due to a 0.7% impact from pricing leverage, partially offset by a 0.5% impact from inflation.\n•\nRestaurant labor costs increased as a percent of sales primarily due to a 1.0% impact from inflation and a 0.3% impact from higher performance-based compensation expense including a higher 401k match for our restaurant teams, partially offset by a 0.7% impact from pricing leverage, a 0.2% impact from productivity and a 0.2% impact from brand mix.\n•\nRestaurant expenses increased as a percent of sales primarily due to a 0.5% impact from inflation, a 0.3% impact from Uber direct fees and a 0.3% impact from brand mix, partially offset by a 0.7% impact from sales leverage and a 0.2% impact from other.\n•\nPre-opening costs remained flat as a percent of sales.\n•\nMarketing expenses remained flat as a percent of sales.\n•\nGeneral and administrative expenses decreased as a percent of sales primarily due to a 0.5% impact from sales leverage including synergies realized from the Chuy’s transaction, partially offset by a 0.2% impact from Chuy’s transaction and integration costs, a 0.1% impact from mark to market adjustments and a 0.1% impact from inflation.\n•\nDepreciation and amortization expenses remained flat as a percent of sales.\n•\nImpairment and (gain) loss on disposal of assets, net increased as a percent of sales due to the gain on sale of the eight Olive Garden Canada locations.\nINTEREST EXPENSE\nNet interest expense increased as a percent of sales for the first three months of fiscal 2026 primarily due to financing related to the Chuy’s acquisition. See Liquidity and Capital Resources for a description of our senior notes issuance to finance the Chuy’s acquisition.\n27\nTable of Contents\nIN\nC\nOME TAXES\nThe effective income tax rate for continuing operations for the three months ended August 24, 2025 was 12.2 percent compared to an effective income tax rate for the three months ended August 25, 2024 of 10.6 percent.  The increase in the tax rate is primarily driven by higher net earnings from continuing operations, offset by the mark to market impacts on hedges related to our deferred compensation programs.\nH.R. 1., also known as the One Big Beautiful Bill Act (OBBBA), was enacted on July 4, 2025. The legislation included several provisions that impact the timing and magnitude of certain tax deductions, including restoring 100% bonus depreciation for qualifying property and the immediate expensing of domestic research and development costs. We have applied the key provisions impacting our financial position for the three months ended August 24, 2025, and will continue to assess the potential impacts on our financial position, results of operations and cash flows as additional guidance from the OBBBA is issued.\nLOSSES FROM DISCONTINUED OPERATIONS \nOn an after-tax basis, losses from discontinued operations for the first three months of fiscal 2026 were $0.1 million ($0.00 per diluted share) compared with losses from discontinued operations for the first three months of fiscal 2025 of $0.4 million ($0.00 per diluted share). \nSEGMENT RESULTS\nWe manage our restaurant brands, Olive Garden, LongHorn Steakhouse, Cheddar’s Scratch Kitchen, Chuy’s, Yard House, Ruth’s Chris, The Capital Grille, Seasons 52, Eddie V’s, Bahama Breeze and The Capital Burger in North America as operating segments. We aggregate our operating segments into reportable segments based on a combination of the size, economic characteristics and sub-segment of full-service dining within which each brand operates. Our four reportable segments are: (1) Olive Garden, (2) LongHorn Steakhouse, (3) Fine Dining and (4) Other Business (see Note 7 to our unaudited consolidated financial statements in Part I, Item 1 of Form 10-Q). \nOur management uses segment profit as the measure for assessing performance of our segments. The following table presents segment profit margin\n1\n for the periods indicated.\nThree Months Ended\nSegment\nAugust 24, 2025\nAugust 25, 2024\nChange\nOlive Garden\n20.6%\n20.7%\n(10)\n BPS\nLongHorn Steakhouse\n17.4%\n18.0%\n(60)\n BPS\nFine Dining\n13.5%\n13.9%\n(40)\n BPS\nOther Business\n16.1%\n15.2%\n90 \n BPS\n1\n Segment profit margin is calculated as (sales less costs of food & beverage, restaurant labor, restaurant expenses and marketing expenses) / sales.  During the fourth quarter of 2025, we changed our reporting of segment profit to exclude pre-opening costs in order to better align with our internal reporting and provide a better representation of restaurant-level operating costs.  Fiscal 2025 figures were recast for comparability.\nThe decrease in Olive Garden’s segment profit margin for the first quarter of fiscal 2026 was driven primarily by  increased restaurant labor costs and restaurant expenses, partially offset by decreased food and beverage costs. The decrease in Longhorn Steakhouse’s segment profit margin for the first quarter of fiscal 2026 was driven primarily by increased restaurant labor and food and beverage costs, primarily due to pricing approximately 100 bps below inflation, partially offset by decreased restaurant expenses and marketing costs. The decrease in Fine Dining’s segment profit margin for the first quarter of fiscal 2026 was driven primarily by increased restaurant labor costs and negative same-restaurant sales, partially offset by lower restaurant expenses and food and beverage costs.  The increase in Other Business’ segment profit margin for the first quarter of fiscal 2026 was driven primarily by the addition of Chuy’s operating results and lower food and beverage and restaurant labor costs, partially offset by higher restaurant expenses and marketing costs. \nSEASONALITY\nOur sales volumes have historically fluctuated seasonally. Our average sales per restaurant are highest in the winter and spring, followed by the fall and summer. Holidays, changes in the economy, severe weather, and the effects of other conditions may impact sales volumes seasonally in some operating regions. Because of the historical seasonality of our business and these other factors, results for any fiscal quarter are not necessarily indicative of the results that may be achieved for the full fiscal year.\n28\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nTypically, cash flows generated from operating activities are our principal source of liquidity, which we use to finance capital expenditures for new restaurants and to remodel and maintain existing restaurants, to pay dividends to our shareholders and to repurchase shares of our common stock. Since substantially all of our sales are for cash and cash equivalents, and accounts payable are generally paid in 5 to 90 days, we are typically able to carry current liabilities in excess of current assets. \nWe currently manage our business and financial ratios to target an investment-grade bond rating, which has historically allowed flexible access to financing at reasonable costs. Our publicly issued long-term debt currently carries the following ratings:\n•\nMoody’s Investors Service “Baa2”; \n•\nStandard & Poor’s “BBB”; and\n•\nFitch “BBB”. \nOur commercial paper has ratings of:\n•\nMoody’s Investors Service “P-2”; \n•\nStandard & Poor’s “A-2”; and \n•\nFitch “F-2”.\n These ratings are as of the date of the filing of this Form 10-Q and have been obtained with the understanding that Moody’s Investors Service, Standard & Poor’s and Fitch will continue to monitor our credit and make future adjustments to these ratings to the extent warranted. The ratings are not a recommendation to buy, sell or hold our securities, may be changed, superseded or withdrawn at any time and should be evaluated independently of any other rating.\nOn October 23, 2023, we entered into a $1.25 billion Revolving Credit Agreement (as amended, Revolving Credit Agreement) with Bank of America, N.A. (BOA), as administrative agent, and the lenders and other agents party thereto. The Revolving Credit Agreement is a senior unsecured credit commitment to the Company and contains customary representations and affirmative and negative covenants (including limitations on liens and subsidiary debt and, prior to the Amendment (as defined below), a maximum consolidated lease adjusted total debt to total capitalization ratio of 0.75 to 1.00) and events of default usual for credit facilities of this type. As of August 24, 2025, we had no outstanding balances and were in compliance with all covenants under the Revolving Credit Agreement. As of August 24, 2025, $142.0 million of commercial paper and $0.2 million of letters of credit were outstanding, and were both backed by this facility. After consideration of commercial paper and letters of credit backed by the Revolving Credit Agreement, as of August 24, 2025, we had $1.10 billion of credit available under the Revolving Credit Agreement.\nLoans under the Revolving Credit Agreement bear interest at a rate of (a) Term SOFR (which is defined, for the applicable interest period, as the Term SOFR Screen Rate two U.S. Government Securities Business Days prior to the commencement of such interest period with a term equivalent to such interest period) plus a Term SOFR adjustment of 0.10 percent plus the relevant margin determined by reference to a ratings-based pricing grid (Applicable Margin), or (b) the base rate (which is defined as the highest of the BOA prime rate, the Federal Funds rate plus 0.500 percent, and the Term SOFR plus 1.00 percent) plus the relevant Applicable Margin. Assuming a “BBB” equivalent credit rating level, the Applicable Margin under the Revolving Credit Agreement is 1.000 percent for Term SOFR loans and 0.000 percent for base rate loans. \nOn September 16, 2024, we entered into Amendment No. 1 (Amendment) to the Revolving Credit Agreement, which replaced the prior financial covenant (which provided for a maximum consolidated total debt to total capitalization ratio) with a new financial covenant requiring us to maintain, measured as of the end of each fiscal quarter, a maximum consolidated leverage ratio of 3.50 to 1.00 (which may be temporarily increased to 4.00 to 1.00 upon our the election as a result of a covered acquisition, subject to customary limitations set forth in the Revolving Credit Agreement). All other material terms and conditions of the Revolving Credit Agreement were unchanged.\nThe Revolving Credit Agreement matures on October 23, 2028, and the proceeds may be used for working capital and capital expenditures, the refinancing of certain indebtedness, certain acquisitions and general corporate purposes.\nAs of August 24, 2025, our outstanding long-term debt consisted principally of:\n•\n$500.0 million of unsecured 3.850 percent senior notes due in May 2027;\n•\n$400.0 million of unsecured 4.350 percent senior notes due in Oct 2027;\n•\n$350.0 million of unsecured 4.550 percent senior notes due in Oct 2029;\n•\n$500.0 million of unsecured 6.300 percent senior notes due in October 2033;\n•\n$96.3 million of unsecured 6.000 percent senior notes due in August 2035;\n•\n$42.8 million of unsecured 6.800 percent senior notes due in October 2037; and\n29\nTable of Contents\n•\n$300.0 million of unsecured 4.550 percent senior notes due in February 2048.\nThe interest rate on our $42.8 million senior notes due in October 2037 is subject to adjustment from time to time if the debt rating assigned to such series of notes is downgraded below a certain rating level (or subsequently upgraded). The maximum adjustment is 2.000 percent above the initial interest rate and the interest rate cannot be reduced below the initial interest rate. As of August 24, 2025, no such adjustments are made to this rate.\nThrough our shelf registration statement on file with the SEC, depending on conditions prevailing in the public capital markets, we may from time to time issue equity securities or unsecured debt securities in one or more series, which may consist of notes, debentures or other evidences of indebtedness in one or more offerings.\nFrom time to time, we or our affiliates, may repurchase our outstanding debt in privately negotiated transactions, open-market transactions or otherwise. Such repurchases, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. The amounts involved may be material.\nFrom time to time, we enter into interest rate derivative instruments. See Note 11 to our unaudited consolidated financial statements in Part I, Item 1 of this report, which is incorporated by reference. \nNet cash flows provided by operating activities from continuing operations increased to $342.5 million for the first three months of fiscal 2026, from $273.2 million for the first three months of fiscal 2025. Net cash flows provided by operating activities include net earnings from continuing operations of $257.9 million and $207.6 million in the first three months of fiscal 2026 and 2025, respectively. Net cash flows provided by operating activities increased in fiscal 2026 primarily due to higher net earnings in fiscal 2026 and the timing of federal income tax payments.\nNet cash flows used in investing activities from continuing operations were $159.3 million for the first three months of fiscal 2026, compared to $149.7 million for the first three months of fiscal 2025. Capital expenditures increased to $174.1 million for the first three months of fiscal 2026 from $145.2 million for the first three months of fiscal 2025, reflecting an increase in new restaurant construction and remodel spend during fiscal 2026. Additionally, the first three months of fiscal 2026 include a portion of the proceeds from the sale of eight Olive Garden Canada locations.\nNet cash flows used in financing activities from continuing operations were $212.2 million for the first three months of fiscal 2026, compared to net cash used in financing activities of $126.7 million for the first three months of fiscal 2025. Net cash flows used in financing activities for the first three months of fiscal 2026 included borrowings of commercial paper of $142.0 million, net, dividends paid of $175.1 million and share repurchases of $182.7 million. Net cash flows used in financing activities for the first three months of fiscal 2025 included dividends paid of $166.0 million and share repurchases of $172.4 million. Dividends declared by our Board of Directors totaled $1.50 and $1.40 per share for the first three months of fiscal 2026 and 2025, respectively.\nWe are not aware of any trends or events that would materially affect our capital requirements or liquidity. We believe that our internal cash-generating capabilities, the potential issuance of equity or unsecured debt securities under our shelf registration statement and short-term commercial paper or drawings under our Revolving Credit Agreement should be sufficient to finance our capital expenditures, debt maturities and other operating activities through fiscal 2026. \nOn June 18, 2025, our Board of Directors authorized a new share repurchase program under which we may repurchase up to $1 billion of our outstanding common stock.  This repurchase program does not have an expiration and replaced the prior share repurchase authorization. During the three months ended August 24, 2025, we repurchased 0.9 million shares of our common stock compared to 1.2 million shares of our common stock during the three months ended August 25, 2024.   \nWe are not a party to any off-balance sheet arrangements that have, or are reasonably likely to have, a current or future material effect on our financial condition, changes in financial condition, sales, costs or expenses, results of operations, liquidity, capital expenditures or capital resources. \nFINANCIAL CONDITION\nOur current assets totaled $932.8 million as of August 24, 2025, compared to $937.7 million as of May 25, 2025.  The decrease was primarily due to a decrease in cash and cash equivalents partially offset by an increase in prepaid income tax.\nOur current liabilities totaled $2.35 billion as of August 24, 2025, compared to $2.25 billion as of May 25, 2025.  The increase was primarily driven by an increase in short term debt partially offset by unearned revenues associated with gift card redemptions in excess of gift card activations.\n30\nTable of Contents\nCRITICAL ACCOUNTING ESTIMATES\nWe prepare our consolidated financial statements in conformity with U.S. generally accepted accounting principles. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of sales, costs and expenses during the reporting period. Actual results could differ from those estimates. We have discussed the development, selection and disclosure of those estimates with the Audit Committee. Our critical accounting estimates have not changed materially from those previously reported in our Annual Report on Form 10-K for the fiscal year ended May 25, 2025.\nAPPLICATION OF NEW ACCOUNTING STANDARDS\nInformation regarding application of new accounting standards is incorporated by reference from Note 1 to our unaudited consolidated financial statements in Part I, Item 1 of this report.\nFORWARD-LOOKING STATEMENTS\nStatements set forth in or incorporated into this report regarding the expected increase in the number of our restaurants  and capital expenditures in fiscal 2026, projections for sales and all other statements that are not historical facts, including without limitation statements with respect to the financial condition, results of operations, plans, objectives, future performance and business of Darden Restaurants, Inc. and its subsidiaries that are preceded by, followed by or that include words such as “may,” “will,” “expect,” “intend,” “anticipate,” “continue,” “estimate,” “project,” “believe,” “plan,” “outlook” or similar expressions, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and are included, along with this statement, for purposes of complying with the safe harbor provisions of that Act. Any forward-looking statements speak only as of the date on which such statements are made, and we undertake no obligation to update such statements for any reason to reflect events or circumstances arising after such date. By their nature, forward-looking statements involve risks and uncertainties that could cause actual results to differ materially from those set forth in or implied by such forward-looking statements. In addition to the risks and uncertainties of ordinary business obligations, and those described in information incorporated into this report, the forward-looking statements contained in this report are subject to the risks and uncertainties described in Part I, Item 1A “Risk Factors” in our Annual Report on Form 10-K for the year ended May 25, 2025 and in our Forms 10-Q (including this report), which are summarized as follows:\n•\nA failure to address cost pressures, including rising costs for commodities, labor, health care and utilities used by our restaurants, and a failure to effectively deliver cost management activities and achieve economies of scale in purchasing;\n•\nCertain economic and business factors and their impacts on the restaurant industry and general macroeconomic factors including unemployment, energy prices, tariffs and interest rates;\n•\nThe inability to hire, train, reward and retain restaurant team members and determine and maintain adequate staffing;\n•\nA failure to recruit, develop and retain effective leaders or the loss or shortage of personnel with key capacities and skills;\n•\nIncreases in labor and insurance costs;\n•\nHealth concerns arising from food-related pandemics, outbreaks of flu, viruses or other diseases;\n•\nFailure to maintain food safety throughout the supply chain and food-borne illness concerns;\n•\nInsufficient guest or employee facing technology or a failure to maintain a continuous or secure cyber network;\n•\nIncreased costs related to compliance with privacy and data protection laws and government enforcement, litigation or adverse publicity relating to potential failures thereof; \n•\nA failure to successfully complete our integration of Chuy’s operations into our business;\n•\nInsufficient or ineffective response to legislation or government regulation may adversely impact our cost structure, operational efficiencies and talent availability; \n•\nIntense competition, or an insufficient strategy or focus, on competition and the consumer landscape; \n•\nChanges in consumer preferences that may adversely affect demand for food at our restaurants;\n•\nAn inability or failure to recognize, respond to and effectively manage the accelerated impact of social media;\n•\nA failure to identify and execute innovative marketing and guest relationship tactics, ineffective or improper use of other marketing initiatives and increased advertising and marketing costs;\n•\nImpacts of climate change, adverse weather conditions and natural disasters;\n•\nThe inability to cancel long-term, non-cancelable leases that we may want to cancel or the inability to renew the leases that we may want to extend at the end of their terms;\n31\nTable of Contents\n•\nOur inability or failure to execute a comprehensive business continuity plan following a major natural disaster, such as a hurricane or manmade disaster;\n•\nThe impact of shortages, delay or interruptions in the delivery of food and other products from third-party vendors and suppliers;\n•\nOur failure to drive both short-term and long-term profitable sales growth through brand relevance, operating excellence, opening new restaurants of existing brands and developing or acquiring new dining brands; \n•\nA lack of suitable new restaurant locations or a decline in the quality of the locations of our current restaurants; \n•\nHigher-than-anticipated costs or delays to open, close, relocate or remodel restaurants;\n•\nRisks associated with doing business with franchisees and licensees;\n•\nRisks associated with doing business with business partners and vendors in foreign markets;\n•\nVolatility in the market value of derivatives we may use to hedge exposures to fluctuations in commodity and broader market prices;\n•\nVolatility in the United States equity markets that may affect our ability to efficiently hedge exposures to our market risk related to equity-based compensation awards;\n•\nFailure to protect our service marks or other intellectual property;\n•\nEnvironmental, social and governance risk, including disclosure expectations and the impact of third party ratings,\n•\nLitigation, including allegations of illegal, unfair or inconsistent employment practices;\n•\nUnfavorable publicity, or a failure to respond effectively to adverse publicity;\n•\nDisruptions in the financial markets that may impact consumer spending patterns, affect the availability and cost of credit; \n•\nImpairment of the carrying value of our goodwill or other intangible assets;\n•\nChanges in tax laws or treaties and unanticipated tax liabilities; and\n•\nA failure of our internal controls over financial reporting and future changes in accounting standards.\nAny of the risks described above or elsewhere in this report or our other filings with the SEC could have a material impact on our business, financial condition or results of operations. It is not possible to predict or identify all risk factors. Additional risks and uncertainties not presently known to us or that we currently believe to be immaterial may also impair our business operations. Therefore, the above is not intended to be a complete discussion of all potential risks or uncertainties."
}