{
  "source_file": "dri-20250525.htm",
  "form_type": "10-K",
  "item1": "Item 1.  BUSINESS\nIntroduction \nDarden Restaurants, Inc. is a full-service restaurant company, and as of May 25, 2025, we owned and operated 2,159 restaurants through subsidiaries in the United States and Canada under the Olive Garden\n®\n, LongHorn Steakhouse\n®\n, Cheddar’s Scratch Kitchen\n®\n, Chuy’s\n®\n, Yard House\n®\n, Ruth’s Chris Steak House\n® \n(“Ruth’s Chris”), The Capital Grille\n®\n, Seasons 52\n®\n, Eddie V’s Prime Seafood\n® \n(“Eddie V’s”), Bahama Breeze\n®\n, and The Capital Burger\n®\n trademarks. As of May 25, 2025, we also had 154 restaurants operated by independent third parties pursuant to area development and franchise agreements and 4 restaurants operating under contractual agreements. The following table details the number of company-owned and operated restaurants, as well as those operated under franchise and contractual agreements, as of May 25, 2025:    \nNumber of Restaurants \nOlive\nGarden\nLongHorn\nSteakhouse\nCheddar’s Scratch Kitchen\nChuy’s\nYard House (1)\nRuth’s Chris \nThe\nCapital\nGrille\nSeasons 52\nEddie V’s\nBahama Breeze\nThe Capital Burger\nTotal\nOwned and operated:\nUnited States\n927\n591\n181\n108\n88\n82\n71\n43\n29\n28\n3\n2,151\nCanada\n8\n—\n—\n—\n—\n—\n—\n—\n—\n—\n—\n8\nTotal\n935\n591\n181\n108\n88\n82\n71\n43\n29\n28\n3\n2,159\nFranchised:\nUnited States (2)\n11\n19\n3\n—\n—\n51\n—\n—\n—\n1\n—\n85\nLatin America\n32\n—\n—\n—\n—\n2\n2\n—\n—\n—\n—\n36\nCanada\n—\n—\n—\n—\n—\n6\n—\n—\n—\n—\n—\n6\nAsia\n5\n1\n—\n—\n—\n16\n—\n—\n—\n—\n—\n22\nMiddle East\n3\n—\n—\n—\n—\n—\n—\n—\n—\n—\n—\n3\nThe Caribbean\n1\n—\n—\n—\n—\n1\n—\n—\n—\n—\n—\n2\nTotal\n52\n20\n3\n—\n—\n76\n2\n—\n—\n1\n—\n154\nOperated:\nUnited States\n—\n—\n—\n—\n—\n4\n—\n—\n—\n—\n—\n4\nTotal\n—\n—\n—\n—\n—\n4\n—\n—\n—\n—\n—\n4\nGrand Total\n987\n611\n184\n108\n88\n162\n73\n43\n29\n29\n3\n2,317\n(1)\nIncludes one restaurant that is owned jointly by us and third parties and managed by us.\n(2)\nIncludes Puerto Rico and Guam.\nDarden Restaurants, Inc. is a Florida corporation incorporated in March 1995, and is the parent company of GMRI, Inc., also a Florida corporation. GMRI, Inc. and certain other of our subsidiaries own and operate our restaurants. GMRI, Inc. was originally incorporated in March 1968 as Red Lobster Inns of America, Inc. We were acquired by General Mills, Inc. in 1970 and became a separate publicly held company in 1995 when General Mills distributed all of our outstanding stock to the stockholders of General Mills. Our principal executive offices and restaurant support center are located at 1000 Darden Center Drive, Orlando, Florida 32837, telephone (407) 245-4000. Our corporate website address is \nwww.darden.com\n. We make our reports on Forms 10-K, 10-Q and 8-K, Section 16 reports on Forms 3, 4 and 5, and all amendments to those reports available free of charge on our website the same day as the reports are filed with or furnished to the Securities and Exchange Commission. Information on our website is not deemed to be incorporated by reference into this Form 10-K. Unless the context indicates otherwise, all references to “Darden,” “the Company,” “we,” “our” or “us” include Darden Restaurants, Inc., GMRI, Inc. and our respective subsidiaries.\nOn October 11, 2024, we acquired 100 percent of the equity interest of Chuy’s Holdings, Inc. (Chuy’s Holdings) in an all-cash transaction of $649.1 million in total consideration, $613.7 million in net cash consideration, inclusive of $35.4 million of cash on Chuy’s Holdings balance sheet at closing. We financed the acquisition with a portion of the proceeds from the issuance of a $400.0 million aggregate principal amount of 4.350 percent senior notes due 2027 (2027 Notes) and a $350.0 million aggregate principal amount of 4.550 percent senior notes due 2029 (2029 Notes), which were issued on October 3, 2024. The 2027 Notes will mature on October 15, 2027 and the 2029 Notes will mature on October 15, 2029.  Interest on the Notes will be paid semi-\n1\nannually in arrears on April 15 and October 15 of each year, commencing on April 15, 2025, to holders of record on the preceding March 31 or September 30, as the case may be.\nDuring the fourth quarter of fiscal 2025, we entered into an agreement with Recipe Unlimited, Canada’s largest full-service restaurant company,  pursuant to which Recipe Unlimited will acquire Olive Garden’s eight Canadian restaurants. These restaurants will be franchise-owned and will operate as members of our Olive Garden International family.  Recipe Unlimited is headquartered in Toronto, operating more than 1,200 restaurants in more than 300 communities across Canada.  Subsequent to the end of the quarter, on July 14, 2025, we successfully closed on the sale. \nOn our June 2025 earnings call, we announced the decision to explore strategic alternatives for the Bahama Breeze brand, which includes 28 locations owned and operated by Darden and one franchise location. We will be exploring a sale of the brand or conversions of some or all locations to other Darden brands. \nWe have a 52/53 week fiscal year ending the last Sunday in May. Our fiscal year \n2025\n ended May 25, 2025 and consisted of 52 weeks, fiscal 2024 ended May 26, 2024 and consisted of 52 weeks, and fiscal 2023 ended May 28, 2023 and consisted of 52 weeks.\nThe following description of our business should be read in conjunction with the information in Part II of this report under the caption “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Item 8 - Financial Statements and Supplementary Data.” \nSegment Information\nWe manage our restaurant brands in North America as operating segments. The brands operate principally in the U.S. within full-service dining. We aggregate our operating segments into reportable segments based on a combination of the size, economic characteristics and sub-segment of full-service dining within which each brand operates. We have four reportable segments: 1) Olive Garden, 2) LongHorn Steakhouse, 3) Fine Dining (which includes Ruth’s Chris, The Capital Grille and Eddie V’s) and 4) Other Business (which includes Cheddar’s Scratch Kitchen, Chuy’s, Yard House, Bahama Breeze, Seasons 52, The Capital Burger and ongoing royalties and other fees from our franchise operations and contractually managed locations). External sales are derived principally from food and beverage sales, we do not rely on any major customers as a source of sales and the customers and long-lived assets of our reportable segments are predominantly in the U.S. There were no material transactions among reportable segments. \nRestaurant Brands\nOlive Garden\nOlive Garden is an internally-developed brand and is the largest full-service dining Italian restaurant operator in the United States. Olive Garden offers a variety of Italian foods featuring fresh ingredients presented simply with a focus on flavor and quality, and a broad selection of imported Italian wines. In 1982, Olive Garden opened its first restaurant in Orlando, Florida.  \n Most dinner menu entrée prices range from $12.00 to $23.50, and most lunch menu entrée prices range from $9.50 to $11.50. The price of each entrée includes as much fresh salad or soup and breadsticks as a guest desires. During fiscal 2025, the average check per person (defined as total sales divided by number of entrées sold) was approximately $24.00, with alcoholic beverages accounting for 4.7 percent of Olive Garden’s sales. Olive Garden maintains different menus across its trade areas to reflect geographic differences in consumer preferences, prices and selections, as well as a smaller portioned, lower-priced children’s menu. \nLongHorn Steakhouse\nLongHorn Steakhouse is a full-service steakhouse restaurant brand with locations primarily in the eastern United States, operating in an atmosphere inspired by the American West. LongHorn Steakhouse opened its first restaurant in 1981, and we acquired LongHorn Steakhouse in October 2007 as part of the RARE Hospitality International, Inc. (RARE) acquisition. LongHorn Steakhouse restaurants feature a variety of menu items including signature fresh steaks and chicken, as well as salmon, shrimp, ribs, pork chops and burgers.\nMost dinner menu entrée prices range from $14.00 to $41.00, and most lunch menu entrée prices range from $9.00 to $12.00. The price of most entrées includes a side and/or salad and as much freshly baked bread as a guest desires. During fiscal 2025, the average check per person was approximately $28.00, with alcoholic beverages accounting for 8.5 percent of LongHorn Steakhouse’s sales. LongHorn Steakhouse maintains different menus for dinner and lunch and different menus across its trade \n2\nareas to reflect geographic differences in consumer preferences, prices and selections, as well as a smaller portioned, lower-priced children’s menu.\nCheddar’s Scratch Kitchen\nCheddar’s Scratch Kitchen is a full-service restaurant brand operating primarily in Texas and throughout the southern, mid-western and mid-Atlantic regions of the United States. The casual dining menu features modern classics and American favorites cooked from scratch. Each entree includes a honey butter croissant.  Cheddar’s Scratch Kitchen opened its first restaurant in 1979, and we acquired Cheddar’s Scratch Kitchen in April 2017.\nMost dinner menu entrée prices range from $10.00 to $23.00, and most lunch menu entrée prices range from $9.00 to $11.00.  During fiscal 2025, the average check per person was approximately $19.00, with alcoholic beverages accounting for 7.0 percent of Cheddar’s Scratch Kitchen’s sales. Cheddar’s Scratch Kitchen features different menus across its trade areas to reflect geographic differences in consumer preferences, prices and selections, as well as a smaller portioned, lower-priced children’s \nmenu\n.  \nChuy’s\nChuy’s is a full-service restaurant brand offering a distinct menu of authentic, freshly-prepared Mexican and Tex-Mex inspired food. The restaurants have common décor, but each location is unique in format, offering an “unchained” look and feel, as expressed by the motto “If you’ve seen one Chuy’s, you’ve seen one Chuy’s!”  Chuy’s opened its first restaurant in Austin, Texas in 1982, and we acquired Chuy’s in October 2024.  \nMost menu entrée prices range from $11.00 to $21.00.  During fiscal 2025, the average check per person was approximately $19.50, with alcoholic beverages accounting for 12.0 percent of Chuy’s sales. The core menu was established using recipes from family and friends of the founders and has remained relatively unchanged over the years. Chuy’s offers the same menu for both lunch and dinner, which includes enchiladas, fajitas, tacos, burritos, combination platters and salads complemented by a variety of appetizers and desserts.  All meals include free chips and salsa.\nYard House\nYard House is a full-service restaurant brand operating in metropolitan areas across the United States and is known for great food, classic rock and over 100 draft beer offerings. The American menu includes more than 100 chef driven items with a wide range of appetizers, burgers and steaks, street tacos, salads, sandwiches and a generous selection of vegetarian dishes. Yard House opened its first restaurant in 1996, and we acquired Yard House in August 2012.  \nYard House design elements create a contemporary, yet casual, “come as you are” environment.  Most lunch and dinner menu entrée prices range from $10.00 to $54.00. During fiscal 2025, the average check per person was approximately $36.00, with alcoholic beverages accounting for 30.0 percent of Yard House’s sales. Yard House maintains different menus and selections of craft beers across its trade areas to reflect geographic differences in consumer preferences, prices and selections, as well as a smaller portioned, lower-priced children’s menu. \nRuth’s Chris\nRuth’s Chris is one of the largest fine dining steakhouse restaurant brands in the world. The menu features a broad\nselection of high-quality USDA Prime and Choice grade steaks and other premium offerings served in Ruth’s Chris’ signature fashion —“sizzling”— complemented by other traditional menu items inspired by its New Orleans heritage. Ruth’s Chris complements its distinctive food offerings with an award-winning wine list.  Ruth’s Chris opened its first restaurant in 1965, and we acquired Ruth’s Chris in June 2023.\nMost dinner menu entrée prices range from $40.00 to $85.00, and most lunch menu entrée prices range from $16.00 to $65.00. During fiscal 2025, the average check per person was approximately $104.50, with alcoholic beverages accounting for 19.3 percent of Ruth’s Chris’ sales. Ruth’s Chris offers different menus for dinner and lunch and varies its wine list to reflect geographic differences in consumer preferences, prices and selections. \nThe Capital Grille\nThe Capital Grille is a fine dining restaurant brand with locations primarily in major metropolitan cities in the United States featuring relaxed elegance and style. The Capital Grille opened its first restaurant in 1990, and we acquired The Capital Grille in October 2007 as part of the RARE acquisition. Nationally acclaimed for dry aging steaks on the premises, the restaurants feature an award-winning wine list offering over 350 selections, personalized service, a comfortable club-like atmosphere, and premiere private dining rooms.\n3\nMost dinner menu entrée prices range from $40.00 to $95.00, and most lunch menu entrée prices range from $23.00 to $53.00. During fiscal 2025, the average check per person was approximately $104.00, with alcoholic beverages accounting for 26.3 percent of The Capital Grille’s sales. The Capital Grille offers different menus for dinner and lunch and varies its wine list to reflect geographic differences in consumer preferences, prices and selections.\nSeasons 52\nSeasons 52 is an internally-developed full-service restaurant brand with a casually sophisticated, fresh grill and wine bar that offers a seasonally changing menu with all items under 595 calories. The menu includes an international collection of wines, along with exceptional signature handcrafted cocktails. In 2003, Seasons 52 opened its first restaurant in Orlando, Florida.  \nMost lunch and dinner menu entrée prices range from $12.50 to $51.00. During fiscal 2025, the average check per person was approximately $52.00, with alcoholic beverages accounting for 21.8 percent of Seasons 52’s sales. Seasons 52 maintains an all-day menu in addition to different seasonal offerings, a pared-down lunch menu and a happy-hour menu.\nEddie V’s\nEddie V’s is a fine dining restaurant brand with locations in major metropolitan cities in the United States, with a sophisticated and contemporary ambiance, featuring live music nightly in the V Lounge. Dishes are artistically prepared and feature seasonal seafood and critically acclaimed prime steaks, hand cut and broiled to perfection.  The atmosphere provides an alluring dining experience reminiscent of a modern day Gatsby, infusing an indulgent experience with an irresistible vibe.  Eddie V’s opened its first restaurant in 2000, and we acquired Eddie V’s in November 2011.\nMost dinner menu entrée prices range from $41.00 to $116.00. During fiscal 2025, the average check per person was approximately $123.00, with alcoholic beverages accounting for 27.3 percent of Eddie V’s sales. Eddie V’s menu features a premium selection of seafood and hand-cut steaks, and each restaurant offers unique wine and spirit selections that reflect local preferences, in addition to the brand’s core wine & cocktail offerings.\nBahama Breeze\nBahama Breeze is an internally-developed full-service restaurant brand operating primarily in the eastern United States that offers guests the feeling of a Caribbean escape, with food, drinks and atmosphere found in the islands. The menu features distinctive, Caribbean-inspired fresh seafood, chicken and steaks as well as handcrafted tropical cocktails. In 1996, Bahama Breeze opened its first restaurant in Orlando, Florida.  \nMost lunch and dinner menu entrée prices range from $10.50 to $39.00. During fiscal 2025, the average check per person was approximately $35.00, with alcoholic beverages accounting for 20.5 percent of Bahama Breeze’s sales. Bahama Breeze maintains different menus across its trade areas to reflect geographic differences in consumer preferences, prices and selections, as well as a smaller portioned, lower-priced children’s menu.\nThe Capital Burger\nThe Capital Burger is an internally-created, development-stage full-service restaurant concept with locations primarily in major metropolitan cities in the United States that offers guests a luxe burger experience. The Capital Burger opened its first restaurant in 2018. The menu features burgers made with a proprietary beef blend, sandwiches and appetizers. It is a bar-centric concept offering local craft beers, a unique wine list and spiked shakes. Multiple items take from the parentage of The Capital Grille, like the signature Doli, a pineapple-infused martini. \nMost lunch and dinner menu entrée prices range from $18.00 to $36.00. During fiscal 2025, the average check per person was approximately $36.00, with alcoholic beverages accounting for 25.3 percent of The Capital Burger’s sales.  The Capital Burger maintains an all-day menu in addition to a happy hour menu.\nThe following table shows our restaurant growth over the last five years including the number of restaurants owned and operated by each brand and concept as of the end of the respective fiscal years.  The table excludes our restaurants operated by independent third parties pursuant to area development, franchise, and contractual agreements. The final column in the table lists our total sales from continuing operations for the fiscal years indicated.\n4\nFiscal\nYear\nOlive\nGarden\nLongHorn\nSteakhouse\nCheddar’s \nScratch \nKitchen\nChuy’s\nYard\nHouse\nRuth’s\nChris\nThe\nCapital\nGrille\nSeasons\n52\nEddie V’s\nBahama\nBreeze\nThe \nCapital\nBurger\nTotal\nRestaurants\nTotal \nSales\n(in millions) (1)\n2021\n875\n533\n170\n—\n81\n—\n60\n44\n26\n42\n3\n1,834\n$7,196.1\n2022\n884\n546\n172\n—\n85\n—\n62\n45\n28\n42\n3\n1,867\n$9,630.0\n2023\n905\n562\n180\n—\n86\n—\n62\n44\n29\n42\n4\n1,914\n$10,487.8\n2024\n920\n575\n181\n—\n88\n80\n66\n44\n30\n43\n4\n2,031\n$11,390.0\n2025\n935\n591\n181\n108\n88\n82\n71\n43\n29\n28\n3\n2,159\n$12,076.7\n(1) During fiscal 2021, many of our locations experienced restrictions on operations, including the ability to have dine-in operations and were subject to vaccine and/or mask mandates as a result of the COVID-19 pandemic.  \nStrategy\nWe believe that capable operators of strong multi-unit brands have the opportunity to increase their share of the restaurant industry’s full-service segment. Generally, the restaurant industry is considered to be comprised of three segments: quick service, fast casual, and full-service. All of our restaurants fall within the full-service segment, which is highly fragmented and includes many independent operators and small chains. We believe we have strong brands and that the breadth and depth of our experience and expertise sets us apart in the full-service restaurant industry. This collective capability is the product of investments over many years in areas that are critical to success in our business, including restaurant operations excellence, brand management excellence, supply chain, talent management and information technology, among other things.\nOur operating philosophy remains focused on strengthening the core operational fundamentals of the business by providing an outstanding guest experience rooted in culinary innovation, attentive service, and engaging atmosphere enabled by our people. Darden enables each brand to reach its full potential by leveraging its scale, insights, and experience in a way that protects uniqueness and competitive advantages. Additionally, our brands can capitalize on data driven insights to deliver customized one-to-one customer relationship marketing. We hold ourselves accountable for operating our restaurants with a sense of urgency to achieve our commitments to all of our stakeholders.\nRecent and Planned Restaurant Growth \nDuring fiscal 2025, we added 103 company-owned Chuy’s restaurants and 25 other net new restaurants in the United States. Our fiscal 2025 actual restaurant openings and closings, fiscal 2026 projected openings, and approximate capital investment, square footage and dining capacity, by brand, are shown below:\nActual - Fiscal 2025\nProjected - Fiscal 2026 (4)\nPro-Forma New Restaurants (4)\nRestaurant Openings\nAcquired\nRestaurant Closings\nNew Restaurant Openings\nCapital Investment\n Range (1)\n (in millions)\nApproximate Square Feet\n(2)\nApproximate Dining Seats\n(3)\nOlive Garden\n15\n—\n—\n19-22\n$4.5\n-\n$6.2\n7,700\n250\nLongHorn Steakhouse\n16\n—\n—\n23-26\n$3.8\n-\n$5.1\n5,800\n180\nCheddar’s Scratch Kitchen\n3\n—\n3\n2-3\n$4.2\n -\n$5.5\n6,300\n210\nChuy’s\n7\n103\n2\n2-4\n$4.0\n-\n$4.9\n5,700\n160\nYard House \n2\n—\n2\n5-6\n$7.8\n-\n$9.8\n9,000\n330\nRuth’s Chris\n3\n—\n1\n1-2\n$6.0\n-\n$8.0\n7,400\n200\nThe Capital Grille\n7\n—\n2\n3-4\n$7.0\n-\n$9.7\n9,000\n260\nSeasons 52\n1\n—\n2\n1-2\n$6.0\n-\n$7.2\n7,400\n230\nEddie V’s\n1\n—\n2\n2-3\n$8.7\n-\n$10.2\n10,000\n320\nBahama Breeze (5)\n1\n—\n16\n—\n$—\n-\n$—\n—\n—\nTotals\n56\n103\n30\n60-65\n5\n(1)\nIncludes cash investments for building, equipment, furniture and other construction costs; excludes internal capitalized overhead, pre-opening expenses, tenant allowance and future lease obligations. Olive Garden, LongHorn Steakhouse, Cheddar’s Scratch Kitchen and Chuy’s capital investments are based on costs associated with land-only leases; Yard House, Ruth’s Chris, The Capital Grille, Seasons 52 and Eddie V’s capital investments are based on ground and building leases. Actual costs can vary significantly depending on the specific location.\n(2)\nIncludes all space under the roof, including coolers and freezers; based on primary prototypes.\n(3)\nIncludes bar dining seats and patio seating, but excludes bar stools.\n(4)\nThe Capital Burger is a development-stage concept with limited pro-forma information, and as such, it is excluded from this table.\n(5)\nWe are exploring strategic alternatives for the Bahama Breeze brand, and as such, it is excluded from the pro forma section of this table.\nWhile our objective is to continue to expand all of our restaurant brands, the actual number of openings for each of our brands for fiscal 2026 will depend on many factors, including our ability to recruit and train restaurant management and hourly personnel, locate appropriate sites, negotiate acceptable purchase or lease terms, obtain necessary local governmental permits, and complete construction.\nWe consider location to be a critical factor in determining a restaurant’s long-term success, and we devote significant effort to the site selection process. Prior to entering a market, we conduct a thorough study to determine the optimal number and placement of restaurants. Our site selection process incorporates a variety of analytical techniques to evaluate key factors. These factors include trade area demographics, such as target population density and household income levels; competitive influences in the trade area; the site’s visibility, accessibility and traffic volume; and proximity to activity centers such as shopping malls, hotel/motel complexes, offices and universities. Members of senior management evaluate, inspect and approve each restaurant site prior to its acquisition. Constructing and opening a new restaurant typically takes approximately 250 days on average after the site is acquired and permits are obtained.\nWe systematically review the performance of our restaurants to ensure that each one meets our standards. When a restaurant falls below minimum standards, we conduct a thorough analysis to determine the causes, and implement operational and marketing plans to improve that restaurant’s performance. If performance does not improve to acceptable levels, the restaurant is evaluated for relocation, closing or conversion to one of our other brands. Permanent closures are typically due to economic changes in trade areas, the expiration of lease agreements, or site concerns. Accordingly, we continue to evaluate our site locations in order to minimize the risk of future closures or asset impairment charges. \nRestaurant Operations\nWe believe that high-quality restaurant management is critical to our long-term success. Our restaurant management structure varies by brand and restaurant size. We issue detailed operations manuals covering all aspects of restaurant operations, as well as food and beverage manuals which detail the preparation procedures of our recipes. The restaurant management teams are responsible for the day-to-day operation of each restaurant and for ensuring compliance with our operating standards.\nEach Olive Garden restaurant is led by a General Manager, and each LongHorn Steakhouse and Cheddar’s Scratch Kitchen restaurant is led by a Managing Partner. Each also has three to six additional managers, depending on the operating complexity and sales volume of the restaurant. In addition, each restaurant typically employs between 35 to 200 hourly team members, most of whom work part-time. Restaurant General Managers or Managing Partners report to a Director of Operations who is responsible for approximately five to eleven restaurants. Each Director of Operations reports to a Divisional Vice President of Operations who is responsible for between 80 and 120 restaurants. From time to time, we deploy Senior Directors of Operations in our large brands to oversee up to five Directors of Operations and assist with succession planning. Restaurants are visited regularly by operations management, including officer-level executives, to help ensure strict adherence to our standards and to solicit feedback on opportunities for improvement.\n \nEach Yard House, Ruth’s Chris, The Capital Burger and Bahama Breeze restaurant is led by a General Manager, and each The Capital Grille, Seasons 52, Eddie V’s and The Capital Burger restaurant is led by a Managing Partner. Each also has three to ten additional managers. Each Yard House, Ruth’s Chris, The Capital Grille, Seasons 52 and Eddie V’s restaurant has one executive chef, and some have one to two sous chefs. Each Bahama Breeze and The Capital Burger restaurant has one to three culinary managers.  In addition, each restaurant typically employs between 50 to 200 hourly team members, most of whom work part-time. The General Manager or Managing Partner of each restaurant reports directly to a Director of Operations, who has operational responsibility for approximately three to eleven restaurants. Restaurants are visited regularly by operations \n6\nmanagement, including officer-level executives, to help ensure strict adherence to our standards and to solicit feedback on opportunities for improvement.\nEach Chuy’s restaurant is led by a General Manager. Each restaurant has a First Assistant, Kitchen Manager and an additional one to three managers, depending on the operating complexity and sales volume of the restaurant. In addition, each restaurant typically employs between 60 to 120 hourly team members, most of whom work part-time. Restaurant General Managers report to an Area Supervisor who is responsible for approximately four to seven restaurants. Each Area Supervisor reports to a Senior Director of Operations who is responsible for between 30 – 40 restaurants. Restaurants are visited regularly by operations management, including officer-level executives, to help ensure strict adherence to our standards and to solicit feedback on opportunities for improvement.\nOur Learning and Development team in partnership with each brand’s training leader, together with senior operations executives, is responsible for developing and maintaining our operations training programs. These efforts include an eight to twelve-week training program for management trainees and continuing development programs for all levels of leadership. The emphasis of the training and development programs varies by restaurant brand, but includes leadership effectiveness, restaurant business management and culinary skills. We also use a highly structured training program to open new restaurants, including deploying training teams experienced in all aspects of restaurant operations. The opening training teams typically begin work one to two weeks prior to opening and remain at the new restaurant for up to three weeks after the opening. They are re-deployed as appropriate to enable a smooth transition to the restaurant’s operating staff.\nWe maintain performance measurement and incentive compensation programs for our management-level team members. We believe that our leadership position, strong results-oriented culture and various short-term and long-term incentive programs, including stock-based compensation, enhance our ability to attract and retain highly motivated restaurant managers.\nQuality Assurance \nOur Total Quality Department helps ensure that all restaurants provide safe, high-quality food in a clean and safe environment.\nThrough rigorous supplier and risk-based product evaluations, we purchase only products that meet or exceed our product specifications. We rely on independent third parties to inspect and evaluate our suppliers and distributors. Suppliers that produce “high-risk” ready-to-eat products are subject to a food safety evaluation by Darden personnel at least annually. We require our suppliers to maintain sound manufacturing practices and operate with comprehensive Hazard Analysis and Critical Control Point (HACCP) food safety programs and risk-based preventative controls adopted by the U.S. Food and Drug Administration. These programs focus on preventing hazards that could cause food-borne illnesses by applying scientifically-based controls to analyze hazards, identify and monitor critical control points, and establish corrective actions when monitoring shows that a critical limit has not been met.\nThird party auditors inspect each restaurant regularly throughout the year to assess food safety and sanitation practices. Our total quality team verifies the application of preventative controls through on-site support visits ensuring an effective and robust food safety system. Total quality managers provide support to operations staff with education and training in food safety and sanitation. The team also serves as a liaison to regulatory agencies on issues relating to food safety.\nSourcing and Distribution\nEnsuring available, safe, high-quality food and supplies at competitive prices to all our restaurants depends on reliable sources of procurement. Our sourcing staff sources, negotiates, and purchases food and supplies from more than 1,400 suppliers whose products originate in more than 30 countries. Suppliers must meet our strict quality control standards in the development, harvest, catch and production of food products. We leverage competitive bids, long-term contracts and strategic supplier relationships to manage availability and cost of products.\nWe contribute to Darden’s scale advantage, by directly sourcing product utilizing our supplier relationships, product expertise, dedicated distribution network, while prioritizing food safety. Our staff travels routinely within the United States and internationally to source top-quality food and supplies at competitive prices. We actively engage with and monitor our suppliers, both in person and remotely, including hosting virtual visits and audits. We have excellent long-term relationships with key suppliers and usually source our product directly from producers.\n7\nWe enter into long-term agreements with multiple third-party national distribution companies to deliver food and supplies to our restaurants. Under these arrangements we maintain ownership of the food and supplies inventory through our subsidiary Darden Direct Distribution, Inc. (Darden Direct), managed by third-party distribution partners. Because of the rapid turnover of perishable food products, inventories in the restaurants have a modest aggregate dollar value in relation to sales.\nWe continue to drive automation of our supply chain by collaborating with our suppliers, logistics partners and distributors to improve optimization with information visibility and other technological advances. These and other terms of Darden Direct’s long-term supply agreements further enable our sourcing staff to integrate demand forecasts into our purchasing operations, driving efficiencies in our operations.\nIntegrated Marketing\nOur restaurants appeal to a broad spectrum of consumers. To further strengthen our brands, we focus on highlighting what makes each one unique.  Accordingly, our brands evaluate each marketing activity through three filters. The first filter involves elevating brand equity by bringing each brand’s competitive advantages to life. The second filter is simple execution, allowing our teams to deliver consistently memorable guest experiences. And finally, it will not be at a deep discount. We are focused on providing great value to our guests but doing so in a way that drives profitable sales growth.\nIntegrated marketing is key to bringing our brands to life, and our scale enables us to be a leading advertiser in the full-service dining segment of the restaurant industry. Olive Garden leverages the efficiency of national advertising, on both traditional and streaming television, supplemented with targeted digital media investments. LongHorn Steakhouse, Cheddar’s Scratch Kitchen, Yard House, Ruth’s Chris Steak House, The Capital Grille, Chuy’s, Seasons 52, Eddie V’s and Bahama Breeze also use digital marketing to build engagement and loyalty. \nIn fiscal 2025, we continued a multi-year effort to implement new technology platforms that allow us to digitally engage with our guests and team members and strengthen our marketing and analytics capabilities. We also continued making improvements to our online and mobile ordering and payment systems across all our brands. In addition, we continued working on developing sophisticated customer relationship management programs, data analytics and data-driven marketing approaches to effectively and efficiently target our existing and potential guests across our portfolio of brands. This enables us to tailor our messaging and offerings depending on guest visit history, preferences and brand loyalty. Finally, we have developed and consistently use sophisticated consumer marketing research to monitor guest satisfaction and evolving trends and marketplace dynamics.\nHuman Capital\nWe prioritize our team members through our People Strategy that includes four strategic imperatives:\n•\nHire - Attract and select diverse team members that reflect our values and are committed to our results-oriented culture;\n•\nTrain - Teach team members to perform in today’s environment and develop the skills to meet tomorrow’s needs;\n•\nReward - Invest in compelling programs that recognize team members when goals are achieved and further motivate our culture of winning; and \n•\nRetain - Keep team members engaged and motivated, ready to deliver results and grow their careers.\nWe closely track and assess a variety of metrics that help us evaluate our performance on each of these imperatives.\nHire.\n \nWe are committed to attracting, engaging, developing and retaining a workforce that mirrors the diversity of our guests and the communities in which we operate.\n \nWe track a variety of workforce statistics to help us understand the gender, racial and ethnic diversity of our team members.\n \nKey team member statistics as of the end of fiscal 2025 included the following:\nTotal team members (hourly and salaried)\n197,924\nTotal number of hourly team members\n186,993\nPercent of hourly team members – female\n58%\nPercent of hourly team members – members of racial or ethnic minority groups\n57%\nTotal number of new hires of hourly team members during fiscal 2025\n139,210\n8\nPercent of hourly new hires – female\n57%\nPercent of hourly new hires – members of racial or ethnic minority groups\n56%\nIn addition to the gender, racial and ethnic diversity of our workforce, our team members are also very diverse in age; we employ members of five generations of the United States population:  Traditionalists, Baby Boomers, Generation X, Millennials and Centennials.\n \nWe provide our EEO-1 report on our website at www.darden.com.\nTrain.\n \nWe succeed because of our people, and with our success come rewards, recognition and great opportunities for our team members.\n \nWe regularly invest in our team members’ careers by providing the tools they need to succeed in their current roles, to grow personally and professionally, and to deliver exceptional experiences to our guests each day.\n \nWith thousands of leadership positions across our restaurants, we provide a pathway and training for thousands of individuals across the country to advance from entry-level jobs into management roles.\n \nIn fiscal 2025, 61% of the participants in our restaurant Manager In Training program were internal promotions, and 99% of the new General Managers or Managing Partners were internal promotions.\nReward.\n \nWe believe that we provide working conditions and pay and benefits that compare favorably with those of our competitors.  Most team members, other than restaurant management and corporate management, are paid on an hourly basis.\n \nWe offer our team members flexible work schedules and competitive pay and benefits, including paid sick leave and access to free counseling through our employee assistance program for team members and their families.\nWe regularly review our pay and benefits programs to identify and implement enhancements to the ways we reward our team members.\n \nSince fiscal 2022, we have maintained a policy that each hourly restaurant team member company-wide would earn a minimum hourly wage of at least $12 per hour, inclusive of tip income.  For fiscal 2025, across all of our brands, our hourly team members earned, on average, $24 per hour, inclusive of tip income, far exceeding that minimum wage. Since fiscal 2018, we have significantly increased the percentage of medical premium contributions we make on behalf of our team members. In fiscal 2025, we subsidized 75-81% (depending on the plan and tier selected) of the premiums for our team members, representing a 17-28% increase in the percentage of medical premiums we contributed as compared to fiscal 2018. In fiscal 2025, we invested approximately $12 million to continue to maintain competitive premiums for our team members.   \nFurther, in fiscal 2025, the Darden Restaurants Foundation continued the Next Course Scholarship program for children and dependents of our team members that launched during fiscal 2023.\n \nIn its third year, the program awarded scholarships worth $3,000 each to 98 children or dependents of Darden team members.\n \nIn January 2023, we introduced a new benefit for restaurant team members called Fast Fluency. For many of our team members, English is not their first language, and this program provides the opportunity to learn English for free. \nNone of our team members are covered by a collective bargaining agreement.\n \nWe consider our team member relations to be good.\n \nWe conduct engagement surveys with hourly team members and management twice a year through Gallup, and Darden’s overall engagement is well above the average for both U.S. and international companies as measured by Gallup.\nConsistent with our core values of respect, caring and teamwork, in fiscal 1999, we established a program called Darden Dimes to help fellow Darden team members in need.\n \nDarden Dimes provides short-term financial grants to team members experiencing financial need caused by unexpected emergencies or catastrophic natural disasters. Participating team members donate as little as 10 cents from each paycheck to the Darden Dimes fund, which raised over $2.6 million and granted $2.8 million in fiscal 2025.\nRetain.\n \nAs a full-service restaurant company, food is always top of mind, but our team members make the difference: they are at the heart of everything we do.\n \nWe believe the guest experience can never exceed the team member experience, so we strive to hire the best individuals and retain them by fostering an environment of respect and inclusion, where diversity of thought and background is valued and everyone has the opportunity to develop and grow their careers.\n \nIn addition, our geographic footprint often puts us in a position to offer our restaurant team members jobs in their current roles when personal circumstances require relocation.\nDarden’s consolidated turnover rate for hourly team members during fiscal 2025 was 67%, one of the lowest rates in the restaurant industry. Each of our brands experienced a turnover rate during fiscal 2025 that was lower than the most recent relevant \n9\ncasual dining or fine dining turnover rate for their segment of the industry as reported in The People Report\nTM \nby Black Box Intelligence\nTM\n.\n \nDarden’s consolidated restaurant management turnover rate of 16% was also significantly lower than the broader restaurant industry benchmark.\n \nOur executive leadership (vice president and above) has an average of over 20 years of experience with Darden, while our restaurant General Managers and Managing Partners have an average of 15 years of experience with us.\nInformation Technology and Cybersecurity\nWe strive for leadership in the restaurant business by using technology as a competitive advantage and as an enabler of our strategy. We have implemented technology-enabled business solutions to improve financial control, cost management, guest service and employee effectiveness, as well as enable e-commerce. These solutions are designed to be used across restaurant brands, yet are flexible enough to meet the unique needs of each restaurant brand.  Our strategy is to fully integrate systems to drive operational efficiencies and enable restaurant teams to focus on restaurant operations excellence. Restaurant hardware and software support for our restaurant brands is provided or coordinated from our restaurant support center facility in Orlando, Florida. Our data center contains sufficient computing power to process information from restaurants quickly and efficiently.  We leverage public cloud computing where appropriate to enhance our capabilities and to leverage scale.  Our information is processed in a secure environment to protect both our data and the physical computing assets. We guard against business interruption by maintaining a disaster recovery plan, which includes storing critical business information off-site, testing the disaster recovery plan annually and providing on-site power backup. We periodically engage third parties to perform cybersecurity audits utilizing the National Institute of Standards and Technology Cybersecurity Framework. We also engage third parties to conduct security reviews of our network, processes and systems on a regular basis.  We use internally developed proprietary software, cloud-based software as a service (SaaS), as well as purchased software, with proven, non-proprietary hardware.\nOur brands share a secure, robust digital platform with online ordering and other guest-facing capabilities. We also have deployed mobile applications with online ordering and other features for most of our casual dining brands and specialty restaurant brands. We successfully leverage these digital capabilities to address evolving guest needs. We will continue to invest in these platforms and applications to enhance the guest experience.  \nWe maintain a robust system of data protection and cybersecurity resources, technology and processes. We regularly evaluate new and emerging risks and ever-changing legal and compliance requirements. We make strategic investments to address these risks, including maintaining insurance coverage to mitigate the potential financial consequences of cybersecurity incidents, and compliance requirements to keep Company, guest and team member data secure. We monitor risks of sensitive information compromise at our business partners where relevant and reevaluate these risks on a periodic basis. We also perform annual and ongoing cybersecurity awareness training for our restaurant management and restaurant support center team members. In addition, we provide annual credit card handling training following Payment Card Industry (PCI) guidelines to team members who handle guest credit cards.\nOur management believes that our current systems and practice of implementing regular updates position us well to support current needs and future growth. We use a strategic information systems multi-year planning process that involves senior management and is integrated into our overall business planning. We provide data protection and cybersecurity reports to the Audit Committee of the Company’s Board of Directors on a quarterly basis, which has oversight of risks related to cybersecurity threats.  These reports are also provided periodically to the full Board of Directors. Information systems projects are prioritized based upon strategic, financial, regulatory, risk and other business advantage criteria.\nCompetition\nThe restaurant industry is intensely competitive with respect to the type and quality of food, price, service, restaurant location, personnel, brand, attractiveness of facilities, availability of carryout and home delivery, internet and mobile ordering capabilities and effectiveness of advertising and marketing. The restaurant business is often affected by changes in consumer tastes; national, regional or local economic conditions; demographic trends; traffic patterns; the type, number and location of competing restaurants; and consumers’ discretionary purchasing power. We compete within each market with national and regional chains and locally-owned restaurants for guests, management and hourly personnel and suitable real estate sites. In addition, expanding product offerings at fast casual and quick-service restaurants and the convenience of home delivery services, together with negative economic conditions, could cause consumers to choose less expensive alternatives or reduce the frequency of their restaurant visits. We expect intense competition to continue in all of these areas.\n10\nOther factors pertaining to our competitive position in the industry are addressed under the sections entitled “Sourcing and Distribution,” “Integrated Marketing” and “Information Technology and Cybersecurity” in this Item 1 and in our Risk Factors in Item 1A of this Form 10-K.\nTrademarks and Service Marks\nWe regard our Olive Garden\n®\n, LongHorn Steakhouse\n®\n, Cheddar’s Scratch Kitchen\n®\n, Chuy’s\n®\n, Yard House\n®\n, Ruth’s Chris Steak House\n®\n, The Capital Grille\n®\n,  Seasons 52\n®\n, Eddie V’s Prime Seafood\n®, \nBahama Breeze\n®\n, The Capital Burger\n®\n, Darden\n® \nand Darden Restaurants\n® \nservice marks, and other service marks and trademarks related to our restaurant businesses, as having significant value and as being important to our marketing efforts.  Our policy is to pursue registration of our important service marks and trademarks and to vigorously oppose any infringement of them.  Generally, with appropriate renewal and use, the registration of our service marks and trademarks will continue indefinitely.\nFranchises, Joint Ventures and New Business Development\nAs of May 25, 2025, we owned and operated 2,159 restaurants through subsidiaries in the United States and Canada. We own all of those locations, except for 5 restaurants we manage through joint venture or other contractual agreements. In all instances, we maintain control over the use of our service marks and receive management fees, which are not material to our consolidated financial statements.\nAs of May 25, 2025, franchisees operated 85 franchised restaurants in the United States and 69 franchised restaurants outside of the United States. We have area development, franchise and/or license agreements in place with unaffiliated operators to develop and operate Olive Garden, LongHorn Steakhouse, Cheddar’s Scratch Kitchen, Yard House, Ruth’s Chris, The Capital Grille and Bahama Breeze restaurants in the following regions:\n•\nUnited States (including Puerto Rico and Guam),\n•\nCanada,\n•\nMexico, \n•\nCentral and South America (Brazil, Costa Rica, Ecuador, El Salvador, Guatemala and Panama),\n•\nAsia (Philippines, China, Hong Kong, Taiwan, Indonesia, Singapore, Japan and India)\n•\nCaribbean (Aruba, Jamaica, Bahamas, Barbados and Cayman Islands),\n•\nEurope (Spain)\n•\nMiddle East (Saudi Arabia and Qatar).\nThe open and operating franchised restaurants are all reflected in the table under the “Introduction” section of this Item 1.  We do not have an ownership interest in any of these franchisees, but we receive fees under the area development and franchise agreements and royalty income under the franchise or license agreements. The amount of income we derive from our franchise arrangements is not material to our consolidated financial statements.\nThe restaurants operating under contractual agreements are also reflected in the table under the “Introduction” section of this Item 1. We do not have an ownership interest in any of these locations, but we receive incentive and royalty fees under the management agreements. The amount of income we derive from our managed agreement arrangements is not material to our consolidated financial statements.\nWe license the sales and distribution of several items including Olive Garden salad dressings, salad croutons and seasoning through various channels including wholesale distribution chains and major grocery chains. The amount of income we derive from these licensing arrangements is not material to our consolidated financial statements.\nSeasonality\nOur sales volumes have historically fluctuated seasonally. Our average sales per restaurant are highest in the winter and spring, followed by the fall and summer. Holidays, changes in the economy, severe weather and similar conditions may impact sales volumes seasonally in some operating regions. Because of the historical seasonality of our business and these other factors, results for any fiscal quarter are not necessarily indicative of the results that may be achieved for the full fiscal year.\n11\nGovernment Regulation\nWe are subject to various federal, state, local and international laws affecting our business.  Each of our restaurants must comply with licensing requirements and regulations by a number of governmental authorities, which include health, safety and fire agencies in the state or municipality in which a restaurant is located.  The development and operation of restaurants depend on selecting and acquiring suitable sites, which are subject to zoning, land use, environmental, traffic and other regulations.  To date, we have not been significantly affected by any difficulty, delay or failure to obtain required licenses or approvals.\nDuring fiscal 2025, 10.6 percent of our sales were attributable to the sale of alcoholic beverages.  Regulations governing the sale of alcoholic beverages require licensure by each site (in most cases, on an annual basis), and licenses may be revoked or suspended for cause at any time. These regulations relate to many aspects of restaurant operations, including the minimum age of patrons and employees, hours of operation, advertising, wholesale purchasing, inventory control and handling, and storage and dispensing of alcoholic beverages.  In recent years, many states have modified their regulations to permit “To Go” sales of alcoholic beverages, and in some locations we now offer a variety of alcoholic beverages to go, including in bottles, from draft and mixed drinks.  The failure of a restaurant to obtain or retain alcoholic beverage licenses or to comply with regulations governing the sale of alcoholic beverages would adversely affect a restaurant’s operations. We also are subject in certain states to “dram shop” statutes, which generally provide an injured party with recourse against an establishment that serves alcoholic beverages to an intoxicated person who then causes injury to himself or a third party.  We carry liquor liability coverage as part of our comprehensive general liability insurance.\nWe also are subject to federal, state and local minimum wage laws and other laws governing such matters as overtime, tip credits, working conditions, paid leave, safety standards, and hiring and employment practices. In April 2024, the U.S. Department of Labor (DOL) announced updates to the Fair Labor Standards Act overtime rules that, in two stages, one on July 1, 2024 and a second on January 1, 2025 increase the salary threshold above which non-exempt workers are required to be paid overtime. In November  2024, a federal judge in Texas struck down the DOL's proposed rule. As a result, the salary thresholds reverted to the 2019 rule, resetting the white-collar and highly compensated employee exemptions at $35,568 and $107,432, respectively.\nSince 1995, Darden has had a Tip Rate Alternative Commitment (TRAC) agreement with the Internal Revenue Service (IRS).  TRAC requirements, which include increased educational and other efforts in each restaurant to increase the reporting compliance of employees with respect to cash tips, are applied across all of our brands.  Compliance with TRAC requirements reduces the likelihood of potential employer-only FICA tax assessments related to cash tips that are unreported by employees at Darden’s covered units.  Consistent with our long-standing agreement with the IRS, we work proactively with IRS personnel responsible for tip compliance to ensure that we are taking the appropriate steps to continue to meet our TRAC obligations.\nWe are subject to federal and state environmental regulations, but these rules have not had a material effect on our operations. During fiscal 2025, there were no material capital expenditures for environmental control facilities and [no material expenditures for this purpose are anticipated].\nOur facilities must comply with the applicable requirements of the Americans with Disabilities Act of 1990 (ADA) and related state accessibility statutes.  Under the ADA and related state laws, we must provide equivalent service to disabled persons and make reasonable accommodation for their employment, and when constructing or undertaking significant remodeling of our restaurants, we must make those facilities accessible.\nWe are subject to federal and state regulations relating to employer-provided health insurance, but these rules have not had a material effect on our operations. \nWe are subject to laws and regulations relating to the preparation and sale of food, including regulations regarding product safety, nutritional content and menu labeling.  We are subject to laws and regulations requiring disclosure of calorie, fat, trans fat, salt and allergen content. \nWe are subject to laws relating to information security, privacy, cashless payments and consumer credit, protection and fraud.  An increasing number of governments and industry groups worldwide have established data privacy laws and standards for the protection of personal information, including social security numbers, financial information (including credit card numbers), and health information.  As a merchant and service provider of point-of-sale services, we are also subject to the Payment Card Industry Data Security Standard issued by the Payment Card Industry Council (PCI DSS).  \nWe are subject to anti-corruption laws in the United States and in the international jurisdictions where we do business, including the Foreign Corrupt Practices Act.  We are also subject to a variety of international laws relating to franchising and licensing of intellectual property in the various countries across the world where we are engaged in franchising our restaurant brands.\n12\nSee Item 1A “Risk Factors” below for a discussion of risks relating to federal, state and local regulation of our business, including in the areas of data privacy and environmental matters.\nSustainability\nThe sustainability of our food sources and restaurant operations is a key component of providing great service and food to our guests. During fiscal 2025, we remained focused on our climate strategy, restaurant sustainability metrics and Darden’s Animal Welfare Council. We will continue to adapt our sustainability approach with development or enhancement of integrated and strategic priorities in the near term across our operations, from the food we source to the operation of our restaurants. \nDarden manages energy and water conservation within our restaurant operations and engages with our supply chain partners on sustainability topics including climate, water, deforestation and animal welfare. In fiscal 2025, Darden continued to develop our understanding, measurement systems and relevant disclosures in our priority focus areas. Additional environmental indicators, including energy and water consumption, waste generation and diversion, as well as Scope 3 greenhouse gas emissions, are reported on our website at \nwww.darden.com/our-impact/communities/sustainability\n.\n \nGreenhouse Gas (GHG) Emissions\n(1)\nFiscal Year Ended\n(in metric tons CO2e)\nMay 25, 2025\nMay 26, 2024\nMay 28, 2023\n(3)\nAverage Per Restaurant \n(2)\n380\n400\n410\nTotal - Scope 1 and 2\n833,462\n(3)\n818,117 \n785,862 \n(1)\nAs of fiscal 2024, GHG reporting is for the same fiscal year for which current financial results are included in this report.  Above emissions are for owned and operated restaurants only.\n \nFranchises are accounted for in our Scope 3 inventory.\n(2)\nGHG Emissions per Restaurant Intensity Ratio includes only Scope 1 and 2 totals (as defined in the Corporate Accounting and Reporting Standard of the GHG Protocol) divided by the total number of restaurants at the end of each fiscal year.\n(3)\nAPEX Companies, LLC provided statements of third-party verification to a limited assurance level for the above stated values for the fiscal years ended 2025, 2024 and 2023 in accordance with ISO Standard 14064-3 Second edition 2019-4 on greenhouse gases- Part 3: Specification with guidance for the verification and validation of GHG statements.\nWe shared Darden’s Food Principles in 2016 to outline our commitment to guests in areas of sustainable sourcing, nutritional disclosure, food safety and animal welfare. Darden’s Food Principles connect each of these strategic business efforts in a guest-centered platform, including sourcing and ingredient commitments to our guests. We continue to work with our supplier partners to make progress in these focus areas, and we provide annual updates on our efforts in the Sustainability section of our website, \nwww.darden.com\n.\nBuilding on our Food Principles, Darden established an Animal Welfare Policy that adopts an outcomes-based approach to continue to ensure a high level of care for farm animals in our food supply chain. To implement this policy, we established an Animal Welfare Council consisting of leading academics and thought leaders with expertise in the care of animals in food supply chains.\n \nThe Council advises and supports the Company on our efforts to advance strategy and implementation of an outcomes-based approach to animal welfare, from supplier collaborations to reporting improvements.\nMore information about our sustainability strategy, our commitment to our guests on Food Principles and our progress to date is available at \nwww.darden.com\n.\nDarden Foundation and Community Affairs\nWe are recognized for a culture that rewards caring for and responding to people. That defines service for Darden.\n \nThe Darden Restaurants, Inc. Foundation (the Foundation) works to bring this spirit of service to life through its philanthropic support of charitable organizations across the country and support for the volunteer involvement of our team members. The Foundation does this by focusing its philanthropic efforts on programs that enhance the communities where our team members and guests live and work.\n \nIn addition, team members at our Restaurant Support Center are eligible for 16 hours per calendar year of paid time for approved community service activities during scheduled work hours.\nIn fiscal 2025, the Foundation awarded approximately $4.0 million in grants to national organizations as well as local nonprofits, including Second Harvest Food Bank of Central Florida and the Heart of Florida United Way. These organizations \n13\nprovide service to the public through hunger relief, community investment, and the promotion of career opportunities in the culinary industry.\nThe Foundation continues to invest in mobile food pantry programs through its long-standing partnership with Feeding America.\n \nIn fiscal 2025, the Foundation awarded a $2.0 million grant to provide refrigerated box trucks to help Feeding America increase access to nutritious food and address transportation needs at food banks that are under-resourced and serve communities with high percentages of food insecurity.\n \nOver five consecutive years, the Foundation has funded more than 50 vehicles to meet the increasing demand for food assistance in communities where we operate.\n \nThe most recent donation marks a total of $20.3 million that the Foundation and Darden have contributed to the Feeding America network since 2010.\nOur support of Feeding America and the fight against hunger complement our Darden Harvest program, which began in 2003 as a mechanism for delivering fresh and healthy food to people who need it. Each day, our restaurants collect surplus, wholesome food that is not served to guests and, rather than discarding the food, they prepare it for donation to local nonprofit feeding partners. In fiscal 2025, Darden contributed approximately 6 million pounds of food, the equivalent of 5 million meals provided to people in need across the communities served by our restaurants. As an added benefit of the Darden Harvest program, we are able to divert millions of pounds of surplus food from waste streams every year.\nThe Foundation’s funding helps support the National Restaurant Association Educational Foundation’s ProStart program, a national high school program that introduces students to the restaurant industry and provides them with an industry-driven curriculum on topics ranging from culinary techniques to management skills. The Foundation’s fiscal 2025 contribution of $250,000 also supports the Restaurant Ready program to engage and encourage disconnected young people to pursue a path to employment and improve their quality of life.\nWe are also a proud member of the American Red Cross’ Annual Disaster Giving Program, which enables the Red Cross to respond to the needs of individuals and families impacted by disasters anywhere in the United States. In fiscal 2025, the Foundation provided $500,000 to the American Red Cross for the program. In addition to financial support, our restaurants donate meals to feed first responders and victims of natural disasters. \nIn fiscal 2025, the Foundation supported the third annual Next Course Scholarship program to help the children or dependents of Darden team members reach their educational goals. The Foundation has partnered with Scholarship America to administer the initiative, which provided scholarships for post-secondary education to children or dependents of eligible full-time and part-time Darden team members for the 2025-26 academic year. As a result, 98 children or dependents of Darden team members were awarded scholarships worth $3,000 each. These team members represent more than 90 different restaurants across eight of our brands and 31 states.\nMore information about the Foundation and its efforts to enhance the quality of life in the communities where we do business is available on our website at \nwww.darden.com\n.",
  "item7": "Item 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis discussion and analysis below for Darden Restaurants, Inc. (Darden, the Company, we, us or our) should be read in conjunction with our consolidated financial statements and related financial statement notes included in Part II of this report under the caption “Item 8 - Financial Statements and Supplementary Data.” We operate on a 52/53-week fiscal year, which ends on the last Sunday in May. Fiscal 2025, which ended May 25, 2025, and fiscal 2024, which ended May 26, 2024, each consisted of 52 weeks.   Fiscal 2026, which ends on May 31, 2026, will consist of 53 weeks. \nOVERVIEW OF OPERATIONS \nOur business operates in the full-service dining segment of the restaurant industry.  At May 25, 2025, we owned and operated 2,159 restaurants through subsidiaries in the United States and Canada under the Olive Garden\n®\n, LongHorn Steakhouse\n®\n, Cheddar’s Scratch Kitchen\n®\n, Chuy’s\n®\n, Yard House\n®\n, Ruth’s Chris Steak House\n® \n(Ruth’s Chris), The Capital Grille\n®\n, Seasons 52\n®\n, Eddie V’s Prime Seafood\n®\n (Eddie V’s), Bahama Breeze\n®\n and The Capital Burger\n® \ntrademarks. We own and operate all of our restaurants in the United States and Canada, except for 5 restaurants we manage through joint venture or other contractual agreements and 85 franchised restaurants. We also have 69 franchised restaurants in operation located in Canada, Latin America, the Caribbean, Asia and the Middle East. All intercompany balances and transactions have been eliminated in consolidation.\nOn October 11, 2024, we acquired 100 percent of the equity interest of Chuy’s Holdings Inc. (Chuy’s) in an all-cash transaction of $649.1 million in total consideration, $613.7 million in net cash consideration, inclusive of $35.4 million of cash on Chuy’s balance sheet at closing. As a result of the acquisition and related integration efforts, we incurred expenses of $44.6 million ($36.7 million, net of tax) during the twelve months ended May 25, 2025.\nFiscal 2025 Financial Highlights\n•\nTotal sales increased 6.0 percent to $12.08 billion in fiscal 2025 from $11.39 billion in fiscal 2024 driven by a blended same-restaurant sales increase of 2.0 percent and sales from the addition of 103 net company-owned Chuy’s restaurants and 25 other net new restaurants.\n•\nDiluted net earnings per share from continuing operations increased to $8.88 in fiscal 2025 from $8.53 in fiscal 2024, a 4.1 percent increase.\n•\nNet earnings from continuing operations increased to $1.05 billion in fiscal 2025 from $1.03 billion in fiscal 2024, a 2.0 percent increase.\n•\nNet loss from discontinued operations decreased to $1.4 million ($0.02 per diluted share) in fiscal 2025, from $2.9 million ($0.02 per diluted share) in fiscal 2024. When combined with results from continuing operations, our diluted net earnings per share was $8.86 for fiscal 2025 and $8.51 for fiscal 2024. \nOutlook\nWe expect fiscal 2026 sales from continuing operations to increase between 7.0 to 8.0 percent, driven by growth of 2.0 percent related to the fifty-third week in fiscal 2026, same-restaurant sales growth\n (1)\n of 2.0 to 3.5 percent, and sales from 60 to 65 new restaurant openings. In fiscal 2026, we expect our annual effective tax rate to be 13 percent, and we expect capital expenditures incurred to build new restaurants, remodel and maintain existing restaurants and technology initiatives to be between $700 million and $750 million.\n(1) \n \nAnnual same-restaurant sales is a 52-week metric and excludes the impact of Chuy’s, which will not have been owned and operated by Darden for a 16-month period prior to the beginning of fiscal 2026, as well as any additional locations not expected to be operated by Darden for the entirety of the fiscal year.\n30\nRESULTS OF OPERATIONS FOR FISCAL 2025 AND 2024\nTo facilitate review of our results of operations, the following table sets forth our financial results for the periods indicated.  All information is derived from the consolidated statements of earnings for the fiscal years ended May 25, 2025 and May 26, 2024: \nFiscal Year Ended\nPercent Change\n(in millions)\nMay 25, 2025\nMay 26, 2024\n2025 v. 2024\nSales\n$\n12,076.7 \n$\n11,390.0 \n6.0%\nCosts and expenses:\nFood and beverage\n3,657.0 \n3,523.9 \n3.8%\nRestaurant labor\n3,833.1 \n3,619.3 \n5.9%\nRestaurant expenses\n1,944.0 \n1,812.3 \n7.3%\n    Pre-opening costs\n24.8 \n24.3 \n2.1%\nMarketing expenses\n169.9 \n144.5 \n17.6%\nGeneral and administrative expenses\n520.3 \n479.2 \n8.6%\nDepreciation and amortization\n516.1 \n459.9 \n12.2%\nImpairments and disposal of assets, net\n49.2 \n12.4 \nNM\nTotal operating costs and expenses\n$\n10,714.4 \n$\n10,075.8 \n6.3%\nOperating income\n$\n1,362.3 \n$\n1,314.2 \n3.7%\nInterest, net\n175.1 \n138.7 \n26.2%\nEarnings before income taxes\n$\n1,187.2 \n$\n1,175.5 \n1.0%\nIncome tax expense (1)\n136.2 \n145.0 \n(6.1)%\nEarnings from continuing operations\n$\n1,051.0 \n$\n1,030.5 \n2.0%\nLosses from discontinued operations, net of tax\n(1.4)\n(2.9)\n(51.7)%\nNet earnings\n$\n1,049.6 \n$\n1,027.6 \n2.1%\n(1) Effective tax rate\n11.5 \n%\n12.3 \n%\nNM- Percentage change not considered meaningful.\n31\nThe following table details the number of company-owned restaurants reported in continuing operations at the end of fiscal 2025, compared with the number open at the end of fiscal 2024:\nMay 25, 2025\nMay 26, 2024\nOlive Garden\n935 \n920 \nLongHorn Steakhouse\n591 \n575 \nCheddar’s Scratch Kitchen\n181 \n181 \nChuy’s\n108 \n— \nYard House\n88 \n88 \nRuth’s Chris\n82 \n80 \nThe Capital Grille\n71 \n66 \nSeasons 52\n43 \n44 \nEddie V’s\n \n29 \n30 \nBahama Breeze\n28 \n43 \nThe Capital Burger\n3 \n4 \nTotal\n2,159 \n2,031 \nSALES \nThe following table presents our company-owned restaurant sales, U.S. same-restaurant sales (SRS) and average annual sales per restaurant by segment for the periods indicated:\nSales\nAverage Annual Sales per Restaurant (2)\nFiscal Year Ended\nPercent Change\nFiscal Year Ended\n(in millions)\nMay 25, 2025\nMay 26, 2024\nSRS (1)\nMay 25, 2025\nMay 26, 2024\nOlive Garden\n$\n5,212.9 \n$\n5,067.0 \n2.9 \n%\n1.7 \n%\n$\n5.6 \n$\n5.6 \nLongHorn Steakhouse\n$\n3,025.5 \n$\n2,806.2 \n7.8 \n%\n5.1 \n%\n$\n5.2 \n$\n4.9 \nFine Dining\n$\n1,304.8 \n$\n1,291.5 \n1.0 \n%\n(3.0)\n%\n$\n7.2 \n$\n7.6 \nOther Business\n$\n2,533.5 \n$\n2,225.3 \n13.8 \n%\n0.2 \n%\n$\n5.8 \n$\n6.0 \n$\n12,076.7 \n$\n11,390.0 \n(1)\nSame-restaurant sales is a year-over-year comparison of each period’s sales volumes for a 52-week year and is limited to restaurants that have been open, and operated by Darden, for at least 16 months.\n(2)\nAverage annual sales are calculated as sales divided by total restaurant operating weeks multiplied by 52 weeks; excludes franchise locations.\nOlive Garden’s sales increase for fiscal 2025 was primarily driven by a U.S. same-restaurant sales increase combined with revenue from new restaurants.  The increase in U.S. same-restaurant sales in fiscal 2025 resulted from a 4.1 percent increase in average check, which includes a 0.7 increase in off-premise catering sales, partially offset by a 2.3 percent decrease in same-restaurant guest counts. \nLongHorn Steakhouse’s sales increase for fiscal 2025 was primarily driven by a same-restaurant sales increase combined with revenue from new restaurants.  The increase in same-restaurant sales in fiscal 2025 resulted from a 3.1 percent increase in average check and a 1.9 percent increase in same-restaurant guest counts. \nFine Dining’s sales increase for fiscal 2025 was driven by revenue from new restaurants offset by same-restaurant sales decreases.  The decrease in same-restaurant sales in fiscal 2025 resulted from a 5.2 percent decrease in same-restaurant guest counts offset by a 2.3 percent increase in average check.  \nOther Business’s sales increase for fiscal 2025 was driven by a U.S. same-restaurant sales increase combined with revenue from new restaurants including the acquisition of Chuy’s. The increase in same-restaurant sales in fiscal 2025 resulted from a 2.6 percent increase in average check offset by a 2.4 percent decrease in same-restaurant guest counts.\n32\nCOSTS AND EXPENSES \nThe following table sets forth selected operating data as a percent of sales from continuing operations for the periods indicated.  This information is derived from the consolidated statements of earnings for the fiscal years ended May 25, 2025 and May 26, 2024.\nFiscal Year Ended\nMay 25, 2025\nMay 26, 2024\nSales\n100.0 \n%\n100.0 \n%\nCosts and expenses:\nFood and beverage\n30.3 \n30.9 \nRestaurant labor\n31.7 \n31.8 \nRestaurant expenses\n16.1 \n15.9 \nMarketing expenses\n1.4 \n1.3 \nPre-opening costs\n0.2 \n0.2 \nGeneral and administrative expenses\n4.3 \n4.2 \nDepreciation and amortization\n4.3 \n4.0 \nImpairments and disposal of assets, net\n0.4 \n0.1 \nTotal operating costs and expenses\n88.7 \n%\n88.5 \n%\nOperating income\n11.3 \n%\n11.5 \n%\nInterest, net\n1.4 \n1.2 \nEarnings before income taxes\n9.8 \n%\n10.3 \n%\nIncome tax expense\n1.1 \n1.3 \nEarnings from continuing operations\n8.7 \n%\n9.0 \n%\nTotal operating costs and expenses from continuing operations were $10.71 billion in fiscal 2025 and $10.08 billion in fiscal 2024.   \nFiscal 2025 Compared to Fiscal 2024: \n•\nFood and beverage costs decreased as a percent of sales primarily due to a 0.9 percent impact from pricing leverage and a 0.2 percent impact from cost savings, partially offset by a 0.3 percent impact from mix and other and a 0.2 percent impact from inflation.\n•\nRestaurant labor costs decreased as a percent of sales primarily due to a 0.8 percent impact from sales leverage, a 0.2 percent impact from productivity improvement and a 0.2 percent impact from lower benefits expense, partially offset by a 1.1 percent impact from inflation.\n•\nRestaurant expenses increased as a percent of sales primarily due to a 0.5 percent impact from inflation, a 0.2 percent impact from brand mix, including Chuy’s and a 0.1 percent impact from Uber Direct fees, partially offset by a 0.4 percent impact from sales leverage and a 0.2 percent impact from other expenses.\n•\nMarketing expenses increased as a percent of sales primarily due to increased marketing and media.\n•\nPre-opening costs remained flat as a percent of sales.\n•\nGeneral and administrative expenses increased as a percent of sales primarily due to a 0.4 percent impact from Chuy’s acquisition and integration costs, 0.1 percent impact from inflation, a 0.1 percent impact from mark to market adjustments and a 0.1 percent impact from restaurant closures, partially offset by a 0.4 percent impact from reduced Ruth’s Chris acquisition and integration costs and by a 0.2 percent impact from sales leverage.\n•\nDepreciation and amortization expenses increased as a percent of sales primarily due to the acquisition of Chuy’s as well as incremental depreciation on brand assets.\n•\nImpairments and disposal of assets, net increased as a percent of sales primarily due to the decision to close twenty-two underperforming restaurant locations during the fourth quarter of fiscal 2025.\nINCOME TAXES \n The effective income tax rates for fiscal 2025 and 2024 for continuing operations were 11.5 percent and 12.3 percent, respectively.  During fiscal 2025, we had income tax expense of $136.2 million on earnings before income tax of $1.19 billion \n33\ncompared to income tax expense of $145.0 million on earnings before income taxes of $1.18 billion in fiscal 2024.  This change was primarily driven by federal tax credits.\nH.R. 1., also known as the One Big Beautiful Bill Act (OBBBA), was enacted on July 4, 2025.  The legislation includes several provisions that may impact the timing and magnitude of certain tax deductions.  Key provisions include the permanent extension of several business tax benefits originally introduced under the 2017 Tax Cuts and Jobs Act.  We are currently evaluating the provisions of the OBBBA to assess their potential impact on our financial position, results of operations and cash flows.\nNET EARNINGS AND NET EARNINGS PER SHARE FROM CONTINUING OPERATIONS \nNet earnings from continuing operations for fiscal 2025 were $1.05 billion ($8.88 per diluted share) compared with net earnings from continuing operations for fiscal 2024 of $1.03 billion ($8.53 per diluted share). \nNet earnings from continuing operations for fiscal 2025 increased 2.0 percent and diluted net earnings per share from continuing operations increased 4.1 percent compared with fiscal 2024.\nLOSS FROM DISCONTINUED OPERATIONS \nOn an after-tax basis, results from discontinued operations for fiscal 2025 were a net loss of $1.4 million ($0.02 per diluted share) compared with a net loss for fiscal 2024 of $2.9 million ($0.02 per diluted share).\nSEGMENT RESULTS\nWe manage our restaurant brands, Olive Garden, LongHorn Steakhouse, Cheddar’s Scratch Kitchen, Chuy’s, Yard House, Ruth’s Chris, The Capital Grille, Seasons 52, Eddie V’s, Bahama Breeze and The Capital Burger in the U.S. and Canada as operating segments. We aggregate our operating segments into reportable segments based on a combination of the size, economic characteristics and sub-segment of full-service dining within which each brand operates. Our four reportable segments are: (1) Olive Garden, (2) LongHorn Steakhouse, (3) Fine Dining and (4) Other Business.  See Note 6 of the Notes to Consolidated Financial Statements (Part II, Item 8 of this report) for further details.\nOur management uses segment profit as the measure for assessing performance of our segments. The following table presents segment profit margin for the periods indicated:\nFiscal Year Ended\nChange\nSegment\nMay 25, 2025\nMay 26, 2024\n2025 vs 2024\nOlive Garden\n22.3%\n22.1%\n20 \nBP\nLongHorn Steakhouse\n19.3%\n18.4%\n90 \nBP\nFine Dining\n18.6%\n19.0%\n(40)\nBP\nOther Business\n15.7%\n15.3%\n40 \nBP\nThe increases in the Olive Garden and LongHorn Steakhouse segment profit margins for fiscal 2025 were both driven primarily by positive same-restaurant sales and lower food and beverage costs, partially offset by higher restaurant expenses and marketing costs. The decrease in the Fine Dining segment profit margin for fiscal 2025 was driven primarily by negative same-restaurant sales and higher restaurant labor and restaurant expenses, partially offset by lower food and beverage costs.  The increase in the Other Business segment profit margin for fiscal 2025 was driven primarily by positive same-restaurant sales and lower food and beverage costs, partially offset by increased restaurant expenses and marketing costs.\nRESULTS OF OPERATIONS FOR FISCAL 2024 COMPARED TO FISCAL 2023\nFor a comparison of our results of operations for the fiscal years ended May 26, 2024 and May 28, 2023, see “Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our annual report on Form 10-K for the fiscal year ended May 26, 2024, filed with the SEC on July 19, 2024.\nSEASONALITY \nOur sales volumes have historically fluctuated seasonally. Our average sales per restaurant are highest in the winter and spring, followed by the fall and summer. Holidays, changes in the economy, severe weather and similar conditions may impact sales volumes seasonally in some operating regions. Because of the historical seasonality of our business and these other factors, results for any fiscal quarter are not necessarily indicative of the results that may be achieved for the full fiscal year.\n34\nIMPACT OF INFLATION \nWe attempt to minimize the annual effects of inflation through appropriate planning, operating practices and menu price increases. We recently operated in a period of higher than usual inflation, led by food and beverage cost and labor inflation.  Food and beverage inflation is principally due to increased costs incurred by our vendors related to higher labor, transportation, packaging, and raw materials costs.  Some of the impacts of inflation have been offset by menu price increases and other adjustments made during the year.  Whether we are able and/or choose to continue to offset the effects of inflation will determine to what extent, if any, inflation affects our restaurant profitability in future periods.\nCRITICAL ACCOUNTING ESTIMATES\nWe prepare our consolidated financial statements in conformity with U.S. generally accepted accounting principles. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of sales and expenses during the reporting period. Actual results could differ from those estimates. \nOur significant accounting policies are more fully described in Note 1 of the Notes to Consolidated Financial Statements (Part II, Item 8 of this report).  Judgments and uncertainties affecting the application of those policies may result in materially different amounts being reported under different conditions or using different assumptions. We consider the following estimates to be most critical in understanding the judgments that are involved in preparing our consolidated financial statements. \nLeases \nWe evaluate our leases at their inception to estimate their expected term, which commences on the date when we have the right to control the use of the leased property and includes the non-cancelable base term plus all option periods we are reasonably certain to exercise. Our judgment in determining the appropriate expected term and discount rate for each lease affects our evaluation of: \n•\nThe classification and accounting for leases as operating versus finance; \n•\nThe rent holidays and escalation in payments that are included in the calculation of the lease liability and related right-of-use asset; and\n•\nThe term over which leasehold improvements for each restaurant facility are amortized. \nThese judgments may produce materially different amounts of lease liabilities and right-of-use assets recognized on our consolidated balance sheets, as well as depreciation, amortization, interest and rent expense recognized in our consolidated statements of earnings if different discount rates and expected lease terms were used. \nValuation of Long-Lived Assets \nLand, buildings and equipment, operating lease right-of-use assets and certain other assets, including definite-lived intangible assets, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. A significant amount of judgment is involved in determining if an indicator of impairment has occurred. Such indicators may include, among others: a significant decline in our expected future cash flows; changes in expected useful life; unanticipated competition; slower growth rates, ongoing maintenance and improvements of the assets, or changes in the usage or operating performance. Any adverse change in these factors could have a significant impact on the recoverability of these assets and could have a material impact on our consolidated financial statements. Based on a review of operating results for each of our restaurants, given the current operating environment, the amount of net book value associated with lower performing restaurants that would be deemed at risk for impairment is not material to our consolidated financial statements.\nValuation and Recoverability of Goodwill and Trademarks \n We have eleven reporting units, eight of which have goodwill and nine of which have trademarks. Goodwill and trademarks are not subject to amortization and have been assigned to reporting units for purposes of impairment testing. The reporting units are our restaurant brands. A significant amount of judgment is involved in determining if an indicator of impairment has occurred. Such indicators may include, among others: a significant decline in our expected future cash flows; a sustained, significant decline in our stock price and market capitalization; a significant adverse change in legal factors or in the business climate; unanticipated competition; the testing for recoverability of a significant asset group within a reporting unit; and slower growth rates. Any adverse change in these factors could have a significant impact on the recoverability of these assets and could have a material impact on our consolidated financial statements. We review our goodwill and trademarks for impairment annually, as of the first day of our fourth fiscal quarter, or more frequently if indicators of impairment exist.\n35\nDuring fiscal 2025, we elected to perform a qualitative assessment for our annual review of goodwill and trademarks to determine whether or not indicators of impairment exist. In considering the qualitative approach related to goodwill, we evaluated factors including, but not limited to, macro-economic conditions, market and industry conditions, commodity cost fluctuations, competitive environment, share price performance, results of prior impairment tests, operational stability, the overall financial performance of the reporting units and the impacts of discount rates. As it relates to trademarks, we evaluate similar factors from the goodwill assessment, in addition to impacts of royalty rates. As a result of the qualitative assessment, no indicators of impairment were identified, and no additional indicators of impairment were identified through the end of our fourth fiscal quarter that would require us to test further for impairment.\nWe evaluate the useful lives of our other intangible assets to determine if they are definite or indefinite-lived. A determination on useful life requires significant judgments and assumptions regarding the future effects of obsolescence, demand, competition, other economic factors (such as the stability of the industry, legislative action that results in an uncertain or changing regulatory environment and expected changes in distribution channels), the level of required maintenance expenditures and the expected lives of other related groups of assets.\nUnearned Revenues \nUnearned revenues primarily represent our liability for gift cards that have been sold but not yet redeemed. The estimated value of gift cards expected to remain unused is recognized over the expected period of redemption as the remaining gift card values are redeemed, generally over a period of 12 years. Utilizing this method, we estimate both the amount of breakage and the time period of redemption. If actual redemption patterns vary from our estimates, actual gift card breakage income may differ from the amounts recorded. We update our estimates of our redemption period and our breakage rate periodically and apply that rate to gift card redemptions on a prospective basis. Changing our breakage-rate estimates by 50 basis points would have resulted in an adjustment in our breakage income of approximately $3.5 million for fiscal 2025.\nIncome Taxes \nWe estimate certain components of our provision for income taxes. These estimates include, among other items, depreciation and amortization expense allowable for tax purposes, allowable tax credits for items such as taxes paid on reported employee tip income, effective rates for state and local income taxes and the tax deductibility of certain other items. We adjust our annual effective income tax rate as additional information on outcomes or events becomes available. \nAssessment of uncertain tax positions requires judgments relating to the amounts, timing and likelihood of resolution. As described in Note 13 of the Notes to Consolidated Financial Statements (Part II, Item 8 of this report), the $21.4 million balance of unrecognized tax benefits at May 25, 2025, includes $1.3 million related to tax positions for which it is reasonably possible that the total amounts could change during the next 12 months based on the outcome of examinations.  All of such $1.3 million relates to items that would impact our effective income tax rate.\nLIQUIDITY AND CAPITAL RESOURCES \nTypically, cash flows generated from operating activities are our principal source of liquidity, which we use to finance capital expenditures for new restaurants and to remodel and maintain existing restaurants, to pay dividends to our shareholders and to repurchase shares of our common stock. Since substantially all of our sales are for cash and cash equivalents, and accounts payable are generally paid in 5 to 90 days, we are typically able to carry current liabilities in excess of current assets. \nWe currently manage our business and financial ratios to target an investment-grade bond rating, which has historically allowed flexible access to financing at reasonable costs. Our publicly issued long-term debt currently carries the following ratings:\n•\nMoody’s Investors Service “Baa2”; \n•\nStandard & Poor’s “BBB”; and\n•\nFitch “BBB”. \nOur commercial paper has ratings of:\n•\nMoody’s Investors Service “P-2”; \n•\nStandard & Poor’s “A-2”; and \n•\nFitch “F-2”.\nThese ratings are as of the date of the filing of this report and have been obtained with the understanding that Moody’s Investors Service, Standard & Poor’s and Fitch will continue to monitor our credit and make future adjustments to these ratings to the extent warranted. The ratings are not a recommendation to buy, sell or hold our securities, may be changed, superseded or withdrawn at any time and should be evaluated independently of any other rating.\n36\nOn October 23, 2023, we entered into a $1.25 billion Revolving Credit Agreement (Revolving Credit Agreement) with Bank of America, N.A. (BOA), as administrative agent, and the lenders and other agents party thereto.  The Revolving Credit Agreement is a senior unsecured credit commitment to the Company and contains customary representations and affirmative and negative covenants (including limitations on liens and subsidiary debt and a maximum consolidated lease adjusted total debt to total capitalization ratio of 0.75 to 1.00) and events of default usual for credit facilities of this type.  As of May 25, 2025, we had no outstanding balances and were in compliance with all covenants under the Revolving Credit Agreement.  As of May 25, 2025, $0.2 million of letters of credit were outstanding, which was backed by this facility. After consideration of letters of credit backed by the Revolving Credit Agreement, as of May 25, 2025, we had $1.25 billion of credit available under the Revolving Credit Agreement.\nLoans under the Revolving Credit Agreement bear interest at a rate of (a) Term SOFR (which is defined, for the applicable interest period, as the Term SOFR Screen Rate two U.S. Government Securities Business Days prior to the commencement of such interest period with a term equivalent to such interest period) plus a Term SOFR adjustment of 0.10 percent plus the relevant margin determined by reference to a ratings-based pricing grid (Applicable Margin), or (b) the base rate (which is defined as the highest of the BOA prime rate, the Federal Funds rate plus 0.500 percent, and the Term SOFR plus 1.00 percent) plus the relevant Applicable Margin. Assuming a “BBB” equivalent credit rating level, the Applicable Margin under the Revolving Credit Agreement is 1.000 percent for Term SOFR loans and 0.000 percent for base rate loans.\nOn September 16, 2024, we entered into Amendment No. 1 (Amendment) to the Revolving Credit Agreement, which replaced the prior financial covenant (which provided for a maximum consolidated total debt to total capitalization ratio) with a new financial covenant requiring us to maintain, measured as of the end of each fiscal quarter, a maximum consolidated leverage ratio of 3.50 to 1.00 (which may be temporarily increased to 4.00 to 1.00 upon the election as a result of a covered acquisition, subject to customary limitations set forth in the Revolving Credit Agreement). All other material terms and conditions of the Revolving Credit Agreement were unchanged. \nThe Revolving Credit Agreement matures on October 23, 2028, and the proceeds may be used for working capital and capital expenditures, the refinancing of certain indebtedness, certain acquisitions and general corporate purposes.\nOn September 16, 2024, we entered into a senior unsecured $600 million 2-year Term Loan Credit Agreement (Term Loan Agreement) with BOA, as administrative agent, the lenders and other agents party thereto, the material terms of which were consistent with the Revolving Credit Agreement. The intended use of the proceeds was to finance our acquisition of Chuy’s and we subsequently terminated the Term Loan Agreement on October 3, 2024, in connection with the closing of our senior notes issuance discussed below. We did not draw any funds, and there were never any outstanding borrowings under the Term Loan Agreement.  \nOn October 3, 2024, we issued and sold $400.0 million aggregate principal amount of 4.350 percent Senior Notes due 2027 (2027 Notes) and $350.0 million aggregate principal amount of 4.550 percent Senior Notes due 2029 (2029 Notes and, together with the 2027 Notes, the Notes), pursuant to the provisions of the Underwriting Agreement, dated September 30, 2024, among the Company and BofA Securities, Inc., Truist Securities, Inc., U.S. Bancorp Investments, Inc. and Wells Fargo Securities, LLC, as representatives of the several underwriters named therein. The Notes were issued under the Company’s Indenture, dated as of January 1, 1996, between the Company and Computershare Trust Company, National Association (as successor to Wells Fargo Bank, National Association, successor to Wells Fargo Bank Minnesota, National Association, formerly known as Norwest Bank Minnesota, National Association), as trustee (Base Trustee), as amended and supplemented by the Second Supplemental Indenture, dated as of October 4, 2023, among the Company, the Base Trustee and U.S. Bank Trust Company, National Association, as a successor trustee with respect to the Notes. We used the proceeds from our issuance of the Notes to finance our acquisition of Chuy’s and for general corporate purposes.\nThe 2027 Notes will mature on October 15, 2027, and the 2029 Notes will mature on October 15, 2029. Interest on the Notes will be paid semi-annually in arrears on April 15 and October 15 of each year, commencing on April 15, 2025, to holders of record on the preceding March 31 or September 30, as the case may be.\n37\nAs of May 25, 2025, our outstanding long-term debt consisted principally of:\n•\n$500.0 million of unsecured 3.850 percent senior notes due in May 2027;\n•\n$400.0 million of unsecured 4.350 percent senior notes due in October 2027;\n•\n$350.0 millions of unsecured 4.550 percent senior notes due in October 2029;\n•\n$500.0 million of unsecured 6.300 percent senior notes due October 2033;\n•\n$96.3 million of unsecured 6.000 percent senior notes due in August 2035;\n•\n$42.8 million of unsecured 6.800 percent senior notes due in October 2037; and\n•\n$300.0 million of unsecured 4.550 percent senior notes due in February 2048.\nThe interest rate on our $42.8 million 6.800 percent senior notes due October 2037 is subject to adjustment from time to time if the debt rating assigned to such series of notes is downgraded below a certain rating level (or subsequently upgraded). The maximum adjustment is 2.000 percent above the initial interest rate and the interest rate cannot be reduced below the initial interest rate. As of May 25, 2025, no such adjustments have been made to this rate. \nThrough our shelf registration statement on file with the SEC, depending on conditions prevailing in the public capital markets, we may from time to time issue equity securities or unsecured debt securities in one or more series, which may consist of notes, debentures or other evidences of indebtedness in one or more offerings. \nFrom time to time, we or our affiliates, may repurchase our outstanding debt in privately negotiated transactions, open-market transactions or otherwise. Such repurchases, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. The amounts involved may be material.\nFrom time to time, we enter into interest rate derivative instruments to manage interest rate risk inherent in our operations. See Note 8 of the Notes to Consolidated Financial Statements (Part II, Item 8 of this report). \nA summary of our contractual obligations and commercial commitments at May 25, 2025, is as follows: \n(in millions)\nPayments Due by Period\nContractual Obligations\nTotal\nLess Than \n1 Year\n1-3 \nYears\n3-5 \nYears\nMore Than \n5 Years\nLong-term debt (1)\n$\n3,021.5 \n$\n106.4 \n$\n1,084.9 \n$\n481.6 \n$\n1,348.6 \nLeases (2)\n3,066.0 \n527.8 \n982.7 \n712.9 \n842.6 \nPurchase obligations (3)\n547.6 \n500.8 \n46.8 \n— \n— \nBenefit obligations (4)\n321.3 \n32.4 \n64.6 \n64.4 \n159.9 \nUnrecognized income tax benefits (5)\n23.7 \n1.6 \n4.6 \n17.5 \n— \nTotal contractual obligations\n$\n6,980.1 \n$\n1,169.0 \n$\n2,183.6 \n$\n1,276.4 \n$\n2,351.1 \n(in millions)\nAmount of Commitment Expiration per Period\nOther Commercial Commitments\nTotal \nAmounts \nCommitted\nLess Than \n1 Year\n1-3 \nYears\n3-5 \nYears\nMore Than \n5 Years\nStandby letters of credit (6)\n$\n96.7 \n$\n96.7 \n$\n— \n$\n— \n$\n— \nGuarantees (7)\n76.5 \n26.6 \n32.5 \n14.9 \n2.5 \nTotal commercial commitments\n$\n173.2 \n$\n123.3 \n$\n32.5 \n$\n14.9 \n$\n2.5 \n(1)\nIncludes interest payments associated with existing long-term debt. Excludes discount and issuance costs of $20.2 million. \n(2)\nIncludes non-cancelable future operating lease and finance lease commitments. \n(3)\nIncludes commitments for food and beverage items and supplies, capital projects, information technology and other miscellaneous items.\n(4)\nPrimarily represents our non-qualified deferred compensation plan through fiscal 2035.\n(5)\nIncludes interest on unrecognized income tax benefits of $2.3 million, $0.3 million of which relates to contingencies expected to be resolved within one year.\n(6)\nIncludes letters of credit for $80.0 million of workers’ compensation and general liabilities accrued in our consolidated financial statements and letters of credit for $16.7 million of surety bonds related to other payments. \n38\n(7)\nConsists solely of guarantees associated with leased properties that have been assigned to third parties and are primarily related to the disposition of Red Lobster in fiscal 2015.\nPer the Amendment, our adjusted debt to EBITDAR ratio must be 3.50 to 1.00 or lower in order to be in compliance with our financial covenants. As of May 25, 2025, our adjusted debt to EBITDAR ratio was 2.1.  For fiscal 2025, the lease-debt equivalent includes 6.00 times the total annual minimum rent for consolidated lease obligations of $498.1 million. The calculation of adjusted debt to EBITDAR ratio is shown in the following table:\n(in millions, except ratios)\nMay 25, 2025\nLong-term debt, excluding unamortized discount and issuance costs and fair value hedge\n$\n2,189.1 \nLease-debt equivalent\n2,988.9 \nGuarantees\n76.5\nAdjusted Debt\n$\n5,254.5 \nCalculation of EBITDAR\nEarnings from continuing operations\n$\n1,051.0 \nDepreciation and amortization\n516.1 \nInterest, net\n175.1 \nIncome tax expense\n136.2 \nImpairments and disposal of assets, net\n49.2 \nTransaction and integration costs\n51.1 \nNon-cash stock based compensation\n79.1 \nMinimum rent\n498.1 \nAdjusted EBITDAR\n$\n2,555.9 \nAdjusted Debt/ EBITDAR Ratio\n2.1\n \nPrior to the Amendment, the ratio was calculated as adjusted debt to adjusted total capital and the maximum permitted was 75 percent.  As of May 26, 2024, our adjusted debt to adjusted capital ratio was 66 percent.  For fiscal 2024, the lease-debt equivalent includes 6.00 times the total annual minimum rent for consolidated lease obligations of $464.4 million. The composition of our capital structure is shown in the following table: \n(in millions, except ratios)\nMay 26, 2024\nCapital Structure\nShort-term debt\n$\n86.8 \nLong-term debt, excluding unamortized discount and issuance costs and fair value hedge\n1,439.1 \nTotal debt\n$\n1,525.9 \nStockholders’ equity\n2,242.5 \nTotal capital\n$\n3,768.4 \nCalculation of Adjusted Capital\nTotal debt\n$\n1,525.9 \nLease-debt equivalent\n2,786.4 \nGuarantees\n71.0 \nAdjusted debt\n$\n4,383.3 \nStockholders’ equity\n2,242.5 \nAdjusted total capital\n$\n6,625.8 \nCapital Structure Ratios\nDebt to total capital ratio\n40 \n%\nAdjusted debt to adjusted total capital ratio\n66 \n%\n39\nBased on these ratios, we believe our financial condition is strong. We include the lease-debt equivalent and contractual lease guarantees in our ratios reported to shareholders, as we believe its inclusion better represents the optimal capital structure that we target from period to period and because it is consistent with the calculation of the covenant under our Revolving Credit Agreement.\nNet cash flows provided by operating activities from continuing operations were $1.71 billion and $1.62 billion in fiscal 2025 and 2024, respectively. Net cash flows provided by operating activities include net earnings from continuing operations of $1.05 billion in fiscal 2025 and $1.03 billion in fiscal 2024. Net cash flows provided by operating activities from continuing operations increased in fiscal 2025 primarily due to higher net earnings from continuing operations.\nNet cash flows used in investing activities from continuing operations were $1.3 billion in fiscal 2025 and 2024. Capital expenditures incurred principally for building new restaurants, remodeling existing restaurants, replacing equipment, and technology initiatives were $644.6 million in fiscal 2025, compared to $601.2 million in fiscal 2024. Net cash used in the acquisition of Chuy’s was $613.7 million during fiscal 2025. Net cash used in the acquisition of Ruth’s Chris was $701.1 million during fiscal 2024.\nNet cash flows used in financing activities from continuing operations were $385.8 million and $483.4 million in fiscal 2025 and 2024, respectively. Net cash flows used in financing activities in fiscal 2025 included dividend payments of $658.5 million, share repurchases of $418.2 million and repayment of commercial paper of $86.8 million, partially offset by net proceeds from the issuance of long-debt of $750.0 million and proceeds from the exercise of employee stock options. Net cash flows used in financing activities in fiscal 2024 included dividend payments of $628.4 million and share repurchases of $453.9 million, partially offset by the issuance of commercial paper of $86.8 million, net proceeds from the 2033 Notes of $500.0 million and proceeds from the exercise of employee stock options. Dividends declared by our Board of Directors totaled $5.60 and $5.24 per share for fiscal 2025 and 2024, respectively. \nWe are not aware of any trends or events that would materially affect our capital requirements or liquidity. We believe that our internal cash-generating capabilities, the potential issuance of equity or unsecured debt securities under our shelf registration statement and short-term commercial paper or drawings under our Revolving Credit Agreement should be sufficient to finance our capital expenditures, debt maturities and other operating activities through fiscal 2026. \nOFF-BALANCE SHEET ARRANGEMENTS \nWe are not a party to any off-balance sheet arrangements that have, or are reasonably likely to have, a current or future material effect on our financial condition, changes in financial condition, sales or expenses, results of operations, liquidity, capital expenditures or capital resources. \nFINANCIAL CONDITION \nOur total current assets were $937.7 million at May 25, 2025, compared with $822.8 million at May 26, 2024. The increase was primarily due to an increase in cash and cash equivalents driven by cash from operations.\nOur total current liabilities were $2.25 billion at May 25, 2025 and $2.19 billion at May 26, 2024. The increase was primarily due to increases in accounts payable as well as an increase in other current liabilities associated with our non-qualified deferred compensation plan, operating and financing leases and sales tax liability.\nAPPLICATION OF NEW ACCOUNTING STANDARDS \nSee Note 1 of the Notes to Consolidated Financial Statements (Part II, Item 8 of this report) for a discussion of recently issued accounting standards.",
  "item2": null
}