{
  "item1": "Darden Restaurants, Inc. full-service restaurant company, May 25, 2025, owned operated 2,159 restaurants through subsidiaries United States Canada under Olive Garden , LongHorn Steakhouse , Cheddar’s Scratch Kitchen , Ruth’s Chris Steak House (“Ruth’s Chris”), Capital Grille , Eddie V’s Prime Seafood (“Eddie V’s”), Bahama Breeze , Capital Burger trademarks. May 25, 2025, also 154 restaurants operated independent third parties pursuant area development franchise agreements 4 restaurants operating under contractual agreements. following table details number company-owned operated restaurants, well those operated under franchise contractual agreements, May 25, 2025: Number Restaurants Cheddar’s Scratch Kitchen Includes one restaurant owned jointly us third parties managed us.",
  "item7": "SALES following table presents company-owned restaurant sales, U.S. same-restaurant sales (SRS) average annual sales per restaurant segment periods indicated: Average Annual Sales per Restaurant (2) SRS (1) Same-restaurant sales year-over-year comparison each period’s sales volumes 52-week year limited restaurants been open, operated Darden, least 16 months. Average annual sales calculated sales divided total restaurant operating weeks multiplied 52 weeks; excludes franchise locations. Olive Garden’s sales increase fiscal 2025 primarily driven U.S.",
  "item2": "Food beverage costs decreased percent sales primarily due 0.7% impact pricing leverage, partially offset 0.5% impact inflation. Restaurant labor costs increased percent sales primarily due 1.0% impact inflation 0.3% impact higher performance-based compensation expense including higher 401k match restaurant teams, partially offset 0.7% impact pricing leverage, 0.2% impact productivity 0.2% impact brand mix. Restaurant expenses increased percent sales primarily due 0.5% impact inflation, 0.3% impact Uber direct fees 0.3% impact brand mix, partially offset 0.7% impact sales leverage 0.2% impact other. Pre-opening costs remained flat percent sales."
}