{
  "item1": "\"External conditions, including those related general economic, marketplace global health conditions...\" Physician relationships Joint venture partners own operate certain dialysis centers through entities structured joint ventures. generally hold controlling interests these joint ventures, nephrologists, hospitals, management services organizations, and/or other healthcare providers holding minority equity interests. These joint ventures typically formed limited liability companies. year ended December 31, 2024, revenues joint ventures which controlling interest represented approximately 30% U.S.",
  "item7": "reconciliation adjusted operating income (loss) reportable segment, see \" Reconciliations non-GAAP measures U.S. dialysis business December 31, 2024, U.S. dialysis business leading provider kidney dialysis services, operating 2,657 outpatient dialysis centers serving approximately 200,800 patients, contracted provide hospital inpatient dialysis services approximately 760 hospitals. estimate approximately 36% share U.S.",
  "item2": "Management’s Discussion Analysis Financial Condition Results Operations. Forward-looking statements incident experienced Company 2025, potential impact federal government shutdown One Big Beautiful Bill Act (OBBBA) business, including respect federal funding Medicaid other government programs, availability cost supplies, including without limitation impact evolving trade policies tariffs any reduction clinical other supplies due any disruptions experienced third party vendors, including respect ability provide home dialysis services, treatment volumes, mix expectation, such percentage number patients under commercial insurance, including potential impacts such mix result federal government shutdown U.S. administration policies, current macroeconomic, marketplace labor market conditions, overall impact patients teammates, well other statements regarding future operations, financial condition prospects, capital allocation plans, expenses, cost saving initiatives, other strategic initiatives, use contract labor, government commercial payment rates, expectations related value-based care (VBC), integrated kidney care (IKC), Medicare Advantage (MA) plan enrollment international operations, expectations regarding increased competition marketplace changes, including those related new potential entrants dialysis pre-dialysis marketplace potential impact innovative technologies, drugs, other treatments dialysis industry, expectations regarding share repurchase program. All statements report, other than statements historical fact, forward-looking statements."
}