{
  "source_file": "dva-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.        Business\nUnless otherwise indicated in this report \"DaVita\", \"the Company\" \"we\", \"us\", \"our\" and other similar terms refer to DaVita Inc. and its consolidated subsidiaries. Our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, are made available free of charge through our website, located at \nhttp://www.davita.com\n, as soon as reasonably practicable after the reports are filed with or furnished to the Securities and Exchange Commission (SEC). The SEC also maintains a website at \nhttp://www.sec.gov\n where these reports and other information about us can be obtained. The contents of our website are not incorporated by reference into this report.\nOverview of DaVita Inc.\nDaVita is a leading healthcare provider focused on transforming care delivery to improve quality of life for patients globally. As a comprehensive kidney care provider, we have been a leader in clinical quality and innovation for 25 years. We care for patients at every stage and setting along their kidney health journey\n–\nfrom earlier diagnosis and prevention through supporting the transplant process. This includes ensuring they are supported at home, in our dialysis centers, in the hospital and/or skilled nursing facilities. In our unwavering pursuit of a healthier tomorrow, we strive to reimagine what high quality care looks like: more preventative, better integrated, improved outcomes at the lowest total cost, and personalized at scale to deliver a better tomorrow regardless of location, insurance status or other factors. Our caring culture fuels our continuous drive toward achieving our mission to be the provider, partner and employer of choice.\nDefining chronic kidney disease \nThere are five stages of chronic kidney disease (CKD). These stages are generally based on how well the kidneys work to filter waste and extra fluid out of the blood–with higher stages of CKD corresponding to progressing levels of kidney disease. Stage 1 CKD is the closest to healthy kidney function. Stage 5 CKD indicates that a patient has severe kidney damage.\nA patient diagnosed with Stage 5 CKD has kidneys that have lost nearly all functionality or have failed. If an individual's kidneys fail, the person is then diagnosed with end stage renal disease (ESRD), also known as end stage kidney disease (ESKD). Because kidney function is essential for survival and the loss of kidney function is normally irreversible, ESKD patients require continued dialysis treatments or a kidney transplant to sustain life. Dialysis is the removal of toxins, fluids and salt from the blood of patients by artificial means. Patients suffering from ESKD generally require regular life-sustaining dialysis therapy for the rest of their lives or until they receive a kidney transplant. \nThe treatment goal for CKD patients prior to Stage 5 is to manage and slow the progression of the disease to preserve kidney functionality. Because kidney failure is typically caused by one or more comorbidities such as Type I and Type II diabetes, hypertension, polycystic kidney disease, long-term autoimmune attack on the kidneys or prolonged urinary tract obstruction, slowing the progression generally involves working with nephrologists and dieticians to help control blood pressure, monitor blood glucose and maintain healthy diet and exercise routines, among other things. If the kidney disease continues to progress, the goal is to support efforts for kidney transplantation where available and medically appropriate, and in the event transplantation is not possible, to work with the patient and his or her nephrologist to safely transition the patient to the dialysis treatment and modality of their choice.\nOur businesses\nWe are a leading dialysis provider in the United States. Our U.S. dialysis and related lab services (U.S. dialysis) business treats patients with chronic kidney failure, ESKD, in the United States, and is our largest line of business. Our robust platform to deliver kidney care services also includes established nephrology and payor relationships. \nIn addition, as of December 31, 2024, our international operations provided dialysis and administrative services to a total of 509 outpatient dialysis centers located in 13 countries outside of the U.S., serving approximately 80,300 patients.\nFinally, our U.S. integrated kidney care (IKC) business provided integrated care and disease management services to 70,400 patients in risk-based integrated care arrangements and to an additional 11,600 patients in other integrated care arrangements across the United States as of December 31, 2024.\nWe also maintain a few other ancillary services and investments outside of our U.S. dialysis, U.S. IKC, or international operations, which we refer to as our U.S. other ancillary services. We refer to our U.S. integrated kidney care business, U.S. other ancillary services and international operations as, collectively, our \"ancillary services.\" We also have a separate corporate \n2\nadministrative support function that supports our U.S. dialysis business and these ancillary services\n. Each of our businesses are described in greater detail in the sections that follow.\nOur care model\nOur patient-centric care model leverages our platform of kidney care services to maximize patient choice in both models and modalities of care. We believe that the flexibility we offer coupled with a focus on comprehensive kidney care supports our commitments to help improve equitable clinical outcomes and quality of life for our patients. According to the most recently published data, for the ten most recently reported years, we have continued as an industry leader in the Centers for Medicare & Medicaid Services’ (CMS) Quality Incentive Program (QIP), which promotes high quality services in outpatient dialysis facilities treating patients with ESKD. In addition, according to the most recently published data, for the nine most recently reported years, we have also continued as an industry leader under CMS’ Five-Star Quality Rating System (Star Rating), which rates eligible dialysis centers based on the quality of outcomes to help patients, their families, and caregivers make more informed decisions about where patients receive care. Following a pause in refreshed Star Ratings in October 2020 and October 2021 due to the COVID-19 pandemic, CMS reset the baseline with the October 2023 Star Rating release to reflect current performance and provide clinical differentiation through newly defined cutoff values. Under the new baseline, the lowest scoring 10% of facilities receive one star, the next 20% receive two stars, the next 40% receive three stars, the next 20% receive four stars and the highest 10% of facilities receive five stars in the baseline period for each subsequent evaluation period.\nOur clinical outcomes are driven by our experienced and knowledgeable caregivers. We employ registered nurses, licensed practical or vocational nurses, patient care technicians, social workers, registered dietitians, biomedical technicians and other administrative and support teammates who strive to achieve superior clinical outcomes at our dialysis facilities. In addition to our teammates at our dialysis facilities, as of December 31, 2024, our domestic Chief Medical Officer leads a team of 23 nephrologists in our physician leadership team as part of our domestic Office of the Chief Medical Officer (OCMO). Our international Chief Medical Officer leads a team of 11 nephrologists in our physician leadership team as part of our international OCMO as of December 31, 2024. Our OCMO teammates represent a variety of academic, clinical practice, and clinical research backgrounds. We also have a Physician Council that serves as an advisory body to senior management, which was composed of 10 physicians with extensive experience in clinical practice and five Group Medical Directors as of December 31, 2024.\nValue-based care arrangements continue to impact the kidney health space. These arrangements are fostering a much larger degree of \ncollaboration\n between nephrologists and other providers, including transplant programs, resulting in a more complete understanding of each patient’s clinical needs. We believe this more complete understanding allows for better care coordination and earlier intervention, which we believe ultimately leads to improved clinical outcomes, lower overall costs and improved patient experiences. Our IKC business provides comprehensive care management for complex CKD patients nationwide, with payment models that include a variety of structures to advance and encourage integrated and value-based care. Among other arrangements, our IKC business has percent-of-premium arrangements in several Medicare Advantage ESRD Chronic Special Needs Plans and is an active participant in CMMI’s Comprehensive Kidney Care Contracting (CKCC) model that seeks to manage the care of late stage CKD and ESKD patients to delay the progression of kidney disease, promote home dialysis when appropriate, and incentivize transplants. Our IKC business also utilizes other value-based payment methodologies in its care coordination and disease management contracts, which include two-sided shared savings/shared losses and outcomes-based pay-for-performance compensation arrangements.\nU.S. dialysis business\nOur U.S. dialysis business is a leading provider of kidney dialysis services for patients suffering from ESKD. As of December 31, 2024, we provided dialysis, administrative and related laboratory services in the U.S. through a network of 2,657 outpatient dialysis centers in 46 states and the District of Columbia, serving a total of approximately 200,800 patients. We also have contracts to provide hospital inpatient dialysis services in approximately 760 hospitals throughout the U.S. \nBased on the most recent 2024 annual data report from the United States Renal Data System (USRDS), there were over 554,000 ESKD dialysis patients in the U.S. in 2022. The underlying ESKD dialysis patient population grew at an approximate compound annual rate of 3.3% from 2012 to 2022 and 3.4% from 2017 to 2022 as compared to a decline in annual growth of 0.4% from 2021 to 2022. Despite this near term slowdown, which, among other things, included impacts from the COVID-19 pandemic on mortality rates amongst the ESKD dialysis patient population, the rate of growth has been relatively consistent over time. In general, a number of factors may impact ESKD growth rates, including, among others, mortality rates for dialysis patients or CKD patients, the growth and aging of the U.S. population, limitations on immigration in the U.S., transplant rates, incidence rates for diseases that cause kidney failure such as diabetes and hypertension, growth rates of minority populations with higher than average incidence rates of ESKD or other changes in demand for dialysis treatments over time, including for \n3\nexample, as a result of the development and application of certain innovative technologies, drugs or other treatments. Certain of these factors, in particular mortality rates for dialysis or CKD patients, have been impacted by the COVID-19 pandemic.\nTreatment options for ESKD\nTreatment options for ESKD are dialysis and kidney transplantation.\nDialysis options\n•\nHemodialysis\nHemodialysis is the most common form of ESKD treatment. The hemodialysis machine uses a filter, called a dialyzer, to remove toxins, fluids and salt from the patient’s blood. The dialysis process occurs across a semi-permeable membrane that divides the dialyzer into two distinct chambers. While blood is circulated through one chamber, a pre-mixed fluid is circulated through the other chamber. The toxins, salt and excess fluids from the blood cross the membrane into the fluid, allowing cleansed blood to return back into the patient’s body. \nHemodialysis is usually performed at a freestanding outpatient dialysis center, at a hospital-based outpatient center, in a skilled nursing facility or at the patient's home. Our freestanding outpatient dialysis centers are staffed with members of our care team and store the supplies necessary for treatment. Treatments are usually performed three times per week.\nHospital inpatient hemodialysis services are required for patients with acute kidney failure primarily resulting from acute medical illness or trauma, patients in early stages of ESKD and ESKD patients who require hospitalization for other reasons. Hospital inpatient hemodialysis is generally performed at the patient’s bedside or in a dedicated treatment room in the hospital, as needed.\nSome ESKD patients may perform hemodialysis with the help of a care partner in their home or residence through the use of a hemodialysis machine designed specifically for home therapy that is portable, smaller and easier to use. This is referred to as home hemodialysis (HHD). Patients receive training, support and monitoring from registered nurses, usually in our outpatient dialysis centers, in connection with their HHD treatment. HHD is typically performed with greater frequency than dialysis treatments performed in outpatient dialysis centers and on varying schedules.\n•\nPeritoneal dialysis\nPeritoneal dialysis uses the patient’s peritoneal or abdominal cavity to eliminate fluid and toxins and is typically performed at home. The most common methods of peritoneal dialysis are continuous ambulatory peritoneal dialysis (CAPD) and continuous cycling peritoneal dialysis (CCPD). Because it does not involve going to an outpatient dialysis center three times a week for treatment, peritoneal dialysis is generally an alternative to hemodialysis for patients who are healthier, more independent and desire more flexibility in their lifestyle. \nCAPD introduces dialysis solution into the patient’s peritoneal cavity through a surgically placed catheter. Toxins in the blood continuously cross the peritoneal membrane into the dialysis solution. After several hours, the patient drains the used dialysis solution and replaces it with fresh solution. This procedure is usually repeated four times per day.\nCCPD is performed in a manner similar to CAPD, but uses a mechanical device to cycle dialysis solution through the patient’s peritoneal cavity while the patient is sleeping or at rest.\n•\nKidney transplantation\nKidney transplantation, when successful, is considered the most desirable form of therapeutic intervention. However, in light of the shortage of suitable donors, side effects of immunosuppressive pharmaceuticals given to transplant recipients and dangers associated with transplant surgery, some patient populations have generally limited the use of this treatment option. In accordance with an executive order signed in July 2019 (the 2019 Executive Order), the U.S. Department of Health and Human Services (HHS) developed policies addressing, among other things, the goal of making more kidneys available for transplant. CMS, through CMMI, also subsequently released the framework for certain proposed and existing voluntary and mandatory payment models, including ESRD Treatment Choices Model (ETC) model, which would adjust payment incentives to encourage kidney transplants. For more information about these payment models, please see the discussion below under the heading \"—\nIntegrated Kidney Care, Medicare and Medicaid program reforms and Other Healthcare Regulations\n.\"\n•\nHemodiafiltration\nHemodiafiltration (HDF) is a form of augmented hemodialysis that includes a component of convection to remove additional molecules from the blood. Like hemodialysis, HDF can be performed at certain freestanding outpatient dialysis \n4\ncenters and may also be performed in hospital in-patient centers. HDF usage varies by country, and the efficacy of this modality is still being assessed in the U.S.\nU.S. dialysis services we provide\nOutpatient hemodialysis services \nThe majority of services we provide to patients are outpatient hemodialysis treatments. As a condition of our enrollment in Medicare for the provision of dialysis services, we contract with a nephrologist or a group of associated nephrologists to provide medical director services at each of our dialysis centers. In addition, other nephrologists may apply for practice privileges to treat their patients at our centers. Each center has an administrator, often a registered nurse, who supervises the day-to-day operations of the center and its staff. The staff of each center typically consists of registered nurses, licensed practical or vocational nurses, patient care technicians, a social worker, a registered dietician, biomedical technician support and other administrative and support personnel.\nThe overall number of patients to whom we provided services in the U.S. in 2024 was relatively flat compared to 2023, primarily due to growth in new admits partially offset by elevated mortality rates, which continue to be elevated relative to our pre-COVID-19 mortality rates.\nHospital inpatient hemodialysis services\nAs of December 31, 2024, we have contracts to provide hospital inpatient dialysis services to patients in approximately 760 hospitals throughout the U.S. We render these services based on a contracted per-treatment fee that is individually negotiated with each hospital. When a hospital requests our services, we typically administer the dialysis treatment at the patient’s bedside or in a dedicated treatment room in the hospital, as needed. \nHome-based dialysis services \nHome-based dialysis services includes HHD and peritoneal dialysis. Many of our outpatient dialysis centers offer certain support services for dialysis patients who prefer and are able to perform either HHD or peritoneal dialysis in their homes. Home-based hemodialysis support services consist of providing equipment and supplies, training, patient monitoring, on-call support services and follow-up assistance. Registered nurses train patients and their families or other caregivers to perform either HHD or peritoneal dialysis. The 2019 Executive Order and related HHS guidance described above also included a stated goal of increasing the relative number of new ESKD patients that receive dialysis at home.\nAccording to the most recent annual data report from the USRDS, in 2022 approximately 14% of ESKD dialysis patients in the U.S. utilized home-based dialysis.\nTreatments and revenues by modality:\nThe following graph summarizes our U.S. dialysis treatments by modality and U.S. dialysis patient service revenues by modality for the year ended December 31, 2024.\nOther\nESKD laboratory services \nWe operate a separately licensed and highly automated clinical laboratory that specializes in ESKD patient testing. This specialized laboratory provides routine laboratory tests for dialysis and other physician-prescribed laboratory tests for ESKD patients. The vast majority of these tests are performed for our ESKD patients throughout the U.S. These tests are performed for \n5\na variety of reasons, including to monitor a patient’s ESKD condition, including the adequacy of dialysis, as well as other medical conditions of the patient. Our laboratory utilizes information systems that provide information to certain members of the dialysis centers’ staff and medical directors regarding critical outcome indicators.\nManagement services \nWe currently operate or provide management and administrative services pursuant to management and administrative services agreements to 52 outpatient dialysis centers located in the U.S. in which we either own a noncontrolling interest or which are wholly-owned by third parties. Management fees are established by contract and are recognized as earned typically based on a percentage of revenues or cash collections generated by the outpatient dialysis centers.\nSources of revenue—concentrations and risks\nOur U.S. dialysis revenues represent approximately 88% of our consolidated revenues for the year ended December 31, 2024. Our U.S. dialysis revenues are derived primarily from our core business of providing dialysis services and related laboratory services and, to a lesser extent, the administration of pharmaceuticals and management fees generated from providing management and administrative services to certain outpatient dialysis centers, as discussed above.\nThe sources of our U.S. dialysis revenues are principally from government-based programs, including Medicare and Medicare Advantage plans, Medicaid and managed Medicaid plans, other government-based programs including our agreement with the Veterans Administration, and commercial insurance plans. The following table summarizes our U.S. dialysis revenues by payor source for U.S. dialysis patient service revenues for the year ended December 31, 2024:\nMedicare and Medicare Advantage plans\n56 \n%\nMedicaid and managed Medicaid plans\n8 \n%\nOther government-based programs\n3 \n%\nTotal government-based programs\n67 \n%\nCommercial (including hospital dialysis services)\n33 \n%\nTotal U.S. dialysis patient service revenues\n100 \n%\nMedicare revenue\nMedicare fee for service\nSince 1972, the federal government has provided healthcare coverage for qualified ESRD patients under the Medicare ESRD program regardless of age or financial circumstances. ESRD is the first and only disease state eligible for Medicare coverage both for dialysis and dialysis-related services and for all benefits available under the Medicare program. \nGovernment dialysis related payment rates in the U.S. are principally determined by federal Medicare and state Medicaid policy. For patients with Medicare coverage, all ESRD payments for dialysis treatments are made under a single bundled payment rate that provides a fixed payment rate to encompass all goods and services provided during the dialysis treatment that are related to the dialysis treatment, including certain pharmaceuticals, such as erythropoiesis-stimulating agents (ESAs), calcimimetics, vitamin D analogs, oral-only renal phosphate binders and iron supplements, irrespective of the level of pharmaceuticals administered to the patient or additional services performed. Most lab services are also included in the bundled payment. \nAlthough Medicare reimbursement limits the allowable charge per treatment, it provides industry participants with a relatively predictable and recurring revenue stream for dialysis services provided to patients without commercial insurance. For the year ended December 31, 2024, approximately 89% of our total U.S. dialysis patients were covered under some form of government-based program, with approximately 74% of our total U.S. dialysis patients covered under Medicare and Medicare Advantage plans. \nUnder this bundled payment rate system, known as the ESRD Prospective Payment System (PPS), the payments to a dialysis facility may be reduced by as much as 2% based on the facility’s performance in specified quality measures set annually by CMS through its QIP. CMS established QIP through the Medicare Improvements for Patients and Providers Act of 2008 to promote high quality services in outpatient dialysis facilities treating patients with ESRD. QIP associates a portion of Medicare reimbursement directly with a facility’s performance on quality of care measures. Reductions in Medicare reimbursement result when a facility’s overall score on applicable measures does not meet established standards.\n6\nUncertainty about future payment rates remains a material risk to our business, as well as the potential implementation of or changes in coverage determinations or other rules or regulations by CMS or Medicare Administrative Contractors that may impact reimbursement. An important provision in the Medicare ESRD statute is an annual adjustment, or market basket update, to the ESRD PPS base rate. Absent action by Congress, the ESRD PPS base rate is updated annually by an inflation adjustment based on historical data and forecasts that may create a lag between these adjustments and actual inflationary increase. As a result, an inflation adjustment may not always cover the actual inflationary increase experienced. Due in part to continued higher than expected inflation rates, the annual update for the 2024 ESRD PPS base rate did not accurately forecast the cost increase experienced by providers. \nIn November 2024, CMS issued a final rule to update the Medicare ESRD PPS payment rate and policies for calendar year 2025. Among other things, the final rule updated both the ESRD and Acute Kidney Injury (AKI) dialysis payment rate for renal dialysis services furnished by ESRD facilities, extended payment for dialysis in a home setting for AKI, and outlined requirements for the ESRD QIP. CMS estimates that the overall impact of the rule will increase ESRD facilities' average reimbursement by a productivity-adjusted market basket increase of 2.2%. On January 1, 2025, phosphate binders, a drug class taken orally by many ESKD patients to reduce absorption of dietary phosphate, were incorporated into the ESRD PPS bundled payment rate. Phosphate binders are not considered accounted for in the ESRD PPS base rate at this time and will be reimbursed through a Transitional Drug Add-on Payment Adjustment (TDAPA). The TDAPA period is expected to continue for a period of at least two years.\nAs a result of the Budget Control Act of 2011 (BCA) and subsequent activity in Congress, a $1.2 trillion sequester (across-the-board spending cuts) in discretionary programs took effect in 2013 reducing Medicare payments (currently by 2%), which was subsequently extended into fiscal year 2032. \nMost ESRD patients receiving dialysis services become eligible for primary Medicare coverage at various times, depending on their age or disability status, as well as whether they are covered by a commercial insurance plan. Generally, for a patient not covered by a commercial insurance plan, Medicare can become the primary payor for qualified ESRD patients receiving dialysis services either immediately or after a three-month waiting period. In most cases, for a patient covered by a commercial insurance plan, Medicare will either become the primary payor after 33 months, which includes the three-month waiting period, or earlier if the patient’s commercial insurance plan coverage terminates or if the patient chooses Medicare over the commercial plan. When Medicare becomes the primary payor, the payment rates we receive for that patient shift from the commercial insurance plan rates to Medicare payment rates, which are on average significantly lower than commercial insurance rates.\nMedicare pays 80% of the amount set by the Medicare system for each covered dialysis treatment. The patient is responsible for the remaining 20%. In many cases, a secondary payor, such as Medicare supplemental insurance, a state Medicaid program or a commercial health plan, covers all or part of these balances. If a patient does not have secondary insurance coverage, we are generally unsuccessful in our efforts to collect from the patient the remaining 20% portion of the ESRD composite rate that Medicare does not pay. In those instances, however, we are able to recover some portion of this unpaid patient balance from Medicare through an established cost reporting process by identifying these Medicare bad debts on each center’s Medicare cost report. For additional detail on the associated risks, see the risk factor in Part I Item 1A. \"\nRisk Factors\n\" under the heading \n\"\nChanges in federal and state legislation or regulations...\" \nMedicare Advantage revenue\nMedicare Advantage (MA, managed Medicare or Medicare Part C) plans are offered by private health insurers who contract with CMS to provide their members with Medicare Part A, Part B and/or Part D benefits. These MA plans include health maintenance organizations, preferred provider organizations, private fee-for-service (FFS) organizations, special needs plans (SNPs) or Medicare medical savings account plans. Since January 1, 2021, under the 21st Century Cures Act (the Cures Act) Medicare-eligible beneficiaries with ESRD can choose coverage under an MA plan. MA plans usually provide reimbursement to us at a negotiated rate that is generally higher than Medicare FFS rates. CMS releases an annual MA notice that includes, among other things, a MA payment rate for MA plans and updates certain policies associated with risk adjustments. We continue to monitor MA notices, regulatory updates and guidance, as well as enforcement for impact on our business. \nMedicaid revenue\nMedicaid programs are state-administered programs partially funded by the federal government. These programs are intended to provide health coverage for patients whose income and assets fall below state-defined levels and who are otherwise uninsured. These programs also serve as supplemental insurance programs for co-insurance payments due from Medicaid-eligible patients with primary coverage under the Medicare program. Some Medicaid programs also pay for additional services, \n7\nincluding some oral medications that are not covered by Medicare. We are enrolled in the Medicaid programs in the states in which we conduct our business.\nCommercial revenue\nAs discussed above, if a patient has commercial insurance, then that commercial insurance plan is generally responsible for payment of dialysis services for up to the first 33 months before that patient becomes eligible to elect to have Medicare as their primary payor for dialysis services. Although commercial payment rates vary, average commercial payment rates negotiated with commercial payors are generally significantly higher than Medicare rates. The payments we receive from commercial payors generate nearly all of our profits and all of our non-hospital dialysis profits come from commercial payors. Payment methods from commercial payors can include a single per treatment rate, referred to as bundled rates, or in other cases separate payments for dialysis treatments and pharmaceuticals, if used as part of the treatment, referred to as FFS rates. Commercial payment rates are the result of negotiations between us and commercial payors or third party administrators. Our commercial contracts sometimes contain annual price escalator provisions. We are comprehensively contracted, and the vast majority of patients insured through commercial health plans are covered by one of our commercial contracts, though we also receive payments for a limited set of commercial patients that are covered by a health plan that considers us out-of-network. While our out-of-network payment rates are on average higher than in-network commercial contract payment rates, we have made efforts to be contracted with the majority of commercial payors offering health plans.\nApproximately 27% of our U.S. dialysis patient service revenues and approximately 11% of our U.S. dialysis patients are associated with non-hospital commercial payors for the year ended December 31, 2024. Non-hospital commercial patients as a percentage of our total U.S. dialysis patients for 2024 increased slightly compared to 2023. Less than 1% of our U.S. dialysis revenues are due directly from patients. No single commercial payor accounted for more than 10% of total U.S. dialysis revenues for the year ended December 31, 2024. See Note 2 to the consolidated financial statements included in this report for disclosure on our concentration related to our commercial payors on a total consolidated revenue basis.\nBoth the number of our patients under commercial plans and the rates under these commercial plans are subject to change based on a number of factors. For additional detail on these factors and other risks associated with our commercial revenue, see the risk factors in Part I Item 1A. \"\nRisk Factors\n\" under the headings \"\nOur business is subject to a complex set of governmental laws, regulations and other requirements...;\" \"\nChanges in federal and state legislation or regulations...;\" \"If the number or percentage of patients with higher-paying commercial insurance declines...;\n\" \nand\n \n\"External conditions, including those related to general economic, marketplace and global health conditions...\"\nPhysician relationships\nJoint venture partners\nWe own and operate certain of our dialysis centers through entities that are structured as joint ventures. We generally hold controlling interests in these joint ventures, with nephrologists, hospitals, management services organizations, and/or other healthcare providers holding minority equity interests. These joint ventures are typically formed as limited liability companies. For the year ended December 31, 2024, revenues from joint ventures in which we have a controlling interest represented approximately 30% of our U.S. dialysis revenues. We expect to continue to enter into new U.S. dialysis-related joint ventures in the ordinary course of business.\nCommunity physicians\nAn ESKD patient generally seeks treatment or support for their home treatment at an outpatient dialysis center near their home where their treating nephrologist has practice privileges. Our relationships with local nephrologists and our ability to provide quality dialysis services and to meet the needs of their patients are key factors in the success of our dialysis operations. Nearly 5,300 nephrologists currently refer patients to our outpatient dialysis centers.    \nMedical directors\nParticipation in the Medicare ESRD program requires that dialysis services at an outpatient dialysis center be under the general supervision of a medical director. Per these requirements, this individual is usually a board certified nephrologist. We engage physicians or groups of physicians to serve as medical directors for each of our outpatient dialysis centers. At some outpatient dialysis centers, we also separately contract with one or more other physicians or groups to serve as assistant or associate medical directors over other modalities such as home dialysis. We have over 900 individual physicians and physician groups under contract to provide medical director services.\nMedical directors for our dialysis centers enter into written contracts with us that specify their duties and fix their compensation. These agreements range in duration, but generally are for periods of ten years. The compensation of our medical \n8\ndirectors is the result of arm’s length negotiations, consistent with fair market value, and generally depends upon an analysis of various factors such as the physician’s duties, responsibilities, professional qualifications and experience, as well as the time and effort required to provide such services.\nOur medical director contracts and joint venture operating agreements generally include covenants not to compete or own interests in dialysis centers operated by other providers within a defined geographic area for various time periods, as applicable. These non-compete agreements do not restrict or limit the physicians from practicing medicine or prohibit the physicians from referring patients to any outpatient dialysis center, including dialysis centers operated by other providers. \nLocation of our U.S. dialysis centers\nWe operated 2,657 outpatient dialysis centers in the U.S. as of December 31, 2024 and 2,605 of these centers are consolidated in our financial statements. Of the remaining 52 nonconsolidated U.S. outpatient dialysis centers, we own noncontrolling interests in 49 centers and provide management and administrative services to three centers that are wholly-owned by third parties. The locations of the 2,605 U.S. outpatient dialysis centers consolidated in our financial statements at December 31, 2024, were as follows:\nAncillary services, including our international operations\n Our ancillary services relate primarily to our core business of providing kidney care services. As of December 31, 2024, these consisted primarily of our U.S. integrated kidney care (IKC) business, certain U.S. other ancillary businesses (including our clinical research programs, transplant software business, and venture investment group), and our international operations.\nWe have made and continue to make investments in building our integrated care capabilities, including the operation of certain strategic business initiatives that are intended to integrate and coordinate care among healthcare participants across the renal care continuum from CKD to ESKD to kidney transplant. Through improved technology and data sharing, as well as an increasing focus on value-based contracting and care, these initiatives seek to bring together physicians, nurses, dieticians, pharmacists, hospitals, dialysis clinics, transplant centers, payors and other specialists with a view towards improving clinical outcomes for our patients and reducing the overall cost of comprehensive kidney care. Certain of our ancillary services are described below.\n9\nU.S. Integrated Kidney Care\n•\nIntegrated Kidney Care.\n DaVita Integrated Kidney Care (DaVita IKC), provides advanced integrated care management services to health plans and government programs for members/beneficiaries diagnosed with ESKD and CKD. Through a combination of health monitoring, clinical coordination, innovative interventions, predictive analytics, medical claims analysis and information technology, we endeavor to assist our health plan and government program customers and patients in obtaining superior renal healthcare and improved clinical outcomes, as well as helping to reduce overall medical costs. Integrated kidney care management revenues from commercial and Medicare Advantage insurers can be based upon either an established contract fee recognized as earned for services provided over the contract period, or related to the operation of risk-based and value-based care programs, including shared savings, pay-for-performance, and capitation contracts. DaVita IKC also contracts with payors to support MA ESKD chronic condition special needs plans (C-SNPs) to provide ESKD patients full service healthcare and integrated care management services. DaVita IKC currently participates in both the involuntary and certain voluntary payment models administered by CMMI. As described below under the heading \"\n—Government regulation\n—\nCMMI Payment Models\n\", we have invested resources, and expect to continue to invest substantial resources in these models as part of our overall plan to grow our integrated kidney care business and value-based care initiatives. See Note 1, \nOther revenues, \nin the Company's consolidated financial statements for more information on how the Company accounts for its integrated care arrangements.\nThe Company is also developing, and has entered into, various forms of technology-based, administrative, financial and other collaboration and incentive arrangements with physician partners and other providers in support of our innovative care model, developing and expanding IKC programs and arrangements.\nU.S. Other Ancillary services\n•\nClinical research programs.\n DaVita Clinical Research (DCR) is a provider-based specialty clinical research organization with a wide spectrum of services for clinical drug research and device development. DCR uses its extensive real-world healthcare expertise to assist in the design, recruitment and completion of retrospective and prospective studies. Revenues are based upon study generated fees, as determined by contract with drug companies and other sponsors, and are recognized as earned according to the contract terms.\n•\nTransplant software business.\n DaVita's transplant software business, MedSleuth, works with transplant centers across the U.S. to provide greater connectivity among transplant candidates, transplant centers, physicians and care teams to help improve the experience and outcomes for kidney and liver transplant patients. \n•\nVenture group. \nDaVita Venture Group (DVG) focuses on innovative products, solutions and businesses that improve care for patients with kidney disease and related conditions. DVG identifies companies and products for acquisitions, strategic partnerships, and venture investment opportunities. DVG’s focus includes innovation in digital health, pharmaceuticals, medical devices, and care delivery models. \nFor additional discussion of our ancillary services, see Part II Item 7, \"\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\n\" \nInternational dialysis operations\nWe operated, managed or administered 509 outpatient dialysis centers located in 13 countries outside of the U.S. serving approximately 80,300 patients as of December 31, 2024. Our international dialysis operations have continued to grow steadily and expand as a result of acquiring and developing outpatient dialysis centers in various strategic markets. Our international operations are included in our ancillary services. \n10\nAs of December 31, 2024, the international outpatient dialysis centers we operate or provide administrative services to were located as follows: \nBrazil\n100 \nColombia\n72 \nChile\n63 \nPoland\n63 \nGermany\n49 \nMalaysia\n44 \nUnited Kingdom\n27 \nSaudi Arabia\n26 \nEcuador\n22 \nChina\n12 \nJapan\n12 \nPortugal\n12 \nSingapore\n7 \n \n509 \nFor additional discussion of our international business, see Part II Item 7, \"\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\n\"\nCorporate administrative support\nCorporate administrative support consists primarily of labor, benefits and long-term incentive compensation costs, as well as professional fees for departments which provide support to more than one of our different operating lines of business. These expenses are included in our consolidated general and administrative expenses.\nGovernment regulation\nWe operate in a complex regulatory environment with an extensive and evolving set of federal, state, local and international governmental laws, regulations and other requirements. These laws, regulations and other requirements are promulgated and overseen by a number of different legislative, regulatory, administrative and quasi-regulatory bodies, each of which may have varying interpretations, judgments or related guidance. As such, we utilize considerable resources on an ongoing basis to monitor, assess and respond to applicable legislative, regulatory and administrative requirements, but there is no guarantee that we will be successful in our efforts to adhere to all of these requirements. \nIf any of our personnel, representatives, third party vendors or operations are alleged to have violated these or other laws, regulations or requirements, we could experience material harm to our reputation and stock price, and it could impact our relationships and/or contracts related to our business, among other things. If any of our personnel, representatives, third party vendors or operations are found to violate these or other laws, regulations or requirements, we could suffer additional severe consequences that could have a material adverse effect on our business, results of operations, financial condition and cash flows. Additional discussion on certain of these laws, regulations and other requirements is set forth below in this section.\nOur business is and we expect that our industry will continue to be subject to extensive and complex federal, state, local and international laws, regulations and other requirements, the scope and effect of which are difficult to predict. We are also currently subject to various legal proceedings, such as lawsuits, investigations, audits and inquiries by various government and regulatory agencies, as described in Note 15 to the consolidated financial statements, and our operations and activities could be reviewed or challenged by regulatory authorities at any time in the future. In addition, each of the laws, regulations and other requirements, including interpretations thereof, that govern our business may continue to change over time, and there is no assurance that we will be able to accurately predict the nature, timing or extent of such changes or the impact of such changes on the markets in which we conduct business or on the other participants that operate in those markets. For additional detail on risks related to each of the foregoing, as well as the consequences of any violation of applicable laws, regulations or other requirements, see the discussion in Part I Item 1A. \"\nRisk Factors\n\" under the headings, \"\nOur business is subject to a complex set of governmental laws, regulations and other requirements...;\" \nand\n \"We are, and may in the future be, a party to various lawsuits, demands, claims, qui tam suits, governmental investigations and audits and other legal matters...\"\nLicensure and Certification\nOur dialysis centers are certified by CMS, as required for the receipt of Medicare payments. Certain of our payor contracts also condition payment on Medicare certification. In some states, our outpatient dialysis centers also are required to \n11\nsecure additional state licenses and permits. Governmental authorities, primarily state departments of health, periodically inspect our centers to determine if we satisfy applicable federal and state standards and requirements, including the conditions for coverage in the Medicare ESRD program.\nWe have experienced some delays in obtaining Medicare certifications from CMS, though changes by CMS in the prioritizing of dialysis providers as well as legislation allowing private entities to perform initial dialysis facility surveys for certification has helped to decrease or limit certain delays.\nIn addition, pursuant to the Provider Enrollment Rule, CMS has authority to revoke provider enrollment and to impose a Medicare reapplication bar where a prospective provider's Medicare enrollment application is denied because the provider submitted incomplete, false, or misleading information for providers who are terminated from the Medicare program. CMS may also deny enrollment to providers who have affiliations with other providers that CMS has determined pose undue risk of fraud, waste or abuse. If we fail to comply with these and other applicable requirements on our licensure and certification programs, particularly in light of increased penalties that include a 10-year bar to Medicare re-enrollment, under certain circumstances it could have a material adverse impact on our business, results of operations, financial condition, cash flows and reputation. \nIn addition to certification by CMS, our dialysis centers are also certified by each state Medicaid program, are licensed in those states that require licensing for dialysis clinics, and are required to obtain licenses, permits and certificates, including for such areas as biomedical waste. Failure to obtain the correct certifications, permits and certificates as well as a failure to adhere to the requirements thereunder, may result in penalties, fines, and the loss of the right to operate, any of which could have a material adverse impact on our business, results of operations, financial condition, cash flows and reputation.\nFederal Anti-Kickback Statute\nThe federal Anti-Kickback Statute prohibits, among other things, knowingly and willfully offering, paying, soliciting or receiving remuneration, directly or indirectly, in cash or kind, to induce or reward either the referral of an individual for, or the purchase, or order or recommendation of, any good or service, for which payment may be made under federal and state healthcare programs such as Medicare and Medicaid.\nFederal criminal penalties for the violation of the federal Anti-Kickback Statute include imprisonment, fines and exclusion of the provider from future participation in the federal healthcare programs, including Medicare and Medicaid. Violations of the federal Anti-Kickback Statute are punishable by imprisonment for up to ten years and statutory fines of up to $100,000 or both. Larger criminal fines can be imposed under the provisions of the U.S. Sentencing Guidelines and the Alternate Fines Statute. Individuals and entities convicted of violating the federal Anti-Kickback Statute are subject to mandatory exclusion from participation in Medicare, Medicaid and other federal healthcare programs for a minimum of five years. Civil penalties for violation of this law include statutory amounts of up to $100,000 (adjusted for inflation) in monetary penalties per violation, assessments of up to three times the total payments between the parties to the arrangement, and permissive exclusion from participation in the federal healthcare programs or suspension from future participation in Medicare and Medicaid. The Patient Protection and Affordable Care Act and the Health Care Reconciliation Act of 2010, as amended (collectively, the ACA), amended the federal Anti-Kickback Statute to clarify that the defendant may not need to have actual knowledge of the federal Anti-Kickback Statute or have the specific intent to violate it and to provide that any claims for items or services resulting from a violation of the federal Anti-Kickback Statute are considered false or fraudulent for purposes of the False Claims Act (FCA) and can result in treble damages and other penalties under the FCA.\nThe federal Anti-Kickback Statute includes statutory exceptions and regulatory safe harbors that protect certain arrangements. Business transactions and arrangements that are structured fully within an applicable safe harbor do not violate the federal Anti-Kickback Statute. When an arrangement is not structured fully within a safe harbor, the arrangement must be evaluated on a case-by-case basis in light of the parties’ intent and the arrangement’s potential for abuse, and may be subject to greater scrutiny by enforcement agencies. \nIn the ordinary course of our business operations, DaVita and its ancillary businesses and subsidiaries enter into numerous arrangements with physicians and other potential referral sources, that potentially implicate the Anti-Kickback Statute. Examples of such arrangements include, among other things, medical director agreements, joint ventures, leases and subleases with entities in which physicians, hospitals or medical groups hold ownership interests, consulting agreements, hospital services agreements, discharge planning services agreements, acute dialysis services agreements, value-based care arrangements, employment and coverage agreements, and incentive performance arrangements. In addition, some referring physicians may own DaVita Inc. common stock. Furthermore, our dialysis centers and subsidiaries sometimes enter into certain rebate, pricing, or other contracts to acquire certain discounted items and services that may be reimbursed by a federal healthcare program.\n12\nAgreements and other arrangements can still be appropriate under the federal Anti-Kickback Statute even if they fail to meet all parameters of a relevant safe harbor provision; and we endeavor to structure our arrangements within applicable safe harbors, although some arrangements are not structured fully within a safe harbor. \nIf any of our current or previous business transactions or arrangements, including but not limited to those described above, were found to violate the federal Anti-Kickback Statute, we, among other things, could face criminal, civil or administrative sanctions, including possible exclusion from participation in Medicare, Medicaid and other state and federal healthcare programs. \nStark Law\nThe Stark Law is a strict liability civil law that prohibits a physician who has a financial relationship, or who has an immediate family member who has a financial relationship, with entities providing Designated Health Services (DHS), from referring Medicare and Medicaid patients to such entities for the furnishing of DHS, unless an exception applies. The types of financial arrangements between a physician and a DHS entity that trigger the self-referral prohibitions of the Stark Law are broad and include direct and indirect ownership and investment interests and compensation arrangements. The Stark Law also prohibits the DHS entity receiving a prohibited referral from presenting, or causing to be presented, a claim or billing for the services arising out of the prohibited referral. If the Stark Law is implicated, the financial relationship must fully satisfy a Stark Law exception. If an exception to the Stark Law is not satisfied, then the parties to the arrangement could be subject to sanctions. Sanctions for violation of the Stark Law include denial of payment for claims for services provided in violation of the prohibition, refunds of amounts collected in violation of the prohibition, a civil penalty of up to $15,000 (adjusted for inflation) for each service arising out of the prohibited referral, a statutory civil penalty of up to $100,000 (adjusted for inflation) against parties that enter into a scheme to circumvent the Stark Law prohibition, civil assessment of up to three times the amount claimed, and potential exclusion from the federal healthcare programs, including Medicare and Medicaid. Furthermore, Stark Law violations and failure to return overpayments timely can form the basis for FCA liability as discussed below. \nThe definition of DHS under the Stark Law excludes services paid under a composite rate, even if some of the components bundled in the composite rate are DHS. Although the ESRD bundled payment system is no longer titled a composite rate, we believe that the former composite rate payment system and the current bundled system are both composite systems excluded from the Stark Law. Since most services furnished to Medicare beneficiaries provided in our dialysis centers are reimbursed through a bundled rate, we believe that the services performed in our facilities generally are not DHS. Certain separately billable drugs (drugs furnished to an ESRD patient that are not for the treatment of ESRD that CMS allows our centers to bill for using the so-called AY modifier) may be considered DHS. However, we have implemented certain billing controls designed to limit DHS being billed out of our dialysis clinics. Likewise, the definition of inpatient hospital services, for purposes of the Stark Law, also excludes inpatient dialysis performed in hospitals that are not certified to provide ESRD services. Consequently, we believe that our arrangements with such hospitals for the provision of dialysis services to hospital inpatients should not trigger the Stark Law referral prohibition.\nIn addition, although prescription drugs are DHS, there is an exception in the Stark Law for calcimimetics, ESAs and other specifically enumerated dialysis drugs when furnished in or by an ESRD facility such that the arrangement for the furnishing of the drugs does not violate the Stark Law. \nIn the ordinary course of business operations, DaVita and its ancillary businesses and subsidiaries have many different types of financial arrangements with referring physicians that potentially implicate the Stark Law, including, but not limited to, medical director agreements, joint ventures, leases and subleases with entities in which physicians, hospitals or medical groups hold ownership interests, consulting agreements, hospital services agreements, discharge planning services agreements, acute dialysis services agreements, value-based care arrangements, employment agreements and incentive performance arrangements. In addition, some referring physicians may own our common stock in reliance on the Stark Law exception for investment interests in large publicly traded companies. \nIf our interpretation of the applicability of the Stark Law to our operations is incorrect, the controls we have implemented fail, an arrangement is entered into outside of our processes, or we were to fail to satisfy an applicable exception to the Stark Law, we could be found to be in violation of the Stark Law and required to change our practices, face civil penalties, pay substantial fines, return certain payments received from Medicare and beneficiaries or otherwise experience a material adverse effect.\nIn addition, it might be necessary to restructure existing compensation agreements with our medical directors and to repurchase or to request the sale of ownership interests in subsidiaries and partnerships held by referring physicians or, alternatively, to refuse to accept referrals for DHS from these physicians, or take other actions to modify our operations. Any finding by CMS or other regulatory or enforcement authorities that we have violated the Stark Law or related penalties and \n13\nrestructuring or other required actions could have a material adverse effect on our business, results of operations, financial condition, cash flows, stock price and reputation.\nFalse Claims Act\nThe federal FCA is a means of policing false claims, false bills or false requests for payment in the healthcare delivery system. In part, the FCA authorizes the imposition of up to three times the government’s damages and civil penalties, plus up to approximately $28,000 per claim, on any person who, among other acts:\n•\nKnowingly presents or causes to be presented to the federal government, a false or fraudulent claim for payment or approval;\n•\nKnowingly makes, uses or causes to be made or used, a false record or statement material to a false or fraudulent claim;\n•\nKnowingly makes, uses, or causes to be made or used, a false record or statement material to an obligation to pay the government, or knowingly conceals or knowingly and improperly, avoids or decreases an obligation to pay or transmit money or property to the federal government; or\n•\nConspires to commit the above acts.\nIn addition, the FCA imposes severe penalties for the knowing and improper retention of overpayments collected from government payors. Under these provisions, a provider is required to refund overpayments within 60 days of obtaining knowledge of the overpayment. A provider is deemed to have knowledge of the overpayment if it has actual knowledge, or if it acts with reckless disregard or deliberate ignorance of the overpayment. An overpayment impermissibly retained could subject us to liability under the FCA, exclusion from government healthcare programs, and penalties under the federal Civil Monetary Penalty statute. As a result of these provisions, our procedures for identifying and processing overpayments may be subject to greater scrutiny.\nThe federal government has used the FCA to prosecute a wide variety of alleged false claims and fraud allegedly perpetrated against Medicare and state healthcare programs, including coding errors, billing for services not rendered, the submission of false cost reports, billing for services at a higher payment rate than appropriate, billing under a comprehensive code as well as under one or more component codes included in the comprehensive code and billing for care that is not considered medically necessary. The ACA provides that claims tainted by a violation of the federal Anti-Kickback Statute are false for purposes of the FCA. Some courts have held that filing claims or failing to refund amounts collected in violation of the Stark Law can form the basis for liability under the FCA. In addition to the provisions of the FCA, which provide for civil enforcement, the federal government can use several criminal statutes to prosecute persons who are alleged to have submitted false or fraudulent claims for payment to the federal government. \nFraud and abuse under state law\nState fraud and abuse laws related to anti-kickback, physician self-referral, beneficiary inducement and false claims often mirror those requirements of the applicable federal laws, or, in some instances contain additional or different requirements. If we were found to violate these state laws and regulations, we, among other things, could face criminal, civil or administrative sanctions, including loss of licensure or possible exclusion from Medicaid and other state and federal healthcare programs. \nIn addition to these fraud waste and abuse laws, some states in which we operate dialysis centers have laws prohibiting physicians from holding financial interests in various types of medical facilities to which they refer patients. Some of these laws could potentially be interpreted broadly as prohibiting physicians who hold shares of our publicly traded stock or are physician owners from referring patients to our dialysis centers if the centers use our laboratory subsidiary to perform laboratory services for their patients or do not otherwise satisfy an exception to the law. States also have laws similar to or stricter than the federal Anti-Kickback Statute that may affect our ability to receive referrals from physicians with whom we have financial relationships, such as our medical directors and value-based care partners, or with other referral sources, including hospitals. Some state anti-kickback laws also include civil and criminal penalties. Some of these laws include exemptions that may be applicable to our medical directors, value-based care partners and other physician and referral source relationships or for financial interests limited to shares of publicly traded stock. Some, however, may include no explicit exemption for certain types of agreements and/or relationships entered into with referral sources such as physicians and hospitals. If these laws are interpreted to apply to referring sources with whom we contract for items or services, including medical directors, value-based care partners, and hospitals, to referring physicians or hospitals with whom we hold joint ownership interests, or to referring entities or individuals who hold interests in DaVita Inc. limited solely to our publicly traded stock, and for which no applicable exception exists, we may be required to terminate or restructure our relationships with or refuse referrals from these referring \n14\nentities or individuals and could be subject to criminal, civil and administrative sanctions, refund requirements and exclusions from participation in government healthcare programs, including Medicare and Medicaid. \nCorporate Practice of Medicine and Fee-Splitting\nThere are states in which we operate that have laws that prohibit business entities not owned by health care providers, such as our Company and our subsidiaries, from practicing medicine, employing physicians and other licensed health care providers providing certain clinical services or exercising control over medical or clinical decisions by physicians and potentially other types of licensed health care providers (known collectively as the corporate practice of medicine). These states may also prohibit entities from engaging in certain financial arrangements, such as fee-splitting, with physicians and potentially other types of licensed health care providers. Violations of the corporate practice of medicine, fee-splitting and related laws vary by state and may result in physicians and potentially other types of licensed health care providers being subject to disciplinary action, as well as to forfeiture of revenues from payors for services rendered. Violations may also bring both civil and, in more extreme cases, criminal liability for engaging in medical practice without a license and violating the corporate practice of medicine, fee-splitting and related laws. Some of the relevant laws, regulations, and agency interpretations in states with corporate practice of medicine restrictions have been subject to limited judicial and regulatory interpretation. \nCivil Monetary Penalties Statute\nThe Civil Monetary Penalties Statute, 42 U.S.C. § 1320a-7a, authorizes the imposition of civil money penalties, assessments, and exclusion against an individual or entity based on a variety of prohibited conduct, including, but not limited to:\n•\nPresenting, or causing to be presented, claims for payment to Medicare, Medicaid, or other third-party payors that the individual or entity knows or should know are for an item or service that was not provided as claimed or is false or fraudulent; \n•\nOffering remuneration to a federal healthcare program beneficiary that the individual or entity knows or should know is likely to influence the beneficiary to order or receive healthcare items or services from a particular provider;\n•\nArranging contracts with an entity or individual excluded from participation in the federal healthcare programs;\n•\nViolating the federal Anti-Kickback Statute;\n•\nMaking, using, or causing to be made or used, a false record or statement material to a false or fraudulent claim for payment for items and services furnished under a federal healthcare program;\n•\nMaking, using, or causing to be made any false statement, omission, or misrepresentation of a material fact in any application, bid, or contract to participate or enroll as a provider of services or a supplier under a federal healthcare program; and\n•\nFailing to report and return an overpayment owed to the federal government.\nSubstantial civil monetary penalties may be imposed under the federal Civil Monetary Penalty Statute and vary, depending on the underlying violation. In addition, an assessment of not more than three times the total amount claimed for each item or service may also apply, and a violator may be subject to exclusion from participation in federal and state healthcare programs.\nForeign Corrupt Practices Act\nWe are subject to the provisions of the Foreign Corrupt Practices Act (FCPA) in the United States and similar laws in other countries, which generally prohibit companies and those acting on their behalf from making improper payments to foreign government officials and others for the purpose of obtaining or retaining business. A violation of the FCPA or other similar laws by us and/or our agents or representatives could result in, among other things, the imposition of fines and penalties, changes to our business practices, the termination of or other adverse impacts under our debt arrangements and contracts or debarment from bidding on contracts, and/or harm to our reputation.\nPrivacy and Security\nThe Health Insurance Portability and Accountability Act of 1996 and its implementing privacy and security regulations, as amended by the federal Health Information Technology for Economic and Clinical Health Act (HITECH Act) (collectively referred to as HIPAA), require us to provide certain protections to patients and their health information. The HIPAA privacy and security regulations extensively regulate the use and disclosure of PHI and require covered entities, which include \n15\nhealthcare providers, to implement and maintain administrative, physical and technical safeguards to protect the security of such information. Additional security requirements apply to electronic PHI. These regulations also provide patients with substantive rights with respect to their health information.\nThe HIPAA privacy and security regulations also require us to enter into written agreements with certain contractors, known as business associates, to whom we disclose PHI. Covered entities may be subject to penalties for, among other activities, failing to enter into a business associate agreement where required by law or as a result of a business associate violating HIPAA if the business associate is found to be an agent of the covered entity and acting within the scope of the agency. Business associates are also directly subject to liability under the HIPAA privacy and security regulations. In instances where we act as a business associate to a covered entity, there is the potential for additional liability beyond our status as a covered entity.\nCovered entities must report breaches of unsecured PHI to affected individuals without unreasonable delay but not to exceed 60 days of discovery of the breach by a covered entity or its agents. Notification must also be made to the HHS and, for breaches of unsecured PHI involving more than 500 residents of a state or jurisdiction, to the media. All non-permitted uses or disclosures of unsecured PHI are presumed to be breaches unless the covered entity or business associate establishes that there is a low probability the information has been compromised. Various state laws and regulations may also require us to notify affected individuals, and U.S. state attorneys general, or other regulators or law enforcement, in the event of a data breach involving individually identifiable information without regard to whether there is a low probability of the information being compromised.\nPenalties for impermissible use or disclosure of PHI were increased by the HITECH Act by imposing tiered penalties of more than $50,000 per violation and up to $1.5 million per year for identical violations. In addition, HIPAA provides for criminal penalties of up to $250,000 and ten years in prison, with the severest penalties for obtaining and disclosing PHI with the intent to sell, transfer or use such information for commercial advantage, personal gain or malicious harm. Further, state attorneys general may bring civil actions seeking either injunction or damages in response to violations of the HIPAA privacy and security regulations that threaten the privacy of state residents.\nIn addition to the protection of PHI, healthcare companies must meet privacy and security requirements applicable to other categories of personal information. Companies may process consumer information in conjunction with website and corporate operations. They may also handle employee information, including Social Security Numbers, payroll information, and other categories of sensitive information, to further their employment practices. In processing this additional information, companies must comply with the applicable privacy and security requirements of comprehensive privacy and data protection laws, consumer protection laws, labor and employment laws, and its publicly-available notices. In addition, federal and state laws governing the use of artificial intelligence and machine learning technologies are evolving. As the regulation of these technologies matures, we may face additional compliance costs and legal risk to our operations.\nOutside of the United States, the requirements of applicable privacy and data protection laws and regulations, and any related implementation guidance from and enforcement postures of local country regulators, may present varying implementation and compliance considerations for our local country operations. These include the European Union General Data Protection Regulation (GDPR), the United Kingdom General Data Protection Regulation (UK GDPR), and other non-GDPR laws, such as the Brazilian Lei Geral de Proteção de Dados (LGPD), the Saudi Arabia Personal Data Protection Law and the Data Security Law of the People's Republic of China (DSL), among others. This variation presents compliance costs and legal risks to our international operations. When providing services or using personal data, we must ensure compliance with the applicable legislation and local legal requirements.\nThe GDPR imposes a comprehensive data protection regime with the potential for regulatory fines as well as data breach litigation by impacted data subjects. Under the GDPR, regulatory penalties may be passed by data protection authorities for up to the greater of 4% of worldwide turnover or €20 million. The UK GDPR carries similar compliance and operational costs, and carries similar fines of up to the greater of £17.5 million or 4% of global turnover. In non-GDPR countries, the cost of non-compliance varies but can also be just as significant as those under the GDPR. For example, the maximum fine for non-compliance with the LGPD is 50 million Brazilian real (approximately $8 million) or 2% of the company’s annual revenue, while the maximum fine for non-compliance with the DSL is RMB 50 million (approximately $7 million) or 5% of the previous year's turnover. In addition to fines, data protection authorities in non-GDPR countries may also impose criminal sanctions as well as other penalties, such as orders to cease processing personal data, orders to delete personal data, or warnings and reprimands.\nPrivacy and data protection laws are also evolving nationally, providing for enhanced state privacy rights that are broader than the current federal privacy rights, and may add additional compliance costs and legal risks to our U.S. operations. For example, the California Consumer Privacy Act of 2018 (CCPA), which was significantly amended by the California Privacy \n16\nRights Act (CPRA), the Colorado Privacy Act, as well as multiple other states, afford consumers expanded privacy protections. These provide for civil penalties for violations, and the CCPA and CPRA provide for a private right of action for data breaches. Additionally, several privacy bills have been proposed both at the federal and state level that may result in additional legal requirements that impact our business. On a related front, states continue to enact laws focusing on consumer health data that are similar to other comprehensive data laws, but impose more stringent consent requirements (e.g., opt-in consent for certain types of processing) for consumer health data. These laws carry statutory damages and in some cases allow for a private right of action. These state data protection laws (both the comprehensive laws and the health-focused laws) will likely result in broader increased regulatory scrutiny in applicable states of businesses' privacy and security practices, could lead to a further rise in data protection litigation, and will require additional compliance investment and potential business process changes. \nIn addition to the breach reporting requirements under HIPAA, companies are subject to state breach notification laws. Each state enforces a law requiring companies to provide notice of a breach of certain categories of sensitive personal information, e.g. Social Security Number, financial account information, or username and password. A company impacted by a breach must notify affected individuals, attorney’s general or other agencies within a certain time frame. If a company does not provide timely notice with the required content, it may be subject to civil penalties brought by attorneys general or affected individuals. \nCompanies must also safeguard personal information in accordance with federal and state data security laws and requirements. These requirements are akin to the HIPAA requirements to safeguard PHI, described above. The FTC, for example, requires companies to implement reasonable data security measures relative to its operations and the volume and complexity of the information it processes. Also, various state data security laws require companies to safeguard data with technical security controls and underlying policies and processes. Due to the constant changes in the data security space, companies must continuously review and update data security practices to seek to mitigate any potential operational or legal liabilities stemming from data security risks. For additional details on the risks of compliance with applicable privacy and security laws, regulations and standards, see the discussion in Part I Item 1A. \"\nRisk Factors\n\" under the heading \"\nPrivacy and information security laws are complex...\" \nFor additional information about our assessment of our cybersecurity risks, see the discussion in Part I Item 1C. \"\nCybersecurity\n.\"\nIntegrated Kidney Care, Medicare and Medicaid program reforms and Other Healthcare Regulations\nThe regulatory framework of the healthcare marketplace continues to evolve as a result of executive, legislative, regulatory and administrative developments and judicial proceedings. These changes shape the landscape for our current dialysis business as well as for emerging comprehensive and integrated kidney care programs. The following discussion describes certain of these changes in further detail.\nCMMI Payment Models:\n As described above, CMS has launched payment models through CMMI to evaluate the effects of creating payment incentives for the greater use of home-based dialysis and kidney transplants for those already on dialysis, improve quality of care for kidney patients and reduce expenditures. The first of these, the ETC mandatory payment model, launched in approximately 30% of dialysis clinics across the country on January 1, 2021. CMS subsequently issued several clarifying rules and continues to evaluate the model. CMS has also implemented two voluntary kidney care payment models, Kidney Care First (KCF) and Comprehensive Kidney Care Contracting (CKCC), with the stated goal of helping healthcare providers reduce the cost and improve the quality of care for patients with late-stage chronic kidney disease and ESRD. CMS has stated these payment models are aimed to prevent or delay the need for dialysis and encourage kidney transplantation. As described above, we have invested substantial resources, and expect to continue to invest substantial resources in these models as part of our overall plan to grow our integrated kidney care business and value-based care initiatives.\nFor additional details on the risks related to integrated kidney care and Medicare and Medicaid program reforms, see the discussion in Part I Item 1A. \"\nRisk Factors\n\" under the headings \"\nIf we are not able to successfully implement our strategy with respect to our integrated kidney care and value-based care initiatives...;\" \nand\n \"If we are unable to compete successfully...\"\nHealthcare Reform, ACA and Related Regulatory and Legal Developments\n: The ACA regulatory framework of the healthcare marketplace continues to evolve as a result of executive, legislative, regulatory and administrative developments and judicial proceedings. For example, the expanded access to healthcare developed under the ACA has been both positively and negatively impacted over time by subsequent legal, regulatory and judicial action. In 2021 and 2022, respectively, the American Rescue Plan and Inflation Reduction Act of 2022 included several provisions designed to expand health coverage, including the expansion and extension of premium tax credits that assist consumers who purchase health insurance on marketplaces developed under the ACA and temporarily offering incentives to expand Medicaid coverage for states that have not yet done so. Our revenue and operating income levels are highly sensitive to the percentage of our patients with higher-paying commercial health insurance and any legislative, regulatory or other changes that decrease the accessibility and availability, including the \n17\nduration, of commercial insurance, such as the potential expiration at the end of 2025 of the premium tax credits described above, is likely to have a material adverse impact on our business. \nChanges to the political environment may increase the likelihood of legislative or regulatory changes that would impact us, such as changes to the healthcare regulatory landscape. Examples of such potential changes also could include, among other things, legislative, regulatory, or executive development, including those that may impact the availability of certain premium tax credits under the ACA exchanges or may impact the eligibility age for Medicare beneficiaries. Some of these or other changes could in turn impact the percentage of our patients with higher-paying commercial health insurance, impact the scope or terms of coverage under commercial health plans and/or increase our expenses, among other things. The timing of legislative, regulatory or executive action related to these potential initiatives, if any, remains uncertain, particularly in light of the current economic and political environment, and as such, considerable uncertainty exists surrounding the continued development of the ACA and related regulations, programs and models, as well as similar healthcare reform measures and/or other potential changes at the federal and/or state level to laws, regulations and other requirements that govern our business. \n21\nst\n Century Cures Act\n:\n \nAs described above under the heading \"—\nMedicare Advantage revenue,\"\n the Cures Act broadened patient access to certain enhanced benefits offered by MA plans. This change in benefit eligibility has increased the percentage of our patients on MA plans as compared to Medicare Part B plans. In addition, the Cures Act also includes provisions related to data interoperability, information blocking and patient access. For details on the risks associated with these provisions of the Cures Act, see the risk factors in Part I Item 1A. \"\nRisk Factors\n\" under the headings,\n \"Our business is subject to a complex set of governmental laws, regulations and other requirements...;\" \"If the number or percentage of patients with higher-paying commercial insurance declines...;\n\"\n \nand\n \"Failing to effectively maintain, operate or upgrade our information systems or those of third-party service providers upon which we rely...\"\nHealth Plan Price Transparency Rules\n: In addition, recent price transparency regulations require most group health plans, and health insurance issuers in the group and individual markets, to make certain pricing and patient responsibility information publicly available. On July 1, 2022, most group health plans and issuers of group or individual health insurance were required to begin publishing machine-readable files that include negotiated rates for all covered items and services with all providers and out-of-network allowed amounts. For plan years that begin on or after January 1, 2023, most group health plans, and health insurance issuers in the group and individual markets, must provide enrollees with out-of-pocket cost and underlying provider negotiated rate information in a consumer-friendly format for an initial list of 500 designated services (which do not include dialysis). A plan or issuer may choose to include more than these 500 services, and for plan years that begin on or after January 1, 2024, most group health plans, and health insurance issuers in the group and individual markets, must provide enrollees with this information for all covered items and services. \nIn addition to the aforementioned pricing transparency rules, the government has also implemented certain additional pricing transparency requirements that apply to certain types of providers, including DaVita. Under the No Surprises Act, which went into effect January 1, 2022, certain providers, including DaVita, are required to develop and disclose a \"Good Faith Estimate\" (GFE) that details the expected charges for furnishing certain items or services, although the government is currently only enforcing portions of this requirement with respect to uninsured or self-pay patients. The GFE is currently required to include specific information regarding the service provided and diagnostic codes, among other things, and is subject to formatting requirements, notice requirements, availability and dispute resolution procedures; in the future, GFEs will be required to include additional information, including co-provider service estimates. Similar to the aforementioned pricing transparency rules, the impact of the GFE requirements on DaVita remains uncertain at this time, in part due to ongoing rulemaking around the No Surprises Act as well as the delayed effective date of certain provisions of the GFE framework, uncertainty around operational timeframes, potential penalties and patient reaction, among other things. For additional details about the risks associated with these requirements, see the discussion in the risk factor in Part I Item 1A. \"\nRisk Factors\n\" under the heading, \n\"If the number or percentage of patients with higher-paying commercial insurance declines...\n\"\nOther regulations\nOur U.S. dialysis and related lab services operations are subject to various state hazardous waste and non-hazardous medical waste disposal laws at both the state and federal level. In addition, OSHA regulations require employers to provide workers who are occupationally subject to blood or other potentially infectious materials with prescribed protections. These regulatory requirements apply to all healthcare facilities, including dialysis centers, and require employers to make a determination as to which employees may be exposed to blood or other potentially infectious materials and to have in effect a written exposure control plan. In addition, employers are required to provide or employ hepatitis B vaccinations, personal protective equipment and other safety devices, infection control training, post-exposure evaluation and follow-up, waste disposal techniques and procedures and work practice controls. Employers are also required to comply with various record-keeping requirements.\n18\nIn addition, certain states in which we do business have certificate of need programs regulating the establishment or expansion of healthcare facilities, including dialysis centers. Furthermore, given the evolving nature of our business, agencies, including but not limited to the Food and Drug Administration, FTC, and HHS's Office of Civil Rights, will continue to introduce and/or enforce existing laws and regulations that we may need to comply with. For additional information of the risks to our business associated with the impact of these and other laws and regulations, see the risk factors in Part I Item 1A. \"\nRisk Factors\n\" under the headings, \n\"Our business is subject to a complex set of governmental laws, regulations, and other requirements...\" \nand\n \"Changes in federal and state legislation or regulations...\"\nState laws and initiatives\nThere have been several state-based policy initiatives to limit payments to dialysis providers or impose other burdensome operational requirements, which, if passed, could have a material adverse impact on our business, results of operation, financial condition and cash flows. For example, in October 2019, a California bill (AB 290) was signed into law that limits the amount of reimbursement paid to certain providers for services provided to patients with commercial insurance who receive charitable premium assistance (reimbursement cap). The implementation of AB 290 has been stayed pending resolution of legal challenges. The trial court has issued a decision relating to these challenges to AB 290, which is currently on appeal. In addition, California passed into law California Senate Bill No. 525 (SB 525), which raises minimum wage for many California healthcare workers and went into effect in October 2024. \nFor additional discussion on the risks associated with the evolving payment and regulatory landscape for kidney care, see the discussion in Part I Item 1A. \"\nRisk Factors\n,\" including the discussion under the headings,\n \"Our business is subject to a complex set of governmental laws, regulations and other requirements...\" \nand\n \"Changes in federal and state legislation or regulations...\"\nCorporate compliance program\nManagement has designed and implemented a corporate compliance program as part of our commitment to comply fully with applicable criminal, civil and administrative laws and regulations and to maintain the high standards of conduct we expect from all of our teammates, physician partners, and certain other third parties. We continuously review this program and work to enhance and evolve it as appropriate. The primary purposes of the program include:\n•\nAssessing and identifying health care regulatory risks for existing and new businesses;\n•\nTraining and educating our teammates, physician partners, and certain other third parties to promote awareness of legal and regulatory requirements, a culture of compliance, and the necessity of complying with all applicable laws, regulations and requirements;\n•\nDeveloping and implementing compliance policies and procedures and creating controls to support compliance with applicable laws, regulations and requirements and our policies and procedures;\n•\nAuditing and monitoring the activities of our operating units and business support functions to identify and mitigate risks and potential instances of noncompliance in a timely manner; and\n•\nEnsuring that we promptly take steps to resolve any instances of noncompliance and address areas of weakness or potential noncompliance.\nWe have a code of conduct that each of our teammates, members of our Board of Directors (Board), physician partners, and certain other third parties must follow, and we have an anonymous compliance hotline for teammates, physician partners, patients and other third parties to report potential instances of noncompliance that is managed by a third party. Our Chief Compliance Officer administers the compliance program. The Chief Compliance Officer reports directly to our Chief Executive Officer (CEO) and the Chair of the Compliance and Quality Committee of our Board.\nWe could be subject to penalties or other consequences if the OIG or a similar regulatory authority determines that we failed to comply with applicable laws, regulations or requirements, including, among other things substantial monetary penalties and exclusion from participation in federal healthcare programs that could have a material adverse effect on our business, results of operations, financial condition, cash flows, reputation and stock price.\nCompetition\nThe U.S. dialysis industry remains highly competitive, with many new and emerging entrants entering the kidney healthcare business space. In our U.S. dialysis business, we continue to face intense competition from large and medium-sized providers, among others, which compete directly with us for limited acquisition targets, for individual patients who may choose \n19\nto dialyze with us and to engage physicians qualified to provide required medical director services. In addition to these large and medium sized dialysis providers with substantial financial resources and other established participants in the dialysis space, we also compete with new dialysis providers, individual nephrologists and former medical directors or physicians that have opened their own dialysis units or facilities. Moreover, as we continue our international dialysis expansion into various international markets, we face competition from large and medium-sized providers, among others, for acquisition targets as well as physician relationships. We also experience competitive pressures from other dialysis and healthcare providers in recruiting and retaining qualified skilled clinical personnel as well as in connection with negotiating contracts with commercial healthcare payors and inpatient dialysis service agreements with hospitals. Acquisitions, developing new outpatient dialysis centers, patient retention and referrals, and referral source relationships, in which such sources understand us to be the clinical and operational leaders in the market are significant components of our growth strategy and our business could be adversely affected if we are not able to continue to make dialysis acquisitions on reasonable and acceptable terms, continue to develop new outpatient dialysis centers, maintain our referral sources' trust in our capabilities or if we experience significant patient attrition or lack of new patient growth relative to our competitors. \nOur largest competitor, Fresenius Medical Care (FMC), manufactures a full line of dialysis supplies and equipment in addition to owning and operating outpatient dialysis centers worldwide. This may, among other things, give FMC cost advantages over us because of its ability to manufacture its own products. Additionally, FMC is one of our largest suppliers of dialysis products and equipment. Our agreement with FMC typically requires us to purchase a certain amount of dialysis equipment, parts and supplies from FMC based upon a number of factors, including the operating requirements of our centers, the number of centers we acquire, and growth of our existing centers.\nAs we continue to expand our efforts to grow across the full continuum of kidney care from CKD care to dialysis treatment to transplant facilitation, we also face competition outside dialysis. In the integrated care market, we face competition from other dialysis providers who, similar to DaVita, may be seeking to expand arrangements with payors, physicians and hospitals. We also face competition from non-traditional providers and others in this space, who have made a number of announcements, initiatives and capital raises in areas along the full continuum of kidney care from CKD to dialysis to transplant. These business entities, certain of which command considerable resources and capital, increasingly compete with us in the integrated kidney care market, and they may also focus their efforts on the development of more traditional dialysis competition or the commencement of other new business activities or the development of innovative technologies, drugs or other treatments that could impact the rate of growth of the kidney care patient population or otherwise be transformative to the industry. For additional discussion on these developments and associated risks, see the risk factors in Part I Item 1A. \"\nRisk Factors\n\" under the headings, \"\nIf we are unable to compete successfully..\n.\" and \"\nIf we are not able to successfully implement our strategy with respect to our integrated kidney care and value-based care initiatives\n...\"\nInsurance\nWe are primarily self-insured with respect to professional and general liability, workers' compensation and automobile risks, and a portion of our employment liability practice risks, through wholly-owned captive insurance companies. We are also predominantly self-insured with respect to employee medical and other health benefits. We also maintain insurance, excess coverage, or reinsurance for property and general liability, professional liability, directors’ and officers’ liability, workers' compensation, cybersecurity and other coverage in amounts and on terms deemed appropriate by management, based on our actual claims experience and expectations for future claims. Future claims could, however, exceed our applicable insurance coverage. Physicians practicing at our dialysis centers are required to maintain their own malpractice insurance, and our medical directors are required to maintain coverage for their individual private medical practices. Our liability policies cover our medical directors for the performance of their duties as medical directors at our outpatient dialysis centers.\nHuman capital management\nOverview\nAt DaVita, we are guided by our Mission—to be the provider, partner and employer of choice—and our Core Values—Service Excellence, Integrity, Team, Continuous Improvement, Accountability, Fulfillment and Fun—which are reinforced at all levels of the organization. Our teammates share a common passion for equitably improving patients' lives and are the cornerstone for the health of DaVita.\nWe strive to be a community first and a company second, and affectionately call ourselves a Village. To be a healthy Village, we need to attract, develop and retain top talent that reflect the communities we serve. To do so, we have implemented strategies that support our mission to be the employer of choice, such as: \n•\nDesigning programs and processes to cultivate a talent pipeline that can allow us to hire ahead of needs;\n20\n•\nProviding development and professional growth opportunities; and\n•\nOffering a robust and competitive total rewards program. \nWe believe that this intentional investment of time and resources fosters a special community of teammates that, in turn, leads to better care for our patients and the communities we serve.\nAs of December 31, 2024, we employed approximately 76,000 teammates, including our international teammates, with approximately 75% of our teammates located within the U.S.\nOversight & Management\nOur Board provides oversight on human capital matters, receiving regular updates from our Chief People Officer about People Services’ activities, strategies and initiatives, and through the Board’s annual work with our CEO on management development and succession planning. Among other things, our Board and/or its committees also receive reports related to pay equity, risks and trends related to labor and human capital management issues and other issues generally pertaining to our teammates. The Board, in conjunction with its committees, also oversees the Company's activities, policies and programs related to corporate environmental and social responsibility, including considering the impact of such activities, policies and programs on the Company, teammates, patients and communities, among others.\nThese reports and recommendations to the Board and its committees are part of our broader People Services leadership and oversight framework, which includes guidance from various stakeholders across the business and benefits from the broad participation of senior leadership.\nConnection & Belonging\nOur investment in our teammates is anchored by our commitment to building a team of high performing teammates that reflect the communities we serve. We take a collaborative, leader-led approach, with everyone from our front-line patient care technicians and nurses to our divisional vice presidents, our CEO, and our Board playing a role in implementing our strategy. It truly does take a Village to bring our vision to life.\nTo help achieve this vision, we empower all leaders and teammates to cultivate connection and belonging in their centers and on their teams. We offer a suite of training to ensure our leaders are well-versed in how to cultivate belonging on their teams, reduce bias in hiring and talent reviews, and more. Leaders may also go deeper into more complex topics to understand how to create trust and safety, respect and value others and provide fair and consistent support. Finally, the fundamentals of creating a culture of belonging are integrated into new teammate onboarding to ensure all teammates understand their role in bringing our vision to life.\nOver the past several years, our efforts to build culture have focused primarily on ensuring that we are creating a welcoming, open environment where all teammates, patients, physicians and care partners belong. Based on our most recent internal engagement surveys, 84% of our U.S. teammates indicated that they feel a sense of belonging within the DaVita community. We also celebrate a Week of Belonging each year, engaging teammates globally with activities and education designed to further create a sense of belonging.\nAs of December 31, 2024, DaVita in the U.S. was composed of 78% women and 58% people of color. As of December 31, 2024, in the U.S. 73% of our managers and 62% of our directors are women and that leaders with profit and loss responsibility are 52% women and 27% people of color. Our Board is composed of 40% women and 20% people of color. \nTalent Pipeline and Career Development\nHelping teammates and leaders grow and increase their earning potential are important tenets of our Employer of Choice strategy. We have a robust set of career development offerings to support teammates in reaching their professional ambitions. We have invested in an end-to-end career development pipeline that includes programs and initiatives that provide financial, educational and social support to our clinical and operations personnel to help achieve their higher education and leadership goals. \nOur DaVita Ladders program – which currently includes Clinical Ladders for our clinical teammates – is designed to unlock clarity, competitive pay and transparent career journeys to systematically create more effective teammates and leaders. Through Clinical Ladders, the Village offers clinical teammates and leaders:\n•\nClarity around role expectations;\n•\nA shared language to describe and understand career progression across the business units and regions;\n21\n•\nMore structured talent mobility efforts to empower teammates to explore alternative career pathways based on interest, competency, and skill;\n•\nA tool to support all aspects of the talent lifecycle through selection practices, professional development review (PDR) discussions, and succession planning, among other things;\n•\nStandardization in how we execute performance and talent conversations that are aligned to factors for role success; and\n•\nMarket informed pay structure, pay design and guidance to consistently execute our pay for performance philosophy.\nOur goal is to make resources available to teammates at each step of a possible career path to enable teammates to increase their earnings potential. For example, our Bridge to Your Dreams program supports high performing teammates pursuing an associate's degree in nursing with financial assistance, resources and role placement support to become a DaVita nurse. We currently have 2,400 teammates going through the program and on the way to becoming registered nurses. We also offer programs that help develop high potential nurses, clinical coordinators and clinic nurse managers into operational managers, along with programs that prepare and coach operational managers for regional operations director roles. These are just some of the many other career development opportunities we have in place for our teammates.\nWe are proud of the work we have done in this area. In 2024 approximately 58% of our managers in the U.S. were promoted from within. We will continue to lean into our teammates' growth and help them achieve their career objectives.\nTotal Rewards Program\nOur total rewards philosophy and practices are designed to be competitive in the local market and reward strong team and individual performance. We believe merit-driven pay encourages teammates to do their best work, including in caring for our patients, and we strive to link pay to performance so we can continue to incentivize the provision of extraordinary care to our patients and grow our Village.\nTo attract, retain and grow our teammates, we have a holistic approach to total rewards that includes financial, physical and emotional support. Highlights include, among other things:\n•\nHealthcare benefits including a menu of plan designs and health savings accounts.\n•\nFree health programs in support of the most prevalent health conditions affecting our teammates, including hypertension, diabetes prevention/maintenance, musculoskeletal issues and weight loss/management. \n•\nFinancial wellness elements including 401(k) match, employee stock purchase plan (ESPP), a deferred compensation plan, financial planning support and access to free banking services. Additionally, DailyPay is a service that provides teammates with financial flexibility by allowing them to access earned but unpaid wages before payday.\n•\nFamily support programs to our teammates and their families that include family care programs for back-up child and elder care, family planning support for fertility, adoption and surrogacy, parental support for children’s educational and special needs and parental leave programs. We also offer a number of scholarships for teammates' children and grandchildren.\n•\nTeammate Assistance Program that offers counseling sessions to all teammates and their household members, along with critical incident support for work related trauma, on both a personal and group level, with access to ten free sessions annually for each household member.\n•\nFree access to Headspace, an application for digital meditation and mindfulness, and referrals/consultations on everyday issues such as dependent care, auto repair, pet care and home improvement.\n•\nVitality Points, a voluntary wellness incentive program that encourages teammates and their spouses/domestic partners to engage with their provider to manage their overall health. In addition, it allows participating teammates and spouses/domestic partners to earn credits toward their medical premium for getting a biometric screening with a primary care provider.\n•\nShort & Long term disability for full time teammates and Life/AD&D coverage at both the basic and supplemental levels. Our voluntary Whole Life plan also includes long-term care coverage.\n22\n•\nOur DaVita Village Network, which provides financial support to eligible teammates experiencing a specific tragedy or hardship and helps cover additional costs that insurance does not fully cover.\nPay Equity\nAt DaVita, we are committed to equal pay for equal work; meaning, teammates in the same position, performing at the same level, and in similar geographies, are paid equitably relative to one another, regardless of their gender, race or ethnicity. We believe that equitable pay is a critical component of establishing a work environment where all teammates are valued and feel like they belong. Equitable pay is essential to our ability to attract, motivate and retain the top talent that reflect the communities we serve who are at the center of our current and future success.\nTeammate Health and Safety \nWe are committed to promoting a safe and compliant environment for our teammates, particularly in our clinical settings. Our safety programs are designed to proactively identify, prevent and mitigate risk in these settings, prioritizing the health, safety and well-being of both our teammates and patients. We routinely assess facilities to closely monitor adherence to established security and safety standards. We have an electronic audit system that includes monthly OSHA and infection control audits, and survey preparedness and biomedical audits are performed every six months. The audits are tracked for timely completion and correction of issues found in the audit. In the spirit of our safety culture, we also have an electronic system for capturing adverse clinical events. These events are tracked and trended to identify opportunity to improve our teammate trainings and enhance our clinical safety systems. Our teammates complete mandatory annual compliance trainings focused on key areas, reflecting our dedication to ensuring the health and safety of our teammates and patients. \nFor additional information about certain risks associated with our human capital management, see the risk factors in Part I Item 1A. \"\nRisk Factors\n\" under the headings, \"\nOur business is labor intensive and if our labor costs continue to rise...;\n\" and \n\"External conditions, including those related to general economic, marketplace and global health conditions...\"\n23",
  "item7": "Item 7.        Management’s Discussion and Analysis of Financial Condition and Results of Operations\nForward-looking statements\nThis Annual Report on Form 10-K, including this Management’s Discussion and Analysis of Financial Condition and Results of Operations, contains statements that are forward-looking statements within the meaning of the federal securities laws and as such are intended to be covered by the safe harbor for \"forward-looking statements\" provided by the Private Securities Litigation Reform Act of 1995. These forward-looking statements could include, among other things, statements about our balance sheet and liquidity, our expenses, revenues, billings and collections, patient census, availability or cost of supplies, including without limitation the impact of any reduction in clinical and other supplies due to any disruptions experienced by third party vendors, including with respect to our ability to provide home dialysis services, treatment volumes, mix expectation, such as the percentage or number of patients under commercial insurance, the effects on us and our operations of any interruptions in key functions performed by our third party service providers or suppliers, current macroeconomic, marketplace and labor market conditions, and overall impact on our patients and teammates, as well as other statements regarding our future operations, financial condition and prospects, capital allocation plans, expenses, cost saving initiatives, other strategic initiatives, use of contract labor, government and commercial payment rates, expectations related to value-based care (VBC), integrated kidney care (IKC), Medicare Advantage (MA) plan enrollment and our international operations, expectations regarding increased competition and marketplace changes, including those related to new or potential entrants in the dialysis and pre-dialysis marketplace and the potential impact of innovative technologies, drugs, or other treatments on the dialysis industry, and expectations regarding our stock repurchase program. All statements in this report, other than statements of historical fact, are forward-looking statements. Without limiting the foregoing, statements including the words \"expect,\" \"intend,\" \"will,\" \"could,\" \"plan,\" \"anticipate,\" \"believe\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are based on DaVita's current expectations and are based solely on information available as of the date of this report. DaVita undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of changed circumstances, new information, future events or otherwise, except as may be required by law. Actual future events and results could differ materially from any forward-looking statements due to numerous factors that involve substantial known and unknown risks and uncertainties. These risks and uncertainties include, among other things:\n•\nexternal conditions, including those related to general economic, marketplace and global health conditions, including without limitation, the impact of global events and political or governmental volatility; the impact of the domestic political environment and related developments on the current healthcare marketplace, our patients and on our business; the continuing impact of the COVID-19 pandemic on our financial condition and the chronic kidney disease (CKD) population and our patient population; supply chain challenges and disruptions, including without limitation with respect to certain key services, critical clinical supplies and equipment we obtain from third parties, and including any impacts on our supply chain as a result of natural disasters; the potential impact of new or potential entrants in the dialysis and pre-dialysis marketplace and potential impact of innovative technologies, drugs, or other treatments on our patients and industry; elevated teammate turnover or labor costs; the impact of continued increased competition from dialysis providers and others; and our ability to respond to challenging U.S. and global economic and marketplace conditions, including, among other things, our ability to successfully identify cost saving opportunities;\n•\nthe concentration of profits generated by higher-paying commercial payor plans for which there is continued downward pressure on average realized payment rates; a reduction in the number or percentage of our patients under commercial plans, including, without limitation, as a result of continuing legislative efforts to restrict or prohibit the use and/or availability of charitable premium assistance, or as a result of payors implementing restrictive plan designs; \n•\nrisks arising from potential changes in or new laws, regulations or requirements applicable to us, including, without limitation, those related to healthcare, privacy, antitrust matters, and acquisition, merger, joint venture or similar transactions and/or labor matters, and potential impacts of changes in interpretation or enforcement thereof or related litigation impacting, among other things, coverage or reimbursement rates for our services or the number of patients enrolled in or that select higher-paying commercial plans, and the risk that we make incorrect assumptions about how our patients will respond to any such developments; \n•\nour ability to successfully implement our strategies with respect to IKC and VBC initiatives and home based dialysis in the desired time frame and in a complex, dynamic and highly regulated environment; \n•\na reduction in government payment rates under the Medicare End Stage Renal Disease program, state Medicaid or other government-based programs and the impact of the MA benchmark structure;\n•\nour reliance on significant suppliers, service providers and other third party vendors to provide key support to our business operations and enable our provision of services to patients, including, among others, suppliers of certain pharmaceuticals, administrative or other services or critical clinical products; and risks resulting from a closure, \n57\nreduction or other disruption in the services or products provided to us by such suppliers, service providers and third party vendors;\n•\nnoncompliance by us or our business associates with any privacy or security laws or any security breach by us or a third party, including, among other things, any such non-compliance or breach involving the misappropriation, loss or other unauthorized use or disclosure of confidential information;\n•\nlegal and compliance risks, such as compliance with complex, and at times, evolving government regulations and requirements, and with additional laws that may apply to our operations as we expand geographically or enter into new lines of business;\n•\nour ability to attract, retain and motivate teammates, including key leadership personnel, and our ability to manage potential disruptions to our business and operations, including potential work stoppages, operating cost increases or productivity decreases whether due to union organizing activities, legislative or other changes, demand for labor, volatility and uncertainty in the labor market, the current challenging and highly competitive labor market conditions, including due to the ongoing nationwide shortage of skilled clinical personnel, or other reasons;\n•\nchanges in pharmaceutical practice patterns, reimbursement and payment policies and processes, or pharmaceutical pricing, including with respect to oral phosphate binders, among other things; \n•\nour ability to develop and maintain relationships with physicians and hospitals, changing affiliation models for physicians, and the emergence of new models of care or other initiatives that, among other things, may erode our patient base and impact reimbursement rates;\n•\nour ability to complete and successfully integrate and operate acquisitions, mergers, dispositions, joint ventures or other strategic transactions on terms favorable to us or at all; and our ability to continue to successfully expand our operations and services in markets outside the United States, or to businesses or products outside of dialysis services;\n•\nthe variability of our cash flows, including, without limitation, any extended billing or collections cycles including, without limitation, due to defects or operational issues in our billing systems or in the billing systems or services of third parties on which we rely; the risk that we may not be able to generate or access sufficient cash in the future to service our indebtedness or to fund our other liquidity needs;\n•\nthe effects on us or others of natural or other disasters, public health crises or severe adverse weather events such as hurricanes, earthquakes, fires or flooding;\n•\nfactors that may impact our ability to repurchase stock under our stock repurchase program and the timing of any such stock repurchases, as well as any use by us of a considerable amount of available funds to repurchase stock; \n•\nour goals and disclosures related to environmental, social and governance (ESG) matters, including, among other things, evolving regulatory requirements affecting ESG standards, measurements and reporting requirements\n; \nand\n•\nthe other risk factors, trends and uncertainties set forth in Part I Item 1A. of this Annual Report on Form 10-K, and the other risks and uncertainties discussed in any subsequent reports that we file or furnish with the Securities and Exchange Commission (SEC) from time to time.\nThe following should be read in conjunction with our consolidated financial statements.\n58\nCompany overview\nOur principal business is to provide dialysis and related lab services to patients in the United States, which we refer to as our U.S. dialysis business. We also operate our U.S. integrated kidney care (IKC) business, our U.S. other ancillary services, and our international operations, which we collectively refer to as our ancillary services, as well as our corporate administrative support functions. Our U.S. dialysis business is a leading provider of kidney dialysis services in the U.S. for patients suffering from chronic kidney failure, also known as end stage renal disease (ESRD) or end stage kidney disease (ESKD).\nOperational and financial highlights for 2024 include, among other things:\n•\nU.S. dialysis revenue growth of 4.2% from an increase in average patient services revenue per treatment of $13.88;\n•\nrevenue growth of 16.2% in our other ancillary businesses, primarily in our international operations; \n•\noperating income of $2,090 million and adjusted operating income of $1,981 million;\n•\noperating cash flows of $2,022 million and free cash flows of $1,162 million; \n•\nrepurchase of 9,832,705 shares of our common stock for aggregate consideration of $1,389 million, and a 9.3% reduction in our outstanding share count year-over-year;\n•\nentered into an amendment to our senior secured credit agreement which extended the maturity date of a portion of our Term Loan B-1 in the aggregate principal amount of $1,640 million. We further amended the senior secured credit agreement to incur an incremental Term Loan A-1 tranche in the aggregate principal amount of $1,100 million and issued an aggregate principal amount of $1,000 million of 6.875% senior notes due 2032. A portion of the proceeds of these transactions was used to repay the Term Loan B-1 maturing in 2026 of approximately $950 million; \n•\nwe purchased an additional $2,500 million notional amount of forward interest rate caps to shield our exposure to significant interest rate increases through 2027; and\n•\nleverage ratio, as a multiple of Consolidated EBITDA, each as defined by our credit agreement, remained within our target range of 3.0x to 3.5x throughout 2024.\nAdditional highlights include:\n•\na net increase in consolidated patient growth of 12.4%, with flat patient growth in U.S. dialysis and 62.6% international patient growth as of December 31, 2024; \n•\na net decrease of 18 U.S. dialysis centers as we continued to improve center capacity utilization, as well as a net increase of 142 international dialysis centers from acquisitions; and\n•\ncontinued patient growth in IKC to \n70,400\n patients in risk-based integrated care arrangements and an additional 11,600 patients in other integrated care arrangements.\nIn 2025, we expect relatively flat year-over-year treatment volumes due to a number of factors. These include, among other things, elevated mortality levels relative to pre-pandemic levels; the continued impact of missed treatment rates, which in recent years have been impacted by increased hospitalizations and the prevalence of severe weather events; and the impact of the supply disruption affecting our home dialysis supplies. We expect operating income growth resulting from revenue per treatment improvements, primarily driven by rate increases, the net impact of our continued improvements in our billing and collections process, mix improvement and the incorporation of oral phosphate binder reimbursement into the bundle, as described below. We expect an increase in costs per treatment due to the oral phosphate binders and inflationary increases in labor and other costs, partially offset by \na decline in center closure costs. In 2025, we also expect operating growth in our international business as we continue our expansion in international markets and we expect results in our 2025 integrated kidney care business to be consistent with 2024. We expect a continued increase in debt expense in 2025 due in part to the financing transactions announced in 2024 and the expiration of our 2019 interest cap agreements in 2024 as described below. \nFinally, considerable uncertainty remains surrounding the continued implementation and development of the various governmental laws, regulations and other requirements that may impact our business, including the extent to the which such developments impact the behavior of other health care market participants such as payors, employers, charitable organizations and government agencies.\nThe discussion below includes analysis of our financial condition and results of operations for the years ended December 31, 2024 compared to December 31, 2023. Our Annual Report on Form 10-K for the year ended December 31, 2023, \n59\nincludes a discussion and analysis of our financial condition and results of operations for the year ended December 31, 2022, in its Part II Item 7, \"\nManagement's Discussion and Analysis of Financial Condition and Results of Operations.\n\"\nReferences to the \"Notes\" in the discussion below refer to the notes to the Company's consolidated financial statements included in this Annual Report on Form 10-K at Part IV Item 15, \"\nExhibits, Financial Statement Schedules\n\" as referred from Part II Item 8, \"\nFinancial Statements and Supplementary Data.\n\"\nGeneral Economic, Marketplace and Global Health Conditions; Legal and Regulatory Developments\nAs noted above and described below, developments in general economic, marketplace and global health conditions have directly and indirectly impacted the Company and in the future could have a material adverse impact on our patients, teammates, physician partners, suppliers, business, operations, reputation, financial condition, results of operations, share price, cash flows and/or liquidity. Many of these external factors and conditions are interrelated, including, among other things, inflation, interest rate volatility, and other economic conditions, labor market conditions, wage pressure, the increased mortality rates of our patients and other ESKD or CKD patients, supply chain challenges and the potential impact and application of innovative technologies, drugs or other treatments. Certain of these impacts could be further intensified by concurrent global events, which have continued to drive sociopolitical, geopolitical and economic uncertainty; severe weather events and other natural disasters, which have impacted national supply chain challenges; the impact of new policies implemented by the new administration in the United States, which have affected certain government sponsored programs, among other things. For additional discussion of general economic, marketplace and global health conditions that could impact our business, see Part I Item 1. \"\nBusiness\n\" and Part I Item 1A.\n \n\"\nRisk Factors.\n\"\nOperational and Financial Impacts\nOn a full year basis, we experienced a negative impact on revenue and treatment volume due to, among other things, continued elevated mortality rates of our patients in comparison to the periods prior to the COVID-19 pandemic and the associated impact on our patient census, missed treatments driven by severe weather events and the impact of a temporary pause in home dialysis starts that resulted from the closure of one of our supplier's facilities. Treatment volumes during the year were also adversely impacted by continued elevated missed treatment rates, which during 2024 were driven primarily by severe weather events. New-to-dialysis admission rates, treatment volumes, future revenues and non-acquired growth, among other things, could continue to be negatively impacted over time to the extent that the ESKD and CKD populations experience sustained elevated mortality levels. These mortality levels could be influenced by, among other things, the availability and use of vaccines, treatments and therapies. As described in Part I Item 1A. \"\nRisk Factors,\n\" the magnitude of these cumulative impacts could have a material adverse impact on our results of operations, financial condition and cash flows.\nOngoing global economic conditions and political and regulatory developments, such as general labor, supply chain and inflationary pressures have increased, and will likely continue to increase, our expenses, including, among others, staffing, labor and supply costs. We have also experienced service disruptions relating to key business functions and supply chain shortages with respect to certain of our equipment and clinical supplies, including critical clinical and other supplies. Certain of these disruptions related to external conditions, such as the aforementioned severe weather event that impacted our supply chain for key products as well as the cybersecurity incident at Change Healthcare (CHC) that impacted our billing operations. As described in Part I Item 1A. \"\nRisk Factors\n\" under the heading, \"\nIf certain of our supplier and service providers…\n\", any disruption involving such suppliers could materially impact our operations and require significant resources or operational changes in response. \nWe expect certain of these increased staffing and labor costs to continue into 2025, due to, among other factors, the continuation of inflationary conditions and a challenging healthcare labor market. The cumulative impact of these increased costs could be material. During 2024, our industry also continued to experience increased union organizing activities. For example, union petitions have been filed in nine of our clinics in California and eight of these petitions are in different stages of the voting process and have been subject to legal challenges. For additional details on the risks related to rising labor costs and union organizing activities, see the discussion in Part I Item 1A. \"\nRisk Factors\n\" under the headings, \"\nOur business is labor intensive...\"\n and \n\"External conditions, including those related to general economic, marketplace and global health conditions...\"\nLegal and Regulatory Developments\nAs noted above, the Federal Trade Commission (FTC) published in the federal register a final rule that would generally ban all post-employment personal service non-compete clauses with employees and prohibit employers from enforcing existing non-compete clauses in contracts with workers, with limited exceptions. Even though the rule has been enjoined, many state legislatures continue to introduce legislation that seeks to place limitations on restrictive covenants with workers. For additional details on federal and state regulations or future federal or state regulations and the potential impact on our business, see the \n60\ndiscussion in Part I Item 1. \"\nBusiness\n\" under the heading \"\nU.S. Dialysis Business\"\n and Part I Item 1A. \"\nRisk Factors\n\" under the heading, \"\nChanges in federal and state legislation and regulations...\"\nChange Healthcare\nAs noted above and previously reported, due to a cybersecurity breach that affected CHC, a subsidiary of UnitedHealth Group Incorporated (United) that serves as an intermediary for processing the vast majority of our payment claims for domestic commercial and government payors, we temporarily suspended all claims processing activity with CHC (CHC Outage), primarily during a period of time during the first and second quarters of 2024, which impacted our cash flows. We have since resumed claims submissions and billing processes through CHC’s information technology systems and as of the date of this filing, through a combination of CHC's platform and certain alternate billing processes, we are current on our primary claims submissions. However, the CHC Outage, and the resultant delay in claims submissions, led to an increase in our days sales outstanding (DSO), among other things. That DSO increase has subsided, but we do continue to see delays in, and issues with, collections with some payors. For additional details on the CHC Outage and a discussion of the risks associated with outages, disruptions or incidents at third parties on which we rely, see the discussion in Part I Item 1A. \"\nRisk Factors\n\" under the headings, \"\nFailing to effectively maintain, operate or upgrade our information systems or those of third-party service providers upon which we rely...\n\" and \"\nPrivacy and information security laws are complex…\n\"\nWe believe that the aforementioned recent developments and general economic, marketplace and global health conditions will continue to impact the Company in the future. Their ultimate impact depends on future developments that are highly uncertain and difficult to predict.\n61\nConsolidated results of operations\nThe following table summarizes our revenues, operating income (loss) and adjusted operating income (loss) by line of business. See the discussion of our results for each line of business following this table. When multiple drivers are identified in the following discussion of results, they are listed in order of magnitude: \n \nYear ended December 31,\nAnnual change\n \n2024\n2023\nAmount\nPercent\n \n(dollars in millions)\nRevenues:\n \n \n \nU.S. dialysis\n$\n11,391 \n$\n10,937 \n$\n454 \n4.2 \n%\nOther - Ancillary services\n1,510 \n1,299 \n211 \n16.2 \n%\nElimination of intersegment revenues\n(86)\n(96)\n10 \n10.4 \n%\nTotal consolidated revenues\n$\n12,816 \n$\n12,140 \n$\n676 \n5.6 \n%\nOperating income (loss):\nU.S. dialysis\n$\n2,121 \n$\n1,775 \n$\n346 \n19.5 \n%\nOther - Ancillary services\n83 \n(9)\n92 \n1,022.2 \n%\nCorporate administrative support\n(113)\n(163)\n50 \n30.7 \n%\nOperating income\n$\n2,090 \n$\n1,603 \n$\n487 \n30.4 \n%\nAdjusted operating income (loss):\n(1)\nU.S. dialysis\n$\n2,086 \n$\n1,801 \n$\n285 \n15.8 \n%\nOther - Ancillary services\n8 \n(45)\n53 \n117.8 \n%\nCorporate administrative support\n(113)\n(122)\n9 \n7.4 \n%\nAdjusted operating income\n$\n1,981 \n$\n1,635 \n$\n346 \n21.2 \n%\nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers.\n \n(1)\nFor a reconciliation of adjusted operating income (loss) by reportable segment, see the \"\nReconciliations of non-GAAP measures\n\" section below. \nU.S. dialysis business\nAs of December 31, 2024, our U.S. dialysis business is a leading provider of kidney dialysis services, operating 2,657 outpatient dialysis centers serving approximately 200,800 patients, and contracted to provide hospital inpatient dialysis services in approximately 760 hospitals. We estimate that we have approximately a 36% share of the U.S. dialysis market based upon the number of patients we serve.\nApproximately 88% of our 2024 consolidated revenues were derived directly from our U.S. dialysis business. The principal drivers of our U.S. dialysis revenues include    :\n•\nour number of treatments, which is primarily a function of the number of chronic patients requiring approximately three in-center treatments per week as well as, to a lesser extent, the number of treatments for home-based dialysis and hospital inpatient dialysis; and\n•\nour average dialysis patient service revenue per treatment, including the mix of patients with commercial plans and government programs as primary payor.\nWithin our U.S. dialysis business, our home-based dialysis and hospital inpatient dialysis services are operationally integrated with our outpatient dialysis centers and related laboratory services. Our outpatient, home-based and hospital inpatient dialysis services comprise approximately 75%, 19% and 6% of our U.S. dialysis revenues, respectively.\nIn the U.S., government dialysis-related payment rates are principally determined by federal Medicare and state Medicaid policy. For 2024, approximately 67% of our total U.S. dialysis patient service revenues were generated from government-based programs for services to approximately 89% of our total U.S. patients. These government-based programs are principally Medicare and MA, Medicaid and managed Medicaid plans, and other government plans, representing approximately 56%, 8% and 3% of our U.S. dialysis patient service revenues, respectively. \n62\nIn November 2024, the Centers for Medicare & Medicaid Services (CMS) issued a final rule to update the Medicare ESRD Prospective Payment System payment rate and policies for calendar year 2024. CMS has finalized ESRD facilities' average reimbursement by a productivity-adjusted market basket increase of 2.2% in 2025. In addition, from time-to-time CMS identifies drugs to be added to the ESRD PPS bundled payment. On January 1, 2025, phosphate binders, a drug class taken orally by many ESKD patients to reduce absorption of dietary phosphate, were incorporated into the ESRD PPS bundle. Phosphate binders are not considered accounted for in the ESRD PPS base rate at this time and will be reimbursed through a Transitional Drug Add-on Payment Adjustment (TDAPA). The TDAPA period is expected to continue for a period of at least two years. Currently, phosphate binders are offered in both generic and branded forms and are produced by multiple manufacturers. During this TDAPA period, our operating results could be materially impacted by certain factors, including physician prescribing patterns, the terms of supplier and other vendor contracts, the mix of branded and generic forms of the drug used by our patients, whether the drug enters into the ESRD PPS and becomes part of its bundled payment following TDAPA and, if so, at what rate and how payors will treat reimbursement of the drug at the conclusion of the TDAPA period.\nDialysis payment rates from commercial payors vary and a major portion of our commercial rates are set at contracted amounts with payors and are subject to intense negotiation pressure. On average, dialysis-related payment rates from contracted commercial payors are significantly higher than Medicare, Medicaid and other government program payment rates, and therefore the percentage of commercial patients in relation to total patients represents a significant driver of our total average dialysis patient service revenue per treatment. Commercial payors (including hospital dialysis services) represent approximately 33% of U.S. dialysis patient service revenues.\nFor a discussion of government reimbursement, the Medicare ESRD bundled payment system, MA and commercial reimbursement, see Part I Item 1\n.\"Business\"\n under the heading \"\nU.S. dialysis business – Sources of revenue-concentrations and risks.\"\n For a discussion of operational, clinical and financial risks and uncertainties that we face in connection with the Medicare ESRD bundled payment system, see the risk factor in Part I Item 1A. \n\"Risk Factors\n\" under the heading \"\nOur business is subject to a complex set of governmental laws, regulations and other requirements and any failure to adhere to those requirements, or any changes in those requirements...\" \nFor a discussion of operational, clinical and financial risks and uncertainties that we face in connection with commercial payors, see the risk factor in Part I Item 1A. \n\"Risk Factors\"\n under the heading \"\nIf the number or percentage of patients with higher-paying commercial insurance declines, if the average rates that commercial payors pay us declines...\n\"\nWe anticipate that we will continue to experience increases in our operating costs in 2025 that may outpace any net Medicare, commercial or other rate increases that we may receive, which could significantly impact our operating results. In particular, we expect to continue experiencing increases in operating costs that are subject to inflation, such as labor and supply costs, including increases in maintenance costs, regardless of whether there is a compensating inflation-based increase in Medicare, commercial or other payor payment rates. In addition, we expect to continue to incur capital expenditures and associated depreciation and amortization costs to improve, renovate and maintain our facilities, equipment and information technology to meet evolving regulatory requirements and otherwise.\nU.S. dialysis patient care costs are those costs directly associated with operating and supporting our dialysis centers, home-based dialysis programs and hospital inpatient dialysis programs, and consist principally of labor, benefits, pharmaceuticals, medical supplies and other operating costs of the dialysis centers. \nThe principal drivers of our U.S. dialysis patient care costs include:\n•\nclinical hours per treatment, labor rates and benefit costs;\n•\nvendor pricing and utilization levels of pharmaceuticals;\n•\nbusiness infrastructure costs, which include the operating costs of our dialysis centers; and \n•\nmedical supply costs. \nOther cost categories that can present significant variability include insurance costs and professional fees. In addition, proposed ballot initiatives or referendums, legislation, regulations or policy changes could cause us to incur substantial costs to prepare for, or implement changes required. Any such changes could result in, among other things, increases in our labor costs or limitations on the amount of revenue that we can retain. For additional information on risks associated with potential and proposed ballot initiatives, referendums, legislation, regulations or policy changes, see the risk factor in Part I Item 1A. \"\nRisk Factors\"\n under the heading, \"\nChanges in federal and state healthcare legislation or regulations...\n\"\nOur average clinical hours per treatment decreased in 2024 compared to 2023 primarily due to a decrease in turnover as described below. We are always striving for improved productivity levels, however, changes in factors such as federal and state \n63\npolicies or regulatory billing requirements can lead to increased labor costs as can increases in turnover. In 2024, the demand for skilled clinical personnel continued, exacerbated by the nationwide shortage of these resources. In 2024 and 2023, we experienced increases in our clinical labor wage rates, which includes contract labor, of approximately 3.8% and 1.3%, respectively. We expect to continue to see higher clinical labor rates in 2025 due to labor market conditions, including changes in local minimum wage laws, and the continued competition for skilled clinical personnel. In 2024, our overall clinical teammate turnover decreased from 2023, but remains elevated from historical pre-COVID levels. We also continue to experience increases in the infrastructure and operating costs of our dialysis centers and general increases in utilities and repairs and maintenance. In 2024, we continued to implement certain cost control initiatives to help manage our overall operating costs, including labor productivity, and we expect to continue these initiatives in 2025.\nOur U.S. dialysis general and administrative expenses represented 10.3% and 10.1% of our U.S. dialysis revenues in 2024 and 2023, respectively. Increases in general and administrative expenses over the last several years were primarily related to strengthening our dialysis business and related compliance and operational processes, responding to certain legal and compliance matters and professional fees. We expect that these levels of general and administrative expenses will be impacted by continued investment in developing our capabilities and executing on our strategic priorities, among other things.\nU.S. dialysis results of operations\nTreatment volume:    \n \nYear ended December 31,\nAnnual change\n \n2024\n2023\nAmount\nPercent\nDialysis treatments\n29,046,346 \n28,910,177 \n136,169 \n0.5 \n%\nAverage treatments per day\n92,534 \n92,542 \n(8)\n— \n%\nTreatment days\n314 \n312 \n2 \n0.6 \n%\nNormalized non-acquired treatment growth\n(1)\n— \n%\n(0.1)\n%\n0.1 \n%\nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers\n \n(1)\nNormalized non-acquired treatment growth reflects year over year growth in treatment volume, adjusted to exclude acquisitions and other similar transactions, and further adjusted to normalize for the number and mix of treatment days in a given period versus the prior period.\nOur U.S. dialysis operating revenues and expenses are directly driven by treatment volume. The increase in our U.S. dialysis treatments in 2024 was primarily driven by additional treatment days and increased treatments from acquired treatment growth partially offset by an increase in missed treatments.\nRevenues:    \n \nYear ended December 31,\nAnnual change\n \n2024\n2023\nAmount\nPercent\n \n(dollars in millions, except per treatment data)\nTotal revenues\n$\n11,391 \n$\n10,937 \n$\n454 \n4.2 \n%\nAverage patient service revenue per treatment\n$\n391.32 \n$\n377.44 \n$\n13.88 \n3.7 \n%\nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers\nU.S. dialysis average patient service revenue per treatment increased primarily driven by the increase in average reimbursement rates from normal annual rate increases including Medicare rate increases, revenue cycle improvements, favorable changes in mix, and an increase in hospital inpatient dialysis rates.\n64\nOperating expenses and charges:\n \nYear ended December 31,\nAnnual change\n \n2024\n2023\nAmount\nPercent\n \n(dollars in millions, except per treatment data)\nPatient care costs\n$\n7,498 \n$\n7,395 \n$\n103 \n1.4 \n%\nGeneral and administrative\n1,174 \n1,102 \n72 \n6.5 \n%\nDepreciation and amortization\n661 \n696 \n(35)\n(5.0)\n%\nEquity investment income\n(28)\n(30)\n2 \n6.7 \n%\nGain on changes in ownership interests\n(35)\n— \n(35)\n(100.0)\n%\nTotal operating expenses and charges\n$\n9,270 \n$\n9,162 \n$\n107 \n1.2 \n%\nPatient care costs per treatment\n$\n258.12 \n$\n255.78 \n$\n2.34 \n0.9 \n%\nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers\nCharges impacting operating income\nClosure costs.\n In the third quarter of 2022, we began a strategic review of our outpatient clinic capacity requirements and utilization, which had been significantly impacted by declines in our patient census due to the COVID-19 pandemic. This review continued through 2023, with impacts continuing into 2024, and has resulted in higher than normal charges for center capacity closures over the last several quarters. These capacity closure costs include net losses on assets retired, lease termination costs, asset impairments and accelerated depreciation and amortization.\nDuring the year ended December 31, 2024, U.S. dialysis center closure costs were approximately $72.4 million, which impacted our patient care costs by $30.8 million, our general and administrative expenses by $25.6 million and our depreciation and amortization expense by $16.0 million. By comparison, during the year ended December 31, 2023, U.S. dialysis center closures were approximately $99.1 million, which impacted our patient care costs by $28.0 million, our general and administrative expenses by $20.6 million and our depreciation and amortization expense by $50.5 million.\nIn the upcoming fiscal year, we expect a decrease in our center closure costs as we expect future closures to return to pre-COVID levels.\nSeverance costs.\n During the fourth quarter of 2022, we committed to a plan to increase efficiencies and cost savings in certain general and administrative support functions. As a result of this plan, we recognized expenses related to termination and other benefit commitments in our U.S. dialysis business of $26.7 million during the twelve months ended December 31, 2023.\nPatient care costs. \nU.S. dialysis patient care costs are those costs directly associated with operating and supporting our dialysis centers and consist principally of compensation expenses including labor and benefits, pharmaceuticals, medical supplies and other operating costs of the dialysis centers. \nU.S. dialysis patient care costs per treatment increased primarily due to increased compensation expenses, including increased wage rates, as well as increases in health benefit expense and medical supply costs. Other drivers of this change include increases in utilities expense driven by lower expense in 2023 related to our virtual power purchase arrangements, insurance costs and routine repairs and maintenance. These increases were partially offset by decreases in contributions to charitable organizations, other direct operating expenses associated with our dialysis centers, contract wages and a gain on settlement received in the fourth quarter of 2024.\nGeneral and administrative expenses. \nU.S. dialysis general and administrative expenses increased primarily due to increases in compensation expense, including increased wage rates and headcount, as well as IT-related costs and advocacy costs, including a refund received in 2023 related to 2022 advocacy costs. Other drivers of this change include increased professional fees, center closure costs, as described above, and health benefit expense. These increases were partially offset by decreases in severance costs, as described above, and contributions to our charitable foundation.\nDepreciation and amortization. \nDepreciation and amortization expense is directly impacted by the number of our dialysis centers and the information technology that we develop and acquire as well as changes in useful lives of assets. U.S. dialysis depreciation and amortization expense decreased in 2024 primarily due to decreased accelerated depreciation related to center closures, as described above.\nEquity investment income. \nU.S. dialysis equity investment income decreased due to the consolidation of a previously nonconsolidated dialysis partnership in the first quarter of 2024, partially offset by increased profitability at certain nonconsolidated dialysis partnerships.\n65\nGain on changes in ownership interests\n. During the first quarter of 2024, we acquired a controlling interest in a previously nonconsolidated dialysis partnership for which we recognized a non-cash gain of $35.1 million on our prior investment upon consolidation.\nOperating income and adjusted operating income\n \nYear ended December 31,\nAnnual change\n \n2024\n2023\nAmount\nPercent\n(dollars in millions)\nOperating income\n$\n2,121 \n$\n1,775 \n$\n346 \n19.5 \n%\nAdjusted operating income\n(1)\n$\n2,086 \n$\n1,801 \n$\n285 \n15.8 \n%\nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers.\n \n(1)\nFor a reconciliation of adjusted operating income by reportable segment, see the \"\nReconciliations of non-GAAP measures\n\" section below.\nU.S. dialysis operating income for 2024 compared to 2023 was positively impacted by a gain on a change in business ownership interest and severance costs, as described above. U.S. dialysis operating income and adjusted operating income increased compared to 2023 primarily due to an increase in our average patient service revenue per treatment and dialysis treatments, as described above, as well as decreases in charitable contributions, center closure costs, as described above, other direct operating expenses associated with our dialysis centers, contract wages and a gain on settlement, as described above. These increases in operating income and adjusted operating income were partially offset by increases in compensation expenses, as described above, as well as increases in health benefit expense, IT-related costs, medical supply costs, advocacy costs and utilities expense, as described above. Operating income and adjusted operating income were also negatively impacted by increased insurance costs, routine repairs and maintenance and professional fees.\nOther - Ancillary services\nOur other operations include ancillary services that are primarily aligned with our core business of providing dialysis services to our network of patients. As of December 31, 2024, these consisted primarily of our U.S. IKC business, certain U.S. other ancillary businesses (including our clinical research programs, transplant software business, and venture investment group), and our international operations. \nThese ancillary services, including our international operations, generated revenues of approximately $1.510 billion in 2024, representing approximately 12% of our consolidated revenues.\nAs of December 31, 2024, DaVita IKC provided integrated care and disease management services to approximately 70,400 patients in risk-based integrated care arrangements and to an additional 11,600 patients in other integrated care arrangements. We also expect to add additional service offerings to our business and pursue additional strategic initiatives in the future as circumstances warrant, which could include, among other things, healthcare services not related to kidney disease.\nFor a discussion of the risks related to IKC and our ancillary services, see the discussion in the risk factors in Part I Item 1A. \"\nRisk Factors\n\" under the headings, \"\nThe U.S. integrated kidney care, U.S. other ancillary services and international operations that we operate or invest in now or in the future\n...\" and \"\nIf we are not able to successfully implement our strategy with respect to our integrated kidney care and value-based care initiatives\n...\" \nAs of December 31, 2024, our international dialysis business owned or operated 509 outpatient dialysis centers located in 13 countries outside of the U.S. For 2024, total revenues generated from our international operations were approximately 8% of our consolidated revenues.\n66\nAncillary services results of operations\n \nYear ended December 31,\nAnnual change\n \n2024\n2023\nAmount\nPercent\n(dollars in millions)\nRevenues:\nU.S. IKC\n$\n508 \n$\n511 \n$\n(3)\n(0.6)\n%\nU.S. other ancillary\n25 \n25 \n— \n— \n%\nInternational\n977 \n763 \n214 \n28.0 \n%\nTotal ancillary services revenues\n$\n1,510 \n$\n1,299 \n$\n211 \n16.2 \n%\nOperating (loss) income:\nU.S. IKC\n$\n(35)\n$\n(39)\n$\n4 \n10.3 \n%\nU.S. other ancillary\n(9)\n(25)\n16 \n64.0 \n%\nInternational\n(1)\n127 \n55 \n72 \n130.9 \n%\nTotal ancillary services operating income (loss)\n$\n83 \n$\n(9)\n$\n92 \n1,022.2 \n%\nAdjusted operating (loss) income\n(2)\n:\nU.S. IKC\n$\n(35)\n$\n(93)\n$\n58 \n62.4 \n%\nU.S. other ancillary\n(9)\n(7)\n(2)\n(28.6)\n%\nInternational\n(1)\n52 \n55 \n(3)\n(5.5)\n%\nTotal adjusted operating income (loss):\n$\n8 \n$\n(45)\n$\n53 \n117.8 \n%\nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers.\n \n(1)\nThe reported operating income and adjusted operating income for the years ended December 31, 2024 and December 31, 2023, includes foreign currency gains (losses) embedded in equity method income recognized from our APAC joint venture, which was consolidated in the fourth quarter of 2024, of approximately $0.6 million and $(1.6) million, respectively.\n(2)\nFor a reconciliation of adjusted operating (loss) income by reportable segment, see the \"\nReconciliations of non-GAAP measures\n\" section below. \nRevenues:\nOur IKC revenues were impacted by decreased revenues from our special needs plans and the divestiture of our physician services business, partially offset by a net increase in shared savings. Our U.S. other ancillary services revenues were impacted by increased revenues from our transplant software business, offset by decreased revenues in our clinical research programs. Our international revenues increased due to acquired and non-acquired treatment growth and average reimbursement rate increases in certain countries, partially offset by charges for balances deemed uncollectible.\nItems impacting operating income\nIKC adjustment. \nThe decrease in IKC revenues for 2024, as described above, was impacted by the lifting of certain revenue recognition constraints for some of our value-based care contracts with health plans in 2023, which allowed us to recognize approximately $55 million in incremental shared savings revenues during 2023 compared to what we would have recognized under previous years' constraints.\nSince we launched our IKC VBC business, the COVID-19 pandemic and its distorting effects on medical utilization have subsided, our VBC contracts have continued to mature, we have begun to receive more timely and granular data from our health plan partners and we have gained more experience making total medical cost estimates for this population. These changes and refinements have helped to mitigate or alleviate a number of the information and measurement limitations that constrained our revenue recognition in the past, allowing us to recognize a greater share of expected shared savings revenues for our VBC plans sooner than we had in previous periods. As a result, we recognized a majority of the VBC shared savings revenues we expected to earn for 2023 in 2023, while in previous years a substantial majority of the shared savings earned for a VBC plan year were recognized in a subsequent year.\nOur fiscal year 2023 therefore included a general shift in the timing of our revenue recognition for shared savings under our VBC contracts with health plans, as it included a majority of shared savings revenues earned for both 2022 and 2023.\n67\nSeverance and other costs\n. During the fourth quarter of 2022, similar to U.S. dialysis, we committed to a plan to increase efficiencies and cost savings in certain general and administrative support functions and other overhead costs. As a result of this plan, we recognized expenses related to termination and other benefit commitments in our IKC business of $0.5 million during the year ended December 31, 2023.\nGoodwill impairment charge and related items\n. During the fourth quarter of 2023, we recognized a goodwill impairment charge of $26.1 million in our transplant software business. We also recognized a gain of $7.7 million due to a reduction in the estimated value of earn-out obligations from our original acquisition of this business. This impairment charge and related gain resulted from a reduction in estimated fair value for the business driven primarily from the business not achieving its revenue targets, with reduced revenue expectations for future years, as well as an increase in the risk-free rate.\nGain on changes in ownership interests\n. During the fourth quarter of 2024, we acquired a controlling interest in the previously nonconsolidated partnership known as the Company's APAC joint venture, for which we recognized a non-cash gain of $74.3 million on our prior investment upon consolidation.\nOperating income (loss) and adjusted operating income (loss):\nOur IKC operating loss for 2024 compared to 2023 was impacted by the IKC adjustment, as described above. Our IKC operating loss and adjusted operating loss decreased primarily due to a net increase in shared savings, decreased medical costs for our special needs plans and the divestiture of our physician services business. These increases were partially offset by decreased revenues from our special needs plans and continued investments in our integrated care support functions. Our U.S. other ancillary services operating loss for 2024 compared to 2023 was impacted by a goodwill impairment charge and related gain, as described above. Our U.S. other ancillary services operating loss and adjusted operating loss was impacted by decreased revenues in our clinical research programs and increased expenses in our transplant software business, partially offset by increased revenues from our transplant software business. Our international operating income was impacted by a gain on a change in business ownership interests, as described above. International operating income and adjusted operating income were impacted by increased revenues, as described above, partially offset by increases in operating and deal costs from acquisition-related growth.\nCorporate administrative support\nCorporate administrative support consists primarily of\n \nlabor, benefits and long-term incentive compensation expense, as well as professional fees, for departments which provide support to more than one of our various operating lines of business. Corporate administrative support expenses are included in general and administrative expenses on our consolidated income statement\n.\nAccruals for legal matters\n. During 2023, we recorded a charge of $40 million for a legal matter within corporate administrative support.\nCorporate administrative support expenses decreased $50 million due to the absence in 2024 of the legal charge described above, and decreased long-term incentive compensation costs, partially offset by increased compensation expenses in 2024.\n68\nCorporate-level charges\n \nYear ended December 31,\nAnnual change\n \n2024\n2023\nAmount\nPercent\n(dollars in millions)\nDebt expense\n$\n470 \n$\n399 \n$\n71 \n17.8 \n%\nDebt prepayment, extinguishment and modification costs\n$\n20 \n$\n8 \n$\n12 \n150.0 \n%\nWeighted average effective interest rate\n(1)\n5.07 \n%\n4.52 \n%\n0.55 \n%\nOther loss, net\n$\n(70)\n$\n(19)\n$\n(51)\n(268.4)\n%\nEffective income tax rate\n18.3 \n%\n18.7 \n%\n(0.4)\n%\nEffective income tax rate attributable to DaVita Inc.\n(2)\n22.9 \n%\n24.3 \n%\n(1.4)\n%\nNet income attributable to noncontrolling interests\n$\n314 \n$\n265 \n$\n49 \n18.5 \n%\nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers.\n \n(1)\nRepresents our overall weighted average effective interest rate on all debt, including the effect of interest rate caps and amortization of debt discount, premium and deferred financing charges.\n(2)\nFor a reconciliation of our effective income tax rate attributable to DaVita Inc., see the \"\nReconciliations of non-GAAP measures\n\" section below. \nDebt expense\nDebt expense increased primarily due to an increase in overall weighted average effective interest rate principally related to the expiration of our 2019 interest rate cap agreements on June 30, 2024, which had lower rates than our currently effective interest rate caps, as well as an increase in our our long-term debt balance related to the issuance of 6.875% senior notes due 2032 and incremental borrowing on our Term Loan A-1, partially offset by the repayment of the non-extended Term Loan B-1. See Note 12 to the consolidated financial statements for further information on the components of our debt and changes in them since 2023.\nDebt extinguishment and modification costs\nDebt prepayment, extinguishment and modification costs were $20 million in 2024 composed of fees incurred in connection with the additional incremental borrowing on our Term Loan A-1 (Incremental Term Loan A-1), the extension of the maturity date of a portion of our Term Loan B-1 from August 2026 to May 2031 (Extended Term Loan B-1), and deferred financing costs and original issue discount written off for the extinguishment of the non-extended Term Loan B-1. Comparatively, debt extinguishment and modification costs were $8 million in 2023 related to the refinancing of our prior Term Loan A and prior revolving line of credit. These costs were composed of deferred financing costs written off for the portion of this debt considered extinguished and reborrowed and fees incurred as part of this debt refinancing. See Note 12 to the condensed consolidated financial statements for further information on the Incremental Term Loan A-1, Extended Term Loan B-1 and the components of our debt.\nOther loss\n \nOther loss consists primarily of interest income on cash and cash equivalents and short- and long-term investments, equity investment (loss) income on equity method investments other than dialysis partnerships, realized and unrealized gains and losses recognized on other investments, impairments on investments, and foreign currency transaction gains and losses. Other loss increased primarily due to equity investment losses on our investment in Mozarc Medical Holding LLC (Mozarc), including the $14 million gain recognized in 2023 on the non-cash assets contributed to Mozarc, partially offset by decreased losses recognized on other investments, decreased losses on foreign currency transactions and an increase in interest income.\nProvision for income taxes \nOur effective income tax rate and effective income tax rate attributable to DaVita Inc. decreased in 2024 primarily due to the tax impact of non-taxable non-cash gains related to previously nonconsolidated businesses and a decrease in nondeductible executive compensation. This benefit was partially offset by additional expense recognized in 2024 for finalized tax returns and a decrease in benefits recognized for uncertain tax positions.\n69\nNet income attributable to noncontrolling interests\nThe increase in income attributable to noncontrolling interests was due to an increase in earnings at certain U.S. dialysis partnerships.\n U.S. dialysis accounts receivable\nOur U.S. dialysis accounts receivable balances at December 31, 2024 and December 31, 2023 were $1.615 billion and $1.632 billion, respectively, representing approximately 52 days and 54 days of revenue (DSO), respectively. The decrease in DSO was primarily due to continued collections improvements. Our DSO calculation is based on the most recent quarter’s average revenues per day. There were no significant changes during 2024 from 2023 in the carrying amount of accounts receivable outstanding over one year old or in the amounts pending approval from third-party payors.\nAs of December 31, 2024 and 2023, our U.S. dialysis accounts receivable balances that are more than six months old represented approximately 23% and 19% of our U.S. dialysis accounts receivable balances outstanding, respectively. Substantially all revenue realized for patient services is received from government and commercial payors, as discussed above. Less than 1% of our revenues in both periods were classified as patient pay.\nAmounts pending approval from third-party payors associated with Medicare bad debt claims as of December 31, 2024 and 2023, other than the standard monthly billing, were approximately $107 million, and are classified within other receivables. A significant portion of our Medicare bad debt claims are typically paid to us before the Medicare fiscal intermediary audits the claims but are subject to subsequent adjustment based upon the actual results of those audits. Such audits typically occur one to four years after the claims are filed.\n70\nLiquidity and capital resources\nThe following table summarizes our major sources and uses of cash, cash equivalents and restricted cash:\nYear ended December 31,\nAnnual change\n2024\n2023\nAmount\nPercent\n(dollars in millions)\nNet cash provided by operating activities:\nNet income\n$\n1,251 \n$\n957 \n$\n294 \n30.7 \n%\nNon-cash items in net income\n801 \n908 \n(107)\n(11.8)\n%\nOther working capital changes\n44 \n209 \n(165)\n(78.9)\n%\nOther\n(74)\n(14)\n(60)\n(428.6)\n%\n$\n2,022 \n$\n2,059 \n$\n(37)\n(1.8)\n%\nNet cash used in investing activities:\nMaintenance capital expenditures\n(1)\n$\n(394)\n$\n(406)\n$\n12 \n3.0 \n%\nDevelopment capital expenditures\n(2)\n(162)\n(162)\n— \n— \n%\nAcquisition expenditures\n(246)\n(26)\n(220)\n(846.2)\n%\nProceeds from sale of self-developed properties\n18 \n11 \n7 \n63.6 \n%\nOther\n12 \n(189)\n201 \n106.3 \n%\n$\n(771)\n$\n(772)\n$\n1 \n0.1 \n%\nNet cash used in financing activities:\nDebt proceeds (payments), net\n$\n1,095 \n$\n(550)\n$\n1,645 \n299.1 \n%\nDeferred and debt related financing costs\n(51)\n(70)\n19 \n27.1 \n%\nDistributions to noncontrolling interests\n(337)\n(281)\n(56)\n(19.9)\n%\nContributions from noncontrolling interests\n14 \n15 \n(1)\n(6.7)\n%\nStock award exercises and other share issuances\n(114)\n(48)\n(66)\n(137.5)\n%\nShare repurchases\n(1,386)\n(272)\n(1,114)\n(409.6)\n%\nOther\n(39)\n35 \n(74)\n(211.4)\n%\n$\n(817)\n$\n(1,170)\n$\n353 \n30.2 \n%\nTotal number of shares repurchased\n9,832,705 \n2,903,832 \n6,928,873 \n238.6 \n%\nFree cash flow\n(3)\n$\n1,162 \n$\n1,236 \n$\n(74)\n(6.0)\n%\nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers.\n \n(1)\nMaintenance capital expenditures represent capital expenditures to maintain the productive capacity of the business and include those made for investments in information technology, dialysis center renovations, capital asset replacements, and any other capital expenditures that are not development or acquisition expenditures.\n(2)\nDevelopment capital expenditures principally represent capital expenditures (other than acquisition expenditures) made to expand the productive capacity of the business and include those for new U.S. and international dialysis center developments, dialysis center expansions and relocations, and new or expanded contracted hospital operations.\n(3)\nFor a reconciliation of our free cash flow, see the \"\nReconciliations of Non-GAAP measures\n\" section below.\nConsolidated cash flows\nConsolidated cash flows from operating activities for 2024 and 2023 were $2,022 million and $2,059 million, respectively. The decrease in cash flows was primarily driven by increases in taxes and interest paid combined with changes in other working capital items partially offset by improved operating results. \nCash flows used for investing activities in 2024 was flat compared to 2023. An increase in acquisitions due to our international growth was largely offset by decreases in equity investments driven by our investment in Mozarc in 2023.\n71\nCash flows used in financing activities decreased $353 million in 2024 compared to 2023. Significant sources of cash during the period included the extension of the maturity date from August 2026 to May 2031 for a portion of our Term Loan B-1 (the Extended Term Loan B-1 transaction) in the aggregate principal amount of approximately $1,640 million, (such portion referred to as the Extended Term Loan B-1), the incurrence of an incremental Term Loan A-1 tranche in the aggregate principal amount of $1,100 million (such portion referred to as the Incremental Term Loan A-1), the issuance of 6.875% senior notes due 2032 in the amount of $1,000 million (the 6.875% Senior Notes) and Change Healthcare temporary funding assistance of $93 million, net, pursuant to the CHC Funding Arrangement during the year ended December 31, 2024. Significant uses of cash during that same period included debt prepayments on Term Loan B-1 in the aggregate amount of approximately $2,590 million as part of the Extended Term Loan B-1, Incremental Term Loan A-1 and 6.875% Senior Notes transactions, and regularly scheduled principal payments under our senior secured credit facilities totaling approximately $75 million on our Term Loan A-1, $14 million on Term Loan B-1 and $4 million on Extended Term Loan B-1, as well as additional required payments under other debt arrangements. Additionally, we recognized financing cash outflows of $36 million in deferred financing costs and discount related to the Fourth and Sixth Amendments to the Senior Secured Credit Agreement and 6.875% Senior Notes transactions, as well as $15 million in cap premium fees for our 2024 forward interest rate cap agreements. During the year ended December 31, 2024 we also used cash to repurchase 9,832,705 shares of our common stock.\nBy comparison, 2023 significant uses of cash included the pay-off of the remaining principal balance outstanding on our prior Term Loan A and prior revolving line of credit in the amount of $1,444 million and $150 million, respectively. Other uses of cash included regularly scheduled and other principal payments under our senior secured credit facilities totaling approximately $54 million on our prior Term Loan A, $16 million on our new Term Loan A-1, $57 million on Term Loan B-1, additional net repayments of $15 million on our revolving line of credit, as well as additional required payments under other debt arrangements. Additionally, we recognized financing cash outflows of $30 million in deferred financing costs related to the Amendments to the Senior Secured Credit Agreement and $40 million in cap premium fees for our 2023 forward interest cap agreements. Significant sources of cash during the period included the refinancing of the Term Loan A and revolving line of credit with a secured Term Loan A-1 facility in the aggregate principal amount of $1,250 million. During the year ended December 31, 2023 we also used cash to repurchase 2,903,832 shares of our common stock.\nDialysis center capacity and growth\nWe are typically able to increase our capacity by extending hours at our existing dialysis centers, expanding our existing dialysis centers, relocating our dialysis centers, developing new dialysis centers and by acquiring dialysis centers. The development of a typical new outpatient dialysis center generally requires approximately $2 million for leasehold improvements and other capital expenditures. Based on our experience, a new outpatient dialysis center typically opens within a year after the property lease is signed, normally achieves operating profitability in the second year after Medicare certification, and normally reaches maturity within three to five years. Acquiring an existing outpatient dialysis center requires a substantially greater initial investment, but profitability and cash flows are generally accelerated and more predictable. To a limited extent, we enter into agreements to provide management and administrative services to outpatient dialysis centers in which we own a noncontrolling interest or which are wholly-owned by third parties in return for management fees.\nThe table below shows the growth in our dialysis operations by number of dialysis centers owned or operated:\nU.S.\nInternational\n \n2024\n2023\n2024\n2023\nNumber of centers operated at beginning of year\n2,675 \n2,724 \n367 \n350 \nAcquired centers\n12 \n— \n198 \n12 \nDeveloped centers\n13 \n20 \n5 \n8 \nNet change in non-owned managed or administered centers\n(1)\n(7)\n3 \n(47)\n2 \nSold and closed centers\n(2)\n(12)\n(6)\n(6)\n(2)\nClosed centers\n(3)\n(24)\n(66)\n(8)\n(3)\nNumber of centers operated at end of year\n2,657 \n2,675 \n509 \n367 \n(1)\nRepresents the change in the number of dialysis centers which we manage or provide administrative services to but in which we own a noncontrolling equity interest or which are wholly-owned by third parties. For our international business, 2024 activity includes a reduction in managed centers, and an increase in acquired centers, from the consolidation of our APAC joint venture on November 1, 2024.\n(2)\nRepresents dialysis centers that were sold and/or closed for which the majority of patients were not retained.\n(3)\nRepresents dialysis centers that were closed for which the majority of patients were retained and transferred to one of our other existing outpatient dialysis centers.\n72\nStock repurchases\nThe following table summarizes our common stock repurchases during the years ended December 31, 2024 and 2023:\nYear ended December 31,\n2024\n2023\n(dollars in millions and shares in thousands, except per share data)\nShares\n9,833 \n2,904 \nAmounts paid\n(1)\n$\n1,389 \n$\n286 \nAverage price paid per share\n(2)\n$\n140.06 \n$\n97.82 \n(1)\nIncludes commissions and the 1% excise tax imposed on certain stock repurchases made after December 31, 2022 by the Inflation Reduction Act of 2022. The excise tax is recorded as part of the cost basis of treasury stock repurchased and, as such, is included in stockholders’ equity.\n(2)\nExcludes commissions and the excise tax described above\nSubsequent to December 31, 2024, we have repurchased 778,746 shares of our common stock for $125 million at an average price paid of $158.48 per share through February 13, 2025, including repurchases from Berkshire Hathaway Inc. (Berkshire) pursuant to our previously disclosed share repurchase agreement.\nSee further discussion of our share repurchase activity, authorizations and information on our share repurchase agreement with Berkshire in Note 18 to the consolidated financial statements.\nAvailable liquidity\nAs of December 31, 2024, our cash balance was $795 million and we held approximately $51 million in short-term investments. At that time we also had undrawn capacity on the revolving line of credit under our senior credit facilities of $1.5 billion. Credit available under this revolving line of credit is reduced by the amount of any letters of credit outstanding thereunder, of which there were none as of December 31, 2024. As of December 31, 2024 we separately had approximately $161 million in letters of credit outstanding under a separate bilateral secured letter of credit facility.\nSee Note 12 to the consolidated financial statements for components of our long-term debt and their interest rates.\nWe believe that our cash flows from operations and other sources of liquidity, including from amounts available under our senior secured credit facilities and our access to the capital markets, will be sufficient to fund our scheduled debt service under the terms of our debt agreements and other obligations for the foreseeable future, including the next 12 months. From time to time, depending on market conditions, our capital requirements and the availability of financing, among other things, we may seek to refinance our existing debt and may incur additional indebtedness. Our primary recurrent sources of liquidity are cash from operations and cash from borrowings, which are subject to general, economic, financial, competitive, regulatory and other factors that are beyond our control, as described in Part I Item 1A. \n\"Risk Factors\"\n under the heading \"\nThe level of our current and future debt...\n\"\nReconciliations of non-GAAP measures\nThe following tables provide reconciliations of adjusted operating income (loss) to operating income (loss) as presented on a U.S. generally accepted accounting principles (GAAP) basis for our U.S. dialysis reportable segment as well as for our U.S. IKC business, our U.S. other ancillary services, our international business, and for our total ancillary services which combines them and is disclosed as our other segments category, in addition to our corporate administrative support.\nIn connection with a comment letter from the Securities and Exchange Commission Staff, beginning in the second quarter of 2024, we have updated the presentation of our non-GAAP measures to no longer exclude center closure costs for all periods presented. To facilitate comparisons, the non-GAAP measures presented for prior periods have also been conformed to the presentation of non-GAAP measures for the current period.\nThese non-GAAP or \"adjusted\" measures are presented because management believes these measures are useful adjuncts to, but not alternatives for, our GAAP results. Specifically, management uses adjusted operating income (loss) to compare and evaluate our performance period over period and relative to competitors, to analyze the underlying trends in our business, to establish operational budgets and forecasts and for incentive compensation purposes. We believe this non-GAAP measure is also useful to investors and analysts in evaluating our performance over time and relative to competitors, as well as in analyzing the underlying trends in our business. We also believe this presentation enhances a user's understanding of our normal operating income by excluding certain items which we do not believe are indicative of our ordinary results of operations.\n73\nIn addition, our effective income tax rate on income attributable to DaVita Inc. excludes noncontrolling owners' income, which primarily relates to non-tax paying entities. We believe this adjusted effective income tax rate is useful to management, investors and analysts in evaluating our performance and establishing expectations for income taxes incurred on our ordinary results attributable to DaVita Inc.\nFinally, our free cash flow represents net cash provided by operating activities less distributions to noncontrolling interests, development capital expenditures, and maintenance capital expenditures; plus contributions from noncontrolling interests and proceeds from the sale of self-developed properties. Management uses this measure to assess our ability to fund acquisitions and meet our debt service obligations and we believe this measure is equally useful to investors and analysts as an adjunct to cash flows from operating activities and other measures under GAAP.\nIt is important to bear in mind that these non-GAAP \"adjusted\" measures are not measures of financial performance under GAAP and should not be considered in isolation from, nor as substitutes for, their most comparable GAAP measures.\nYear ended December 31, 2024\nU.S. \ndialysis\nAncillary services\nCorporate \nadministration\nU.S. IKC\nU.S. Other\nInternational\nTotal\nConsolidated\n(dollars in millions)\nOperating income (loss)\n$\n2,121 \n$\n(35)\n$\n(9)\n$\n127 \n$\n83 \n$\n(113)\n$\n2,090 \nGain on changes in ownership\n interests\n(1)\n(35)\n— \n— \n(74)\n(74)\n— \n(109)\nAdjusted operating income (loss)\n(2)\n$\n2,086 \n$\n(35)\n$\n(9)\n$\n52 \n$\n8 \n$\n(113)\n$\n1,981 \nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers.\nYear ended December 31, 2023\nU.S. \ndialysis\nAncillary services\nCorporate \nadministration\nU.S. IKC\nU.S. Other\nInternational\nTotal\nConsolidated\n(dollars in millions)\nOperating income (loss)\n$\n1,775 \n$\n(39)\n$\n(25)\n$\n55 \n$\n(9)\n$\n(163)\n$\n1,603 \nSeverance and other costs\n(3)\n27 \n— \n— \n— \n— \n1 \n28 \nLegal matter\n(4)\n— \n— \n— \n— \n— \n40 \n40 \nIKC adjustment\n(5)\n— \n(55)\n— \n— \n(55)\n— \n(55)\nEarn-out revaluation\n(6)\n— \n— \n(8)\n— \n(8)\n— \n(8)\nGoodwill impairment\n(6)\n— \n— \n26 \n— \n26 \n— \n26 \nAdjusted operating income\n (loss)\n(2)\n$\n1,801 \n$\n(93)\n$\n(7)\n$\n55 \n$\n(45)\n$\n(122)\n$\n1,635 \nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers.\n(1)\nRepresents non-cash gains recognized on the acquisitions of controlling financial interests in previously nonconsolidated partnerships in 2024. See additional discussion above under the heading \"\nGain on changes in ownership interests\n\" within \"\nU.S. dialysis results of operations\n\" and \n\"Ancillary services results of operation\" \nfor the $35 million and $74 million, respectively. These gains were to mark our prior investments in these businesses to fair value before consolidation and to recognize related foreign currency gains from translation adjustments previously deferred in accumulated other comprehensive loss. Gains on changes in business ownership interests do not represent a normal and recurring requirement of operating our business or generating revenues and may obscure analysis of underlying trends and financial performance.\n(2)\nIn connection with the conclusion of a comment letter from the Securities and Exchange Commission Staff in July 2024, beginning in the second quarter 2024, we have updated the presentation of our non-GAAP measures to no longer exclude center closure costs for all periods presented. To facilitate comparisons, the non-GAAP measures presented for prior periods also have been conformed to the presentation of the non-GAAP measures for the current period.\n(3)\nIncludes severance and other termination costs related to a prior strategic restructuring initiative and associated transition of certain general and administrative support functions to a third party. See additional discussion above under the heading \"\nSeverance costs\n\" within \"\nU.S. dialysis results of operations\n\" and \"\nSeverance and other costs\n\" within \"\nAncillary services results of operations\n\".\n(4)\nRepresents an amount that was accrued for costs prior to agreement on a third-party settlement for the matter further described in Note 15 to our consolidated financial statements under the heading \"\n2017 U.S. Attorney Colorado Investigation\n\". We have excluded this charge, which had been previously disclosed, from our non-GAAP metrics because, among other things, we do not believe it is indicative of our ordinary results of operations. In this instance, among the factors considered were that the claim relates to prior ancillary operations or activities that we sold or closed (or otherwise ceased) prior to June 2020, and the charge is significant and may obscure analysis of underlying trends and financial performance of our current business.\n74\n(5)\nOur fiscal year 2023 results included a majority of shared savings revenues earned for both 2022 and 2023 as a result of a general shift in the timing of recognition for shared savings under our VBC contracts with health plans due to the lifting of certain revenue recognition constraints in 2023. This amount represents the effect of shared savings revenues recognized in 2023 incremental to what we would have recognized in 2023 under prior year constraints. We have excluded this benefit to operating income because it is both unusual to our business and significant in size, and may obscure analysis of underlying trends and financial performance. See additional discussion above under \"\nIKC adjustment\"\n within \"\nAncillary services results of operations\"\n.\n(6)\nRepresents a goodwill impairment charge, and related gain from a reduction in earn-out obligation values, for our transplant software business. See additional discussion above under the heading \"\nGoodwill impairment charge and related items\"\n within \"\nAncillary services results of operations\"\n. This charge and this gain are excluded from our non-GAAP metrics because they do not occur in or reflect the ordinary course of our ongoing business operations, are inherently unpredictable and, in the case of impairments, are non-cash amounts, the exclusion of which facilitates comparison of historical, current, and forecasted financial results.\nYear ended December 31,\n2024\n2023\n(dollars in millions)\nIncome before income taxes\n$\n1,530 \n$\n1,177 \nLess: Noncontrolling owners’ income primarily attributable to non-tax paying entities\n(315)\n(263)\nIncome before income taxes attributable to DaVita Inc.\n$\n1,215 \n$\n914 \nIncome tax expense\n$\n280 \n$\n220 \nIncome tax attributable to noncontrolling interests\n(1)\n2 \nIncome tax expense attributable to DaVita Inc.\n$\n279 \n$\n222 \nEffective income tax rate on income attributable to DaVita Inc.\n22.9 \n%\n24.3 \n%\nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers.\nYear ended December 31,\n2024\n2023\n(dollars in millions)\nNet cash provided by operating activities\n$\n2,022 \n$\n2,059 \nAdjustments to reconcile net cash provided by operating activities to free cash flow:\nDistributions to noncontrolling interests\n(337)\n(281)\nContributions from noncontrolling interests\n14 \n15 \nMaintenance capital expenditures\n(394)\n(406)\nDevelopment capital expenditures\n(162)\n(162)\nProceeds from sale of self-developed properties\n18 \n11 \nFree cash flow\n$\n1,162 \n$\n1,236 \nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers.\n75\nOff-balance sheet arrangements and aggregate contractual obligations\nIn addition to the debt obligations and operating lease liabilities reflected on our balance sheet, we have commitments associated with letters of credit as well as certain working capital funding obligations associated with our equity investments in nonconsolidated dialysis ventures that we manage and some we manage that are wholly-owned by third parties.\nWe also have potential obligations to purchase the noncontrolling interests held by third parties in many of our majority-owned dialysis partnerships and other nonconsolidated entities. These obligations are in the form of put provisions that are exercisable at the third-party owners’ discretion within specified periods as outlined in each specific put provision. For additional information see Notes 16 and 23 to the consolidated financial statements.\nThe following is a summary of these cash contractual obligations and commitments as of December 31, 2024:\n \n2025\n2026-2027\n2028-2029\nThereafter\nTotal\n(dollars in millions)\nDebt and leases:\n \n \n \n \n \nLong-term debt\n(1)\n:\nPrincipal payments\n$\n243 \n$\n315 \n$\n1,911 \n$\n6,826 \n$\n9,295 \nInterest payments on credit facilities and senior notes\n500 \n967 \n746 \n489 \n2,702 \nFinancing leases\n(2)\n28 \n62 \n51 \n75 \n216 \nOperating leases, including imputed interest\n(2)\n508 \n971 \n696 \n864 \n3,039 \n \n$\n1,279 \n$\n2,315 \n$\n3,404 \n$\n8,254 \n$\n15,252 \nPartnership interests subject to put provisions:\n(3)\n \n \n \n \n \nOn-balance sheet:\nNoncontrolling interests subject to put provisions\n1,527 \n84 \n44 \n40 \n1,695 \nOff-balance sheet:\nNon-owned and minority owned put provisions\n57 \n— \n— \n— \n57 \n \n$\n1,584 \n$\n84 \n$\n44 \n$\n40 \n$\n1,752 \n(1)\nSee Note 12 to the consolidated financial statements for components of our long-term debt and related interest rates. \n(2)\nSee Note 13 to the consolidated financial statements for components of our leases and related interest rates. \n(3)\nRepresents amounts for which we are contractually committed, should the outside partner exercise its put option.\nAs of December 31, 2024 we had outstanding letters of credit in the aggregate amount of approximately $161 million under a separate bilateral secured letter of credit facility.\nAs of December 31, 2024 we have outstanding purchase agreements with various suppliers to purchase set amounts of dialysis equipment, parts, pharmaceuticals, and supplies. If we fail to meet the minimum purchase commitments under these contracts during any year, we are required to pay the difference to the supplier. For additional information see Note 16 to the consolidated financial statements.\nWe also have certain potential commitments to provide working capital funding, if necessary, to certain nonconsolidated dialysis businesses that we manage and in which we own a noncontrolling equity interest or which are wholly-owned by third parties. For additional information see Note 16 to the consolidated financial statements.\nAdditionally, we expect our 2025 capital expenditures to be consistent with our 2024 capital expenditures.\nIn addition, we have approximately $39 million of existing long-term income tax liabilities for unrecognized tax benefits, including interest and penalties, which are excluded from the table above as reasonably reliable estimates of their timing cannot be made.\nOn March 5, 2024, we entered into four separate purchase agreements with Fresenius Medical Care AG and its affiliates to acquire their dialysis service operations in Chile, Ecuador, Colombia and Brazil. The Chile, Ecuador and Colombia transactions closed during 2024. The Brazil transaction is expected to close mid-year 2025 and remains subject to customary closing conditions and regulatory approval. The expected cash payment for this remaining transaction is approximately $100 million, subject to certain customary adjustments.\n76\nContingencies\nThe information in Note 15 to the consolidated financial statements included in this report is incorporated by reference in response to this item.\nCritical accounting policies, estimates and judgments\nOur consolidated financial statements and accompanying notes are prepared in accordance with United States generally accepted accounting principles. These accounting principles require us to make estimates, judgments and assumptions that affect the reported amounts of revenues, expenses, assets, liabilities, contingencies and noncontrolling interests subject to put provisions (redeemable equity interests). All significant estimates, judgments and assumptions are developed based on the best information available to us at the time made and are regularly reviewed and updated when necessary. Actual results will generally differ from these estimates, and such differences may be material. Changes in estimates are reflected in our financial statements in the period of change based upon on-going actual experience trends or subsequent settlements and realizations depending on the nature and predictability of the estimates and contingencies. Certain accounting estimates, including those concerning revenue recognition and accounts receivable, fair value estimates for goodwill and noncontrolling interests, accounting for income taxes, and loss contingencies are considered to be critical to evaluating and understanding our financial results because they involve inherently uncertain matters and their application requires the most difficult and complex judgments and estimates. For additional information, see Part IV Item 15, \"\nExhibits, Financial Statement Schedules\" – Note 1 – \"Organization and summary of significant accounting policies\n\" as referred from Part II Item 8, \"\nFinancial Statements and Supplementary Data\n.\"\nRevenue recognition and accounts receivable for our U.S. dialysis patient services\n. There are significant estimating risks associated with the amount of U.S. dialysis patient service revenue that we recognize in a given reporting period. Payment rates are often subject to significant uncertainties related to wide variations in the coverage terms of the commercial healthcare plans under which we receive payments. In addition, ongoing insurance coverage changes, geographic coverage differences, differing interpretations of contract coverage, and other payor issues complicate the billing and collection process. The measurement and recognition of revenue requires the use of estimates of the amounts that will ultimately be realized considering, among other items, retroactive adjustments that may be associated with regulatory reviews, audits, billing reviews and other matters.\nRevenues associated with Medicare and Medicaid programs are recognized based on (a) the payment rates that are established by statute or regulation for the portion of the payment rates paid by the government payor (e.g., 80% for Medicare patients) and (b) for the portion not paid by the primary government payor, the estimated amounts that will ultimately be collectible from other government programs providing secondary coverage (e.g., Medicaid secondary coverage), the patient’s commercial health plan secondary coverage, or the patient. Our dialysis-related reimbursements from Medicare are subject to certain variations under Medicare’s single bundled payment rate system whereby our reimbursements can be adjusted for certain patient characteristics and other variable factors. Our revenue recognition depends upon our ability to effectively capture, document and bill for Medicare’s base payment rate and these other factors. In addition, as a result of the potential range of variations that can occur in our dialysis-related reimbursements from Medicare under the single bundled payment rate system, our revenue recognition is subject to a greater degree of estimating risk.\nCommercial healthcare plans, including contracted managed-care payors, are billed at our usual and customary rates; however, revenue is recognized based on estimated net realizable revenue for the services provided. Net realizable revenue is estimated based on contractual terms for the patients covered under commercial healthcare plans with which we have formal agreements, non-contracted commercial healthcare plan coverage terms if known, estimated secondary collections, historical collection experience, historical trends of refunds and payor payment adjustments (retractions), inefficiencies in our billing and collection processes that can result in denied claims for payments, the estimated timing of collections, changes in our expectations of the amounts that we expect to collect and regulatory compliance matters. Determining applicable primary and secondary coverage for our approximately 200,800 U.S. dialysis patients at any given point in time, together with the changes in patient coverages that occur each month, requires complex, resource-intensive processes. Collections, refunds and payor retractions typically continue to occur for up to three years or longer after services are provided.\nWe generally expect the range of our U.S. dialysis revenue estimating risk to be within 1% of revenue, which can represent as much as approximately 5% of our U.S. dialysis business’s operating income and adjusted operating income. Changes in estimates are reflected in the then-current financial statements based on on-going actual experience trends, or subsequent settlements and realizations depending on the nature and predictability of the estimates and contingencies. Changes in revenue estimates for prior periods are separately disclosed and reported if material to the current reporting period and longer term trend analyses, and have not been significant.\nRevenues for laboratory services, which are integrally related to our dialysis services, are recognized in the period services are provided at the estimated net realizable amounts to be received.\n77\nCertain fair value estimates.\n Fair value measurements and estimates affect, or potentially affect, a variety of elements in the Company's financial statements. Two of the elements most significantly impacted by fair value estimates are the Company's goodwill impairment assessments and remeasurements of its noncontrolling interests subject to put provisions balance.\nGoodwill is not amortized, but is assessed for impairment at least annually, or when changes in circumstances warrant. An impairment charge is recorded when and to the extent a reporting unit's carrying amount is determined to exceed its estimated fair value. Changes in circumstance that may trigger a goodwill impairment assessment for one of our business units can include, among others, changes in the legal environment, addressable market, business strategy, development or business plans, reimbursement structure or rates, operating performance, future prospects, relationships with partners, interest rates and/or market value indications for the subject business. We use a variety of factors to assess changes in the financial condition, future prospects and other circumstances for businesses subject to goodwill impairment assessment. However, these assessments and the related valuations can involve significant uncertainties and require significant judgment on various matters.\nThe Company is also required to remeasure its noncontrolling interests subject to put provisions to estimated fair value each reporting period. These estimates also require substantive judgment on meaningful uncertainties concerning this significant balance. See Notes 16 and 23 to the consolidated financial statements for a summary of the Company's approach to these valuations, the variables and uncertainties involved, and the sensitivity of these valuations to changes in a primary aggregate valuation metric.\nAccounting for income taxes\n. Our income tax expense, deferred tax assets and liabilities, and liabilities for unrecognized tax benefits reflect management’s best assessment of estimated current and future taxes to be paid. We are subject to income taxes in the United States and numerous state and foreign jurisdictions, and changes in tax laws or regulations may be proposed or enacted that could adversely affect our overall tax liability. The actual impact of any such laws or regulations could be materially different from our current estimates.\nSignificant judgments and estimates are required in determining our consolidated income tax expense. Deferred income taxes arise from temporary differences between the tax basis of assets and liabilities and their reported amounts in the financial statements, which will result in taxable or deductible amounts in the future. In evaluating our ability to recover our deferred tax assets within the jurisdictions from which they arise, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies, results of recent operations, and assumptions about the amount of future federal, state, and foreign pre-tax operating income adjusted for items that do not have tax consequences. The assumptions about future taxable income require significant judgments and are consistent with the plans and estimates we use to manage the underlying businesses. To the extent that recovery is not likely, a valuation allowance is established. The allowance is regularly reviewed and updated for changes in circumstances that would cause a change in judgment about the realizability of the related deferred tax assets.\nLoss contingencies. \nAs discussed in Notes 1 and 15 to the consolidated financial statements, we operate in a highly regulated industry and are party to various lawsuits, claims, qui tam suits, governmental investigations and audits (including, without limitation, investigations or other actions resulting from our obligation to self-report suspected violations of law), contract disputes and other legal proceedings. Assessments of such matters can involve a series of complex judgments about future events and can rely heavily on estimates and assumptions. We record accruals for loss contingencies on such matters to the extent that we determine an unfavorable outcome is probable and the amount of the loss can be reasonably estimated. See Note 15 to the consolidated financial statements included in this report for further discussion.\nSignificant new accounting standards\nSee Note 1 to the consolidated financial statements included in this report for information regarding certain recent financial accounting standards that have been issued by the Financial Accounting Standards Board (FASB).\n78",
  "item2": null
}