{
  "source_file": "dva-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n    \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nForward-looking statements\nThis Quarterly Report on Form 10-Q, including this Management’s Discussion and Analysis of Financial Condition and Results of Operations, contains statements that are forward-looking statements within the meaning of the federal securities laws and as such are intended to be covered by the safe harbor for \"forward-looking statements\" provided by the Private Securities Litigation Reform Act of 1995. These forward-looking statements could include, among other things, statements about our balance sheet and liquidity, our expenses, revenues, billings and collections, patient census, the impact of the \ncybersecurity\n incident experienced by the Company in 2025, the potential impact of the federal government shutdown and the One Big Beautiful Bill Act (OBBBA) on our business, including with respect to federal funding of Medicaid and other government programs, availability or cost of supplies, including without limitation the impact of evolving trade policies and tariffs and any reduction in clinical and other supplies due to any disruptions experienced by third party vendors, including with respect to our ability to provide home dialysis services, treatment volumes, mix expectation, such as the percentage or number of patients under commercial insurance, including potential impacts to such mix as a result of the federal government shutdown or U.S. administration policies, current macroeconomic, marketplace and labor market conditions, and overall impact on our patients and teammates, as well as other statements regarding our future operations, financial condition and prospects, capital allocation plans, expenses, cost saving initiatives, other strategic initiatives, use of contract labor, government and commercial payment rates, expectations related to value-based care (VBC), integrated kidney care (IKC), Medicare Advantage (MA) plan enrollment and our international operations, expectations regarding increased competition and marketplace changes, including those related to new or potential entrants in the dialysis and pre-dialysis marketplace and the potential impact of innovative technologies, drugs, or other treatments on the dialysis industry, and expectations regarding our share repurchase program. All statements in this report, other than statements of historical fact, are forward-looking statements. Without limiting the foregoing, statements including the words \"expect,\" \"intend,\" \"will,\" \"could,\" \"plan,\" \"anticipate,\" \"believe\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are based on DaVita's current expectations and are based solely on information available as of the date of this report. DaVita undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of changed circumstances, new information, future events or otherwise, except as may be required by law. Actual future events and results could differ materially from any forward-looking statements due to numerous factors that involve substantial known and unknown risks and uncertainties. These risks and uncertainties include, among other things:\n•\nexternal conditions, including those related to general economic, marketplace and global health conditions, including without limitation, the impact of global events and political or governmental volatility; the impact of the domestic political environment and related developments on the current healthcare marketplace, our patients and on our business; the continuing impact of infectious diseases on our financial condition and the chronic kidney disease (CKD) population and our patient population; supply chain challenges and disruptions, including without limitation with respect to certain key services, critical clinical supplies and equipment we obtain from third parties, and including any impacts on our supply chain and cost of supplies as a result of natural disasters or evolving trade policies, including tariffs; the potential impact on our patients and industry of new or potential entrants in the dialysis and pre-dialysis marketplace and innovative technologies, drugs, or other treatments, including our ability to successfully implement new technologies or treatments in our business; elevated teammate turnover or labor costs; the impact of continued increased competition from dialysis providers and others; and our ability to respond to challenging U.S. and global economic and marketplace conditions, including, among other things, our ability to successfully identify cost saving opportunities;\n•\nthe concentration of profits generated by higher-paying commercial payor plans for which there is continued downward pressure on average realized payment rates; a reduction in the number or percentage of our patients under commercial plans, including, without limitation, as a result of healthcare, immigration or other policies implemented by the U.S. administration, continuing legislative efforts to restrict or prohibit the use and/or availability of charitable premium assistance, or as a result of payors implementing restrictive plan designs; \n•\nrisks arising from potential changes in or new laws, regulations or requirements applicable to us, including, without limitation, the federal government shutdown, OBBBA and those related to trade policy, healthcare, privacy, antitrust matters, and acquisition, merger, joint venture or similar transactions and/or labor matters, and potential impacts of changes in interpretation or enforcement thereof or related litigation impacting, among other things, coverage or reimbursement rates for our services or the number of patients enrolled in or that select higher-paying commercial plans, and the risk that we make incorrect assumptions about how our patients will respond to any such developments; \n•\nour ability to successfully implement our strategies with respect to IKC and VBC initiatives and home based dialysis in the desired time frame and in a complex, dynamic and highly regulated environment; \n23\n•\na reduction in government payment rates under the Medicare End Stage Renal Disease program, state Medicaid or other government-based programs and the impact of the MA benchmark structure;\n•\nour reliance on significant suppliers, service providers and other third party vendors to provide key support to our business operations and enable our provision of services to patients, including, among others, suppliers of certain pharmaceuticals, administrative or other services or critical clinical products; and risks resulting from a closure, reduction or other disruption in the services or products provided to us by such suppliers, service providers and third party vendors;\n•\nnoncompliance by us or our business associates with any privacy or security laws or any security breach by us or a third party, such as the \ncybersecurity\n incident experienced by the Company in 2025, including, among other things, any such non-compliance or breach involving the misappropriation, loss or other unauthorized use or disclosure of confidential information;\n•\nlegal and compliance risks, such as compliance with complex, and at times, evolving government regulations and requirements, and with additional laws that may apply to our operations as we expand geographically or enter into new lines of business;\n•\nour ability to attract, retain and motivate teammates, including key leadership personnel, and our ability to manage potential disruptions to our business and operations, including potential work stoppages, operating cost increases or productivity decreases whether due to union organizing activities, legislative or other changes, demand for labor, volatility and uncertainty in the labor market, the current challenging and highly competitive labor market conditions, including due to the ongoing nationwide shortage of skilled clinical personnel, or other reasons;\n•\nchanges in pharmaceutical practice patterns, reimbursement and payment policies and processes, or pharmaceutical pricing, including with respect to oral phosphate binders, among other things; \n•\nour ability to develop and maintain relationships with physicians and hospitals, changing affiliation models for physicians, and the emergence of new models of care or other initiatives that, among other things, may erode our patient base and impact reimbursement rates;\n•\nour ability to complete and successfully integrate and operate acquisitions, mergers, dispositions, joint ventures or other strategic transactions on terms favorable to us or at all; and our ability to continue to successfully expand our operations and services in markets outside the United States, or to businesses or products outside of dialysis services;\n•\nthe variability of our cash flows, including, without limitation, any extended billing or collections cycles including, without limitation, due to defects or operational issues in our billing systems, the impact of the \ncybersecurity\n incident experienced by the Company in 2025 or defects or operational issues in the billing systems or services of third parties on which we rely; the risk that we may not be able to generate or access sufficient cash in the future to service our indebtedness or to fund our other liquidity needs;\n•\nthe effects on us or others of natural or other disasters, public health crises or severe adverse weather events such as hurricanes, earthquakes, fires or flooding;\n•\nfactors that may impact our ability to repurchase stock under our share repurchase program and the timing of any such stock repurchases, as well as any use by us of a considerable amount of available funds to repurchase stock; \n•\nour goals and disclosures related to environmental, social and governance (ESG) matters, including, among other things, evolving regulatory requirements affecting ESG standards, measurements and reporting requirements\n; \nand\n•\nthe other risk factors, trends and uncertainties set forth in our Annual Report on Form 10-K for the year ended December 31, 2024 (2024 10-K), and the risks and uncertainties discussed in any subsequent reports that we file or furnish with the Securities and Exchange Commission (SEC) from time to time. \nThe following should be read in conjunction with our condensed consolidated financial statements.\n24\nCompany Overview\nOur principal business is to provide dialysis and related lab services to patients in the United States, which we refer to as our U.S. dialysis business. We also operate our U.S. integrated kidney care (IKC) business, our U.S. other ancillary services, and our international operations, which we collectively refer to as our ancillary services, as well as our corporate administrative support functions. Our U.S. dialysis business is a leading provider of kidney dialysis services in the U.S. for patients suffering from chronic kidney failure, also known as end stage renal disease (ESRD) or end stage kidney disease (ESKD).\nWe assess our revenue and operating performance for our U.S. dialysis business based upon several principal metrics including, among others, treatment volume, revenue per treatment and patient care costs. Each of these metrics may be impacted by a number of factors that change from period to period and over time. For example, treatment volumes may be impacted by, among other things, mortality levels, missed treatment rates and admission rates. Revenue per treatment may be impacted by, among other things, rate changes, mix of patients with commercial plans and government programs as primary payor, timing of collections and seasonal factors such as patients meeting health plan co-insurance and deductibles. Patient care costs may be impacted by, among other things, labor market conditions and cost trends in pharmaceuticals and other medical supplies. We have set forth a discussion of such factors below, and we believe that information related to changes in these metrics from period to period allows investors to assess the performance of the business.\nExternal Conditions\nDevelopments in external conditions, including those related to general economic, marketplace, environmental and global health conditions, have directly and indirectly impacted the Company and in the future could have a material adverse impact on our patients, teammates, physician partners, suppliers, business, operations, reputation, financial condition, results of operations, share price, cash flows and/or liquidity. Many of these external factors and conditions are interrelated, including, among other things, inflation, interest rate volatility and other economic conditions, labor market conditions, wage pressures, the increased mortality rates of our patients and other ESKD or chronic kidney disease (CKD) patients, supply chain challenges and the potential impact and application of innovative technologies, drugs or other treatments. Certain of these impacts could be further intensified by: concurrent global events that have continued to drive sociopolitical, geopolitical and economic uncertainty; severe weather events and other natural disasters; the impact of healthcare, immigration, trade and other policies implemented by the U.S. administration; and the impact of the ongoing federal government shutdown as further described below. For additional discussion of general economic, marketplace and global health conditions that could impact our business, see Part I Item 1. \"\nBusiness\n\" and Part I Item 1A.\n \n\"\nRisk Factors\n\" in our 2024 10-K.\nIn the third quarter of 2025, treatment per day volumes slightly decreased compared to the second quarter. For the full year to date, we have experienced a negative impact on revenue and treatment volume due to, among other things, the cybersecurity incident described below, an elevated number of missed treatments and a particularly severe flu season. In addition, admission rates, treatment volumes, future revenues and non-acquired growth, among other things, could continue to be negatively impacted over time to the extent that the ESKD and CKD populations experience sustained elevated mortality levels. These mortality levels could be influenced by, among other things, the impact of infectious diseases on our patient population and the availability and use of vaccines, treatments and therapies as described in Part I Item 1A.\n \n\"\nRisk Factors\n\" of our 2024 10-K, and the magnitude of these cumulative impacts could have a material adverse impact on our results of operations, financial condition and cash flows.\nGlobal economic conditions and political and regulatory developments, including, among other things, inflationary pressures and U.S. administration policies have increased, and may continue to increase, our expenses. For example, staffing and labor costs have increased during the year, due to, among other factors, the continuation of inflationary conditions. While the cumulative impact of any increased staffing, labor, and supply costs and other expenses could be material, we have seen improvements in certain labor related costs such as training and productivity, and we expect to continue to see improvements in labor-related costs due to, among other things, reduced turnover. Our industry has also experienced increased union organizing activities. For example, union petitions have been filed in ten of our clinics in California and nine of these petitions are in different stages of the voting process and have been subject to legal challenges. For additional details on the risks related to rising labor costs and union organizing activities, see the discussion in Part I Item 1A. \"\nRisk Factors\n\" of our 2024 10-K under the headings, \"\nOur business is labor intensive...\n\" and \"\nExternal conditions, including those related to general economic, marketplace and global health conditions...\n\"\nWe believe that the aforementioned developments and general economic, marketplace and global health conditions will continue to impact the Company in the future. Their ultimate impact depends on future developments that are highly uncertain and difficult to predict.\n25\nLegislative and Regulatory Developments\nOn October 1, 2025, the U.S. federal government entered a shutdown period due to the lack of enacted appropriations or continuing resolution legislation by Congress for the 2026 fiscal year. Funding for mandatory spending programs, such as Medicare and Medicaid, is authorized separately from the annual appropriations process and therefore, we would expect payments under these programs to continue without impact from the shutdown. However, a prolonged shutdown may result in reductions in force or terminations of staff at key agencies such as the Department of Health and Human Services and the Centers for Medicare & Medicaid Services (CMS). These and other government agencies have already experienced staff reductions during the year, and the cumulative impact of staff reductions may, among other things, result in delays in Medicare enrollment, coverage verification, licensing and credentialing approval, issuance or finalization of regulations, and may limit the availability of administrative and legal support that, among other things, delays claims resolution or similar processes. Any of the foregoing may have an adverse impact on our business. \nThe current government shutdown also introduces significant uncertainty regarding the legislative calendar and the potential for Congress to address the extension of the enhanced premium tax credits for individuals who purchase health insurance through health insurance exchanges established under the Patient Protection and Affordable Care Act and Health Care Reconciliation Act of 2010, as amended (collectively, the ACA) that are set to expire at the end of 2025. Failure to extend these credits would likely reduce enrollment in health insurance on marketplaces developed under the ACA and may lead to a decrease in the number of our patients with commercial health insurance. In the event such a decrease occurs, it would have an adverse impact on our business, results of operations, financial condition, and cash flows. For additional information regarding the impact of the potential risks to us related to federal funding of government programs, the expiration of enhanced premium tax credits, and related regulatory developments, as well as information on the potential risks related to any decrease in the number of our patients who are covered by commercial insurance, see Part I Item 1. \"\nBusiness—Government Regulation\"\n and Part I Item 1A. \"\nRisk Factors\"\n of our 2024 Form 10-K.\nCybersecurity Incident\nAs previously disclosed, on April 12, 2025, we became aware of a cybersecurity incident that impacted certain elements of our network. While the incident disrupted our operations, we have continued dialysis care and have restored all major functions. \nWe are aware of the exfiltration of\n certain\n data as part of the cybersecurity incident, including certain Personally Identifiable Information and/or Protected Health Information from our DaVita Laboratory line of business. We started the notice process on August 1, 2025 and completed the process on August 15, 2025, giving notice to applicable regulators, and potentially involved patients, former patients and the estates of former patients as well as public notice. \nWe have incurred, and expect to continue to incur, expenses in connection with the investigation and remediation activities related to this incident, including in connection with litigation that has been filed or may in the future be filed related to the incident as well as any potential regulatory investigations. In addition, it is possible that future risks and uncertainties resulting from the incident, including risks related to impacted data, litigation, reputational harm, and regulatory actions could adversely affect our business, results of operations, financial condition and cash flows. At this time we are unable to predict the extent of these and other potential liabilities or consequences that may arise from this incident.\nThe cybersecurity incident had an adverse impact on our billing and revenue collection cycles as well as our patient census. These impacts have had, and we expect will continue to have, an adverse impact on our revenue per treatment and treatment volumes for the full year. We do not yet know the full impact of the \ncybersecurity\n incident, including how much of the financial impact will be covered by insurance.\nFor a discussion of the risks associated with privacy and security incidents and risks associated with our information systems or those of our third party service providers upon which we rely, see the discussions in Part I Item 1A. \"\nRisk Factors\n\" of our 2024 10-K under the headings, \"\nPrivacy and information security laws are complex\n…\" and \"\nFailing to effectively maintain, operate or upgrade our information systems or those of third-party service providers upon which we rely...\n\". These risks include, among other things, business or other operational interruptions that may impact, among other things, our billing or clinical systems; the loss, compromise or corruption of data; systems outages; litigation or regulatory actions under privacy and security laws, all of which could have a material adverse effect on our business, results of operations, financial condition and cash flows, or materially harm our reputation.\nFinancial Results\nThe discussion below includes analysis of our financial condition and results of operations for the three months ended September 30, 2025 compared to the three months ended June 30, 2025, and the year-to-date periods for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024.\n26\nConsolidated results of operations\nThe following tables summarize our revenues, operating income (loss) and adjusted operating income (loss) by line of business. See the discussion of our results for each line of business following the tables. When multiple drivers are identified in the following discussion of results, they are listed in order of magnitude:\nThree months ended\nQ3 2025 vs. Q2 2025\nSeptember 30, \n2025\nJune 30, \n2025\nAmount\nPercent\n(dollars in millions)\nRevenues:\nU.S. dialysis\n$\n2,980 \n$\n2,913 \n$\n67 \n2.3 \n%\nOther — Ancillary services\n455 \n486 \n(31)\n(6.4)\n%\nElimination of intersegment revenues\n(15)\n(20)\n5 \n25.0 \n%\nTotal consolidated revenues\n$\n3,420 \n$\n3,380 \n$\n40 \n1.2 \n%\nOperating income (loss):\nU.S. dialysis\n$\n530 \n$\n523 \n$\n7 \n1.3 \n%\nOther — Ancillary services\n1 \n57 \n(56)\n(98.2)\n%\nCorporate administrative support\n(26)\n(42)\n16 \n38.1 \n%\nOperating income\n$\n506 \n$\n538 \n$\n(32)\n(5.9)\n%\nAdjusted operating income (loss)\n(1)\n:\nU.S. dialysis\n$\n542 \n$\n536 \n$\n6 \n1.1 \n%\nOther — Ancillary services\n1 \n57 \n(56)\n(98.2)\n%\nCorporate administrative support\n(26)\n(42)\n16 \n38.1 \n%\nAdjusted operating income\n$\n517 \n$\n551 \n$\n(34)\n(6.2)\n%\n    \nCertain columns, rows or percentages may not sum due to the presentation of rounded numbers.\n(1)\nFor a reconciliation of adjusted operating income (loss) by reportable segment, see the \"\nReconciliations of Non-GAAP measures\n\" section below.\nNine months ended\nYTD Q3 2025 vs. YTD Q3 2024\nSeptember 30, \n2025\nSeptember 30, \n2024\nAmount\nPercent\n(dollars in millions)\nRevenues:\nU.S. dialysis\n$\n8,717 \n$\n8,503 \n$\n214 \n2.5 \n%\nOther — Ancillary services\n1,355 \n1,080 \n275 \n25.5 \n%\nElimination of intersegment revenues\n(49)\n(63)\n14 \n22.2 \n%\nTotal consolidated revenues\n$\n10,023 \n$\n9,521 \n$\n502 \n5.3 \n%\nOperating income (loss):\nU.S. dialysis\n$\n1,529 \n$\n1,625 \n$\n(96)\n(5.9)\n%\nOther — Ancillary services\n55 \n(16)\n71 \n443.8 \n%\nCorporate administrative support\n(101)\n(84)\n(17)\n(20.2)\n%\nOperating income\n$\n1,483 \n$\n1,525 \n$\n(42)\n(2.8)\n%\nAdjusted operating income (loss)\n(1)\n:\nU.S. dialysis\n$\n1,554 \n$\n1,590 \n$\n(36)\n(2.3)\n%\nOther — Ancillary services\n55 \n(16)\n71 \n443.8 \n%\nCorporate administrative support\n(101)\n(84)\n(17)\n(20.2)\n%\nAdjusted operating income\n$\n1,508 \n$\n1,490 \n$\n18 \n1.2 \n%\nCertain columns, rows or percentages may not sum due to the presentation of rounded numbers.\n(1)\nFor a reconciliation of adjusted operating income (loss) by reportable segment, see the \"\nReconciliations of Non-GAAP measures\n\" section below.\n27\nU.S. dialysis results of operations \nTreatment volume:\nThree months ended\nQ3 2025 vs. Q2 2025\nSeptember 30, \n2025\nJune 30, \n2025\nAmount\nPercent\nDialysis treatments\n7,242,725 \n7,186,217 \n56,508 \n0.8 \n%\nAverage treatments per day\n91,680 \n92,131 \n(451)\n(0.5)\n%\nTreatment days\n79.0 \n78.0 \n1.0 \n1.3 \n%\nNormalized non-acquired treatment growth\n(1)\n(0.6)\n%\n(0.8)\n%\nCertain columns, rows or percentages may not sum due to the presentation of rounded numbers.\n(1)\nNormalized non-acquired treatment growth reflects year over year growth in treatment volume, adjusted to exclude acquisitions and other similar transactions, and further adjusted to normalize for the number and mix of treatment days in a given quarter versus the prior year quarter.\nNine months ended\nYTD Q3 2025 vs. YTD Q3 2024\nSeptember 30, \n2025\nSeptember 30, \n2024\nAmount\nPercent\nDialysis treatments\n21,469,460 \n21,767,740 \n(298,280)\n(1.4)\n%\nAverage treatments per day\n91,868 \n92,787 \n(919)\n(1.0)\n%\nTreatment days\n233.7 \n234.6 \n(0.9)\n(0.4)\n%\nCertain columns, rows or percentages may not sum due to the presentation of rounded numbers.\nOur U.S. dialysis operating revenues and expenses are directly driven by treatment volume. The increase in our U.S. dialysis treatments for the third quarter of 2025 from the second quarter of 2025 was primarily driven by an increase in treatment days. The decrease in our U.S. dialysis treatments for the nine months ended September 30, 2025 from the nine months ended September 30, 2024 was primarily driven by a decrease in average treatments per day due to higher mortality and missed treatments from a more severe flu season, as well as fewer treatment days.\nRevenues:\nThree months ended\nQ3 2025 vs. Q2 2025\nSeptember 30, \n2025\nJune 30, \n2025\nAmount\nPercent\n(dollars in millions, except per treatment data)\nTotal revenues\n$\n2,980 \n$\n2,913 \n$\n67 \n2.3 \n%\nAverage patient service revenue per treatment\n$\n410.59 \n$\n404.58 \n$\n6.01 \n1.5 \n%\nCertain columns, rows or percentages may not sum due to the presentation of rounded numbers.\nNine months ended\nYTD Q3 2025 vs. YTD Q3 2024\nSeptember 30, \n2025\nSeptember 30, \n2024\nAmount\nPercent\n(dollars in millions, except per treatment data)\nTotal revenues\n$\n8,717 \n$\n8,503 \n$\n214 \n2.5 \n%\nAverage patient service revenue per treatment\n$\n405.15 \n$\n389.79 \n$\n15.36 \n3.9 \n%\nCertain columns, rows or percentages may not sum due to the presentation of rounded numbers.\nU.S. dialysis average patient service revenue per treatment for the third quarter of 2025 compared to the second quarter of 2025 increased primarily due to an increase in average reimbursement rates, and other normal fluctuations, as well as an increase in volume of phosphate binders. These increases were partially offset by changes in payor mix.\nU.S. dialysis average patient service revenue per treatment for the nine months ended September 30, 2025 increased compared to the nine months ended September 30, 2024 primarily driven by the incorporation of phosphate binders into the ESRD Prospective Payment System (ESRD PPS) bundle, as further described below, Medicare base rate and other annual rate increases, as well as other normal fluctuations. \n28\nOn January 1, 2025, phosphate binders, a drug class taken orally by many ESKD patients to reduce absorption of dietary phosphate, were incorporated into the ESRD PPS bundled payment. Phosphate binders are not included in the ESRD PPS base rate at this time and are reimbursed through a Transitional Drug Add-on Payment Adjustment (TDAPA). During the TDAPA period, Medicare payments for phosphate binders are based on the average sales price increased by a fixed monthly amount of $36.41 for incremental operational costs. The TDAPA period is expected to be in place for a period of at least two years.\nIn June 2025, CMS issued a proposed rule to update the Medicare ESRD PPS payment rate and policies for calendar year 2026. CMS estimates that the overall impact of the proposed rule will increase ESRD freestanding facilities’ average reimbursement by 1.9% in 2026.\nOperating expenses and charges:\nThree months ended\nQ3 2025 vs. Q2 2025\nSeptember 30, \n2025\nJune 30, \n2025\nAmount\nPercent\n(dollars in millions, except per treatment data)\nPatient care costs\n$\n1,981 \n$\n1,928 \n$\n53 \n2.7 \n%\nGeneral and administrative\n322 \n312 \n10 \n3.2 \n%\nDepreciation and amortization\n156 \n157 \n(1)\n(0.6)\n%\nEquity investment income\n(10)\n(7)\n(3)\n(42.9)\n%\nTotal operating expenses and charges\n$\n2,450 \n$\n2,391 \n$\n59 \n2.5 \n%\nPatient care costs per treatment\n$\n273.54 \n$\n268.36 \n$\n5.18 \n1.9 \n%\nCertain columns, rows or percentages may not sum due to the presentation of rounded numbers.\nNine months ended\nYTD Q3 2025 vs. YTD Q3 2024\nSeptember 30,\n2025\nSeptember 30, \n2024\nAmount\nPercent\n(dollars in millions, except per treatment data)\nPatient care costs\n$\n5,823 \n$\n5,572 \n$\n251 \n4.5 \n%\nGeneral and administrative\n917 \n858 \n59 \n6.9 \n%\nDepreciation and amortization\n470 \n504 \n(34)\n(6.7)\n%\nEquity investment income\n(22)\n(20)\n(2)\n(10.0)\n%\nGain on changes in ownership interests\n— \n(35)\n35 \n100.0 \n%\nTotal operating expenses and charges\n$\n7,188 \n$\n6,878 \n$\n310 \n4.5 \n%\nPatient care costs per treatment\n$\n271.23 \n$\n255.96 \n$\n15.27 \n6.0 \n%\nCertain columns, rows or percentages may not sum due to the presentation of rounded numbers.\nCharges impacting operating income\nCybersecurity incident-related charges. \nDuring the second quarter of 2025, we experienced a cybersecurity incident that impacted certain elements of our network and resulted in a temporary disruption of our operations, as described above. As a result of our efforts to remediate the incident and restore systems with the assistance of third-party cybersecurity professionals, we incurred general and administrative charges of approximately $11.7 million during the third quarter of 2025. During the nine months ended September 30, 2025, we incurred patient care costs of approximately $1.0 million and general and administrative expenses of approximately $24.2 million related to the incident. These costs do not include the impact related to business interruption on our results.\nPatient care costs.\n U.S. dialysis patient care costs per treatment for the third quarter of 2025 increased from the second quarter of 2025 primarily due to increased compensation expense, including increased wage rates, as well as increases in pharmaceutical costs, principally due to volume of phosphate binders, and health benefit expense. These increases were partially offset by decreases in insurance costs.\nU.S. dialysis patient care costs per treatment for the nine months ended September 30, 2025 increased from the nine months ended September 30, 2024 primarily due to increases in pharmaceutical costs, principally due to the administration of phosphate binders, as described above, and compensation expenses, including increased wage rates, as well as increases in medical supplies expense.\n29\nGeneral and administrative expenses. \nU.S. dialysis general and administrative expenses in the third quarter of 2025 increased from the second quarter of 2025 primarily due to increased IT-related costs.\nU.S. dialysis general and administrative expenses for the nine months ended September 30, 2025 increased from the nine months ended September 30, 2024 due to increases in IT-related costs and increases in costs related to the cybersecurity incident, as described above, as well as increases in compensation expenses, including increased wage rates and headcount. These increases were partially offset by decreased center closure costs.\nDepreciation and amortization. \nDepreciation and amortization expense is directly impacted by the number of our dialysis centers and the information technology that we develop and acquire. U.S. dialysis depreciation and amortization expenses in the third quarter of 2025 were relatively flat compared to the second quarter of 2025.\nU.S. dialysis depreciation and amortization expenses for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 decreased primarily due to decreases in capital IT projects as well as decreases in accelerated depreciation related to center closures.\nEquity investment income. \nU.S. dialysis equity investment income for the third quarter of 2025 compared to the second quarter of 2025 and for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 increased due to increased profitability at certain nonconsolidated dialysis partnerships. \nGain on changes in ownership interests.\n During the first quarter of 2024, we acquired a controlling interest in a previously nonconsolidated dialysis partnership for which we recognized a non-cash gain of $35.1 million on our prior investment upon consolidation.\nOperating income and adjusted operating income:\nThree months ended\nQ3 2025 vs. Q2 2025\nSeptember 30, \n2025\nJune 30, \n2025\nAmount\nPercent\n(dollars in millions)\nOperating income\n$\n530 \n$\n523 \n$\n7 \n1.3 \n%\nAdjusted operating income\n(1)\n$\n542 \n$\n536 \n$\n6 \n1.1 \n%\nNine months ended\nYTD Q3 2025 vs. YTD Q3 2024\nSeptember 30,\n2025\nSeptember 30, \n2024\nAmount\nPercent\n(dollars in millions)\nOperating income\n$\n1,529 \n$\n1,625 \n$\n(96)\n(5.9)\n%\nAdjusted operating income\n(1)\n$\n1,554 \n$\n1,590 \n$\n(36)\n(2.3)\n%\n(1)\nFor a reconciliation of adjusted operating income by reportable segment, see the \"\nReconciliations of Non-GAAP measures\n\" section below.\nU.S. dialysis operating income for the third quarter of 2025 and the second quarter of 2025 were negatively impacted by the cybersecurity incident-related charges, as described above. U.S. dialysis operating income and adjusted operating income for the third quarter of 2025 increased compared to the second quarter of 2025 as a result of all factors discussed above.\nU.S. dialysis operating income for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 was negatively impacted by the cybersecurity incident-related charges in 2025 and gain on changes in ownership interests in the first quarter of 2024, each described above. U.S. dialysis operating income and adjusted operating income for the nine months ended September 30, 2025 decreased compared to the nine months ended September 30, 2024 as a result of all factors discussed above.\n30\nOther—Ancillary services\nOur other operations include ancillary services that are primarily aligned with our core business of providing dialysis services to our network of patients. As of September 30, 2025, these consisted principally of our U.S. IKC business, certain U.S. other ancillary businesses (including our clinical research programs, transplant software business, and venture investment group), and our international operations. In the first quarter of 2025, we reallocated the revenues and costs associated with an internal software product from the U.S. IKC business to the U.S. other ancillary business. Prior periods have been recast to reflect this change.\nAs of September 30, 2025, DaVita IKC provided integrated care and disease management services to approximately 64,900 patients in risk-based integrated care arrangements and to an additional 9,400 patients in other integrated care arrangements. We also expect to add additional service offerings to our business and pursue additional strategic initiatives in the future as circumstances warrant, which could include, among other things, healthcare services not related to kidney disease.\nFor a discussion of the risks related to IKC and our ancillary services, see the discussion in the risk factors in Part I Item 1A. \"\nRisk Factors\n\" of our 2024 10-K under the headings, \"\nThe U.S. integrated kidney care, U.S. other ancillary services and international operations that we operate or invest in now or in the future...\" \nand\n \"If we are not able to successfully implement our strategy with respect to our integrated kidney care and value-based care initiatives...\"\n \nAs of September 30, 2025, our international dialysis operations provided dialysis and administrative services through a total of 585 outpatient dialysis centers located in 14 countries outside of the United States. \nAncillary services results of operations\nThree months ended\nQ3 2025 vs. Q2 2025\nSeptember 30, \n2025\nJune 30, \n2025\nAmount\nPercent\n(dollars in millions)\nRevenues:\nU.S. IKC\n$\n94 \n$\n152 \n$\n(58)\n(38.2)\n%\nU.S. other ancillary\n9 \n8 \n1 \n12.5 \n%\nInternational\n352 \n325 \n27 \n8.3 \n%\nTotal ancillary services revenues\n$\n455 \n$\n486 \n$\n(31)\n(6.4)\n%\nOperating income (loss)\nU.S. IKC\n$\n(21)\n$\n26 \n$\n(47)\n(180.8)\n%\nU.S. other ancillary\n(4)\n(5)\n1 \n20.0 \n%\nInternational\n27 \n36 \n(9)\n(25.0)\n%\nTotal ancillary services operating income\n$\n1 \n$\n57 \n$\n(56)\n(98.2)\n%\nCertain columns, rows or percentages may not sum due to the presentation of rounded numbers.\n31\nNine months ended\nYTD Q3 2025 vs. YTD Q3 2024\nSeptember 30,\n2025\nSeptember 30, \n2024\nAmount\nPercent\n(dollars in millions)\nRevenues:\nU.S. IKC\n$\n352 \n$\n339 \n$\n13 \n3.8 \n%\nU.S. other ancillary\n24 \n23 \n1 \n4.3 \n%\nInternational\n979 \n719 \n260 \n36.2 \n%\nTotal ancillary services revenues\n$\n1,355 \n$\n1,080 \n$\n275 \n25.5 \n%\nOperating income (loss)\nU.S. IKC\n$\n(24)\n$\n(48)\n$\n24 \n50.0 \n%\nU.S. other ancillary\n(14)\n(19)\n5 \n26.3 \n%\nInternational\n(1)\n93 \n51 \n42 \n82.4 \n%\nTotal ancillary services operating income (loss)\n$\n55 \n$\n(16)\n$\n71 \n443.8 \n%\nCertain columns, rows or percentages may not sum due to the presentation of rounded numbers.\n(1)\nThe reported operating income for the nine months ended September 30, 2024 includes foreign currency losses embedded in equity method income recognized from our Asia Pacific (APAC) joint venture, which was consolidated in the fourth quarter of 2024, of approximately $1.8 million.\nOperating income (loss) and adjusted operating income (loss)\nIKC operating loss for the third quarter of 2025 compared to IKC operating income for the second quarter of 2025 was primarily driven by a net decrease in shared savings and decreased revenues related to our special needs plans, partially offset by decreased medical claims expense related to our special needs plans. IKC operating loss for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 decreased, primarily due to a net increase in shared savings and increased revenues related to our special needs plans, partially offset by decreased revenues related to the divestiture of our physician services business in 2024. IKC operating loss was also impacted by decreased operating expenses related to the divestiture of our physician services business in 2024 and medical claims expense related to our special needs plans, partially offset by increased professional fees.\nU.S. other ancillary services operating loss for the third quarter of 2025 remained relatively flat compared to the second quarter of 2025. U.S. other ancillary services operating loss for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 was impacted by a reduction of the earn-out obligations related to our transplant software business in the first quarter of 2025 and decreased compensation expenses.\nInternational operating income for the third quarter of 2025 compared to the second quarter of 2025 was impacted by favorable changes in the fair value of contingent consideration in the second quarter of 2025 associated with a prior acquisition. International operating income for the nine months ended September 30, 2025 increased compared to the nine months ended September 30, 2024 primarily driven by non-acquired and acquired treatment growth, and favorable changes related to the fair value of contingent consideration associated with a prior acquisition.\nCorporate administrative support\nThree months ended\nQ3 2025 vs. Q2 2025\nSeptember 30, \n2025\nJune 30, \n2025\nAmount\nPercent\n(dollars in millions)\nCorporate administrative support\n$\n(26)\n$\n(42)\n$\n16 \n38.1 \n%\nNine months ended\nYTD Q3 2025 vs. YTD Q3 2024\nSeptember 30, \n2025\nSeptember 30, \n2024\nAmount\nPercent\n(dollars in millions)\nCorporate administrative support\n$\n(101)\n$\n(84)\n$\n(17)\n(20.2)\n%\n32\nCorporate administrative support expenses for the third quarter of 2025 compared to the second quarter of 2025 decreased primarily due to a decline in professional fees. Corporate administrative support expenses for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 increased primarily due to increased long-term incentive compensation, partially offset by decreased professional fees.\nCorporate-level charges\nThree months ended\nQ3 2025 vs. Q2 2025\nSeptember 30, \n2025\nJune 30, \n2025\nAmount\nPercent\n(dollars in millions)\nDebt expense\n$\n151 \n$\n146 \n$\n5 \n3.4 \n%\nDebt extinguishment and modification costs\n$\n5 \n$\n— \n$\n5 \n100.0 \n%\nWeighted average effective interest rate\n(1)\n5.70 \n%\n5.71 \n%\n(0.01)\n%\nOther loss, net\n$\n41 \n$\n23 \n$\n18 \n78.3 \n%\nEffective income tax rate\n22.2 \n%\n25.4 \n%\n(3.2)\n%\nEffective income tax rate attributable to DaVita Inc.\n(2)\n31.3 \n%\n31.9 \n%\n(0.6)\n%\nNet income attributable to noncontrolling interests\n$\n90 \n$\n76 \n$\n14 \n18.4 \n%\n(1)\nRepresents our overall weighted average effective interest rate on all debt, including the effect of interest rate caps and amortization of debt discount, premium and deferred financing charges.\n(2)\nFor a reconciliation of our effective income tax rate attributable to DaVita Inc., see the \"\nReconciliations of Non-GAAP measures\n\" section below.\nNine months ended\nYTD Q3 2025 vs. YTD Q3 2024\nSeptember 30, \n2025\nSeptember 30, \n2024\nAmount\nPercent\n(dollars in millions)\nDebt expense\n$\n432 \n$\n332 \n$\n100 \n30.1 \n%\nDebt extinguishment and modification costs\n$\n5 \n$\n20 \n$\n(15)\n(75.0)\n%\nWeighted average effective interest rate\n(1)\n5.67 \n%\n4.84 \n%\n0.83 \n%\nOther loss, net\n$\n82 \n$\n57 \n$\n25 \n43.9 \n%\nEffective income tax rate\n22.4 \n%\n19.3 \n%\n3.1 \n%\nEffective income tax rate attributable to DaVita Inc.\n(2)\n29.6 \n%\n24.1 \n%\n5.5 \n%\nNet income attributable to noncontrolling interests\n$\n235 \n$\n224 \n$\n11 \n4.9 \n%\n(1)\nRepresents our overall weighted average effective interest rate on all debt, including the effect of interest rate caps and amortization of debt discount, premium and deferred financing charges.\n(2)\nFor a reconciliation of our effective income tax rate attributable to DaVita Inc., see the \"\nReconciliations of Non-GAAP measures\n\" section below.\nDebt expense\nDebt expense for the third quarter of 2025 compared to the second quarter of 2025 increased due to an increase in our weighted average long-term debt balance related to the May 23, 2025 issuance of the 6.75% senior notes due 2033 (the 6.75% Senior Notes), partially offset by decreased borrowing activity on our revolving line of credit during the third quarter. Debt expense for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 increased primarily due to an increase in our weighted average effective interest rate principally related to the expiration of our 2019 interest rate cap agreements on June 30, 2024, which had lower rates than our currently effective interest rate caps. This change was also driven by a net increase in our weighted average long-term debt balance primarily related to the third quarter 2024 issuance of 6.875% senior notes due 2032 and the second quarter 2025 issuance of the 6.75% Senior Notes, partially offset by regularly scheduled principal payments on our senior secured credit facilities.\nDebt extinguishment and modification costs\nThe three and nine months ended September 30, 2025 included debt extinguishment and modification costs of $5 million composed partially of fees incurred in connection with the Term Loan B-2 transaction and partially of deferred financing costs \n33\nand original issue discount written off for the extinguishment of Term Loan B-1 and partial repayment of Term Loan A-1. Comparatively, the nine months ended September 30, 2024 included debt extinguishment and modification costs of $20 million composed partially of fees incurred in connection with the Incremental Term Loan A-1 and Term Loan B-1 Extension and partially of deferred financing costs and original issue discount written off for the extinguishment of the non-extended Term Loan B-1.\nOther loss, net\nOther loss for the third quarter of 2025 increased compared to the second quarter of 2025 primarily due to increased equity investment losses at Mozarc Medical Holding LLC (Mozarc) which included impairment and restructuring charges of $25.9 million. Other loss for the nine months ended September 30, 2025 increased compared to the nine months ended September 30, 2024, primarily driven by increased equity investment losses at Mozarc as discussed above and losses on foreign currency translation.\nEffective income tax rate\nThe effective income tax rate and the effective income tax rate attributable to DaVita Inc. decreased for the third quarter of 2025 compared to the second quarter of 2025 primarily due to a write down of a 2014 tax refund claim recognized in the second quarter of 2025. \nThe effective income tax rate and the effective income tax rate attributable to DaVita Inc. for the nine months ended September 30, 2025 increased compared to the nine months ended September 30, 2024 primarily due to a write down of a 2014 tax refund claim recognized in 2025, a decrease in tax benefits related to stock-based compensation in 2025, and a benefit recognized in 2024 related to a non-taxable non-cash consolidation gain.\nNet income attributable to noncontrolling interests\nThe increase in net income attributable to noncontrolling interests for the third quarter of 2025 from the second quarter of 2025 and for the nine months ended September 30, 2025 from the nine months ended September 30, 2024 was due to increased profitability at certain U.S. dialysis partnerships.\nU.S. dialysis accounts receivable\nOur U.S. dialysis accounts receivable balances at September 30, 2025 and December 31, 2024 were $1.704 billion and $1.615 billion, respectively, representing approximately 53 days and 52 days of revenue outstanding (DSO), respectively. The increase in DSO is primarily due to timing of collections. Our DSO calculation is based on the current quarter’s average revenues per day. There were no significant changes from the second quarter of 2025 to the third quarter of 2025 in the carrying value of accounts receivable outstanding over one year old.\n34\nLiquidity and capital resources\nThe following table summarizes our major sources and uses of cash, cash equivalents and restricted cash:\nNine months ended September 30,\nYTD Q3 2025 vs. YTD Q3 2024\n2025\n2024\nAmount\nPercent\n(dollars in millions and shares in thousands)\nNet cash provided by operating activities:\nNet income\n$\n748 \n$\n901 \n$\n(153)\n(17.0)\n%\nNon-cash items in net income\n807 \n664 \n143 \n21.5 \n%\nOther working capital changes\n(194)\n(71)\n(123)\n(173.2)\n%\nOther\n(14)\n(21)\n7 \n33.3 \n%\n$\n1,346 \n$\n1,474 \n$\n(128)\n(8.7)\n%\nNet cash used in investing activities:\nMaintenance capital expenditures\n(1)\n$\n(304)\n$\n(275)\n$\n(29)\n(10.5)\n%\nDevelopment capital expenditures\n(2)\n(126)\n(110)\n(16)\n(14.5)\n%\nAcquisition expenditures\n(118)\n(161)\n43 \n26.7 \n%\nProceeds from sale of self-developed properties\n29 \n11 \n18 \n163.6 \n%\nOther\n28 \n12 \n16 \n133.3 \n%\n$\n(492)\n$\n(523)\n$\n31 \n5.9 \n%\nNet cash used in financing activities:\nDebt issuances, net\n$\n788 \n$\n1,171 \n$\n(383)\n(32.7)\n%\nDeferred and debt-related financing costs\n(26)\n(46)\n20 \n43.5 \n%\nDistributions to noncontrolling interests\n(233)\n(229)\n(4)\n(1.7)\n%\nContributions from noncontrolling interests\n4 \n11 \n(7)\n(63.6)\n%\nStock award exercises and other share issuances\n(16)\n(112)\n96 \n85.7 \n%\nShare repurchases\n(1,464)\n(1,021)\n(443)\n(43.4)\n%\nOther\n(13)\n(26)\n13 \n50.0 \n%\n$\n(960)\n$\n(252)\n$\n(708)\n(281.0)\n%\nTotal number of shares repurchased\n10,001 \n7,508 \n2,493 \n33.2 \n%\nFree cash flow\n(3)\n$\n716 \n$\n882 \n$\n(166)\n(18.8)\n%\nCertain columns or rows may not sum due to the presentation of rounded numbers.\n \n(1)\nMaintenance capital expenditures represent capital expenditures to maintain the productive capacity of the business and include those made for investments in information technology, dialysis center renovations, capital asset replacements, and any other capital expenditures that are not development or acquisition expenditures.\n(2)\nDevelopment capital expenditures principally represent capital expenditures (other than acquisition expenditures) made to expand the productive capacity of the business and include those for new U.S. and international dialysis center developments, dialysis center expansions and relocations, and new or expanded contracted hospital operations.\n(3)\nFor a reconciliation of our free cash flow, see the \"\nReconciliations of Non-GAAP measures\n\" section below.\nConsolidated cash flows\nConsolidated cash flows from operating activities during the nine months ended September 30, 2025 decreased compared to the nine months ended September 30, 2024. The decrease was principally due to a decrease in operating results and timing in other working capital items.\nFree cash flow during the nine months ended September 30, 2025 decreased as compared to the nine months ended September 30, 2024 primarily due to a decrease in net cash provided by operating activities, as described above, and increases in capital expenditures.\n35\nSignificant sources of cash during the period included the refinancing of Term Loan B-1 with a secured Term Loan B-2 facility in the aggregate principal amount of $1,878 million and issuance of the 6.75% Senior Notes in the amount of $1,000 million. Significant uses of cash during the nine months ended September 30, 2025 included the pay-off of the remaining principal balance outstanding on our Term Loan B-1 in the amount of $1,628 million, principal prepayment on our Term Loan A-1 in the amount of $250 million and repayment of $93 million in interest-free funding made available by UnitedHealth Group and its affiliates following the cybersecurity breach that affected Change Healthcare (CHC), a subsidiary of UnitedHealth Group, during the first quarter of 2025, regularly scheduled principal payments under our senior secured credit facilities totaling approximately $59 million on our Term Loan A-1, $8 million on Term Loan B-1 and $5 million on Term Loan B-2, as well as additional required payments under other debt arrangements. Additionally, we recognized financing cash outflows of $12 million in deferred financing costs related to the 6.75% Senior Notes transaction, as well as $13 million in cap premium fees for our 2025 forward interest rate cap agreements. In addition, during the nine months ended September 30, 2025 we used cash to repurchase 10.0 million shares of our common stock.\nBy comparison, the same period in 2024 included the extension of the maturity date from August 2026 to May 2031 for a portion of our Term Loan B-1 (the Extended Term Loan B-1 transaction) in the aggregate principal amount of approximately $1,640 million (such portion referred to as the Extended Term Loan B-1), the incurrence of an incremental Term Loan A-1 tranche in the aggregate principal amount of $1,100 million (such portion referred to as the Incremental Term Loan A-1), the issuance of 6.875% senior notes due 2032 in the amount of $1,000 million (the 6.875% Senior Notes) and $120 million, net, of interest-free funding made available by UnitedHealth Group and its affiliates following the cybersecurity breach that affected CHC during the first quarter of 2024. Significant uses of cash during that same period included debt prepayments on Term Loan B-1 of $2,590 million as part of the Extended Term Loan B-1, Incremental Term Loan A-1 and 6.875% Senior Notes transactions, and regularly scheduled principal payments under our senior secured credit facilities totaling approximately $45 million on our Term Loan A-1 and $14 million on Term Loan B-1, as well as additional required payments under other debt arrangements. Additionally, we recognized financing cash outflows of $35 million in deferred financing costs and discount related to the Fourth and Sixth Amendments to the Senior Secured Credit Agreement and 6.875% Senior Notes transactions, as well as $11 million in cap premium fees for our 2024 forward interest cap agreements.\nDialysis center footprint\nThe table below shows the footprint of our dialysis operations by number of dialysis centers owned or operated:\nU.S.\nInternational\nThree months ended\nSeptember 30,\nNine months ended \nSeptember 30,\nThree months ended\nSeptember 30,\nNine months ended \nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nNumber of centers operated at beginning of period\n2,662 \n2,672 \n2,657 \n2,675 \n513 \n452 \n509 \n367 \nAcquired centers\n— \n— \n2 \n12 \n58 \n1 \n59 \n91 \nDeveloped centers\n3 \n3 \n12 \n12 \n— \n4 \n6 \n5 \nNet change in non-owned managed or\n administered centers\n(1)\n— \n— \n— \n(8)\n23 \n— \n27 \n— \nSold and closed centers\n(2)\n— \n(2)\n(3)\n(11)\n(9)\n— \n(13)\n(2)\nClosed centers\n(3)\n(3)\n(13)\n(6)\n(20)\n— \n(4)\n(3)\n(8)\nNumber of centers operated at end of period\n2,662 \n2,660 \n2,662 \n2,660 \n585 \n453 \n585 \n453 \n \n(1)\nRepresents the change in the number of dialysis centers which we manage or provide administrative services to but in which we own a noncontrolling equity interest or which are wholly-owned by third parties, including our APAC joint venture centers which were consolidated in the fourth quarter of 2024. \n(2)\nRepresents dialysis centers that were sold and/or closed for which the majority of patients were not retained.\n(3)\nRepresents dialysis centers that were closed for which the majority of patients were retained and transferred to one of our other existing outpatient dialysis centers.\n36\nShare repurchases\nDuring the nine months ended September 30, 2025, we repurchased a total of 10.0 million shares of our common stock for $1,461 million at an average price of $144.72 per share.\nAvailable liquidity\nAs of September 30, 2025, we had undrawn capacity on the revolving line of credit under our senior secured credit facilities of $1.5 billion. Credit available under this revolving line of credit is reduced by the amount of any letters of credit outstanding thereunder, of which there were none as of September 30, 2025. We separately had approximately $175 million in letters of credit outstanding under a separate bilateral secured letter of credit facility.\nSee Note 6 to the condensed consolidated financial statements for components of our long-term debt and their interest rates.\nWe believe that our cash flow from operations and other sources of liquidity, including from amounts available under our senior secured credit facilities and our access to the capital markets, will be sufficient to fund our scheduled debt service under the terms of our debt agreements and other obligations for the foreseeable future, including the next 12 months. From time to time, depending on market conditions, our capital requirements and the availability of financing, among other things, we may seek to refinance our existing debt and may incur additional indebtedness. Our primary recurrent sources of liquidity are cash from operations and cash from borrowings, which are subject to general, economic, financial, competitive, regulatory and other factors that are beyond our control, as described in Part I Item 1A. \"\nRisk Factors\"\n of our 2024 10-K\n.\nReconciliations of Non-GAAP measures\nThe following tables provide reconciliations of adjusted operating income (loss) to operating income (loss) as presented on a U.S. generally accepted accounting principles (GAAP) basis for our U.S. dialysis reportable segment as well as for our U.S. IKC business, our U.S. other ancillary services, our international business, and for our total ancillary services which combines them and is disclosed as our other segments category, in addition to our corporate administrative support.\nThese non-GAAP or \"adjusted\" measures are presented because management believes these measures are useful adjuncts to, but not alternatives for, our GAAP results. Specifically, management uses adjusted operating income (loss) to compare and evaluate our performance period over period and relative to competitors, to analyze the underlying trends in our business, to establish operational budgets and forecasts and for incentive compensation purposes. We believe this non-GAAP measure is also useful to investors and analysts in evaluating our performance over time and relative to competitors, as well as in analyzing the underlying trends in our business. We also believe this presentation enhances a user's understanding of our normal operating income by excluding certain items which we do not believe are indicative of our ordinary results of operations.\nIn addition, our effective income tax rate on income attributable to DaVita Inc. excludes noncontrolling owners' income, which primarily relates to non-tax paying entities. We believe this adjusted effective income tax rate is useful to management, investors and analysts in evaluating our performance and establishing expectations for income taxes incurred on our ordinary results attributable to DaVita Inc.\nFinally, our free cash flow represents net cash provided by operating activities less distributions to noncontrolling interests, development capital expenditures, and maintenance capital expenditures; plus contributions from noncontrolling interests and proceeds from the sale of self-developed properties. Management uses this measure to assess our ability to fund acquisitions and meet our debt service obligations and we believe this measure is equally useful to investors and analysts as an adjunct to cash flows from operating activities and other measures under GAAP.\nIt is important to bear in mind that these non-GAAP \"adjusted\" measures are not measures of financial performance under GAAP and should not be considered in isolation from, nor as substitutes for, their most comparable GAAP measures.\nThree months ended September 30, 2025\nU.S. dialysis\nAncillary services\nCorporate administration\nConsolidated\nU.S. IKC\nU.S. Other\nInternational\nTotal\n(dollars in millions)\nOperating income (loss)\n$\n530 \n$\n(21)\n$\n(4)\n$\n27 \n$\n1 \n$\n(26)\n$\n506 \nCybersecurity incident-related\n charges\n(1)\n12 \n— \n— \n— \n— \n— \n12 \nAdjusted operating income (loss)\n$\n542 \n$\n(21)\n$\n(4)\n$\n27 \n$\n1 \n$\n(26)\n$\n517 \n37\nThree months ended June 30, 2025\nU.S. dialysis\nAncillary services\nCorporate administration\nConsolidated\nU.S. IKC\nU.S. Other\nInternational\nTotal\n(dollars in millions)\nOperating income (loss)\n$\n523 \n$\n26 \n$\n(5)\n$\n36 \n$\n57 \n$\n(42)\n$\n538 \nCybersecurity incident-related\n charges\n(1)\n13 \n— \n— \n— \n— \n— \n13 \nAdjusted operating income (loss)\n$\n536 \n$\n26 \n$\n(5)\n$\n36 \n$\n57 \n$\n(42)\n$\n551 \nNine months ended September 30, 2025\nU.S. dialysis\nAncillary services\nCorporate administration\nConsolidated\nU.S. IKC\nU.S. Other\nInternational\nTotal\n(dollars in millions)\nOperating income (loss)\n$\n1,529 \n$\n(24)\n$\n(14)\n$\n93 \n$\n55 \n$\n(101)\n$\n1,483 \nCybersecurity incident-related\n charges\n(1)\n25 \n— \n— \n— \n— \n— \n25 \nAdjusted operating income (loss)\n$\n1,554 \n$\n(24)\n$\n(14)\n$\n93 \n$\n55 \n$\n(101)\n$\n1,508 \nNine months ended September 30, 2024\nU.S. dialysis\nAncillary services\nCorporate administration\nConsolidated\nU.S. IKC\nU.S. Other\nInternational\nTotal\n(dollars in millions)\nOperating income (loss)\n$\n1,625 \n$\n(48)\n$\n(19)\n$\n51 \n$\n(16)\n$\n(84)\n$\n1,525 \nGain on changes in ownership\n interest\n(2)\n(35)\n— \n— \n— \n— \n— \n(35)\nAdjusted operating income (loss)\n$\n1,590 \n$\n(48)\n$\n(19)\n$\n51 \n$\n(16)\n$\n(84)\n$\n1,490 \nCertain columns or rows in the above tables may not sum due to the presentation of rounded numbers.\n(1)\nRepresents charges recognized to remediate a cybersecurity incident and restore systems following the occurrence of the incident in the second quarter of 2025. We have excluded these charges from our non-GAAP metrics as we do not believe they are indicative of our ordinary results of operations. See additional discussion above under the heading \"\nCybersecurity incident-related charges\n\" within \"\nU.S. dialysis results of operations\n\".\n(2)\nRepresents a non-cash gain recognized on the acquisition of a controlling financial interest in a previously nonconsolidated dialysis partnership. See additional discussion above under the heading \"\nGain on changes in ownership interests\n\" within \"\nU.S. dialysis results of operations\n\". This gain to mark the prior investment in the business to fair value before consolidation does not represent a normal and recurring requirement of operating our business or generating revenues and may obscure analysis of underlying trends and financial performance.\nThree months ended\nNine months ended\nSeptember 30, \n2025\nJune 30, \n2025\nSeptember 30, \n2025\nSeptember 30, \n2024\n(dollars in millions)\nIncome before income taxes\n$\n309 \n$\n369 \n$\n964 \n$\n1,117 \nLess: Noncontrolling owners' income primarily attributable to non-tax\n paying entities\n(90)\n(76)\n(236)\n(225)\nIncome before income taxes attributable to DaVita Inc.\n$\n219 \n$\n293 \n$\n729 \n$\n892 \nIncome tax expense\n$\n69 \n$\n94 \n$\n216 \n$\n215 \nLess: Income tax attributable to noncontrolling interests\n— \n— \n— \n(1)\nIncome tax expense attributable to DaVita Inc.\n$\n68 \n$\n93 \n$\n216 \n$\n215 \nEffective income tax rate on income attributable to DaVita Inc.\n31.3 \n%\n31.9 \n%\n29.6 \n%\n24.1 \n%\nCertain columns or rows may not sum or recalculate due to the presentation of rounded numbers.\n38\nNine months ended\nSeptember 30, \n2025\nSeptember 30, \n2024\n(dollars in millions)\nNet cash provided by operating activities\n$\n1,346 \n$\n1,474 \nAdjustments to reconcile net cash provided by operating activities to free cash flow:\nDistributions to noncontrolling interests\n(233)\n(229)\nContributions from noncontrolling interests\n4 \n11 \nMaintenance capital expenditures\n(304)\n(275)\nDevelopment capital expenditures\n(126)\n(110)\nProceeds from sale of self-developed properties\n29 \n11 \nFree cash flow\n$\n716 \n$\n882 \nCertain columns or rows may not sum due to the presentation of rounded numbers.\nOff-balance sheet arrangements and aggregate contractual obligations\nIn addition to the debt obligations and operating lease liabilities reflected on our balance sheet, we have commitments associated with letters of credit, as well as certain working capital funding obligations associated with our equity investments in nonconsolidated dialysis ventures that we manage and some that we manage which are wholly-owned by third parties. For additional information see Note 7 to the condensed consolidated financial statements.\nWe also have potential obligations to purchase the noncontrolling interests held by third parties in many of our majority-owned dialysis partnerships and other nonconsolidated entities. These obligations are in the form of put provisions that are exercisable at the third-party owners’ discretion within specified periods as outlined in each specific put provision. For additional information on these obligations and how we measure and report them, see Note 12 to the condensed consolidated financial statements included in this report and Notes 16 and 23 to the consolidated financial statements included in our 2024 10-K.\nFor information on the maturities and other terms of our long-term debt, see Note 6 to the condensed consolidated financial statements.\nAs of September 30, 2025, we have outstanding letters of credit in the aggregate amount of approximately $175 million under a bilateral secured letter of credit facility separate from our senior secured credit facilities.\nAs of September 30, 2025, we have outstanding purchase agreements with various suppliers to purchase set amounts of dialysis equipment, parts, pharmaceuticals and supplies. If we fail to meet the minimum purchase commitments under these contracts during any year, we are required to pay the difference to the supplier, as described further in Note 16 to the Company's consolidated financial statements included in our 2024 10-K.\nNew Accounting Standards\nSee discussion of new accounting standards in Note 14 to the condensed consolidated financial statements."
}