{
  "source_file": "dxcm-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2 - MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Quarterly Report on Form 10-Q, including the following Management’s Discussion and Analysis of Financial Condition and Results of Operations, contains forward-looking statements that are not purely historical regarding Dexcom’s or its management’s intentions, beliefs, expectations and strategies for the future. These forward-looking statements fall within the meaning of the federal securities laws that relate to future events or our future financial performance. In some cases, you can identify forward-looking statements by terminology such as “may,” “will,” “expect,” “plan,” “anticipate,” “believe,” “estimate,” “intend,” “potential” or “continue” or the negative of these terms or other comparable terminology. Forward-looking statements are made as of the date of this Quarterly Report on Form 10-Q, deal with future events, are subject to various risks and uncertainties, and actual results could differ materially from those anticipated in those forward looking statements. The risks and uncertainties that could cause actual results to differ materially are more fully described under “Risk Factors” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 filed with the SEC on February 18, 2025, together with any updates identified under “Risk Factors” in Part II, Item 1A of this Quarterly Report on Form 10-Q, elsewhere in this Quarterly Report on Form 10-Q, and in our other reports filed with the SEC. We assume no obligation to update any of the forward-looking statements after the date of this Quarterly Report on Form 10-Q or to conform these forward-looking statements to actual results. You should read the following discussion and analysis together with our condensed consolidated financial statements and related notes in Part I, Item 1 of this Quarterly Report on Form 10-Q.\nOverview\nWho We Are\nWe are a medical device company primarily focused on the design, development and commercialization of continuous glucose monitoring, or CGM, systems for the management of diabetes and metabolic health by patients, caregivers, and clinicians around the world.\nWe received approval from the Food and Drug Administration, or FDA, and commercialized our first product in 2006. We launched our latest generation systems, the Dexcom G6 integrated Continuous Glucose Monitoring System, or G6, in 2018, and we launched the Dexcom G7, or G7,\n \nin 2023. In August 2024, we launched Stelo, our biosensor designed for adults with prediabetes and Type 2 diabetes who do not use insulin, as the first over-the-counter glucose biosensor in the U.S. In April 2025, we received FDA clearance for the Dexcom G7 15 Day CGM System for people over the age of 18 with diabetes in the United States.\nUnless the context requires otherwise, the terms “we,” “us,” “our,” the “company,” or “Dexcom” refer to DexCom, Inc. and its subsidiaries.\nGlobal Presence\nWe have built a direct sales organization in North America and certain international markets to call on health care professionals, such as endocrinologists, physicians and diabetes educators, who can educate and influence patient adoption of continuous glucose monitoring. To complement our direct sales efforts, we have entered into distribution arrangements in North America and several international markets that allow distributors to sell our products.\nFuture Developments\nProduct Development: \nWe plan to develop future generations of technologies that are focused on improved performance and convenience and that will enable intelligent insulin administration. Over the longer term, we plan to continue to develop and improve networked platforms with open architecture, connectivity and transmitters capable of communicating with other devices. We also intend to expand our efforts to accumulate CGM patient data and metrics and apply predictive modeling and machine learning to generate interactive CGM insights that can inform patient behavior.\nPartnerships:\n We continue to support partnerships with insulin pump companies and companies or institutions developing insulin delivery systems, including automated insulin delivery systems. With the introduction of Stelo, we are also pursuing and supporting development partnerships with consumer technology product companies that seek to provide metabolic health insights to their customers.\nNew Opportunities:\n \nWe are also exploring how to extend our offerings to other opportunities, including for people with pre-diabetes, people who are obese, people who are pregnant, and people in the hospital setting. Eventually, we may apply our technological expertise to products beyond glucose monitoring.\n27\nTable \nof\n Contents\nCritical Accounting Estimates\nThe discussion and analysis of our financial condition and results of operations are based on our condensed consolidated financial statements, which we have prepared in accordance with GAAP. The preparation of these condensed consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the condensed consolidated financial statements as well as the reported revenue and expenses during the reporting periods. On an ongoing basis, we evaluate our estimates and judgments. We base our estimates on historical experience and on various other factors that we believe are reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe that the estimates, assumptions and judgments involved in the accounting policies described in “\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n” in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, have the greatest potential impact on our financial statements, so we consider them to be our critical accounting policies and estimates. There were no material changes to our critical accounting estimates during the nine months ended September 30, 2025.\n28\nTable \nof\n Contents\nOverview of Financial Results\nThe most important financial indicators that we use to assess our business are revenue, gross profit, operating income, net income, and operating cash flow.\nKey Highlights for the Three Months Ended September 30, 2025 include the following:\nRevenue\nGross Profit\nOperating Income\nNet Income\nOperating \nCash Flow\n$1.21 billion\n$731.4 million\n$242.5 million\n$283.8 million\n$659.9 million\nup 22% from the same period in 2024\nup 23% from the same period in 2024\nup 60% from the same period in 2024\nup 111% from the same period in 2024\nup 231% from the same period in 2024\nWe ended the third quarter of 2025 with cash, cash equivalents and short-term marketable securities totaling $3.32 billion.\nResults of Operations\nFinancial Overview\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nThree Months Ended September 30,\n2025 - 2024\n(In millions, except per share amounts)\n2025\n% of Revenue \n(1)\n2024\n% of Revenue \n(1)\n$ Change\n% Change\nRevenue\n$\n1,209.3 \n100 \n%\n$\n994.2 \n100 \n%\n$\n215.1 \n22 \n%\nCost of sales\n477.9 \n40 \n%\n400.4 \n40 \n%\n77.5 \n19 \n%\nGross profit\n731.4 \n60.5 \n%\n593.8 \n59.7 \n%\n137.6 \n23 \n%\nOperating expenses:\nResearch and development\n157.5 \n13 \n%\n135.4 \n14 \n%\n22.1 \n16 \n%\nSelling, general and administrative\n331.4 \n27 \n%\n306.4 \n31 \n%\n25.0 \n8 \n%\nTotal operating expenses\n488.9 \n40 \n%\n441.8 \n44 \n%\n47.1 \n11 \n%\nOperating income\n242.5 \n20 \n%\n152.0 \n15 \n%\n90.5 \n60 \n%\nOther income, net\n109.8 \n9 \n%\n25.4 \n3 \n%\n84.4 \n**\nIncome before income taxes\n352.3 \n29 \n%\n177.4 \n18 \n%\n174.9 \n99 \n%\nIncome tax expense\n68.5 \n6 \n%\n42.8 \n4 \n%\n25.7 \n60 \n%\nNet income\n$\n283.8 \n23 \n%\n$\n134.6 \n14 \n%\n$\n149.2 \n111 \n%\nBasic net income per share\n$\n0.73 \n**\n$\n0.34 \n**\n$\n0.39 \n**\nDiluted net income per share\n$\n0.70 \n**\n$\n0.34 \n**\n$\n0.36 \n**\n(1) \nThe sum of the individual percentages may not equal the total due to rounding.\n** Not meaningful\n29\nTable \nof\n Contents\nRevenue\nWe generate our revenue from the sale of disposable sensors and our reusable transmitter and receiver, collectively referred to as Reusable Hardware. \nWe expect that the revenue we generate from the sales of our products will fluctuate from quarter to quarter. We typically experience seasonality, with lower sales in the first quarter of each year compared to the immediately preceding fourth quarter. This seasonal sales pattern relates to U.S. annual insurance deductible resets and unfunded flexible spending accounts.\nCost of sales\nCost of sales includes direct labor and materials costs related to each product sold or produced, including assembly, test labor and scrap, as well as factory overhead supporting our manufacturing operations. Factory overhead includes facilities, material procurement and control, manufacturing engineering, quality assurance, supervision and management. These costs are primarily salary, fringe benefits, share-based compensation, facility expense, supplies and purchased services. All of our manufacturing costs are included in cost of sales. In addition, amortization of certain licensing related intangibles are also included in cost of sales.\nResearch and development\nOur research and development expenses primarily consist of engineering and research expenses related to our sensing technology, clinical trials, regulatory expenses, quality assurance programs, employee compensation, and business process outsourcers.\nSelling, general and administrative\nOur selling, general and administrative expenses primarily consist of employee compensation for our executive, financial, sales, marketing, information technology and administrative functions. Other significant expenses include commissions, marketing and advertising, IT software license costs, insurance, professional fees for our outside legal counsel and independent auditors, litigation expenses, patent application expenses and consulting expenses.\nOther income, net\nOther income, net consists primarily of interest and dividend income on our cash, cash equivalents and short-term marketable securities portfolio, foreign currency transaction gains and losses resulting from the effects of foreign currency fluctuations, realized and unrealized gains and losses on marketable and non-marketable equity investments, including changes in fair value, and interest expense related to our senior convertible notes.\n30\nTable \nof\n Contents\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nThree Months Ended September 30,\n2025 - 2024\n2025\n2024\nChange in Revenue\n(In millions)\nRevenue\n% of Total\nRevenue\n% of Total\n$\n%\nUnited States\n$\n851.9 \n70%\n$\n701.9 \n71%\n$\n150.0 \n21%\nInternational\n357.4 \n30%\n292.3 \n29%\n65.1 \n22%\nTotal Revenue\n$\n1,209.3 \n100%\n$\n994.2 \n100%\n$\n215.1 \n22%\n \nThree Months Ended September 30, 2025 Compared to \nThree Months Ended September 30, 2024 \nRevenue\nThe revenue increase was primarily driven by increased sales volume of our disposable sensors due to the continued growth of our worldwide customer base. We added approximately 500,000 - 600,000 net customers, excluding Stelo customers, to our worldwide customer base in 2024. The increase in revenue was offset by pricing headwinds due to rebate eligibility and channel mix.\nDisposable sensor and other revenue comprised approximately 97% of total revenue and Reusable Hardware revenue comprised approximately 3% of total revenue for the three months ended September 30, 2025. Disposable sensor and other revenue comprised approximately 96% of total revenue and Reusable Hardware revenue comprised approximately 4% of total revenue for the three months ended September 30, 2024.\nCost of sales & Gross profit\nCost of sales and gross profit increased primarily due to an increase in sales volume driven by the addition of approximately 500,000 - 600,000 net customers, excluding Stelo customers, to our worldwide customer base in 2024.\nThe increase in gross profit margin percentage in the third quarter of 2025 compared to the third quarter of 2024 was primarily driven by higher manufacturing volumes which improved fixed cost absorption. This benefit was partially offset by inefficiencies associated with ensuring supply availability, build configurations that lowered production yield, and total replacement costs.\n31\nTable \nof\n Contents\nThree Months Ended September 30, 2025 Compared to \nThree Months Ended September 30, 2024 \nResearch and development expense\nResearch and development expense\n \nincreased primarily due to $16.4 million in higher compensation and related costs.\nWe continue to believe that focused investments in research and development are critical to our future growth and competitive position in the marketplace, and to the development of new and updated products and services that are central to our core business strategy.\nSelling, general and administrative expense\nSelling, general and administrative expense increased primarily due to $44.2 million in higher compensation and related costs, partially driven by increased headcount\n \nand $10.2 million in incremental investments in advertising and marketing costs, offset by $26.8 million in lower legal expense primarily related to a patent infringement lawsuit that was settled in December 2024.\nOther income, net\nOther income, net, increased primarily due to $82.3 million in higher net gains on equity investments.\nIncome tax expense\nThe income tax expense recorded for the three months ended September 30, 2025 was primarily attributable to income tax expense from normal, recurring operations and the tax benefit related to the commencement of our Malaysia tax holiday.\nThe\n \nincome tax expense recorded for the three months ended September 30, 2024 was primarily attributable to income tax expense from normal, recurring operations and discrete impacts of certain foreign tax return filings.\nThe decrease in our effective tax rate for the three months ended September 30, 2025 compared to the same period in 2024 is primarily attributable to a lower annual effective tax rate applied to normal, recurring operations and the tax benefit related to the commencement of our Malaysia tax holiday.\n32\nTable \nof\n Contents\nResults of Operations\nFinancial Overview\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nNine Months Ended September 30,\n2025 - 2024\n(In millions, except per share amounts)\n2025\n% of Revenue \n(1)\n2024\n% of Revenue \n(1)\n$ Change\n% Change\nRevenue\n$\n3,402.4 \n100 \n%\n$\n2,919.5 \n100 \n%\n$\n482.9 \n17 \n%\nCost of sales\n1,393.2 \n41 \n%\n1,137.1 \n39 \n%\n256.1 \n23 \n%\nGross profit\n2,009.2 \n59.1 \n%\n1,782.4 \n61.1 \n%\n226.8 \n13 \n%\nOperating expenses:\nResearch and development\n450.9 \n13 \n%\n412.9 \n14 \n%\n38.0 \n9 \n%\nSelling, general and administrative\n969.5 \n28 \n%\n958.4 \n33 \n%\n11.1 \n1 \n%\nTotal operating expenses\n1,420.4 \n42 \n%\n1,371.3 \n47 \n%\n49.1 \n4 \n%\nOperating income\n588.8 \n17 \n%\n411.1 \n14 \n%\n177.7 \n43 \n%\nOther income, net\n158.9 \n5 \n%\n86.6 \n3 \n%\n72.3 \n83 \n%\nIncome before income taxes\n747.7 \n22 \n%\n497.7 \n17 \n%\n250.0 \n50 \n%\nIncome tax expense\n178.7 \n5 \n%\n73.2 \n3 \n%\n105.5 \n**\nNet income\n$\n569.0 \n17 \n%\n$\n424.5 \n15 \n%\n$\n144.5 \n34 \n%\nBasic net income per share\n$\n1.45 \n**\n$\n1.08 \n**\n$\n0.37 \n34 \n%\nDiluted net income per share\n$\n1.42 \n**\n$\n1.04 \n**\n$\n0.38 \n37 \n%\n(1) \nThe sum of the individual percentages may not equal the total due to rounding.\n** Not meaningful\n33\nTable \nof\n Contents\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nNine Months Ended September 30,\n2025 - 2024\n2025\n2024\nChange in Revenues\n(In millions)\nRevenue\n% of Total\nRevenue\n% of Total\n$\n%\nUnited States\n$\n2,443.4 \n72%\n$\n2,087.0 \n71%\n$\n356.4 \n17%\nInternational\n959.0 \n28%\n832.5 \n29%\n126.5 \n15%\nTotal Revenue\n$\n3,402.4 \n100%\n$\n2,919.5 \n100%\n$\n482.9 \n17%\nNine Months Ended September 30, 2025 Compared to \nNine Months Ended September 30, 2024\nRevenue\nThe revenue increase was primarily driven by increased sales volume of our disposable sensors due to the continued growth of our worldwide customer base. We added approximately 500,000 - 600,000 net customers, excluding Stelo customers, to our worldwide customer base in 2024. The increase in revenue was offset by pricing headwinds due to greater rebate eligibility and channel mix.\nDisposable sensor and other revenue comprised approximately 97% of total revenue and Reusable Hardware revenue comprised approximately 3% of total revenue for the nine months ended September 30, 2025. Disposable sensor and other revenue comprised approximately 94% of total revenue and Reusable Hardware revenue comprised approximately 6% of total revenue for the nine months ended September 30, 2024.\nCost of sales & Gross profit\nCost of sales and gross profit increased primarily due to an increase in sales volume driven by the addition of approximately 500,000 - 600,000 net customers, excluding Stelo customers, to our worldwide customer base in 2024.\nThe decrease in gross profit margin percentage in 2025 compared to 2024 was primarily driven by inefficiencies associated with ensuring supply availability, build configurations that lowered production yield, and total replacement costs.\n34\nTable \nof\n Contents\nNine Months Ended September 30, 2025 Compared to \nNine Months Ended September 30, 2024\nResearch and development expense\nResearch and development expense increased primarily due to $37.1 million in higher\n \ncompensation and related costs, offset by $4.8 million in lower clinical trials, supplies, and other support costs.\nWe continue to believe that focused investments in research and development are critical to our future growth and competitive position in the marketplace, and to the development of new and updated products and services that are central to our core business strategy.\nSelling, general and administrative expense\nSelling, general and administrative expense increased primarily due to $77.7 million in higher compensation and related costs, partially driven by increased headcount, offset by $72.4 million in lower legal expense primarily related to a patent infringement lawsuit that was settled in December 2024.\nOther income, net\nOther income, net, increased primarily due to $79.5 million in higher net gains on equity investments and $8.1 million in higher net foreign currency gains, offset by $15.3 million in lower interest and dividend income on our cash, cash equivalents, and marketable securities portfolio. The decrease in interest income was primarily related to a change in market interest rates.\nIncome tax expense\nThe income tax expense recorded for the nine months ended September 30, 2025 was primarily attributable to income tax expense from normal, recurring operations at an estimated annual effective tax rate of 22.5%, increased by discrete shortfalls recognized for share-based compensation for employees, net of nondeductible executive compensation, offset by the tax benefit related to the commencement of our Malaysia tax holiday.\nThe income tax expense recorded for the nine months ended September 30, 2024 was primarily attributable to income tax expense from normal, recurring operations at an estimated annual effective tax rate of 23.1%, partially offset by discrete excess tax benefits recognized for share-based compensation for employees, net of nondeductible executive compensation, the Verily milestone payment, and the impacts of certain foreign tax return filings.\nThe increase in our effective tax rate for the nine months ended September 30, 2025 compared to the same period in 2024 is primarily attributable to impacts of shortfalls on share-based compensation, a non-recurring benefit related to the Verily milestone payment, offset by the tax benefit related to the commencement of our Malaysia tax holiday.\n35\nTable \nof\n Contents\nLiquidity and Capital Resources\nOverview, Capital Resources, and Capital Requirements\nOur principal sources of liquidity are our existing cash, cash equivalents and marketable securities, cash generated from operations, proceeds from our senior convertible notes issuances, and access to our Credit Facility. Our primary uses of cash have been for research and development programs, selling and marketing activities, capital expenditures, acquisitions of businesses, and debt service costs.\nWe expect that cash provided by our operations may fluctuate in future periods as a result of a number of factors, including fluctuations in our operating results, working capital requirements and capital deployment decisions. We have historically invested our cash primarily in U.S. dollar-denominated, investment grade, highly liquid obligations of U.S. government agencies, commercial paper, corporate debt, and money market funds. Certain of these investments are subject to general credit, liquidity and other market risks. The general condition of the financial markets and the economy may increase those risks and may affect the value and liquidity of investments and restrict our ability to access the capital markets.\nOur future capital requirements will depend on many factors, including but not limited to:\nThe evolution of the international expansion of our business and the revenue generated by sales of our approved products and any future products;\nOur ability to efficiently scale our operations to meet demand for our current and any future products;\nThe success of our research and development efforts;\nThe expenses we incur in manufacturing, developing, selling and marketing our products;\nThe costs, timing and risks of delays of additional regulatory approvals;\nThe costs of filing, prosecuting, defending and enforcing any patent claims and other intellectual property rights;\nThe quality levels of our products and services;\nThe emergence of competing or complementary technological developments;\nThe terms and timing of any collaborative, licensing and other arrangements that we may establish; and\nThe third-party reimbursement of our products for our customers;\nThe rate of progress and cost of our clinical trials and other development activities;\nThe acquisition of businesses, products and technologies and our ability to integrate and manage any acquired businesses, products and technologies.\nWe expect that existing cash and short-term investments and cash flows from our future operations will generally be sufficient to fund our ongoing core business. As current borrowing sources become due, we may be required to access the capital markets for additional funding. As we assess inorganic growth strategies, we may need to supplement our internally generated cash flow with outside sources. In the event that we are required to access the debt market, we believe that we will be able to secure reasonable borrowing rates. As part of our liquidity strategy, we will continue to monitor our current level of earnings and cash flow generation as well as our ability to access the market in light of those earning levels.\nA substantial portion of our operations are located in the United States, and the majority of our sales since inception have been made in U.S. dollars. As we continue to expand our manufacturing sites in Ireland and Malaysia, we will be subject to additional foreign exchange currency risk primarily related to our long-lived assets.\n \nSee “\nForeign Currency Exchange Risk\n” in Part II, Item 7A of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, for more information.\n36\nTable \nof\n Contents\nMain Sources of Liquidity\nCash, cash equivalents and short-term marketable securities\nOur cash, cash equivalents and short-term marketable securities totaled $3.32 billion as of September 30, 2025. None of those funds were restricted and $2.96 billion (approximately 89%) of those funds were located in the United States.\nCash flows from Operations\nFor the nine months ended September 30, 2025, we had positive cash flows of $1.15 billion from operating activities. We anticipate that we will continue to generate positive cash flows from operations for the foreseeable future.\nSenior Convertible Notes\nWe received net proceeds of $1.19 billion in May 2020 from the 2025 Notes offering, and net proceeds of $1.23 billion in May 2023 from the 2028 Notes offering. We used $282.6 million of the net proceeds from the offering of the 2025 Notes to repurchase a portion of our senior convertible notes due in 2022. We used $289.9 million of the net proceeds from the offering of the 2028 Notes to purchase capped call transactions and repurchase shares of our common stock in May 2023. We intend to use the remainder of the net proceeds for general corporate purposes and capital expenditures, including working capital needs. We may also use the net proceeds to expand our current business through in-licensing or acquisitions of, or investments in, other businesses, products or technologies; however, we do not have any significant commitments with respect to any such acquisitions or investments at this time.\nIn connection with the 2028 Notes offering, we purchased the 2028 Capped Calls. See Note 4 “\nDebt\n” to the condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information about our senior convertible notes and the 2028 Capped Calls.\nAmended Credit Agreement\nAs of September 30, 2025, we had no outstanding borrowings, $7.7 million in outstanding letters of credit, and a total available balance of $192.3 million under the Amended Credit Agreement. We monitor counterparty risk associated with the institutional lenders that are providing the Credit Facility. We currently believe that the Credit Facility will be available to us should we choose to borrow under it. Revolving loans will be available for general corporate purposes, including working capital and capital expenditures. See Note 4 “\nDebt\n” to the condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information on the Amended Credit Agreement.\nShort-term Liquidity Requirements\nAs of September 30, 2025, our short-term liquidity requirements primarily consist of regular operating costs, interest payments related to our senior convertible notes, the principal payment related to the maturity of our 2025 Notes, capital expenditures for the development of our manufacturing facilities and office spaces, and short-term material cash requirements as described below. As of September 30, 2025, we had a working capital ratio of 1.56 and a quick ratio of 1.33, which indicates that our current assets are sufficient to cover our short-term liabilities. We expect to incur significant capital expenditures for the next year as we continue to invest in equipment and our manufacturing facilities.\nAs of September 30, 2025, we have $1.21 billion of our outstanding 2025 Notes scheduled to mature on November 15, 2025, all of which will need to be repaid or refinanced, if not converted. We currently intend to repay the outstanding balance of the 2025 Notes in cash upon maturity. See Note 4 “\nDebt\n—\nSenior Convertible Notes\n” to the condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information on the 2025 Notes and our other senior convertible notes.\nWe believe that our cash, cash equivalents, and marketable securities balances, projected cash contributions from our commercial operations, and borrowings under our Credit Facility will be sufficient to meet our anticipated seasonal working capital needs, all capital expenditure requirements, material cash requirements as described herein, repay the remaining balance of the 2025 Notes, and meet other liquidity requirements associated with our operations for at least the next 12 months. We may continue to use cash to repurchase shares of our common stock, including pursuant to the 2025 Share Repurchase Program, or for other strategic initiatives that strengthen our foundation for long-term growth.\n37\nTable \nof\n Contents\nLong-term Liquidity Requirements\nOur long-term liquidity requirements primarily consist of interest and principal payments related to our 2028 Notes, capital expenditures for the development of our manufacturing facilities and office spaces, and long-term material cash requirements as described below. As of September 30, 2025, we had a debt-to-assets ratio of 0.33, which indicates that our total assets are more than enough to cover our short-term and long-term debts. As demand grows for our products, we will continue to expand global operations to meet demand through investments in manufacturing and operations. We expect to meet our long-term liquidity requirements from our main sources of liquidity as described above to support our future operations, capital expenditures, acquisitions, and other liquidity requirements associated with our operations beyond the next 12 months.\nAs of September 30, 2025, we have outstanding senior convertible notes classified as long-term that will mature in May 2028. However, the outstanding principal of our senior convertible notes could be converted into cash and/or shares of our common stock prior to maturity once certain conditions are met. See Note 4 “\nDebt\n—\nSenior Convertible Notes\n” to the condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for information on conversion rights prior to maturity.\nMaterial Cash Requirements\nFrom time to time in the ordinary course of business, we enter into a variety of purchase arrangements including but not limited to, purchase arrangements related to capital expenditures, components used in manufacturing, and research and development activities. As of September 30, 2025, there were no material changes to our contractual obligations outside the ordinary course of business.\nOur obligations under the 2025 Notes and 2028 Notes include both principal and interest payments. As of September 30, 2025, we have $1.21 billion of our outstanding 2025 Notes scheduled to mature on November 15, 2025, all of which will need to be repaid or refinanced, if not converted. We currently intend to repay the outstanding balance of the 2025 Notes in cash upon maturity.\nPrior to the maturity of the 2025 Notes and 2028 Notes in November 2025 and May 2028, respectively, they may be converted into cash and/or shares of our common stock if certain conditions are met. Any conversion prior to maturity may result in repayment of the principal amounts due under the Notes sooner than the scheduled repayment.\nAs market conditions warrant, we may, from time to time, repurchase our outstanding debt securities or shares of our common stock, including pursuant to the 2025 Share Repurchase Program, in the open market, in privately negotiated transactions, by exchange transaction or otherwise. Such repurchases, if any, will depend on prevailing market conditions, our liquidity and other factors and may be commenced or suspended at any time. The amounts involved and total consideration paid may be material. See Note 7 “\nStockholders’ Equity—Share Repurchase Program and Treasury Shares\n” to the condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information about our 2025 Share Repurchase Program.\nSee Note 4 “\nDebt\n” to the condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information about the terms of the Amended Credit Agreement, our senior convertible notes, and the 2028 Capped Calls.\nWe are party to various leasing arrangements, primarily for office, manufacturing and warehouse space that expire at various times through December 2030, excluding any renewal options. We also have land leases in Penang, Malaysia that expire in 2082 and Athenry, Ireland that expire in 3023 related to our international manufacturing facilities. We anticipate incurring significant expenditures related to the build-out of our manufacturing facilities and investment in equipment. See Note 6 “\nLeases and Other Commitments—Leases\n” to the consolidated financial statements in Part II, Item 8 of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 for more information about our leases. There were no material changes to our lease obligations during the nine months ended September 30, 2025.\n38\nTable \nof\n Contents\nCash Flows\nAs of September 30, 2025, we had $3.32 billion in cash, cash equivalents and short-term marketable securities, which is an increase of $742.7 million compared to $2.58 billion as of December 31, 2024.\nThe following table sets forth a summary of our cash flows and the primary changes in cash flows for the periods shown. See the condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for the complete condensed consolidated statements of cash flows for these periods.\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n$ Change\nNet cash provided by operating activities\n$\n1,146.7 \n$\n688.1 \n$\n458.6 \nNet cash provided by investing activities\n229.4 \n96.2 \n133.2 \nNet cash used in financing activities\n(164.2)\n(733.2)\n569.0 \nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n17.7 \n3.8 \n13.9 \nIncrease in cash, cash equivalents and restricted cash\n$\n1,229.6 \n$\n54.9 \n$\n1,174.7 \nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nOperating Cash Flows\n$144.5 million increase in net income\n$162.1 million increase in net non-cash adjustments primarily due to adjustments to deferred income taxes, partially offset by net (gains) losses on equity investments\n$152.0 million increase in net changes in operating assets and liabilities primarily due to the timing of payables and changes in accrued payroll due to lower variable compensation payments, partially offset by the timing of sales and customer collections in accounts receivables\nInvesting Cash Flows\n$172.8 million increase in net proceeds from marketable securities due to the management of our liquidity\nFinancing Cash Flows\n$562.8 million decrease in cash used to repurchase our common stock\nRecent Accounting Guidance\nSee Note 1 “\nOrganization and Significant Accounting Policies\n” to the condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information regarding recently issued accounting pronouncements and the potential impact on our condensed consolidated financial statements, if any."
}