{
  "source_file": "ea-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nCAUTIONARY NOTE ABOUT FORWARD-LOOKING STATEMENTS\nThis Quarterly Report on Form 10-Q contains forward-looking statements. We use words such as “anticipate”, “believe”, “expect”, “intend”, “estimate”, “plan”, “predict”, “seek”, “goal”, “will”, “may”, “likely”, “should”, “could”, “continue”, “potential” (and the negative of any of these terms), “future” and similar expressions to identify forward-looking statements. In addition, any statements that refer to projections of our future financial performance, trends in our business, projections of markets relevant to our business, the Merger (as defined herein), uncertain events and assumptions and other characterizations of future events or circumstances are forward-looking statements. Forward-looking statements consist of, among other things, statements related to our business, operations and financial results, industry prospects, our future financial performance, and our business plans and objectives, and may include certain assumptions that underlie the forward-looking statements. These forward-looking statements are not guarantees of future performance and reflect management’s current expectations. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that might cause or contribute to such differences include those discussed in Part II, Item 1A of this Quarterly Report under the heading “Risk Factors”, as well as in other documents we have filed with the Securities and Exchange Commission (“SEC”), including our Annual Report on Form 10-K for the fiscal year ended March 31, 2025. We assume no obligation to revise or update any forward-looking statement for any reason, except as required by law.\nOVERVIEW\nThe following overview is a high-level discussion of our operating results, as well as some of the trends and drivers that affect our business. Management believes that an understanding of these trends and drivers provides important context for our results for the three months ended September 30, 2025, as well as our future prospects. This summary is not intended to be exhaustive, nor is it intended to be a substitute for the detailed discussion and analysis provided elsewhere in this Form 10-Q, including in the remainder of “Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”),” “Risk Factors,” and the Condensed Consolidated Financial Statements and related Notes. Additional information can be found in the “Business” section of our Annual Report on Form 10-K for the fiscal year ended March 31, 2025 as filed with the SEC on May 13, 2025 and in other documents we have filed with the SEC.\nProposed Merger\n \nOn September 28, 2025, we entered into a Merger Agreement pursuant to and subject to the terms and conditions of which we will be acquired by the Consortium. For further details on this proposed transaction, see \nNote 1\n5\n of the Condensed Consolidated Financial Statements and \"Part II—Item 1A. Risk Factors\" contained elsewhere in this Form 10-Q.\nAbout Electronic Arts\nElectronic Arts is a global leader in digital interactive entertainment. We develop, market, publish and deliver games, content and services that can be experienced on game consoles, PCs, and mobile devices. We create innovative games and experiences that deliver high-quality interactive entertainment and drive engagement across our global network of hundreds of millions of players. Through our live services offerings, we offer high-quality experiences designed to provide value to players and extend and enhance gameplay. These live services include extra content, subscription offerings and other revenue generated in addition to the sale of our full games. We are focusing on building games and experiences that grow the global online communities around our key franchises; deepening engagement through connecting interactive storytelling to key intellectual property; and harnessing our communities to grow in, around, and beyond our games.\n31\nTable of Contents\nFinancial Results\nOur key financial results for our fiscal quarter ended September 30, 2025 were as follows:\n•\nTotal net revenue was $1,839 million, down 9 percent year-over-year.\n•\nLive services and other net revenue was $1,221 million, down 7 percent year-over-year.\n•\nGross margin was 75.9 percent, down 2 percentage points year-over-year. \n•\nOperating expenses were $1,196 million, up 1 percent year-over-year.\n•\nOperating income was $200 million, down 48 percent year-over-year.\n•\nNet income was $137 million with diluted earnings per share of $0.54.\n•\nNet cash provided by operating activities was $130 million, down 44 percent year-over-year.\n•\nTotal cash, cash equivalents and short-term investments were $1,260 million.\n•\nWe returned $423 million to stockholders through our capital return programs, which include repurchasing 2.3 million shares for approximately $375 million and paying $48 million through our quarterly cash dividend program.\nTrends in Our Business\nLive Services Business. \nWe offer our players high-quality experiences designed to provide value to players and to extend and enhance gameplay. These live services include extra content, subscription offerings and other revenue generated in addition to the sale of our full games and free-to-play games. Our net revenue attributable to live services and other was $5,345 million, $5,492 million, and $5,535 million for the trailing twelve months ended September 30, 2025, 2024, and 2023, respectively, and we expect that live services net revenue will continue to be material to our business. Within live services and other, net revenue attributable to extra content was $4,199 million, $4,393 million, and $4,374 million for the trailing twelve months ended September 30, 2025, 2024, and 2023, respectively. Growth in live services net revenue, including extra content may not be linear due to the competitive landscape, consumer buying patterns, and other factors. Our most popular live services are the extra content in the \nUltimate Team\n mode associated with our sports franchises. \nUltimate Team\n allows players to collect current and former players in order to build and compete as a personalized team. Live services net revenue generated from extra content purchased within \nUltimate Team\n, a substantial portion of which was derived from FC \nUltimate Team\n, is material to our business.\nDigital Delivery of Games. \nIn our industry, players increasingly purchase games digitally as opposed to purchasing physical discs. While this trend, as applied to our business, may not be linear due to a mix of products during a fiscal year, consumer buying patterns and other factors, over time we expect players to continue to purchase a higher proportion of our games digitally. As a result, we expect net revenue attributable to digital full game downloads to increase over time and net revenue attributable to sales of packaged goods to decrease.\nOur net revenue attributable to digital full game downloads was $1,478 million, $1,343 million, and $1,262 million during fiscal years 2025, 2024, and 2023, respectively; while our net revenue attributable to packaged goods sales was $524 million, $672 million, and $675 million in fiscal years 2025, 2024, and 2023, respectively. In addition, as measured based on total units sold on Microsoft’s Xbox One and Xbox Series X and Sony’s PlayStation 4 and 5 rather than by net revenue, we estimate that 78 percent, 73 percent, and 68 percent of our total units sold during fiscal years 2025, 2024, and 2023, were sold digitally. Digital full game units are based on sales information provided by Microsoft and Sony; packaged goods units sold through are estimated by obtaining data from significant retail and distribution partners in North America, Europe and Asia, and applying internal sales estimates with respect to retail partners from which we do not obtain data. We believe that these percentages are reasonable estimates of the proportion of our games that are digitally downloaded in relation to our total number of units sold for the applicable period of measurement.\nIncreases in consumer adoption of digital purchase of games combined with increases in our live services revenue generally results in expansion of our gross margin, as costs associated with selling a game digitally are generally less than selling the same game through traditional retail and distribution channels.\nIncreased Competition. \nCompetition in our business is intense. Our competitors range from established interactive entertainment companies to emerging start-ups. In addition, we compete with large, diversified companies that have strengthened their interactive entertainment capabilities. Our competitors have access to certain resources such as larger budgets, tools, technologies, or IP portfolios that can lead to greater consumer success and shift player time and engagement away from our products and services. In addition, our leading position within the interactive entertainment industry makes us a prime target for recruiting our executives, as well as key creative and technical talent, resulting in retention challenges and increased cost to retain and incentivize our key people.\n32\nTable of Contents\nConcentration of Sales Among the Most Popular Games\n. In our industry, we see a large portion of games sales concentrated on the most popular titles. Similarly, a significant portion of our revenue has been derived from games based on a few popular titles, such as EA SPORTS FC, EA SPORTS College Football, EA SPORTS Madden NFL, \nApex Legends\n, Battlefield, and The Sims. In particular, we have historically derived a significant portion of our net revenue from our global football franchise, the annualized version of which is consistently one of the best-selling games in the marketplace.  \nNet Bookings\n. In order to improve transparency into our business, we disclose an operating performance metric, net bookings. Net bookings is defined as the net amount of products and services sold digitally or sold-in physically in the period. Net bookings is calculated by adding total net revenue to the change in deferred net revenue for online-enabled games.\nThe following is a calculation of our total net bookings for the periods presented:\nThree Months Ended \nSeptember 30,\nSix Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\n2025\n2024\nNet revenue\n$\n1,839 \n$\n2,025 \n$\n3,510 \n$\n3,685 \nChange in deferred net revenue (online-enabled games)\n(21)\n54 \n(394)\n(344)\nNet bookings\n$\n1,818 \n$\n2,079 \n$\n3,116 \n$\n3,341 \nNet bookings were $1,818 million for the three months ended September 30, 2025, primarily driven by sales related to our global football, American football, and The Sims franchises\n. \nNet bookings decreased $261 million, or 13 percent, as compared to the three months ended September 30, 2024, primarily due to a year-over-year decrease in sales from EA SPORTS College Football and our global football franchise, partially offset by an increase in sales from \nSplit Fiction\n and EA SPORTS Madden NFL\n.\n Live services and other net bookings were $1,118 million for the three months ended September 30, 2025, and decreased $129 million, or 10 percent, as compared to the three months ended September 30, 2024.\n \nThe decrease in live services and other net bookings was primarily due to decreased sales of extra content from \nUltimate Team\n within our global football franchise and EA SPORTS College Football\n,\n partially offset by increased sales of extra content from \nApex Legends. \nFull game net bookings were $700 million for the three months ended September 30, 2025, and decreased $132 million, or 16 percent, as compared to the three months ended September 30, 2024, primarily due to a year-over-year decline from EA SPORTS College Football, partially offset by \nSplit Fiction \nand EA SPORTS Madden NFL.\n33\nTable of Contents\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur Condensed Consolidated Financial Statements have been prepared in accordance with accounting principles generally accepted in the United States (“U.S. GAAP”). The preparation of these Condensed Consolidated Financial Statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, contingent assets and liabilities, and revenue and expenses during the reporting periods. The policies discussed below are considered by management to be critical because they are not only important to the portrayal of our financial condition and results of operations, but also because application and interpretation of these policies requires both management judgment and estimates of matters that are inherently uncertain and unknown. As a result, actual results may differ materially from our estimates.\nRevenue Recognition\nWe derive revenue principally from sales of our games, and related extra content and services that can be experienced on game consoles, PCs, and mobile devices. Our product and service offerings include, but are not limited to, the following:\n•\nfull games with both online and offline functionality (“Games with Services”), which generally includes (1) the initial game delivered digitally or via physical disc at the time of sale and typically provide access to offline core game content (“software license”); (2) updates on a when-and-if-available basis, such as software patches or updates, and/or additional free content to be delivered in the future (“future update rights”); and (3) a hosted connection for online playability (“online hosting”);\n•\nfull games with online-only functionality which require an Internet connection to access all gameplay and functionality (“Online-Hosted Service Games”);\n•\nextra content related to Games with Services and Online-Hosted Service Games which provides access to additional in-game content;\n•\nsubscriptions, such as EA Play and EA Play Pro, that generally offer access to a selection of full games, in-game content, online services and other benefits typically for a recurring monthly or annual fee; and\n•\nlicensing to third parties to distribute and host our games and content.\nWe evaluate and recognize revenue by:\n•\nidentifying the contract(s) with the customer;\n•\nidentifying the performance obligations in the contract;\n•\ndetermining the transaction price;\n•\nallocating the transaction price to performance obligations in the contract; and\n•\nrecognizing revenue as each performance obligation is satisfied through the transfer of a promised good or service to a customer (i.e., “transfer of control”).\nCertain of our full game and/or extra content are sold to resellers with a contingency that the full game and/or extra content cannot be resold prior to a specific date (“Street Date Contingency”). We recognize revenue for transactions that have a Street Date Contingency when the Street Date Contingency is removed and the full game and/or extra content can be resold by the reseller. For digital full game and/or extra content downloads sold to customers, we recognize revenue when the full game and/or extra content is made available for download to the customer.\nOnline-Enabled Games\nGames with Services. \nOur sales of Games with Services are evaluated to determine whether the software license, future update rights and the online hosting are distinct and separable. Sales of Games with Services are generally determined to have three distinct performance obligations: software license, future update rights, and the online hosting.\nSince we do not sell the performance obligations on a stand-alone basis, we consider market conditions and other observable inputs to estimate the stand-alone selling price for each performance obligation. For Games with Services, generally 75 percent of the sales price is allocated to the software license performance obligation and recognized at a point in time when control of the license has been transferred to the customer. The remaining 25 percent is allocated to the future update rights and the online hosting performance obligations and recognized ratably as the service is provided (over the Estimated Offering Period).\n34\nTable of Contents\nOnline-Hosted Service Games. \nSales of our Online-Hosted Service Games are determined to have one distinct performance obligation: the online hosting service. We recognize revenue from these arrangements ratably as the service is provided (over the Estimated Offering Period).\nExtra Content. \nRevenue received from sales of downloadable content are derived primarily from the sale of virtual currencies and digital in-game content that are designed to extend and enhance players’ game experience. Sales of extra content are accounted for in a manner consistent with the treatment for our Games with Services and Online-Hosted Service Games as discussed above, depending upon whether or not the extra content has offline functionality. That is, if the extra content has offline functionality, then the extra content is accounted for similarly to Games with Services (generally determined to have three distinct performance obligations: software license, future update rights, and the online hosting). If the extra content does not have offline functionality, then the extra content is determined to have one distinct performance obligation: the online-hosted service.\nSubscriptions\nSales of our subscriptions are determined to have one performance obligation: the online hosting. We recognize revenue from these arrangements ratably over the subscription term as the performance obligation is satisfied.\nLicensing Revenue\nWe utilize third-party licensees to distribute and host our games and content in accordance with license agreements, for which the licensees typically pay us a fixed minimum guarantee and/or sales-based royalties. These arrangements typically include multiple performance obligations, such as a time-based license of software and future update rights. We recognize as revenue a portion of the minimum guarantee when we transfer control of the license of software (generally upon commercial launch) and the remaining portion ratably over the contractual term in which we provide the licensee with future update rights. Any sales-based royalties are generally recognized as the related sales occur by the licensee.\nSignificant Judgments around Revenue Arrangements\nIdentifying performance obligations.\n Performance obligations promised in a contract are identified based on the goods and services that will be transferred to the customer that are both capable of being distinct, (i.e., the customer can benefit from the goods or services either on its own or together with other resources that are readily available), and are distinct in the context of the contract (i.e., it is separately identifiable from other goods or services in the contract). To the extent a contract includes multiple promises, we must apply judgment to determine whether those promises are separate and distinct performance obligations. If these criteria are not met, the promises are accounted for as a combined performance obligation.\nDetermining the transaction price.\n \nThe transaction price is determined based on the consideration that we will be entitled to receive in exchange for transferring our goods and services to the customer. Determining the transaction price often requires judgment, based on an assessment of contractual terms and business practices. It further includes review of variable consideration such as discounts, sales returns, price protection, and rebates, which is estimated at the time of the transaction. In addition, the transaction price does not include an estimate of the variable consideration related to sales-based royalties. Sales-based royalties are recognized as the sales occur.\nAllocating the transaction price. \nAllocating the transaction price requires that we determine an estimate of the relative stand-alone selling price for each distinct performance obligation. Determining the relative stand-alone selling price is inherently subjective, especially in situations where we do not sell the performance obligation on a stand-alone basis (which occurs in the majority of our transactions). In those situations, we determine the relative stand-alone selling price based on various observable inputs using all information that is reasonably available. Examples of observable inputs and information include: historical internal pricing data, cost plus margin analysis, pre-release versus post-release costs, and pricing data from competitors to the extent the data is available. The results of our analysis resulted in a specific percentage of the transaction price being allocated to each performance obligation.\nDetermining the Estimated Offering Period.\n The offering period is the period in which we offer to provide the future update rights and/or online hosting for the game and related extra content sold. Because the offering period is not an explicitly defined period, we must make an estimate of the offering period for the service-related performance obligations (i.e., future update rights and/or online hosting). Determining the Estimated Offering Period is inherently subjective and is subject to regular revision. Generally, we consider the average period of time customers are online when estimating the offering period. We also consider the estimated period of time between the date a game unit is sold to a reseller and the date the reseller sells the game \n35\nTable of Contents\nunit to the customer (i.e., time in channel). Based on these two factors, we then consider the method of distribution. For example, games and extra content sold at retail would have a composite offering period equal to the online gameplay period plus time in channel as opposed to digitally-distributed games and extra content which are delivered immediately via digital download and therefore, the offering period is estimated to be only the online gameplay period.\nAdditionally, we consider results from prior analyses, known and expected online gameplay trends, as well as disclosed service periods for competitors’ games in determining the Estimated Offering Period for future sales. We believe this provides a reasonable depiction of the transfer of future update rights and online hosting to our customers, as it is the best representation of the time period during which our games and extra content are experienced. We recognize revenue for future update rights and online hosting performance obligations ratably on a straight-line basis over this period as there is a consistent pattern of delivery for these performance obligations. Revenue for service-related performance obligations for digitally-distributed games and extra content is recognized over an estimated eight-month period beginning in the month of sale, and revenue for service-related performance obligations for games and extra content sold through retail is recognized over an estimated ten-month period beginning in the month of sale. Prior to July 1, 2025, revenue for service-related performance obligations related to our mobile free-to-play and PC and console free-to-play games was recognized generally over eight and twelve-month periods, respectively, beginning in the month of sale. \nDuring the three months ended September 30, 2025, we completed our annual evaluation of the Estimated Offering Period, and as a result, for sales beginning July 1, 2025, the revenue that we recognize for service-related performance obligation related to our mobile free-to-play and PC and console free-to-play games is recognized generally over an eleven-month period beginning in the month of sale. This change in Estimated Offering Period did not impact the amount of net bookings or the operating cash flows that we report. We expect that this change will move the recognition of approximately $78 million in net revenue from fiscal year 2026 into fiscal year 2027. During the three and six months ended September 30, 2025, this change to our Estimated Offering Period resulted in an estimated decrease in net revenue of $8 million and net income of $6 million, and a decrease of $0.02 diluted earnings per share.\nPrincipal Agent Considerations\nWe evaluate sales to end customers of our full games and related content via third-party storefronts, including digital storefronts such as Microsoft’s Xbox Store, Sony’s PlayStation Store, Apple App Store, and Google Play Store, in order to determine whether or not we are acting as the principal in the sale to the end customer, which we consider in determining if revenue should be reported gross or net of fees retained by the third-party storefront. An entity is the principal if it controls a good or service before it is transferred to the end customer. Key indicators that we evaluate in determining gross versus net treatment include but are not limited to the following:\n•\nthe underlying contract terms and conditions between the various parties to the transaction;\n•\nwhich party is primarily responsible for fulfilling the promise to provide the specified good or service to the end customer;\n•\nwhich party has discretion in establishing the price for the specified good or service; and\n•\nwhich party has title risk before the specified good or service has been transferred to the end customer.\nBased on an evaluation of the above indicators, except as discussed below, we have determined that generally the third party is considered the principal to end customers for the sale of our full games and related content. We therefore report revenue related to these arrangements net of the fees retained by the storefront. However, for sales arrangements via Apple App Store and Google Play Store, EA is considered the principal to the end customer and thus, we report revenue on a gross basis and mobile platform fees are reported within cost of revenue.\nIncome Taxes\nWe recognize deferred tax assets and liabilities for both (1) the expected impact of differences between the financial statement amount and the tax basis of assets and liabilities and (2) the expected future tax benefit to be derived from tax losses and tax credit carryforwards. We do not recognize any deferred taxes related to the U.S. taxes on foreign earnings as we recognize these taxes as a period cost. \n36\nTable of Contents\nWe record a valuation allowance against deferred tax assets when it is considered more likely than not that all or a portion of our deferred tax assets will not be realized. In making this determination, we are required to give significant weight to evidence that can be objectively verified. It is generally difficult to conclude that a valuation allowance is not needed when there is significant negative evidence, such as cumulative losses in recent years. Forecasts of future taxable income are considered to be less objective than past results. Therefore, cumulative losses weigh heavily in the overall assessment.\nIn addition to considering forecasts of future taxable income, we are also required to evaluate and quantify other possible sources of taxable income in order to assess the realization of our deferred tax assets, namely the reversal of existing deferred tax liabilities, the carryback of losses and credits as allowed under current tax law, and the implementation of tax planning strategies. Evaluating and quantifying these amounts involves significant judgments. Each source of income must be evaluated based on all positive and negative evidence and this evaluation may involve assumptions about future activity. Certain taxable temporary differences that are not expected to reverse during the carry forward periods permitted by tax law cannot be considered as a source of future taxable income that may be available to realize the benefit of deferred tax assets.\nEvery quarter, we perform a realizability analysis to evaluate whether it is more likely than not that all or a portion of our deferred tax assets will not be realized. Our Swiss deferred tax asset realizability analysis relies upon future Swiss taxable income, and considers all available sources of Swiss income based on positive and negative evidence. We give more weight to evidence that can be objectively verified. However, estimating future Swiss taxable income requires judgment, specifically related to assumptions about expected growth rates of future Swiss taxable income, which are based primarily on third party market and industry growth data. Actual results that differ materially from those estimates could have a material impact on our valuation allowance assessment. Swiss interest rates have an impact on the valuation allowance and are based on published Swiss guidance, which generally occurs in the fourth quarter of our fiscal year. Any significant changes to such interest rates could result in a material impact to the valuation allowance and to our Condensed Consolidated Financial Statements. We have adjusted our valuation allowance for changes in the published interest rates in the past and we may do so again in the future. Switzerland has a seven-year carryforward period and does not permit the carry back of losses. Actions we take in connection with acquisitions could also impact the utilization of our Swiss deferred tax asset. \nAs part of the process of preparing our Condensed Consolidated Financial Statements, we are required to estimate our income taxes in each jurisdiction in which we operate prior to the completion and filing of tax returns for such periods. This process requires estimating both our geographic mix of income and our uncertain tax positions in each jurisdiction where we operate. These estimates require us to make judgments about the likely application of the tax law to our situation, as well as with respect to other matters, such as anticipating the positions that we will take on tax returns prior to preparing the returns and the outcomes of disputes with tax authorities. The ultimate resolution of these issues may take extended periods of time due to examinations by tax authorities and statutes of limitations. In addition, changes in our business, including acquisitions, changes in our international corporate structure, changes in the geographic location of business functions or assets, changes in the geographic mix and amount of income, as well as changes in our agreements with tax authorities, valuation allowances, applicable accounting rules, applicable tax laws and regulations, rulings and interpretations thereof, developments in tax audit and other matters, and variations in the estimated and actual level of annual pre-tax income can affect the overall effective tax rate.\nIMPACT OF RECENTLY ISSUED ACCOUNTING STANDARDS\nThe information under the subheading “Other Recently Issued Accounting Standards” in \nNote 1 — Description of Business and Basis of Presentation\n to the Condensed Consolidated Financial Statements in this Form 10-Q is incorporated by reference into this Item 2.\n37\nTable of Contents\nRESULTS OF OPERATIONS\nOur fiscal year is reported on a 52- or 53-week period that ends on the Saturday nearest March 31. Our results of operations for the fiscal year ending March 31, 2026 contains 52 weeks and ends on March 28, 2026. Our results of operations for the fiscal year ended March 31, 2025 contained 52 weeks and ended on March 29, 2025. Our results of operations for the three and six months ended September 30, 2025 contained 13 weeks and 26 weeks, respectively, and ended on September 27, 2025. Our results of operations for the three and six months ended September 30, 2024 contained 13 weeks and 26 weeks, respectively, and ended on September 28, 2024. For simplicity of disclosure, all fiscal periods are referred to as ending on a calendar month end.\nNet Revenue\nNet revenue consists of sales generated from (1) full games sold as digital downloads or as packaged goods and designed for play on game consoles and PCs, (2) live services which primarily includes sales of extra content for console, PC, and mobile games, (3) subscriptions that generally offer access to a selection of full games, in-game content, online services and other benefits, and (4) licensing our games to third parties to distribute and host our games and content.\nNet Revenue Quarterly Analysis\nNet Revenue\nNet revenue for the three months ended September 30, 2025 was $1,839 million, primarily driven by sales related to our global football, American football, and The Sims franchises.\n \nNet revenue for the three months ended September 30, 2025 decreased $186 million as compared to the three months ended September 30, 2024. This decrease was driven by a $251 million decrease in net revenue primarily due to our American football franchises and decreased sales of extra content for \nApex Legends, \npartially offset by a $65 million increase in net revenue primarily due to \nSplit Fiction\n.\nNet Revenue by Composition\nOur net revenue by composition for the three months ended September 30, 2025 and 2024 was as follows (in millions):\nThree Months Ended September 30,\n2025\n2024\n$ Change\n% Change\nNet revenue:\nFull game downloads\n$\n401 \n$\n475 \n$\n(74)\n(16)\n%\nPackaged goods\n217 \n241 \n(24)\n(10)\n%\nFull game\n$\n618 \n$\n716 \n$\n(98)\n(14)\n%\nLive services and other\n$\n1,221 \n$\n1,309 \n$\n(88)\n(7)\n%\nTotal net revenue\n$\n1,839 \n$\n2,025 \n$\n(186)\n(9)\n%\nFull Game Net Revenue\nFull game net revenue includes full game downloads and packaged goods. Full game downloads primarily include revenue from digital sales of full games on console, PC, and certain licensing revenue. Packaged goods primarily include revenue from full games that are sold physically through distribution arrangements, mass market retailers, and specialty stores.\nFor the three months ended September 30, 2025, full game net revenue was $618 million, primarily driven by \nEA\n \nSPORTS FC 26, EA SPORTS College Football 26, \nand \nEA SPORTS Madden NFL 26. \nFull game net revenue for the three months ended September 30, 2025 decreased $98 million, or 14 percent, as compared to the three months ended September 30, 2024, primarily due to a year-over-year decline in EA SPORTS College Football, partially offset by \nSplit Fiction\n and EA SPORTS Madden NFL.\nLive Services and Other Net Revenue\nLive services and other net revenue primarily includes revenue from sales of extra content for console, PC, and mobile games, certain licensing revenue, subscriptions, and advertising.\n38\nTable of Contents\nFor the three months ended September 30, 2025, live services and other net revenue was $1,221 million, primarily driven by sales of extra content for our global football, American football, and The Sims franchises\n. \nLive services and other net revenue for the three months ended September 30, 2025 decreased $88 million, or 7 percent, as compared to the three months ended September 30, 2024. This decrease was primarily driven by decreased sales of extra content for\n Apex Legends\n, from \nUltimate team \nwithin EA SPORTS Madden NFL,\n \nand our mobile catalog portfolio, partially offset by increased sales of extra content from \nUltimate Team\n within EA SPORTS College Football\n.\nNet Revenue Year-to-Date Analysis\nNet Revenue\nNet revenue for the six months ended September 30, 2025 was $3,510 million, primarily driven by sales related to our global football, American football, and The Sims franchises.\n \nNet revenue for the six months ended September 30, 2025 decreased $175 million as compared to the six months ended September 30, 2024. This decrease was driven by a $322 million decrease in net revenue primarily due to sales of extra content for \nApex Legends \nand a decrease in net revenue from our American football franchises, partially offset by a $147 million increase in net revenue primarily driven by\n Split Fiction.\nNet Revenue by Composition\nOur net revenue by composition for the six months ended September 30, 2025 and 2024 was as follows (in millions):\nSix Months Ended September 30,\n2025\n2024\n$ Change\n% Change\nNet revenue:\nFull game downloads\n$\n634 \n$\n665 \n$\n(31)\n(5)\n%\nPackaged goods\n273 \n301 \n(28)\n(9)\n%\nFull game\n$\n907 \n$\n966 \n$\n(59)\n(6)\n%\nLive services and other\n$\n2,603 \n$\n2,719 \n$\n(116)\n(4)\n%\nTotal net revenue\n$\n3,510 \n$\n3,685 \n$\n(175)\n(5)\n%\nFull Game Net Revenue\nFor the six months ended September 30, 2025, full game net revenue was $907 million, primarily driven by \nEA\n \nSPORTS FC 26, EA\n \nSPORTS FC 25, EA SPORTS College Football 26, Split Fiction, \nand \nEA SPORTS Madden NFL 26. \nFull game net revenue for the six months ended September 30, 2025 decreased $59 million, or 6 percent, as compared to the six months ended September 30, 2024, primarily due to a year-over-year decline in EA SPORTS College Football, partially offset by \nSplit Fiction\n.\nLive Services and Other Net Revenue\nFor the six months ended September 30, 2025, live services and other net revenue was $2,603 million, primarily driven by sales of extra content for our global football, American football, and The Sims franchises\n. \nLive services and other net revenue for the six months ended September 30, 2025 decreased $116 million, or 4 percent, as compared to the six months ended September 30, 2024. This decrease was primarily driven by decreased sales of extra content for\n Apex Legends \nand \nUltimate Team\n within EA SPORTS Madden NFL, partially offset by an increase in net revenue primarily due to sales of extra content from \nUltimate Team\n within EA SPORTS College Football.\nCost of Revenue Quarterly Analysis\nCost of revenue consists of (1) certain royalty expenses for sports organizations, movie studios, independent software developers, and others (2) mobile platform fees associated with our mobile revenue (for transactions in which we are acting as the principal in the sale to the end customer), (3) data center, bandwidth and server costs associated with hosting our online games and websites, (4) inventory costs, including manufacturing royalties, (5) payment processing fees, (6) amortization and impairments of certain intangible assets, and (7) personnel-related costs.\n39\nTable of Contents\nCost of revenue for the three months ended September 30, 2025 and 2024 was as follows (in millions):\nSeptember 30,\n2025\n% of Net Revenue\nSeptember 30,\n2024\n% of Net Revenue\n% Change\nChange as a % of Net Revenue\n$\n443 \n24 \n%\n$\n456 \n23 \n%\n(3)\n%\n1 \n%\nCost of Revenue\nCost of revenue decreased by $13 million during the three months ended September 30, 2025, as compared to the three months ended September 30, 2024, primarily due to a year-over-year decrease in product related costs from EA SPORTS College Football and sales performance from royalty bearing titles\n.\nCost of Revenue Year-to-Date Analysis\nCost of revenue for the six months ended September 30, 2025 and 2024 was as follows (in millions):\nSeptember 30,\n2025\n% of Net Revenue\nSeptember 30,\n2024\n% of Net Revenue\n% Change\nChange as a % of Net Revenue\n$\n722 \n21 \n%\n$\n719 \n20 \n%\n— \n%\n1 \n%\nCost of Revenue\nCost of revenue increased by $3 million during the six months ended September 30, 2025, as compared to the six months ended September 30, 2024, primarily due to the mix of sales from royalty-bearing titles and impacts from foreign exchange, partially offset by a decrease in online hosting and platform fees and a decrease in product related costs from EA SPORTS College Football\n.\nResearch and Development\nResearch and development expenses consist of expenses incurred by our production studios for personnel-related costs, related overhead costs, external third-party development costs, contracted services, and depreciation. Research and development expenses for our online products include expenses incurred by our studios consisting of direct development and related overhead costs in connection with the development and production of our online games. Research and development expenses also include expenses associated with our digital platform, software licenses and maintenance, and management overhead.\nResearch and development expenses for the three and six months ended September 30, 2025 and 2024 were as follows (in millions):\nSeptember 30,\n2025\n% of Net\nRevenue\nSeptember 30,\n2024\n% of Net\nRevenue\n$ Change\n% Change\nThree months ended\n$\n686 \n37 \n%\n$\n648 \n32 \n%\n$\n38 \n6 \n%\nSix months ended\n$\n1,392 \n40 \n%\n$\n1,277 \n35 \n%\n$\n115 \n9 \n%\nResearch and development expenses increased by $38 million, or 6 percent, during the three months ended September 30, 2025, as compared to the three months ended September 30, 2024. This increase was primarily due to a $22 million increase in digital infrastructure costs, primarily driven by the \nBattlefield 6 \nopen beta, and a $17 million increase in studio-related contracted services.\nResearch and development expenses increased by $115 million, or 9 percent, during the six months ended September 30, 2025, as compared to the six months ended September 30, 2024. This increase was primarily due to a $52 million increase in personnel-related expenses as part of our continued investment in our studios, a $36 million increase in studio-related contracted services, and a $28 million increase in digital infrastructure costs.\n40\nTable of Contents\nMarketing and Sales\nMarketing and sales expenses consist of advertising, marketing and promotional expenses, personnel-related costs, and related overhead costs.\nMarketing and sales expenses for the three and six months ended September 30, 2025 and 2024 were as follows (in millions):\nSeptember 30,\n2025\n% of Net\nRevenue\nSeptember 30,\n2024\n% of Net\nRevenue\n$ Change\n% Change\nThree months ended\n$\n304 \n17 \n%\n$\n272 \n13 \n%\n$\n32 \n12 \n%\nSix months ended\n$\n518 \n15 \n%\n$\n477 \n13 \n%\n$\n41 \n9 \n%\nMarketing and sales expenses increased by $32 million, or 12 percent, during the three months ended September 30, 2025, as compared to the three months ended September 30, 2024. This increase was primarily due to higher advertising and marketing spending related to pre-release activities for \nBattlefield 6\n and \nskate.\n, partially offset by reduced spending for \nApex Legends.\nMarketing and sales expenses increased by $41 million, or 9 percent, during the six months ended September 30, 2025, as compared to the six months ended September 30, 2024. This increase was primarily due to higher advertising and marketing spending related to pre-release activities for \nBattlefield 6\n and for our American football franchises, partially offset by reduced spending for \nApex Legends.\nGeneral and Administrative\nGeneral and administrative expenses consist of personnel and related expenses of executive and administrative staff, corporate functions such as finance, legal, human resources, and information technology (“IT”), related overhead costs, fees for professional services, and allowances for doubtful accounts.\nGeneral and administrative expenses for the three and six months ended September 30, 2025 and 2024 were as follows (in millions):\nSeptember 30,\n2025\n% of Net\nRevenue\nSeptember 30,\n2024\n% of Net\nRevenue\n$ Change\n% Change\nThree months ended\n$\n189 \n10 \n%\n$\n197 \n10 \n%\n$\n(8)\n(4)\n%\nSix months ended\n$\n373 \n11 \n%\n$\n377 \n10 \n%\n$\n(4)\n(1)\n%\nGeneral and administrative expenses decreased by $8 million, or 4 percent, during the three months ended September 30, 2025, as compared to the three months ended September 30, 2024. This decrease was primarily due to a $4 million decrease in contracted services and a $2 million decrease in personnel-related costs.\nGeneral and administrative expenses decreased by $4 million, or 1 percent, during the six months ended September 30, 2025, as compared to the six months ended September 30, 2024. This decrease was primarily due to a $6 million decrease in contracted services, partially offset by a $4 million increase in personnel-related costs.\nIncome Taxes\nOn July 4, 2025, the United States enacted OBBB which extended or modified certain corporate tax provisions under the 2017 TCJA. The changes resulting from the tax provisions of OBBB are not expected to have a material impact on our results of operations.\nProvision for income taxes for the three and six months ended September 30, 2025 and 2024 were as follows (in millions):\nSeptember 30, 2025\nEffective Tax Rate\nSeptember 30, 2024\nEffective Tax Rate\n$ Change\nThree months ended\n$\n60 \n30 \n%\n$\n105 \n26 \n%\n$\n(45)\nSix months ended\n$\n132 \n28 \n%\n$\n219 \n28 \n%\n$\n(87)\nThe provision for income taxes for the three and six months ended September 30, 2025 is based on our projected annual effective tax rate for fiscal year 2026, adjusted for specific items that are required to be recognized in the period in which they \n41\nTable of Contents\nare incurred. The increase in the three month effective tax rate year-over-year is primarily due to one-time tax benefits recorded in the prior year related to a legislative update and tax refund claim.\nThe European Union and other countries, including Switzerland, have enacted, or have committed to enact global minimum taxes, commonly referred to as Pillar II, as proposed by the Organization for Economic Cooperation and Development (“OECD”), effective with our fiscal year 2025. Pillar II in the relevant countries where we operate did not have a material impact on our tax provision for the three or six months ended September 30, 2025. On June 28, 2025, the G7 countries announced an agreement on the potential application of Pillar II to U.S.-parented multinationals. We will monitor legislative guidance to evaluate potential Pillar II impacts as they become available.\nLIQUIDITY AND CAPITAL RESOURCES\n(In millions)\nAs of \nSeptember 30, 2025\nAs of \nMarch 31, 2025\nIncrease/(Decrease)\nCash and cash equivalents\n$\n1,148 \n$\n2,136 \n$\n(988)\nShort-term investments\n112 \n112 \n— \nTotal\n$\n1,260 \n$\n2,248 \n$\n(988)\nPercentage of total assets\n11 \n%\n18 \n%\n \nSix Months Ended \nSeptember 30,\n \n(In millions)\n2025\n2024\nChange\nNet cash provided by operating activities\n$\n147 \n$\n354 \n$\n(207)\nNet cash used in investing activities\n(157)\n(115)\n(42)\nNet cash used in financing activities\n(997)\n(948)\n(49)\nEffect of foreign exchange on cash and cash equivalents\n19 \n6 \n13 \nNet increase (decrease) in cash and cash equivalents\n$\n(988)\n$\n(703)\n$\n(285)\nChanges in Cash Flow\nOperating Activities.\n Net cash provided by operating activities decreased by $207 million during the six months ended September 30, 2025, as compared to the six months ended September 30, 2024, primarily driven by lower cash collections from sales, higher personnel-related payments, and lower cash inflows from hedging activities, partially offset by lower cash payments for income taxes.\nInvesting Activities. \nNet cash used in investing activities increased by $42 million during the six months ended September 30, 2025, as compared to the six months ended September 30, 2024, primarily driven by lower proceeds from maturities and sales of short-term investments and acquisition-related payments, partially offset by reduced purchases of short-term and other investments.\nFinancing Activities.\n Net cash used in financing activities increased by $49 million during the six months ended September 30, 2025, as compared to the six months ended September 30, 2024, primarily due to a $38 million increase in cash paid to taxing authorities in connection with withholding taxes for stock-based compensation.\nShort-term Investments\nDue to our mix of fixed and variable rate securities, our short-term investment portfolio is susceptible to changes in short-term interest rates. As of September 30, 2025, our short-term investments had net unrealized gains of less than $1 million or less than 1 percent of total short-term investments. From time to time, we may liquidate some or all of our short-term investments to fund operational needs or other activities, such as capital expenditures, business acquisitions or debt repayment obligations.\nSenior Notes\nIn February 2021, we issued $750 million aggregate principal amount of the 2031 Notes and $750 million aggregate principal amount of the 2051 Notes. The effective interest rate is 1.98% for the 2031 Notes and 3.04% for the 2051 Notes. Interest is payable semiannually in arrears, on February 15 and August 15 of each year.\n42\nTable of Contents\nIn February 2016, we issued $400 million aggregate principal amount of the 2026 Notes. The effective interest rate is 4.97% for the 2026 Notes. Interest is payable semiannually in arrears, on March 1 and September 1 of each year.\nSee \nNote 10 — Financing Arrangements\n \nto the Condensed Consolidated Financial Statements in this Form 10-Q as it relates to our Senior Notes, which is incorporated by reference into this Item 2.\nCredit Facility\nOn March 22, 2023, we entered into a $500 million unsecured revolving credit facility (the \"Credit Facility\") with a syndicate of banks. The Credit Facility terminates on March 22, 2028 unless the maturity is extended in accordance with its terms. As of \nSeptember 30, 2025\n, no amounts were outstanding. The Credit Facility contains an option to arrange with existing lenders and/or new lenders to provide up to an aggregate of $500 million in additional commitments for revolving loans. Proceeds of loans made under the Credit Facility may be used for general corporate purposes.\n See \nNote 10 — Financing Arrangements\n to the Condensed Consolidated Financial Statements in this Form 10-Q as it relates to our Credit Facility, which is incorporated by reference into this Item 2.\nFinancial Condition\nOur material cash requirements, including commitments for capital expenditure, as of September 30, 2025 are set forth in our \nNote 11 — Commitments and Contingencies\n to the Condensed Consolidated Financial Statements in this Form 10-Q, which is incorporated by reference into this Item 2. We believe that our cash, cash equivalents, short-term investments, cash generated from operations and available financing facilities will be sufficient to meet these material cash requirements, which include licensing intellectual property from sports organizations and players associations used in our EA SPORTS titles and third-party content, debt repayment obligations, and to fund our operating requirements for the next 12 months and beyond. Our operating requirements include working capital requirements, capital expenditures, our capital return programs, and potentially, future acquisitions or strategic investments. We may choose at any time to raise additional capital to repay debt, strengthen our financial position, facilitate expansion, repurchase our stock, pursue strategic acquisitions and investments, and/or to take advantage of business opportunities as they arise. There can be no assurance, however, that such additional capital will be available to us on favorable terms, if at all, or that it will not result in substantial dilution to our existing stockholders.\nDuring the six months ended September 30, 2025, we returned $846 million to stockholders through our capital return programs, which include repurchasing 5.3 million shares for approximately $750 million and paying $96 million through our quarterly cash dividend program.\nOur foreign subsidiaries are generally subject to U.S. tax, and to the extent earnings from these subsidiaries can be repatriated without a material tax cost, such earnings will not be indefinitely reinvested. As of September 30, 2025, approximately $737 million of our cash and cash equivalents were domiciled in foreign tax jurisdictions. All of our foreign cash is available for repatriation without a material tax cost.\nWe have a “shelf” registration statement on Form S-3 on file with the SEC. This shelf registration statement, which includes a base prospectus, allows us at any time to offer any combination of securities described in the prospectus in one or more offerings. Unless otherwise specified in a prospectus supplement accompanying the base prospectus, we would use the net proceeds from the sale of any securities offered pursuant to the shelf registration statement for general corporate purposes, which may include funding for working capital, financing capital expenditures, research and development, marketing and distribution efforts, and if opportunities arise, for acquisitions or strategic alliances. Pending such uses, we may invest the net proceeds in interest-bearing securities. In addition, we may conduct concurrent or other financings at any time.\nOur ability to maintain sufficient liquidity could be affected by various risks and uncertainties including, but not limited to, customer demand and acceptance of our products, our ability to collect our accounts receivable as they become due, successfully achieving our product release schedules and attaining our forecasted sales objectives, economic conditions in the United States and abroad, the impact of acquisitions and other strategic transactions in which we may engage, the impact of competition, the seasonal and cyclical nature of our business and operating results, and the other risks described in the “\nRisk Factors\n” section, included in Part II, Item 1A of this report.\nAs of September 30, 2025, we did not have any off-balance sheet arrangements.\n43\nTable of Contents"
}