{
  "source_file": "ebay-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2:    \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nYou should read the following Management’s Discussion and Analysis of Financial Condition and Results of Operations in conjunction with the condensed consolidated financial statements and the related notes included in this report. This section of this Form 10-Q generally discusses items relating to the three and nine-month periods ended September 30, 2025 and 2024 and comparisons between the respective periods.\nOVERVIEW\nUnless otherwise expressly stated or the context otherwise requires, when we refer to “we,” “our,” “us,” “eBay” or the “Company” in this Quarterly Report on Form 10-Q, we mean eBay Inc. and its consolidated subsidiaries. \n \nBusiness\neBay Inc. is a global commerce leader that connects people and builds communities to create economic opportunity for all. Our technology empowers millions of buyers and sellers in more than 190 markets around the world, providing everyone the opportunity to grow and thrive. Our Marketplace platforms, including our online marketplace located at www.ebay.com and its localized counterparts, our off-platform marketplaces and our suite of mobile apps, together, create one of the world's largest and most vibrant marketplaces for discovering great value and unique selection.\nGross Merchandise Volume (“GMV”) grew during the first nine months of 2025 as we executed on our strategy across Focus Categories, country-specific investments, and horizontal initiatives. GMV growth was partially offset by pressure in discretionary spending across certain markets primarily resulting from geopolitical events, inflationary pressure, elevated interest rates, and changes in and uncertainty regarding global tariffs and trade policies, which we expect to continue through the end of 2025.\nFX-Neutral Presentation\nIn addition to presenting net revenues in accordance with U.S. generally accepted accounting principles (“GAAP”), we also present foreign exchange neutral (“FX-Neutral”) net revenues to supplement our results of operations presented in accordance with GAAP and to enhance investors’ understanding of our global business performance by excluding the positive or negative year-over-year impact of foreign currency movements on reported net revenues. We define FX-Neutral net revenues as GAAP net revenues minus the exchange rate effect, which we calculate by applying prior period foreign currency exchange rates to current year transactional currency amounts, excluding hedging activity. We believe presenting FX-Neutral net revenues provides useful information to both management and investors by isolating the effects of foreign currency exchange rate fluctuations that may not be indicative of our core operating results. In addition, as we have historically reported certain FX-Neutral results to investors, we believe that continuing to include these FX-Neutral measures provides consistency in our financial reporting. FX-Neutral net revenues are non-GAAP financial measures that are not based on any comprehensive set of accounting rules or principles and may be calculated differently than other “FX-Neutral,” “constant currency,” or similarly titled measures used by other companies. FX-Neutral net revenues are not presented as an alternative to GAAP net revenues and should only be used to evaluate our results of operations in conjunction with GAAP net revenues.\n42\nTable of Contents\nQuarter Highlights\nNet revenues increased 9% to $2,820 million for the three months ended September 30, 2025 compared to $2,576 million during the same period in 2024. The increase in net revenues was primarily due to higher GMV, increased penetration of first party advertising and the ramping of our U.K. managed shipping program. The increase in net revenues was partially offset by lower seller fees in connection with our U.K. consumer-to-consumer initiative.\nOperating margin decreased to 20.4% for the three months ended September 30, 2025 compared to 23.1% during the same period in 2024 primarily due to higher non-recurring general and administrative expenses related to legal matters and restructuring.\nWe generated cash flow from continuing operating activities of $934 million for the three months ended September 30, 2025 compared to $755 million in the same period in 2024.\nWe repurchased $625 million of common stock and paid $132 million in cash dividends during the three months ended September 30, 2025.\nOn October 22, 2025, we redeemed the $425 million aggregate principal amount of our previously outstanding 5.900% senior notes due in November 2025. Total cash consideration paid was $425 million, as the redemption price was equal to 100% of the principal amount. In addition, we paid accrued and unpaid interest on the principal amount.\nIn October 2025, our Audit Committee, pursuant to delegated authority from our Board of Directors (our “Board”), declared a quarterly cash dividend of $0.29 per share of common stock to be paid on December 12, 2025 to stockholders of record as of November 28, 2025.\n43\nTable of Contents\nRESULTS OF OPERATIONS\nWe have one reportable segment, which reflects how our chief operating decision maker, our President and Chief Executive Officer, reviews and assesses performance of the business. This reportable segment includes our online marketplace located at www.ebay.com and its localized counterparts, our off-platform marketplaces and our suite of mobile apps. The accounting policies of this segment are the same as those described in “Note 1 — The Company and Summary of Significant Accounting Policies” in our condensed consolidated financial statements included elsewhere in this report.\nNet Revenues\nWe generate revenues from the following activities:\nMarketplace revenues\n primarily consist of commissions related to the connection service including final value fees, listing fees, feature fees, and foreign exchange fees. Marketplace revenues also include store subscription fees, shipping fees, and certain other fees. Marketplace revenues are reduced by customer incentive programs, including discounts, coupons, and rewards.\nAdvertising revenues\n primarily consist of fees charged to sellers to promote their listings on our Marketplace platforms, as well as third-party advertising fees.\nThe following table presents net revenues for the periods indicated (in millions, except percentages):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nMarketplace revenues \n(1)\n$\n2,295 \n$\n2,168 \n6 \n%\n$\n6,686 \n$\n6,514 \n3 \n%\nAdvertising revenues \n(1)\n525 \n408 \n29 \n%\n1,449 \n1,190 \n22 \n%\nNet revenues\n$\n2,820 \n$\n2,576 \n9 \n%\n$\n8,135 \n$\n7,704 \n6 \n%\n(1)\nBeginning January 1, 2025, we began classifying certain immaterial revenues previously reported as Marketplace revenues as Advertising revenues. Amounts reported for the \nthree and nine\n months ended \nSeptember 30, 2025\n reflect this updated basis of presentation. Under this updated basis of presentation, Marketplace and Advertising revenues would have been $2,152 million and $424 million, respectively, for the \nthree months\n ended \nSeptember 30, 2024\n and $6,474 million and $1,230 million, respectively, for the \nnine\n months ended \nSeptember 30, 2024\n.\nSeasonality\nWe expect volume on our Marketplace platforms to trend with general consumer buying patterns. Seasonal trends in net revenues have been, and we expect in the future will be, influenced by macroeconomic conditions, including tariffs and global trade policies, foreign exchange rate fluctuations, as well as new and updated products and initiatives. The following table presents our total net revenues and the sequential quarterly movements of these net revenues for the periods indicated (in millions, except percentages):\n \nQuarter Ended\n \nMarch 31\nJune 30\nSeptember 30\nDecember 31\n2023\nNet revenues\n$\n2,510 \n$\n2,540 \n$\n2,500 \n$\n2,562 \n% change from prior quarter\n— \n%\n1 \n%\n(2)\n%\n2 \n%\n2024\nNet revenues\n$\n2,556 \n$\n2,572 \n$\n2,576 \n$\n2,579 \n% change from prior quarter\n— \n%\n1 \n%\n— \n%\n— \n%\n2025\nNet revenues\n$\n2,585 \n$\n2,730 \n$\n2,820 \n$\n— \n% change from prior quarter\n— \n%\n6 \n%\n3 \n%\n44\nTable of Contents\nNet Revenues by Geography\nRevenues are attributed to the United States and international geographies primarily based upon the country in which the customer is located. The following table presents net revenues by geography for the periods indicated (in millions, except percentages):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nUnited States\n$\n1,453 \n$\n1,302 \n12 \n%\n$\n4,196 \n  \n$\n3,897 \n8 \n%\nPercentage of net revenues\n52 \n%\n51 \n%\n52 \n%\n51 \n%\nInternational\n1,367 \n1,274 \n7 \n%\n3,939 \n3,807 \n3 \n%\nPercentage of net revenues\n48 \n%\n49 \n%\n48 \n%\n49 \n%\nNet revenues \n(1)\n$\n2,820 \n$\n2,576 \n9 \n%\n$\n8,135 \n$\n7,704 \n6 \n%\n(1)\nNet revenues included $24 million and $22 million\n \nof hedging losses for the three and nine months ended September 30, 2025, respectively, compared to $11 million and $31 million, respectively,\n \nof hedging losses during the same periods in 2024.\nOur Marketplace platforms operate globally, resulting in certain revenues that are denominated in foreign currencies, primarily the British pound and the euro. Year-over-year appreciation or depreciation of the U.S. dollar may have a material impact to our financial results, as we have experienced and may continue to experience elevated foreign currency volatility in the future, including as a result of tariffs and global trade announcements. Through our hedging programs, we actively monitor foreign currency volatility and attempt to mitigate significant movements. As shown in the table above, we generate approximately half of our net revenues internationally. Therefore, we are subject to the risks related to conducting business in foreign countries as discussed in “Part I — Item 1A: Risk Factors” of the 2024 Form 10-K.\nForeign currency movements relative to the U.S. dollar had favorable impacts of $20 million and $31 million for the three and nine months ended September 30, 2025, respectively, compared to unfavorable impacts of $6 million and $3 million, respectively, during the same periods in 2024. The effect of foreign currency exchange rate movements for the three and nine months ended September 30, 2025 compared to the same periods in 2024 was primarily attributable to the weakening of the U.S. dollar against the euro and other major currencies.\nKey Operating Metrics\nGMV and take rate are significant factors that we believe affect our net revenues.\nGMV\n consists of the total value of all paid transactions between users on our Marketplace platforms during the applicable period inclusive of shipping fees and taxes, without adjustment for returns or cancellations. We believe that GMV provides a useful measure of the overall volume of paid transactions that flow through our Marketplace platforms in a given period.\nFX-Neutral GMV is defined as GMV minus the exchange rate effect, which we calculate by applying prior period foreign currency exchange rates to current year transactional currency amounts.\nTake rate\n is defined as net revenues divided by GMV and represents net revenue as a percentage of overall volume on our Marketplace platforms. We believe that take rate provides a useful measure of our ability to monetize volume through services on our Marketplace platforms in a given period. We use take rate to identify key revenue drivers.\n45\nTable of Contents\nThe following table presents net revenues and our key operating metrics of GMV and take rate for the periods indicated. The following table also presents a reconciliation of FX-Neutral net revenues and FX-Neutral GMV (each as defined above) to our reported net revenues and GMV for the periods indicated (in millions, except percentages):\nThree Months Ended September 30,\n \n2025\n2024\n% Change\n \nAs Reported \n(1)\nExchange Rate Effect\nFX-Neutral\nAs Reported\nAs Reported\nFX-Neutral\nNet revenues\n$\n2,820 \n$\n20 \n$\n2,800 \n$\n2,576 \n9 \n%\n8 \n%\nGMV\n$\n20,105 \n$\n333 \n$\n19,772 \n$\n18,306 \n10 \n%\n8 \n%\nTake rate\n14.03 \n%\n14.08 \n%\n(0.05)\n%\nNine Months Ended September 30,\n \n2025\n2024\n% Change\n \nAs Reported \n(1)\nExchange Rate Effect\nFX-Neutral\nAs Reported\nAs Reported\nFX-Neutral\nNet revenues\n$\n8,135 \n$\n31 \n$\n8,104 \n$\n7,704 \n6 \n%\n5 \n%\nGMV\n$\n58,372 \n$\n414 \n$\n57,958 \n$\n55,347 \n5 \n%\n5 \n%\nTake rate\n13.94 \n%\n13.92 \n%\n0.02 \n%\n(1)\nNet revenues included $24 million and $22 million\n \nof hedging losses for the three and nine months ended September 30, 2025, respectively, compared to $11 million and $31 million, respectively,\n \nof hedging losses during the same periods in 2024.\nNet revenues increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to higher GMV, increased penetration of first party advertising and the ramping of our U.K. managed shipping program. The increase in net revenues was partially offset by lower seller fees in connection with our U.K. consumer-to-consumer initiative.\nThe increase in GMV for the three and nine months ended September 30, 2025 compared to the same periods in 2024 was primarily driven by the continued execution of our strategic initiatives as consumer demand improved through the first nine months of 2025 and lower than expected impact of tariffs and trade policy changes. GMV growth in Focus Categories, including Collectibles, Motors Parts & Accessories, Luxury goods, Refurbished, Apparel and Sneakers, outpaced the remainder of our Marketplace. The increase in GMV was partially offset by the impact of tariffs, including the elimination of the U.S. de minimis trade exemption during the third quarter of 2025.\nDuring the third quarter of 2025, we experienced an increase in canceled orders as buyers and sellers adapted to new U.S. trade policies. This trend may continue depending on the state of future global trade policies and the speed with which our buyers and sellers adjust to these changes or respond to uncertainty around global trade policies. Changes in return and cancellation rates can impact our GMV growth rate and related take rate. As a result, we clarified above that our definition of GMV includes returns and cancellations. We have consistently included returns and cancellations in our previously reported GMV.\nIn the United States, GMV growth was driven by favorable trends in consumer demand during the three and nine months ended September 30, 2025 compared to the same periods in 2024 as reflected in the broad-based strength across categories with particularly strong performance in Trading Cards. The increase in GMV was also attributable to increases in both sold items and average selling price, the expansion of the Klarna buyer payment option and efficiency in lower-funnel marketing spend.\nInternational GMV growth was primarily driven by cross-border trade, led by exports from Greater China and Japan into our major markets during the three and nine months ended September 30, 2025 compared to the same periods in 2024. Cross-border trade was also a significant contributor to growth in Focus Categories. Across international markets, we continued to experience challenging macroeconomic conditions through the first nine \n46\nTable of Contents\nmonths of 2025 with recent enhancements to our consumer-to-consumer initiative in the U.K. contributing to an overall increase in U.K. volume.\nCost of Net Revenues\nCost of net revenues represents costs associated with customer support, site operations and payment processing. Significant components of these costs primarily consist of employee compensation (including stock-based compensation), contractor costs, facilities costs, depreciation of equipment and amortization expense, bank transaction fees, credit card interchange and assessment fees, authentication costs, shipping costs and indirect tax expenses. The following table presents cost of net revenues for the periods indicated (in millions, except percentages):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nCost of net revenues \n(1)(2)\n$\n821 \n$\n727 \n13 \n%\n$\n2,320 \n$\n2,162 \n7 \n%\nPercentage of net revenues\n29 \n%\n28 \n%\n \n29 \n%\n28 \n%\n \n(1)\nCost of net revenues were net of immaterial hedging activity for the three and nine months ended September 30, 2025 and 2024, respectively.\n(2)\nForeign currency movements relative to the U.S. dollar had unfavorable impacts of $9 million and $12 million on cost of net revenues for the three and nine months ended September 30, 2025, respectively, compared to unfavorable impacts of $1 million and $3 million, respectively, during the same periods in 2024.\nThe increase in cost of net revenues for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due to increases of $36 million in shipping costs, $21 million in payment processing costs, $15 million in cost of promoted listings products, $13 million in depreciation expense due to the prior year benefit related to the change in useful lives of our servers and networking equipment and $12 million in customer support costs, partially offset by a $18 million decrease in indirect tax expense.\nThe increase in cost of net revenues for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily due to increases of $55 million in shipping costs, $47 million in depreciation expense due to the prior year benefit related to the change in useful lives of our servers and networking equipment, $41 million in cost of promoted listings products, $26 million in customer support costs and $11 million in payment processing costs, partially offset by a $46 million decrease in indirect tax expense.\nOperating Expenses\nThe following table presents operating expenses for the periods indicated (in millions, except percentages): \n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nSales and marketing\n$\n606 \n$\n592 \n2 \n%\n$\n1,728 \n$\n1,710 \n1 \n%\nPercentage of net revenues\n21 \n%\n23 \n%\n21 \n%\n22 \n%\nProduct development\n423 \n374 \n13 \n%\n1,206 \n1,104 \n9 \n%\nPercentage of net revenues\n15 \n%\n15 \n%\n15 \n%\n14 \n%\nGeneral and administrative\n282 \n194 \n46 \n%\n914 \n673 \n36 \n%\nPercentage of net revenues\n10 \n%\n8 \n%\n11 \n%\n9 \n%\nProvision for transaction losses\n106 \n89 \n19 \n%\n273 \n266 \n3 \n%\nPercentage of net revenues\n4 \n%\n3 \n%\n3 \n%\n3 \n%\nAmortization of acquired intangible assets\n6 \n5 \n8 \n%\n18 \n14 \n28 \n%\nTotal operating expenses \n(1)\n$\n1,423 \n$\n1,254 \n13 \n%\n$\n4,139 \n$\n3,767 \n10 \n%\n(1)\nForeign currency movements relative to the U.S. dollar had an unfavorable impact of $17 million on operating expenses for both the three and nine months ended September 30, 2025 compared to an unfavorable impact of $1 million and a favorable impact of $2 million, respectively, during the same periods in 2024.\n47\nTable of Contents\nSales and Marketing\n \nSales and marketing expenses primarily consist of marketing program costs, employee compensation (including stock-based compensation), certain user coupons and rewards, contractor costs, facilities costs and depreciation on equipment. Marketing program costs represent traffic acquisition costs in various channels, such as paid search, affiliates marketing, display advertising, brand campaigns and buyer/seller communications.\nThe increase in sales and marketing expenses for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due the unfavorable impact of foreign currency movements.\nThe increase in sales and marketing expenses for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily due to increases of $16 million in employee-related costs, $13 million due to the unfavorable impact of foreign currency movements and $13 million in other individually immaterial expenses, partially offset by a $24 million decrease in marketing program costs.\nProduct Development\nProduct development expenses primarily consist of employee compensation (including stock-based compensation), contractor costs, facilities costs and depreciation on equipment. Product development expenses are net of required capitalization of major platform and other product development efforts, including the development and maintenance of our technology platform. Our top technology priorities include improving seller tools and buyer experiences across our Marketplace platforms powered by intelligent computing at scale.\nThe increase in product development expenses for the three and nine months ended September 30, 2025 compared to the same periods in 2024 was primarily due to an increase in employee-related costs.\nCapitalized internal use and platform development costs were $30 million and $87 million for the three and nine months ended September 30, 2025, respectively, compared to $27 million and $84 million, respectively, during the same periods in 2024. These costs are primarily reflected as a cost of net revenues when amortized in future periods.\nGeneral and Administrative\n \nGeneral and administrative expenses primarily consist of employee compensation (including stock-based compensation), contractor costs, facilities costs, depreciation of equipment, legal expenses, restructuring, insurance premiums and professional fees. Our legal expenses, including those related to various ongoing legal proceedings, may fluctuate substantially from period to period.\nThe increase in general and administrative expenses for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due to $28 million of restructuring costs, $9 million in employee-related costs and a legal accrual release in the third quarter of 2024 of $50 million.\nThe increase in general and administrative expenses for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily due to $89 million of senior leader transitions and restructuring costs, $61 million of legal accruals recorded during 2025, $32 million in employee-related costs and legal accrual releases in 2024 of $56 million.\nProvision for Transaction Losses\nProvision for transaction losses consists primarily of losses resulting from our buyer protection programs, chargebacks for unauthorized credit card use, and merchant related chargebacks due to non-delivery of goods or services. We expect our provision for transaction losses to fluctuate depending on many factors, including changes to our protection programs and macroeconomic conditions.\nThe increase in provision for transaction losses for the three and nine months ended September 30, 2025 compared to the same periods in 2024 was primarily due to the ramping of our U.K. managed shipping program and unfavorable fluctuations in buyer and seller fraud and recovery rates.\n48\nTable of Contents\nGain (loss) on equity investments and warrant, net\nGain (loss) on equity investments and warrant, net primarily consists of gains and losses related to our various types of equity investments, including our equity investments in Adevinta ASA (“Adevinta”), Gmarket Global LLC (“Gmarket”), and gains and losses due to changes in fair value of the warrant received from Adyen N.V. (“Adyen”) and the Aurelia Option (as defined in “Note 5 — Investments”). The following table presents Gain (loss) on equity investments and warrant, net for the periods indicated (in millions, except percentages):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n  \n2024\n% Change\n2025\n2024\n% Change\nUnrealized change in fair value of equity investment in Adevinta\n$\n— \n$\n— \n**\n$\n— \n$\n(234)\n**\nRealized change in fair value of shares sold in Adevinta\n— \n— \n**\n— \n78 \n**\nUnrealized change in fair value of equity investment in Gmarket\n— \n16 \n**\n— \n(12)\n**\nChange in fair value of warrants\n2 \n145 \n**\n2 \n120 \n**\nChange in fair value of Aurelia option\n— \n35 \n**\n— \n(74)\n**\nGain (loss) on other investments\n(12)\n3 \n**\n(18)\n2 \n**\nTotal gain (loss) on equity investments and warrant, net\n$\n(10)\n  \n$\n199 \n(105)\n%\n$\n(16)\n$\n(120)\n(87)\n%\nPercentage of net revenues\n0 \n%\n8 \n%\n0 \n%\n(2)\n%\n** Percentage change not meaningful\nRefer to “Note 5 — Investments” for further details about our equity investments and the Aurelia Option and “Note 6 — Derivative Instruments” for further details about the Adyen warrant.\nInterest Expense, Interest Income and Other, Net\n \nInterest expense primarily consists of interest charges on amounts borrowed, commitment fees on unborrowed amounts under our credit agreement and interest expense on our outstanding debt securities and commercial paper, as applicable. Interest income and other, net primarily consists of interest earned on cash, cash equivalents, investments and customer accounts, gains and losses on foreign exchange transactions and transaction costs of acquisitions. The following table presents interest expense and interest income and other, net for the periods indicated (in millions, except percentages):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nInterest expense\n$\n(62)\n$\n(63)\n(2)\n%\n$\n(185)\n$\n(194)\n(5)\n%\nPercentage of net revenues\n(2)\n%\n(2)\n%\n(2)\n%\n(3)\n%\nInterest income\n$\n65 \n$\n72 \n(10)\n%\n$\n206 \n$\n196 \n5 \n%\nForeign exchange and other\n4 \n(6)\n**\n3 \n4 \n**\nTotal interest income and other, net\n$\n69 \n$\n66 \n5 \n%\n$\n209 \n$\n200 \n5 \n%\nPercentage of net revenues\n2 \n%\n3 \n%\n3 \n%\n3 \n%\n** Percentage change not meaningful\nInterest expense decreased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to a lower average notional amount of outstanding debt.\nInterest income decreased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to a lower average notional amount of fixed-income investments.\nInterest income increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to a higher average notional amount of fixed-income investments.\n49\nTable of Contents\nIncome Tax Benefit (Provision) \nThe following table presents benefit from (provision for) income taxes and the effective tax rate for the periods indicated (in millions, except percentages):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\nIncome tax benefit (provision)\n$\n24\n$\n(161)\n$\n(213)\n$\n(360)\nEffective tax rate\n(4.1)\n%\n20.2 \n%\n12.7 \n%\n  \n21.7 \n%\nThe decrease in our effective tax rate for the three and nine months ended September 30, 2025 compared to the same periods in 2024 was primarily due to a decrease in uncertain tax positions resulting from audit settlements, a net benefit associated with the One Big Beautiful Bill Act and an increase in excess tax benefits on stock-based compensation.\nWe are regularly under examination by tax authorities both domestically and internationally. We believe that adequate amounts have been reserved for any adjustments that may ultimately result from these examinations, although there are inherent uncertainties in these examinations. Due to the ongoing tax examinations, it is generally impractical to determine the amount and timing of these adjustments.\n50\nTable of Contents\nLiquidity and Capital Resources \nCash Flows\n \n \nNine Months Ended\nSeptember 30,\n \n2025\n2024\n \n(In millions)\nNet cash provided by (used in):\n \n \nContinuing operating activities\n$\n1,414 \n$\n1,737 \nContinuing investing activities\n1,644 \n951 \nContinuing financing activities\n(2,838)\n(2,814)\nEffect of exchange rates on cash, cash equivalents and restricted cash\n45 \n5 \nNet decrease in cash, cash equivalents and restricted cash - discontinued operations\n(38)\n— \nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n227 \n$\n(121)\n \nContinuing Operating Activities\nOur operating cash flows are largely dependent on the amount of revenue generated on our Marketplace platforms offset by cash payments for marketing programs, employee-related costs, payment processing and taxes.\nCash provided by continuing operating activities decreased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to an increase in cash paid for income taxes of $604 million, partially offset by an increase in net revenues and other working capital movements.\nContinuing Investing Activities\nCash provided by continuing investing activities of $1.6 billion for the nine months ended September 30, 2025 was primarily attributable to proceeds of $8.0 billion from the maturities of investments and $227 million from shareholder distributions from equity investments, partially offset by cash paid for investments of $6.1 billion and property and equipment of $408 million.\nCash provided by continuing investing activities of $951 million in the nine months ended September 30, 2024 was primarily attributable to proceeds of $10.4 billion from the maturities and sales of investments and proceeds of $2.4 billion from the sale of our equity investment in Adevinta, partially offset by cash paid for investments of $11.5 billion and property and equipment of $341 million.\nContinuing Financing Activities\nCash used in continuing financing activities of $2.8 billion for the nine months ended September 30, 2025 was primarily attributable to the $1.9 billion paid to repurchase common stock, the $1.4 billion repayment of commercial paper, the repayment of the $800 million aggregate principal amount of our previously outstanding 1.900% senior notes due 2025 and $400 million paid in cash dividends, partially offset by proceeds of $1.6 billion from the issuance of commercial paper.\nCash used in continuing financing activities of $2.8 billion in the nine months ended September 30, 2024 was primarily attributable to cash paid to repurchase $2.2 billion of common stock, repayment of the $750 million aggregate principal amount of our previously outstanding 3.450% senior notes due 2024 and $405 million paid in cash dividends, partially offset by borrowings under our commercial paper program of $441 million.\nThe positive effect of exchange rate movements on cash, cash equivalents and restricted cash for the nine months ended September 30, 2025 compared to the 2024 was due to the weakening of the U.S. dollar against other currencies.\n51\nTable of Contents\nLiquidity and Capital Resource Requirements\nAs of September 30, 2025 and December 31, 2024, we had assets classified as cash and cash equivalents as well as short-term and long-term non-equity investments, in an aggregate amount of $5.3 billion and $7.2 billion, respectively. These amounts do not include cash held on behalf of customers related to marketplace activity of $947 million and $763 million, respectively, which are recognized separately within “Customer accounts and funds receivable” with a corresponding liability within “Customer accounts and funds payable” in our condensed consolidated balance sheet. These amounts also do not include restricted cash related to safeguarding customer funds, our global sabbatical program, and other compensation arrangements held in escrow totaling $143 million and $90 million, respectively. We believe these assets, together with cash expected to be generated from operations, borrowings available under our credit agreement and commercial paper program, and our access to capital markets, will be sufficient to satisfy our material cash requirements over the next 12 months and for the foreseeable future. \nGeopolitical events, inflationary pressure, foreign exchange rate volatility, elevated interest rates, and changes in and uncertainty regarding global tariffs and trade policies have caused material disruptions in both the United States and international financial markets and economies and are uncertain in duration. The impact of these events has increased, and may continue to increase, our borrowing costs and other costs of capital and otherwise adversely affect our business, results of operations, financial condition and liquidity. The future impact of these events cannot be predicted with certainty and we cannot assure that we will have access to external financing at times and on terms we consider acceptable, or at all, or that we will not experience other liquidity issues going forward.\nWe have certain fixed contractual obligations and commitments that include future estimated payments for general operating purposes. Changes in our business needs, contractual cancellation provisions, fluctuating interest rates, and other factors may result in actual payments differing from the estimates. We cannot provide certainty regarding the timing and amounts of these payments. The following sections summarize our fixed contractual obligations and commitments and other material cash requirements.\nSenior Notes\nIn March 2025, we repaid the $800 million aggregate principal amount of our previously outstanding 1.900% senior notes due 2025 on the date of maturity.\nAs of September 30, 2025, we had fixed-rate senior notes outstanding with an aggregate principal amount of $6.2 billion, with $1.2 billion aggregate principal amount payable within 12 months.\nOn October 22, 2025, we redeemed the $425 million aggregate principal amount of our previously outstanding 5.900% senior notes due in November 2025. Total cash consideration paid was $425 million, as the redemption price was equal to 100% of the principal amount. In addition, we paid accrued and unpaid interest on the principal amount.\nCommercial Paper\nWe have a commercial paper program pursuant to which we may issue commercial paper notes in an aggregate principal amount at maturity of up to $1.5 billion outstanding at any time with maturities of up to 397 days from the date of issue. During the nine months ended September 30, 2025, we repaid the $1.5 billion aggregate principal amount of the previously outstanding commercial paper notes on the dates of maturity and issued $1.6 billion aggregate principal amount of commercial paper notes, of which $1.2 billion aggregate principal amount had original maturities 90 days or less and $0.4 billion aggregate principal amount had original maturities greater than 90 days. As of September 30, 2025, we had $575 million aggregate principal amount of commercial paper notes outstanding with a weighted average interest rate of 4.52% per annum and a weighted average remaining term of 18 days.\n52\nTable of Contents\nCredit Agreement\nWe have a credit agreement maturing in January 2029 that provides for an unsecured $2.0 billion five-year revolving credit facility. We may also, subject to the agreement of the applicable lenders, increase the commitments under the revolving credit facility by up to $1.0 billion. Funds borrowed under the credit agreement may be used for working capital, capital expenditures, acquisitions and other general corporate purposes and will bear interest at either (i) a customary forward-looking term rate based on the secured overnight financing rate published by CME Group for the relevant interest period plus an adjustment of 0.1% or (ii) a customary base rate formula, plus a margin (based on our public debt ratings) ranging from 0% to 0.375%. The covenants of the credit agreement are discussed in “Note 9 — Debt” to the condensed consolidated financial statements included in this report. As of September 30, 2025, we had $575 million aggregate principal amount of commercial paper notes outstanding; therefore, $1.4 billion of borrowing capacity was available for other purposes permitted by the credit agreement.\nIncome Taxes\nThe timing of the resolution and/or closure of audits is highly uncertain. Given the number of years remaining subject to examination and the number of matters being examined, we are unable to estimate the full range of possible adjustments to the balance of gross unrecognized tax benefits. We do not expect the gross amount of unrecognized tax benefits to significantly change within the next 12 months.\nAs of September 30, 2025, our assets classified as cash and cash equivalents as well as short-term and long-term non-equity investments included assets held in certain of our foreign operations totaling $1.2 billion. As we repatriate these funds to the United States, we will be required to pay income taxes in certain U.S. states and applicable foreign withholding taxes on those amounts during the period when such repatriation occurs. We have accrued deferred taxes for the tax effect of repatriating the funds to the United States. For additional details related to our income taxes, please see “Income Tax Provision” in our Results of Operations above and “Note 13 — Income Taxes” to the condensed consolidated financial statements included in this report.\nStock Repurchases\nOur stock repurchase programs are intended to programmatically offset the impact of dilution from our equity compensation programs and, subject to market conditions and other factors, to make opportunistic and programmatic repurchases of our common stock to reduce our outstanding share count and return value to stockholders. Any share repurchases under our stock repurchase programs will be funded from our working capital or other financing alternatives.\nWe expect to continue making opportunistic and programmatic repurchases of our common stock, subject to market conditions and other uncertainties. However, our stock repurchase programs may be limited or terminated at any time without prior notice. The timing and actual number of shares repurchased will depend on a variety of factors, including corporate and regulatory requirements, price and other market conditions and management’s determination as to the appropriate use of our cash.\nDuring the nine months ended September 30, 2025, we repurchased $1.9 billion of our common stock under our stock repurchase program. As of September 30, 2025, a total of $1.4 billion remained available for future repurchases of our common stock\n. \nSee “Note 11 — Stockholders’ Equity” to the condensed consolidated financial statements included in this report for more information about our stock repurchase program.\nDividends\nDuring the three and nine months ended September 30, 2025, we paid a total of $132 million and $400 million, respectively,\n \nin cash dividends compared to $131 million and $405 million, respectively, paid during the same periods in 2024. In October 2025, our Audit Committee, pursuant to delegated authority from our Board, declared a cash dividend of $0.29 per share of common stock to be paid on December 12, 2025 to stockholders of record as of November 28, 2025.\n53\nTable of Contents\nOther Capital Resource Requirements\nWe actively monitor significant counterparties that hold our cash and cash equivalents and non-equity investments, focusing primarily on the safety of principal and secondarily on improving yield on these assets. We diversify our cash and cash equivalents and investments among various counterparties in order to reduce our exposure should any one of these counterparties fail or encounter difficulties. To date, we have not experienced any material loss or lack of access to our invested cash, cash equivalents or short-term investments; however, we can provide no assurances that access to our invested cash, cash equivalents or short-term investments will not be impacted by adverse conditions in the financial markets, including, without limitation, as a result of the impact of geopolitical events, inflationary pressure, changes in and uncertainty regarding global tariffs and global trade policies, and foreign exchange rate volatility. At any point in time we have funds in our operating accounts and customer accounts that are deposited and invested with various third-party financial institutions.\nWe have entered into various indemnification agreements and, in the ordinary course of business, we have included limited indemnification provisions in certain of our agreements with parties with which we have commercial relations. It is not possible to determine the maximum potential loss under these various indemnification provisions due to our limited history of prior indemnification claims and the unique facts and circumstances involved in each particular provision. To date, losses recognized in our consolidated statement of income in connection with our indemnification provisions have not been significant, either individually or collectively. See “Note 10 — Commitments and Contingencies” to the condensed consolidated financial statements included in this report for more information about our indemnification provisions.\n54\nTable of Contents"
}