{
  "source_file": "ebay-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1:  \nBUSINESS\nUnless otherwise expressly stated or the context otherwise requires, when we refer to “we,” “our,” “us,” “eBay” or the “Company” in this Annual Report on Form 10-K, we mean eBay Inc. and its consolidated subsidiaries. \nOverview\nFounded in 1995 in San Jose, California, eBay Inc. is a global commerce leader that connects people and builds communities to create economic opportunity for all. Our technology empowers millions of buyers and sellers in more than 190 markets around the world, providing everyone the opportunity to grow and thrive. Our Marketplace platforms, including our online marketplace located at www.ebay.com and its localized counterparts, our off-platform marketplaces and our suite of mobile apps, together, create one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2024, eBay enabled $75 billion of Gross Merchandise Volume (“GMV”).\nOur Strategy\nAs a global commerce leader and third-party marketplace, our technologies and services are designed to provide buyers choice and a breadth of relevant inventory from around the globe, and to enable sellers’ access to eBay’s 134 million buyers worldwide. Our business model and pricing are designed so our business is successful when our sellers are successful. We earn revenue primarily through fees collected on paid sales, inclusive of payment processing and first-party advertising.\neBay’s strategy is to leverage technology to enhance the marketplace experience for our customers, drive growth in GMV, increase the rate of revenue growth through our advertising initiatives, and deliver healthy operating margins. Beginning in 2020, we embarked on a multi-year journey to build more compelling category experiences for enthusiastic consumers, to become the partner of choice for sellers, and to strengthen trust in relationships with buyers on our Marketplace platforms. In 2023, we evolved our strategy to focus on reinventing the future of ecommerce for enthusiasts. We derived a majority of GMV in 2024 from the following product categories: parts & accessories, collectibles, fashion, electronics, and home & garden.\nSince late 2021, eBay has managed payments for all transactions on our Marketplace platforms, delivering intuitive end-to-end payment experiences for our current and next-generation customers. Our customers enjoy significant choice and flexibility in how they pay and get paid on our Marketplace platforms. Additionally, we are continuing to launch and expand services such as eBay Balance, Express Payouts, and Seller Capital to cater to the needs of our customers and drive greater marketplace engagement.\nWe are focused on growing our first-party advertising revenue while reducing our focus on non-strategic, third-party advertising. We currently offer several advertising solutions to our sellers, including: Promoted Listings, Promoted Offsite, and Promoted Stores. Through these offerings, we aim to provide sellers with data-driven recommendations to improve their conversion and drive velocity. We are also actively testing and building more technology features to simplify the advertising experience, increase listing visibility, and drive continued business growth.\nWe have acquired and disposed of a significant number of businesses, technologies, services and products, and we maintain investments in certain businesses. We regularly review and manage our investments to ensure they support eBay’s strategic direction and complement our disciplined approach to value creation, profitability, and capital allocation. We expect to continue to evaluate and consider potential strategic transactions as part of our \n5\nTable of Contents\nstrategy, including business combinations, acquisitions and dispositions of businesses, technologies, services, products and other assets, as well as strategic investments and joint ventures.\nOur Customer Offerings\nWe provide a number of features for our sellers and buyers that align with our approach of leveraging technology, including generative AI (“Gen AI”), to enhance the marketplace experience for our customers. These offerings are designed to build trust and confidence on our Marketplace platforms and drive GMV.\nFor sellers, we are focused on simplifying their business processes to help drive their sales effectively and efficiently, and we continuously invest in technology to enhance the quality of selling experiences and products to expand the seller tools ecosystem. In 2024, we expanded our new magical listing experience to more sellers in more markets, saving them time and effort as they create their listings. We also launched a redesigned advertising dashboard across our global markets to enable sellers to have a more cohesive, streamlined view of their advertising reach, spend, and other metrics, giving them more tools to make the best decisions for their businesses. The dashboard enhances the advertising experience for sellers, providing artificial intelligence (“AI”) driven insights and personalized recommendations to help sellers grow their businesses. Additionally, we offer the eBay International Shipping program for sellers in the United States, surfacing millions of listings to buyers across more than 190 markets while removing the friction of international shipping and customs formalities.\nFor buyers, we are changing the way they find inventory through discovery, personalization and other innovative experiences. We are utilizing AI to transform the shopping experience for buyers. In 2024, we launched Shop the Look, which leverages Gen AI to create shoppable content and fashion recommendations. We also launched Explore, an AI-powered shopping feed enabling users to browse a nearly unlimited list of personalized recommendations based on their interests, style preferences, and sizes. We intend to continue to invest in AI and Gen AI to improve the quality of our buying and selling experiences.\nAdditionally, we have continued to strengthen our buyers’ confidence and trust in our services. We offer “eBay Money Back Guarantee,” which allows buyers to receive their money back if the item they ordered does not arrive, is faulty or damaged, or does not match the listing. eBay Money Back Guarantee covers most items purchased on the eBay Marketplace platforms in the United States, the United Kingdom, Germany, Australia, Canada, France, Italy and Spain through a qualifying payment method. In addition, eBay authenticates eligible luxury and collectible items in six categories through “Authenticity Guarantee,” an authentication service available in the United States, the United Kingdom, Germany, Australia, Canada, and Japan. In our parts & accessories category, we offer tools that drive trusted and convenient transactions, including fitment to ensure that buyers can find the right parts to fit their vehicles and select installation services that make maintenance and repairs easier. We also continue to expand our eBay Refurbished offering, a dedicated destination that brings inventory from pre-selected brands and top-rated sellers with standardized condition grading, to meet consumer demand for top products backed by a warranty.\nOur Impact and Responsibility\neBay’s purpose is to empower people and create economic opportunity for all through our technology for our global community of users. Every day, people build businesses on our Marketplace platforms. With a low cost of entry for sellers, we offer a highly accessible way for all types of users to interact in a global marketplace that’s inclusive and connects people of all backgrounds. Accordingly, we prioritize our corporate responsibility efforts to impact the areas of economic empowerment and sustainable commerce. Key economic programs include eBay for Charity, the eBay Foundation and our small business enablement efforts, such as our Up & Running Grants program.\neBay for Charity empowers buyers and sellers to support charities around the world. In 2024, eBay for Charity partnered with the GLIDE Foundation, the Elton John AIDS Foundation, World Central Kitchen, Six Degrees Org, Deckaid, and Homes for Our Troops, amongst others. In 2024, more than $192 million was raised by buyers and sellers to support charities via eBay for Charity.\nThe eBay Foundation helps to build economically vibrant and thriving communities. During 2024, the eBay Foundation granted nearly $18 million through strategic grantmaking and our employee gift-matching program, primarily to support historically excluded entrepreneurs. To date, the eBay Foundation has awarded nearly $140 million to more than 1,800 nonprofits.\n6\nTable of Contents\nRecommerce has been an integral part of eBay’s purpose since the Company was founded in 1995. As a pioneer of the circular economy, eBay has created an online marketplace where people can buy and sell pre-owned goods. This helps preserve the world’s natural resources by avoiding a portion of the carbon emissions, water, energy and waste typically used in producing new goods.\nIn 2024, eBay sourced 100% of its electricity consumption for eBay-controlled offices and data centers from renewable sources, reaching our 2025 renewable energy goal one year early. eBay has also set emissions reduction targets, including near- and long-term science-based targets, and a 2045 net-zero target, that have been validated by the Science Based Targets initiative. In 2024, eBay was ranked in the United States Environmental Protection Agency’s Green Power Partnership National Top 100 and Top 30 Tech & Telecom for the fifth year. In 2024, eBay was also recognized for its commitment to sustainability and responsible business by its inclusion in the Dow Jones Best-in-Class World and North American Indices (formerly known as the Dow Jones Sustainability Indices) for the sixth straight year.\nFinancial Information\nWe measure our footprint in our addressable market according to GMV. GMV consists of the total value of all paid transactions between users on our Marketplace platforms during the applicable period inclusive of shipping fees and taxes. In 2024, we generated $75 billion in GMV, of which 49 percent was generated outside the United States. We believe that GMV provides a useful measure of the overall volume of paid transactions that flow through our Marketplace platforms in a given period.\nAt the end of 2024, eBay had 134 million active buyers and 2.3 billion live listings globally. The term “active buyer” means, as of any date, all buyer accounts that paid for a transaction on our Marketplace platforms within the previous 12-month period. Buyers may register more than once and, as a result, may have more than one account.\nWe generate net revenues through two activities, Marketplace activities which primarily consist of commissions from the service of connecting buyers and sellers on our secure and trusted Marketplace platforms and Advertising activities, which primarily consist of fees charged to sellers to promote their listings. The majority of our revenue comes from a take rate on the GMV of transactions paid on our Marketplace platforms. We define “take rate” as net revenues divided by GMV.\nOur Marketplace platforms are designed to enable our buyers and sellers to leverage our economies of scale and capital investments in sales and marketing, mobile, customer acquisition, technology innovation and customer service.\nCompetition\nWe encounter vigorous competition in our business from numerous sources. Our users can list, sell, buy, and pay for similar items through a variety of competing online, mobile and offline channels. These include, but are not limited to, retailers, distributors, liquidators, import and export companies, auctioneers, catalog and mail-order companies, directories, search engines, commerce participants (consumer-to-consumer, business-to-consumer and business-to-business), shopping channels and networks. As our product offerings continue to broaden into new categories of items and new commerce formats, we expect to face additional competition from other online, mobile and offline channels for those new offerings. We compete on the basis of numerous factors, including price, product selection and services, and geographical reach.\nFor more information regarding competitive factors impacting our business, see the information in “Item 1A: Risk Factors” under the captions “Substantial and increasingly intense competition worldwide in ecommerce may harm our business” and “We could be subject to regulatory or agency investigations and/or court proceedings under unfair competition laws that could adversely impact our business.”\nGovernment Regulation\nGovernment regulation impacts key aspects of our business. In particular, we are subject to laws and regulations that affect the ecommerce industry in many countries where we operate. \n7\nTable of Contents\nOur business is subject to payments reporting requirements for our sellers in many jurisdictions. For example, in the United States, legislation was passed in 2021 requiring all businesses that process payments to issue a Form 1099-K for all sellers who receive more than $600 in gross payments in a year, a decrease from the previous reporting threshold of $20,000 and 200 transactions. The Internal Revenue Service (“IRS”) delayed the enforcement of this rule twice until 2024, when it announced a phase-in threshold of $5,000 for 2024 and $2,500 for 2025. As a result, Form 1099-Ks for the $5,000 threshold were issued in January 2025 for 2024 transactions and Form 1099-Ks for the $2,500 threshold will be issued beginning in January 2026 for 2025 transactions, subject to potential new federal legislation raising the threshold and/or future IRS action. Outside the United States, we have complied with reporting requirements in the European Union and United Kingdom, among other jurisdictions, and more countries and jurisdictions continue to enact similar requirements. Tax collection and/or reporting responsibilities and the additional costs associated with compliance with complex sales and use tax collection, remittance and audit requirements, could create additional burdens for buyers and sellers on our Marketplace platforms.\nThe E.U. Digital Services Act (the “DSA”) took effect for all online platforms in February 2024. The DSA imposes legal obligations on online marketplaces operating in Europe, requiring them to verify and ensure the accuracy and disclosure of required information, as well as the safety and authenticity of products posted by third-party merchants. The DSA also enforces new content moderation obligations, notice obligations, advertising restrictions and other requirements on digital platforms that created additional operational burdens and compliance costs for us. Additionally, in late 2023, the United Kingdom’s Online Safety Act (the “OSA”) became law, and in 2024 the United Kingdom’s Digital Markets, Competition and Consumers Act (the “DMCCA”) became law. The OSA created requirements around monitoring and handling harmful content and required us to expend resources to comply with the new regulations. The DMCCA expands the investigative and enforcement powers of the Competition and Markets Authority, modifies the United Kingdom merger control rules, and creates a new consumer protection regime. We may expend additional resources to comply with the DMCCA.\nFor more information regarding the regulations that impact our business and our legal and regulatory risks, see the information in “Item 1A: Risk Factors” under the category “Regulatory and Legal Risks.”\nSeasonality\n \nTransaction activity patterns on our Marketplace platforms generally trend in line with consumer buying patterns. Seasonal trends have been influenced by macroeconomic conditions, foreign exchange rate fluctuations, as well as the introduction and scaling of new products by us and our competitors. Please see the additional information in “Item 7: Management’s Discussion and Analysis of Financial Condition and Results of Operations” under the caption “Seasonality.”\nTechnology\nThe eBay Marketplace platforms use a combination of proprietary technologies and services as well as technologies and services provided by others. We have developed intuitive user interfaces; buyer, seller and developer tools; and transaction processing, database and network applications that help enable our users to reliably and securely complete transactions on our Marketplace platforms. Our technology infrastructure simplifies the storage and processing of large amounts of data, eases the deployment and operation of large-scale global products and services and automates much of the administration of large-scale clusters of computers. Our infrastructure has been designed around industry-standard architectures to reduce downtime in the event of outages or catastrophic occurrences.\nIn support of our commitment to innovation and a better customer experience, we have been on a multi-year evolution to modernize our Marketplace platforms. Through technologies like AI, including Gen AI, we are anticipating the needs of buyers, sellers and developers, empowering entrepreneurs looking to grow their business, and making the Marketplace platforms more accessible to everyone. We aim to create highly personalized and inspiring shopping experiences powered by advanced technologies.\nFor information regarding technology-related risks, see the information in “Item 1A: Risk Factors” under the captions “Cyberattacks and data security breaches and incidents could significantly damage our reputation, reduce our revenues, increase our costs, result in litigation and regulatory penalties, and otherwise harm our business,” “Systems failures and resulting interruptions in the availability of or degradation in the performance of our websites, applications, products or services could harm our business” and “New laws and increasing levels of regulation in the areas of privacy and protection of user data could harm our business.”\n8\nTable of Contents\nIntellectual Property \nWe regard the protection of our intellectual property, including our trademarks (particularly those covering the eBay name), patents, copyrights, domain names, trade dress and trade secrets as critical to our success. We protect our intellectual property rights by relying on federal, state and common law rights in the United States and internationally, as well as a variety of administrative procedures. We also rely on contractual restrictions to protect our proprietary rights in products and services. We routinely enter into confidentiality and invention assignment agreements with our employees and contractors and nondisclosure agreements with parties with whom we conduct business to limit access to and disclosure of our proprietary information.\nWe routinely pursue registration of our domain names, trademarks and patents in the United States and internationally. Additionally, we have filed patent applications in the United States and internationally covering certain aspects of our proprietary technology. Effective trademark, copyright, patent, domain name, trade dress and trade secret protection is typically expensive to maintain and may require litigation. We must protect our intellectual property rights and other proprietary rights in an increasing number of jurisdictions, a process that is expensive and time consuming and may not be successful.\nWe have registered our core brands as trademarks and domain names in the United States and internationally and have in place an active program to continue to secure trademarks and domain names that correspond to our brands in markets of interest. If we are unable to register or protect our trademarks or domain names, we could be adversely affected in any jurisdiction in which our trademarks or domain names are not registered or protected. We have licensed in the past, and expect to license in the future, certain of our proprietary rights, such as trademarks, to others.\nFrom time to time, third parties have claimed — and others will likely claim in the future — that we have infringed their intellectual property rights. We are typically involved in a number of such legal proceedings at any time. Please see the information in “Item 1A: Risk Factors” under the captions “The listing or sale by our users of certain items, including items that allegedly infringe the intellectual property rights of rights owners, including pirated or counterfeit items, illegal items or items used in an illegal manner, may harm our business,” and “We may be unable to adequately protect or enforce our intellectual property rights and face ongoing allegations by third parties that we are infringing their intellectual property rights.”\nHuman Capital Management\nAs of December 31, 2024, we employed approximately 11,500 people globally, of which, approximately 7,000 were located in the United States. eBay has robust people-focused programs to attract, support and retain our employees globally. Our recruitment, development, compensation and benefits, wellness, and our eBay DNA are designed to reflect our values, ensure eBay’s competitiveness in the talent market and ensure we support our employees’ well-being. eBay’s management is focused on delivering programs that develop and support our people and connect them with our customers, our community, and each other. We believe that our employees are important to our overall success. The Compensation and Human Capital Committee of our Board of Directors oversees our human capital management strategy and practices, including our talent recruitment, development and retention, employee engagement, succession planning, and company culture.\nCulture and the eBay DNA\neBay’s purpose is to connect people and build communities to create economic opportunity for all, which continues to serve as the backbone of our culture. We bring this purpose to life through five core elements that make up the eBay DNA: Empower our Community, Innovate Boldly, Deliver with Impact, Be for Everyone, and Act with Integrity. Our human capital management programs tend to focus on the two elements described below, but these programs are designed and intended to support each of our five core elements.\nBe For Everyone\nAt eBay, our core value — “Be for Everyone”— fuels our commitment to diversity, inclusion, and belonging. We strive to create a workplace where every employee feels valued, empowered, and able to bring their best, most innovative selves to work. This commitment fosters creativity, strengthens engagement, and cultivates a deep sense \n9\nTable of Contents\nof belonging, which we believe is essential for driving corporate performance, achieving business goals, and delivering shareholder value.\nAs a global marketplace connecting millions of buyers and sellers, eBay’s purpose is to build communities and create economic opportunity for all. By embracing diverse perspectives and fostering an inclusive culture, we enhance innovation, deepen our understanding of customers, and strengthen the connections that drive our business. We believe that fostering belonging and reflecting the diversity of our global community helps us attract and retain consumers, expand the breadth of inventory on our Marketplace platforms, and create long-term value for our shareholders.\nWe engage with our people on an ongoing basis to support their physical, financial, and mental well-being for them and their families through expanded wellness resources. As part of these efforts, we have continued our focus on ensuring our employees and their families have access to high quality care. We also seek to make that care affordable. Throughout the year, we emphasize the importance of our employees’ well-being and continue to provide mental health training for managers and peers. In 2024, we introduced Thrive Global, a wellness program to encourage small habit changes that positively impact overall well-being, and launched a global financial well-being education campaign to promote financial literacy and health. We believe our commitment to well-being support programs strengthens our ability to attract and retain the top talent we need to achieve our business goals and drive shareholder value by supporting eBay employees and their families in moments that matter.\nAct With Integrity\nWe are committed to ethics and acting with integrity. We regularly communicate about the importance of being open, honest, ethical and authentic with ongoing trainings and “tone from the top” topics that encourage conversations between leaders and our employees. We also host an annual Ethics and Compliance Week focused on celebrating ethical decision making and conduct and educating employees about our programs and the resources available to them to support them in acting with integrity. By fostering an ethical culture, where speaking up is encouraged, we believe that we reduce company risk, protect our business and ultimately serve our shareholders’ best interests.\nIn addition to multiple channels for sharing feedback, we also regularly survey our employees through our eBay Listens program. We ask about trust and engagement, their experience with diversity, inclusion and belonging, ethics and integrity, and we also ask for upward feedback about managers. We believe our employees welcome sharing their points of view with us and are encouraged by how their input molds several strategic programs and our values, including our commitments in critical areas such as Impact and Responsibility.  We believe these programs increase employee engagement and cohesion and allow for creativity and innovation in achieving our business goals and driving shareholder value.\nAvailable Information \nOur Internet address is www.ebay.com. Our investor relations website is located at investors.ebayinc.com. We make available free of charge on our investor relations website under the heading “Financial Information - SEC Filings” our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports as soon as reasonably practicable after such materials are electronically filed with (or furnished to) the SEC at www.sec.gov.\nWe webcast our earnings calls and certain events we participate in or host with members of the investment community on our investor relations website. Additionally, we provide notifications of news or announcements regarding our financial performance, including SEC filings, investor events, press and earnings releases, and blogs on our investor relations website, as well as our company website and social media channels including LinkedIn and X. Company sustainability information for investors is available on our investor relations website under the heading “ESG Investors.” Corporate governance information, including our governance guidelines for our Board of Directors (our “Board”), Board committee charters and code of conduct, is also available on our investor relations website under the heading “Corporate Governance.”\nThe contents of our websites and webcasts and information that can be accessed through our websites, webcasts and social media channels are not incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with (or furnish to) the SEC, and any references to our websites and webcasts are intended to be inactive textual references only.\n10\nTable of Contents",
  "item7": "ITEM 7: \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nYou should read the following Management’s Discussion and Analysis of Financial Condition and Results of Operations in conjunction with Part I “Forward Looking Statements,” Part I, Item 1 “Business,” Part I, Item 1A “Risk Factors,” and the consolidated financial statements and the related notes included in this report. This section of this Annual Report on Form 10-K generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 are not included in this Annual Report on Form 10-K, and can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023.\nOVERVIEW\n \nBusiness\neBay Inc. is a global commerce leader that connects people and builds communities to create economic opportunity for all. Our technology empowers millions of buyers and sellers in more than 190 markets around the world, providing everyone the opportunity to grow and thrive. Our Marketplace platforms, including our online marketplace located at www.ebay.com and its localized counterparts, our off-platform marketplaces and our suite of mobile apps, together, create one of the world's largest and most vibrant marketplaces for discovering great value and unique selection.\nGross Merchandise Volume (“GMV”) grew during 2024 as we executed on our strategy, including across Focus Categories, country-specific investments, and horizontal initiatives. Improvement was driven by cross-category shopping, horizontal innovation, country-specific initiatives and growth in recommerce. The culmination of these effects, combined with consumers looking for value, offset pressure in discretionary spending across our three largest markets primarily resulting from geopolitical events, inflationary pressure, foreign exchange rate volatility, elevated interest rates and lower consumer confidence.\nFX-Neutral Presentation\nIn addition to presenting net revenues in accordance with U.S. generally accepted accounting principles (“GAAP”), we also present foreign exchange neutral (“FX-Neutral”) net revenues to supplement our results of operations presented in accordance with GAAP and to enhance investors’ understanding of our global business performance by excluding the positive or negative year-over-year impact of foreign currency movements on reported net revenues. We define FX-Neutral net revenues as GAAP net revenues minus the exchange rate effect, which we calculate by applying prior period foreign currency exchange rates to current year transactional currency amounts, excluding hedging activity. We believe presenting FX-Neutral net revenues provides useful information to both management and investors by isolating the effects of foreign currency exchange rate fluctuations that may not be indicative of our core operating results. In addition, as we have historically reported certain FX-Neutral results to investors, we believe that continuing to include these FX-Neutral measures provides consistency in our financial reporting. FX-Neutral net revenues are non-GAAP financial measures that are not based on any comprehensive set of accounting rules or principles and may be calculated differently than other “FX-Neutral,” “constant currency,” or similarly titled measures used by other companies. FX-Neutral net revenues are not presented as an alternative to GAAP net revenues and should only be used to evaluate our results of operations in conjunction with GAAP net revenues.\n40\nTable of Contents\nFiscal Year Highlights\nNet revenues increased 2% to $10.3 billion compared to $10.1 billion in 2023. FX-Neutral net revenues (as defined above) also increased 2% compared to 2023. Operating margin increased to 22.5% compared to 19.2% in 2023.\nWe generated cash flow from continuing operating activities of $2.4 billion in both 2024 and 2023.\nWe recognized $76 million of aggregate losses on equity investments and warrant in our consolidated statement of income compared to $1.8 billion of aggregate gains recognized during 2023.\nWe repurchased $3.1 billion of common stock and paid $533 million in cash dividends.\nIn the first and fourth quarter, our Board authorized an incremental $2.0 billion and $3.0 billion, respectively, under our stock repurchase program, with no expiration from the date of authorization.\nIn the third quarter, we repaid $750 million aggregate principal amount of our previously outstanding 3.450% senior notes on the date of maturity.\nIn the second quarter, we completed the previously announced sale of Adevinta ASA (“Adevinta”) shares in exchange for $2.4 billion in cash and shares of the new entity, Aurelia Netherlands TopCo B.V. (“Aurelia”) representing approximately 18.3% ownership. We recognized an unrealized loss of $234 million and a realized gain of $78 million. Concurrently, we granted Aurelia UK Feederco Limited, the buyer, a six-month option to purchase Aurelia shares.\nIn the fourth quarter, the option was exercised upon which we sold additional shares in Aurelia in exchange for $1.0 billion in cash and recognized an $11 million loss. The fair value of the investment was $867 million as of December 31, 2024, representing approximately 8.3% of the outstanding equity of Aurelia.\nIn the fourth quarter, we met the processing volume milestone required to vest in the second tranche of our warrant to purchase shares of Adyen N.V. (“Adyen”). Upon vesting, we exercised the option to purchase shares of Adyen valued at $630 million in exchange for $108 million in cash. We subsequently sold our shares for $573 million and recognized a realized loss of $57 million.\nIn the fourth quarter, we sold our remaining stake in Gmarket Global LLC (“Gmarket”) valued at $323 million in exchange for $322 million in cash, net of transaction costs, and recognized a realized loss of $1 million and an unrealized loss of $12 million related to the change in fair value of the investment.\nIn January 2025, we repaid the $450 million aggregate principal amount of the previously outstanding commercial paper notes on the date of maturity.\nIn February 2025, our Board declared a cash dividend of $0.29 per share of common stock to be paid on March 28, 2025 to stockholders of record as of March 14, 2025.\n41\nTable of Contents\nRESULTS OF OPERATIONS\nWe have one reportable segment, which reflects how the chief operating decision maker (“CODM”), President and Chief Executive Officer, reviews and assesses performance of the business. This reportable segment includes our online marketplace located at www.ebay.com and its localized counterparts, our off-platform marketplaces and our suite of mobile apps. The accounting policies of this segment are the same as those described in “Note 1 — The Company and Summary of Significant Accounting Policies” in our consolidated financial statements included elsewhere in this report.\nNet Revenues\nWe generate revenues from the following activities:\nMarketplace revenues\n primarily consist of commissions related to the connection service including final value fees, listing fees, feature fees, and foreign exchange fees. Marketplace revenues also include store subscription fees, shipping fees, and certain other fees. Marketplace revenues are reduced by customer incentive programs, including discounts, coupons, and rewards.\nAdvertising revenues\n primarily consist of fees charged to sellers to promote their listings on our Marketplace platforms, as well as third-party advertising fees.\nThe following table presents net revenues for the periods indicated (in millions, except percentages):\n \nYear Ended December 31,\n \n2024\n% Change\n2023\n% Change\n2022\nMarketplace revenues\n$\n8,648 \n— \n%\n$\n8,669 \n— \n%\n$\n8,644 \nAdvertising revenues\n1,635 \n13 \n%\n1,443 \n25 \n%\n1,151 \nNet revenues\n$\n10,283 \n2 \n%\n$\n10,112 \n3 \n%\n$\n9,795 \nSeasonality\nWe expect volume on our Marketplace platforms to trend with general consumer buying patterns. Seasonal trends in net revenues have been influenced by macroeconomic conditions, foreign exchange rate fluctuations, as well as the introduction and scaling of new products and initiatives by us and our competitors. The following table presents our total net revenues and the sequential quarterly movements of these net revenues for the periods indicated (in millions, except percentages):\n \nQuarter Ended\n \nMarch 31\nJune 30\nSeptember 30\nDecember 31\n2022\nNet revenues\n$\n2,483 \n$\n2,422 \n$\n2,380 \n$\n2,510 \n% change from prior quarter\n(5)\n%\n(2)\n%\n(2)\n%\n5 \n%\n2023\nNet revenues\n$\n2,510 \n$\n2,540 \n$\n2,500 \n$\n2,562 \n% change from prior quarter\n— \n%\n1 \n%\n(2)\n%\n2 \n%\n2024\nNet revenues\n$\n2,556 \n$\n2,572 \n$\n2,576 \n$\n2,579 \n% change from prior quarter\n— \n%\n1 \n%\n— \n%\n— \n%\n42\nTable of Contents\nNet Revenues by Geography\nRevenues are attributed to the United States and international geographies primarily based upon the country in which the customer is located. The following table presents net revenues by geography for the periods indicated (in millions, except percentages):\n \nYear Ended December 31,\n \n2024\n% Change\n2023\n% Change\n2022\nUnited States\n$\n5,238 \n  \n3 \n%\n$\n5,073 \n  \n5 \n%\n$\n4,842 \n% of net revenues\n51 \n%\n50 \n%\n49 \n%\nInternational\n5,045 \n— \n%\n5,039 \n2 \n%\n4,953 \n% of net revenues\n49 \n%\n50 \n%\n51 \n%\nNet revenues \n(1)(2)\n$\n10,283 \n2 \n%\n$\n10,112 \n3 \n%\n$\n9,795 \n(1)\nNet revenues included $54 million of hedging losses during 2024 compared to $56 million and $140 million of hedging gains during 2023 and 2022, respectively.\n(2)\nForeign currency movements relative to the U.S. dollar had a favorable impact of $2 million during 2024 compared to a favorable impact of $52 million and an unfavorable impact of $320 million during 2023 and 2022, respectively. The effect of foreign currency exchange rate movements during 2024 compared to 2023 was primarily attributable to the weakening of the U.S. dollar against the euro and other major currencies.\nOur Marketplace platforms operate globally, resulting in certain revenues that are denominated in foreign currencies, primarily the British pound and euro. Year-over-year appreciation or depreciation of the U.S. dollar may have a material impact to our financial results; we have experienced and may continue to experience elevated foreign currency volatility in the future. Through our hedging programs, we actively monitor foreign currency volatility and attempt to mitigate significant movements. As shown in the table above, we generate approximately half of our net revenues internationally. Therefore, we are subject to the risks related to conducting business in foreign countries as discussed under “Item 1A: Risk Factors” in Part I of this report.\nKey Operating Metrics\nGMV and take rate are significant factors that we believe affect our net revenues.\nGMV\n consists of the total value of all paid transactions between users on our Marketplace platforms during the applicable period inclusive of shipping fees and taxes. We believe that GMV provides a useful measure of the overall volume of paid transactions that flow through our Marketplace platforms in a given period.\nFX-Neutral GMV is defined as GMV minus the exchange rate effect, which we calculate by applying prior period foreign currency exchange rates to current year transactional currency amounts.\nTake rate\n is defined as net revenues divided by GMV and represents net revenue as a percentage of overall volume on our Marketplace platforms. We believe that take rate provides a useful measure of our ability to monetize volume through services on our Marketplace platforms in a given period. We use take rate to identify key revenue drivers.\n43\nTable of Contents\nThe following table presents net revenues and our key operating metrics of GMV and take rate for the periods indicated. The following table also presents a reconciliation of FX-Neutral net revenues and FX-Neutral GMV (each as defined above) to our reported net revenues and GMV for the periods indicated (in millions, except percentages):\nYear Ended December 31,\n \n2024\n2023\n% Change\n \nAs Reported \n(1)\nExchange Rate Effect\nFX-Neutral\nAs Reported\nAs Reported\nFX-Neutral\nNet revenues\n$\n10,283 \n$\n2 \n$\n10,281 \n$\n10,112 \n2 \n%\n2 \n%\nGMV\n$\n74,667 \n$\n430 \n$\n74,237 \n$\n73,206 \n2 \n%\n1 \n%\nTake rate\n13.77 \n%\n13.81 \n%\n(0.04)\n%\nYear Ended December 31,\n \n2023\n2022\n% Change\n \nAs Reported \n(1)\nExchange Rate Effect\nFX-Neutral\nAs Reported\nAs Reported\nFX-Neutral\nNet revenues\n$\n10,112 \n$\n52 \n$\n10,060 \n$\n9,795 \n3 \n%\n4 \n%\nGMV\n$\n73,206 \n$\n(44)\n$\n73,250 \n$\n73,900 \n(1)\n%\n(1)\n%\nTake rate\n13.81 \n%\n13.25 \n%\n0.56 \n%\n(1)\nNet revenues included $54 million of hedging losses during 2024 compared to $56 million and $140 million of hedging gains during 2023 and 2022, respectively.\nIn 2024, the increase in net revenues was primarily due to higher GMV, the expansion of promoted listings products, the ramp of eBay International Shipping and additional financial services offered to buyers and sellers within our payments system, partially offset by a decline in our take rate driven by fluctuations in foreign currency exchange rates and changes to our fee structure in certain markets.\nGMV grew during 2024 as we executed on our strategy, including across Focus Categories, country-specific investments, and horizontal initiatives. Traffic improvement was driven by cross-category shopping, horizontal innovation, country-specific initiatives and growth in recommerce. The culmination of these effects, combined with consumers looking for value, offset pressure in discretionary spending across our three largest markets primarily resulting from geopolitical events, inflationary pressure, foreign exchange rate volatility, elevated interest rates and lower consumer confidence.\nFocus Categories GMV grew in aggregate, faster than the remainder of our marketplace. This volume growth was primarily driven by Parts & Accessories (“P&A”), Refurbished, Collectibles, and Luxury goods. Traffic and conversion improved in the U.S., which led to a narrower gap to U.S. ecommerce market growth. Collectibles was a key contributor to U.S. growth, including Trading Cards, where traffic and conversion have improved, driven by strategic investments and partnerships. In the United Kingdom and Germany, we continued to experience challenging macroeconomic conditions and lower consumer confidence, with offsetting growth in P&A and consumer-to-consumer volume. Cross-border trade was a key driver of International GMV growth, led by exports from Greater China and Japan into our major markets. Cross-border trade was also a significant contributor to growth in Focus Categories, particularly P&A.\n44\nTable of Contents\nCost of Net Revenues\nCost of net revenues represents costs associated with customer support, site operations and payment processing. Significant components of these costs primarily consist of employee compensation (including stock-based compensation), contractor costs, facilities costs, depreciation of equipment and amortization expense, bank transaction fees, credit card interchange and assessment fees, authentication costs, shipping costs and indirect tax expenses. The following table presents cost of net revenues for the periods indicated (in millions, except percentages): \n \nYear Ended December 31,\n \n2024\n% Change\n  \n2023\n% Change\n  \n2022\nCost of net revenues \n(1)(2)\n$\n2,880 \n2 \n%\n  \n$\n2,833 \n6 \n%\n  \n$\n2,680 \n% of net revenues\n28 \n%\n28 \n%\n27 \n%\n(1)\nCost of net revenues were net of immaterial hedging activity during 2024, 2023 and 2022, respectively.\n(2)\nForeign currency movements relative to the U.S. dollar had an unfavorable impact of $7 million on cost of net revenues during 2024 compared to an unfavorable impact of $2 million and a favorable impact of $81 million during 2023 and 2022, respectively.\nThe increase in cost of net revenues during 2024 compared to 2023 was primarily due to a $53 million increase related to the expansion of promoted listings products, a $50 million increase related to indirect tax expenses, a $32 million increase related to the ramp of eBay International Shipping, and an $11 million disposition of data center equipment, partially offset by a $66 million decrease in depreciation expense due to the change in our estimate of the useful lives for our servers and networking equipment and a $38 million decrease in payment processing costs driven by rate improvements.\nOperating Expenses\nThe following table presents operating expenses for the periods indicated (in millions, except percentages): \n \nYear Ended December 31,\n \n2024\n% Change\n2023\n% Change\n2022\nSales and marketing\n$\n2,319 \n5 \n%\n$\n2,217 \n4 \n%\n$\n2,136 \n% of net revenues\n23 \n%\n22 \n%\n22 \n%\nProduct development\n1,479 \n(4)\n%\n1,544 \n16 \n%\n1,330 \n% of net revenues\n14 \n%\n15 \n%\n14 \n%\nGeneral and administrative\n914 \n(24)\n%\n1,196 \n24 \n%\n963 \n% of net revenues\n9 \n%\n12 \n%\n10 \n%\nProvision for transaction losses\n353 \n(2)\n%\n360 \n8 \n%\n332 \n% of net revenues\n3 \n%\n4 \n%\n3 \n%\nAmortization of acquired intangible assets\n20 \n**\n21 \n**\n4 \nTotal operating expenses \n(1)(2)\n$\n5,085 \n(5)\n%\n$\n5,338 \n12 \n%\n$\n4,765 \n(1)\nOperating expenses were net of immaterial hedging activity during 2024, 2023 and 2022, respectively.\n(2)\nForeign currency movements relative to the U.S. dollar had an unfavorable impact of $9 million on operating expenses during 2024 compared to a favorable impact of $16 million and $193 million during 2023 and 2022, respectively.\n**    Not meaningful\nSales and Marketing\n \nSales and marketing expenses primarily consist of marketing program costs, employee compensation (including stock-based compensation), certain user coupons and rewards, contractor costs, facilities costs and depreciation on equipment. Marketing program costs represent traffic acquisition costs in various channels such as paid search, affiliates marketing and display advertising, as well as brand campaigns and buyer/seller communications.\nThe increase in sales and marketing expenses during 2024 compared to 2023 was primarily due to a $163 million increase in marketing program costs and user coupons, partially offset by a $74 million decrease in employee-related costs.\n45\nTable of Contents\nProduct Development\n \nProduct development expenses primarily consist of employee compensation (including stock-based compensation), contractor costs, facilities costs and depreciation on equipment. Product development expenses are net of required capitalization of major platform and other product development efforts, including the development and maintenance of our technology platform. Our top technology priorities include improving seller tools and buyer experiences across our Marketplace platforms powered by intelligent computing at scale.\nThe decrease in product development expenses during 2024 compared to 2023 was primarily due to a decrease in employee-related costs driven by operational efficiencies. While employee costs are decreasing, we continue to invest in strategic areas such as browsing experience, search optimization and providing relevant recommendations to enhance the experience for our customers around the world.\nCapitalized internal use and platform development costs were $108 million and $115 million in 2024 and 2023, respectively. These costs are primarily reflected as a cost of net revenues when amortized in future periods.\nGeneral and Administrative\n \nGeneral and administrative expenses primarily consist of employee compensation (including stock-based compensation), contractor costs, facilities costs, depreciation of equipment, legal expenses, restructuring, insurance premiums and professional fees. Our legal expenses, including those related to various ongoing legal proceedings, may fluctuate substantially from period to period.\nThe decrease in general and administrative expenses during 2024 compared to 2023 was primarily due to a $56 million legal accrual release during 2024 compared to a $65 million legal expense recognized during 2023 and an $8 million restructuring accrual release during 2024 compared to a $141 million restructuring expense recognized during 2023. See “Note 12 — Commitments and Contingencies” and “Note 18 — Restructuring” to the consolidated financial statements included in this report for additional details regarding our legal matters and the restructuring, respectively.\nProvision for Transaction Losses\nProvision for transaction losses consists primarily of losses resulting from our buyer protection programs, chargebacks for unauthorized credit card use, and merchant related chargebacks due to non-delivery of goods or services. We expect our provision for transaction losses to fluctuate depending on many factors, including changes to our protection programs and macroeconomic conditions.\nThe decrease in provision for transaction losses during 2024 compared to 2023 was primarily due to favorable fluctuations in buyer and seller fraud rates.\n46\nTable of Contents\nGain (loss) on equity investments and warrant, net\nGain (loss) on equity investments and warrant, net primarily consists of gains and losses related to our various types of equity investments, including our equity investments in Adevinta, Adyen, Aurelia and Gmarket, and gains and losses due to changes in fair value of the warrant received from Adyen. The following table presents gain (loss) on equity investments and warrant, net for the periods indicated (in millions, except percentages):\n \nYear Ended December 31,\n \n2024\n% Change\n  \n2023\n% Change\n  \n2022\nUnrealized change in fair value of equity investment in Adevinta\n$\n(234)\n(113)\n%\n$\n1,782 \n166 \n%\n$\n(2,693)\nRealized change in fair value of shares sold in \nAdevinta\n78 \n100 \n%\n— \n(100)\n%\n2 \nUnrealized change in fair value of equity investment in Adyen\n— \n**\n— \n100 \n%\n(118)\nRealized change in fair value of shares sold in Adyen\n(57)\n(100)\n%\n— \n100 \n%\n(143)\nRealized change in fair value of shares sold in Aurelia\n(11)\n(100)\n%\n— \n**\n— \nUnrealized change in fair value of equity investment in Gmarket\n(12)\n88 \n%\n(96)\n67 \n%\n(294)\nRealized change in fair value of shares sold in Gmarket\n(1)\n**\n— \n**\n— \nUnrealized change in fair value of equity investment in KakaoBank\n— \n**\n— \n100 \n%\n(218)\nRealized change in fair value of shares sold in KakaoBank\n— \n(100)\n%\n13 \n117 \n%\n(75)\nGain (loss) on other investments\n3 \n118 \n%\n(17)\n— \n%\n(17)\nChange in fair value of warrant\n158 \n5 \n%\n150 \n165 \n%\n(230)\nTotal gain (loss) on equity investments and warrant, net\n$\n(76)\n(104)\n%\n  \n$\n1,832 \n148 \n%\n  \n$\n(3,786)\n**    Not meaningful\nThe change in gain (loss) on equity investments and warrant, net during 2024 compared to 2023 was driven by the realized and unrealized changes in fair value of our equity investments and the warrant. Refer to “Note 6 — Investments” for further details about our equity investments.\n47\nTable of Contents\nInterest Expense, Interest Income and Other, Net\nInterest expense primarily consists of interest charges on amounts borrowed, commitment fees on unborrowed amounts under our credit agreement and interest expense on our outstanding debt securities and commercial paper, as applicable. Interest income and other, net primarily consists of interest earned on cash, cash equivalents, investments and customer accounts, gains and losses on foreign exchange transactions and transaction costs of acquisitions. The following table presents interest expense and interest income and other, net for the periods indicated (in millions, except percentages):\n \nYear Ended December 31,\n \n2024\n% Change\n  \n2023\n% Change\n  \n2022\nInterest expense\n$\n(259)\n(2)\n%\n$\n(263)\n12 \n%\n$\n(235)\nPercentage of net revenues\n(3)\n%\n(3)\n%\n(2)\n%\nInterest income\n$\n272 \n33 \n%\n  \n$\n204 \n179 \n%\n  \n$\n73 \nForeign exchange and other\n23 \n**\n  \n(7)\n**\n  \n(3)\nTotal interest income and other, net\n$\n295 \n50 \n%\n  \n$\n197 \n181 \n%\n  \n$\n70 \nPercentage of net revenues\n3 \n%\n2 \n%\n1 \n%\n**    Not meaningful\nInterest expense decreased during 2024 compared to 2023 primarily due to a lower average notional amount of outstanding debt.\nInterest income increased during 2024 compared to 2023 primarily due to a higher average notional amount and higher yields on fixed-income investments.\n \nIncome Tax Provision (Benefit)\nThe following table presents provision for income taxes and effective tax rate for the periods indicated (in millions, except percentages):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nIncome tax provision (benefit)\n$\n297 \n$\n932 \n$\n(327)\nEffective tax rate\n13.0 \n%\n  \n25.1 \n%\n  \n20.4 \n%\nThe decrease in our effective tax rate during 2024 compared to 2023 was primarily due to benefits from the sale of Gmarket, research and development tax credits generated, excess tax benefits on stock-based compensation and the 2023 non-recurring remeasurement of deferred tax assets related to a tax rate reduction and an increase in reserves for uncertain tax positions, partially offset by a benefit from the release of a valuation allowance.\nWe are regularly under examination by tax authorities both domestically and internationally. We believe that adequate amounts have been reserved for any adjustments that may ultimately result from these examinations, although there are inherent uncertainties in these examinations. Due to the ongoing tax examinations, it is generally impractical to determine the amount and timing of these adjustments. However, we expect several tax examinations to close within the next 12 months. See “Note 15 — Income Taxes” to the consolidated financial statements included in this report for more information on estimated settlements within the next 12 months.\n48\nTable of Contents\nLiquidity and Capital Resources \nCash Flows\n \n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In millions)\nNet cash provided by (used in):\n \n \nContinuing operating activities\n$\n2,414 \n$\n2,431 \n$\n2,627 \nContinuing investing activities\n2,213 \n240 \n2,459 \nContinuing financing activities\n(3,806)\n(2,450)\n(3,792)\nEffect of exchange rates on cash, cash equivalents and restricted cash\n(28)\n5 \n(57)\nNet decrease in cash, cash equivalents and restricted cash - discontinued operations\n— \n(5)\n(371)\nNet increase in cash, cash equivalents and restricted cash\n$\n793 \n$\n221 \n$\n866 \n \nContinuing Operating Activities\nOur operating cash flows arise primarily from cash received from our customers on our Marketplace platforms offset by cash payments for sales and marketing, employee compensation and payment processing expenses.\nCash provided by continuing operating activities of $2.4 billion in 2024 compared to $2.4 billion in 2023 was primarily attributable to a $377 million increase in operating income offset by working capital movements.\nContinuing Investing Activities\nCash provided by continuing investing activities of $2.2 billion in 2024 was primarily attributable to proceeds of $12.3 billion from the maturities and sales of investments, and proceeds of $2.4 billion, $1.0 billion, $573 million and $322 million from the sale of our equity investments in Adevinta, Aurelia, Adyen and Gmarket, respectively, partially offset by cash paid for investments of $13.9 billion and property and equipment of $458 million.\nCash provided by continuing investing activities of $240 million in 2023 was primarily attributable to proceeds of $14.5 billion from the maturities and sales of investments, partially offset by cash paid for investments of $13.9 billion and property and equipment of $456 million.\nThe largely offsetting effects of purchases of investments and maturities and sale of investments results from the management of our investments. As our immediate cash needs change, purchase and sale activity will fluctuate.\nContinuing Financing Activities\nCash used in continuing financing activities of $3.8 billion in 2024 was primarily driven by common stock repurchases of $3.1 billion, debt repayments of $750 million related to the repayment of our 3.450% senior notes due 2024, and $533 million of cash dividends paid, partially offset by borrowing under our commercial paper program of $441 million and net funds receivable and payable activity of $305 million.\nCash used in continuing financing activities of $2.5 billion in 2023 was primarily driven by common stock repurchases of $1.4 billion, debt repayments of $1.2 billion related to the repayment of our floating rate and \n2.750%\n senior notes due 2023, and $528 million of cash dividends paid, partially offset by net funds receivable and payable activity of $717 million driven by changes in payment processors.\nThe negative and positive effects of exchange rate movements on cash, cash equivalents and restricted cash during 2024 and 2023, respectively, was due to the strengthening and weakening, respectively, of the U.S. dollar against other currencies.\n49\nTable of Contents\nLiquidity and Capital Resource Requirements\n \nAs of December 31, 2024 and 2023, we had assets classified as cash and cash equivalents as well as short-term and long-term non-equity investments, in an aggregate amount of $7.2 billion and $5.1 billion, respectively. These amounts do not include cash held on behalf of customers related to marketplace activity of $763 million and $481 million, respectively, which are recognized separately within “Customer accounts and funds receivable” with a corresponding liability within “Customer accounts and funds payable” in our consolidated balance sheet. These amounts also do not include restricted cash related to safeguarding customer funds, our global sabbatical program, and other compensation arrangements held in escrow totaling $90 million and $27 million, respectively. We believe these assets together with cash expected to be generated from operations, borrowings available under our credit agreement and commercial paper program, and our access to capital markets, will be sufficient to satisfy our material cash requirements over the next 12 months and for the foreseeable future. \nGeopolitical events, inflationary pressure, foreign exchange rate volatility, elevated interest rates and global economic uncertainty have caused material disruptions in both the United States and international financial markets and economies and are uncertain in duration. The impact of these events has increased, and may continue to increase, our borrowing costs and other costs of capital and otherwise adversely affect our business, results of operations, financial condition and liquidity. The future impact of these events cannot be predicted with certainty and we cannot assure that we will have access to external financing at times and on terms we consider acceptable, or at all, or that we will not experience other liquidity issues going forward.\nWe have certain fixed contractual obligations and commitments that include future estimated payments for general operating purposes. Changes in our business needs, contractual cancellation provisions, fluctuating interest rates, and other factors may result in actual payments differing from the estimates. We cannot provide certainty regarding the timing and amounts of these payments. The following sections summarizes our fixed contractual obligations and commitments.\nSenior Notes\nIn 2024, we repaid the $750 million aggregate principal amount of our previously outstanding 3.450% senior notes on the date of maturity.\nIn 2023, we repaid the $1.2 billion \naggregate principal amount of our \nfloating rate and 2.750% senior notes on the date of maturity.\nAs of December 31, 2024, we had fixed-rate senior notes outstanding with an aggregate principal amount of $7.0 billion, with $1.2 billion payable within 12 months. Future interest payments associated with the senior notes totaled an aggregate of $2.1 billion, with an aggregate of $223 million payable within 12 months. The net proceeds from the issuances of these senior notes were used for general corporate purposes, including, among other things, capital expenditures, share repurchases, repayment of indebtedness and acquisitions.\nCommercial Paper\nWe have a commercial paper program pursuant to which we may issue commercial paper notes in an aggregate principal amount at maturity of up to $1.5 billion outstanding at any time with maturities of up to 397 days from the date of issue. In 2024, we issued and repaid $180 million of commercial paper notes with original maturities less than 90 days and issued $450 million of commercial paper notes with original maturities greater than 90 days. As of December 31, 2024, we had $450 million aggregate principal amount of commercial paper notes outstanding with a weighted average interest rate of 5.10% per annum, and a weighted average remaining term of 144 days.\nIn January 2025, we repaid the $450 million aggregate principal amount of the previously outstanding commercial paper notes on the date of maturity.\n50\nTable of Contents\nCredit Agreement \nWe have a credit agreement that provides for an unsecured $2.0 billion five-year revolving credit facility. We may also, subject to the agreement of the applicable lenders, increase the commitments under the revolving credit facility by up to $1.0 billion. Funds borrowed under the credit agreement may be used for working capital, capital expenditures, acquisitions and other general corporate purposes and will bear interest at either (i) a customary forward-looking term rate based on the secured overnight financing rate published by CME Group for the relevant interest period plus an adjustment of 0.1% or (ii) a customary base rate formula, plus a margin (based on our public debt ratings) ranging from 0% to 0.375%. The covenants of the credit agreement are discussed in “Note 10 — Debt” to the consolidated financial statements included in this report. As of December 31, 2024, we had $450 million aggregate principal amount of commercial paper notes outstanding; therefore, $1.6 billion of borrowing capacity was available for other purposes permitted by the credit agreement.\nLeases\nWe have operating leases for office space, data centers, as well as other corporate assets that we utilize under lease arrangements. As of December 31, 2024, we had fixed lease payment obligations of $544 million, with $142 million payable within 12 months. For additional details related to our leases, please see “Note 11 — Leases” to the consolidated financial statements included in this report.\nPurchase Obligations\nPurchase obligation amounts include minimum purchase commitments for advertising, capital expenditures (including for computer equipment, software applications, engineering development services, and construction contracts) and other goods and services entered into in the ordinary course of business. As of December 31, 2024, we had purchase obligations of $86 million, with $64 million payable within 12 months.\nIncome Taxes\nThe timing of the resolution and/or closure of audits is highly uncertain. Given the number of years remaining subject to examination and the number of matters being examined, we are unable to estimate the full range of possible adjustments to the balance of gross unrecognized tax benefits. We expect the gross amount of unrecognized tax benefits to be reduced within the next 12 months by at least $170 million.\nAs of December 31, 2024, our assets classified as cash and cash equivalents as well as short-term and long-term non-equity investments included assets held in certain of our foreign operations totaling $1.6 billion. As we repatriate these funds to the United States, we will be required to pay income taxes in certain U.S. states and applicable foreign withholding taxes on those amounts during the period when such repatriation occurs. We have accrued deferred taxes for the tax effect of repatriating the funds to the United States. For additional details related to our income taxes, please see “Income Tax Provision” in our Results of Operations above and “Note 15 — Income Taxes” to the consolidated financial statements included in this report.\nStock Repurchases\nOur stock repurchase programs are intended to programmatically offset the impact of dilution from our equity compensation programs and, subject to market conditions and other factors, to make opportunistic and programmatic repurchases of our common stock to reduce our outstanding share count and return value to stockholders. Any share repurchases under our stock repurchase programs will be funded from our working capital or other financing alternatives.\nWe expect to continue making opportunistic and programmatic repurchases of our common stock, subject to market conditions and other uncertainties. However, our stock repurchase programs may be limited or terminated at any time without prior notice. The timing and actual number of shares repurchased will depend on a variety of factors, including corporate and regulatory requirements, price and other market conditions and management’s determination as to the appropriate use of our cash.\nIn February and December 2024, our Board authorized an incremental $2.0 billion and $3.0 billion, respectively, under our stock repurchase program in addition to the $4.0 billion previously authorized in 2022. Our stock repurchase program has no expiration from the date of authorization.\n51\nTable of Contents\nDuring 2024, we repurchased $3.1 billion of our common stock under our stock repurchase program. As of December 31, 2024, a total of $3.3 billion remained available for future repurchases of our common stock. See “Note 13 — Stockholders’ Equity” to the consolidated financial statements included in this report for more information about our stock repurchase program.\nDividends\nWe paid a total of $533 million and $528 million in cash dividends in 2024 and 2023, respectively. In February 2025, our Board declared a cash dividend of $0.29 per share of common stock to be paid on March 28, 2025 to stockholders of record as of March 14, 2025.\nOther Capital Resource Requirements\nWe actively monitor all counterparties that hold our cash and cash equivalents and non-equity investments, focusing primarily on the safety of principal and secondarily on improving yield on these assets. We diversify our cash and cash equivalents and investments among various counterparties in order to reduce our exposure should any one of these counterparties fail or encounter difficulties. To date, we have not experienced any material loss or lack of access to our invested cash, cash equivalents or short-term investments; however, we can provide no assurances that access to our invested cash, cash equivalents or short-term investments will not be impacted by adverse conditions in the financial markets, including, without limitation, as a result of the impact of geopolitical events, inflationary pressure and foreign exchange rate volatility. At any point in time we have funds in our operating accounts and customer accounts that are deposited and invested with third party financial institutions.\nWe have entered into various indemnification agreements and, in the ordinary course of business, we have included limited indemnification provisions in certain of our agreements with parties with which we have commercial relations. It is not possible to determine the maximum potential loss under these various indemnification provisions due to our limited history of prior indemnification claims and the unique facts and circumstances involved in each particular provision. To date, losses recognized in our consolidated statement of income in connection with our indemnification provisions have not been significant, either individually or collectively. See “Note 12 — Commitments and Contingencies” to the consolidated financial statements included in this report for more information about our indemnification provisions.\n52\nTable of Contents\nCritical Accounting Policies, Judgments and Estimates\nGeneral \nThe preparation of our consolidated financial statements and related notes requires us to make judgments, estimates and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. We have based our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Our senior management has discussed the development, selection and disclosure of these estimates with the Audit Committee of our Board of Directors. Actual results may differ from these estimates under different assumptions or conditions. \nAn accounting policy is considered to be critical if it requires an accounting estimate to be made based on assumptions about matters that are highly uncertain at the time the estimate is made, and if different estimates that reasonably could have been used, or changes in the accounting estimates that are reasonably likely to occur periodically, could materially impact the consolidated financial statements. We believe the following critical accounting policies reflect the more significant estimates and assumptions used in the preparation of our consolidated financial statements. The following descriptions of critical accounting policies, judgments and estimates should be read in conjunction with our consolidated financial statements and related notes and other disclosures included in this report. \nRevenue Recognition\nWe may enter into certain revenue contracts that include promises to transfer multiple goods or services, including discounts on future services. We also may enter into arrangements to purchase services from certain customers. As a result, significant interpretation and judgment is sometimes required to determine the appropriate accounting for these transactions, including: (1) whether services are considered distinct performance obligations that should be accounted for separately or combined; (2) developing an estimate of the stand-alone selling price of each distinct performance obligation; (3) whether revenue should be reported gross (as eBay is acting as a principal), or net (as eBay is acting as an agent); (4) evaluating whether a promotion or incentive is a payment to a customer; and (5) whether the arrangement would be characterized as revenue or reimbursement of costs incurred. Changes in judgments with respect to these assumptions and estimates could impact the timing or amount of revenue recognition.\nIncome Taxes\nOur annual tax rate is based on our income, statutory tax rates and tax planning opportunities available to us in the various jurisdictions in which we operate. Tax laws are complex and subject to different interpretations by the taxpayer and respective government taxing authorities. Significant judgment is required in determining our tax expense and in evaluating our tax positions, including evaluating uncertainties and the complexity of taxes on foreign earnings. We review our tax positions quarterly and adjust the balances as new information becomes available. Tax positions are evaluated for potential reserves for uncertainty based on the estimated probability of sustaining the position under examination. Our income tax rate is affected by the tax rates that apply to our foreign earnings including U.S. minimum taxes on foreign earnings. The deferred tax benefit derived from the amortization of our intellectual property is based on the fair value, which has been agreed with foreign tax authorities. The deferred tax benefit may from time to time change based on changes in tax rates. Management has no specific plans to indefinitely reinvest the undistributed earnings of our foreign subsidiaries at the balance sheet date. \nDeferred tax assets represent amounts available to reduce income taxes payable on taxable income in future years. Such assets arise because of temporary differences between the financial reporting and tax bases of assets and liabilities, as well as from net operating loss and tax credit carryforwards. We evaluate the recoverability of these future tax deductions and credits by assessing the adequacy of future expected taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings and available tax planning strategies. These sources of income rely heavily on estimates that are based on a number of factors, including our historical experience and short-range and long-range business forecasts. As of December 31, 2024, we had a valuation allowance on certain net operating loss and tax credit carryforwards based on our assessment that it is more likely than not that the deferred tax asset will not be realized.\n53\nTable of Contents\nWe recognize and measure uncertain tax positions in accordance with generally accepted accounting principles in the United States, or GAAP, pursuant to which we only recognize the tax benefit from an uncertain tax position if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such positions are then measured based on the largest benefit that has a greater than 50 percent likelihood of being realized upon ultimate settlement. We report a liability for unrecognized tax benefits resulting from uncertain tax positions taken or expected to be taken in a tax return. GAAP further requires that a change in judgment related to the expected ultimate resolution of uncertain tax positions be recognized in earnings in the quarter in which such change occurs. We recognize interest and penalties, if any, related to unrecognized tax benefits in income tax expense. \nWe file annual income tax returns in multiple taxing jurisdictions around the world. A number of years may elapse before an uncertain tax position is audited by the relevant tax authorities and finally resolved. While it is often difficult to predict the final outcome or the timing of resolution of any particular uncertain tax position, we believe that our reserves for income taxes reflect the most likely outcome. We adjust these reserves, as well as the related interest, where appropriate in light of changing facts and circumstances. Settlement of any particular position could require the use of cash. \nOur future effective tax rates could be adversely affected by earnings being lower than anticipated in countries where we have lower statutory rates and higher than anticipated in countries where we have higher statutory rates, by changes in the valuation of our deferred tax assets or liabilities, or by changes or interpretations in tax laws, regulations or accounting principles. In addition, we are subject to the continuous examination of our income tax returns by the Internal Revenue Service, as well as various state and foreign tax authorities. We regularly assess the likelihood of adverse outcomes resulting from these examinations to determine the adequacy of our provision for income taxes. \nBased on our results for the year ended December 31, 2024, a one-percentage point change in our provision for income taxes as a percentage of income before taxes would have resulted in an increase or decrease in the provision of $23 million, resulting in an approximate $0.05 change in diluted earnings per share. \nGoodwill\nThe purchase price of an acquired company is allocated between intangible assets and the net tangible assets of the acquired business with the residual of the purchase price recognized as goodwill. \nAs of December 31, 2024, our goodwill totaled $4.3 billion. We assess the impairment of goodwill of our reporting unit annually, or more often if events or changes in circumstances indicate that the carrying value may not be recoverable. Goodwill is tested for impairment at the reporting unit level by first performing a qualitative assessment to determine whether it is more likely than not that the fair value of the reporting unit is less than its carrying value. If the reporting unit does not pass the qualitative assessment, then the reporting unit’s carrying value is compared to its fair value. The fair value of the reporting unit is estimated using market and discounted cash flow approaches. Goodwill is considered impaired if the carrying value of the reporting unit exceeds its fair value. The discounted cash flow approach uses expected future operating results. The market approach uses comparable company information to determine revenue and earnings multiples to value our reporting unit. Failure to achieve these expected results or market multiples may cause a future impairment of goodwill at the reporting unit. We conducted our annual impairment test of goodwill as of August 31, 2024 and 2023. As of December 31, 2024, we determined that no impairment of the carrying value of goodwill was required. See “Note 4 — Goodwill and Intangible Assets” to the consolidated financial statements included in this report. \nLegal Contingencies \nIn connection with certain pending litigation and other claims, we have estimated the range of probable loss, net of expected recoveries, and provided for such losses through charges to our consolidated statements of income. These estimates have been based on our assessment of the facts and circumstances at each balance sheet date and are subject to change based upon new information and future events. \n54\nTable of Contents\nFrom time to time, we are involved in disputes and regulatory inquiries that arise in the ordinary course of business. We are currently involved in legal proceedings, some of which are discussed in “Note 12 — Commitments and Contingencies” to the consolidated financial statements included in this report. We believe that we have meritorious defenses to the claims against us, and we intend to defend ourselves vigorously. However, even if successful, our defense against certain actions will be costly and could require significant amounts of management’s time and result in the diversion of significant operational resources. If the plaintiffs were to prevail on certain claims, we might be forced to pay significant damages and licensing fees, modify our business practices or even be prohibited from conducting a significant part of our business. Any such results could materially harm our business and could result in a material adverse impact on the financial position, results of operations or cash flows. \nRecent Accounting Pronouncements\nSee \"Note 1 — The Company and Summary of Significant Accounting Policies\" to the consolidated financial statements included in this report, regarding the impact of certain recent accounting pronouncements in our consolidated financial statements.\n55\nTable of Contents",
  "item2": null
}