{
  "source_file": "efx-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \nThe following Management’s Discussion and Analysis (“MD&A”) is intended to help the reader understand the results of operations and financial condition of Equifax Inc. MD&A is provided as a supplement to and should be read in conjunction with our consolidated financial statements and the accompanying Notes to Financial Statements in Item 1 of this Form 10-Q. This section discusses the results of our operations for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024. All percentages have been calculated using unrounded amounts for each of the periods presented.\nAs used herein, the terms Equifax, the Company, we, our and us refer to Equifax Inc., a Georgia corporation, and its consolidated subsidiaries as a combined entity, except where it is clear that the terms mean only Equifax Inc.\n \nAll references to earnings per share data in MD&A are to diluted earnings per share, or EPS, unless otherwise noted. Diluted EPS is calculated to reflect the potential dilution that would occur if stock options or other contracts to issue common stock were exercised and resulted in additional common shares outstanding.\n \nBUSINESS OVERVIEW\n \nEquifax Inc. is a global data, analytics and technology company. We provide information solutions for businesses, governments and consumers, and we provide human resources business process automation and outsourcing services for employers. We have a large and diversified group of clients, including financial institutions, corporations, government agencies and individuals. Our services are based on comprehensive databases of consumer and business information derived from numerous sources including credit, financial assets, telecommunications and utility payments, employment, income, educational history, criminal justice, healthcare professional licensure and sanctions, demographic and marketing data. We use advanced statistical techniques, artificial intelligence including machine learning, and proprietary software tools to analyze available data to create customized insights, decision-making and process automation solutions and processing services for our clients. We are a leading provider of information and solutions used in payroll-related and human resource management business process services in the U.S., as well as e-commerce fraud and charge back protection services in North America. For consumers, we provide products and services to help people understand, manage and protect their personal information and make more informed financial decisions. Additionally, we also provide information, technology and services to support debt collections and recovery management.\n24\nWe currently operate in four global regions: North America (U.S. and Canada), Asia Pacific (Australia, New Zealand and India), Europe (the U.K., Spain and Portugal) and Latin America (Argentina, Brazil, Chile, Costa Rica, Dominican Republic, Ecuador, El Salvador, Honduras, Mexico, Paraguay, Peru and Uruguay). We maintain support operations in Chile, Costa Rica, India and Ireland. We also have investments in consumer and/or commercial credit information companies through joint ventures in Brazil, Cambodia, Malaysia and Singapore.\nRecent Events and Company Outlook\nAs further described in our 2024 Form 10-K, we operate in the U.S., which represented 76% of our revenue in 2024. Additionally, we operate internationally in 20 countries. Our products and services span a wide variety of vertical markets including financial services, mortgage, talent solutions, federal, state and local governments, automotive, telecommunications, e-commerce and many others.\nDemand for our services tends to be correlated to general levels of economic activity and to consumer credit and small business commercial credit decisioning and portfolio review, marketing, identity validation and fraud protection activity, employee hiring and onboarding activity, and activity in provisioning support services in the U.S. by government agencies. Demand is also enhanced by our initiatives to expand our products, capabilities and markets served.\nWe remain in a period of economic uncertainty in the U.S. and our global markets, including uncertainty regarding expectations for inflation and interest rates. The direction of global economies, inflation and interest rates will have an impact on demand for our services. \nOur current planning for 2025 assumes that U.S. economic activity, as measured by GDP, will grow at a rate somewhat lower than in 2024. We expect U.S. mortgage credit activity in 2025 to be below the levels of activity seen in 2024. The U.S. mortgage market, particularly the mortgage refinance portion of the U.S. mortgage market, can be significantly impacted by U.S. interest rates which impact mortgage rates available to consumers. In the international markets in which we operate, our planning also assumes that economic activity, as measured by GDP, will generally grow in 2025 at rates below those experienced in 2024. As noted above, due to the current significant economic and market volatility and uncertainty, these assumptions may change.\nFor more information, see “Item 1A. Risk FactorsーNegative changes in general economic conditions, including interest rates, the level of inflation, unemployment rates, income, home prices, investment values and consumer confidence, could adversely affect us,” in our 2024 Form 10-K.\nSegment and Geographic Information\nSegments. \n The Workforce Solutions segment consists of the Verification Services and Employer Services business lines. Verification Services revenue is transaction and subscription based and is derived primarily from verifications of employment and income data, as well as criminal justice data and educational background data. Employer Services revenue is derived from our provision of certain human resources business process outsourcing services that include both transaction and subscription based product offerings. These services include unemployment claims management, I-9 and onboarding services, Affordable Care Act (\"ACA\") compliance management, tax credits and incentives and other complementary employment-based transaction services.  \nThe USIS segment consists of two service lines: Online Information Solutions and Financial Marketing Services. Online Information Solutions revenue is principally transaction-based and is derived from our sales of products such as consumer and commercial credit reporting and scoring, identity management, fraud detection, modeling services and consumer credit monitoring services. USIS also markets certain analytical and decisioning software and services which facilitate and automate a variety of consumer and commercial credit-oriented decisions. Online Information Solutions also includes our U.S. consumer credit monitoring solutions business. Financial Marketing Services revenue is principally project and subscription based and is derived from our sales of batch credit and consumer wealth information such as those that assist clients in acquiring new customers, cross-selling to existing customers and managing portfolio risk.\n \nThe International segment consists of Latin America, Europe, Asia Pacific and Canada. Canada’s services are similar to our USIS offerings. Asia Pacific, Europe and Latin America are made up of varying mixes of service lines that are generally consistent with those in our USIS reportable segment. We also provide information and technology services to support lenders and other creditors in the collections and recovery management process.\n25\nGeographic Information.\n  We currently have operations in the following countries: Argentina, Australia, Brazil, Canada, Chile, Costa Rica, Dominican Republic, Ecuador, El Salvador, Honduras, India, Ireland, Mexico, New Zealand, Paraguay, Peru, Portugal, Spain, the U.K., Uruguay and the U.S. We also have investments in consumer and/or commercial credit information companies through joint ventures in Brazil, Cambodia, Malaysia and Singapore. Approximately 76% of our revenue was generated in the U.S. during the three months ended September 30, 2025 and 2024. Approximately 77% and 76% of our revenue was generated in the U.S. during the nine months ended September 30, 2025 and 2024, respectively.\n \nSeasonality.\n We experience seasonality in certain of our revenue streams. Revenue generated by the online consumer information services component of our USIS operating segment is typically the lowest during the first quarter, when consumer lending activity is at a seasonal low. Revenue generated from the Employer Services business unit within the Workforce Solutions operating segment is generally higher in the first quarter due primarily to the provision of 1095-C services that occur in the first quarter each year. Revenue generated from our financial wealth asset products and data management services in our Financial Marketing Services business is generally higher in the fourth quarter each year due to the significant portion of our annual renewals and deliveries which occur then. Mortgage related revenue is generally higher in the second and third quarters of the year due to the increase in consumer home purchasing during the summer in the U.S. Any change in the U.S. mortgage market has a corresponding impact on revenue and operating profit for our business within the Workforce Solutions and USIS operating segments.\nKey Performance Indicators.\n  Management focuses on a variety of key indicators to monitor operating and financial performance. These performance indicators include measurements of operating revenue, change in operating revenue, operating income, operating margin, net income, diluted earnings per share, cash provided by operating activities and capital expenditures. The key performance indicators for the three and nine months ended September 30, 2025 and 2024 were as follows:\nKey Performance Indicators\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n(In millions, except per share data)\nOperating revenue\n$\n1,544.9\n \n$\n1,441.8 \n$\n4,523.9\n \n$\n4,261.7 \nOperating revenue change\n7\n \n%\n9 \n%\n6\n \n%\n8 \n%\nOperating income\n$\n264.3\n \n$\n247.1 \n$\n811.0\n \n$\n754.0 \nOperating margin\n17.1\n \n%\n17.1 \n%\n17.9\n \n%\n17.7 \n%\nNet income attributable to Equifax\n$\n160.2\n \n$\n141.3 \n$\n484.5\n \n$\n430.1 \nDiluted earnings per share\n$\n1.29\n \n$\n1.13 \n$\n3.89\n \n$\n3.44 \nCash provided by operating activities\n$\n559.9\n \n$\n479.5 \n$\n1,144.9\n \n$\n999.7 \nCapital expenditures*\n$\n(125.8)\n$\n(123.2)\n$\n(349.1)\n$\n(378.9)\n*Amounts include accruals for capital expenditures.\n \nOperational and Financial Highlights\n \n•\nOn April 21, 2025, the Board of Directors terminated the existing share repurchase authorization and approved an authorization to repurchase up to $3 billion of shares of common stock. We repurchased 1,237,362 shares of our common stock on the open market for $300.0 million, excluding brokerage commissions and excise taxes of $2.8 million, during the third quarter of 2025. We repurchased 1,716,868 shares of our common stock on the open market for $427.4 million, excluding brokerage commissions and excise taxes of $3.5 million, during the first nine months of 2025. We did not repurchase any shares from public market transactions during the third quarter or first nine months of 2024. At September 30, 2025, approximately $2.6 billion was available for future purchases of common stock under our share repurchase authorization.\n•\nOn April 21, 2025, the Board of Directors approved an increase in our quarterly cash dividend to $0.50 per share beginning in the second quarter of 2025. We paid out $61.5 million, or $0.50 per share, and $172.0 million, or $1.39 per share, in dividends to our shareholders during the third quarter and first nine months of 2025, respectively. \n26\nRESULTS OF OPERATIONS—THREE AND \nNINE\n MONTHS ENDED SEPTEMBER 30, 2025 AND 2024 \n \nConsolidated Financial Results \n \nOperating Revenue\n \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\nConsolidated Operating Revenue\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(In millions)\n(In millions)\nWorkforce Solutions\n$\n649.4\n \n$\n620.0 \n$\n29.4\n \n5\n \n%\n$\n1,930.1\n \n$\n1,835.6 \n$\n94.5\n \n5\n \n%\nU.S. Information Solutions\n530.2\n \n476.9 \n53.3\n \n11\n \n%\n1,551.6\n \n1,420.5 \n131.1\n \n9\n \n%\nInternational\n365.3\n \n344.9 \n20.4\n \n6\n \n%\n1,042.2\n \n1,005.6 \n36.6\n \n4\n \n%\nConsolidated operating revenue\n$\n1,544.9\n \n$\n1,441.8 \n$\n103.1\n \n7\n \n%\n$\n4,523.9\n \n$\n4,261.7 \n$\n262.2\n \n6\n \n%\nRevenue increased by $103.1 million, or 7%, and increased by $262.2 million, or 6%, for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. Total revenue was negatively impacted by foreign exchange rates, which decreased revenue by $2.6 million, or less than 1%, and $28.5 million, or 1%, for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024.\n \nRevenue increased for both periods due to revenue growth in all three business units. USIS revenue growth is primarily due to growth in mortgage revenue and non-mortgage revenue in Online Information Solutions, as well as growth in Financial Marketing Services. Workforce Solutions revenue growth for both periods is primarily due to growth in Verification Services. Workforce Solutions revenue growth in the first nine months is partially offset by declines in Employer Services. International revenue growth for both periods is primarily driven by growth in Europe and Latin America. International revenue growth in the third quarter is also driven by growth in Canada. \nOperating Expenses\n \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\nConsolidated Operating Expenses\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(In millions)\n(In millions)\nConsolidated cost of services\n$\n663.2\n \n$\n645.2 \n$\n18.0\n \n3\n \n%\n$\n1,984.4\n \n$\n1,903.7 \n$\n80.7\n \n4\n \n%\nConsolidated selling, general and administrative expenses\n434.1\n \n380.4 \n53.7\n \n14\n \n%\n1,193.2\n \n1,105.7 \n87.5\n \n8\n \n%\nConsolidated depreciation and amortization expense\n183.3\n \n169.1 \n14.2\n \n8\n \n%\n535.3\n \n498.3 \n37.0\n \n7\n \n%\nConsolidated operating expenses\n$\n1,280.6\n \n$\n1,194.7 \n$\n85.9\n \n7\n \n%\n$\n3,712.9\n \n$\n3,507.7 \n$\n205.2\n \n6\n \n%\n \nCost of services increased $18.0 million and $80.7 million in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is primarily due to higher royalty, revenue share and purchased data and information costs, partially offset by a decrease in people costs. The impact of changes in foreign exchange rates on costs of services led to an increase of $0.1 million and a decrease of $9.9 million in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024.\n \nSelling, general and administrative expenses increased $53.7 million and $87.5 million for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is primarily due to higher people costs and litigation expense. The impact of changes in foreign currency exchange rates led to a decrease in selling, general and administrative expenses of $1.2 million and $10.5 million for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024.\nDepreciation and amortization expense increased $14.2 million and $37.0 million for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is primarily due to increased amortization of capitalized internal-use software costs resulting from technology transformation capital spending incurred previously, partially offset by lower amortization of acquisition related purchased intangibles. The impact of changes in foreign \n27\ncurrency exchange rates led to an increase in depreciation and amortization expense of $0.6 million and a decrease of $2.1 million for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. \nOperating Income and Operating Margin\n \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\nConsolidated Operating Income\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(In millions)\n(In millions)\nConsolidated operating revenue\n$\n1,544.9\n$\n1,441.8\n$\n103.1\n \n7\n \n%\n$\n4,523.9\n$\n4,261.7\n$\n262.2\n \n6\n \n%\nConsolidated operating expenses\n1,280.6\n1,194.7\n85.9\n \n7\n \n%\n3,712.9\n3,507.7\n205.2\n \n6\n \n%\nConsolidated operating income\n$\n264.3\n$\n247.1\n$\n17.2\n \n7\n \n%\n$\n811.0\n$\n754.0\n$\n57.0\n \n8\n \n%\nConsolidated operating margin\n17.1\n \n%\n17.1 \n%\n \n—\n \n pts\n17.9\n \n%\n17.7 \n%\n0.2\n \n pts\nTotal company operating margin was flat in the third quarter and increased by 0.2 percentage points in the first nine months of 2025 compared to the same periods in 2024. The increase in revenue in both periods is partially offset by the increase in operating expenses, primarily due to higher royalty, revenue share and purchased data and information costs. The increase in operating expenses in the first nine months is also due to the increase in internal-use software amortization costs.\n \nInterest Expense and Other Income, net \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\nConsolidated Interest Expense and Other Income, net\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(In millions)\n \n(In millions)\nConsolidated interest expense\n$\n(52.2)\n$\n(56.3)\n$\n4.1\n \n(7)\n%\n$\n(158.2)\n$\n(173.4)\n$\n15.2\n \n(9)\n%\nConsolidated other income, net\n3.2\n3.0\n0.2\n \n7\n \n%\n9.2\n4.3 \n4.9\n \n114\n \n%\nAverage cost of debt\n4.3\n \n%\n4.1 \n%\n \n4.3\n \n%\n4.1 \n%\nTotal consolidated debt, net, at quarter end\n$\n4,813.1\n$\n5,471.6\n$\n(658.5)\n(12)\n%\n$\n4,813.1\n$\n5,471.6\n$\n(658.5)\n(12)\n%\n \nInterest expense decreased by $4.1 million and $15.2 million in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The decrease for both periods is due to lower overall debt balances when compared to the same periods in 2024.\nOther income, net, increased by $0.2 million and $4.9 million in the third quarter of 2025 and in the first nine months of 2025, respectively, as compared to the same periods in 2024. The increase in both periods is primarily due to higher equity investment income, partially offset by lower interest income as compared to the same periods in 2024. The increase in the first nine months is also due to a decrease in other non-operating expenses. \n28\nIncome Taxes\n \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\nConsolidated Provision for Income Taxes\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(In millions)\n(In millions)\nConsolidated provision for income taxes\n$\n(53.8)\n$\n(51.1)\n$\n(2.7)\n5\n \n%\n$\n(174.1)\n$\n(151.0)\n$\n(23.1)\n15\n \n%\nEffective income tax rate\n25.0\n \n%\n26.4 \n%\n \n \n26.3\n \n%\n25.8 \n%\n \nOur effective income tax rate was 25.0% for the three months ended September 30, 2025 compared to 26.4% for the three months ended September 30, 2024. Our effective income tax rate was 26.3% for the nine months ended September 30, 2025 compared to 25.8% for the nine months ended September 30, 2024. Our effective tax rate was lower for the three months ended September 30, 2025 as compared to the same period in 2024, which was primarily attributable to more favorable discrete benefits in the current period, which primarily consisted of a more favorable change in prior-year estimated R&D credit, offset by a less favorable discrete item for equity compensation. Our effective tax rate was higher for the nine months ended September 30, 2025 as compared to the same period in 2024 primarily due to a lower estimated R&D credit and less favorable discrete tax benefits in the current period.\nNet Income\n \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\nConsolidated Net Income\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(In millions, except per share amounts)\n(In millions, except per share amounts)\nConsolidated operating income\n$\n264.3\n \n$\n247.1 \n$\n17.2\n \n7\n \n%\n$\n811.0\n \n$\n754.0 \n$\n57.0\n \n8\n \n%\nConsolidated interest expense and other income, net\n(49.0)\n(53.3)\n4.3\n \n(8)\n%\n(149.0)\n(169.1)\n20.1\n \n(12)\n%\nConsolidated provision for income taxes\n(53.8)\n(51.1)\n(2.7)\n5\n \n%\n(174.1)\n(151.0)\n(23.1)\n15\n \n%\nConsolidated net income\n161.5\n \n142.7 \n18.8\n \n13\n \n%\n487.9\n \n433.9 \n54.0\n \n12\n \n%\nNet income attributable to noncontrolling interests including redeemable noncontrolling interests\n(1.3)\n(1.4)\n0.1\n \n(7)\n%\n(3.4)\n(3.8)\n0.4\n \n(11)\n%\nNet income attributable to Equifax\n$\n160.2\n \n$\n141.3 \n$\n18.9\n \n13\n \n%\n$\n484.5\n \n$\n430.1 \n$\n54.4\n \n13\n \n%\nDiluted earnings per common share:\n \n \nNet income attributable to Equifax\n$\n1.29\n \n$\n1.13 \n$\n0.16\n \n14\n \n%\n$\n3.89\n \n$\n3.44 \n$\n0.45\n \n13\n \n%\nWeighted-average shares used in computing diluted earnings per share\n124.1\n \n125.2 \n \n \n124.7\n \n124.9 \n \nConsolidated net income increased by $18.8 million and $54.0 million for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase in both periods is due to increased operating income and lower interest expense, partially offset by higher income tax expense.\n29\nSegment Financial Results\nWorkforce Solutions \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\nWorkforce Solutions\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(In millions)\n(In millions)\nOperating revenue:\n \n \n \n \nVerification Services\n$\n553.6\n$\n524.9\n$\n28.7\n \n5\n \n%\n$\n1,622.9\n$\n1,517.2\n$\n105.7\n \n7\n \n%\nEmployer Services\n95.8\n95.1\n0.7\n \n1\n \n%\n307.2\n318.4\n(11.2)\n(4)\n%\nTotal operating revenue\n$\n649.4\n$\n620.0\n$\n29.4\n \n5\n \n%\n$\n1,930.1\n$\n1,835.6\n$\n94.5\n \n5\n \n%\n% of consolidated revenue\n42\n \n%\n43 \n%\n \n43\n \n%\n43 \n%\nTotal operating income\n$\n284.5\n$\n267.6\n$\n16.9\n \n6\n \n%\n$\n856.0\n$\n795.4\n$\n60.6\n \n8\n \n%\nOperating margin\n43.8\n \n%\n43.2 \n%\n \n0.6\n \npts\n44.3\n \n%\n43.3 \n%\n1.0\n \npts\n \nWorkforce Solutions revenue increased by 5% for both the third quarter and first nine months of 2025 compared to the same periods in 2024. The increase for the third quarter is primarily due to an increase in non-mortgage verticals within Verification Services. The increase for the first nine months is due to an increase in both non-mortgage and mortgage verticals within Verification Services, partially offset by declines in Employer Services.\nVerification Services\n \nRevenue increased by 5% and 7% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase in revenue in both periods is principally due to growth in non-mortgage revenue, primarily from growth in the government, talent solutions and consumer lending verticals. The increase for both periods is also due to growth in mortgage revenue. \nEmployer Services\n \nRevenue increased by 1% and decreased by 4% in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. Employer Services revenue did not change materially in the third quarter of 2025 compared to the third quarter of 2024. The decrease in revenue for the first nine months of 2025 is primarily due to declines in I-9, unemployment claims and ACA revenue, partially offset by increases in work opportunity tax credit and identity theft protection services. \n \nWorkforce Solutions Operating Margin\n \nOperating margin increased to 43.8% for the third quarter of 2025 from 43.2% for the third quarter of 2024 and increased to 44.3% for the first nine months of 2025 from 43.3% for the first nine months of 2024. The increased margin for both periods is primarily due to the aforementioned increases in revenue.\nUSIS\n \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\nU.S. Information Solutions\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(In millions)\n(In millions)\nOperating revenue:\n \n \n \nOnline Information Solutions\n$\n467.5\n$\n419.1\n$\n48.4\n \n12\n \n%\n$\n1,373.5\n$\n1,255.5\n$\n118.0\n \n9\n \n%\nFinancial Marketing Services\n62.7\n57.8\n4.9\n \n9\n \n%\n178.1\n165.0\n13.1\n \n8\n \n%\nTotal operating revenue\n$\n530.2\n$\n476.9\n$\n53.3\n \n11\n \n%\n$\n1,551.6\n$\n1,420.5\n$\n131.1\n \n9\n \n%\n% of consolidated revenue\n34\n \n%\n33 \n%\n \n \n34\n \n%\n33 \n%\nTotal operating income\n$\n123.3\n$\n98.1\n$\n25.2\n \n26\n \n%\n$\n346.9\n$\n289.3\n$\n57.6\n \n20\n \n%\nOperating margin\n23.2\n \n%\n20.6 \n%\n \n2.6\n \npts\n22.4\n \n%\n20.4 \n%\n2.0\n \npts\n \n30\nUSIS revenue increased by 11% and 9% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is primarily due to growth in Online Information Solutions which is due to growth in both mortgage and non-mortgage revenue, as well as growth in Financial Marketing Services. Growth in mortgage related services is primarily due to product pricing, partially offset by lower mortgage credit inquiry volumes in the current year compared to the prior year periods.\nOnline Information Solutions\n \nRevenue increased by 12% and 9% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is driven by growth in mortgage related services, as well as growth in non-mortgage online services and consumer solutions revenue. The growth in mortgage related services for both periods is primarily due to product pricing, partially offset by lower mortgage credit inquiry volumes in the current year compared to the prior year periods.\nFinancial Marketing Services\nRevenue increased by 9% and 8% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is primarily due to growth in credit marketing services. \nUSIS Operating Margin\nUSIS operating margin increased to 23.2% for the third quarter of 2025 from 20.6% for the third quarter of 2024 and increased to 22.4% for the first nine months of 2025 from 20.4% for the first nine months of 2024. The margin increase for both periods is due to the aforementioned increase in revenue, partially offset by an increase in operating expenses primarily due to an increase in certain product revenue royalty costs. The increase in operating expenses in the first nine months is partially offset by a decline in people costs.\nInternational\n \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\nInternational\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(In millions)\n(In millions)\nOperating revenue:\n \n \n \n \nLatin America\n$\n102.1\n$\n96.7\n$\n5.4\n \n6\n \n%\n$\n295.8\n$\n285.1\n$\n10.7\n \n4\n \n%\nEurope\n102.3\n94.9\n7.4\n \n8\n \n%\n288.0\n269.3\n18.7\n \n7\n \n%\nAsia Pacific\n90.1\n88.5\n1.6\n \n2\n \n%\n255.1\n251.4\n3.7\n \n1\n \n%\nCanada\n70.8\n64.8\n6.0\n \n9\n \n%\n203.3\n199.8\n3.5\n \n2\n \n%\nTotal operating revenue\n$\n365.3\n$\n344.9\n$\n20.4\n \n6\n \n%\n$\n1,042.2\n$\n1,005.6\n$\n36.6\n \n4\n \n%\n% of consolidated revenue\n24\n \n%\n24 \n%\n23\n \n%\n24 \n%\nTotal operating income\n$\n57.7\n$\n48.1\n$\n9.6\n \n20\n \n%\n$\n121.7\n$\n120.4\n$\n1.3\n \n1\n \n%\nOperating margin\n15.8\n \n%\n13.9 \n%\n \n1.9\n \npts\n11.7\n \n%\n12.0 \n%\n(0.3)\npts\n \nInternational revenue increased by 6% and 4% in the third quarter and the first nine months of 2025, respectively, compared to the same periods in 2024. On a local currency basis, revenue increased by 7% and 6% in the third quarter and first nine months of 2025, respectively,  compared to the same periods in 2024, driven by local currency growth in Latin America, primarily from Brazil and Argentina, as well as local currency growth in Canada, Asia Pacific and Europe. Local currency fluctuations against the U.S. dollar negatively impacted revenue by $2.6 million, or 1%, for the third quarter of 2025, and by $28.5 million, or 2%, for the first nine months of 2025.\nLatin America\n \nOn a local currency basis, revenue increased by 9% and 12% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase in both periods is primarily due to local currency growth in Argentina and Brazil. Local currency fluctuations against the U.S. dollar negatively impacted revenue by $3.6 million, or 3%, and $23.1 million, or 8%, for the third quarter and first nine months of 2025, respectively, primarily within Argentina, as well \n31\nas Brazil for the first nine months. Reported revenue increased by 6% and 4% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024.\nEurope\nOn a local currency basis, revenue increased by 4% for both the third quarter and first nine months of 2025 compared to the same periods in 2024. The increase in both periods is primarily due to growth in the consumer credit reporting business in the U.K. The increase in the first nine months is also driven by growth in the consumer credit reporting business in Spain. Local currency fluctuations against the U.S. dollar positively impacted revenue by $4.0 million, or 4%, and $8.5 million, or 3%, for the third quarter and first nine months of 2025, respectively. Reported revenue increased by 8% and 7% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024.\nAsia Pacific\nOn a local currency basis, revenue increased by 4% and 5% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is primarily driven by growth in the Australia commercial, consumer credit reporting and identity and fraud businesses. The increase in the first nine months is partially offset by a decline in India.  Local currency fluctuations against the U.S. dollar negatively impacted revenue by $2.2 million, or 2%, and $8.4 million, or 4%, for the third quarter and first nine months of 2025, respectively. Reported revenue increased by 2% and 1% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024.\nCanada\n \nOn a local currency basis, revenue increased by 11% and 5% in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase in both periods is driven by growth in the direct to consumer, consumer credit reporting and commercial businesses. Local currency fluctuations against the U.S. dollar negatively impacted revenue by $0.7 million, or 2%, and $5.5 million, or 3%, for the third quarter and first nine months of 2025, respectively. Reported revenue increased by 9% and 2% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024.\nInternational Operating Margin\n \nOperating margin increased to 15.8% for the third quarter of 2025 from 13.9% for the third quarter of 2024 and decreased to 11.7% for the first nine months of 2025 from 12.0% for the first nine months of 2024. The increase in the third quarter is primarily due to the aforementioned increase in revenue. The decrease in the first nine months is primarily due to higher people costs and increased amortization of capitalized internal-use software costs resulting from technology transformation capital spending incurred previously, partially offset by the increase in revenue.\n General Corporate Expense\n \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\nGeneral Corporate Expense\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(In millions)\n(In millions)\nGeneral corporate expense\n$\n201.2\n \n$\n166.7 \n$\n34.5\n \n21\n \n%\n$\n513.6\n \n$\n451.1 \n$\n62.5\n \n14\n \n%\nOur general corporate expenses are unallocated costs that are incurred at the corporate level and include those expenses impacted by the overall management and strategic choices of the company, including shared services overhead, technology, security, data and analytics, administrative, legal, restructuring, and the portion of management incentive compensation determined by total company-wide performance.\nGeneral corporate expense increased by $34.5 million and $62.5 million for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is primarily due to higher people costs, litigation expense and depreciation and amortization of capitalized internal-use software costs. \n32\nLIQUIDITY AND FINANCIAL CONDITION\nManagement assesses liquidity in terms of our ability to generate cash to fund operating, investing and financing activities. We continue to generate substantial cash from operating activities, remain in a strong financial position and manage our capital structure to meet short- and long-term objectives including reinvestment in existing businesses and completing strategic acquisitions.\nFunds generated by operating activities, our $1.5 billion five-year unsecured revolving credit facility (\"Revolver\") and related commercial paper (\"CP\") program, more fully described below, are our most significant sources of liquidity. At September 30, 2025, we had $189.0 million in cash and cash equivalents, as well as $1.4 billion available to borrow under our Revolver.\n \nSources and Uses of Cash\nWe believe that our existing cash balance, liquidity available from our CP and Revolver, cash generated from ongoing operations and continued access to public or private debt markets will be sufficient to satisfy cash requirements over the next 12 months and beyond. While there was no significant change in our cash requirements as of September 30, 2025 compared to December 31, 2024, we have utilized existing CP capacity, together with cash from operating activities, to meet our current obligations. \nFund Transfer Limitations.\n  The ability of certain of our subsidiaries and associated companies to transfer funds to the U.S. may be limited, in some cases, by certain restrictions imposed by foreign governments. These restrictions do not, individually or in the aggregate, materially limit our ability to service our indebtedness, meet our current obligations or pay dividends. As of September 30, 2025, we held $173.1 million of cash in our foreign subsidiaries.\nInformation about our cash flows, by category, is presented in the Consolidated Statements of Cash Flows. The following table summarizes our cash flows for the nine months ended September 30, 2025 and 2024:\n \nNine Months Ended September 30,\nChange\nNet cash provided by (used in):\n2025\n2024\n2025 vs. 2024\n \n(In millions)\nOperating activities\n$\n1,144.9\n \n$\n999.7 \n$\n145.2\n \nInvesting activities\n$\n(350.6)\n$\n(392.6)\n$\n42.0\n \nFinancing activities\n$\n(783.5)\n$\n(345.0)\n$\n(438.5)\n \nOperating Activities\n \nCash provided by operating activities in the nine months ended September 30, 2025 increased by $145.2 million compared to the prior year period primarily due to increased net income.\nInvesting Activities\n \nCapital Expenditures\n \nNine Months Ended September 30,\nChange\nNet cash used in:\n2025\n2024\n2025 vs. 2024\n \n(In millions)\nCapital expenditures*\n$\n(351.4)\n$\n(392.6)\n$\n41.2\n \n*Amounts above are total cash outflows for capital expenditures.\nOur capital expenditures are used for developing, enhancing and deploying new and existing software in support of our expanding product set, replacing or adding equipment, updating systems for regulatory compliance, the licensing of certain software applications, investing in system reliability, security and disaster recovery enhancements, and updating or expanding our office facilities.\n33\nCapital expenditures in the first nine months of 2025 decreased by $41.2 million from the same period in 2024 due to lower capitalized software costs and lower spending on technology infrastructure as compared to the first nine months of 2024.\nFinancing Activities\n \nBorrowings and Credit Facility Availability\n \nNine Months Ended September 30,\nChange\nNet cash (used in) provided by:\n2025\n2024\n2025 vs. 2024\n \n(In millions)\nNet short-term payments\n$\n(204.1)\n$\n(195.9)\n$\n(8.2)\nPayments on long-term debt\n$\n—\n \n$\n(695.6)\n$\n695.6\n \nProceeds from issuance of long-term debt\n$\n1.7\n \n$\n649.8 \n$\n(648.1)\nCredit Facility Availability\n \nWe have access to a $1.5 billion five-year unsecured revolving credit facility (the Revolver), which matures in August 2028. Borrowings under the Revolver may be used for working capital, for capital expenditures, to refinance existing debt, to finance acquisitions and for other general corporate purposes. The Revolver includes an option to request a maximum of three one-year extensions of the maturity date any time after the first anniversary of the closing date of the Revolver. In May 2025, we exercised our second option to extend the maturity date by one year, from August 2027 to August 2028, and thus have one extension option remaining. Availability of the Revolver is reduced by the outstanding principal balance of our CP notes and by any letters of credit issued under the Revolver.\n \nOur $1.5 billion CP program has been established to allow for borrowing through the private placement of CP notes with maturities ranging from overnight to 397 days. We may use the proceeds of CP notes for general corporate purposes. The CP program is supported by our Revolver and the total amount of CP notes that may be issued is reduced by the amount of any outstanding borrowings under our Revolver and by any letters of credit issued under the facility. \nAs of September 30, 2025, there were $1.3 million of letters of credit outstanding, no outstanding borrowings under the Revolver and $81.5 million of outstanding CP notes. Availability under the Revolver was $1.4 billion at September 30, 2025.\n \nAt September 30, 2025, approximately 98% of our debt was fixed-rate debt and 2% was variable-rate debt. Our variable-rate debt consists of outstanding amounts under our CP program. The interest rates reset periodically, depending on the terms of the respective financing agreements. At September 30, 2025, the interest rate on our variable-rate debt ranged from 4.23% to 4.40%.\n \nBorrowing and Repayment Activity\n \nWe primarily borrow under our CP program and Revolver as needed and as availability allows. \nNet short-term payments primarily represent net borrowings or repayments of outstanding amounts under our CP program. \nBorrowings on long-term debt represent $1.7 million in borrowings for the first nine months of 2025. Borrowings on long-term debt in the first nine months of 2024 represented the issuance of $650.0 million of 4.8% senior notes in the third quarter of 2024. There were no payments on long-term debt for the first nine months of 2025. Payments on long-term debt for the first nine months of 2024 represented $695.6 million in payments on our then-outstanding term loan.\nDebt Covenants.\n  A downgrade in our credit ratings would increase the cost of borrowings under our CP program and our Revolver, and could limit or, in the case of a significant downgrade, preclude our ability to issue CP. Our outstanding indentures and comparable instruments also contain customary covenants including, for example, limits on mortgages, liens, sale/leaseback transactions, mergers and sales of assets. \nThe Revolver requires a maximum leverage ratio, defined as consolidated funded debt divided by consolidated EBITDA, of 3.75 to 1.0. We may also elect to increase the maximum leverage ratio by 0.5 to 1.0 (subject to a maximum \n34\nleverage ratio of 4.25 to 1.0) in connection with certain material acquisitions if we satisfy certain requirements. The Revolver also permits cash in excess of $175 million to be netted against debt in the calculation of the leverage ratio, subject to certain restrictions. \nAs of September 30, 2025, we were in compliance with all of our debt covenants.\nWe do not have any credit rating triggers that would accelerate the maturity of a material amount of our outstanding debt; however, our 2.6% senior notes due 2025, 3.25% senior notes due 2026, 5.1% senior notes due 2027, 5.1% senior notes due 2028, 4.8% senior notes due 2029, 3.1% senior notes due 2030, 2.35% senior notes due 2031 and 7.0% senior notes due 2037 (collectively, the “Senior Notes”) contain change in control provisions. If we experience a change of control or publicly announce an intention to effect a change of control and the rating on the Senior Notes is lowered by Standard & Poor’s (“S&P”) and Moody’s Investors Service (“Moody’s”) below an investment grade rating within 60 days of such change of control or notice thereof, then we will be required to offer to repurchase the Senior Notes at a price equal to 101% of the aggregate principal amount of the Senior Notes plus accrued and unpaid interest. \nFor additional information about our debt, including the terms of our financing arrangements, basis for variable interest rates and debt covenants, see Note 5 of the Notes to Consolidated Financial Statements in our 2024 Form 10-K.\nEquity Transactions\n \nNine Months Ended September 30,\nChange\nNet cash (used in) provided by:\n2025\n2024\n2025 vs. 2024\n \n(In millions)\nTreasury stock repurchases\n$\n(427.4)\n$\n— \n$\n(427.4)\nDividends paid to Equifax shareholders\n$\n(172.0)\n$\n(144.8)\n$\n(27.2)\nProceeds from exercise of stock options and employee stock purchase plan\n$\n38.1\n \n$\n67.5 \n$\n(29.4)\nPayment of taxes related to settlement of equity awards\n$\n(13.6)\n$\n(16.4)\n$\n2.8\n \nSources and uses of cash related to equity during the nine months ended September 30, 2025 and 2024 were as follows:\n-    During the first nine months of 2025, we repurchased 1,716,868 shares of our common stock on the open market. During the first nine months of 2024, we did not repurchase any shares of our common stock on the open market. \n-    On April 21, 2025, the Board of Directors approved an increase in our quarterly cash dividend to $0.50 per share beginning in the second quarter of 2025. We paid cash dividends to Equifax shareholders of $172.0 million, or $1.39 per share, and $144.8 million, or $1.17 per share, during the nine months ended September 30, 2025 and 2024, respectively.\n-    We received cash of $38.1 million and $67.5 million during the first nine months of 2025 and 2024, respectively, from the exercise of stock options and the employee stock purchase plan.\n-    We paid taxes of $13.6 million and $16.4 million related to the settlement of equity awards during the first nine months of 2025 and 2024, respectively.\n \nOn April 21, 2025, the Board of Directors terminated the existing share repurchase authorization and approved an authorization to repurchase up to $3 billion of shares of common stock.  At September 30, 2025, approximately $2.6 billion was available for future purchases of common stock under our share repurchase authorization.\n \nContractual Obligations, Commercial Commitments and Other Contingencies\n \nOur contractual obligations and commercial commitments have not changed materially from those reported in our 2024 Form 10-K. For additional information about certain obligations and contingencies, see Note 6 of the Notes to Consolidated Financial Statements in this Form 10-Q.\n \n35\nOff-Balance Sheet Arrangements\n \nThere have been no material changes with respect to our off-balance sheet arrangements from those presented in our 2024 Form 10-K.\nBenefit Plans\n \nAt December 31, 2024, our U.S. Retirement Income Plan met or exceeded ERISA’s minimum funding requirements. In the future, we expect to make minimum funding contributions as required and may make discretionary contributions, depending on certain circumstances, including market conditions and our liquidity needs. We believe additional funding contributions, if any, would not prevent us from continuing to meet our liquidity needs, which are primarily funded from cash flows generated by operating activities, available cash and cash equivalents, our CP program and our Revolver.\n \nFor our non-U.S. tax-qualified retirement plans, we fund an amount sufficient to meet minimum funding requirements but no more than allowed as a tax deduction pursuant to applicable tax regulations. For our non-qualified supplementary retirement plans, we fund the benefits as they are paid to retired participants, but accrue the associated expense and liabilities in accordance with U.S. GAAP.\n \nFor additional information about our benefit plans, see Note 9 of the Notes to Consolidated Financial Statements in our 2024 Form 10-K.\nForeign Currency\nArgentina experienced multiple periods of increasing inflation rates, devaluation of the peso, and increasing borrowing rates. As such, Argentina was deemed a highly inflationary economy by accounting policymakers. Beginning in the third quarter of 2018, we have accounted for Argentina as a highly inflationary economy which resulted in the recognition of a $0.7 million and $0.3 million foreign currency loss that was recorded in Other income, net in our Consolidated Statements of Income during the three months ended September 30, 2025 and 2024, respectively.\nRECENT ACCOUNTING PRONOUNCEMENTS\n \nFor information about new accounting pronouncements and the potential impact on our Consolidated Financial Statements, see Note 1 of the Notes to Consolidated Financial Statements in this Form 10-Q and Note 1 of the Notes to Consolidated Financial Statements in our 2024 Form 10-K.\n \nAPPLICATION OF CRITICAL ACCOUNTING POLICIES\n \nThe Company’s Consolidated Financial Statements are prepared in conformity with U.S. GAAP. This requires our management to make estimates and assumptions that affect the reported amounts of assets and liabilities, revenues and expenses and related disclosures of contingent assets and liabilities in our Consolidated Financial Statements and the Notes to Consolidated Financial Statements. We believe the most complex and sensitive judgments, because of their significance to the Consolidated Financial Statements, result primarily from the need to make estimates and assumptions about the effects of matters that are inherently uncertain. The “Application of Critical Accounting Policies and Estimates” section in the MD&A, and Note 1 of the Notes to Consolidated Financial Statements, in our 2024 Form 10-K describe the significant accounting estimates and policies used in the preparation of our Consolidated Financial Statements. Although we believe that our estimates, assumptions and judgments are reasonable, they are based upon information available at the time. Actual results may differ significantly from these estimates under different assumptions, judgments or conditions."
}