{
  "source_file": "eg-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nOverview.\nEverest is a global underwriting leader providing best-in-class property, casualty and specialty reinsurance and insurance solutions. As part of the Standard & Poor’s (“S&P”) 500 Index, we are a leading financial services institution focused on value creation for our shareholders while diversifying our portfolio and geographic presence. Through our direct and indirect subsidiaries operating in the U.S. and internationally, we serve a diverse group of clients worldwide, providing what we believe are extensive product and distribution capabilities, a strong balance sheet, an innovative culture and access to world-class talent.  \nAs a global leader with a 50-year track record, we are a preferred Reinsurance partner in the markets we serve, and with our growing Insurance franchise we strive to deliver consistent value to all our stakeholders. We continue to grow and develop our Insurance business, investing in our global platform and strengthening our portfolio and its potential to deliver on our customer promise.\nDuring 2024, we formed a new “Other” segment, primarily comprised of the results of our sports and leisure business sold in October 2024, consisting of policies written prior to the sale and polices renewed and certain new business written on the Company’s paper post-sale. It also includes run-off asbestos and environmental (“A&E”) exposures, certain discontinued insurance programs primarily written prior to 2012 and certain discontinued insurance and reinsurance coverage classes.   The Other segment does not generally sell insurance or reinsurance products but is responsible for the management of existing policies and settlement of related losses.  These segment presentation changes have been reflected retrospectively. The Company will continue to have two reportable segments that actively sell products, Reinsurance and Insurance, consistent with how the on-going business is managed. See Note 6 of the Notes to the Consolidated Financial Statements for a summary of segment results.\nThe following is a discussion of our results of operations, financial condition and liquidity and capital resources for the three and nine months ended September 30, 2025.  This discussion should be read in conjunction with the consolidated financial statements and related notes, under Part I - Item 1 of this Form 10-Q, as well as the audited consolidated financial statements and notes thereto for the year ended December 31, 2024, included in the Company’s most recent Form 10-K filing.\nAll comparisons in this discussion are to the corresponding prior year unless otherwise indicated.\nRecent Developments. \nAdverse Development Cover Reinsurance Agreements \nOn October 26, 2025, Everest Re and Bermuda Re (the “Ceding Companies”) entered into adverse development cover reinsurance agreements with State National Insurance Company, Inc. and MS Transverse Insurance Company.  The adverse development cover reinsurance agreements are supported on a retrocessional basis by Longtail Re, an affiliate of Stone Ridge Capital. The adverse development cover reinsurance agreements are effective October 1, 2025 and cover risks arising out of the Ceding Companies’ North American Insurance and Other Segment liabilities and relating to premium earned during 2024 and prior years (the “Subject Business”). The reinsurance agreements exclude certain liabilities, including among others those related to the Ceding Companies’ Asbestos and Environmental reserves included in the Other Segment.  The aggregate of the statutory reserves held for the Subject Business, pursuant to the Reinsurance Agreements, is $5.4 billion, as of September 30, 2025. \nThe adverse development cover is composed of two layers in excess of the $5.4 billion of North America Insurance and Other segment liability subject reserves. The first layer is $700 million, upon which Everest will transfer $1.25 billion of in-the-money reserves in consideration upon closing of the transaction.The second layer is $500 million, upon which Everest will pay approximately $122 million of consideration upon closing of the transaction, which will be reported in the consolidated statement of operations for the fourth quarter of 2025. Everest will have a co-participation of $100 million in each layer.\nSale of Certain Retail Commercial Insurance Renewal Rights\nOn October 26, 2025, Group entered into an agreement with American International Group, Inc. (“AIG”) to sell the renewal rights for certain lines of commercial property and casualty insurance business written by the Company in the U.S., U.K. and Asia Pacific, for an aggregate purchase price of $252 million (the “Master Transaction Agreement”).  In \n32\nTable of Contents\naddition, pursuant to the Master Transaction Agreement, AIG has agreed to pay Group $30 million for certain expenses.  The closing of the transaction, occurred on October 26, 2025.  Pursuant to the Master Transaction Agreement, if the gross written premium paid and payable to AIG with respect to aggregate renewed premiums are less than 80% of the aggregate premiums for the period beginning January 1, 2025 to and including December 31, 2025, including premiums on renewed policies between November 1, 2025 and December 31, 2025, Everest will reimburse a portion of the aggregate purchase price, not to exceed $70 million, to AIG depending on the relative percentage of such 2025 premiums.\nIn addition, on October 26, 2025, Everest entered into an agreement with AIG to sell the renewal rights for certain lines of commercial property and casualty insurance business written by the Company in certain countries in the European Union, for an aggregate purchase price of $49 million (the “EU Master Transaction Agreement,” and together with the Master Transaction Agreement, the “Master Transaction Agreements”). Completion of the transaction will be subject to certain regulatory approvals. \nThe purchase price under the Master Transaction Agreements is subject to adjustment such that the final purchase price will be equal to 15% of the actual premiums written for the period beginning January 1, 2025 to and including December 31, 2025, including premiums on renewed policies between November 1, 2025 and December 31, 2025.  Under the Master Transaction Agreements, AIG has also agreed to pay Group a total of $10 million per month for nine months for specified transition services.\nFinancial Summary.\nWe monitor and evaluate our overall performance based upon financial results.  The following table displays a summary of the consolidated net income (loss), ratios and shareholders’ equity for the periods indicated:\nThree Months Ended\nSeptember 30,\nPercentage\nIncrease/\n(Decrease)\nNine Months Ended\nSeptember 30,\nPercentage\nIncrease/\n(Decrease)\n(Dollars in millions)\n2025\n2024\n2025\n2024\nGross written premiums\n$\n4,375 \n$\n4,425 \n(1.1)\n%\n$\n13,446 \n$\n13,561 \n(0.8)\n%\nNet written premiums\n3,754 \n3,805 \n(1.3)\n%\n11,607 \n11,789 \n(1.5)\n%\nREVENUES:\nPremiums earned\n$\n3,855 \n$\n3,918 \n(1.6)\n%\n$\n11,698 \n$\n11,262 \n3.9 \n%\nNet investment income\n540 \n496 \n8.8 \n%\n1,563 \n1,481 \n5.5 \n%\nNet gains (losses) on investments\n(47)\n(27)\n75.4 \n%\n(59)\n(50)\n17.7 \n%\nOther income (expense)\n(29)\n(102)\n(71.3)\n%\n(129)\n(48)\nNM\nTotal revenues\n4,319 \n4,285 \n0.8 \n%\n13,073 \n12,645 \n3.4 \n%\nCLAIMS AND EXPENSES:\nIncurred losses and loss adjustment expenses\n2,837 \n2,584 \n9.8 \n%\n8,203 \n7,132 \n15.0 \n%\nCommission, brokerage, taxes and fees\n890 \n826 \n7.8 \n%\n2,595 \n2,398 \n8.2 \n%\nOther underwriting expenses\n258 \n236 \n9.2 \n%\n750 \n694 \n8.1 \n%\nCorporate expenses\n27 \n25 \n10.1 \n%\n79 \n69 \n15.6 \n%\nInterest, fees and bond issue cost amortization expense\n38 \n38 \n1.5 \n%\n114 \n112 \n1.3 \n%\nTotal claims and expenses\n4,050 \n3,708 \n9.2 \n%\n11,740 \n10,404 \n12.8 \n%\nINCOME (LOSS) BEFORE TAXES\n269 \n577 \n(53.4)\n%\n1,332 \n2,241 \n(40.5)\n%\nIncome tax expense (benefit)\n14 \n68 \n(80.0)\n%\n187 \n275 \n(32.0)\n%\nNET INCOME (LOSS)\n$\n255 \n$\n509 \n(49.9)\n%\n$\n1,145 \n$\n1,966 \n(41.7)\n%\nRATIOS:\nPoint\nChange\nPoint\nChange\nLoss ratio\n73.6 \n%\n66.0 \n%\n7.6 \n70.1 \n%\n63.3 \n%\n6.8 \nCommission and brokerage ratio\n23.1 \n%\n21.1 \n%\n2.0 \n22.2 \n%\n21.3 \n%\n0.9 \nOther underwriting expense ratio\n6.7 \n%\n6.0 \n%\n0.7 \n6.4 \n%\n6.2 \n%\n0.2 \nCombined ratio\n103.4 \n%\n93.1 \n%\n10.3 \n98.7 \n%\n90.8 \n%\n7.9 \n33\nTable of Contents\nAt\nSeptember 30,\nAt\nDecember 31,\nPercentage\nIncrease/\n(Decrease)\n(Dollars in millions, except per share amounts)\n2025\n2024\nBalance sheet data:\nTotal investments and cash\n$\n45,831 \n$\n41,531 \n10.4 \n%\nTotal assets\n62,240 \n56,341 \n10.5 \n%\nReserve for losses and loss adjustment expenses\n33,742 \n29,889 \n12.9 \n%\nTotal debt\n3,588 \n3,587 \n— \n%\nTotal liabilities\n46,864 \n42,466 \n10.4 \n%\nShareholders' equity\n15,375 \n13,875 \n10.8 \n%\nBook value per share\n366.22 \n322.97 \n13.4 \n%\n(NM, not meaningful)\n(Some amounts may not reconcile due to rounding.)\nRevenues.\nPremiums.\n   Gross written premiums decreased by 1.1%, remaining relatively constant at $4.4 billion for the three months ended September 30, 2025, compared to $4.4 billion for the three months ended September 30, 2024. The decrease reflects a $59 million, or 1.8%, decrease in our reinsurance business and a $28 million, or 55.9%, decrease in business within the Other segment, partially offset by a $37 million, or 3.4%, increase in our insurance business.   The decrease in reinsurance premiums was primarily due to U.S. casualty pro rata and casualty excess of loss lines of business, partially offset by an increase in the property book of business and financial lines business. Gross written premiums within Other decreased by $28 million as this segment generally represents lines of business that have been discontinued.   The increase in insurance premiums compared to the prior year period was primarily due to an increase in accident and health business, professional liability business and other specialty business, partially offset by portfolio actions taken on specialty casualty lines of business primarily in the U.S. portfolio.\nGross written premiums decreased by 0.8% to $13.4 billion for the nine months ended September 30, 2025, compared to $13.6 billion for the nine months ended September 30, 2024.  The decrease reflects an $111 million, or 60.6%, decrease within the Other segment and a $22 million, or 0.6%, decrease in our insurance business, partially offset by a $19 million, or 0.2%, increase in our reinsurance business.  Gross written premiums within Other has decreased by $111 million as this segment generally represents lines of business that have been discontinued.  The decrease in insurance premiums was primarily due to portfolio actions taken on specialty casualty lines of business, partially offset by an increase in other specialty business and property/short tail business.  The increase in reinsurance premiums was primarily driven by property pro rata business and property catastrophe excess of loss business in the U.S., partially offset by actions taken on our U.S. reinsurance casualty business.\nNet written premiums decreased by 1.3% remaining relatively constant at $3.8 billion for the three months ended September 30, 2025, compared to $3.8 billion for the three months ended September 30, 2024, primarily driven by  overall mix of business.  Net written premiums decreased by 1.5% to $11.6 billion for the nine months ended September 30, 2025, compared to $11.8 billion for the nine months ended September 30, 2024.  The larger percentage decrease in net written premiums compared to the percentage decrease in gross written premiums was mainly due to higher retention and overall mix of business. \nPremiums earned decreased by 1.6% to $3.9 billion during the three months ended September 30, 2025, compared to $3.9 billion during the three months ended September 30, 2024.  Premiums earned increased by 3.9% to $11.7 billion for the nine months ended September 30, 2025, compared to $11.3 billion for the nine months ended September 30, 2024.  The change in premiums earned relative to net written premiums was primarily the result of timing as the higher base premium written in 2024 is being earned through the 2025 period; premiums are earned ratably over the coverage period whereas written premiums are generally recorded at the initiation of the coverage period. \nOther Income (Expense).\n  We recorded other expense of $29 million and other expense of $102 million for the three months ended September 30, 2025 and 2024, respectively.  We recorded other expense of $129 million and other expense of $48 million for the nine months ended September 30, 2025 and 2024, respectively. The changes were primarily the result of fluctuations in foreign currency exchange rates, in particular, the movements in the Euro and British Pound Sterling.  We recognized foreign currency exchange expense of $33 million and foreign exchange currency expense of $102 million for the three months ended September 30, 2025 and 2024, respectively.  We recognized foreign currency exchange expense of $165 million and foreign currency exchange expense of $61 million for the nine months ended September 30, 2025 and 2024, respectively. The other expense incurred for the nine months ended September 30, \n34\nTable of Contents\n2025 is partially offset by a $26.7 million pension plan settlement gain recognized in the second quarter of 2025 driven by the extinguishment of the Everest Reinsurance Company (“Everest Re”) retirement pension plan obligation liability.\nNet Investment Income.\n  Refer to the “Consolidated Investments Results” section below.\nNet Gains (Losses) on Investments.\n  Refer to the “Consolidated Investments Results” section below.  \nClaims and Expenses.\nIncurred Losses and Loss Adjustment Expenses (“LAE”).\n  The following tables present our incurred losses and LAE for the periods indicated.\nThree Months Ended September 30,\n(Dollars in millions)\nCurrent\nYear\nRatio %/ \nPt Change\nPrior\nYears\nRatio %/ \nPt Change\nTotal\nIncurred\nRatio %/ \nPt Change\n2025\nAttritional\n$\n2,309 \n59.9 \n%\n$\n537 \n13.9 \n%\n$\n2,846 \n73.8 \n%\nCatastrophes\n50 \n1.3 \n%\n(59)\n(1.5)\n%\n(9)\n(0.2)\n%\nTotal\n$\n2,359 \n61.2 \n%\n$\n478 \n12.4 \n%\n$\n2,837 \n73.6 \n%\n2024\nAttritional\n$\n2,274 \n58.0 \n%\n$\n— \n— \n%\n$\n2,274 \n58.0 \n%\nCatastrophes\n310 \n7.9 \n%\n— \n— \n%\n310 \n7.9 \n%\nTotal\n$\n2,584 \n66.0 \n%\n$\n— \n— \n%\n$\n2,584 \n66.0 \n%\nVariance 2025/2024\nAttritional\n$\n35 \n1.8 \n pts\n$\n537 \n13.9 \n pts\n$\n572 \n15.8 \n  pts\nCatastrophes\n(260)\n(6.6)\n pts\n(59)\n(1.5)\n pts\n(319)\n(8.1)\n  pts\nTotal\n$\n(225)\n(4.8)\n pts\n$\n478 \n12.4 \n pts\n$\n253 \n7.6 \n  pts\n(Some amounts may not reconcile due to rounding.)\nNine Months Ended September 30,\n(Dollars in millions)\nCurrent\nYear\nRatio %/ Pt Change\nPrior\nYears\nRatio %/ Pt Change\nTotal\nIncurred\nRatio %/ Pt Change\n2025\nAttritional\n$\n7,061 \n60.4 \n%\n$\n596 \n5.1 \n%\n$\n7,658 \n65.5 \n%\nCatastrophes\n604 \n5.2 \n%\n(59)\n(0.5)\n%\n545 \n4.7 \n%\nTotal\n$\n7,665 \n65.5 \n%\n$\n537 \n4.6 \n%\n$\n8,203 \n70.1 \n%\n2024\nAttritional\n$\n6,586 \n58.5 \n%\n$\n— \n— \n%\n$\n6,586 \n58.5 \n%\nCatastrophes\n546 \n4.9 \n%\n— \n— \n%\n546 \n4.9 \n%\nTotal\n$\n7,132 \n63.3 \n%\n$\n— \n— \n%\n$\n7,132 \n63.3 \n%\nVariance 2025/2024\nAttritional\n$\n476 \n1.9 \n pts\n$\n596 \n5.1 \n pts\n1,072 \n7.0 \n pts\nCatastrophes\n58 \n0.3 \n pts\n(59)\n(0.5)\n pts\n(1)\n(0.2)\n pts\nTotal\n$\n533 \n2.2 \n pts\n$\n537 \n4.6 \n pts\n$\n1,071 \n6.8 \n pts\n(Some amounts may not reconcile due to rounding.)\nIncurred losses and LAE increased by 9.8% to $2.8 billion for the three months ended September 30, 2025, compared to $2.6 billion for the three months ended September 30, 2024, primarily due to an increase of $35 million in current year attritional losses and an increase in unfavorable development on prior year attritional losses of $537 million, partially offset by a decrease of $260 million in current year catastrophe losses and favorable development on prior year catastrophe losses of $59 million.  \n35\nTable of Contents\nThe increase in unfavorable development on prior year attritional losses of $537 million was primarily a result of strengthening of U.S. casualty reserves. The reserve strengthening for prior year loss development was driven by elevated loss experience in excess casualty and U.S. liability lines primarily on accident years 2022-2024.\nThe current year catastrophe losses of $50 million for the three months ended September 30, 2025 related primarily to Typhoon Ragasa ($20 million), the 2025 U.S. September floods ($20 million) and the 2025 Philippines earthquake ($10 million).  The $310 million of current year catastrophe losses for the three months ended September 30, 2024 related primarily to Hurricane Helene ($81 million), Hurricane Beryl ($67 million), Hurricane Debby ($60 million), the 2024 European flood Boris ($48 million) and the third quarter 2024 Calgary Alberta storms ($41 million). For the three months ended September 30, 2025, the favorable development on prior year catastrophe losses was mainly related to reserves released related to the 2022 Hurricane Ian event.\nIncurred losses and LAE increased by 15.0% to $8.2 billion for the nine months ended September 30, 2025, compared to $7.1 billion for the nine months ended September 30, 2024, primarily due to an increase of $476 million in current year attritional losses, an increase in unfavorable development on prior year attritional losses of $596 million and an increase of $58 million in current year catastrophe losses, partially offset by favorable development on prior year catastrophe losses of $59 million. \nThe increase in current year attritional losses and the unfavorable development on prior year attritional losses were both primarily related to the strengthening of U.S. casualty reserves. Additionally, the unfavorable development on prior year attritional losses was impacted by $98 million of aviation losses associated with the Russia/Ukraine war, partially offset by net favorable prior year development of $39 million due to reserve releases for property business. \nThe current year catastrophe losses of $604 million for the nine months ended September 30, 2025 related primarily to the 2025 Southern California wildfires ($512 million), the first quarter 2025 Myanmar earthquake ($28 million), Typhoon Ragasa ($20 million), the 2025 U.S. September floods ($20 million), the 2025 U.S. Midwest convective storms ($14 million) and the 2025 Philippines earthquake ($10 million).  The $546 million of current year catastrophe losses for the nine months ended September 30, 2024 related primarily to Hurricane Helene ($81 million), Hurricane Beryl ($67 million), the 2024 Baltimore bridge collapse ($62 million), Hurricane Debby ($60 million), the 2024 European flood Boris ($48 million), the 2024 Brazil Floods ($41 million), the third quarter 2024 Calgary Alberta storms ($41 million), the 2024 Germany floods ($41 million), the 2024 Dubai floods ($40 million) and the 2024 Taiwan earthquake ($27 million).  For the nine months ended September 30, 2025, the favorable development on prior year catastrophe losses was mainly related to reserves released related to the 2022 Hurricane Ian event.\nCatastrophe losses and loss expenses typically have a material effect on our incurred losses and LAE results and can vary significantly from period to period. Losses from natural catastrophes contributed 1.3 percentage points to the combined ratio for the three months ended September 30, 2025, compared with 7.9 percentage points in the corresponding period of 2024, and 5.2 percentage points to the combined ratio for the nine months ended September 30, 2025, compared with 4.9 percentage points in the corresponding period of 2024.\nCommission, Brokerage, Taxes and Fees.\n  Commission, brokerage, taxes and fees increased by 7.8% to $890 million for the three months ended September 30, 2025, compared to $826 million for the three months ended September 30, 2024.  Commission, brokerage, taxes and fees increased by 8.2% to $2.6 billion for the nine months ended September 30, 2025, compared to $2.4 billion for the nine months ended September 30, 2024. The increases were primarily due to the impact of change in profit commission from the mortgage business loss reserves decrease within the Reinsurance segment and overall mix of business.\nOther Underwriting Expenses.\n  Other underwriting expenses were $258 million and $236 million for the three months ended September 30, 2025 and September 30, 2024, respectively.  Other underwriting expenses were $750 million and $694 million for the nine months ended September 30, 2025 and 2024, respectively.  The increases in other underwriting expenses were driven by continued investment in insurance operations.\nCorporate Expenses.\n  Corporate expenses, which are general operating expenses that are not allocated to segments, were $27 million and $25 million for the three months ended September 30, 2025 and 2024, respectively, and $79 million and $69 million for the nine months ended September 30, 2025 and 2024, respectively.  The increases in Corporate expenses for the three and nine month periods ended September 30, 2025 are primarily due to a nonrecurring adjustment due to the curtailment of the employee benefit plan in 2024, as well as an increase in professional services related to the continued build out of our infrastructure.\n36\nTable of Contents\nInterest, Fees and Bond Issue Cost Amortization Expense.\n  Interest, fees and other bond amortization expense remained consistent at $38 million for the three months ended September 30, 2025, compared to $38 million for the three months ended September 30, 2024.  Interest, fees and other bond amortization expense increased to $114 million from $112 million for the nine months ended September 30, 2025 and 2024, respectively.  The increase for the nine months ended September 30, 2025 was mainly due to higher interest costs on the Federal Home Loan Bank of New York borrowing, partially offset by a decrease in the floating interest rate related to the Company’s outstanding fixed to floating rate long-term subordinated notes, which is reset quarterly, per the note agreement.  The floating rate was 6.86% as of September 30, 2025, compared to 7.76% as of September 30, 2024.  \nIncome Tax Expense (Benefit).\n  Income tax expense was $14 million and $68 million for the three months ended September 30, 2025 and 2024, respectively. Income tax expense was $187 million and $275 million for the nine months ended September 30, 2025 and 2024, respectively. The period over period decrease in income tax expense is primarily a function of the geographic location of the Company’s pre-tax income and the statutory tax rates in those jurisdictions. The effective tax rate (“ETR”) is primarily affected by tax-exempt investment income, foreign tax credits and dividends. Variations in the ETR generally result from changes in the relative levels of pre-tax income, including the impact of catastrophe losses and net capital gains (losses), among jurisdictions with different tax rates. \nOn December 27, 2023, the Government of Bermuda enacted the Corporate Income Tax Act 2023 (“The 2023 Act”), which applies a 15% corporate income tax to certain Bermuda businesses in fiscal years beginning on or after January 1, 2025. The 2023 Act includes a provision referred to as “The Economic Transition Adjustment”, which is intended to provide a fair and equitable transition into the new tax regime, and results in a deferred tax benefit for the Company. However, on January 15, 2025, the Organisation for Economic Co-operation and Development issued Administrative Guidance related to “deferred tax assets arising from tax benefits provided by General Government” whereby it has restricted the utilization of those deferred tax benefits against the computation of its Pillar Two Global Minimum Taxes to approximately 20% of the originally calculated amounts and only for a grace period of two years through 2026. If the Bermuda Ministry of Finance amends The 2023 Act in response to this guidance, the exact impact of any such amendments is uncertain but there is a risk that it results in a reduction in the Company's Deferred Tax Assets.\nOn July 4, 2025, The One Big Beautiful Bill was signed into law. The One Big Beautiful Bill did not have a material impact on our results of operations, financial condition, or cash flows upon enactment in the third quarter of 2025, and we do not expect it to have a material impact in the future; however, we will continue to evaluate the impact of The One Big Beautiful Bill.\nNet Income (Loss).\nOur net income was $255 million and $509 million for the three months ended September 30, 2025 and 2024, respectively.  Our net income was $1.1 billion and $2.0 billion for the nine months ended September 30, 2025 and 2024, respectively.  The period over period changes in net income were primarily driven by the financial component fluctuations explained above.\nRatios.\nOur combined ratio increased by 10.3 points to 103.4% for the three months ended September 30, 2025, compared to 93.1% for the three months ended September 30, 2024 and increased by 7.9 points to 98.7% for the nine months ended September 30, 2025, compared to 90.8% for the nine months ended September 30, 2024. The current year increase is primarily due to higher attritional losses.  Refer to the analysis of combined ratio components below.\nThe loss ratio component increased by 7.6 points to 73.6% for the three months ended September 30, 2025, compared to 66.0% for the three months ended September 30, 2024, mainly due to a $537 million increase in unfavorable development on prior year attritional losses, partially offset by a $260 million decrease in catastrophe losses.  The loss ratio component increased by 6.8 points to 70.1% for the nine months ended September 30, 2025, compared to 63.3% for the nine months ended September 30, 2024, primarily due to an increase of $476 million in current year attritional losses, an increase of $58 million in current year catastrophe losses and unfavorable prior year development on attritional losses of $596 million. \nThe commission and brokerage ratio components increased to 23.1% for the three months ended September 30, 2025, compared to 21.1% for the three months ended September 30, 2024, and increased to 22.2% for the nine months ended September 30, 2025, compared to 21.3% for the nine months ended September 30, 2024.  The quarter over quarter increase was mainly due to changes in the mix of business and the change in profit commission from the mortgage business loss reserves decrease within the Reinsurance segment.  \n37\nTable of Contents\nThe other underwriting expense ratios increased to 6.7% for the three months ended September 30, 2025, compared to 6.0% for the three months ended September 30, 2024, and increased to 6.4% for the nine months ended September 30, 2025, compared to 6.2% for the nine months ended September 30, 2024.  The increase for the three and nine months was mainly due to growth in insurance operations.\nShareholders’ Equity.\nShareholders’ equity increased by $1.5 billion to $15.4 billion at September 30, 2025 from $13.9 billion at December 31, 2024, principally as a result of $1.1 billion of net income, $762 million of unrealized appreciation on available for sale fixed maturity portfolio net of tax, $230 million of net foreign currency translation adjustments and $24 million of share-based compensation transactions, partially offset by $400 million of share repurchases, $253 million of shareholder dividends and $8 million of net benefit plan obligation adjustments. \nConsolidated Investment Results\nNet Investment Income.\nNet investment income increased by 8.8% to $540 million for the three months ended September 30, 2025, compared with net investment income of $496 million for the three months ended September 30, 2024.  The increase for the three months ended September 30, 2025 was primarily the result of an increase of $41 million in limited partnership income and an increase of $12 million in income from fixed maturity investments, partially offset by a decline of $11 million in income from short-term investments.  Net investment income increased by 5.5% to $1.6 billion for the nine months ended September 30, 2025, compared with investment income of $1.5 billion for the nine months ended September 30, 2024.  The increase for the nine months ended September 30, 2025 was primarily the result of an increase of $73 million of income from fixed maturity investments, an increase of $6 million in limited partnership income and an increase of $2 million in income from other alternative investments, partially offset by a decline of $10 million from short-term investments.  The limited partnership income primarily reflects changes in reported net asset values.  As such, until these asset values are monetized and the resultant income is distributed, they are subject to volatile results of future increases or decreases in the asset value.  \nThe following table shows the components of net investment income for the periods indicated:  \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(Dollars in millions)\n2025\n2024\n2025\n2024\nFixed maturities\n$\n390 \n$\n378 \n$\n1,172 \n$\n1,099 \nEquity securities\n1 \n1 \n3 \n3 \nShort-term investments and cash\n43 \n54 \n125 \n135 \nOther invested assets\nLimited partnerships\n76 \n36 \n189 \n183 \nOther  \n36 \n36 \n87 \n85 \nGross investment income before adjustments \n546 \n504 \n1,577 \n1,506 \nFunds held interest income (expense)\n7 \n5 \n22 \n20 \nFuture policy benefit reserve income (expense)\n— \n1 \n— \n— \nGross investment income \n553 \n510 \n1,598 \n1,525 \nInvestment expenses \n13 \n13 \n35 \n44 \nNet investment income\n$\n540 \n$\n496 \n$\n1,563 \n$\n1,481 \n(Some amounts may not reconcile due to rounding.)\nThe following table shows a comparison of various investment yields for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nAnnualized pre-tax yield on average cash and invested assets\n4.8 \n%\n4.8 \n%\n4.7 \n%\n4.9 \n%\nAnnualized after-tax yield on average cash and invested assets\n4.0 \n%\n4.2 \n%\n3.9 \n%\n4.3 \n%\nAnnualized return on invested assets\n4.4 \n%\n4.6 \n%\n4.5 \n%\n4.8 \n%\n38\nTable of Contents\nNet Gains (Losses) on Investments.\nThe following table presents the composition of our net gains (losses) on investments for the periods indicated:  \nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\n2025\n2024\nVariance\n2025\n2024\nVariance\nRealized gains (losses) from dispositions:\nFixed maturity securities - available for sale\nGains\n$\n34 \n$\n59 \n$\n(26)\n$\n43 \n$\n86 \n(42)\nLosses\n(69)\n(84)\n15 \n(91)\n(133)\n41 \nTotal\n(36)\n(25)\n(11)\n(48)\n(47)\n(1)\nFixed maturity securities - held to maturity\nGains\n— \n— \n— \n— \n— \n— \nLosses\n— \n— \n— \n(1)\n— \n(1)\nTotal\n— \n— \n— \n— \n— \n— \nEquity securities\nGains\n— \n— \n— \n— \n2 \n(1)\nLosses\n— \n— \n— \n(1)\n— \n— \nTotal\n— \n— \n— \n(1)\n1 \n(2)\nOther Invested Assets\nGains\n— \n— \n— \n— \n— \n— \nLosses\n— \n1 \n(1)\n— \n— \n— \nTotal\n— \n1 \n(1)\n— \n— \n— \nShort-Term Investments\nGains\n— \n1 \n(1)\n— \n1 \n(1)\nLosses\n— \n— \n— \n— \n— \n— \nTotal\n— \n1 \n(1)\n— \n1 \n(1)\nTotal net realized gains (losses) from dispositions\nGains\n34 \n60 \n(26)\n44 \n88 \n(44)\nLosses\n(69)\n(84)\n14 \n(93)\n(133)\n40 \nTotal\n(36)\n(24)\n(12)\n(49)\n(45)\n(3)\nAllowance for credit losses\n(12)\n(9)\n(3)\n(14)\n(3)\n(11)\nGains (losses) from fair value adjustments\nEquity securities\n— \n5 \n(5)\n3 \n(3)\n6 \nTotal\n— \n5 \n(5)\n3 \n(3)\n6 \nTotal net gains (losses) on investments\n$\n(47)\n$\n(27)\n$\n(20)\n$\n(59)\n$\n(50)\n$\n(9)\n(Some amounts may not reconcile due to rounding.)\nTotal net gains (losses) on investments during the three months ended September 30, 2025 primarily consist of $36 million of losses due to the disposition of investments and an increase to the allowance for credit losses of $12 million.\nTotal net gains (losses) on investments during the nine months ended September 30, 2025 primarily relate to $49 million of net losses due to the disposition of investments and an increase to the allowance for credit losses of $14 million, partially offset by $3 million of gains from fair value adjustments on equity securities.\nSegment Results.\nOur two reportable segments, Reinsurance and Insurance, each have executive leadership who are responsible for the overall performance of their respective segments and who are directly accountable to our chief operating decision maker (“CODM”), the President and Chief Executive Officer of Everest Group, Ltd., who is ultimately responsible for reviewing \n39\nTable of Contents\nthe business to assess performance, make operating decisions and allocate resources. We report the results of our operations consistent with the manner in which our CODM reviews the business.\nDuring the fourth quarter of 2024, the Company revised its classification and presentation of certain run-off business, previously included within the Reinsurance and Insurance reportable segments, as part of a new segment called \"Other\".  The Other segment includes the results of our sports and leisure business sold in October 2024, consisting of policies written prior to the sale and polices renewed and certain new business written on the Company’s paper post-sale. It also includes run-off A&E exposures, certain discontinued insurance programs primarily written prior to 2012 and certain discontinued insurance and reinsurance coverage classes.   The Other segment does not generally sell insurance or reinsurance products but is responsible for the management of existing policies and settlement of related losses.  \nThe Company does not review and evaluate the financial results of its segments based upon balance sheet data.  Management generally monitors and evaluates the financial performance of these segments based upon their underwriting results.  Underwriting results include earned premium less losses and LAE incurred, commission and brokerage expenses and other underwriting expenses.  The Company measures its underwriting results using ratios, in particular, loss, commission and brokerage and other underwriting expense ratios, which, respectively, divide incurred losses, commissions and brokerage and other underwriting expenses by premiums earned.  Management has determined that these measures are appropriate and align with how the business is managed. We continue to evaluate our segments as our business evolves and may further refine our segments and financial performance measures.\nThe following discusses the underwriting results for each of our segments for the periods indicated. \nReinsurance.\nThe following table presents the underwriting results and ratios for the Reinsurance segment for the periods indicated:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\n2025\n2024\nVariance\n% Change\n2025\n2024\nVariance\n% Change\nGross written premiums\n$\n3,206\n$\n3,265\n$\n(59)\n(1.8)\n%\n$\n9,668\n$\n9,650\n$\n19 \n0.2 \n%\nNet written premiums\n2,885\n2,975\n(89)\n(3.0)\n%\n8,773\n8,950\n(177)\n(2.0)\n%\nPremiums earned\n$\n2,892\n$\n2,970\n$\n(78)\n(2.6)\n%\n$\n8,835\n$\n8,429\n$\n405 \n4.8 \n%\nIncurred losses and LAE\n1,678\n1,942\n(264)\n(13.6)\n%\n5,673\n5,266\n407 \n7.7 \n%\nCommission and brokerage\n764\n710\n53 \n7.5 \n%\n2,223\n2,054\n170 \n8.3 \n%\nOther underwriting expenses\n74\n73\n1 \n1.7 \n%\n221\n215\n6 \n2.9 \n%\nUnderwriting gain (loss)\n$\n376\n$\n245\n$\n132 \n53.9 \n%\n$\n717\n$\n895\n$\n(178)\n(19.9)\n%\nPoint Chg\nPoint Chg\nLoss ratio\n58.0 \n%\n65.4 \n%\n(7.4)\n64.2 \n%\n62.5 \n%\n1.7 \nCommission and brokerage ratio\n26.4 \n%\n23.9 \n%\n2.5 \n25.2 \n%\n24.4 \n%\n0.8 \nOther underwriting expense ratio\n2.6 \n%\n2.5 \n%\n0.1 \n2.5 \n%\n2.6 \n%\n— \nCombined ratio\n87.0 \n%\n91.8 \n%\n(4.8)\n91.9 \n%\n89.4 \n%\n2.5 \n(NM, Not Meaningful)\n(Some amounts may not reconcile due to rounding.)\nPremiums.\n  Gross written premiums decreased by 1.8% to $3.2 billion for the three months ended September 30, 2025, compared to $3.3 billion for the three months ended September 30, 2024, primarily driven by the effects of underwriting actions on U.S. casualty pro rata and casualty excess of loss lines of business, partially offset by an increase in the property book of business and financial lines business.  Gross written premiums increased by 0.2% to $9.7 billion for the nine months ended September 30, 2025, compared to $9.6 billion for the nine months ended September 30, 2024, primarily driven by property pro rata business and property catastrophe excess of loss business in the U.S., partially offset by actions taken on our U.S. reinsurance casualty business.\nNet written premiums decreased by 3.0% to $2.9 billion for the three months ended September 30, 2025, compared to $3.0 billion for the three months ended September 30, 2024.  Net written premiums decreased by 2.0% to $8.8 billion for the nine months ended September 30, 2025, compared to $8.9 billion for the nine months ended September 30, 2024.  The decreases were driven by changes in cessions and overall mix of business.\n40\nTable of Contents\nPremiums earned decreased by 2.6% to $2.9 billion for the three months ended September 30, 2025, compared to $3.0 billion for the three months ended September 30, 2024, comparable to the decrease in net written premium.  Premiums earned increased by 4.8% to $8.8 billion for the nine months ended September 30, 2025, compared to $8.4 billion for the nine months ended September 30, 2024, primarily driven by increased property pro rata business written that was recorded over the prior quarters which are now being earned. The change in premiums earned relative to net written premiums is the result of timing; premiums are earned ratably over the coverage period, whereas written premiums are generally recorded at the initiation of the coverage period. \nIncurred Losses and LAE. \n The following tables present the incurred losses and LAE for the Reinsurance segment for the periods indicated:\nThree Months Ended September 30,\n(Dollars in millions)\nCurrent\nYear\nRatio %/\nPt Change\nPrior\nYears\nRatio %/\nPt Change\nTotal\nIncurred\nRatio %/\nPt Change\n2025\nAttritional\n$\n1,662 \n57.5 \n%\n$\n30 \n1.0 \n%\n1,692 \n58.5 \n%\nCatastrophes\n45 \n1.6 \n%\n(59)\n(2.0)\n%\n(14)\n(0.5)\n%\nTotal Segment\n$\n1,707 \n59.0 \n%\n$\n(29)\n(1.0)\n%\n$\n1,678 \n58.0 \n%\n2024\nAttritional\n$\n1,672 \n56.3 \n%\n$\n— \n— \n%\n1,672 \n56.3 \n%\nCatastrophes\n270 \n9.1 \n%\n— \n— \n%\n270 \n9.1 \n%\nTotal Segment\n$\n1,942 \n65.4 \n%\n$\n— \n— \n%\n$\n1,942 \n65.4 \n%\nVariance 2025/2024\nAttritional\n$\n(10)\n1.2 \n pts\n$\n30 \n1.0 \n pts\n$\n20 \n2.2 \n pts\nCatastrophes\n(225)\n(7.5)\n pts\n(59)\n(2.0)\n pts\n(284)\n(9.6)\n pts\nTotal Segment\n$\n(235)\n(6.4)\n pts\n$\n(29)\n(1.0)\n pts\n$\n(264)\n(7.4)\n pts\n(Some amounts may not reconcile due to rounding.)\nNine Months Ended September 30,\n(Dollars in millions)\nCurrent\nYear\nRatio %/\nPt Change\nPrior\nYears\nRatio %/\nPt Change\nTotal\nIncurred\nRatio %/\nPt Change\n2025\nAttritional\n$\n5,074 \n57.4 \n%\n$\n89 \n1.0 \n%\n5,164 \n58.4 \n%\nCatastrophes\n569 \n6.4 \n%\n(59)\n(0.7)\n%\n509 \n5.8 \n%\nTotal Segment\n$\n5,643 \n63.9 \n%\n$\n30 \n0.3 \n%\n$\n5,673 \n64.2 \n%\n2024\nAttritional\n$\n4,779 \n56.7 \n%\n$\n— \n— \n%\n4,779 \n56.7 \n%\nCatastrophes\n487 \n5.8 \n%\n— \n— \n%\n487 \n5.8 \n%\nTotal Segment\n$\n5,266 \n62.5 \n%\n$\n— \n— \n%\n$\n5,266 \n62.5 \n%\nVariance 2025/2024\nAttritional\n$\n295 \n0.7 \n pts\n$\n89 \n1.0 \n pts\n$\n385 \n1.8 \n pts\nCatastrophes\n82 \n0.7 \n pts\n(59)\n(0.7)\n pts\n23 \n— \n pts\nTotal Segment\n$\n377 \n1.4 \n pts\n$\n30 \n0.3 \n pts\n$\n407 \n1.7 \n pts\n(Some amounts may not reconcile due to rounding.)\nIncurred losses decreased by 13.6% to $1.7 billion for the three months ended September 30, 2025, compared to $1.9 billion for the three months ended September 30, 2024.  The decrease was primarily due to a decrease of $10 million in current year attritional losses, a decrease of $225 million in current year catastrophe losses and favorable development on prior year catastrophe losses of $59 million, partially offset by an increase of unfavorable development on prior year attritional losses of $30 million.  \n41\nTable of Contents\nThe decrease in current year attritional losses was mainly related to the impact of change in business mix.  The unfavorable development on prior year attritional losses was primarily related to reserve strengthening of the U.S. casualty business.\nThe $45 million of current year catastrophe losses for the three months ended September 30, 2025 related primarily to Typhoon Ragasa ($20 million), the 2025 U.S. September floods ($15 million) and the 2025 Philippines earthquake ($10 million).  The $270 million of current year catastrophe losses for the three months ended September 30, 2024 related primarily to Hurricane Helene ($65 million), Hurricane Debby ($59 million), Hurricane Beryl ($56 million), the 2024 European flood Boris ($46 million) and the 2024 third quarter Calgary Alberta storms ($35 million). For three months ended September 30, 2025, the favorable development on prior year catastrophe losses was mainly related to reserves released related to the 2022 Hurricane Ian event. \nIncurred losses increased by 7.7% to $5.7 billion for the nine months ended September 30, 2025, compared to $5.3 billion for the nine months ended September 30, 2024.  The increase was primarily due to an increase of $295 million in current year attritional losses, an increase of $82 million in current year catastrophe losses and an increase of unfavorable development on prior year attritional losses of $89 million, partially offset by favorable development on prior year catastrophe losses of $59 million. \nThe increase in current year attritional losses was mainly related to the impact of the increase in premiums earned, the impact of the Washington D.C. aviation accident during the first quarter and reserve strengthening on the U.S. casualty business.  The unfavorable development on prior year attritional losses was primarily related to reserve strengthening on the U.S. casualty business, as well as aviation losses associated with the Russia/Ukraine war of $98 million. In the second quarter of 2025, the United Kingdom’s High Court concluded that the confiscation of certain aircraft was covered under the war provision within certain reinsurance contracts.  As a result of the court’s decision, the Company increased its net ultimate loss reserve for contracts that were exposed to the war in the Ukraine by $98 million ($84 million net of reinstatement premiums). \nThe current year catastrophe losses of $569 million for the nine months ended September 30, 2025 related primarily to the 2025 Southern California wildfires ($502 million) and the first quarter 2025 Myanmar earthquake ($20 million), Typhoon Ragasa ($20 million), the 2025 U.S. September floods ($15 million), the 2025 Philippines earthquake ($10 million) and the 2025 U.S. Midwest convective storms ($14 million).  The $487 million of current year catastrophe losses for the nine months ended September 30, 2024 related primarily to Hurricane Helene ($65 million), Hurricane Debby ($59 million), the 2024 Baltimore bridge collapse ($57 million), Hurricane Beryl ($56 million), the 2024 European flood Boris ($46 million), the 2024 Brazil Floods ($41 million), the 2024 Dubai floods ($40 million), the 2024 Germany floods ($39 million), the third quarter 2024 Calgary Alberta storms ($35 million) and the 2024 Taiwan earthquake ($25 million).  For nine months ended September 30, 2025, the favorable development on prior year catastrophe losses was mainly related to reserves released related to the 2022 Hurricane Ian event.\nSegment Expenses.\n  Commission and brokerage expense increased by 7.5% to $764 million for the three months ended September 30, 2025, compared to $710 million for the three months ended September 30, 2024.  Commission and brokerage expense increased by 8.3% to $2.2 billion for the nine months ended September 30, 2025, compared to $2.1 billion for the nine months ended September 30, 2024.  The increases were mainly due to the impact of the increase in premiums earned, mortgage-related contingent commissions and changes in the mix of business.\nSegment other underwriting expenses increased to $74 million for the three months ended September 30, 2025, compared to $73 million for the three months ended September 30, 2024.  Segment other underwriting expenses increased to $221 million for the nine months ended September 30, 2025, compared to $215 million for the nine months ended September 30, 2024.  Quarter to date remained relatively consistent with written premium movement, while the increase in year to date was mainly due to increased expenditures supporting premium volume of the segment. \n42\nTable of Contents\nInsurance.\nThe following table presents the underwriting results and ratios for the Insurance segment for the periods indicated:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\n2025\n2024\nVariance\n% Change\n2025\n2024\nVariance\n% Change\nGross written premiums\n$\n1,147\n$\n1,110\n$\n37 \n3.4 \n%\n$\n3,706\n$\n3,728\n$\n(22)\n(0.6)\n%\nNet written premiums\n848\n789\n59 \n7.5 \n%\n2,767\n2,694\n72 \n2.7 \n%\nPremiums earned\n$\n939\n$\n898\n$\n41 \n4.6 \n%\n$\n2,772\n$\n2,679\n$\n93 \n3.5 \n%\nIncurred losses and LAE\n996\n605\n391 \n64.7 \n%\n2,280\n1,744\n536 \n30.7 \n%\nCommission and brokerage\n121\n110\n11 \n10.1 \n%\n355\n325\n30 \n9.1 \n%\nOther underwriting expenses\n178\n154\n24 \n15.5 \n%\n518\n454\n64 \n14.1 \n%\nUnderwriting gain (loss)\n$\n(357)\n$\n28\n$\n(385)\nNM\n$\n(381)\n$\n156\n$\n(536)\nNM\nPoint Chg\nPoint Chg\nLoss ratio\n106.1 \n%\n67.4 \n%\n38.7 \n82.2 \n%\n65.1 \n%\n17.1 \nCommission and brokerage ratio\n12.9 \n%\n12.3 \n%\n0.7 \n12.8 \n%\n12.1 \n%\n0.7 \nOther underwriting expense ratio\n19.0 \n%\n17.2 \n%\n1.8 \n18.7 \n%\n16.9 \n%\n1.7 \nCombined ratio\n138.1 \n%\n96.9 \n%\n41.2 \n113.7 \n%\n94.2 \n%\n19.5 \n(NM not meaningful)\n(Some amounts may not reconcile due to rounding.)\nPremiums.\n  Gross written premiums increased by 3.4% remaining relatively constant at $1.1 billion for the three months ended September 30, 2025, compared to $1.1 billion for the three months ended September 30, 2024.  The increase in insurance premiums was primarily due to an increase in accident and health business, increases in professional liability business and other specialty business within the U.S. portfolio, and increases in property/short tail business in Latin America and Singapore, partially offset by portfolio actions taken on specialty casualty lines of business in the U.S. portfolio.  Gross written premiums decreased by 0.6% remaining relatively constant at $3.7 billion for the nine months ended September 30, 2025, compared to $3.7 billion for the nine months ended September 30, 2024.  The decrease in insurance premiums was primarily due to portfolio actions taken on specialty casualty lines of business in the U.S. portfolio, partially offset by an increase in other specialty business and property/short tail business driven by emerging growth in Colombia, Mexico, and contributions from Ireland and Lloyds.\nNet written premiums increased by 7.5% to $848 million for the three months ended September 30, 2025, compared to $789 million for the three months ended September 30, 2024.  Net written premiums increased by 2.7% to $2.8 billion for the nine months ended September 30, 2025, compared to $2.7 billion for the nine months ended September 30, 2024.  The increases were primarily due to business mix and higher retention in certain lines of business.\nPremiums earned increased by 4.6% to $939 million for the three months ended September 30, 2025, compared to $898 million for the three months ended September 30, 2024.  Premiums earned increased by 3.5% to $2.8 billion for the nine months ended September 30, 2025, compared to $2.7 billion for the nine months ended September 30, 2024. The change in premiums earned relative to net written premiums is the result of timing as the higher base premium written in 2024 is being earned through the 2025 period; premiums are earned ratably over the coverage period, whereas written premiums are generally recorded at the initiation of the coverage period.     \n43\nTable of Contents\nIncurred Losses and LAE. \n The following tables present the incurred losses and LAE for the Insurance segment for the periods indicated:  \nThree Months Ended September 30,\n(Dollars in millions)\nCurrent\nYear\nRatio %/\nPt Change\nPrior\nYears\nRatio %/\nPt Change\nTotal\nIncurred\nRatio %/\nPt Change\n2025\nAttritional\n$\n630 \n67.1 \n%\n$\n361 \n38.5 \n%\n991 \n105.6 \n%\nCatastrophes\n5 \n0.5 \n%\n— \n— \n%\n5 \n0.5 \n%\nTotal Segment\n$\n635 \n67.6 \n%\n$\n361 \n38.5 \n%\n$\n996 \n106.1 \n%\n2024\nAttritional\n$\n565 \n62.9 \n%\n$\n— \n— \n%\n565 \n62.9 \n%\nCatastrophes\n40 \n4.5 \n%\n— \n— \n%\n40 \n4.5 \n%\nTotal Segment\n$\n605 \n67.4 \n%\n$\n— \n— \n%\n$\n605 \n67.4 \n%\nVariance 2025/2024\nAttritional\n$\n65 \n4.2 \n pts\n$\n361 \n38.5 \n pts\n$\n426 \n42.7 \n pts\nCatastrophes\n(35)\n(3.9)\n pts\n— \n— \n pts\n(35)\n(3.9)\n pts\nTotal Segment\n$\n30 \n0.2 \n pts\n$\n361 \n38.5 \n pts\n$\n391 \n38.7 \n pts\nNine Months Ended September 30,\n(Dollars in millions)\nCurrent\nYear\nRatio %/\nPt Change\nPrior\nYears\nRatio %/\nPt Change\nTotal\nIncurred\nRatio %/\nPt Change\n2025\nAttritional\n$\n1,893 \n68.3 \n%\n$\n361 \n13.0 \n%\n2,255 \n81.3 \n%\nCatastrophes\n25 \n0.9 \n%\n— \n— \n%\n25 \n0.9 \n%\nTotal Segment\n$\n1,919 \n69.2 \n%\n$\n361 \n13.0 \n%\n$\n2,280 \n82.2 \n%\n2024\nAttritional\n$\n1,685 \n62.9 \n%\n$\n— \n— \n%\n1,685 \n62.9 \n%\nCatastrophes\n60 \n2.2 \n%\n— \n— \n%\n59 \n2.2 \n%\nTotal Segment\n$\n1,744 \n65.1 \n%\n$\n— \n— \n%\n$\n1,744 \n65.1 \n%\nVariance 2025/2024\nAttritional\n$\n209 \n5.4 \n pts\n$\n361 \n13.0 \n pts\n570 \n18.4 \n pts\nCatastrophes\n(34)\n(1.3)\n pts\n— \n— \n pts\n(34)\n(1.3)\n pts\nTotal Segment\n$\n174 \n4.1 \n pts\n$\n361 \n13.0 \n pts\n$\n536 \n17.1 \n pts\n(Some amounts may not reconcile due to rounding.)\nIncurred losses and LAE increased by 64.7% to $996 million for the three months ended September 30, 2025, compared to $605 million for the three months ended September 30, 2024.  The increase was mainly due to an increase of $65 million in current year attritional losses and an increase of $361 million in unfavorable development on prior year attritional losses, partially offset by a decrease of $35 million in current year catastrophe losses.  \nThe increase in current year attritional losses and the unfavorable development on prior year attritional losses were both primarily due to reserve strengthening in U.S. casualty lines of business driven by elevated loss experience in excess casualty and U.S. liability lines primarily on accident years 2022-2024. The $5 million of current year catastrophe losses for the three months ended September 30, 2025 primarily related to the 2025 U.S. September floods.  The $40 million of current year catastrophe losses for the three months ended September 30, 2024 related to Hurricane Helene ($16 million), Hurricane Beryl ($11 million), the 2024 Jasper fires ($6 million) and the third quarter 2024 Calgary Alberta storms ($6 million).\nIncurred losses and LAE increased by 30.7% to $2.3 billion for the nine months ended September 30, 2025, compared to $1.7 billion for the nine months ended September 30, 2024.  The increase was mainly due to an increase of $209 million \n44\nTable of Contents\nin current year attritional losses and an increase of $361 million in unfavorable development on prior year attritional losses, partially offset by a decrease in current year catastrophe losses of $34 million.  \nThe increase in current year attritional losses and the unfavorable development on prior year attritional losses were both primarily due to reserve strengthening in U.S. casualty lines of business driven by elevated loss experience in excess casualty and U.S. liability lines primarily on accident years 2022-2024.\nThe current year catastrophe losses of $25 million for the nine months ended September 30, 2025 related primarily to the first quarter 2025 Myanmar earthquake ($8 million), the 2025 Southern California wildfires ($7 million), the 2025 U.S. Midwest convective storms ($5 million) and the 2025 U.S. September floods ($5 million).  The $60 million of current year catastrophe losses for the nine months ended September 30, 2024 related to Hurricane Helene ($16 million), Hurricane Beryl ($11 million), the 2024 second quarter U.S. convective storms ($10 million), the 2024 Jasper fires ($6 million), the third quarter 2024 Calgary Alberta storms ($6 million) and the 2024 Baltimore bridge collapse ($5 million).\nSegment Expenses. \n Commission and brokerage expenses increased by 10.1% to $121 million for the three months ended September 30, 2025, compared to $110 million for the three months ended September 30, 2024.  Commission and brokerage expenses increased by 9.1% to $355 million for the nine months ended September 30, 2025, compared to $325 million for the nine months ended September 30, 2024.  The increases were mainly due to changes in the mix of business. \nSegment other underwriting expenses increased to $178 million for the three months ended September 30, 2025, compared to $154 million for the three months ended September 30, 2024.  Segment other underwriting expenses increased to $518 million for the nine months ended September 30, 2025, compared to $454 million for the nine months ended September 30, 2024.  These increases were mainly due to the impact of the continued investment in insurance operations.\nOther.\nThe Other segment includes the results of our sports and leisure business sold in October 2024, consisting of policies written prior to the sale and polices renewed and certain new business written on the Company’s paper post-sale. It also includes run-off A&E exposures, certain discontinued insurance programs primarily written prior to 2012 and certain discontinued insurance and reinsurance coverage classes.   The Other segment does not generally sell insurance or reinsurance products but is responsible for the management of existing policies and settlement of related losses.  \nThe following table presents the underwriting results and ratios for the Other segment for the periods indicated:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\n2025\n2024\nVariance\n% Change\n2025\n2024\nVariance\n% Change\nGross written premiums\n$\n22 \n$\n50 \n$\n(28)\n(55.9)\n%\n$\n72 \n$\n183 \n$\n(111)\n(60.6)\n%\nNet written premiums\n21 \n41 \n(21)\n(49.9)\n%\n68 \n145 \n(77)\n(53.3)\n%\nPremiums earned\n$\n24 \n$\n50 \n$\n(25)\n(51.0)\n%\n$\n92 \n$\n154 \n$\n(62)\n(40.3)\n%\nIncurred losses and LAE\n163 \n37 \n126 \nNM\n250 \n122 \n128 \nNM\nCommission and brokerage\n6 \n5 \n— \n2.1 \n%\n16 \n19 \n(2)\n(11.7)\n%\nOther underwriting expenses\n5 \n8 \n(4)\n(43.3)\n%\n11 \n24 \n(14)\n(56.7)\n%\nUnderwriting gain (loss)\n$\n(149)\n$\n(1)\n$\n(148)\nNM\n$\n(185)\n$\n(11)\n$\n(174)\nNM\nIncurred Losses and LAE.\n  Incurred losses and LAE increased to $163 million for the three months ended September 30, 2025, compared to $37 million for the three months ended September 30, 2024.  Incurred losses and LAE increased to $250 million for the nine months ended September 30, 2025, compared to $122 million for the nine months ended September 30, 2024.  The increase in incurred losses was due to unfavorable development on prior year attritional losses driven by U.S. casualty lines, primarily from our sports and leisure business.\nFINANCIAL CONDITION \nInvestments.\n  Total investments were $44.3 billion at September 30, 2025, an increase of $4.3 billion compared to $40.0 billion at December 31, 2024. The rise in investments was primarily related to an increase in fixed maturities - available for sale due to an overall net purchase of $3.7 billion, partially offset by a decrease in short-term investment due to an overall net sale of $945 million during the nine months ended September 30, 2025.\n45\nTable of Contents\nThe Company’s limited partnership investments are comprised of limited partnerships that invest in private equity, private credit and private real estate.  Generally, the limited partnerships are reported on a month or quarter lag.  We receive annual audited financial statements for all the limited partnerships, which are prepared using fair value accounting in accordance with Financial Accounting Standards Board guidance.  For the quarterly reports, the Company reviews the financial reports for any unusual changes in carrying value.  If the Company becomes aware of a significant decline in value during the lag reporting period, the loss will be recorded in the period in which the Company identifies the decline.\nThe table below summarizes the composition and characteristics of our investment portfolio for the periods indicated.  \nAt\nSeptember 30, 2025\nAt\nDecember 31, 2024\nFixed income portfolio duration (years)\n3.4\n3.1\nFixed income composite credit quality\nAA-\nAA-\nReinsurance Recoverables.\nReinsurance recoverables for both paid and unpaid losses totaled $3.9 billion and $3.1 billion at September 30, 2025 and December 31, 2024, respectively.  At September 30, 2025, $405 million, or 10.4%, was receivable from Mt. Logan Re collateralized segregated accounts; $391 million, or 10.0%, was receivable from Munich Reinsurance America, Inc. and $301 million, or 7.7% was receivable from Endurance Assurance Corporation.  No other retrocessionaire accounted for more than 5% of our recoverables.\nLoss and LAE Reserves.\n   Gross loss and LAE reserves totaled $33.7 billion and $29.9 billion at September 30, 2025 and December 31, 2024, respectively.\nThe following tables summarize gross outstanding loss and LAE reserves by segment, classified by case reserves and Incurred But Not Reported (“IBNR”) reserves, for the periods indicated.\nAt September 30, 2025\n(Dollars in millions)\nCase\nReserves\nIBNR\nReserves\nTotal\nReserves\n% of\nTotal\nReinsurance\n$\n7,034 \n$\n15,227 \n$\n22,261 \n66.0 \n%\nInsurance\n2,648 \n7,414 \n10,062 \n29.8 \n%\nOther\n (1)\n394 \n1,025 \n1,419 \n4.2 \n%\nTotal\n$\n10,076 \n$\n23,666 \n$\n33,742 \n100.0 \n%\n(Some amounts may not reconcile due to rounding.)\n(1)  \nReserves for A&E exposures are included within Other. At September 30, 2025, A&E case and IBNR reserves totaled $156 million and $68 million, respectively. \nAt December 31, 2024\n(Dollars in millions)\nCase\nReserves\nIBNR\nReserves\nTotal\nReserves\n% of\nTotal\nReinsurance\n$\n6,591 \n$\n13,117 \n$\n19,708 \n65.9 \n%\nInsurance\n2,289 \n6,552 \n8,841 \n29.6 \n%\nOther\n (1)\n389 \n950 \n1,340 \n4.5 \n%\nTotal\n$\n9,270 \n$\n20,619 \n$\n29,889 \n100.0 \n%\n(Some amounts may not reconcile due to rounding.)\n(1)  \nReserves for A&E exposures are included within Other. At December 31, 2024, A&E case and IBNR reserves totaled $149 million and $111 million, respectively. \nChanges in premiums earned and business mix, reserve re-estimations, catastrophe losses and changes in catastrophe loss reserves and claim settlement activity all impact loss and LAE reserves by segment and in total.\nOur carried loss and LAE reserves represent management’s best estimate of our ultimate liability for unpaid claims.  We continuously re-evaluate our reserves, including re-estimates of prior period reserves, taking into consideration all available information and, in particular, newly reported loss and claim experience.  Changes in reserves resulting from such re-evaluations are reflected in incurred losses in the period when the re-evaluation is made.  Our analytical methods and processes operate at multiple levels, including individual contracts, groupings of like contracts, classes and lines of business, internal business units, segments, accident years, legal entities, and in the aggregate.  In order to set \n46\nTable of Contents\nappropriate reserves, we make qualitative and quantitative analyses and judgments at these various levels.  We utilize actuarial science, business expertise and management judgment in a manner intended to ensure the accuracy and consistency of our reserving practices.  Management’s best estimate is developed through collaboration with actuarial, underwriting, claims, legal and finance departments and culminates with the input of reserve committees. Each segment reserve committee includes the participation of the relevant parties from actuarial, finance, claims and segment senior management and has the responsibility for recommending and approving management’s best estimate.  Reserves are further reviewed by Everest’s Chief Reserving Actuary and senior management.  The objective of this process is to determine a single best estimate viewed by management to be the best estimate of its ultimate loss liability.   Nevertheless, our reserves are estimates and are subject to variation, which may be significant.  \nThere can be no assurance that reserves for, and losses from, claim obligations will not increase in the future, possibly by a material amount.  However, we believe that our existing reserves and reserving methodologies lessen the probability that any such increase would have a material adverse effect on our financial condition, results of operations or cash flows.  \nAsbestos and Environmental Exposures.\n   A&E exposures represent a separate exposure group for monitoring and evaluating reserve adequacy.  The results of run-off A&E exposures are included within the Company’s Other segment.  The following table summarizes the outstanding loss reserves with respect to A&E reserves on both a gross and net of retrocessions basis for the periods indicated.  \nAt\nSeptember 30,\nAt\nDecember 31,\n(Dollars in millions)\n2025\n2024\nGross reserves\n$\n224 \n$\n260 \nCeded reserves\n(17)\n(17)\nNet reserves\n$\n207 \n$\n242 \n(Some amounts may not reconcile due to rounding.)\nWith respect to asbestos only, at September 30, 2025, we had net asbestos loss reserves of $183 million, or 88.6%, of total net A&E reserves, all of which was for assumed business.  At September 30, 2025, we had gross asbestos loss reserves of $200 million, or 89.5% of total gross A&E reserves, all of which was for assumed business.\nUltimate loss projections for A&E liabilities cannot be accomplished using standard actuarial techniques.  We believe that our A&E reserves represent management’s best estimate of the ultimate liability; however, there can be no assurance that ultimate loss payments will not exceed such reserves, perhaps by a significant amount.  \nIndustry analysts use the “survival ratio” to compare the A&E reserves among companies with such liabilities.  The survival ratio is typically calculated by dividing a company’s current net reserves by the three-year average of annual paid losses.  Hence, the survival ratio equals the number of years that it would take to exhaust the current reserves if future loss payments were to continue at historical levels.  Using this measurement, our net three-year asbestos survival ratio was 5.5 years at September 30, 2025 and 6.6 years at December 31, 2024.  These metrics can be skewed by individual large settlements occurring in the prior three years and therefore may not be indicative of the timing of future payments.  \nLIQUIDITY AND CAPITAL RESOURCES \nCapital.\n Shareholders’ equity at September 30, 2025 and December 31, 2024 was $15.4 billion and $13.9 billion, respectively.  Management’s objective in managing capital is to ensure that the Company’s overall capital level, as well as the capital levels of its operating subsidiaries, exceed the amounts required by regulators, the amount needed to support our current financial strength ratings from rating agencies and our own economic capital models.  The Company’s capital has historically exceeded these benchmark levels.  \nOur two main operating companies, Everest Reinsurance (Bermuda) Ltd. (“Bermuda Re”) and Everest Reinsurance Company (“Everest Re”), are regulated by the Bermuda Monetary Authority and the State of Delaware’s Department of Insurance, respectively.  Both regulatory bodies have their own capital adequacy models based on statutory capital as opposed to GAAP basis equity.  Failure to meet the required statutory capital levels could result in various regulatory restrictions, including restrictions on business activity and the payment of dividends to their parent companies.  \n47\nTable of Contents\nThe regulatory targeted capital and the actual statutory capital for Bermuda Re and Everest Re were as follows:\nBermuda Re \n(1)\nEverest Re\n (2)\nAt December 31,\nAt December 31,\n(Dollars in millions)\n2024\n2023\n2024\n2023\nRegulatory targeted capital\n$\n3,151 \n$\n2,669 \n$\n4,799 \n$\n4,242 \nActual capital\n$\n4,323 \n$\n3,711 \n$\n8,126 \n$\n6,963 \n(1)   \nRegulatory targeted capital represents the target capital level from the applicable year's Bermuda Solvency Capital Requirement calculation.\n(2) \n Regulatory targeted capital represents 200% of the Risk Based Capital  authorized control level calculation for the applicable year. \nOur financial strength ratings, as determined by A.M. Best, S&P and Moody’s, are important, as they provide our customers and investors with an independent assessment of our financial strength using a rating scale that provides for relative comparisons.  We continue to possess significant financial flexibility and access to debt and equity markets as a result of our financial strength, as evidenced by the financial strength ratings assigned by independent rating agencies.  \nWe maintain our own economic capital models to monitor and project our overall capital, as well as the capital at our operating subsidiaries.  A key input to the economic models is projected income, and this input is continually compared to actual results, which may require a change in the capital strategy.   \nFor the nine months ended September 30, 2025, we repurchased 1,154,883 of our common shares at a cost of $400 million in the open market and paid $253 million in common share dividends to enhance long-term expected returns to our shareholders.  During fiscal year 2024, we repurchased 536,469 of our common shares at a cost of $200 million in the open market and paid $334 million in common share dividends.  From time to time, we may enter into a Rule 10b5-1 repurchase plan to facilitate the repurchase of shares, repurchase shares\n \nin open market transactions, privately negotiated transactions or otherwise. On November 7, 2024, our existing Board authorization to repurchase up to 32 million of our shares was increased by 10 million shares to authorize the repurchase of up to 42 million shares.  As of September 30, 2025, we had repurchased 32.5 million shares under this authorization.  During the third quarter of 2025, the Company’s Board of Directors declared a quarterly common stock dividend of $2.00 per share.  The common stock dividend was paid on September 19, 2025 for holders of record as of September 3, 2025.\nWe may continue, from time to time, to seek to retire portions of our outstanding debt securities through cash repurchases, in open-market purchases, privately negotiated transactions or otherwise. Such repurchases, if any, will be subject to and depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. The amounts involved in any such transactions, individually or in the aggregate, may be material.\nLiquidity.\n  Our liquidity requirements are generally met from positive cash flow from operations.  Positive cash flow results from reinsurance and insurance premiums being collected prior to disbursements for claims, with disbursements generally taking place over an extended period after the collection of premiums, sometimes a period of many years.  Collected premiums are generally invested, prior to their use in such disbursements, and investment income provides additional funding for loss payments.  Our net cash flows from operating activities were $3.5 billion and $4.2 billion for the nine months ended September 30, 2025 and 2024, respectively.  Additionally, these cash flows reflected net catastrophe loss payments of $654 million and $506 million for the nine months ended September 30, 2025 and 2024, respectively, and net tax payments of $98 million and $340 million for the nine months ended September 30, 2025 and 2024, respectively.  \nIf disbursements for losses and LAE, policy acquisition costs and other operating expenses were to exceed premium inflows, cash flow from reinsurance and insurance operations would be negative.  The effect on cash flow from insurance operations would be partially offset by cash flow from investment income. Additionally, cash inflows from investment maturities of both short-term investments and longer-term maturities are available to supplement other operating cash flows.  We do not expect to supplement negative insurance operations cash flows with investment dispositions.\nAs the timing of payments for losses and LAE cannot be predicted with certainty, we maintain portfolios of long-term invested assets with varying maturities, along with short-term investments that provide additional liquidity for payment of claims.  At September 30, 2025 and December 31, 2024, we held cash and short-term investments of $5.4 billion and $6.3 billion, respectively.  Our short-term investments are generally readily marketable and can be converted to cash.  In addition to these cash and short-term investments, at September 30, 2025, we had $1.4 billion of fixed maturity securities - available for sale maturing within one year or less, $10.6 billion maturing within one to five years and $8.6 billion maturing after five years. We believe that these fixed maturity securities, in conjunction with the short-term \n48\nTable of Contents\ninvestments and positive cash flow from operations, provide ample sources of liquidity for the expected payment of losses and LAE in the near future.  We do not anticipate selling a significant amount of securities to pay losses and LAE.  At September 30, 2025, we had $86 million of net pre-tax unrealized depreciation related to fixed maturity - available for sale securities, comprised of $708 million of pre-tax unrealized depreciation and $621 million of pre-tax unrealized appreciation.  \nManagement generally expects annual positive cash flow from operations.  However, given catastrophic events observed in recent periods, cash flow from operations may decline and could become negative in the near term as significant claim payments are made related to the catastrophes.  However, as indicated above, the Company has access to ample liquidity to settle its catastrophe claims and also may receive payments under the catastrophe bond program and the Mt. Logan Re collateralized reinsurance arrangement.\nIn addition to our cash flows from operations and liquid investments, Everest Re is a member of the Federal Home Loan Bank of New York (“FHLBNY”), which allows Everest Re to borrow up to 10% of its statutory admitted assets.  As of September 30, 2025, Everest Re had statutory admitted assets of approximately $33.0 billion which provides borrowing capacity of up to approximately $3.3 billion.  As of September 30, 2025, Everest Re had $1.0 billion of borrowings outstanding, which begin to expire in 2025. See Note 7 – Credit Facilities to the Notes to the consolidated financial statements in Part I, Item I of this Form 10-Q for further details. \nMarket Sensitive Instruments.  \nU.S. Securities and Exchange Commission (the “SEC”) Registrants are required to clarify and expand upon the existing financial statement disclosure requirements for derivative financial instruments, derivative commodity instruments and other financial instruments (collectively, “market sensitive instruments”).  We do not generally enter into market sensitive instruments for trading purposes.  \nOur current investment strategy seeks to maximize after-tax income through a high quality, diversified, fixed maturity portfolio, while maintaining an adequate level of liquidity.  Our mix of investments is adjusted periodically, consistent with our current and projected operating results and market conditions.  The fixed maturity securities in the investment portfolio are comprised of available for sale and held to maturity securities.  Additionally, we have invested in equity securities.\nThe overall investment strategy considers the scope of present and anticipated Company operations.  In particular, estimates of the financial impact resulting from non-investment asset and liability transactions, together with our capital structure and other factors, are used to develop a net liability analysis.  This analysis includes estimated payout characteristics for which our investments provide liquidity.  This analysis is considered in the development of specific investment strategies for asset allocation, duration and credit quality.  The change in overall market sensitive risk exposure principally reflects the asset changes that took place during the period.\nInterest Rate Risk.\n Our $45.8 billion cash and invested assets portfolio at September 30, 2025 is principally comprised of fixed maturity securities, which are generally subject to interest rate risk and some foreign currency exchange rate risk, and some equity securities, which are subject to price fluctuations and some foreign exchange rate risk.  The overall economic impact of the foreign exchange risks on the investment portfolio is partially mitigated by changes in the dollar value of foreign currency denominated liabilities and their associated income statement impact. \nInterest rate risk is the potential change in value of the fixed maturity securities portfolio from a change in market interest rates.  In a declining interest rate environment, interest rate risk includes prepayment risk on the $8.4 billion of mortgage-backed securities in the $34.5 billion fixed maturity portfolio.  Prepayment risk results from potential accelerated principal payments that shorten the average life, and thus, the expected yield of the security.  \nThe table below displays the potential impact of market value fluctuations and after-tax unrealized appreciation on our fixed maturity portfolio (including $3.9 billion of short-term investments) for the period indicated based on upward and downward parallel and immediate 100 and 200 basis point shifts in interest rates.  For legal entities with a U.S. dollar functional currency, this modeling was performed on each security individually.  To generate appropriate price estimates on mortgage-backed securities, changes in prepayment expectations under different interest rate environments were \n49\nTable of Contents\ntaken into account.  For legal entities with a non-U.S. dollar functional currency, the effective duration of the involved portfolio of securities was used as a proxy for the market value change under the various interest rate change scenarios.  \nImpact of Interest Rate Shift in Basis Points\nAt September 30, 2025\n-200\n-100\n0\n100\n200\n(Dollars in millions)\nTotal Fair Value\n$\n41,084\n$\n39,744\n$\n38,405\n$\n37,066\n$\n35,727\nFair Value Change from Base (%)\n7.0%\n3.5%\n—%\n(3.5)%\n(7.0)%\nChange in Unrealized Appreciation\nAfter-tax from Base ($)\n$\n2,169\n$\n1,085\n$\n—\n$\n(1,085)\n$\n(2,169)\nWe had $33.7 billion and $29.9 billion of gross reserves for losses and LAE as of September 30, 2025 and December 31, 2024, respectively.  These amounts are recorded at their nominal value, as opposed to present value, which would reflect a discount adjustment to reflect the time value of money.  Since losses are paid out over a period of time, the present value of the reserves is less than the nominal value.  As interest rates rise, the present value of the reserves decreases and, conversely, as interest rates decline, the present value increases.  These movements are similar to the interest rate impacts on the fair value of investments held.  While the difference between present value and nominal value is not reflected in our financial statements, our financial results will include investment income over time from the investment portfolio until the claims are paid.  Our loss and loss reserve obligations have an expected duration of approximately 4.0 years, which is reasonably consistent with our fixed income portfolio.  If we were to discount our loss and LAE reserves, net of ceded reserves, the discount would be approximately $5.1 billion resulting in a discounted reserve balance of approximately $25.1 billion, representing approximately 65.3% of the value of the fixed maturity investment portfolio funds.  \nForeign Currency Risk.\n Foreign currency risk is the potential change in value, income and cash flow arising from adverse changes in foreign currency exchange rates.  Each of our non-U.S./Bermuda operations maintains capital in the currency of the country of its geographic location consistent with local regulatory guidelines.  Our operating entities may conduct business in local currency, as well as the currency of other countries in which they operate.  The primary foreign currency exposures for these operations are the British Pound Sterling, the Canadian Dollar, the Euro and the Singapore Dollar.  We mitigate foreign exchange exposure by generally matching the currency and duration of our assets to our corresponding operating liabilities.  In accordance with GAAP guidance, the impact on the fair value of available for sale fixed maturities due to changes in foreign currency exchange rates, in relation to functional currency, is reflected as part of other comprehensive income.  Conversely, the impact of changes in foreign currency exchange rates, in relation to functional currency, on other assets and liabilities is reflected through net income as a component of other income (expense).  In addition, we translate the assets, liabilities and income of non-U.S. dollar functional currency legal entities to the U.S. dollar.  This translation amount is reported as a component of other comprehensive income."
}