{
  "source_file": "el-20250630.htm",
  "form_type": "10-K",
  "item1": "Item 1.  \nBusiness.\nThe Estée Lauder Companies Inc., founded in 1946 by Estée and Joseph Lauder, is one of the world’s leading manufacturers, marketers and sellers of quality skin care, makeup, fragrance and hair care products. We are a steward of over 20 luxury and prestige brands globally. Since the initial launch of the Estée Lauder brand in the United States, we have significantly expanded our consumer reach to approximately 150 countries and territories. We operate as a wholesaler, with our products sold in brick-and-mortar locations and on various e-commerce platforms, including those operated by department stores, duty-free retailers, specialty-multi retailers, online pure players, upscale perfumeries and pharmacies, and top-tier salons and spas. Additionally, we operate a direct-to-consumer business across freestanding stores, our brands' websites and third-party online platforms.\nIn February 2025, we embarked on “Beauty Reimagined,” a strategic vision which focuses on accelerating best-in-class consumer coverage, creating transformative innovation, boosting consumer-facing investments, fueling sustainable growth through bold efficiencies and reimagining the way we work.\nWe have been controlled by the Lauder family since the founding of our Company. Members of the Lauder family, some of whom are directors, executive officers and/or employees, beneficially own, directly or indirectly, as of August 13, 2025, shares of our Company's Class A Common Stock and Class B Common Stock having approximately 84% of the outstanding voting power of the Common Stock.\n2\nTable of Contents\nProducts \nSkin Care\n - Our broad range of skin care products address various skin care needs. These products include moisturizers, serums, cleansers, toners, eye care, body care, exfoliators, acne and oil correctors, facial masks and sun care products.\nMakeup\n - We offer an extensive array of makeup products across shades and colors. Our full array of makeup products includes foundations, powders, concealers and setting sprays, lipsticks, lip liners and lip glosses, and mascaras, eyeshadows and eyeliners. We also sell related items such as compacts, brushes and other makeup tools.\nFragrance\n - We offer a variety of fragrance products. The fragrances are sold in various forms, including parfum, eau de parfum, eau de toilette, eau de cologne, and body spray, as well as lotions, creams, powders, candles and soaps that are based on a particular fragrance.\nHair Care\n - Our hair care products include shampoos, conditioners, styling products, treatment, finishing sprays and hair color products.\nOther\n - The other category includes royalty revenue from our licensing of the TOM FORD trademark to third parties since our fiscal 2023 acquisition of the TOM FORD brand as well as sales from ancillary products and services that do not fit within the definitions of skin care, makeup, fragrance, and hair care. \n3\nTable of Contents\nOur Brands\nGiven the personal nature of our products and the wide array of consumer preferences and tastes, as well as competition for the attention of consumers, our strategy has been to market and promote our products through distinctive brands seeking to address broad preferences and tastes. Each brand has a single global image that is promoted with consistent logos, packaging and advertising designed to enhance its image and differentiate it from other brands in the market. Beauty brands are differentiated by numerous factors, including quality, performance, a particular lifestyle, where they are distributed (e.g., prestige or mass) and price point. Below is a chart showing brands we sell and how we view them based on lifestyle and price point:\n \n4\nTable of Contents\n \nEstée Lauder brand products, which have been sold since 1946, have a reputation for innovation, sophistication and superior quality. Estée Lauder is one of the world’s most renowned beauty brands, producing iconic skin care, makeup and fragrances.\n \nWe pioneered the marketing of prestige men’s fragrance, grooming and skin care products with the introduction of Aramis products in 1964.\n \nIntroduced in 1968, Clinique skin care and makeup products are all allergy tested and 100% fragrance free and have been designed to address individual skin types and needs. Clinique also offers select fragrances. The skin care and makeup products are based on the research and related expertise of leading dermatologists.\n \nLab Series, introduced in 1987, is a series of high performance, specialized skin care solutions uniquely created to improve the look and feel of men’s skin.\n \nIntroduced in 1990, Origins is known for high-performance natural skin care that is “powered by nature and proven by science” and also sells fragrance products. Origins has a license agreement to develop and sell beauty products using the name of Dr. Andrew Weil.\n \nM·A·C, the leading brand of professional cosmetics, was created in Toronto, Canada. After having acquired a majority interest in 1994, we completed our acquisition of M·A·C in 1998. The brand’s popularity has grown through a tradition of word-of-mouth endorsement from professional makeup artists, models, photographers and journalists around the world.\n \nAcquired in 1995, Bobbi Brown Cosmetics is a global prestige beauty brand known for its high quality and undertone-correct makeup and skin care products that celebrate individual beauty and confidence. Reflecting its artistry roots, the brand is focused on creating a teaching and learning community of women around the world.\n5\nTable of Contents\n \nAcquired in 1995, La Mer is a leading global luxury skin care brand that is available in limited distribution worldwide. The brand is known for its iconic Crème de la Mer moisturizer, serums and lotions, as well as other skin care and foundation products that are created around the original “Miracle Broth.”\n \n \n \nAcquired in 1997, Aveda sells high-performance, naturally-derived hair care products, as well as skin care, makeup and fragrance. The brand is known for its innovative plant-based products and its commitment to environmental sustainability and corporate responsibility. It is distributed primarily through top-tier hair salons and direct-to-consumer, via online and Aveda stores.\n \nAcquired in 1999, Jo Malone London is a scented British lifestyle brand with understated elegance, offering enchanted story-telling and “High-Touch” boutique services. The brand’s famous colognes are perfect alone or artfully layered. Jo Malone London embodies the spirit of gifting generosity and inspires emotional elevation.\n \nAcquired a majority interest in 2000 (and the remaining interest in 2006), Bumble and bumble is a New York-based hair care brand that creates high-quality hair care and styling products. The brand is distributed primarily through top-tier salons, including Bumble and bumble’s own flagship salons, specialty-multi retailers and online.\n \nAcquired in 2003, Darphin is a Paris-based, prestige skin care brand known for its high-performance botanical skin care. The brand is distributed primarily through high-end independent pharmacies and online brand and retailer channels.\n \nIn 2005, we entered into a license agreement under the TOM FORD brand name and developed, manufactured and distributed luxury fragrances and beauty products. In fiscal 2023, we acquired the TOM FORD brand and related intellectual property. The TOM FORD brand is a luxury brand created in 2005, encompassing fashion, fragrance, eyewear and other accessories. As the current owner and steward of the brand, we are continuing with the beauty products and have licensed the fashion brand and operations and eyewear to third parties. Consistent with the fashion brand, our products exude seductive modern-day glamour and include luxury fragrance, color cosmetics, men’s grooming products and skin care products for discerning consumers globally.\n \nAcquired in 2010, Smashbox Cosmetics is a Los Angeles-based, photo studio-inspired makeup brand with high performance products created for our consumers' everyday life in the spotlight.\n6\nTable of Contents\n \nLaunched in 2012, AERIN is a luxury lifestyle beauty and fragrance brand inspired by the signature style of its founder, Aerin Lauder.\n \nAcquired in 2014, Le Labo is a sensory and experiential lifestyle brand, deeply rooted in the craft of slow perfumery. Born in Grasse, France and raised in downtown NYC, it offers hand-crafted and personalized fragrances, as well as ‘alternative’ and genuine experiences celebrating craftsmanship.\n \nAcquired in 2015, Les Editions de Parfums Frédéric Malle is a collection of exclusive, sophisticated, ultraluxury fragrances crafted by some of the world’s most talented perfumers and published by the brand.\n \nAcquired in 2015, GLAMGLOW started as a behind-the-scenes Hollywood secret to instant glow. The brand is known for bold, sensorial products that deliver instant results, and its unconventional philosophy that high performance skin care should also be fun and sexy.\n \nAcquired in 2016, KILIAN PARIS is a prestige fragrance brand that embodies timeless sophistication and modern luxury.\n \nAcquired in 2016, Too Faced is a serious makeup brand that knows how to have fun. The brand is unabashedly pink, pretty and feminine with a playful wink that is beloved for its high-quality formulas, cheeky product names and distinctive packaging.\nAcquired in 2019, Dr.Jart+ is a Seoul-based, global skin care brand known for its innovative formulations and unique combination of dermatological science and art. \n \n \nAfter increasing our investment to 76% in 2021, we purchased the remaining interest in the Deciem Beauty Group Inc. (\"DECIEM\") in 2024. Known as “The Abnormal Beauty Company,” DECIEM is a Toronto-based, vertically integrated multi-brand beauty company rooted in a consumer-focused and functional approach. Its portfolio includes The Ordinary, an ingredient-focused brand, and NIOD, a science-driven skin care brand.\nBALMAIN Beauty was established in 2022 through a license from the fashion house Balmain Paris “to celebrate all the beauties of the world, no exceptions.” Building upon an exceptional fashion and fragrance legacy, BALMAIN Beauty launched its first fragrances in fiscal 2025.\n7\nTable of Contents\nFrom time to time, we also make minority investments in companies, mainly in the beauty industry, including through our New Incubation Ventures, the strategic early-stage investment and incubation arm of our Company. In some cases, we have acquired the remaining interests (e.g., Have & Be Co. Ltd. (i.e. Dr.Jart+) and DECIEM). We have several minority investments including a company based in India that manufactures, markets and sells Ayurvedic skin care and other products under the Forest Essentials brand name, primarily in India.\nOur “Luxury Brands” are La Mer, Jo Malone London, TOM FORD, AERIN Beauty, Le Labo, Editions de Parfums Frédéric Malle, KILIAN PARIS and BALMAIN Beauty. Our luxury portfolio also includes Estée Lauder's Re-Nutriv product franchise. Our “Large Brands” are Estée Lauder, La Mer, Clinique and M·A·C. Our “Scaling Brands” are Jo Malone London, TOM FORD, The Ordinary, Aveda, and Bobbi Brown Cosmetics. Our “Developing Brands” are Le Labo, Too Faced, Dr.Jart+, Origins, KILIAN PARIS, Bumble and bumble, Editions de Parfums Frédéric Malle, Smashbox, Darphin Paris, Lab Series, AERIN Beauty, NIOD, Aramis, BALMAIN Beauty and GLAMGLOW. \nSocial Impact and Sustainability\nWe continue to integrate social impact and sustainability into our strategy and business operations. Our social impact and sustainability initiatives help drive innovation, growth and efficiency across the business and within our brand portfolio. These initiatives also aim to foster employee engagement and build consumer trust and loyalty.\nAreas of focus include climate and energy; packaging; sourcing; green chemistry and ingredient transparency; inclusion; employee health and safety; and social investments. We have set goals or made commitments within these focus areas. For example, our goals related to climate and energy support efficiency and conservation within our facilities, internal supply chain and value chain. Certain goals are also intended to help us reduce cost and waste. \nThe Nominating and ESG Committee of our Board of Directors has oversight responsibility for our Company’s environmental, social and governance (“ESG”) activities and practices, including citizenship and sustainability matters. Our social impact and sustainability efforts are led by our President and Chief Executive Officer. Other members of senior management, along with employees across the organization, help to drive our strategic initiatives concerning social impact and sustainability.\nAdditional information related to our social impact and sustainability matters can be found at \nwww.elcompanies.com\n.\nDistribution\nWe operate as a wholesaler, with our products sold in brick-and-mortar locations and on various e-commerce platforms, including those operated by department stores, duty-free retailers, specialty-multi retailers, online pure players, upscale perfumeries and pharmacies, and top-tier salons and spas. Additionally, we operate a direct-to-consumer business across freestanding stores, our brands' websites and third-party online platforms. Our general practice is to accept returns of our products from customers if properly requested and approved.\nOur online sites, including our brand.com sites as well as those operated by authorized retailers and through third-party online platforms are in approximately 50 countries, with a majority of these online sales generated in mainland China, the United States and the United Kingdom. During fiscal 2025, we closed freestanding stores in underperforming areas of our business and opened new freestanding stores where growth opportunities existed. We operated approximately 1,600 freestanding stores as of June 30, 2025. Most freestanding stores are operated by us under a single brand name, such as M·A·C, Jo Malone London and Le Labo. Over 300 of the freestanding stores are multi-branded company stores, primarily in outlet malls. \nWe maintain dedicated sales teams that manage our retail accounts. We have wholly-owned operations in over 50 countries through which we market, sell and distribute our products. In certain countries, we sell our products through carefully selected distributors who we believe share our commitment to protecting the image and position of our brands. For information regarding our net sales by geographic region, see \nItem 8. Financial Statements and Supplementary Data – Note 15 – Revenue Recognition.\n8\nTable of Contents\nAs we have done historically, we continue to develop our strategy, assess performance and allocate resources by product category and will continue to report results by product category. To enhance accountability and streamline operations within the organization, as well as to align with our recently announced leadership changes, we have reorganized our geographic regions. Beginning with the fiscal 2026 first quarter, we will be reporting our fiscal 2026 and comparative fiscal 2025 results by geographic region under the new regional structure. Our four new geographic regions are: \n•\nThe Americas, which will continue to include North America and Latin America; \n•\nEurope, the United Kingdom and Ireland and Emerging Markets (\"EUKEM\"), which will continue to include the geographic markets of our previously reported Europe, the Middle East & Africa region, will exclude our global travel retail business, and will include our Southeast Asian Emerging Markets, previously reported in our Asia/Pacific region, of Indonesia, Malaysia, the Philippines, Thailand and Vietnam; \n•\nAsia/Pacific, which will continue to include certain geographic markets of our previously reported Asia/Pacific region, such as Japan, Korea, Hong Kong SAR, and Australia, among others, and will also include our global travel retail business, previously reported in our Europe, the Middle East & Africa region; and \n•\nMainland China, previously reported in our Asia/Pacific region, will now be reported as a separate region. \nOur “Emerging Markets” in The Americas are Argentina, Brazil, Chile, Colombia, Mexico, Panama and Peru and in our reorganized region of EUKEM are Central Europe, India, Indonesia, Israel, Kazakhstan, Malaysia, the Middle East, the Philippines, Russia, South Africa, Thailand, Turkey and Vietnam. \nOur “Priority Emerging Markets” in The Americas are Brazil and Mexico and in EUKEM are India, Indonesia, Malaysia, the Middle East, the Philippines, South Africa, Thailand, Turkey and Vietnam.\nOur references to North America within this document include the United States and Canada.\nCustomers\nOur strategy is to build strong relationships globally with select retailers, and our senior management works with executives of our major retail accounts on a regular basis in support of these relationships. We believe we are viewed as an important supplier to these customers. In addition, we connect with our consumers directly through freestanding stores, e-commerce sites and social media to build a robust omnichannel experience that allows consumers to shop in these and other channels.  \nMarketing\nOur strategy to market and promote our products begins with our well-diversified portfolio of distinctive brands across four major product categories. Our portfolio can be deployed in multiple distribution channels, key travel corridors and geographies and we continue to expand our consumer coverage by entering high-growth, consumer-preferred channels, markets, media and price tiers where our global reputation and awareness of our brands benefit us. By putting the consumer at the center of every engagement and leveraging our geographic and distribution channel diversity, we offer strong consumer coverage which allows us to reach and engage local consumers across an array of developed and emerging markets by emphasizing products and services with local relevance, inclusiveness and appeal. This strategy is built around “Bringing the Best to Everyone We Touch.” Our founder, Mrs. Estée Lauder, formulated this unique marketing philosophy to provide “High-Touch” service and high-quality products as the foundation for a solid and loyal consumer base. Our “High-Touch” approach is demonstrated through our integrated consumer engagement models that leverage our product specialists and technology to provide the consumer with a distinct and truly personalized experience. As our business has grown and channel mix has evolved, we have further expanded our marketing philosophy and “High-Touch” execution to build both online and offline personalized consumer experiences through digital and physical demonstration, targeted digital media and tailored trial-to-loyalty pathways. We plan to continue to leverage our core strengths, including the quality of our products, our “High-Touch” consumer engagement and a diversified portfolio of brands, channels and geographies. \n9\nTable of Contents\nOur marketing strategies vary by brand, local market and distribution channel. We have a diverse portfolio of brands, and we employ different engagement models suited to each brand’s equity, distribution, product focus, understanding of the core consumer and local relevance. This enables us to elevate the consumer experience as we attract new consumers, create trial, build loyalty, drive consumer advocacy and address the transformation of consumer shopping behaviors. Hero products are at the core of our brand marketing strategies. They are the pillars of our brands and historically have provided strong results through high repeat sales and consumer loyalty. In addition to continuing to attract existing consumers, our hero products provide an opportunity for new consumers to be introduced to our desirable products, creating consumer traffic across all channels of distribution. We aim to further strengthen our hero products, and create new ones, through continuous review of our product portfolio and transformative innovation that delivers fast-to-market, trend-driven products across prestige price tiers focused on in-demand subcategories, benefits, and occasions. Our marketing planning approach focuses on effective and impactful visible advertising spending, optimizing marketing programs, and eliminating low-return activities to accelerate new consumer acquisition. To that end, we also leverage local insights to optimize allocation of resources across different media outlets and retail touch points to resonate with our most discerning consumers most effectively. This includes strategically deploying our brands and tailoring product assortments and communications to fit local tastes and preferences in cities and neighborhoods, and also using these insights to develop new ways to innovate, engage consumers, build brand equity and sell products. For a number of products, we create and deploy 360° integrated consumer engagement programs. We build brand equity and drive traffic to retail locations and to our own and authorized retailers’ websites including through digital and social media, broad reach advertising, such as billboards in cities and airports, television and email. In addition, we seek editorial coverage for our brands and products in digital and social media and print, to drive influencer amplification.\nWe continue to focus on increasing our brand awareness and sales through our strategic emphasis on technology, by expanding our digital and omnichannel presence, including social media and influencer marketing. Our ongoing investments in new analytical capabilities enable us to create more personalized experiences across our distribution channels. We also anticipate and monitor emerging platforms, balancing speed to market with brand protection to ensure readiness while safeguarding brand equity. We continue to innovate to better meet consumer online shopping preferences (e.g., how-to videos, ratings and reviews and mobile phone and tablet applications), support e-commerce businesses via digital and social marketing activities designed to build brand equity and “High-Touch” consumer engagement, in order to continue to offer better experiences and services and set the standard for prestige beauty shopping online. We also support our authorized retailers to strengthen their e-commerce businesses and drive sales of our brands on their websites. \nWe are leveraging artificial intelligence (“AI”) across the marketing value chain to enhance personalization at scale, increase speed to market and reduce costs. As examples, we are using AI to identify insights to inform consumer-centric campaigns, develop and test concepts, and produce creative content. \nPromotional activities, in-store displays, and online navigation are designed to attract new consumers, build demand and loyalty and introduce existing consumers to other product offerings from the respective brands. Our marketing efforts also benefit from cooperative advertising programs with some retailers, some of which are supported by coordinated promotions, such as sampling programs, including purchase with purchase and gift with purchase. Sampling is a key promotional activity as the quality and perceived benefits of sample products are very effective inducements to purchases by new and existing consumers. Such activities attract consumers and keep existing consumers engaged. Our marketing and sales executives spend considerable time in the field meeting with consumers, retailers, beauty advisors and makeup artists at the points of sale to enable us to offer a seamless experience across channels of distribution.\nAs consumer behaviors, digital-first consumer journeys and e-commerce evolve, we adjust our direct-to-consumer business models and consumer engagement programs. These models and programs are designed to provide distinct one-to-one and one-to-many “High-Touch” omnichannel services and personalized experiences by leveraging technology and our talented beauty advisors, consultants, and makeup artists.\nInformation Technology\nInformation technology, including operational technology and our websites, is a key enabler of all aspects of our business, from research and development, product development, production and distribution, to marketing, sales and order processing, consumer experiences as well as finance and human resources. We continue to make strategic investments to align with our long-term strategy and to maintain and enhance our information technology and cybersecurity infrastructure. We are focused on optimizing adoption of such investments to maximize return on investment and realized value. The modernization and simplification of our technology ecosystem remains a key focus, as we increasingly leverage the benefits of the cloud. \n10\nTable of Contents\nWe recognize technology presents opportunities for competitive advantage, and we continue to invest in new capabilities and the use of emerging technologies, including investments in AI, across various aspects of our business. As an example, this includes the strategic utilization of data to provide better visibility into consumer trends, to increase responsiveness in our product development. \nResearch and Development\nWe believe we are an industry leader in the development of new products, and strive to deliver breakthrough, on-trend and commercial innovation to consumers around the world. Our research and development group, which includes scientists, engineers, analysts, and other employees involved in product and packaging innovation, works closely with our marketing and product development teams, as well as external partners in certain cases, to generate new technologies, design new testing methods, identify new materials, develop new products and product-line extensions, create new packaging concepts, and improve, redesign or reformulate existing products. In addition, these research and development personnel provide ongoing technical assistance and know-how to quality assurance and manufacturing personnel on a worldwide basis, to ensure consistent global standards for our products and to deliver environmentally responsible products that meet or exceed consumer expectations. The research and development group has research-based working relationships with several U.S. and international dermatology and medical institutions, research universities and educational facilities, which supplement internal capabilities. Members of the research and development group are also responsible for product safety, registration and regulatory compliance matters. \nOur research and development costs totaled $316 million, $360 million and $344 million in fiscal 2025, 2024 and 2023, respectively, and are expensed as incurred. As of June 30, 2025, we had approximately 1,100 employees engaged in research and development activities. We maintain research and development programs at certain of our principal facilities and facilities dedicated to performing research and development, see",
  "item7": "Item 7.  \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nRESULTS OF OPERATIONS\nWe manufacture, market and sell beauty products including those in the skin care, makeup, fragrance and hair care categories, which are distributed in approximately 150 countries and territories. \nYear Ended June 30,\n2025\n2024\n2023\n($ in millions)\n$\n%\n$\n%\n$\n%\nNet sales\n$\n14,326 \n100.0 \n%\n$\n15,608 \n100.0 \n%\n$\n15,910 \n100.0 \n%\nCost of sales\n3,729 \n26.0 \n4,424 \n28.3 \n4,564 \n28.7 \nGross profit\n10,597 \n74.0 \n11,184 \n71.7 \n11,346 \n71.3 \nOperating expenses:\nSelling, general and administrative\n9,456 \n66.0 \n9,621 \n61.6 \n9,575 \n60.2 \nRestructuring and other charges\n481 \n3.4 \n122 \n0.8 \n55 \n0.3 \nGoodwill impairment\n13 \n0.1 \n291 \n1.9 \n— \n— \nImpairment of other intangible assets\n1,273 \n8.9 \n180 \n1.2 \n207 \n1.3 \nTalcum litigation settlement agreements\n159 \n1.1 \n— \n— \n— \n— \nTotal operating expenses\n11,382 \n79.4 \n10,214 \n65.4 \n9,837 \n61.8 \nOperating (loss) income\n(785)\n(5.5)\n970 \n6.2 \n1,509 \n9.5 \nInterest expense\n357 \n2.5 \n378 \n2.4 \n255 \n1.6 \nInterest income and investment income, net\n114 \n0.8 \n167 \n1.1 \n131 \n0.8 \nOther components of net periodic benefit cost\n12 \n0.1 \n(13)\n(0.1)\n(12)\n(0.1)\n(Loss) earnings before income taxes\n(1,040)\n(7.3)\n772 \n4.9 \n1,397 \n8.8 \nProvision for income taxes\n93 \n0.6 \n363 \n2.3 \n387 \n2.4 \nNet (loss) earnings\n(1,133)\n(7.9)\n409 \n2.6 \n1,010 \n6.3 \nNet earnings attributable to redeemable noncontrolling interest\n— \n— \n(19)\n(0.1)\n(4)\n— \nNet (loss) earnings attributable to The Estée Lauder Companies Inc.\n$\n(1,133)\n(7.9)\n%\n$\n390 \n2.5 \n%\n$\n1,006 \n6.3 \n%\nPercentages not adjusted for differences caused by rounding\n29\nTable of Contents\nThe following table is a comparative summary of operating results for fiscal 2025, 2024 and 2023, for our product categories and geographic regions and reflects the basis of presentation described in",
  "item2": null
}