{
  "source_file": "el-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n in our Annual Report on Form 10-K for the fiscal year ended June 30, 2025. Since June 30, 2025, there have been no significant changes to the assumptions and estimates related to our critical accounting policies.\nRECENTLY ISSUED ACCOUNTING STANDARDS\nFor a discussion regarding the impact of accounting standards that were recently issued but not yet effective, on our consolidated financial statements, see \nNotes to Consolidated Financial Statements, Note 1 –\n \nSummary of Significant Accounting Policies\n.\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING INFORMATION\nWe and our representatives from time to time make written or oral forward-looking statements, including in this and other filings with the Securities and Exchange Commission, in our press releases and in our reports to stockholders, which may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements may address our expectations regarding sales, earnings or other future financial performance and liquidity, other performance measures, product introductions, entry into new geographic regions, information technology initiatives, new methods of sale, our long-term strategy, restructuring and other charges and resulting cost savings, and future operations or operating results. These statements may contain words like “expect,” “will,” “will likely result,” “would,” “believe,” “estimate,” “planned,” “plans,” “intends,” “may,” “should,” “could,” “anticipate,” “estimate,” “project,” “projected,” “forecast,” and “forecasted” or similar expressions. Although we believe that our expectations are based on reasonable assumptions within the bounds of our knowledge of our business and operations, actual results may differ materially from our expectations. Factors that could cause actual results to differ from expectations include, without limitation:\n(1)\nincreased competitive activity from companies in the skin care, makeup, fragrance and hair care businesses;\n(2)\nour ability to develop, produce and market new products on which future operating results may depend and to successfully address challenges in our business;\n(3)\nconsolidations, restructurings, bankruptcies and reorganizations in the retail industry causing a decrease in the number of stores that sell our products, an increase in the ownership concentration within the retail industry, ownership of retailers by our competitors or ownership of competitors by our customers that are retailers and our inability to collect receivables;\n(4)\ndestocking and tighter working capital management by retailers;\n53\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\n(5)\nthe success, or changes in timing or scope, of new product launches and the success, or changes in timing or scope, of advertising, sampling and merchandising programs;\n(6)\nshifts in the preferences of consumers as to how they perceive value and where and how they shop;\n(7)\nsocial, political and economic risks to our foreign or domestic manufacturing, distribution and retail operations, including changes in foreign investment and trade policies and regulations of the host countries and of the United States;\n(8)\nchanges in the laws, regulations and policies (including the interpretations and enforcement thereof) that affect, or will affect, our business, including those relating to our products or distribution networks, changes in accounting standards, tax laws and regulations, environmental or climate change laws, regulations or accords, trade rules and customs regulations, and the outcome and expense of legal or regulatory proceedings, and any action we may take as a result;\n(9)\nforeign currency fluctuations affecting our results of operations and the value of our foreign assets, the relative prices at which we and our foreign competitors sell products in the same markets and our operating and manufacturing costs outside of the United States;\n(10)\nchanges in global or local conditions, including those due to volatility in the global credit and equity markets, government economic policies, natural or man-made disasters, real or perceived epidemics, supply chain challenges, inflation, or increased energy costs, that could affect consumer purchasing, the willingness or ability of consumers to travel and/or purchase our products while traveling, the financial strength of our customers, suppliers or other contract counterparties, our operations, the cost and availability of capital which we may need for new equipment, facilities or acquisitions, the returns that we are able to generate on our pension assets and the resulting impact on funding obligations, the cost and availability of raw materials and the assumptions underlying our critical accounting estimates;\n(11)\nshipment delays, commodity pricing, depletion of inventory and increased production costs resulting from disruptions of operations at any of the facilities that manufacture our products or at our distribution or inventory centers, including disruptions that may be caused by the implementation of information technology initiatives, or by restructurings;\n(12)\nreal estate rates and availability, which may affect our ability to increase or maintain the number of retail locations at which we sell our products and the costs associated with our other facilities;\n(13)\nchanges in product mix to products which are less profitable;\n(14)\nour ability to acquire, develop or implement new information technology, including operational technology and websites, on a timely basis and within our cost estimates; to maintain continuous operations of our new and existing information technology; and to secure the data and other information that may be stored in such technologies or other systems or media;\n(15)\nour ability to capitalize on opportunities for improved efficiency, such as publicly-announced strategies and restructuring and cost-savings initiatives, and to integrate acquired businesses and realize value therefrom;\n(16)\nconsequences attributable to local or international conflicts around the world, as well as from any terrorist action, retaliation and the threat of further action or retaliation;\n(17)\nthe timing and impact of acquisitions, investments and divestitures; and\n(18)\nadditional factors as described in our filings with the Securities and Exchange Commission, including the Annual Report on Form 10-K for the fiscal year ended June 30, 2025.\nWe assume no responsibility to update forward-looking statements made herein or otherwise.\nItem 3. \nQuantitative and Qualitative Disclosures About Market Risk.\nThe information required by this item is set forth in Item 2 of this Quarterly Report on Form 10-Q under the caption \nLiquidity and Capital Resources\n - \nMarket Risk\n and is incorporated herein by reference.\n54\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nItem 4. \nControls and Procedures.\nOur disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”)) are designed to ensure that information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission and to ensure that information required to be disclosed is accumulated and communicated to management, including our principal executive and financial officers, to allow timely decisions regarding disclosure. The Chief Executive Officer and the Chief Financial Officer, with assistance from other members of management, have reviewed the effectiveness of our disclosure controls and procedures as of September 30, 2025 and, based on their evaluation, have concluded that the disclosure controls and procedures were effective as of such date.\nAs part of our review of internal control over financial reporting, we make changes to systems and processes to improve such controls and increase efficiencies, while ensuring that we maintain an effective internal control environment. There have been no changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) that occurred during the first quarter of fiscal 2026 that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nPART II. OTHER INFORMATION\nItem 1. \nLegal Proceedings.\nFor a discussion of legal proceedings, see \nNotes to Consolidated Financial Statements, Note 8 – Commitments and Contingencies\n.\nItem 2. \nUnregistered Sales of Equity Securities and Use of Proceeds.\nShare Repurchase Program\nWe are authorized by the Board of Directors to repurchase shares of our Class A Common Stock in the open market or in privately negotiated transactions, depending on market conditions and other factors. The following table provides information relating to our repurchase of Class A Common Stock during the referenced periods:\nPeriod\nTotal Number\nof Shares\nPurchased\n(1)\nAverage Price\nPaid Per\nShare\nTotal Number of\nShares Purchased as\nPart of Publicly\nAnnounced\nProgram\nMaximum\nNumber of Shares\nthat May Yet Be\nPurchased Under\nthe Program\n(2)\nJuly 2025\n—\n$\n— \n—\n25,073,242\nAugust 2025\n7,940\n91.38 \n—\n25,073,242\nSeptember 2025\n91,405\n90.10 \n—\n25,073,242\n99,345\n90.20 \n—\n(1)\nReflects shares that were repurchased by the Company to satisfy tax withholding obligations upon the payout of certain stock-based compensation arrangements.\n(2)\nThe Board of Directors has authorized the current repurchase program for up to 256.0 million shares. The total amount was last increased by the Board on October 31, 2018. Our repurchase program does not have an expiration date.\nBeginning in December 2022, we suspended the repurchase of shares of our Class A Common Stock under our publicly announced program. We may resume repurchases in the future.\n55\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nItem 5. Other Information.\nTrading Arrangements\nDuring the fiscal 2026 first quarter, none of the Company’s directors or officers (as defined in Rule 16a-1(f) under the Exchange Act) \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or a “non-Rule 10b5-1 trading arrangement,” each as defined in Item 408(a) of Regulation S-K under the Exchange Act.\nItem 6. \nExhibits.\nExhibit \nNumber\nDescription\n31.1\nCertification pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (CEO).\n31.2\nCertification pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (CFO).\n32.1\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (CEO). (furnished)\n32.2\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (CFO). (furnished)\n101.1\nThe following materials from The Estée Lauder Companies Inc.’s Quarterly Report on Form 10-Q for the quarterly period ended September 30, 2025 are formatted in iXBRL (Inline eXtensible Business Reporting Language): (i) the Consolidated Statements of Earnings (Loss), (ii) the Consolidated Statements of Comprehensive Income (Loss), (iii) the Consolidated Balance Sheets, (iv) the Consolidated Statements of Cash Flows and (v) Notes to Consolidated Financial Statements\n104\nThe cover page from The Estée Lauder Companies Inc.’s Quarterly Report on Form 10-Q for the quarterly period ended September 30, 2025 is formatted in iXBRL\n56\nTable of Contents\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nTHE ESTÉE LAUDER COMPANIES INC.\nBy:\n/s/ AKHIL SHRIVASTAVA\nDate: October 30, 2025\nAkhil Shrivastava\nExecutive Vice President and Chief Financial Officer\n(Principal Financial and Accounting Officer)\n57",
  "item2": "Item 2. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nRESULTS OF OPERATIONS\nThe Estée Lauder Companies Inc. is one of the world’s leading manufacturers, marketers and sellers of quality skin care, makeup, fragrance and hair care products. We are a steward of over 20 luxury and prestige brands globally. Our products are sold in approximately 150 countries and territories. We operate as a wholesaler, with our products sold in brick-and-mortar locations and on various e-commerce platforms, including those operated by department stores, duty-free retailers, specialty-multi retailers, online pure players, upscale perfumeries and pharmacies, and top-tier salons and spas. Additionally, we operate a direct-to-consumer business across freestanding stores, our brands' websites and third-party online platforms.\nThree Months Ended\nSeptember 30,\n2025\n2024\n($ in millions)\n$\n%\n$\n%\nNet sales\n$\n3,481 \n100.0 \n%\n$\n3,361 \n100.0 \n%\nCost of sales\n927 \n26.6 \n928 \n27.6 \nGross profit\n2,554 \n73.4 \n2,433 \n72.4 \nOperating expenses:\nSelling, general and administrative\n2,296 \n66.0 \n2,298 \n68.4 \nRestructuring and other charges\n89 \n2.6 \n97 \n2.9 \nTalcum litigation settlement agreements\n— \n— \n159 \n4.7 \nTotal operating expenses\n2,385 \n68.5 \n2,554 \n76.0 \nOperating income (loss)\n169 \n4.9 \n(121)\n(3.6)\nInterest expense\n86 \n2.5 \n92 \n2.7 \nInterest income and investment income, net\n30 \n0.9 \n35 \n1.0 \nOther components of net periodic benefit cost\n4 \n0.1 \n2 \n0.1 \nEarnings (loss) before income taxes\n109 \n3.1 \n(180)\n(5.4)\nProvision (benefit) for income taxes\n62 \n1.8 \n(24)\n(0.7)\nNet earnings (loss)\n$\n47 \n1.4 \n%\n$\n(156)\n(4.6)\n%\nNot adjusted for differences caused by rounding\n33\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nThe following table is a comparative summary of operating results for the three months ended September 30, 2025 and 2024, for our product categories and geographic regions and reflects the basis of presentation described in \nNotes to Consolidated Financial Statements, Note 1 – Summary of Significant Accounting Policies\n and \nNote 13 – Segment Data\n and \nRelated Information\n, for our product categories that meet the definition of reportable segments, for all periods presented. Royalty revenue from license arrangements, and products and services that do not fit within our definitions of skin care, makeup, fragrance and hair care have been included in the “other” category.\nThree Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nNET SALES\nBy Product Category:\nSkin Care\n$\n1,575 \n$\n1,529 \nMakeup\n1,030 \n1,038 \nFragrance\n721 \n630 \nHair Care\n129 \n139 \nOther\n25 \n25 \n3,480 \n3,361 \nReturns associated with restructuring and other activities\n1 \n— \nNet sales\n$\n3,481 \n$\n3,361 \nBy Geographic Region\n(1)\n:\nThe Americas\n$\n1,174 \n$\n1,197 \nEurope, United Kingdom and Ireland and Emerging Markets (\"EUKEM\")\n901 \n868 \nAsia/Pacific\n873 \n806 \nMainland China\n532 \n490 \n3,480 \n3,361 \nReturns associated with restructuring and other activities\n1 \n— \nNet sales\n$\n3,481 \n$\n3,361 \nOPERATING INCOME (LOSS)\nBy Product Category:\nSkin Care\n$\n187 \n$\n117 \nMakeup\n(15)\n(185)\nFragrance\n86 \n60 \nHair Care\n(12)\n(18)\nOther\n9 \n11 \n255 \n(15)\nCharges associated with restructuring and other activities\n(86)\n(106)\nOperating income (loss)\n$\n169 \n$\n(121)\nBy Geographic Region\n(1)(2)\n:\nThe Americas\n$\n87 \n$\n(85)\nEUKEM\n6 \n10 \nAsia/Pacific\n150 \n76 \nMainland China\n12 \n(16)\n255 \n(15)\nCharges associated with restructuring and other activities\n(86)\n(106)\nOperating income (loss)\n$\n169 \n$\n(121)\n(1)\n The net sales and operating results from the Company’s travel retail business are included in the Asia/Pacific region. \n(2)\n Operating results by geographic region for the fiscal 2025 first quarter have been adjusted to reflect the correction of a regional misclassification in the amounts furnished in the Form 8-K on October 2, 2025 related to a one-time charge during the fiscal 2025 first quarter. The misclassification was offset in the fiscal 2025 second quarter (quarter-to-date period) furnished amounts, and the adjusted amounts will be reflected in the fiscal 2026 second quarter Form 10-Q. No other periods were impacted and there is no impact on the consolidated financial results or results by product category. \n34\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nPeriod-over-period changes in our net sales are generally attributable to the impacts from (i) pricing on our base portfolio, including changes in mix and those due to strategic pricing actions, (ii) volume, including changes driven by the impact of new product innovation, (iii) acquisitions and/or divestitures, and/or (iv) foreign currency translation. The percentages disclosed for these impacts are calculated on an individual basis.\nThe net sales impact from pricing consists of changes in list prices, due to strategic pricing actions, and mix shifts within and among product categories, geographic regions, brands and distribution channels. The prices at which we sell our products vary by brand, distribution channel (e.g., wholesale or direct-to-consumer) and may also vary by country. Our brands and products cover a broad array of pricing tiers. Prices of skin care and fragrance products are typically higher than makeup and hair care products. \nNew product innovation includes the introduction of new products, as well as changes related to existing products or where they are sold, including reformulations, regional expansion, repackaging and sets. A product is considered \"new innovation\" for the twelve-month period following the initial shipment date. Our innovation is launched at different price points than existing products and value derived from innovation may vary from year to year. We continually introduce new products, support new and established products through advertising, merchandising and sampling and phase out existing products that no longer meet the needs of our consumers or our objectives. The economics of developing, producing, launching, supporting and discontinuing products impact our sales and operating performance each period. The introduction of new products often has some cannibalizing effect on sales of existing products, which we take into account in our business planning. The impact of new product introductions, including timing compared to introductions in prior periods, also affects our results.\nNon-GAAP Financial Measures\nWe use certain non-GAAP financial measures, among other financial measures, to evaluate our operating performance, which represent the manner in which we conduct and view our business. Management believes that excluding certain items that are not comparable from period to period helps investors and others compare operating performance between periods. While we consider the non-GAAP measures useful in analyzing our results, they are not intended to replace, or act as a substitute for, any presentation included in the consolidated financial statements prepared in conformity with U.S. GAAP. See \nReconciliations of Non-GAAP Financial Measures\n beginning on page 46 for reconciliations between non-GAAP financial measures and the most directly comparable U.S. GAAP measures.\nWe operate on a global basis, with the majority of our net sales generated outside the United States. Accordingly, fluctuations in foreign currency exchange rates affect our results of operations. Therefore, we present certain net sales, operating results and diluted net earnings (loss) per common share information excluding the effect of foreign currency rate fluctuations to provide a framework for assessing the performance of our underlying business outside the United States. Constant currency information compares results between periods as if exchange rates had remained constant period-over-period. We calculate constant currency information by translating current-period results using prior-year monthly average foreign currency exchange rates and adjusting for the period-over-period impact of foreign currency cash flow hedging activities.\nOutlook\nWe have experienced challenges within our business and we expect volatility and uncertainty to continue. Although there are signs of stabilization in Mainland China, travel retail conversion continues to be weak and challenges persist in Western Europe, including subdued sentiment. Additionally, within the United States we continue to experience headwinds from challenges in department stores. These challenges are collectively expected to impact net sales and profitability, including impacts to our effective tax rate from changes to our geographical mix of earnings. \nWe are continuing to monitor and assess the potential effects of new and existing tariffs in the United States as well as in other markets in which we operate. These tariffs have led to significant volatility and uncertainty in global markets and difficulty in forecasting demand. We have implemented and are continuing to implement and consider additional mitigation measures. The impact was not material to fiscal 2026 first quarter profitability and cash flows, however, even if we can minimize some of these impacts, we anticipate higher tariff rates to have an adverse effect on fiscal 2026 profitability and cash flows, and depending on actual rates and countries imposing tariffs such adverse impacts could be material.\n35\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nWe continue to believe that the best way to increase long-term stockholder value is to provide superior products and services in the most efficient and effective manner while recognizing shifts in consumers’ behaviors and shopping practices. Accordingly, our long-term strategy has numerous initiatives across product categories, brands, geographic regions, channels of distribution and functions designed to grow our sales, provide cost efficiencies, leverage our strengths, such as our history of outstanding creativity and innovation, high quality products and services, and engaging communications, and make us more productive and profitable. With the transition of leadership in the second and third quarters of fiscal 2025, we have embarked on \"Beauty Reimagined,\" a strategic vision which focuses on accelerating best-in-class consumer coverage, creating transformative innovation, boosting consumer-facing investments, fueling sustainable growth through bold efficiencies and reimagining the way we work, including through the expansion of the Profit Recovery and Growth Plan (\"PRGP\"), as discussed below. \nWe continue to monitor the effects of the global macro environment, including the risk of recession; currency volatility; inflationary pressures; supply chain challenges; social and political issues; competitive pressures; legal and regulatory matters, including the imposition of tariffs and sanctions; geopolitical tensions; and global security issues. We are also mindful of inflationary pressures (including those caused by tariffs) on our cost base and are monitoring the impact on consumer preferences, the impact of changes being made in the organization, including those related to Beauty Reimagined and the PRGP, as well as the potential impact of changes expected to be made as part of the PRGP on suppliers, retailers and others, and challenges relating to successfully outsourcing select services. In our outlook, we have made assumptions relating to these and other internal and external factors and challenges. Declines in net sales and profitability have, and may continue to, adversely impact the goodwill and other intangible assets associated with our brands, as well as long-lived assets, potentially resulting in impairments.\nIn December 2021, the Organization for Economic Cooperation and Development issued \"Pillar Two\" Global Anti-Base Erosion model rules for countries to enact into domestic law that would establish a 15% global minimum tax applied on a country-by-country basis for multinational companies. We are continuing to monitor and evaluate the potential impact of incorporating the global minimum tax in additional countries that have yet to enact the legislation.\nOn July 4, 2025, new U.S tax legislation was enacted known as the One Big Beautiful Bill Act. This legislation includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework and the restoration of certain business tax provisions. The legislation has multiple effective dates, and we are continuing to evaluate the potential impact of the provisions that are expected to be effective in future fiscal years. \nOur ability to recognize deferred tax assets, inclusive of utilizing net operating loss carryforwards, tax credits, and other carryforwards is dependent on the generation of sufficient taxable income in future periods. Accordingly, there can be no assurance that additional valuation allowances on our deferred tax assets will not be required should our financial performance be negatively impacted in the future. Such valuation allowance could be material. We are also monitoring certain provisions in global tax regulations that may expire during fiscal 2026, which, if not extended, could increase our effective tax rate.\nRestructuring Program Component of the Profit Recovery and Growth Plan\nAs announced on November 1, 2023, we launched the PRGP to help progressively rebuild our profit margins in fiscal years 2025 and 2026.\nAs a component of the PRGP, on February 5, 2024, we announced a two-year restructuring program. We committed to this course of action on February 1, 2024. \nAfter reviewing additional potential initiatives and the progress of previously approved initiatives, on February 3, 2025, we committed to the expansion of the PRGP, including an expansion of the restructuring program. \nThe expanded component of the restructuring program began during our fiscal 2025 third quarter. The focus of the overall expanded restructuring program (collectively the “Restructuring Program”) includes (i) reorganization and rightsizing of certain areas, (ii) simplification and acceleration of processes, (iii) outsourcing of select services and (iv) evolution of go-to-market footprint and selling models. Specific initiatives under the Restructuring Program are expected to be approved by the end of fiscal 2026 and substantially completed by the end of fiscal 2027.\nIn connection with the Restructuring Program, as of September 30, 2025 we estimate a net reduction in the range of approximately 5,800 to 7,000 positions globally, which is about 9-11% of our positions including temporary and part-time employees as of June 30, 2023. This net reduction takes into account the elimination of positions after retraining and redeployment of certain employees in select areas. \n36\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nWe expect that the Restructuring Program will result in restructuring and other charges totaling between $1,200 million and $1,600 million, before taxes, consisting of employee-related costs, asset-related costs, contract terminations and other costs associated with implementing these initiatives, which other than the non-cash charges, are expected to result in future cash expenditures funded from cash provided by operations.\nOnce fully implemented, we expect the restructuring program to yield annual target gross benefits of between $800 million and $1,000 million, before taxes, a portion of which is expected to be reinvested in consumer-facing activities. The net benefits of the PRGP, which includes the Restructuring Program, are expected to enable a return to a double-digit operating margin over the next few years.\nFurther information about the Restructuring Program Component of the Profit Recovery and Growth Plan, is described in \nNotes to Consolidated Financial Statements, Note 3 – Charges Associated with Restructuring and Other Activities\n herein.\nNET SALES\nThree Months Ended\nSeptember 30,\n($ in millions)\n2025\n2024\nAs Reported:\nNet sales\n$\n3,481 \n$\n3,361 \n$ Change from prior-year period\n120 \n% Change from prior-year period\n4 \n%\nNon-GAAP Financial Measure\n(1)\n:\n% Change from prior-year period in constant currency\n3 \n%\n(1)\nSee “\nReconciliations of Non-GAAP Financial Measures”\n beginning on page 46 for reconciliations between non-GAAP financial measures and the most directly comparable U.S. GAAP measures.\nReported net sales increased for the three months ended September 30, 2025, driven by an increase in net sales in the fragrance and skin care product categories.\nBy geographic region, reported net sales increased across all geographic regions, with the exception of The Americas. The increase in net sales was primarily driven by higher net sales in our travel retail business, and to a lesser extent, in Mainland China.\nReported net sales were impacted by approximately $25 million of favorable foreign currency translation for the three months ended September 30, 2025. \nReported net sales increased 4% for the three months ended September 30, 2025, driven by the increase from pricing of 2% reflecting the favorable impact from strategic price actions and changes in mix, the increase from volume of 1%, and the favorable impact from foreign currency translation of 1%. \nReturns associated with restructuring and other activities are not allocated to our product categories or geographic regions because they are centrally directed and controlled, are not included in internal measures of product category or geographic region performance and result from activities that are deemed a Company-wide initiative to redesign, resize and reorganize select areas of the business. Accordingly, the following discussions of Net sales by \nProduct Categories \nand \nGeographic Regions \nexclude the impacts of return adjustments associated with restructuring and other activities of $1 million for the three months ended September 30, 2025. There were no returns associated with restructuring and other activities for the three months ended September 30, 2024.\n37\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nProduct Categories\nReported net sales for our product categories for the three months ended September 30, 2025 and 2024 were as follows:\nThree Months Ended September 30,\n($ in millions)\n2025\n2024\n$ Change\n% Change\n% Change in Constant Currency\n(1)\nSkin Care\n$\n1,575 \n$\n1,529 \n$\n46 \n3 \n%\n3 \n%\nMakeup\n1,030 \n1,038 \n(8)\n(1)\n(2)\nFragrance\n721 \n630 \n91 \n14 \n13 \nHair Care\n129 \n139 \n(10)\n(7)\n(7)\nOther\n25 \n25 \n—\n— \n— \n3,480 \n3,361 \n119 \n4 \n3 \nReturns associated with restructuring and other activities\n1 \n—\n1 \n100 \n100 \nNet sales\n$\n3,481 \n$\n3,361 \n$\n120 \n4 \n%\n3 \n%\n(1)\nSee “\nReconciliations of Non-GAAP Financial Measures”\n beginning on page 46 for reconciliations between non-GAAP financial measures and the most directly comparable U.S. GAAP measures.\nSkin Care\nReported skin care net sales increased $46 million, or 3%, for the three months ended September 30, 2025, reflecting higher net sales from La Mer and Estée Lauder, combined, of approximately $54 million.\nNet sales from La Mer increased, primarily driven by higher net sales in our Asia travel retail business, attributable to the low prior-year period net sales base which reflected (i) the challenging retail environment, including low consumer sentiment and conversion from Chinese consumers, as well as (ii) our prior-year efforts to improve in-trade inventory levels. The increase in net sales from Estée Lauder was primarily driven by higher net sales in our Asia travel retail business, as reflected above, and higher net sales in Mainland China, primarily driven by the impacts from new product launches, and reflecting an improvement in the retail environment, including improved consumer sentiment comparatively, to the prior-year period.\nSkin care net sales were impacted by approximately $7 million of favorable foreign currency translation for the three months ended September 30, 2025.\nReported skin care net sales increased 3% for the three months ended September 30, 2025, driven by the increase from pricing of 3% reflecting the favorable impact from strategic pricing actions and changes in mix. The impact from volume was flat period-over-period. \nMakeup\nReported makeup net sales decreased $8 million, or 1%, for the three months ended September 30, 2025, reflecting lower net sales from Bobbi Brown and Too Faced, combined, of approximately $17 million.\nThe decrease in net sales from Bobbi Brown was primarily driven by lower net sales in the face subcategory reflecting the unfavorable year-over-year impact of new product launch shipments and lower net sales in the eye subcategory reflecting a reduction in color palettes. Net sales from Too Faced decreased, primarily driven by North America, reflecting lower net sales in the face and eye subcategories.\nPartially offsetting the makeup net sales decrease were higher net sales from Estée Lauder, primarily driven by higher net sales in our Asia travel retail business, attributable to the low prior-year period net sales base which reflected (i) the challenging retail environment, including low consumer sentiment and conversion from Chinese consumers, as well as (ii) our prior-year efforts to improve in-trade inventory levels.\n38\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nMakeup net sales were impacted by approximately $10 million of favorable foreign currency translation for the three months ended September 30, 2025.\nReported makeup net sales decreased 1% for the three months ended September 30, 2025, driven by the decrease from pricing of 1% reflecting changes in mix partially offset by the favorable impact from strategic pricing actions. Partially offsetting the decrease was the favorable impact from foreign currency translation of 1%. The impact from volume was flat period-over-period.\nFragrance\nReported fragrance net sales increased $91 million, or 14% for the three months ended September 30, 2025, primarily driven by higher net sales from Le Labo, TOM FORD, and Jo Malone London, combined, of approximately $76 million. The increase in net sales for Le Labo reflected growth from targeted expanded consumer reach and the success of hero products. Net sales from TOM FORD increased, primarily driven by growth in the Private Blend and Signature franchises, reflecting the benefit from new product launches which created halo benefits on existing products. Net sales from Jo Malone London increased reflecting higher net sales in the cologne subcategory, including success from hero franchises and holiday campaigns, as well as new product launches.\nFragrance net sales were impacted by approximately $8 million of favorable foreign currency translation for the three months ended September 30, 2025.\nReported fragrance net sales increased 14% for the three months ended September 30, 2025, driven by the increase from volume of 8%, an increase from pricing of 5% reflecting changes in mix and the favorable impact from strategic pricing actions, and the favorable impact from foreign currency translation of 1%.\nHair Care\nReported hair care net sales decreased $10 million, or 7%, for the three months ended September 30, 2025, driven by lower net sales from Aveda, reflecting the brand’s strategies to improve long-term performance, including (i) planned reductions in online promotional activity and (ii) the exit from underperforming doors, including freestanding stores. Also contributing to the decrease in Aveda net sales was continued softness in the salon channel. These declines were partially offset by the impact from its launch in Amazon's U.S. Premium Beauty store during the fiscal 2025 fourth quarter.\nReported hair care net sales decreased 7% for the three months ended September 30, 2025, driven by the decrease from volume of 14%, partially offset by an increase from pricing of 6% reflecting changes in mix and the favorable impact from strategic pricing actions. \nGeographic Regions\nReported net sales by geographic region for the three months ended September 30, 2025 and 2024 were as follows:\nThree Months Ended September 30,\n($ in millions)\n2025\n2024\n$ Change\n% Change\n% Change in Constant Currency\n(2)\nThe Americas\n$\n1,174 \n$\n1,197 \n$\n(23)\n(2)\n%\n(2)\n%\nEUKEM\n901 \n868 \n33 \n4 \n— \nAsia/Pacific\n(1)\n873 \n806 \n67 \n8 \n9 \nMainland China\n532 \n490 \n42 \n9 \n9 \n3,480 \n3,361 \n119 \n4 \n3 \nReturns associated with restructuring and other activities\n1 \n— \n1 \n100 \n100 \nNet sales\n$\n3,481 \n$\n3,361 \n$\n120 \n4 \n%\n3 \n%\n(1)\nThe net sales from the Company’s travel retail business are included in the Asia/Pacific region.\n(2)\nSee “\nReconciliations of Non-GAAP Financial Measures”\n beginning on page 46 for reconciliations between non-GAAP financial measures and the most directly comparable U.S. GAAP measures.\n39\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nReported net sales increased for the three months ended September 30, 2025, primarily driven by higher net sales in Asia/Pacific and in Mainland China, combined, of approximately $109 million. \nThe increase in net sales in Asia/Pacific was primarily driven by higher net sales in our travel retail business, led by Asia travel retail, attributable to the low prior-year period net sales base which reflected (i) the challenging retail environment, including low consumer sentiment and conversion from Chinese consumers, as well as (ii) our prior-year efforts to improve in-trade inventory levels. Also contributing to the increase in net sales from our travel retail business was higher net sales from our Europe, the Middle East & Africa travel retail business, primarily driven by growth in fragrance. \nThe increase in net sales in Mainland China for the three months ended September 30, 2025 was primarily driven by the impact from new product launches and the expansion of The Ordinary into the region during the fiscal 2025 third quarter, and also reflected an improvement in the retail environment, including improved consumer sentiment comparatively, to the prior-year period.\nPartially offsetting the reported net sales increase was lower net sales in North America, primarily reflecting continued challenges in department stores, including the impact from store closures related to a retailer bankruptcy as well as softness in certain retailers, and elevated levels of inventory for some brands that continued through the quarter. Partially offsetting the net sales decline for North America was growth from shipments in support of our Amazon Premium Beauty stores in the U.S. and Canada, including ongoing brand expansion on the platform.\nReported net sales in The Americas decreased 2% for the three months ended September 30, 2025, driven by the decrease from volume of 3%, partially offset by an increase from pricing of 2% reflecting changes in mix and the favorable impact from strategic pricing actions.\nReported net sales in EUKEM increased 4% for the three months ended September 30, 2025, driven by the favorable impact of foreign currency translation of 4% and an increase from pricing of 3% reflecting the favorable impact from strategic pricing actions and changes in mix. Partially offsetting these increases was the decrease from volume of 3%. \nReported net sales in Asia/Pacific increased 8% for the three months ended September 30, 2025, driven by an increase from pricing of 5% reflecting the favorable impact from strategic pricing actions and changes in mix, and the increase from volume of 4%.\nReported net sales in Mainland China increased 9% for the three months ended September 30, 2025, driven by an increase from volume of 12%, partially offset by a decrease in pricing of 3%, reflecting changes in mix partially offset by the favorable impact from strategic pricing actions. \n40\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nGROSS MARGIN\nGross margin increased to 73.4% for the three months ended September 30, 2025, as compared with 72.4% in the prior-year period.\nFavorable (Unfavorable) Basis Points\nSeptember 30, 2025\nThree Months Ended\nAs Reported:\nMix of business\n50 \nObsolescence charges\n20 \nManufacturing costs and other\n20 \nForeign exchange transactions\n(30)\nCharges associated with restructuring and other activities\n40 \nAs Reported Gross Margin Basis Point Variance\n100 \nNon-GAAP Financial Measure Adjustments\nCharges associated with restructuring and other activities\n(40)\nNon-GAAP Gross Margin Basis Point Variance\n60 \nThe increase in gross margin for the three months ended September 30, 2025 reflected net benefits from the PRGP, which included favorable impacts across our mix of business, obsolescence charges and manufacturing costs and other. The favorability within mix of business was driven by reductions in promotional activity, and the favorability within obsolescence charges was driven by reductions in excess inventory. Manufacturing costs and other reflects the favorable impact of cost efficiencies within our global supply chain network, partially offset by the impact of inflation on our costs. \n41\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nOPERATING EXPENSES\nOperating expenses as a percentage of net sales was 68.5% for the three months ended September 30, 2025, as compared with 76.0% in the prior-year period.\nFavorable (Unfavorable) Basis Points \nSeptember 30, 2025\nThree Months Ended\nAs Reported:\nGeneral and administrative expenses\n90 \nAdvertising, marketing, promotion and product development\n140 \nSelling\n30 \nShipping\n30 \nStore operating costs\n10 \nStock-based compensation\n(20)\nForeign exchange transactions\n(30)\nCharges associated with restructuring and other activities\n30 \nTalcum litigation settlement agreements\n470 \nAs Reported Operating Expense Margin Basis Point Variance\n750 \nNon-GAAP Financial Measure Adjustments:\nImpact of restructuring and other activities\n(40)\nTalcum litigation settlement agreements\n(470)\nNon-GAAP Operating Expense Margin Basis Point Variance\n240 \nThe favorability in our operating expense margin reflects lower expenses within non-consumer-facing areas of the business, primarily within general and administrative, marketing and product development expenses. These reductions were driven by lower employee-related costs realized through initiatives as part of the PRGP, with the general and administrative favorability partially offset by the year-over-year increase in employee incentive costs. Partially offsetting these expense reductions were increased investments in consumer-facing areas of the business to drive sales, including advertising, selling, promotion and store operating expenses.\n42\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nOPERATING RESULTS\nThree Months Ended\nSeptember 30,\n($ in millions)\n2025\n2024\nAs Reported:\nOperating income (loss)\n$\n169 \n$\n(121)\n$ Change from prior-year period\n290 \n% Change from prior-year period\n100+%\nOperating margin\n4.9 \n%\n(3.6)\n%\nNon-GAAP Financial Measure\n(1)\n:\n% Change in operating income (loss) from the prior-year period adjusting for the impact of charges associated with restructuring and other activities and talcum litigation settlement agreements\n77 \n%\n(1)\nSee “\nReconciliations of Non-GAAP Financial Measures”\n beginning on page 46 for reconciliations between non-GAAP financial measures and the most directly comparable U.S. GAAP measures.\nThe increase in reported operating margin for the three months ended September 30, 2025 was driven by the favorable year-over-year impact of the charge in the fiscal 2025 first quarter associated with the talcum litigation settlement agreements of $159 million, reflected within the favorable operating expense margin, as well as the increase in net sales and increase in gross margin, as discussed above. \nCharges associated with restructuring and other activities are not allocated to our product categories or geographic regions because they are centrally directed and controlled, are not included in internal measures of product category or geographic region performance and result from activities that are deemed a Company-wide initiative to redesign, resize and reorganize select areas of the business. Accordingly, the following discussions of Operating income (loss) by \nProduct Categories\n and \nGeographic Regions\n exclude the impact of charges associated with restructuring and other activities for the three months ended September 30, 2025 and 2024 of $86 million and $106 million, respectively.\nProduct Categories\nReported Operating income (loss) for our product categories for the three months ended September 30, 2025 and 2024 were as follows:\nThree Months Ended September 30,\n($ in millions)\n2025\n2024\n$ Change\n% Change\n(As reported)\n% Change \n(Non-GAAP)\n(1)\nNon-GAAP Financial Measure\n(1)\nSkin Care\n$\n187 \n$\n117 \n$\n70 \n60 \n%\n60 \n%\nMakeup\n(15)\n(185)\n170 \n92 \n42 \nAdjusted for the impact of talcum litigation settlement agreements.\nFragrance\n86 \n60 \n26 \n43 \n43 \nHair Care\n(12)\n(18)\n6 \n33 \n33 \nOther\n9 \n11 \n(2)\n(18)\n(18)\n255 \n(15)\n270\n100+\n77\nCharges associated with restructuring and other activities\n(86)\n(106)\n20 \n19 \n68 \nOperating income (loss)\n$\n169 \n$\n(121)\n$\n290 \n100+%\n100+%\n(1)\nSee “\nReconciliations of Non-GAAP Financial Measures”\n beginning on page 46 for reconciliations between non-GAAP financial measures and the most directly comparable U.S. GAAP measures.\n43\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nSkin Care\nReported skin care operating income increased $70 million, or 60%, for the three months ended September 30, 2025, reflecting an increase in net sales, as well as lower non-consumer-facing expenses, including the reduction in employee-related costs realized through initiatives as part of the PRGP.\nMakeup\nReported makeup operating loss decreased $170 million, or 92%, for the three months ended September 30, 2025, primarily reflecting the favorable year-over-year impact of the charge in the fiscal 2025 first quarter associated with the talcum litigation settlement agreements of $159 million, and to a lesser extent lower non-consumer-facing expenses, including the reduction in employee-related costs realized through initiatives as part of the PRGP.\nFragrance\nReported fragrance operating income increased $26 million, or 43%, for the three months ended September 30, 2025, reflecting higher net sales, partially offset by higher cost of sales, and an increase in investments in consumer-facing areas of the business, including selling expenses to support targeted expanded consumer reach, higher promotion expenses to support new product launches, and higher store operating costs to support targeted expanded consumer reach.  \nHair Care\nReported hair care operating loss decreased $6 million, or 33%, for the three months ended September 30, 2025, primarily reflecting lower operating expenses and cost of sales, partially offset by lower net sales.\nGeographic Regions\nThree Months Ended September 30,\n($ in millions)\n2025\n2024\n(1)\n$ Change\n% Change\n(As Reported)\n% Change \n(Non-GAAP)\n(2)\nNon-GAAP Financial Measure\n(2)\nThe Americas\n$\n87 \n$\n(85)\n$\n172 \n100+%\n18 \n%\nAdjusted for the impact of talcum litigation settlement agreements\nEUKEM\n6 \n10 \n(4)\n(40)\n(40)\nAsia/Pacific\n(3)\n150 \n76 \n74 \n97\n97 \nMainland China\n12 \n(16)\n28 \n100+\n100+\n255 \n(15)\n270 \n100+\n77 \nCharges associated with restructuring and other activities\n(86)\n(106)\n20 \n19\n68\nOperating income (loss)\n$\n169 \n$\n(121)\n$\n290 \n100+%\n100+%\n(1)\nOperating results by geographic region for the fiscal 2025 first quarter have been adjusted to reflect the correction of a regional misclassification in the amounts furnished in the Form 8-K on October 2, 2025 related to a one-time charge during the fiscal 2025 first quarter. The misclassification was offset in the fiscal 2025 second quarter (quarter-to-date period) furnished amounts, and the adjusted amounts will be reflected in the fiscal 2026 second quarter Form 10-Q. No other periods were impacted and there is no impact on the consolidated financial results or results by product category. \n(2)\nSee \n“Reconciliations of Non-GAAP Financial Measures” \nbeginning on page 46 for reconciliations between non-GAAP financial measures and the most directly comparable U.S. GAAP measures.\n(3)\nThe operating results from the Company’s travel retail business are included in the Asia/Pacific region.\nReported operating results in The Americas increased $172 million, or over 100%, for the three months ended September 30, 2025, reflecting the favorable year-over-year impact of the charge in the fiscal 2025 first quarter associated with the talcum litigation settlement agreements of $159 million, and to a lesser extent, lower non-consumer-facing expenses, including the reduction in employee-related costs realized through initiatives as part of the PRGP, and lower cost of sales, partially offset by lower net sales. \n44\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nReported operating income in EUKEM decreased $4 million, or 40%, for the three months ended September 30, 2025, reflecting an increase in investments in consumer-facing areas of the business, including to support targeted expanded consumer reach and to support key campaigns and activations, offset by higher net sales.\nReported operating income in Asia/Pacific increased $74 million, or 97%, for the three months ended September 30, 2025, reflecting higher net sales and lower non-consumer-facing expenses, including the reduction in employee-related costs realized through initiatives as part of the PRGP, partially offset by higher cost of sales. \nReported operating results in Mainland China increased $28 million, or over 100%, for the three months ended September 30, 2025, reflecting higher net sales, partially offset by higher cost of sales and the unfavorable year-over-year impact associated with the recognition of local government subsidies in the prior-year period. \nINTEREST AND INVESTMENT INCOME\nThree Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nInterest expense\n$\n86 \n$\n92 \nInterest income and investment income, net\n$\n30 \n$\n35 \nInterest expense decreased for the three months ended September 30, 2025, primarily reflecting a lower average debt balance compared to the prior-year period. Interest income and investment income, net decreased, primarily reflecting a lower average cash balance and lower average interest rates compared to the prior-year period.\nPROVISION FOR INCOME TAXES\nThe provision or benefit for income taxes represents U.S. federal, foreign, state and local income taxes. The effective rate differs from the federal statutory rate primarily due to the effect of state and local income taxes, the tax impact of stock-based compensation, the taxation of foreign income and income tax reserve adjustments, which represent changes in our net liability for unrecognized tax benefits including tax settlements and lapses of the applicable statutes of limitations, as well as changes to valuation allowances based on our assessment of the realizability of deferred tax assets. Our effective tax rate will change from quarter-to-quarter based on recurring and non-recurring factors including the geographical mix of earnings, enacted tax legislation, state and local income taxes, tax reserve adjustments, the tax impact of stock-based compensation, changes to valuation allowances, the interaction of various global tax strategies and the impact from certain acquisitions. In addition, changes in judgment from the evaluation of new information resulting in the recognition, derecognition or remeasurement of a tax position taken in a prior annual period are recognized separately in the quarter of change.\nThree Months Ended\nSeptember 30,\n2025\n2024\nEffective rate for income taxes\n56.9 \n%\n13.3 \n%\nBasis-point change from the prior-year period\n4,360 \nThe increase in the effective tax rate of 4,360 basis points was attributable in part to the loss before income taxes in the fiscal 2025 first quarter as well as the estimated unfavorable impact of the newly enacted U.S. tax legislation, a higher effective tax rate on our foreign operations due to our full year geographical mix of earnings in the current and prior-year periods and an unfavorable impact associated with the establishment of a valuation allowance against current period foreign tax credit and research and development tax credit U.S. deferred tax assets.  \n45\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nNET EARNINGS (LOSS)\nThree Months Ended\nSeptember 30,\n($ in millions, except per share data)\n2025\n2024\nAs Reported:\nNet earnings (loss)\n$\n47 \n$\n(156)\n$ Change from prior-year period\n203 \n% Change from prior-year period\n100+%\nDiluted net earnings (loss) per common share\n$\n.13 \n$\n(.43)\n% Change from prior-year period\n100+%\nNon-GAAP Financial Measure\n(1)\n:\n% Change in diluted net earnings (loss) per common share from the prior-year period adjusting for the impact of charges associated with restructuring and other activities and talcum litigation settlement agreements\n100+%\n(1)\nSee “\nReconciliations of Non-GAAP Financial Measures”\n below for reconciliations between non-GAAP financial measures and the most directly comparable U.S. GAAP measures.\nRECONCILIATIONS OF NON-GAAP FINANCIAL MEASURES\nWe use certain non-GAAP financial measures, among other financial measures, to evaluate our operating performance, which represent the manner in which we conduct and view our business. Management believes that excluding certain items that are not comparable from period to period, or do not reflect the Company’s underlying ongoing business, provides transparency for such items and helps investors and others compare and analyze our operating performance from period to period. In the future, we expect to incur charges or adjustments similar in nature to those presented below; however, the impact to the Company’s results in a given period may be highly variable and difficult to predict. Our non-GAAP financial measures may not be comparable to similarly titled measures used by, or determined in a manner consistent with, other companies. While we consider the non-GAAP measures useful in analyzing our results, they are not intended to replace, or act as a substitute for, any presentation included in the consolidated financial statements prepared in conformity with U.S. GAAP. The following tables present Net sales, Operating income (loss) and Diluted net earnings (loss) per common share adjusted to exclude the impact of charges associated with restructuring and other activities; talcum litigation settlement agreements; and the effects of foreign currency translation.\n46\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nThe following table provides reconciliations between these non-GAAP financial measures and the most directly comparable U.S. GAAP measures.\n($ in millions, except per share data)\nThree Months Ended\nSeptember 30,\nVariance\n% Change\n% Change in \nconstant currency\n2025\n2024\nNet sales, as reported\n$\n3,481 \n$\n3,361 \n$\n120 \n4 \n%\n3 \n%\nReturns associated with restructuring and other activities\n(1)\n— \n(1)\nNet sales, as adjusted\n$\n3,480 \n$\n3,361 \n$\n119 \n4 \n%\n3 \n%\nOperating income (loss), as reported\n$\n169 \n$\n(121)\n$\n290 \n100+%\n100+%\nCharges associated with restructuring and other activities\n86 \n106 \n(20)\nTalcum litigation settlement agreements\n— \n159 \n(159)\nOperating income, as adjusted\n$\n255 \n$\n144 \n$\n111 \n77 \n%\n79 \n%\nDiluted net earnings (loss) per common share, as reported\n$\n.13 \n$\n(.43)\n$\n.56 \n100+%\n100+%\nCharges associated with restructuring and other activities\n.19 \n.23 \n(.04)\nTalcum litigation settlement agreements\n— \n.34 \n(.34)\nDiluted net earnings per common share, as adjusted\n$\n.32 \n$\n.14 \n$\n.18 \n100+%\n100+%\nAs diluted net earnings (loss) per common share, as adjusted, is used as a measure of the Company’s performance, we consider the impact of current and deferred income taxes when calculating the per-share impact of each of the reconciling items.\n47\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nThe following table reconciles the change in net sales by product category and geographic region, as reported, to the change in net sales excluding the effects of foreign currency translation:\nAs Reported\nImpact of foreign\ncurrency translation\nVariance,\nin constant currency\n% Change,\nas reported\n% Change,\nin constant currency\nThree Months Ended\nSeptember 30,\n($ in millions)\n2025\n2024\nVariance\nBy Product Category:\nSkin Care\n$\n1,575 \n$\n1,529 \n$\n46 \n$\n(7)\n$\n39 \n3 \n%\n3 \n%\nMakeup\n1,030 \n1,038 \n(8)\n(10)\n(18)\n(1)\n(2)\nFragrance\n721 \n630 \n91 \n(8)\n83 \n14 \n13 \nHair Care\n129 \n139 \n(10)\n— \n(10)\n(7)\n(7)\nOther\n25 \n25 \n— \n— \n— \n— \n— \n3,480 \n3,361 \n119 \n(25)\n94 \n4 \n3 \nReturns associated with restructuring and other activities\n1 \n— \n1 \n— \n1 \nTotal\n$\n3,481 \n$\n3,361 \n$\n120 \n$\n(25)\n$\n95 \n4 \n%\n3 \n%\nBy Geographic Region:\nThe Americas\n$\n1,174 \n$\n1,197 \n$\n(23)\n$\n4 \n$\n(19)\n(2)\n%\n(2)\n%\nEUKEM\n901 \n868 \n33 \n(35)\n(2)\n4 \n— \nAsia/Pacific\n873 \n806 \n67 \n4 \n71 \n8 \n9 \nMainland China\n532 \n490 \n42 \n2 \n44 \n9 \n9 \n3,480 \n3,361 \n119 \n(25)\n94 \n4 \n3 \nReturns associated with restructuring and other activities\n1 \n— \n1 \n— \n1 \nTotal\n$\n3,481 \n$\n3,361 \n$\n120 \n$\n(25)\n$\n95 \n4 \n%\n3 \n%\n48\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nThe following table reconciles the change in operating results by product category and geographic region, as reported, to the change in operating results excluding the impact of talcum litigation settlement agreements:\nAs Reported\nAdd:\nTalcum litigation settlement agreements\nVariance, as adjusted\n% Change, as reported\n% Change, as adjusted\nThree Months Ended\nSeptember 30,\n($ in millions)\n2025\n2024\nVariance\nBy Product Category:\nSkin Care\n$\n187 \n$\n117 \n$\n70 \n$\n— \n$\n70 \n60 \n%\n60 \n%\nMakeup\n(15)\n(185)\n170 \n(159)\n11 \n92 \n42 \nFragrance\n86 \n60 \n26 \n— \n26 \n43 \n43 \nHair Care\n(12)\n(18)\n6 \n— \n6 \n33 \n33 \nOther\n9 \n11 \n(2)\n— \n(2)\n(18)\n(18)\n255 \n(15)\n270 \n$\n(159)\n$\n111 \n100+%\n77 \n%\nCharges associated with restructuring and other activities\n(86)\n(106)\n20 \nTotal\n$\n169 \n$\n(121)\n$\n290 \nBy Geographic Region\n(1)\n:\nThe Americas\n$\n87 \n$\n(85)\n$\n172 \n$\n(159)\n$\n13 \n100+%\n18 \n%\nEUKEM\n6 \n10 \n(4)\n— \n(4)\n(40)\n(40)\nAsia/Pacific\n150 \n76 \n74 \n— \n74 \n97 \n97 \nMainland China\n12 \n(16)\n28 \n— \n28 \n100+\n100+\n255 \n(15)\n270 \n$\n(159)\n$\n111 \n100+%\n77 \n%\nCharges associated with restructuring and other activities\n(86)\n(106)\n20 \nTotal\n$\n169 \n$\n(121)\n$\n290 \n(1)\nOperating results by geographic region for the fiscal 2025 first quarter have been adjusted to reflect the correction of a regional misclassification in the amounts furnished in the Form 8-K on October 2, 2025 related to a one-time charge during the fiscal 2025 first quarter. The misclassification was offset in the fiscal 2025 second quarter (quarter-to-date period) furnished amounts, and the adjusted amounts will be reflected in the fiscal 2026 second quarter Form 10-Q. No other periods were impacted and there is no impact on the consolidated financial results or results by product category.\nFINANCIAL CONDITION\nLIQUIDITY AND CAPITAL RESOURCES\nOverview\nOur principal sources of funds historically have been cash flows from operations, borrowings pursuant to our commercial paper program, borrowings from the issuance of long-term debt and committed and uncommitted credit lines provided by banks and other lenders in the United States and abroad. At September 30, 2025, we had cash and cash equivalents of $2,219 million compared with $2,921 million at June 30, 2025. Our cash and cash equivalents are maintained at a number of financial institutions. To mitigate the risk of uninsured balances, we select financial institutions based on their credit ratings and financial strength, and we perform ongoing evaluations of these institutions to limit our concentration risk exposure.\nBased on past performance and current expectations, we believe that cash on hand, cash generated from operations, available credit lines and access to credit markets will be adequate to support seasonal working capital needs, currently planned business operations, information technology enhancements, capital expenditures, acquisitions, dividends, stock repurchases, restructuring initiatives, commitments and other contractual obligations on both a near-term and long-term basis. \n49\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nThe Tax Cuts and Jobs Act resulted in the Transition Tax on unrepatriated earnings of our foreign subsidiaries and changed the tax law in ways that present opportunities to repatriate cash without additional U.S. federal income tax. We continue to analyze the indefinite reinvestment assertion on our remaining applicable foreign earnings. We do not believe that continuing to reinvest these remaining applicable foreign earnings impairs our ability to meet our domestic debt or working capital obligations. If these reinvested earnings were repatriated into the United States as dividends, we would be subject to state income taxes and applicable foreign taxes in certain jurisdictions.\nInflation impacted our operating results in the fiscal 2026 first quarter and we expect it to continue. Generally, we have plans to introduce new products at higher prices, increase prices and implement other operating efficiencies which we expect to offset some of these cost increases.\nCredit Ratings\nChanges in our credit ratings will likely result in changes in our borrowing costs. Our credit ratings also impact the cost of our revolving credit facilities. Downgrades in our credit ratings may reduce our ability to issue commercial paper and/or long-term debt and would likely increase the relative costs of borrowing. A credit rating is not a recommendation to buy, sell, or hold securities, is subject to revision or withdrawal at any time by the assigning rating organization, and should be evaluated independently of any other rating. As of October 23, 2025, our long-term debt is rated A- with a negative outlook by Standard & Poor’s and A3 with a negative outlook by Moody’s.\n50\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nDebt\nAt September 30, 2025, our outstanding borrowings were as follows:\n($ in millions)\nLong-term\nDebt\nCurrent\nDebt\nTotal Debt\n5.150% Senior Notes, due May 15, 2053 (\"2053 Senior Notes\") \n(1), (15)\n$\n591 \n$\n— \n$\n591 \n3.125% Senior Notes, due December 1, 2049 (“2049 Senior Notes”) \n(2), (15)\n637 \n— \n637 \n4.150% Senior Notes, due March 15, 2047 (“2047 Senior Notes”) \n(3), (15)\n495 \n— \n495 \n4.375% Senior Notes, due June 15, 2045 (“2045 Senior Notes”) \n(4), (15)\n455 \n— \n455 \n3.700% Senior Notes, due August 15, 2042 (“2042 Senior Notes”) \n(5), (15)\n247 \n— \n247 \n6.000% Senior Notes, due May 15, 2037 (“2037 Senior Notes”) \n(6), (15)\n295 \n— \n295 \n5.000% Senior Notes, due February 14, 2034 (\"2034 Senior Notes) \n(7), (15)\n640 \n— \n640 \n5.75% Senior Notes, due October 15, 2033 (“October 2033 Senior Notes”) \n(8), (15)\n198 \n— \n198 \n4.650% Senior Notes, due May 15, 2033 (\"May 2033 Senior Notes\") \n(9), (15)\n695 \n— \n695 \n1.950% Senior Notes, due March 15, 2031 (\"2031 Senior Notes\") \n(10), (15)\n566 \n— \n566 \n2.600% Senior Notes, due April 15, 2030 (\"2030 Senior Notes\") \n(11), (15)\n631 \n— \n631 \n2.375% Senior Notes, due December 1, 2029 (“2029 Senior Notes”) \n(12), (15)\n645 \n— \n645 \n4.375% Senior Notes, due May 15, 2028 (\"2028 Senior Notes\") \n(13), (15)\n698 \n— \n698 \n3.150% Senior Notes, due March 15, 2027 (“2027 Senior Notes”) \n(14), (15)\n500 \n— \n500 \nOther long-term borrowings\n27 \n— \n27 \nOther current borrowings\n— \n3 \n3 \n$\n7,320 \n$\n3 \n$\n7,323 \n(1)\nConsists of $600 million principal, unamortized debt discount of $3 million and debt issuance costs of $6 million.\n(2)\nConsists of $650 million principal, unamortized debt discount of $7 million and debt issuance costs of $6 million.\n(3)\nConsists of $500 million principal, unamortized debt discount of $1 million and debt issuance costs of $4 million.\n(4)\nConsists of $450 million principal, net unamortized debt premium of $9 million and debt issuance costs of $4 million.\n(5)\nConsists of $250 million principal, unamortized debt discount of $1 million and debt issuance costs of $2 million.\n(6)\nConsists of $300 million principal, unamortized debt discount of $3 million and debt issuance costs of $2 million.\n(7)\nConsists of $650 million principal, unamortized debt discount of $2 million, debt issuance costs of $4 million and a $4 million loss to reflect the fair value of interest rate swaps.\n(8)\nConsists of $200 million principal, unamortized debt discount of $1 million and debt issuance costs of $1 million.\n(9)\nConsists of $700 million principal, unamortized debt discount of $1 million and debt issuance costs of $4 million.\n(10)\nConsists of $600 million principal, unamortized debt discount of $2 million, debt issuance costs of $2 million and a $30 million loss to reflect the fair value of interest rate swaps.\n(11)\nConsists of $700 million principal, unamortized debt discount of $1 million, debt issuance costs of $2 million and a $66 million loss to reflect the fair value of interest rate swaps.\n(12)\nConsists of $650 million principal, unamortized debt discount of $3 million and debt issuance costs of $2 million.\n(13)\nConsists of $700 million principal and debt issuance costs of $2 million.\n(14)\nConsists of $500 million principal.\n(15)\nThe Senior Notes contain certain customary covenants, including limitations on indebtedness secured by liens.\nTotal debt as a percent of total capitalization was 65% at September 30, 2025 and June 30, 2025.\nCash Flows\nThree Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nNet cash flows used for operating activities\n$\n(340)\n$\n(670)\nNet cash flows used for investing activities\n$\n(116)\n$\n(160)\nNet cash flows used for financing activities\n$\n(239)\n$\n(226)\n51\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nThe change in net cash flows used for operating activities was primarily driven by higher net earnings in the fiscal 2026 first quarter and a favorable change in operating assets and liabilities variances.\nThe change in net cash flows used for investing activities was primarily driven by a favorable year-over-year impact from lower capital expenditures compared to the prior-year period.\nThe change in net cash flows used for financing activities primarily reflected the payment of deferred consideration in the fiscal 2026 first quarter associated with the fiscal 2023 acquisition of TOM FORD, partially offset by a decrease in dividends paid to stockholders in the current-year period.\nDividends\nFor a summary of quarterly cash dividends declared per share on our Class A and Class B Common Stock during the three months ended September 30, 2025, see \nNotes to Consolidated Financial Statements, Note 11 – Equity and Redeemable Noncontrolling Interest\n. \nPension and Post-retirement Plan Funding\nThere have been no significant changes to our pension and post-retirement funding as discussed in our Annual Report on Form 10-K for the fiscal year ended June 30, 2025.\nCommitments, Contractual Obligations and Contingencies\nThere have been no significant changes to our commitments and contractual obligations as discussed in our Annual Report on Form 10-K for the fiscal year ended June 30, 2025\n.\n For a discussion of contingencies, see \nNotes to Consolidated Financial Statements, Note 8 – Commitments and Contingencies\n.\nDerivative Financial Instruments and Hedging Activities\nFor a discussion of our derivative financial instruments and hedging activities, see \nNotes to Consolidated Financial Statements, Note 4 – Derivative Financial Instruments\n.\nForeign Exchange Risk Management\nFor a discussion of foreign exchange risk management, see \nNotes to Consolidated Financial Statements, Note 4 – Derivative Financial Instruments (Fair Value Hedges, Cash Flow Hedges and Net Investment Hedges)\n.\nCredit Risk\nFor a discussion of credit risk, see \nNotes to Consolidated Financial Statements, Note 4 – Derivative Financial Instruments (Credit Risk)\n.\nMarket Risk\nWe address certain financial exposures through a controlled program of market risk management that includes the use of foreign currency forward contracts to reduce the effects of fluctuating foreign currency exchange rates and to mitigate the change in fair value of specific assets and liabilities on the balance sheet, anticipated transactions and receivables and payables and the net investment in certain foreign operations. To perform a sensitivity analysis of our foreign currency forward contracts, we assess the change in fair values from the impact of hypothetical changes in foreign currency exchange rates. A hypothetical 10% weakening of the U.S. dollar against the foreign exchange rates for the currencies in our portfolio would have resulted in a net decrease in the fair value of our portfolio of approximately $186 million and $223 million as of September 30, 2025 and June 30, 2025, respectively. This potential change does not consider our underlying foreign currency exposures.\nWe also enter into cross-currency swap contracts to hedge the impact of foreign currency changes on certain intercompany foreign currency denominated debt and to hedge a portion of the net investment in certain foreign operations. A hypothetical 10% weakening of the U.S. dollar against the foreign exchange rates for the currencies in our cross-currency swap contracts would have resulted in a net decrease in the fair value of our cross-currency swap contracts of approximately $85 million as of September 30, 2025 and June 30, 2025.\nIn addition, we enter into interest rate derivatives to manage the effects of interest rate movements on our funded indebtedness, including future debt issuances. Based on a hypothetical 100 basis point increase in interest rates, the estimated fair value of our interest rate derivatives would decrease by approximately $63 million and $43 million as of September 30, 2025 and June 30, 2025, respectively. \n52\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\nOur sensitivity analysis represents an estimate of reasonably possible net losses that would be recognized on our portfolio of derivative financial instruments assuming hypothetical movements in future market rates and is not necessarily indicative of actual results, which may or may not occur. It does not represent the maximum possible loss or any expected loss that may occur, since actual future gains and losses will differ from those estimated, based upon actual fluctuations in market rates, operating exposures, and the timing thereof, and changes in our portfolio of derivative financial instruments during the year. We believe, however, that any such loss incurred would be offset by the effects of market rate movements on the respective underlying transactions for which the derivative financial instrument was intended.\nOFF-BALANCE SHEET ARRANGEMENTS\nWe do not maintain any off-balance sheet arrangements, transactions, obligations or other relationships with unconsolidated entities that would be expected to have a material current or future effect upon our financial condition or results of operations.\nCRITICAL ACCOUNTING POLICIES\nAs disclosed in our Annual Report on Form 10-K for the fiscal year ended June 30, 2025, the discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements, which have been prepared in conformity with U.S. GAAP. The preparation of these financial statements requires us to make estimates and assumptions that affect the amounts of assets, liabilities, revenues and expenses reported in those financial statements. These estimates and assumptions can be subjective and complex, and consequently, actual results could differ from those estimates. Refer to the \nCritical Accounting Policies and Estimates \nsection within \nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n in our Annual Report on Form 10-K for the fiscal year ended June 30, 2025. Since June 30, 2025, there have been no significant changes to the assumptions and estimates related to our critical accounting policies.\nRECENTLY ISSUED ACCOUNTING STANDARDS\nFor a discussion regarding the impact of accounting standards that were recently issued but not yet effective, on our consolidated financial statements, see \nNotes to Consolidated Financial Statements, Note 1 –\n \nSummary of Significant Accounting Policies\n.\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING INFORMATION\nWe and our representatives from time to time make written or oral forward-looking statements, including in this and other filings with the Securities and Exchange Commission, in our press releases and in our reports to stockholders, which may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements may address our expectations regarding sales, earnings or other future financial performance and liquidity, other performance measures, product introductions, entry into new geographic regions, information technology initiatives, new methods of sale, our long-term strategy, restructuring and other charges and resulting cost savings, and future operations or operating results. These statements may contain words like “expect,” “will,” “will likely result,” “would,” “believe,” “estimate,” “planned,” “plans,” “intends,” “may,” “should,” “could,” “anticipate,” “estimate,” “project,” “projected,” “forecast,” and “forecasted” or similar expressions. Although we believe that our expectations are based on reasonable assumptions within the bounds of our knowledge of our business and operations, actual results may differ materially from our expectations. Factors that could cause actual results to differ from expectations include, without limitation:\n(1)\nincreased competitive activity from companies in the skin care, makeup, fragrance and hair care businesses;\n(2)\nour ability to develop, produce and market new products on which future operating results may depend and to successfully address challenges in our business;\n(3)\nconsolidations, restructurings, bankruptcies and reorganizations in the retail industry causing a decrease in the number of stores that sell our products, an increase in the ownership concentration within the retail industry, ownership of retailers by our competitors or ownership of competitors by our customers that are retailers and our inability to collect receivables;\n(4)\ndestocking and tighter working capital management by retailers;\n53\nTable of Contents\nTHE ESTÉE LAUDER COMPANIES INC.\n(5)\nthe success, or changes in timing or scope, of new product launches and the success, or changes in timing or scope, of advertising, sampling and merchandising programs;\n(6)\nshifts in the preferences of consumers as to how they perceive value and where and how they shop;\n(7)\nsocial, political and economic risks to our foreign or domestic manufacturing, distribution and retail operations, including changes in foreign investment and trade policies and regulations of the host countries and of the United States;\n(8)\nchanges in the laws, regulations and policies (including the interpretations and enforcement thereof) that affect, or will affect, our business, including those relating to our products or distribution networks, changes in accounting standards, tax laws and regulations, environmental or climate change laws, regulations or accords, trade rules and customs regulations, and the outcome and expense of legal or regulatory proceedings, and any action we may take as a result;\n(9)\nforeign currency fluctuations affecting our results of operations and the value of our foreign assets, the relative prices at which we and our foreign competitors sell products in the same markets and our operating and manufacturing costs outside of the United States;\n(10)\nchanges in global or local conditions, including those due to volatility in the global credit and equity markets, government economic policies, natural or man-made disasters, real or perceived epidemics, supply chain challenges, inflation, or increased energy costs, that could affect consumer purchasing, the willingness or ability of consumers to travel and/or purchase our products while traveling, the financial strength of our customers, suppliers or other contract counterparties, our operations, the cost and availability of capital which we may need for new equipment, facilities or acquisitions, the returns that we are able to generate on our pension assets and the resulting impact on funding obligations, the cost and availability of raw materials and the assumptions underlying our critical accounting estimates;\n(11)\nshipment delays, commodity pricing, depletion of inventory and increased production costs resulting from disruptions of operations at any of the facilities that manufacture our products or at our distribution or inventory centers, including disruptions that may be caused by the implementation of information technology initiatives, or by restructurings;\n(12)\nreal estate rates and availability, which may affect our ability to increase or maintain the number of retail locations at which we sell our products and the costs associated with our other facilities;\n(13)\nchanges in product mix to products which are less profitable;\n(14)\nour ability to acquire, develop or implement new information technology, including operational technology and websites, on a timely basis and within our cost estimates; to maintain continuous operations of our new and existing information technology; and to secure the data and other information that may be stored in such technologies or other systems or media;\n(15)\nour ability to capitalize on opportunities for improved efficiency, such as publicly-announced strategies and restructuring and cost-savings initiatives, and to integrate acquired businesses and realize value therefrom;\n(16)\nconsequences attributable to local or international conflicts around the world, as well as from any terrorist action, retaliation and the threat of further action or retaliation;\n(17)\nthe timing and impact of acquisitions, investments and divestitures; and\n(18)\nadditional factors as described in our filings with the Securities and Exchange Commission, including the Annual Report on Form 10-K for the fiscal year ended June 30, 2025.\nWe assume no responsibility to update forward-looking statements made herein or otherwise."
}