{
  "source_file": "elv-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS.\nGeneral\nElevance Health and its direct and indirect subsidiaries, referred to throughout this document as “we,” “us,” “our,” the “Company” or “Elevance Health,” is a leading health company bringing together the concepts of elevate and advance, in order to exemplify and follow our purpose of improving the health of humanity. We serve people across their entire health journey to better address their full range of needs with an integrated whole-health approach. Through our broad view, we aim to meaningfully improve the health of the people and communities we serve. We strive to deliver on our mission by maximizing the power of partnerships, innovating to fuel growth and health equity, and maintaining a high-performance culture. Our strategy is to be a lifetime trusted health partner through the following four core competencies:\nWith an unyielding commitment to meeting the needs of our diverse customers, we are guided by the following values:\nWe are one of the largest health insurers in the United States in terms of medical membership, serving approximately 45.7 million medical members through our affiliated health plans as of December 31, 2024. We offer a broad spectrum of \n-3-\nnetwork-based managed care risk-based plans to Individual, Employer Group, Medicaid and Medicare markets. In addition, we provide a broad array of managed care services to fee-based customers, including claims processing, stop loss insurance, provider network access, medical management, care management, wellness programs, actuarial services and other administrative services. We provide services to the federal government in connection with our Federal Health Products & Services business, which administers the Federal Employee Program\n®\n (“FEP\n®\n”). We provide an array of specialty services both to customers of our subsidiary health plans and to unaffiliated health plans, including pharmacy services, stop loss insurance, dental, vision and supplemental health insurance benefits, as well as integrated health services.\n We are an independent licensee of the Blue Cross and Blue Shield Association (“BCBSA”), an association of independent health benefit plans. We serve our members as the Blue Cross licensee for California and as the Blue Cross and Blue Shield (“BCBS”) licensee for Colorado, Connecticut, Georgia, Indiana, Kentucky, Maine, Missouri (excluding 30 counties in the Kansas City area), Nevada, New Hampshire, New York (in the New York City metropolitan area and upstate New York), Ohio, Virginia (excluding the Northern Virginia suburbs of Washington, D.C.) and Wisconsin. In a majority of these service areas, we do business as Anthem Blue Cross and Anthem Blue Cross and Blue Shield. We also conduct business through arrangements with other BCBS licensees, as well as other strategic partners. In addition, we serve members in numerous states as Wellpoint, Carelon, MMM and/or Simply Healthcare. We are licensed to conduct insurance operations in all 50 states, the District of Columbia and Puerto Rico through our subsidiaries. Through various subsidiaries, we also offer pharmacy services through our CarelonRx business, and other healthcare related services as Carelon Insights and Carelon Health. \n We have organized our brand portfolio into the following core go-to-market brands:\n•\nAnthem Blue Cross/Anthem Blue Cross and Blue Shield — represents our Anthem-branded and affiliated Blue Cross and/or Blue Shield licensed plans;\n•\nWellpoint — unites select non-BCBSA licensed Medicare, Medicaid and commercial plans under the Wellpoint name; and\n•\nCarelon — this brand brings together our healthcare related services and capabilities, including our CarelonRx and Carelon Services businesses, under a single brand name.\n We report our results of operations in the following four reportable segments: Health Benefits, CarelonRx, Carelon Services and Corporate & Other (our businesses that do not individually meet the quantitative thresholds for an operating segment, as well as corporate expenses not allocated to our other reportable segments). \nFor additional discussion, see “Reportable Segments” below in this “Business” section and Note 1, “Organization,” and Note 20, “Segment Information,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nWe believe healthcare is local and that we have the strong local presence required to understand and meet local customer needs with regard to any product customers are enrolled in with us. Further, we believe we are well-positioned to deliver what customers want: innovative, choice-based and affordable products; distinctive service; simplified transactions; and better access to information for quality care. Our local presence, combined with our national expertise, has created opportunities for collaborative programs that reward physicians and hospitals for clinical quality and excellence. We feel that our commitment to health improvement and care management provides added value to customers and healthcare professionals. Ultimately, we believe that practical and sustainable improvements in healthcare must focus on improving healthcare quality while managing costs for total affordability. We have implemented initiatives driving payment innovation and partnered with providers to lower cost and improve the quality of healthcare for our members, and we continue to develop new and innovative ways to effectively manage risk and engage our members. Further, we continue to expand our financial arrangements with providers to implement payment models that advance value-based care. We believe focusing on quality of care rather than volume of care is the foundation for improving patient outcomes. Our value-based payment models support patient-centered care by improving collaboration between providers and health partners and delivering to our members the right care, at the right time, in the right place. In addition, we are focused on achieving efficiencies from our national scale while optimizing service performance for our customers. Finally, we expect to continue to rationalize our portfolio of businesses and products and align our investments to optimize our core businesses, invest in high-growth opportunities, and accelerate value creation through expanded capabilities and services.\n -4-\nImpact on Our Results of Operations\nOur results of operations depend in large part on our ability to accurately predict and effectively manage healthcare costs through effective contracting with providers of care to our members, product pricing, medical management and health and wellness programs, including service coordination and case management for addressing complex and specialized healthcare needs, innovative product design and our ability to maintain or achieve improvement in our Centers for Medicare and Medicaid Services (“CMS”) Star Ratings. CMS Star Ratings affect Medicare Advantage plan reimbursements as well as our eligibility to earn quality-based bonus payments for those plans. See “Regulation” below in this “Business” section for additional information on our CMS Star Ratings.\n For additional information on our networks and provider relations, product pricing and healthcare cost management programs, see “Pricing and Underwriting of Our Products,” “Networks and Provider Relations,” “Medical Management Programs,” “Care Management and Wellness Products and Programs” and “Healthcare Quality Initiatives” below in this “Business” section.\nAdvances in medical technology, including new specialty drugs, and new indications for existing prescription drugs, changes in regulations, the aging population and other demographic characteristics continue to contribute to rising healthcare costs. Our managed care plans and products are designed to encourage providers and members to participate in quality, cost-effective health benefit programs by using the full range of our innovative medical management services, health outcomes-based initiatives and health quality-based financial incentives. We believe our market position and high business retention rates will enable us to realize the long-term benefits of investing in preventive and early detection programs. Our ability to provide cost-effective health benefits products and services is enhanced through a disciplined approach to internal cost containment, prudent management of our risk exposure and successful integration of acquired businesses. In addition, our ability to manage operating expenses continues to be a driver of our overall profitability.\nOur future results of operations will be impacted by certain external forces and resulting changes in our business model and strategy. Changes to our business environment will continue as elected officials at the national and state levels enact modifications to existing laws and regulations, including changes to available subsidies, taxes and fees. For additional discussion, see “Regulation” below in this “Business” section and Part I, Item 1A “Risk Factors” included in this Annual Report on Form 10-K.\nOur results of operations are also impacted by levels and mix of membership, which has changed, and will continue to change, as a result of the quality and pricing of our health benefits products and services, Medicaid redeterminations, an aging population, healthcare utilization patterns, previously uninsured members entering the healthcare system, provider and member fraud, economic conditions, changes in unemployment, the continued and future impact of large-scale emergencies, acquisitions, entry into new markets and expansions in or exits from existing markets. These membership trends could be negatively impacted by various factors that could have a material adverse effect on our future results of operations such as general economic downturns that result in business failures, failure to obtain new customers or retain existing customers, premium increases, benefit changes, changes in how our members access healthcare services or our exit from a specific market. See Part I, Item 1A “Risk Factors” and Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in this Annual Report on Form 10-K.\nWe continue to enhance interactions with customers, providers, brokers, agents, employees and other stakeholders through digital technology and improvements to internal operations. Our approach includes not only the sales and distribution of health benefits products through digital technology, but also implementing advanced capabilities that improve services benefiting customers, agents, brokers and providers while optimizing administrative costs. These enhancements can also help improve the quality, coordination and safety of healthcare through increased communications between patients and their physicians.\nThrough our participation in various federal government programs, we generated approximately 31%, 29% and 28% of our total consolidated revenues from agencies of the U.S. government for the years ended December 31, 2024, 2023 and 2022, respectively. The majority of these revenues are contained in our Health Benefits segment as described below. An immaterial amount of our total consolidated revenues is derived from activities outside of the U.S. and Puerto Rico.\n -5-\nReportable Segments\nWe report our results of operations in the following four reportable segments: Health Benefits, CarelonRx, Carelon Services and Corporate & Other (our businesses that do not individually meet the quantitative thresholds for an operating segment, as well as corporate expenses not allocated to our other reportable segments).\nOur Health Benefits segment offers a comprehensive suite of health plans and services to our Individual, Employer Group risk-based, Employer Group fee-based, BlueCard\n®\n, Medicare, Medicaid and FEP\n®\n members. The Health Benefits segment offers health products on a full-risk basis; provides a broad array of administrative managed care services to our fee-based customers; and provides a variety of specialty and other insurance products and services such as stop loss, dental, vision and supplemental health insurance benefits.\nOur CarelonRx segment includes our pharmacy services business. CarelonRx markets and offers pharmacy services to our affiliated health plan customers, as well as to external customers outside of the health plans we own. CarelonRx offers a comprehensive portfolio of pharmacy services, which includes all core pharmacy services, such as home delivery and specialty pharmacies, claims adjudication, formulary management, pharmacy networks, rebate administration, a prescription drug database and member services. In addition, CarelonRx includes ambulatory infusion centers, added to our portfolio in March 2024 through our acquisition of Paragon Healthcare, Inc. and its subsidiaries.\nOur Carelon Services segment integrates physical, behavioral, pharmacy, and social services with the aim of delivering whole health affordably by offering a broad array of healthcare related services and capabilities to internal and external customers through our Carelon Health and Carelon Insights businesses. Our Carelon businesses promote affordability by managing complex areas of the healthcare system, leveraging data and insights to improve how our members receive safe, appropriate, high-quality care and providers are reimbursed accurately and timely. Our approach to cost management relies on capabilities including provider enablement, value-based networks, member engagement, and utilization management. Our care delivery services primarily target serving chronic and complex populations by providing personalized care in the home and virtually. As a part of Carelon Health, we completed our acquisition of RSV QOZB LTSS, Inc. and certain affiliated entities (d/b/a CareBridge) at the end of 2024, which provides virtual care to complex Medicaid and Medicare patients and supports plans in managing home and community-based services.\nOur Corporate & Other segment includes our businesses that do not individually meet the quantitative threshold for an operating segment, as well as corporate expenses not allocated to our other reportable segments.\nFor additional information, see Note 20, “Segment Information,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K. \nMembership\nOur medical membership includes the following customer types: Individual, Employer Group risk-based, Employer Group fee-based, BlueCard\n®\n,\n \nMedicare, Medicaid and FEP\n®\n. In addition, we also serve customers who purchase one or more of our other products or services that are often ancillary to our health business. \nOur products are generally developed and marketed with an emphasis on the differing needs of our customers. In particular, our product development and marketing efforts take into account the differing characteristics between the various customers served by us, as well as the unique needs of educational and public entities, labor groups, the FEP\n®\n, national employers and state-run programs servicing low-income, high-risk and underserved markets. Overall, we seek to establish pricing and product designs to provide value for our customers while achieving an appropriate level of profitability for each of our customer categories balanced with the competitive objective to grow market share. We believe that one of the keys to our success has been our focus on these distinct customer types, which better enables us to develop benefit plans and services that meet our customers’ unique needs.\nWe market our Individual, Medicare and certain Employer Group products with a smaller employee base through direct marketing activities and an extensive network of independent agents, brokers and retail partnerships. Products for commercial customers with a larger employee base are generally sold through independent brokers or consultants retained by the customer who work with industry specialists from our in-house sales force. In the Individual markets, we offer on-exchange products through state- or federally-facilitated marketplaces (the “Public Exchange”) in compliance with the Patient \n -6-\nProtection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended (collectively, the “ACA”) and off-exchange products. Federal subsidies are available for certain members, subject to eligibility, who purchase Public Exchange products.\nWe continue to participate in the Public Exchange in nearly all of our Anthem Blue Cross and Anthem Blue Cross and Blue Shield service areas.\n \nWe anticipate growth in our Public Exchange membership as former Medicaid members, no longer eligible for Medicaid coverage, continue to seek alternative coverage options. Additionally, we are entering select service areas in Florida, Maryland, and Texas in 2025, using our Simply Healthcare and Wellpoint brands, and we are actively evaluating expansion opportunities in additional marketplaces beyond 2025. See “Regulation” below in this “Business” section for additional discussion about the Public Exchange marketplace. \nBeing a licensee of the BCBS association of companies, of which there were 33 independent primary licensees including us as of December 31, 2024, provides significant market value, especially when competing for very large multi-state employer groups. For example, each BCBS member company is able to utilize other BCBS licensees’ substantial provider networks and discounts when any BCBS member works or travels outside of the state in which their policy is written. This program is referred to as BlueCard\n®\n. BlueCard\n®\n host members are generally members who reside in or travel to a state in which an Elevance Health subsidiary is the Blue Cross and/or Blue Shield licensee and who are covered under an employer-sponsored health plan serviced by a non-Elevance Health controlled BCBS licensee, which is the “home” plan. We perform certain administrative functions for BlueCard\n® \nhost members, including claims pricing and administration, for which we receive service fees from the BlueCard\n®\n members’ home plan. Other administrative functions, including maintenance of enrollment information and customer services, are performed by the home plan. See “BCBSA Licenses” below in this “Business” section for additional information on our BCBSA licenses. We refer to members in our service areas licensed by the BCBSA as our BCBS-branded, or Anthem BCBS, business. Non-BCBS-branded business refers to members in our non-BCBS-branded plans, which include Wellpoint, MMM and Simply Healthcare plans.\nFor additional information describing each of our customer types and changes in medical membership over the last three years, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations - \nMembership\n” included in Part II, Item 7 of this Annual Report on Form 10-K.\nProduct and Service Descriptions\nVarious forms of managed care products have been developed to contain the cost of healthcare by negotiating contracts with hospitals, physicians and other providers to deliver high-quality healthcare to members at favorable rates. These products usually feature medical management and other quality and cost optimization measures such as pre-admission review and approval for certain non-emergency services, pre-authorization of outpatient surgical procedures, network credentialing to determine that network physicians and hospitals have the required certifications and expertise, and various levels of care management programs to help members better understand and navigate the healthcare system. In addition, providers may have incentives to achieve certain quality measures, may share medical cost risk or may have other incentives to deliver quality medical services in a cost-effective manner. Also, certain plans offer members incentives for healthy behaviors, such as smoking cessation and weight management. Members are charged periodic, prepaid premiums and generally pay copayments, coinsurance and/or deductibles when they receive services.\nHealth Benefits\n•\nCommercial Risk-Based Products.\n \nWe offer employer groups a diversified mix of managed care risk-based products including: Preferred Provider Organization (“PPO”), Health Maintenance Organization (“HMO”), Consumer-Driven Health Plans (“CDHP”), Traditional Indemnity and Point-of-Service (“POS”) plans. PPO plans generally provide members the freedom to choose any healthcare provider, but require the member to pay a greater portion of the provider’s fee in the event the member chooses not to use a provider participating in the PPO’s network. HMOs include comprehensive managed care benefits generally through a participating network of physicians, hospitals and other providers. CDHPs generally combine a high-deductible PPO plan with an employer-funded and/or employee-funded personal care account, which may result in tax benefits to the employee and allow some or all of the dollars remaining in the personal care account at year-end to be rolled over to the next year for future healthcare needs. Traditional indemnity plans offer the member an option to select any healthcare provider for covered services, with coverage subject to deductibles and coinsurance and with member cost-sharing usually limited by out-of-pocket maximums. POS products \n -7-\nblend the characteristics of HMO, PPO and indemnity plans. In general, POS plans allow members to choose to seek care from a provider within the plan’s network or outside the network, subject to, among other things, certain deductibles and coinsurance.\nWe also offer Individual risk-based products on and off the Public Exchange, covering essential health benefits (as defined in the ACA) along with many other requirements and cost-sharing features.\n•\nCommercial Fee-Based Products.\n \nWe provide a broad array of managed care services to fee-based groups, including claims processing, provider network access, medical management, care management and wellness programs, actuarial services and other administrative services. Fee-based health plans are also able to use our provider networks and to realize savings through our negotiated provider arrangements, while allowing employers the ability to design certain health benefit plans in accordance with their own requirements and objectives. We also charge a premium to underwrite stop loss insurance for employers that maintain fee-based plans but want to limit their retained risk.\nIn addition, we perform certain administrative functions for BlueCard\n®\n host members, discussed under “Membership” above, including claims pricing and administration, for which we receive service fees from the BlueCard\n®\n members’ home plans. Other administrative functions, including maintenance of enrollment information and customer service, are performed by the home plan.\n•\nSpecialty Products. \nWe offer an array of products and services to both risk-based and fee-based customers in conjunction with our health plans as well as to unaffiliated healthcare plans that are not Elevance Health subsidiaries.\n◦\nStop Loss Insurance. \nOur stop loss insurance arrangements are built around our clients’ needs while assuming 100% of the risk. We offer specific and aggregate plans that will provide options to meet our clients’ coverage terms, budget and risk tolerance; active claims management to help avoid errors and missing claims; as well as cost containment to assist our clients with claims and cost control.\n◦\nDental. \nOur dental plans include networks in certain states in which we operate and are offered on both a risk-based and fee-based basis. Our members also have access to additional dental providers through our participation in the National Dental GRID, a national dental network developed by and for BCBS plans that offers in-network discounts across the country.\n◦\nVision.\n \nOur vision plans include networks within the states in which we operate and are offered on both a risk-based and fee-based basis.\n◦\nSupplemental Health.\n \nWe offer supplemental health products, including accident, critical illness and hospital indemnity, which provide coverage for specific conditions or circumstances.\n•\nMedicare Plans. \nWe offer a wide variety of plans, products and options to individuals age 65 and older such as Medicare Advantage, including Special Needs Plans (“SNPs”), dual-eligible programs through Medicare-Medicaid Plans (“MMPs”), Medicare Supplement plans and Medicare Part D Prescription Drug Plans (“Medicare Part D”). \nMedicare Advantage plans provide Medicare beneficiaries with a managed care alternative to traditional Medicare and often include a Medicare Part D benefit. In addition, our Medicare Advantage SNPs provide tailored benefits to special needs individuals who are institutionalized or have severe or disabling chronic conditions and to dual-eligible customers, who are low-income seniors and persons under age 65 with disabilities. Medicare Advantage SNPs are coordinated care plans specifically designed to provide targeted care, covering all the healthcare services considered medically necessary for members and often providing professional care coordination services, with personal guidance and programs that help members maintain their health. Medicare Advantage membership also includes Medicare Advantage members in our Group Retiree Solutions business who are retired members of commercial accounts or groups who are not affiliated with our commercial accounts that have selected a Medicare Advantage product through us. MMP is focused on serving members who are dually eligible for Medicaid and Medicare. Medicare Supplement plans typically pay the difference between healthcare costs incurred by a beneficiary and amounts paid by the traditional Medicare Fee-For-Service program. Medicare Part D offers a prescription drug plan to Medicare and MMP beneficiaries. \n•\nMedicaid Plans and Other State-Sponsored Programs. \nOur Medicaid business includes our managed care alternatives through public-funded healthcare programs, including Medicaid; Medicaid expansion programs; Temporary Assistance for Needy Families (“TANF”); programs for seniors and people with disabilities (“SPD”); Children’s Health Insurance \n -8-\nPrograms (“CHIP”); and specialty programs such as those focused on long-term services and support (“LTSS”), HIV/AIDS, children living in foster care, behavioral health and/or substance abuse disorders, and intellectual disabilities and/or developmental disabilities. The Medicaid program makes federal matching funds available to all states for the delivery of healthcare benefits for low income and/or high medical risk individuals. These programs are managed by the individual states based on broad federal guidelines. Our Medicaid plans also cover certain dual-eligible customers, as previously described above, who also receive Medicare benefits. In 2024, we provided Medicaid and other state sponsored services, such as administrative services, in Arkansas, California, Colorado, District of Columbia, Florida, Georgia, Indiana, Iowa, Kentucky, Louisiana, Maryland, Minnesota, Missouri, Nebraska, Nevada, New Jersey, New York, North Carolina, Ohio, Puerto Rico, South Carolina, Tennessee, Texas, Virginia, Washington, West Virginia and Wisconsin.\n•\nFederal Employee Program\n®\n. \nFEP\n®\n members consist of United States government employees and their dependents within our geographic markets.\n•\nMedicare Administrative Operations.\n \nWe serve as a fiscal intermediary, carrier and Medicare administrative contractor for the federal government by providing administrative services for the Medicare program, Parts A and B, which generally provides coverage for persons who are 65 or older and for persons who are under 65 and disabled or with end-stage renal disease. Part A of the Medicare program provides coverage for services provided by hospitals, skilled nursing facilities and other healthcare facilities. Part B of the Medicare program provides coverage for services provided by physicians, physical and occupational therapists and other professional providers, as well as certain durable medical equipment and medical supplies.\n Carelon\nCarelon integrates physical, behavioral, social and pharmacy services to deliver whole health affordably by creating value through the offering of market-competitive services powered by analytics. \nCarelonRx\nOur subsidiary CarelonRx markets and offers pharmacy services to our affiliated health plan customers throughout the country, as well as to customers outside of the health plans we own. Our comprehensive pharmacy services portfolio includes all core pharmacy services, such as home delivery and specialty pharmacies, claims adjudication, formulary management, pharmacy networks, rebate administration, a prescription drug database and member services, as well as infusion services and injectable therapies through owned ambulatory infusion centers. \nCarelonRx delegates certain core pharmacy services to CaremarkPCS Health, L.L.C., which is a subsidiary of CVS Health Corporation (“CVS”), pursuant to an agreement (the “CVS Agreement”) with the current contractual term extending through December 31, 2027. We can elect to have CVS continue to provide services to us for a three-year extension period on the same terms and conditions as in the current CVS Agreement in the event of a termination or non-renewal by either party.\nCarelon Services\n \nCarelon Services integrates physical, behavioral, pharmacy, and social services with the aim of delivering whole health affordably by offering a broad array of healthcare related services and capabilities to internal and external customers through our Carelon Health and Carelon Insights businesses. Carelon businesses promote affordability by managing complex areas of the healthcare system, leveraging data and insights to improve how our members receive safe, appropriate, high-quality care and providers are reimbursed accurately and timely. Our approach to cost management relies on capabilities including provider enablement, value-based networks, member engagement, and utilization management. Our care delivery services primarily target serving the chronic and complex populations by providing personalized care in the home and virtually.\n•\nCarelon Health: \nCarelon Health\n, \npowered by clinical excellence, curates value-based whole health solutions for populations, one person at a time. Carelon Medical Benefits Management provides specialty care enablement and utilization management support for specialized clinical domains. Carelon Post Acute Solutions manages home health, post-acute institutional management, and durable medical equipment costs. Carelon Behavioral Health provides comprehensive behavioral health management services through clinical services and network \n -9-\nadministration. Carelon Care Navigation provides comprehensive care management services. Our Carelon Advanced Primary Care business includes palliative care services and management of our partnership with Augusta Topco Holdings L.P. (“Mosaic Health”), a joint venture with Clayton, Dubilier & Rice (“CD&R”). At the end of 2024, we completed our acquisition of CareBridge, which provides virtual care to complex Medicaid and Medicare patients and supports plans in managing home and community-based services.\n•\nCarelon Insights: \nCarelon Insights aims to improve the health of the healthcare system by simplifying workflows and providing real-time insights. Carelon Insights capabilities include payment integrity, subrogation, clinical data exchange through our HealthOS platform, research and data services, reporting and clinical analytics, and information technology services and global business process support. \nCompetition\nThe managed care industry is highly competitive, both nationally and in our local markets. Competition continues to be intense due to aggressive marketing, pricing, bid activity for government-sponsored programs, business consolidations, new strategic alliances, new competitors in the market, a proliferation of new products, technological advancements, the impact of legislative reform, increased quality awareness and price sensitivity among customers and changing market practices, such as increased usage of telehealth.\nWe believe that participants in the managed care industry compete for customers based on quality of service, price, access to provider networks, access to care management and wellness programs (including health information), innovation, effective use of digital technology, breadth and flexibility of products and benefits, expertise and reputation (including National Committee on Quality Assurance (“NCQA”) accreditation status as well as CMS Star Ratings), brand recognition and financial stability. Our ability to attract and retain customers is substantially tied to our ability to distinguish ourselves from our competitors in these areas.\nWe believe our exclusive right to market products under the most recognized brand in the industry, BCBS, in our most significant markets provides us with greater brand recognition over competitive product offerings. Typically, we are the largest participant in each of our BCBS branded markets, and thus are closely watched by other health benefits companies.\nProduct pricing remains competitive, and we strive to price our health benefit products and design our Medicare and Medicaid bids consistent with anticipated underlying medical trends. We believe our pricing and bid strategy, based on predictive modeling, proprietary research and data-driven processes, has positioned us to benefit from the potential growth opportunities available through entry into new markets, expansions in existing markets and as a result of any future changes to the current regulatory scheme. We believe that our pricing and bid strategy, brand name and network quality will provide a strong foundation for membership growth opportunities in the future. \nOur provider networks give us a highly competitive unit cost position and provide distinctive service levels which allow us to offer a broad range of affordable health benefit products to our customers. To build our provider networks, we compete with other health benefits plans for the best contracts with hospitals, physicians and other providers. We believe that physicians and other providers primarily consider customer volume, reimbursement rates, timeliness of reimbursement and administrative service capabilities along with the reduction of non-value added administrative tasks when deciding whether to contract with a health benefits plan.\nAt the sales and distribution level, we compete for qualified agents and brokers to recommend and distribute our products. Strong competition exists among insurance companies and health benefits plans for agents and brokers with demonstrated ability to secure new business and maintain existing accounts. We believe that the quality and price of our products, support services, reputation and prior relationships, along with a reasonable commission structure, are the factors agents and brokers consider in choosing whether to market our products. We believe that we have good relationships with our agents and brokers, and that our products, support services and commission structure compare favorably to those of our competitors in all of our markets. \nIn addition, the pharmacy industry is highly competitive, and CarelonRx is subject to competition from national, regional and local pharmacy service providers, insurers, health plans, large retail pharmacy chains, large retail stores, supermarkets, mail order pharmacies, web pharmacies and specialty pharmacies. Strong competition within the pharmacy industry has \n -10-\ngenerated greater demand for lower product and service pricing, increased revenue sharing and enhanced product and service offerings.\nPricing and Underwriting of Our Products\nWe price our products based on our assessment of current healthcare claim costs and emerging healthcare cost trends, combined with charges for administrative expenses, risk and profit. We continually review our product designs and pricing guidelines on a national and regional basis so that our products remain competitive and consistent with our strategies and profitability goals.\nOur revenue on Medicare policies is based on annual bids submitted to CMS. We base the commercial and Medicaid premiums we charge and our Medicare bids on our estimates of future medical costs over the fixed contract period. In applying our pricing to each employer group and customer, we aim to maintain consistent, competitive and disciplined underwriting standards. We employ our proprietary accumulated actuarial and financial data to determine underwriting and pricing parameters for both our risk-based and fee-based businesses. \nIn most circumstances, our pricing and underwriting decisions follow a prospective rating process in which a fixed premium is determined at the beginning of the contract period. For our risk-based business, any deviation, favorable or unfavorable, from the medical costs assumed in determining the premium is our responsibility. Some of our larger groups employ retrospective rating reviews, where positive experience is partially refunded to the group, and negative experience is charged against a rate stabilization fund established from the group’s favorable experience or charged against future favorable experience. In addition, our ACA and government risk-based contracts may include minimum medical loss ratio, risk adjustment, or risk corridor arrangements, which also stabilize premiums based upon claims experience.\nOur pharmacy services pricing through CarelonRx is presented to market via discounts off the average wholesale price for drugs dispensed through the retail, mail and specialty channels as well as through rebate projections. We utilize group-specific script data, formulary, network and clinical care program selection combined with administrative expense, risk and profit guidance to set market competitive pricing discounts and rebate projections. Pharmacy services pricing guidelines guide the underwriting process and undergo an annual external review process to ensure market competitiveness.\nNetworks and Provider Relations\nOur relationships with physicians, hospitals and professionals that render healthcare services to our members are guided by local, regional and national standards for network development, reimbursement and contract methodologies. While following industry standards, we are simultaneously seeking to lead transformation efforts within our healthcare system, moving from a fragmented model premised on episodic intervention to one based on proactive, coordinated care built around the whole health needs of the patient.\n We establish “market-based” hospital reimbursement payments that we believe are fair, but aggressive, and among the most competitive in the market. We also seek to ensure that physicians in our network are paid in a timely manner at appropriate rates. In most instances, we deploy multi-year contracting strategies, including fixed case rates and fee schedules, to limit our exposure to medical cost inflation and to increase cost predictability. We maintain both broad and narrow provider networks to ensure member choice, based on both price and access needs, while implementing programs designed to improve the quality of care our members receive. Increasingly, we are supplementing our broad-based networks with smaller or more cost-conscious networks that are designed to be attractive to a more price-sensitive customer segment, such as Public Exchange customers.\n \nOur reimbursement strategies are tailored to each market and reflect the degree of consolidation and integration of physician groups and hospitals. Under a fee-for-service reimbursement methodology for physicians, fee schedules are developed at the state level based on an assessment of several factors and conditions, including the CMS resource-based relative value system (“RBRVS”), medical practice cost inflation and physician supply of each specialty. We utilize CMS RBRVS fee schedules as a reference point for fee schedule development and analysis. The RBRVS structure was developed, maintained, and updated by CMS and is used by the Medicare program and other major health plans. In addition, we have implemented and continue to expand physician incentive contracting, which ties physician payment levels to performance on efficiency, clinical and patient experience measures.\n -11-\n \nWhile we generally do not delegate full financial responsibility to our physician providers in the form of capitation-based reimbursement, we maintain capitation-based arrangements in certain markets where we determine that market dynamics result in it being a useful method to lower costs and reduce underwriting risk. Our provider engagement and contracting strategies have evolved to include value-based contracting arrangements that meet providers where they are in the movement from traditional fee-for-service to value-based care. These programs are designed to support commercial, Medicare and Medicaid programs and the unique characteristics of these populations. Our value-based contracting programs are designed to reward our contracted providers for improving the overall quality of care they deliver by adhering to evidence-based medicine. In addition, these value-based contracts also share with the providers total cost of care savings that are achieved by adhering to evidence-based medicine over time. For providers who contract in one of our value-based programs, we work with them to share gaps in care information and other important data to assist them in managing the care of their patients. Often providers will also grant us access to data to support the efficient administration of program components. This data can allow us to more efficiently capture information regarding the risk of our membership and the overall adherence to evidence-based medicine, as well as information to more efficiently perform utilization management administration.\n Our hospital contracts provide for a variety of reimbursement arrangements depending on local market dynamics and current hospital utilization efficiency. Most hospitals are reimbursed a per-case amount, per admission, for inpatient covered services. Our “per-case” reimbursement methods utilize many of the same attributes contained in Medicare’s Diagnosis Related Groups methodology. Hospital outpatient services are reimbursed by fixed case rates, fee schedules or percent of approved charges. A small percentage of hospitals, primarily rural, sole community hospitals, are reimbursed on a discount from approved charge basis for covered outpatient services. Our hospital contracts recognize unique hospital attributes, such as academic medical centers or sole community hospitals, and the volume of care performed for our members. To improve predictability of expected costs, we frequently use a multi-year contracting approach with providers. In addition, the majority of our hospital contracts include a pay-for-performance component where reimbursement levels are linked to improved clinical performance, patient safety and medical error reduction. \nSeasonality\nWithin our Health Benefits segment, although premium revenues for our commercial business are not seasonal, our benefit costs rise as members pay their contractual portion of claims responsibility, hitting their deductibles and out-of-pocket maximums. Seasonality in our Medicaid business can vary depending on the timing of the recognition of premium rates during the year, and we typically experience additional costs in our Medicare business in the fourth quarter to support the annual enrollment period. \nOur Carelon Services segment engages in risk-based contracts with members across many health plans including Elevance Health plans. These risk-based contracts allow our Health Benefits segment to reduce medical expense variability by replacing seasonal claims costs with agreed-upon pricing. Seasonality in our Carelon Services segment aligns with the claims and revenue seasonality for services covered, which can vary by Carelon product and line of business. As the year progresses, members will generally reach their deductible and out-of-pocket maximum limit, and benefit expense in our Carelon Services businesses will typically increase to cover member costs.\nMedical Management Programs\nWe have a broad array of medical management activities that facilitate improvements in the quality of care provided to our members and promote cost-effective medical care. These medical management activities and programs are administered and directed by physicians and nurses with the goal of ensuring that the care delivered to our members is supported by appropriate medical and scientific evidence, is received on a timely basis and occurs in the most appropriate setting. The medical management programs available to our members may vary depending on the particular plan or product in which they participate. \nCare coordination is one of the strategies we utilize and is based on nationally recognized criteria developed by third-party medical specialists to help coordinate inpatient as well as outpatient care and monitor appropriate utilization of such services. Our case management focuses on identifying\n \nmembership that will require a high level of intervention and providing assistance to manage their healthcare needs. Precertification is utilized to assess appropriateness of certain medical services and sites of care prior to the services being rendered. Our medical policy committee determines our national policies \n -12-\nand guidelines for the application of medical technologies, procedures and services and reviews these policies and guidelines at least once a year or as new published clinical evidence becomes available. We are actively engaged with our hospital and physician networks to enable them to achieve better outcomes for our members. We also work with outside experts through a process of external review to provide our members scientifically and clinically evidence-based medical care. Our web-based tools allow our members to obtain or compare cost estimates for care, including out-of-pocket costs.\nWe remain committed to assisting our members in making informed and value-based healthcare decisions, providing for easier navigation of healthcare services and delivering a better healthcare experience. \nCare Management and Wellness Products and Programs  \nWe continue to expand our suite of integrated care management programs and tools. Availability of these programs and tools to our members may depend on the particular plan or product in which they participate. Our care management tools and programs are designed to increase quality and reduce medical costs for our members and help them make better decisions about their well-being as they navigate the healthcare system. Our digital engagement platform, Sydney Health, is designed to give our members access to personalized health and wellness resources, medical, pharmacy, dental and vision benefits details, and virtual care services, all in one place. Our care management, infertility services and maternity management programs serve as adjuncts to physician care. Through these programs, medical professionals help to educate participants regarding their care and condition. Our 24/7 NurseLine offers access to qualified, registered nurses to allow our members to make informed decisions about the appropriate level of care and avoid unnecessary worry. Our Carelon Palliative Care Services subsidiary engages with members near end of life and/or requiring palliative care to manage serious illnesses and improve quality of life during a difficult time. With our integrated information systems and sophisticated data analytics, we help our members improve their compliance with evidence-based care guidelines, provide personal care notes that alert members to potential gaps in care, enable more prudent healthcare choices and assist in the realization of member out-of-pocket cost savings. Our employee assistance programs provide 24/7 telephonic support for personal and crisis events and provide resources such as counseling and referral assistance with childcare, health and wellness, financial issues, legal issues, adoption and daily living. We have a comprehensive behavioral health case management program supporting a wide range of members who are impacted by their behavioral health conditions, including specialty areas such as eating disorders, anxiety, depression and substance abuse. The program assists members and their families with obtaining appropriate behavioral health treatment, offering community resources, providing education and telephonic support, and promoting provider collaboration. \nHealthcare Quality Initiatives \nIncreasingly, the healthcare industry is able to define quality healthcare based on effective, safe, equitable and affordable care in preventive health, and optimal care management for chronic disease. A key to our success has been our ability to develop partnerships by working with our network physicians, hospitals, and social resources providers to improve the quality outcomes of the healthcare and social impact services provided to our members, their families, and the community-at-large. Our ability to promote quality medical care and patient safety, address health-related social risks and advance health equity has been recognized by the National Committee for Quality Assurance (“NCQA”), the largest and most respected national accreditation program for managed care health plans, and our company was awarded the NCQA 2023-2024 Innovation Award for the advancement of better maternal and neonatal outcomes.\nSeveral quality healthcare measures, including the Healthcare Effectiveness Data and Information Set (“HEDIS\n®\n”), have been incorporated into NCQA’s accreditation processes. HEDIS\n®\n measures range from preventive services, such as screening mammography and pediatric immunization, to elements of care, including decreasing the complications of diabetes, improving treatment for patients with heart disease, integration of behavioral health, and racial and ethnic stratification measurement to help close healthcare disparities.\nThrough our Carelon Medical Benefits Management, Inc. subsidiary, we promote appropriate, safe and affordable member care in areas including maternity care, imaging, sleep disorders, cardiac testing, oncology drugs and musculoskeletal procedures. These expanded specialty benefit management solutions leverage clinical expertise and technology to engage provider communities and members in the more effective and efficient use of outpatient services and to promote the most appropriate use of clinical services to improve the quality of care. \nWe perform management review for home health and post-acute institutional services provided to Medicare members through our Carelon Post Acute Solutions, Inc. subsidiary, with the goal of ensuring they receive appropriate, high-quality \n -13-\ncare and supporting their transition back into the home. Effective management of these services can help reduce preventable hospital admissions and readmissions, thereby improving healthcare outcomes for patients. Additionally, Carelon Medical Benefits Management, Inc. has developed programs to address healthcare quality by identifying and closing care gaps. A social determinants of health program screens our members for social needs and connects members to appropriate community resources to encourage better care outcomes. Both medical benefits management and post-acute solutions programs are examples of how we facilitate improvements in the quality of care provided to our members and promote cost-effective, affordable medical care. \nThe physical aspects of health have been traditionally the focus and the priority for healthcare. However, unique life circumstances and experiences impact every individual and their health. We seek to understand our members' health-related social needs to create a healthcare system that synchronizes care delivery for physical, behavioral, social and pharmacy needs. We have invested in a number of strategies to improve how we address health related social needs. We are advancing our efforts through consistent screening of our members for their social needs by using industry-standard tools such as the Protocol for Responding to & Assessing Patients’ Assets, Risks & Experiences, co-creating social action plans with our members, connecting members to related social support services, and evaluating the entire process for continuous quality improvement. We have also implemented our “Food as Medicine” strategy across many of our lines of business to create interventions that not only prevent, manage, and treat diseases but also address food and nutrition insecurity among our members. We are committed to ensuring that all people, regardless of age, race or ethnicity, sexual orientation, gender identity, disability, and geographic or financial access can receive individualized care. Harnessing data gives a more complete picture of each member and their health needs and can help make healthcare more personalized and equitable. Strengthening communities has a positive effect on health; therefore, we value and nurture our local ties, which are a key component of our whole-health approach and drive us to work closely with community organizations that create support networks. Using our data, we also identify the resources needed to support local residents, including the people who we serve, to ensure those resources can better meet local needs.\nBCBSA Licenses  \nWe are a party to license agreements with the BCBSA that entitle us to the exclusive, and in certain areas, non-exclusive, use of the Blue Cross and Blue Shield names and marks in assigned geographic territories. BCBSA is a national association of independent Blue Cross and Blue Shield companies, the primary function of which is to promote and preserve the integrity of the BCBS names and marks, as well as provide certain coordination among the member companies. Each BCBSA licensee is an independent legal organization and is not responsible for obligations of other BCBSA member organizations. Although previously we did not have a right to sell products and services using the BCBS names and marks outside of our exclusive service areas, under the terms of the\n In re Blue Cross Blue Shield Antitrust Litigation\n subscriber settlement agreement and release (“Subscriber Settlement Agreement”) some large national employers with self-funded plans (specifically identified in the Subscriber Settlement Agreement), have a right to request a second Blue plan bid in addition to a bid from the local Blue plan, effective as of September 2024. \nWe are required to pay an annual license fee to the BCBSA based on enrollment and to comply with various requirements and restrictions regarding our operations and our use of the BCBS names and marks. These requirements and restrictions include, among other things: minimum capital and liquidity requirements; enrollment and customer service performance requirements; participation in programs that provide portability of membership between plans; disclosures to the BCBSA relating to enrollment and financial conditions; disclosures as to the structure of the BCBS system in contracts with third parties and in public statements; plan governance requirements; cybersecurity requirements; a requirement that at least 80% (or, in the case of Blue Cross of California, substantially all) of a licensee’s annual combined local net revenue, as defined by the BCBSA, attributable to healthcare plans and related services within its service areas must be sold, marketed, administered or underwritten under the BCBS names and marks; a requirement that neither a plan nor any of its licensed affiliates may permit an entity other than a plan or a licensed affiliate to obtain control of the plan or the licensed affiliate or to acquire a substantial portion of its assets related to licensable services; governance requirements such as a requirement that we divide our Board of Directors into three classes serving staggered three-year terms; a requirement that we guarantee certain contractual and financial obligations of our licensed affiliates; and a requirement that we indemnify the BCBSA against any claims asserted against it resulting from the contractual and financial obligations of any subsidiary that serves as a fiscal intermediary providing administrative services for Medicare Parts A and B. In addition, a change of control or violation of the BCBSA ownership limitations on our capital stock, impending financial insolvency or the appointment of a trustee or \n -14-\nreceiver or the commencement of any action against us seeking our dissolution could cause a termination of our license agreements.\nWe believe that we and our licensed affiliates are currently in compliance with these standards. The standards under the license agreements may be modified in certain instances by the BCBSA. See Part I, Item 1A, “Risk Factors” in this Annual Report on Form 10-K for additional details on the impact if we were not to comply with these license agreements and Note 14, “Commitments and Contingencies \n–\n \nLitigation and Regulatory Proceedings – Blue Cross Blue Shield Antitrust Litigation\n,”\n \nof the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional information on the Subscriber Settlement Agreement.\nRegulation\nGeneral\nOur operations are subject to comprehensive and detailed state, federal and international regulation throughout the jurisdictions in which we do business. These laws and regulations, which can vary significantly from jurisdiction to jurisdiction, restrict how we conduct our businesses and result in additional burdens and costs to us. Further, federal and state laws and regulations are subject to amendments and changing interpretations in each jurisdiction. The application of these complex legal and regulatory requirements to the detailed operation of our businesses creates areas of uncertainty. In addition, there are numerous proposed healthcare laws and regulations at the federal and state levels, including single payer, Medicare for All and public option proposals, some of which could materially adversely affect our businesses if they were to be enacted.\nSupervisory agencies, including federal and state regulators, departments of health and insurance and secretaries of state, have broad authority to:\n•\ngrant, suspend and revoke licenses to transact business;\n•\nregulate our products and services in great detail;\n•\nregulate, limit, or suspend our ability to market products, including participation in Medicare and the Public Exchanges;\n•\ndetermine through a procurement process our ability to participate in certain programs, including state Medicaid programs;\n•\nretroactively adjust premium rates;\n•\nmonitor our solvency and reserve adequacy;\n•\naudit, and recover audit discrepancies, including risk adjustment data validation (“RADV”) audits;\n•\nscrutinize our investment activities on the basis of quality, diversification and other quantitative criteria; and\n•\nimpose monetary and criminal sanctions for non-compliance with regulatory requirements.\nTo carry out these tasks, these government entities periodically examine our operations and accounts.\nThe health benefits business, pharmacy services, and related healthcare products and services businesses also may be adversely impacted by court and regulatory decisions that expand or invalidate the interpretations of existing statutes and regulations. It is uncertain whether we could recoup, through higher premiums or other measures, the increased costs of mandated benefits or other increased costs caused by potential legislation, regulation or court rulings. See Part I, Item 1A “Risk Factors” in this Annual Report on Form 10-K.\n -15-\nThe Consolidation Appropriations Act of 2023\nThe Consolidated Appropriations Act of 2023 decoupled Medicaid eligibility redetermination from the COVID-19 Public Health Emergency, initially declared in January 2020. As a result, states were permitted to begin removing ineligible beneficiaries from their Medicaid programs starting April 1, 2023, and the majority of our Medicaid markets began doing so as of June 30, 2023. Although most states have completed this process, CMS has provided that states have until December 31, 2025, to complete these eligibility redeterminations. Since redeterminations resumed, we have continued to experience a decline in our Medicaid membership. We expect growth over time in our commercial plans, including through the Public Exchanges, as members who have lost Medicaid coverage in states where we offer commercial plans seek coverage elsewhere.\nThe Inflation Reduction Act of 2022\nThe Inflation Reduction Act of 2022 contains a variety of provisions that have impacted, and continue to impact, our business including extending the American Rescue Plan Act of 2021's enhanced Premium Tax Credits (“PTC”) through 2025; imposing a new corporate alternative minimum tax; providing a one percent excise tax on repurchases of stock; allowing CMS to negotiate prices on a limited set of prescription drugs beginning in 2026; instituting caps on insulin cost sharing in Medicare; redesigning the Medicare Part D benefit; requiring drug manufacturers to pay rebates if prices increase beyond inflation; and delaying the implementation of the Trump Administration Medicare drug rebate rule to 2032. The extension of the enhanced PTC has allowed for growth in Individual Public Exchange enrollment and has supported continuity of coverage since Medicaid eligibility redeterminations resumed in 2023. If Congress does not act to extend the enhanced PTC, they will expire at the end of 2025, which could have a material adverse effect on our business and results of operations. \nThe Consolidated Appropriations Act of 2021\nThe Consolidated Appropriations Act of 2021 (the “2021 Appropriations Act”) has impacted our business, including by imposing additional disclosure and reporting requirements related to broker compensation, mental health parity, pharmacy benefits and drug costs, as well as procedures and coverage requirements related to surprise medical bills, provider directory maintenance and continuity of care for certain patients. The requirements applicable to us under the 2021 Appropriations Act had varying effective dates beginning in December 2021. \nThe health plan price transparency regulations issued by the U.S. Departments of Health and Human Services (“HHS”), Labor, and Treasury (the “Tri-Agencies”) pursuant to the 2021 Appropriations Act required us to begin disclosing certain pricing information regarding negotiated rates and historical payment information with providers in 2022. Additionally, as directed by law, we make available to members personalized out-of-pocket cost information and underlying negotiated rates.\nIn September 2024, the Tri-Agencies issued final regulations related to mental health parity that will require health plans to make administrative and operational changes to comply with these final regulations. Although some provisions became effective on January 1, 2025, additional guidance from the Tri-Agencies will be necessary to assess the full impact of these regulations on our operations and financial results. Litigation has been filed challenging the final regulation and is pending court action.\nState Regulation of Insurance Companies and HMOs\nOur insurance and HMO subsidiaries must obtain a certificate of authority and maintain that license in the jurisdictions in which they conduct business. The National Association of Insurance Commissioners (“NAIC”) has adopted model regulations that, where adopted by states, require expanded governance practices, risk and solvency assessment reporting and the filing of periodic financial and operating reports. Most states have adopted these or similar measures to expand the scope of regulations relating to corporate governance and internal control activities of HMOs and insurance companies. Health insurers and HMOs are subject to state examination and periodic license renewal.\nIn addition, we are regulated as an insurance holding company and are subject to the insurance holding company acts of the states in which our insurance company and HMO subsidiaries are domiciled. These acts contain certain reporting requirements, as well as restrictions on transactions between an insurer or HMO and its affiliates, and may restrict the ability of our regulated subsidiaries to pay dividends to our holding companies. These holding company laws and regulations \n -16-\ngenerally require registration with applicable state departments of insurance and the filing of reports describing capital structure, ownership, financial condition, certain intercompany transactions, enterprise risks, corporate governance and general business operations. State insurance holding company laws and regulations require notice or prior regulatory approval of transactions including acquisitions, material intercompany transfers of assets, guarantees and other transactions between the regulated companies and their affiliates, including parent holding companies. Applicable state insurance holding company acts also restrict the ability of any person to obtain control of an insurance company or HMO without prior regulatory approval. “Control” is generally defined as the direct or indirect power to direct or cause the direction of the management and policies of a person and is presumed to exist if a person directly or indirectly owns or controls 10% or more of the voting securities of another person. Dispositions of control generally are also regulated under the state insurance holding company acts.\nThe states of domicile of our regulated subsidiaries have statutory risk-based capital (“RBC”) requirements for health and other insurance companies and HMOs based on the Risk-Based Capital (RBC) For Health Organizations Model Act. These RBC requirements are intended to assess the capital adequacy of health insurers and HMOs, taking into account the risk characteristics of a company’s investments and products. In general, under these laws, an insurance company or HMO must submit a report of its RBC level to the insurance department or insurance commissioner of its state of domicile for each calendar year. The law requires increasing degrees of regulatory oversight and intervention as a company’s RBC declines. As of December 31, 2024, the RBC levels of our insurance and HMO subsidiaries exceeded all applicable mandatory RBC requirements. For more information on RBC capital and additional liquidity and capital requirements for a licensee of the BCBSA, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Liquidity and Capital Resources – \nCapital Resources\n,” included in Part II, Item 7 of this Annual Report on Form 10-K.\nOngoing Requirements and Changes Stemming from the ACA\nSince its enactment in 2010, the ACA has introduced new risks, regulatory challenges and uncertainties, has impacted our business model and strategy and has required changes in the way our products are designed, underwritten, priced, distributed and administered. We expect the ACA will continue to significantly impact our business and results of operations, including pricing, minimum medical loss ratios (“MLRs”) and the geographies in which our products are available. We will continue to evaluate the impact of the ACA as any further developments occur.\nWe also expect further and ongoing regulatory guidance on a number of issues related to Medicare, including evolving methodology for ratings and quality bonus payments. CMS also frequently proposes changes to its program that audits data submitted under the risk adjustment programs in ways that could increase financial recoveries from plans.\nCertain significant provisions of the ACA include, among others:\n•\nThe creation of Public Exchanges for individuals and small group customers.\n•\nThe establishment of minimum MLR thresholds by line of business for the commercial market (which may be subject to more restrictive MLR thresholds under state regulations, such as those in New York). Medicare Advantage or Medicare Part D prescription drug plans that do not meet the mandated threshold will have to pay a minimum MLR rebate, will be subject to restricted enrollment if MLR is below the threshold for three consecutive years and are subject to contract termination if the plan’s MLR is below the threshold for five consecutive years. In addition, state Medicaid programs are required to set managed care capitation rates such that a minimum MLR is projected to be achieved; however, states are not required to collect remittances if the minimum MLR is not achieved.\nApproximately 54.2% and 18.4% of our premium revenue and medical membership, respectively, were subject to the minimum MLR regulations as of and for the year ended December 31, 2024. Approximately 52.3% and 18.0% of our premium revenue and medical membership, respectively, were subject to the minimum MLR regulations as of and for the year ended December 31, 2023. \n•\nThe creation of an incentive payment program for Medicare Advantage plans. CMS developed the Medicare Advantage Star Ratings system, which awards between 1.0 and 5.0 Stars to Medicare Advantage plans based on performance in several categories, including quality of care and customer service. The Star Ratings are used by CMS to award quality-based bonus payments to plans that receive a rating of 4.0 or higher. The methodology and measures included in the Star Ratings system can be modified by CMS annually. Our 2024 Star Ratings, which are \n -17-\nused for payment year 2025, reflect that 53% of our Medicare Advantage members are enrolled in plans rated at least 4.0 Stars or higher. This was an increase over the original 2024 Star Rating of 34% that were released in October 2023 and were subsequently recalculated by CMS. CMS released our 2025 Star Ratings in October 2024, which will be used to determine our Medicare Advantage bonus payments in 2026. Our 2025 Star Ratings reflect that 38% of our Medicare Advantage members are enrolled in plans rated at least 4.0 Stars or higher. We expect this will result in a reduction to our 2026 operating revenue of approximately $183 million, net of offsets from contracting provisions. Further, we expect to mitigate the financial impact to our 2026 operating gain and net income per share through various strategies such as contract diversification, operating expense efficiencies, capital deployment alternatives and network enhancements.\n•\nThe implementation of a Medicare Advantage payment formula, which prevents reimbursement rates from increasing as much as otherwise would be expected. \n We continue to participate in the Public Exchange in nearly all of our Anthem Blue Cross and Anthem Blue Cross and Blue Shield service areas.\n \nWe anticipate growth in our Public Exchange membership as former Medicaid members, no longer eligible for Medicaid coverage, continue to seek alternative coverage options. Additionally, we are entering select service areas in Florida, Maryland, and Texas in 2025, using our Simply Healthcare and Wellpoint brands, and we are actively evaluating expansion opportunities in additional marketplaces beyond 2025. Any variation from our expectations regarding acuity, enrollment levels, adverse selection, or other assumptions utilized in setting premium rates could have a material adverse effect on our results of operations, financial position, and cash flows, and may require further adjustments to our rates and participation going forward. Changes to our business environment are likely to continue as elected officials at the national and state levels continue to enact significant modifications to existing laws and regulations, including changes to available subsidies, taxes and fees. \nPharmacy Services and Drug Benefit Regulation\nPharmacy services, including pharmacy benefit managers, are regulated at both the federal and state levels and must comply with federal and state statutes and regulations governing a pharmacy benefit manager's business, including, but not limited to, pharmacy network restrictions and configurations, formulary management, affiliate pharmacy reimbursement, anti-steering to affiliated pharmacies, prohibition on pharmacy claim processing/transaction fees, pharmacy effective rates, guarantees and reconciliations, reimbursement pricing type mandates, purchase discount and/or rebate arrangements with drug manufacturers, advertising and licensing. Regulation in the states varies dramatically and ranges from licensure of pharmacy benefit managers as third-party administrators, licensure specifically as a pharmacy benefit manager, and licensure accompanied by additional disclosures and limitations of business practices to varying degrees.\nPharmacy benefit managers are also subject to continued changes in public policy, legislation, laws, and regulations relating to drug benefits and pharmacy services, which include, but are not limited to, (1) regulation of rebates from drug manufacturers that would require rebate dollars to be applied at the point-of-sale or passed through to the plan sponsor, (2) federal policy changes to set the prices for a subset of drugs covered under the Medicare program, (3) reforms to the Medicare drug benefit, such as beneficiary cost-sharing changes that aim to lower consumer costs and prohibit pharmacy benefit managers and their affiliates from deriving income based on the price of the drug, (4) attempts at both the federal and state levels to prohibit the use of spread pricing contracts in both the commercial and Medicaid markets, (5) prior authorizations of drugs, (6) transparency and public disclosure of costs and profits, (7) prohibiting exclusive specialty and mail pharmacy networks, (8) limiting pharmacy accreditation and credentialing requirements, (9) consumer choice/any willing provider requirements, and (10) prohibiting steering to affiliated pharmacies. These changes in public policy, legislation, laws, and regulations have the potential to have broad impacts on our pharmacy benefit management services and could materially adversely affect our business.\nOur pharmacy services business includes home delivery and specialty pharmacies, infusion services, injectable therapies and clinic-based pharmacies, which must be licensed as pharmacies in the states in which they are located. Certain pharmacies must also register with the U.S. Drug Enforcement Agency (“DEA”) and individual state-controlled substance authorities to dispense controlled substances. In addition to adhering to the laws and regulations in the states where our pharmacies are located, we may also be required to comply with certain laws and regulations in certain states into which one of our pharmacies delivers prescription drugs, including those requiring us to register with Boards of Pharmacy as a non-resident pharmacy. These non-resident states generally expect our pharmacies to follow the laws of the state in which the \n -18-\npharmacies are located, but some non-resident states also require us to comply with certain of their pharmacy regulations as well. Additionally, pharmacies that participate in Medicare or Medicaid pharmacy networks are required to comply with applicable Medicare and Medicaid provider rules and regulations.\nPrivacy, Confidentiality and Data Standards Regulation\nThe federal Health Insurance Portability and Accountability Act of 1996 (“HIPAA”) and the administrative simplification provisions of HIPAA impose a number of requirements on covered entities (including insurers, HMOs, group health plans, providers and clearinghouses) and their business associates relating to the use, disclosure and safeguarding of protected health information. These requirements include uniform standards of common electronic healthcare transactions; privacy and security regulations; and unique identifier rules for employers, health plans and providers.\nAlso, the Health Information Technology for Economic and Clinical Health (“HITECH”) Act provisions of the American Recovery and Reinvestment Act of 2009 and corresponding implementing regulations have imposed additional requirements on the use and disclosure of protected health information such as additional data breach notification and reporting requirements, contracting requirements for HIPAA business associate agreements, strengthened enforcement mechanisms and increased penalties for HIPAA violations. Federal consumer protection laws may also apply in some instances to privacy and security practices related to personally identifiable information.\nThe federal Gramm-Leach-Bliley Act generally places restrictions on the disclosure of non-public information to non-affiliated third parties, and requires financial institutions, including insurers, to provide customers with notice regarding how their non-public personal information is used, including an opportunity to “opt out” of certain disclosures. State departments of insurance and certain federal agencies adopted implementing regulations as required by federal law. \nThe Cybersecurity Information Sharing Act of 2015 encourages organizations to share cyber threat indicators with the federal government and, among other things, directed HHS to develop a set of voluntary cybersecurity best practices for organizations in the healthcare industry, which were issued in 2018.\nIn addition, Public Exchanges are required to adhere to privacy and security standards with respect to personally identifiable information and to impose privacy and security standards that are at least as protective as those the Public Exchange has implemented for itself on insurers offering plans through the Public Exchanges and their designated downstream entities, including pharmacy services providers and other business associates. These standards may differ from, and be more stringent than, HIPAA.\nFurthermore, states have begun enacting more comprehensive privacy laws and regulations addressing consumer rights to data protection or transparency that may affect our privacy and security practices, such as state laws like the California Privacy Rights Act of 2020 that govern the use, disclosure and protection of member data and impose additional breach notification requirements. The NAIC has proposed revisions to the Privacy of Consumer Financial and Health Information Model Act, which, if implemented, would expand consumer privacy rights and place additional limitations on the use and disclosure of member data. State consumer protection laws may also apply to privacy and security practices related to personally identifiable information, including information related to consumers and care providers. Complying with conflicting cybersecurity regulations and varying enforcement philosophies, which may differ from state to state, requires significant resources and may materially and adversely affect our ability to standardize our products and services across state lines. \nFederal regulations have been finalized in the following areas that will continue to materially impact our operations:\n•\nFederal regulations on data interoperability that require claims data to be made available to third parties unaffiliated with us that may not be HIPAA regulated; and \n•\nFederal regulations requiring hospitals and health insurers to publish negotiated prices for services, including the health plan price transparency regulations issued in October 2020 by the U.S. Departments of Health and Human Services, Labor and Treasury (the “Health Plan Transparency Rule”). \nBeginning in July 2022, the Health Plan Transparency Rule required us to disclose, on a monthly basis, detailed pricing information regarding negotiated rates for all covered items and services between the plan or issuer and in-network providers and historical payments to, and billed charges from, out-of-network providers. Additionally, beginning in 2023, we were \n -19-\nrequired to make available to members personalized out-of-pocket cost information and the underlying negotiated rates for 500 covered healthcare items and services, including prescription drugs. Effective January 1, 2024, this ongoing requirement has expanded to include all items and services.\nEmployee Retirement Income Security Act of 1974\nThe provision of services to certain employee welfare benefit plans is subject to the Employee Retirement Income Security Act of 1974, as amended (“ERISA”), a complex set of laws and regulations subject to interpretation and enforcement by the Internal Revenue Service and the Department of Labor. ERISA regulates certain aspects of the relationships between us, the employers that maintain employee welfare benefit plans subject to ERISA and participants in such plans. Some of our administrative services and other activities may also be subject to regulation under ERISA. In addition, certain states require licensure or registration of companies providing third-party claims administration services for benefit plans. We provide a variety of products and services to employee welfare benefit plans that are covered by ERISA. Plans subject to ERISA can also be subject to state laws, and the question of whether and to what extent ERISA preempts a state law has been, and will continue to be, interpreted by many courts.\nGuaranty Fund Assessments\nUnder insolvency or guaranty association laws in most states, insurance companies and HMOs can be assessed for amounts paid by guaranty funds for policyholder losses incurred when an insurance company or HMO becomes insolvent. Most state insolvency or guaranty association laws currently provide for assessments based upon the amount of premiums received on insurance underwritten within such state (with a minimum amount payable even if no premium is received). Under many of these guaranty association laws, assessments are made retrospectively. Some states permit insurers or HMOs to recover assessments paid through full or partial premium tax offsets or through future policyholder surcharges. The amount and timing of any future assessments cannot be predicted with certainty; however, future assessments are likely to occur.\nInternational Regulation\nWe have various international subsidiaries, which provide administrative and other services, that are subject to different, and sometimes more stringent, legal and regulatory requirements that vary widely by jurisdiction. In addition, our non-U.S. operations are subject to U.S. laws regulating the conduct and activities of U.S.-based businesses operating abroad, including but not limited to, the Foreign Corrupt Practices Act and corresponding foreign laws governing anti-bribery, anti-corruption, anti-money laundering, data protection and privacy, employment, and other regulatory oversight initiatives. \nHuman Capital\nThe foundation of our strategy starts with our culture, and our associates are critical to fulfilling our purpose of improving the health of humanity. As of December 31, 2024, our employee population, including all full-time, part-time and temporary workers, consisted of approximately 104,200 individuals, 76,300 in the United States and 27,900 internationally. Ninety-nine percent of our total workforce is employed full-time, at least 33 hours a week. \nWe believe we have built a high-performance culture that enhances our ability to deliver on our commitments and long-term strategy, as well as guides us to address the challenges of today. We believe that our culture allows us to attract and retain talented and experienced individuals to support the communities we serve.\nBecause dedication to human capital management is a core component of our corporate governance, the Compensation and Talent Committee of our Board of Directors (our “Board”) regularly reviews and discusses management's approach to talent acquisition and retention, and monitors our programs and practices related to workforce inclusion. Additionally, the Governance Committee of our Board has primary responsibility for monitoring our corporate social responsibility and environmental sustainability initiatives and performance. We provide the age, gender and racial and ethnic compositions of our U.S. work force in our annual Impact Report, which includes Equal Employment Opportunity Employer Information Report (EEO-1) data.\n   Culture, Engagement and Inclusion\nEach year we conduct internal associate engagement surveys that provide our associates with an opportunity to share their opinions and experiences with respect to their roles, their teams and the Company, and we also offer online feedback \n -20-\ntools. Our management team reviews, monitors and analyzes associate feedback and acts on responses to identify opportunities to adjust our policies and benefits to improve our associates’ experiences. In addition, in 2024, over 20% of our U.S. workforce participated in our Business Resource Groups, or BRGs, which provide associates meaningful opportunities to connect, collaborate and grow. These voluntary, associate-led communities, which are open to all of our associates, help to foster an environment of inclusivity, respect and collaboration. To further engage and reward our associates, we have an associate recognition program called IMPACT that empowers all associates to recognize their colleagues for their contributions to our Company and to celebrate both personal and professional milestones, whether recognition is for going “above and beyond” or simply to express thanks. \nWe are dedicated to attracting, developing, maintaining, and supporting an inclusive workforce that fosters a sense of belonging for individuals with a wide range of backgrounds, life experiences and cultures. We believe that these varied experiences enhance our connection with our members, enabling us to serve our members and communities more effectively and driving business impact. Our initiatives in this area are led by our Chief Talent Officer, and our workforce embodies a multitude of dimensions, including skills, experiences, age, tenure, gender, race, ethnicity, physical abilities and geographic location.\nFair Pay\nWe are committed to a fair pay workplace. We were in the first cohort of companies certified by the Fair Pay Workplace (“FPW”), an independent certification that takes a holistic approach to pay equity, partnering to design an annual pay equity action plan that includes a perpetual review of all positions, new hires and promotions to effect meaningful and measurable change. This independent certification is based on a set of publicly available rules and standards and the endorsed methodology of a group of leading experts from forward-thinking corporations, academia, human resources, data science and the legal field. After partnering with and overseeing our review process examining pay equity for cash compensation, including base and short-term incentives, in December 2024 FPW again validated our analysis of our U.S. associate population, which found that pay for women is 99.2% of men, and pay for people of color is 99.8% of white associates, after taking into account neutral, job related factors. \nTalent Development and Retention\nGrowing, developing and retaining our talent internally is key to our succession plans and our ability to lead at our best every day. To inspire a high-performance culture, promote talent excellence and accelerate growth and innovation, we offer individual, career and leadership development opportunities, encouraging associates to continually learn, grow and expand their skill sets. We offer various instructor-led and virtual instructor-led programs and maintain a vast curriculum of relevant, on-demand learning and development resources. In 2024, we invested a significant amount in human capital development, averaging approximately 27 hours of training and development per associate. \nHealth, Wellness and Safety\nWe have the privilege of touching the lives of millions of people each day, starting with the health and safety of our own associates. To improve the health, wellbeing and safety of our associates, we offer a comprehensive compensation package, including competitive salaries, a 401(k) plan and medical, dental, vision and disability coverage. In addition, we offer our associates wellness and behavioral health programs and tools to help them get and stay healthy and more easily manage their work and personal lives. We have a mixed in-office, hybrid and remote workplace strategy, and we foster associate engagement through a variety of activities based in our key office locations.\n -21-\nInformation About Our Executive Officers\nThe following sets forth certain information regarding our executive officers and Chief Accounting Officer as of February 1, 2025.\nName\nAge\nPosition\nGail K. Boudreaux\n64\nPresident and Chief Executive Officer\nMark B. Kaye\n45\nExecutive Vice President and Chief Financial Officer\nPeter D. Haytaian\n55\nExecutive Vice President and President, Carelon and CarelonRx\nCharles M. Kendrick, Jr.\n59\nExecutive Vice President and President, Commercial Health Benefits\nRatnakar V. Lavu\n54\nExecutive Vice President and Chief Digital and Information Officer\nFelicia F. Norwood\n65\nExecutive Vice President and President, Government Health Benefits\nRonald W. Penczek\n60\nChief Accounting Officer and Controller\nMs. Boudreaux\n has been serving as our President and Chief Executive Officer and as a Director of the Company since November 2017. Prior to joining us, she served as Chief Executive Officer of GKB Global Health, LLC (healthcare consulting firm) from 2015 to November 2017. Prior thereto, Ms. Boudreaux was Executive Vice President of UnitedHealth Group Incorporated (“UHGI”) (diversified healthcare company) from 2008 to 2015. She also served as Chief Executive Officer of UnitedHealthcare (managed healthcare company), a subsidiary of UHGI from 2011 to 2014 and as President of the Commercial Business of UnitedHealthcare from 2008 to 2010. Before joining United Healthcare, she worked at Health Care Service Corporation (“HCSC”) (health insurance company) as Executive Vice President of External Operations from 2005 to 2008 and President of Blue Cross and Blue Shield of Illinois from 2002 to 2005. Before joining HCSC, Ms. Boudreaux held various positions at Aetna, Inc. (“Aetna”) (managed healthcare company), including Senior Vice President, Group Insurance. \nMr. Kaye \nhas been serving as our Executive Vice President and Chief Financial Officer since November 2023, having joined us in September 2023 as our Chief Financial Officer Designate. Prior to joining us, he served as the Executive Vice President and Chief Financial Officer of Moody’s Corporation (“Moody’s”) (credit rating and research company) from April 2021 to September 2023, with responsibility for all global finance activities across the company and as Senior Vice President - Chief Financial Officer from August 2018 to April 2021. Prior to Moody’s, he served as Senior Vice President and Head of Financial Planning and Analysis at Massachusetts Mutual Life Insurance Company (“MassMutual”) (financial services company) from February 2016 until July 2018, and Chief Financial Officer of MassMutual U.S. from July 2015 to February 2016. Prior to that, Mr. Kaye served as Chief Financial Officer and Senior Vice President, Retirement Solutions, at Voya Financial (formerly ING U.S.) (institutional asset manager) from 2011 to 2015. Leading up to that appointment, Mr. Kaye held various senior financial and risk reporting positions at ING U.S. and ING Group. Prior to that, Mr. Kaye worked in the investment banking division of Credit Suisse First Boston.\nMr. Haytaian\n has been serving as our Executive Vice President and President of Carelon and CarelonRx since October 2021. Prior to his current role, he was Executive Vice President and President of the Commercial & Specialty Business Division beginning in April 2018. From June 2014 until April 2018, Mr. Haytaian held the position of Executive Vice President and President of the Government Business Division. He joined the Company in 2012 through the acquisition of Amerigroup Corporation (“Amerigroup”) and served as President of our Medicaid business from 2013 until 2014. From 2005 to 2013, Mr. Haytaian held various leadership positions with Amerigroup, including Chief Executive Officer of the North Region for its Medicaid business from 2012 until 2013. Mr. Haytaian has extensive experience leading Medicare and Medicaid programs both at Amerigroup and, prior thereto, with Oxford Health Plans, Inc.\nMr. Kendrick\n has been serving as our Executive Vice President and President of our Commercial Health Benefits since October 2021. From January 2021 until October 2021, Mr. Kendrick served as President of our Commercial Business West Markets (California, Colorado, Indiana, Kentucky, Missouri, Nevada, Ohio and Wisconsin). Mr. Kendrick has been with the Company since 1995, and has held various leadership roles across the organization, including serving as President, Anthem National Accounts/Central Markets from 2015 until January 2021 and President of National Accounts and General Manager for Anthem Blue Cross and Blue Shield of Georgia from 2010 until 2015.\n -22-\nMr. Lavu \nhas been serving as our Executive Vice President and Chief Digital and Information Officer since February 2024. Prior to joining us, he served as Global Chief Digital Information Officer of Nike, Inc. (“Nike”) (retailer) from July 2019 to February 2023. Prior to Nike, he served as Chief Technology Officer/CIO of Kohl’s Corporation (“Kohls”) (retailer) from March 2016 to June 2019, and he held other various roles at Kohl's beginning in 2011, including Executive Vice President, Digital Technology, and Senior Vice President of Digital Innovation. Prior to Kohl's, Mr. Lavu served as Chief Technology Officer at Redbox Automated Retail, LLC (retailer) from October 2009 to October 2011.\nMs. Norwood \nhas been serving as our Executive Vice President and President of our Government Health Benefits since June 2018. Prior to joining us, she was Director of The Department of Healthcare and Family Services for the State of Illinois from 2015 to June 2018. Prior to that appointment, Ms. Norwood held various leadership roles at Aetna, with her most recent role as President of the Mid-America Region for Aetna from 2010 until 2013.\nMr. Penczek\n has been serving as our Controller since November 2015 and as our Chief Accounting Officer since December 2015. He served as our Vice President and Corporate Controller from 2013 to 2015. Prior to that appointment, Mr. Penczek served as Vice President and Assistant Controller from 2008 to 2012 and in various other roles in our finance department from 2005 until 2008. Before joining us in 2005, Mr. Penczek was a Staff Vice President with CNA Insurance from 2000 to 2005 and held various positions at PricewaterhouseCoopers LLP from 1992 to 2000, including as a Manager.\nAvailable Information\nWe are a large accelerated filer (as defined in Rule 12b-2 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”)) and are required, pursuant to Item 101 of Regulation S-K, to provide certain information regarding our website and the availability of certain documents filed with or furnished to the U.S. Securities and Exchange Commission (the “SEC”). The SEC maintains a website that contains reports, proxy and information statements and other information regarding issuers at www.sec.gov. Our website is \nwww.elevancehealth.com.\n We have included our website address in this Annual Report on Form 10-K as a textual reference only. The information contained on, or accessible through, our website is not incorporated into this Annual Report on Form 10-K or any of our other SEC filings. We make available through our website, free of charge, our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after we electronically file such material with or furnish it to the SEC. We also include on our website our Corporate Governance Guidelines, our Code of Conduct and the charter of each standing committee of our Board of Directors. In addition, we intend to disclose on our website any amendments to, or waivers from, our Code of Conduct that are required to be publicly disclosed pursuant to rules of the SEC and the New York Stock Exchange. Elevance Health, Inc. is an Indiana corporation incorporated on July 17, 2001.",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\n \n(In Millions, Except Per Share Data or as Otherwise Stated Herein)\n This Management's Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) should be read in conjunction with the accompanying audited consolidated financial statements and notes, included in Part II, Item 8 of this Annual Report on Form 10-K. References to the terms “we,” “our,” “us,” “Elevance Health” or the “Company” used throughout this MD&A refer to Elevance Health, Inc., an Indiana corporation, and, unless the context otherwise requires, its direct and indirect subsidiaries. References to the “states” include the District of Columbia and Puerto Rico, unless the context otherwise requires.\nThis MD&A generally discusses 2024 and 2023 items and year-over-year comparisons between 2024 and 2023. A detailed discussion of 2022 items and year-over-year comparisons between 2023 and 2022 that are not included in this Annual Report on Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 included in our Annual Report on Form 10-K for the year ended December 31, 2023.\nOverview\nElevance Health is a health company with the purpose of improving the health of humanity. We are one of the largest health insurers in the United States in terms of medical membership, serving approximately 45.7 million medical members through our affiliated health plans as of December 31, 2024. We are an independent licensee of the Blue Cross and Blue Shield Association (“BCBSA”), an association of independent health benefit plans. We serve our members as the Blue Cross licensee for California and as the Blue Cross and Blue Shield (“BCBS”) licensee for Colorado, Connecticut, Georgia, Indiana, Kentucky, Maine, Missouri (excluding 30 counties in the Kansas City area), Nevada, New Hampshire, New York (in the New York City metropolitan area and upstate New York), Ohio, Virginia (excluding the Northern Virginia suburbs of Washington, D.C.) and Wisconsin. In a majority of these service areas, we do business as Anthem Blue Cross and Anthem Blue Cross and Blue Shield. We also conduct business through arrangements with other BCBS licensees, as well as other strategic partners. In addition, we serve members in numerous states as Wellpoint, Carelon, MMM and/or Simply Healthcare. We are licensed to conduct insurance operations in all 50 states, the District of Columbia and Puerto Rico through our subsidiaries. Through various subsidiaries, we also offer pharmacy services through our CarelonRx business, and other healthcare related services as Carelon Insights and Carelon Health. \n We have organized our brand portfolio into the following core go-to-market brands:\n•\nAnthem Blue Cross/Anthem Blue Cross and Blue Shield — represents our Anthem-branded and affiliated Blue Cross and/or Blue Shield licensed plans;\n•\nWellpoint — unites select non-BCBSA licensed Medicare, Medicaid and commercial plans under the Wellpoint name; and\n•\nCarelon — this brand brings together our healthcare related services and capabilities, including our CarelonRx and Carelon Services businesses, under a single brand name.\n We report our results of operations in the following four reportable segments: Health Benefits, CarelonRx, Carelon Services and Corporate & Other (our businesses that do not individually meet the quantitative thresholds for an operating segment, as well as corporate expenses not allocated to our other reportable segments). \nOur results of operations discussed throughout this MD&A are determined in accordance with generally accepted accounting principles (“GAAP”). We also calculate operating gain and operating margin to further aid investors in understanding and analyzing our core operating results. Operating gain is calculated as total operating revenue less benefit expense, cost of products sold and operating expense. Operating margin is calculated as operating gain divided by operating revenue. Our definition of operating gain and operating margin may not be comparable to similarly titled measures reported by other companies. We use these measures as a basis for evaluating segment performance, allocating resources, forecasting future operating periods and setting incentive compensation targets. This information is not intended to be considered in isolation or as a substitute for income before income tax expense, net income or fully-diluted shareholders’ earnings per share (“EPS”) prepared in accordance with GAAP. For additional details on operating gain, see our “Reportable Segments Results \n -43-\nof Operations” discussion included in this MD&A. For a reconciliation of reportable segment operating revenue to the amounts of total revenue included in the consolidated statements of income and a reconciliation of reportable segment operating gain to income before income tax expense, see Note 20, “Segment Information,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nOur operating revenue consists of premiums, product revenue, and service fees. Premium revenue is generated from risk-based contracts where we indemnify our policyholders against costs for covered health benefits. Product revenue represents services performed by CarelonRx for unaffiliated pharmacy customers and includes ingredient costs (net of any rebates or discounts), including co-payments made by or on behalf of the customer, and service fees. Unaffiliated pharmacy customers include our fee-based employer groups that contract with CarelonRx for pharmacy services and external customers outside of the health plans we own. Service fees are generated from our fee-based customers for the processing of transactions or network discount savings realized, revenues from our Medicare processing business and revenues from other health-related businesses, including care management programs and miscellaneous other income. \nOur benefit expense primarily includes costs of care for health services consumed by our risk-based members, such as outpatient care, inpatient hospital care, professional services (primarily physician care) and pharmacy benefit costs. All four components are affected both by unit costs and utilization rates. Unit costs include the cost of outpatient medical procedures per visit, inpatient hospital care per admission, physician fees per office visit and prescription drug prices. Utilization rates represent the volume of consumption of health services and prescription drugs, and typically vary with the age and health status of our members and their social and lifestyle choices, along with clinical protocols and medical practice patterns in each of our markets. A portion of benefit expense recognized in each reporting period consists of actuarial estimates of claims incurred but not yet paid by us. Any changes in these estimates are recorded in the period the need for such an adjustment arises. While we offer a diversified mix of managed care products and services through our managed care plans, our aggregate cost of care can fluctuate based on a change in the overall mix of these products and services. Our managed care plans include: Preferred Provider Organizations; Health Maintenance Organizations; Point-of-Service plans; Traditional Indemnity plans and other hybrid plans, including Consumer-Driven Health Plans; and hospital only and limited benefit products. \nWe classify certain quality improvement costs as benefit expense. Quality improvement activities are those designed to improve member health outcomes, prevent hospital readmissions and improve patient safety. They also include expenses for wellness and health promotion provided to our members. These quality improvement costs may be comprised of expenses incurred for: (i) medical management, including care coordination and case management; (ii) health and wellness, including disease management services for such conditions as diabetes, high-risk pregnancies, congestive heart failure and asthma management and wellness initiatives like weight-loss programs and smoking cessation treatments; and (iii) clinical health policy, such as identification and use of best clinical practices to avoid harm, identifying clinical errors and safety concerns, and identifying potential adverse drug interactions. \nOur cost of products sold represents the cost of pharmaceuticals dispensed by CarelonRx for our unaffiliated pharmacy customers (net of rebates or discounts), including any co-payments made by or on behalf of the customer, per-claim administrative fees for prescription fulfillment and certain direct costs related to sales and administration of customer contracts.\nOur operating expenses consist of fixed and variable costs. Examples of fixed costs are depreciation, amortization and certain facilities expenses. Certain variable costs, such as premium taxes, vary directly with premium volume. Commission expense generally varies with premium or membership volume. Other variable costs, such as salaries and benefits, do not vary directly with changes in premium but are more aligned with changes in membership or services provided to our customers. The acquisition or loss of a significant block of business would likely impact staffing levels and thus, associated compensation expense. Other variable costs include professional and consulting expenses and advertising. Other factors can impact our administrative cost structure, including systems efficiencies, inflation and changes in productivity.\nOur results of operations depend in large part on our ability to accurately predict and effectively manage healthcare costs through effective contracting with providers of care to our members, product pricing, medical management and health and wellness programs, including service coordination and case management for addressing complex and specialized healthcare needs, innovative product design and our ability to maintain or achieve improvement in our Centers for Medicare and Medicaid Services Star Ratings. Several economic factors related to healthcare costs, such as regulatory mandates of \n -44-\ncoverage as well as direct-to-consumer advertising by providers and pharmaceutical companies, have a direct impact on the volume of care consumed by our members. The potential effect of escalating healthcare costs, any changes in our ability to negotiate competitive rates with our providers and any regulatory or market-driven restrictions on our ability to obtain adequate premium rates to offset overall inflation in healthcare costs, including increases in unit costs and utilization rates resulting from the aging of the population and other demographics, the impact of epidemics and pandemics, as well as advances in medical technology and pharmaceuticals, may impose further risks to our ability to profitably underwrite our business and may have a material adverse impact on our results of operations.\nWe intend to expand through a combination of organic growth, strategic acquisitions and efficient use of capital in both existing and new markets. Our growth strategy is designed to enable us to take advantage of additional economies of scale, as well as provide us access to new and evolving technologies and products. In addition, we believe geographic and product diversity reduces our exposure to local or regional regulatory, economic and competitive pressures and provides us with increased opportunities for growth. We market and offer pharmacy services through CarelonRx and other subsidiaries, and we expect CarelonRx to continue to improve our ability to integrate pharmacy benefits within our medical and specialty platform. We have continued growing our government-sponsored business through organic growth and acquisitions. In all other markets, we intend to maintain our position by delivering excellent service, offering competitively priced products, providing access to high-quality provider networks and effectively capitalizing on the brand strength of the Blue Cross and Blue Cross and Blue Shield names and marks.\n \nFor additional information about our business and reportable segments, see Part I, Item 1 “Business” and Note 20, “Segment Information” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nBusiness Trends\nWe continue to participate in the Individual state- or federally-facilitated marketplaces (“the Public Exchange”) in nearly all of our Anthem Blue Cross and Anthem Blue Cross and Blue Shield service areas. We anticipate growth in our Public Exchange memberships as former Medicaid members, no longer eligible for Medicaid coverage, continue to seek alternative coverage options. Additionally, we are entering select service areas in Florida, Maryland, and Texas in 2025, using our Simply Healthcare and Wellpoint brands, and we are actively evaluating expansion opportunities in additional marketplaces beyond 2025. Changes to our business environment are likely to continue as elected officials at the national and state levels continue to enact significant modifications to existing laws and regulations, including changes to available subsidies, taxes and fees.\nCarelonRx markets and offers pharmacy services to our affiliated health plan customers throughout the country, as well as to customers outside of the health plans we own. Our comprehensive pharmacy services portfolio includes all core pharmacy services, such as home delivery and specialty pharmacies, claims adjudication, formulary management, pharmacy networks, rebate administration, a prescription drug database and member services, as well as infusion services and injectable therapies. \nCarelonRx delegates certain core pharmacy services to CaremarkPCS Health, L.L.C., which is a subsidiary of CVS Health Corporation (“CVS”), pursuant to an agreement (the “CVS Agreement”) with the current contractual term extending through December 31, 2027. We can elect to have CVS continue to provide services to us for a three-year extension period on the same terms and conditions as in the current CVS Agreement in the event of a termination or non-renewal by either party.\nPricing Trends: \n \nWe strive to price our health benefit products consistent with anticipated underlying medical cost trends. We frequently make adjustments to respond to legislative and regulatory changes as well as pricing and other actions taken by existing competitors and new market entrants. Revenues from the Medicare and Medicaid programs are dependent, in whole or in part, upon annual funding from the federal government and/or applicable state governments. Product pricing remains competitive.\nIf the approvals of any annual premium rate changes by contracted government agencies are delayed, we are required to defer the recognition of any premium rate increases to the period in which the premium rates become final. The impact of this deferral can be significant in the period in which the increased premium rates are first recognized depending on the magnitude of the premium rate increase, the number of members to which it applies and the length of the delay between the \n -45-\neffective date of the rate increase and the final contract date. Premium rate decreases are recognized in the period the change in premium rate becomes effective and the change in the rate is known, which may be prior to the period in which the contract amendment affecting the rate is finalized.\nMedical Cost Trends:\n \nOur medical cost trends are primarily driven by changes in the utilization of services across all provider types and the unit cost of these services. We work to mitigate these trends through various medical management programs such as care and condition management, program integrity and specialty pharmacy management and utilization management, as well as benefit design changes. There are many drivers of medical cost trends that can cause variance from our estimates, such as changes in the level and mix of services utilized, regulatory changes, aging of the population, health status and other demographic characteristics of our members, epidemics, pandemics, advances in medical technology, new high-cost prescription drugs, new indications of existing prescription drugs, provider contracting inflation, labor costs and healthcare provider or member fraud.\nFor additional discussion regarding business trends, see Part I, Item 1 “Business” of this Annual Report on Form 10-K.\nRegulatory Trends and Uncertainties\nThe Consolidated Appropriations Act of 2023, decoupled Medicaid eligibility redeterminations from the COVID-19 Public Health Emergency initially declared in January 2020. As a result, states were permitted to begin removing ineligible beneficiaries from their Medicaid programs starting April 1, 2023, and the majority of our Medicaid markets began doing so as of June 30, 2023. Although most states have completed this process, Centers for Medicare and Medicaid Services (“CMS”) has provided that states have until December 31, 2025 to complete these eligibility redeterminations. Since redeterminations have resumed, we have continued to experience a decline in our Medicaid membership. We expect growth over time in our commercial plans, including through the Public Exchanges in states where we offer commercial plans, as members who have lost Medicaid coverage seek alternative coverage elsewhere. \nThe Inflation Reduction Act of 2022 contains a variety of provisions that have impacted, and continue to impact our business including by extending the American Rescue Plan Act of 2021's enhanced Premium Tax Credits (“PTC”) through 2025; imposing a new corporate alternative minimum tax; providing a one percent excise tax on repurchases of stock; allowing CMS to negotiate prices on a limited set of prescription drugs in Medicare effective in 2026; instituting caps on insulin cost sharing in Medicare; redesigning the Medicare Part D benefit; requiring drug manufacturers to pay rebates if prices increase beyond inflation; and delaying the implementation of the Trump Administration Medicare drug rebate rule until at least 2032. The extension of the enhanced PTC has allowed for growth in Individual Public Exchange enrollment and has supported continuity of coverage since Medicaid eligibility redeterminations resumed in 2023. If Congress does not act to extend the enhanced PTC, they will expire at the end of 2025, which could have a material adverse effect on our business and results of operations. \nThe Consolidated Appropriations Act of 2021 (the “2021 Appropriations Act”) has impacted our business, including by imposing additional disclosure and reporting requirements related to broker compensation, mental health parity, pharmacy benefits and drug costs, as well as procedures and coverage requirements related to surprise medical bills, provider directory maintenance and continuity of care for certain patients. The requirements applicable to us under the 2021 Appropriations Act had varying effective dates, beginning in December 2021. \n The health plan price transparency regulations issued by the U.S. Departments of Health and Human Services, Labor, and Treasury (“the Tri-Agencies”) pursuant to the 2021 Appropriations Act required us to begin disclosing certain pricing information regarding negotiated rates and historical payment information with providers in 2022. Additionally, as directed by law, we make available to members personalized out-of-pocket cost information and underlying negotiated rates.\nIn September 2024, the Tri-Agencies issued final regulations related to mental health parity that will require health plans to make administrative and operational changes to comply with these final regulations. While some provisions became effective on January 1, 2025, additional guidance from the Tri-Agencies will be necessary to assess the full impact of these regulations on our operations and financial results. Litigation has been filed challenging the final regulation and is pending court action.\nThe Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended (collectively, the “ACA”), continues to impact our business and results of operations, including pricing, minimum \n -46-\nmedical loss ratios, and the geographies in which our products are available. We also expect further and ongoing regulatory guidance on a number of issues related to Medicare, including evolving methodology for ratings and quality bonus payments. CMS also frequently proposes changes to its program that audits data submitted under the risk adjustment programs in ways that could increase financial recoveries from plans.\nFor additional discussion regarding regulatory trends and uncertainties, and risk factors that could cause actual results to differ materially from those contained in forward-looking statements made in this Annual Report on Form 10-K, see Part I, Item 1 “Business-\nRegulation\n” and Part I, Item 1A “Risk Factors.”\nOther Significant Items\nBusiness and Operational Matters\nDuring the third quarter of 2023, based on a strategic review of our operations, assets and investments, management implemented the “2023-2024 Business Efficiency Program” to refine the focus of our investments, and optimize our physical footprint. The 2023-2024 Business Efficiency Program included the write-off of certain information technology assets and contract exit costs, a reduction in staff including the relocation of certain job functions, and the impairment of assets associated with the closure or partial closure of data centers and offices. The 2023-2024 Business Efficiency Program was finalized as of December 31, 2024. For additional information, see Note 4, “Business Optimization Initiatives,” and Note 18, “Leases,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nPursuant to CMS’ Medicare Advantage Star Ratings system, CMS annually awards between 1.0 and 5.0 Stars to Medicare Advantage plans based on performance in several categories. Plans must have a Star Rating of 4.0 or higher to qualify for bonus payments. Our 2024 Star Ratings, which are used for payment year 2025, reflect that 53% of our Medicare Advantage members were enrolled in plans rated at least 4.0 Stars or higher. This is an increase, based on subsequent recalculations by CMS, over the original 2024 Star Ratings from October 2023, which reflected that 34% of our Medicare Advantage members were enrolled in plans rated at least 4.0 Stars or higher. \nCMS released our 2025 Star Ratings in October 2024, which will be used to determine our Medicare Advantage bonus payments in 2026. Our 2025 Star Ratings reflect that 38% of our Medicare Advantage members were enrolled in plans rated at least 4.0 Stars or higher. We expect this change will result in a reduction to our 2026 operating revenue of approximately $183 million, net of offsets from contracting provisions. Further, we expect to mitigate the financial impact to our 2026 operating gain and net income per share resulting from this change through various strategies such as contract diversification, operating expense efficiencies, capital deployment alternatives and network enhancements.\nBusiness Acquisitions and Divestitures\nInvestments in Joint Ventures and Completed Acquisitions\nOn December 31, 2024, we completed our acquisition of Centers Plan for Healthy Living LLC and Centers for Specialty Care Group IPA, LLC (“Centers”). Centers is a managed long-term care plan that serves New York state Medicaid and dual-eligible Medicaid/Medicare members, enabling adults with long-term care needs and disabilities to live safely and independently in their own home. This acquisition aligns with our strategic plan to grow the Health Benefits segment and leverage industry-leading expertise while serving Medicaid and dual-eligible populations.\nOn December 10, 2024, we completed our acquisition of RSV QOZB LTSS, Inc. and certain affiliated entities (d/b/a CareBridge), a value-based healthcare company that manages home and community-based services for Medicaid and dual-eligible Medicaid/Medicare members receiving long-term services and support. This acquisition aligns with Carelon Services’ care at home strategy, and our vision to be an innovative, valuable, and inclusive healthcare partner by providing care management programs that improve the lives of the people we serve. \n -47-\nOn August 6, 2024, as discussed in Note 5 “Investments,” we made an equity investment of $2,580 that resulted in our minority interest ownership of approximately 35% of Augusta Topco Holdings, L.P. (“Mosaic Health”), a joint venture with Clayton, Dubilier & Rice (“CD&R”) that is designed to accelerate innovation in care delivery across multiple regions in the United States by bringing together certain care delivery and enablement assets of Carelon Management Services, LLC (“CMSI Assets”), a Carelon Health business, and two CD&R portfolio businesses, apree health and Millennium Physician Group. Our additional contribution of the CMSI Assets to Mosaic Health was completed on January 1, 2025, for which we received an additional $300 of equity (approximately 5% ownership) in Mosaic Health. The CMSI Assets are included under the captions “Assets held for sale” and “Liabilities held for sale” in our consolidated balance sheets as of December 31, 2024.\nOn March 11, 2024, we completed our acquisition of Paragon Healthcare, Inc. and its subsidiaries (“Paragon”). Paragon, which operates as part of CarelonRx, provides infusion services and injectable therapies through its omnichannel model of ambulatory infusion centers, home infusion pharmacies, and other specialty pharmacy services. This acquisition aligns with our vision to be an innovative, valuable and inclusive healthcare partner by providing care management programs that improve the lives of the people we serve.\nOn February 15, 2023, we completed our acquisition of BioPlus Parent, LLC and its subsidiaries (“BioPlus”) from CarepathRx Aggregator, LLC. Prior to the acquisition, BioPlus was one of the largest independent specialty pharmacy organizations in the United States. BioPlus, which operates as part of CarelonRx, seeks to connect payors and providers of specialty pharmaceuticals to meet the medication therapy needs of patients with complex medical conditions. This acquisition aligns with our vision to be an innovative, valuable and inclusive healthcare partner by providing care management programs that improve the lives of the people we serve.\nDivestiture\nOn April 1, 2024, we completed the sale of our life and disability businesses to StanCorp Financial Group, Inc. (“The Standard”), a provider of financial protection products and services for employers and individuals, which resulted in a gain on sale of business of $201 in the year ended December 31, 2024. Upon closing, we and The Standard entered into a product distribution partnership. The related net assets held for sale for the life and disability businesses divested as of December 31, 2023, and the results of operations for such businesses for the year ended December 31, 2024 were not material.\nFor additional information, see Note 3, “Business Acquisitions and Divestitures,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nLitigation Matters\nWe are a defendant in multiple lawsuits that were initially filed in 2012 against the BCBSA and Blue Cross and/or Blue Shield licensees (the “Blue plans”) across the country. Cases filed in 28 states were consolidated into a single, multi-district proceeding captioned \nIn re Blue Cross Blue Shield Antitrust Litigation \n(“BCBSA Litigation”), that is pending before the U.S. District Court for the Northern District of Alabama (the “Court”). Generally, the lawsuits in the BCBSA Litigation challenge elements of the licensing agreements between the BCBSA and the independently owned and operated Blue plans. The cases were brought by two putative nationwide classes of plaintiffs, health plan subscribers and providers.\nThe BCBSA and Blue plans approved a settlement agreement and release with the subscriber plaintiffs (the “Subscriber Settlement Agreement”), and the ultimate amount paid by the Company under the Subscriber Settlement Agreement was $604, which was primarily accrued in 2020. The Subscriber Settlement Agreement and the defendants’ payment and non-monetary obligations under the Subscriber Settlement Agreement became effective in June 2024 with the request for the second Blue plan bid provision effective in September 2024. The funds held in escrow will be distributed in accordance with the Subscriber Settlement Agreement.\nThe BCBSA and the Blue plans have approved a settlement agreement and release (the “Provider Settlement Agreement”) with the provider plaintiffs, and in October 2024, the provider plaintiffs filed a motion for preliminary approval with the Court. The Court granted preliminary approval of the Provider Settlement Agreement on December 4, 2024. If approved by the Court, the Provider Settlement Agreement will require the defendants to make a monetary settlement payment, our portion of which is estimated to be $666, and will contain certain non-monetary terms including (i) expansion of certain opportunities to contract with providers in contiguous service areas, (ii) certain prompt pay commitments, and (iii) \n -48-\nvarious technological enhancements to the BlueCard program. We recognized our estimated payment obligation under the Provider Settlement Agreement of $666 in September 2024.\nFor additional information regarding the BCBSA Litigation, see Note 14, “Commitments and Contingencies – \nLitigation and Regulatory Proceedings – Blue Cross Blue Shield Antitrust Litigation\n,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nSelected Operating Performance\nDuring the year ended December 31, 2024, total medical membership decreased by 1.1 million, or 2.3%. The decrease in medical membership was driven primarily by attrition in Medicaid membership, including as a result of eligibility redeterminations and certain market exits, and decreases in our Employer Group risk-based and Medicare Supplement businesses. These decreases were partially offset by increases in our Employer Group fee-based, Individual and FEP\n®\n businesses.\nOperating revenue for the year ended December 31, 2024, was $175,204, an increase of $4,995, or 2.9%, from the year ended December 31, 2023. The increase in operating revenue was primarily driven by premium rate increases in all of our lines of business in recognition of medical cost trends, growth in CarelonRx product revenue and recent acquisitions. These increases were partially offset by declines in premiums driven by Medicaid membership attrition. \nNet income for the year ended December 31, 2024, was $5,971, a decrease of $20, or 0.3%, from the year ended December 31, 2023. The decrease in net income was primarily due to a net decrease in our operating gain in our reportable segments and higher income tax expense, partially offset by increased net investment income, gain on the sale of our life and disability businesses and lower amortization of other intangible assets.\nOur fully-diluted shareholders’ EPS for the year ended December 31, 2024, was $25.68, an increase of $0.46, or 1.8%, from the year ended December 31, 2023. Our diluted shares for the year ended December 31, 2024 were 232.9, a decrease of 4.5, or 1.9%, compared to the year ended December 31, 2023. The increase in EPS resulted from fewer diluted shares outstanding. \nOperating cash flow for the year ended December 31, 2024, was $5,808, or approximately 1.0 times net income. Operating cash flow for the year ended December 31, 2023 was $8,061, or approximately 1.3 times net income. The decrease in operating cash flow was primarily due to the impact of the membership decline in our Medicaid business and working capital changes. \nMembership and Other Metrics \nOur medical membership includes the following customer types: Individual, Employer Group risk-based, Employer Group fee-based, BlueCard\n®\n, Medicare, Medicaid and our FEP\n®\n. We refer to members in our service areas licensed by the BCBSA as our BCBS-branded, or Anthem BCBS, business. Non-BCBS-branded business refers to members in our non-BCBS-branded plans, which include Wellpoint, MMM and Simply Healthcare plans. In addition to the above medical membership, we also serve customers who purchase one or more of our other products or services that are often ancillary to our health business.\n•\nIndividual consists of individual customers under age 65 and their covered dependents. Individual policies are generally sold through independent agents and brokers, retail partnerships, our in-house sales force or via the Public Exchanges. Individual business is sold on a risk-based basis. We offer on-exchange products through Public Exchanges and off-exchange products. Federal premium subsidies are available only for certain Public Exchange Individual products. Unsubsidized Individual customers are generally more sensitive to product pricing and, to a lesser extent, the configuration of the network and the efficiency of administration. Customer turnover is generally higher with Individual as compared to Employer Group risk-based. Individual business accounted for 2.8%, 2.2% and 1.7% of our medical members at December 31, 2024, 2023 and 2022, respectively.\n•\nEmployer Group risk-based consists of employer customers who purchase products on a full-risk basis, which are products for which we charge a premium and indemnify our policyholders against costs for health benefits. Employer Group risk-based accounts include Local Group customers and National Accounts. Local Group consists of those employer customers with less than 5% of eligible employees located outside of the headquarter state, as \n -49-\nwell as customers with more than 5% of eligible employees located outside of the headquarter state with up to 5,000 eligible employees. In addition, Local Group includes Student Health members. National Accounts generally consist of multi-state employer groups primarily headquartered in an Elevance Health service area with at least 5% of the eligible employees located outside of the headquarter state and with more than 5,000 eligible employees. Some exceptions are allowed based on broker and consultant relationships. Employer Group risk-based accounts are generally sold through brokers or consultants who work with industry specialists from our in-house sales force and are offered both on and off the Public Exchanges. Employer Group risk-based accounted for 8.1%, 8.0% and 8.4% of our medical members at December 31, 2024, 2023 and 2022, respectively.\n•\nEmployer Group fee-based customers represent employer groups, Local Group, and National Accounts, who purchase fee-based products and elect to retain most or all of the financial risk associated with their employees’ healthcare costs. Some fee-based customers choose to purchase stop loss coverage to limit their retained risk. Employer Group fee-based accounts are generally sold through independent brokers or consultants retained by the customer working with our in-house sales force. Employer Group fee-based accounted for 45.0%, 43.2% and 42.4% of our medical members at December 31, 2024, 2023 and 2022, respectively.\n•\nBlueCard\n®\n host customers represent enrollees of Blue Cross and/or Blue Shield plans not owned by Elevance Health who receive healthcare services in our BCBSA licensed markets. BlueCard\n®\n membership consists of estimated host members using the national BlueCard\n®\n program. Host members are generally members who reside in or travel to a state in which an Elevance Health subsidiary is the Blue Cross and/or Blue Shield licensee and who are covered under an employer-sponsored health plan issued by a non-Elevance Health controlled BCBSA licensee (the “home plan”). We perform certain functions, including claims pricing and administration, for BlueCard\n®\n members, for which we receive service fees from the BlueCard\n®\n members’ home plans. Other administrative functions, including maintenance of enrollment information and customer service, are performed by the home plan. Host members are computed using, among other things, the average number of BlueCard\n®\n claims received per month. BlueCard\n®\n host membership accounted for 14.5%, 14.3% and 13.8% of our medical members at December 31, 2024, 2023 and 2022, respectively.\n•\nMedicare customers are Medicare-eligible individual members age 65 and over who have enrolled in Medicare Advantage, including Special Needs Plans (“SNPs”), also known as Medicare Advantage SNPs; dual-eligible programs through Medicare-Medicaid Plans (“MMPs”); Medicare Supplement plans; and Medicare Part D Prescription Drug Plans (“Medicare Part D”). Medicare Advantage plans provide Medicare beneficiaries with a managed care alternative to traditional Medicare and often include a Medicare Part D benefit. In addition, our Medicare Advantage SNPs provide tailored benefits to special needs individuals who are institutionalized or have severe or disabling chronic conditions and to dual-eligible customers, who are low-income seniors and persons under age 65 with disabilities. Medicare Advantage SNPs are coordinated care plans specifically designed to provide targeted care, covering all the healthcare services considered medically necessary for members and often providing professional care coordination services, with personal guidance and programs that help members maintain their health. Medicare Advantage membership also includes Medicare Advantage members in our Group Retiree Solutions business who are retired members of commercial accounts or retired members of groups who are not affiliated with our commercial accounts who have selected a Medicare Advantage product through us. Medicare Supplement plans typically pay the difference between healthcare costs incurred by a beneficiary and amounts paid by Medicare. Medicare Part D offers a prescription drug plan to Medicare and MMP beneficiaries. MMP, which was established as a result of the passage of the ACA, is focused on serving members who are dually eligible for Medicaid and Medicare. Medicare Supplement and Medicare Advantage products are marketed in the same manner, primarily through independent agents and brokers. Medicare program business accounted for 6.5%, 6.3% and 6.1% of our medical members at December 31, 2024, 2023 and 2022, respectively.\n•\nMedicaid membership represents eligible members who receive health benefits through publicly funded healthcare programs, including Medicaid, ACA-related Medicaid expansion programs, Temporary Assistance for Needy Families, programs for seniors and people with disabilities, Children’s Health Insurance Programs, and specialty programs such as those focused on long-term services and support, HIV/AIDS, foster care, behavioral health and/or substance abuse disorders, and intellectual disabilities or developmental disabilities, among others. Total Medicaid program business accounted for 19.5%, 22.4% and 24.3% of our medical members at December 31, 2024, 2023 and 2022, respectively.\n -50-\n•\nFEP\n®\n members consist of United States government employees and their dependents who receive health benefits within our geographic markets. FEP\n®\n business accounted for 3.6%, 3.5% and 3.4% of our medical members at December 31, 2024, 2023 and 2022, respectively.\nThe following table presents our medical membership by customer type as of December 31, 2024, 2023 and 2022. Also included below is other membership by product and other metrics. The membership data and other metrics presented are unaudited and in certain instances include estimates of the number of members represented by each contract at the end of the period. The CarelonRx Quarterly Adjusted Scripts metric represents adjusted script volume based on the number of days a prescription covers. On an adjusted basis, one 90-day script counts the same as three 30-day scripts. The Carelon Services Consumers Served metric represents the number of consumers receiving one or more healthcare related services from Carelon Services who are members of our affiliated health plans as well as those who are members of non-affiliated health plans. \n2024 vs. 2023\n2023 vs. 2022\n2024\n2023\n2022\nChange\n% Change\nChange\n% Change\nMedical Membership \n(in thousands)\nIndividual\n1,287 \n1,025 \n789 \n262 \n25.6 \n%\n236 \n29.9 \n%\nEmployer Group Risk-Based\n3,713 \n3,756 \n3,988 \n(43)\n(1.1)\n%\n(232)\n(5.8)\n%\nCommercial Risk-Based\n5,000 \n4,781 \n4,777 \n219 \n4.6 \n%\n4 \n0.1 \n%\nBlueCard\n®1\n6,630 \n6,706 \n6,555 \n(76)\n(1.1)\n%\n151 \n2.3 \n%\nEmployer Group Fee-Based\n20,569 \n20,227 \n20,174 \n342 \n1.7 \n%\n53 \n0.3 \n%\nCommercial Fee-Based\n27,199 \n26,933 \n26,729 \n266 \n1.0 \n%\n204 \n0.8 \n%\nMedicare Advantage\n2,066 \n2,047 \n1,977 \n19 \n0.9 \n%\n70 \n3.5 \n%\nMedicare Supplement\n891 \n923 \n947 \n(32)\n(3.5)\n%\n(24)\n(2.5)\n%\nTotal Medicare\n2,957 \n2,970 \n2,924 \n(13)\n(0.4)\n%\n46 \n1.6 \n%\nMedicaid\n8,917 \n10,503 \n11,571 \n(1,586)\n(15.1)\n%\n(1,068)\n(9.2)\n%\nFederal Employee Program\n®\n1,661 \n1,642 \n1,623 \n19 \n1.2 \n%\n19 \n1.2 \n%\nTotal Medical Membership\n45,734 \n46,829 \n47,624 \n(1,095)\n(2.3)\n%\n(795)\n(1.7)\n%\nOther Membership \n(in thousands)\n2\nDental Members\n7,282 \n6,820 \n6,692 \n462 \n6.8 \n%\n128 \n1.9 \n%\nDental Administration Members\n1,887 \n1,729 \n1,586 \n158 \n9.1 \n%\n143 \n9.0 \n%\nVision Members\n10,419 \n9,944 \n9,813 \n475 \n4.8 \n%\n131 \n1.3 \n%\nMedicare Part D Standalone Members\n256 \n260 \n271 \n(4)\n(1.5)\n%\n(11)\n(4.1)\n%\nOther Metrics\n (in millions)\nCarelonRx Quarterly Adjusted Scripts\n82.9 \n78.0 \n82.0 \n4.9 \n6.3 \n%\n(4.0)\n(4.9)\n%\nCarelon Services Consumers Served\n101.1 \n103.3 \n105.0 \n(2.2)\n(2.1)\n%\n(1.7)\n(1.6)\n%\n1       BlueCard\n®\n membership at December 31, 2023 and 2022 has been restated lower by 132 and higher by 93, respectively, to align to our current reporting, which is the BCBSA reporting methodology.\n2      We are no longer presenting our Life and Disability membership following the sale of that business on April 1, 2024.\nDecember 31, 2024 Compared to December 31, 2023\nMedical Membership \nTotal medical membership declined during the twelve months ended December 31, 2024. This was driven primarily by attrition in Medicaid membership, including as a result of eligibility redeterminations and certain market exits, decreases in our Employer Group risk-based and Medicare Supplement businesses. These decreases were partially offset by increases in our Employer Group fee-based, Individual and FEP\n®\n businesses.\n -51-\nOther Membership\nOur other membership has the potential to be impacted by changes in our medical membership, as our medical members often purchase our other products that are ancillary to our health business. Dental membership increased primarily due to favorable sales in our Individual, Employer Group fee-based and FEP\n®\n businesses. Dental Administration membership increased primarily due to favorable in-group change with our other BCBSA plans associated with the FEP\n®\n. Vision membership increased due to increased sales in our Employer Group fee-based and Individual businesses and increased sales associated with our Medicare Advantage plans.\nConsolidated Results of Operations\nOur consolidated summarized results of operations and other information for the years ended December 31, 2024, 2023 and 2022 are as follows:                                                        \n \n \nChange\n \nYears Ended December 31\n2024 vs. 2023\n2023 vs. 2022\n \n2024\n2023\n2022\n$\n%\n$\n%\nTotal operating revenue\n$\n175,204 \n$\n170,209 \n$\n155,660 \n$\n4,995 \n2.9 \n%\n$\n14,549 \n9.3 \n%\nNet investment income\n2,051 \n1,825 \n1,485 \n226 \n12.4 \n%\n340 \n22.9 \n%\nNet losses on financial instruments\n(445)\n(694)\n(550)\n249 \n(35.9)\n%\n(144)\n26.2 \n%\nGain on sales of business\n201 \n— \n— \n201 \n100.0 \n%\n— \n— \n%\nTotal revenues\n177,011 \n171,340 \n156,595 \n5,671 \n3.3 \n%\n14,745 \n9.4 \n%\nBenefit expense\n127,567 \n124,330 \n116,642 \n3,237 \n2.6 \n%\n7,688 \n6.6 \n%\nCost of products sold\n19,750 \n17,293 \n13,035 \n2,457 \n14.2 \n%\n4,258 \n32.7 \n%\nOperating expense\n20,025 \n20,087 \n17,700 \n(62)\n(0.3)\n%\n2,387 \n13.5 \n%\nOther expense\n1 \n1,765 \n1,915 \n1,618 \n(150)\n(7.8)\n%\n297 \n18.4 \n%\nTotal expenses\n169,107 \n163,625 \n148,995 \n5,482 \n3.4 \n%\n14,630 \n9.8 \n%\nIncome before income tax expense \n7,904 \n7,715 \n7,600 \n189 \n2.4 \n%\n115 \n1.5 \n%\nIncome tax expense\n1,933 \n1,724 \n1,712 \n209 \n12.1 \n%\n12 \n0.7 \n%\nNet income\n5,971 \n5,991 \n5,888 \n(20)\n(0.3)\n%\n103 \n1.7 \n%\nNet loss (gain) attributable to noncontrolling interests \n9 \n(4)\n6 \n13 \nNM\n(10)\nNM\nShareholders’ net income\n$\n5,980 \n$\n5,987 \n$\n5,894 \n$\n(7)\n(0.1)\n%\n$\n93 \n1.6 \n%\nAverage diluted shares outstanding\n232.9 \n237.4 \n242.8 \n(4.5)\n(1.9)\n%\n(5.4)\n(2.2)\n%\nDiluted shareholders’ earnings per share\n$\n25.68 \n$\n25.22 \n$\n24.28 \n$\n0.46 \n1.8 \n%\n$\n0.94 \n3.9 \n%\nEffective tax rate\n24.5 \n%\n22.3 \n%\n22.5 \n%\n200 bp\n3\n(20) bp\n3\nBenefit expense ratio\n2\n88.5 \n%\n87.0 \n%\n87.6 \n%\n150 bp\n3\n(60) bp\n3\nOperating expense ratio\n4\n \n11.4 \n%\n11.8 \n%\n11.4 \n%\n(40) bp\n3\n40 bp\n3\nIncome before income tax expense as a percentage of total revenues\n4.5 \n%\n4.5 \n%\n4.9 \n%\n0 bp\n3\n(40) bp\n3\nShareholders’ net income as a percentage of total revenues\n3.4 \n%\n3.5 \n%\n3.8 \n%\n(10) bp\n3\n(30) bp\n3\nCertain of the following definitions are also applicable to all other results of operations tables in this discussion:\nNM   Not meaningful.\n1\nIncludes interest expense and amortization of other intangible assets. \n2\nBenefit expense ratio represents benefit expense as a percentage of premium revenue. Premiums for the years ended December 31, 2024, 2023 and 2022 were $144,166, $142,854 and $133,229, respectively. Premiums are included in total operating revenue presented above.\n3\nbp = basis point; one hundred basis points = 1%.\n4\nOperating expense ratio represents operating expense as a percentage of total operating revenue.\n -52-\nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023\nTotal operating revenue increased primarily as a result of premium rate increases in all of our lines of business in recognition of medical cost trends, growth in CarelonRx product revenue and recent acquisitions. These increases were partially offset by declines in premiums driven by Medicaid membership attrition.\nNet investment income increased primarily due to higher income from fixed maturity securities and alternative investments.\nNet losses on financial instruments decreased due to increased gains on fixed maturity securities, partially offset by losses on strategic investments and equity securities.\nDuring the twelve months ended December 31, 2024, we experienced a gain on sale of business due to the sale of our life and disability business. \nBenefit expense increased primarily due to increases in medical cost trends in our Health Business segment due to Medicaid membership eligibility redeterminations. These increases were partially offset by declines driven by Medicaid membership attrition.\nOur benefit expense ratio increased, primarily driven by higher Medicaid membership cost trends due to Medicaid rates being inadequate to cover medical cost trends that were well in excess of historical averages, primarily due to the Medicaid membership redeterminations. \nCost of products sold reflects the cost of pharmaceuticals dispensed by CarelonRx for our unaffiliated pharmacy customers. Cost of products sold increased as a result of higher script utilization.\nOperating expense decreased primarily due to disciplined cost management, enhanced efficiency and lower business optimization charges, partially offset by the accrual for the Provider Settlement Agreement associated with the BCBSA Litigation.\nOur operating expense ratio decreased primarily due to disciplined cost management, enhanced efficiency, lower business optimization charges and the favorable impact of operating revenue growth, partially offset by the accrual for the Provider Settlement Agreement associated with the BCBSA Litigation. \nOther expense decreased primarily due to decreased amortization of intangible assets during the twelve months ended December 31, 2024. During the twelve months ended December 31, 2023, we had increased amortization of other intangible assets as the amortization period of certain assets was shortened to align with the dates our new branding took place.\nOur effective income tax rate increased from 22.3% to 24.5%, primarily due to the impact of geographic changes in the mix of our 2024 earnings.\nOur shareholders’ net income as a percentage of total revenues slightly decreased in 2024 as compared to 2023 as a result of all the factors discussed above.\n -53-\nReportable Segments Results of Operations\nThe following table presents a summary of our reportable segment financial information for the years ended December 31, 2024, 2023 and 2022: \nYears Ended December 31\nChange\n \n2024 vs. 2023\n2023 vs. 2022\n2024\n2023\n2022\n$\n%\n$\n%\nOperating Revenue\nHealth Benefits\n$\n150,275\n$\n148,571\n$\n138,484\n$\n1,704 \n1.1 \n%\n$\n10,087 \n7.3 \n%\nCarelonRx\n35,961\n33,835\n28,526\n2,126 \n6.3 \n%\n5,309 \n18.6 \n%\nCarelon Services\n17,961\n14,147\n12,860\n3,814 \n27.0 \n%\n1,287 \n10.0 \n%\nCorporate & Other\n309\n479\n399\n(170)\n(35.5)\n%\n80 \n20.1 \n%\nEliminations \n(29,302)\n(26,823)\n(24,609)\n(2,479)\n9.2 \n%\n(2,214)\n9.0 \n%\nTotal operating revenue\n$\n175,204\n$\n170,209\n$\n155,660\n$\n4,995 \n2.9 \n%\n$\n14,549 \n9.3 \n%\nOperating Gain (Loss)\nHealth Benefits\n$\n6,243\n$\n6,888\n$\n6,022\n$\n(645)\n(9.4)\n%\n$\n866 \n14.4 \n%\nCarelonRx\n2,172\n1,975\n1,868\n197 \n10.0 \n%\n107 \n5.7 \n%\nCarelon Services\n717\n680\n535\n37 \n5.4 \n%\n145 \n27.1 \n%\nCorporate & Other\n(1,270)\n(1,044)\n(142)\n(226)\n21.6 \n%\n(902)\n635.2 \n%\nOperating Margin\nHealth Benefits\n4.2 \n%\n4.6 \n%\n4.3 \n%\n(40) bp\n30 bp\nCarelonRx\n6.0 \n%\n5.8 \n%\n6.5 \n%\n20 bp\n(70) bp\nCarelon Services\n4.0 \n%\n4.8 \n%\n4.2 \n%\n(80) bp\n60 bp\nThe following table summarizes Health Benefits operating revenues by Commercial, Medicare, Medicaid and FEP\n®\n lines of business for the years ended December 31, 2024, 2023 and 2022:\nYears Ended December 31\nChange\n \n2024 vs. 2023\n2023 vs. 2022\n2024\n2023\n2022\n$\n%\n$\n%\nHealth Benefits Operating Revenue\nCommercial\n$\n46,816 \n$\n43,266 \n$\n41,674 \n$\n3,550 \n8.2 \n%\n$\n1,592 \n3.8 \n%\nMedicare\n36,795 \n35,067 \n31,604 \n1,728 \n4.9 \n%\n3,463 \n11.0 \n%\nMedicaid\n51,937 \n56,601 \n52,886 \n(4,664)\n(8.2)\n%\n3,715 \n7.0 \n%\nFederal Employee Program\n®\n14,727 \n13,637 \n12,320 \n1,090 \n8.0 \n%\n1,317 \n10.7 \n%\nTotal Health Benefits operating revenues\n$\n150,275 \n$\n148,571 \n$\n138,484 \n$\n1,704 \n1.1 \n%\n$\n10,087 \n7.3 \n%\nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023\nHealth Benefits\nOperating revenue increased primarily as a result of higher premium yields driven by premium rate increases in all of our lines of business in recognition of medical cost trends, partially offset by membership attrition in our Medicaid business. \nThe decrease in operating gain was primarily a result of Medicaid rates being inadequate to cover medical cost trends that were well in excess of historical averages due to Medicaid membership eligibility redeterminations, partially offset by improved premium yields in our other Health Benefits businesses. \n -54-\nCarelonRx\nOperating revenue increased primarily as a result of higher prescription volume associated with growth in external pharmacy members and the recent acquisition of Paragon, partially offset by the impact of Medicaid membership attrition.\nThe increase in operating gain was primarily a result of the growth in product revenue, partially offset by expenses associated with the launch of additional services by CarelonRx.\nCarelon Services\nOperating revenue increased primarily due to the continued expansion of our medical benefit management, behavioral health and post-acute care services, as well as acquisitions completed in 2024.\nThe increase in operating gain was primarily driven by improved performance in Carelon Services businesses, partially offset by increased medical cost trends in our post-acute business and the impact of Medicaid membership attrition.\nCorporate & Other\nThe increase in operating loss was primarily due to the accrual recorded for the Provider Settlement Agreement associated with the BCBSA Litigation, partially offset by disciplined cost management and lower business optimization charges.\nCritical Accounting Policies and Estimates\nWe prepare our consolidated financial statements in conformity with GAAP. Application of GAAP requires management to make estimates and assumptions that affect the amounts reported in our consolidated financial statements and accompanying notes and within this MD&A. We consider our most important accounting policies that require significant estimates and management judgment to be those policies with respect to liabilities for medical claims payable, goodwill and other intangible assets and investments, which are discussed below. Our other significant accounting policies are summarized in Note 2, “Basis of Presentation and Significant Accounting Policies,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nWe continually evaluate the accounting policies and estimates used to prepare the consolidated financial statements. In general, our estimates are based on historical experience, evaluation of current trends, information from third-party professionals and various other assumptions that we believe to be reasonable under the known facts and circumstances. Estimates can require a significant amount of judgment, and a different set of assumptions could result in material changes to our reported results.\nMedical Claims Payable\nThe most subjective accounting estimate in our consolidated financial statements is our liability for medical claims payable. At December 31, 2024, this liability was $15,746 and represented 20.9% of our total liabilities. We record this liability and the corresponding benefit expense for incurred but not paid claims, including the estimated costs of processing such claims. Incurred but not paid claims include (1) an estimate for claims that are incurred but not reported; as well as (2) claims reported to us but not yet processed through our systems, which approximated 97.5%, or $15,347, of our total medical claims liability as of December 31, 2024; and (3) claims reported to us and processed through our systems but not yet paid, which approximated 2.5%, or $399 of the total medical claims payable as of December 31, 2024. The level of claims payable processed through our systems but not yet paid may fluctuate from one period-end to the next, from approximately 2% to 6% of our total medical claims liability, due to timing of when claim payments are made.\nLiabilities for claims incurred but not reported and reported but not yet processed through our systems are determined in the aggregate, employing actuarial methods that are commonly used by health insurance actuaries and meet Actuarial Standards of Practice. Our reserving practice for claim liabilities is to consistently recognize the appropriate amount of reserve within a level of confidence required by Actuarial Standards of Practice. We determine the amount of the liability for incurred but not yet reported or processed claims by following a detailed actuarial process that uses both historical claim payment patterns as well as emerging medical cost trends to project our best estimate of claim liabilities. Under this process, historical paid claims data is formatted into “claim triangles,” which compare claim incurred dates to the dates of claim \n -55-\npayments. This information is analyzed to create “completion factors” that represent the average percentage of total incurred claims that have been paid through a given date after being incurred. Completion factors are applied to claims paid through the period-end date to estimate the ultimate claim expense incurred for the period. Actuarial estimates of incurred but not paid claim liabilities are then determined by subtracting the actual paid claims from the estimate of the ultimate incurred claims. \nFor the most recent incurred months (typically the most recent two months), the percentage of claims paid for claims incurred in those months is generally low. This makes the completion factor methodology less reliable for such months. Therefore, incurred claims for recent months are not projected from historical completion and payment patterns; rather, they are projected by estimating the claims expense for those months based on recent claims expense levels and healthcare trend levels (“trend factors”). \nOur reserve methodology, which relies upon historical information, must be adjusted to account for known or suspected operational and environmental changes. Adjustments are carried out by our actuaries, drawing on expert knowledge and taking into account their estimate of emerging impacts to benefit costs and payment speed. Factors such as changes in levels of utilization, unit costs, business mix, benefit plan designs, provider reimbursements, processing system modifications, claim inventory levels, claim processing and submission patterns, and operational changes resulting from business combinations are considered when developing our reserve estimates. We also compare prior period liabilities to revised claim liabilities based on subsequent claim development. In these comparisons, methods and assumptions remain constant as reserves are recalculated; rather, the availability of additional paid claims information drives changes in the re-estimate of the unpaid claim liability. To the extent appropriate, changes in such development are recorded as a change to current period benefit expense.\nOn a regular basis, we review cost trends and utilization assumptions set upon initial establishment of claim liabilities. We utilize subsequent paid claims activity to monitor and continuously adjust the claims liability and benefit expense. If actual results are determined to be materially different than assumptions regarding cost trends and utilization, future periods of our income statement and overall financial position could be impacted. Adjustments made to prior year estimates may result in either an additional benefit expense or a reduction of benefit expense in the period the adjustment is made. The variability of healthcare costs necessitates that claim liabilities be adjusted each period and are sometimes significant compared to the net income recorded in that period. An actuary’s judgment that a portion of the prior period liability is no longer needed or that an additional liability should have been accrued triggers the immediate recognition of prior period development. Once sufficient information is available to ascertain that the re-estimate of the liability is reasonable, the determination is made.\nWhile numerous factors contribute to our medical claims payable liability estimation, the two assumptions having the most significant impact on our incurred but not paid claims liability as of December 31, 2024, were the completion and trend factors. These vital assumptions can be affected by variables such as utilization levels, unit costs, mix of business, benefit plan designs, provider reimbursement levels, processing system conversions and changes, claim inventory levels, claim processing and submission patterns, and operational changes resulting from business combinations.\nThere is variation in the reasonable choice of completion factors by duration for durations of three months through twelve months where the completion factors have the most significant impact. As previously discussed, completion factors tend to be less reliable for the most recent months and therefore are not specifically utilized for months one and two. In our analysis for the claim liabilities at December 31, 2024, the variability in months three to five was estimated to be between 40 and 90 basis points, while months six through twelve have much lower estimated variability ranging from 0 to 30 basis points.\nThe difference in completion factor assumptions results in variability of 2%, or approximately $295, in the December 31, 2024 incurred but not paid claims liability, depending on the completion factors chosen. It is important to note that the completion factor methodology inherently assumes that historical completion rates will be reflective of the current period. However, it is possible that the actual completion rates for the current period will develop differently from historical patterns and therefore could fall outside the possible variations described herein.\nThe other major assumption used in the establishment of the December 31, 2024 incurred but not paid claim liability was the trend factors. In our analysis for the period ended December 31, 2024, there was a 380 basis point differential in the high and low trend factors. This range of trend factors would imply variability of 4%, or approximately $560, in the incurred but \n -56-\nnot paid claims liability, depending upon the trend factors used. Because historical trend factors are often not representative of current claim trends, the trend experience for the most recent six to nine months, plus knowledge of recent events likely affecting current trends, have been taken into consideration in establishing the incurred but not paid claims liability at December 31, 2024.\nSee Note 12, “Medical Claims Payable,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for a reconciliation of the beginning and ending balance for medical claims payable for the years ended December 31, 2024, 2023 and 2022. Components of the total incurred claims for each year include amounts accrued for current year estimated claims expense as well as adjustments to prior year estimated accruals. In Note 12, “Medical Claims Payable,” the line labeled “Net incurred medical claims: Prior years redundancies” accounts for those adjustments made to prior year estimates. The impact of any reduction of “Net incurred medical claims: Prior years redundancies” may be offset as we establish the estimate of “Net incurred medical claims: Current year”, or as we establish liabilities for premium refunds based upon the minimum medical loss ratio (“MLR”), the relative health risk of members, and other contractual or regulatory requirements. Our reserving practice is to consistently recognize the actuarial best estimate of our ultimate liability for our claims. When we recognize a release of the redundancy, we disclose the amount that is not in the ordinary course of business, if material. \nThe ratio of current year medical claims paid as a percent of current year net medical claims incurred was 88.5% for 2024, 88.0% for 2023 and 87.3% for 2022. This ratio serves as an indicator of claims processing speed whereby 2024 claims were processed at a similar speed to 2023 and 2022.\nWe calculate the percentage of prior year redundancies in the current year as a percent of prior year net incurred claims payable less prior year redundancies in the current year in order to demonstrate the development of the prior year reserves. For the year ended December 31, 2024, this metric was 12.3%, largely driven by favorable completion factor development from 2023 as well as favorable trend factor development at the end of 2023. For the year ended December 31, 2023, this metric was 11.4% and was largely driven by favorable trend factor development at the end of 2022 as well as favorable completion factor development from 2022. For the year ended December 31, 2022, this metric was 7.0% and was largely driven by favorable trend factor development at the end of 2021.\nWe calculate the percentage of prior year redundancies in the current year as a percent of prior year net incurred medical claims to indicate the percentage of redundancy included in the preceding year calculation of current year net incurred medical claims. We believe this calculation supports the reasonableness of our prior year estimate of incurred medical claims. For the year ended December 31, 2024, this metric was 1.4%, which was calculated using the redundancy of $1,731. This metric was 1.4% for 2023 and 0.9% for 2022. \nThe following table shows the variance between total net incurred medical claims as reported in Note 12, “Medical Claims Payable,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for each of 2023 and 2022 and the incurred claims for such years had it been determined retrospectively (computed as the difference between “net incurred medical claims – current year” for the year shown and “net incurred medical claims – prior years redundancies” for the immediately following year):\n \nYears Ended December 31\n \n2023\n2022\nTotal net incurred medical claims, as reported\n$\n120,227 \n$\n112,545 \nRetrospective basis, as described above\n120,067 \n111,843 \nVariance\n$\n160 \n$\n702 \nVariance to total net incurred medical claims, as reported\n0.1 \n%\n0.6 \n%\nGiven that our business is primarily short tailed (which means that medical claims are generally paid within twelve months of the member receiving service from the provider), the variance to total net incurred medical claims, as reported above, is used to assess the reasonableness of our estimate of ultimate incurred medical claims for a given calendar year with the benefit of one year of experience. We expect that substantially all of the development of the 2024 estimate of medical claims payable will be known during 2025.\n -57-\nThe 2023 variance to total net incurred medical claims, as reported, of 0.1% was less than the 2022 percentage of 0.6%. This was primarily driven by the fact that the change in prior year redundancy reported for 2023 as compared to 2022 was less than the change in the prior year redundancy reported for 2022 as compared to 2021. \nGoodwill and Other Intangible Assets\nOur total goodwill and other intangible assets at December 31, 2024 were $40,371, and represented 34.5% of our total assets and 97.5% of our total equity at December 31, 2024.\nWe follow FASB guidance for business combinations and goodwill and other intangible assets, which specifies the types of acquired intangible assets that are required to be recognized and reported separately from goodwill. Under the guidance, goodwill and other intangible assets (with indefinite lives) are not amortized but are tested for impairment at least annually. Furthermore, goodwill and other intangible assets are allocated to reporting units for purposes of the annual impairment test. Our impairment tests require us to make assumptions and judgments regarding the estimated fair value of our reporting units, which include goodwill and other intangible assets. In addition, certain other intangible assets with indefinite lives, such as trademarks, are also tested separately.\nWe complete our annual impairment tests of existing goodwill and other intangible assets with indefinite lives during the fourth quarter of each year. These tests involve the use of estimates related to the fair value of goodwill at the reporting unit level and other intangible assets with indefinite lives, and require a significant degree of management judgment and the use of subjective assumptions. Certain interim impairment tests are also performed when potential impairment indicators exist or changes in our business or other triggering events occur. We have the option of first performing a qualitative assessment for each reporting unit to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, which is an indication that our goodwill may be impaired. These qualitative impairment tests include assessing events and factors that could affect the fair value of the indefinite-lived intangible assets. Our procedures include assessing our financial performance, macroeconomic conditions, industry and market considerations, various asset specific factors and entity specific events. If we determine that a reporting unit’s goodwill may be impaired after utilizing these qualitative impairment analysis procedures, we are required to perform a quantitative impairment test.\nOur quantitative impairment test utilizes the projected income and market valuation approaches for goodwill and the projected income approach for our indefinite lived intangible assets. Use of the projected income and market valuation approaches for our goodwill impairment test reflects our view that both valuation methodologies provide a reasonable estimate of fair value. The projected income approach is developed using assumptions about future revenue, expenses and net income derived from our internal planning process. These estimated future cash flows are then discounted. Our assumed discount rate is based on our industry’s weighted-average cost of capital. Market valuations are based on observed multiples of certain measures including revenue; earnings before interest, taxes, depreciation and amortization; and book value of invested capital (debt and equity) and include market comparisons to publicly traded companies in our industry.\nWe did not incur any impairment losses as a result of our 2024 annual impairment tests, as it was determined that it is more likely than not that the estimated fair values of our reporting units were substantially in excess of the carrying values as of December 31, 2024. Additionally, we do not believe that the estimated fair values of our reporting units are at risk of becoming impaired in the next twelve months.\n If estimated fair values are less than the carrying values of goodwill and other intangibles with indefinite lives in future annual impairment tests, or if significant impairment indicators are noted relative to other intangible assets subject to amortization, we may be required to record impairment losses against future income.\nFor additional information, see Note 3, “Business Acquisitions and Divestitures,” and Note 10, “Goodwill and Other Intangible Assets,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\n \nInvestments\nCurrent and long-term marketable investment securities were $27,428 at December 31, 2024 and represented 23.5% of our total consolidated assets at December 31, 2024. We classify fixed maturity securities in our investment portfolio as “available-for-sale” and report those securities at fair value. Most fixed maturity securities are available to support current \n -58-\noperations and, accordingly, we classify such investments as current assets without regard to their contractual maturity. Investments used to satisfy contractual, regulatory or other requirements are classified as long-term, without regard to contractual maturity.\nOur impairment review is subjective and requires a high degree of judgment. We conduct this review on a quarterly basis, using both qualitative and quantitative factors. Such factors considered include the extent to which a security’s market value has been less than its cost, the reasons for the decline in value (i.e., credit event compared to liquidity, general credit spread widening, currency exchange rate or interest rate factors), financial condition and near term prospects of the issuer, including the credit ratings and changes in the credit ratings of the issuer, recommendations of investment advisors, and forecasts of economic, market or industry trends. \nIf a fixed maturity security is in an unrealized loss position and we have the intent to sell the fixed maturity security, or it is more likely than not that we will have to sell the fixed maturity security before recovery of its amortized cost basis, we write down the fixed maturity security’s cost basis to fair value and record an impairment loss in our consolidated statements of income. For impaired fixed maturity securities that we do not intend to sell or if it is more likely than not that we will not have to sell such securities, but we expect that we will not fully recover the amortized cost basis, we recognize the credit component of the impairment as an allowance for credit loss in our consolidated balance sheets and record an impairment loss in our consolidated statements of income. The non-credit component of the impairment is recognized in accumulated other comprehensive (loss) income. Furthermore, unrealized losses entirely caused by non-credit-related factors related to fixed maturity securities for which we expect to fully recover the amortized cost basis continue to be recognized in accumulated other comprehensive (loss) income. \nThe credit component of an impairment is determined primarily by comparing the net present value of projected future cash flows with the amortized cost basis of the fixed maturity security. The net present value is calculated by discounting our best estimate of projected future cash flows at the effective interest rate implicit in the fixed maturity security at the date of purchase. For mortgage-backed and asset-backed securities, cash flow estimates are based on assumptions regarding the underlying collateral, including prepayment speeds, vintage, type of underlying asset, geographic concentrations, default rates, recoveries and changes in value. For all other securities, cash flow estimates are driven by assumptions regarding probability of default, including changes in credit ratings and estimates regarding timing and amount of recoveries associated with a default.\nWe have a committee of accounting and investment associates and management that is responsible for managing the impairment review process. We believe that we have adequately reviewed our investment securities for impairment and that our investment securities are carried at fair value. We have established an allowance for credit loss and recorded credit loss expense as a reflection of our expected impairment losses. Given the inherent uncertainty of changes in market conditions and the significant judgments involved, there is continuing risk that declines in fair value may occur and additional impairment losses on investments may be recorded in future periods. \nIn addition to marketable investment securities, we held additional long-term investments of $9,749, or 8.3% of total consolidated assets, at December 31, 2024. These long-term investments consisted primarily of certain other equity investments, the cash surrender value of corporate-owned life insurance policies, notes receivables and mortgage loans. Due to their less liquid nature, these investments are classified as long-term.\nThrough our investing activities, we are exposed to financial market risks, including those resulting from changes in interest rates and changes in equity market valuations. We manage market risks through our investment policy, which establishes credit quality limits and limits on investments in individual issuers. Ineffective management of these risks could have an impact on our future results of operations and financial condition. Our investment portfolio includes fixed maturity securities with a fair value of $26,236 at December 31, 2024. The weighted-average credit rating of these securities was “A” as of December 31, 2024. Included in this balance are investments in fixed maturity securities of states, municipalities and political subdivisions of $835 that are guaranteed by third parties. With the exception of 14 securities with a fair value of $8, these securities are all investment-grade and carry a weighted-average credit rating of “AA” as of December 31, 2024. The securities are guaranteed by a number of different guarantors, and we do not have any material exposure to any single guarantor, neither indirectly through the guarantees, nor directly through investment in the guarantor. Further, the weighted-average credit rating of the fixed maturity securities without a guarantee, for which such information is available, was “A” as of December 31, 2024.\n -59-\nFair values of fixed maturity and equity securities are based on quoted market prices, where available. These fair values are obtained primarily from third-party pricing services, which generally use Level I or Level II inputs for the determination of fair value in accordance with FASB guidance for fair value measurements and disclosures. We have controls in place to review the pricing services’ qualifications and procedures used to determine fair values. In addition, we periodically review the pricing services’ pricing methodologies, data sources and pricing inputs to ensure the fair values obtained are reasonable.\nWe obtain quoted market prices for each security from the pricing services, which are derived through recently reported trades for identical or similar securities, making adjustments through the reporting date based upon available market observable information. For securities not actively traded, the pricing services may use quoted market prices of comparable instruments or discounted cash flow analyses, incorporating inputs that are currently observable in the markets for similar securities. Inputs that are often used in these valuation methodologies include, but are not limited to, broker quotes, benchmark yields, credit spreads, default rates and prepayment speeds. As we are responsible for the determination of fair value, we perform analysis on the prices received from the pricing services to determine whether the prices are reasonable estimates of fair value. Our analysis includes procedures such as a review of month-to-month price fluctuations and price comparisons to secondary pricing services. There were no adjustments to quoted market prices obtained from the pricing services during the years ended December 31, 2024 and 2023.\nIn certain circumstances, it may not be possible to derive pricing model inputs from observable market activity, and therefore, such inputs are estimated internally. Such securities are designated Level III in accordance with FASB guidance. Securities designated Level III at December 31, 2024 totaled $872 and represented approximately 2.6% of our total assets measured at fair value on a recurring basis. Our Level III securities primarily consisted of certain corporate securities and equity securities for which observable inputs were not always available and the fair values of these securities were estimated using inputs including, but not limited to, prepayment speeds, credit spreads, default rates and benchmark yields.\nFor additional information, see Part II, Item 7A, “Quantitative and Qualitative Disclosures about Market Risk” of this Annual Report on Form 10-K and Note 2, “Basis of Presentation and Significant Accounting Policies,” Note 5, “Investments,” and Note 7, “Fair Value,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nNew Accounting Pronouncements\nFor information regarding new accounting pronouncements that were issued or became effective during the year ended December 31, 2024 that had, or are expected to have, a material impact on our financial position, results of operations or financial statement disclosures, see the “\nRecently Adopted Accounting Guidance\n” and \n“Recent Accounting Guidance Not Yet Adopted”\n sections of Note 2, “Basis of Presentation and Significant Accounting Policies,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nLiquidity and Capital Resources\nIntroduction\nOur cash receipts result primarily from premiums, product revenue, service fees, investment income, proceeds from the sale or maturity of our investment securities, proceeds from business divestitures, proceeds from borrowings and proceeds from the issuance of common stock under our employee stock plans. Cash disbursements result mainly from claims payments, operating expenses, taxes, purchases of investment securities, interest expense, payments on borrowings, acquisitions, capital expenditures, repurchases of our debt securities and common stock and the payment of cash dividends. Cash outflows fluctuate with the amount and timing of settlement of these transactions. Any future decline in our profitability would likely have an unfavorable impact on our liquidity.\nWe manage our cash, investments and capital structure so that we are able to meet the short-term and long-term obligations of our business while maintaining financial flexibility and liquidity. We forecast, analyze and monitor our cash flows to enable investment and financing within the overall constraints of our financial strategy.\n -60-\nA substantial portion of the assets held by our regulated subsidiaries are in the form of cash and cash equivalents and investments. After considering expected cash flows from operating activities, we generally invest cash that exceeds our near-term obligations in longer term marketable fixed maturity securities to improve our overall investment income returns. Our investment strategy is to make investments consistent with insurance statutes and other regulatory requirements, while preserving our asset base. Our investments are generally available-for-sale to meet liquidity and other needs. Our subsidiaries pay out excess capital annually in the form of dividends to their respective parent companies for general corporate use, as permitted by applicable regulations.\nThe availability of financing in the form of debt or equity is influenced by many factors, including our profitability, operating cash flows, debt levels, debt ratings, contractual restrictions, regulatory requirements and market conditions. The securities and credit markets have in the past experienced higher than normal volatility. Interest rates on fixed debt income securities have increased since the beginning of 2022, which may increase our borrowing costs if we elect to issue debt. During recent years, the federal government and various governmental agencies have taken a number of steps to strengthen the regulation of the financial services market. In addition, governments around the world have developed their own plans to provide stability and security in the credit markets and to ensure adequate capital in certain financial institutions. \nA summary of our major sources and uses of cash and cash equivalents for the years ended December 31, 2024, 2023 and 2022 is as follows:\n \nYears Ended December 31\n$ Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nSources of Cash:\nNet cash provided by operating activities\n$\n5,808 \n$\n8,061 \n$\n8,399 \n$\n(2,253)\n$\n(338)\nProceeds from sales, maturities, calls and redemptions of investments, net of purchases\n586 \n— \n— \n586 \n— \nIssuances of short- and long-term debt, net of repayments\n6,200 \n626 \n862 \n5,574 \n(236)\nIssuances of common stock under employee stock plans\n221 \n152 \n182 \n69 \n(30)\nOther sources of cash, net\n— \n— \n762 \n— \n(762)\nTotal sources of cash\n12,815 \n8,839 \n10,205 \n3,976 \n(1,366)\nUses of Cash:\nPurchases of investments, net of proceeds from sales, maturities, calls and redemptions\n— \n(2,700)\n(2,338)\n2,700 \n(362)\nRepurchase and retirement of common stock\n(2,900)\n(2,676)\n(2,316)\n(224)\n(360)\nPurchases of subsidiaries, net of cash acquired\n(4,809)\n(1,552)\n(649)\n(3,257)\n(903)\nPurchases of property and equipment\n(1,256)\n(1,296)\n(1,152)\n40 \n(144)\nCash dividends\n(1,508)\n(1,395)\n(1,229)\n(113)\n(166)\nOther uses of cash, net\n(508)\n(80)\n— \n(428)\n(80)\nTotal uses of cash\n(10,981)\n(9,699)\n(7,684)\n(1,282)\n(2,015)\nEffect of foreign exchange rates on cash and cash equivalents\n(6)\n(1)\n(14)\n(5)\n13 \nNet increase (decrease) in cash and cash equivalents\n$\n1,828 \n$\n(861)\n$\n2,507 \n$\n2,689 \n$\n(3,368)\nLiquidity—Year Ended December 31, 2024 Compared to Year Ended December 31, 2023\nThe decline in cash provided by operating activities was primarily due to the impact of the membership decline in our Medicaid business and working capital changes. \nOther significant changes in sources and uses of cash year-over-year included (a) additional sources of cash from issuances of short- and long-term debt, net of repayments, proceeds from sales, maturities, calls and redemptions of investments, net of purchases, and issuances of common stock under employee stock plans and (b) increased uses of cash from purchases of subsidiaries, net of cash acquired, the repurchase and retirement of common stock, the purchase of property and equipment, cash dividends, and other uses of cash, net.\n -61-\nFinancial Condition\nWe maintained a strong financial condition and liquidity position, with consolidated cash, cash equivalents and investments in fixed maturity and equity securities of $35,716 at December 31, 2024. Since December 31, 2023, total cash, cash equivalents and investments in fixed maturity and equity securities decreased by $1,529, primarily due to cash used for common stock repurchases, purchases of subsidiaries net of cash acquired, purchases of property and equipment and cash dividends paid to shareholders. This decrease was partially offset by cash generated from operations, issuances of short-and-long term debt, net of repayment, proceeds from sales, maturities, calls, and redemptions, and issuances of common stock.\nMany of our subsidiaries are subject to various government regulations that restrict the timing and amount of dividends and other distributions that may be paid to their respective parent companies. Certain accounting practices prescribed by insurance regulatory authorities, or statutory accounting practices, differ from GAAP. Changes that occur in statutory accounting practices, if any, or other regulatory requirements, could impact our subsidiaries’ future dividend capacity. In addition, we have agreed to certain undertakings to regulatory authorities, including the requirement to maintain certain capital levels in certain of our subsidiaries.\nAt December 31, 2024, we held $2,357 of cash, cash equivalents and investments at the parent company, which are available for general corporate use, including investment in our businesses, acquisitions, potential future common stock repurchases and dividends to shareholders, repurchases of debt securities and debt and interest payments. \nPeriodically, we access capital markets and issue debt (“Notes”) for long-term borrowing purposes, for example, to refinance debt, to finance acquisitions or for share repurchases. Certain of these Notes may have a call feature that allows us to redeem the Notes at any time at our option and/or a put feature that allows a Note holder to redeem the Notes upon the occurrence of both a change in control event and a downgrade of the Notes below an investment grade rating. For more information on our debt, including redemptions and issuances, see Note 13, “Debt,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nWe calculate our consolidated debt-to-capital ratio, a non-GAAP measure, from the amounts presented on our audited consolidated balance sheets included in Part II, Item 8 of this Annual Report on Form 10-K. Our debt-to-capital ratio is calculated as total debt divided by total debt plus total equity. Total debt is the sum of short-term borrowings, current portion of long-term debt and long-term debt, less current portion. We believe our debt-to-capital ratio assists investors and rating agencies in measuring our overall leverage and additional borrowing capacity. In addition, our bank covenants include a maximum debt-to-capital ratio that we cannot and did not exceed. Our debt-to-capital ratio may not be comparable to similarly titled measures reported by other companies. Our consolidated debt-to-capital ratio was 43.0% and 38.9% as of December 31, 2024 and 2023, respectively.\nOur senior debt is rated “A” by S&P Global Ratings, “BBB+” by Fitch Ratings, Inc., “Baa2” by Moody’s Investors Service, Inc. and “bbb+” by AM Best Company, Inc. We intend to maintain our senior debt investment grade ratings. If our credit ratings are downgraded, our business, liquidity, financial condition and results of operations could be adversely impacted by limitations on future borrowings and a potential increase in our borrowing costs.\nCapital Resources\nWe have a shelf registration statement on file with the U.S. Securities and Exchange Commission to register an unlimited amount of any combination of debt or equity securities in one or more offerings. Specific information regarding terms and securities being offered will be provided at the time of an offering. Proceeds from future offerings are expected to be used for general corporate purposes, including, but not limited to, the repayment of debt, investments in or extensions of credit to our subsidiaries and the financing of possible acquisitions or business expansions.\nWe have a senior revolving credit facility (the “5-Year Facility”) with a group of lenders for general corporate purposes. The 5-Year Facility provides credit of up to $4,000 and matures in April 2027. Our ability to borrow under the 5-Year Facility is subject to compliance with certain covenants, including covenants requiring us to maintain a defined debt-to-capital ratio of not more than 60%, subject to increase in certain circumstances set forth in the credit agreement for the 5-Year Facility. As of December 31, 2024, our debt-to-capital ratio, as defined and calculated under the 5-Year Facility, was 43.0%. We do not believe the restrictions contained in our 5-Year Facility covenants materially affect our financial or operating \n -62-\nflexibility. As of December 31, 2024, we were in compliance with all of our debt covenants under the 5-Year Facility. There were no amounts outstanding under the 5-Year Facility at December 31, 2024.\nWe have an authorized commercial paper program of up to $4,000, the proceeds of which may be used for general corporate purposes. Should commercial paper issuance become unavailable, we have the ability to use a combination of cash on hand and/or our 5-Year Facility, which provides for credit in the amount of $4,000, to redeem any outstanding commercial paper upon maturity. At December 31, 2024, we had $0 outstanding under our commercial paper program. Beginning June 30, 2023, we have reclassified our commercial paper balances from long-term debt to short-term debt as our intent is to not replace short-term commercial paper outstanding at expiration with additional short-term commercial paper for an uninterrupted period extending for more than one year. \nWhile there is no assurance in the current economic environment, we believe the lenders participating in our 5-Year Facility, if market conditions allow, would be willing to provide financing in accordance with their legal obligations.\nWe are a member, through certain subsidiaries, of the Federal Home Loan Bank of Indianapolis, the Federal Home Loan Bank of Cincinnati, the Federal Home Loan Bank of Atlanta and the Federal Home Loan Bank of New York (collectively the “FHLBs”). As a member, we have the ability to obtain short-term cash advances, subject to certain minimum collateral requirements. At December 31, 2024, we had $365 of outstanding short-term borrowings from the FHLBs.\nAs discussed in “\nFinancial Condition\n” above, many of our subsidiaries are subject to various government regulations that restrict the timing and amount of dividends and other distributions that may be paid. Based upon these requirements, we currently estimate that approximately $2,700 of dividends will be paid to us by our subsidiaries during 2025. During 2024, we received $6,322 of dividends from our subsidiaries.\nIn addition to regulations regarding the timing and amount of dividends, our regulated subsidiaries’ states of domicile have statutory risk-based capital (“RBC”) requirements for health and other insurance companies and health maintenance organizations largely based on the National Association of Insurance Commissioners (the “NAIC”) Risk-Based Capital (RBC) for Health Organizations Model Act (the “RBC Model Act”). These RBC requirements are intended to measure capital adequacy, taking into account the risk characteristics of an insurer’s investments and products. The NAIC sets forth the formula for calculating the RBC requirements, which are designed to take into account asset risks, insurance risks, interest rate risks and other relevant risks with respect to an individual insurance company’s business. In general, under the RBC Model Act, an insurance company must submit a report of its RBC level to the state insurance department or insurance commissioner, as appropriate, at the end of each calendar year. Our regulated subsidiaries’ respective RBC levels as of December 31, 2024 were in excess of all applicable mandatory RBC requirements. In addition to exceeding these RBC requirements, we are in compliance with the liquidity and capital requirements for a licensee of the BCBSA and with the tangible net worth requirements applicable to certain of our California subsidiaries. For additional information, see Note 22, “Statutory Information,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nFuture Sources and Uses of Liquidity\nShort-Term Liquidity Requirements\nAs previously described, our cash disbursements result mainly from claims payments, administrative expenses, taxes, purchases of investment securities, interest expense, payments on borrowings, acquisitions, capital expenditures, repurchases of our debt securities and common stock and the payment of cash dividends. We believe cash on hand, operating cash receipts, investments and amounts available under our commercial paper program, our 5-Year Facility and borrowings available from the FHLBs will be adequate to fund our expected cash disbursements over the next twelve months.\n -63-\nLong-Term Liquidity Requirements\nAs of December 31, 2024, our long-term cash disbursements required under various contractual obligations and commitments were:\n•\nDebt and interest expense:  \nFuture debt and estimated interest payments are $52,073, with $2,855 due within the next twelve months. For additional information, see Note 13, “Debt,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\n•\nOperating leases:  \nWe lease office space and certain computer equipment, for which the future estimated payments were $886, with $184 due within the next twelve months. For additional information, see Note 18, “Leases,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\n•\nOther liabilities:  \nThese liabilities primarily consist of future policy reserves, projected other postretirement benefits, deferred compensation, supplemental executive retirement plan liabilities and certain other miscellaneous long-term obligations. Amounts due within twelve months were $35, with $1,956 due in future periods. Estimated future payments for funded pension benefits have been excluded from these numbers, as we had no funding requirements under the Employee Retirement Income Security Act of 1974, as amended, at December 31, 2024, as a result of the value of the assets in the plans. In addition, gross liabilities for uncertain tax positions and interest for which we cannot reasonably estimate the timing of the resolutions with the respective taxing authorities have not been included. For further information, see Note 8, “Income Taxes,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\n•\nPurchase obligations:  \nThese obligations include estimated payments for future services under contractual arrangements from third-party service vendors. Amounts due within the next twelve months for these purchase obligations were $995, while longer term payments were $3,891. For further information, see Note 14, “Commitments and Contingencies,” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\n•\nInvestment commitments:  \nThese include unfunded capital commitments for alternative investments and low-income housing tax credits. Estimated amounts due were $1,444, including $409 due within the next twelve months. \nIn addition to the contractual obligations and commitments discussed above, we have a variety of other contractual agreements related to acquiring materials and services used in our operations. However, we do not believe these other agreements contain material noncancelable commitments. \nWe regularly review the appropriate use of capital, including acquisitions, common stock and debt security repurchases and dividends to shareholders. The declaration and payment of any dividends or repurchases of our common stock or debt is at the discretion of our Board of Directors and depends upon our financial condition, results of operations, future liquidity needs, regulatory and capital requirements and other factors deemed relevant by our Board of Directors.\nOn January 22, 2025, our Audit Committee declared a quarterly cash dividend to shareholders of $1.71 per share on the outstanding shares of our common stock. This quarterly dividend is payable on March 25, 2025 to the shareholders of record as of March 10, 2025.\nUnder our Board of Directors’ authorization, we maintain a common stock repurchase program. As of December 31, 2024, we had Board authorization of $9,300 to repurchase our common stock. No duration has been placed on our common stock repurchase program, and we reserve the right to discontinue the program at any time. We intend to utilize this authorization over a multi-year period, subject to market and industry conditions.\nWe believe that funds from future operating cash flows, cash and investments and funds available under our credit facilities and/or from public or private financing sources will be sufficient for future operations and commitments, and for capital acquisitions and other strategic transactions.\nOther than disclosed in the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, we do not have any off-balance sheet derivative instruments, guarantee transactions, agreements or other contractual arrangements or any indemnification agreements that will require funding in future periods. We have not transferred assets to an unconsolidated entity that serves as credit, liquidity or market risk support to such entity. We do not hold any variable interest in an unconsolidated entity where such entity provides us with financing, liquidity, market risk or \n -64-\ncredit risk support. See Note 2, “Subsidiary Transactions,” of the Notes to Condensed Financial Statements (Parent Company Only) included in Part IV, Item 15 of this Annual Report on Form 10-K for additional detail on the Elevance Health, Inc. parent guarantees of certain subsidiaries.",
  "item2": null
}