{
  "source_file": "eme-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nBusiness Description\nWe are one of the largest specialty contractors in the United States and a leading provider of electrical and mechanical construction and facilities services, building services, and industrial services. Our services are provided to a broad range of commercial, technology, manufacturing, industrial, healthcare, utility, and institutional customers through approximately 100 operating subsidiaries. Such operating subsidiaries are organized into the following reportable segments: \n•\nUnited States electrical construction and facilities services;\n•\nUnited States mechanical construction and facilities services;\n•\nUnited States building services;\n•\nUnited States industrial services; and\n•\nUnited Kingdom building services. \nWe refer to our United States electrical construction and facilities services segment and our United States mechanical construction and facilities services segment together as our United States construction segments. On September 22, 2025, we entered into a definitive agreement to sell EMCOR (UK) Limited and EMCOR Group (UK) plc, which collectively represent our United Kingdom building services segment. The transaction is expected to close by the end of 2025, subject to U.K. regulatory approval.\nFor a more complete description of our operations, refer to Item 1. Business of our Form 10-K for the year ended December 31, 2024.\nOverview\nThe following table presents selected financial data for the quarters ended September 30, 2025 and 2024 (in thousands, except for percentages and per share data):\n \n \nFor the three months ended\nSeptember 30,\n \n2025\n2024\nRevenues\n$\n4,301,529 \n$\n3,696,924 \nRevenues increase from prior year\n16.4 \n%\n15.3 \n%\nGross profit\n$\n835,313 \n$\n734,726 \nGross profit as a percentage of revenues\n19.4 \n%\n19.9 \n%\nOperating income\n$\n405,696 \n$\n363,538 \nOperating income as a percentage of revenues\n9.4 \n%\n9.8 \n%\nNet income\n$\n295,373 \n$\n270,263 \nDiluted earnings per common share\n$\n6.57 \n$\n5.80 \nRevenues of $4.30 billion for the quarter ended September 30, 2025 set a record for the Company with respect to a third quarter and represent an increase of 16.4% from revenues of $3.70 billion for the quarter ended September 30, 2024. Demand for our services continues to be strong across most of the market sectors we serve and, as described in further detail below, we experienced revenue growth within all of our reportable segments. Our results for the third quarter of 2025 included incremental acquisition revenues of approximately $306.6 million.\nFor the quarter ended September 30, 2025, operating income was $405.7 million, establishing a third quarter record for the Company, and operating margin was 9.4%. This compares to operating income of $363.5 million and an operating margin of 9.8% for the quarter ended September 30, 2024. As described in further detail below, the $42.2 million increase in operating income was predominantly driven by greater contribution from our United States construction segments while the 40 basis point reduction in operating margin was attributable to a decrease in the operating margin of our United States electrical construction and facilities services segment.\nNet income of $295.4 million, or $6.57 per diluted share, for the quarter ended September 30, 2025 compares favorably to net income of $270.3 million, or $5.80 per diluted share, for the quarter ended September 30, 2024. While the majority of the increase in our net income and diluted earnings per share was a result of the increased operating income referenced above, diluted earnings per share for the quarter ended September 30, 2025 additionally benefited from a reduced weighted average share count given the impact of common stock repurchases made by us throughout 2024 and the first nine months of 2025.\n32\nTable of Contents\nImpact of Acquisitions\nIn order to provide a more meaningful period-over-period discussion of our operating results, we may discuss amounts generated or incurred (revenues, gross profit, selling, general and administrative expenses, and operating income) from companies acquired. These amounts reflect the acquired companies’ operating results in the current reported period only for the time period these entities were not owned by EMCOR in the comparable prior reported period. For further discussion regarding our acquisitions, refer to Note 4 - Acquisitions and Dispositions of Businesses of the notes to consolidated financial statements.\nDuring the first quarter of 2025, we completed the acquisition of Miller Electric Company (“Miller Electric”), a leading electrical contractor predominantly operating across the Southeastern United States, for total consideration of approximately $868.6 million. The results of operations for Miller Electric have been included within our United States electrical construction and facilities services segment. In addition, during the first nine months of 2025, we acquired five companies for upfront consideration of $50.9 million, inclusive of customary working capital adjustments. These acquisitions are comprised of: (a) three companies that have been included in our United States mechanical construction and facilities services segment, including: (i) a company in the Midwestern region of the United States that provides building automation controls and solutions to commercial, institutional, and industrial customers, (ii) a company that adds capabilities to our national fire protection offerings, and (iii) a provider of mechanical construction and maintenance services in the Western region of the United States, and (b) two companies that have been included in our United States building services segment, which enhance our building automation and controls or energy efficiency offerings. \nWe acquired seven companies during calendar year 2024 for upfront consideration of $231.1 million, inclusive of customary working capital adjustments. These acquisitions are comprised of: (a) an electrical contractor in the Southeast region of the United States, that has been included in our United States electrical construction and facilities services segment, (b) two companies that have been included within our United States mechanical construction and facilities services segment, including: (i) a leading plumbing services provider in the Southeast region of the United States and (ii) a full service provider of mechanical construction and maintenance services in Central Texas, (c) three companies that have been included in our United States building services segment, including: (i) a provider of building automation and controls solutions in the Northeast region of the United States, (ii) a mechanical services company in the Western region of the United States, and (iii) a mechanical services company in the Eastern region of the United States, and (d) an instrumentation and electrical contractor, that has been included in our United States industrial services segment, which provides electrical, automation, digital integration, and fabrication services to various energy sector and process equipment customers.\nResults of Operations\nRevenues\nThe following tables present our operating segment revenues from unrelated entities and their respective percentages of total revenues (in thousands, except for percentages):\n \n \nFor the three months ended September 30,\n \n2025\n% of\nTotal\n2024\n% of\nTotal\nRevenues:\nUnited States electrical construction and facilities services\n$\n1,285,269 \n30 \n%\n$\n845,030 \n23 \n%\nUnited States mechanical construction and facilities services\n1,779,279 \n41 \n%\n1,662,211 \n45 \n%\nUnited States building services\n813,879 \n19 \n%\n796,923 \n21 \n%\nUnited States industrial services\n286,914 \n7 \n%\n286,410 \n8 \n%\nTotal United States operations\n4,165,341 \n97 \n%\n3,590,574 \n97 \n%\nUnited Kingdom building services\n136,188 \n3 \n%\n106,350 \n3 \n%\nConsolidated revenues\n$\n4,301,529 \n100 \n%\n$\n3,696,924 \n100 \n%\n \nFor the nine months ended September 30,\n \n2025\n% of\nTotal\n2024\n% of\nTotal\nRevenues:\nUnited States electrical construction and facilities services\n$\n3,713,360 \n30 \n%\n$\n2,409,735 \n22 \n%\nUnited States mechanical construction and facilities services\n5,107,139 \n41 \n%\n4,745,057 \n44 \n%\nUnited States building services\n2,349,761 \n19 \n%\n2,359,191 \n22 \n%\nUnited States industrial services\n926,988 \n7 \n%\n964,510 \n9 \n%\nTotal United States operations\n12,097,248 \n97 \n%\n10,478,493 \n97 \n%\nUnited Kingdom building services\n376,053 \n3 \n%\n317,604 \n3 \n%\nConsolidated revenues\n$\n12,473,301 \n100 \n%\n$\n10,796,097 \n100 \n%\n33\nTable of Contents\nAs described in more detail below, due to strong demand for our services across most of the market sectors we serve, our consolidated revenues for the three months ended September 30, 2025 increased to $4.30 billion compared to $3.70 billion for the three months ended September 30, 2024, and our consolidated revenues for the nine months ended September 30, 2025 increased to $12.47 billion compared to $10.80 billion for the nine months ended September 30, 2024. For both 2025 periods, the growth in our revenues was driven by our United States construction segments. Revenues for the three and nine months ended September 30, 2025 included incremental acquisition contribution of approximately $306.6 million and $887.8 million, respectively.\nRevenues of our United States electrical construction and facilities services segment were $1,285.3 million for the three months ended September 30, 2025, a $440.2 million increase compared to revenues of $845.0 million for the three months ended September 30, 2024. Revenues of this segment for the nine months ended September 30, 2025 were $3,713.4 million, a $1,303.6 million increase compared to revenues of $2,409.7 million for the nine months ended September 30, 2024. This segment’s results for the three and nine months ended September 30, 2025 included $299.2 million and $806.8 million, respectively, of incremental acquisition revenues, almost entirely from Miller Electric. From a market sector perspective, increased revenues were generated from nearly all of the sectors we serve. While the largest increase in revenues was seen within the network and communications market sector, predominantly driven by greater demand for data center construction projects, this segment also experienced notable revenue growth within: (a) the healthcare market sector, as a result of greater project activity across several of the geographies in which we operate, (b) the commercial market sector, inclusive of certain office and tenant fit-out projects, (c) the institutional market sector, given an increase in revenues from public sector projects, and (d) the transportation market sector, due to certain infrastructure projects currently underway. Revenues of this segment for both the three and nine months ended September 30, 2025 additionally benefited from greater levels of short-duration projects and service work.\nOur United States mechanical construction and facilities services segment’s revenues for the three months ended September 30, 2025 were $1,779.3 million, a $117.1 million increase compared to revenues of $1,662.2 million for the three months ended September 30, 2024. For the nine months ended September 30, 2025, revenues of this segment were $5,107.1 million, a $362.1 million increase compared to revenues of $4,745.1 million for the nine months ended September 30, 2024. This segment’s results for the three and nine months ended September 30, 2025 included $7.4 million and $58.7 million, respectively, of incremental acquisition revenues. Similar to our United States electrical construction and facilities services segment, this segment experienced the most significant increase in revenues within the network and communications market sector due to greater demand for data center construction projects. In addition to data centers, notable revenue growth was generated from: (a) the manufacturing and industrial market sector, primarily driven by certain food processing projects, (b) the hospitality and entertainment market sector, given increased project activity, and (c) the water and wastewater market sector as a result of greater opportunities in the Southeast region of the United States. Further contributing to the revenue increase within this segment were greater levels of short-duration projects. These increases were partially offset by revenue declines from: (a) the high-tech manufacturing market sector, largely as we completed certain semiconductor manufacturing construction projects, and (b) the commercial market sector, as a result of: (i) the completion or substantial completion of several tenant fit-out or office projects, and (ii) fewer active warehousing and distribution projects for some of our e-commerce customers during the nine months ended September 30, 2025.\nRevenues of our United States building services segment were $813.9 million and $2,349.8 million for the three and nine months ended September 30, 2025, respectively, compared to revenues of $796.9 million and $2,359.2 million for the three and nine months ended September 30, 2024. This segment’s revenues for the nine months ended September 30, 2025 included incremental acquisition contribution of $2.6 million. For both 2025 periods, this segment’s mechanical services division experienced revenue growth from: (a) HVAC project and retrofit work, as demand for these services remained strong, partially as our customers continue to seek ways to improve the energy efficiency of their facilities, (b) service repair and maintenance volumes, given growth in our service contract base, and (c) building automation and controls projects, as we continue to expand our service offerings in this area. Offsetting the strength of the mechanical services division were revenue declines within this segment’s commercial site-based and government site-based services divisions due to the loss of certain facilities maintenance contracts that were not renewed upon rebid in a prior period.\nRevenues of our United States industrial services segment for the three months ended September 30, 2025 were $286.9 million, a slight increase compared to revenues of $286.4 million for the three months ended September 30, 2024. Revenues of this segment for the nine months ended September 30, 2025 were $927.0 million, a decrease of $37.5 million compared to revenues of $964.5 million for the nine months ended September 30, 2024. This segment’s results for the nine months ended September 30, 2025 included $19.7 million of incremental acquisition revenues. The reduction in this segment’s revenues for the nine months ended September 30, 2025 primarily resulted from its field services division, given: (a) lower turnaround project demand when compared to the prior year, which benefited from scope growth on certain projects, (b) the deferral or delay of planned turnaround projects, and (c) the completion of a renewable fuel project, which was active throughout 2024.\n34\nTable of Contents\nOur United Kingdom building services segment revenues were $136.2 million and $376.1 million for the three and nine months ended September 30, 2025, respectively, compared to revenues of $106.4 million and $317.6 million for the three and nine months ended September 30, 2024, respectively. The increase in this segment’s revenues for both 2025 periods was due to: (a) greater service revenues, as a result of: (i) the recent award of certain facilities maintenance contracts by new customers and (ii) scope expansion with existing customers, and (b) increased project work, largely within the manufacturing and industrial and network and communications market sectors. Revenues of this segment for the three and nine months ended September 30, 2025 were positively impacted by $4.8 million and $11.6 million, respectively, given favorable exchange rate movements for the British pound versus the United States dollar.\nCost of sales and gross profit\nThe following table presents our cost of sales, gross profit (revenues less cost of sales), and gross profit as a percentage of revenues (“gross profit margin”) (in thousands, except for percentages):\n \n \nFor the three months ended\nSeptember 30,\nFor the nine months ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\nCost of sales\n$\n3,466,216 \n$\n2,962,198 \n$\n10,081,499 \n$\n8,788,061 \nGross profit\n$\n835,313 \n$\n734,726 \n$\n2,391,802 \n$\n2,008,036 \nGross profit margin\n19.4 \n%\n19.9 \n%\n19.2 \n%\n18.6 \n%\nConsolidated gross profit for the three months ended September 30, 2025 was $835.3 million, or 19.4% of revenues, compared to consolidated gross profit of $734.7 million, or 19.9% of revenues, for the three months ended September 30, 2024. Gross profit for the three months ended September 30, 2025 included incremental acquisition contribution of $37.8 million, net of amortization expense attributable to identifiable intangible assets of $7.1 million. Excluding the impact of acquisitions, gross profit for the three months ended September 30, 2025 increased as a result of greater contribution from both of our United States construction segments, given the revenue growth referenced above. Despite overall excellent project execution during the quarter, our consolidated gross profit margin contracted by 50 basis points period-over-period largely as a result of a decrease in the gross profit margin of our United States electrical construction and facilities services segment due to: (a) lower profitability on certain projects in new geographies where we encountered reduced labor productivity or availability while investing in the development of a workforce and (b) the impact of the incremental intangible asset amortization expense resulting from the acquisition of Miller Electric.\nConsolidated gross profit for the nine months ended September 30, 2025 was $2,391.8 million, or 19.2% of revenues, compared to consolidated gross profit of $2,008.0 million, or 18.6% of revenues, for the nine months ended September 30, 2024. Gross profit for the nine months ended September 30, 2025 included incremental acquisition contribution of $123.3 million, net of amortization expense attributable to identifiable intangible assets of $19.5 million. Excluding the impact of acquisitions, the year-over-year increases in gross profit and gross profit margin were driven by both of our United States construction segments, as well as our United States building services segment, in each case due to improved revenue mix and excellent project execution.\nSelling, general and administrative expenses\nThe following table presents our selling, general and administrative expenses (“SG&A”) and selling, general and administrative expenses as a percentage of revenues (“SG&A margin”) (in thousands, except for percentages):\n \n \nFor the three months ended\nSeptember 30,\nFor the nine months ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\nSelling, general and administrative expenses\n$\n429,617 \n$\n371,188 \n$\n1,252,138 \n$\n1,051,737 \nSG&A margin\n10.0 \n%\n10.0 \n%\n10.0 \n%\n9.7 \n%\nOur selling, general and administrative expenses for the three months ended September 30, 2025 were $429.6 million, or 10.0% of revenues, compared to selling, general and administrative expenses of $371.2 million, or 10.0% of revenues, for the three months ended September 30, 2024. Selling, general and administrative expenses for the nine months ended September 30, 2025 were $1,252.1 million, or 10.0% of revenues, compared to selling, general and administrative expenses of $1,051.7 million, or 9.7% of revenues, for the nine months ended September 30, 2024. Selling, general and administrative expenses for the three and nine months ended September 30, 2025 included $37.9 million and $99.9 million, respectively, of incremental expenses directly related to companies acquired, including amortization expense attributable to identifiable intangible assets of $5.7 million and $16.3 million, respectively. Included in selling, general and administrative expenses for the nine months ended September 30, 2025 were $9.4 million of transaction related costs incurred during the first quarter in connection with the acquisition of Miller Electric.\n35\nTable of Contents\nExcluding incremental expenses resulting from acquisitions, our selling, general and administrative expenses for the three and nine months ended September 30, 2025 increased by $20.5 million and $100.5 million, respectively, primarily as a result of greater: (a) salaries and related employment expenses, due to additional headcount to support our organic revenue growth as well as annual cost of living adjustments, (b) incentive compensation expense, predominantly within our United States construction segments, given higher projected annual operating results, and (c) computer hardware and software costs due to various information technology and cybersecurity initiatives currently in process. \nThe 30 basis point increase in our SG&A margin for the nine months ended September 30, 2025 was primarily due to: (a) improved gross profit and gross profit margin, which resulted in the above referenced increase in incentive compensation expense across certain of our operating subsidiaries, (b) a decrease in revenues, without a commensurate decrease in selling, general and administrative expenses, within our United States building services and United States industrial services segments, and (c) the impact of the $9.4 million of transaction related costs referenced above.\nOperating income (loss)\nThe following tables present our operating income (loss) and operating income (loss) as a percentage of segment revenues (“operating margin”) (in thousands, except for percentages): \n \nFor the three months ended September 30,\n2025\n% of\nSegment\nRevenues\n2024\n% of\nSegment\nRevenues\nOperating income (loss):\nUnited States electrical construction and facilities services\n$\n145,200 \n11.3 \n%\n$\n119,118 \n14.1 \n%\nUnited States mechanical construction and facilities services\n229,296 \n12.9 \n%\n214,831 \n12.9 \n%\nUnited States building services\n59,390 \n7.3 \n%\n55,562 \n7.0 \n%\nUnited States industrial services\n6,292 \n2.2 \n%\n3,292 \n1.1 \n%\nTotal United States operations\n440,178 \n10.6 \n%\n392,803 \n10.9 \n%\nUnited Kingdom building services\n7,563 \n5.6 \n%\n5,497 \n5.2 \n%\nCorporate administration\n(42,045)\n— \n(34,762)\n— \nConsolidated operating income\n405,696 \n9.4 \n%\n363,538 \n9.8 \n%\nOther items:\nNet periodic pension income\n56 \n227 \nInterest income, net\n1,838 \n8,312 \nIncome before income taxes\n$\n407,590 \n$\n372,077 \n \nFor the nine months ended September 30,\n2025\n% of\nSegment\nRevenues\n2024\n% of\nSegment\nRevenues\nOperating income (loss):\nUnited States electrical construction and facilities services\n$\n438,901 \n11.8 \n%\n$\n299,284 \n12.4 \n%\nUnited States mechanical construction and facilities services\n654,780 \n12.8 \n%\n578,991 \n12.2 \n%\nUnited States building services\n145,858 \n6.2 \n%\n135,860 \n5.8 \n%\nUnited States industrial services\n12,633 \n1.4 \n%\n34,004 \n3.5 \n%\nTotal United States operations\n1,252,172 \n10.4 \n%\n1,048,139 \n10.0 \n%\nUnited Kingdom building services\n20,975 \n5.6 \n%\n16,651 \n5.2 \n%\nCorporate administration\n(133,483)\n— \n(108,491)\n— \nConsolidated operating income\n1,139,664 \n9.1 \n%\n956,299 \n8.9 \n%\nOther items:\nNet periodic pension income\n165 \n670 \nInterest income, net\n3,985 \n21,959 \nIncome before income taxes\n$\n1,143,814 \n$\n978,928 \n36\nTable of Contents\nOperating income for the three months ended September 30, 2025 was $405.7 million, an increase of $42.2 million compared to operating income of $363.5 million for the three months ended September 30, 2024. Operating margin for the three months ended September 30, 2025 was 9.4% compared to an operating margin of 9.8% for the three months ended September 30, 2024. As described in further detail below, the quarterly increase in operating income was predominantly driven by greater contribution from our United States construction segments, due to the revenue growth they experienced, while the 40 basis point reduction in operating margin was attributable to a decrease in the operating margin of our United States electrical construction and facilities services segment. For the nine months ended September 30, 2025, operating income was $1,139.7 million, an increase of $183.4 million compared to operating income of $956.3 million for the nine months ended September 30, 2024. Operating margin for the nine months ended September 30, 2025 was 9.1% compared to an operating margin of 8.9% for the nine months ended September 30, 2024. Operating income for the nine months ended September 30, 2025 included incremental acquisition contribution of $23.3 million, net of amortization expense attributable to identifiable intangible assets of $35.8 million. Excluding the impact of acquisitions, and as described in more detail below, the year-over-year increase in profitability was predominantly a result of improved operating performance within our United States construction segments, due to a more favorable mix of work and better project execution, including enhanced productivity, due in part to investments in virtual design and construction, prefabrication, and automation. \nOperating income of our United States electrical construction and facilities services segment was $145.2 million, or 11.3% of revenues, for the three months ended September 30, 2025, compared to $119.1 million, or 14.1% of revenues, for the three months ended September 30, 2024. Operating income of this segment for the nine months ended September 30, 2025 was $438.9 million, or 11.8% of revenues, compared to $299.3 million, or 12.4% of revenues, for the nine months ended September 30, 2024. Largely driven by Miller Electric, this segment’s operating income for the nine months ended September 30, 2025 included incremental acquisition contribution of $21.6 million, net of amortization expense attributable to identifiable intangible assets of $30.8 million. The increase in operating income of this segment for both 2025 periods resulted from greater gross profit given the growth in revenues it experienced. While the most significant increase in gross profit was generated within the network and communications market sector, this segment additionally experienced increases within the majority of the other market sectors in which we operate, generally in line with the revenue trends described above. With respect to the period-over-period decreases in operating margin, this segment’s results were impacted by: (a) lower profitability on certain projects in new geographies where we encountered reduced labor productivity or availability while investing in the development of a workforce and (b) the incremental intangible asset amortization expense resulting from the acquisition of Miller Electric, which negatively impacted operating margin by approximately 90 basis points and approximately 80 basis points, respectively, for the three and nine months ended September 30, 2025.\nOur United States mechanical construction and facilities services segment’s operating income for the three months ended September 30, 2025 was $229.3 million, or 12.9% of revenues, compared to operating income of $214.8 million, or 12.9% of revenues, for the three months ended September 30, 2024. Operating income of this segment for the nine months ended September 30, 2025 was $654.8 million, or 12.8% of revenues, compared to $579.0 million, or 12.2% of revenues, for the nine months ended September 30, 2024. In addition to the impact of greater revenues, the operating results of this segment for both 2025 periods benefited from excellent project execution and a more favorable mix of work. From a market sector perspective, this segment experienced greater profitability across a number of the sectors in which we operate, with the most significant increase in gross profit coming from network and communications. This segment’s operating income for the nine months ended September 30, 2025 included incremental acquisition contribution of $2.8 million, net of amortization expense attributable to identifiable intangible assets of $3.1 million. Partially offsetting this increased profitability was a decrease in gross profit from the commercial market sector, primarily as a result of reduced revenues within such sector.\nOperating income of our United States building services segment was $59.4 million, or 7.3% of revenues, for the three months ended September 30, 2025 compared to $55.6 million, or 7.0% of revenues, for the three months ended September 30, 2024. Operating income of this segment for the nine months ended September 30, 2025 was $145.9 million, or 6.2% of revenues, compared to $135.9 million, or 5.8% of revenues, for the nine months ended September 30, 2024. For both 2025 periods, this segment’s mechanical services division continued to produce strong margins across its portfolio of HVAC retrofits, building automation and controls projects, and repair service work orders. Headwinds faced in this segment’s commercial site-based services and government site-based services divisions, given the loss of the previously referenced facilities maintenance contracts, partially offset such profitability during the first nine months of 2025. The results of this segment for the nine months ended September 30, 2024 included an $11.0 million reserve for a specific customer bankruptcy within its commercial site-based services division, which negatively impacted the segment’s operating margin by 40 basis points in such prior year period.\nOur United States industrial services segment reported operating income of $6.3 million, or 2.2% of revenues, for the three months ended September 30, 2025, compared to operating income of $3.3 million, or 1.1% of revenues, for the three months ended September 30, 2024. Despite the increase in quarter-over-quarter profitability, for the nine months ended September 30, 2025, this segment reported operating income of $12.6 million, or 1.4% of revenues, compared to operating \n37\nTable of Contents\nincome of $34.0 million, or 3.5% of revenues, for the nine months ended September 30, 2024. The decrease in operating income and operating margin of this segment for the nine months ended September 30, 2025 was primarily a result of: (a) the reductions in segment revenues discussed above, which also resulted in a greater amount of unabsorbed labor costs, and (b) a less favorable revenue mix when compared to the prior year period, which benefited from turnaround projects of a greater size as well as a large renewable fuel project.\nOperating income of our United Kingdom building services segment was $7.6 million, or 5.6% of revenues, for the three months ended September 30, 2025, compared to $5.5 million, or 5.2% of revenues, for the three months ended September 30, 2024. Operating income for the nine months ended September 30, 2025 was $21.0 million, or 5.6% of revenues, compared to $16.7 million, or 5.2% of revenues, for the nine months ended September 30, 2024. For both 2025 periods, the increase in this segment’s operating income and operating margin was due to the revenue growth it experienced, which resulted in: (a) greater gross profit and (b) a reduction in SG&A margin as our segment management team leveraged its overhead cost structure. In addition, operating income and operating margin of this segment for the three months ended September 30, 2025 benefited from an increase in gross profit margin given a more favorable project mix largely within the network and communications and  manufacturing and industrial market sectors. Operating income of this segment for the three and nine months ended September 30, 2025 were positively impacted by $0.3 million and $0.7 million, respectively, as a result of favorable exchange rate movements for the British pound versus the United States dollar.\nOur corporate administration expenses for the three months ended September 30, 2025 were $42.0 million, compared to $34.8 million for the three months ended September 30, 2024. For the nine months ended September 30, 2025, our corporate administration expenses were $133.5 million, compared to $108.5 million for the nine months ended September 30, 2024. Corporate expenses for the first nine months of 2025 included $9.4 million of transaction related costs incurred in connection with the acquisition of Miller Electric. Excluding these items, the increase in corporate expenses for both 2025 periods was primarily a result of greater: (a) computer hardware and software costs, due to various information technology and cybersecurity initiatives currently in process, and (b) employment expenses, partially due to additional headcount to support our growth as well as annual cost of living adjustments. \nOther items\nFor the three months ended September 30, 2025, net interest income was $1.8 million, compared to net interest income of $8.3 million for the three months ended September 30, 2024. For the nine months ended September 30, 2025, net interest income was $4.0 million, compared to net interest income of $22.0 million for the nine months ended September 30, 2024. These year-over-year fluctuations were a result of a reduction in interest income primarily due to a lower average daily invested cash balance, coupled with an increase in interest expense, given the utilization of our revolving credit facility during the first nine months of 2025.\nFor the three and nine months ended September 30, 2025, our income tax provision was $112.2 million and $305.6 million, respectively, compared to an income tax provision of $101.8 million and $263.9 million for the three and nine months ended September 30, 2024, respectively. Our effective income tax rate for the three and nine months ended September 30, 2025 was 27.5% and 26.7%, respectively, compared to an effective income tax rate for the three and nine months ended September 30, 2024 of 27.4% and 27.0%, respectively. Refer to Note 9 - Income Taxes of the notes to consolidated financial statements for further discussion regarding our income tax provision and effective income tax rate.\nRemaining Unsatisfied Performance Obligations    \nThe following table presents the transaction price allocated to remaining unsatisfied performance obligations (“remaining performance obligations”) for each of our reportable segments and their respective percentage of total remaining performance obligations (in thousands, except for percentages):\nSeptember 30, 2025\n% of Total\nDecember 31, 2024\n% of Total\nSeptember 30, 2024\n% of Total\nRemaining performance obligations:\nUnited States electrical construction and \nfacilities services\n$\n4,497,521 \n35 \n%\n$\n3,068,396 \n31 \n%\n$\n2,767,672 \n28 \n%\nUnited States mechanical construction and facilities services\n6,421,665 \n51 \n%\n5,463,096 \n54 \n%\n5,362,689 \n55 \n%\nUnited States building services\n1,280,681 \n10 \n%\n1,246,642 \n12 \n%\n1,334,163 \n14 \n%\nUnited States industrial services\n202,198 \n2 \n%\n138,599 \n1 \n%\n110,583 \n1 \n%\nTotal United States operations\n12,402,065 \n98 \n%\n9,916,733 \n98 \n%\n9,575,107 \n98 \n%\nUnited Kingdom building services\n211,828 \n2 \n%\n185,466 \n2 \n%\n214,345 \n2 \n%\nTotal operations\n$\n12,613,893 \n100 \n%\n$\n10,102,199 \n100 \n%\n$\n9,789,452 \n100 \n%\n38\nTable of Contents\nOur remaining performance obligations at September 30, 2025 were approximately $12.61 billion compared to approximately $10.10 billion at December 31, 2024 and approximately $9.79 billion at September 30, 2024. When compared to December 31, 2024, remaining performance obligations increased by approximately $2.51 billion. Acquisitions, notably Miller Electric, account for approximately $0.91 billion of such increase, with the remaining growth resulting from new contract awards across all of our reportable segments. From a market sector perspective, we experienced growth within the majority of the sectors we serve, with the most significant increases within: (a) network and communications, largely as a result of several data center construction contracts, (b) water and wastewater, given recent project awards in the Southeast region of the United States, (c) institutional, (d) manufacturing and industrial, due to certain: (i) food processing construction projects and (ii) renewable energy projects, (e) commercial, including various warehousing and distribution projects, and (f) hospitality and entertainment, resulting from select project opportunities.\nSee Note 3 - Revenue from Contracts with Customers of the notes to consolidated financial statements for further disclosure regarding our remaining performance obligations.\nLiquidity and Capital Resources    \nThe following section discusses our principal liquidity and capital resources, as well as our primary liquidity requirements and sources and uses of cash. \nWe are focused on the efficient conversion of operating income into cash to provide for the Company’s material cash requirements, including working capital needs, investment in our growth strategies through business acquisitions and capital expenditures, satisfaction of contractual commitments, including principal and interest payments on any outstanding indebtedness, and shareholder return through share repurchases and dividend payments. We strive to maintain a balanced approach to capital allocation in order to achieve growth, deliver value, and minimize risk. \nManagement monitors financial markets and overall economic conditions for factors that may affect our liquidity and capital resources and adjusts our capital allocation strategy as necessary. Negative macroeconomic trends could have an adverse effect on future liquidity if we experience delays in the payment of outstanding receivables beyond normal payment terms, an increase in credit losses, or significant increases in the price of commodities or the materials and equipment utilized for our project and service work, beyond those experienced in recent years. In addition, during economic downturns, there have typically been fewer small discretionary projects from the private sector and our competitors have aggressively bid larger long-term infrastructure and public sector contracts. Our liquidity is also impacted by: (a) the type and length of construction contracts in place, as performance of long duration contracts typically requires greater amounts of working capital, (b) the level of turnaround activities within our United States industrial services segment, as such projects are billed in arrears pursuant to contractual terms that are standard within the industry, and (c) the billing terms of our maintenance contracts, including those within our United States and United Kingdom building services segments. While we strive to negotiate favorable billing terms, which allow us to invoice in advance of costs incurred on certain of our contracts, there can be no assurance that such terms will be agreed to by our customers.\nAs of September 30, 2025, we had cash and cash equivalents, excluding restricted cash, of $655.1 million, which are maintained in depository accounts and highly liquid investments with original maturity dates of three months or less. Both our short-term and long-term liquidity requirements are expected to be met through our cash and cash equivalent balances, cash generated from our operations, and, as necessary, the borrowing capacity under our revolving credit facility. Our credit agreement provides for a $1.30 billion revolving credit facility, for which there was $1.23 billion of available capacity as of September 30, 2025. \nRefer to Note 7 - Debt of the notes to consolidated financial statements for further information regarding our credit agreement. Based upon our current credit rating and financial position, we can also reasonably expect to be able to secure long-term debt financing if required to achieve our strategic objectives; however, no assurances can be made that such debt financing will be available on favorable terms. We believe that we have sufficient financial resources available to meet our short-term and foreseeable long-term liquidity requirements.\nCash Flows\nThe following table presents a summary of our operating, investing, and financing cash flows (in thousands):\n     \n \nFor the nine months ended\nSeptember 30,\n \n2025\n2024\nNet cash provided by operating activities\n$\n777,659 \n$\n938,402 \nNet cash used in investing activities\n$\n(977,719)\n$\n(243,687)\nNet cash used in financing activities\n$\n(495,027)\n$\n(455,032)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n$\n11,009 \n$\n7,377 \n(Decrease) increase in cash, cash equivalents, and restricted cash\n$\n(684,078)\n$\n247,060 \n39\nTable of Contents\nDuring the nine months ended September 30, 2025, our cash balance, including cash equivalents and restricted cash, decreased by approximately $684.1 million from $1,340.4 million at December 31, 2024 to $656.3 million at September 30, 2025. Changes in our cash position from December 31, 2024 to September 30, 2025 are described in further detail below. \nOperating Activities\n – Operating cash flows generally represent our net income as adjusted for certain non-cash items and changes in assets and liabilities. Net cash provided by operating activities for the nine months ended September 30, 2025 was approximately $777.7 million compared to approximately $938.4 million for the nine months ended September 30, 2024. The decrease in our operating cash flow period-over-period was a result of an increase in working capital, primarily on our construction projects, given the progression on a number of contracts for which we were previously billed ahead. As we worked through these upfront payments, we saw the expected decrease in operating cash as our cash outflows exceeded our inflows on these projects. Such decrease was partially offset by an increase in our net income for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024.\nInvesting Activities\n – Investing cash flows consist primarily of payments for acquisition of businesses, capital expenditures, and proceeds from the sale or disposal of property, plant, and equipment. Net cash used in investing activities for the nine months ended September 30, 2025 increased by approximately $734.0 million compared to the nine months ended September 30, 2024, primarily due to the acquisition of Miller Electric.\nFinancing Activities\n – Financing cash flows consist primarily of the issuance and repayment of short-term and long-term debt, repurchases of common stock, payments of dividends to stockholders, and the issuance of common stock through certain equity plans. Net cash used in financing activities was $495.0 million for the nine months ended September 30, 2025 compared to $455.0 million for the nine months ended September 30, 2024. The $40.0 million variance was primarily due to an increase in common stock repurchases made by us. The timing of common stock repurchases is at management’s discretion subject to securities laws and other legal requirements and depends upon several factors, including market and business conditions, current and anticipated future liquidity, share price, and share availability, among others. For additional detail regarding our share repurchase program, refer to Note 10 - Common Stock of the notes to consolidated financial statements.\nWe currently pay a regular quarterly dividend of $0.25 per share. For the nine months ended September 30, 2025 and 2024, cash payments related to dividends were $33.8 million and $31.9 million, respectively. Our credit agreement places limitations on the payment of dividends on our common stock. However, we do not believe that the terms of such agreement currently materially limit our ability to pay such quarterly dividends for the foreseeable future.\nEffect of Exchange Rate Changes on Cash, Cash Equivalents, and Restricted Cash \n–\n \nWe are exposed to fluctuations in foreign currency exchange rates, almost entirely with respect to the British pound. Therefore, the $3.6 million variance between the nine months ended September 30, 2025 and 2024 was a direct result of exchange rate movements for the British pound versus the United States dollar.\nMaterial Cash Requirements from Contractual and Other Obligations\nAs of September 30, 2025, our short-term and long-term material cash requirements for known contractual and other obligations were as follows: \nOutstanding Debt and Interest Payments\n – As of September 30, 2025, there were no direct borrowings outstanding under our revolving credit facility. Interest payments on any future borrowings will be determined based on prevailing interest rates at that time. Refer to Note 7 - Debt of the notes to consolidated financial statements for further detail of our debt obligations, including our revolving credit facility.\nOperating and Finance Leases\n – In the normal course of business, we lease real estate, vehicles, and equipment under various arrangements which are classified as either operating or finance leases. Future payments for such leases, excluding leases with initial terms of one year or less, were $507.5 million at September 30, 2025, with $117.8 million payable within the next 12 months.\nOpen Purchase Obligations\n – As of September 30, 2025, we had $2.95 billion of open purchase obligations, of which payments totaling approximately $2.51 billion are expected to become due within the next 12 months. These obligations represent open purchase orders to suppliers and subcontractors related to our construction and services contracts. These purchase orders are not reflected in the Consolidated Balance Sheets and are not expected to impact future liquidity as amounts should be recovered through customer billings. \n40\nTable of Contents\nInsurance Obligations\n – As described in further detail in Note 12 - Commitments and Contingencies of the notes to consolidated financial statements, we have loss payment deductibles and/or self-insured retentions for certain insurance matters. As of September 30, 2025, our insurance liabilities, net of estimated recoveries, were $283.8 million. Of this net amount, approximately $62.1 million is estimated to be payable within the next 12 months. Due to many uncertainties inherent in resolving these matters, it is not practical to estimate these payments beyond such period. To the extent that the amount required to settle claims covered by insurance continues to increase, the cost of our insurance coverage, including premiums and deductibles, is likely to increase.\nContingent Consideration Liabilities\n – We have incurred liabilities related to contingent consideration arrangements associated with certain acquisitions, payable in the event discrete performance objectives are achieved by the acquired businesses during designated post-acquisition periods. The aggregate amount of these liabilities can change due to additional business acquisitions, settlement of outstanding liabilities, changes in the fair value of amounts owed based on performance during such post-acquisition periods, and accretion in present value. As of September 30, 2025, the present value of expected future payments relating to these contingent consideration arrangements was $8.2 million. Of this amount, $7.3 million is estimated as being payable within the next 12 months, with the remainder due pursuant to the terms of our contractual agreements, some of which extend into 2027.\nIn addition, material cash requirements for other potential obligations, for which we cannot reasonably estimate future payments, include the following:\nLegal Proceedings\n – We are involved in several legal proceedings in which damages and claims have been asserted against us. While litigation is subject to many uncertainties and the outcome of litigation is not predictable with assurance, we do not believe that any such matters will have a material adverse effect on our financial position, results of operations, or liquidity. Refer to Note 12 - Commitments and Contingencies of the notes to consolidated financial statements for more information regarding legal proceedings.\nMultiemployer Benefit Plans\n – In addition to our Company sponsored benefit plans, we participate in certain multiemployer pension and other post-retirement plans. The cost of these plans is equal to the annual required contributions determined in accordance with the provisions of negotiated collective bargaining agreements. Our future contributions to the multiemployer plans are dependent upon a number of factors. Amounts of future contributions that we would be contractually obligated to make pursuant to these plans cannot be reasonably estimated. Refer to Note 14 - Retirement Plans of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of our Form 10-K for the year ended December 31, 2024 for more information regarding multiemployer benefit plans.\nOff-Balance Sheet Arrangements and Other Commercial Commitments\nThe terms of our construction contracts frequently require that we obtain from surety companies, and provide to our customers, surety bonds as a condition to the award of such contracts. These surety bonds are issued in return for premiums, which vary depending on the size and type of the bond, and secure our payment and performance obligations under such contracts. We have agreed to indemnify the surety companies for amounts, if any, paid by them in respect of surety bonds issued on our behalf. As of September 30, 2025, based on the percentage-of-completion of our projects covered by surety bonds, our aggregate estimated exposure, assuming defaults on all our then existing contractual obligations, was approximately $3.0 billion, which represents approximately 24% of our total remaining performance obligations. \nSurety bonds expire at various times ranging from final completion of a project to a period extending beyond contract completion in certain circumstances. Such amounts can also fluctuate from period to period based upon the mix and level of our bonded operating activity. For example, public sector contracts require surety bonds more frequently than private sector contracts and, accordingly, our bonding requirements typically increase as the amount of our public sector work increases. Our estimated maximum exposure as it relates to the value of the surety bonds outstanding is lowered on each bonded project as the cost to complete is reduced, and each commitment under a surety bond generally extinguishes concurrently with the expiration of its related contractual obligation.\nSurety bonds are sometimes provided to secure obligations for wages and benefits payable to or for certain of our employees, at the request of labor unions representing such employees. In addition, surety bonds or letters of credit may be issued as collateral for certain insurance obligations. As of September 30, 2025, we satisfied approximately $61.7 million and $71.2 million of the collateral requirements of our insurance programs by utilizing surety bonds and letters of credit, respectively. All such letters of credit were issued under our revolving credit facility, therefore reducing the available capacity of such facility.\nWe are not aware of any losses in connection with surety bonds that have been posted on our behalf, and we do not expect to incur significant losses in the foreseeable future.\n41\nTable of Contents\nFrom time to time, we discuss with our current and other surety bond providers the amounts of surety bonds that may be available to us based on our financial strength and the absence of any default by us on any surety bond issued on our behalf and believe those amounts are currently adequate for our needs. However, if we experience changes in our bonding relationships or if there are adverse changes in the surety industry, we may: (a) seek to satisfy certain customer requests for surety bonds by posting other forms of collateral in lieu of surety bonds, such as letters of credit, parent company guarantees, or cash, in order to convince customers to forego the requirement for surety bonds, (b) increase our activities in our businesses that rarely require surety bonds, and/or (c) refrain from bidding for certain projects that require surety bonds. \nThere can be no assurance that we would be able to effectuate alternatives to providing surety bonds to our customers or to obtain, on favorable terms, sufficient additional work that does not require surety bonds. Accordingly, a reduction in the availability of surety bonds could have a material adverse effect on our financial position, results of operations, and/or cash flows.\nIn the ordinary course of business, we, at times, guarantee obligations of our subsidiaries under certain contracts. Generally, we are liable under such an arrangement only if our subsidiary fails to perform its obligations under the contract. Historically, we have not incurred any substantial liabilities as a consequence of these guarantees. \nWe do not have any other material financial guarantees or off-balance sheet arrangements other than those disclosed herein.\nNew Accounting Pronouncements\nWe review new accounting standards to determine the expected impact, if any, that the adoption of such standards will have on our financial position and/or results of operations. See Note 2 - New Accounting Pronouncements of the notes to consolidated financial statements for further information regarding new accounting standards, including the anticipated dates of adoption and the effects on our consolidated financial position, results of operations, or liquidity.\nCritical Accounting Policies and Estimates\nThe preparation of our consolidated financial statements is based on the application of significant accounting policies, which require management to make estimates and assumptions. Our significant accounting policies are described further in Note 2 - Summary of Significant Accounting Policies of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of our Form 10-K for the year ended December 31, 2024. We base our estimates on historical experience, known or expected trends, third-party valuations, and various other assumptions that we believe to be reasonable under the circumstances. As future events and their effects cannot be determined with precision, actual results could differ significantly from these estimates. There have been no significant changes to our critical accounting policies or methods during the nine months ended September 30, 2025.\n42\nTable of Contents"
}