{
  "source_file": "eog-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.  MANAGEMENT'S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\nEOG RESOURCES, INC.\nOverview \nEOG Resources, Inc., together with its subsidiaries (collectively, EOG), is one of the largest independent (non-integrated) crude oil and natural gas companies in the United States of America (United States) with proved reserves in the United States and the Republic of Trinidad and Tobago (Trinidad).  EOG is focused on being among the highest return and lowest cost producers, committed to strong environmental performance and playing a significant role in the long-term future of energy.  EOG operates under a consistent business and operational strategy that focuses on a comprehensive approach to developing acreage through industry cycles.  EOG evaluates rate of return, net present value, margins, payback period and other key metrics.  This strategy is intended to enhance the generation of cash flow and earnings from each unit of production on a cost-efficient basis, allowing EOG to maximize long-term growth in shareholder value and maintain a strong balance sheet.  EOG implements its strategy primarily by emphasizing the drilling of internally generated prospects in order to find and develop low-cost reserves.  Maintaining the lowest possible operating cost structure, coupled with efficient and safe operations and robust environmental stewardship practices and performance, is integral in the implementation of EOG's strategy.\nCommodity Prices\n.\n  Prices for crude oil and condensate, natural gas liquids (NGLs) and natural gas have historically been volatile.  This volatility is expected to continue due to the many uncertainties associated with the world political and economic environment, the global supply of, and demand for, crude oil, NGLs and natural gas, the availability of other energy supplies and other factors, including tariffs, trade policies and agreements and trade barriers or other restrictions imposed by the U.S. government or other governments and the related impact of such measures on commodity and financial markets.\nThe market prices of crude oil and condensate, NGLs and natural gas impact the amount of cash generated from EOG's operating activities, which, in turn, impact EOG's financial position and results of operations.  \nFor the first nine months of 2025, the average U.S. New York Mercantile Exchange (NYMEX) crude oil and natural gas prices were $66.67 per barrel and $3.39 per million British thermal units (MMBtu), respectively, representing a decrease of 14% and an increase of 61%, respectively, from the average NYMEX prices for the same period in 2024.  Market prices for NGLs are influenced by the components extracted, including ethane, propane and butane and natural gasoline, among others, and the respective market pricing for each component.  \nIncluding the impact of EOG's NGL financial derivative contracts and based on EOG's tax position, EOG's price sensitivity as of September 30, 2025, for each $1.00 per barrel increase or decrease in crude oil and condensate price, combined with the estimated change in NGL price, is approximately $165 million for net income and $211 million for pretax cash flows from operating activities, in each case for the full-year 2025.\nIncluding the impact of EOG's natural gas financial derivative contracts and based on EOG's tax position and the portion of EOG's anticipated natural gas volumes for which prices have not (as of September 30, 2025) been determined under long-term marketing contracts, EOG's price sensitivity as of September 30, 2025, for each $0.10 per thousand cubic feet increase or decrease in natural gas price, is approximately $36 million for net income and $46 million for pretax cash flows from operating activities, in each case for the full-year 2025.\nOperating Efficiencies.\n  EOG has undertaken (and continues to undertake) initiatives to increase its drilling, completion and operating efficiencies and improve the performance of its wells.  Such initiatives include (among others): (i) EOG's downhole drilling motor program, which has resulted in increased footage drilled per day and, in turn, reduced drilling times; (ii) enhanced techniques for completing its wells, which have resulted in increased footage completed per day and pumping hours per day; (iii) drilling extended laterals, which has resulted in a decrease in cost per foot drilled; and (iv) EOG's self-sourced sand program, which has provided supply certainty and resulted in operational efficiencies in its well completion operations.  In addition, EOG has entered into agreements with its service providers from time to time, when available and advantageous, to secure the costs and availability of certain drilling and completion services it utilizes as part of its operations. \n-25-\n    \nEOG plans to continue with these initiatives and actions, though there can be no assurance that such efforts will continue to be successful due to the impacts of any future inflationary pressures (such as from tariffs, other trade barriers or other macroeconomic factors) on EOG's operating costs and capital expenditures, cash flows and results of operations.  Further, there can be no assurance that any such pressures or factors will not impact EOG's ability to conduct its future day-to-day drilling, completion and production operations.  \nUnited States.\n \nEOG's efforts to identify plays with large reserve potential have proven to be successful.  EOG continues to drill numerous wells in large acreage plays, which in the aggregate have contributed substantially to, and are expected to continue to contribute substantially to, EOG's crude oil and condensate, NGLs and natural gas production.  EOG has placed an emphasis on applying its horizontal drilling and completion expertise to unconventional crude oil plays and natural gas plays. \nDuring the first nine months of 2025, EOG continued to focus on initiatives to increase its drilling, completion and operating efficiencies and improve well performance. In addition, EOG continued to evaluate certain potential crude oil and condensate, NGLs and natural gas exploration and development prospects and to look for opportunities to add drilling inventory through leasehold acquisitions, farm-ins, exchanges or tactical or bolt-on acquisitions. On a volumetric basis, as calculated using a ratio of 1.0 barrel of crude oil and condensate or NGLs to 6.0 thousand cubic feet of natural gas, crude oil and condensate and NGLs production accounted for approximately 69% and 72% of EOG's United States production during the first nine months of 2025 and 2024, respectively.  During the first nine months of 2025, EOG's drilling and completion activities occurred primarily in the Delaware Basin and the Eagle Ford play.  EOG's major producing areas in the United States are in New Mexico, Texas and Ohio.  \nOn July 4, 2025, the U.S. President signed into law the One Big Beautiful Bill Act, which primarily made permanent (generally with amendments) certain tax provisions of the 2017 Tax Cuts and Jobs Act.  Included, among others, were changes to business tax provisions such as permanently restoring 100% bonus depreciation and full domestic research expensing.  While the legislation is expected to reduce EOG's 2025 cash tax payments, it did not have a material impact on EOG's earnings.  \nOn August 1, 2025, EOG completed its previously announced acquisition of Encino Acquisition Partners, LLC (Encino).  The assets of Encino include 675,000 core net acres in the Utica play.  EOG is in the process of integrating and optimizing operations and expects to complete 65 net wells in the Utica play in 2025.  The financial results of Encino have been included in EOG's consolidated financial statements beginning August 1, 2025.\nTrinidad\n.  In Trinidad, EOG continues to deliver natural gas which is sold to the National Gas Company of Trinidad and Tobago Limited and its subsidiary under existing supply contracts.  Crude oil and condensate are sold to both Heritage Petroleum Company Limited and BP Trinidad and Tobago LLC.  In January 2025, EOG executed two production sharing contracts with the Government of Trinidad and Tobago for the Lower Reverse L and North Coast Marine Area 4(a) Blocks.  \nOther International.  \nIn February 2025, a subsidiary of EOG signed an exploration participation agreement with Bapco Energies B.S.C. (Closed) (Bapco) to evaluate a gas exploration prospect in the Kingdom of Bahrain.  In August 2025, the government of the Kingdom of Bahrain approved the related concession agreement.  As part of the transaction, EOG has a working interest in several producing legacy wells and has commenced drilling operations.\nIn May 2025, a subsidiary of EOG was awarded a new oil exploration concession for Unconventional Onshore Block 3 (UCO3) by Abu Dhabi's Supreme Council for Financial and Economic Affairs.  EOG holds one hundred percent equity and operatorship and, in coordination with Abu Dhabi National Oil Company (ADNOC), will explore and appraise unconventional oil in the concession area.  Following a three-year appraisal phase, EOG may enter into a production concession in which ADNOC has the option to participate.  \nIn November 2021, a subsidiary of EOG was granted an exploration permit for the WA-488-P Block, located offshore Western Australia.  The company has deferred drilling plans to further evaluate the prospect.  \nEOG continues to evaluate other select crude oil and natural gas opportunities outside the United States, primarily by pursuing exploration opportunities in countries where crude oil and natural gas reserves have been identified.\n-26-\n    \n2025 Capital and Operating Plan\n.\n  Total 2025 capital expenditures are estimated to range from approximately $6.2 billion to $6.4 billion, including exploration and development drilling, facilities, leasehold acquisitions, capitalized interest, dry hole costs and other property, plant and equipment and excluding the acquisition of the equity interests in Encino, property acquisitions, asset retirement costs, non-cash exchanges and transactions and exploration costs incurred as operating expenses.  EOG plans to continue to focus a substantial portion of its exploration and development expenditures in its major producing areas in the United States.  In particular, EOG will be focused on United States drilling activity in its plays where it generates the highest rates of return - specifically, in the Delaware Basin, Eagle Ford, Utica and Rocky Mountain area.  To further enhance the economics of these plays, EOG expects to continue to improve well performance and to focus on improving operating efficiencies; see the above related discussion.  Relative to 2024, full-year oil production for 2025 (inclusive of production from the acquired Encino assets) is expected to increase by approximately 6% and full-year total crude oil, NGLs and natural gas production for 2025 (inclusive of production from the acquired Encino assets) is expected to increase by approximately 15%.  In addition, EOG plans to continue to spend a portion of its anticipated 2025 capital expenditures on leasing acreage, evaluating new prospects and transportation infrastructure.\nManagement continues to believe EOG has one of the strongest prospect inventories in EOG's history.  When it fits EOG's strategy, EOG will make acquisitions that bolster existing drilling programs or offer incremental exploration and/or production opportunities.\nCapital Structure\n.\n  One of management's key strategies is to maintain a strong balance sheet with a consistently below average debt-to-total capitalization ratio as compared to those in EOG's peer group.  EOG's debt-to-total capitalization ratio was 20% at September 30, 2025 and 14% at December 31, 2024.  As used in this calculation, total capitalization represents the sum of total current and long-term debt and total stockholders' equity.\nOn April 1, 2025, EOG repaid upon maturity the $500 million aggregate principal amount of its 3.15% Senior Notes due 2025.\nOn July 1, 2025, EOG closed on its offering of $500 million aggregate principal amount of its 4.400% Senior Notes due 2028, $1.25 billion aggregate principal amount of its 5.000% Senior Notes due 2032, $1.25 billion aggregate principal amount of its 5.350% Senior Notes due 2036 and $500 million aggregate principal amount of its 5.950% Senior Notes due 2055 (collectively, the New Notes).  Interest on the New Notes is payable semi-annually in arrears on January 15 and July 15 of each year, beginning on January 15, 2026.  EOG received net proceeds of $3.47 billion from the issuance of the New Notes, which were used for general corporate purposes, including the payment of a portion of the consideration for the acquisition of Encino and related fees, costs and expenses. \nAt September 30, 2025, the $750 million aggregate principal amount of EOG's 4.15% Senior Notes due 2026 was classified as long-term debt based upon EOG's intent and ability to ultimately replace such amount with other long-term debt.\nEOG has significant flexibility with respect to financing alternatives, including borrowings under its commercial paper program, bank borrowings, borrowings under its senior unsecured revolving credit facility, joint development agreements and similar agreements and issuances of additional equity and/or debt securities.  For related discussion, see ITEM 7, Management's Discussion and Analysis of Financial Condition and Results of Operations - Capital Resources and Liquidity included in EOG's 2024 Annual Report.\nCash Return Framework.\n  In November 2023, EOG announced an increase in its cash return commitment - specifically, a commitment, effective beginning with fiscal year 2024, to return a minimum of 70% of annual net cash provided by operating activities before certain balance sheet-related changes, less total capital expenditures, to stockholders, through a combination of quarterly dividends, special dividends and share repurchases. \nFor discussion regarding EOG's payment of dividends and share repurchases, see ITEM 1A,\n \nRisk Factors\n \nand ITEM 5,\n \nMarket for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\n \nin EOG's 2024 Annual Report and Part II, Item 2,\n \nUnregistered Sales of Equity Securities and Use of Proceeds\n \nin this Quarterly Report on Form 10-Q.\n-27-\n    \nDividend Declarations.\n  On February 27, 2025, the Board of Directors (Board) declared a quarterly cash dividend on the common stock of $0.975 per share paid on April 30, 2025, to stockholders of record as of April 16, 2025.\nOn May 1, 2025, the Board declared a quarterly cash dividend on the common stock of $0.975 per share paid on July 31, 2025, to stockholders of record as of July 17, 2025.\nOn May 30, 2025, the Board declared a quarterly cash dividend on the common stock of $1.02 per share paid on October 31, 2025, to stockholders of record as of October 17, 2025.  This represented an increase from the previous quarterly cash dividend which was $0.975 per share.\nOn November 6, 2025, the Board declared a quarterly cash dividend on the common stock of $1.02 per share to be paid on January 30, 2026, to stockholders of record as of January 16, 2026.\n-28-\n    \nResults of Operations\nThe following review of operations for the three months and nine months ended September 30, 2025 and 2024 should be read in conjunction with the Condensed Consolidated Financial Statements of EOG and notes thereto included in this Quarterly Report on Form 10‑Q.  The following includes results of operations from the assets acquired from Encino beginning August 1, 2025. \nThree Months Ended September 30, 2025 vs. Three Months Ended September 30, 2024 \nOperating Revenues and Other.\n  During the third quarter of 2025, total operating revenues decreased $118 million, or 2%, to $5,847 million from $5,965 million for the same period of 2024.  Total revenues from sales of EOG's production of crude oil and condensate, NGLs and natural gas for the third quarter of 2025 increased $170 million, or 4%, to $4,554 million from $4,384 million for the same period of 2024.  EOG recognized net gains on the mark-to-market of financial commodity and other derivative contracts of $116 million for the third quarter of 2025 compared to net gains of $79 million for the same period of 2024.  Gathering, processing and marketing revenues for the third quarter of 2025 decreased $303 million, or 20%, to $1,178 million from $1,481 million for the same period of 2024.  \n-29-\n    \nVolume and price statistics for the three-month periods ended September 30, 2025 and 2024 were as follows (see Note 5 for segment financial information):\nThree Months Ended\nSeptember 30,\n \n2025\n2024\nCrude Oil and Condensate Volumes (MBbld) \n(1)\nUnited States\n532.9 \n491.8 \nTrinidad\n1.6 \n1.2 \nTotal\n534.5 \n493.0 \nAverage Crude Oil and Condensate Prices ($/Bbl) \n(2)\n \nUnited States\n$\n65.97 \n$\n76.95 \nTrinidad\n57.74 \n63.15 \nComposite\n65.95 \n76.92 \nNatural Gas Liquids Volumes (MBbld) \n(1)\nUnited States\n309.3 \n254.3 \nTotal\n309.3 \n254.3 \nAverage Natural Gas Liquids Prices ($/Bbl) \n(2)\n \n \nUnited States\n$\n21.25 \n$\n22.42 \nNatural Gas Volumes (MMcfd) \n(1)\nUnited States\n2,511 \n1,745 \nTrinidad\n230 \n225 \nOther International \n(3)\n4 \n— \nTotal\n2,745 \n1,970 \nAverage Natural Gas Prices ($/Mcf) \n(2)\n \n \nUnited States\n$\n2.71 \n$\n1.84 \nTrinidad\n3.80 \n3.68 \nOther International \n(3)\n3.27 \n— \nComposite\n2.80 \n2.05 \nCrude Oil Equivalent Volumes (MBoed) \n(4)\nUnited States\n1,260.7 \n1,037.1 \nTrinidad\n39.8 \n38.6 \nOther International \n(3)\n0.7 \n— \nTotal\n1,301.2 \n1,075.7 \nTotal MMBoe \n(4)\n119.7 \n99.0 \n(1)\nThousand barrels per day or million cubic feet per day, as applicable.\n(2)\nDollars per barrel or per thousand cubic feet, as applicable.  Excludes the impact of financial commodity and other derivative instruments (see Note 10 to the Condensed Consolidated Financial Statements).\n(3)\nOther International represents EOG's Kingdom of Bahrain operations. Realized price represents contract price less Bapco's processing and distribution costs.\n(4)\nThousand barrels of oil equivalent per day or million barrels of oil e\nq\nuivalent, as applicable; includes crude oil and condensate, NGLs and natural gas. Crude oil equivalent volumes are determined using a ratio of 1.0 barrel of crude oil and condensate or NGLs to 6.0 thousand cubic feet of natural gas.  MMBoe is calculated by multiplying the MBoed amount by the number of days in the period and then dividing that amount by one thousand.\n-30-\n    \nCrude oil and condensate revenues for the third quarter of 2025 decreased $245 million, or 7%, to $3,243 million from $3,488 million for the same period of 2024.  The decrease was due to a lower composite average price ($520 million), partially offset by an increase of 41.5 MBbld, or 8%, in crude oil and condensate production ($275 million).  Increased production was primarily from the Utica and Permian Basin.  EOG's composite crude oil and condensate price for the third quarter of 2025 decreased 14% to $65.95 per barrel compared to $76.92 per barrel for the same period of 2024.\nNGL revenues for the third quarter of 2025 increased $80 million, or 15%, to $604 million from $524 million for the same period of 2024 due to an increase of 55.0 MBbld, or 22%, in NGL deliveries ($113 million), partially offset by a lower composite average price ($33 million).  Increased production was primarily from the Utica and Permian Basin.  EOG's composite NGL price for the third quarter of 2025 decreased 5% to $21.25 per barrel compared to $22.42 per barrel for the same period of 2024.\nNatural gas revenues for the third quarter of 2025 increased $335 million, or 90%, to $707 million from $372 million for the same period of 2024.  The increase was due to a higher composite average price ($189 million) and an increase in natural gas deliveries ($146 million).  Natural gas deliveries for the third quarter of 2025 increased 775 MMcfd, or 39%, compared to the same period of 2024 due primarily to increased production of associated natural gas from the Permian Basin and higher natural gas deliveries in the Utica and Dorado.  EOG's composite natural gas price for the third quarter of 2025 increased 37% to $2.80 per Mcf compared to $2.05 per Mcf for the same period of 2024.  \nDuring the third quarter of 2025, EOG recognized net gains on the mark-to-market of financial commodity and other derivative contracts of $116 million compared to net gains of $79 million for the same period of 2024.  The net gains of $116 million included gains of $8 million related to the Brent crude oil (Brent) linked gas sales contract.  During the third quarter of 2025, net cash received from settlements of financial commodity derivative contracts was $27 million compared to net cash received from settlements of financial commodity derivative contracts of $61 million for the same period of 2024. \nGathering, processing and marketing revenues are revenues generated from sales of third-party crude oil, NGLs and natural gas, as well as fees associated with gathering third-party natural gas and revenues from sales of EOG-owned sand.  Purchases and sales of third-party crude oil and natural gas may be utilized in order to balance firm capacity at third-party facilities with production in certain areas and to utilize excess capacity at EOG-owned facilities.  Marketing costs represent the costs to purchase third-party crude oil, natural gas and sand and the associated transportation costs, as well as costs associated with EOG-owned sand sold to third parties.\nGathering, processing and marketing revenues less marketing costs for the first nine months of 2025 increased $63 million as compared to the same period of 2024 primarily due to higher margins on crude oil and natural gas marketing activities.  \nOperating and Other Expenses.\n \n For the third quarter of 2025, operating expenses of $4,011 million were $135 million higher than the $3,876 million incurred during the third quarter of 2024.  The following table presents the costs per barrel of oil equivalent (Boe) for the three-month periods ended September 30, 2025 and 2024:\nThree Months Ended\nSeptember 30,\n \n2025\n2024\nLease and Well\n$\n3.60 \n$\n3.96 \nGathering, Processing and Transportation Costs (GP&T)\n4.90 \n4.50 \nDepreciation, Depletion and Amortization (DD&A) -\nOil and Gas Properties\n9.20 \n9.89 \nOther Property, Plant and Equipment\n0.57 \n0.53 \nGeneral and Administrative (G&A)\n2.00 \n1.69 \nInterest Expense, Net\n0.59 \n0.31 \nTotal \n(1)\n$\n20.86\n \n$\n20.88\n \n(1)\nTotal excludes exploration costs, dry hole costs, impairments, marketing costs and taxes other than income.\n-31-\n    \nThe primary factors impacting the cost components of per-unit rates of lease and well, GP&T, DD&A, G&A and interest expense, net for the three months ended September 30, 2025, compared to the same period of 2024, are set forth below.  See \"Operating Revenues and Other\" above for a discussion of volumes.\nLease and well expenses include expenses for EOG-operated properties, as well as expenses billed to EOG from other operators where EOG is not the operator of a property.  Lease and well expenses can be divided into the following categories: costs to operate and maintain crude oil and natural gas wells, the cost of workovers and lease and well administrative expenses.  Operating and maintenance costs include, among other things, pumping services, produced water disposal, equipment repair and maintenance, compression expense, lease upkeep and fuel and power.  Workovers are operations to restore or maintain production from existing wells.\nEach of these categories of costs individually fluctuates from time to time as EOG attempts to maintain and increase production while maintaining efficient, safe and environmentally responsible operations.  EOG continues to increase its operating activities by drilling new wells in existing and new areas.  Operating and maintenance costs within these existing and new areas, as well as the costs of services charged to EOG by vendors, fluctuate over time. \nLease and well expenses of $431 million for the third quarter of 2025 increased $39 million from $392 million for the same prior year period primarily due to increased operating and maintenance costs in the United States ($33 million) and increased lease and well administrative expenses ($14 million), partially offset by decreased workover expenditures in the United States ($10 million).  \nGP&T costs represent costs to process and deliver hydrocarbon products from the lease to a downstream point of sale.  GP&T costs include operating and maintenance expenses from EOG-owned assets, fees paid to third-party operators and administrative expenses associated with operating EOG's GP&T assets.  EOG pays third parties to process the majority of its natural gas production to extract NGLs.\nGP&T costs of $587 million for the third quarter of 2025 increased $142 million from $445 million for the same prior year period primarily due to increased GP&T costs related to increased production in the Utica and Permian Basin, partially offset by a decrease in GP&T costs in the Eagle Ford and the Powder River Basin.\nDD&A of the cost of proved oil and gas properties is calculated using the unit-of-production method.  EOG's DD&A rate and expense are the composite of numerous individual DD&A group calculations.  There are several factors that can impact EOG's composite DD&A rate and expense, such as field production profiles, drilling or acquisition of new wells, disposition of existing wells and reserve revisions (upward or downward) primarily related to well performance, economic factors and impairments.  Changes to these factors may cause EOG's composite DD&A rate and expense to fluctuate from period to period.  DD&A of the cost of other property, plant and equipment is generally calculated using the straight-line depreciation method over the useful lives of the assets.\nDD&A expenses for the third quarter of 2025 increased $138 million to $1,169 million from $1,031 million for the same prior year period.  DD&A expenses associated with oil and gas properties for the third quarter of 2025 were $122 million higher than the same prior year period.  The increase primarily reflects increased production in the United States ($201 million) partially offset by decreased unit rates in the United States ($80 million).  DD&A expenses associated with other property, plant and equipment for the third quarter of 2025 were $16 million higher than the same prior year period primarily due to an increase in expenses related to GP&T assets and equipment.\nG&A expenses of $239 million for the third quarter of 2025 increased $72 million from $167 million for the same prior year period primarily due to increased professional services and other costs, including Encino acquisition-related costs ($61 million), and employee-related costs ($7 million).\nInterest expense, net of $71 million for the third quarter of 2025 increased $40 million compared to the same prior year period primarily due to the issuance in July 2025 of the New Notes ($46 million) and the issuance in November 2024 of the $1,000 million aggregate principal amount of 5.650% Senior Notes due 2054 ($14 million), partially offset by increased capitalized interest ($15 million) and the maturity in April 2025 of the $500 million aggregate principal amount of 3.15% Senior Notes due 2025 ($4 million).\n-32-\n    \nExploration costs of $71 million for the third quarter of 2025 increased $28 million from $43 million for the same prior year period primarily due to geological and geophysical expenditures in Trinidad ($19 million) and the United States ($3 million), and increased administrative expenses ($3 million).\nImpairments include: amortization of individually insignificant unproved oil and gas property costs as well as impairments of proved oil and gas properties; other property, plant and equipment; individually significant unproved oil and gas property costs; and other assets.  Unproved properties with acquisition costs that are not individually significant are aggregated, and the portion of such costs estimated to be nonproductive is amortized over the remaining lease term.  Unproved properties with individually significant acquisition costs are reviewed individually for impairment.  \nThe following table sets forth impairments for the third quarter of 2025 and 2024 (in millions):\nThree Months Ended\nSeptember 30,\n \n2025\n2024\nProved properties\n$\n— \n$\n1 \nUnproved properties\n15 \n14 \nOther Assets\n56 \n— \nFirm commitment contracts\n— \n— \nTotal\n$\n71 \n$\n15 \nTaxes other than income include severance/production taxes, ad valorem/property taxes, payroll taxes, franchise taxes and other miscellaneous taxes.  Severance/production taxes are generally determined based on wellhead revenues, and ad valorem/property taxes are generally determined based on the valuation of the underlying assets.\nTaxes other than income for the third quarter of 2025 increased $26 million to $309 million (6.8% of revenues from sales of crude oil and condensate, NGLs and natural gas) from $283 million (6.5% of revenues from sales of crude oil and condensate, NGLs and natural gas) for the same prior year period.  The increase in taxes other than income was primarily due to decreased state severance tax refunds ($31 million) and increased ad valorem taxes ($5 million), partially offset by decreased severance/production taxes, all in the United States ($10 million).\nOther income, net of $59 million for the third quarter of 2025 decreased $17 million from $76 million for the same prior year period.  The decrease was primarily due to decreased interest income.\nIncome taxes of $353 million for the third quarter of 2025 decreased from income taxes of $461 million for the third quarter of 2024 primarily due to decreased pretax income and lower state deferred income taxes.  The net effective tax rate for the third quarter of 2025 decreased to 19% from 22% for the third quarter of 2024.  The lower effective tax rate is primarily due to a reduction of the state deferred income tax liability resulting from changes in state apportionment factors due to the Encino acquisition.\n-33-\n    \nNine Months Ended September 30, 2025 vs. Nine Months Ended September 30, 2024 \nOperating Revenues and Other.\n  During the first nine months of 2025, total operating revenues decreased $1,119 million, or 6%, to $16,994 million from $18,113 million for the same period of 2024.  Total revenues from sales of EOG's production of crude oil and condensate, NGLs and natural gas for the first nine months of 2025 decreased $105 million, or 1%, to $13,164 million from $13,269 million for the same period of 2024.  During the first nine months of 2025, EOG recognized net gains on the mark-to-market of financial commodity and other derivative contracts of $32 million compared to net gains of $269 million for the same period of 2024.  Gathering, processing and marketing revenues for the first nine months of 2025 decreased $694 million, or 16%, to $3,765 million from $4,459 million for the same period of 2024.  \nVolume and price statistics for the nine-month periods ended September 30, 2025 and 2024 were as follows (see Note 5 for segment financial information):\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nCrude Oil and Condensate Volumes (MBbld)\nUnited States\n512.4 \n489.6 \nTrinidad\n1.3 \n0.8 \nTotal\n513.7 \n490.4 \nAverage Crude Oil and Condensate Prices ($/Bbl) \n(1)\n \n \nUnited States\n$\n67.83 \n$\n79.36 \nTrinidad\n57.80 \n66.22 \nComposite\n67.81 \n79.34 \nNatural Gas Liquids Volumes (MBbld)\nUnited States\n270.0 \n243.7 \nTotal\n270.0 \n243.7 \nAverage Natural Gas Liquids Prices ($/Bbl) \n(1)\n \n \nUnited States\n$\n23.20 \n$\n23.25 \nNatural Gas Volumes (MMcfd)\nUnited States\n2,110 \n1,691 \nTrinidad\n243 \n209 \nOther International \n(2)\n1 \n— \nTotal\n2,354 \n1,900 \nAverage Natural Gas Prices ($/Mcf) \n(1)\n \n \nUnited States\n$\n2.94 \n$\n1.84 \nTrinidad\n3.74 \n3.57 \nOther International \n(2)\n3.27 \n— \nComposite\n3.03 \n2.03 \nCrude Oil Equivalent Volumes (MBoed)\nUnited States\n1,134.1 \n1,015.0 \nTrinidad\n41.7 \n35.8 \nOther International \n(2)\n0.2 \n— \nTotal\n1,176.0 \n1,050.8 \nTotal MMBoe\n321.0 \n287.9 \n(1)    Excludes the impact of financial commodity and other derivative instruments (see Note 10 to the Condensed Consolidated Financial Statements).\n(2)    Other International represents EOG's Kingdom of Bahrain operations. Realized price represents contract price less Bapco's processing and distribution costs.\n-34-\n    \nCrude oil and condensate revenues for the first nine months of 2025 decreased $1,150 million, or 11%, to $9,510 million from $10,660 million for the same period of 2024 due to a lower composite average price ($1,607 million), partially offset by an increase of 23.3 MBbld, or 5%, in crude oil and condensate production ($457 million).  Increased production was primarily in the Utica and Permian Basin.  EOG's composite crude oil and condensate price for the first nine months of 2025 decreased 15% to $67.81 per barrel compared to $79.34 per barrel for the same period of 2024.\nNGL revenues for the first nine months of 2025 increased $158 million, or 10%, to $1,710 million from $1,552 million for the same period of 2024 due to an increase of 26.3 MBbld, or 11%, in NGL deliveries ($162 million), partially offset by a lower composite average price ($4 million).  Increased production was primarily from the Utica and Permian Basin.  EOG's composite NGL price for the first nine months of 2025 decreased less than 1% to $23.20 per barrel compared to $23.25 per barrel for the same period of 2024.\nNatural gas revenues for the first nine months of 2025 increased $887 million, or 84%, to $1,944 million from $1,057 million for the same period of 2024.  The increase was due to a higher composite average price ($640 million) and an increase in natural gas deliveries ($247 million).  Natural gas deliveries for the first nine months of 2025 increased 454 MMcfd, or 24%, compared to the same period of 2024 due primarily to increased production of associated natural gas from the Permian Basin and higher natural gas deliveries in the Utica,  Dorado and Trinidad.  EOG's composite natural gas price for the first nine months of 2025 increased 49% to $3.03 per Mcf compared to $2.03 per Mcf for the same period of 2024.  \nDuring the first nine months of 2025, EOG recognized net gains on the mark-to-market of financial commodity and other derivative contracts of $32 million compared to net gains of $269 million for the same period of 2024.  The net gains of $32 million included losses of $45 million related to the Brent linked gas sales contract.  During the first nine months of 2025, net cash payments for settlements of financial commodity derivative contracts was $35 million.  Net cash received from settlements of financial commodity derivative contracts was $195 million for the same period of 2024. \nGathering, processing and marketing revenues less marketing costs for the first nine months of 2025 increased $25 million as compared to the same period of 2024 primarily due to higher margins on natural gas marketing activities and sand sales, partially offset by lower margins on crude oil marketing activities.  \nOperating and Other Expenses. \n For the first nine months of 2025, operating expenses of $11,552 million were $71 million lower than the $11,623 million incurred during the same period of 2024.  The following table presents the costs per Boe for the nine-month periods ended September 30, 2025 and 2024:\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nLease and Well\n$\n3.82 \n$\n4.09 \nGP&T\n4.62 \n4.45 \nDD&A -\nOil and Gas Properties\n9.48 \n10.20 \nOther Property, Plant and Equipment\n0.60 \n0.53 \nG&A\n1.86 \n1.67 \nInterest Expense, Net\n0.53 \n0.35 \nTotal \n(1)\n$\n20.91\n \n$\n21.29\n \n(1)\nTotal excludes exploration costs, dry hole costs, impairments, marketing costs and taxes other than income.\nThe primary factors impacting the cost components of per-unit rates of lease and well, GP&T, DD&A, G&A, and interest expense, net for the nine months ended September 30, 2025, compared to the same period of 2024 are set forth below.  See \"Operating Revenues\" above for a discussion of  volumes.\n-35-\n    \nLease and well expenses of $1,228 million for the first nine months of 2025 increased $50 million from $1,178 million for the same prior year period primarily due to increased operating and maintenance costs in the United States ($55 million) and Trinidad ($7 million) and increased lease and well administrative expenses ($23 million), partially offset by decreased workover expenditures in the United States ($35 million).  \nGP&T costs of $1,482 million for the first nine months of 2025 increased $201 million from $1,281 million for the same prior year period primarily due to increased GP&T costs related to increased production in the Utica and Permian Basin, partially offset by a decrease in GP&T costs in the Eagle Ford and the Powder River Basin.\nDD&A expenses for the first nine months of 2025 increased $146 million to $3,235 million from $3,089 million for the same prior year period. DD&A expenses associated with oil and gas properties for the first nine months of 2025 were $105 million higher than the same prior year period.  The increase primarily reflects increased production in the United States ($318 million) and in Trinidad ($15 million), as well as increased unit rates in Trinidad ($5 million). This was partially offset by an adjustment to DD&A recorded in 2024 ($117 million) related to natural gas production used by EOG's domestic gathering systems, as well as decreased unit rates in the United States ($116 million).  DD&A expenses associated with other property, plant and equipment for the first nine months of 2025 were $41 million higher than the same prior year period primarily due to an increase in expenses related to GP&T assets and equipment.  \nG&A expenses of $596 million for the first nine months of 2025 increased $116 million from $480 million for the same prior year period primarily due to increased professional services and other costs, including Encino acquisition-related costs ($84 million), employee-related costs ($23 million) and information systems costs ($6 million).\nInterest expense, net of $169 million for the first nine months of 2025 increased $69 million compared to the same prior year period primarily due to the issuance in July 2025 of the New Notes ($46 million), the issuance in November 2024 of the $1,000 million aggregate principal amount of 5.650% Senior Notes due 2054 ($42 million), and financing commitment costs related to the acquisition of Encino ($6.5 million), partially offset by increased capitalized interest ($17 million) and the maturity in April 2025 of the $500 million aggregate principal amount of 3.15% Senior Notes due 2025 ($8 million). \nExploration costs of $186 million for the first nine months of 2025 increased $64 million from $122 million for the same prior year period due primarily to geological and geophysical expenditures in Trinidad ($25 million), the United Arab Emirates ($22 million) and the United States ($10 million), and increased administrative expenses ($6 million).\nThe following table sets forth impairments for the nine-month periods ended September 30, 2025 and 2024 (in millions):\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nProved properties\n$\n44 \n$\n36 \nUnproved properties\n39 \n48 \nOther assets\n70 \n30 \nFirm commitment contracts\n1 \n1 \nTotal\n$\n154 \n$\n115 \nTaxes other than income for the first nine months of 2025 decreased $7 million to $951 million (7.2% of revenues from sales of crude oil and condensate, NGLs and natural gas) from $958 million (7.2% of revenues from sales of crude oil and condensate, NGLs and natural gas) for the same prior year period.  The decrease in taxes other than income was primarily due to decreased severance/production taxes ($40 million), partially offset by decreased state severance tax refunds ($31 million), all in the United States.\nOther income, net of $179 million for the first nine months of 2025 decreased $25 million from $204 million for the same prior year period.  The decrease was primarily due to decreased interest income. \nIncome taxes of $1,173 million for the first nine months of 2025 decreased from income taxes of $1,442 million for the first nine months of 2024 primarily due to decreased pretax income.  The net effective tax rate for the first nine months of 2025 was unchanged from the prior year period tax rate of 22%. \n-36-\n    \nCapital Resources and Liquidity\nLiquidity Overview.  \nAt September 30, 2025, EOG maintained a strong financial and liquidity position, including $3.5 billion of cash and cash equivalents on hand and $1.9 billion of availability under its senior unsecured revolving credit facility (which remained undrawn). \nThe primary source of cash for EOG during the nine months ended September 30, 2025, was funds generated from operations and the issuance of the New Notes.  The primary uses of cash were for the acquisition of Encino; exploration and development expenditures; funds used in operations; dividend payments to stockholders; purchases of treasury stock; repayments of long-term debt and other property, plant and equipment expenditures.  During the first nine months of 2025, EOG's cash balance decreased $3,562 million to $3,530 million from $7,092 million at December 31, 2024.  \nSee Notes 8 and 9 to the Condensed Consolidated Financial Statements for further discussion of our debt obligations, including the fair value of our senior notes.\nCash Flow.\n \n Net cash provided by operating activities of $7,432 million for the first nine months of 2025 decreased $1,948 million compared to the same period of 2024 primarily due to an increase in net cash paid for income taxes and tax credit purchases ($1,039 million), an increase in cash operating expenses ($416 million), an increase in net cash used in working capital and other assets and liabilities ($290 million), net cash paid for settlements of financial commodity derivative contracts of $35 million compared to net cash received of $195 million for the first nine months of 2024 and a decrease in revenues from sales of crude oil and condensate, NGLs and natural gas ($105 million).\nNet cash used in investing activities of $9,174 million for the first nine months of 2025 increased $4,483 million compared to the same period of 2024 primarily due to the acquisition of Encino ($4,464 million), an increase in additions to oil and gas properties ($467 million) and a decrease in cash provided by working capital associated with investing activities ($89 million), partially offset by a decrease in additions to other property, plant and equipment ($535 million).\nNet cash used in financing activities of $1,820 million for the first nine months of 2025 included purchases of treasury stock ($1,887 million), repayments of long-term debt ($1,766 million) and dividend payments to stockholders ($1,611 million).  Cash provided by financing activities for the first nine months of 2025 included long-term debt borrowings ($3,472 million).  Net cash used in financing activities of $3,845 million for the first nine months of 2024 included purchases of treasury stock ($2,253 million) and dividend payments to stockholders ($1,578 million).\n-37-\n    \nTotal Expenditures. \n For the full-year 2025, EOG's updated budget for exploration and development and other property, plant and equipment expenditures is estimated to range from approximately $6.2 billion to $6.4 billion, including exploration and development drilling, facilities, leasehold acquisitions, capitalized interest, dry hole costs and other property, plant and equipment and excluding the acquisition of the equity interests in Encino, property acquisitions, asset retirement costs, non-cash exchanges and transactions and exploration costs incurred as operating expenses.  The table below sets out components of total expenditures for the nine-month periods ended September 30, 2025 and 2024 (in millions):\nNine Months Ended\nSeptember 30,\n2025\n2024\nExpenditure Category\nCapital\nExploration and Development Drilling\n$\n3,624 \n$\n3,512 \nFacilities\n465 \n430 \nLeasehold Acquisitions \n(1)\n118 \n205 \nProperty Acquisitions \n(2)\n7,005 \n26 \nCapitalized Interest\n50 \n32 \nSubtotal\n11,262 \n4,205 \nExploration Costs\n186 \n122 \nDry Hole Costs\n45 \n6 \nExploration and Development Expenditures\n11,493 \n4,333 \nAsset Retirement Costs \n(3)\n113 \n(28)\nTotal Exploration and Development Expenditures\n11,606 \n4,305 \nOther Property, Plant and Equipment \n(4)\n367 \n902 \nTotal Expenditures\n$\n11,973 \n$\n5,207 \n(1)    Leasehold acquisitions included $14 million and $82 million for the nine-month periods ended September 30, 2025 and 2024, respectively, related to non-cash property exchanges.\n(2)    Property acquisitions for the nine-month period ended September 30, 2025, included $6,721 million related to the Encino acquisition.  Property acquisitions for the nine-month period ended September 30, 2024, included $24 million related to non-cash property exchanges.\n(3)    Asset Retirement Costs for the nine-month period ended September 30, 2025, included $52 million related to the Encino acquisition.  Asset Retirement Costs for the nine-month period ended September 30, 2024, included a downward revision to asset retirement obligations of $84 million.\n(4)    Other Property, Plant and Equipment included $137 million related to the acquisition of a gathering system in South Texas for the nine-month period ended September 30, 2024.\nExploration and development expenditures of $11,493 million for the first nine months of 2025 were $7,160 million higher than the same period of 2024 primarily due to increased property acquisitions (including Encino) ($6,979 million), increased development drilling expenditures in the United States ($174 million), increased facilities expenditures ($35 million) and increased exploration costs in the United Arab Emirates ($27 million), partially offset by decreased exploration and development drilling expenditures in Trinidad ($57 million). Exploration and development expenditures for the first nine months of 2025 of $11,493 million consisted of $7,005 million in property acquisitions, $4,035 million in development drilling and facilities, $403 million in exploration and $50 million in capitalized interest.  Exploration and development expenditures for the first nine months of 2024 of $4,333 million consisted of $3,797 million in development drilling and facilities, $478 million in exploration,  $32 million in capitalized interest and $26 million in property acquisitions. \nThe level of exploration and development expenditures, including acquisitions, will vary in future periods depending on energy market conditions and other economic factors.  EOG believes it has significant flexibility and availability with respect to financing alternatives and the ability to adjust its exploration and development expenditure budget as circumstances warrant.  While EOG has certain continuing commitments associated with expenditure plans related to its operations, such commitments are not expected to be material when considered in relation to the total financial capacity of EOG.  Further, EOG believes that its sources of liquidity are adequate for other near-term and long-term funding requirements, including its cash return commitment, debt service obligations, repayments of debt maturities and other commitment and contingencies.  \n-38-\n    \nFinancial Commodity and Other Derivative Transactions. \n As more fully discussed in Note 12 to the Consolidated Financial Statements included in EOG's 2024 Annual Report, EOG engages in price risk management activities from time to time.  These activities are intended to manage EOG's exposure to fluctuations in commodity prices for crude oil, NGLs and natural gas.  EOG utilizes financial commodity derivative instruments, primarily price swap, option, swaption, collar and basis swap contracts, as a means to manage this price risk.  EOG has not designated any of its financial commodity and other derivative contracts as accounting hedges and, accordingly, accounts for financial commodity and other derivative contracts using the mark-to-market accounting method, including the Brent linked gas sales contract.  Under this accounting method, changes in the fair value of outstanding financial and other derivative instruments are recognized as gains or losses in the period of change and are recorded as Gains on Mark-to-Market Financial Commodity and Other Derivative Contracts on the Condensed Consolidated Statements of Income and Comprehensive Income.  The related cash flow impact is reflected in Cash Flows from Operating Activities on the Condensed Consolidated Statements of Cash Flows. \nThe total fair value of EOG's financial commodity and other derivative contracts was reflected on the Condensed Consolidated Balance Sheets at September 30, 2025, as a net asset of $46 million. \nAs discussed in \"Operating Revenues and Other,\" the net cash received from settlements of financial commodity derivative contracts during the third quarter of 2025 was $27 million and net cash paid for settlements of financial commodity derivative contracts during the first nine\n \nmonths of 2025 was $35 million.\nPresented below is a comprehensive summary of EOG's financial commodity derivative contracts settled during the period from January 1, 2025 to October 31, 2025 (closed) and outstanding as of October 31, 2025.  Natural gas volumes are presented in MMBtu per day (MMBtud) and prices are presented in dollars per MMBtu ($/MMBtu).  NGL volumes are presented in MBbld and prices are presented in $/Bbl.\nNatural Gas Financial Price Swap Contracts\nContracts Sold\nPeriod\nSettlement Index\nVolume\n(MMBtud in thousands)\nWeighted Average Price\n($/MMBtu)\nFebruary - July 2025 (closed)\nNYMEX Henry Hub\n725 \n$\n3.07 \nAugust - November 2025 (closed)\nNYMEX Henry Hub\n1,225 \n3.32 \nDecember 2025\nNYMEX Henry Hub\n1,225 \n3.32 \nJanuary - June 2026\nNYMEX Henry Hub\n460 \n3.78 \nJuly - December 2026\nNYMEX Henry Hub\n450 \n3.79 \n-39-\n    \nNatural Gas Basis Swap Contracts\nContracts Sold\nPeriod\nSettlement Index\nVolume\n(MMBtud in thousands)\nWeighted Average Price\nDifferential\n($/MMBtu)\nJanuary - October 2025 (closed)\nNYMEX Henry Hub Houston Ship Channel (HSC) Differential \n(1)\n10 \n$\n0.00 \nNovember - December 2025\nNYMEX Henry Hub HSC Differential\n10 \n0.00 \n(1)    This settlement index is used to fix the differential between pricing at the Houston Ship Channel and NYMEX Henry Hub prices.\nNatural Gas Collar Contracts\nContracts Sold\nWeighted Average Price\n($/MMBtu)\nPeriod\nSettlement Index\nVolume\n(MMBtud in thousands)\nCeiling Price\nFloor Price\nSeptember 2025 (closed)\nNYMEX Henry Hub\n50 \n$\n4.65 \n$\n3.81 \nOctober - November 2025 (closed)\nNYMEX Henry Hub\n60 \n4.63 \n3.76 \nDecember 2025\nNYMEX Henry Hub\n60 \n4.63 \n3.76 \nJanuary - June 2026\nNYMEX Henry Hub\n80 \n4.28 \n3.72 \nJuly - December 2026\nNYMEX Henry Hub\n70 \n4.23 \n3.71 \nJanuary - December 2027\nNYMEX Henry Hub\n120 \n4.41 \n3.42 \nEthane Financial Price Swap Contracts\nContracts Sold\nPeriod\nSettlement Index\nVolume\n(MBbld)\nWeighted Average Price\n($/Bbl)\nAugust - October 2025 (closed)\nMont Belvieu Ethane (non-Tet)\n11 \n$\n10.46 \nNovember - December 2025\nMont Belvieu Ethane (non-Tet)\n11 \n10.46 \nJanuary - December 2026\nMont Belvieu Ethane (non-Tet)\n11 \n10.94 \nButane Financial Price Swap Contracts\nContracts Sold\nPeriod\nSettlement Index\nVolume\n(MBbld)\nWeighted Average Price\n($/Bbl)\nAugust - October 2025 (closed)\nMont Belvieu Butane (non-Tet)\n7 \n$\n36.28 \nNovember - December 2025\nMont Belvieu Butane (non-Tet)\n7 \n36.28 \n-40-\n    \nPropane Financial Price Swap Contracts\nContracts Sold\nPeriod\nSettlement Index\nVolume\n(MBbld)\nWeighted Average Price\n($/Bbl)\nAugust - October 2025 (closed)\nMont Belvieu Propane (Tet)\n13 \n$\n30.82 \nNovember - December 2025\nMont Belvieu Propane (Tet)\n13 \n30.82 \nJanuary - December 2026\nMont Belvieu Propane (Tet)\n1 \n30.24 \nIn connection with its financial commodity derivative contracts, EOG had no collateral posted and no collateral held at October 31, 2025.  The amount of posted collateral will increase or decrease based on fluctuations in forward NYMEX Henry Hub prices.\nNatural Gas Sales Linked to Brent Crude Oil. \n \nAs more fully discussed in Note 12 to the Consolidated Financial Statements included in EOG's 2024 Annual Report, in February 2024, EOG entered into a 10-year agreement, commencing in 2027, to sell 180,000 MMBtud of its domestic natural gas production, with 140,000 MMBtud to be sold at a price indexed to Brent and the remaining volumes to be sold at a price indexed to Brent or a U.S. Gulf Coast gas index at the counterparty's election.  \n-41-\n    \nCritical Accounting Policies and Estimates\nThe critical accounting policies and estimates applied in the preparation of EOG's interim condensed consolidated financial statements for the nine months ended September 30, 2025 are the same as those described in EOG's 2024 Annual Report except as follows. \nBusiness Combinations\nEOG accounts for business combinations under the Business Combinations topic of the Accounting Standards Codification (ASC 805), which requires identifiable assets acquired and liabilities assumed to be recognized at their acquisition date fair values.  In estimating the fair values of assets acquired and liabilities assumed, various assumptions are applied.\nThe most significant assumptions relate to the estimated fair values of proved and unproved oil and natural gas properties for which EOG utilized the Income Approach described in the Fair Value Measurement Topic of the Accounting Standards Codification (ASC 820).  The assumptions made in performing the valuation under the Income Approach include future crude oil, NGLs and natural gas prices, future operating and development costs, anticipated production from reserves, a weighted average cost of capital rate and risk adjustment factors for proved undeveloped, probable and possible reserves. \nThe assumptions and inputs used in determining fair value estimates involve significant management judgment and are based on industry, market and economic conditions at the time of the acquisition.  While these estimates are based on assumptions considered reasonable, they are inherently uncertain and actual results may differ.  For related discussion on proved oil and gas reserves, depreciation, depletion, and amortization for oil and gas properties and impairments, see ITEM 7, Management's Discussion and Analysis of Financial Condition and Results of Operations – Summary of Critical Accounting Policies and Estimates included in EOG's 2024 Annual Report.\nSee Note 11 to the Condensed Consolidated Financial Statements for further discussion on the Encino acquisition\n. \n-42-\n    \nInformation Regarding Forward-Looking Statements\nThis Quarterly Report on Form 10-Q includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended.  All statements, other than statements of historical facts, including, among others, statements and projections regarding EOG's future financial position, operations, performance, business strategy, goals, returns and rates of return, budgets, reserves, levels of production, capital expenditures, operating costs and asset sales, statements regarding future commodity prices, statements regarding the plans and objectives of EOG's management for future operations and statements and projections regarding the strategic rationale for, and anticipated benefits of, EOG's acquisition of Encino Acquisition Partners, LLC (Encino) are forward‐looking statements.  EOG typically uses words such as \"expect,\" \"anticipate,\" \"estimate,\" \"project,\" \"strategy,\" \"intend,\" \"plan,\" \"target,\" \"aims,\" \"ambition,\" \"initiative,\" \"goal,\" \"may,\" \"will,\" \"focused on,\" \"should\" and \"believe\" or the negative of those terms or other variations or comparable terminology to identify its forward‐looking statements.  In particular, statements, express or implied, concerning (i) EOG's future financial or operating results and returns, (ii) EOG's ability to replace or increase reserves, increase production, generate returns and rates of return, replace or increase drilling locations, reduce or otherwise control drilling, completion and operating costs and capital expenditures, generate cash flows, pay down or refinance indebtedness, achieve, reach or otherwise meet initiatives, plans, goals, ambitions or targets with respect to emissions, other environmental matters or safety matters, pay and/or increase regular and/or special dividends or repurchase shares or (iii) the successful integration of Encino's assets and operations or the strategic rationale for, or anticipated benefits of, EOG's acquisition of Encino, in each case are forward‐looking statements.  Forward-looking statements are not guarantees of performance.  Although EOG believes the expectations reflected in its forward-looking statements are reasonable and are based on reasonable assumptions, no assurance can be given that such assumptions are accurate or will prove to have been correct or that any of such expectations will be achieved (in full or at all) or will be achieved on the expected or anticipated timelines.  Moreover, EOG's forward-looking statements may be affected by known, unknown or currently unforeseen risks, events or circumstances that may be outside EOG's control.  Important factors that could cause EOG's actual results to differ materially from the expectations reflected in EOG's forward-looking statements include, among others:\n•\nthe timing, magnitude and duration of changes in prices for, supplies of, and demand for, crude oil and condensate, natural gas liquids (NGLs), natural gas and related commodities; \n•\nthe extent to which EOG is successful in its efforts to acquire or discover additional reserves; \n•\nthe extent to which EOG is successful in its efforts to (i) economically develop its acreage in, (ii) produce reserves and achieve anticipated production levels and rates of return from, (iii) decrease or otherwise control its drilling, completion and operating costs and capital expenditures related to, and (iv) maximize reserve recoveries from, its existing and future crude oil and natural gas exploration and development projects and associated potential and existing drilling locations;\n•\nthe success of EOG's cost-mitigation initiatives and actions in offsetting the impact of any inflationary or other pressures on EOG's operating costs and capital expenditures;\n•\nthe extent to which EOG is successful in its efforts to market its production of crude oil and condensate, NGLs and natural gas;\n•\nsecurity threats, including cybersecurity threats and disruptions to our business and operations from breaches of our information technology systems, physical breaches of our facilities and other infrastructure or breaches of the information technology systems, facilities and infrastructure of third parties with which we transact business, and enhanced regulatory focus on the prevention of, and disclosure requirements relating to, cyber incidents; \n•\nthe availability, proximity and capacity of, and costs associated with, appropriate gathering, processing, compression, storage, transportation, refining, liquefaction and export facilities and equipment; \n•\nthe availability, cost, terms and timing of issuance or execution of mineral licenses, concessions and leases and governmental and other permits and rights-of-way, and EOG's ability to retain mineral licenses, concessions and leases;\n-43-\n    \n•\nthe impact of, and changes in, government policies, laws and regulations, including climate change-related regulations, policies and initiatives (for example, with respect to air emissions); tax laws and regulations (including, but not limited to, carbon tax or other emissions-related legislation); environmental, health and safety laws and regulations relating to disposal of produced water, drilling fluids and other wastes, hydraulic fracturing and access to and use of water; laws and regulations affecting the leasing of acreage and permitting for oil and gas drilling and the calculation of royalty payments in respect of oil and gas production; laws and regulations imposing additional permitting and disclosure requirements, additional operating restrictions and conditions or restrictions on drilling and completion operations and on the transportation of crude oil, NGLs and natural gas; laws and regulations with respect to financial and other derivatives and hedging activities; and laws and regulations with respect to the import and export of crude oil, natural gas and related commodities; \n•\nthe impact of climate change-related legislation, policies and initiatives; climate change-related political, social and shareholder activism; and physical, transition and reputational risks and other potential developments related to climate change;\n•\nthe extent to which EOG is able to successfully and economically develop, implement and carry out its emissions and other environmental or safety-related initiatives and achieve its related targets, goals, ambitions and initiatives;\n•\nEOG's failure to realize, in full or at all, the anticipated benefits of its acquisition of Encino and/or business disruptions resulting from the acquisition (e.g., relating to the integration of Encino's assets and operations into EOG's operations) that could harm EOG's business operations (including current plans and operations and the diversion of management's attention from EOG's ongoing business operations);\n•\nEOG's ability to effectively integrate acquired crude oil and natural gas properties into its operations, identify and resolve existing and potential issues with respect to such properties and accurately estimate reserves, production, drilling, completion and operating costs and capital expenditures with respect to such properties;\n•\nthe extent to which EOG's third-party-operated crude oil and natural gas properties are operated successfully, economically and in compliance with applicable laws and regulations;\n•\ncompetition in the oil and gas exploration and production industry for the acquisition of licenses, concessions, leases and properties; \n•\nthe availability and cost of, and competition in the oil and gas exploration and production industry for, employees, labor and other personnel, facilities, equipment, materials (such as water, sand, fuel and tubulars) and services;\n•\nthe accuracy of reserve estimates, which by their nature involve the exercise of professional judgment and may therefore be imprecise;\n•\nweather and natural disasters, including its impact on crude oil and natural gas demand, and related delays in drilling and in the installation and operation (by EOG or third parties) of production, gathering, processing, refining, liquefaction, compression, storage, transportation, and export facilities;\n•\nthe ability of EOG's customers and other contractual counterparties to satisfy their obligations to EOG and, related thereto, to access the credit and capital markets to obtain financing needed to satisfy their obligations to EOG;\n•\nEOG's ability to access the commercial paper market and other credit and capital markets to obtain financing on terms it deems acceptable, if at all, and to otherwise satisfy its capital expenditure requirements;\n•\nthe extent to which EOG is successful in its completion of planned asset dispositions;\n•\nthe extent and effect of any hedging activities engaged in by EOG;\n•\nthe timing and extent of changes in foreign currency exchange rates, interest rates, inflation rates, global and domestic financial market conditions and global and domestic general economic conditions;\n•\nthe economic and financial impact of epidemics, pandemics or other public health issues;\n•\ngeopolitical factors and political conditions and developments around the world (such as the imposition of tariffs or trade or other economic sanctions, political instability and armed conflicts), including in the areas in which EOG operates;\n•\nthe extent to which EOG incurs uninsured losses and liabilities or losses and liabilities in excess of its insurance coverage; and\n•\nthe other factors described under ITEM 1A, Risk Factors of EOG's Annual Report on Form 10-K for the year ended December 31, 2024, and any updates to those factors set forth in EOG's subsequent Quarterly Reports on Form 10-Q or Current Reports on Form 8-K. \n-44-\n    \nIn light of these risks, uncertainties and assumptions, the events anticipated by EOG's forward-looking statements may not occur, and, if any of such events do, we may not have anticipated the timing of their occurrence or the duration or extent of their impact on our actual results.  Accordingly, you should not place any undue reliance on any of EOG's forward-looking statements.  EOG's forward-looking statements speak only as of the date made, and EOG undertakes no obligation, other than as required by applicable law, to update or revise its forward-looking statements, whether as a result of new information, subsequent events, anticipated or unanticipated circumstances or otherwise.\n-45-\n    \nPART I.  FINANCIAL INFORMATION"
}