{
  "source_file": "eog-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.  \nBusiness\nGeneral \nEOG Resources, Inc., a Delaware corporation organized in 1985, together with its subsidiaries (collectively, EOG), explores for, develops, produces and markets crude oil, natural gas liquids (NGLs) and natural gas primarily in major producing basins in the United States of America (United States or U.S.), the Republic of Trinidad and Tobago (Trinidad) and, from time to time, select other international areas.  EOG's principal producing areas are further described in \"Exploration and Production\" below.  EOG's Annual Reports on Form 10-K, Quarterly Reports on Form 10‑Q, Current Reports on Form 8-K and any amendments to those reports (including related exhibits and supplemental schedules) filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 (as amended) are made available, free of charge, through EOG's website, as soon as reasonably practicable after such reports have been filed with, or furnished to, the United States Securities and Exchange Commission (SEC).  EOG's website address is www.eogresources.com.  Information on our website is not incorporated by reference into, and does not constitute a part of, this report.\nAt December 31, 2024, EOG's total estimated net proved reserves were 4,748 million barrels of oil equivalent (MMBoe), of which 1,870 million barrels (MMBbl) were crude oil and condensate reserves, 1,358 MMBbl were NGLs reserves and 9,122 billion cubic feet (Bcf), or 1,520 MMBoe, were natural gas reserves (see \"Supplemental Information to Consolidated Financial Statements\").  At such date, approximately 99% of EOG's net proved reserves, on a crude oil equivalent basis, were located in the United States and 1% in Trinidad.  Crude oil equivalent volumes are determined using a ratio of 1.0 barrel of crude oil and condensate or NGLs to 6.0 thousand cubic feet (Mcf) of natural gas.\nEOG's operations are all crude oil and natural gas exploration and production related.  For information regarding the risks associated with EOG's domestic and foreign operations, see ITEM 1A, Risk Factors.\nEOG is focused on being among the highest return and lowest cost producers, committed to strong environmental performance and playing a significant role in the long-term future of energy.  EOG operates under a consistent business and operational strategy that focuses on a comprehensive approach to developing acreage through industry cycles.  EOG evaluates rate of return, net present value, margins, payback period and other key metrics.  This strategy is intended to enhance the generation of cash flow and earnings from each unit of production on a cost-efficient basis, allowing EOG to maximize long-term growth in shareholder value and maintain a strong balance sheet.  EOG is also focused on innovation and cost-effective utilization of advanced technology associated with three-dimensional seismic and microseismic data, the development of reservoir simulation models and the use of improved drilling equipment and completion technologies for horizontal drilling and formation evaluation.  These advanced technologies are used, as appropriate, throughout EOG to reduce the risks and costs associated with all aspects of oil and gas exploration, development and exploitation.  EOG implements its strategy primarily by emphasizing the drilling of internally generated prospects in order to find and develop low-cost reserves.  Maintaining the lowest possible operating cost structure, coupled with efficient and safe operations and robust environmental stewardship practices and performance, is integral in the implementation of EOG's strategy.\nWith respect to information on EOG's working interest in wells or acreage, \"net\" oil and gas wells or acreage are determined by multiplying \"gross\" oil and gas wells or acreage by EOG's working interest in the wells or acreage.\nExploration and Production \nUnited States Operations\nEOG's operations are located in most of the productive basins in the United States with a focus on crude oil and natural gas plays.\nAt December 31, 2024, on a crude oil equivalent basis, 40% of EOG's net proved reserves in the United States were crude oil and condensate, 29% were NGLs and 31% were natural gas.  The majority of these reserves are in long-lived fields with well-established production characteristics.  EOG believes opportunities exist to increase production through continued development in and around many of these fields and through the utilization of applicable technologies.  EOG also maintains an active exploration program designed to extend fields and add new trends and resource plays to its already broad portfolio.\n1\nThe following is a summary of volume statistics and net well completions for the year ended December 31, 2024, total net acres at December 31, 2024, and expected net well completions planned for 2025 for certain areas of EOG's United States operations.  \n2024\n2025\nArea of Operation\nCrude Oil & Condensate Volumes\n(MBbld) \n(1)\nNatural Gas Liquids Volumes\n(MBbld) \n(1)\nNatural Gas Volumes\n(MMcfd) \n(1)\nTotal Net Acres (in thousands)\nNet Well Completions\nExpected Net Well Completions\nDelaware Basin\n309.7 \n184.9 \n1,039 \n395 \n385 \n375 \nSouth Texas\n124.4 \n30.8 \n448 \n1,272 \n181 \n145 \nRocky Mountain\n41.7 \n14.9 \n149 \n776 \n42 \n45 \nOther Areas\n14.8 \n15.3 \n92 \n915 \n33 \n40 \nTotal\n490.6 \n245.9 \n1,728 \n3,358 \n641 \n605 \n(1)\nThousand barrels per day or million cubic feet per day, as applicable.\nIn the Delaware Basin, EOG completed 385 net wells in 2024, primarily in the Wolfcamp, Bone Spring and Leonard plays.  The Delaware Basin consists of approximately 4,800 feet of liquids-rich stacked pay potential offering EOG multiple co-development opportunities throughout its 395,000 net acre position.  Activity in 2025 will remain focused on the Wolfcamp, Bone Spring and Leonard plays, where EOG expects to complete approximately 375 net wells.\nThe South Texas area includes the Eagle Ford play and the Dorado gas play.  EOG holds approximately 535,000 total net acres in the Eagle Ford play and approximately 160,000 net acres in the Dorado gas play.  In 2024, EOG completed 160 net wells in the Eagle Ford play, and 21 net wells in the Dorado gas play.  In addition, key gathering, processing and transportation infrastructure was added in order to lower operating costs and increase price realizations.  In 2025, EOG expects to complete approximately 120 net Eagle Ford play wells and 25 net Dorado gas play wells, while utilizing new infrastructure that connects the Dorado gas play to the Agua Dulce gas market near Corpus Christi, Texas.\nActivity in the Rocky Mountain area in 2024 was focused on the Wyoming Powder River Basin.  In the Powder River Basin, EOG completed 27 net wells in the Niobrara, Mowry, Turner and Parkman formations.  In 2025, activity in the Rocky Mountain area is expected to remain flat with plans to complete 30 net wells in the Powder River Basin. \nActivity in the Other Areas includes EOG's newest play, the Utica play.  EOG holds approximately 460,000 total net acres, including 135,000 net mineral acres in the Utica.  In 2024, EOG completed 25 net Utica wells, collecting data and delineating its acreage.  In 2025, EOG expects to complete approximately 30 net Utica wells.\n2\nOperations Outside the United States \nEOG has operations offshore Trinidad and is evaluating additional exploration, development and exploitation opportunities in other select international areas.  In addition, EOG is executing an abandonment and reclamation program in Canada.\nTrinidad. \nEOG, through its subsidiaries, including EOG Resources Trinidad Limited, holds interests in (i) the exploration and production licenses covering the South East Coast Consortium (SECC) and Pelican Blocks, Banyan and Sercan Areas and each of their related platforms and facilities and the Ska, Mento and Reggae (SMR) and deep Teak, Saaman and Poui (TSP Deep) Areas, all of which are offshore Trinidad; and (ii) two production sharing contracts with the Government of Trinidad and Tobago for the Modified U(a) and 4(a) Blocks.\nSeveral fields in the SECC Block, Modified U(a) Block, 4(a) Block and Banyan and Sercan Areas have been developed and are producing natural gas and crude oil and condensate.\nIn 2024, EOG's net production in Trinidad averaged approximately 220 MMcfd of natural gas and approximately 0.8 MBbld of crude oil and condensate.  In 2024, EOG completed one net developmental well and one net exploratory well from the Osprey B platform in the Modified U(a) Block.  EOG also completed two net exploratory wells from the Oilbird platform in the SECC Block,\n \ndrilled a TSP Deep exploratory well which allowed EOG to retain a 50% working interest in the TSP Deep Area and recompleted one net well in the Sercan Area.  In June 2024, EOG relinquished its rights to a portion of the contract area governed by the Trinidad Northern Area License located offshore the southwest coast of Trinidad.  In July 2024, EOG signed a farmout agreement with BP Trinidad and Tobago LLC, which allows EOG to earn a 50% working interest to develop the Coconut field in the Coconut Area located within the East Mayaro and South East Galeota exploration and production licenses.  In December 2024, EOG was selected as the preferred bidder in the Lower Reverse L (LRL) and North Coast Marine Area (NCMA) 4(a) Blocks in respect of the 2023 shallow water offshore bid round.  Additionally in 2024, EOG completed construction and installation of the Mento platform in the SMR Area and commenced pipeline and associated tie-in installations that will connect the Mento platform to the Pelican platform (Mento Pipeline Installation).\nIn 2025, EOG expects to (i) complete the Mento Pipeline Installation; (ii) drill and, if successful, complete two net exploratory wells and drill and complete two net developmental wells, all in the Mento Field located in the SMR Area; (iii) following the execution of the production sharing contracts for the LRL Block, commence an ocean bottom nodal 3D seismic survey over a portion of the LRL Block; and (iv) commence construction of the platform for the Coconut field.  The production sharing contracts with the Government of Trinidad and Tobago for the LRL and NCMA 4(a) Blocks were executed on January 29, 2025.\nBahrain.\n  In February 2025, a subsidiary of EOG signed an exploration participation agreement with Bapco Energies B.S.C. (Closed) to evaluate a gas exploration project in the Kingdom of Bahrain, with drilling anticipated to commence in the second half of 2025.  The transaction, which includes a concession agreement with the Kingdom of Bahrain, is subject to further government approvals, which the parties anticipate receiving in the second half of 2025.\nAustralia.\n  In April 2021, a subsidiary of EOG entered into a purchase and sale agreement to acquire a 100% interest in the WA-488-P Block, located offshore Western Australia.  In November 2021, the petroleum exploration permit for that block was transferred to that subsidiary.  The company has deferred drilling plans to further evaluate the prospect.\nCanada.\n  EOG continues the process of exiting its Canada operations in the Horn River area in Northeast British Columbia.\n3\nMarketing\nIn 2024, EOG continued its diversified approach to marketing its crude oil and condensate.  The majority of EOG's United States crude oil and condensate production was transported by pipeline to downstream markets with the remainder sold into local markets.  Major U.S. sales areas accessed by EOG were at various locations along the U.S. Gulf Coast, including Houston and Corpus Christi, Texas; Cushing, Oklahoma; the Permian Basin and the Midwest.  In 2024, EOG also sold crude oil at the Port of Corpus Christi for export to foreign destinations.  In each case, the price received was based on market prices at that specific sales point or based on the price index applicable for that location.  In 2025, the pricing mechanism for such production is expected to remain the same.  At December 31, 2024, EOG was committed to deliver to multiple parties aggregate fixed quantities of crude oil of 2 MMBbls in 2025, all of which is expected to be sourced from future production of available reserves. \nIn 2024, EOG processed certain of its United States natural gas production, either at EOG-owned facilities or at third-party facilities, extracting NGLs.  NGLs were sold at prevailing market prices, into either local markets or downstream locations.  In certain instances, EOG exchanged its NGLs production for purity products received downstream, which were sold at prevailing market prices.  In 2024, EOG also sold purity products at the Houston Ship Channel.  In each case, the price received was based on market prices for that location and purity product.  In 2025, the pricing mechanisms for NGL and purity products sales are expected to remain the same.  At December 31, 2024, EOG was committed to deliver to multiple parties aggregate fixed quantities of purity products of 15 MMBbls in 2025, all of which is expected to be sourced from future production of available reserves.\nIn 2024, consistent with its diversified marketing strategy, the majority of EOG's United States natural gas production was transported by pipeline to various locations, including Katy, Texas; East Texas; the Agua Dulce Hub in South Texas; the Cheyenne Hub in Weld County, Colorado; and Chicago, Illinois.  Remaining natural gas production was sold into local markets.  In each case, pricing was based on the spot market price at the ultimate sales point.  In 2025, the pricing mechanism for such production is expected to remain the same.  Additionally, EOG sells natural gas to a liquefaction facility near Corpus Christi, Texas, and receives pricing based on the Platts Japan Korea Marker; such pricing mechanism is expected to remain the same in 2025.  At December 31, 2024, EOG was committed to deliver to multiple parties aggregate fixed quantities of natural gas of 342 Bcf in 2025, 318 Bcf in 2026, 359 Bcf in 2027, 328 Bcf in 2028, 328 Bcf in 2029 and 3,474 Bcf thereafter, all of which is expected to be sourced from future production of available reserves. \nIn February 2024, EOG entered into a 10-year agreement, commencing in 2027, to sell 180,000 million British thermal units per day (MMBtud) of its domestic natural gas production, with 140,000 MMBtud to be sold at a price indexed to Brent crude oil (Brent) and the remaining volumes to be sold at a price indexed to Brent or a U.S. Gulf Coast gas index.  \nIn 2024, natural gas volumes from Trinidad were sold to the National Gas Company of Trinidad and Tobago Limited and its subsidiary under two natural gas sales arrangements: (i) a fixed price contract and (ii) a contract based on an escalated floor price which further increases if index prices for certain commodities exceed specified levels.\nIn certain instances, EOG purchases and sells third-party crude oil and natural gas in order to balance firm capacity at third-party facilities with production in certain areas and to utilize excess capacity at EOG-owned facilities. \nDuring 2024, three purchasers each accounted for more than 10% of EOG's total crude oil and condensate, NGLs and natural gas revenues and gathering, processing and marketing revenues.  The purchasers are in the crude oil refining industry.  EOG does not believe that the loss of any single purchaser would have a material adverse effect on its financial condition or results of operations.\n4\nVolumes and Prices\nThe following table sets forth certain information regarding EOG's volumes of, and average prices for, crude oil and condensate, NGLs and natural gas.  The table also presents crude oil equivalent volumes which are determined using a ratio of 1.0 barrel of crude oil and condensate or NGLs to 6.0 Mcf of natural gas for each of the years ended December 31, 2024, 2023 and 2022.  See ITEM 7, Management's Discussion and Analysis of Financial Condition and Results of Operations - Results of Operations, for volumes on a per-day basis.\nYear Ended December 31\n2024\n2023\n2022\nCrude Oil and Condensate Volumes (MMBbl) \n(1)\nUnited States:\nDelaware Basin\n113.3 \n110.2 \n101.1 \nEagle Ford Play\n45.5 \n43.9 \n46.6 \nOther\n20.8 \n19.4 \n20.3 \nUnited States\n179.6 \n173.5 \n168.0 \nTrinidad\n0.3 \n0.2 \n0.3 \nTotal\n179.9\n \n173.7\n \n168.3\n \nNatural Gas Liquids Volumes (MMBbl) \n(1)\n \n \nUnited States:\n \n \nDelaware Basin\n67.7 \n59.8 \n50.7 \nEagle Ford Play\n11.1 \n10.5 \n10.5 \nOther\n11.2 \n11.4 \n10.9 \nUnited States\n90.0 \n81.7 \n72.1 \nTotal\n90.0\n \n81.7\n \n72.1\n \nNatural Gas Volumes (Bcf) \n(1)\n \n \nUnited States:\n \nDelaware Basin\n380 \n325 \n279 \nEagle Ford Play\n53 \n50 \n52 \nOther\n199 \n191 \n149 \nUnited States\n632 \n566 \n480 \nTrinidad\n81 \n59 \n66 \nTotal\n713\n \n625\n \n546\n \nCrude Oil Equivalent Volumes (MMBoe) \n(2)\n \n \nUnited States:\n \n \nDelaware Basin\n244.4 \n224.2 \n198.3 \nEagle Ford Play\n65.4 \n62.7 \n65.8 \nOther\n65.2 \n62.6 \n56.0 \nUnited States\n375.0 \n349.5 \n320.1 \nTrinidad\n13.7 \n9.9 \n11.4 \nTotal\n388.7\n \n359.4\n \n331.5\n \n5\nYear Ended December 31\n2024\n2023\n2022\nAverage Crude Oil and Condensate Prices ($/Bbl) \n(3)\nUnited States\n$\n77.42 \n$\n79.18 \n$\n97.22 \nTrinidad\n64.43 \n68.58 \n86.16 \nComposite\n77.40\n \n79.17\n \n97.21\n \nAverage Natural Gas Liquids Prices ($/Bbl) \n(3)\nUnited States\n$\n23.40 \n$\n23.07 \n$\n36.70 \nComposite\n23.40\n \n23.07\n \n36.70\n \nAverage Natural Gas Prices ($/Mcf) \n(3)\nUnited States\n$\n1.99 \n$\n2.70 \n$\n7.27 \nTrinidad\n3.65 \n3.65 \n4.43 \n(4)\nComposite\n2.17\n \n2.79\n \n6.93\n \n(1)\nMillion barrels or billion cubic feet, as applicable.\n(2)\nMillion barrels of oil equivalent; includes crude oil and condensate, NGLs and natural gas.  \n(3)\nDollars per barrel or per thousand cubic feet, as applicable.  Excludes the impact of financial commodity and other derivative instruments (see Note 12 to Consolidated Financial Statements).\n(4)\nIncludes positive revenue adjustment of $0.76 per Mcf ($0.09 per Mcf of EOG's composite natural gas price) for the twelve months ended December 31, 2022, related to a price adjustment per a provision of the natural gas sales contract with NGC amended in July 2022 for natural gas sales during the period from September 2020 through June 2022.\nHuman Capital Management\nAs of December 31, 2024, EOG employed approximately 3,150 persons, including foreign national employees.  EOG's approach to human capital management includes oversight by the Board of Directors (Board) and the Compensation and Human Resources Committee of the Board and focuses on various areas, including the following:\nCulture; Recruiting; Retention\n.  EOG's culture is key to its sustainable success.  By providing employees with a quality work environment and maintaining a consistent college recruiting and internship program and experienced talent recruiting program, EOG is able to attract and retain many of the industry's best and brightest.  To help assess the effectiveness of its approach to human capital management, EOG conducts an annual employee engagement and satisfaction survey.  Based on the results of the survey, EOG has received \"top workplace\" recognition in various office locations as well as several \"culture excellence\" awards.\nEOG values the gender, racial, ethnic and cultural backgrounds of our employees and works to foster a collaborative work environment of different talents, perspectives and experiences.\n \nEOG believes the backgrounds and experiences of our employees, as well as an inclusive work environment, promotes collaboration through multiple perspectives, which helps foster creativity and drive innovation.\n \nFurther, as reflected in its Code of Business Conduct and Ethics for Directors, Officers and Employees, EOG is committed to providing equal opportunity in all aspects of employment and to hiring, evaluating and promoting employees based on skills and performance.\nCompensation, Benefits, Health & Wellness\n.  EOG values attracting and retaining talent, and so it provides competitive salaries, bonuses and a subsidized, comprehensive benefits package.  EOG also offers a holistic wellness program, a matching gifts program, a flexible work schedule, paid family care leave, paid leave for illness or injury, paid volunteer time and an employee assistance program to support the mental well-being of employees and their dependents.  In addition, new-hire stock grants, annual stock grants and an employee stock purchase plan give every employee the opportunity to be a participant in EOG's success.\nTraining and Development\n.  EOG supports employees' professional development and provides training in leadership, management skills, communication, team effectiveness, technical skills and use of EOG systems and applications.  EOG's leadership training, in particular, is focused on providing continuity of leadership at EOG by further enhancing the skills needed to lead a multi-disciplined, diverse and decentralized workforce.  In addition, EOG holds several internal technical conferences each year designed to share best practices and technical advances across the company, including safety and environmental topics.  EOG also offers its employees a tuition reimbursement program as well as reimbursement for the costs of professional certifications.\n6\nSafety\n.  EOG's safety management programs and processes provide a framework for assessing safety performance in a systematic way.  To foster accountability for conducting operations in a safe manner, EOG's safety performance is also considered in evaluating employee performance and compensation.  EOG provides initial, periodic and refresher safety training to employees and contractors.  These training programs address various topics, including operating procedures, safe work practices and emergency and incident response procedures.  EOG also collects and tracks incident data and metrics to identify trends, implement corrective actions as necessary, and enhance our understanding, identification and implementation of proactive safety management practices.\nCompetition \nEOG competes with major integrated oil and gas companies, government-affiliated oil and gas companies and other independent oil and gas companies for the acquisition of licenses, concessions and leases, properties and reserves and access to the facilities, equipment, materials, services, and employees and other personnel (including geologists, geophysicists, engineers and other specialists) necessary to explore for, develop, produce, market and transport crude oil, NGLs and natural gas.  Certain of EOG's competitors have financial and other resources substantially greater than those EOG possesses and have established strategic long-term positions or strong governmental relationships in countries or areas in which EOG may seek new or expanded entry.  As a consequence, EOG may be at a competitive disadvantage in certain respects, such as in bidding for drilling rights or in accessing necessary services, facilities, equipment, materials and personnel.  In addition, EOG's larger competitors may have a competitive advantage when responding to factors that affect demand for crude oil, NGLs and natural gas, such as changing worldwide prices and levels of production and the cost and availability of alternative fuels.  EOG also faces competition from alternative energy sources, such as renewable energy sources.  See ITEM 1A, Risk Factors. \nRegulation\nGeneral.\n  New or revised rules, regulations and policies may be issued, and new legislation may be proposed, that could impact the oil and gas exploration and production industry.  Such rules, regulations, policies and legislation may affect, among other things, (i) permitting for oil and gas drilling on state, tribal and federal lands, (ii) the leasing of state, tribal and federal lands for oil and gas development, (iii) the regulation and disclosure of greenhouse gas (GHG) emissions and/or other climate change-related matters associated with oil and gas operations (e.g., the development, implementation and carrying out of carbon capture and storage activities, including associated financial or tax incentives), (iv) the use of hydraulic fracturing on state, tribal and federal lands, (v) the calculation of royalty payments in respect of oil and gas production from state, tribal and federal lands (including, but not limited to, an increase in applicable royalty percentages), (vi) U.S. federal income tax laws applicable to oil and gas exploration and production companies and (vii) the use of financial derivative instruments to hedge the financial impact of fluctuations in crude oil, NGLs and natural gas prices.  For additional discussion regarding the regulatory-related risks to which EOG's operations, financial condition and results of operations are or may be subject, see the below discussion and ITEM 1A, Risk Factors.\nUnited States Regulation of Crude Oil and Natural Gas Production.  \nCrude oil and natural gas production operations are subject to various types of regulation, including regulation by federal and state agencies.\nUnited States legislation affecting the oil and gas industry is regularly reviewed, expanded and/or revised by lawmakers.  In addition, numerous departments and agencies, both federal and state, are authorized by statute to issue, and have issued, rules and regulations applicable to the oil and gas industry.  Such rules and regulations, among other things, require permits for the drilling of wells, regulate the spacing of wells, prevent the waste of natural gas through restrictions on flaring, require surety bonds for various exploration and production operations and regulate the calculation and disbursement of royalty payments (for federal and state leases), production taxes and ad valorem taxes.\nA portion of EOG's oil and gas leases in New Mexico, North Dakota and Wyoming, as well as in other areas, are granted by the federal government and administered by the Bureau of Land Management (BLM) and/or the Bureau of Indian Affairs (BIA), both federal agencies.  Operations conducted by EOG on federal oil and gas leases must comply with numerous additional statutory and regulatory restrictions and, in the case of leases relating to tribal lands, certain tribal environmental and permitting requirements and employment rights regulations.  In addition, the U.S. Department of the Interior (via various of its agencies, including the BLM, the BIA and the Office of Natural Resources Revenue) has certain authority over our calculation and payment of royalties, bonuses, fines, penalties, assessments and other revenues related to federal and tribal oil and gas leases.  In addition, the Inflation Reduction Act of 2022 (IRA) requires that all leases granted and administered by the BLM and entered into on or after August 16, 2022 include a royalty rate of 16.67 percent in respect of the associated oil and gas production.  Regulations implementing the new royalty rate were finalized in April 2024.\n7\nBLM and BIA leases contain relatively standardized terms requiring compliance with detailed regulations.  Under certain circumstances, the BLM or BIA may require operations on federal leases to be suspended or terminated.  Any such suspension or termination could materially and adversely affect EOG's interests on federal lands.  From time to time, the U.S. Department of the Interior has also considered limiting or pausing new oil and natural gas leases on federal lands.  Any limitation or ban on permitting for oil and gas exploration and production activities on federal lands could have a material and adverse effect on EOG's operations, financial condition and results of operations.  EOG's interests in offshore leases are de minimis. \nThe transportation and sale for resale of natural gas in interstate commerce are regulated pursuant to the Natural Gas Act of 1938, as amended (NGA), and the Natural Gas Policy Act of 1978.  These statutes are administered by the Federal Energy Regulatory Commission (FERC).  Effective January 1993, the Natural Gas Wellhead Decontrol Act of 1989 deregulated natural gas prices for all \"first sales\" of natural gas, which includes all sales by EOG of its own production.  All other sales of natural gas by EOG, such as those of natural gas purchased from third parties, remain jurisdictional sales subject to a blanket sales certificate under the NGA, which has flexible terms and conditions.  Consequently, all of EOG's sales of natural gas currently may be made at unregulated market prices, subject to applicable contract provisions.  EOG's jurisdictional sales, however, may be subject in the future to greater federal oversight, including the possibility that the FERC might prospectively impose more restrictive conditions on such sales.  Conversely, sales of crude oil and condensate and NGLs by EOG are made at unregulated market prices.\nEOG owns certain gathering and/or processing facilities and systems in the Permian Basin in West Texas and New Mexico, the Anadarko Basin in Oklahoma, the Powder River Basin in Wyoming, the Utica in Ohio, the Barnett Shale in the Bend Arch-Fort Worth Basin in North Texas, the Bakken and Three Forks plays in the Williston Basin in North Dakota, and the Eagle Ford play and Dorado gas play in South Texas.  State regulation of gathering and processing facilities generally includes various safety, environmental and, in some circumstances, nondiscrimination requirements with respect to the provision of gathering and processing services, but does not generally entail rate regulation.  EOG's gathering and processing operations could be materially and adversely affected should they be subject in the future to the application of state or federal regulation of rates and services.\nEOG's gathering and processing operations also may be, or become, subject to safety and operational regulations relating to the design, installation, testing, construction, operation, replacement and management of such facilities.  Additional rules and legislation pertaining to these matters are considered and/or adopted from time to time.  Although EOG cannot predict what effect, if any, such legislation might have on its operations and financial condition, EOG could be required to incur additional capital expenditures and increased compliance and operating costs depending on the nature and extent of such future legislative and regulatory changes.\nEOG also owns crude oil truck unloading facilities in certain of its U.S. plays.  Regulation of such facilities is conducted at the state and federal levels and generally includes various safety, environmental and permitting requirements.  Additional regulation pertaining to these matters is considered and/or adopted from time to time.  Although EOG cannot predict what effect, if any, any such new regulations might have on the transportation of its crude oil production by truck, EOG could be required to incur additional capital expenditures and increased compliance and operating costs depending on the nature and extent of such future regulatory changes.  EOG did not transport any crude oil by rail during 2024.\nProposals and proceedings that might affect the oil and gas industry are considered from time to time by Congress, the state legislatures, the FERC and other federal, state and local regulatory commissions, agencies, councils and courts.  EOG cannot predict when or whether any such proposals or proceedings may become effective.  It should also be noted that the oil and gas industry historically has been very heavily regulated; therefore, there is no assurance that the approach currently being followed by such legislative bodies and regulatory commissions, agencies, councils and courts will remain unchanged.\nEnvironmental Regulation Generally - United States.\n  EOG is subject to various federal, state and local laws and regulations covering the discharge or release of materials into the environment or otherwise relating to the protection of the environment.  These laws and regulations affect EOG's operations and costs as a result of their effect on crude oil and natural gas exploration, development and production operations and related activities (e.g., carbon capture and storage).  Failure to comply with these laws and regulations may result in the assessment of administrative, civil and criminal penalties, including the assessment of monetary penalties, the imposition of investigatory and remedial obligations, the suspension or revocation of necessary permits, licenses and authorizations, the requirement that additional pollution controls be installed and the issuance of orders enjoining future operations or imposing additional compliance requirements.\n8\nIn addition, EOG has acquired certain oil and gas properties from third parties whose actions with respect to the management and disposal or release of hydrocarbons or other wastes were not under EOG's control.  Under environmental laws and regulations, EOG could be required to remove or remediate wastes disposed of or released by prior owners or operators.  EOG also could incur costs related to the clean-up of third-party sites to which it sent regulated substances for disposal or to which it sent equipment for cleaning, and for damages to natural resources or other claims related to releases of regulated substances at such third-party sites.  In addition, EOG could be responsible under environmental laws and regulations for oil and gas properties in which EOG previously owned or currently owns an interest, but was or is not the operator.  Moreover, EOG is subject to the U.S. Environmental Protection Agency's (U.S. EPA) rule requiring annual reporting of GHG emissions and, as discussed further below, is also subject to federal, state and local laws and regulations regarding hydraulic fracturing and other aspects of our operations.\nCompliance with environmental laws and regulations increases EOG's overall cost of business, but has not had, to date, a material adverse effect on EOG's operations, financial condition, results of operations or capital expenditures (for environmental control facilities or otherwise).  In addition, it is not anticipated, based on current laws and regulations, that EOG will be required in the near future to expend amounts (whether for environmental control facilities or otherwise) that are material in relation to its total exploration and development expenditure program in order to comply with such laws and regulations.  However, EOG is unable to predict (i) the timing, scope and effect of any currently proposed or future laws or regulations regarding the environment and (ii) the ultimate cost of compliance or the ultimate effect on EOG's operations, financial condition, results of operations and capital expenditures relating to such future laws and regulations.  The direct and indirect cost of such laws and regulations (if enacted) could materially and adversely affect EOG's operations, financial condition, results of operations and capital expenditures.\nClimate Change - United States.\n  Local, state, federal and international regulatory bodies have been increasingly focused on GHG emissions and climate change issues in recent years.  The U.S. Congress has, from time to time, proposed legislation for imposing restrictions on, or requiring fees or carbon taxes in respect of, GHG emissions. Further, the IRA imposes a methane emissions charge on certain oil and gas facilities, including onshore and offshore petroleum and natural gas production facilities, that exceed certain emissions thresholds.  The charge will be levied annually based on emissions reported under the U.S. EPA's GHG reporting program, which program was amended in May 2024, impacting how emissions are reported under the program.  The U.S. EPA published final regulations specific to the calculation of such annual charge in November 2024.  In February 2025, however, the U.S. House and Senate approved a joint resolution of disapproval under the Congressional Review Act to repeal the methane emissions charge, which President Trump is expected to sign into law.  In any event, EOG does not expect such annual methane emissions charge would have a material impact on EOG's financial condition, results of operations, capital expenditures or operations.\nIn addition to the U.S. EPA's rule requiring annual reporting of GHG emissions from covered facilities (which is amended from time to time and under which EOG reports), the U.S. EPA has adopted regulations for certain large sources regulating GHG emissions as pollutants under the federal Clean Air Act.  Further, the U.S. EPA, in May 2016, issued regulations that require operators to reduce methane emissions and emissions of volatile organic compounds (VOC) from new, modified and reconstructed crude oil and natural gas wells and equipment located at natural gas production gathering and boosting stations, gas processing plants and natural gas transmission compressor stations.  In November 2021, the U.S. EPA proposed a rule to further reduce methane and VOC emissions from new and existing sources in the oil and natural gas sector and, in November 2022, the U.S. EPA issued a supplemental proposal to expand its November 2021 proposed rule, including proposed regulation of additional sources of methane and VOC emissions, such as abandoned and unplugged wells.  In addition, in March 2024, the U.S. EPA published its final methane rules, which impose new methane emission requirements on the oil and gas industry, including our operations.  Further, in April 2024, the BLM published its final Waste Prevention Rule, which requires operators of oil and gas leases to take reasonable steps to avoid natural gas waste, as well as develop leak detection, repair and waste minimization plans.  In January 2025, President Trump signed executive orders that, among other things, direct federal executive departments and agencies to initiate a regulatory freeze for certain rules that have not taken effect, pending review by the newly appointed agency head, and call upon the U.S. EPA to submit a report on the continuing applicability of its endangerment finding for GHGs under the Clean Air Act.\n9\nAt the international level, the U.S., in December 2015, participated in the 21st Conference of the Parties of the United Nations Framework Convention on Climate Change in Paris, France.  The Paris Agreement (adopted at the conference) calls for nations to undertake efforts with respect to global temperatures and GHG emissions.  The Paris Agreement went into effect in November 2016.  The United States formally rejoined the Paris Conference in February 2021 and established economy-wide targets of (i) reducing its net GHG emissions by 50-52 percent below 2005 levels by 2030 and (ii) achieving net zero GHG emissions economy-wide by no later than 2050.  In December 2023, the first global stocktake, also known as the “UAE Consensus,” was issued at the COP 28 Conference.  The UAE Consensus is an assessment of members’ collective efforts and achievements to reduce GHG emissions and adapt to the impacts of climate change.  The UAE Consensus calls on parties, including the U.S., to contribute to the transitioning away from fossil fuels, reduce methane emissions, and increase renewable energy capacity, among other things, to achieve net zero emissions by 2050. In January 2025, the United States submitted formal notification to the United Nations that it intends to withdraw from the Paris Agreement.  Pursuant to the terms of the Paris Agreement, the withdrawal will take effect on January 27, 2026.  Nevertheless, state and local officials may continue efforts to uphold the commitments set forth in the international accord.  \nEOG believes that its strategy to continue to improve its emissions performance is important for environmental, operational and economic reasons.  EOG’s approach to reducing emissions from its operations remains operationally focused.  For example, EOG has developed an environmental data collection and analysis system that is utilized in calculating GHG emissions from the facilities it operates.  This system calculates emissions based on recognized regulatory methodologies, where applicable, and on commonly accepted engineering practices.  \nIn addition, EOG has developed, and will continue to develop, targets and ambitions related to its environmental initiatives, including, but not limited to, its emissions reduction targets and its ambition to reach net zero Scope 1 and Scope 2 GHG emissions by 2040.  See ITEM 1A, Risk Factors, for additional discussion regarding EOG’s initiatives, targets and ambitions related to emissions and other environmental matters.\nEOG is unable to predict the timing, scope and effect of any currently proposed or future investigations, laws, regulations, treaties or policies regarding climate change and GHG emissions (including any laws and regulations that may be enacted in the U.S.), but the direct and indirect costs of such investigations, laws, regulations, treaties or policies (if enacted, issued or applied) could materially and adversely affect EOG's operations, financial condition, results of operations and capital expenditures.  The potential increase in the costs of our operations could include costs to operate and maintain our facilities, install new emissions controls on our facilities, acquire allowances or credits to cover our GHG emissions, pay taxes, charges or fees related to our GHG emissions, or administer and manage a GHG emissions program.  In addition, changes in regulatory policies that result in a reduction in the demand for hydrocarbon products that are deemed to contribute to GHG emissions, or restrictions on their use, could also adversely affect market demand for, and in turn the prices we receive for our production of, crude oil, NGLs and natural gas.  Further, the increasing attention to global climate change risks has created the potential for a greater likelihood of governmental investigations and private and public litigation, which could increase our costs or otherwise adversely affect our business.  See ITEM 1A, Risk Factors, for additional discussion regarding climate change-related developments.  \nRegulation of Hydraulic Fracturing and Other Operations - United States.\n  Substantially all of the onshore crude oil and natural gas wells drilled by EOG are completed and stimulated through the use of hydraulic fracturing.  Hydraulic fracturing technology, which has been used by the oil and gas industry for more than 60 years and is constantly being enhanced, enables EOG to produce crude oil and natural gas that otherwise would not be recovered.  Specifically, hydraulic fracturing is a process in which pressurized fluid is pumped into underground formations to create tiny fractures or spaces that allow crude oil and natural gas to flow from the reservoir into the well so that it can be brought to the surface.  Hydraulic fracturing generally takes place thousands of feet underground, a considerable distance below any drinking water aquifers, and there are impermeable layers of rock between the area fractured and the water aquifers.  The makeup of the fluid used in EOG’s hydraulic fracturing process includes water and sand, and typically less than 0.5% of highly diluted chemical additives; lists of the chemical additives used in fracturing fluids are available to the public via internet websites and in other publications sponsored by industry trade associations and through state agencies in those states that require the reporting of the components of fracturing fluids.  While the majority of the sand remains underground to hold open the fractures, a significant amount of the water and chemical additives flow back and are then either reused or safely disposed of at sites that are approved and permitted by the appropriate regulatory authorities.  EOG periodically conducts regulatory assessments of these disposal facilities to monitor compliance with applicable regulations.  \n10\nThe regulation of hydraulic fracturing is primarily conducted at the state and local level through permitting and other compliance requirements.  In April 2012, however, the U.S. EPA issued regulations specifically applicable to the oil and gas industry that require operators to significantly reduce VOC emissions from natural gas wells that are hydraulically fractured through the use of \"green completions\" to capture natural gas that would otherwise escape into the air.  The U.S. EPA has also issued regulations that establish standards for VOC emissions from several types of equipment, including storage tanks, compressors, dehydrators, and valves and sweetening units at gas processing plants.  In addition, and as further discussed above under “Climate Change – United States,” the U.S. EPA has issued regulations with respect to the reduction of methane and VOC emissions, including its final methane rules published in March 2024.  From time to time, there have been various other proposals to regulate hydraulic fracturing at the federal level.    \nIn addition to the above-described federal regulations, some state and local governments have imposed, or have considered imposing, various conditions and restrictions on drilling and completion operations, including requirements regarding casing and cementing of wells; testing of nearby water wells; restrictions on access to, and usage of, water; disclosure of the chemical additives used in hydraulic fracturing operations; restrictions on the type of chemical additives that may be used in hydraulic fracturing operations; and restrictions on drilling or injection activities on certain lands lying within wilderness wetlands, ecologically or seismically sensitive areas, and other protected areas.  Such federal, state and local permitting and disclosure requirements, operating restrictions, conditions or prohibitions could lead to operational delays and increased operating and compliance costs and, moreover, could delay or effectively prevent the development of crude oil and natural gas from formations which would not be economically viable without the use of hydraulic fracturing.\nCompliance with laws and regulations relating to hydraulic fracturing and other aspects of our operations increases EOG's overall cost of business, but has not had, to date, a material adverse effect on EOG's operations, financial condition, results of operations or capital expenditures (for environmental control facilities or otherwise).  In addition, it is not anticipated, based on current laws and regulations, that EOG will be required in the near future to expend amounts that are material in relation to its total exploration and development expenditure program in order to comply with such laws and regulations.  However, EOG is unable to predict (i) the timing, scope and effect of any currently proposed or future laws or regulations regarding hydraulic fracturing in the United States or other aspects of our operations and (ii) the ultimate cost of compliance or the ultimate effect on EOG's operations, financial condition, results of operations and capital expenditures relating to such future laws and regulations.  The direct and indirect costs of such laws and regulations (if enacted) could materially and adversely affect EOG's operations, financial condition, results of operations and capital expenditures.\nOther International Regulation.\n  EOG's exploration and production operations outside the United States are subject to various types of regulations, including environmental regulations, imposed by the respective governments of the countries in which EOG's operations are conducted, and may affect EOG's operations and costs of compliance within those countries.  EOG is unable to predict the timing, scope and effect of any currently proposed or future laws, regulations or treaties, including those regarding climate change and hydraulic fracturing, but the direct and indirect costs of such laws, regulations and treaties (if enacted) could materially and adversely affect EOG's operations, financial condition, results of operations and capital expenditures.  EOG will continue to review the risks to its existing business and operations, as well as any potential business and operations, outside the United States associated with all environmental matters, including climate change and hydraulic fracturing regulation.  In addition, EOG will continue to monitor and assess any new policies, legislation, regulations and treaties in the areas outside the United States where it operates to determine the impact on its operations and take appropriate actions, where necessary.  \nFurther, EOG will continue to monitor and assess the impact on its business of any environmental, climate change or other policies, legislation and regulations enacted by foreign governments – for example, the European Union’s November 2023 approval of methane emissions limits on crude oil and natural gas imports beginning in 2030.\nOther Matters \nEnergy Prices.  \nEOG is a crude oil and natural gas producer and is impacted by changes in the prices for crude oil and condensate, NGLs and natural gas.  During the last three years, average United States commodity prices have fluctuated, at times rather dramatically.  Average crude oil and condensate prices received by EOG for production in the United States decreased 2% in 2024, decreased 19% in 2023 and increased 42% in 2022, each as compared to the immediately preceding year.  Average NGLs prices received by EOG for production in the United States increased 1% in 2024, decreased 37% in 2023 and increased 7% in 2022, each as compared to the immediately preceding year.  Fluctuations in average natural gas prices received by EOG for production in the United States resulted in a 26% decrease in 2024, a 63% decrease in 2023, and a 49% increase in 2022, each as compared to the immediately preceding year.  \n11\nDue to the many uncertainties associated with the world political and economic environment (for example, the actions of other crude oil exporting nations, including the Organization of Petroleum Exporting Countries, or the global impacts of wars or military conflicts involving such nations or regions), the global supply of, and demand for, crude oil, NGLs and natural gas and the availability of other energy supplies, the relative competitive relationships of the various energy sources in the view of consumers and other factors, EOG is unable to predict what changes may occur in the prices of crude oil and condensate, NGLs and natural gas in the future.  For additional discussion regarding changes in crude oil and condensate, NGLs and natural gas prices, the potential impacts on EOG and the risks that such changes may present to EOG, see ITEM 1A, Risk Factors.\nBased on EOG's tax position, EOG's price sensitivity in 2025 for each $1.00 per barrel increase or decrease in crude oil and condensate price, combined with the estimated change in NGLs price, is approximately $159 million for net income and $204 million for pretax cash flows from operating activities.  Including the impact of EOG's natural gas financial derivative contracts and based on EOG's tax position and the portion of EOG's anticipated natural gas volumes for 2025 for which prices have not been determined under long-term marketing contracts, EOG's price sensitivity for each $0.10 per Mcf increase or decrease in natural gas price is approximately $33 million for net income and $42 million for pretax cash flows from operating activities.  For a summary of EOG's financial commodity and other derivative contracts through February 21, 2025, see ITEM 7, Management's Discussion and Analysis of Financial Condition and Results of Operations - Capital Resources and Liquidity - Financial Commodity and Other Derivative Transactions.  For a summary of EOG's financial commodity and other derivative contracts for the year ended December 31, 2024, see Note 12 to Consolidated Financial Statements.\nRisk Management.  \nEOG engages in price risk management activities from time to time.  These activities are intended to manage EOG's exposure to fluctuations in prices of crude oil, NGLs and natural gas.  EOG utilizes financial commodity derivative instruments, primarily price swap, option, swaption, collar and basis swap contracts, as a means to manage this price risk.  See Note 12 to Consolidated Financial Statements.  For a summary of EOG's financial commodity and other derivative contracts through February 21, 2025, see ITEM 7, Management's Discussion and Analysis of Financial Condition and Results of Operations ‑ Capital Resources and Liquidity - Financial Commodity and Other Derivative Transactions. \nAll of EOG's crude oil, NGLs and natural gas activities are subject to the risks normally incident to the exploration for, and development, production and transportation of, crude oil, NGLs and natural gas, including rig and well explosions, cratering, fires, loss of well control and leaks and spills, each of which could result in damage to life, property and/or the environment.  EOG's operations are also subject to certain perils, including hurricanes, tropical storms, flooding, winter storms and other adverse weather events.  Moreover, EOG's activities are subject to governmental regulations as well as interruption or termination by governmental authorities based on environmental and other considerations.  Losses and liabilities arising from such events could reduce EOG's revenues and increase costs to EOG to the extent not covered by insurance.\nInsurance is maintained by EOG against many, but not all, of these risks in accordance with what EOG believes are customary industry practices and in amounts and at costs that EOG believes to be prudent and commercially practicable.  Specifically, EOG maintains commercial general liability and excess liability insurance coverage for bodily injury or death claims resulting from an incident involving EOG's operations (subject to policy terms and conditions).  Moreover, for any incident involving EOG's operations which results in negative environmental effects, EOG maintains operators extra expense insurance coverage for obligations, expenses or claims that EOG may incur from such an incident, including obligations, expenses or claims in respect of sudden and accidental seepage and pollution, cleanup and containment, evacuation expenses and control of the well (subject to policy terms and conditions).  In the event of a well control incident resulting in negative environmental effects, such operators extra expense coverage would be EOG's primary coverage, with the commercial general liability and excess liability coverage also providing certain coverage to EOG.  Additionally, subject to policy terms and conditions, EOG also maintains insurance that covers damage to EOG's equipment, facilities and structures due to a physical damage event.  All of EOG's drilling activities are conducted on a contractual basis with independent drilling contractors and other third-party service contractors.  The indemnification and other risk allocation provisions included in such contracts are negotiated on a contract-by-contract basis and are each based on the particular circumstances of the services being provided and the anticipated operations.\n12\nIn addition to the above-described risks, EOG's operations outside the United States are subject to certain risks, including: \n•\nincreases in taxes and governmental royalties;\n•\nadditional and potentially unfamiliar laws and policies governing the operations of foreign-based companies and changes in such laws and policies;\n•\nexpropriation of assets;\n•\nunilateral or forced renegotiation, modification or nullification of existing contracts with governmental entities; and\n•\ncurrency restrictions and exchange rate fluctuations.\n  Please refer to ITEM 1A, Risk Factors, for further discussion of the risks to which EOG is subject with respect to its operations outside the United States.\nInformation About Our Executive Officers\nThe current executive officers of EOG and their names and ages (as of February 27, 2025) are as follows:\nName\nAge\nPosition\nEzra Y. Yacob\n48\nChairman of the Board and Chief Executive Officer\nJeffrey R. Leitzell\n45\nExecutive Vice President and Chief Operating Officer\nAnn D. Janssen\n60\nExecutive Vice President and Chief Financial Officer\nMichael P. Donaldson\n62\nExecutive Vice President, General Counsel and Corporate Secretary\nEzra Y. Yacob was appointed Chairman of the Board, effective October 2022, and elected Chief Executive Officer and appointed as a Director effective October 2021.  Prior to that, he served as President from January 2021 through September 2021; Executive Vice President, Exploration and Production from December 2017 to January 2021; and Vice President and General Manager of EOG's Midland, Texas office from May 2014 to December 2017.  He also previously served as Manager, Division Exploration in EOG's Fort Worth, Texas, and Midland, Texas, offices from March 2012 to May 2014 as well as in various geoscience and leadership positions.  Mr. Yacob joined EOG in August 2005.\nJeffrey R. Leitzell was elected Executive Vice President and Chief Operating Officer in December 2023.  Mr. Leitzell previously served as Executive Vice President, Exploration and Production from May 2021 to December 2023, Vice President and General Manager of EOG's Midland, Texas office from December 2017 to May 2021 and as Operations Manager in Midland from August 2015 to December 2017.  Prior to that, Mr. Leitzell held various engineering roles of increasing responsibility in multiple offices and functional areas within EOG.  Mr. Leitzell joined EOG in October 2008.\nAnn D. Janssen was elected Executive Vice President and Chief Financial Officer effective January 2024.  Previously, Ms. Janssen served as Senior Vice President and Chief Accounting Officer from February 2018 through December 2023 and as EOG's principal accounting officer from September 2010 through December 2023.  Prior to that, Ms. Janssen held various accounting and finance roles of increasing responsibilities.  Ms. Janssen joined a predecessor of EOG in October 1995.\nMichael P. Donaldson was elected Executive Vice President, General Counsel and Corporate Secretary in April 2016.  Previously, Mr. Donaldson served as Vice President, General Counsel and Corporate Secretary from May 2012 to April 2016.  He was elected Corporate Secretary in May 2008, and was appointed Deputy General Counsel and Corporate Secretary in July 2010.  Mr. Donaldson joined EOG in September 2007.\n13",
  "item7": "ITEM 7.  \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nEOG Resources, Inc., together with its subsidiaries (collectively, EOG), is one of the largest independent (non-integrated) crude oil and natural gas companies in the United States of America (United States) with proved reserves in the United States and the Republic of Trinidad and Tobago (Trinidad).  EOG is focused on being among the highest return and lowest cost producers, committed to strong environmental performance and playing a significant role in the long-term future of energy.  EOG operates under a consistent business and operational strategy that focuses on a comprehensive approach to developing acreage through industry cycles.  EOG evaluates rate of return, net present value, margins, payback period and other key metrics.  This strategy is intended to enhance the generation of cash flow and earnings from each unit of production on a cost-efficient basis, allowing EOG to maximize long-term growth in shareholder value and maintain a strong balance sheet.  EOG implements its strategy primarily by emphasizing the drilling of internally generated prospects in order to find and develop low-cost reserves.  Maintaining the lowest possible operating cost structure, coupled with efficient and safe operations and robust environmental stewardship practices and performance, is integral in the implementation of EOG's strategy.\nEOG realized net income of $6,403 million during 2024 as compared to net income of $7,594 million for 2023.  At December 31, 2024, EOG's total estimated net proved reserves were 4,748 million barrels of oil equivalent (MMBoe), an increase of 250 MMBoe from December 31, 2023.  During 2024, net proved crude oil and condensate and natural gas liquids (NGLs) reserves increased by 218 million barrels (MMBbl), and net proved natural gas reserves increased by 192 billion cubic feet, or 32 MMBoe, in each case from December 31, 2023.\nRecent Developments\nCommodity Prices.\n  Prices for crude oil and condensate, NGLs and natural gas have historically been volatile. This volatility is expected to continue due to the many uncertainties associated with the world political and economic environment and the global supply of, and demand for, crude oil, NGLs and natural gas and the availability of other energy supplies, the relative competitive relationships of the various energy sources in the view of consumers and other factors.\n The market prices of crude oil and condensate, NGLs and natural gas impact the amount of cash generated from EOG's operating activities, which, in turn, impact EOG's financial position and results of operations. \nFor the year ended December 31, 2024, the average U.S. New York Mercantile Exchange (NYMEX) crude oil and natural gas prices were $75.72 per barrel and $2.27 per million British thermal units (MMBtu), respectively, representing decreases of 2% and 17%, respectively, from the average NYMEX prices for the year ended December 31, 2023. Market prices for NGLs are influenced by the components extracted, including ethane, propane and butane and natural gasoline, among others, and the respective market pricing for each component. \nInflationary Pressures, Operational Efficiencies & Related Initiatives/Actions.\n  During 2024, EOG continued to see diminished inflationary pressures on its operating costs and capital expenditures (e.g., for fuel, wellbore tubulars, facilities manufactured using steel, labor and drilling and completion services) and, in certain circumstances, has seen declines in prices.  However, because the market for such materials, services and labor continues to fluctuate, there can be no assurance that the inflationary pressures experienced by EOG in prior periods will not resume.  Further, the timing and impact of any future price changes on EOG's operating costs and capital expenditures is uncertain. \n35\nEOG has undertaken (and continues to undertake) initiatives to increase its drilling, completion and operating efficiencies and improve the performance of its wells and, in turn, mitigate the inflationary pressures experienced in prior periods.  Such initiatives include (among others): (i) EOG's downhole drilling motor program, which has resulted in increased footage drilled per day and, in turn, reduced drilling times; (ii) enhanced techniques for completing its wells, which has resulted in increased footage completed per day and pumping hours per day; (iii) drilling extended laterals, which has resulted in a decrease in cost per foot drilled; and (iv) EOG's self-sourced sand program, which has resulted in cost savings for the sand utilized in its well completion operations.  In addition, EOG has entered into agreements with its service providers from time to time, when available and advantageous, to secure the costs and availability of certain drilling and completion services it utilizes as part of its operations. \nEOG plans to continue with these initiatives and actions, though there can be no assurance that such efforts will offset, largely or at all, the impacts of any future inflationary pressures (such as from tariffs) on EOG's operating costs and capital expenditures, cash flows and results of operations.  Further, there can be no assurance that the factors contributing to any such future inflationary pressures will not impact EOG's ability to conduct its future day-to-day drilling, completion and production operations.  See ITEM 1A. Risk Factors, for related discussion.\nClimate Change\n.  For a discussion of climate change matters and related regulatory matters, including potential developments related to climate change and the potential impacts and risks of such developments on EOG, see ITEM 1A, Risk Factors, and the related discussion in ITEM 1, Business – Regulation.  EOG will continue to monitor and assess any climate change-related developments that could impact EOG and the oil and gas industry, to determine the impact on its business and operations, and take appropriate actions where necessary.\nOperations\nSeveral important developments have occurred since January 1, 2024.\nUnited States.  \nEOG's efforts to identify plays with large reserve potential have proven to be successful.  EOG continues to drill numerous wells in large acreage plays, which in the aggregate have contributed substantially to, and are expected to continue to contribute substantially to, EOG's crude oil and condensate, NGLs and natural gas production.  EOG has placed an emphasis on applying its horizontal drilling and completion expertise to unconventional crude oil and natural gas plays.\nIn 2024, EOG continued to focus on initiatives to increase its drilling, completion and operating efficiencies and improve well performance and, in turn, mitigate the inflationary pressures on its operating costs and capital expenditures experienced in prior periods. In addition, EOG continued to evaluate certain potential crude oil and condensate, NGLs and natural gas exploration and development prospects and to look for opportunities to add drilling inventory through leasehold acquisitions, farm-ins, exchanges or tactical or bolt-on acquisitions. On a volumetric basis, as calculated using a ratio of 1.0 barrel of crude oil and condensate or NGLs to 6.0 thousand cubic feet of natural gas, crude oil and condensate and NGLs production accounted for approximately 72% and 73% of EOG's United States production during 2024 and 2023, respectively. During 2024, EOG's drilling and completion activities occurred primarily in the Delaware Basin play, Eagle Ford play and Rocky Mountain area. EOG's major producing areas in the United States are in New Mexico and Texas.  See ITEM 1, Business - Exploration and Production for further discussion regarding EOG's 2024 United States operations.\nTrinidad.\n  In Trinidad, EOG continues to deliver natural gas under existing supply contracts.  Several fields in the South East Coast Consortium (SECC) Block, Modified U(a) Block, Block 4(a) and Banyan and Sercan Areas have been developed and are producing natural gas which is sold to the National Gas Company of Trinidad and Tobago Limited and its subsidiary, and crude oil and condensate which is sold to Heritage Petroleum Company Limited.\nDuring 2024, EOG completed one net developmental well and one net exploratory well from the Osprey B platform in the Modified U(a) Block.  EOG also completed two net exploratory wells from the Oilbird platform in the SECC Block, drilled a deep Teak, Saaman and Poui (TSP Deep) exploratory well which allowed EOG to retain a 50% working interest in the TSP Deep Area and recompleted one net well in the Sercan Area.  EOG also completed construction and installation of the Mento platform in the Ska, Mento and Reggae Area and commenced pipeline and associated tie-in installations that will connect the Mento platform to the Pelican platform.  In 2024, EOG relinquished its rights to a portion of the contract area governed by the Trinidad Northern Area License located offshore the southwest coast of Trinidad and signed a farmout agreement with BP Trinidad and Tobago LLC, which allows EOG to earn a 50% working interest to develop the Coconut field in the Coconut Area located within the East Mayaro and South East Galeota exploration and production licenses.  Additionally, EOG was selected as the preferred bidder in the Lower Reverse L and North Coast Marine Area 4(a) Blocks in respect of the 2023 shallow water offshore bid round.  \n36\nOther International.\n  In February 2025, a subsidiary of EOG signed an exploration participation agreement with Bapco Energies B.S.C. (Closed) to evaluate a gas exploration project in the Kingdom of Bahrain, with drilling anticipated to commence in the second half of 2025.  The transaction, which includes a concession agreement with the Kingdom of Bahrain, is subject to further government approvals, which the parties anticipate receiving in the second half of 2025.\nIn November 2021, a subsidiary of EOG was granted an exploration permit for the WA-488-P Block, located offshore Western Australia.  The company has deferred drilling plans to further evaluate the prospect.  \nEOG continues to evaluate other select exploration, development and exploitation opportunities outside the United States, primarily by pursuing opportunities in countries where crude oil and natural gas reserves have been identified.\nCapital Structure\nOne of management's key strategies is to maintain a strong balance sheet with a consistently below average debt-to-total capitalization ratio as compared to those in EOG's peer group.  EOG's debt-to-total capitalization ratio was 14% at December 31, 2024 and 12% at December 31, 2023.  As used in this calculation, total capitalization represents the sum of total current and long-term debt and total stockholders' equity.  \nAt December 31, 2024, EOG maintained a strong financial and liquidity position, including $7.1 billion of cash and cash equivalents on hand and $1.9 billion of availability under its senior unsecured revolving credit facility (discussed below).    \nOn November 21, 2024, EOG closed on its offering of $1.0 billion aggregate principal amount of its 5.650% Senior Notes due 2054 (the Notes).  EOG received net proceeds of $985 million from the issuance of the Notes, which will be used for general corporate purposes, including (i) the repayment of the $500 million aggregate principal amount of 3.15% Senior Notes due 2025 and (ii) the funding of future capital expenditures.\nThe Internal Revenue Service previously announced tax relief related to 2024 severe weather events occurring in various Texas counties, including Harris County, where EOG's corporate offices are located.  The tax relief permitted eligible taxpayers to postpone certain tax filings and payments.  In February 2025, EOG paid approximately $700 million of such federal tax payments related to the 2024 tax year.\nDuring 2024, EOG funded $6.7 billion ($109 million of which was non-cash) in exploration and development and other property, plant and equipment expenditures (excluding asset retirement obligations), paid $2.1 billion in dividends to common stockholders and paid $3.2 billion to repurchase shares of common stock, primarily by utilizing net cash provided by its operating activities and cash on hand.\nTotal anticipated 2025 capital expenditures are estimated to range from approximately $6.0 billion to $6.4 billion, including exploration and development drilling, facilities, leasehold acquisitions, capitalized interest, dry hole costs and other property, plant and equipment and excluding property acquisitions, asset retirement costs, non-cash exchanges and transactions and exploration costs incurred as operating expenses.  The majority of 2025 expenditures will be focused on United States crude oil drilling activities.  EOG has significant flexibility with respect to financing alternatives, including borrowings under its commercial paper program, bank borrowings, borrowings under its senior unsecured revolving credit facility, joint development agreements and similar agreements and equity and debt offerings.\nManagement continues to believe EOG has one of the strongest prospect inventories in EOG's history.  When it fits EOG's strategy, EOG will make acquisitions that bolster existing drilling programs or offer incremental exploration and/or production opportunities.  \nCash Return Framework.\n  In November 2023, EOG announced an increase in its cash return commitment - specifically, a commitment, effective beginning with fiscal year 2024, to return a minimum of 70% of annual net cash provided by operating activities before certain balance sheet-related changes, less total capital expenditures, to stockholders through a combination of quarterly dividends, special dividends and share repurchases.  For discussion regarding EOG's payment of dividends and share repurchases, see ITEM 1A, Risk Factors, and ITEM 5, Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\n37\nDividend Declarations.  \nOn February 22, 2024, the Board of Directors (Board) declared a quarterly cash dividend on the common stock of $0.91 per share paid on April 30, 2024, to stockholders of record as of April 16, 2024.\nOn May 2, 2024, the Board declared a quarterly cash dividend on the common stock of $0.91 per share paid on July 31, 2024, to stockholders of record as of July 17, 2024.\nOn August 1, 2024, the Board declared a quarterly cash dividend on the common stock of $0.91 per share paid on October 31, 2024, to stockholders of record as of October 17, 2024.\nOn November 7, 2024, the Board increased the quarterly cash dividend on the common stock from the previous $0.91 per share to $0.975 per share, effective beginning with the dividend paid on January 31, 2025, to stockholders of record as of January 17, 2025.\nOn February 27, 2025, the Board declared a quarterly cash dividend on the common stock of $0.975 per share to be paid on April 30, 2025, to stockholders of record as of April 16, 2025.\nResults of Operations\nThis section discusses certain year-to-year comparisons between 2024 and 2023, which should be read in conjunction with the consolidated financial statements of EOG and notes thereto beginning on page F-1.  For discussion of certain year-to-year comparisons between 2023 and 2022, see \"Management’s Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of EOG's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed on February 22, 2024, which is incorporated herein by reference.\nOperating Revenues and Other\nDuring 2024, operating revenues decreased $488 million, or 2%, to $23,698 million from $24,186 million in 2023.  Total revenues from sales of EOG's production of crude oil and condensate, NGLs and natural gas, increased $202 million, or 1%, to $17,578 million in 2024 from $17,376 million in 2023.  Revenues from the sales of crude oil and condensate and NGLs in 2024 were 91% of total revenues from sales of crude oil and condensate, NGLs and natural gas compared to 90% in 2023.  During 2024, EOG recognized net gains on the mark-to-market of financial commodity and other derivative contracts of $204 million compared to net gains of $818 million in 2023.  Gathering, processing and marketing revenues decreased $6 million during 2024, to $5,800 million from $5,806 million in 2023.  EOG recognized net gains on asset dispositions of $16 million in 2024 compared to net gains on asset dispositions of $95 million in 2023.\n38\nVolume and price statistics for the years ended December 31, 2024, 2023 and 2022 were as follows:\nYear Ended December 31\n2024\n2023\n2022\nCrude Oil and Condensate Volumes (MBbld) \n(1)\nUnited States\n490.6 \n475.2 \n460.7 \nTrinidad\n0.8 \n0.6 \n0.6 \nTotal\n491.4\n \n475.8\n \n461.3\n \nAverage Crude Oil and Condensate Prices ($/Bbl) \n(2)\n \n \nUnited States\n$\n77.42 \n$\n79.18 \n$\n97.22 \nTrinidad\n64.43 \n68.58 \n86.16 \nComposite\n77.40\n \n79.17\n \n97.21\n \nNatural Gas Liquids Volumes (MBbld) \n(1)\nUnited States\n245.9 \n223.8 \n197.7 \nTotal\n245.9\n \n223.8\n \n197.7\n \nAverage Natural Gas Liquids Prices ($/Bbl) \n(2)\n \n \nUnited States\n$\n23.40 \n$\n23.07 \n$\n36.70 \nComposite\n23.40\n \n23.07\n \n36.70\n \nNatural Gas Volumes (MMcfd) \n(1)\nUnited States\n1,728 \n1,551 \n1,315 \nTrinidad\n220 \n160 \n180 \nTotal\n1,948\n \n1,711\n \n1,495\n \nAverage Natural Gas Prices ($/Mcf) \n(2)\n \n \nUnited States\n$\n1.99 \n$\n2.70 \n$\n7.27 \nTrinidad\n3.65 \n3.65 \n4.43 \n(4)\nComposite\n2.17\n \n2.79\n \n6.93\n \nCrude Oil Equivalent Volumes (MBoed) \n(3)\nUnited States\n1,024.5 \n957.5 \n877.5 \nTrinidad\n37.6 \n27.3 \n30.7 \nTotal\n1,062.1\n \n984.8\n \n908.2\n \nTotal MMBoe \n(3)\n388.7\n \n359.4\n \n331.5\n \n(1)    Thousand barrels per day or million cubic feet per day, as applicable.\n(2)\nDollars per barrel or per thousand cubic feet, as applicable.  Excludes the impact of financial commodity and other derivative instruments (see Note 12 to Consolidated Financial Statements).\n(3)\nThousand barrels of oil equivalent per day or million barrels of oil equivalent, as applicable; includes crude oil and condensate, NGLs and natural gas.  Crude oil equivalent volumes are determined using a ratio of 1.0 barrel of crude oil and condensate or NGLs to 6.0 thousand cubic feet of natural gas.  MMBoe is calculated by multiplying the MBoed amount by the number of days in the period and then dividing that amount by one thousand.\n(4)\nIncludes positive revenue adjustment of $0.76 per Mcf ($0.09 per Mcf of EOG's composite natural gas price) for the twelve months ended December 31, 2022, related to a price adjustment per a provision of the natural gas sales contract with NGC amended in July 2022 for natural gas sales during the period from September 2020 through June 2022.\n39\nCrude oil and condensate revenues in 2024 increased $173 million, or 1%, to $13,921 million from $13,748 million in 2023, primarily due to an increase in production ($491 million), partially offset by a lower composite average crude oil and condensate price ($318 million).  EOG's composite crude oil and condensate price for 2024 decreased 2% to $77.40 per barrel compared to $79.17 per barrel in 2023.  Crude oil and condensate production in 2024 increased 3% to 491 MBbld as compared to 476 MBbld in 2023.  The increased production was primarily in the Permian Basin and Utica.\nNGLs revenues in 2024 increased $222 million, or 12%, to $2,106 million from $1,884 million in 2023 primarily due to an increase in production ($192 million) and a higher composite average NGLs price ($30 million).  EOG's composite average NGLs price increased 1% to $23.40 per barrel in 2024 compared to $23.07 per barrel in 2023.  NGLs production in 2024 increased 10% to 246 MBbld as compared to 224 MBbld in 2023.  The increased production was primarily in the Permian Basin.\nNatural gas revenues in 2024 decreased $193 million, or 11%, to $1,551 million from $1,744 million in 2023 primarily due to a lower composite natural gas price ($435 million), partially offset by an increase in natural gas deliveries ($242 million).  EOG's composite average natural gas price decreased 22% to $2.17 per Mcf in 2024 compared to $2.79 per Mcf in 2023.  Natural gas deliveries in 2024 increased 14% to \n1,948\n MMcfd as compared to \n1,711\n MMcfd in 2023.  The increase in production was primarily due to increased production of associated natural gas from the Permian Basin and higher natural gas deliveries in Trinidad.\nDuring 2024, EOG recognized net gains on the mark-to-market of financial commodity and other derivative contracts of $204 million, which included net cash received from settlements of natural gas financial commodity derivative contracts of $214 million.  The net gains of $204 million included gains of $110 million related to the Brent crude oil (Brent) linked gas sales contract.  During 2023, EOG recognized net gains on the mark-to-market of financial commodity and other derivative contracts of $818 million, which included net cash paid for settlements of crude oil, NGLs and natural gas financial commodity derivative contracts of $112 million.  \nGathering, processing and marketing revenues are revenues generated from sales of third-party crude oil, NGLs and natural gas, as well as fees associated with gathering third-party natural gas and revenues from sales of EOG-owned sand.  Purchases and sales of third-party crude oil and natural gas may be utilized in order to balance firm capacity at third-party facilities with production in certain areas and to utilize excess capacity at EOG-owned facilities.  EOG sells sand primarily in order to balance the timing of firm purchase agreements with completion operations.  Marketing costs represent the costs to purchase third-party crude oil, natural gas and sand and the associated transportation costs, as well as costs associated with EOG-owned sand sold to third parties.\nGathering, processing and marketing revenues less marketing costs in 2024 decreased $14 million compared to 2023, primarily due to lower margins on sand sales and natural gas marketing activities, partially offset by higher margins on crude oil marketing activities.  \nOperating and Other Expenses\nDuring 2024, operating expenses of $15,616 million were $1,033 million higher than the $14,583 million incurred during 2023.\n \n The following table presents the costs per barrel of oil equivalent (Boe) for the years ended December 31, 2024 and 2023:\n \n2024\n2023\nLease and Well\n$\n4.04 \n$\n4.05 \nGathering, Processing and Transportation Costs (GP&T)\n4.43 \n4.50 \nDepreciation, Depletion and Amortization (DD&A) -\nOil and Gas Properties\n10.04 \n9.24 \nOther Property, Plant and Equipment\n0.53 \n0.48 \nGeneral and Administrative (G&A)\n1.72 \n1.78 \nInterest Expense, Net\n0.36 \n0.41 \nTotal \n(1)\n$\n21.12\n \n$\n20.46\n \n(1)\nTotal excludes exploration costs, dry hole costs, impairments, marketing costs and taxes other than income.\n40\nThe primary factors impacting the cost components of per-unit rates of lease and well, GP&T, DD&A, G&A and interest expense, net for 2024 compared to 2023 are set forth below.  See \"Operating Revenues and Other\" above for a discussion of volumes.\nLease and well expenses include expenses for EOG-operated properties, as well as expenses billed to EOG from other operators where EOG is not the operator of a property.  Lease and well expenses can be divided into the following categories: costs to operate and maintain crude oil and natural gas wells, the cost of workovers and lease and well administrative expenses.  Operating and maintenance costs include, among other things, pumping services, produced water disposal, equipment repair and maintenance, compression expense, lease upkeep and fuel and power.  Workovers are operations to restore or maintain production from existing wells.\nEach of these categories of costs individually fluctuates from time to time as EOG attempts to maintain and increase production while maintaining efficient, safe and environmentally responsible operations.  EOG continues to increase its operating activities by drilling new wells in existing and new areas.  Operating and maintenance costs within these existing and new areas, as well as the costs of services charged to EOG by vendors, fluctuate over time. \nLease and well expenses of $1,572 million in 2024 increased $118 million from $1,454 million in 2023 primarily due to increased operating and maintenance costs ($81 million), increased lease and well administrative expenses ($27 million) and increased workovers expenditures ($13 million), all in the United States.  Lease and well expenses increased in the United States primarily due to increased operating activities resulting from increased production.\nGP&T costs represent costs to process and deliver hydrocarbon products from the lease to a downstream point of sale.  GP&T costs include operating and maintenance expenses from EOG-owned assets, fees paid to third-party operators and administrative expenses associated with operating EOG's GP&T assets.  EOG pays third parties to process the majority of its natural gas production to extract NGLs.\nGP&T costs increased $102 million to $1,722 million in 2024 compared to $1,620 million in 2023 primarily due to increased production in the Permian Basin ($91 million) and the Utica ($35 million), partially offset by decreased costs in the Powder River Basin due to reduced operating and maintenance expenses ($17 million), the Eagle Ford play due to lower volumes and reduced third-party fees ($11 million) and the Barnett Shale due to lower gas volumes and operating costs ($5 million).\nDD&A of the cost of proved oil and gas properties is calculated using the unit-of-production method.  EOG's DD&A rate and expense are the composite of numerous individual DD&A group calculations.  There are several factors that can impact EOG's composite DD&A rate and expense, such as field production profiles, drilling or acquisition of new wells, disposition of existing wells and reserve revisions (upward or downward) primarily related to well performance, economic factors and impairments.  Changes to these factors may cause EOG's composite DD&A rate and expense to fluctuate from period to period.  DD&A of the cost of other property, plant and equipment is generally calculated using the straight-line depreciation method over the useful lives of the assets. \nDD&A expenses in 2024 increased $616 million to $4,108 million from $3,492 million in 2023.  DD&A expenses associated with oil and gas properties in 2024 were $583 million higher than in 2023.  The increase primarily reflects increased production in the United States ($233 million) and Trinidad ($26 million), and increased unit rates in the United States ($166 million) and in Trinidad ($35 million).  In addition, the recording of an adjustment to DD&A ($117 million) primarily related to natural gas production used by EOG's domestic gathering systems also contributed to the variance.  DD&A expenses associated with other property, plant and equipment in 2024 were $33 million higher than in 2023 primarily due to an increase in expense related to GP&T assets and equipment.\nG&A expenses of $669 million in 2024 increased $29 million from $640 million in 2023 primarily due to a net increase in costs associated with corporate support activities, including employee-related expenses and information systems.\nInterest expense, net of $138 million in 2024 decreased $10 million from $148 million in 2023 primarily due to an increase in capitalized interest ($12 million) and the repayment in March 2023 of the $1,250 million aggregate principal amount of 2.625% Senior Notes due 2023 ($7 million), partially offset by the issuance in November 2024 of the $1,000 million aggregate principal amount of 5.650% Senior Notes due 2054 ($7 million).\nExploration costs of $174 million in 2024 decreased $7 million from $181 million in 2023 primarily due to decreased geological and geophysical expenditures in the United States ($22 million), partially offset by increased administrative expenses ($9 million) and increased delay rentals ($6 million).\n41\nImpairments include: amortization of individually insignificant unproved oil and gas property costs as well as impairments of proved oil and gas properties; other property, plant and equipment; individually significant unproved oil and gas property costs; and other assets.  Unproved properties with acquisition costs that are not individually significant are aggregated, and the portion of such costs estimated to be nonproductive is amortized over the remaining lease term.  Unproved properties with individually significant acquisition costs are reviewed individually for impairment.  When circumstances indicate that proved oil and gas properties may be impaired, EOG compares expected undiscounted future cash flows at a DD&A group level to the unamortized capitalized cost of the group.  If the expected undiscounted future cash flows, based on EOG's estimate of (and assumptions regarding) future crude oil, NGLs and natural gas prices, operating costs, development expenditures, anticipated production from proved reserves and other relevant data (all Level 3 inputs as defined by the FASB's Fair Value Measurement Topic of the ASC (ASC 820)), are lower than the unamortized capitalized cost, the capitalized cost is reduced to fair value.  Fair value is generally calculated using the Income Approach described in ASC 820.  In certain instances, EOG utilizes accepted offers from third-party purchasers as the basis for determining fair value.\nThe following table represents impairments for the years ended December 31, 2024 and 2023 (in millions):\n \n2024\n2023\nProved properties\n$\n295 \n$\n44 \nUnproved properties\n63 \n125 \nOther assets\n31 \n31 \nFirm commitment contracts\n2 \n2 \nTotal\n$\n391\n \n$\n202\n \nImpairments of proved properties for the year ended December 31, 2024, were primarily due to the write-down to fair value of  natural gas and crude oil assets in the Rocky Mountain area.\nTaxes other than income include severance/production taxes, ad valorem/property taxes, payroll taxes, franchise taxes and other miscellaneous taxes.  Severance/production taxes are generally determined based on revenues from sales of crude oil and condensate, NGLs and natural gas, and ad valorem/property taxes are generally determined based on the valuation of the underlying assets.\nTaxes other than income in 2024 decreased $35 million to $1,249 million (7.1% of revenues from sales of crude oil and condensate, NGLs and natural gas) from $1,284 million (7.4% of revenues from sales of crude oil and condensate, NGLs and natural gas) in 2023.  The decrease in taxes other than income was primarily due to increased state severance tax refunds ($18 million), decreased ad valorem/property taxes ($14 million) and decreased severance/production taxes ($5 million), all in the United States.\nOther income, net, was $274 million in 2024 compared to other income, net, of $234 million in 2023. The increase of $40 million in 2024 was primarily due to an increase in interest income.\nIncome taxes of $1,815 million in 2024 decreased from income taxes of $2,095 million in 2023 primarily due to decreased pretax income.  The net effective tax rate for 2024 was unchanged from the prior year rate of 22%.  \n42\nCapital Resources and Liquidity\nCash Flow\nThe primary sources of cash for EOG during the three-year period ended December 31, 2024, were funds generated from operations and, to a lesser extent, net proceeds from the issuance of long-term debt and proceeds from asset sales.  The primary uses of cash were funds used in operations; exploration and development expenditures; dividend payments to stockholders; purchases of treasury stock; net cash paid for settlements of financial commodity derivative contracts; other property, plant and equipment expenditures; and repayment of debt.\nNet cash provided by operating activities of $12,143 million in 2024 increased $803 million from $11,340 million in 2023 primarily due to a decrease in net cash paid for income taxes ($450 million),  an increase in net cash received from settlements of financial commodity derivative contracts ($326 million), an increase in revenues from sales of crude oil and condensate, NGLs and natural gas ($202 million) and a decrease in net cash used in working capital and other assets and liabilities ($197 million), partially offset by the return in 2023 of cash collateral posted for financial commodity derivative contracts ($324 million) and an increase in cash operating expenses ($185 million).\nNet cash used in investing activities of $5,967 million in 2024 decreased by $373 million from $6,340 million in 2023 primarily due to a decrease in net cash used in working capital associated with investing activities ($677 million) and a decrease in additions to oil and gas properties ($32 million); partially offset by an increase in additions to other property, plant and equipment ($219 million) and a decrease in proceeds from the sales of assets ($117 million). \nNet cash used in financing activities of $4,361 million in 2024 included purchases of treasury stock ($3,246 million), cash dividend payments ($2,087 million) and repayment of finance lease liabilities ($33 million).  Cash provided by financing activities in 2024 included long-term debt borrowings ($985 million) and proceeds from stock options exercised and employee stock purchase plan activity ($22 million).  \n43\nTotal Expenditures\nThe table below sets out components of total expenditures for the years ended December 31, 2024, 2023 and 2022 (in millions):\n \n2024\n2023\n2022\nExpenditure Category\nCapital\nExploration and Development Drilling \n(1)\n$\n4,534 \n$\n4,803 \n$\n3,675 \nFacilities\n606 \n520 \n411 \nLeasehold Acquisitions \n(2)\n230 \n207 \n186 \nProperty Acquisitions \n(3)\n33 \n16 \n419 \nCapitalized Interest\n45 \n33 \n36 \nSubtotal\n5,448 \n5,579 \n4,727 \nExploration Costs\n174 \n181 \n159 \nDry Hole Costs\n14 \n1 \n45 \nExploration and Development Expenditures\n5,636 \n5,761 \n4,931 \nAsset Retirement Costs \n(4)\n(2)\n257 \n298 \nTotal Exploration and Development Expenditures\n5,634 \n6,018 \n5,229 \nOther Property, Plant and Equipment \n(5)\n1,019 \n800 \n381 \nTotal Expenditures\n$\n6,653\n \n$\n6,818\n \n$\n5,610\n \n(1)\nExploration and development drilling included $90 million related to non-cash development drilling in 2023.\n(2)\nLeasehold acquisitions included $85 million, $99 million and $127 million related to non-cash property exchanges in 2024, 2023 and 2022, respectively.\n(3)\nProperty acquisitions included $24 million, $6 million and $26 million related to non-cash property exchanges in 2024, 2023 and 2022, respectively.\n(4)\nAsset Retirement Costs for 2024 included a downward revision to asset retirement obligations of $83 million.\n(5)\nOther property, plant and equipment included $137 million related to the acquisition of a gathering and processing system in South Texas and $134 million related to the acquisition of a gathering and processing system in the Powder River Basin in 2024 and 2023, respectively.  \nExploration and development expenditures of $5,636 million for 2024 were $125 million lower than the prior year primarily due to decreased development drilling expenditures ($249 million), partially offset by increased facility expenditures ($86 million), increased leasehold acquisitions ($23 million) and increased property acquisitions ($17 million).  The 2024 exploration and development expenditures of $5,636 million included $4,944 million in development drilling and facilities, $614 million in exploration, $45 million in capitalized interest and $33 million in property acquisitions.  The 2023 exploration and development expenditures of $5,761 million included $5,101 million in development drilling and facilities, $611 million in exploration, $33 million in capitalized interest and $16 million in property acquisitions.\n \nThe 2022 exploration and development expenditures of $4,931 million included $3,962 million in development drilling and facilities, $514 million in exploration, $419 million in property acquisitions and $36 million in capitalized interest.\nThe level of exploration and development expenditures, including acquisitions, will vary in future periods depending on energy market conditions and other economic factors.  EOG believes it has significant flexibility and availability with respect to financing alternatives and the ability to adjust its exploration and development expenditure budget as circumstances warrant.  While EOG has certain continuing commitments associated with expenditure plans related to its operations, such commitments are not expected to be material when considered in relation to the total financial capacity of EOG.  Further, EOG believes that its sources of liquidity are adequate for other near-term and long-term funding requirements, including its cash return commitment, debt service obligations, repayments of debt maturities and other commitment and contingencies.\n \nHowever, the adequacy of liquidity sources could be impacted by various factors, including general economic and market conditions, volatility in commodity prices or financial and capital markets and regulatory and other factors discussed in this report under Item 1A, Risk Factors.\n44\nFinancial Commodity and Other Derivative Transactions\nPresented below is a comprehensive summary of EOG's financial commodity derivative contracts settled during the year ended December 31, 2024 (closed) and remaining for 2025, as of February 21, 2025.  Natural gas volumes are presented in MMBtu per day (MMBtud) and prices are presented in dollars per MMBtu ($/MMBtu).\nNatural Gas Financial Price Swap Contracts\nContracts Sold\nPeriod\nSettlement Index\nVolume\n(MMBtud in thousands)\nWeighted Average\nPrice ($/MMBtu)\nJanuary - December 2024 (closed)\nNYMEX Henry Hub\n725 \n3.07 \nJanuary - February 2025 (closed) \nNYMEX Henry Hub\n725 \n3.07 \nMarch - December 2025\nNYMEX Henry Hub\n725 \n3.07 \nNatural Gas Basis Swap Contracts\nContracts Sold\nPeriod\nSettlement Index\nVolume\n(MMBtud in thousands)\nWeighted Average\nPrice Differential\n($/MMBtu)\nJanuary - December 2024 (closed)\nNYMEX Henry Hub HSC Differential \n(1)\n10 \n0.00 \nJanuary - February 2025 (closed)\nNYMEX Henry Hub HSC Differential\n10 \n0.00 \nMarch - December 2025\nNYMEX Henry Hub HSC Differential\n10 \n0.00 \n_________________\n(1)    This settlement index is used to fix the differential between pricing at the Houston Ship Channel and NYMEX Henry Hub prices.\nNatural Gas Sales Linked to Brent Crude Oil\n.\n \nIn February 2024, EOG entered into a 10-year agreement, commencing in 2027, to sell 180,000 MMBtud of its domestic natural gas production, with 140,000 MMBtud to be sold at a price indexed to Brent crude oil (Brent) and the remaining volumes to be sold at a price indexed to Brent or a U.S. Gulf Coast gas index.\n \nIt was determined that this agreement meets the definition of a derivative under the Derivatives and Hedging Topic of the ASC and does not qualify for the normal purchases and normal sales scope exception.\n \nAs such, this agreement is accounted for as a derivative using the mark-to-market accounting method.\n \nChanges in the fair value are recognized as gains or losses in the period of change on the Consolidated Statements of Income and Comprehensive Income.\nFinancing\nEOG's debt-to-total capitalization ratio was 14% at December 31, 2024, compared to 12% at December 31, 2023.  As used in this calculation, total capitalization represents the sum of total current and long-term debt and total stockholders' equity.\nAt December 31, 2024 and 2023, respectively, EOG had outstanding $4,640 million and $3,640 million aggregate principal amount of senior notes, which had estimated fair values of $4,441 million and $3,574 million, respectively.  The estimated fair value of debt was based upon quoted market prices and, where such prices were not available, other observable inputs regarding interest rates available to EOG at year-end.  EOG's debt is at fixed interest rates.  While changes in interest rates affect the fair value of EOG's senior notes, such changes do not expose EOG to material fluctuations in earnings or cash flow.\nDuring 2024, EOG funded its capital program and operations by utilizing cash provided by operating activities and cash on hand.  While EOG maintains a $1.9 billion senior unsecured revolving credit facility to back its commercial paper program, there were no borrowings outstanding at any time during 2024 and the amount outstanding at year-end was zero.  EOG considers the availability of its $1.9 billion senior unsecured revolving credit facility, as described in Note 2 to Consolidated Financial Statements, to be sufficient to meet its ongoing operating needs.\n45\nOutlook\nPricing.\n  Crude oil, NGLs and natural gas prices have been volatile, and this volatility is expected to continue.  As a result of the many uncertainties associated with the world economic and political environment, worldwide supplies of, and demand for, crude oil and condensate, NGLs and natural gas, the availability of other energy supplies, the relative competitive relationships of the various energy sources in the view of consumers and other factors, EOG is unable to predict what changes may occur in crude oil and condensate, NGLs, natural gas, ammonia and methanol prices in the future.  The market price of crude oil and condensate, NGLs and natural gas in 2025 will impact the amount of cash generated from EOG's operating activities, which will in turn impact EOG's financial position.  As of February 21, 2025, the average 2025 NYMEX crude oil and natural gas prices were $69.58 per barrel and $4.26 per MMBtu, respectively, representing a decrease of 8% for crude oil and an increase of 88% for natural gas from the average NYMEX prices in 2024.  See ITEM 1A, Risk Factors for additional discussion of the impact of commodity prices (including fluctuations in commodity prices) on our financial condition, cash flows and results of operations.\nBased on EOG's tax position, EOG's price sensitivity in 2025 for each $1.00 per barrel increase or decrease in crude oil and condensate price, combined with the estimated change in NGLs price, is approximately $159 million for net income and $204 million for pretax cash flows from operating activities.  Including the impact of EOG's natural gas financial derivative contracts and based on EOG's tax position and the portion of EOG's anticipated natural gas volumes for 2025 for which prices have not been determined under long-term marketing contracts, EOG's price sensitivity for each $0.10 per Mcf increase or decrease in natural gas price is approximately $33 million for net income and $42 million for pretax cash flows from operating activities.  For information regarding EOG's crude oil, NGLs and natural gas financial commodity derivative contracts through February 21, 2025, see \"Financial Commodity and Other Derivative Transactions\" above.\nCapital.  \nEOG plans to continue to focus a substantial portion of its exploration and development expenditures in its major producing areas in the United States.  In particular, EOG will be focused on United States drilling activity in the Delaware Basin play, Eagle Ford play, Dorado gas play and Utica play where it generates its highest rates-of-return.  To further enhance the economics of these plays, EOG expects to continue to improve well performance and mitigate any future inflationary pressures (such as from tariffs) through efficiency gains and by locking in certain service costs for drilling and completion activities.  In addition, EOG expects to spend a portion of its anticipated 2025 capital expenditures on leasing acreage, evaluating new prospects, gathering and processing infrastructure, transportation infrastructure and environmental projects.  \n \nThe total anticipated 2025 capital expenditures of approximately $6.0 billion to $6.4 billion, including exploration and development drilling, facilities, leasehold acquisitions, capitalized interest, dry hole costs and other property, plant and equipment and excluding property acquisitions, asset retirement costs, non-cash exchanges and transactions and exploration costs incurred as operating expenses, is structured to maintain EOG's strategy of capital discipline by funding its exploration, development\n \nand exploitation activities primarily from available internally generated cash flows and cash on hand.  EOG has significant flexibility with respect to financing alternatives, including borrowings under its commercial paper program, bank borrowings, borrowings under its $1.9 billion senior unsecured revolving credit facility and equity and debt offerings.\n \nOperations. \n In 2025, crude oil and total crude oil equivalent production are expected to increase from 2024 levels.  In 2025, EOG expects to continue to focus on mitigating any future inflationary pressures (such as from tariffs) on operating costs through efficiency improvements.\n46\nCash Requirements.\n  Certain of EOG's capital expenditures and operating costs are subject to contracts with minimum commitments, including those that meet the definition of a lease under ASC \"Leases (Topic 842)\".  In 2025, EOG anticipates the following cash requirements under these commitments (in millions):\nFinance Leases \n(1)\n$\n35 \nOperating Leases \n(1)\n355\nLeases Effective, Not Commenced \n(1)\n13\nTransportation and Storage Service Commitments \n(2) (3)\n888\nPurchase and Service Obligations \n(3)\n632\nTotal Cash Requirements\n$\n1,923\n \n(1)    For more information on contracts that meet the definition of a lease under ASC \"Leases (Topic 842),\" see Note 17 to Consolidated Financial Statements.\n(2)    Amounts exclude transportation and storage service commitments that meet the definition of a lease.  Amounts shown are based on current transportation and storage rates and the foreign currency exchange rates used to convert Canadian dollars into United States dollars at December 31, 2024.  Management does not believe that any future changes in these rates before the expiration dates of these commitments will have a material adverse effect on the financial condition or results of operations of EOG.\n(3)    For more information on transportation and storage service commitments and purchase and service obligations, see Note 8 to Consolidated Financial Statements.\nIn 2025, EOG has $500 million aggregate principal amount of senior notes maturing, which are expected to be repaid with proceeds from its November 2024 Notes offering discussed above.  Additionally in 2025, EOG expects to pay interest of $209 million on senior notes.  For more information on EOG's current and long-term debt, see Note 2 to Consolidated Financial Statements.\nCash requirements to settle the liability for EOG's pension and postretirement benefit obligations and the liability for dismantlement, abandonment and asset retirement obligations (see Notes 7 and 15, respectively, to Consolidated Financial Statements) are excluded because they are subject to estimates and the timing of settlement is unknown.\nEOG expects to fund its exploration, development and exploitation activities and other cash requirements, both in 2025 and in future years, primarily from internally generated cash flows and cash on hand.  As discussed above, EOG has significant flexibility with respect to financing alternatives, including borrowings under its commercial paper program, bank borrowings, borrowings under its $1.9 billion senior unsecured revolving credit facility and equity and debt offerings.\nSummary of Critical Accounting Policies and Estimates\nEOG prepares its financial statements and the accompanying notes in conformity with accounting principles generally accepted in the United States, which require management to make estimates and assumptions about future events that affect the reported amounts in the financial statements and the accompanying notes.  EOG identifies certain accounting policies and estimates as critical based on, among other things, their impact on EOG's financial condition, results of operations or liquidity, and the degree of difficulty, subjectivity and complexity in their application.  Critical accounting policies and estimates cover accounting matters that are inherently uncertain because the future resolution of such matters is unknown.  Management routinely discusses the development, selection and disclosure of each of the critical accounting policies and estimates.  Following is a discussion of EOG's most critical accounting policies and estimates:\nProved Oil and Gas Reserves\nEOG's engineers estimate proved oil and gas reserves in accordance with United States Securities and Exchange Commission (SEC) regulations, which directly impact financial accounting estimates, including depreciation, depletion and amortization and impairments of proved properties and related assets.  Proved reserves represent estimated quantities of crude oil and condensate, NGLs and natural gas that geological and engineering data demonstrate, with reasonable certainty, to be recoverable in future years from known reservoirs under economic and operating conditions existing at the time the estimates were made.  \n47\nThe process of estimating quantities of proved oil and gas reserves is complex, requiring significant subjective decisions in the evaluation of available geological, engineering and economic data for each reservoir.  The data for a given reservoir may also change substantially over time as a result of numerous factors including, but not limited to, additional development activity, evolving production history, crude oil and condensate, NGLs and natural gas prices, continual reassessment of the viability of production under varying economic conditions and improvements and other changes in geological, geophysical and engineering evaluation methods.  Proved reserves are estimated using a trailing 12-month average price, in accordance with SEC rules.  Crude oil, NGLs and natural gas prices have exhibited significant volatility in the past, and EOG expects that volatility to continue in the future.  Consequently, material revisions (upward or downward) to existing reserve estimates may occur from time to time.  For related discussion, see ITEM 1A, Risk Factors, and \"Supplemental Information to Consolidated Financial Statements.\"\nDepreciation, Depletion and Amortization for Oil and Gas Properties\nThe quantities of estimated proved oil and gas reserves are a significant component of EOG's calculation of depreciation, depletion and amortization expense, and revisions in such estimates may alter the rate of future expense. Holding all other factors constant, if reserves are revised upward or downward, earnings will increase or decrease, respectively.\nDepreciation, depletion and amortization of the cost of proved oil and gas properties is calculated using the unit-of-production method.  The reserve base used to calculate depreciation, depletion and amortization for leasehold acquisition costs and the cost to acquire proved properties is the sum of proved developed reserves and proved undeveloped reserves.  With respect to lease and well equipment costs, which include development costs and successful exploration drilling costs, the reserve base used includes only proved developed reserves.  \nImpairments\nOil and gas lease acquisition costs are capitalized when incurred.  Unproved properties with acquisition costs that are not individually significant are aggregated, and the portion of such costs estimated to be nonproductive is amortized over the remaining lease term.  Unproved properties with individually significant acquisition costs are reviewed individually for impairment.  If the unproved properties are determined to be productive, the appropriate related costs are transferred to proved oil and gas properties.  \nWhen circumstances indicate that proved oil and gas properties may be impaired, EOG compares expected undiscounted future cash flows at a DD&A group level to the unamortized capitalized cost of the group.  If the expected undiscounted future cash flows, based on EOG's estimate of (and assumptions regarding) future crude oil, NGLs and natural gas prices, operating costs, development expenditures, anticipated production from proved reserves and other relevant data (all Level 3 inputs as defined by the FASB's Fair Value Measurement Topic of the ASC (ASC 820)), are lower than the unamortized capitalized cost, the capitalized cost is reduced to fair value.  Fair value is generally calculated using the Income Approach described in ASC 820.  In certain instances, EOG utilizes accepted offers from third-party purchasers as the basis for determining fair value.\nCrude oil, NGLs and natural gas prices have exhibited significant volatility in the past, and EOG expects that volatility to continue in the future.  During the five years ended December 31, 2024, WTI crude oil spot prices have fluctuated from approximately $(36.98) per barrel to $123.64 per barrel, and Henry Hub natural gas spot prices have ranged from approximately $1.21 per MMBtu to $23.86 per MMBtu.  Market prices for NGLs are influenced by the components extracted, including ethane, propane, butane and natural gasoline, among others, and the respective market pricing for each component.  \nEOG uses the five-year NYMEX futures strip for WTI crude oil and Henry Hub natural gas and the five-year Oil Price Information Services futures strip for NGLs components (in each case as of the applicable balance sheet date) as a basis to estimate future crude oil, NGLs and natural gas prices.  EOG's proved reserves estimates, including the timing of future production, are also subject to significant assumptions and judgment, and are frequently revised (upwards and downwards) as more information becomes available.  In the future, if any combination of crude oil prices, NGLs prices, natural gas prices or estimated proved reserves diverge negatively from EOG's current estimates, impairment charges may be necessary.\nThese estimates, which factor into EOG's unproved and proved property impairment calculations, involve the use of various assumptions and judgement.  Differing assumptions could impact the timing and amount of an impairment in any given period.  Any impairment will decrease earnings in the period in which it is recognized.  See Notes 13 and 14 to Consolidated Financial Statements for further disclosures of impairments of oil and gas properties and other assets.\n48\nInformation Regarding Forward-Looking Statements\nThis Annual Report on Form 10-K includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended.  All statements, other than statements of historical facts, including, among others, statements and projections regarding EOG's future financial position, operations, performance, business strategy, goals, returns and rates of return, budgets, reserves, levels of production, capital expenditures, operating costs and asset sales, statements regarding future commodity prices and statements regarding the plans and objectives of EOG's management for future operations, are forward‐looking statements.  EOG typically uses words such as \"expect,\" \"anticipate,\" \"estimate,\" \"project,\" \"strategy,\" \"intend,\" \"plan,\" \"target,\" \"aims,\" \"ambition,\" \"initiative,\" \"goal,\" \"may,\" \"will,\" \"focused on,\" \"should\" and \"believe\" or the negative of those terms or other variations or comparable terminology to identify its forward‐looking statements.  In particular, statements, express or implied, concerning EOG's future financial or operating results and returns or EOG's ability to replace or increase reserves, increase production, generate returns and rates of return, replace or increase drilling locations, reduce or otherwise control drilling, completion and operating costs and capital expenditures, generate cash flows, pay down or refinance indebtedness, achieve, reach or otherwise meet initiatives, plans, goals, ambitions or targets with respect to emissions, other environmental matters or safety matters, pay and/or increase regular and/or special dividends or repurchase shares are forward‐looking statements.  Forward-looking statements are not guarantees of performance.  Although EOG believes the expectations reflected in its forward-looking statements are reasonable and are based on reasonable assumptions, no assurance can be given that such assumptions are accurate or will prove to have been correct or that any of such expectations will be achieved (in full or at all) or will be achieved on the expected or anticipated timelines.  Moreover, EOG's forward-looking statements may be affected by known, unknown or currently unforeseen risks, events or circumstances that may be outside EOG's control.  Important factors that could cause EOG's actual results to differ materially from the expectations reflected in EOG's forward-looking statements include, among others:\n•\nthe timing, magnitude and duration of changes in prices for, supplies of, and demand for, crude oil and condensate, natural gas liquids (NGLs), natural gas and related commodities; \n•\nthe extent to which EOG is successful in its efforts to acquire or discover additional reserves; \n•\nthe extent to which EOG is successful in its efforts to (i) economically develop its acreage in, (ii) produce reserves and achieve anticipated production levels and rates of return from, (iii) decrease or otherwise control its drilling, completion and operating costs and capital expenditures related to, and (iv) maximize reserve recoveries from, its existing and future crude oil and natural gas exploration and development projects and associated potential and existing drilling locations;\n•\nthe success of EOG's cost-mitigation initiatives and actions in offsetting the impact of any inflationary or other pressures on EOG's operating costs and capital expenditures;\n•\nthe extent to which EOG is successful in its efforts to market its production of crude oil and condensate, NGLs and natural gas;\n•\nsecurity threats, including cybersecurity threats and disruptions to our business and operations from breaches of our information technology systems, physical breaches of our facilities and other infrastructure or breaches of the information technology systems, facilities and infrastructure of third parties with which we transact business, and enhanced regulatory focus on the prevention of, and disclosure requirements relating to, cyber incidents; \n•\nthe availability, proximity and capacity of, and costs associated with, appropriate gathering, processing, compression, storage, transportation, refining, liquefaction and export facilities and equipment; \n•\nthe availability, cost, terms and timing of issuance or execution of mineral licenses, concessions and leases and governmental and other permits and rights-of-way, and EOG's ability to retain mineral licenses, concessions and leases;\n•\nthe impact of, and changes in, government policies, laws and regulations, including climate change-related regulations, policies and initiatives (for example, with respect to air emissions); tax laws and regulations (including, but not limited to, carbon tax or other emissions-related legislation); environmental, health and safety laws and regulations relating to disposal of produced water, drilling fluids and other wastes, hydraulic fracturing and access to and use of water; laws and regulations affecting the leasing of acreage and permitting for oil and gas drilling and the calculation of royalty payments in respect of oil and gas production; laws and regulations imposing additional permitting and disclosure requirements, additional operating restrictions and conditions or restrictions on drilling and completion operations and on the transportation of crude oil, NGLs and natural gas; laws and regulations with respect to financial and other derivatives and hedging activities; and laws and regulations with respect to the import and export of crude oil, natural gas and related commodities; \n49\n•\nthe impact of climate change-related legislation, policies and initiatives; climate change-related political, social and shareholder activism; and physical, transition and reputational risks and other potential developments related to climate change;\n•\nthe extent to which EOG is able to successfully and economically develop, implement and carry out its emissions and other environmental or safety-related initiatives and achieve its related targets, goals, ambitions and initiatives;\n•\nEOG's ability to effectively integrate acquired crude oil and natural gas properties into its operations, identify and resolve existing and potential issues with respect to such properties and accurately estimate reserves, production, drilling, completion and operating costs and capital expenditures with respect to such properties;\n•\nthe extent to which EOG's third-party-operated crude oil and natural gas properties are operated successfully, economically and in compliance with applicable laws and regulations;\n•\ncompetition in the oil and gas exploration and production industry for the acquisition of licenses, concessions, leases and properties; \n•\nthe availability and cost of, and competition in the oil and gas exploration and production industry for, employees, labor and other personnel, facilities, equipment, materials (such as water, sand, fuel and tubulars) and services;\n•\nthe accuracy of reserve estimates, which by their nature involve the exercise of professional judgment and may therefore be imprecise;\n•\nweather and natural disasters, including its impact on crude oil and natural gas demand, and related delays in drilling and in the installation and operation (by EOG or third parties) of production, gathering, processing, refining, liquefaction, compression, storage, transportation, and export facilities;\n•\nthe ability of EOG's customers and other contractual counterparties to satisfy their obligations to EOG and, related thereto, to access the credit and capital markets to obtain financing needed to satisfy their obligations to EOG;\n•\nEOG's ability to access the commercial paper market and other credit and capital markets to obtain financing on terms it deems acceptable, if at all, and to otherwise satisfy its capital expenditure requirements;\n•\nthe extent to which EOG is successful in its completion of planned asset dispositions;\n•\nthe extent and effect of any hedging activities engaged in by EOG;\n•\nthe timing and extent of changes in foreign currency exchange rates, interest rates, inflation rates, global and domestic financial market conditions and global and domestic general economic conditions;\n•\nthe economic and financial impact of epidemics, pandemics or other public health issues;\n•\ngeopolitical factors and political conditions and developments around the world (such as the imposition of tariffs or trade or other economic sanctions, political instability and armed conflicts), including in the areas in which EOG operates;\n•\nthe extent to which EOG incurs uninsured losses and liabilities or losses and liabilities in excess of its insurance coverage; and\n•\nthe other factors described under ITEM 1A, Risk Factors of this Annual Report on Form 10-K and any updates to those factors set forth in EOG's subsequent Quarterly Reports on Form 10-Q or Current Reports on Form 8-K. \nIn light of these risks, uncertainties and assumptions, the events anticipated by EOG's forward-looking statements may not occur, and, if any of such events do, we may not have anticipated the timing of their occurrence or the duration or extent of their impact on our actual results.  Accordingly, you should not place any undue reliance on any of EOG's forward-looking statements.  EOG's forward-looking statements speak only as of the date made, and EOG undertakes no obligation, other than as required by applicable law, to update or revise its forward-looking statements, whether as a result of new information, subsequent events, anticipated or unanticipated circumstances or otherwise.\n50",
  "item2": null
}