{
  "source_file": "epam-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion and analysis of our financial condition and results of operations together with our Annual Report on Form 10-K for the year ended December 31, 2024 and the unaudited condensed consolidated financial statements and the related notes included elsewhere in this quarterly report. In addition to historical information, this discussion contains forward-looking statements that involve risks, uncertainties and assumptions that could cause actual results to differ materially from management’s expectations. Factors that could cause such differences are discussed in the sections entitled “Forward-Looking Statements” in this item and in “Part I. Item 1A. Risk Factors” in our Annual Report on Form 10-K for the year ended December 31, 2024. We assume no obligation to update any of these forward-looking statements.\nIn this quarterly report, “EPAM,” “EPAM Systems, Inc.,” the “Company,” “we,” “us” and “our” refer to EPAM Systems, Inc. and its consolidated subsidiaries.\n“EPAM” is a trademark of EPAM Systems, Inc. All other trademarks and service marks used herein are the property of their respective owners.\nExecutive Summary\nWe have used our software engineering expertise to become a leading global provider of digital engineering, cloud and AI-enabled transformation services, as well as a leading business and experience consulting partner for global enterprises and ambitious startups. We address our clients’ transformation challenges by fusing EPAM Continuum’s integrated strategy, experience and technology consulting with our 30+ years of engineering execution to speed our clients’ time to market and drive greater value from their digital investments.\nWe leverage AI and GenAI to deliver transformative solutions that accelerate our clients' digital innovation and enhance their competitive edge. Through platforms like EPAM AI/RUN™ and initiatives like DIALX Lab™, we integrate advanced AI technologies into tailored business strategies, driving significant industry impact and fostering continuous innovation.\nThrough increased specialization in focused verticals and a continued emphasis on strategic partnerships, we are able to deliver technology transformation from start to finish, leveraging agile methodologies, proven client collaboration frameworks, engineering excellence tools, hybrid teams and our award-winning proprietary global delivery platform.\nOur clients depend on us to solve their complex technical challenges and rely on our expertise in core engineering, advanced technologies, digital design and intelligent enterprise development. We combine our software engineering heritage with strategic business and innovation consulting, design thinking, and physical-digital capabilities to deliver end-to-end digital transformation services for our clients. We focus on building long-term partnerships with our clients in a market that is constantly challenged by the pressures of digitization through our innovative strategy and scalable software solutions, integrated advisory, business consulting and experience design, and a continually evolving mix of advanced capabilities.\nOur global delivery model and centralized support functions, combined with the benefits of scale from the shared use of fixed-cost resources, enhance our productivity levels and enable us to better manage the efficiency of our global operations. As a result, we have created a delivery base whereby our applications, tools, methodologies and infrastructure allow us to seamlessly deliver services and solutions from our global delivery centers to our clients across the world. Our teams of consultants, designers, architects, engineers and trainers have the capabilities and skill sets to deliver business results.\nBusiness Update Regarding the War in Ukraine\nOn February 24, 2022, Russian forces attacked Ukraine and its people, and through the issuance date of these interim financial statements, there has been no resolution to this attack. EPAM’s highest priority is the safety and security of its employees and their families in Ukraine as well as in the broader region, and we have continued to support relocating our employees to lower risk locations, both within Ukraine and to other countries where we operate. The vast majority of our Ukraine employees are in safe locations and operating at levels of productivity consistent with those achieved prior to the attack. As of September 30, 2025, Ukraine continues to be a significant delivery location with a large number of delivery professionals. Furthermore, we have maintained our $100 million humanitarian aid commitment to our people in Ukraine in addition to our other donations and volunteer efforts, and as of September 30, 2025, we have $12.5 million remaining to be expensed under this humanitarian commitment. \n 34\nTable of contents\nThe impact of Russia’s invasion of Ukraine on our operations, personnel, and physical assets in Ukraine has had, and, along with any escalation of the war that includes Belarus’ territory or military, could continue to have a material adverse effect on our operations. Actions taken by other countries, including new and stricter sanctions by Canada, the United Kingdom, the European Union, the U.S. and other companies and organizations against officials, individuals, regions, and industries in Belarus, and Belarus’ responses to those sanctions, including counter-sanctions and other actions, have had and could continue to have a material adverse effect on our operations. Clients have and may continue to seek altered terms, conditions, and delivery locations for the performance of services, delay planned work or seek services from alternate providers, or suspend, terminate, fail to renew, or reduce existing contracts or services, which could have a material adverse effect on our financial condition. Some of our clients have implemented steps to block internet communications with Ukraine and Belarus to protect against potential cyberattacks or other information security threats, which has caused a material adverse effect on our ability to deliver our services to these clients from those locations. Such material adverse effects disrupt our delivery of services, cause us to shift all or portions of our work occurring in the region to other countries, restrict our ability to engage in certain projects in the region and serve certain clients in or from the region, and could negatively impact our personnel, operations, financial results and business outlook. Our Board of Directors and its committees continue their oversight of our strategic, geopolitical, and cybersecurity risks and the risks related to our geographic expansion. Our Board has received updates from management during both regular and special meetings, while also providing oversight of the risks associated with Russia’s invasion of Ukraine and other strategic areas of importance related to the war.\nMoving Forward\nWe continue to monitor and respond to the difficult conditions in Ukraine while maintaining a focus on our clients and long-term growth. We execute on our business continuity plans and adapt to developments as they occur to protect the safety of our people and address impacts on our delivery infrastructure, including reallocating work to other geographies within our global footprint. We engage with both our personnel and our clients when navigating delivery challenges while operating productively in a multitude of locations and providing consistent high-quality delivery to our clients. Our global delivery centers have sufficient resources, including infrastructure and capital, to support ongoing operations while continuing to focus on the safety and security of our employees and their families in Ukraine as well as in the broader region.\nThe implementation and execution of our business continuity plans, relocation costs, our humanitarian commitment to our people in Ukraine, and the cost of our phased exit from Russia resulted in materially increased expenses. Some of these expenses continued during this quarter and we expect some of these expenses will continue to occur in subsequent quarters for some time in the future.\nWe have no way to predict the progress or outcome of the war in Ukraine because the conflict and government reactions change quickly and are beyond our control. Prolonged military activities, broad-based sanctions and counter-sanctions, or escalation of the war that includes Belarus’ territory or military could have a material adverse effect on our operations and financial condition. The information contained in this section is accurate as of the date hereof but may become outdated due to changing circumstances beyond our control or present awareness. For additional information on the various risks posed by the attack against Ukraine and the impact in the region as well as other risks to our business, please read “Part I. Item 1A. Risk Factors” in our Annual Report on Form 10-K for the year ended December 31, 2024 and “Part II. Item 1A. Risk Factors” in this quarterly report.\nYear-to-Date 2025 Developments and Trends\n For the first nine months of 2025, our revenues were $4.050 billion, an increase of 16.4% from $3.480 billion reported for the same period of 2024. Revenues have been positively impacted by improving demand for our services, acquisitions completed in 2024, and foreign exchange fluctuations. Income from operations as a percentage of revenues decreased to 9.2% for the nine months ended September 30, 2025 as compared to 11.7% for the nine months ended September 30, 2024, largely driven by lower government incentives related to conducting R&D activities in Poland and an increase in cost of revenues (exclusive of depreciation and amortization) as a percentage of revenues. Diluted earnings per share decreased to $4.75 for the nine months ended September 30, 2025 from $6.04 for the nine months ended September 30, 2024, principally resulting from a decrease in income from operations as well as reduced excess tax benefits upon vesting or exercise of equity awards.\n 35\nTable of contents\nCritical Accounting Policies\nThe discussion and analysis of our financial position and results of operations is based on our unaudited condensed consolidated financial statements which have been prepared in accordance with U.S. GAAP. The preparation of these condensed consolidated financial statements in accordance with U.S. GAAP requires us to make estimates and judgments that may affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. On a recurring basis, we evaluate our estimates and judgments, including those related to revenue recognition and related allowances, impairments of long-lived assets including intangible assets, goodwill and right-of-use assets, income taxes including the valuation allowance for deferred tax assets, and stock-based compensation. Actual results may differ materially from these estimates under different assumptions and conditions. In addition, our reported financial condition and results of operations could vary due to a change in the application of a particular accounting standard. \nDuring the three and nine months ended September 30, 2025, there have been no material changes to our critical accounting policies as reported in our Annual Report on Form 10-K for the year ended December 31, 2024.\nResults of Operations\nThe following table sets forth a summary of our consolidated results of operations for the periods indicated. This information should be read together with our unaudited condensed consolidated financial statements and related notes included elsewhere in this quarterly report. The operating results in any period are not necessarily indicative of the results that may be expected for any future period.\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n(in thousands, except percentages and per share data)\nRevenues\n$\n1,394,373\n \n100.0\n \n%\n$\n1,167,527\n \n100.0\n \n%\n$\n4,049,508\n \n100.0\n \n%\n$\n3,479,589\n \n100.0\n \n%\nOperating expenses:\nCost of revenues (exclusive of depreciation and amortization)\n(1)\n983,169 \n70.5 \n%\n763,992 \n65.4 \n%\n2,899,189 \n71.6 \n%\n2,409,183 \n69.3 \n%\n Selling, general and administrative expenses\n(2)\n234,948 \n16.8 \n%\n206,820 \n17.7 \n%\n685,546 \n16.9 \n%\n599,331 \n17.2 \n%\nDepreciation and amortization expense\n31,313 \n2.3 \n%\n19,736 \n1.7 \n%\n94,024 \n2.3 \n%\n63,003 \n1.8 \n%\nIncome from operations\n144,943\n \n10.4\n \n%\n176,979\n \n15.2\n \n%\n370,749\n \n9.2\n \n%\n408,072\n \n11.7\n \n%\nInterest and other income, net\n2,302 \n0.2 \n%\n13,347 \n1.1 \n%\n11,635 \n0.2 \n%\n40,425 \n1.1 \n%\nForeign exchange loss\n(3,627)\n(0.3)\n%\n(710)\n(0.1)\n%\n(20,581)\n(0.5)\n%\n(1,416)\n— \n%\nIncome before provision for income taxes\n143,618\n \n10.3\n \n%\n189,616\n \n16.2\n \n%\n361,803\n \n8.9\n \n%\n447,081\n \n12.8\n \n%\nProvision for income taxes\n36,802 \n2.6 \n%\n53,270 \n4.5 \n%\n93,479 \n2.3 \n%\n95,847 \n2.7 \n%\nNet income\n$\n106,816\n \n7.7\n \n%\n$\n136,346\n \n11.7\n \n%\n$\n268,324\n \n6.6\n \n%\n$\n351,234\n \n10.1\n \n%\nEffective tax rate\n25.6 \n%\n28.1 \n%\n25.8 \n%\n21.4 \n%\nDiluted earnings per share\n$\n1.91 \n$\n2.37 \n$\n4.75 \n$\n6.04 \n(1)\nInclu\ndes $21,149 and $19,576 of stock-based compensation expense for the three months ended September 30, 2025 and 2024, respectively, and $63,233 and $58,870 of stock-based compensation expense for the nine months ended September 30, 2025 and 2024, respectively.\n(2)\nIncludes $23,455 and $22,548 of stock-based compensation expense for the three months ended September 30, 2025 and 2024, respectively, and $68,385 and $63,729 of stock-based compensation expense for the nine months ended September 30, 2025 and 2024, respectively.\n 36\nTable of contents\nConsolidated Results Review\nRevenues\nDuring the three months ended September 30, 2025, our total revenues increased by 19.4% to $1.394 billion compared to the corresponding period in 2024. During the three months ended September 30, 2025 as compared to the same period last year, revenues have been positively impacted by improving demand for our services, acquisitions completed in 2024 which contributed 10.5% to revenue growth, and fluctuations in foreign currency exchange rates which contributed 1.8% to revenue growth. \nRevenues by client location for the three and nine months ended September 30, 2025 and 2024 were as follows:\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(in thousands, except percentages)\n(in thousands, except percentages)\nAmericas\n(1)\n$\n808,630 \n58.0 \n%\n$\n697,167 \n59.7 \n%\n$\n2,390,348 \n59.0 \n%\n$\n2,081,286 \n59.8 \n%\nEMEA\n(2)\n555,739 \n39.9 \n%\n444,867 \n38.1 \n%\n1,577,663 \n39.0 \n%\n1,325,435 \n38.1 \n%\nAPAC\n(3)\n30,004 \n2.1 \n%\n25,493 \n2.2 \n%\n81,497 \n2.0 \n%\n72,868 \n2.1 \n%\nRevenues\n$\n1,394,373\n \n100.0\n \n%\n$\n1,167,527\n \n100.0\n \n%\n$\n4,049,508\n \n100.0\n \n%\n$\n3,479,589\n \n100.0\n \n%\n(1)\nAmericas includes revenues from clients in North, Central and South America.\n(2)\nEMEA includes revenues from clients in Europe and the Middle East. \n(3)\nAPAC includes revenues from clients in East Asia, Southeast Asia and Australia.\nDuring the three and nine months ended September 30, 2025, the United States continued to be our largest client location. During the three months ended September 30, 2025, revenues in the United States increased 7.4% to $716.2 million from $666.9 million in the third quarter of 2024, largely due to increased spending at certain large accounts in the region as well as revenues from our 2024 acquisitions. During the nine months ended September 30, 2025, revenues in the United States increased to $2.115 billion as compared to $1.997 billion in the same period of the prior year.\nDuring the three months ended September 30, 2025, the top three revenue contributing countries by client location in EMEA were the United Kingdom, Switzerland and Netherlands, generating $153.4 million, $113.3 million and $60.7 million in revenues, respectively compared to $126.0 million, $104.3 million, and $45.8 million, respectively, in the corresponding period last year. During the nine months ended September 30, 2025, the United Kingdom, Switzerland and Germany performed as EMEA’s top revenue generating locations and contributed $447.5 million, $328.2 million, and $168.4 million, respectively, compared to $389.7 million, $304.0 million, and $153.6 million, respectively, in the corresponding period last year. Revenues in the EMEA region were positively impacted by acquisitions completed in 2024, increased spending at certain large accounts and changes in foreign currency exchange rates during the three and nine months ended September 30, 2025 as compared to the same periods in the previous year. \nDuring the three and nine months ended September 30, 2025, revenues from clients in the APAC region increased by $4.5 million or 17.7% and $8.6 million or 11.8%, respectively,  mainly due to growth in the Consumer Goods, Retail & Travel vertical compared to the corresponding periods of 2024. \nCost of Revenues (Exclusive of Depreciation and Amortization)\nThe principal components of our cost of revenues (exclusive of depreciation and amortization) are salaries, bonuses, fringe benefits, stock-based compensation, project-related travel costs and fees for subcontractors who are assigned to client projects. Salaries and other compensation expenses of our delivery professionals are reported as cost of revenues regardless of whether the employees are actually performing services for clients during a given period. Our employees are a critical asset, necessary for our continued success and therefore we expect to continue hiring talented employees and providing them with competitive compensation programs. Additionally, government incentives and assistance related to services performed by delivery professionals and contractors assigned to client projects are reported in cost of revenues.\n 37\nTable of contents\nDuring the three months ended September 30, 2025, cost of revenues (exclusive of depreciation and amortization) was $983.2 million representing an increase of 28.7% from $764.0 million in the corresponding period of 2024. The increase primarily resulted from the acquisitions of NEORIS and First Derivative in the fourth quarter of 2024, higher variable compensation expense, and a $38.8 million decrease in government incentives recognized in the third quarter of 2025 compared to the third quarter of 2024 related to conducting R&D activities in Poland. The third quarter of 2024 included a cumulative catch-up benefit related to Poland R&D tax credits. Expressed as a percentage of revenues, cost of revenues (exclusive of depreciation and amortization) was 70.5% and 65.4% in the third quarter of 2025 and 2024, respectively. This year-over-year increase is primarily due to the acquisitions completed in 2024, higher variable compensation expense, and a decrease in government incentives recognized in the third quarter related to conducting R&D activities in Poland.\nDuring the nine months ended September 30, 2025, cost of revenues (exclusive of depreciation and amortization) was $2.899 billion representing an increase of 20.3% from $2.409 billion in the corresponding period of 2024. The increase primarily resulted from the acquisitions of NEORIS and First Derivative in the fourth quarter of 2024, higher variable compensation expense, and a $13.8 million decrease in government incentives recognized in the first nine months of 2025 compared to the corresponding period of 2024 related to conducting R&D activities in Poland. The first nine months of 2024 included a cumulative catch-up benefit related to Poland R&D tax credits. Expressed as a percentage of revenues, cost of revenues (exclusive of depreciation and amortization) was 71.6% and 69.3% for the nine months ended September 30, 2025 and 2024, respectively. The year-over-year increase is primarily due to the 2024 \ncompensation increases which we were not able to fully offset through pricing\n increases,\n \nthe acquisitions completed in 2024, higher variable compensation expense, and a decrease in government incentives recognized in the first nine months of 2025 related to conducting R&D activities in Poland.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses represent expenditures associated with promoting and selling our services and general and administrative functions of our business. These expenses include the costs of salaries, bonuses, fringe benefits, stock-based compensation, severance, bad debt, travel, legal and accounting services, insurance, facilities including operating leases, advertising, and other promotional activities. Additionally, selling, general and administrative expenses include costs of relocating our employees and various one-time and unusual expenses such as impairment charges.\nDuring the three months ended September 30, 2025, selling, general and administrative expenses were $234.9 million representing a 13.6% increase as compared to $206.8 million in the corresponding period of 2024. The increase was mainly driven by the acquisitions of NEORIS and First Derivative completed in the fourth quarter of 2024 and higher variable compensation expense, partially offset by a decrease in professional fee expenses related to our business acquisition efforts. Expressed as a percentage of revenues, selling, general and administrative expenses decreased by 0.9% to 16.8% for the three months ended September 30, 2025 as compared to the same period from the prior year, primarily driven by a decrease in professional fee expenses related to our business acquisition efforts and a decrease in personnel-related costs, including stock-based compensation expense, as a percentage of revenues.\nDuring the nine months ended September 30, 2025, selling, general and administrative expenses were $685.5 million representing a 14.4% increase as compared to $599.3 million in the corresponding period of 2024. The increase in selling, general and administrative expenses was mainly driven by the acquisitions of NEORIS and First Derivative completed in the fourth quarter of 2024. Expressed as a percentage of revenues, selling, general and administrative expenses decreased by 0.3% to 16.9% for the nine months ended September 30, 2025 as compared to the same period from the prior year, primarily driven by the decrease in personnel-related costs, including stock-based compensation expense, and professional fee expenses related to our business acquisition efforts as a percentage of revenues. \nDepreciation and Amortization Expense\nDuring the three and nine months ended September 30, 2025, depreciation and amortization expense was $31.3 million and $94.0 million, respectively, as compared to $19.7 million and $63.0 million, respectively, in the corresponding periods last year. The increase in depreciation and amortization expense during the three and nine months ended September 30, 2025 was primarily the result of increased amortization of acquired finite-lived intangible assets largely resulting from the acquisitions of First Derivative and NEORIS in 2024, partially offset by lower depreciation on furniture, fixtures, other equipment, and computer hardware. Expressed as a percentage of revenues, depreciation and amortization expense increased by 0.6% and 0.5%  during the three and nine months ended September 30, 2025, respectively, primarily driven by increased amortization of acquired finite-lived intangible assets largely resulting from the acquisitions of First Derivative and NEORIS in 2024.\n 38\nTable of contents\nInterest and Other Income, Net\nInterest and other income, net includes interest earned on cash and cash equivalents and short-term investments, gains and losses from certain financial instruments, interest expense related to our borrowings, and changes in the fair value of contingent consideration. Interest and other income, net was $2.3 million and $11.6 million during the three and nine months ended September 30, 2025, respectively, compared to $13.3 million and $40.4 million during the three and nine months ended September 30, 2024, respectively. The decrease in Interest and other income, net during the three months ended September 30, 2025 as compared to the three months ended September 30, 2024 was largely driven by a $10.1 million decrease in interest income from our cash, cash equivalents and short-term investments. The decrease in Interest and other income, net during the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024 was largely driven by a $33.6 million decrease in interest income from our cash, cash equivalents and short-term investments, partially offset by a $4.4 million gain from the change in fair value of contingent consideration.\nForeign Exchange Loss\nFor discussion of the impact of foreign exchange fluctuations see “Item 3. Quantitative and Qualitative Disclosures About Market Risk.”\nProvision for Income Taxes \n In determining our interim provision for income taxes, we use an estimated annual effective tax rate, which is based on expected annual profit before tax, statutory tax rates and tax planning opportunities available in the various jurisdictions in which we operate. Certain significant or unusual items are separately recognized in the quarter in which they occur and can be a source of variability in the effective tax rates from quarter to quarter.\nDetermining the consolidated provision for income tax expense, deferred income tax assets and liabilities and an\ny potential related valuation allowances involves judgment. We consider factors that may contribute, favorably or unfavorably, to the overall effective tax rate in the current year as well as the future. These factors include statutory tax rates and tax law changes in the countries where we operate and excess tax benefits/tax shortfalls upon vesting or exercise of stock awards as well as consideration of any significant or unusual items.\nOur\n \neffective\n tax rate was 25.6% and 25.8% for the three and nine months ended September 30, 2025, respectively, and 28.1% and 21.4% for the three and nine months ended September 30, 2024, respectively. We recorded a tax shortfall upon vesting or exercise of stock awards of $0.2 million and $0.3 million during the three months ended September 30, 2025 and 2024, respectively. We recorded a tax shortfall upon vesting or exercise of stock awards of $0.8 million and an excess tax benefit of $20.5 million during the nine months ended September 30, 2025 and 2024, respectively. The effective tax rate during the three and nine months ended September 30, 2024 was negatively impacted by the accounting treatment of the receipt of government incentives related to conducting R&D activities in Poland, which resulted in a 2.3% and 1.0% increase in the effective tax rate, respectively, and the non-deductibility of certain acquisition costs for tax purposes which resulted in a 1.4% and 0.6% increase in the effective tax rate, respectively.\nOn July 4, 2025, the U.S. federal government enacted tax reform legislation, commonly referred to as the One Big Beautiful Bill Act (“the Act”), which includes a broad range of tax reform provisions. The tax law changes included in the Act did not have a material impact on the Company’s effective tax rate for the three and nine months ended September 30, 2025; however, the Company expects an acceleration of certain deductions resulting in a $26.2 million reduction in cash tax payments associated with the 2025 tax year.\nResults by Business Segment\nWe determine our business segments and report segment information in accordance with how the Company’s chief operating decision maker (“CODM”) organizes the segments to evaluate performance, allocate resources and make business decisions. Our CODM is the chief executive officer. We manage our business primarily based on the managerial responsibility for our client base and market. As managerial responsibility for a particular client relationship generally correlates with the client’s geographic location, there is a high degree of similarity between client locations and the geographic boundaries of our reportable segments. In some cases, managerial responsibility for a particular client is assigned to a management team in another region and is usually based on the strength of the relationship between client executives and particular members of EPAM’s senior management team. In such cases, the client’s activity would be reported through the management team’s reportable segment. \n 39\nTable of contents\nStarting in 2025, we renamed our North America segment to Americas. The new name reflects the evolving geographic footprint and growth of operations within the segment, particularly in Latin America. This constitutes a naming change only and no changes were made to amounts reported.\nSegment results are based on the segment’s revenues and operating profit, where segment operating profit is defined as segment income from operations before unallocated costs. Expenses included in segment operating profit consist principally of direct selling and delivery costs as well as an allocation of certain shared services expenses. Intersegment transactions are excluded from the segment’s revenues and operating profit on the basis that they are neither included in the measure of a segment’s profit and loss results, nor considered by the CODM during the review of segment results. Certain corporate expenses are not allocated to specific segments as these expenses are not controllable at the segment level. Such expenses include certain types of professional fees, certain taxes included in operating expenses, compensation to non-employee directors and certain other general and administrative expenses, including compensation of specific groups of non-production employees. In addition, we do not allocate amortization of intangible assets acquired through business combinations, goodwill and other asset impairment charges, stock-based compensation expenses, acquisition-related costs and certain other one-time charges and benefits. These unallocated amounts are combined with total segment operating profit to arrive at consolidated income from operations. \nOur CODM considers the operating results of each segment on a quarterly basis and uses segment operating profit predominantly to assess the performance of each segment by comparing the results of each segment with one another and to historical performance. When combined with certain other financial information, this enables the CODM to make decisions about the reporting structure, allocation of operating and capital resources, and compensation of certain employees.\nDuring the year ended December 31, 2024, the Company revised its CODM report to enhance the presentation of segment expenses by category and to revise the allocation methodology for certain types of shared expenses. The following prior period amounts presented have been revised to align with the current methodology. No changes were made to historically reported segment revenues.\nSee Note 16 “Segment Information” in the notes to our condensed consolidated interim financial statements in this Form 10-Q for more information related to our reportable segments.\nAmericas Segment\nThe following table summarizes revenues from external clients and operating profit, before unallocated expenses, for the Americas segment for the three and nine months ended September 30, 2025, and 2024:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nAmericas segment revenues \n$\n799,869\n \n$\n704,613\n \n$\n2,364,437\n \n$\n2,107,971\n \nLess:\nCost of revenues (exclusive of depreciation and amortization)\n548,161 \n447,952 \n1,643,778 \n1,410,358 \nSelling, general and administrative expenses\n106,753 \n90,819 \n312,270 \n269,102 \nDepreciation and amortization expense\n8,656 \n9,120 \n27,372 \n29,578 \nAmericas segment operating profit\n$\n136,299\n \n$\n156,722\n \n$\n381,017\n \n$\n398,933\n \nDuring the three months ended September 30, 2025, revenues for the Americas segment increased $95.3 million, or 13.5%, compared to the same period last year and segment operating profit decreased $20.4 million, or 13.0%, compared to the same period last year. Acquisitions contributed $66.3 million to Americas segment revenues during the three months ended September 30, 2025. During the three months ended September 30, 2025, revenues from our Americas segment were 57.4% of total segment revenues, a decrease from 60.4% reported in the corresponding period of 2024. As a percentage of Americas segment revenues, the Americas segment’s operating profit decreased to 17.0% during the third quarter of 2025 from 22.2% in the third quarter of 2024. This decrease is primarily attributable to\n \nlower government incentives related to conducting R&D activities in Poland,  the impact of\n lower profitability from \nacquisitions completed in 2024, and an increase in variable compensation expense as a percentage of segment revenues during the third quarter of 2025 compared to the third quarter of 2024. \n 40\nTable of contents\nDuring the nine months ended September 30, 2025, revenues for the Americas segment increased $256.5 million, or 12.2%, compared to the same period last year and segment operating profit decreased $17.9 million, or 4.5%, compared to the same period last year. Acquisitions contributed $211.4 million to Americas segment revenues during the nine months ended September 30, 2025. During the nine months ended September 30, 2025, revenues from our Americas segment were 58.4% of total segment revenues, a decrease from 60.6% reported in the corresponding period of 2024. As a percentage of Americas segment revenues, the Americas segment’s operating profit decreased to 16.1% during the nine months ended September 30, 2025 from 18.9% in the nine months ended September 30, 2024. This decrease is primarily attributable to lower government incentives related to conducting R&D activities in Poland, the impact of lower profitability from acquisitions completed in 2024, changes in foreign exchange rates, and an increase in variable compensation expense as a percentage of segment revenues during the first nine months of 2025 compared to the first nine months of 2024.\nThe following table presents Americas segment revenues by industry vertical for the periods indicated:\nThree Months Ended\nSeptember 30,\nChange\nNine Months Ended\nSeptember 30,\nChange\n2025\n2024\nDollars\nPercentage\n2025\n2024\nDollars\nPercentage\nIndustry Vertical\n(in thousands, except percentages)\nFinancial Services\n$\n150,573 \n$\n129,339 \n$\n21,234 \n16.4 \n%\n$\n448,475 \n$\n377,000 \n$\n71,475 \n19.0 \n%\nSoftware & Hi-Tech\n143,191 \n131,145 \n12,046 \n9.2 \n%\n423,163 \n392,600 \n30,563 \n7.8 \n%\nLife Sciences & Healthcare\n124,943 \n120,659 \n4,284 \n3.6 \n%\n375,859 \n362,983 \n12,876 \n3.5 \n%\nConsumer Goods, Retail & Travel\n122,673 \n107,866 \n14,807 \n13.7 \n%\n356,090 \n339,556 \n16,534 \n4.9 \n%\nBusiness Information & Media\n116,848 \n115,121 \n1,727 \n1.5 \n%\n348,912 \n332,602 \n16,310 \n4.9 \n%\nEmerging Verticals\n141,641 \n100,483 \n41,158 \n41.0 \n%\n411,938 \n303,230 \n108,708 \n35.9 \n%\nRevenues\n$\n799,869\n \n$\n704,613\n \n$\n95,256\n \n13.5\n \n%\n$\n2,364,437\n \n$\n2,107,971\n \n$\n256,466\n \n12.2\n \n%\nDuring the three and nine months ended September 30, 2025, Financial Services was the largest industry vertical in the Americas segment and grew 16.4% and 19.0%, respectively, compared to the corresponding periods of 2024, benefiting from new revenues from clients gained through our 2024 acquisitions. Software & Hi-Tech grew 9.2% and 7.8% during the three and nine months ended September 30, 2025, respectively, which was a result of the continued focus on engaging with our technology clients. Life Sciences & Healthcare grew 3.6% and 3.5% during the three and nine months ended September 30, 2025, respectively, primarily due to increased demand from pharmaceutical, medical device and healthcare companies. Consumer Goods, Retail & Travel grew 13.7% and 4.9% during the three and nine months ended September 30, 2025, respectively, primarily due to growth from our retail clients. Business Information & Media grew 1.5% and 4.9% during the three and nine months ended September 30, 2025, respectively, primarily due to improvement in demand from clients in the publishing and entertainment sect\nors. Emerging Verticals grew 41.0% and 35.9% during the three and nine months ended September 30, 2025, respectively, primarily due to revenues from clients gained through our 2024 acquisitions as well as growth from various clients in industries such as energy and industrial materials.\nEurope Segment\nThe following table summarizes revenues from external clients and operating profit, before unallocated expenses, for the Europe segment for the three and nine months ended September 30, 2025, and 2024:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nEurope segment revenues \n$\n594,504\n \n$\n462,914\n \n$\n1,685,071\n \n$\n1,371,618\n \nLess:\nCost of revenues (exclusive of depreciation and amortization)\n421,398 \n300,572 \n1,200,316 \n952,551 \nSelling, general and administrative expenses\n79,767 \n65,543 \n230,811 \n198,110 \nDepreciation and amortization expense\n4,438 \n4,909 \n12,940 \n15,949 \nEurope segment operating profit\n$\n88,901\n \n$\n91,890\n \n$\n241,004\n \n$\n205,008\n \n 41\nTable of contents\nDuring the three months ended September 30, 2025, Europe’s segment revenues were $594.5 million, representing an increase of $131.6 million, or 28.4%, from the same period last year. Acquisitions completed in the prior 12 months contributed $55.8 million to Europe segment revenues during the three months ended September 30, 2025. Revenues were positively impacted by changes in foreign currency exchange rates during the third quarter of 2025 and had our Europe segment revenues been expressed in constant currency terms using the exchange rates in effect during the third quarter of 2024, we would have reported revenue growth of 23.8%. Europe’s segment revenues accounted for 42.6% and 39.6% of total segment revenues during the three months ended September 30, 2025 and 2024, respectively. During the third quarter of 2025, the segment’s operating profit decreased 3.3% to $88.9 million compared to the third quarter of 2024. Expressed as a percentage of revenues, Europe’s segment operating profit decreased to 15.0% compared to 19.9% in the same period of the prior year. Segment operating profit as a percentage of revenues was negatively impacted by lower government incentives related to conducting R&D activities in Poland and an increase in variable compensation expense as a percentage of segment revenues, partially offset by changes in foreign exchange rates and results of Cost Optimization Programs during the third quarter of 2025 compared to the third quarter of 2024. \nDuring the nine months ended September 30, 2025, Europe’s segment revenues were $1.685 billion, representing an increase of $313.5 million, or 22.9%, from the same period last year. Acquisitions completed in the prior 12 months contributed $164.8 million to Europe segment revenues during the nine months ended September 30, 2025. Europe’s segment revenues accounted for 41.6% and 39.4% of total segment revenues during the nine months ended September 30, 2025 and 2024, respectively. During the nine months ended September 30, 2025, the segment’s operating profit increased 17.6% to $241.0 million compared to the corresponding period of 2024. Expressed as a percentage of revenues, Europe’s segment operating profit decreased to 14.3% compared to 14.9% in the same period of the prior year. Segment operating profit as a percentage of revenues was negatively impacted by lower government incentives related to conducting R&D activities in Poland and an increase in variable compensation expense as a percentage of segment revenues, partially offset by changes in foreign exchange rates and results of Cost Optimization Programs during the first nine months of 2025 compared to the first nine months of 2024.\nThe following table presents Europe segment revenues by industry vertical for the periods indicated:\nThree Months Ended\nSeptember 30,\nChange\nNine Months Ended\nSeptember 30,\nChange\n2025\n2024\nDollars \nPercentage\n2025\n2024\nDollars \nPercentage\nIndustry Vertical\n(in thousands, except percentages)\nFinancial Services\n$\n187,228 \n$\n125,296 \n$\n61,932 \n49.4 \n%\n$\n531,604 \n$\n364,740 \n$\n166,864 \n45.7 \n%\nConsumer Goods, Retail & Travel\n153,354 \n143,259 \n10,095 \n7.0 \n%\n443,499 \n423,026 \n20,473 \n4.8 \n%\nSoftware & Hi-Tech\n68,965 \n46,928 \n22,037 \n47.0 \n%\n183,737 \n127,727 \n56,010 \n43.9 \n%\nBusiness Information & Media\n50,782 \n52,273 \n(1,491)\n(2.9)\n%\n155,658 \n170,872 \n(15,214)\n(8.9)\n%\nLife Sciences & Healthcare\n34,251 \n21,675 \n12,576 \n58.0 \n%\n94,794 \n59,644 \n35,150 \n58.9 \n%\nEmerging Verticals\n99,924 \n73,483 \n26,441 \n36.0 \n%\n275,779 \n225,609 \n50,170 \n22.2 \n%\nRevenues\n$\n594,504\n \n$\n462,914\n \n$\n131,590\n \n28.4\n \n%\n$\n1,685,071\n \n$\n1,371,618\n \n$\n313,453\n \n22.9\n \n%\nDuring the three and nine months ended September 30, 2025, Financial Services was the largest industry vertical in the Europe segment and grew 49.4% and 45.7%, respectively, compared to the corresponding periods of 2024, benefiting from new revenues from clients that we gained as part of our 2024 acquisitions. During the three and nine months ended September 30, 2025, revenues in Consumer Goods, Retail & Travel grew 7.0% and 4.8%, respectively, primarily due to improved demand from clients in the retail and consumer goods industries. During the three and nine months ended September 30, 2025, revenues in Software & Hi-Tech grew 47.0% and 43.9%, respectively, primarily due to the expansion of services provided to one of our top 10 clients as well as the addition of several new clients in the past 12 months. During the three and nine months ended September 30, 2025, revenues in Business Information & Media declined 2.9% and 8.9%, respectively, primarily due to decreased demand from two clients who were historically included in our top 10 clients. Revenues in Life Sciences & Healthcare grew 58.0% and 58.9%, respectively, during the three and nine months ended September 30, 2025, primarily due to the growth experienced from clients in the pharmaceutical and medical devices sectors. Revenues in Emerging Verticals grew 36.0% and 22.2%, respectively, during the three and nine months ended September 30, 2025, due to growth from various clients in industries such as energy, professional services and industrial materials. Emerging Verticals also benefited from new revenues from clients gained through our 2024 acquisitions. \n 42\nTable of contents\nEffects of Inflation\nEconomies in many countries where we operate have periodically experienced high rates of inflation. Periods of higher inflation may affect various economic sectors in those countries and increase our cost of doing business there. We do not believe that inflation has had a material impact on our business, results of operations or financial condition to date. We continue to track the impact of inflation, particularly on wages, while attempting to minimize its effects through pricing and cost management strategies. A higher-than-normal rate of inflation in the future could adversely affect our operations and financial condition. For a discussion of our potential risks and uncertainties, including those related to inflation, see “Part I. Item 1A. Risk Factors” in our Annual Report on Form 10-K for the year ended December 31, 2024. \nLiquidity and Capital Resources\nCapital Resources\nOur cash generated from operations has been our primary source of liquidity to fund operations, to repurchase shares and make investments to support the growth of our business. As of September 30, 2025, our principal sources of liquidity were cash and cash equivalents totaling $1.239 billion, short-term investments totaling $5.2 million, and $675.0 million of available borrowings under our revolving credit facility. See Note 8 “Debt” of our condensed consolidated financial statements in “Part I. Item 1. Financial Statements (Unaudited)” for information regarding our debt.\nCash Flows\nThe following table summarizes our cash flows for the periods indicated:\n \nNine Months Ended\nSeptember 30,\n \n2025\n2024\n \n(in thousands)\nCondensed Consolidated Statements of Cash Flow Data:\nNet cash provided by operating activities\n$\n372,044 \n$\n428,909 \nNet cash used in investing activities\n(32,802)\n(39,100)\nNet cash used in financing activities\n(439,219)\n(391,667)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n53,100 \n(543)\nNet decrease in cash, cash equivalents and restricted cash\n(46,877)\n(2,401)\nCash, cash equivalents and restricted cash, beginning of period\n1,290,392 \n2,043,108 \nCash, cash equivalents and restricted cash, end of period\n$\n1,243,515 \n$\n2,040,707 \nOperating Activities\nOur largest source of cash provided by operating activities is cash generated from our professional services that we provide to our clients. Our primary uses of cash from operating activities include compensation to our employees and related costs, payments for leased facilities, various general corporate expenditures and income tax payments. Since the invasion of Ukraine in 2022, our operating activities included using cash on humanitarian efforts for Ukraine and geographic repositioning of our workforce. The first nine months of 2025 were negatively impacted by a larger increase in days sales outstanding compared to the first nine months of 2024 and higher payments for variable compensation as compared to the first nine months of 2024, attributable to a higher level of financial performance for the year ended December 31, 2024.\nInvesting Activities\nOur primary uses of cash in investing activities consist of purchases of computer hardware, software and office equipment, as well as investments into office buildings and new businesses. We also use cash for short-term investments and time deposits and receive cash upon maturity of these deposits. Most of our investments are typically short-term and cash equivalent in nature but we may invest in longer term deposits if the terms are favorable. The cash used in investing activities during the nine months ended September 30, 2025 was primarily attributable to $27.5 million used for capital expenditures compared to $16.4 million used for capital expenditures in the corresponding period of 2024. During the nine months ended September 30, 2025, $3.3 million was used for the acquisitions of businesses, net of cash acquired compared to $57.1 million used for the acquisitions of businesses, net of cash acquired in the corresponding period of 2024. There were no proceeds from short-term investments during the nine months ended September 30, 2025 compared to $41.5 million in the corresponding period of 2024.\n 43\nTable of contents\nFinancing Activities\nCash used in financing activities mainly consists of repurchasing shares of EPAM common stock under our share repurchase programs, payments of withholding taxes related to net share settlements of restricted stock units, repayments of debt, and settlements of the acquisition-date fair value of contingent consideration related to acquisitions of businesses. Cash provided by financing activities mainly consists of the proceeds from the purchases of shares under our ESPP and exercises of stock options issued under our long-term incentive plans as well as proceeds from debt. We typically do not rely on debt to supplement our cash flows. During the first nine months of 2025, our main use of cash in financing activities consisted of $438.6 million of payments to repurchase our common stock, compared to $385.0 million in the corresponding period of 2024. These cash outflows were partially offset by cash received from the exercises of stock options issued under our long-term incentive plans and proceeds from the purchase of shares under our ESPP of $35.0 million in the first nine months of 2025, compared to $33.8 million received in the corresponding period of 2024. \nFuture Capital Requirements\nWe believe that our existing cash, cash equivalents and short-term investments, combined with our expected cash flow from operations will be sufficient to meet our projected operating and capital expenditure requirements for at least the next twelve months and that we possess the financial flexibility to execute our strategic objectives, including the ability to make acquisitions and strategic investments in the foreseeable future. However, the invasion of Ukraine, other various geopolitical events, and the related measures implemented to contain their impact, have caused and may continue to cause material disruptions in financial markets and economies. These disruptions may increase our costs of capital, decrease returns on investment, and otherwise adversely affect our business, results of operations, financial condition and liquidity.\nOur ability to generate cash is subject to our performance, general economic conditions, industry trends and other factors including the impact of the invasion of Ukraine, as described elsewhere in this Management’s Discussion and Analysis of Financial Condition and Results of Operations. We may require additional cash resources due to changed business conditions or other future developments, including any investments or acquisitions we may decide to pursue. To the extent that existing cash, cash equivalents, short-term investments, and operating cash flows are insufficient to fund our future activities and requirements, we may need to raise additional funds through public or private equity or debt financing. If we issue equity securities in order to raise additional funds, substantial dilution to existing stockholders may occur. If we raise cash through the issuance of additional indebtedness, we may be subject to additional contractual restrictions on our business and there is no assurance that we would be able to raise additional funds on favorable terms or at all. Our ability to expand and grow our business in accordance with current plans and to meet our long-term capital requirements will depend on many factors, including the rate at which our cash flows increase or decrease and the availability of public and private debt and equity financing. \nSee Note 15 “Commitments and Contingencies” of our condensed consolidated financial statements in “Part I. Item 1. Financial Statements (Unaudited)” of this Quarterly Report and “Part II. Item 7. Future Capital Requirements” of our Annual Report on Form 10-K for the year ended December 31, 2024 for information regarding contractual obligations.\nOff-Balance Sheet Commitments and Arrangements\nWe do not have any material obligations under guarantee contracts or other contractual arrangements other than as disclosed in Note \n15\n “Commitments and Contingencies” of our condensed consolidated financial statements in “Part I. Item 1. Financial Statements (Unaudited).” We have not entered into any transactions with unconsolidated entities where we have financial guarantees, subordinated retained interests, derivative instruments, or other contingent arrangements that expose us to material continuing risks, contingent liabilities, or any other obligation under a variable interest in an unconsolidated entity that provides financing, liquidity, market risk, or credit risk support to us, or engages in leasing, hedging, or research and development services with us.\nRecent Accounting Pronouncements\nSee Note 1 “Organization and Summary of Significant Accounting Policies” to our unaudited condensed consolidated financial statements in “Part I. Item 1. Financial Statements (Unaudited)” for additional information.\n 44\nTable of contents\nForward-Looking Statements\nThis quarterly report on Form 10-Q contains estimates and forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, principally in “Part I. Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Part II. Item 1A. Risk Factors.” Our Annual Report on Form 10-K for the year ended December 31, 2024 also contains estimates and forward-looking statements, principally in “Part I. Item 1A. Risk Factors.” Our estimates and forward-looking statements are based on our current expectations and estimates of future events and trends, which affect or may affect our businesses and operations. Those future events and trends may relate to, among other things, developments relating to the war in Ukraine and escalation of the war in the surrounding region, political and civil unrest or military action in the geographies where we conduct business and operate, difficult conditions in global capital markets, foreign exchange markets, global trade and the broader economy, the adoption and implementation of artificial intelligence technologies by EPAM and its clients, and the effect that these events may have on client demand, our revenues, operations, access to capital and profitability. Although we believe that these estimates and forward-looking statements are based upon reasonable assumptions, they are subject to several risks, uncertainties and assumptions as to future events that may not prove to be accurate and are made in light of information currently available to us. Important factors, in addition to the factors described in this quarterly report and in our Annual report, may materially and adversely affect our results. You should read this quarterly report, our Annual report and the documents that we have filed as exhibits hereto completely and with the understanding that our actual future results may be materially different from what we expect. \n \nThe words “may,” “will,” “should,” “could,” “expect,” “plan,” “anticipate,” “believe,” “estimate,” “predict,” “intend,” “potential,” “might,” “would,” “continue” or the negative of these terms or other comparable terminology and similar words are intended to identify estimates and forward-looking statements. Estimates and forward-looking statements speak only as of the date they were made and, except to the extent required by law, we undertake no obligation to update, to correct, to revise or to review any estimate and/or forward-looking statement because of new information, future events or other factors. Estimates and forward-looking statements involve risks and uncertainties and are not guarantees of future performance. As a result of the risks and uncertainties described above, the estimates and forward-looking statements discussed in this quarterly report and our Annual Report on Form 10-K for the year ended December 31, 2024 might not occur and our future results, level of activity, performance or achievements may differ materially from those expressed in these forward-looking statements due to, including, but not limited to, the factors mentioned above, and the differences may be material and adverse. Because of these uncertainties, you should not place undue reliance on these forward-looking statements."
}