{
  "source_file": "eqr-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\n\n\nGeneral\n\n\nEquity Residential (“EQR”) is committed to creating communities where people thrive.  The Company, a member of the S&P 500, is focused on the acquisition, development and management of residential properties located in and around dynamic cities that attract affluent long-term renters.  ERP Operating Limited Partnership (“ERPOP”) is focused on conducting the multifamily property business of EQR.  EQR is a Maryland real estate investment trust (“REIT”) formed in March 1993 and ERPOP is an Illinois limited partnership formed in May 1993.  References to the “Company,” “we,” “us” or “our” mean collectively EQR, ERPOP and those entities/subsidiaries owned or controlled by EQR and/or ERPOP.  References to the “Operating Partnership” mean collectively ERPOP and those entities/subsidiaries owned or controlled by ERPOP.\n\n\nEQR is the general partner of, and as of December 31, 2024 owned an approximate 97.0% ownership interest in, ERPOP.  All of the Company’s property ownership, development and related business operations are conducted through the Operating Partnership and EQR has no material assets or liabilities other than its investment in ERPOP.  EQR issues equity from time to time, the net proceeds of which it is obligated to contribute to ERPOP, but does not have any indebtedness as all debt is incurred by the Operating Partnership.  The Operating Partnership holds substantially all of the assets of the Company, including the Company’s ownership interests in its joint ventures.  The Operating Partnership conducts the operations of the business and is structured as a partnership with no publicly traded equity.\n\n\nThe Company’s corporate headquarters is located in Chicago, Illinois and the Company also operates regional property management offices in most of its markets.\n\n\nCertain capitalized terms used herein are defined in the Notes to Consolidated Financial Statements or the Definitions section of Item 7, \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n.  See also Note 16 in the Notes to Consolidated Financial Statements for additional discussion regarding the Company’s segment disclosures.\n\n\nAvailable Information\n\n\nYou may access our Annual Report on Form 10-K, our Quarterly Reports on Form 10-Q, our Current Reports on Form 8-K, our proxy statements and any amendments to any of those reports/statements we file with or furnish to the Securities and Exchange Commission (“SEC”) free of charge on our website, www.equityapartments.com.  These reports/statements are made available on our website as soon as reasonably practicable after we file them with or furnish them to the SEC.  The information contained on our website, including any information referred to in this report as being available on our website, is not a part of or incorporated into this report.\n\n\nBusiness Objectives and Operating and Investing Strategies\n\n\nOverview\n \n\n\nThe Company is one of the largest U.S. publicly-traded owners and operators of high quality rental apartment properties, with an established presence in Boston, New York, Washington, D.C., Southern California (including Los Angeles, Orange County and San Diego), San Francisco and Seattle, and an expanding presence in Denver, Atlanta, Dallas/Ft. Worth and Austin.  Through our ownership in these markets, we seek to optimize our portfolio by balancing risk and maximizing returns.  We believe that this portfolio will allow us to produce more consistent cash flows in a volatile world where local market conditions may cause operating fundamentals to rapidly fluctuate.  We believe our markets are knowledge centers of the U.S. economy that draw employers and their talented affluent workers that drive economic growth in the United States.  We believe that both the locations of our properties and the cost of renting versus home ownership in these markets are attractive to these affluent knowledge workers (who often choose to rent for lifestyle reasons and due to a lack of home affordability) that we hope to convert into satisfied long-term residents.\n \n\n\nWe believe we have created an industry-leading operating platform and balance sheet to run our properties.  Our employees are focused on delivering remarkable customer service to our residents so they will stay with us longer, be willing to pay higher rent for a great experience and will tell others about how much they love living in an Equity Residential property.  We utilize technology and other innovative methods of engagement with our residents to foster relationships and community, improve the resident experience and operate our business more efficiently.  We pair that with disciplined balance sheet management that enhances returns and value creation while maintaining flexibility to take advantage of future opportunities.  We believe that our stakeholders value stability, liquidity, predictability and accountability and that is the mission to which we remain unwaveringly committed.\n\n\n7\n\n\n\n\nTable of Contents\n \n\n\nDemand to live in our apartment communities remains healthy and we believe that the long-term prospects for our business remain strong.  Our business benefits from elevated single family home ownership costs which makes renting more attractive, positive household formation trends, residents choosing a rental lifestyle for greater flexibility in living arrangements and the overall deficit in housing across the country, especially in the areas in which we are investing.  Our well-located communities provide an exceptional experience for our residents around dynamic cities that we believe will continue to attract long-term renters who are highly educated, well employed and earn high incomes.\n\n\nEquity Residential is committed to creating communities where people thrive.  We carry this, our corporate purpose, through our relationships with our customers, our employees, our shareholders and the communities in which we operate.  It drives our commitments to sustainability, inclusion, the total wellbeing of our employees and being a responsible corporate citizen in the communities in which we operate.\n \n\n\nInvestment Strategy\n\n\nThe Company’s long-term strategy is to invest in apartment properties located in strategically targeted markets with the goal of generating consistent and superior risk-adjusted total returns by balancing current cash flow generation with long-term capital appreciation.  We seek to meet this goal by investing in markets that are characterized by conditions favorable to multifamily property operations over the long-term.  Our multi-pronged investment strategy featuring acquisitions, new stand-alone and expansion developments, densifying developments and accretive renovations of existing properties is focused on optimizing and balancing our portfolio in terms of location, including between our Established Markets and Expansion Markets and between urban and suburban submarkets within those markets.  The markets we focus on generally feature one or more of the following characteristics that allow us to drive performance:\n\n\n•\nLarge and diverse economic drivers\n.  Our markets are some of the largest cities in the United States.  They are markets that generally attract a variety of large and diverse industries and businesses.  They include a number of submarkets that are attractive for long-term multifamily ownership and are positioned to capture future demand.\n\n\n•\nHigh costs of single family home ownership.  \nElevated single family home ownership costs (large down payments, high interest rates, etc.), low for sale inventory and existing homeowners that are reluctant to sell given favorable locked-in financing all support renting in the long-term, especially in the markets in which we operate.\n\n\n•\nStrong high quality job growth.\n  Our markets attract and create high quality jobs that are often focused in growing areas of the knowledge-based economy.  These jobs result in the significant presence and growth in renters that work in the highest earning sectors of the economy and are not rent-burdened, creating the ability to raise rents more readily in good economic times and reducing risk during downturns.  Many of these workers are employed in the fields of Science, Technology, Engineering and Mathematics, or STEM jobs, as well as financial services, medical, legal and other higher-earning professions.\n\n\n•\nSignificant apartment demand that meets new apartment supply. \n We remain focused on owning and operating properties in markets and submarkets where the supply of apartments is met with strong demand.  While at times supply and demand imbalances may occur, over the long-term we believe that the dynamics in our markets will support superior long-term returns.\n\n\nWe also focus on resiliency/environmental and regulatory issues when choosing which markets/submarkets in which to concentrate our investment efforts.  We conduct climate resilience analyses and assess the regulatory climate to identify potential risks and opportunities as part of our due diligence process for new acquisitions and developments, as well as potential markets for portfolio expansion.  Resiliency and regulatory issues also factor into our decisions to dispose of certain properties and/or exit certain submarkets.\n\n\nWe believe our strategy capitalizes on the preference of renters of all ages to live in the locations where we operate which typically are near transportation (both public transit and convenient highway access), entertainment, employment centers/universities and cultural and outdoor amenities.  Furthermore, we believe that demand for rental housing will continue to be driven primarily through household formations from the younger segments of our population, particularly Generation Z, while retaining Millennials for longer, and to a lesser extent, capturing the aging Baby Boomer generation.\n \n\n\n•\nGeneration Z is approximately 70 million people born between 1997 and 2012.  This cohort is entering prime renter age and is expected to continue to be an important source of demand. \n\n\n•\nMillennials are individuals born between 1981 and 1996, totaling approximately 72 million people, and continue to be a significant portion of the renter population.  They also tend to remain renters longer due to the high cost of single family home ownership, societal trends favoring delays in marriage and having children and caution around making large financial commitments during uncertain economic times.   \n\n\n8\n\n\n\n\nTable of Contents\n \n\n\n•\nBaby Boomers, a demographic of more than 68 million people born between 1946 and 1964, also may trend toward apartment rentals as they downsize and select retirement living in vibrant cities.  \n\n\nThe Company continues to allocate capital in order to optimize performance by balancing current cash flow growth with long-term capital appreciation.  We have done so by adding Expansion Markets to our portfolio when certain submarkets in those markets meet many of the same characteristics listed above.  Expansion into these markets includes investments in both urban and suburban properties in select submarkets and is generally being funded by reducing exposure to older or lower returning assets in selected Established Markets.  We believe having a more balanced portfolio between urban and suburban and between our Established Markets and Expansion Markets, while remaining focused on serving a more financially resilient renter, will create the highest returns and lowest return volatility over time.  Development also plays an important role in our capital allocation.  Development activity is primarily focused on our strategic partnerships and joint ventures with third-party developers, as well as on our in-house redevelopment/densification of existing operating properties, located in both Established Markets and Expansion Markets.  The Company remains committed to development as a driver of external growth but acknowledges its incremental risk, particularly in higher inflationary cost environments, when evaluating it as a method of expansion.\n\n\nCompetition\n\n\nAll of the Company’s properties are located in developed areas with multiple housing choices, including other multifamily properties.  The number of competitive housing choices or multifamily properties in a particular area could have a material effect on the Company’s ability to lease apartment units at its properties and on the rents charged.  The Company may be competing with other housing providers that have greater resources than the Company and whose managers have more experience than the Company’s managers.  In addition, other forms of rental properties and single family housing provide housing alternatives to potential residents of multifamily properties.  See Item 1A, \nRisk Factors\n,\n \nfor additional information with respect to competition.\n \n\n\nOperations and Innovation\n\n\nWe attempt to balance occupancy and rental rates to maximize our revenue while exercising tight cost control to generate the highest possible cash flow generation to our shareholders.  Our focus on operating efficiency and delivery of an exceptional resident living experience has driven strong Physical Occupancy and low Turnover while achieving strong renewal rate growth.\n\n\nWe deliver this performance through rapidly evolving technology and innovation that is increasingly prevalent in our industry.  We have been and continue to be a leader in deploying and investing in property technology to serve our customers better and operate more efficiently.  Having a history as a first mover in such important areas as online leasing, we are focused on technology that drives superior margins and improves customer experience.  We use a standardized purchasing system to control our operating expenses and a business intelligence platform and other data analytics that allow our team members to quickly identify and address issues and opportunities.  Many of these initiatives allow us to interact with our customers in a safe, responsible and convenient manner, including self-guided tours, automated responses to customer inquiries and enhanced service and maintenance management.  While we believe areas such as “smart home” technology and others will provide the foundation for current and future improvements to how we do business, we will continue to consider the cost and longevity of technology capital investments and their benefits.\n\n\nOur Commitment to Corporate Responsibility\n\n\nAt Equity Residential, corporate responsibility is integrated into every aspect of our business, as we aim to minimize environmental impact, manage climate and environmental risks and position the Company as an attractive investment.  We prioritize robust governance and transparency, operating our assets efficiently, strategically and responsibly allocating capital and investing in innovative technologies and practices.  We are focused on creating and maintaining a sustainable portfolio with properties that can withstand and adapt to the impacts of climate change, minimizing casualty loss risk and providing stable housing for our residents.  We have a dedicated in-house team that initiates and applies sustainable practices in all aspects of our business, including investment activities, development, property operations and property management activities.  Multifamily housing is one of the most environmentally-friendly uses of real estate, as each property provides homes for hundreds of families in a denser shared environment.  We consider building locations based on walkability, accessibility, neighborhoods and communities.  Our properties support amenities such as fitness centers and we select locations near retail shops, restaurants, outdoor amenities such as bike/running paths and health clubs, enabling a low carbon footprint lifestyle for our residents to live, work and play.\n\n\n9\n\n\n\n\nTable of Contents\n \n\n\nEquity Residential’s sustainability program actively manages environmental impacts and utility costs through optimized, financially responsible capital investments and technologies.  We methodically focus on energy, water, waste and emissions to advance the program’s policies, targets and resilience outcomes as well as our shareholders' long-term financial interests.  We believe that our approach will prepare us to operate in a low-carbon economy and drive long-term asset value while maintaining a commitment to good corporate citizenship and maximizing investment performance.  Our expertise has shown that as real estate owners, developers and managers, we have the ability to make a positive impact on the environment while also enhancing our financial performance and strengthening our organization’s sense of purpose.\n\n\nAs detailed below, we are committed to our employees’ engagement, inclusion and wellness.  We are committed to building a community where everyone belongs and diverse perspectives fuel creativity and innovation, shaping a workplace that is not only inclusive but also collaborative.  We also recognize that a successful company must incorporate the best corporate governance practices to serve its stakeholders better.  Consistent with the Company's purpose and commitment to corporate responsibility concepts in all aspects of its business, executive compensation includes a goal that focuses on corporate responsibility factors.\n\n\nFor additional information regarding our corporate responsibility efforts, see our 2024 Corporate Responsibility Report at our website, www.equityapartments.com, which includes third-party limited assurance covering some of the environmental metrics included in the report.  The report was reviewed and approved by the Corporate Governance Committee of our Board of Trustees, which monitors the Company’s ongoing corporate responsibility efforts.  The Corporate Responsibility Report is not part of or incorporated into this report.  Furthermore, our annual proxy statements contain additional information on our corporate responsibility efforts, including detailed information regarding our corporate governance practices.  Such annual proxy statements and the information contained therein are not part of or incorporated into this report, except as otherwise provided herein.\n\n\nHuman Capital\n\n\nOur commitment to Human Capital starts with a highly skilled Board of Trustees that reflects a diverse range of thought and perspective.  At Equity Residential, our team of approximately 2,500 employees is the driving force behind our continued success.  Employees can grow, innovate and contribute to our shared goals, including our purpose of “\nCreating communities where people thrive.”  \nThis alignment of individual aspirations with our business goals creates a powerful partnership that drives innovation, excellence and lasting impact across our organization and industry.  We believe it enhances employee job capabilities, advances our business and creates sustainable shareholder value.\n\n\nOur approach focuses on engaging, motivating and rewarding employees, ensuring they feel valued and contribute their best.  Built on a foundation of continuous learning and development, we have implemented programs that support career progression, enhance managerial capabilities and create a culture of collaboration and engagement.  These efforts ensure that our workforce is well-prepared to meet today’s challenges and equipped to lead the future.\n\n\nTalent Development, Attraction and Retention\n\n\n•\nTo develop, attract and retain the best employees, we are committed to providing a total compensation package that is market-based, performance driven, fair and internally equitable.\n\n\n•\nOur goal is to be competitive both within the general employment market and with our competitors in the real estate industry, with our strongest performers being paid more.\n\n\n•\nBase pay is reviewed annually, along with Equity Residential’s compensation framework.  This process involves partnering with managers to create and update job descriptions that accurately reflect the duties, skills, experience and education required for each role.  We then benchmark the Company’s pay practices and budget as well as our job roles against third-party compensation surveys to determine the market value of each position.\n\n\n•\nDuring the year-end performance evaluation process, managers review and calibrate compensation for their team members in an effort to ensure fairness in our pay practices, while recognizing and rewarding top talent to keep them motivated.\n\n\n•\nWe benefit from a diverse workforce, of which over 60% currently identify as ethnically diverse.\n\n\n•\nWe are committed to fostering a safe, inclusive and productive workplace for all employees.  We believe our strength lies in our differences.  By fostering a work environment built on respect, trust and collaboration, we create an exceptional experience where employees can bring their full selves to work and thrive in their careers.\n\n\n•\nWe actively work to expand the breadth of our talent pipeline at all levels, with an enhanced focus on mid-management and higher positions.  We connect with emerging real estate talent in the communities we serve, sponsor internships and ensure educational opportunities are accessible to more students.\n\n\n10\n\n\n\n\nTable of Contents\n \n\n\n•\nWe employ interns from universities nationwide and local colleges to provide pathways for students of various backgrounds interested in real estate. \n\n\nEmployee Engagement\n\n\n•\nEmployee engagement and experience are extremely important at Equity Residential.  Our Employee Experience (EX) Survey measures employee engagement, manager effectiveness, trust and inclusion, among other components of the employee experience.\n\n\n•\nOur 2024 engagement score of 77.4% favorability is very strong, especially given changes in employee expectations over the past several years.  Our inclusion index score of 84.4% demonstrates significant employee favorability for our initiatives and a greater sense of belonging.\n\n\n•\nWe launched an Engagement Advisory Group dedicated to identifying opportunities to bolster our engagement scores and improve the employee experience by leveraging insights gleaned from our 2023 engagement survey.\n\n\n•\nExecutive leaders are assessed annually on leadership results on inclusion, engagement and manager completion of Ethics and Positive Workplace training, which for 2024 were measured by an employee experience survey and course completion rates.\n\n\nTraining and Development\n\n\n•\nOur HR Transformation Learning & Development team is focused on driving innovation, connection and a culture of continuous growth.  We work hand-in-hand with leaders and employees to create meaningful learning experiences that allow everyone to succeed.  With tailored learning paths, we guide employees on personalized development journeys, helping them build the skills they need to thrive. \n\n\n•\nLeadership development is a key focus, giving current and future leaders the tools to inspire, innovate and lead with impact.  Whether it’s hands-on workshops, virtual learning or self-paced programs, our team blends diverse approaches to meet evolving needs and elevate our organization to the next level.\n\n\nHealth, Total Rewards and Wellness\n\n\n•\nEquity Residential empowers employees to thrive across physical, mental, financial, career, social and community dimensions of wellbeing.  By fostering an environment where employees bring their best selves to work, we enable impactful contributions to our business, culture and communities, underscoring the connection between employee wellbeing and organizational success.\n\n\n•\nRecognizing that one size does not fit all when supporting our employees, we offer a comprehensive and inclusive benefits package designed to meet a wide range of needs.  Our programs include medical, dental and vision coverage; mental health and stress management resources; financial wellness tools; and support for proactive self-care.  From addressing complex health conditions to providing resources for everyday wellbeing, we believe our benefits ensure every employee feels supported, balanced and able to thrive.\n\n\n•\nTo address the ongoing importance of mental health, we provide culturally competent and accessible resources, including educational tools, free access to an industry-leading meditation app for employees and their families, partnerships with virtual care providers and an Employee Assistance Program offering five free counseling sessions per year per presenting matter.  These efforts focus on mindfulness, stress management and building resilience to enhance productivity and overall wellbeing.\n\n\n•\nWe prioritize proactive healthcare by covering 100% of preventive care for employees, a longstanding commitment that predates healthcare reform.  We removed financial barriers to accessing affordable, life-saving medications, such as insulin, opioid overuse, asthma and severe allergic reaction medications, by eliminating out-of-pocket expenses for these medications within our medical plan.  Our robust wellness program encourages ongoing healthy behaviors, rewards proactive health management and ensures accessible care for ongoing health needs and emergencies, fostering a balanced and healthy workforce.\n\n\n•\nIn 2024, we reimagined recognition, introducing popular digital recognition badges awarded at the peer-to-peer, manager-to-employee and officer-to-employee levels.  We rebuilt our year-end awards program for all employees and added new governance, accountability and reporting layers to ensure compliance and equitable application.  It was codified in a recognition playbook that informs and guides any employee on recognition and appreciation best practices.\n\n\n11\n\n\n\n\nTable of Contents\n \n\n\n•\nFinancial benefits and resources help our employees manage their money better today, while preparing for financial milestones and retirement in the future.  Financial peace of mind is at the core of these offerings, whether it’s our generous 401(k) match, basic and supplemental insurance to ensure our loved ones and possessions are cared for, rent discounts at our properties or additional savings and investment options like our employee share purchase plan.\n\n\n•\nWhen employees move up in skill and experience, so does Equity Residential.  We encourage our employees to push the boundaries of their comfort zones and seek new challenges through several learning resources and courses.  We actively promote from within, and many senior corporate and property leaders have risen from entry level or junior positions.\n\n\n•\nWe offer a number of benefits that foster social and community wellbeing, including paid time off to volunteer in our communities.\n\n\n•\nEquity Residential continues to partner with Employees1st to provide financial relief via a crisis fund for employees struck by personal hardships or unforeseen disasters.  The Company contributes funds to further support employees who experience unforeseen or catastrophic hardship.  We are proud that this program allows yet another avenue for us to tangibly demonstrate a one team culture by ensuring that employees feel safe and supported during extreme circumstances.\n\n\nRegulatory Considerations\n\n\nSee Item 1A, \nRisk Factors\n,\n \nfor information concerning the potential effects of governmental regulations, including environmental regulations, on our operations.\n\n\n12\n\n\n\n\nTable of Contents\n \n\n\nItem 1A. Ri\nsk Factors\n\n\nGeneral\n\n\nThis Item 1A includes forward-looking statements.  You should refer to our discussion of the qualifications and limitations on forward-looking statements included in Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations.\n\n\nThe occurrence of the events discussed in the following risk factors could adversely affect, possibly in a material manner, our business, financial condition or results of operations, which could affect the value of our common shares of beneficial interest or preferred shares of beneficial interest (which we refer to collectively as “Shares”), Preference Units, OP Units, restricted units and our public unsecured debt.  In this section, we refer to the Shares, Preference Units, OP Units, restricted units and public unsecured debt together as our “securities” and the investors who own such securities as our “security holders.”\n\n\nRisks Related to our Business Strategy\n\n\nInvesting in real estate is inherently subject to risks that could negatively impact our business.\n\n\nInvesting in real estate is subject to varying degrees and types of risk.  While we seek to mitigate these risks through various strategies, including geographic diversification, market research and proactive asset management, among other techniques, these risks cannot be eliminated entirely.  Factors that have in the past and may in the future impact cash flows and real estate values include, but are not limited to:\n\n\n•\nLocal economic conditions, particularly oversupply or reductions in demand;\n\n\n•\nNational, regional and local political and regulatory climates, governmental fiscal health and governmental policies;\n\n\n•\nThe inability or unwillingness of residents to pay rent increases;\n\n\n•\nIncreases in our operating expenses due to inflation, tariffs, immigration issues or other cost pressures;\n\n\n•\nCost and availability of labor and materials required to maintain our properties at acceptable standards;\n\n\n•\nAvailability of attractive financing opportunities; \n\n\n•\nChanges in social preferences, demographics or migration patterns; and\n\n\n•\nAdditional risks that are discussed below.\n\n\nThe geographic concentration of our properties could have an adverse effect on our operations.\n\n\nWhile the Company continues to diversify its portfolio with the addition of the Expansion Markets, the Company’s properties are still predominantly concentrated in our Established Markets (generally within certain dense urban and suburban submarkets).  If one or more of these markets is unfavorably impacted by specific geopolitical and/or economic conditions, local real estate conditions, increases in social unrest, increases in real estate and other taxes, reduced quality of life, deterioration of local or state government health, rent control or rent stabilization laws, other similar regulations, or localized environmental and climate issues, the impact of such conditions may have a more negative impact on our results of operations than if our properties were more geographically diverse.  Additionally, to the extent that these markets or submarkets become less desirable to operate in, including changes in multifamily housing supply and demand, our results of operations could be more negatively impacted than if we were more diversified within our markets\n \nor invested in a greater number of markets.\n \n\n\nCompetition for housing may negatively affect operations and demand for the Company’s properties or residents.\n\n\nOur properties face competition for residents from other existing or new multifamily properties, condominiums, single family homes and other living arrangements, whether owned or rental, that may attract residents from our properties or prospective residents that would otherwise choose to live with us.  As a result, we may not be able to renew existing resident leases or enter into new resident leases, or if we are able to renew or enter into new leases, they may be at rates or terms that are less favorable than our current rates or terms, resulting in a material impact on our results of operations.\n\n\nAdditionally, our properties face competition for residents as a result of innovations in technology and amenities.  Therefore, we may not be able to retain residents or attract new residents if we are unable to identify and cost effectively implement new, relevant technologies/amenities and keep up with constantly changing resident demand for the latest innovations in these areas.\n \n\n\n13\n\n\n\n\nTable of Contents\n \n\n\nThe short-term nature of apartment leases exposes us more quickly to the effects of declining market rents, potentially making our results of operations and cash flows more volatile.\n \n\n\nGenerally, our residential apartment leases are for twelve months or less.  If the terms of the renewal or releasing are less favorable than current terms, then the Company’s results of operations and financial condition could be negatively affected.  Given our generally shorter-term lease structure, our rental revenues are impacted by declines in market rents more quickly than if our leases were for longer terms.  In addition, operating expenses associated with each property, such as real estate taxes, insurance, utilities, maintenance costs and employee wages and benefits, may not decline at all or decline at the same rate as revenues when circumstances might cause a reduction of those revenues at our properties.\n \n\n\nBecause real estate investments are illiquid, we may not be able to sell properties when appropriate.\n\n\nReal estate investments often cannot be sold quickly due to regulatory constraints, market conditions or otherwise.  As a result, we may not be able to reconfigure our portfolio, including the diversification of our portfolio into the Expansion Markets, as promptly as desired or as quickly in response to changing economic or other conditions.  We may also be unable to consummate dispositions in a timely manner, on attractive terms, or at all.  The capitalization rates/disposition yields at which properties may be sold could also be higher than historic rates, thereby reducing our potential proceeds from sale.  In some cases, we may also determine that we will not recover the carrying amount of the property upon disposition, potentially causing an impairment charge.  This inability to reallocate our capital promptly could negatively affect our financial condition, including our ability to make distributions to our security holders.\n\n\nCompetition may prevent us from acquiring properties on favorable terms.\n\n\nWe may not be successful in pursuing acquisition and development opportunities.  We expect that other real estate investors will compete with us for attractive investment opportunities or may also develop properties in markets where we focus our development and acquisition efforts.  We may not be in a position or have the opportunity in the future to make suitable property acquisitions on favorable terms.\n \n\n\nOperations from new acquisitions, development projects and renovations may fail to perform as expected.\n\n\nWe intend to actively acquire, develop and renovate multifamily operating properties as part of our business strategy.  Newly acquired, developed or renovated properties may not perform as we expect.  We may overestimate the revenue (or underestimate the expenses) that these new or repositioned properties may generate.  The occupancy and rental rates at these properties may also fail to meet our expectations for these investments.  Land parcels acquired for development may lose significant value prior to the start of construction.  Development and renovations are subject to even greater uncertainties and risks due to the complexities and lead time to build or complete these projects.  We may also underestimate the costs to complete a development property or to complete a renovation.\n\n\nAdditionally, we have and may in the future acquire large portfolios of properties or companies that could increase our size and result in alterations to our capital structure.  We may be unable to integrate the operations or accurately assess the liabilities of newly acquired large portfolios or companies and realize the anticipated synergies and other benefits or do so within the anticipated time frame.\n\n\nFurthermore, we have in the past and may in the future decide to invest in new markets outside of our existing Established Markets by acquiring and/or developing properties in accordance with the Company's long-term investment strategy.  Our historical experience in our Established Markets does not ensure that we will be able to operate successfully in new markets, should we choose to enter them.  Entering into new markets may expose us to a variety of risks, including an inability to accurately evaluate local market conditions and local economies, to identify appropriate acquisition and/or development opportunities, to hire and retain key personnel and a lack of familiarity with local governmental regulations.\n\n\nConstruction risks on our development projects could affect our profitability.\n\n\nWe intend to continue to develop multifamily properties through both wholly owned and joint venture arrangements as part of our business strategy.  Development often includes long planning and entitlement timelines, subjecting the projects to changes in market conditions.  It can involve complex and costly activities, including significant environmental remediation or construction work in our markets.  We have experienced and may continue to experience an increase in costs due to general disruptions that affect the cost of labor and/or materials, such as supply chain disruptions, trade disputes, tariffs, immigration issues, labor unrest, geopolitical conflicts or other factors that create inflationary pressures.  We may abandon opportunities that we have already begun to explore for a number of reasons, and as a result, we may fail to recover costs already incurred in exploring those opportunities, potentially causing an impairment charge.  We may also be unable to obtain, or experience delays in obtaining, necessary zoning, occupancy, or other required governmental or third-party permits and authorizations.  These and other risks inherent in development projects, including the joint venture risks noted below, could result in increased costs or the delay or abandonment of opportunities.\n \n\n\n14\n\n\n\n\nTable of Contents\n \n\n\nWe are subject to risks involved in real estate activity through joint ventures.\n\n\nWe currently, and may continue to in the future, develop and acquire properties in joint ventures with unrelated third parties.  Joint ventures create risks including the following:\n \n\n\n•\nThe possibility that our partners might refuse or be financially unable to make capital contributions when due or may fail to meet contractual obligations to cover development cost overruns and therefore we may be forced to make contributions to protect our investments;\n\n\n•\nThese projects generally use mortgage debt (including variable rate constructions loans) to finance their activities at a higher leverage level (and at a potentially higher cost due to higher variable rates) than how we finance the Company as a whole;   \n\n\n•\nWe may be responsible to our partners for indemnifiable losses;\n\n\n•\nOur partners might at any time have business, tax planning or economic goals that are inconsistent with ours;\n\n\n•\nOur partners may be in a position to take action or withhold consent contrary to our recommendations, instructions or requests; and\n\n\n•\nThe possibility that our partner is either unable to or unwilling to complete their contractual development activities.\n\n\nAt times we have entered into agreements providing for joint and several liability with our partners.  We have in the past and may in the future choose to guarantee part of or all of certain joint venture debt or to act as a lender to the joint venture itself.  We and our respective joint venture partners may each have the right to trigger a buy-sell arrangement that could cause us to sell our interest, or acquire our partner's interest, at a time or price that is unfavorable to us.  Each joint venture agreement is individually negotiated and our ability to operate, finance or dispose of properties and interests in such joint ventures in our sole discretion may be limited to varying degrees depending on the terms of the applicable joint venture agreement.  To the extent we have commitments to, on behalf of or are dependent on any such off-balance sheet commitments, or if those commitments or their properties or leases are subject to material contingencies, our liquidity and financial condition could be adversely affected.\n \n\n\nIn some instances, our joint venture partners may also have competing interests or objectives that could create conflicts of interest similar to those noted above.  These objectives may be contrary to our compliance with the REIT requirements, and our REIT status could be jeopardized if any of our joint ventures do not operate in compliance with those requirements.  To the extent our partners do not meet their obligations to us or our joint ventures, or they take actions inconsistent with the interests of the joint venture, it could have a negative effect on our results of operations and financial condition, including distributions to our security holders.\n \n\n\nWe are subject to risks involved in activity through real estate technology and other real estate fund investments.\n\n\nWe have entered into, and may continue in the future to enter into, real estate technology and other real estate fund investments.  Noncontrolling interests and passive investments are inherently risky because we have limited ability to influence business decisions.  The managers of such investments have autonomy over the day-to-day operations of the business and may make business, financial or management decisions with which we do not agree or take risks or otherwise act in a manner that does not serve our interests.  In addition, the market for the technologies or products these companies are developing are typically in the early stages and may not materialize to the expected scale, causing these companies to abandon, modify or alter their product, service or overall strategy.  Further, there is no assurance that these companies can obtain additional capital or resources, generate sufficient cash flow to sustain operations and successfully execute their strategy or that their equity will become sufficiently liquid for us to effectively monetize our investment.  The performance of these investments may also rely on the services of a limited number of key individuals, the loss of whom could significantly adversely affect such investments’ performance.  As a result, we may recognize an impairment of our investment or be unable to sell or otherwise monetize any of the investments we have acquired or may acquire in the future.\n\n\nWe are subject to risks related to our properties that are subject to ground leases.\n\n\nWe have entered into, and may continue in the future to enter into, long-term ground leases with respect to assets that may restrict our ability to finance, sell or otherwise transfer our interests in these properties, limit our use and expose us to loss of the properties if such agreements are breached by us or terminated.  These restrictions may limit our ability to timely sell or exchange the properties, impair the properties’ value or negatively impact our ability to operate the properties.  In addition, as we get closer to the lease termination dates, the values of the properties could decrease if we are unable to agree upon an extension of the lease with the lessor.  Certain of these ground leases have payments subject to annual escalations and/or periodic fair market value adjustments which could adversely affect our financial condition or results of operations.\n\n\n15\n\n\n\n\nTable of Contents\n \n\n\nWe face certain risks related to our Non-Residential operating activities.\n\n\nThe Non-Residential space (includes retail and public parking garage operations) at our properties primarily serves as an additional amenity for our residents and neighbors.  The longer-term nature of our Non-Residential leases (generally five to ten years with market based renewal options) and the characteristics of many of our Non-Residential tenants (generally small, local businesses) may subject us to certain risks.  We may not be able to lease new space for rents that are consistent with our projections or for market rates.  Also, when leases for our existing Non-Residential space expire or are otherwise terminated, the space may not be relet or the terms of reletting, including the cost of allowances and concessions to tenants, may be less favorable than the current lease terms.  The presence of competitive alternatives and other market conditions (including online shopping) may affect our ability to lease our Non-Residential space and impact the level of rents we can obtain.  If our Non-Residential tenants experience financial distress or bankruptcy, they may fail to comply with their contractual obligations, seek concessions, such as rent abatements and deferrals, in order to continue operations or cease their operations, any or all of which could lead us to record a non-cash write-off of a tenant's straight-line rent receivable (like we did in 2023 due to the Rite Aid bankruptcy) and could adversely impact our results of operations and financial condition.\n \n\n\nThe Company’s real estate assets may be subject to impairment charges.\n\n\nA decline in the fair value of our assets may require us to recognize an impairment against our assets under accounting principles generally accepted in the United States (“GAAP”) if we were to determine that, with respect to any assets in unrealized loss positions, we do not have the ability and intent to hold such assets for a period of time sufficient to allow for recovery of the depreciated cost of such assets.  If such a determination were to be made, we would recognize unrealized losses through earnings and write-down the depreciated cost of such assets to a new cost basis, based on the fair value of such assets on the date they are considered to be impaired.  Such impairment charges reflect non-cash losses at the time of recognition; subsequent disposition or sale of such assets could further affect our future losses or gains, as they are based on the difference between the sale price received and adjusted depreciated cost of such assets at the time of sale.  If we are required to recognize material asset impairment charges, these charges could adversely affect our financial condition and results of operations.\n\n\nCorporate responsibility, specifically related to sustainability efforts, may impose additional costs and expose us to new risks.\n\n\nCorporate responsibility evaluations remain highly important to some investors and other stakeholders.  Certain organizations that provide corporate governance and other corporate risk advisory services to investors have developed scores and ratings to evaluate companies and investment funds based upon corporate responsibility metrics.  Many investors focus on corporate responsibility-related business practices and scores when choosing to allocate their capital and may consider a company's score as a reputational or other factor in making an investment decision.  Government regulators' and investors' increased focus and activism related to corporate responsibility and similar matters may constrain our business operations or increase expenses or capital expenditures.  In addition, investors may decide to refrain from investing in us as a result of their assessment of our approach to and consideration of corporate responsibility factors.  We may face reputational damage in the event our corporate responsibility procedures or standards do not meet the standards set by various constituencies.  In addition, the criteria by which companies are rated for their efforts may change, which could cause us to receive different scores than in previous years.  Our rating could result in a negative perception of the Company, exclusion of our securities from consideration by certain investors who may elect to invest with our competition instead and/or cause investors to reallocate their capital away from the Company, all of which could have an adverse impact on the price of our securities.\n\n\nOur various technology-related initiatives to improve our operating margins and customer experience may fail to perform as expected.\n\n\nWe have developed and may continue to develop initiatives that are intended to serve our customers better and operate more efficiently, including “smart home” technology and self-service options that are accessible to residents through smart devices or otherwise.  Such initiatives have involved and may involve our employees having new or different responsibilities and processes with which they may be unfamiliar.  We may incur significant costs and divert resources in connection with such initiatives, and these initiatives may not perform as expected, which could adversely affect our business, results of operations, cash flows and financial condition.​\n\n\nRisks Related to our Financing Strategy and Capital Structure\n \n\n\nDisruptions in the financial markets could hinder our ability to obtain debt and equity financing and impact our acquisitions and dispositions.\n\n\nDislocations and disruptions in capital markets could result in increased costs or lack of availability of debt financing (including under our commercial paper program) and equity financing.  This includes any disruptions that may occur as a result of the potential\n \n\n\n16\n\n\n\n\nTable of Contents\n \n\n\nprivatization of the currently government sponsored organizations, Fannie Mae and Freddie Mac.  Such events may affect our ability to refinance existing debt, require us to utilize higher cost alternatives and/or impair our ability to adjust to changing economic and business conditions.  Capital market disruptions have and could continue to negatively impact our ability to make acquisitions or make it more difficult or not possible for us to sell properties or may unfavorably affect the price we receive for properties that we do sell.  Such disruptions could cause the price of our securities to decline.\n\n\nChanges in market conditions and volatility of share prices could decrease the market price of our Common Shares.\n\n\nThe stock markets, including the New York Stock Exchange on which we list our Common Shares, have experienced significant price and volume fluctuations over time, including in recent years.  As a result, the market price of our Common Shares has been and could continue to be similarly volatile.  Investors in our Common Shares consequently may experience a decrease in the value of their shares, including decreases due to this volatility and not necessarily related to our operating performance or prospects.  Additionally, the market price of our Common Shares may decline or fluctuate significantly in response to the sale of substantial amounts of our Common Shares, or the anticipation of the sale of such shares, by large holders of our securities, as well as our inclusion or exclusion from stock indices.  The issuance of additional Common Shares by the Company, or the perception that such issuances might occur, could also cause significant volatility and decreases in the value of our shares.  Continuing high interest rates can also negatively impact the value of our Common Shares, not just through higher interest expense on our debt, but also as investors and markets discount our earnings more and/or assume slower growth in earnings.\n\n\nOur financial counterparties may not perform their obligations.\n\n\nDisruptions in financial and credit markets or other events could impair the ability of our counterparties to perform under their contractual obligations to us.  There are multiple financial institutions that are individually committed to provide borrowings under our revolving credit facility and to pay us amounts due under various interest rate derivative agreements.  Should any of these institutions fail to perform their obligations when contractually required, our financial condition could be adversely affected.\n\n\nRising interest rates can increase costs and impact the value of the Company’s assets.\n\n\nThe Company is exposed to market risk from financial instruments primarily from changes in market interest rates.  Such risks derive from the refinancing of debt at or prior to maturity, from exposure to interest rate fluctuations on floating rate debt and from derivative instruments utilized to swap fixed rate debt to floating rates or to hedge rates in anticipation of future debt issuances.  Rising interest rates increased and may continue to increase our interest expense and the costs of refinancing existing debt.  Higher interest rates also increased and could continue to increase capitalization rates, which may lead to reduced valuations of the Company’s assets.\n\n\nFailure to hedge effectively against interest rate changes may adversely affect our results of operations.\n \n\n\nFrom time to time when we anticipate issuing debt securities, we may seek to limit our exposure to fluctuations in interest rates during the period prior to the pricing of the securities by entering into interest rate hedging contracts.  Also, from time to time we may rely on interest rate hedging contracts to limit our exposure under variable rate debt to unfavorable changes in market interest rates.  The settlement of interest rate hedging contracts may involve material charges.  In addition, our use of interest rate hedging arrangements may expose us to additional risks, including a risk that a counterparty to a hedging arrangement may default on the contract.  There can be no assurance that our hedging activities will be effective and have the desired beneficial impact on our results of operations or financial condition.\n\n\nInsufficient cash flow could affect our ability to service existing debt and create refinancing risk.\n\n\nWe are subject to risks normally associated with debt financing, including the risk that our cash flow will be insufficient to meet required payments.  We may not be able to refinance existing debt and if we can, the terms of such refinancing may be less favorable than the terms of existing indebtedness.  Our inability to refinance, extend or repay debt with proceeds from other capital market transactions would negatively impact our financial condition.  If the debt is secured, the mortgage holder may also foreclose on the property.\n \n\n\nA significant downgrade in our credit ratings could adversely affect our performance.\n\n\nA significant downgrade in our credit ratings, while not affecting our ability to draw proceeds under the Company’s revolving credit facility, would cause the corresponding borrowing costs to increase, impact our ability to borrow secured and unsecured debt, and potentially impair our ability to access the commercial paper market or otherwise limit our access to capital.  In addition, a downgrade below investment grade would likely cause us to lose access to the commercial paper market and would require us to post cash collateral\n \n\n\n17\n\n\n\n\nTable of Contents\n \n\n\nand/or letters of credit in favor of some of our secured lenders to cover our self-insured property and liability insurance deductibles or to obtain lower deductible insurance compliant with the lenders’ requirements at the lower ratings level.\n\n\nFinancial covenants could limit operational flexibility and affect our overall financial position.\n\n\nThe terms of our credit agreements, including our revolving credit facility and the indentures under which a substantial portion of our unsecured debt was issued, require us to comply with a number of financial covenants.  These covenants may limit our flexibility to run our business and breaches of these covenants could result in defaults under the instruments governing the applicable indebtedness and trigger a cross default of other debt.\n\n\nSome of our properties are financed with tax-exempt bonds or otherwise contain restrictive covenants or deed restrictions, including affordability requirements, which limit income from certain properties.  The Company monitors compliance with the restrictive covenants and deed restrictions that affect these properties.  While we generally believe that the interest rate benefit from financing properties with tax-exempt bonds more than outweighs any loss of income due to restrictive covenants or deed restrictions, this may not always be the case.  Some of these requirements are complex, and our failure to comply with them may subject us to material fines or liabilities.\n\n\nWe may change the dividend policy for our securities in the future.\n \n\n\nThe decision to declare and pay dividends on our securities, as well as the timing, amount and composition of any such future dividends, is at the discretion of the Board of Trustees and will depend on actual and projected financial conditions, the Company’s actual and projected liquidity and operating results, the Company’s projected cash needs for capital expenditures and other investment activities and such other factors as the Company’s Board of Trustees deems relevant.  The Board of Trustees may modify our dividend policy from time to time and any change in our dividend policy could negatively impact the market price of our securities.\n\n\nIssuances or sales of our Common Shares or Units may be dilutive.\n\n\nAny additional issuance of Common Shares (including those issued under our At-The-Market (\"ATM\") program) or Units would reduce the percentage of our Common Shares and Units owned by existing investors.  In some circumstances, shareholders and unitholders will not be entitled to vote on whether or not we issue additional Common Shares or Units.  In addition, depending on the terms and pricing of additional offerings of our Common Shares or Units along with the value of our properties, our shareholders and unitholders could experience dilution in both the book value and fair value of their Common Shares or Units, as well as dilution in our actual and expected earnings per share, funds from operations (“FFO”) per share and Normalized FFO per share.\n\n\nRegulatory and Tax Risks\n\n\nThe adoption of, or changes in, rent control or rent stabilization regulations and eviction restrictions could have an adverse effect on our operations and property values.\n\n\nIn part due to increasing pressure from advocacy groups, a growing number of state and local governments have enacted and may continue to consider enacting and/or expanding rent control, rent stabilization, eviction moratoriums or other regulations that restrict the methods and strategies by which we operate our business.  In addition, the federal government has recently considered imposing rent regulations on multifamily properties secured by government-sponsored debt.  These regulations specifically and/or effectively limit or could continue to limit our ability to raise rents or charge certain fees (either of which could have a retroactive effect), enforce residents’ or tenants’ contractual rent obligations or pursue collections, all of which could have an adverse impact on our operations and property values.\n \n\n\nCompliance or failure to comply with regulatory requirements could result in substantial costs.\n \n\n\nOur properties are subject to various federal, state and local regulatory requirements, such as state and local fire and life safety requirements, building and zoning codes, environmental and other related regulations, and federal, state and local accessibility requirements, including and in addition to those imposed by the Americans with Disabilities Act and the Fair Housing Act.  Noncompliance could result in fines, subject us to lawsuits and require us to remediate or repair the noncompliance.  Existing requirements could change and compliance with future requirements may require significant unanticipated expenditures that could adversely affect our financial condition or results of operations.\n\n\nFurther, laws and regulations at the federal, state and local level requiring climate-related disclosures, including the rules proposed by the SEC and the legislation recently enacted in the State of California, may increase compliance and data collection costs if and/or when such laws and regulations become effective.\n\n\n18\n\n\n\n\nTable of Contents\n \n\n\nEnvironmental problems are possible and can be costly.\n\n\nFederal, state and local laws and regulations relating to the protection of the environment may require current or previous owners or operators of real estate to investigate and clean up hazardous or toxic substances at such properties.  The owner or operator may have to pay a governmental entity or third parties for property damage and for investigation and clean-up costs incurred by such parties in connection with the contamination.  These laws typically impose clean-up responsibility and liability without regard to whether the owner or operator knew of or caused the presence of the contaminants.  Even if more than one person may have been responsible for the contamination, each person covered by the environmental laws may be held responsible for all of the clean-up costs incurred.  Third parties may also sue the owner or operator of a site for damages and costs resulting from environmental contamination emanating from that site.  We cannot be assured that existing environmental assessments of our properties reveal all environmental liabilities, that any prior owner of any of our properties did not create a material environmental condition not known to us, or that a material environmental condition does not otherwise exist as to any of our properties.\n\n\nChanges in U.S. accounting standards may materially and adversely affect the reporting of our operations.\n\n\nThe Company follows GAAP, which is established by the Financial Accounting Standards Board (“FASB”), an independent body whose standards are recognized by the SEC as authoritative for publicly held companies.  The FASB and the SEC create and interpret accounting standards and may issue new accounting pronouncements or change the interpretation and application of these standards that govern the preparation of our financial statements.  These changes could have a material impact on our reported consolidated results of operations and financial position.\n\n\nAny weaknesses identified in our internal control over financial reporting could result in a decrease of our share price.\n\n\nSection 404 of the Sarbanes-Oxley Act of 2002 requires us to evaluate and report on our internal control over financial reporting.  If we identify one or more material weaknesses in our internal control over financial reporting, we could lose investor confidence in the accuracy and completeness of our financial reports, which in turn could have a negative impact on our share price.\n\n\nOur failure to qualify as a REIT would have serious adverse consequences to our security holders.\n\n\nWe plan to continue to meet the requirements for taxation as a REIT.  Many of these requirements, for which there is limited judicial and administrative interpretation, however, are highly technical and complex.  Therefore, we cannot guarantee that we have qualified or will qualify as a REIT in the future.  The determination that we are a REIT requires an analysis of various factual matters that may not be totally within our control.  To qualify as a REIT, our assets must be substantially comprised of real estate assets as defined in the Internal Revenue Code of 1986, as amended (the “Code”), and related guidance and our gross income must generally come from rental and other real estate or passive related sources that are itemized in the REIT tax laws.  We are also required to distribute to security holders at least 90% of our REIT taxable income excluding net capital gains.\n\n\nIf we fail to qualify as a REIT, we would be subject to U.S. federal income tax at regular corporate rates and would have to pay significant income taxes unless the Internal Revenue Service (“IRS”) granted us relief under certain statutory provisions.  In addition, we would remain disqualified from taxation as a REIT for four years following the year in which we failed to qualify as a REIT.  We would therefore have less money available for investments or for distributions to security holders and would no longer be required to make distributions to security holders.  This would likely have a significant negative impact on the value of our securities.\n \n\n\nIn addition, we own and may in the future own additional interests in subsidiary entities that have elected or will elect to be taxed as REITs.  As such, each must separately satisfy all of the requirements to qualify for REIT status.  If a subsidiary REIT did not satisfy such requirements, and certain relief provisions did not apply, it would be taxed as a regular corporation and its income would be subject to U.S. federal income taxation.   Failure to comply with these complex REIT rules at the subsidiary REIT level can have a material and detrimental impact to EQR’s REIT status.\n\n\n \n\n\nGain on disposition of assets held for sale in the ordinary course of business is subject to 100% tax.\n \n\n\nAny gain resulting from transfers of properties we hold as inventory or primarily for sale to customers in the ordinary course of business is treated as income from a prohibited transaction subject to a 100% penalty tax unless certain safe harbor exceptions set forth in the Code apply.  We do not believe that our transfers or disposals of property are prohibited transactions.  However, whether property is held for investment purposes is a question that depends on all the facts and circumstances surrounding the particular transaction.  The IRS may contend that certain transfers or dispositions of properties by us or contributions of properties are prohibited transactions.  While we believe the IRS would not prevail in any such dispute, if the IRS were to argue successfully that a transfer or disposition of property constituted a prohibited transaction, we would be required to pay a 100% penalty tax on any gain allocable to us from the prohibited transaction.  In addition, income from a prohibited transaction might adversely affect our ability to satisfy the income tests for qualification as a REIT.\n\n\n19\n\n\n\n\nTable of Contents\n \n\n\nWe may be subject to legislative or regulatory tax changes that could negatively impact our financial condition.\n\n\nAt any time, U.S. federal income tax laws governing REITs or impacting real estate or the administrative interpretations of those laws may be enacted or amended.  We cannot predict if or when any new U.S. federal income tax law, regulation or administrative interpretation, or any amendment to any existing U.S. federal income tax law, IRS and U.S. Department of Treasury regulations or other administrative guidance, will be adopted or become effective and any such law, regulation or interpretation may take effect retroactively.  The Company and our shareholders could be negatively impacted by any such change in, or any new, U.S. federal income tax law, regulations or administrative guidance.\n\n\nDistribution requirements may limit our flexibility to manage our portfolio.\n\n\nIn order to maintain qualification as a REIT under the Code, a REIT must annually distribute to its shareholders at least 90% of its REIT taxable income, excluding the dividends paid deduction and net capital gains.  To the extent the REIT does not distribute all of its net capital gain, or distributes at least 90%, but less than 100% of its REIT taxable income, it will be required to pay regular U.S. federal income tax on the undistributed amount at corporate rates.  In addition, we will be subject to a 4% nondeductible excise tax on amounts, if any, by which distributions we pay in any calendar year are less than the sum of 85% of our ordinary income, 95% of our net capital gains and 100% of our undistributed income from prior years.  We may not have sufficient cash or other liquid assets to meet the 90% distribution requirement. We may be required from time to time, under certain circumstances, to accrue as income for tax purposes interest and rent earned but not yet received.  We may incur a reduction in tax depreciation without a reduction in capital expenditures.  Difficulties in meeting the 90% distribution requirement might arise due to competing demands for our funds or due to timing differences between tax reporting and cash distributions, because deductions may be disallowed, income may be reported before cash is received, expenses may have to be paid before a deduction is allowed or because the IRS may make a determination that adjusts reported income.  In addition, gain from the sale of property may exceed the amount of cash received on a leverage-neutral basis.  A substantial increase to our taxable income may reduce the flexibility of the Company to manage its portfolio through dispositions of properties other than through tax deferred transactions, such as Section 1031 exchanges, or cause the Company to borrow funds or liquidate investments on unfavorable terms in order to meet these distribution requirements.  If we do not dispose of our properties through tax deferred transactions, we may be required to distribute the gain proceeds to shareholders or pay income tax.  If we fail to satisfy the 90% distribution requirement and are unable to cure the deficiency, we would cease to be taxed as a REIT, resulting in substantial tax-related liabilities.\n\n\nWe have a share ownership limit for REIT tax purposes.\n\n\nTo remain qualified as a REIT for U.S. federal income tax purposes, not more than 50% in value of our outstanding Shares may be owned, directly or indirectly, by five or fewer individuals at any time during the last half of any year.  To facilitate maintenance of our REIT qualification, our Declaration of Trust, subject to certain exceptions, prohibits ownership by any single shareholder of more than five percent of the lesser of the number or value of any outstanding class of common or preferred shares (the “Ownership Limit”).  Absent an exemption or waiver granted by our Board of Trustees, securities acquired or held in violation of the Ownership Limit will be transferred to a trust for the exclusive benefit of a designated charitable beneficiary, and the security holder’s rights to distributions and to vote would terminate.  A transfer of Shares may automatically be deemed void if it causes a person to violate the Ownership Limit.  The Ownership Limit could delay or prevent a change in control and, therefore, could affect our security holders’ ability to realize a premium over the then-prevailing market price for their Shares.  To reduce the ability of the Board to use the Ownership Limit as an anti-takeover device, the Company’s Ownership Limit requires, rather than permits, the Board to grant a waiver of the Ownership Limit if the individual seeking a waiver demonstrates that such ownership would not jeopardize the Company’s status as a REIT.\n \n\n\nTax elections regarding distributions may impact future liquidity of the Company or our shareholders.\n\n\nUnder certain circumstances we have made and/or may consider making in the future, a tax election to treat certain distributions to shareholders made after the close of a taxable year as having been distributed during such closed taxable year.  This election, which is provided for in the Code, may allow us to avoid increasing our dividends or paying additional income taxes in the current year.  However, this could result in a constraint on our ability to decrease our dividends in future years without creating risk of either violating the REIT distribution requirements or generating additional income tax liability.  In addition, the Company may be required to pay interest to the IRS based on such a distribution.\n\n\nIn order to retain liquidity and continue to satisfy the REIT distribution requirements, the Company could issue shares rather than pay a dividend entirely in cash to shareholders. The IRS has published several rulings which have allowed REITs to offer shareholders the choice between shares or cash as a form of payment of a dividend (an “elective stock dividend”).  However, REITs are generally required to structure the cash component to be no less than 20% of the total dividend paid.  Therefore, it is possible that the total tax burden to shareholders resulting from an elective stock dividend may exceed the amount of cash received by the shareholder.\n\n\nCertain provisions of Maryland law could inhibit changes in control.\n\n\nCertain provisions of Maryland law applicable to REITs prohibit “business combinations” (including certain issuances of equity securities) with any person who beneficially owns ten percent or more of the voting power of outstanding securities, or with an affiliate\n \n\n\n20\n\n\n\n\nTable of Contents\n \n\n\nwho, at any time within the two-year period prior to the date in question, was the beneficial owner of ten percent or more of the voting power of the Company’s outstanding voting securities (an “Interested Shareholder”), or with an affiliate of an Interested Shareholder.  These prohibitions last for five years after the most recent date on which the Interested Shareholder became an Interested Shareholder.  After the five-year period, a business combination with an Interested Shareholder must be approved by two super-majority shareholder votes unless, among other conditions, holders of common shares receive a minimum price for their shares and the consideration is received in cash or in the same form as previously paid by the Interested Shareholder for its common shares.\n\n\nGeneral Risk Factors\n\n\nRisk of Pandemics or Other Health Crises.\n \n\n\nPandemics, epidemics or other health crises or public emergencies have and could in the future disrupt our business.  Both global and locally targeted health events could materially affect areas where our properties, corporate/regional offices or major service providers are located.  These events have and could in the future have an adverse effect on our business, results of operations, financial condition and liquidity, which could also heighten many of the other risks described elsewhere in this Item 1A, \nRisk Factors\n.\n \n\n\nSignificant inflation could negatively impact our business.\n\n\nSubstantial inflationary pressures can adversely affect us by disproportionately increasing the costs of land, materials, labor and other costs needed to operate our business.  In a highly inflationary environment, we may not be able to raise rental rates at or above the rate of inflation, which could reduce our profit margins.  If we are unable to increase our rental prices to offset the effects of inflation, our business, results of operations, cash flows and financial condition could be adversely affected.  In addition, interest rate increases enacted to combat inflation have caused market disruption and could continue to prevent us from acquiring or disposing of assets on favorable terms or at all.\n\n\nThe occurrence of cyber incidents, or a deficiency in our cybersecurity, could negatively impact our business by causing a disruption to our operations, a compromise or corruption of our confidential information, and/or damage to our reputation and business relationships, all of which could negatively impact our financial results.\n\n\nA cybersecurity incident is an unauthorized occurrence, or a series of related unauthorized occurrences, on or conducted through the Company's information systems that jeopardizes the confidentiality, integrity or availability of our information systems or any information residing therein.  These events can include gaining unauthorized access to systems to disrupt operations, corrupt data or steal confidential information, including information regarding our residents, prospective residents, employees and employees’ dependents.\n \n\n\nDespite system redundancy, the implementation of security measures, required employee awareness training and the existence of a disaster recovery plan, our information technology systems, including those maintained by third-party vendors with which we do business, are vulnerable to damage and interruption from any number of sources beyond our control, including energy blackouts, natural disasters, terrorism, geopolitical events, telecommunication failures and cyber attacks.  We face risks associated with security breaches, whether through cyber attacks or cyber intrusions over the Internet, malware, computer viruses, attachments to emails, phishing attempts, social engineering, ransomware or other scams, persons inside our organization or persons/vendors with access to our systems and other significant disruptions of our information technology networks and related systems, including property infrastructure.  These risks have increased due to increased reliance on remote working and other electronic interactions with our current and prospective residents.  Our information technology networks and related systems are essential to the operation of our business and our ability to perform day-to-day operations.  We use these systems to manage our resident and vendor relationships, internal communications, accounting and record-keeping systems and many other key aspects of our business.  Our operations rely on the secure processing, storage and transmission of confidential and other information in our computer systems and networks, which also depend on the strength of our procedures and the effectiveness of our internal controls as well as those of vendors with whom we do business.  Even the most well-protected information, networks, systems and facilities remain potentially vulnerable because the techniques used in such attempted security breaches evolve and generally are not recognized until launched against a target, and in some cases are designed not to be detected and, in fact, may not be detected.  Accordingly, we may be unable to anticipate these techniques or to implement adequate security barriers or other preventative measures, and thus it is impossible for us to entirely mitigate this risk.\n \n\n\nWe may periodically collect and store personally identifiable information of our residents and prospective residents in connection with our leasing activities, and we may collect and store personally identifiable information of our employees and their dependents.  In addition, we often engage third-party service providers that may have access to such personally identifiable information in connection with providing necessary information technology, security and other business services to us.  Despite the fact that we monitor and perform a comprehensive review of businesses that we contract with that represent a cybersecurity risk to the organization, the systems of these third-party service providers may contain defects in design or other problems that could unexpectedly compromise personally\n \n\n\n21\n\n\n\n\nTable of Contents\n \n\n\nidentifiable information or lead to other types of cyber breaches.  Although we make efforts to maintain the security and integrity of our information technology networks and those of our third-party providers and we have implemented various measures to manage the risk of a security breach or disruption, there can be no assurance that our security efforts and measures will be effective or that attempted security breaches or disruptions would not be successful or damaging.\n \n\n\nA breach or significant and extended disruption in the function of our systems, including our primary website, could damage our reputation and cause us to lose residents and revenues, result in a violation of applicable privacy and other laws, generate third-party claims, result in the unintended and/or unauthorized public disclosure or the misappropriation of proprietary, personally identifiable and confidential information and require us to incur significant expenses to address and remediate or otherwise resolve these kinds of issues.  We may not be able to recover these expenses in whole or in any part from our service providers, our insurers or any other responsible parties.  Our insurance coverage may not be sufficient to cover all losses related to cybersecurity incidents.  As a result, there can be no assurance that our financial results would not be negatively impacted.\n\n\nWe are also subject to laws, rules, and regulations in the United States, such as the California Privacy Rights Act (“CPRA”), relating to the collection, use, and security of resident, tenant, employee and other data.  Evolving compliance and operational requirements under the CPRA and the privacy laws of other jurisdictions in which we operate may impose significant costs that are likely to increase over time.  Our failure to comply with laws, rules and regulations related to privacy and data protection could harm our business or reputation or subject us to fines and penalties.\n\n\nOur business and operations rely on specialized information technology systems, the failure of or inadequacy of which could impact our business.\n\n\nOur ability to identify, implement and maintain appropriate information technology systems differentiates and creates competitive advantages for us in the operations of our business.  These systems often are developed and hosted by third-party vendors whom we rely upon for ongoing maintenance, upgrades and enhancements.  While we maintain a rigorous process around selecting appropriate information technology systems and partnering with vendors, our failure to adequately do so could negatively impact our operations and competitive position.\n\n\nOur approach to artificial intelligence may not be successful and could adversely affect our business.\n\n\nWe have incorporated and may continue to incorporate the use of generative artificial intelligence (\"AI\") within our business, and these solutions and features may become more important to our operations or to our future growth over time.  Our research and development of AI remains ongoing.  There can be no assurance that we will realize the desired or anticipated benefits, or any benefits, and we may fail to properly implement such technology.  AI presents risks, challenges and unintended consequences that could affect our adoption and use of this technology.  Our competitors or other third parties may incorporate AI in their business operations more quickly or more successfully than we do, which could impair our ability to compete effectively and adversely affect our results of operations.  Additionally, the complex and rapidly evolving landscape around AI may expose us to claims, demands and proceedings by private parties and regulatory authorities and subject us to legal liability as well as reputational harm.\n \n\n\nWe depend on our key personnel.\n\n\nWe depend on the efforts of our trustees and executive officers.  If one or more of them resign or otherwise cease to be employed by us, our business and results of operations and financial condition could be adversely affected.\n \n\n\nLitigation risk could affect our business.\n\n\nWe are involved and may continue to be involved in legal proceedings, claims, class actions, inquiries and governmental investigations in the ordinary course of business.  These legal proceedings may include, but are not limited to, proceedings related to consumer, shareholder, securities, antitrust, employment, environmental, development, condominium conversion, tort, eviction and commercial legal issues.  Litigation can be lengthy and expensive, and it can divert management's attention and resources.  Results cannot be predicted with certainty, and an unfavorable outcome in litigation could result in liability material to our financial condition or results of operations.  See Item 3, \nLegal Proceedings\n, for additional discussion.\n \n\n\nInsurance policies can be costly and may not cover all losses, which may adversely affect our financial condition or results of operations.\n\n\nThe Company’s property, general liability and workers compensation insurance policies provide coverage with substantial per occurrence deductibles and/or self-insured retentions.  These self-insurance retentions can be a material portion of insurance losses in\n \n\n\n22\n\n\n\n\nTable of Contents\n \n\n\nexcess of the base deductibles.  While the Company has previously purchased incremental insurance coverage in the event of multiple non-catastrophic occurrences within the same policy year, these substantial deductible and self-insured retention amounts do expose the Company to greater potential for uninsured losses and this additional coverage may not be available at all or on commercially reasonable terms in the future.  We believe the policy specifications and insured limits of these policies are adequate and appropriate; however, we may not always be able to place the desired amount of third-party coverage due to a significant increase in insurance premiums and deductibles or a decrease in the availability of coverage, a combination of which have exposed and could further expose the Company to uninsured losses.  As a result, our financial results could be adversely affected and may vary significantly from period to period.\n\n\nThe Company relies on third-party insurance providers for its property, general liability, workers compensation and other insurance, and should any of them experience liquidity issues or other financial distress, it could negatively impact their ability to pay claims under the Company’s policies.\n \n\n\nEarthquake risk:  Our policies insuring against earthquake losses have substantial deductibles which are applied to the values of the buildings involved in the loss.  With the geographic concentration of our properties, a single earthquake affecting a market may have a significant negative effect on our financial condition and results of operations, as well as insurers' ability to pay claims.  We cannot assure that an earthquake would not cause damage or losses greater than insured levels.  In the event of a loss in excess of insured limits, we could lose our capital invested in the affected property or market, as well as anticipated future revenue.\n \n\n\nTerrorism risk:  The Company has terrorism insurance coverage which excludes losses from nuclear, biological and chemical attacks.  In the event of a terrorist attack impacting one or more of our properties, we could lose the revenues from the property, our capital investment in the property and possibly face liability claims from residents or others suffering injuries or losses.\n\n\nCatastrophic weather and natural disaster risk:  Our properties may be located in areas that could experience catastrophic weather and other natural disasters from time to time, including wildfires, snow or ice storms, hail, windstorms or hurricanes, drought, flooding or other severe disasters.  These severe weather and natural disasters could cause substantial damages or losses to our properties which may not be covered or could exceed our insurance coverage.  Exposure to this risk could also result in a decrease in demand for properties located in these areas or affected by these conditions.\n \n\n\nClimate change risk: To the extent that significant changes in the climate occur in areas where our properties are located, we may experience severe weather, which may result in physical damage to or decrease the demand for properties located in these areas or affected by these conditions.  Should the impact of climate change be material in nature, significant property damage or destruction of our properties could result.  Our financial condition or results of operations may be adversely affected.  In addition, changes in federal, state and local legislation and regulation based on concerns about climate change could adversely impact the value of our properties or result in increased capital expenditures or operating expenses on our existing properties and our new development properties.\n\n\nProvisions of our Declaration of Trust and Bylaws could inhibit changes in control.\n\n\nCertain provisions of our Declaration of Trust and Bylaws may delay or prevent a change in control of the Company or other transactions that could provide the security holders with a premium over the then-prevailing market price of their securities or which might otherwise be in the best interest of our security holders.  This includes the Ownership Limit described above.  While our existing preferred shares/preference units do not have all of these provisions, any future series of preferred shares/preference units may have certain voting provisions that could delay or prevent a change in control or other transactions that might otherwise be in the interest of our security holders.  Our Bylaws require certain information to be provided by any security holder, or persons acting in concert with such security holder, who proposes business or a nominee at an annual meeting of shareholders, including disclosure of information related to hedging activities and investment strategies with respect to our securities.  These requirements could delay or prevent a change in control or other transactions that might otherwise be in the interest of our security holders.  The Board of Trustees may use its powers to issue preferred shares and to set the terms of such securities to delay or prevent a change in control of the Company even if a change in control were in the interest of the security holders.\n\n\n23\n\n\n\n\nTable of Contents",
  "item7": "Item 7. Management’s Discussion and Analysis of\n Financial Condition and Results of Operations\n\n\nThe following discussion and analysis of the results of operations and financial condition of the Company and the Operating Partnership should be read in connection with the Consolidated Financial Statements and Notes thereto.  Due to the Company’s ability to control the Operating Partnership and its subsidiaries, the Operating Partnership and each such subsidiary entity has been consolidated with the Company for financial reporting purposes, except for any unconsolidated properties/entities.  Capitalized terms used herein and not defined are as defined elsewhere in this Annual Report on Form 10-K.  In addition, please refer to the Definitions section below for various capitalized terms not immediately defined in this Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n.\n\n\nForward-Looking Statements\n\n\nForward-looking statements are intended to be made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.  These statements are based on current expectations, estimates, projections and assumptions made by management.  While the Company’s management believes the assumptions underlying its forward-looking statements are reasonable, such information is inherently subject to uncertainties and may involve certain risks, which could cause actual results, performance or achievements of the Company to differ materially from anticipated future results, performance or achievements expressed or implied by such forward-looking statements.  Many of these uncertainties and risks are difficult to predict and beyond management’s control.  Additional factors that might cause such differences are discussed in Part I of this Annual Report on Form 10-K, particularly those under Item 1A, \nRisk Factors\n.  Forward-looking statements and related uncertainties are also included in the Notes to Consolidated Financial Statements in this report.  Forward-looking statements are not guarantees of future performance, results or events.  The forward-looking statements contained herein are made as of the date hereof and the Company undertakes no obligation to update or supplement these forward-looking statements.\n\n\nOverview\n \n\n\nSee Item 1, \nBusiness\n, for discussion regarding the Company’s overview.\n \n\n\nBusiness Objectives and Operating and Investing Strategies\n\n\nSee Item 1, \nBusiness\n, for discussion regarding the Company’s business objectives and operating and investing strategies.\n \n\n\n30\n\n\n\n\nTable of Contents\n \n\n\nResults of Operations\n\n\n2023 and 2024 Transactions\n\n\nIn conjunction with our business objectives and operating and investing strategies, the following table provides a rollforward of the transactions that occurred during the years ended December 31, 2023 and 2024:\n \n\n\n \n\n\nPortfolio Rollforward\n\n\n($ in thousands)\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nProperties\n\n\n \n\n\n \n\n\nApartment\nUnits\n\n\n \n\n\n \n\n\nPurchase Price\n\n\n \n\n\n \n\n\nAcquisition\nCap Rate\n\n\n \n\n\n\n\n\n\n12/31/2022\n\n\n \n\n\n \n\n\n308\n\n\n \n\n\n \n\n\n \n\n\n79,597\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAcquisitions:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nConsolidated Rental Properties\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n577\n\n\n \n\n\n \n\n\n$\n\n\n189,734\n\n\n \n\n\n \n\n\n \n\n\n5.1\n\n\n%\n\n\n\n\n\n\nConsolidated Rental Properties – Not Stabilized\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n606\n\n\n \n\n\n \n\n\n$\n\n\n176,600\n\n\n \n\n\n \n\n\n \n\n\n5.9\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nSales Price\n\n\n \n\n\n \n\n\nDisposition\nYield\n\n\n \n\n\n\n\n\n\nDispositions:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nConsolidated Rental Properties\n\n\n \n\n\n \n\n\n(11\n\n\n)\n\n\n \n\n\n \n\n\n(912\n\n\n)\n\n\n \n\n\n$\n\n\n(379,893\n\n\n)\n\n\n \n\n\n \n\n\n(5.5\n\n\n)%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCompleted Developments – Consolidated\n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n312\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nConfiguration Changes\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n11\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n12/31/2023\n\n\n \n\n\n \n\n\n302\n\n\n \n\n\n \n\n\n \n\n\n80,191\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPurchase Price\n\n\n \n\n\n \n\n\nAcquisition\nCap Rate\n\n\n \n\n\n\n\n\n\nAcquisitions:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nConsolidated Rental Properties\n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n \n\n\n \n\n\n4,986\n\n\n \n\n\n \n\n\n$\n\n\n1,438,250\n\n\n \n\n\n \n\n\n \n\n\n5.1\n\n\n%\n\n\n\n\n\n\nConsolidated Rental Properties – Not Stabilized\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n387\n\n\n \n\n\n \n\n\n$\n\n\n153,845\n\n\n \n\n\n \n\n\n \n\n\n5.5\n\n\n%\n\n\n\n\n\n\nUnconsolidated Land Parcels\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n33,394\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nSales Price\n\n\n \n\n\n \n\n\nDisposition\nYield\n\n\n \n\n\n\n\n\n\nDispositions:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nConsolidated Rental Properties\n\n\n \n\n\n \n\n\n(13\n\n\n)\n\n\n \n\n\n \n\n\n(2,598\n\n\n)\n\n\n \n\n\n$\n\n\n(975,641\n\n\n)\n\n\n \n\n\n \n\n\n(5.4\n\n\n)%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCompleted Developments – Unconsolidated\n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n1,262\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nConfiguration Changes\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n21\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n12/31/2024\n\n\n \n\n\n \n\n\n311\n\n\n \n\n\n \n\n\n \n\n\n84,249\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nAcquisitions\n\n\n•\nThe consolidated properties acquired in 2023 are located in the Atlanta (3) and Denver markets;\n\n\n•\nIn 2023, the Company acquired its joint venture partner's 10.0% interest in a 200-unit apartment property located in the San Francisco market for $4.6 million, of which the Company paid $3.7 million in cash and ERPOP issued $0.9 million of 3.00% Series Q Preference Units.  The property is now wholly owned.  The Company also repaid $64.7 million of mortgage debt at par prior to maturity in conjunction with the buyout;\n\n\n•\nThe consolidated properties acquired in 2024 are located in the Atlanta (7), Boston, Dallas/Ft. Worth (5) and Denver (5) markets; and\n\n\n•\nIn 2024, the Company acquired its joint venture partner's 8.0% interest in a 312-unit apartment property located in the Washington, D.C. market for $3.1 million in cash.  The property is now wholly owned.  The Company also repaid $67.9 million of the joint venture construction mortgage debt during 2023.\n\n\nDispositions\n\n\n•\nThe consolidated properties disposed of in 2023 were located in the Los Angeles (8), Seattle (2) and San Francisco markets; and\n\n\n31\n\n\n\n\nTable of Contents\n \n\n\n•\nThe consolidated properties disposed of in 2024 were located in the Boston, Orange County, San Francisco (3), Washington, D.C. (5), Seattle (2) and San Diego markets.\n\n\nDevelopments\n\n\n•\nConsolidated:\n\n\n•\nThe Company stabilized one consolidated apartment property during 2023, located in the San Francisco market, consisting of 200 apartment units totaling approximately $116.4 million of development costs; \n\n\n•\nThe Company completed construction on one consolidated apartment property during 2023, located in the Washington, D.C. market, consisting of 312 apartment units totaling approximately $108.0 million of development costs; \n\n\n•\nThe Company spent approximately $78.2 million during 2023, primarily for consolidated development projects;\n\n\n•\nThe Company commenced construction on one partially owned consolidated apartment property during 2024, located in the Boston market, consisting of 440 apartment units totaling approximately $232.2 million of expected development costs;\n\n\n•\nThe Company stabilized one partially owned consolidated apartment property during 2024, located in the Washington, D.C. market, consisting of 312 apartment units totaling approximately $106.0 million of development costs; and\n\n\n•\nThe Company spent approximately $129.8 million during 2024, primarily for consolidated development projects.\n\n\n \n\n\n•\nUnconsolidated:\n\n\n•\nThe Company entered into two separate unconsolidated joint ventures during 2023 for the purpose of developing vacant land parcels in the Boston and Seattle markets.  The Company’s total investment in these two joint ventures was approximately $4.9 million as of December 31, 2023;\n\n\n•\nThe Company spent approximately $42.8 million during 2023, primarily for unconsolidated development projects;\n\n\n•\nThe Company completed construction on four unconsolidated apartment properties during 2024, located in the Denver and Dallas/Ft. Worth (3) markets, consisting of 1,262 apartment units totaling approximately $338.0 million of development costs;\n\n\n•\nThe Company spent approximately $103.8 million during 2024, primarily for unconsolidated development projects; and\n\n\n•\nThe Company previously entered into two separate unconsolidated joint ventures for the purpose of developing vacant land parcels in the Boston and Seattle markets.  During 2024, the joint ventures acquired their respective land parcels for the total purchase price listed above.  The Company commenced construction on these two apartment properties, which are expected to contain 639 total apartment units.  Total expected development cost for these projects is $307.2 million, and the Company's total investment in these two joint ventures is approximately $90.9 million as of December 31, 2024.\n\n\nSee Notes 4 and 5 in the Notes to Consolidated Financial Statements for additional discussion regarding the Company’s real estate investments and investments in partially owned entities.\n\n\n32\n\n\n\n\nTable of Contents\n \n\n\nComparison of the year ended December 31, 2024 to the year ended December 31, 2023\n \n\n\nThe following table presents a reconciliation of diluted earnings per share/unit for the year ended December 31, 2024 as compared to the same period in 2023:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended \nDecember 31\n\n\n \n\n\n\n\n\n\nDiluted earnings per share/unit for full year 2023\n\n\n \n\n\n$\n\n\n2.20\n\n\n \n\n\n\n\n\n\nProperty NOI\n\n\n \n\n\n \n\n\n0.18\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n(0.04\n\n\n)\n\n\n\n\n\n\nCorporate overhead (1)\n\n\n \n\n\n \n\n\n(0.04\n\n\n)\n\n\n\n\n\n\nNet gain/loss on property sales\n\n\n \n\n\n \n\n\n0.68\n\n\n \n\n\n\n\n\n\nDepreciation expense\n\n\n \n\n\n \n\n\n(0.17\n\n\n)\n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n(0.09\n\n\n)\n\n\n\n\n\n\nDiluted earnings per share/unit for full year 2024\n\n\n \n\n\n$\n\n\n2.72\n\n\n \n\n\n\n\n\n\n \n\n\n(1)\nCorporate overhead includes property management and general and administrative expenses.\n\n\nThe Company’s primary financial measure for evaluating each of its apartment communities is net operating income (“NOI”).  NOI represents rental income less direct property operating expenses (including real estate taxes and insurance).  The Company believes that NOI is helpful to investors as a supplemental measure of its operating performance because it is a direct measure of the actual operating results of the Company’s apartment properties.\n \n\n\nThe following tables present reconciliations of net income per the consolidated statements of operations to NOI, along with rental income, operating expenses and NOI per the consolidated statements of operations allocated between same store and non-same store/other results (amounts in thousands):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n$\nChange\n\n\n \n\n\n \n\n\n%\nChange\n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n1,070,975\n\n\n \n\n\n \n\n\n$\n\n\n868,488\n\n\n \n\n\n \n\n\n$\n\n\n202,487\n\n\n \n\n\n \n\n\n \n\n\n23.3\n\n\n%\n\n\n\n\n\n\nAdjustments:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProperty management\n\n\n \n\n\n \n\n\n132,739\n\n\n \n\n\n \n\n\n \n\n\n119,804\n\n\n \n\n\n \n\n\n \n\n\n12,935\n\n\n \n\n\n \n\n\n \n\n\n10.8\n\n\n%\n\n\n\n\n\n\nGeneral and administrative\n\n\n \n\n\n \n\n\n61,653\n\n\n \n\n\n \n\n\n \n\n\n60,716\n\n\n \n\n\n \n\n\n \n\n\n937\n\n\n \n\n\n \n\n\n \n\n\n1.5\n\n\n%\n\n\n\n\n\n\nDepreciation\n\n\n \n\n\n \n\n\n952,191\n\n\n \n\n\n \n\n\n \n\n\n888,709\n\n\n \n\n\n \n\n\n \n\n\n63,482\n\n\n \n\n\n \n\n\n \n\n\n7.1\n\n\n%\n\n\n\n\n\n\nNet (gain) loss on sales of real estate properties\n\n\n \n\n\n \n\n\n(546,797\n\n\n)\n\n\n \n\n\n \n\n\n(282,539\n\n\n)\n\n\n \n\n\n \n\n\n(264,258\n\n\n)\n\n\n \n\n\n \n\n\n93.5\n\n\n%\n\n\n\n\n\n\nInterest and other income\n\n\n \n\n\n \n\n\n(30,329\n\n\n)\n\n\n \n\n\n \n\n\n(22,345\n\n\n)\n\n\n \n\n\n \n\n\n(7,984\n\n\n)\n\n\n \n\n\n \n\n\n35.7\n\n\n%\n\n\n\n\n\n\nOther expenses\n\n\n \n\n\n \n\n\n74,051\n\n\n \n\n\n \n\n\n \n\n\n29,419\n\n\n \n\n\n \n\n\n \n\n\n44,632\n\n\n \n\n\n \n\n\n \n\n\n151.7\n\n\n%\n\n\n\n\n\n\nInterest:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nExpense incurred, net\n\n\n \n\n\n \n\n\n285,735\n\n\n \n\n\n \n\n\n \n\n\n269,556\n\n\n \n\n\n \n\n\n \n\n\n16,179\n\n\n \n\n\n \n\n\n \n\n\n6.0\n\n\n%\n\n\n\n\n\n\nAmortization of deferred financing costs\n\n\n \n\n\n \n\n\n7,834\n\n\n \n\n\n \n\n\n \n\n\n8,941\n\n\n \n\n\n \n\n\n \n\n\n(1,107\n\n\n)\n\n\n \n\n\n \n\n\n(12.4\n\n\n)%\n\n\n\n\n\n\nIncome and other tax expense (benefit)\n\n\n \n\n\n \n\n\n1,256\n\n\n \n\n\n \n\n\n \n\n\n1,148\n\n\n \n\n\n \n\n\n \n\n\n108\n\n\n \n\n\n \n\n\n \n\n\n9.4\n\n\n%\n\n\n\n\n\n\n(Income) loss from investments in unconsolidated entities\n\n\n \n\n\n \n\n\n8,974\n\n\n \n\n\n \n\n\n \n\n\n5,378\n\n\n \n\n\n \n\n\n \n\n\n3,596\n\n\n \n\n\n \n\n\n \n\n\n66.9\n\n\n%\n\n\n\n\n\n\nTotal NOI\n\n\n \n\n\n$\n\n\n2,018,282\n\n\n \n\n\n \n\n\n$\n\n\n1,947,275\n\n\n \n\n\n \n\n\n$\n\n\n71,007\n\n\n \n\n\n \n\n\n \n\n\n3.6\n\n\n%\n\n\n\n\n\n\nRental income:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSame store\n\n\n \n\n\n$\n\n\n2,823,418\n\n\n \n\n\n \n\n\n$\n\n\n2,740,193\n\n\n \n\n\n \n\n\n$\n\n\n83,225\n\n\n \n\n\n \n\n\n \n\n\n3.0\n\n\n%\n\n\n\n\n\n\nNon-same store/other\n\n\n \n\n\n \n\n\n156,690\n\n\n \n\n\n \n\n\n \n\n\n133,771\n\n\n \n\n\n \n\n\n \n\n\n22,919\n\n\n \n\n\n \n\n\n \n\n\n17.1\n\n\n%\n\n\n\n\n\n\nTotal rental income\n\n\n \n\n\n \n\n\n2,980,108\n\n\n \n\n\n \n\n\n \n\n\n2,873,964\n\n\n \n\n\n \n\n\n \n\n\n106,144\n\n\n \n\n\n \n\n\n \n\n\n3.7\n\n\n%\n\n\n\n\n\n\nOperating expenses:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSame store\n\n\n \n\n\n \n\n\n894,477\n\n\n \n\n\n \n\n\n \n\n\n869,635\n\n\n \n\n\n \n\n\n \n\n\n24,842\n\n\n \n\n\n \n\n\n \n\n\n2.9\n\n\n%\n\n\n\n\n\n\nNon-same store/other\n\n\n \n\n\n \n\n\n67,349\n\n\n \n\n\n \n\n\n \n\n\n57,054\n\n\n \n\n\n \n\n\n \n\n\n10,295\n\n\n \n\n\n \n\n\n \n\n\n18.0\n\n\n%\n\n\n\n\n\n\nTotal operating expenses\n\n\n \n\n\n \n\n\n961,826\n\n\n \n\n\n \n\n\n \n\n\n926,689\n\n\n \n\n\n \n\n\n \n\n\n35,137\n\n\n \n\n\n \n\n\n \n\n\n3.8\n\n\n%\n\n\n\n\n\n\nNOI:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSame store\n\n\n \n\n\n \n\n\n1,928,941\n\n\n \n\n\n \n\n\n \n\n\n1,870,558\n\n\n \n\n\n \n\n\n \n\n\n58,383\n\n\n \n\n\n \n\n\n \n\n\n3.1\n\n\n%\n\n\n\n\n\n\nNon-same store/other\n\n\n \n\n\n \n\n\n89,341\n\n\n \n\n\n \n\n\n \n\n\n76,717\n\n\n \n\n\n \n\n\n \n\n\n12,624\n\n\n \n\n\n \n\n\n \n\n\n16.5\n\n\n%\n\n\n\n\n\n\nTotal NOI\n\n\n \n\n\n$\n\n\n2,018,282\n\n\n \n\n\n \n\n\n$\n\n\n1,947,275\n\n\n \n\n\n \n\n\n$\n\n\n71,007\n\n\n \n\n\n \n\n\n \n\n\n3.6\n\n\n%\n\n\n\n\n\n\n \n\n\nSee Note 16 in the Notes to Consolidated Financial Statements for our disclosure of reportable segments.\n\n\n \n\n\n•\nThe increase in same store rental income is primarily driven by good demand and modest supply across most of our markets.\n\n\n33\n\n\n\n\nTable of Contents\n \n\n\n•\nThe increase in same store operating expenses is due primarily to:\n\n\n•\nReal estate taxes – An $11.2 million increase due to escalation in rates and assessed values including an approximately one percentage point contribution to growth from 421-a tax abatement burnoffs in New York City.  Once the burnoffs are completed, previously rent-restricted apartment units will transition to market;\n\n\n•\nOther on-site operating expenses – A $3.4 million increase primarily driven by higher property-related legal expenses;\n\n\n•\nInsurance – A $3.3 million increase due to higher premiums on property insurance renewal due to conditions in the insurance market that while less difficult than recent years, remain challenging;\n\n\n•\nUtilities – A $3.4 million increase primarily driven by higher water, sewer and trash expense, partially offset by lower commodity prices for gas and electric; and\n\n\n•\nRepairs and maintenance – A $2.3 million increase primarily driven by higher minimum wage on contracted services, partially offset by lower resident Turnover compared to the same period of 2023.\n\n\n•\nNon-same store/other NOI results consist primarily of properties acquired in calendar years 2023 and 2024, operations from the Company’s development properties, other corporate operations and operations prior to disposition from 2023 and 2024 sold properties.  The increase in NOI is primarily a result of the Company's net acquisition activity during 2024.\n\n\n•\nThe increase in consolidated total NOI is primarily a result of the Company’s higher NOI from same store properties, largely due to improvement in same store revenues as noted above and the Company's continued focus on same store expense efficiency.\n\n\nSee the \nSame Store Results\n section below for additional discussion of those results.  See the reconciliation table of net income per the consolidated statements of operations to NOI above for the dollar and percentage changes related to the comparison discussions provided below.\n\n\nProperty management expenses include off-site expenses associated with the self-management of the Company’s properties as well as management fees paid to any third-party management companies.  The increase during the year ended December 31, 2024 as compared to 2023 is primarily attributable to increases in payroll-related costs, information technology expenses and legal and professional fees.\n\n\nGeneral and administrative expenses, which include corporate operating expenses, increased during the year ended December 31, 2024 as compared to 2023, primarily due to increases in legal and professional fees and other public company costs, partially offset by decreases in payroll-related costs.\n \n\n\nDepreciation expense increased during the year ended December 31, 2024 as compared to 2023, primarily as a result of additional depreciation expense on properties acquired in 2023 and 2024 and development properties placed in service during 2023 and 2024, partially offset by lower depreciation from properties sold in 2023 and 2024.\n\n\nNet gain on sales of real estate properties increased during the year ended December 31, 2024 as compared to 2023, primarily as a result of a significantly higher dollar sales volume and the mix of properties sold in 2024 vs. 2023.\n \n\n\nInterest and other income increased during the year ended December 31, 2024 as compared to 2023, primarily due to a net increase in realized/unrealized gains on various investment securities, short-term investment income on restricted deposit accounts due to a higher rate environment and higher overall invested balances as well as insurance/litigation settlement proceeds received during 2024 that did not occur in 2023.\n\n\nOther expenses increased during the year ended December 31, 2024 as compared to 2023, primarily due to increases in litigation accruals and advocacy contributions, partially offset by decreases in data transformation project costs that occurred during 2023 but not during 2024.\n \n\n\nInterest expense, including amortization of deferred financing costs, increased during the year ended December 31, 2024 as compared to 2023, primarily due to higher overall debt balances outstanding and higher overall rates, partially offset by higher capitalized interest.  The effective interest cost on all indebtedness, excluding debt extinguishment costs/prepayment penalties, for the year ended December 31, 2024 was 3.91% as compared to 3.82% in 2023.  The Company capitalized interest of approximately $14.5 million and $12.3 million during the years ended December 31, 2024 and 2023, respectively.\n \n\n\nLoss from investments in unconsolidated entities increased during the year ended December 31, 2024 as compared to 2023, primarily as a result of losses incurred on our unconsolidated development properties which recently started lease-up activities, partially offset by increases in net income of unconsolidated operating properties and a gain on sale of an unconsolidated operating property.\n\n\n34\n\n\n\n\nTable of Contents\n \n\n\nFor comparison of the year ended December 31, 2023 to the year ended December 31, 2022, refer to Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n, included in the Company’s and the Operating Partnership’s Annual Report on Form 10-K for the year ended December 31, 2023.\n\n\nSame Store Results\n\n\nProperties that the Company owned and were stabilized for all of both 2024 and 2023, which represented 75,299 apartment units, drove the Company’s results of operations.  Properties are considered “stabilized” when they have achieved 90% Physical Occupancy for three consecutive months.\n \n\n\nThe following table provides results and statistics related to our Residential same store operations for the years ended December 31, 2024 and 2023:\n \n\n\n \n\n\n2024 vs. 2023\n \n\n\nSame Store Residential Results/Statistics by Market\t\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nIncrease (Decrease) from Prior Year\n\n\n \n\n\n\n\n\n\nMarkets/Metro Areas\n\n\n \n\n\nApartment\nUnits\n\n\n \n\n\n \n\n\n2024 \n% of \nActual  \nNOI\n\n\n \n\n\n \n\n\n2024 \nAverage \nRental \nRate\n\n\n \n\n\n \n\n\n2024 \nWeighted \nAverage \nPhysical \nOccupancy %\n\n\n \n\n\n \n\n\n2024 \nTurnover\n\n\n \n\n\n \n\n\nAverage\nRental \nRate\n\n\n \n\n\n \n\n\nPhysical\nOccupancy\n\n\n \n\n\n \n\n\nTurnover\n\n\n \n\n\n\n\n\n\nLos Angeles\n\n\n \n\n\n \n\n\n14,136\n\n\n \n\n\n \n\n\n \n\n\n17.7\n\n\n%\n\n\n \n\n\n$\n\n\n2,933\n\n\n \n\n\n \n\n\n \n\n\n95.6\n\n\n%\n\n\n \n\n\n \n\n\n43.3\n\n\n%\n\n\n \n\n\n \n\n\n2.5\n\n\n%\n\n\n \n\n\n \n\n\n0.3\n\n\n%\n\n\n \n\n\n \n\n\n(1.2\n\n\n%)\n\n\n\n\n\n\nOrange County\n\n\n \n\n\n \n\n\n3,718\n\n\n \n\n\n \n\n\n \n\n\n5.3\n\n\n%\n\n\n \n\n\n \n\n\n2,925\n\n\n \n\n\n \n\n\n \n\n\n95.9\n\n\n%\n\n\n \n\n\n \n\n\n38.2\n\n\n%\n\n\n \n\n\n \n\n\n3.7\n\n\n%\n\n\n \n\n\n \n\n\n(0.4\n\n\n%)\n\n\n \n\n\n \n\n\n0.6\n\n\n%\n\n\n\n\n\n\nSan Diego\n\n\n \n\n\n \n\n\n2,649\n\n\n \n\n\n \n\n\n \n\n\n4.1\n\n\n%\n\n\n \n\n\n \n\n\n3,167\n\n\n \n\n\n \n\n\n \n\n\n95.9\n\n\n%\n\n\n \n\n\n \n\n\n40.6\n\n\n%\n\n\n \n\n\n \n\n\n3.5\n\n\n%\n\n\n \n\n\n \n\n\n0.5\n\n\n%\n\n\n \n\n\n \n\n\n(1.3\n\n\n%)\n\n\n\n\n\n\nSubtotal – Southern California\n\n\n \n\n\n \n\n\n20,503\n\n\n \n\n\n \n\n\n \n\n\n27.1\n\n\n%\n\n\n \n\n\n \n\n\n2,962\n\n\n \n\n\n \n\n\n \n\n\n95.7\n\n\n%\n\n\n \n\n\n \n\n\n42.0\n\n\n%\n\n\n \n\n\n \n\n\n2.9\n\n\n%\n\n\n \n\n\n \n\n\n0.2\n\n\n%\n\n\n \n\n\n \n\n\n(0.9\n\n\n%)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSan Francisco\n\n\n \n\n\n \n\n\n11,093\n\n\n \n\n\n \n\n\n \n\n\n16.1\n\n\n%\n\n\n \n\n\n \n\n\n3,326\n\n\n \n\n\n \n\n\n \n\n\n96.1\n\n\n%\n\n\n \n\n\n \n\n\n44.2\n\n\n%\n\n\n \n\n\n \n\n\n1.1\n\n\n%\n\n\n \n\n\n \n\n\n0.5\n\n\n%\n\n\n \n\n\n \n\n\n(0.1\n\n\n%)\n\n\n\n\n\n\nWashington, D.C.\n\n\n \n\n\n \n\n\n13,534\n\n\n \n\n\n \n\n\n \n\n\n15.9\n\n\n%\n\n\n \n\n\n \n\n\n2,743\n\n\n \n\n\n \n\n\n \n\n\n96.8\n\n\n%\n\n\n \n\n\n \n\n\n40.7\n\n\n%\n\n\n \n\n\n \n\n\n4.6\n\n\n%\n\n\n \n\n\n \n\n\n0.0\n\n\n%\n\n\n \n\n\n \n\n\n0.0\n\n\n%\n\n\n\n\n\n\nNew York\n\n\n \n\n\n \n\n\n8,536\n\n\n \n\n\n \n\n\n \n\n\n14.6\n\n\n%\n\n\n \n\n\n \n\n\n4,640\n\n\n \n\n\n \n\n\n \n\n\n97.3\n\n\n%\n\n\n \n\n\n \n\n\n33.6\n\n\n%\n\n\n \n\n\n \n\n\n3.0\n\n\n%\n\n\n \n\n\n \n\n\n0.5\n\n\n%\n\n\n \n\n\n \n\n\n(3.6\n\n\n%)\n\n\n\n\n\n\nBoston\n\n\n \n\n\n \n\n\n7,077\n\n\n \n\n\n \n\n\n \n\n\n11.3\n\n\n%\n\n\n \n\n\n \n\n\n3,615\n\n\n \n\n\n \n\n\n \n\n\n96.0\n\n\n%\n\n\n \n\n\n \n\n\n41.5\n\n\n%\n\n\n \n\n\n \n\n\n3.6\n\n\n%\n\n\n \n\n\n \n\n\n0.0\n\n\n%\n\n\n \n\n\n \n\n\n(2.6\n\n\n%)\n\n\n\n\n\n\nSeattle\n\n\n \n\n\n \n\n\n8,853\n\n\n \n\n\n \n\n\n \n\n\n10.2\n\n\n%\n\n\n \n\n\n \n\n\n2,607\n\n\n \n\n\n \n\n\n \n\n\n96.2\n\n\n%\n\n\n \n\n\n \n\n\n45.2\n\n\n%\n\n\n \n\n\n \n\n\n1.2\n\n\n%\n\n\n \n\n\n \n\n\n1.0\n\n\n%\n\n\n \n\n\n \n\n\n(3.1\n\n\n%)\n\n\n\n\n\n\nDenver\n\n\n \n\n\n \n\n\n2,505\n\n\n \n\n\n \n\n\n \n\n\n2.6\n\n\n%\n\n\n \n\n\n \n\n\n2,410\n\n\n \n\n\n \n\n\n \n\n\n96.2\n\n\n%\n\n\n \n\n\n \n\n\n54.9\n\n\n%\n\n\n \n\n\n \n\n\n0.2\n\n\n%\n\n\n \n\n\n \n\n\n(0.1\n\n\n%)\n\n\n \n\n\n \n\n\n(3.2\n\n\n%)\n\n\n\n\n\n\nOther Expansion Markets\n\n\n \n\n\n \n\n\n3,198\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n%\n\n\n \n\n\n \n\n\n1,946\n\n\n \n\n\n \n\n\n \n\n\n95.1\n\n\n%\n\n\n \n\n\n \n\n\n56.9\n\n\n%\n\n\n \n\n\n \n\n\n(2.2\n\n\n%)\n\n\n \n\n\n \n\n\n0.3\n\n\n%\n\n\n \n\n\n \n\n\n(1.0\n\n\n%)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n \n\n\n75,299\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n$\n\n\n3,127\n\n\n \n\n\n \n\n\n \n\n\n96.2\n\n\n%\n\n\n \n\n\n \n\n\n42.5\n\n\n%\n\n\n \n\n\n \n\n\n2.6\n\n\n%\n\n\n \n\n\n \n\n\n0.3\n\n\n%\n\n\n \n\n\n \n\n\n(1.5\n\n\n%)\n\n\n\n\n\n\n \n\n\nNote: The above table reflects Residential same store results only.  Residential operations account for more than 96.0% of total revenues for the year ended December 31, 2024.\n\n\nDuring the year ended December 31, 2024, the Company's operating business performed well, with healthy demand across most of our markets supported by a continuing solid job market, high employment levels and high wage growth among our target renter demographic.  Competitive new supply was modest in our Established Markets, but has been elevated in our Expansion Markets.  As expected, our East Coast markets were our best performers.  On the West Coast, Seattle showed improvement, while San Francisco improved but at a more modest pace.  Our Southern California markets (namely the city of Los Angeles) showed good demand but greater price sensitivity during the second half of 2024, though pricing started improving later in the year.\n\n\nWe continued to make progress in delinquent resident move-out activity, which reduced delinquencies in our portfolio.  However, that progress was slower during 2024 than originally anticipated.\n\n\nActivity in the transaction market was intermittent in 2024.  However, we were able to source attractive opportunities to acquire properties in our Expansion Markets.  We are excited to grow our portfolio and create operating scale in these markets as we execute on our strategy to optimize our portfolio allocation.\n\n\nOverall, the fundamentals of our business are healthy.  Long-term, we expect elevated single family home ownership costs, positive household formation trends, manageable competitive new supply in our Established Markets and moderating competitive new supply in our Expansion Markets.  With an overall deficit in housing across the country, we believe our business is well positioned for the future.  We also see our resident base as being resilient to economic uncertainty, including elevated inflation, due to higher levels of disposable income and lower relative rent-to-income ratios.\n\n\n Liquidity and Capital Resources\n\n\n \n\n\nWith approximately $2.0 billion in readily available liquidity, a strong balance sheet, limited near-term debt maturities, very strong credit metrics and ample access to capital markets, the Company believes it is well positioned to meet its future obligations and take advantage of opportunities.  See further discussion below.\n \n\n\n35\n\n\n\n\nTable of Contents\n \n\n\nStatements of Cash Flows\n \n\n\nThe following table sets forth our sources and uses of cash flows for the years ended December 31, 2024, 2023 and 2022 (amounts in thousands):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCash flows provided by (used for):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating activities\n\n\n \n\n\n$\n\n\n1,573,607\n\n\n \n\n\n \n\n\n$\n\n\n1,532,798\n\n\n \n\n\n \n\n\n$\n\n\n1,454,756\n\n\n \n\n\n\n\n\n\nInvesting activities\n\n\n \n\n\n$\n\n\n(1,176,484\n\n\n)\n\n\n \n\n\n$\n\n\n(409,504\n\n\n)\n\n\n \n\n\n$\n\n\n107,792\n\n\n \n\n\n\n\n\n\nFinancing activities\n\n\n \n\n\n$\n\n\n(376,952\n\n\n)\n\n\n \n\n\n$\n\n\n(1,120,471\n\n\n)\n\n\n \n\n\n$\n\n\n(1,785,612\n\n\n)\n\n\n\n\n\n\n \n\n\nThe following provides information regarding the Company’s cash flows from operating, investing and financing activities for the year ended December 31, 2024.\n\n\nOperating Activities\n\n\nOur operating cash flows are primarily impacted by NOI and its components, such as Average Rental Rates, Physical Occupancy levels and operating expenses related to our properties.  Cash provided by operating activities for the year ended December 31, 2024 as compared to 2023 increased by approximately $40.8 million primarily as a result of the NOI and other changes discussed above in \nResults of Operations\n.\n\n\nInvesting Activities\n\n\nOur investing cash flows are primarily impacted by our transaction activity (acquisitions/dispositions), development spend and capital expenditures.  For the year ended December 31, 2024, key drivers were:\n\n\n•\nAcquired eighteen consolidated rental properties for approximately $1.6 billion;\n\n\n•\nDisposed of thirteen consolidated rental properties, receiving net proceeds of approximately $960.4 million;\n\n\n•\nInvested $129.8 million primarily in consolidated development projects;\n\n\n•\nInvested $109.7 million primarily in unconsolidated development joint venture entities as well as unconsolidated investments in real estate technology funds/companies for various technology initiatives; and\n\n\n•\nInvested $301.4 million in capital expenditures to real estate presented in the table below.\n\n\nFor the year ended December 31, 2024, our actual capital expenditures to real estate included the following (amounts in thousands except for apartment unit and per apartment unit amounts):\n\n\nCapital Expenditures to Real Estate\n\n\nFor the Year Ended December 31, 2024\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nSame Store \nProperties\n\n\n \n\n\n \n\n\nNon-Same Store \nProperties/Other\n\n\n \n\n\n \n\n\nTotal Consolidated\nProperties\n\n\n \n\n\n \n\n\nSame Store Avg. \nPer Apartment Unit\n\n\n \n\n\n\n\n\n\nTotal Consolidated Apartment Units\n\n\n \n\n\n \n\n\n75,299\n\n\n \n\n\n \n\n\n \n\n\n7,688\n\n\n \n\n\n \n\n\n \n\n\n82,987\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBuilding Improvements\n\n\n \n\n\n$\n\n\n122,515\n\n\n \n\n\n \n\n\n$\n\n\n12,781\n\n\n \n\n\n(2)\n\n\n$\n\n\n135,296\n\n\n \n\n\n \n\n\n$\n\n\n1,627\n\n\n \n\n\n\n\n\n\nRenovation Expenditures\n\n\n \n\n\n \n\n\n100,456\n\n\n \n\n\n(1)\n\n\n \n\n\n10,837\n\n\n \n\n\n(2)\n\n\n \n\n\n111,293\n\n\n \n\n\n \n\n\n \n\n\n1,334\n\n\n \n\n\n\n\n\n\nReplacements\n\n\n \n\n\n \n\n\n51,026\n\n\n \n\n\n \n\n\n \n\n\n3,819\n\n\n \n\n\n \n\n\n \n\n\n54,845\n\n\n \n\n\n \n\n\n \n\n\n678\n\n\n \n\n\n\n\n\n\nTotal Capital Expenditures to Real Estate\n\n\n \n\n\n$\n\n\n273,997\n\n\n \n\n\n \n\n\n$\n\n\n27,437\n\n\n \n\n\n \n\n\n$\n\n\n301,434\n\n\n \n\n\n \n\n\n$\n\n\n3,639\n\n\n \n\n\n\n\n\n\n \n\n\n(1)\nRenovation Expenditures – Amounts for 3,353 same store apartment units approximated $30,000 per apartment unit renovated.\n\n\n(2)\nIncludes expenditures for two properties that have been removed from same store while undergoing major renovations requiring a significant number of apartment units to be vacated to accommodate the extensive planned improvements.  The renovation at one property was substantially completed in the second quarter of 2024, while the renovation of the other is ongoing and expected to continue into 2026.\n\n\n36\n\n\n\n\nTable of Contents\n \n\n\nFinancing Activities\n\n\nOur financing cash flows primarily relate to our borrowing activity (debt proceeds or repayment), distributions/dividends to shareholders/unitholders and other Common Share activity.  For the year ended December 31, 2024, key drivers were:\n\n\n•\nIssued Common Shares related to share option exercises and ESPP purchases and received net proceeds of $26.5 million;\n\n\n•\nPaid dividends/distributions on Common Shares, Preferred Shares, Units (including OP Units and restricted units) and noncontrolling interests in partially owned properties totaling approximately $1.1 billion;\n\n\n•\nRepurchased and retired 652,452 Common Shares, at a weighted average purchase price of $58.95 per share, for an aggregate purchased amount of approximately $38.5 million.  See Note 3 in the Notes to Consolidated Financial Statements for further discussion;\n\n\n•\nRepurchased and retired 402,500 Series K Preferred Shares/Preference Units with a liquidation value of approximately $20.1 million for total cash consideration of approximately $21.8 million, inclusive of premiums and accrued dividends through the redemption date.  See Note 3 in the Notes to Consolidated Financial Statements for further discussion; and\n\n\n•\nIssued $600.0 million of ten-year 4.65% unsecured notes, receiving net proceeds of approximately $598.0 million before underwriting fees, hedge termination costs and other expenses.  The proceeds from this issuance were used to partially fund the Company’s acquisition activity during 2024.\n\n\nShort-Term Liquidity and Cash Proceeds\n\n\nThe Company generally expects to meet its short-term liquidity requirements, including capital expenditures related to maintaining its existing properties and scheduled unsecured note and mortgage note repayments, through its working capital, net cash provided by operating activities and borrowings under the Company’s revolving credit facility and commercial paper program.  Currently, the Company considers its cash provided by operating activities to be adequate to meet operating requirements and payments of distributions.\n \n\n\nThe following table presents the Company’s balances for cash and cash equivalents, restricted deposits and the available borrowing capacity on its revolving credit facility as of December 31, 2024 and 2023 (amounts in thousands):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n\n\n\n\nCash and cash equivalents\n\n\n \n\n\n$\n\n\n62,302\n\n\n \n\n\n \n\n\n$\n\n\n50,743\n\n\n \n\n\n\n\n\n\nRestricted deposits\n\n\n \n\n\n$\n\n\n97,864\n\n\n \n\n\n \n\n\n$\n\n\n89,252\n\n\n \n\n\n\n\n\n\nUnsecured revolving credit facility availability\n\n\n \n\n\n$\n\n\n1,952,067\n\n\n \n\n\n \n\n\n$\n\n\n2,086,585\n\n\n \n\n\n\n\n\n\n \n\n\nCredit Facility and Commercial Paper Program\n\n\nThe Company has a $2.5 billion unsecured revolving credit facility maturing on October 26, 2027.  The Company has the ability to increase available borrowings by an additional $750.0 million by adding lenders to the facility, obtaining the agreement of existing lenders to increase their commitments or incurring one or more term loans.  The interest rate on advances under the facility will generally be the Secured Overnight Financing Rate (\"SOFR\") plus a spread (currently 0.725%), or based on bids received from the lending group, and the Company pays an annual facility fee (currently 0.125%).  Both the spread and the facility fee are dependent on the Company’s senior unsecured credit rating and other terms and conditions per the agreement.  See Note 8 in the Notes to Consolidated Financial Statements for additional discussion of the Company’s credit facility.\n\n\nThe Company has an unsecured commercial paper note program under which it may borrow up to a maximum of $1.5 billion (increased from $1.0 billion as of December 18, 2024) subject to market conditions.  The notes will be sold under customary terms in the United States commercial paper note market and will rank pari passu with all of the Company’s other unsecured senior indebtedness.\n\n\n37\n\n\n\n\nTable of Contents\n \n\n\nThe Company limits its utilization of the revolving credit facility in order to maintain liquidity to support its $1.5 billion commercial paper program along with certain other obligations.  The following table presents the availability on the Company’s unsecured revolving credit facility as of February 6, 2025 (amounts in thousands):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nFebruary 6, 2025\n\n\n \n\n\n\n\n\n\nUnsecured revolving credit facility commitment\n\n\n \n\n\n$\n\n\n2,500,000\n\n\n \n\n\n\n\n\n\nCommercial paper balance outstanding\n\n\n \n\n\n \n\n\n(425,000\n\n\n)\n\n\n\n\n\n\nUnsecured revolving credit facility balance outstanding\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nOther restricted amounts\n\n\n \n\n\n \n\n\n(3,438\n\n\n)\n\n\n\n\n\n\nUnsecured revolving credit facility availability\n\n\n \n\n\n$\n\n\n2,071,562\n\n\n \n\n\n\n\n\n\n \n\n\nDividend Policy\n\n\nThe Company declared a dividend/distribution for each quarter in 2024 of $0.675 per share/unit, an annualized increase of 2.0% over the amount paid in 2023.  All future dividends/distributions remain subject to the discretion of the Company’s Board of Trustees.\n \n\n\nTotal dividends/distributions paid in January 2025 amounted to $263.5 million (excluding distributions on Partially Owned Properties), which consisted of certain distributions declared during the quarter ended December 31, 2024.\n\n\nLong-Term Financing and Capital Needs\n\n\nThe Company expects to meet its long-term liquidity requirements, such as lump sum unsecured note and mortgage debt maturities, property acquisitions and financing of development activities, through the issuance of secured and unsecured debt and equity securities (including additional OP Units), proceeds received from the disposition of certain properties and joint ventures, along with cash generated from operations after all distributions.  The Company has a significant number of unencumbered properties available to secure additional mortgage borrowings should unsecured capital be unavailable or the cost of alternative sources of capital be too high.  The value of and cash flow from these unencumbered properties are in excess of the requirements the Company must maintain in order to comply with covenants under its unsecured notes and line of credit.  Of the $30.0 billion in investment in real estate on the Company’s balance sheet at December 31, 2024, $26.8 billion or 89.4% was unencumbered.  However, there can be no assurances that these sources of capital will be available to the Company in the future on acceptable terms or otherwise.  For additional details, see Item 1A, \nRisk Factors\n.\n\n\nEQR issues equity and guarantees certain debt of the Operating Partnership from time to time.  EQR does not have any indebtedness as all debt is incurred by the Operating Partnership.\n\n\nThe Company’s total debt summary schedule as of December 31, 2024 is as follows:\n\n\nDebt Summary as of December 31, 2024\n\n\n($ in thousands)\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDebt\nBalances\n\n\n \n\n\n \n\n\n% of Total\n\n\n \n\n\n\n\n\n\nSecured\n\n\n \n\n\n$\n\n\n1,630,690\n\n\n \n\n\n \n\n\n \n\n\n20.1\n\n\n%\n\n\n\n\n\n\nUnsecured\n\n\n \n\n\n \n\n\n6,491,055\n\n\n \n\n\n \n\n\n \n\n\n79.9\n\n\n%\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n8,121,745\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\nFixed Rate Debt:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSecured – Conventional\n\n\n \n\n\n$\n\n\n1,401,099\n\n\n \n\n\n \n\n\n \n\n\n17.3\n\n\n%\n\n\n\n\n\n\nUnsecured – Public\n\n\n \n\n\n \n\n\n5,947,376\n\n\n \n\n\n \n\n\n \n\n\n73.2\n\n\n%\n\n\n\n\n\n\nFixed Rate Debt\n\n\n \n\n\n \n\n\n7,348,475\n\n\n \n\n\n \n\n\n \n\n\n90.5\n\n\n%\n\n\n\n\n\n\nFloating Rate Debt:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSecured – Tax Exempt\n\n\n \n\n\n \n\n\n229,591\n\n\n \n\n\n \n\n\n \n\n\n2.8\n\n\n%\n\n\n\n\n\n\nUnsecured – Revolving Credit Facility\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nUnsecured – Commercial Paper Program\n\n\n \n\n\n \n\n\n543,679\n\n\n \n\n\n \n\n\n \n\n\n6.7\n\n\n%\n\n\n\n\n\n\nFloating Rate Debt\n\n\n \n\n\n \n\n\n773,270\n\n\n \n\n\n \n\n\n \n\n\n9.5\n\n\n%\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n8,121,745\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\n \n\n\n38\n\n\n\n\nTable of Contents\n \n\n\nThe following table summarizes the Company’s debt maturity schedule as of December 31, 2024:\n\n\nDebt Maturity Schedule as of December 31, 2024\n\n\n($ in thousands)\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYear\n\n\n \n\n\nFixed\nRate\n\n\n \n\n\n \n\n\nFloating\nRate\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n \n\n\n% of Total\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n450,000\n\n\n \n\n\n \n\n\n$\n\n\n552,595\n\n\n \n\n\n(1)\n\n\n$\n\n\n1,002,595\n\n\n \n\n\n \n\n\n \n\n\n12.2\n\n\n%\n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n592,025\n\n\n \n\n\n \n\n\n \n\n\n9,000\n\n\n \n\n\n \n\n\n \n\n\n601,025\n\n\n \n\n\n \n\n\n \n\n\n7.3\n\n\n%\n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n400,000\n\n\n \n\n\n \n\n\n \n\n\n9,800\n\n\n \n\n\n \n\n\n \n\n\n409,800\n\n\n \n\n\n \n\n\n \n\n\n5.0\n\n\n%\n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n900,000\n\n\n \n\n\n \n\n\n \n\n\n10,700\n\n\n \n\n\n \n\n\n \n\n\n910,700\n\n\n \n\n\n \n\n\n \n\n\n11.1\n\n\n%\n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n888,120\n\n\n \n\n\n \n\n\n \n\n\n11,500\n\n\n \n\n\n \n\n\n \n\n\n899,620\n\n\n \n\n\n \n\n\n \n\n\n11.0\n\n\n%\n\n\n\n\n\n\n2030\n\n\n \n\n\n \n\n\n1,148,462\n\n\n \n\n\n \n\n\n \n\n\n12,700\n\n\n \n\n\n \n\n\n \n\n\n1,161,162\n\n\n \n\n\n \n\n\n \n\n\n14.2\n\n\n%\n\n\n\n\n\n\n2031\n\n\n \n\n\n \n\n\n528,500\n\n\n \n\n\n \n\n\n \n\n\n39,800\n\n\n \n\n\n \n\n\n \n\n\n568,300\n\n\n \n\n\n \n\n\n \n\n\n6.9\n\n\n%\n\n\n\n\n\n\n2032\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n28,100\n\n\n \n\n\n \n\n\n \n\n\n28,100\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n%\n\n\n\n\n\n\n2033\n\n\n \n\n\n \n\n\n550,000\n\n\n \n\n\n \n\n\n \n\n\n2,300\n\n\n \n\n\n \n\n\n \n\n\n552,300\n\n\n \n\n\n \n\n\n \n\n\n6.7\n\n\n%\n\n\n\n\n\n\n2034\n\n\n \n\n\n \n\n\n600,000\n\n\n \n\n\n \n\n\n \n\n\n2,400\n\n\n \n\n\n \n\n\n \n\n\n602,400\n\n\n \n\n\n \n\n\n \n\n\n7.4\n\n\n%\n\n\n\n\n\n\n2035+\n\n\n \n\n\n \n\n\n1,350,850\n\n\n \n\n\n \n\n\n \n\n\n106,200\n\n\n \n\n\n \n\n\n \n\n\n1,457,050\n\n\n \n\n\n \n\n\n \n\n\n17.8\n\n\n%\n\n\n\n\n\n\nSubtotal\n\n\n \n\n\n \n\n\n7,407,957\n\n\n \n\n\n \n\n\n \n\n\n785,095\n\n\n \n\n\n \n\n\n \n\n\n8,193,052\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\nDeferred Financing Costs and\n   Unamortized (Discount)\n\n\n \n\n\n \n\n\n(59,482\n\n\n)\n\n\n \n\n\n \n\n\n(11,825\n\n\n)\n\n\n \n\n\n \n\n\n(71,307\n\n\n)\n\n\n \n\n\nN/A\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n7,348,475\n\n\n \n\n\n \n\n\n$\n\n\n773,270\n\n\n \n\n\n \n\n\n$\n\n\n8,121,745\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\n \n\n\n(1)\nIncludes $544.5 million in principal outstanding on the Company’s commercial paper program.\n\n\nInterest expected to be incurred on the Company’s secured and unsecured debt based on obligations outstanding at December 31, 2024, inclusive of capitalized interest, approximates $225.4 million annually for the next five years, with total remaining obligations of approximately $2.3 billion.  For floating rate debt, the current rate in effect for the most recent payment through December 31, 2024 is assumed to be in effect through the respective maturity date of each instrument.\n\n\nSee Note 8 in the Notes to Consolidated Financial Statements for additional discussion of debt at December 31, 2024.  See also Notes 7 and 15 in the Notes to Consolidated Financial Statements for additional discussion of contractual obligations and commitments as of December 31, 2024.\n\n\nCapital Structure\n\n\nThe Company’s “Consolidated Debt-to-Total Market Capitalization Ratio” as of December 31, 2024 is presented in the following table.  The Company calculates the equity component of its market capitalization as the sum of (i) the total outstanding Common Shares and assumed conversion of all Units at the equivalent market value of the closing price of the Company’s Common Shares on the New York Stock Exchange and (ii) the liquidation value of all perpetual preferred shares outstanding.\n\n\nEquity Residential\n\n\nCapital Structure as of December 31, 2024\n\n\n(Amounts in thousands except for share/unit and per share amounts)\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSecured Debt\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,630,690\n\n\n \n\n\n \n\n\n \n\n\n20.1\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUnsecured Debt\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n6,491,055\n\n\n \n\n\n \n\n\n \n\n\n79.9\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal Debt\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n8,121,745\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n22.4\n\n\n%\n\n\n\n\n\n\nCommon Shares (includes Restricted Shares)\n\n\n \n\n\n \n\n\n379,475,383\n\n\n \n\n\n \n\n\n \n\n\n97.0\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUnits (includes OP Units and Restricted Units)\n\n\n \n\n\n \n\n\n11,543,773\n\n\n \n\n\n \n\n\n \n\n\n3.0\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal Shares and Units\n\n\n \n\n\n \n\n\n391,019,156\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCommon Share Price at December 31, 2024\n\n\n \n\n\n$\n\n\n71.76\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n28,059,535\n\n\n \n\n\n \n\n\n \n\n\n99.9\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPerpetual Preferred Equity\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n17,155\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal Equity\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n28,076,690\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n77.6\n\n\n%\n\n\n\n\n\n\nTotal Market Capitalization\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n36,198,435\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\n \n\n\n39\n\n\n\n\nTable of Contents\n \n\n\nThe Operating Partnership’s “Consolidated Debt-to-Total Market Capitalization Ratio” as of December 31, 2024 is presented in the following table.  The Operating Partnership calculates the equity component of its market capitalization as the sum of (i) the total outstanding Units at the equivalent market value of the closing price of the Company’s Common Shares on the New York Stock Exchange and (ii) the liquidation value of all perpetual preference units outstanding.\n\n\nERP Operating Limited Partnership\n\n\nCapital Structure as of December 31, 2024\n\n\n(Amounts in thousands except for unit and per unit amounts)\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSecured Debt\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,630,690\n\n\n \n\n\n \n\n\n \n\n\n20.1\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUnsecured Debt\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n6,491,055\n\n\n \n\n\n \n\n\n \n\n\n79.9\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal Debt\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n8,121,745\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n22.4\n\n\n%\n\n\n\n\n\n\nTotal Outstanding Units\n\n\n \n\n\n \n\n\n391,019,156\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCommon Share Price at December 31, 2024\n\n\n \n\n\n$\n\n\n71.76\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n28,059,535\n\n\n \n\n\n \n\n\n \n\n\n99.9\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPerpetual Preference Units\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n17,155\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal Equity\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n28,076,690\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n77.6\n\n\n%\n\n\n\n\n\n\nTotal Market Capitalization\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n36,198,435\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\n \n\n\nFinancial Flexibility\n\n\nEQR and ERPOP currently have an active universal shelf registration statement for the issuance of equity and debt securities that automatically became effective upon filing with the SEC in May 2022 and expires in May 2025.  Per the terms of ERPOP’s partnership agreement, EQR contributes the net proceeds of all equity offerings to the capital of ERPOP in exchange for additional OP Units (on a one-for-one Common Share per OP Unit basis) or preference units (on a one-for-one preferred share per preference unit basis).\n\n\nThe Company has an ATM share offering program which allows EQR to issue Common Shares from time to time into the existing trading market at current market prices or through negotiated transactions, including under forward sale arrangements.  The current program matures in May 2025 and gives us the authority to issue up to 13.0 million shares, all of which remain available for issuance as of February 6, 2025.\n \n\n\nForward sale agreements under the ATM program allow the Company, at its election, to settle the agreements by issuing Common Shares in exchange for net proceeds at the then-applicable forward sale price specified by the agreement or, alternatively, to settle the agreements in whole or in part through the delivery or receipt of Common Shares or cash.  Issuances of shares under these forward sale agreements are classified as equity transactions.  Accordingly, no amounts relating to the forward sale agreements are recorded in the consolidated financial statements until settlement occurs.  Prior to any settlements, the only impact to the consolidated financial statements is the inclusion of incremental shares, if any, within the calculation of diluted net income per share using the treasury stock method (see Note 10 in the Notes to Consolidated Financial Statements).  The actual forward price per share to be received by the Company upon settlement will be determined on the applicable settlement date based on adjustments made to the initial forward price to reflect the then-current overnight federal funds rate and the amount of dividends paid to holders of the Company’s Common Shares over the term of the forward sale agreement.\n \n\n\nDuring the year ended December 31, 2024, the Company repurchased and subsequently retired approximately $38.5 million (652,452 shares at a weighted average price per share of $58.95) of its Common Shares in the open market under its share repurchase program.  Concurrent with these transactions, ERPOP repurchased and retired the same amount of OP Units previously issued to EQR.  Prior to the share repurchase activity during the year ended December 31, 2024, the Company had the authority to repurchase up to 13.0 million Common Shares under its share repurchase program.  As of February 6, 2025, EQR has remaining authorization to repurchase up to 12,347,548 of its shares.\n \n\n\nWe believe our ability to access the capital markets is enhanced by ERPOP’s long-term senior debt ratings and short-term commercial paper ratings, as well as EQR’s long-term preferred equity ratings.  As of February 6, 2025, the ratings are as follows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nStandard & Poor’s\n\n\n \n\n\nMoody's\n\n\n\n\n\n\nERPOP's long-term senior debt rating\n\n\n \n\n\nA-\n\n\n \n\n\nA3\n\n\n\n\n\n\nERPOP's short-term commercial paper rating\n\n\n \n\n\nA-2\n\n\n \n\n\nP-2\n\n\n\n\n\n\nEQR's long-term preferred equity rating\n\n\n \n\n\nBBB\n\n\n \n\n\nBaa1\n\n\n\n\n\n\n \n\n\n40\n\n\n\n\nTable of Contents\n \n\n\nSee Note 17 in the Notes to Consolidated Financial Statements for discussion of the events, if any, which occurred subsequent to December 31, 2024.\n\n\nInflation\n\n\nInflation primarily impacts our results of operations as a result of wage/payroll pressures, increases in utilities through escalation of commodity costs and increases in repair and maintenance costs through higher contractor costs.  In addition, inflation could also impact the interest we pay on our floating rate debt and upon refinancing of fixed rate debt in a high-inflationary environment, our cost of capital and our cost of development, renovation and capital expenditure activities.  However, the majority of our apartment leases have initial terms of 12 months or less, which generally enables us to compensate for inflationary effects by increasing rents on our apartment homes, subject to supply and demand conditions.  Although an extreme or sustained escalation in costs could have a negative impact on our residents and their ability to absorb rent increases, we do not believe inflation had a material impact on our results of operations for the years ended December 31, 2024, 2023 and 2022.\n\n\nDefinitions\n\n\nThe definition of certain terms described above or below are as follows:\n \n\n\n•\nAcquisition Capitalization Rate or Cap Rate – NOI that the Company anticipates receiving in the next 12 months (or the year two or three stabilized NOI for properties that are in lease-up at acquisition) less an estimate of property management costs/management fees allocated to the project (generally ranging from 2.0% to 4.0% of revenues depending on the size and income streams of the asset) and less an estimate for in-the-unit replacement capital expenditures (generally ranging from $100-$450 per apartment unit depending on the age and condition of the asset) divided by the gross purchase price of the asset.  The weighted average Acquisition Cap Rate for acquired properties is weighted based on the projected NOI streams and the relative purchase price for each respective property.\n\n\n•\nAverage Rental Rate\n \n– Total Residential rental revenues reflected on a straight-line basis in accordance with GAAP divided by the weighted average occupied apartment units for the reporting period presented. \n\n\n•\nBuilding Improvements – Includes roof replacement, paving, building mechanical equipment systems, exterior siding and painting, major landscaping, furniture, fixtures and equipment for amenities and common areas, vehicles and office and maintenance equipment.  \n\n\n•\nDisposition Yield – NOI that the Company anticipates giving up in the next 12 months less an estimate of property management costs/management fees allocated to the project (generally ranging from 2.0% to 4.0% of revenues depending on the size and income streams of the asset) and less an estimate for in-the-unit replacement capital expenditures (generally ranging from $150-$450 per apartment unit depending on the age and condition of the asset) divided by the gross sales price of the asset.  The weighted average Disposition Yield for sold properties is weighted based on the projected NOI streams and the relative sales price for each respective property.\n\n\n•\nEstablished Markets – Includes Boston, New York, Washington, D.C., Seattle, San Francisco and Southern California (Los Angeles, Orange County and San Diego).\n\n\n•\nExpansion Markets – Includes Denver, Atlanta, Dallas/Ft. Worth and Austin.\n\n\n•\nLeasing Concessions – Reflects upfront discounts on both new move-in and renewal leases on a straight-line basis. \n\n\n•\nNon-Residential – Consists of revenues and expenses from retail and public parking garage operations.\n\n\n•\nNon-Same Store Properties – For annual comparisons, primarily includes all properties acquired during 2023 and 2024, plus any properties in lease-up and not stabilized as of January 1, 2023.  Unless otherwise noted, includes both Residential and Non-Residential operations for these properties.\n\n\n•\nPhysical Occupancy – The weighted average occupied apartment units for the reporting period divided by the average of total apartment units available for rent for the reporting period. \n\n\n•\nRenovation Expenditures – Apartment unit renovation costs (primarily kitchens and baths) designed to reposition these units for higher rental levels in their respective markets.  \n\n\n•\nReplacements – Includes appliances, mechanical equipment, fixtures and flooring (including hardwood and carpeting).\n\n\n•\nResidential – Consists of multifamily apartment revenues and expenses. \n\n\n41\n\n\n\n\nTable of Contents\n \n\n\n•\nSame Store Properties – For annual comparisons, primarily includes all properties acquired or completed that are stabilized prior to January 1, 2023, less properties subsequently sold.  Properties are included in Same Store when they are stabilized for all of the current and comparable periods presented.  Unless otherwise noted, includes both Residential and Non-Residential operations for these properties.\n\n\n•\n% of Stabilized Budgeted NOI – Represents original budgeted 2025 NOI for stabilized properties and projected annual NOI at stabilization (defined as having achieved 90% Physical Occupancy for three consecutive months) for properties that are in lease-up.\n\n\n•\nTotal Budgeted Capital Cost – Estimated remaining cost for projects under development and/or developed plus all capitalized costs incurred to date, including land acquisition costs, construction costs, capitalized real estate taxes and insurance, capitalized interest and loan fees, permits, professional fees, allocated development overhead and other regulatory fees, plus any estimates of costs remaining to be funded for all projects, all in accordance with GAAP.  Amounts for partially owned consolidated and unconsolidated properties are presented at 100% of the project.\n\n\n•\nTurnover\n \n– Total Residential move-outs (including inter-property and intra-property transfers) divided by total Residential apartment units.\n\n\n42\n\n\n\n\nTable of Contents\n \n\n\nCritical Accounting Policies and Estimates\n\n\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to use judgment in the application of accounting policies, including making estimates and assumptions.  If our judgment or interpretation of the facts and circumstances relating to various transactions had been different or different assumptions were made, it is possible that different accounting policies would have been applied, resulting in different financial results or different presentation of our financial statements.\n\n\nThe Company’s significant accounting policies are described in Note 2 in the Notes to Consolidated Financial Statements.  These policies were followed in preparing the consolidated financial statements at and for the year ended December 31, 2024.\n\n\nThe Company has identified the significant accounting policies below as critical accounting policies.  These critical accounting policies are those that have the most impact on the reporting of our financial condition and those requiring significant judgments and estimates.  With respect to these critical accounting policies, management believes that the application of judgments and estimates is consistently applied and produces financial information that fairly presents the results of operations for all periods presented.\n\n\nImpairment of Long-Lived Assets\n\n\nThe Company evaluates its long-lived assets, including its investment in real estate, for indicators of impairment at least quarterly.  The judgments regarding the existence of impairment indicators are based on factors such as operational performance, market conditions, legal, regulatory and environmental concerns, the Company’s intent and ability to hold the related asset, as well as any significant cost overruns on development properties.  Future events could occur which would cause the Company to conclude that impairment indicators exist and an impairment loss is warranted.  Assessing impairment can be complex and involves a high degree of subjectivity in determining if indicators are present and in estimating the future undiscounted cash flows or the fair value of an asset.  In particular, these estimates are sensitive to significant assumptions, including the estimation of future rental revenues, operating expenses, discount and capitalization rates and our intent and ability to hold the related asset, all of which could be affected by our expectations about future market or economic conditions.  Assumptions are primarily subject to property-specific characteristics, especially with respect to our intent and ability to hold the related asset.  While these property-specific assumptions can have a significant impact on the undiscounted cash flows or estimated fair value of a particular asset, our evaluation of the reported carrying values of long-lived assets during the current year were not particularly sensitive to external or market assumptions.\n\n\nAcquisition of Investment Properties\n\n\nThe Company allocates the purchase price of properties that meet the definition of an asset acquisition to net tangible and identified intangible assets acquired based on their relative fair values using assumptions primarily based upon property-specific characteristics.  In making estimates of relative fair values for purposes of allocating purchase price, the Company utilizes a number of sources, including independent appraisals that may be obtained in connection with the acquisition or financing of the respective property, our own analysis of recently acquired or developed and existing comparable properties in our portfolio and other market data.  The Company also considers information obtained about each property as a result of its pre-acquisition due diligence, marketing and leasing activities in estimating the relative fair value of the tangible and intangible assets/liabilities acquired.\n\n\n43\n\n\n\n\nTable of Contents\n \n\n\nFunds From Operations and Normalized Funds From Operations\n\n\nThe following is the Company’s and the Operating Partnership’s reconciliation of net income to FFO available to Common Shares and Units / Units and Normalized FFO available to Common Shares and Units / Units for each of the three years ended December 31, 2024:\n\n\nFunds From Operations and Normalized Funds From Operations\n\n\n(Amounts in thousands)\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n1,070,975\n\n\n \n\n\n \n\n\n$\n\n\n868,488\n\n\n \n\n\n \n\n\n$\n\n\n806,995\n\n\n \n\n\n\n\n\n\nNet (income) loss attributable to Noncontrolling \n   Interests – Partially Owned Properties\n\n\n \n\n\n \n\n\n(6,212\n\n\n)\n\n\n \n\n\n \n\n\n(6,340\n\n\n)\n\n\n \n\n\n \n\n\n(3,774\n\n\n)\n\n\n\n\n\n\nPreferred/preference distributions\n\n\n \n\n\n \n\n\n(1,613\n\n\n)\n\n\n \n\n\n \n\n\n(3,090\n\n\n)\n\n\n \n\n\n \n\n\n(3,090\n\n\n)\n\n\n\n\n\n\nPremium on redemption of Preferred Shares/Preference Units\n\n\n \n\n\n \n\n\n(1,444\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nNet income available to Common Shares and Units / Units\n\n\n \n\n\n \n\n\n1,061,706\n\n\n \n\n\n \n\n\n \n\n\n859,058\n\n\n \n\n\n \n\n\n \n\n\n800,131\n\n\n \n\n\n\n\n\n\nAdjustments:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation\n\n\n \n\n\n \n\n\n952,191\n\n\n \n\n\n \n\n\n \n\n\n888,709\n\n\n \n\n\n \n\n\n \n\n\n882,168\n\n\n \n\n\n\n\n\n\nDepreciation – Non-real estate additions\n\n\n \n\n\n \n\n\n(3,791\n\n\n)\n\n\n \n\n\n \n\n\n(4,268\n\n\n)\n\n\n \n\n\n \n\n\n(4,306\n\n\n)\n\n\n\n\n\n\nDepreciation – Partially Owned Properties\n\n\n \n\n\n \n\n\n(2,132\n\n\n)\n\n\n \n\n\n \n\n\n(2,130\n\n\n)\n\n\n \n\n\n \n\n\n(2,640\n\n\n)\n\n\n\n\n\n\nDepreciation – Unconsolidated Properties\n\n\n \n\n\n \n\n\n7,191\n\n\n \n\n\n \n\n\n \n\n\n2,860\n\n\n \n\n\n \n\n\n \n\n\n2,898\n\n\n \n\n\n\n\n\n\nNet (gain) loss on sales of unconsolidated entities - operating assets\n\n\n \n\n\n \n\n\n(515\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(9\n\n\n)\n\n\n\n\n\n\nNet (gain) loss on sales of real estate properties\n\n\n \n\n\n \n\n\n(546,797\n\n\n)\n\n\n \n\n\n \n\n\n(282,539\n\n\n)\n\n\n \n\n\n \n\n\n(304,325\n\n\n)\n\n\n\n\n\n\nNoncontrolling Interests share of gain (loss) on sales \n   of real estate properties\n\n\n \n\n\n \n\n\n1,857\n\n\n \n\n\n \n\n\n \n\n\n2,336\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nFFO available to Common Shares and Units / Units (1) (3) (4)\n\n\n \n\n\n \n\n\n1,469,710\n\n\n \n\n\n \n\n\n \n\n\n1,464,026\n\n\n \n\n\n \n\n\n \n\n\n1,373,917\n\n\n \n\n\n\n\n\n\nAdjustments:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nWrite-off of pursuit costs\n\n\n \n\n\n \n\n\n5,155\n\n\n \n\n\n \n\n\n \n\n\n3,647\n\n\n \n\n\n \n\n\n \n\n\n4,780\n\n\n \n\n\n\n\n\n\nDebt extinguishment and preferred share/preference unit redemption \n   (gains) losses\n\n\n \n\n\n \n\n\n1,444\n\n\n \n\n\n \n\n\n \n\n\n1,143\n\n\n \n\n\n \n\n\n \n\n\n4,664\n\n\n \n\n\n\n\n\n\nNon-operating asset (gains) losses\n\n\n \n\n\n \n\n\n(16,311\n\n\n)\n\n\n \n\n\n \n\n\n(13,323\n\n\n)\n\n\n \n\n\n \n\n\n2,368\n\n\n \n\n\n\n\n\n\nOther miscellaneous items\n\n\n \n\n\n \n\n\n61,608\n\n\n \n\n\n \n\n\n \n\n\n21,588\n\n\n \n\n\n \n\n\n \n\n\n(13,901\n\n\n)\n\n\n\n\n\n\nNormalized FFO available to Common Shares and Units / Units (2) (3) (4)\n\n\n \n\n\n$\n\n\n1,521,606\n\n\n \n\n\n \n\n\n$\n\n\n1,477,081\n\n\n \n\n\n \n\n\n$\n\n\n1,371,828\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nFFO (1) (3)\n\n\n \n\n\n$\n\n\n1,472,767\n\n\n \n\n\n \n\n\n$\n\n\n1,467,116\n\n\n \n\n\n \n\n\n$\n\n\n1,377,007\n\n\n \n\n\n\n\n\n\nPreferred/preference distributions\n\n\n \n\n\n \n\n\n(1,613\n\n\n)\n\n\n \n\n\n \n\n\n(3,090\n\n\n)\n\n\n \n\n\n \n\n\n(3,090\n\n\n)\n\n\n\n\n\n\nPremium on redemption of Preferred Shares/Preference Units\n\n\n \n\n\n \n\n\n(1,444\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nFFO available to Common Shares and Units / Units (1) (3) (4)\n\n\n \n\n\n$\n\n\n1,469,710\n\n\n \n\n\n \n\n\n$\n\n\n1,464,026\n\n\n \n\n\n \n\n\n$\n\n\n1,373,917\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNormalized FFO (2) (3)\n\n\n \n\n\n$\n\n\n1,523,219\n\n\n \n\n\n \n\n\n$\n\n\n1,480,171\n\n\n \n\n\n \n\n\n$\n\n\n1,374,918\n\n\n \n\n\n\n\n\n\nPreferred/preference distributions\n\n\n \n\n\n \n\n\n(1,613\n\n\n)\n\n\n \n\n\n \n\n\n(3,090\n\n\n)\n\n\n \n\n\n \n\n\n(3,090\n\n\n)\n\n\n\n\n\n\nNormalized FFO available to Common Shares and Units / Units (2) (3) (4)\n\n\n \n\n\n$\n\n\n1,521,606\n\n\n \n\n\n \n\n\n$\n\n\n1,477,081\n\n\n \n\n\n \n\n\n$\n\n\n1,371,828\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(1)\nThe National Association of Real Estate Investment Trusts (“Nareit”) defines funds from operations (“FFO”) (December 2018 White Paper) as net income (computed in accordance with accounting principles generally accepted in the United States (“GAAP”)), excluding gains or losses from sales and impairment write-downs of depreciable real estate and land when connected to the main business of a REIT, impairment write-downs of investments in entities when the impairment is directly attributable to decreases in the value of depreciable real estate held by the entity and depreciation and amortization related to real estate.  Adjustments for partially owned consolidated and unconsolidated partnerships and joint ventures are calculated to reflect funds from operations on the same basis.\n\n\n(2)\nNormalized funds from operations (“Normalized FFO”) begins with FFO and excludes:\n\n\n•\nthe impact of any expenses relating to non-operating real estate asset impairment;\n\n\n•\npursuit cost write-offs;\n\n\n•\ngains and losses from early debt extinguishment and preferred share/preference unit redemptions; \n\n\n•\ngains and losses from non-operating assets; and\n\n\n•\nother miscellaneous items.\n\n\n44\n\n\n\n\nTable of Contents\n \n\n\n(3)\nThe Company believes that FFO and FFO available to Common Shares and Units / Units are helpful to investors as supplemental measures of the operating performance of a real estate company, because they are recognized measures of performance by the real estate industry and by excluding gains or losses from sales and impairment write-downs of depreciable real estate and excluding depreciation related to real estate (which can vary among owners of identical assets in similar condition based on historical cost accounting and useful life estimates), FFO and FFO available to Common Shares and Units / Units can help compare the operating performance of a company’s real estate between periods or as compared to different companies.  The Company also believes that Normalized FFO and Normalized FFO available to Common Shares and Units / Units are helpful to investors as supplemental measures of the operating performance of a real estate company because they allow investors to compare the Company’s operating performance to its performance in prior reporting periods and to the operating performance of other real estate companies without the effect of items that by their nature are not comparable from period to period and tend to obscure the Company’s actual operating results.  FFO, FFO available to Common Shares and Units / Units, Normalized FFO and Normalized FFO available to Common Shares and Units / Units do not represent net income, net income available to Common Shares / Units or net cash flows from operating activities in accordance with GAAP.  Therefore, FFO, FFO available to Common Shares and Units / Units, Normalized FFO and Normalized FFO available to Common Shares and Units / Units should not be exclusively considered as alternatives to net income, net income available to Common Shares / Units or net cash flows from operating activities as determined by GAAP or as a measure of liquidity.  The Company’s calculation of FFO, FFO available to Common Shares and Units / Units, Normalized FFO and Normalized FFO available to Common Shares and Units / Units may differ from other real estate companies due to, among other items, variations in cost capitalization policies for capital expenditures and, accordingly, may not be comparable to such other real estate companies.\n\n\n(4)\nFFO available to Common Shares and Units / Units and Normalized FFO available to Common Shares and Units / Units are calculated on a basis consistent with net income available to Common Shares / Units and reflects adjustments to net income for preferred distributions and premiums on redemption of preferred shares/preference units in accordance with GAAP.  The equity positions of various individuals and entities that contributed their properties to the Operating Partnership in exchange for OP Units are collectively referred to as the “Noncontrolling Interests – Operating Partnership.”  Subject to certain restrictions, the Noncontrolling Interests – Operating Partnership may exchange their OP Units for Common Shares on a one-for-one basis.",
  "item2": null
}