{
  "source_file": "eqt-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.        Business\nGeneral\nWe are a vertically integrated natural gas company with production, gathering and transmission operations focused in the Appalachian Basin. As of December 31, 2024, we had 26.3 Tcfe of proved natural gas, NGLs and oil reserves across approximately 2.1 million gross acres and approximately 2,925 miles of pipeline infrastructure. In addition, we operate and hold an investment in the Mountain Valley Pipeline (the MVP), a 303-mile long pipeline that spans from Wetzel County, West Virginia to Pittsylvania County, Virginia.\nStrategy\nWe are committed to responsibly developing our world-class asset base and being the operator of choice for all stakeholders. By promoting a culture that prioritizes operational efficiency, technology, sustainability and safety, we seek to continuously improve the way we produce and deliver environmentally responsible, reliable and affordable energy.\nOur business strategy is to be the lowest-cost producer of natural gas. The durability of this strategy relies on our substantial inventory of core drilling locations, our vast midstream infrastructure spanning the Appalachian Basin, our investment grade balance sheet, the low emissions profile of our operations and our best-in-class team and culture. As the only large-scale, integrated natural gas producer in the United States, we are situated to endure and excel during times of market volatility. In periods of low commodity prices, our integrated business model is designed to produce durable free cash flow due to the annuity-like nature of our midstream assets. In periods of high commodity prices, our low-cost structure permits lower levels of financial hedging, thus providing increased exposure to higher natural gas prices. Our peer-leading drilling inventory coupled with our midstream ownership and operatorship also positions us to provide production growth to serve growing demand from the power and LNG markets.\nOur operational strategy focuses on the successful execution of combo-development projects. Combo-development refers to the development of several multi-well pads in tandem. Combo-development generates value across all levels of the reserves development process by maximizing operational and capital efficiencies. In the drilling stage, rigs spend more time drilling and less time transitioning to new sites. Advanced planning, a prerequisite to pursuing combo-development, facilitates the delivery of bulk hydraulic fracturing sand and piped fresh and recycled water and provides the ability to continuously meet completions supply needs and the use of environmentally friendly technologies such as electric hydraulic fracturing powered by natural gas. Our operational strategy is further enhanced by our robust midstream pipelines and services, enabling us to keep our development costs low and limiting our need to hedge our future production, providing both downside protection and better exposure to natural gas price increases in the face of a volatile commodity market.\n \nThe benefits of combo-development extend beyond financial gains to include environmental and social interests. We have developed an integrated ESG program that interplays with our combo-development-driven operational strategy. Core tenets of our ESG program include investing in technology and human capital; improving data collection, analysis and reporting; and engaging with stakeholders to understand, and align our actions with, their needs and expectations. Combo-development, when compared to similar production from non-combo-development operations, translates into fewer trucks on the road, decreased fuel usage, shorter periods of noise pollution, fewer areas impacted by midstream pipeline construction and shortened duration of site operations, all of which fosters a greater focus on safety, environmental protection and social responsibility.\nWe believe that combo-development projects are key to delivering sustainably low well costs and higher returns on invested capital. Our business model enables us to generate durable free cash flow and correspondingly, we have implemented a robust capital allocation strategy directed at responsibly developing our assets and positioning us for organic growth, while also returning capital to our shareholders through a combination of debt retirements, a base dividend and opportunistic share repurchases. We are also focused on maintaining and strengthening our investment grade credit metrics, which improve our access to reliable, low-cost capital throughout market cycles. Furthermore, we believe the benefits of our operating model can be enhanced through select strategic transactions, and, as such, part of our strategy includes creating value through mergers and acquisitions, divestitures, joint ventures and similar business transactions as well as by investing in energy transition opportunities directed at complementing and, in certain cases, diversifying our core business operations.\n8\nTable of Contents\nWe believe that our proprietary digital work environment, the size and contiguity of our asset base, and our robust midstream pipeline network, uniquely position us to execute on a multi-decade inventory of combo-development projects in our core acreage position. Our operational strategy employs this differentiation to advance our mission of being the operator of choice for all stakeholders, while simultaneously helping to address energy security and affordability both domestically and globally\n.\n2024 and Recent Highlights\n•\nGenerated $2.8 billion of net cash provided by operating activities.\n•\nCompleted the Equitrans Midstream Merger (defined in Note 6 to the Consolidated Financial Statements).\n•\nCompleted the First NEPA Non-Operated Asset Divestiture (defined in Note 7 to the Consolidated Financial Statements) in May 2024 and the Second NEPA Non-Operated Asset Divestiture (defined in Note 7 to the Consolidated Financial Statements) in December 2024.\n•\nCompleted the Midstream Joint Venture Transaction (defined in Note 8 to the Consolidated Financial Statements).\n•\nRetired $4.3 billion aggregate principal of senior notes and term loans outstanding under the Term Loan Facility (defined in Note 10 to the Consolidated Financial Statements).\n•\nPaid $327 million in aggregate dividends to shareholders.\nOutlook\nIn 2025, we expect to spend approximately $2.3 billion to $2.5 billion on total capital expenditures. We expect to allocate the total planned capital expenditures as follows: approximately $1,445 million to $1,555 million to fund reserve development, approximately $160 million to $180 million to fund land and lease acquisitions, approximately $80 million to $90 million to fund other production infrastructure, approximately $360 million to $390 million to fund gathering infrastructure, approximately $50 million to $60 million to fund transmission infrastructure and approximately $205 million to $225 million towards capitalized interest, capitalized overhead and other. Of the total planned capital expenditures, we expect to allocate approximately $350 million to $380 million to strategic growth projects composed of approximately $85 million to $95 million for water infrastructure within reserve development, approximately $130 million to $140 million for growth projects within gathering infrastructure and approximately $135 million to $145 million for in-fill leasing within land and lease acquisitions. In 2025, we expect our sales volume to be 2,175 Bcfe to 2,275 Bcfe.\nWe are committed to maintaining investment grade credit metrics. In 2024, we published a leverage and debt retirement strategy with the goal of reducing our debt to $7.5 billion by the end of 2025, and, in 2025, we published an update to our leverage and debt retirement strategy with the long-term goal of reducing our debt to $5.0 billion, subject to the overall performance of the commodity markets (our Debt Retirement Plan). Our capital allocation plan is focused on maintaining production volumes while also returning capital to shareholders, including through our quarterly cash dividend and share repurchase program, pursuant to which we are authorized to repurchase shares of our outstanding common stock for an aggregate purchase price of up to $2 billion, excluding fees, commissions and expenses. Furthermore, we have aligned our hedge strategy in a manner that we believe will mitigate the risk of volatility of natural gas and NGLs prices, thereby enabling us to execute on our capital expenditure, debt retirement and shareholder return strategy.\nOur revenues, earnings and liquidity are substantially dependent on the prices we receive for, and our ability to develop our reserves of, natural gas, NGLs and oil, which are also largely dependent on natural gas prices. Due to the volatility of commodity prices, we are unable to predict future potential movements in the market prices for natural gas, NGLs and oil at our ultimate sales points and, thus, cannot predict the ultimate impact of prices on our operations. Changes in natural gas, NGLs and oil prices could affect, among other things, our development plans, which would increase or decrease the pace of the development and the level of our reserves, as well as our revenues, earnings or liquidity. Lower prices and changes in our development plans could also result in non-cash impairments in the book value of our oil and gas properties and midstream infrastructure or downward adjustments to our estimated proved reserves. Any such impairments or downward adjustments to our estimated reserves could potentially be material to us.\nSee \"Critical Accounting Estimates\" included in Item 7., \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and Note 1 to the Consolidated Financial Statements for a discussion of our significant accounting policies and assumptions related to accounting for natural gas, NGLs and oil producing activities and impairment of our oil and gas properties. See also Item 1A., \"Risk Factors – Natural gas, NGLs and oil price declines, and changes in our development strategy, have resulted in impairment of certain of our assets. Future declines in commodity prices, increases in operating costs or adverse changes in well performance or additional changes in our development strategy may result in additional write-downs of the carrying amounts of our assets, including long-lived intangible assets, which could materially and adversely affect our results of operations in future periods.\"\n9\nTable of Contents\nSegment and Geographical Information\nPrior to the completion of the Equitrans Midstream Merger, we reported our results of operations as a single consolidated segment. Thereafter, and as a result thereof, we adjusted our internal reporting structure and our chief operating decision maker changed the manner in which he measures financial performance and allocates resources to incorporate the gathering and transmission assets we acquired in the Equitrans Midstream Merger. Hence, our operations expanded to comprise three discrete segments reflective of our three lines of business of Production, Gathering and Transmission. Accordingly, the manner in which we report our operations has been changed retrospectively, with certain prior period amounts recast between our Production segment and Gathering segment. See Note 2 to the Consolidated Financial Statements as well as Item 7., \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" for further discussion of our reportable segments.\nSubstantially all of our assets and operations are located in the Appalachian Basin.\nComposition of Operating Revenues\nThe following table summarizes the composition of our operating revenues by business segment.\nYears Ended December 31,\n2024\n2023\n2022\n(Thousands)\nOperating revenues:\nProduction (a)\n$\n5,009,833 \n$\n6,896,358 \n$\n7,484,063 \nGathering (b)\n749,700 \n161,395 \n96,947 \nTransmission (b)\n218,293 \n— \n— \nTotal Segment\n5,977,826 \n7,057,753 \n7,581,010 \nIntersegment eliminations and other (c)\n(704,517)\n(148,830)\n(83,321)\nEQT Corporation\n$\n5,273,309 \n$\n6,908,923 \n$\n7,497,689 \n(a)\nPrimarily sales of natural gas, NGLs and oil and, for 2023 and 2022, gain (loss) on derivatives.\n(b)\nPrimarily pipeline revenues.\n(c)\nPrimarily elimination of intercompany transactions between our Production segment and our Gathering or Transmission segments for the transportation of our natural gas.\nProduction Segment Assets and Operations\nReserves\n \nThe following table summarizes our proved developed and undeveloped natural gas, NGLs and oil reserves using average first-day-of-the-month closing prices for the prior twelve months and disaggregated by product. Substantially all of our reserves reside in continuous accumulations.\nDecember 31, 2024\n \nNatural Gas\nNGLs and Oil\nTotal\n(Bcf)\n(MMbbl)\n(Bcfe)\nProved developed reserves\n17,440 \n227 \n18,805 \nProved undeveloped reserves\n7,105 \n59 \n7,460 \nTotal proved reserves\n24,545 \n286 \n26,265 \n90% of our total proved developed reserves, 98% of our total proved undeveloped reserves and 92% of our total proved reserves are located in the Marcellus Shale.\n10\nTable of Contents\nThe following table summarizes our proved developed and undeveloped reserves using average first-day-of-the-month closing prices for the prior twelve months and disaggregated by state.\nDecember 31, 2024\nPennsylvania\nWest Virginia\nOhio\nTotal\n(Bcfe)\nProved developed reserves\n12,093 \n5,850 \n862 \n18,805 \nProved undeveloped reserves\n3,741 \n3,677 \n42 \n7,460 \nTotal proved reserves\n15,834 \n9,527 \n904 \n26,265 \nGross proved undeveloped drilling locations\n178 \n181 \n3 \n362 \nNet proved undeveloped drilling locations\n150 \n158 \n3 \n311 \nOur 2024 total proved reserves decreased by 1,332 Bcfe, or 4.8%, compared to 2023 due to production of 2,228 Bcfe, negative revisions of previous estimates of 1,080 Bcfe and decreases from the NEPA Non-Operated Asset Divestitures of 1,563 Bcfe, partly offset by extensions, discoveries and other additions of 3,126 Bcfe and acquisitions from the First NEPA Non-Operated Asset Divestiture of 413 Bcfe.\nOur 2024 proved undeveloped reserves decreased by 579 Bcfe, or 7.2%, compared to 2023. The following table provides a rollforward of our proved undeveloped reserves.\nProved Undeveloped Reserves\n(Bcfe)\nBalance at January 1, 2024\n8,039 \nConversions into proved developed reserves\n(2,637)\nDivestiture (a)\n(188)\nRevision of previous estimates (b)\n(823)\nExtensions, discoveries and other additions (c)\n3,069 \nBalance at December 31, 2024\n7,460 \n(a)\nProved undeveloped non-operated assets divested in the NEPA Non-Operated Asset Divestitures. See Note 7 to the Consolidated Financial Statements.\n(b)\nComposed of (i) negative revisions of 925 Bcfe related to proved undeveloped locations that we no longer expect to develop as proved reserves within five years of initial booking primarily as a result of development schedule changes, (ii) negative revisions of 87 Bcfe primarily related to revisions to lateral lengths and type curves, partly offset by (iii) positive revisions of 189 Bcfe due primarily to changes in ownership interests.\n(c)\nComposed of (i) 2,912 Bcfe from proved undeveloped additions associated with acreage that was previously unproved but became proved due to 2024 reserve development that expanded the number of our proven locations and additions to our five-year drilling plan and (ii) positive revisions of 157 Bcfe from the extension of lateral lengths of proved undeveloped reserves.\nAs of December 31, 2024, we had zero wells with proved undeveloped reserves that had remained undeveloped for more than five years from their time of booking.\n11\nTable of Contents\nThe following table presents estimated future net cash flows from proved reserves (excluding cash flows from open derivative contracts), the present value of such net cash flows discounted at a rate of 10% (PV-10) and the prices used in estimating such net cash flows. Our reserve estimates do not include any probable or possible reserves.\nYears Ended December 31,\n2024\n2023\n2022\n(Millions, unless otherwise noted)\nFuture net cash flow\n$\n17,094 \n$\n19,031 \n$\n87,612 \nStandardized Measure (a)\n7,999 \n9,262 \n40,065 \nPV-10 (a)\n9,844 \n11,520 \n51,512 \nPrices, including regional adjustments:\nNatural gas price ($/Mcf)\n$\n1.468 \n$\n1.700 \n$\n5.543 \nNGLs price ($/Bbl)\n29.28 \n28.44 \n38.66 \nOil price ($/Bbl)\n59.45 \n63.86 \n76.83 \n(a)\nPV-10 is a non-GAAP financial measure. PV-10 is derived from the standardized measure of discounted future net cash flows (the Standardized Measure), which is the most comparable financial measure calculated in accordance with GAAP. PV-10 differs from the Standardized Measure in that PV-10 excludes the effects of income taxes on future net revenues. We believe the presentation of PV-10 is relevant and useful to investors because it provides the discounted future net cash flows attributable to our proved reserves without regard to any of our specific income tax characteristics and is a useful measure for evaluating the relative monetary significance of our oil and natural gas properties. Investors may use PV-10 as a basis for comparing the relative size and value of our proved reserves to that of other companies. PV-10 should not be considered as a substitute for, or more meaningful than, the Standardized Measure. Neither PV-10 nor the Standardized Measure represents an estimate of the fair market value of our oil and natural gas properties. See below for a reconciliation of the Standardized Measure to PV-10.\nFuture net cash flows represent projected revenues from the sale of proved reserves, net of production and development costs (including transportation and gathering expenses, operating expenses and production taxes) and net of estimated income taxes. Revenues are based on a twelve-month unweighted average of the first-day-of-the-month pricing without escalation. Future cash flows are reduced by estimated production costs, administrative costs, costs to develop and produce the proved reserves and abandonment costs, all based on current economic conditions at each year-end. There can be no assurance that the proved reserves will be produced in the future or that prices, production or development costs will remain constant. There are numerous uncertainties inherent in estimating reserves and related information. See Note 17 to the Consolidated Financial Statements for further discussion of the preparation of, and year-over-year changes in, our reserves estimate and calculation of the Standardized Measure.\nThe following table provides the reconciliation of the Standardized Measure to PV-10.\nYears Ended December 31, \n2024\n2023\n2022\n(Millions)\nStandardized Measure\n$\n7,999 \n$\n9,262 \n$\n40,065 \nEstimated discounted income taxes on future net revenues\n1,845 \n2,258 \n11,447 \nPV-10\n$\n9,844 \n$\n11,520 \n$\n51,512 \nIf the prices we used to calculate the Standardized Measure instead reflected five-year strip pricing as of December 31, 2024 and held constant thereafter using (i) the NYMEX five-year strip adjusted for regional differentials using Texas Eastern Transmission Corp. M-2, Transcontinental Gas Pipe Line, Leidy Line, and Tennessee Gas Pipeline Co., Zone 4-300 Leg for gas and (ii) the NYMEX WTI five-year strip for oil, adjusted for regional differentials consistent with those used in the Standardized Measure, and holding all other assumptions constant, our total proved reserves would be 26,742 Bcfe, the Standardized Measure of our proved reserves would be $22,020 million, the discounted future net cash flows before taxes would be $26,712 million and the average realized product prices weighted by production over the remaining lives of the properties would be $3.016 per Mcf of gas, $24.49 per barrel of NGLs and $47.54 per barrel of oil.\n12\nTable of Contents\nThe NYMEX strip price for proved reserves and related metrics are intended to illustrate reserve sensitivities to market expectations of commodity prices and should not be confused with SEC pricing for proved reserves and do not comply with SEC pricing assumptions. We believe that the presentation of reserve volume and related metrics using NYMEX forward strip prices provides investors with additional useful information about our reserves because the forward prices are based on the market's forward-looking expectations of oil and gas prices as of a certain date. The price at which we can sell our production in the future is the major determinant of the likely economic producibility of our reserves. We hedge certain amounts of future production based on futures prices. In addition, we use such forward-looking market-based data in developing our drilling plans, assessing our capital expenditure needs and projecting future cash flows. While NYMEX strip prices represent a consensus estimate of future pricing, such prices are only an estimate and are not necessarily an accurate projection of future oil and gas prices. Actual future prices may vary significantly from NYMEX prices; therefore, actual revenue and value generated may be more or less than the amounts disclosed. Investors should be careful to consider forward prices in addition to, and not as a substitute for, SEC pricing, when considering our reserves.\nBased on our mix of proved undeveloped probable and possible reserves, we estimate that we have an undeveloped drilling inventory of approximately 3,600 gross locations. At our current drilling pace, these locations provide more than 30 years of drilling inventory based on gross undeveloped acres, average expected lateral length of 12,000 feet and well spacing of 1,000 feet.\n \nProduction Acreage\nThe majority of our production acreage is held by lease or occupied under perpetual easements or other rights acquired, for the most part, without warranty of underlying land titles. Approximately 37% of our total gross acres is developed. We retain deep drilling rights on the majority of our production acreage.\nThe following table summarizes our production acreage disaggregated by state.\nDecember 31, 2024\nPennsylvania\nWest Virginia\nOhio\nTotal\nTotal gross productive acreage\n440,850 \n264,583 \n73,247 \n778,680 \nTotal gross undeveloped acreage\n738,302 \n433,912 \n126,215 \n1,298,429 \nTotal gross acreage\n1,179,152 \n698,495 \n199,462 \n2,077,109 \nTotal net productive acreage\n434,088 \n225,617 \n62,931 \n722,636 \nTotal net undeveloped acreage\n726,978 \n370,008 \n108,438 \n1,205,424 \nTotal net acreage\n1,161,066 \n595,625 \n171,369 \n1,928,060 \nAverage net revenue interest of proved developed reserves\n80.6 \n%\n77.2 \n%\n43.4 \n%\n76.5 \n%\nWe have an active lease renewal program in areas targeted for development. In the event that production is not established or we do not extend or renew the terms of our expiring leases, 17,345, 26,478 and 29,342 of our net undeveloped production acreage as of December 31, 2024 will expire in the years ending December 31, 2025, 2026 and 2027, respectively.\n13\nTable of Contents\nProductive and In-Process Wells\nThe following table summarizes our productive and in-process natural gas wells. We had no productive or in-process oil wells as of December 31, 2024.\nDecember 31, 2024\nPennsylvania\nWest Virginia\nOhio\nTotal\nProductive wells:\nTotal gross productive wells (a)\n3,060 \n1,141 \n412 \n4,613 \nTotal net productive wells\n2,853 \n1,077 \n212 \n4,142 \nIn-process wells:\nTotal gross in-process wells\n146 \n147 \n13 \n306 \nTotal net in-process wells\n115 \n139 \n— \n254 \n(a)\nOf our total gross productive wells, there are 744 gross conventional wells in Pennsylvania and 6 gross conventional wells in West Virginia. We have no gross conventional wells in Ohio.\nDrilling Activity\nThe following table summarizes our completed net productive development wells. During the years ended December 31, 2024, 2023 and 2022, we did not drill any net dry development, net productive exploratory or net dry exploratory wells.\nPennsylvania\nWest Virginia\nOhio\nTotal\nYear Ended December 31, 2024\n76 \n44 \n2 \n122 \nYear Ended December 31, 2023\n91 \n47 \n2 \n140 \nYear Ended December 31, 2022\n55 \n26 \n2 \n83 \nThe following table summarizes the gross and net wells on which we commenced drilling operations (spud) in 2024.\nPennsylvania\nWest Virginia\nOhio\nTotal\nGross wells spud\n64 \n35 \n11 \n110 \nNet wells spud\n53 \n35 \n— \n88 \nProduction, Sales, Customers and Price\nThe following table summarizes our natural gas, NGLs and oil sales volume by state.\nPennsylvania\nWest Virginia\nOhio\nTotal\n(MMcfe)\nYear Ended December 31, 2024\n1,418,812 \n713,267 \n96,080 \n2,228,159 \nYear Ended December 31, 2023\n1,496,197 \n435,898 \n84,178 \n2,016,273 \nYear Ended December 31, 2022\n1,493,568 \n323,113 \n123,362 \n1,940,043 \nFor the years ended December 31, 2024, 2023 and 2022, lease operating expenses (LOE) per Mcfe were $0.09, $0.07 and $0.08, respectively. For more information on our Production segment's operating expenses, refer to \"Business Segment Results of Operations – PRODUCTION\" in Item 7., \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\nNatural Gas Sales.\n \nNatural gas is a commodity and, therefore, we typically receive market-based pricing for our produced natural gas. The market price for natural gas in the Appalachian Basin is typically lower relative to NYMEX Henry Hub, Louisiana (the location for pricing NYMEX natural gas futures) as a result of increased supply of natural gas in the Northeast United States and limited pipeline capacity to transport the supply to other regions. To protect our cash flow from undue exposure to the risk of changing commodity prices, we hedge a portion of our forecasted natural gas production at, for the most part, NYMEX natural gas prices. We also enter into derivative instruments to hedge basis. For information on our hedging strategy and our derivative instruments, refer to \"Commodity Risk Management\" in Item 7., \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" Item 7A., \"Quantitative and Qualitative Disclosures About Market Risk\" and Note 4 to the Consolidated Financial Statements.\n14\nTable of Contents\nNGLs Sales.\n We primarily sell NGLs recovered from our natural gas production. We contract with our Gathering segment (which owns and operates a processing facility), MarkWest Energy Partners, L.P., Williams Ohio Valley Midstream LLC and Blue Racer Midstream to process and extract heavier hydrocarbon streams (consisting predominately of ethane, propane, isobutane, normal butane and natural gasoline) from our produced natural gas. We market the majority of our NGLs.\nNatural Gas and NGLs Customers.\n \nWe sell natural gas and NGLs to marketers, utilities and industrial customers located in the Appalachian Basin and in markets that are accessible through our transportation portfolio, particularly where there is expected future demand growth such as in the Gulf Coast, Midwest, East Coast corridor and Northeast United States and Canada. As of December 31, 2024, approximately 44% of our sales volume reaches markets outside of Appalachia. We do not depend on any single customer and believe that the loss of any one customer would not have an adverse effect on our ability to sell our natural gas, NGLs and oil.\nWe have access to approximately 4.9 Bcf per day of firm pipeline takeaway capacity, including 1.29 Bcf per day of firm pipeline takeaway capacity on the MVP that we have contracted through June 30, 2044. In addition, we are committed to an additional 0.55 Bcf per day of firm pipeline takeaway capacity on MVP Southgate once in service. We have access to approximately 1.1 Bcf per day of firm processing capacity, including 0.2 Bcf per day of firm processing capacity on our owned processing facility. These firm transportation and processing agreements may require minimum volume delivery commitments, which we expect to principally fulfill with production from existing reserves.\nNatural Gas Marketing.\n \nEQT Energy, LLC, our indirect, wholly-owned marketing subsidiary, provides marketing services and contractual pipeline capacity management services primarily for our benefit. EQT Energy, LLC also engages in risk management and hedging activities to limit our exposure to shifts in market prices.\n \nAverage Sales Price.\n \nThe following table presents our average sales price per unit of natural gas, NGLs and oil, with and without the effects of cash settled derivatives, as applicable.\n \nYears Ended December 31,\n \n2024\n2023\n2022\nNatural gas ($/Mcf):\n \n \n \nAverage sales price, excluding cash settled derivatives\n$\n2.02 \n$\n2.37 \n$\n6.22 \nAverage sales price, including cash settled derivatives\n2.59 \n2.68 \n3.00 \nNGLs, excluding ethane ($/Bbl):\n \nAverage sales price, excluding cash settled derivatives\n$\n39.13 \n$\n36.39 \n$\n53.26 \nAverage sales price, including cash settled derivatives\n38.83 \n35.12 \n49.35 \nEthane ($/Bbl):\nAverage sales price\n$\n6.03 \n$\n6.00 \n$\n14.20 \nOil ($/Bbl):\n \nAverage sales price\n$\n58.67 \n$\n59.93 \n$\n77.06 \nNatural gas, NGLs and oil ($/Mcfe):\nAverage sales price, excluding cash settled derivatives\n$\n2.21 \n$\n2.50 \n$\n6.24 \nAverage sales price, including cash settled derivatives\n2.74 \n2.79 \n3.17 \nFor additional information on pricing, see \"Average Realized Price Reconciliation\" in Item 7., \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\n15\nTable of Contents\nDelivery Commitments\nWe have contractually agreed to deliver firm quantities of gas and NGLs to various customers, which we expect to fulfill with production from existing reserves. We regularly monitor our proved developed reserves to ensure sufficient availability to meet commitments for the next one to three years. The following table summarizes our total gross commitments as of December 31, 2024. \nNatural Gas\nNGLs\n(Bcf)\n(Mbbl)\nYears Ending December 31,\n2025\n1,333 \n12,869 \n2026\n572 \n5,429 \n2027\n520 \n3,808 \n2028\n404 \n3,660 \n2029\n349 \n3,650 \nThereafter\n1,811 \n27,380 \nDuring the fourth quarter of 2023, we entered into two firm sales agreements, pursuant to which we agreed to deliver and sell to the parties thereto up to an aggregate 1.2 Bcf per day of gas using our capacity on the MVP for up to ten years beginning in 2027. The firm sales agreements are subject to currently unsatisfied conditions related to the in-service date of the Transco Southeast Supply Enhancement project; therefore, their impact has been excluded from the schedule of total gross commitments in the table above.\nGathering Segment Assets and Operations\nGathering System\nAs of December 31, 2024, our gathering system included approximately 1,975 miles of gathering lines (of which approximately 1,260 miles were high-pressure gathering lines), 179 compression units with an aggregate compression of approximately 623,000 horsepower and multiple interconnect points to our transmission and storage system and to other interstate pipelines. In addition, we own a processing facility with capacity of 0.2 Bcf per day.\nGathering Customers\nOur Gathering segment has gathering agreements with our Production segment and third parties. Certain of our Gathering segment's agreements provide us the right to elect to gather all natural gas produced from wells located in specified dedicated acreage.\n \nFor the year ended December 31, 2024, our Production segment accounted for approximately 71% of our gathering system's throughput and approximately 80% of our Gathering segment's operating revenues. \nAs of December 31, 2024, our gathering system had total contracted firm reservation capacity, including contracted MVCs, of approximately 7.5 Bcf per day. Including future capacity expected from expansion projects that are not yet fully constructed or not yet fully in service for which we have executed firm service contracts, our gathering system had total contracted firm reservation capacity, including contracted MVCs, of approximately 8.6 Bcf per day as of December 31, 2024. \nBased on total projected contractual revenues, our firm gathering contracts with third parties had a weighted average remaining term of approximately 10 years as of December 31, 2024. In addition, based on total projected contractual revenues, our firm gathering contracts with our Production segment had a weighted average remaining term of approximately 14 years as of December 31, 2024.\nGenerally, our Gathering segment does not take title to the natural gas gathered by its assets, but it retains a percentage of wellhead gas receipts to recover natural gas used to fuel its compressor stations and meet other requirements of its gathering system.\n16\nTable of Contents\nTransmission Segment Assets and Operations\nTransmission System\nAs of December 31, 2024, our transmission and storage system included approximately 950 miles of FERC-regulated, interstate pipelines with total throughput capacity of approximately 5.0 Bcf per day, 44 compression units with an aggregate compression of approximately 175,000 horsepower and 8 interconnect points to other interstate pipelines and multiple local distribution companies. As of December 31, 2024, our transmission and storage system included 18 natural gas storage reservoirs with a peak withdrawal capacity of approximately 800 MMcf per day and a working gas capacity of approximately 43 Bcf.\nTransmission Customers\nOur Transmission segment has transmission and storage agreements with our Production segment and third parties. Third-party transmission and storage customers include local distribution companies, other producers, marketers and commercial and industrial users. For the year ended December 31, 2024, our Production segment accounted for approximately 64% of our transmission assets' throughput and approximately 59% of our Transmission segment's operating revenues.\nIncluding future capacity expected from expansion projects that are not yet fully constructed or not yet fully in service for which we have executed firm service contracts, our transmission and storage system had total firm capacity subscribed under transmission contracts of approximately 5.4 Bcf per day and total firm capacity subscribed under storage contracts of 38.4 Bcf as of December 31, 2024.\nBased on total projected contractual revenues, our firm transmission and storage contracts with third parties had a weighted average remaining term of approximately 11 years as of December 31, 2024. In addition, based on total projected contractual revenues, our firm transmission and storage contracts with our Production segment had a weighted average remaining term of approximately 13 years as of December 31, 2024.\nGenerally, our Transmission segment does not take title to the natural gas transported or stored by its assets but does retain a percentage of the gas receipts to recover natural gas used to fuel its compressor stations and meet other requirements of its transmission and storage system.\nAs of December 31, 2024, approximately 99% of our Transmission segment's contracted firm transmission capacity was subscribed under negotiated rate agreements. As of December 31, 2024, our Transmission segment had minimal contracted firm transmission capacity subscribed at discounted rates and recourse rates. See also \"Regulation\" below and Part I, \"Item 1A. Risk Factors – A substantial majority of the services we provide on our transmission and storage systems are subject to long-term, fixed-price 'negotiated rate' contracts that are subject to limited or no adjustment, even if our cost to perform such services exceeds the revenues received from such contracts, and, as a result, our costs could exceed our revenues received under such contracts, we could be unable to achieve the expected investment return under such contracts, and/or our business, financial condition, results of operations, and cash flows could be adversely affected.\" for additional information.\nThe MVP and MVP Southgate\nWe operate and hold an equity method investment in the MVP, a 303-mile long, 42-inch diameter natural gas interstate pipeline with a total capacity of 2.0 Bcf per day that spans from the Company's transmission and storage system in Wetzel County, West Virginia to Pittsylvania County, Virginia and has 3 interconnect points to other interstate pipelines. Based on total projected contractual revenues, the MVP's firm transmission contracts had a weighted average remaining term of approximately 19.5 years as of December 31, 2024.\nIn addition, we hold an equity method investment in MVP Southgate, a contemplated 31-mile, 30-inch diameter natural gas interstate pipeline with a targeted capacity of 0.55 Bcf per day that would extend from the terminus of the MVP in Pittsylvania County, Virginia to new delivery points in Rockingham County, North Carolina. MVP Southgate is estimated to have a total cost of approximately $370 million to $430 million, excluding allowance for funds used during construction (AFUDC) and certain costs incurred for purposes of the originally certificated project (see Note 11 to the Consolidated Financial Statements for further details), of which we will fund our proportionate share through capital contributions to the MVP Joint Venture (defined in Note 11 to the Consolidated Financial Statements).\n17\nTable of Contents\nSeasonality\nGenerally, but not always, the demand for natural gas (including the demand for its gathering, transmission or storage) decreases during the summer months and increases during the winter months. Seasonal anomalies such as mild winters or summers may also affect demand.\nCompetition\n \nOther natural gas producers compete with us in the acquisition of properties; the search for, and development of, reserves; the production and sale of natural gas and NGLs; and the securing of services, labor, equipment and transportation required to conduct operations. Our competitors include independent oil and gas companies, major oil and gas companies, individual producers, operators and marketing companies and other energy companies that produce substitutes for the commodities that we produce.\nCompetitors for our natural gas gathering business include companies that own major natural gas pipelines, independent gas gatherers and integrated energy companies, including natural gas producers that develop or acquire their own gathering system. When compared to us, some of our competitors have operations in multiple natural gas producing basins, greater capital resources and access to, or control of, larger natural gas supplies.\nCompetition for our natural gas transmission and storage business is based primarily on rates, customer commitment levels, timing, performance, commercial terms, reliability, service levels, location, reputation and fuel efficiencies. Our principal competitors include companies that own major natural gas pipelines in the Appalachian Basin. In addition, we compete with companies that are building high-pressure gathering facilities that are able to transport natural gas to interstate pipelines without being subject to FERC jurisdiction.\nRegulation\n \nRegulation of our Operations. \nOur exploration and production operations are subject to various federal, state and local laws and regulations, including regulations related to the following: the location of wells; the method of drilling, well construction, well stimulation, hydraulic fracturing and casing design; water withdrawal and procurement for well stimulation purposes; well production; spill prevention plans; the use, transportation, storage and disposal of fluids and materials incidental to oil and gas operations; surface usage and the reclamation of properties upon which wells or other facilities have been located; the plugging and abandoning of wells; the calculation, reporting and disbursement of royalties and taxes; and the gathering of production in certain circumstances. These regulations, and any delays in obtaining related authorizations, may affect the costs and timing of developing our natural gas resources.\nOur operations are also subject to conservation and correlative rights regulations, including the following: regulation of the size of drilling and spacing units or field rule units; setbacks; the number of wells that may be drilled in a unit or in close proximity to other wells; drilling in the vicinity of coal mining operations and certain other structures; and the unitization or pooling of natural gas properties. Ohio allows the statutory pooling or unitization of tracts to facilitate development and exploration. In Pennsylvania, lease integration legislation authorizes joint development of existing contiguous leases. West Virginia allows the operator of a proposed horizontal well to develop the acreage of non-consenting and unlocatable and unknown owners if 75% of the mineral interest owners and 55% of the working interest owners in the proposed well unit consent to the development. Additionally, state conservation and oil and gas laws generally limit the venting or flaring of natural gas. Various states also impose certain regulatory requirements to transfer wells to third parties or discontinue operations in the event of divestitures by us.\nWe also have gathering and processing operations that are subject to various federal and state environmental laws and local zoning ordinances, including the following: air permitting requirements for compressor station and dehydration units and other permitting requirements; erosion and sediment control requirements for compressor station and pipeline construction projects; waste management requirements and spill prevention plans for compressor stations; various recordkeeping and reporting requirements for air permits and waste management practices; compliance with safety regulations, including regulations by the U.S. Department of Transportation's Pipeline and Hazardous Materials Safety Administration (PHMSA); and siting and noise regulations for compressor stations. These regulations may increase the costs of operating existing pipelines and compressor stations and increase the costs of, and the time to develop, new or expanded pipelines and compressor stations.\n18\nTable of Contents\nWe use financial derivative instruments to hedge the impact of fluctuations in natural gas, NGLs and oil prices on our results of operations and cash flows. In 2010, Congress adopted comprehensive financial reform legislation that established federal oversight and regulation of the OTC derivative market and entities, such as us, that participate in that market. The legislation, known as the Dodd-Frank Wall Street Reform and Consumer Protection Act (the Dodd-Frank Act), required the CFTC, the SEC and other regulatory agencies to promulgate rules and regulations implementing this legislation. Among other things, the Dodd-Frank Act established margin requirements and requires clearing and trade execution practices for certain categories of swaps and may result in certain market participants needing to curtail or alter their derivative activities. The Dodd-Frank Act also created new categories of regulated market participants, such as \"swap dealers\" (SDs) and \"security-based swap dealers\" (SBSDs) that are subject to significant new capital, registration, recordkeeping, reporting, disclosure, business conduct and other regulatory requirements, a large number of which have been implemented. This regulatory framework has significantly increased the costs of entering into derivatives transactions for end-users of derivatives, such as us. In particular, new margin requirements and capital charges, even when not directly applicable to us, have increased the pricing of derivatives that we transact in.\nNew exchange trading margin regulations, trade reporting requirements and position limits may lead to changes in the liquidity of our derivative transactions or higher pricing. That said, our hedging activities are not subject to mandatory clearing or the margin requirements imposed in connection with mandatory clearing, although we are subject to certain recordkeeping and reporting obligations associated with the Dodd-Frank Act. Additionally, our uncleared swaps are not subject to regulatory margin requirements. Finally, we believe that the majority, if not all, of our hedging activities constitute bona fide hedging under applicable federal and exchange-mandated position limits rules and are not materially impacted by the limitations under such rules.\nIn addition to U.S. laws and regulations relating to derivatives, certain non-U.S. regulatory authorities have passed or proposed, or may propose in the future, legislation similar to that imposed by the Dodd-Frank Act. For example, European Union legislation imposes position limits on certain commodity transactions, and the European Market Infrastructure Regulation (EMIR) requires reporting of derivatives and various risk mitigation techniques to be applied to derivatives entered into by parties that are subject to EMIR. Other similar regulations are in development throughout the globe and may increase our cost of doing business even if not directly binding on us.\nRegulators periodically review or audit our compliance with applicable regulatory requirements. We anticipate that compliance with existing laws and regulations governing our current operations will not have a material adverse effect on our capital expenditures, earnings or competitive position. Additional proposals that affect the oil and gas industry are regularly considered by Congress, the states, regulatory agencies and the courts. We cannot predict when or whether any such proposals may become effective or the effect that such proposals may have on us.\nThe following is a summary of some of the existing laws, rules and regulations to which our business operations are subject.\nNatural Gas Sales and Transportation. \nThe availability, terms and cost of transportation significantly affect sales of oil and natural gas. The interstate transportation and sale for resale of oil and natural gas is subject to federal regulation, including regulation of the terms, conditions and rates for interstate transportation, storage and various other matters, primarily by the FERC. Federal and state regulations govern the price and terms for access to oil and natural gas pipeline transportation. The FERC's regulations for interstate oil and natural gas transportation in some circumstances may also affect the intrastate transportation of oil and natural gas.\nHistorically, federal legislation and regulatory controls have affected the price of the natural gas we produce and the manner in which we market our production. The FERC has jurisdiction over the transportation and sale for resale of natural gas in interstate commerce by natural gas companies under the Natural Gas Act of 1938 (NGA) and the Natural Gas Policy Act of 1978 (NGPA). Various federal laws enacted since 1978 have resulted in the removal of all price and non-price controls for sales of domestic natural gas sold in first sales, which include all of our sales of our own production. Under the Energy Policy Act of 2005, the FERC has substantial enforcement authority to prohibit the manipulation of natural gas markets and enforce its rules and orders, including the ability to assess substantial civil penalties of approximately $1.6 million per day for each violation and disgorgement of profits associated with any violation. While our production activities have not been regulated by the FERC as a natural gas company under the NGA, we are required to report the aggregate volume of natural gas purchased or sold at wholesale to the extent such transactions exceed a specific volume and use, contribute to or may contribute to the formation of price indices. In addition, Congress may enact legislation or the FERC may adopt regulations that may subject certain of our otherwise non-FERC jurisdictional facilities to further regulation. Failure to comply with those regulations in the future could subject us to civil penalties.\n19\nTable of Contents\nThe CFTC also holds authority to monitor certain segments of the physical, futures and other derivatives energy commodities markets, including natural gas, NGLs and oil. With regard to physical purchases and sales of natural gas and other energy commodities, and any related hedging activities that we undertake, we are required to observe anti-market manipulation and disruptive trading practices laws and related regulations enforced by the CFTC. The CFTC also holds substantial enforcement authority, including the ability to assess civil penalties.\nThe FERC also regulates interstate natural gas transportation rates and service conditions and establishes the terms under which we may use interstate natural gas pipeline capacity, which affects the marketing of natural gas that we produce, as well as the revenues we receive for sales of natural gas and release of our natural gas pipeline capacity. Commencing in 1985, the FERC promulgated a series of orders, regulations and rule makings that significantly fostered competition in the business of transporting and marketing gas. Today, interstate pipeline companies are required to provide non-unduly discriminatory transportation services to producers, marketers and other shippers, regardless of whether such shippers are affiliated with an interstate pipeline company. The FERC's initiatives have led to the development of a competitive, open access market for natural gas purchases and sales that permits all purchasers of natural gas to buy gas directly from third-party sellers other than pipelines. However, the natural gas industry historically has been very heavily regulated; therefore, we cannot guarantee that the less stringent regulatory approach currently pursued by the FERC and Congress will continue indefinitely into the future nor can we determine what effect, if any, future regulatory changes might have on our natural gas production activities.\nOur FERC-regulated operations are pursuant to tariffs approved by the FERC that establish rates (other than market-based rate authority), cost recovery mechanisms and terms and conditions of service to customers. Generally, the FERC's authority extends to rates and charges for: our natural gas transmission and storage services; certification and construction of new interstate transmission and storage facilities; abandonment of interstate transmission and storage services and facilities; maintenance of accounts and records; relationships between pipelines and certain affiliates; terms and conditions of services and service contracts with customers; depreciation and amortization policies; acquisitions and dispositions of interstate transmission and storage facilities; and initiation and discontinuation of interstate transmission and storage services.\nUnless market-based rates have been approved by the FERC, the maximum applicable recourse rates and terms and conditions for service are set forth in the pipeline's FERC-approved tariff. Generally, the maximum filed recourse rates for interstate pipelines are based on the cost of providing service, including the recovery of a return on the pipeline's actual and prudent historical investment costs. Key determinants in the ratemaking process include the depreciated capital costs of the facilities, the costs of providing service, the allowed rate of return and income tax allowance, as well as volume throughput and contractual capacity commitment assumptions.\nInterstate pipelines may not charge rates or impose terms and conditions of service that, upon review by the FERC, are found to be unjust or unreasonable, unduly discriminatory or preferential. Rate design and the allocation of costs also can affect a pipeline's profitability. While the ratemaking process establishes the maximum rate that can be charged, interstate pipelines, such as our transmission and storage system, are permitted to discount their firm and interruptible rates without further FERC authorization down to a specified minimum level, provided they do not unduly discriminate. In addition, pipelines are allowed to negotiate different rates with their customers, under certain circumstances. Changes to rates or terms and conditions of service, and contracts can be proposed by a pipeline company under Section 4 of the NGA, or the existing interstate transmission and storage rates, terms and conditions of service and/or contracts may be challenged by a complaint filed by interested persons including customers, state agencies or the FERC under Section 5 of the NGA. Rate increases proposed by a pipeline may be allowed to become effective subject to refund and/or a period of suspension, while rates or terms and conditions of service that are the subject of a complaint under Section 5 of the NGA are subject to prospective change by the FERC. Rate increases proposed by a regulated interstate pipeline may be challenged and such increases may ultimately be rejected by the FERC.\nOur interstate pipeline may also use negotiated rates that could involve rates above or below the recourse rate or rates that are subject to a different rate structure than the rates specified in our interstate pipeline tariffs, provided that the affected customers are willing to agree to such rates and that the FERC has approved the negotiated rate agreement. A prerequisite for allowing the negotiated rates is that negotiated rate customers must have had the option to take service under the pipeline's recourse rates. As of December 31, 2024, approximately 99% of our system's contracted firm transmission capacity was subscribed under negotiated rate agreements under its tariff. Some negotiated rate transactions are designed to fix the negotiated rate for the term of the firm transportation agreement and the fixed rate is generally not subject to adjustment for increased or decreased costs occurring during the contract term.\n20\nTable of Contents\nThe FERC's regulations also extend to the terms and conditions set forth in agreements for transmission and storage services executed between interstate pipelines and their customers. These service agreements are required to conform, in all material respects, with the form of service agreements set forth in the pipeline's FERC-approved tariff. Non-conforming agreements must be filed with and accepted by the FERC. In the event that the FERC finds that an agreement is materially non-conforming, in whole or in part, it could reject, or require us to seek modification of, the agreement, or alternatively require us to modify its tariff so that the non-conforming provisions are generally available to all customers or class of customers.\nThe FERC's jurisdiction also extends to the certification and construction of new interstate transmission and storage facilities, including, but not limited to, acquisitions, facility replacements and upgrades, expansions, and abandonment of facilities and services. Prior to commencing construction of new or existing interstate transmission and storage facilities, an interstate pipeline must obtain (except in certain circumstances, such as where the activity is permitted under the FERC's regulations or is authorized under the operator’s existing blanket certificate issued by the FERC) a certificate authorizing the construction, or file to amend its existing certificate, from the FERC.\nIn April 2018, the FERC issued a Notice of Inquiry (2018 Notice of Inquiry) seeking information regarding whether, and if so how, it should revise its approach under its currently effective policy statement on the certification of new natural gas transportation facilities (Certificate Policy Statement). The formal comment period in this proceeding closed in June 2018. In February 2021, the FERC issued another Notice of Inquiry in the same proceeding that modified and expanded the inquiry and renewed its request for public comment (together with the 2018 Notice of Inquiry, the Certificate Policy Statement NOI). The formal comment period closed in May 2021. In February 2022, the FERC issued an Updated Certificate Policy Statement and an interim greenhouse gas (GHG) policy. In March 2022, the FERC issued an order suspending the effectiveness of the Updated Certificate Policy Statement and the interim GHG policy. In January 2025, the FERC terminated the interim GHG policy proceeding, stating that GHG-related considerations are better considered on a case-by-case basis in individual proceedings; the FERC has taken no further action to date on the Updated Certificate Policy Statement. There is a possibility that Congress could pass legislation revising the NGA or other statutes that may impact our existing facilities and operations or the ability to construct new facilities. Potential areas of revision include, but are not limited to, (i) amending Section 5 of the NGA to allow the FERC to require a pipeline to make refunds from the date that a NGA Section 5 complaint was filed with the FERC if rates are later found to be unjust and unreasonable; (ii) amending Section 7 of the NGA affecting the ability of companies to exercise eminent domain; and (iii) amending Section 19(b) of the NGA to provide the FERC additional time to act on requests for rehearing.\nSection 1(b) of the NGA exempts natural gas gathering facilities from regulation by the FERC under the NGA. While the FERC does not generally regulate the rates and terms of service over facilities determined to be performing a natural gas gathering function, it has traditionally regulated rates charged by interstate pipelines for gathering services performed on the pipeline's own gathering facilities when those gathering services are performed in connection with jurisdictional interstate transmission services. We believe that our high-pressure gathering systems meet the traditional tests the FERC has used to establish a pipeline's status as an exempt gatherer not subject to regulation as a jurisdictional natural gas company. However, the distinction between FERC-regulated transmission services and federally unregulated gathering services is often the subject of litigation in the industry, so the classification and regulation of these systems are subject to change based on future determinations by the FERC, the courts or Congress.\nOil and NGLs Price Controls and Transportation Rates. \nSales prices of oil and NGLs are not currently regulated and are made at market prices. Our sales of these commodities are, however, subject to laws and regulations issued by the FTC prohibiting manipulative or fraudulent conduct in the wholesale petroleum market. The FTC holds substantial enforcement authority under these regulations, including the ability to assess civil penalties of more than $1.5 million per day per violation. Our sales of these commodities, and any related hedging activities, are also subject to CFTC oversight and enforcement authority as discussed above.\n21\nTable of Contents\nThe price we receive from the sale of our produced oil and NGLs may be affected by the cost of transporting such products to market. Some of our transportation of oil and NGLs is through FERC-regulated interstate common carrier pipelines. Effective as of January 1, 1995, the FERC implemented regulations generally grandfathering all previously approved interstate transportation rates and establishing an indexing system for those rates by which adjustments are made annually based on the rate of inflation, subject to certain conditions and limitations. The FERC's regulation of oil and NGLs transportation rates may tend to increase the cost of transporting oil and NGLs by interstate pipelines, although the annual adjustments may result in decreased rates in a given year. Every five years, the FERC must examine the relationship between the annual change in the applicable index and the actual cost changes experienced in the oil pipeline industry. The FERC's five-year index level for 2021 through 2026 went into effect on July 1, 2021. In January 2022, the FERC issued an order on rehearing, lowering the index level and directing oil pipelines to recompute their ceiling levels for July 1, 2021 through June 30, 2022 to ensure compliance with the new index level. In July 2024, the U.S. Court of Appeals for the District of Columbia Circuit found that the FERC did not adhere to notice-and-comment procedures in its January 2022 rehearing order. The court vacated the rehearing order. In October 2024, the FERC issued a supplemental notice of proposed rulemaking, which would amend the initial index prospectively by adopting a revised index level for the remainder of the five-year period that began on July 1, 2021.\nEnvironmental, Health and Safety Regulations. \nOur business operations are also subject to numerous stringent federal, state and local environmental, health and safety laws and regulations pertaining to, among other things, the release, emission or discharge of materials into the environment; the generation, storage, transportation, handling and disposal of certain materials, including solid and hazardous wastes; the safety of employees and the general public; pollution; site remediation; and preservation or protection of human health and safety, natural resources, wildlife and the environment. We must take into account environmental, health and safety regulations in, among other things, planning, designing, constructing, operating and plugging and abandoning wells and related facilities. Violations of these laws can result in substantial administrative, civil and criminal penalties. These laws and regulations may require us to acquire permits before drilling, constructing pipelines or other regulated activity commences; restrict the types, quantities and concentrations of various substances that can be released into the environment in connection with our operations; govern the sourcing and disposal of water used in the drilling and completion process; limit or prohibit drilling activities or pipeline construction in certain areas and on certain lands lying within wilderness, wetlands and other protected areas or areas with endangered or threatened species restrictions; require some form of remedial action to prevent, remediate or mitigate pollution from operations, such as plugging abandoned wells or closing earthen pits; establish specific health and safety criteria addressing worker protection; and impose substantial liabilities for pollution resulting from operations or failure to comply with applicable laws and regulations. In addition, these laws and regulations may restrict the rate of our production.\nMoreover, the trend has been for stricter regulation of activities that have the potential to affect the environment. Additional proposals and proceedings that affect the oil and natural gas industry are regularly considered by Congress, federal agencies, the states, local governments and the courts. We cannot predict when or whether any such proposals may become effective. Therefore, we are unable to predict the future costs or impact of compliance. The regulatory burden on the industry increases the cost of doing business and affects profitability. We have established procedures, however, for the ongoing evaluation of our operations to identify potential environmental exposures and to track compliance with regulatory policies and procedures.\nThe following is a summary of the more significant environmental and occupational health and safety laws and regulations, as amended from time to time, to which our business operations are subject and for which compliance may have a material adverse impact on our financial condition, earnings or cash flows.\nHazardous Substances and Waste Handling. \nThe Comprehensive Environmental Response, Compensation, and Liability Act (CERCLA), also known as the \"Superfund\" law, and comparable state laws impose liability, without regard to fault or the legality of the original conduct, on certain classes of persons that are considered to have contributed to the release of a \"hazardous substance\" into the environment. These persons include the current and past owner or operator of the disposal site or the site where the release occurred and companies that disposed or arranged for the disposal of the hazardous substances at the site where the release occurred. Under CERCLA, such persons may be subject to joint and several strict liability for the costs of cleaning up the hazardous substances that have been released into the environment and for damages to natural resources, and it is not uncommon for neighboring landowners and other third parties to file claims for personal injury and property damage allegedly caused by the hazardous substances released into the environment. In addition, despite the \"petroleum exclusion\" of Section 101(14) of CERCLA, which currently encompasses oil and natural gas, we generate materials in the course of our operations that may be regulated as hazardous substances based on their characteristics; however, we are unaware of any liabilities arising under CERCLA for which we may be held responsible that would materially and adversely affect us.\n22\nTable of Contents\nThe Resource Conservation and Recovery Act (RCRA) and analogous state laws establish detailed requirements for the generation, handling, storage, treatment and disposal of nonhazardous and hazardous solid wastes. RCRA specifically excludes drilling fluids, produced water and other wastes associated with the exploration, development or production of oil, natural gas or geothermal energy from regulation as hazardous wastes. However, these wastes may be regulated by the EPA, or state agencies under RCRA's less stringent nonhazardous solid waste provisions, or under state laws or other federal laws. Moreover, it is possible that these particular oil and natural gas exploration, development and production wastes currently classified as nonhazardous solid wastes could be classified as hazardous wastes in the future. Any changes to state or federal programs could result in an increase in our costs to manage and dispose waste, which could have a material adverse effect on our results of operations and financial condition.\nWe currently own, lease or operate numerous properties that have been used for oil and natural gas exploration and production activities for many years. Although we believe that we have used operating and waste disposal practices that were standard in the industry at the time, hazardous substances, wastes or petroleum hydrocarbons may have been released on, under or from the properties owned or leased by us, or on, under or from other locations, including offsite locations, where such substances have been taken for recycling or disposal. In addition, some of our properties have been operated by third parties or by previous owners or operators whose treatment and disposal of hazardous substances, wastes or petroleum hydrocarbons was not under our control. We are able to directly control the operation of only those wells with respect to which we act or have acted as operator. The failure of a prior owner or operator to comply with applicable environmental regulations may, in certain circumstances, be attributed to us as the current owner or operator under CERCLA. These properties and the substances disposed or released on, under or from them may be subject to CERCLA, RCRA and analogous state laws. Under such laws, we could be required to undertake response or corrective measures, regardless of fault, which could include removal of previously disposed substances and wastes, clean-up of contaminated property or performance of remedial plugging or waste pit closure operations to prevent future contamination.\nWater Discharges.\n The Federal Water Pollution Control Act, known as the Clean Water Act (CWA), and comparable state laws impose restrictions and strict controls regarding the discharge of pollutants, including produced waters and other oil and natural gas wastes, into federal and state waters. The discharge of pollutants into regulated waters is prohibited, except in accordance with the terms of a permit issued by the EPA or a state equivalent agency. The discharge of dredge and fill material in regulated waters, including wetlands, is also prohibited, unless authorized by a permit issued by the U.S. Army Corps of Engineers (Corps). In June 2015, the EPA and the Corps issued a rule defining the scope of the EPA's and the Corps' jurisdiction over waters of the United States (WOTUS), which never took effect before being replaced by the Navigable Waters Protection Rule (NWPR) in December 2019. A coalition of states and cities, environmental groups, and agricultural groups challenged the NWPR, which was vacated by a federal district court in August 2021. In January 2023, the EPA and the Corps issued a final rule that based the definition of WOTUS on the pre-2015 definition. The definition of WOTUS was further impacted by the U.S. Supreme Court's decision issued in May 2023 in \nSackett v. EPA\n, wherein the Court held that the jurisdiction of the CWA extends only to those adjacent wetlands that are indistinguishable from traditional navigable bodies of water due to a continuous surface connection and rejected the \"significant nexus\" test embraced in earlier jurisprudence. In September 2023, the EPA and the Corps published a direct-to-final rule redefining WOTUS to amend the January 2023 rule and align with the decision in \nSackett\n. The final rule eliminated the \"significant nexus\" test from consideration when determining federal jurisdiction and clarified that the CWA only extends to relatively permanent bodies of water and wetlands that have a continuous surface connection with such bodies of water. Roughly half of the states and other plaintiffs are challenging the September 2023 rule, and the EPA and the Corps are using the pre-2015 definition of WOTUS in these states while litigation continues. In addition, in an April 2020 decision further defining the scope of the CWA, the U.S. Supreme Court held that, in certain cases, discharges from a point source to groundwater could fall within the scope of the CWA and require a permit. The Court rejected the EPA and the Corps' assertion that groundwater should be totally excluded from the CWA. In November 2023, the EPA issued draft guidance describing the information that should be used to determine which discharges through groundwater may require a permit. However, in January 2025, President Trump issued executive orders directing (i) the EPA and the Corps to identify planned or potential actions that could be subject to emergency treatment under Section 404 of the CWA and (ii) the heads of all federal agencies to identify and begin the processes to suspend, revise, or rescind all agency actions, including all existing regulations and guidance documents, that are unduly burdensome on the identification, development, or use of domestic energy resources. Accordingly, future implementation and enforcement of these rules and policies is uncertain at this time. To the extent a new rule or further litigation expands the scope of the CWA's jurisdiction, we could face increased costs and delays with respect to obtaining permits for dredge and fill activities in wetland areas, which could delay our development projects and pipeline construction. Also, pursuant to these laws and regulations, we may be required to obtain and maintain approvals or permits for the discharge of wastewater or stormwater and to develop and implement spill prevention, control and countermeasure (SPCC) plans in connection with on-site storage of significant quantities of oil. These laws and any implementing regulations provide for administrative, civil and criminal penalties for any unauthorized discharges of oil and other substances and may impose substantial potential liability for the costs of removal and remediation and other damages.\n23\nTable of Contents\nThe \nSackett\n decision may also have effects on the implementation of Water Quality Certifications (WQCs) under Section 401 of the CWA. Section 401 requires that any activity that may result in a discharge to WOTUS must first receive a Section 401 WQC before a federal agency may issue a permit for that activity. A WQC is typically issued by the state where the discharge originates, or by the EPA itself in areas where a state or tribe does not have authority. In 2020, the EPA finalized a series of changes to the CWA regulations governing the WQC process, largely curtailing state and tribal authority over WQCs. In September 2023, the EPA published a final rule that restores state and tribal authority to review requests for WQCs and imposes additional requirements on the WQC process. The final rule took effect on November 27, 2023, but has been challenged by states and regulated entities in ongoing litigation to enjoin its enforcement. However, in January 2025, President Trump issued an executive order directing the heads of all federal agencies to identify and begin the processes to suspend, revise, or rescind all agency actions that are unduly burdensome on the identification, development, or use of domestic energy resources. Accordingly, future implementation and enforcement of the final rule is uncertain. If certain elements of the final rule remain in effect, we could face increased costs and delays with respect to obtaining permits for pipeline crossings and other activities in jurisdictional and non-jurisdictional waters.\nNationwide Permits (NWPs) are issued by the Corps under the CWA and the Rivers and Harbors Act of 1899 and act as a type of general permit to minimize delays and paperwork for certain activities and discharges in federal jurisdictional waters and wetlands. NWPs are typically reviewed and reissued (or modified) every five years. One such permit, NWP 12, authorizes certain \"Oil or Natural Gas Pipeline Activities\" and was most recently modified and reissued in January 2021. In March 2022, the Corps initiated an early review of NWP 12 to determine whether any future actions may be appropriate to modify NWP 12 prior to its expiration in 2026. The Corps solicited public and stakeholder comments through public meetings held in May 2022, but has not provided any additional updates on the status of its review. However, in January 2025, President Trump issued an executive order instructing the Corps to use emergency authorities and NWPs to grant approvals for energy projects under Section 404 of the CWA. As a result, any future revisions to NWPs, including NWP 12, are uncertain at this time. To the extent future revisions to NWP 12 or litigation relating to such revisions modify its provisions with respect to oil and natural gas pipeline activities, we could face increased costs and delays with respect to obtaining permits for certain activities in jurisdictional waters, including wetlands.\nAir Emissions. \nThrough the federal Clean Air Act (CAA) and comparable state and local laws and regulations, the EPA regulates emissions of various air pollutants through the issuance of permits and the imposition of other requirements. The EPA has developed, and continues to develop, stringent regulations governing emissions of air pollutants at specified sources. New facilities may be required to obtain permits before work can begin, and modified and existing facilities may be required to obtain additional permits.\nIn November 2021, the EPA announced a proposed rule expanding upon its New Source Performance Standards (NSPS) rule in Subpart OOOOa, establishing standards for methane and volatile organic compounds (VOCs) from new and modified oil and natural gas production and natural gas processing and transmission facilities which would establish standards for existing wells, impose more frequent and stringent leak monitoring, and mandate that all pneumatic controllers have zero emissions, among other requirements. The proposed rule sought to make existing regulations more stringent, create a Subpart OOOOb to expand reduction requirements for new, modified and reconstructed natural gas and oil sources, and create a Subpart OOOOc that would require states to develop plans to reduce methane emissions from existing sources that must be at least as effective as presumptive standards set by the EPA. In November 2022, the EPA issued a proposed rule supplementing the November 2021 proposed rule, which, among other things, created a new third-party monitoring program to identify large emissions events, referred to in the proposed rule as \"super emitters.\" The EPA announced a final rule in December 2023, which, among other things, requires the phase out of routine flaring of natural gas from new oil wells and routine leak monitoring at all well sites and compressor stations. Notably, the EPA updated the applicability date for Subparts OOOOb and OOOOc to December 6, 2022, meaning that sources constructed prior to that date will be considered existing sources with applicable compliance dates under state plans. The final rule gives states until March 2026 to develop and submit their plans for reducing methane from existing sources. Subpart OOOOc then provides until 2029 for existing sources to comply. Fines and penalties for violation of the final rule could be substantial. The final rule is subject to ongoing litigation but remains in effect. However, in January 2025, President Trump issued an executive order directing the heads of all federal agencies to identify and begin the processes to suspend, revise or rescind all agency actions that are unduly burdensome on the identification, development or use of domestic energy resources. Consequently, future implementation and enforcement of the final rule remains uncertain at this time.\n24\nTable of Contents\nAs a result of these regulatory changes, the scope of any final air emissions regulations or the costs for complying with such regulations are uncertain. We may incur costs as necessary to remain in compliance with these regulations. Obtaining or renewing permits also has the potential to delay the development of oil and natural gas projects. Federal and state regulatory agencies can impose administrative, civil and criminal penalties and seek injunctive relief for non-compliance with air permits or other requirements of the CAA and associated state laws and regulations.\nNational Environmental Policy Act (NEPA)\n. NEPA establishes a national environmental policy and goals for the protection, maintenance and enhancement of the environment and provides a process for implementing these goals within federal agencies. A major federal agency action with the potential to significantly impact the environment requires review under NEPA. Some activities are subject to robust NEPA review, which could lead to delays and increased costs that could materially adversely affect our revenues and results of operations. Other activities are covered under a categorical exclusion, which results in a shorter NEPA review process. In April 2022, the White House Council on Environmental Quality (CEQ) finalized the first of two planned rules to undo changes to NEPA enacted in 2020 under the Trump Administration. The Phase I final rule generally restores certain regulatory provisions that were in effect prior to the 2020 rule, affecting the assessment of projects ranging from oil and gas leasing to development on public and Native American lands. Additionally, in September 2023, the Biden Administration announced that federal agencies will be directed to consider the social cost of carbon in agency budgeting, procurement and other agency decisions, including in environmental reviews conducted pursuant to NEPA, where appropriate. In May 2024, CEQ finalized the Phase II rule, which generally restores certain mitigation language from the pre-2020 version of the NEPA regulations, proposes further revisions and meets environmental, environmental justice and climate change objectives. At least 20 states have challenged the Phase II rule in federal district court. The CEQ's changes could result in increased NEPA review timelines for projects involving agency action regarding federal lands, federal funds or federal permits or approvals. Additionally, in November 2024, a federal appeals court found that CEQ lacks statutory authority to issue NEPA regulations binding other federal agencies. However, the court's holding was confined to striking down the agencies’ action under review on separate grounds, and CEQ's Phase I and II rules remain in effect. However, in January 2025, President Trump issued executive orders (i) requiring CEQ to provide guidance on implementing NEPA and to propose rescinding and replacing CEQ's NEPA regulations with implementing regulations at the agency level; (ii) requiring the EPA to issue guidance on and to consider eliminating the social cost of carbon calculation from federal permitting or regulatory decisions; and (iii) instructing federal agencies to adhere to only the relevant legislated requirements for environmental reviews and to prioritize efficiency and certainty over any other objectives in such reviews. In February 2025, CEQ sent an interim final rule to the White House Office of Management and Budget that would immediately withdraw the NEPA implementing regulations. The potential impact of further changes to the NEPA regulations and statutory text therefore remains uncertain and could have an effect on our business and operations.\nClimate Change and Regulation of Methane and Other Greenhouse Gas Emissions\n. In December 2015, the 21st Conference of the Parties of the United Nations Framework Convention on Climate Change (COP) resulted in nearly 200 countries, including the United States, coming together to develop the Paris Agreement, which calls for the signatories to the agreement to undertake \"ambitious efforts\" to limit increases in the average global temperature. Although the agreement does not create any binding obligations for nations to limit their GHG emissions, it does require pledges to voluntarily limit or reduce future emissions. Pursuant to the terms of the Paris Agreement, the Biden Administration announced goals aimed at reducing the U.S.'s GHG emissions by 50 to 52% (compared to 2005 levels) by 2030. In addition, in September 2021, the Biden Administration publicly announced the Global Methane Pledge, a pact that aims to reduce global methane emissions to at least 30% below 2020 levels by 2030. At COP27, the United States agreed, in conjunction with the European Union and a number of other partner countries, to develop standards for monitoring and reporting methane emissions to help create a market for low methane-intensity natural gas. In August 2024, the European Union adopted a regulation to track and reduce methane emissions in the energy sector, including requiring new monitoring, reporting and verification measures to be applied by exporters to the European Union by January 1, 2027 and \"maximum methane intensity values\" must be met by 2030 and every year thereafter. Each member state will have the power to impose administrative penalties for failure to comply and the standard will be mandatory for supply contracts signed after the law takes effect. Additionally, at COP28, nearly 200 countries, including the United States, agreed to transition away from fossil fuels while accelerating action in this decade to achieve net zero by 2050 and entered into an agreement that calls for actions towards achieving, at a global scale, a tripling of renewable energy capacity and doubling energy efficiency improvements by 2030. Most recently, at COP29, participants representing 159 countries met and, among other things, agreed on rules to operationalize international carbon markets under Article 6 of the Paris Agreement. Various state and local governments have also publicly committed to furthering the goals of the Paris Agreement. However, in January 2025, President Trump issued an executive order directing immediate notice to the United Nations of the United States’ withdrawal from the Paris Agreement and all other agreements made under the United Nations Framework Convention on Climate Change. The full impact of these actions remains uncertain at this time.\n25\nTable of Contents\nIn recent years, the Congress has considered legislation to reduce GHG emissions. While Congress has not passed comprehensive climate legislation regulating the emission of GHGs, energy legislation and other regulatory initiatives have been enacted or proposed that are relevant to GHG emissions and climate change. In November 2021, Congress approved a $1 trillion legislative infrastructure package known as the Inflation Reduction Act of 2022 (IRA) which includes a number of climate-focused spending initiatives. The IRA also provides significant funding and incentives for research and development of low-carbon energy production methods, carbon capture, and other programs directed at addressing climate change, including instituting a Methane Emissions and Waste Reduction Incentive Program for petroleum and natural gas systems. This program requires the EPA to impose a \"waste emissions charge\" on methane emissions from certain natural gas and oil facilities that are in excess of a specified threshold. In November 2024, the EPA finalized a rule implementing the IRA's waste emissions charge that took effect in January 2025. The waste emissions charge imposed under the program for 2024 is $900 per ton emitted over the annual methane emissions threshold, and will increase to $1,200 in 2025, and $1,500 in 2026. The rule includes methodologies for calculating the amount by which a facility's reported methane emissions are below or exceed the waste emissions thresholds and certain exemptions created by the IRA. For petroleum and natural gas production facilities, the threshold is methane emissions in excess of 0.2% of the natural gas sent to sale from the facility or 10 metric tons of methane per million barrels of oil sent to sale from facility if the facility sends no natural gas to sale. If a facility's methane emissions do not exceed the 0.2% threshold, no fee is assessed under the program. Further, in May 2024, the EPA finalized revisions to the Greenhouse Gas Reporting Program for petroleum and natural gas systems (Subpart W). Among other things, the final rule (the Subpart W Revisions Rule) expands the emissions events that are subject to reporting requirements to include \"other large release events\" and applies reporting requirements to certain new sources and sectors. The emissions reported under the Greenhouse Gas Reporting Program will be the basis for any payments under the Methane Emissions and Waste Reduction Incentive Program in the IRA, and the Subpart W Revisions Rule may result in an increase in reported methane and other GHG emissions under Subpart W for many operators. The Subpart W Revisions Rule took effect in January 2025.\nFurthermore, in May 2024, the EPA published final rules for carbon emission limits and guidelines for new, modified, reconstructed and existing fossil fuel-fired (i.e., coal, oil and gas-fired) power plants. The rules purport to reflect the best system of emissions reduction and use of technology-based improvements, including carbon capture and sequestration and low-GHG hydrogen. The rules also revise the NSPS for new fossil fuel-fired stationary combustion turbine units and existing fossil fuel-fired steam generating electric generating units (EGUs), create new GHG emissions guidelines for existing fossil fuel-fired steam generating EGUs and for existing large, frequently operated stationary combustion turbines. The rules require states to submit plans for the establishment, implementation, and enforcement of performance standards for existing sources to the EPA within 24 months of the effective date of the emission guidelines, and compliance deadlines for stationary sources begin by 2030 for existing steam generating units, and 2032 or 2035 for existing combustion turbine units, depending on their subcategory. A coalition of 25 states, energy companies, utilities and fossil fuel industry groups immediately challenged the rules in federal court. In October 2024, the U.S. Supreme Court denied a request to stay the rule for new gas-fired and existing coal-fired power plants while the litigation continues. However, petitions for reconsideration to the EPA are pending and litigation in the D.C. Circuit has commenced. Additionally, in January 2025, President Trump issued an executive order directing the heads of all federal agencies to identify and begin the processes to suspend, revise or rescind all agency actions that are unduly burdensome on the identification, development or use of domestic energy resources. Consequently, future implementation and enforcement of these rules remains uncertain at this time.\nAdditionally, a number of U.S. state and regional efforts have emerged that are aimed at tracking and/or reducing GHG emissions by means of carbon taxes, policies and incentives, and cap-and-trade programs. In October 2019, then-Pennsylvania Governor Wolf signed an Executive Order directing the Pennsylvania Department of Environmental Protection to draft regulations establishing a cap-and-trade program with the intent of enabling Pennsylvania to join the Regional Greenhouse Gas Initiative (RGGI), a multi-state regional cap-and-trade program comprised of several Eastern U.S. states. Pennsylvania became a member of RGGI in April 2022; however, since joining RGGI, Pennsylvania's membership has been the subject of various legal challenges. In November 2023, the Pennsylvania Commonwealth Court held that the state's participation in RGGI is unconstitutional, and funds raised by the state through its participation in RGGI constitute an invalid tax, which ruling was appealed in December 2023 to the Supreme Court of Pennsylvania. In March 2024, Pennsylvania Governor Shapiro unveiled a proposal to adopt a carbon pricing program similar to RGGI and stated that he would pull Pennsylvania out of RGGI if the state legislature enacts his proposal. In September 2024, legislation that would repeal the state’s participation in RGGI passed the Pennsylvania Senate. At this time, it is unclear to what extent, if any, Pennsylvania will continue to seek participation in RGGI or a similar emissions cap-and-trade program.\n26\nTable of Contents\nRegulations requiring the disclosure of GHG emissions and other climate-related information or information substantiating climate-related claims are also increasingly being adopted or proposed at the federal and state level. For example, at the state level, California enacted legislation in October 2023 that will ultimately require certain companies that do business in California to publicly disclose their Scopes 1, 2, and 3 GHG emissions, with third party assurance of such data, and issue public reports on their climate-related financial risk and related mitigation measures, as well as legislation that requires companies operating in California to disclose information that supports certain climate-related claims. Certain of California's climate disclosure rules took effect in January 2025, with the disclosure of Scope 1 and 2 GHG emissions data scheduled to take effect beginning in 2026.\nAny legislation or regulatory programs at the international, federal, state or local levels designed to reduce methane or other GHG emissions could increase the cost of consuming, and thereby reduce demand for, the natural gas, NGLs and oil we produce. Consequently, legislation and regulatory programs designed to reduce emissions of methane or other GHGs could have an adverse effect on our business, financial condition and results of operations.\nIt is not possible at this time to predict how legislation or regulations that may be adopted to address climate change, methane and other GHG emissions would impact our business. Further, the U.S. Supreme Court's decision in \nLoper Bright Enterprises v. Raimondo\n to overrule \nChevron U.S.A. Inc. v. Natural Resources Defense Council, Inc.\n and end the concept of general deference to regulatory agency interpretations of laws introduces new complexity for federal agencies and administration of climate change policy and regulatory programs. However, many of these initiatives at the international, state and local levels are expected to continue, and existing laws and regulations and any such future laws and regulations of this nature, including those imposing reporting obligations on, or imposing a tax or fee or otherwise limiting emissions of methane or other GHG emissions from, our equipment and operations, could require us to incur costs to comply with such regulations. Substantial limitations or fees on methane or other GHG emissions could also adversely affect demand for the natural gas, NGLs and oil we produce and transport and lower the value of our reserves.\nFurther, activism directed at shifting funding away from fossil fuel companies could result in limitations or restrictions on certain sources of funding for the sector. Moreover, activist shareholders have introduced proposals to certain companies seeking to force companies to adopt aggressive emission reduction targets or to shift away from more carbon-intensive activities. While we cannot predict the outcomes of such proposals, they could ultimately make it more difficult to engage in our operations.\nFinally, it should be noted that some scientists have concluded that increasing concentrations of GHGs in the Earth's atmosphere produce climate changes that may have significant physical effects, such as increased frequency and severity of storms, floods, droughts and other extreme climatic events. If any such effects were to occur, they have the potential to cause physical damage to our assets or affect the availability of water and thus could have an adverse effect on our operations.\nHydraulic Fracturing Activities. \nVast quantities of natural gas deposits exist in shale and other formations. It is customary in our industry to recover natural gas from these shale formations through the use of hydraulic fracturing, combined with sophisticated horizontal drilling. Hydraulic fracturing is the process of creating or expanding cracks, or fractures, in formations underground where water, sand and other additives are pumped under high pressure into a shale gas formation. These deeper formations are geologically separated and isolated from fresh ground water supplies by overlying rock layers. Our well construction practices include installation of multiple layers of protective steel casing surrounded by cement that are specifically designed and installed to protect freshwater aquifers. To assess water sources near our drilling locations, we conduct multiple pre-drill samplings for all water sources within 3,000 feet of our sites and post-drill samplings for sources within 1,500 feet of our sites.\nHydraulic fracturing typically is regulated by state oil and natural gas agencies, but the EPA has asserted federal regulatory authority pursuant to the federal Safe Drinking Water Act (SDWA) over certain hydraulic fracturing activities involving the use of diesel fuels and has prohibited the discharge of wastewater from hydraulic fracturing operations to publicly owned wastewater treatment plants. Congress has from time to time considered legislation to provide for federal regulation of hydraulic fracturing under the SDWA and to require disclosure of the chemicals used in the hydraulic fracturing process. At the state level, several states have adopted or are considering legal requirements that could impose more stringent permitting, disclosure and well construction requirements on hydraulic fracturing activities. Local governments also may seek to adopt ordinances within their jurisdictions regulating the time, place and manner of drilling activities in general or hydraulic fracturing activities in particular. Some states and municipalities have sought to ban hydraulic fracturing altogether. If new or more stringent federal, state or local legal restrictions relating to the hydraulic fracturing process are adopted in areas where we operate, we could incur potentially significant added costs to comply with such requirements, experience delays or curtailment in the pursuit of exploration, development or production activities, and perhaps even be precluded from constructing wells.\n27\nTable of Contents\nIn April 2024, the Bureau of Land Management (BLM) finalized a rule to reduce the waste of natural gas from venting, flaring and leaks during oil and gas production activities on federal and Native American leases. The final rule took effect in June 2024. However, in May 2024, the states of North Dakota, Texas, Montana, Wyoming and Utah challenged the rule. In September 2024, the U.S. District Court for the District of North Dakota granted a motion prohibiting the BLM from enforcing the rule against those states pending the outcome of the litigation. However, in January 2025, President Trump issued an executive order directing the heads of all federal agencies to identify and begin the processes to suspend, revise or rescind all agency actions that are unduly burdensome on the identification, development or use of domestic energy resources. Consequently, future implementation and enforcement of the final rule remains uncertain at this time.\nPipeline Safety and Maintenance Regulations. \nOur interstate natural gas pipeline system and natural gas storage assets are subject to regulation by the PHMSA. The PHMSA has established safety requirements pertaining to the design, installation, testing, construction, operation and maintenance of gas pipeline and storage facilities, including requirements that pipeline and storage operators develop a written qualification program for individuals performing covered tasks on pipeline facilities and implement pipeline and storage well integrity management programs. These integrity management plans require more frequent inspections and other preventive measures to ensure safe operation of oil and natural gas transportation pipelines and storage facilities in high population areas or facilities that are hard to evacuate and areas of daily concentrations of people.\nNotwithstanding the investigatory and preventative maintenance costs incurred in our performance of customary pipeline and storage management activities, we may incur significant additional expenses if anomalous pipeline or storage conditions are discovered or more stringent safety requirements are implemented. For example, in April 2016, the PHMSA published a notice of proposed rulemaking addressing several integrity management topics and proposing new requirements to address safety issues for natural gas transmission and gathering lines, along with certain storage facilities (the Mega Rule). The PHMSA intended the Mega Rule to strengthen existing integrity management requirements, expand assessment and repair requirements to pipelines in areas with medium population densities, and extend regulatory requirements to onshore gas gathering lines that are currently exempt. Part I of the Mega Rule was promulgated in October 2019, with an effective date of July 1, 2020 (see discussion below). Part II was promulgated in November 2021, with an effective date of May 16, 2022 (see discussion below). Finally, Part III of the Mega Rule was promulgated in August 2022, with an effective date of May 24, 2023 (see discussion below).\nFurther, in June 2016, then-President Obama signed the Protecting Our Infrastructure of Pipelines and Enhancing Safety Act of 2016 (the 2016 Pipeline Safety Act), extending the PHMSA's statutory mandate under prior legislation through 2019. In addition, the 2016 Pipeline Safety Act empowered the PHMSA to address imminent hazards by imposing emergency restrictions, prohibitions and safety measures on owners and operators of gas or hazardous liquid pipeline facilities without prior notice or an opportunity for a hearing and also required the PHMSA to develop new safety standards for natural gas storage facilities by June 2018. Pursuant to those provisions of the 2016 Pipeline Safety Act, the PHMSA issued a final rule effective December 2, 2019 that expanded the agency's authority to impose emergency restrictions, prohibitions and safety measures and issued a final rule effective March 13, 2020 that strengthened the rules related to underground natural gas storage facilities, including well integrity, wellbore tubing and casing integrity.\nThe PHMSA has also published five final rules on pipeline safety applicable to us: \"Enhanced Emergency Order Procedures;\" \"Safety of Gas Transmission Pipelines: Maximum Allowable Operating Pressure Reconfirmation, Expansion of Assessment Requirements, and Other Related Amendments\" (also known as the Mega Rule Part I); and \"Safety of Gas Gathering Pipelines: Extension of Reporting Requirements, Regulation of Large, High-Pressure Lines, and Other Related Amendments\" (also known as the Mega Rule Part II); and \"Safety of Gas Transmission Pipelines: Repair Criteria, Integrity Management Improvements, Cathodic Protection, Management of Change, and Other Related Amendments\" (also known as the Mega Rule Part III); and “Pipeline Safety: Requirement of Valve Installation and Minimum Rupture Detection Standards” (the valve rule). The Enhanced Emergency Order Procedures rule, which became effective on December 2, 2019, implements an existing statutory authorization for the PHMSA to issue emergency orders related to pipeline safety if an unsafe condition or practice, or a combination of unsafe conditions and practices, constitutes, or is causing an imminent hazard. Mega Rule Part I, which went into effect on July 1, 2020, requires operators of certain gas transmission pipelines that have been tested or that have inadequate records to determine the material strength of their lines by reconfirming the Maximum Allowable Operating Pressure (MAOP), and establishes a new Moderate Consequence Area for determining regulatory requirements for gas transmission pipeline segments outside of high consequence areas. The rule also establishes new requirements for conducting baseline assessments, incorporates into the regulations industry standards and guidelines regarding design, construction and in-line inspections (ILI), and new requirements for data integration and risk analysis in integrity management programs, including seismicity, manufacturing and construction defects, and crack and crack-like defects, and includes several requirements that allow operators to notify the PHMSA of proposed alternative approaches to achieving the objectives of the minimum safety standards. \n28\nTable of Contents\nMega Rule Part II, which was finalized in November 2021 and went into effect on May 16, 2022, extends existing design, operational and maintenance, and reporting requirements to onshore natural gas gathering pipelines in rural areas. The rule requires operators of onshore gas gathering pipelines to report incidents and file annual reports (with the first annual reports submitted in Spring 2023) and creates new safety requirements that vary based on pipeline diameter and potential consequences of a failure. Mega Rule Part III, which was finalized in August 2022, went into effect on May 24, 2023. The rule requires operators of certain transmission pipelines to assess their integrity management practices and comply with enhanced corrosion control and mitigation timelines. It also establishes new requirements for pipeline inspections following an extreme weather event or natural disaster and provides enhanced guidance for pipeline repairs. The valve rule requires the installation of remote operated rupture mitigation valves on new or entirely replaced transmission and storage lines when valves are installed to meet valve spacing requirements. In addition, the valve rule includes requirements for operator actions to be taken when notified of a potential rupture that include notifying emergency response agencies and closing valves within a specified timeframe.\nHowever, as discussed below, we do expect certain compliance costs to increase in the future, and we continue to assess the impact of compliance with these rules which could materially impact our future costs of operations and revenue from operations. For example, Mega Rule Part I requires MAOP reconfirmation of certain previously untested transmission pipeline segments, which are commonly referred to as ‘‘grandfathered’’ pipelines. Our grandfathered pipeline MAOP reconfirmation efforts, which we have initiated, may result in unanticipated testing and/or replacement costs. When reconfirming MAOP on certain of our grandfathered pipeline segments we may be required to remove portions of pipelines for testing, shut in certain pipelines, and/or may face significant operational or technical challenges when performing either a pressure test or an ILI examination, which could result in substantial costs related thereto, or to repairs, remediation, or replacing existing pipelines, and/or other mitigating actions that may be determined to be necessary as a result of the tests, as well as lost cash flows resulting from shutting down our pipelines during the pendency of any such actions, which could be material to our capital expenditures, earnings and competitive position. Additionally, ensuring complete compliance with the applicable Mega Rule compliance deadlines may cause us to incur significant additional expenses if anomalous pipeline conditions are discovered.\nStates are generally preempted by federal law in the area of pipeline safety, but state agencies may qualify to assume responsibility for enforcing federal regulations over intrastate pipelines. They may also promulgate additive pipeline safety regulations provided that the state standards are at least as stringent as the federal standards. Although many of our natural gas facilities fall within a class that is not subject to integrity management requirements, we may incur significant costs and liabilities associated with repair, remediation, preventive or mitigation measures associated with our non-exempt transmission pipelines. The costs, if any, for repair, remediation, preventive or mitigating actions that may be determined to be necessary as a result of the testing program, as well as lost cash flows resulting from shutting down our pipelines during the pendency of any such actions, could be material to our capital expenditures, earnings and competitive position.\nShould we fail to comply with U.S. Department of Transportation regulations adopted under authority granted to the PHMSA, we could be subject to penalties and fines. The PHMSA has the statutory authority to impose civil penalties for pipeline safety violations up to a maximum of approximately $272,926 per day for each violation and approximately $2.7 million for a related series of violations. This maximum penalty authority established by statute will continue to be adjusted periodically to account for inflation. In addition, we could be required to make additional, unforeseen maintenance capital expenditures in the future for our regulatory compliance initiatives. Additionally, the adoption of new laws and regulations, such as the Mega Rule discussed above, could result in significant added costs or delays to in service or the termination of projects, which could have a material adverse effect on us in the future.\nIn December 2020, President Trump signed the \"Protecting our Infrastructure of Pipelines and Enhancing Safety (PIPES Act) of 2020,\" which reauthorized the federal pipeline safety program that expired in 2019. The PIPES Act identifies areas where Congress believed additional oversight, research, or regulations was needed. The PIPES Act includes new mandates for the PHMSA to require operators to update, as needed, their emergency response plans and operating and maintenance plans. The PIPES Act also requires operators to manage records and update, as necessary, their existing district regulator stations to eliminate a common mode of failure. The PHMSA will also require that leak detection and repair programs consider the environment, the use of advance lead detection practices and technologies, and that operators be able to locate and categorize all leaks that are hazardous to human safety, the environment, or that can become hazardous. We have not incurred and do not anticipate incurring material capital expenditures in connection with complying with the PIPES Act.\n29\nTable of Contents\nOccupational Safety and Health Act.\n We are subject to the requirements of the federal Occupational Safety and Health Act and comparable state laws that regulate the protection of the health and safety of employees. In addition, the Occupational Health and Safety Administration's (OSHA) hazard communication standard, the Emergency Planning and Community Right to Know Act and implementing regulations and similar state statutes and regulations require us to maintain information about hazardous materials used or produced in our operations and this information is required to be provided to employees, state and local government authorities, and citizens.\nEndangered Species Act and Migratory Bird Treaty Act. \nThe federal Endangered Species Act (ESA) provides for the protection of endangered and threatened species. Pursuant to the ESA, if a species is listed as threatened or endangered, restrictions may be imposed on activities adversely affecting that species' habitat. The U.S. Fish and Wildlife Service (FWS) may designate critical habitat and suitable habitat areas that it believes are necessary for survival of a threatened or endangered species. In June and July 2022, the FWS issued final rules rescinding the regulations defining \"habitat\" and governing critical habitat exclusions. In March 2024, the FWS issued three final rules governing interagency cooperation, listing species and designating critical habitat, and expanding protection options for species listed as threatened pursuant to the ESA. Protections similar to the ESA are offered to migratory birds under the Migratory Bird Treaty Act (MBTA), which makes it illegal to, among other things, hunt, capture, kill, possess, sell, or purchase migratory birds, nests, or eggs without a permit. This prohibition covers most bird species in the U.S. In October 2021, the Department of the Interior issued an advance notice of proposed rulemaking seeking comment on the Department's plan to develop regulations that authorize incidental taking under certain prescribed conditions. The Department has not yet issued a proposed rule. However, in January 2025, President Trump issued an executive order directing the heads of all federal agencies to identify and begin the processes to suspend or rescind all agency actions that are unduly burdensome on the identification, development or use of domestic energy resources. Consequently, future implementation and enforcement of the rules impacting the ESA and the MBTA are uncertain. A critical habitat or suitable habitat designation could result in further material restrictions to federal land use and may materially delay or prohibit access to protected areas for natural gas development. Further, the designation of previously unprotected species as threatened or endangered in areas where underlying property operations are conducted could cause us to incur increased costs arising from species protection measures or could result in limitations on our exploration, production and midstream activities that could have an adverse impact on our ability to develop and produce reserves and transport products to points of sale. There is also increasing interest in nature-related matters beyond protected species, such as general biodiversity, which may similarly require us or our customers to incur costs or take other measures that may adversely impact our business or operations.\nSee Note 15 to the Consolidated Financial Statements for a description of expenditures related to environmental matters. \nHuman Capital Resources\n \nAs of December 31, 2024, we had 1,461 full-time equivalent employees (i.e., excluding temporary employees and contractors), none of whom were subject to a collective bargaining agreement. Of our employee base, 77% are male and 23% are female. Approximately 56% of our permanent employees work remotely, with 95% residing in Pennsylvania, West Virginia, Texas or Ohio.\nWe aim to develop a workforce that produces peer-leading results. To further that goal, we have focused on creating a modern, innovative, collaborative and digitally-enabled work environment. Our cloud-based digital work environment serves as our primary platform for communication and collaboration as well as the home for our critical work processes and drives decision-making based on a shared and transparent view of operational data. We use our digital work environment to engage directly with our employees by sharing company updates and personnel accomplishments as well as to solicit suggestions and comments from all employees. We believe that this helps promote real-time feedback and a greater degree of employee engagement, which lays the foundation for the success of our workforce.\nWe understand that providing employees with the resources and support they need to live a physically, mentally and financially healthy life is critical for sustaining a workplace of choice. We offer benefits that include subsidized health insurance, a company contribution and company match on 401(k) retirement savings, an employee stock purchase plan, paid maternity and paternity leave, flexible work arrangements, volunteer time off and a company match on employee donations to qualified non-profits. We also offer our employees the flexibility to elect to work a \"9/80\" work schedule, under which, during the standard 80-hour pay period, an employee works eight 9-hour days and one 8-hour day (Friday), with a tenth day off (alternating Fridays). \nWe also offer an \"equity-for-all\" program, pursuant to which, we grant annual equity awards to all of our employees. With the equity-for-all program, all of our employees become owners of EQT and have the opportunity to share directly in our financial success.\n30\nTable of Contents\nAvailability of Reports and Other Information\n \nWe make certain filings with the SEC, including our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and all amendments and exhibits to those reports, available free of charge through our investor relations website, http://ir.eqt.com, as soon as reasonably practicable after they are filed with or furnished to the SEC. Reports filed with the SEC are also available on the SEC's website, http://www.sec.gov.\nWe use our X (formerly known as Twitter) account, @EQTCorp, our Facebook account, @EQTCorporation, and our LinkedIn account, EQT Corporation, as additional ways of disseminating information that may be relevant to investors.\nWe generally post the following to our investor relations website shortly before or promptly following its first use or release: financially-related press releases, including earnings releases and supplemental financial information; various SEC filings; presentation materials associated with earnings and other investor conference calls or events; and access to live and recorded audio from earnings and other investor conference calls or events. In certain cases, we may post the presentation materials for other investor conference calls or events several days prior to the call or event. For earnings and other conference calls or events, we generally include within our posted materials a cautionary statement regarding forward-looking and non-GAAP financial information as well as non-GAAP to GAAP financial information reconciliations (if available). Such GAAP reconciliations may be in materials for the applicable presentation, in materials for prior presentations or in our annual, quarterly or current reports.\nIn certain circumstances, we may post information, such as presentation materials and press releases, to our corporate website, www.EQT.com, or our investor relations website to expedite public access to information regarding EQT in lieu of making a filing with the SEC for first disclosure of the information. When permissible, we expect to continue to do so without also providing disclosure of this information through filings with the SEC.\nWhere we have included internet addresses in this Annual Report on Form 10-K, we have included those internet addresses as inactive textual references only. Except as specifically incorporated by reference into this Annual Report on Form 10-K, information on those websites is not part hereof.\nJurisdiction and Year of Formation\n \nWe are a Pennsylvania corporation formed in 2008 in connection with a holding company reorganization of the former Equitable Resources, Inc.\n31\nTable of Contents",
  "item7": "Item 7.        Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of financial condition and results of operations should be read in conjunction with the Consolidated Financial Statements and the notes thereto included in Item 8., \"Financial Statements and Supplementary Data.\" \nRecent and Significant Events\nMidstream Joint Venture Transaction\nOn December 30, 2024, in connection with the completion of the Midstream Joint Venture Transaction, the Midstream Joint Venture received $3.5 billion of cash consideration, net of certain transaction fees and expenses, from a third-party investor in exchange for a noncontrolling equity interest in the Midstream Joint Venture. We used the proceeds from the Midstream Joint Venture Transaction to repay outstanding borrowings under the Bridge Credit Facility (defined in Note 10 to the Consolidated Financial Statements) and the Term Loan Facility and a portion of outstanding borrowings under EQT's revolving credit facility. Borrowings under the Bridge Credit Facility were used to fund the redemption and repurchase of certain of EQM's senior notes, including pursuant to the EQM Tender Offer (defined in Note 10 to the Consolidated Financial Statements).\nNEPA Non-Operated Asset Divestitures and NEPA Gathering System Acquisition\nResults of operations for 2024 include the results of our operation of assets received as consideration for the First NEPA Non-Operated Asset Divestiture, which closed on May 31, 2024. Such assets received included the remaining 16.25% equity interest in the NEPA Gathering System (defined in Note 6 to the Consolidated Financial Statements) (which was the sole remaining minority interest following our acquisition of a 33.75% equity interest in the NEPA Gathering System Acquisition (defined in Note 6 to the Consolidated Financial Statements) on April 11, 2024), resulting in our 100% ownership of the NEPA Gathering System. See Note 7 to the Consolidated Financial Statements.\nIn addition, on December 31, 2024, we completed the Second NEPA Non-Operated Asset Divestiture. See Note 7 to the Consolidated Financial Statements. We used the proceeds from the Second NEPA Non-Operated Asset Divestiture of $1.25 billion, subject to customary post-closing purchase price adjustments and transaction costs, to repay a portion of outstanding borrowings under EQT's revolving credit facility.\nEquitrans Midstream Merger\nResults of operations for 2024 include the results of our operation of assets acquired in the Equitrans Midstream Merger, which closed on July 22, 2024. Following the completion of the Equitrans Midstream Merger, we own a gathering system with 1,975 miles of gathering lines (including gathering lines owned prior to the Equitrans Midstream Merger) and a transmission and storage system with approximately 950 miles of FERC-regulated, interstate pipelines. See Note 6 to the Consolidated Financial Statements.\nFor the period from July 22, 2024 through December 31, 2024, our consolidated gathering expense decreased due to our ownership of the gathering and transmission assets acquired in the Equitrans Midstream Merger. Our ownership of such assets will continue to positively impact our Production segment's gathering expense, with a corresponding increase to our Production segment's affiliate transportation and processing expense, which is eliminated in consolidation. This relationship will be prominent for full year 2025 results and beyond.\nTug Hill and XcL Midstream Acquisition\nResults of operations for 2024 and the second half of 2023 include the results of our operation of assets acquired in the Tug Hill and XcL Midstream Acquisition (defined in Note 6 to the Consolidated Financial Statements), which closed on August 22, 2023.\n65\nTable of Contents\nTrends and Uncertainties\nOn March 4, 2024, we announced our decision to strategically curtail approximately 1.0 Bcfe per day of gross production (the Strategic Curtailment) beginning on February 24, 2024 in response to the low natural gas price environment resulting from warm winter weather and elevated storage inventories. The Strategic Curtailment resulted in total decreased sales volume of 107 Bcfe for 2024. In addition, certain operators of wells in which we have a non-operating working interest also curtailed production in 2024. For 2024, we estimate that our total expected sales volume was negatively impacted by approximately 130 to 140 Bcfe of curtailments, including our Strategic Curtailment of 107 Bcfe and curtailments by certain operators of wells in which we have a non-operating working interest.\nLow natural gas prices or volatility in the natural gas market may result in adjustments to our 2025 planned development schedule or the development schedule of non-operated wells in which we have a working interest. Further, we cannot control or otherwise influence the development schedule of non-operated wells in which we have a working interest. Adjustments to our 2025 planned development schedule or the development schedule of non-operated wells in which we have a working interest, including due to declines in natural gas prices, the pace of well completions, access to sand and water to conduct drilling operations, access to sufficient pipeline takeaway capacity, unscheduled downtime at processing facilities or otherwise, could impact our future sales volume, operating revenues and expenses, per unit metrics and capital expenditures.\nIn connection with the recent U.S. election and corresponding inauguration of President Trump on January 20, 2025, the President executed several executive orders, some of which impact the oil and gas industry, and he and others in Congress have indicated the potential for further changes to regulations, many of which could impact the oil and gas industry, as well as the institution of tariffs on foreign goods and services. It is uncertain at this time to what extent such changes in regulations and tariffs will impact our business. A changing regulatory environment could increase our costs to comply with such regulations or make us susceptible to lawsuits or fines for failure to comply with such regulations. Further, tariffs on foreign goods and services could result in other countries instituting tariffs on U.S. goods and services, which could impact the price of natural gas, increase the price of supplies and raw materials that we rely on to conduct our business, and could impact interest rates. A changing regulatory environment and domestic or foreign tariffs could ultimately impact our future sales volume, operating revenues and expenses, per unit metrics and capital expenditures. \nLastly, we expect commodity prices to be volatile through 2025 due to macroeconomic uncertainty, changes to the regulatory environment and geopolitical tensions, including developments pertaining to Russia's invasion of Ukraine, conflicts in the Middle East and potential further imposition of domestic and foreign tariffs. Our revenue, profitability, liquidity and financial position will continue to be impacted in the future by the market prices for natural gas and, to a lesser extent, NGLs and oil.\nConsolidated Results of Operations \n \nNet income attributable to EQT Corporation for 2024 was $231 million, $0.45 per diluted share, compared to $1,735 million, $4.22 per diluted share, for 2023. The decrease was attributable primarily to a lower gain on derivatives, increased depreciation, depletion and amortization, increased other operating expenses and increased net interest expense, partly offset by the gains on the NEPA Non-Operated Asset Divestitures, decreased income tax expense, increased pipeline revenues and decreased transportation and processing expense.\nSee Item 7., \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" included in our Annual Report on \nForm 10-K\n for the year ended December 31, 2023, which is incorporated herein by reference, for discussion and analysis of consolidated results of operations for the year ended December 31, 2022.\nWe did not recast our discussion and analysis of financial condition and results of operations for the year ended December 31, 2022 for our change in reportable segments as such change does not materially change our historic comparative discussion of our financial condition and results of operations for the years ended December 31, 2023 and 2022 included within the 2023 Annual Report. Prior to the Equitrans Midstream Merger, we operated our business as a single segment and did not generate material third-party gathering operating income. Further, in our judgment, we do not believe such a recast is necessary to an understanding of our business, financial condition, changes in financial condition and results of operations. See Note 2 to the Consolidated Financial Statements for financial information by business segment, including our profit and loss metric and capital expenditures for the year ended December 31, 2022 and segment assets as of December 31, 2022.\n66\nTable of Contents\nSee \"Average Realized Price Reconciliation\" for a discussion and calculation of our average realized price, which is based on our Production segment's adjusted operating revenues (Production adjusted operating revenues), a non-GAAP supplemental financial measure that has been reconciled from total Production operating revenues in \"Non-GAAP Financial Measures Reconciliation.\" See \"Business Segment Results of Operations\" for a discussion of segment operating revenues and expenses and \"Other Income Statement Items\" for a discussion of other income statement items. See \"Investing Activities\" under \"Capital Resources and Liquidity\" for a discussion of capital expenditures, including by business segment.\nAverage Realized Price Reconciliation\nThe following table presents detailed natural gas and liquids operational information to assist in the understanding of our consolidated operations, including the calculation of our average realized price ($/Mcfe), which is based on Production adjusted operating revenues, a non-GAAP supplemental financial measure. Production adjusted operating revenues is presented because it is an important measure we use to evaluate period-to-period comparisons of earnings trends. Production adjusted operating revenues should not be considered as an alternative to total Production operating revenues. See \"Non-GAAP Financial Measures Reconciliation\" for a reconciliation of Production adjusted operating revenues from total Production operating revenues, the most directly comparable financial measure calculated in accordance with United States generally accepted accounting principles (GAAP).\n67\nTable of Contents\nYears Ended December 31,\n2024\n2023\n(Thousands, unless otherwise noted)\nNATURAL GAS\n \nSales volume (MMcf)\n2,086,441 \n1,907,343 \nNYMEX price ($/MMBtu)\n$\n2.30 \n$\n2.74 \nBtu uplift\n0.13 \n0.14 \nNatural gas price ($/Mcf)\n$\n2.43 \n$\n2.88 \nBasis ($/Mcf) (a)\n$\n(0.41)\n$\n(0.51)\nCash settled basis swaps ($/Mcf)\n(0.07)\n(0.03)\nAverage differential, including cash settled basis swaps ($/Mcf)\n$\n(0.48)\n$\n(0.54)\nAverage adjusted price ($/Mcf)\n$\n1.95 \n$\n2.34 \nCash settled derivatives ($/Mcf)\n0.64 \n0.34 \nAverage natural gas price, including cash settled derivatives ($/Mcf)\n$\n2.59 \n$\n2.68 \nNatural gas sales, including cash settled derivatives\n$\n5,401,642 \n$\n5,112,278 \nLIQUIDS\nNGLs, excluding ethane:\nSales volume (MMcfe) (b)\n87,564 \n64,859 \nSales volume (Mbbl)\n14,594 \n10,810 \nNGLs price ($/Bbl)\n$\n39.13 \n$\n36.39 \nCash settled derivatives ($/Bbl)\n(0.30)\n(1.27)\nAverage NGLs price, including cash settled derivatives ($/Bbl)\n$\n38.83 \n$\n35.12 \nNGLs sales, including cash settled derivatives\n$\n566,808 \n$\n379,663 \nEthane:\nSales volume (MMcfe) (b)\n44,586 \n34,441 \nSales volume (Mbbl)\n7,431 \n5,740 \nEthane price ($/Bbl)\n$\n6.03 \n$\n6.00 \nEthane sales\n$\n44,806 \n$\n34,417 \nOil:\nSales volume (MMcfe) (b)\n9,568 \n9,630 \nSales volume (Mbbl)\n1,595 \n1,605 \nOil price ($/Bbl)\n$\n58.67 \n$\n59.93 \nOil sales\n$\n93,551 \n$\n96,191 \nTotal liquids sales volume (MMcfe) (b)\n141,718 \n108,930 \nTotal liquids sales volume (Mbbl)\n23,620 \n18,155 \nTotal liquids sales\n$\n705,165 \n$\n510,271 \nTOTAL\nTotal natural gas and liquids sales, including cash settled derivatives (c)\n$\n6,106,807 \n$\n5,622,549 \nTotal sales volume (MMcfe)\n2,228,159 \n2,016,273 \nAverage realized price ($/Mcfe)\n$\n2.74 \n$\n2.79 \n(a)\nBasis represents the difference between the ultimate sales price for natural gas, including the effects of delivered price benefit or deficit associated with our firm transportation agreements, and the NYMEX natural gas price. \n(b)\nNGLs, ethane and oil were converted to Mcfe at a rate of six Mcfe per barrel.\n(c)\nAlso referred to in this report as Production adjusted operating revenues, a non-GAAP supplemental financial measure.\n68\nTable of Contents\nNon-GAAP Financial Measures Reconciliation\nThe table below reconciles Production adjusted operating revenues, a non-GAAP supplemental financial measure, from total Production operating revenues, the most comparable financial measure calculated in accordance with GAAP. See Note 2 to the Consolidated Financial Statements for a reconciliation of total Production operating revenues to EQT Corporation operating revenues as reported in the Statements of Consolidated Operations.\nProduction adjusted operating revenues (also referred to in this report as total natural gas and liquids sales, including cash settled derivatives) is presented because it is an important measure we use to evaluate period-to-period comparisons of earnings trends. Production adjusted operating revenues is defined as total Production operating revenues, less the revenue impact of changes in the fair value of derivative instruments prior to settlement and Production net marketing services and other revenues. We believe that Production adjusted operating revenues provides useful information to investors regarding our financial condition and results of operations because it helps facilitate comparisons of operating performance and earnings trends across periods. Production adjusted operating revenues reflects only the impact of settled derivative contracts; thus, the measure excludes the often-volatile revenue impact of changes in the fair value of derivative instruments prior to settlement. The measure also excludes Production net marketing services and other revenues, which consists of costs of, and recoveries on, pipeline capacity releases and other revenues.\nYears Ended December 31,\n2024\n2023\n(Thousands, unless otherwise noted)\nTotal Production operating revenues\n$\n5,009,833 \n$\n6,896,358 \n(Deduct) add:\nProduction gain on derivatives\n(67,880)\n(1,838,941)\nNet cash settlements received on derivatives (a)\n1,217,895 \n900,650 \nPremiums paid for derivatives that settled during the period\n(45,454)\n(322,869)\nProduction net marketing services and other\n(7,587)\n(12,649)\nProduction adjusted operating revenues, a non-GAAP financial measure\n$\n6,106,807 \n$\n5,622,549 \nTotal sales volume (MMcfe)\n2,228,159 \n2,016,273 \nAverage sales price ($/Mcfe)\n$\n2.21 \n$\n2.50 \nAverage realized price ($/Mcfe)\n$\n2.74 \n$\n2.79 \n(a)\nFor the years ended December 31, 2024 and 2023, composed of net cash settlements received on NYMEX natural gas hedge positions of approximately $1,374 million and $976 million , respectively, and net cash settlements paid on basis and liquids hedge positions of $157 million and $76 million, respectively. Net cash settlements received on derivatives are included in average realized price but may not be included in operating revenues.\nBusiness Segment Results of Operations\nOperating segments are revenue-producing components of an entity for which separate financial information is produced internally and reviewed by the chief operating decision maker to measure financial performance and allocate resources.\nPrior to the completion of the Equitrans Midstream Merger, we reported our results of operations as a single consolidated segment. Thereafter, and as a result thereof, we adjusted our internal reporting structure and our chief operating decision maker changed the manner in which he measures financial performance and allocates resources to incorporate the gathering and transmission assets we acquired in the Equitrans Midstream Merger. Hence, our operations expanded to comprise three discrete segments reflective of our three lines of business of Production, Gathering and Transmission. Accordingly, the manner in which we report our operations has been changed retrospectively, with certain prior period amounts recast between our Production segment and Gathering segment.\nThe following sections summarize operating income and certain operational measures by our three reportable segments. We believe this information is useful to investors for evaluating our financial condition, results of operations and trends and uncertainties of our segments. See Note 2 to the Consolidated Financial Statements for financial information by business segment.\n69\nTable of Contents\nCertain amounts, including cash and cash equivalents, debt, income taxes and other amounts related to our headquarters function as well as amounts related to our energy transition initiatives are managed on a consolidated basis and, as such, have not been allocated to our reportable segments. Changes to these amounts are discussed under \"Other Income Statement Items.\"\nPRODUCTION\n \nYears Ended December 31,\n \n2024\n2023\nChange\n% Change\n(Thousands, unless otherwise noted)\nTotal sales volume (MMcfe)\n2,228,159 \n2,016,273 \n211,886 \n10.5 \nAverage daily sales volume (MMcfe/d)\n6,088 \n5,524 \n564 \n10.2 \nAverage sales price ($/Mcfe)\n$\n2.21 \n$\n2.50 \n$\n(0.29)\n(11.6)\nOperating revenues:\nSales of natural gas, NGLs and oil\n$\n4,934,366 \n$\n5,044,768 \n$\n(110,402)\n(2.2)\nGain on derivatives\n67,880 \n1,838,941 \n(1,771,061)\n(96.3)\nPipeline, net marketing services and other\n7,587 \n12,649 \n(5,062)\n(40.0)\nTotal operating revenues\n5,009,833 \n6,896,358 \n(1,886,525)\n(27.4)\nOperating expenses:\nTransportation and processing:\nGathering\n775,114 \n1,282,402 \n(507,288)\n(39.6)\nTransmission\n846,563 \n642,688 \n203,875 \n31.7 \nProcessing\n293,939 \n232,170 \n61,769 \n26.6 \nTransportation and processing to affiliate (a)\n704,094 \n148,830 \n555,264 \n373.1 \nTotal transportation and processing\n2,619,710 \n2,306,090 \n313,620 \n13.6 \nLOE\n196,771 \n143,274 \n53,497 \n37.3 \nProduction taxes\n180,236 \n95,727 \n84,509 \n88.3 \nExploration\n2,735 \n3,330 \n(595)\n(17.9)\nSelling, general and administrative (b)\n244,450 \n236,171 \n8,279 \n3.5 \nProduction depletion\n2,013,120 \n1,702,198 \n310,922 \n18.3 \nOther depreciation and depletion\n3,550 \n3,113 \n437 \n14.0 \n(Gain) loss on sale/exchange of long-lived assets\n(764,431)\n17,445 \n(781,876)\n(4,481.9)\nImpairment and expiration of leases\n97,368 \n109,421 \n(12,053)\n(11.0)\nOther operating expenses\n12,696 \n9,177 \n3,519 \n38.3 \nTotal operating expenses\n4,606,205 \n4,625,946 \n(19,741)\n(0.4)\nOperating income\n$\n403,628 \n$\n2,270,412 \n$\n(1,866,784)\n(82.2)\nPer Unit ($/Mcfe):\nGathering\n$\n0.35 \n$\n0.64 \n$\n(0.29)\n(45.3)\nTransmission\n0.38 \n0.32 \n0.06 \n18.8 \nProcessing\n0.13 \n0.12 \n0.01 \n8.3 \nTransportation and processing to affiliate (a)\n0.32 \n0.07 \n0.25 \n357.1 \nLOE\n0.09 \n0.07 \n0.02 \n28.6 \nProduction taxes\n0.08 \n0.05 \n0.03 \n60.0 \nSelling, general and administrative (b)\n0.11 \n0.12 \n(0.01)\n(8.3)\nProduction depletion\n0.90 \n0.84 \n0.06 \n7.1 \n70\nTable of Contents\n(a)\nTransportation and processing to affiliate represents intercompany transactions with our Gathering and Transmission segments, which are eliminated in consolidation.\n(b)\nSelling, general and administrative expense incurred prior to the Equitrans Midstream Merger closing date was not recast as the necessary information is not available and the cost to develop such information would be excessive.\nSales of natural gas, NGLs and oil.\n Sales of natural gas, NGLs and oil decreased for 2024 compared to 2023 by approximately $110 million, of which approximately $640 million was attributable to lower average sales price, which was partly offset by approximately $530 million attributable to increased sales volumes. The average sales price decreased for 2024 compared to 2023 due to a lower NYMEX price, partly offset by lower basis spreads and higher NGLs price. Sales volume increased for 2024 compared to 2023 primarily as a result of sales volume increases of 164 Bcfe from the assets acquired in the Tug Hill and XcL Midstream Acquisition as well as increases from wells turned-in-line, partly offset by sales volume decreases of 107 Bcfe from the Strategic Curtailment and net decreases of 21 Bcfe due to the First NEPA Non-Operated Asset Divestiture. The increase in sales volume had a favorable impact on per unit costs for 2024 compared to 2023.\nProduction gain on derivatives.\n For 2024, we recognized a gain on derivatives of approximately $68 million related primarily to increases in the fair market value of our NYMEX swaps and options of approximately $377 million due to decreases in NYMEX forward prices, partly offset by decreases in the fair market value of our basis swaps of approximately $309 million. For 2023, we recognized a gain on derivatives of approximately $1,839 million related primarily to increases in the fair market value of our NYMEX swaps and options of approximately $1,830 million due to decreases in NYMEX forward prices as well as increases in the fair market value of our basis swaps of approximately $9 million.\nTransportation and processing\nGathering.\n Gathering expense decreased on an absolute and per Mcfe basis for 2024 compared to 2023 due primarily to our Gathering segment's ownership of the gathering assets acquired in the Equitrans Midstream Merger, our Transmission segment's ownership of the transmission and storage assets acquired in the Equitrans Midstream Merger and our Gathering segment's ownership of the additional interest in the NEPA Gathering System acquired in the NEPA Gathering System Acquisition and as consideration for the First NEPA Non-Operated Asset Divestiture.\nTransmission.\n \nTransmission expense increased on an absolute and per Mcfe basis for 2024 compared to 2023 due primarily to capacity charges related to the in service of the MVP (which commenced long-term firm capacity obligations on July 1, 2024) of approximately $165 million, additional contracted capacity on the Columbia Gas and Transco pipelines of an aggregate approximate $47 million and credits received in 2023 from pipeline credits of approximately $14 million. We record our equity earnings from our investment in the MVP Joint Venture in income from investments in our Statements of Consolidated Operations.\nProcessing.\n Processing expense increased on an absolute and per Mcfe basis for 2024 compared to 2023 due primarily to increased processing expense from the liquids-rich properties acquired in the Tug Hill and XcL Midstream Acquisition of approximately $40 million and increased volumes of gas requiring processing from wells that we turned-in-line in 2024.\nTransportation and processing to affiliate.\n Affiliate transportation and processing expense increased on an absolute and per Mcfe basis for 2024 compared to 2023 due primarily to our Gathering segment's ownership of the gathering assets acquired in the Equitrans Midstream Merger, our Transmission segment's ownership of the transmission and storage assets acquired in the Equitrans Midstream Merger and our Gathering segment's ownership of the additional interest in the NEPA Gathering System acquired in the NEPA Gathering System Acquisition and as consideration for the First NEPA Non-Operated Asset Divestiture. In addition, affiliate transportation and processing expense increased on a per Mcfe basis for 2024 compared to 2023 due to our Gathering segment's ownership of the gathering assets acquired in the Tug Hill and XcL Midstream Acquisition during the third quarter of 2023.\nLOE. \nLOE increased on an absolute and per Mcfe basis for 2024 compared to 2023 due primarily to increased LOE from the operation and maintenance of our assets, including assets acquired in the Tug Hill and XcL Midstream Acquisition and the Equitrans Midstream Merger and water assets internally-developed in the prior year, as well as increased salt water disposal costs.\nProduction taxes.\n Production tax expense increased on an absolute and per Mcfe basis for 2024 compared to 2023 due to increased property tax expense of approximately $63 million primarily from the assets acquired in the Tug Hill and XcL Midstream Acquisition and higher price as well as increased severance tax expense of approximately $24 million from increased sales volume in West Virginia.\n71\nTable of Contents\nSelling, general and administrative. \nSelling, general and administrative expense increased on an absolute basis for 2024 compared to 2023 due primarily to higher legal and professional services costs as well as higher personnel costs due to increased workforce headcount. In addition, we did not recast selling, general and administrative expense for periods prior to the Equitrans Midstream Merger closing date and, upon the Equitrans Midstream Merger closing date, we adjusted our basis for selling, general and administrative expense allocation for multi-segment reporting.\nDepreciation and depletion.\n Production depletion expense increased on an absolute and per Mcfe basis for 2024 compared to 2023 due to increased sales volume and higher annual depletion rate.\n(Gain) loss on sale/exchange of long-lived assets\n. During 2024, we recognized a gain on the First NEPA Non-Operated Asset Divestiture of approximately $299 million and a gain on the Second NEPA Non-Operated Asset Divestiture of approximately $463 million. See Note 7 to the Consolidated Financial Statements. During 2023, we recognized a loss on sale/exchange of long-lived assets of approximately $17 million related to acreage trade agreements where the carrying value of the acres traded exceeded the fair value of the acres received.\nImpairment and expiration of leases.\n During 2024 and 2023, we recognized impairment and expiration of leases related to leases that we no longer expect to extend or develop prior to their expiration based on our development plan.\nOther operating expenses\n. We recognized approximately $13 million and $9 million of other operating expenses for 2024 and 2023, respectively. Other operating expenses increased for 2024 compared to 2023 due primarily to increased rig release expense and increased legal and environmental reserves, including from settlements, partly offset by proceeds received in 2024 from business interruption insurance claim recoveries. See Note 1 to the Consolidated Financial Statements for a summary of consolidated other operating expenses.\nGATHERING\nYears Ended December 31,\n2024\n2023\nChange\n% Change\n(Thousands, unless otherwise noted)\nGathered volume (BBtu/d):\nFirm capacity\n5,277 \n— \n5,277 \n100 \nVolumetric-based services\n4,234 \n976 \n3,258 \n334 \nTotal gathered volume\n9,511 \n976 \n8,535 \n874 \nOperating revenues:\nLoss on derivatives\n$\n(16,763)\n$\n— \n$\n(16,763)\n100 \nFirm reservation fee revenue\n313,987 \n— \n313,987 \n100 \nVolumetric-based fee revenue (a)\n452,476 \n161,395 \n291,081 \n180 \nTotal operating revenues\n749,700 \n161,395 \n588,305 \n365 \nOperating expenses:\nOperating and maintenance\n89,897 \n15,699 \n74,198 \n473 \nSelling, general and administrative (b)\n38,837 \n— \n38,837 \n100 \nDepreciation\n89,513 \n17,066 \n72,447 \n425 \nGain on sale/exchange of long-lived assets\n(22)\n— \n(22)\n100 \nTotal operating expenses\n218,225 \n32,765 \n185,460 \n566 \nOperating income\n$\n531,475 \n$\n128,630 \n$\n402,845 \n313 \n(a)\nFor agreements structured with MVCs, includes volumes up to the contractual MVC; volumes in excess of the contractual MVC are reported under volumetric-based services.\n(b)\nSelling, general and administrative expense incurred prior to the Equitrans Midstream Merger closing date was not recast as the necessary information is not available and the cost to develop such information would be excessive.\n72\nTable of Contents\nGathering revenues and expenses increased for 2024 compared to 2023 primarily from the gathering assets acquired in the Equitrans Midstream Merger during the third quarter of 2024 and in the Tug Hill and XcL Midstream Acquisition during the third quarter of 2023. Prior to the completion of the Equitrans Midstream Merger, we did not own gathering assets that provided firm gathering services.\nTRANSMISSION\nPrior to the completion of the Equitrans Midstream Merger, we did not have transmission or storage assets.\nYear Ended\nDecember 31, 2024\n(Thousands, unless otherwise noted)\nTransmission pipeline throughput (BBtu/d):\nFirm capacity (a)\n3,695 \nInterruptible capacity\n24 \nTotal transmission pipeline throughput\n3,719 \nAverage contracted firm transmission reservation commitments (BBtu/d)\n4,779 \nOperating revenues:\nFirm reservation fee revenue\n$\n183,088 \nVolumetric-based fee revenue\n34,968 \nOther revenues\n237 \nTotal operating revenues\n218,293 \nOperating expenses:\nOperating and maintenance\n20,496 \nSelling, general and administrative\n17,183 \nDepreciation\n33,505 \nAmortization of intangible assets\n5,901 \nLoss on sale/exchange of long-lived assets\n409 \nTotal operating expenses\n77,494 \nOperating income\n$\n140,799 \n(a)\nIncludes all volumes associated with firm capacity contracts, including volumes in excess of firm capacity.\nOther Income Statement Items \nOther operating expenses\n. We recognized $337.2 million and $74.9 million of corporate other operating expenses for 2024 and 2023, respectively. Corporate other operating expenses increased for 2024 compared to 2023 due primarily to transaction costs related to the Equitrans Midstream Merger of $304.8 million and higher legal reserves, partly offset by lower transaction costs related to the Tug Hill and XcL Midstream Acquisition. See Note 1 to the Consolidated Financial Statements for a summary of consolidated other operating expenses.\nTotal transaction costs related to the Equitrans Midstream Merger recognized during 2024 included severance and other termination benefits and stock-based compensation costs of $165.4 million, of which $60.8 million was cash and $104.6 million was non-cash.\nIncome from investments.\n Income from investments increased for 2024 compared to 2023 due primarily to equity earnings from our investment in the MVP Joint Venture of $78.8 million, partly offset by a decrease in the fair value of our investment in the Investment Fund (defined in Note 11 to the Consolidated Financial Statements).\n73\nTable of Contents\nOther income. \nOther income increased for 2024 compared to 2023 due to proceeds received from insurance claim recoveries of $19.1 million related to the assets acquired in the Tug Hill and XcL Midstream Acquisition and dividends received from our investment in the Investment Fund.\nLoss on debt extinguishment.\n During 2024, we recognized a loss on debt extinguishment of $68.3 million due primarily to premiums and financing costs paid on our redemption and repurchase of certain of EQM's senior notes, including pursuant to the EQM Tender Offer, and non-cash losses related to our write off of the unamortized fair value adjustments of those redeemed and repurchased EQM senior notes and unamortized deferred issuance costs of the Term Loan Facility. See Note 10 to the Consolidated Financial Statements.\nInterest expense, net.\n Net interest expense increased for 2024 compared to 2023 due primarily to interest expense on EQM's senior notes, increased interest expense on our borrowings under EQT's revolving credit facility, interest expense on EQT's 5.750% senior notes issued in January 2024, lower interest income earned on cash on hand and interest expense on Eureka Midstream, LLC's (Eureka) borrowings under its revolving credit facility, partly offset by decreased interest expense from our repayment and repurchase of certain of EQT's senior notes as well as higher capitalized interest from the assets acquired in the Tug Hill and XcL Midstream Acquisition. See Note 10 to the Consolidated Financial Statements.\nIncome tax expense. \nSee Note 9 to the Consolidated Financial Statements.\nNet income (loss) attributable to noncontrolling interests\n. During 2024, we recognized $11.4 million of net income attributable to noncontrolling interests of Eureka Midstream Holdings, a consolidated joint venture in which we acquired an equity interest as a result of the Equitrans Midstream Merger. Sees Note 1 and 6 to the Consolidated Financial Statements.\nCapital Resources and Liquidity\n \nAlthough we cannot provide any assurance, we believe cash flows from operating activities and availability under EQT's revolving credit facility should be sufficient to meet our cash requirements, including, but not limited to, normal operating needs, debt service obligations, planned capital expenditures and commitments for at least the next twelve months and, based on current expectations, for the long term.\nPurchase Obligations\nWe have commitments to pay demand charges under long-term contracts and binding precedent agreements with various pipelines as well as charges for processing capacity to extract heavier liquid hydrocarbons from the natural gas stream. In addition, we have commitments to pay for services related to our operations, including electric hydraulic fracturing services and purchase equipment, materials and sand. See Note 15 to the Consolidated Financial Statements for a summary of aggregated future payments for these commitments.\nUnrecognized Tax Benefits\nAs of December 31, 2024, we had a total reserve for unrecognized tax benefits of $9.0 million and an additional reserve of $60.4 million that was offset against deferred tax assets for general business tax credit carryforwards and net operating losses (NOLs). We settled our consolidated U.S. federal income tax liability with the IRS through 2019 in September 2024. We are currently unable to make reasonably reliable estimates of the period of cash settlement of these potential liabilities with taxing authorities. See Note 9 to the Consolidated Financial Statements for further discussion.\nPlanned Capital Expenditures and Sales Volume\nIn 2025, we expect to spend approximately $2.3 billion to $2.5 billion on total capital expenditures. We expect to fund our capital expenditures with cash generated from operations and, if required, borrowings under EQT's revolving credit facility. Because we are the operator of a high percentage of our developed acreage, the amount and timing of certain of our capital expenditures is largely discretionary. We could choose to defer a portion of our planned 2025 capital expenditures depending on a variety of factors, including prevailing and anticipated prices for natural gas, NGLs and oil; the availability of necessary equipment, infrastructure and capital; the receipt and timing of required regulatory permits and approvals; and drilling, completion and acquisition costs. In addition, our gathering and transmission businesses are capital intensive, requiring significant investment to develop new facilities and maintain and upgrade existing operations. In 2025, we expect our sales volume to be 2,175 Bcfe to 2,275 Bcfe.\n74\nTable of Contents\nMaterial Cash Requirements\nWe have contractual commitments under our debt agreements, including interest payments and principal repayments. See Note 10 to the Consolidated Financial Statements for a summary of such contractual commitments, including maturity dates.\nOperating Activities\nNet cash provided by operating activities was $2,827 million and $3,179 million for 2024 and 2023, respectively. The decrease was due primarily to changes in working capital from movements in the market price for natural gas and timing of payments as well as higher cash operating expenses (including from transaction costs related to the Equitrans Midstream Merger), higher net interest expense and higher share-based compensation expense. Such decreases were partly offset by higher net cash settlements received on derivatives, lower net premiums paid on derivatives, higher cash operating revenues (including from pipeline revenues on assets acquired in the Equitrans Midstream Merger) and higher distributions from equity method investments (including approximately $53 million from our investment in the MVP Joint Venture).\nOur cash flows from operating activities, including changes in working capital, are affected by movements in the market price for commodities. We are unable to predict such movements outside of the current market view as reflected in forward strip pricing. For a discussion of potential commodity market risks, refer to Item 1A., \"Risk Factors – Natural gas, NGLs and oil price volatility, or a prolonged period of low natural gas, NGLs and oil prices, may have an adverse effect on our revenue, profitability, future rate of growth, liquidity and financial position.\"\nInvesting Activities\nNet cash used in investing activities was $1,580 million and $4,314 million for 2024 and 2023, respectively. The decrease was attributable primarily to the proceeds received from the NEPA Non-Operated Asset Divestitures in 2024 and lower cash paid for acquisitions in 2024 (primarily for the NEPA Gathering System Acquisition) compared to 2023 (primarily for the Tug Hill and XcL Midstream Acquisition), partly offset by increased capital expenditures and capital contributions made to our investment in the MVP Joint Venture of approximately $145 million.\nThe following table summarizes our capital expenditures by business segment.\nYears Ended December 31,\n2024\n2023\n(Millions)\nProduction:\nReserve development (a)\n$\n1,653 \n$\n1,587 \nLand and lease\n156 \n130 \nOther production infrastructure\n71 \n63 \nCapitalized interest, capitalized overhead and other\n124 \n98 \nTotal Production\n2,004 \n1,878 \nGathering\n202 \n32 \nTransmission\n31 \n— \nOther corporate items\n29 \n15 \nTotal capital expenditures\n2,266 \n1,925 \n(Deduct) add: Non-cash items (b)\n(12)\n94 \nTotal cash capital expenditures\n$\n2,254 \n$\n2,019 \n \n(a)\nCapital expenditures for reserve development included capital expenditures for water infrastructure of $79.8 million and $35.9 million for 2024 and 2023, respectively.\n(b)\nRepresents the net impact of non-cash capital expenditures, including the effect of timing of receivables from working interest partners, accrued capital expenditures, transfers to or from inventory as assets are completed or assigned to a project and capitalized share-based compensation costs. The impact of accrued capital expenditures includes the current period estimate, net of the reversal of the prior period accrual.\n75\nTable of Contents\nFinancing Activities\nNet cash used in financing activities was $1,126 million and $243 million for 2024 and 2023, respectively. For 2024, the primary uses of financing cash flows were our repayment and retirement of debt, repayment of EQM's revolving credit facility, payment of dividends and cash paid for taxes to net settle share-based incentive awards. For 2024, the primary sources of financing cash flows were net proceeds from the sale of units of the Midstream Joint Venture, proceeds from the issuance of EQT's 5.750% senior notes, net borrowings under EQT's revolving credit facility and proceeds from the net settlement of the Capped Call Transactions (defined in Note 10 to the Consolidated Financial Statements). For 2023, the primary uses of financing cash flows were our repayment and retirement of debt, payment of dividends and repurchase and retirement of EQT common stock, and the primary source of financing cash flows was proceeds from the Term Loan Facility borrowings.\nSee Note 10 to the Consolidated Financial Statements for further discussion of our debt.\nOn February 6, 2025, our Board of Directors declared a quarterly cash dividend of $0.1575 per share of EQT common stock, payable on March 3, 2025, to shareholders of record at the close of business on February 18, 2025.\nDepending on our actual and anticipated sources and uses of liquidity, prevailing market conditions and other factors, we may from time to time seek to redeem or repurchase our outstanding debt or equity securities through tender offers or other cash purchases in the open market or privately negotiated transactions. The amounts involved in any such transactions may be material. See Note 10 to the Consolidated Financial Statements for discussion of redemptions and repurchases of debt and Note 12 to the Consolidated Financial Statements for discussion of repurchases of EQT common stock.\nSecurity Ratings and Financing Triggers\n \nOur credit ratings and rating outlooks are subject to revision or withdrawal at any time by the assigning rating agency, and each rating should be evaluated independently from any other rating. We cannot ensure that a rating will remain in effect for any given period of time or that a rating will not be lowered or withdrawn by a rating agency if, in the rating agency's judgment, circumstances so warrant. See Note 4 to the Consolidated Financial Statements for a description of what is deemed investment grade.\nThe table below reflects the credit ratings and rating outlooks assigned to EQT's debt instruments as of February 14, 2025. \nRating agency\nSenior notes\nOutlook\nMoody's Investors Service, Inc. (Moody's)\nBaa3\nNegative\nS&P Global Ratings (S&P)\nBBB–\nStable\nFitch Ratings Service (Fitch)\nBBB–\nStable\nThe table below reflects the credit ratings and rating outlooks assigned to EQM's debt instruments as of February 14, 2025.\nRating agency\n \nSenior notes\n \nOutlook\nMoody's\nBa2\nStable\nS&P\nBBB–\n \nStable\nFitch\nBB+\nStable\nChanges in credit ratings may affect our access to the capital markets, the cost of short-term debt through interest rates and fees under our revolving credit facilities, the interest rate on our senior notes with adjustable rates, the rates available on new debt, our pool of investors and funding sources, the borrowing costs and margin deposit requirements on our OTC derivative instruments and credit assurance requirements, including collateral, in support of our midstream service contracts, joint venture arrangements or construction contracts. Margin deposits on our OTC derivative instruments are also subject to factors other than credit rating, such as natural gas prices and credit thresholds set forth in the agreements between us and our hedging counterparties.\n76\nTable of Contents\nOur debt agreements and other financial obligations contain various provisions that, if not complied with, could result in default or event of default under EQT's revolving credit facility and Eureka's revolving credit facility, mandatory partial or full repayment of amounts outstanding, reduced loan capacity or other similar actions. The most significant covenants and events of default under our debt agreements relate to maintenance of a debt-to-total capitalization ratio, limitations on transactions with affiliates, insolvency events, nonpayment of scheduled principal or interest payments, acceleration of other financial obligations and change of control provisions. EQT's revolving credit facility contains financial covenants that require us to have a total debt to total capitalization ratio no greater than 65%. As of December 31, 2024, we were in compliance with all EQT, Eureka and EQM debt provisions and covenants under our debt agreements.\nSee Note 10 to the Consolidated Financial Statements for a discussion of borrowings under EQT's revolving credit facility and Eureka's revolving credit facility.\nCommodity Risk Management\nThe substantial majority of our commodity risk management program is related to hedging sales of our produced natural gas. The overall objective of our hedging program is to protect cash flows from undue exposure to the risk of changing commodity prices. The derivative commodity instruments that we use are primarily swap, collar and option agreements. The following table summarizes the approximate volume and prices of our NYMEX hedge positions as of February 14, 2025. The difference between the fixed price and NYMEX price is included in average differential presented in our price reconciliation in \"Average Realized Price Reconciliation.\" The fixed price natural gas sales agreements can be physically or financially settled.\nQ1 2025(a)\nQ2 2025\nQ3 2025\nQ4 2025\nHedged Volume (MMDth)\n332 \n336 \n281 \n281 \nHedged Volume (MMDth/d)\n3.7 \n3.7 \n3.1 \n3.1 \nSwaps – Short\nVolume (MMDth)\n250 \n290 \n281 \n95 \nAvg. Price ($/Dth)\n$\n3.49 \n$\n3.11 \n$\n3.26 \n$\n3.27 \nCalls – Short\nVolume (MMDth)\n188 \n46 \n— \n137 \nAvg. Strike ($/Dth)\n$\n4.19 \n$\n3.48 \n$\n— \n$\n5.49 \nPuts – Long\nVolume (MMDth)\n82 \n46 \n— \n186 \nAvg. Strike ($/Dth)\n$\n3.19 \n$\n2.83 \n$\n— \n$\n3.30 \nOption Premiums\nCash Settlement of Deferred Premiums (millions)\n$\n— \n$\n— \n$\n— \n$\n(45)\n(a)\nJanuary 1 through March 31. \nWe have also entered into derivative instruments to hedge basis. We may use other contractual agreements to implement our commodity hedging strategy from time to time.\nSee Item 7A., \"Quantitative and Qualitative Disclosures About Market Risk\" and Note 4 to the Consolidated Financial Statements for further discussion of our hedging program.\nOff-Balance Sheet Arrangements\n \nAs of December 31, 2024, we did not have any material off-balance sheet arrangements other than the commitments described in Note 15 to the Consolidated Financial Statements.\nCommitments and Contingencies\n \nSee Note 15 to the Consolidated Financial Statements for a discussion of our commitments and contingencies.\nRecently Issued Accounting Standards\nOur recently issued accounting standards are described in Note 1 to the Consolidated Financial Statements.\n77\nTable of Contents\nCritical Accounting Estimates\n \nOur significant accounting policies are described in Note 1 to the Consolidated Financial Statements. Management's discussion and analysis of the Consolidated Financial Statements and results of operations are based on our Consolidated Financial Statements, which have been prepared in accordance with GAAP. The preparation of the Consolidated Financial Statements requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses and the related disclosure of contingent assets and liabilities. The following critical accounting estimates, which were reviewed by the Audit Committee of our Board of Directors, relate to our more significant judgments and estimates used in the preparation of our Consolidated Financial Statements. Actual results could differ from our estimates.\n \nOil and Gas Reserves. \nProved oil and gas reserves, as defined by SEC Regulation S-X Rule 4-10, are those quantities of oil and gas that, by analysis of geoscience and engineering data, can be estimated with reasonable certainty to be economically producible from a given date forward from known reservoirs and under existing economic conditions, operating methods and government regulations prior to the time at which contracts providing the right to operate expire unless evidence indicates that renewal is reasonably certain regardless of whether deterministic or probabilistic methods are used for the estimation.\n \nOur estimates of proved reserves are reassessed annually using geological, reservoir and production performance data. Reserve estimates are prepared by our engineers and audited by independent engineers. Revisions may result from changes in, among other things, reservoir performance, development plans, prices, operating costs, economic conditions and governmental restrictions. Decreases in prices, for example, may cause a reduction in certain proved reserves due to reaching economic limits sooner. A material change in the estimated volume of reserves could have an impact on the depletion rate calculation and our Consolidated Financial Statements.\n \nWe estimate future net cash flows from natural gas, NGLs and oil reserves based on selling prices and costs using a twelve-month average price, which is calculated as the unweighted arithmetic average of the first-day-of-the-month price for each month within the twelve-month period and, as such, is subject to change in subsequent periods. Operating costs, production and ad valorem taxes and future development costs are based on current costs with no escalation. Income tax expense is based on currently enacted statutory tax rates and tax deductions and credits available under current laws.\nWe believe oil and gas reserves is a \"critical accounting estimate\" because we must periodically reevaluate proved reserves along with estimates of future production rates, production costs and the timing of development expenditures. Future results of operations and the strength of our Consolidated Balance Sheet for any quarterly or annual period could be materially affected by changes in our assumptions. Based on proved reserves as of December 31, 2024, we estimate that a 1% change in proved reserves would decrease or increase 2025 depletion expense by approximately $10 million and $21 million, respectively, based on current production estimates for 2025.\nSee also Item 1A., \"Risk Factors – Natural gas, NGLs and oil price volatility, or a prolonged period of low natural gas, NGLs and oil prices, may have an adverse effect on our revenue, profitability, future rate of growth, liquidity and financial position.\"\nIncome Taxes. \nWe recognize deferred tax assets and liabilities for the expected future tax consequences of events that have been included in our Consolidated Financial Statements or tax returns. See Note 1 to the Consolidated Financial Statements for a discussion of significant accounting policies related to income taxes and Note 9 to the Consolidated Financial Statements for a discussion of deferred tax assets, valuation allowances and the amount of financial statement benefit recorded for uncertain tax positions.\nWe believe income taxes is a \"critical accounting estimate\" because we must assess the likelihood that our deferred tax assets will be recovered from future taxable income and exercise judgment on the amount of financial statement benefit recorded for uncertain tax positions. When evaluating whether or not a valuation allowance should be established, we exercise judgment on whether it is more likely than not (a likelihood of more than 50%) that a portion or all of our deferred tax assets will not be realized. To determine whether a valuation allowance is needed, we consider all available evidence, both positive and negative, including carrybacks, tax planning strategies, reversals of deferred tax assets and liabilities and forecasted future taxable income. To determine the amount of financial statement benefit recorded for uncertain tax positions, we consider the amounts and probabilities of outcomes that could be realized upon ultimate settlement of an uncertain tax position using facts, circumstances and information available at the reporting date. To the extent that a valuation allowance or uncertain tax position is established or increased or decreased during a period, we record an income tax expense or benefit in our Statements of Consolidated Operations. \n78\nTable of Contents\nFuture results of operations for any quarterly or annual period could be materially affected by changes in our assumptions. A change to future taxable income or tax planning strategies could impact our ability to utilize deferred tax assets, which would increase or decrease our income tax expense and taxes paid. Changes in our assumptions are sensitive to numerous factors; however, based on income before taxes for the years ended December 31, 2024, 2023 and 2022, we estimate that a 1% change in our effective tax rate would decrease or increase income tax expense by approximately $3 million, $21 million and $23 million, respectively. \nDerivative Instruments. \nWe enter into derivative commodity instrument contracts primarily to reduce exposure to commodity price risk associated with future sales of our natural gas production. \nSee Note \n5\n \nto the Consolidated Financial Statements \nfor a description of the fair value hierarchy. \nThe values reported in the Consolidated Financial Statements change as these estimates are revised to reflect actual results or as market conditions or other factors, many of which are beyond our control, change.\nWe believe derivative instruments is a \"critical accounting estimate\" because our financial condition and results of operations can be significantly impacted by changes in the market value of our derivative instruments due to the volatility of both NYMEX natural gas prices and basis. Future results of operations for any quarterly or annual period could be materially affected by changes in our assumptions. Refer to Item 7A., \"Quantitative and Qualitative Disclosures about Market Risk\" for discussion of a hypothetical increase or decrease of 10% in the market price of natural gas.\nContingencies and Asset Retirement Obligations. \nWe are involved in various legal and regulatory proceedings that arise in the ordinary course of business. We record a liability for contingencies based on our assessment that a loss is probable and the amount of the loss can be reasonably estimated. We consider many factors in making these assessments, including historical experience and matter specifics. Estimates are developed in consultation with legal counsel and are based on an analysis of potential results. See Note 15 to the Consolidated Financial Statements.\nWe accrue a liability for asset retirement obligations based on an estimate of the amount and timing of settlement. For oil and gas wells, the fair value of our plugging and abandonment obligations is recorded at the time the obligation is incurred, which is typically at the time the well is spud. See Note 1 to the Consolidated Financial Statements.\n \nWe believe contingencies and asset retirement obligations is a \"critical accounting estimate\" because we must assess the probability of loss related to contingencies and the expected amount and timing of asset retirement obligation settlement. In addition, we must determine the estimated present value of future liabilities. Future results of operations for any quarterly or annual period could be materially affected by changes in our assumptions. If we incur losses related to contingencies that are higher than we expect, we could incur additional costs to settle such obligations. If the expected amount and timing of our asset retirement obligations change, we will be required to adjust the carrying value of our liabilities in future periods. An estimate of the sensitivity to changes in our assumptions is not practicable given the numerous assumptions that can materially affect our estimates.\nBusiness Combinations.\n Accounting for a business combination requires a company to record the identifiable assets and liabilities acquired at fair value. In the third quarter of 2024, we completed the Equitrans Midstream Merger. See Note 6 to the Consolidated Financial Statements for a discussion of the most significant assumptions used to estimate the fair value of the assets acquired and liabilities assumed in the Equitrans Midstream Merger.\nWe believe business combinations is a \"critical accounting estimate\" because the valuation of acquired assets and assumed liabilities involves significant judgment about future events. Future results of operations for any quarterly or annual period could be materially affected by changes in our assumptions. An estimate of the sensitivity to changes in our assumptions is not practicable given the numerous assumptions that can materially affect our estimates.\nProperty, Plant and Equipment (Including Gas, NGLs and Oil Producing Properties). \nWe use the successful efforts method of accounting for gas, NGLs and oil producing activities. See Note 1 to the Consolidated Financial Statements for a discussion of the fair value measurement and any impairment of our oil and gas properties and other property, plant and equipment as well as our evaluation of the recoverability of capitalized costs of unproved oil and gas properties. \n79\nTable of Contents\nWe believe the accounting for our property, plant and equipment, including our gas, NGLs and oil producing properties, is a \"critical accounting estimate\" because the evaluations of impairment of proved properties involve significant judgment about future events, including future sales prices of natural gas and NGLs, future production costs, the amount of natural gas and NGLs recorded and timing of recoveries, as well as discount and inflation rates. In addition, evaluations of impairment of our other property, plant and equipment also involve significant judgement about future events, including assumptions about future cash flows, discount rates and operating levels. Significant changes in these estimates could result in the costs of our property, plant and equipment, including our proved and unproved properties, not being recoverable, which would require us to recognize impairment. An estimate of the sensitivity to changes in our assumptions is not practicable given the numerous assumptions that can materially affect our estimates. \nSee Note 1 to the Consolidated Financial Statements for additional information on impairment of our proved and unproved oil and gas properties, impairment of other property, plant and equipment. See also Item 1A., \"Risk Factors – Natural gas, NGLs and oil price declines, and changes in our development strategy, have resulted in impairment of certain of our assets. Future declines in commodity prices, increases in operating costs or adverse changes in well performance or additional changes in our development strategy may result in additional write-downs of the carrying amounts of our assets, including long-lived intangible assets, which could materially and adversely affect our results of operations in future periods.\"\nIntangible Assets. \nRefer to Notes 1 and 6 to the Consolidated Financial Statements for a discussion of our intangible assets. We evaluate our intangible assets for impairment when indicators of impairment are present.\n \nWe believe impairment of intangible assets is a \"critical accounting estimate\" because the determination of whether an indicator of impairment has occurred and if further evaluation of impairment is required involves significant judgment about future events, including shifts in the market price of the assets, changes in the extent or manner in which the assets are being used, changes in legal factors of the business climate that could affect the value of the assets or a more-likely-than-not expectation that the assets will be sold or otherwise disposed of before the end of their previously estimated useful lives.\nInvestments in Unconsolidated Entities.\n Refer to Notes 1 and 11 to the Consolidated Financial Statements for a discussion of our investments in unconsolidated entities. We evaluate our investments in unconsolidated entities for impairment when events or changes in circumstances indicate that the investment's fair value is less than its carrying value. The recognition of an impairment loss is required if the impairment is considered other than temporary.\nWe believe the impairment of investments in unconsolidated entities is a \"critical accounting estimate\" because evaluations of impairment involve significant judgment about future events, such as our ability to recover the carrying value of our investment or the investee's inability to generate cash flows sufficient to justify the carrying value of our investment.\nGoodwill\n. Goodwill is evaluated for impairment annually as of October 1 or more frequently if indicators of impairment exist. A significant amount of judgement is involved in determining if an indicator of impairment has occurred. Such indicators may include, among others, deterioration in general economic conditions, negative developments in equity and credit markets, adverse changes in the market environments in which we operate, increases in operating costs or other factors that could have a negative effect on earnings and cash flows or a trend of negative or declining cash flows over multiple periods. \nWe test goodwill for impairment on a qualitative or quantitative basis. When performing a qualitative impairment test, we consider a number of factors in our assessment, such as: general economic conditions, performance equity and credit markets, industry and market conditions, market capitalization, earnings and cash flow trends. When performing a quantitative impairment test, we may use a combination of the income and market approach to estimate the fair value of our reporting units.\n \nRefer to Note 1 to the Consolidated Financial Statements for further discussion of our goodwill impairment assessment process.\nWe believe the impairment of goodwill is a \"critical accounting estimate\" because a significant amount of judgement is involved in determining whether an indicator of impairment has occurred. In addition, the estimation of the fair value of a reporting unit involves significant judgment and is sensitive to changes in assumptions, including changes in our stock price, weighted-average cost of capital, forecasted cash flows, terminal growth rates and industry multiples. Changes to assumptions could materially affect the estimated fair value of our reporting units and the resulting conclusion on impairment could materially affect our results of operations and financial position. In addition, future assumptions and estimates may materially differ from current assumptions and estimates.\n80\nTable of Contents",
  "item2": null
}