{
  "source_file": "eqt-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of financial condition and results of operations should be read in conjunction with the Condensed Consolidated Financial Statements and the notes thereto included in this report. Unless the context otherwise indicates, all references in this report to \"EQT\" are to EQT Corporation and all references in this report to the \"Company,\" \"we,\" \"us,\" or \"our\" are to EQT Corporation and its consolidated subsidiaries, collectively. For certain industry specific terms used in this Quarterly Report on Form 10-Q, please see \"Glossary of Commonly Used Terms, Abbreviations and Measurements\" in EQT's Annual Report on \nForm 10-K\n for the year ended December 31, 2024.\nCAUTIONARY STATEMENTS\n \nThis Quarterly Report on Form 10-Q contains certain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act), and Section 27A of the Securities Act of 1933, as amended (the Securities Act). Statements that do not relate strictly to historical or current facts are forward-looking and are usually identified by the use of words such as \"anticipate,\" \"estimate,\" \"could,\" \"would,\" \"will,\" \"may,\" \"forecast,\" \"approximate,\" \"expect,\" \"project,\" \"intend,\" \"plan,\" \"believe\" and other words of similar meaning, or the negative thereof. Without limiting the generality of the foregoing, forward-looking statements contained in this Quarterly Report on Form 10-Q include the matters discussed in the section \"Trends and Uncertainties\" and expectations of our plans, strategies, objectives and growth and anticipated financial and operational performance, including guidance regarding our strategy to develop our reserves; drilling plans and programs, including availability of capital to complete these plans and programs; total resource potential and drilling inventory duration; projected production and sales volume, including liquified natural gas (LNG) volumes and sales; natural gas prices; changes in basis and the impact of commodity prices on our business; potential future impairments of our assets; projected well costs and capital expenditures; infrastructure projects; the cost, capacity and timing of obtaining regulatory approvals; our ability to successfully implement and execute our operational, organizational, technological and environmental, social and governance (ESG) initiatives, and achieve the anticipated results of such initiatives; our ability to enter into definitive agreements pertaining to pending and potential in-basin growth projects, if at all, and the potential scope, duration and other terms thereof; projected gathering and compression rates; potential acquisitions or other strategic transactions, the timing thereof and our ability to achieve the intended operational, financial and strategic benefits from any such transactions or from any recently completed strategic transactions, including the Olympus Energy Acquisition (defined below); the amount and timing of any repayments, redemptions or repurchases of our common stock, outstanding debt securities or other debt instruments; our ability to retire our debt and the timing of such retirements, if any; the projected amount and timing of dividends; projected cash flows and free cash flow, and the timing thereof; liquidity and financing requirements, including funding sources and availability; our ability to maintain or improve our credit ratings, leverage levels and financial profile; our hedging strategy and projected margin posting obligations; the effects of litigation, government regulation and tax position; and the expected impact of changes to tax laws. \nThe forward-looking statements included in this Quarterly Report on Form 10-Q involve risks and uncertainties that could cause actual results to differ materially from projected results. Accordingly, investors should not place undue reliance on forward-looking statements as a prediction of actual results. We have based these forward-looking statements on current expectations and assumptions about future events, taking into account all information currently known by us. While we consider these expectations and assumptions to be reasonable, they are inherently subject to significant business, economic, competitive, regulatory and other risks and uncertainties, many of which are difficult to predict and beyond our control. These risks and uncertainties include, but are not limited to, volatility of commodity prices; the costs and results of drilling and operations; uncertainties about estimates of reserves, identification of drilling locations and the ability to add proved reserves in the future; the assumptions underlying production forecasts; the quality of technical data; our ability to appropriately allocate capital and other resources among our strategic opportunities; access to and cost of capital; our hedging and other financial contracts; inherent hazards and risks normally incidental to drilling for, producing, transporting and storing natural gas, natural gas liquids (NGLs) and oil; operational risks and hazards incidental to the gathering, transmission and storage of natural gas as well as unforeseen interruptions; cyber security risks and acts of sabotage; availability and cost of drilling rigs, completion services, equipment, supplies, personnel, oilfield services and sand and water required to execute our exploration and development plans, including as a result of inflationary pressures or tariffs; risks associated with operating primarily in the Appalachian Basin; the ability to obtain environmental and other permits and the timing thereof; construction, business, economic, competitive, regulatory, judicial, environmental, political and legal uncertainties related to the development and construction by us or our joint ventures of pipeline and storage facilities and transmission assets and the optimization of such assets; our ability to renew or replace expiring gathering, transmission or storage contracts at favorable rates on a long-term basis or at all; risks relating to our joint venture arrangements; government regulation or action, including regulations pertaining to methane and other greenhouse gas emissions; negative public perception of the fossil fuels industry; increased consumer \n35\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\ndemand for alternatives to natural gas; environmental and weather risks, including the possible impacts of climate change; and disruptions to our business due to recently completed divestitures, acquisitions and other significant strategic transactions, including the Olympus Energy Acquisition. These and other risks and uncertainties are described under the \"Risk Factors\" section and elsewhere in EQT's Annual Report on \nForm 10-K\n for the year ended December 31, 2024, and may be updated by other documents we subsequently file from time to time with the Securities and Exchange Commission (the SEC).\nAny forward-looking statement speaks only as of the date on which such statement is made, and, except as required by law, we do not intend to correct or update any forward-looking statement, whether as a result of new information, future events or otherwise.\nRecent and Significant Events\nOlympus Energy Acquisition\nOn July 1, 2025, we completed our acquisition (the Olympus Energy Acquisition) of certain oil and gas properties and related upstream and midstream assets, including approximately 90,000 net acres with approximately 500 million cubic feet (MMcf) per day of net production, from Olympus Energy LLC, Hyperion Midstream LLC and Bow & Arrow Land Company LLC (collectively, Olympus Energy). The purchase price for the Olympus Energy Acquisition consisted of 25,229,166 shares of EQT common stock, with an aggregate value of $1,471 million based on an EQT common stock share price of $58.32 (the last reported per share sale price of EQT common stock on the day prior to the completion of the Olympus Energy Acquisition), and approximately $475 million in cash, each as adjusted pursuant to customary purchase price adjustments and subject to final post-closing purchase price adjustments. We funded the cash consideration with cash on hand and borrowings under EQT's revolving credit facility. See Note 11 to the Condensed Consolidated Financial Statements for further discussion of the Olympus Energy Acquisition.\nNEPA Gathering System Acquisition and NEPA Non-Operated Asset Divestitures\nBeginning May 31, 2024, our results of operations reflect (i) our divestiture (the First NEPA Non-Operated Asset Divestiture) of an undivided 40% interest in our non-operated natural gas assets in Northeast Pennsylvania and (ii) our 100% ownership of the NEPA Gathering System (defined in Note 11 to the Condensed Consolidated Financial Statements) following our acquisition of additional ownership interests therein in connection with the NEPA Gathering System Acquisition (defined in Note 11 to the Condensed Consolidated Financial Statements) and the First NEPA Non-Operated Asset Divestiture.\nIn addition, our results of operations for 2025 reflect our divestiture (the Second NEPA Non-Operated Asset Divestiture, and together with the First NEPA Non-Operated Asset Divestiture, the NEPA Non-Operated Asset Divestitures) of the remaining undivided 60% interest in our non-operated natural gas assets in Northeast Pennsylvania, which was completed on December 31, 2024.\nEquitrans Midstream Merger\nBeginning July 22, 2024, our results of operations reflect our operation of the assets acquired in the Equitrans Midstream Merger (defined in Note 11 to the Condensed Consolidated Financial Statements).\nFollowing the Equitrans Midstream Merger, the gathering and transmission services previously provided to us by Equitrans Midstream Corporation are provided to our Production segment by our Gathering and Transmission segments as affiliate transactions. As a result, our Production segment's third-party gathering expense decreased and its affiliate transportation and processing expense increased, and our Gathering and Transmission segments' affiliate revenue increased. As the affiliate expense and revenue are eliminated in consolidation, the net impact is a reduction in our consolidated transportation and processing expense.\nIn addition, in connection with the Equitrans Midstream Merger, we acquired an equity method investment in the MVP Joint Venture (defined in Note 8 to the Condensed Consolidated Financial Statements). Because the investment is not consolidated, costs incurred by our Production segment for transportation services provided by the MVP (defined in Note 8 to the Condensed Consolidated Financial Statements) are reported in our consolidated transportation and processing expense, and equity earnings recognized by our Transmission segment from our investment in the MVP Joint Venture are reported in income from investments in the Statements of Condensed Consolidated Operations.\n36\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nSee Note 11 to the Condensed Consolidated Financial Statements for further discussion of the Equitrans Midstream Merger.\nTrends and Uncertainties\nCommodity prices have been volatile thus far in 2025, and we expect commodity prices to continue to be volatile for the remainder of 2025 due to macroeconomic uncertainty, changes to the regulatory environment and geopolitical tensions, including developments pertaining to Russia's invasion of Ukraine, conflicts in the Middle East and potential further imposition of domestic and foreign tariffs. Our revenue, profitability, liquidity and financial position will continue to be impacted in the future by the market prices for natural gas and, to a lesser extent, NGLs and oil.\nIn response to price volatility in the natural gas market and to optimize in-basin pricing, we implement strategic curtailments from time to time to reduce our gross production. During the three months ended September 30, 2025, strategic curtailments resulted in decreased sales volumes of approximately 3 billion cubic feet equivalent (Bcfe). In addition, we have included approximately 15 Bcfe to 20 Bcfe of strategic curtailments in our sales volume guidance for the fourth quarter of 2025, subject to market conditions. Low natural gas prices or volatility in the natural gas market may result in further adjustments to our 2025 planned development schedule and/or adjustments to the development schedule of non-operated wells in which we have a working interest. We cannot control or otherwise influence the development schedule of non-operated wells in which we have a working interest. Adjustments to our 2025 planned development schedule or the development schedule of non-operated wells in which we have a working interest, including due to declines in natural gas prices, the pace of well completions, access to sand and water to conduct drilling operations, access to sufficient pipeline takeaway capacity, unscheduled downtime at processing facilities or otherwise, could impact our future sales volume, operating revenues and expenses, per unit metrics and capital expenditures.\nOn July 4, 2025, President Trump signed the One Big Beautiful Bill Act into law. See Note 6 to the Condensed Consolidated Financial Statements for further discussion of the One Big Beautiful Bill Act. We expect the enactment of the One Big Beautiful Bill Act to favorably impact our projected cash income tax obligations over the next five years by deferring the payment of a significant portion of current federal income taxes. \nPresident Trump has also executed several executive orders, some of which impact the oil and gas industry, and he and others in Congress have indicated the potential for further changes to regulations, many of which could impact the oil and gas industry, as well as the implementation of tariffs on foreign goods and services. It is uncertain at this time to what extent such changes in regulations and tariffs will impact our business. Tariffs on foreign goods and services could result in other countries instituting tariffs on U.S. goods and services, which could impact the demand for and price of natural gas, increase the price of supplies and raw materials that we rely on to conduct our business, and could impact interest rates. A changing regulatory environment and domestic or foreign tariffs could ultimately impact our future sales volume, operating revenues and expenses, per unit metrics and capital expenditures. \nConsolidated Results of Operations\nNet income attributable to EQT Corporation for the three months ended September 30, 2025 was $335.9 million, $0.53 per diluted share, compared to net loss attributable to EQT Corporation of $300.8 million, $0.54 per diluted share, for the same period in 2024. The improvement was driven primarily by increased operating revenues, decreased acquisition-related transaction costs and decreased gathering expense, partly offset by income tax expense in 2025 compared to income tax benefit in 2024 and higher depreciation and depletion expense.\nNet income attributable to EQT Corporation for the nine months ended September 30, 2025 was $1,362.1 million, $2.23 per diluted share, compared to net loss attributable to EQT Corporation of $187.8 million, $0.39 per diluted share, for the same period in 2024. The improvement was driven primarily by increased sales of natural gas, decreased gathering expense, increased pipeline revenues, decreased acquisition-related transaction costs and increased equity earnings from the MVP Joint Venture. These favorable impacts were partly offset by income tax expense in 2025 compared to income tax benefit in 2024, higher depreciation and depletion expense, the 2024 gain on the First NEPA Non-Operated Asset Divestiture and higher income attributable to noncontrolling interests.\n37\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nSee \"Average Realized Price Reconciliation\" for a discussion and calculation of our average realized price, which is based on our Production segment's adjusted operating revenues (Production adjusted operating revenues), a non-GAAP supplemental financial measure that has been reconciled to total Production operating revenues in \"Non-GAAP Financial Measures Reconciliation.\" See \"Business Segment Results of Operations\" for a discussion of segment operating revenues and expenses and \"Other Income Statement Items\" for a discussion of other income statement items. See \"Investing Activities\" under \"Capital Resources and Liquidity\" for a discussion of capital expenditures, including by business segment.\nAverage Realized Price Reconciliation\nThe following table presents detailed natural gas and liquids operational information to assist in the understanding of our consolidated operations, including the calculation of our average realized price ($/Mcfe), which is based on Production adjusted operating revenues, a non-GAAP supplemental financial measure. Production adjusted operating revenues is presented because it is an important measure we use to evaluate period-to-period comparisons of earnings trends. Production adjusted operating revenues should not be considered as an alternative to total Production operating revenues. See \"Non-GAAP Financial Measures Reconciliation\" for a reconciliation of Production adjusted operating revenues to total Production operating revenues, the most directly comparable financial measure calculated in accordance with United States generally accepted accounting principles (GAAP).\n38\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(Thousands, unless otherwise noted)\nNATURAL GAS\nSales volume (MMcf)\n595,642 \n547,225 \n1,666,421 \n1,520,574 \nNYMEX price ($/MMBtu)\n$\n3.07 \n$\n2.15 \n$\n3.37 \n$\n2.12 \nBtu uplift\n0.17 \n0.12 \n0.19 \n0.12 \nNatural gas price ($/Mcf)\n$\n3.24 \n$\n2.27 \n$\n3.56 \n$\n2.24 \nBasis ($/Mcf) (a)\n$\n(0.70)\n$\n(0.56)\n$\n(0.50)\n$\n(0.40)\nCash settled basis swaps ($/Mcf)\n0.02 \n(0.09)\n(0.02)\n(0.10)\nAverage differential, including cash settled basis swaps ($/Mcf)\n(0.68)\n(0.65)\n(0.52)\n(0.50)\nAverage adjusted price ($/Mcf)\n2.56 \n1.62 \n3.04 \n1.74 \nCash settled derivatives ($/Mcf)\n0.10 \n0.61 \n(0.05)\n0.75 \nAverage natural gas price, including cash settled derivatives ($/Mcf)\n$\n2.66 \n$\n2.23 \n$\n2.99 \n$\n2.49 \nNatural gas sales, including cash settled derivatives\n$\n1,586,374 \n$\n1,222,498 \n$\n4,987,247 \n$\n3,786,058 \nLIQUIDS\nNGLs, excluding ethane:\nSales volume (MMcfe) (b)\n23,650 \n22,253 \n66,997 \n63,393 \nSales volume (Mbbl)\n3,942 \n3,710 \n11,166 \n10,566 \nNGLs price ($/Bbl)\n$\n31.82 \n$\n35.20 \n$\n37.12 \n$\n38.18 \nCash settled derivatives ($/Bbl)\n0.70 \n(0.11)\n(0.21)\n(0.20)\nAverage NGLs price, including cash settled derivatives ($/Bbl)\n$\n32.52 \n$\n35.09 \n$\n36.91 \n$\n37.98 \nNGLs sales, including cash settled derivatives\n$\n128,183 \n$\n130,140 \n$\n412,206 \n$\n401,232 \nEthane:\nSales volume (MMcfe) (b)\n12,157 \n9,864 \n32,759 \n32,416 \nSales volume (Mbbl)\n2,026 \n1,644 \n5,460 \n5,403 \nEthane price ($/Bbl)\n$\n6.86 \n$\n5.56 \n$\n8.01 \n$\n5.97 \nEthane sales\n$\n13,901 \n$\n9,135 \n$\n43,730 \n$\n32,237 \nOil:\nSales volume (MMcfe) (b)\n2,946 \n2,072 \n7,196 \n6,593 \nSales volume (Mbbl)\n491 \n345 \n1,199 \n1,099 \nOil price ($/Bbl)\n$\n49.12 \n$\n61.25 \n$\n51.09 \n$\n60.43 \nOil sales\n$\n24,119 \n$\n21,144 \n$\n61,270 \n$\n66,403 \nTotal liquids sales volume (MMcfe) (b)\n38,753 \n34,189 \n106,952 \n102,402 \nTotal liquids sales volume (Mbbl)\n6,459 \n5,699 \n17,825 \n17,068 \nTotal liquids sales\n$\n166,203 \n$\n160,419 \n$\n517,206 \n$\n499,872 \nTOTAL\nTotal natural gas and liquids sales, including cash settled derivatives (c)\n$\n1,752,577 \n$\n1,382,917 \n$\n5,504,453 \n$\n4,285,930 \nTotal sales volume (MMcfe)\n634,395 \n581,414 \n1,773,373 \n1,622,976 \nAverage realized price ($/Mcfe)\n$\n2.76 \n$\n2.38 \n$\n3.10 \n$\n2.64 \n(a)\nBasis represents the difference between the ultimate sales price for natural gas, including the effects of delivered price benefit or deficit associated with our firm transportation agreements, and the New York Mercantile Exchange (NYMEX) natural gas price.\n(b)\nNGLs, ethane and oil were converted to thousand cubic feet of natural gas equivalents (Mcfe) at a rate of six Mcfe per barrel.\n(c)\nAlso referred to in this report as Production adjusted operating revenues, a non-GAAP supplemental financial measure.\n39\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nNon-GAAP Financial Measures Reconciliation\nThe table below reconciles Production adjusted operating revenues, a non-GAAP supplemental financial measure, to total Production operating revenues, the most comparable financial measure calculated in accordance with GAAP. See Note 2 to the Condensed Consolidated Financial Statements for a reconciliation of total Production operating revenues to EQT Corporation operating revenues as reported in the Statements of Condensed Consolidated Operations.\nProduction adjusted operating revenues (also referred to in this report as total natural gas and liquids sales, including cash settled derivatives) is presented because it is an important measure we use to evaluate period-to-period comparisons of earnings trends. Production adjusted operating revenues is defined as total Production operating revenues, less the revenue impact of changes in the fair value of derivative instruments prior to settlement and Production other revenues. We believe that Production adjusted operating revenues provides useful information to investors regarding our financial condition and results of operations because it helps facilitate comparisons of operating performance and earnings trends across periods. Production adjusted operating revenues reflects only the impact of settled derivative contracts; thus, the measure excludes the often-volatile revenue impact of changes in the fair value of derivative instruments prior to settlement. The measure also excludes Production other revenues, which consists of costs of, and recoveries on, pipeline capacity releases and other revenues.\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(Thousands, unless otherwise noted)\nTotal Production operating revenues\n$\n1,815,766 \n$\n1,178,067 \n$\n5,805,591 \n$\n3,536,264 \n(Deduct) add:\nProduction gain on derivatives\n(135,784)\n(72,489)\n(176,829)\n(240,333)\nNet cash settlements received (paid) on derivatives (a)\n74,960 \n288,136 \n(118,390)\n1,037,321 \nPremiums paid for derivatives that settled during the period\n— \n(4,971)\n— \n(44,565)\nProduction other revenues\n(2,365)\n(5,826)\n(5,919)\n(2,757)\nProduction adjusted operating revenues, a non-GAAP financial measure\n$\n1,752,577 \n$\n1,382,917 \n$\n5,504,453 \n$\n4,285,930 \nTotal sales volume (MMcfe)\n634,395 \n581,414 \n1,773,373 \n1,622,976 \nAverage sales price ($/Mcfe)\n$\n2.64 \n$\n1.89 \n$\n3.17 \n$\n2.03 \nAverage realized price ($/Mcfe)\n$\n2.76 \n$\n2.38 \n$\n3.10 \n$\n2.64 \n(a)\nNet cash settlements received (paid) on derivatives are included in average realized price but may not be included in operating revenues. For the three months ended September 30, 2025, net cash settlements received on derivatives was composed of net cash settlements received on NYMEX natural gas hedge positions of approximately $59 million and net cash settlements received on basis and liquids hedge positions of approximately $16 million. For the three months ended September 30, 2024, net cash settlements received on derivatives was composed of net cash settlements received on NYMEX natural gas hedge positions of approximately $339 million and net cash settlements paid on basis and liquids hedge positions of approximately $51 million.\nFor the nine months ended September 30, 2025, net cash settlements paid on derivatives was composed of net cash settlements paid on NYMEX natural gas hedge positions of approximately $86 million and net cash settlements paid on basis and liquids hedge positions of approximately $32 million. For the nine months ended September 30, 2024, net cash settlements received on derivatives was composed of net cash settlements received on NYMEX natural gas hedge positions of approximately $1,195 million and net cash settlements paid on basis and liquids hedge positions of approximately $158 million.\n40\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nBusiness Segment Results of Operations\nThe following sections present operating income and key operational measures for our three reportable segments of Production, Gathering and Transmission. We believe this information provides useful information to investors regarding our financial condition, results of operations and trends and uncertainties. See Note 2 to the Condensed Consolidated Financial Statements for additional segment information.\nItems that are managed on a consolidated basis, including cash and cash equivalents, debt, income taxes and amounts related to our headquarters function, and items related to our energy transition initiatives have not been allocated to our reportable segments. These items are discussed under \"Other Income Statement Items.\"\n41\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nPRODUCTION\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nThree Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(Thousands, unless otherwise noted)\nTotal sales volume (MMcfe)\n634,395 \n581,414 \n52,981 \n9.1 \nAverage daily sales volume (MMcfe/d)\n6,896 \n6,320 \n576 \n9.1 \nAverage sales price ($/Mcfe)\n$\n2.64 \n$\n1.89 \n$\n0.75 \n39.7 \nOperating revenues:\nSales of natural gas, NGLs and oil\n$\n1,677,617 \n$\n1,099,752 \n$\n577,865 \n52.5 \nGain on derivatives\n135,784 \n72,489 \n63,295 \n87.3 \nOther\n2,365 \n5,826 \n(3,461)\n(59.4)\nTotal operating revenues\n1,815,766 \n1,178,067 \n637,699 \n54.1 \nOperating expenses:\n \n \n \nTransportation and processing:\nGathering\n39,786 \n115,599 \n(75,813)\n(65.6)\nTransmission\n253,242 \n250,757 \n2,485 \n1.0 \nProcessing\n84,105 \n74,489 \n9,616 \n12.9 \nTransportation and processing to affiliate (a)\n314,384 \n252,825 \n61,559 \n24.3 \nTotal transportation and processing\n691,517 \n693,670 \n(2,153)\n(0.3)\nLease operating expense (LOE)\n58,103 \n54,199 \n3,904 \n7.2 \nProduction taxes\n40,199 \n39,643 \n556 \n1.4 \nExploration\n331 \n282 \n49 \n17.4 \nSelling, general and administrative (b)\n58,579 \n62,952 \n(4,373)\n(6.9)\nProduction depletion\n600,256 \n529,786 \n70,470 \n13.3 \nOther depreciation and depletion\n1,297 \n959 \n338 \n35.2 \n(Gain) loss on sale/exchange of long-lived assets\n(5,589)\n9,708 \n(15,297)\n(157.6)\nImpairment and expiration of leases\n3,476 \n12,095 \n(8,619)\n(71.3)\nOther operating expenses\n(2,740)\n10,206 \n(12,946)\n(126.8)\nTotal operating expenses\n1,445,429 \n1,413,500 \n31,929 \n2.3 \nOperating income (loss)\n$\n370,337 \n$\n(235,433)\n$\n605,770 \n(257.3)\nPer Unit ($/Mcfe):\nGathering\n$\n0.06 \n$\n0.20 \n$\n(0.14)\n(70.0)\nTransmission\n0.40 \n0.43 \n(0.03)\n(7.0)\nProcessing\n0.13 \n0.13 \n— \n— \nTransportation and processing to affiliate (a)\n0.50 \n0.43 \n0.07 \n16.3 \nLOE\n0.09 \n0.09 \n— \n— \nProduction taxes\n0.06 \n0.07 \n(0.01)\n(14.3)\nSelling, general and administrative (b)\n0.09 \n0.11 \n(0.02)\n(18.2)\nProduction depletion\n0.95 \n0.91 \n0.04 \n4.4 \n(a)\nTransportation and processing to affiliate represents intercompany transactions with our Gathering and Transmission segments, which are eliminated in consolidation.\n42\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n(b)\nSelling, general and administrative expense incurred prior to the Equitrans Midstream Merger closing date was not recast for our change in reportable segments from one reportable segment to three reportable segments as the necessary information was not available and the cost to develop such information would be excessive.\nSales of natural gas, NGLs and oil.\n Sales of natural gas, NGLs and oil increased by approximately $578 million for the three months ended September 30, 2025 compared to the same period in 2024, reflecting an increase of approximately $478 million from higher average sales price and approximately $100 million from increased sales volumes. \nAverage sales price increased for the three months ended September 30, 2025 compared to the same period for 2024 due primarily to a higher NYMEX price, partly offset by unfavorable basis differential. Sales volume increased for the three months ended September 30, 2025 compared to the same period for 2024 primarily as a result of sales volume increases of 48 Bcfe from the assets acquired in the Olympus Energy Acquisition, production curtailments in 2024 of 25 Bcfe (compared to production curtailments in 2025 of 3 Bcfe) and wells turned-in-line since the third quarter of 2024, partly offset by sales volume decreases of 33 Bcfe from the assets divested in the Second NEPA Non-Operated Asset Divestiture. The increase in sales volume had a favorable impact on per unit costs for the three months ended September 30, 2025 compared to the same period for 2024.\nGain on derivatives.\n For the three months ended September 30, 2025, we recognized a gain on derivatives of approximately $136 million related primarily to increases in the fair market value of our NYMEX swaps and options of approximately $266 million due to decreases in NYMEX forward prices, partly offset by decreases in the fair market value of our basis and liquids swaps of approximately $130 million. For the three months ended September 30, 2024, we recognized a gain on derivatives of approximately $72 million related primarily to increases in the fair market value of our NYMEX swaps and options of approximately $198 million due to decreases in NYMEX forward prices, partly offset by decreases in the fair market value of our basis and liquids swaps of approximately $126 million.\nGathering.\n Gathering expense decreased on an absolute and per Mcfe basis for the three months ended September 30, 2025 compared to the same period in 2024 due primarily to our Gathering segment's ownership of the gathering assets acquired in the Equitrans Midstream Merger and our Transmission segment's ownership of the transmission and storage assets acquired in the Equitrans Midstream Merger. In addition, gathering expense decreased due to our divestiture of assets in the Second NEPA Non-Operated Asset Divestiture.\nTransportation and processing to affiliate.\n Affiliate transportation and processing expense increased on an absolute and per Mcfe basis for the three months ended September 30, 2025 compared to the same period in 2024 due primarily to our Gathering segment's ownership of the gathering assets acquired in the Equitrans Midstream Merger and the Olympus Energy Acquisition as well as our Transmission segment's ownership of the transmission and storage assets acquired in the Equitrans Midstream Merger.\nDepreciation and depletion.\n Production depletion expense increased on an absolute and per Mcfe basis for the three months ended September 30, 2025 compared to the same period in 2024 due to increased sales volume and higher annual depletion rate.\n43\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nNine Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(Thousands, unless otherwise noted)\nTotal sales volume (MMcfe)\n1,773,373 \n1,622,976 \n150,397 \n9.3 \nAverage daily sales volume (MMcfe/d)\n6,496 \n5,923 \n573 \n9.7 \nAverage sales price ($/Mcfe)\n$\n3.17 \n$\n2.03 \n$\n1.14 \n56.2 \nOperating revenues:\nSales of natural gas, NGLs and oil\n$\n5,622,843 \n$\n3,293,174 \n$\n2,329,669 \n70.7 \nGain on derivatives\n176,829 \n240,333 \n(63,504)\n(26.4)\nOther\n5,919 \n2,757 \n3,162 \n114.7 \nTotal operating revenues\n5,805,591 \n3,536,264 \n2,269,327 \n64.2 \nOperating expenses:\n \n \n \nTransportation and processing:\nGathering\n132,700 \n721,891 \n(589,191)\n(81.6)\nTransmission\n761,830 \n597,578 \n164,252 \n27.5 \nProcessing\n249,928 \n209,624 \n40,304 \n19.2 \nTransportation and processing to affiliate (a)\n941,798 \n384,917 \n556,881 \n144.7 \nTotal transportation and processing\n2,086,256 \n1,914,010 \n172,246 \n9.0 \nLOE\n151,695 \n144,956 \n6,739 \n4.6 \nProduction taxes\n126,563 \n128,086 \n(1,523)\n(1.2)\nExploration\n2,655 \n2,576 \n79 \n3.1 \nSelling, general and administrative (b)\n153,957 \n203,212 \n(49,255)\n(24.2)\nProduction depletion\n1,682,395 \n1,468,644 \n213,751 \n14.6 \nOther depreciation and depletion\n3,570 \n2,322 \n1,248 \n53.7 \nGain on sale/exchange of long-lived assets\n(2,717)\n(310,252)\n307,535 \n(99.1)\nImpairment and expiration of leases\n9,391 \n58,963 \n(49,572)\n(84.1)\nOther operating expenses\n22,593 \n23,650 \n(1,057)\n(4.5)\nTotal operating expenses\n4,236,358 \n3,636,167 \n600,191 \n16.5 \nOperating income\n$\n1,569,233 \n$\n(99,903)\n$\n1,669,136 \n(1,670.8)\nPer Unit ($/Mcfe):\nGathering\n$\n0.07 \n$\n0.44 \n$\n(0.37)\n(84.1)\nTransmission\n0.43 \n0.37 \n0.06 \n16.2 \nProcessing\n0.14 \n0.13 \n0.01 \n7.7 \nTransportation and processing to affiliate (a)\n0.53 \n0.24 \n0.29 \n120.8 \nLOE\n0.09 \n0.09 \n— \n— \nProduction taxes\n0.07 \n0.08 \n(0.01)\n(12.5)\nSelling, general and administrative (b)\n0.09 \n0.13 \n(0.04)\n(30.8)\nProduction depletion\n0.95 \n0.90 \n0.05 \n5.6 \n(a)\nTransportation and processing to affiliate represents intercompany transactions with our Gathering and Transmission segments, which are eliminated in consolidation.\n44\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n(b)\nSelling, general and administrative expense incurred prior to the Equitrans Midstream Merger closing date was not recast for our change in reportable segments from one reportable segment to three reportable segments as the necessary information was not available and the cost to develop such information would be excessive.\nSales of natural gas, NGLs and oil.\n Sales of natural gas, NGLs and oil increased by approximately $2,330 million for the nine months ended September 30, 2025 compared to the same period in 2024, reflecting an increase of approximately $2,025 million from higher average sales price and approximately $305 million from increased sales volumes.\nAverage sales price increased for the nine months ended September 30, 2025 compared to the same period for 2024 due primarily to a higher NYMEX price, partly offset by unfavorable basis differential. Sales volume increased for the nine months ended September 30, 2025 compared to the same period for 2024 primarily as a result of production curtailments in 2024 of 107 Bcfe (compared to production curtailments in 2025 of 3 Bcfe), wells turned-in-line since the third quarter of 2024, sales volume increases of 48 Bcfe from the assets acquired in the Olympus Energy Acquisition and sales volume increases of 25 Bcfe from the assets received as consideration for (net of assets divested in) the First NEPA Non-Operated Asset Divestiture. Increases in sales volume were partly offset by sales volume decreases of 129 Bcfe from the assets divested in the Second NEPA Non-Operated Asset Divestiture. The overall increase in sales volume had a favorable impact on per unit costs for the nine months ended September 30, 2025 compared to the same period for 2024.\nGain on derivatives.\n For the nine months ended September 30, 2025, we recognized a gain on derivatives of approximately $177 million related primarily to increases in the fair market value of our NYMEX swaps and options of approximately $165 million due to decreases in NYMEX forward prices and increases in the fair market value of our basis and liquids swaps of approximately $12 million. For the nine months ended September 30, 2024, we recognized a gain on derivatives of approximately $240 million related primarily to increases in the fair market value of our NYMEX swaps and options of approximately $435 million due to decreases in NYMEX forward prices, partly offset by decreases in the fair market value of our basis and liquids swaps of approximately $195 million.\nGathering.\n Gathering expense decreased on an absolute and per Mcfe basis for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to our Gathering segment's ownership of the gathering assets acquired in the Equitrans Midstream Merger, our Transmission segment's ownership of the transmission and storage assets acquired in the Equitrans Midstream Merger and our Gathering segment's ownership of additional interest in the NEPA Gathering System acquired in the NEPA Gathering System Acquisition. In addition, gathering expense decreased due to our divestiture of assets in the NEPA Non-Operated Asset Divestitures.\nTransmission. \nTransmission expense increased on an absolute and per Mcfe basis for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to capacity charges on the MVP of approximately $183 million and additional contracted capacity on the Transco pipeline of approximately $30 million, partly offset by capacity released in connection with the NEPA Non-Operated Asset Divestitures of approximately $48 million.\nProcessing.\n Processing expense increased on an absolute and per Mcfe basis for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to increased production of gas requiring processing from wells turned-in-line during and subsequent to the third quarter of 2024.\nTransportation and processing to affiliate. \nAffiliate transportation and processing expense increased on an absolute and per Mcfe basis for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to our Gathering segment's ownership of the gathering assets acquired in the Equitrans Midstream Merger and the Olympus Energy Acquisition, our Transmission segment's ownership of the transmission and storage assets acquired in the Equitrans Midstream Merger and our Gathering segment's ownership of additional interest in the NEPA Gathering System acquired in the NEPA Gathering System Acquisition.\nProduction taxes.\n Production tax expense decreased on an absolute basis for the nine months ended September 30, 2025 compared to the same period in 2024 due to decreased property tax expense of approximately $39 million from lower property tax value based on prior year pricing, partly offset by increased severance tax expense of approximately $30 million from increased sales volume and higher sales prices.\n45\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nSelling, general and administrative. \nSelling, general and administrative expense decreased on an absolute basis and per Mcfe basis for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to lower professional service costs. Selling, general and administrative expense incurred prior to the Equitrans Midstream Merger closing date was not recast for our change in reportable segments; upon the Equitrans Midstream Merger closing date, we adjusted our basis for selling, general and administrative expense allocation for multi-segment reporting.\nDepreciation and depletion.\n Production depletion expense increased on an absolute and per Mcfe basis for the nine months ended September 30, 2025 compared to the same period in 2024 due to increased sales volume and higher annual depletion rate.\nGain on sale/exchange of long-lived assets.\n During the nine months ended September 30, 2024, we recognized a gain on the First NEPA Non-Operated Asset Divestiture of approximately $312 million.\nImpairment and expiration of leases. \nDuring the nine months ended September 30, 2025 and 2024, we recognized impairment and expiration of leases of approximately $9 million and $59 million, respectively, related to leases that we no longer expect to extend or develop prior to their expiration based on our development plan.\nGATHERING\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nThree Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(Thousands, unless otherwise noted)\nGathered volume (British thermal unit (BBtu)/d):\nFirm capacity (a)\n5,624 \n5,450 \n174 \n3.2 \nVolumetric-based services (a)\n5,088 \n4,293 \n795 \n18.5 \nTotal gathered volume\n10,712 \n9,743 \n969 \n9.9 \nOperating revenues:\nLoss on derivatives\n$\n— \n$\n(5,673)\n$\n5,673 \n(100.0)\nFirm reservation fee revenue (b)\n144,259 \n136,752 \n7,507 \n5.5 \nVolumetric-based fee revenue\n176,893 \n140,077 \n36,816 \n26.3 \nTotal operating revenues\n321,152 \n271,156 \n49,996 \n18.4 \nOperating expenses:\nOperating and maintenance\n44,519 \n30,712 \n13,807 \n45.0 \nSelling, general and administrative (c)\n15,750 \n11,366 \n4,384 \n38.6 \nDepreciation\n53,642 \n37,773 \n15,869 \n42.0 \nGain on sale/exchange of long-lived assets\n(12)\n— \n(12)\n100.0 \nOther operating expenses\n4,624 \n— \n4,624 \n100.0 \nTotal operating expenses\n118,523 \n79,851 \n38,672 \n48.4 \nOperating income\n$\n202,629 \n$\n191,305 \n$\n11,324 \n5.9 \n(a)\nFor agreements structured with minimum volume commitments (MVCs), firm capacity includes volumes up to the contractual MVC and volumetric-based services includes volumes in excess of the contractual MVC.\n(b)\nFirm reservation fee revenue included unbilled revenues supported by MVCs of approximately $4.1 million and $1.8 million for the three months ended September 30, 2025 and 2024, respectively.\n(c)\nSelling, general and administrative expense incurred prior to the Equitrans Midstream Merger closing date was not recast for our change in reportable segments from one reportable segment to three reportable segments as the necessary information was not available and the cost to develop such information would be excessive.\n46\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nFirm reservation fee revenue increased for the three months ended September 30, 2025 compared to the same period in 2024 due primarily to the gathering assets acquired in the Equitrans Midstream Merger, which contributed approximately $41 million of additional firm revenue in 2025. This increase was partly offset by lower revenues of approximately $33 million from the declining rate structures under the gas gathering agreement with our Production segment.\nVolumetric-based fee revenue increased for the three months ended September 30, 2025 compared to the same period in 2024 due primarily to the gathering assets acquired in the Olympus Energy Acquisition, which contributed approximately $22 million of additional volumetric-based fee revenue in 2025, the timing of the completion of the Equitrans Midstream Merger and higher gathered volumes.\nGathering operating expenses increased for the three months ended September 30, 2025 compared to the same period in 2024 due primarily to the gathering assets acquired in the Equitrans Midstream Merger.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nNine Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(Thousands, unless otherwise noted)\nGathered volume (BBtu/d):\nFirm capacity (a)\n5,288 \n5,450 \n(162)\n(3.0)\nVolumetric-based services (a)\n4,861 \n4,059 \n802 \n19.8 \nTotal gathered volume\n10,149 \n9,509 \n640 \n6.7 \nOperating revenues:\nLoss on derivatives\n$\n— \n$\n(5,673)\n$\n5,673 \n(100.0)\nFirm reservation fee revenue (b)\n480,547 \n136,752 \n343,795 \n251.4 \nVolumetric-based fee revenue\n496,187 \n278,739 \n217,448 \n78.0 \nTotal operating revenues\n976,734 \n409,818 \n566,916 \n138.3 \nOperating expenses:\nOperating and maintenance\n121,425 \n56,018 \n65,407 \n116.8 \nSelling, general and administrative (c)\n44,068 \n11,366 \n32,702 \n287.7 \nDepreciation\n157,098 \n45,282 \n111,816 \n246.9 \nGain on sale/exchange of long-lived assets\n(12)\n(22)\n10 \n(45.5)\nOther operating expenses\n14,920 \n— \n14,920 \n100.0 \nTotal operating expenses\n337,499 \n112,644 \n224,855 \n199.6 \nOperating income\n$\n639,235 \n$\n297,174 \n$\n342,061 \n115.1 \n(a)\nFor agreements structured with MVCs, firm capacity includes volumes up to the contractual MVC and volumetric-based services includes volumes in excess of the contractual MVC.\n(b)\nFirm reservation fee revenue included unbilled revenues supported by MVCs of approximately $15.3 million and $1.8 million for the nine months ended September 30, 2025 and 2024, respectively.\n(c)\nSelling, general and administrative expense incurred prior to the Equitrans Midstream Merger closing date was not recast for our change in reportable segments from one reportable segment to three reportable segments as the necessary information was not available and the cost to develop such information would be excessive.\nFirm reservation fee revenue increased for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to the gathering assets acquired in the Equitrans Midstream Merger, which contributed approximately $377 million of additional firm revenue in 2025. This increase was partly offset by lower revenues of approximately $33 million from the declining rate structures under the gas gathering agreement with our Production segment.\n47\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nVolumetric-based fee revenue increased for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to the timing of the completion of the Equitrans Midstream Merger, the gathering assets acquired in the Olympus Energy Acquisition, which contributed approximately $22 million of additional volumetric-based fee revenue in 2025, and higher gathered volumes.\nGathering operating expenses increased for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to the gathering assets acquired in the Equitrans Midstream Merger. In addition, during the nine months ended September 30, 2025, we recognized Gathering other operating expenses related to environmental reserves.\nTRANSMISSION\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nThree Months Ended\nSeptember 30, 2025\n2025\n2024\nChange\n% Change\n(Thousands, unless otherwise noted)\nTransmission pipeline throughput (BBtu/d):\nFirm capacity (a)\n4,701 \n3,595 \n1,106 \n30.8 \nInterruptible capacity\n13 \n12 \n1 \n8.3 \nTotal transmission pipeline throughput\n4,714 \n3,607 \n1,107 \n30.7 \nAverage contracted firm transmission reservation commitments (BBtu/d)\n4,851 \n4,454 \n397 \n8.9 \nOperating revenues:\nFirm reservation fee revenue\n$\n101,914 \n$\n73,034 \n$\n28,880 \n39.5 \nVolumetric-based fee revenue\n34,799 \n14,350 \n20,449 \n142.5 \nTotal operating revenues\n136,713 \n87,384 \n49,329 \n56.5 \nOperating expenses:\nOperating and maintenance\n15,783 \n9,806 \n5,977 \n61.0 \nSelling, general and administrative\n8,728 \n5,492 \n3,236 \n58.9 \nDepreciation\n23,482 \n13,900 \n9,582 \n68.9 \nAmortization of intangible assets\n3,333 \n3,209 \n124 \n3.9 \nLoss on sale/exchange of long-lived assets\n— \n409 \n(409)\n(100.0)\nTotal operating expenses\n51,326 \n32,816 \n18,510 \n56.4 \nOperating income\n$\n85,387 \n$\n54,568 \n$\n30,819 \n56.5 \n(a)\nIncludes all volumes associated with firm capacity contracts, including volumes in excess of firm capacity.\nFirm reservation fee revenue increased for the three months ended September 30, 2025 compared to the same period in 2024 due primarily to the timing of the completion of the Equitrans Midstream Merger.\nVolumetric-based fee revenue increased for the three months ended September 30, 2025 compared to the same period in 2024 due primarily to increased throughput as well as the timing of the completion of the Equitrans Midstream Merger.\nTransmission operating expenses increased for the three months ended September 30, 2025 compared to the same period in 2024 due primarily to the timing of the completion of the Equitrans Midstream Merger.\n48\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nNine Months Ended\nSeptember 30,\n2025\n2024\nChange\n% Change\n(Thousands, unless otherwise noted)\nTransmission pipeline throughput (BBtu/d):\nFirm capacity (a)\n4,358 \n3,595 \n763 \n21.2 \nInterruptible capacity\n37 \n12 \n25 \n208.3 \nTotal transmission pipeline throughput\n4,395 \n3,607 \n788 \n21.8 \nAverage contracted firm transmission reservation commitments (BBtu/d)\n4,890 \n4,454 \n436 \n9.8 \nOperating revenues:\nFirm reservation fee revenue\n$\n316,301 \n$\n73,034 \n$\n243,267 \n333.1 \nVolumetric-based fee revenue\n101,266 \n14,350 \n86,916 \n605.7 \nTotal operating revenues\n417,567 \n87,384 \n330,183 \n377.9 \nOperating expenses:\nOperating and maintenance\n40,157 \n9,806 \n30,351 \n309.5 \nSelling, general and administrative\n26,254 \n5,492 \n20,762 \n378.0 \nDepreciation\n62,751 \n13,900 \n48,851 \n351.4 \nAmortization of intangible assets\n9,999 \n3,209 \n6,790 \n211.6 \nLoss on sale/exchange of long-lived assets\n349 \n409 \n(60)\n(14.7)\nOther operating expenses\n(536)\n— \n(536)\n100.0 \nTotal operating expenses\n138,974 \n32,816 \n106,158 \n323.5 \nOperating income\n$\n278,593 \n$\n54,568 \n$\n224,025 \n410.5 \n(a)\nIncludes all volumes associated with firm capacity contracts, including volumes in excess of firm capacity.\nFirm reservation fee revenue increased for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to the timing of the completion of the Equitrans Midstream Merger.\nVolumetric-based fee revenue increased for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to the timing of the completion of the Equitrans Midstream Merger as well as increased throughput.\nTransmission operating expenses increased for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to the timing of the completion of the Equitrans Midstream Merger.\n49\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nOther Income Statement Items\nOther operating expenses.\n Corporate other operating expenses decreased for both the three and nine months ended September 30, 2025 compared to the same periods in 2024 due primarily to decreased acquisition-related transaction costs. \nDuring the three months ended September 30, 2025, we recognized approximately $21 million of transaction costs related to the Olympus Energy Acquisition compared to approximately $275 million of transaction costs related to the Equitrans Midstream Merger in the same period in 2024.\nDuring the nine months ended September 30, 2025, we recognized approximately $25 million of transaction costs related to the Olympus Energy Acquisition compared to approximately $299 million of transaction costs related to the Equitrans Midstream Merger in the same period in 2024. In addition, during the nine months ended September 30, 2025 and 2024, we recognized net expense of approximately $134 million and $18 million, respectively, for estimated loss contingencies related to the Securities Class Action (defined in Note 13 to the Condensed Consolidated Financial Statements).\nIncome from investments.\n Income from investments increased for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to higher equity earnings of approximately $73 million and $30 million from our investments in the MVP Joint Venture and Laurel Mountain Midstream, LLC, respectively.\nOther income. \nDuring the nine months ended September 30, 2024, we received proceeds from insurance recoveries of approximately $19 million related to the assets acquired from THQ Appalachia I, LLC and THQ-XcL Holdings I, LLC on August 22, 2023.\nLoss on debt extinguishment.\n During the nine months ended September 30, 2025, we recognized a loss on debt extinguishment of approximately $19 million related primarily to net cash premiums paid in connection with our redemptions of senior notes of approximately $17 million as well as dealer-manager, legal and other fees related to the EQM Exchange Offers and Tender Offers (each defined in Note 7 to the Condensed Consolidated Financial Statements) of approximately $12 million, partly offset by a net gain of approximately $10 million associated with the derecognition of fair value adjustments recorded with Equitrans Midstream Merger purchase price accounting related to our current period redemptions.\nInterest expense, net.\n Net interest expense decreased for the three months ended September 30, 2025 compared to the same period in 2024 due primarily to decreased interest expense from our borrowings under EQT's revolving credit facility, our repayment and repurchase of certain of our senior notes and our prepayment of the term loans outstanding under EQT's unsecured term loan facility (the Term Loan Facility).\nNet interest expense increased for the nine months ended September 30, 2025 compared to the same period in 2024 due primarily to increased interest expense on the senior notes to which we became obligated as a result of the Equitrans Midstream Merger, higher capitalized interest from the assets acquired in the Equitrans Midstream Merger and increased interest expense on Eureka Midstream, LLC's (Eureka) borrowings under its revolving credit facility. Such increases were partly offset by decreased interest expense from our prepayment of the Term Loan Facility, our repayment and repurchase of certain of our senior notes and our borrowings under EQT's revolving credit facility.\nIncome tax expense (benefit).\n See Note 6 to the Condensed Consolidated Financial Statements.\nNet income attributable to noncontrolling interests\n. Net income attributable to noncontrolling interests increased for both the three and nine months ended September 30, 2025 compared to the same periods in 2024 as a result of the Midstream Joint Venture Transaction (defined in Note 9 to the Condensed Consolidated Financial Statements), which was completed in December 2024. For the three and nine months ended September 30, 2025, we recognized net income attributable to noncontrolling interests of the Midstream Joint Venture (defined in Note 9 to the Condensed Consolidated Financial Statements) of approximately $66 million and $199 million, respectively.\nIn addition, for the nine months ended September 30, 2025 compared to the same period in 2024, net income attributable to noncontrolling interests in Eureka Midstream Holdings, LLC increased approximately $15 million due primarily to the timing of the completion of the Equitrans Midstream Merger.\n50\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nCapital Resources and Liquidity\nAlthough we cannot provide any assurance, we believe cash flows from operating activities and availability under EQT's revolving credit facility should be sufficient to meet our cash requirements, including, but not limited to, normal operating needs, debt service obligations, planned capital expenditures and commitments for at least the next twelve months and, based on current expectations, for the long term.\nPlanned Capital Expenditures and Sales Volume\n. In the fourth quarter of 2025, we expect to spend approximately $635 million to $735 million in total capital expenditures. We expect to fund our capital expenditures with cash generated from operations and, if required, borrowings under EQT's revolving credit facility. Because we are the operator of a high percentage of our developed acreage, the amount and timing of certain of our capital expenditures is largely discretionary. We could choose to defer a portion of our planned 2025 capital expenditures depending on a variety of factors, including prevailing and anticipated prices for natural gas, NGLs and oil; the availability of necessary equipment, infrastructure and capital; the receipt and timing of required regulatory permits and approvals; and drilling, completion and acquisition costs.\nIn the fourth quarter of 2025, we expect our sales volume to be 550 Bcfe to 600 Bcfe, inclusive of expected curtailments.\n \nMaterial Cash Requirements.\n We have contractual commitments under our debt agreements, including interest payments and principal repayments. See Note 7 to the Condensed Consolidated Financial Statements for a summary of such contractual commitments, including maturity dates.\nIn addition, see \"Financing Activities\" below for a discussion of the Midstream Joint Venture's requirement to make distributions of available cash flow to the holder of the Midstream Joint Venture's Class B units (Class B Unitholder).\nOperating Activities. \nNet cash provided by operating activities was approximately $4,001 million and $2,071 million for the nine months ended September 30, 2025 and 2024, respectively. The increase was due primarily to higher cash operating revenues, lower net cash operating expenses, distributions received from our equity method investments in the MVP Joint Venture of approximately $191 million and our receipt of a tax refund. Such increases were partly offset by net cash settlements paid on derivatives in 2025 compared to net cash settlements received in 2024.\nOur cash flows from operating activities, including changes in working capital, are affected by movements in the market price for commodities. We are unable to predict such movements outside of the current market view as reflected in forward strip pricing. For a discussion of potential commodity market risks, refer to Part I, Item 1A., \"Risk Factors – Natural gas, NGLs and oil price volatility, or a prolonged period of low natural gas, NGLs and oil prices, may have an adverse effect on our revenue, profitability, future rate of growth, liquidity and financial position\" in EQT's Annual Report on \nForm 10-K\n for the year ended December 31, 2024.\nInvesting Activities. \nNet cash used in investing activities was approximately $2,224 million and $2,162 million for the nine months ended September 30, 2025 and 2024, respectively. The increase was attributable primarily to proceeds received from the First NEPA Non-Operated Asset Divestiture in 2024, partly offset by lower cash paid as consideration for the Olympus Energy Acquisition in 2025 compared to cash paid in 2024 to effect the purchase and redemption of the Equitrans Midstream preferred stock (defined in Note 11 to the Condensed Consolidated Financial Statements) and as consideration for the NEPA Gathering System Acquisition.\n51\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nThe following table summarizes our capital expenditures by segment.\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(Millions)\nProduction:\nReserve development (a)\n$\n391 \n$\n371 \n$\n1,122 \n$\n1,283 \nLand and lease\n51 \n37 \n100 \n105 \nOther production infrastructure\n19 \n16 \n47 \n57 \nCapitalized interest, capitalized overhead and other\n30 \n31 \n80 \n95 \nTotal Production\n491 \n455 \n1,349 \n1,540 \nGathering\n105 \n80 \n263 \n112 \nTransmission\n13 \n10 \n36 \n10 \nOther corporate items\n9 \n13 \n21 \n21 \nTotal capital expenditures\n618 \n558 \n1,669 \n1,683 \nAdd (deduct): Non-cash items (b)\n9 \n11 \n7 \n(21)\nTotal cash capital expenditures\n$\n627 \n$\n569 \n$\n1,676 \n$\n1,662 \n(a)\nCapital expenditures for reserve development included capital expenditures for water infrastructure of approximately $27 million and $29 million for the three months ended September 30, 2025 and 2024, respectively, and approximately $61 million and $59 million for the nine months ended September 30, 2025 and 2024, respectively.\n(b)\nRepresents the net impact of non-cash capital expenditures, including the effect of timing of receivables from working interest partners, accrued capital expenditures, transfers to or from inventory as assets are completed or assigned to a project and capitalized share-based compensation costs. The impact of accrued capital expenditures includes the current period estimate, net of the reversal of the prior period accrual.\nFinancing Activities. \nNet cash used in financing activities was approximately $1,743 million for the nine months ended September 30, 2025 compared to net cash provided by financing activities of $100 million for the same period ended 2024. For the nine months ended September 30, 2025, the primary uses of financing cash flows were the repayment and retirement of debt, payment of dividends, distributions to the Midstream Joint Venture's Class B Unitholder (see below) and net repayments of revolving credit facility borrowings. For the nine months ended September 30, 2024, the primary sources of financing cash flows were the proceeds from borrowings under EQT's revolving credit facility, proceeds from the issuance of EQT's 5.750% senior notes and proceeds from the net settlement of the Capped Call Transactions (defined in Note 7 to the Condensed Consolidated Financial Statements), and the primary uses of financing cash flows were the repayment and retirement of debt, repayment of borrowings under EQM's revolving credit facility and payment of dividends.\nPursuant to the JV Agreement (defined in Note 9 to the Condensed Consolidated Financial Statements), we, through our controlling ownership interest in the Midstream Joint Venture, expect to make distributions of available cash flow to the Midstream Joint Venture's Class B Unitholder at least quarterly. During the nine months ended September 30, 2025, the Midstream Joint Venture paid approximately $259 million of cash distributions to its Class B Unitholder. As of September 30, 2025, the remaining requirement until the Base Return (as defined in the JV Agreement) is achieved was approximately $3.44 billion. See Note 9 to the Condensed Consolidated Financial Statements.\nOn October 16, 2025, our Board of Directors declared a quarterly cash dividend of $0.165 per share of EQT common stock, payable on December 1, 2025, to shareholders of record at the close of business on November 5, 2025.\nDepending on our actual and anticipated sources and uses of liquidity, prevailing market conditions and other factors, we may from time to time seek to redeem or repurchase our outstanding debt or equity securities through tender offers or other cash purchases in the open market or privately negotiated transactions. The amounts involved in any such transactions may be material. See Note 7 to the Condensed Consolidated Financial Statements for discussion of redemptions and repurchases of debt.\n52\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nSecurity Ratings and Financing Triggers\n \nOur credit ratings and rating outlooks are subject to revision or withdrawal at any time by the assigning rating agency, and each rating should be evaluated independently from any other rating. We cannot ensure that a rating will remain in effect for any given period of time or that a rating will not be lowered or withdrawn by a rating agency if, in the rating agency's judgment, circumstances so warrant. See Note 4 to the Condensed Consolidated Financial Statements for a description of what is deemed investment grade.\nThe table below reflects the credit ratings and rating outlooks assigned to EQT's debt instruments as of September 30, 2025. \nRating agency\n \nSenior notes\n \nOutlook\nMoody's Investors Service, Inc. (Moody's)\nBaa3\nStable\nS&P Global Ratings (S&P)\nBBB–\n \nStable\nFitch Ratings Service (Fitch)\nBBB–\nStable\n \nChanges in credit ratings may affect our access to the capital markets, the cost of short-term debt through interest rates and fees under our revolving credit facilities, the interest rate on our senior notes with adjustable rates, the rates available on new debt, our pool of investors and funding sources, the borrowing costs and margin deposit requirements on our over-the-counter (OTC) derivative instruments and credit assurance requirements, including collateral, in support of our midstream service contracts, joint venture arrangements or construction contracts. Margin deposits on our OTC derivative instruments are also subject to factors other than credit rating, such as natural gas prices and credit thresholds set forth in the agreements between us and our hedging counterparties.\nOur debt agreements and other financial obligations contain various provisions that, if not complied with, could result in default or event of default under EQT's revolving credit facility and Eureka's revolving credit facility, mandatory partial or full repayment of amounts outstanding, reduced loan capacity or other similar actions. The most significant covenants and events of default under our debt agreements relate to maintenance of a debt-to-total capitalization ratio, limitations on transactions with affiliates, insolvency events, nonpayment of scheduled principal or interest payments, acceleration of other financial obligations and change of control provisions. EQT's revolving credit facility contains financial covenants that require us to have a total debt to total capitalization ratio no greater than 65%. As of September 30, 2025, we were in compliance with all provisions and covenants under our debt agreements.\nSee Note 7 to the Condensed Consolidated Financial Statements for a discussion of borrowings under EQT's revolving credit facility and Eureka's revolving credit facility.\n53\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nCommodity Risk Management\nThe substantial majority of our commodity risk management program is related to hedging sales of our produced natural gas. The overall objective of our hedging program is to protect cash flows from undue exposure to the risk of changing commodity prices. The derivative commodity instruments that we use are primarily swap, collar and option agreements. The following table summarizes the approximate volume and prices of our NYMEX hedge positions as of October 15, 2025. The difference between the fixed price and NYMEX price is included in average differential presented in our price reconciliation in \"Average Realized Price Reconciliation.\" The fixed price natural gas sales agreements can be physically or financially settled.\nQ4 2025 (a)\nQ1 2026\nQ2 2026\nQ3 2026\nQ4 2026\nQ1 2027\nHedged Volume (MMDth)\n332 \n80 \n31 \n29 \n27 \n9 \nHedged Volume (MMDth/d)\n3.6 \n0.9 \n0.3 \n0.3 \n0.3 \n0.1 \nSwaps – Short\nVolume (MMDth)\n95 \n— \n— \n— \n— \n— \nAvg. Price ($/Dth)\n$\n3.28 \n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \nCalls – Short\nVolume (MMDth)\n189 \n80 \n31 \n29 \n27 \n9 \nAvg. Strike ($/Dth)\n$\n5.34 \n$\n5.77 \n$\n4.22 \n$\n4.17 \n$\n4.35 \n$\n4.25 \nPuts – Long\nVolume (MMDth)\n237 \n80 \n31 \n29 \n27 \n9 \nAvg. Strike ($/Dth)\n$\n3.35 \n$\n3.79 \n$\n3.31 \n$\n3.29 \n$\n3.40 \n$\n3.30 \nOption Premiums\nCash Settlement of Deferred Premiums (millions)\n$\n(45)\n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \n(a)\nOctober 1 through \nDecember 31\n.\nWe have also entered into derivative instruments to hedge basis. We may use other contractual agreements to implement our commodity hedging strategy from time to time. \nSee Part I, Item 3., \"Quantitative and Qualitative Disclosures About Market Risk\" and Note 4 to the Condensed Consolidated Financial Statements for further discussion of our hedging program.\nCommitments and Contingencies\nIn the ordinary course of business, various legal and regulatory claims and proceedings are pending or threatened against us. While the amounts claimed may be substantial, we are unable to predict with certainty the ultimate outcome of such claims and proceedings. We evaluate our legal proceedings, including litigation and regulatory and governmental investigations and inquiries, on a regular basis and accrue a liability for such matters when we believe that a loss is probable and the amount of the loss can be reasonably estimated. Any such accruals are adjusted thereafter as appropriate to reflect changed circumstances. In the event we determine that (i) a loss is probable but the amount of the loss cannot be reasonably estimated, or (ii) a loss is less likely than probable but is reasonably possible, then we are required to disclose the matter in EQT's Annual Report on \nForm 10-K\n with any update thereto in this Quarterly Report on Form 10-Q, as applicable, although we are not required to accrue such loss.\nWhen able, we determine an estimate of reasonably possible losses or ranges of reasonably possible losses, whether in excess of any related accrued liability or where there is no accrued liability, for legal proceedings. In instances where such estimates can be made, any such estimates are based on our analysis of currently available information and are subject to significant judgment and a variety of assumptions and uncertainties and may change as new information is obtained.\nSee Note 13 to the Condensed Consolidated Financial Statements herein and Note 15 to the Consolidated Financial Statements in EQT's Annual Report on \nForm 10-K\n for the year ended December 31, 2024 for discussions of our commitments and contingencies, including certain pending legal and regulatory proceedings and other contingent matters.\n54\nTable of Contents\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nAdditionally, in the normal course of business, we are subject to various other pending and threatened legal proceedings in which claims for monetary damages or other relief are asserted. We do not anticipate, at the present time, that the ultimate aggregate liability, if any, arising out of such other legal proceedings will have a material adverse effect on our financial position, results of operations or liquidity. \nRecently Issued Accounting Standards\nOur recently issued accounting standards are described in Note 1 to the Condensed Consolidated Financial Statements.\nCritical Accounting Estimates\n \nOur critical accounting estimates, including a discussion regarding the estimation uncertainty and the impact that our critical accounting estimates have had, or are reasonably likely to have, on our financial condition or results of operations, are described in the \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" section of EQT's Annual Report on \nForm 10-K\n for the year ended December 31, 2024. The application of our critical accounting estimates may require us to make judgments and estimates about the amounts reflected in the Condensed Consolidated Financial Statements. We use historical experience and all available information to make these estimates and judgments. Different amounts could be reported using different assumptions and estimates."
}