{
  "source_file": "ess-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOVERVIEW\nEssex Property Trust, Inc. (“Essex”), a Maryland corporation, is an S&P 500 company that operates as a self-administered and self-managed real estate investment trust (“REIT”). Essex owns all of its interest in its real estate and other investments directly or indirectly through Essex Portfolio, L.P. (the “Operating Partnership” or “EPLP”). Essex is the sole general partner of the Operating Partnership and as of December 31, 2024, had an approximately 96.5% general partner interest in the Operating Partnership. In this report, the terms “Company,” “we,” “us,” and “our” also refer to Essex Property Trust, Inc., the Operating Partnership and those entities/subsidiaries owned or controlled by Essex and/or the Operating Partnership.\nEssex has elected to be treated as a REIT for federal income tax purposes commencing with the year ended December 31, 1994. Essex completed its initial public offering on June 13, 1994. In order to maintain compliance with REIT tax rules, the Company utilizes taxable REIT subsidiaries for various revenue generating or investment activities. A domestic taxable REIT subsidiary is subject to federal income tax as a regular C Corporation. All taxable REIT subsidiaries are consolidated by the Company for financial reporting purposes.\nThe Company is engaged primarily in the ownership, operation, management, acquisition, development and redevelopment of predominantly apartment communities, located along the West Coast of the United States. As of December 31, 2024, the Company owned or had ownership interests in 255 operating apartment communities, aggregating 62,157 apartment homes, excluding the Company’s ownership in preferred equity co-investments, loan investments, two operating commercial buildings, and a development pipeline comprised of various predevelopment projects (collectively, the “Portfolio”).\nThe Company’s website address is https://www.essex.com. The Company’s annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports, and the Proxy Statement for its Annual Meeting of Stockholders are available, free of charge, on its website as soon as practicable after the Company files the reports with the U.S. Securities and Exchange Commission (“SEC”). The information contained on the Company’s website shall not be deemed to be incorporated into this report.\nBUSINESS STRATEGIES\nThe following is a discussion of the Company’s business strategies in regards to real estate investment and management.\nBusiness Strategies\nResearch Driven Approach to Investments\n \n–\n The Company believes that successful real estate investment decisions and portfolio growth begin with extensive regional economic research and local market knowledge. The Company continually assesses markets where the Company operates, as well as markets where the Company considers future investment opportunities by evaluating markets and focusing on the following strategic criteria:\n•\nMajor metropolitan areas that have regional population in excess of one million;\n•\nConstraints on new supply driven by: (i) low availability of developable land sites where competing housing could be economically built; (ii) political growth barriers, such as protected land, urban growth boundaries, and potential lengthy and expensive development permit processes; and (iii) natural limitations to development, such as mountains or waterways;\n•\nRental demand enhanced by affordability of rents relative to costs of for-sale housing; and\n•\nHousing demand based on job growth, proximity to jobs, high median incomes and the quality of life including related commuting factors.\nRecognizing that all real estate markets are cyclical, the Company regularly evaluates the results of its regional economic, and local market research, and adjusts the geographic focus of its portfolio accordingly. The Company seeks to increase its portfolio allocation in markets projected to have the strongest local economies and to decrease allocations in markets projected to have declining economic conditions. Likewise, the Company also seeks to increase its portfolio allocation in markets that have attractive property valuations and to decrease allocations in markets that have inflated valuations and low relative yields.\nProperty Operations\n – The Company manages its communities by focusing on activities that may generate above-average rental growth, tenant retention/satisfaction and long-term asset appreciation. The Company intends to achieve this by utilizing the strategies set forth below:\n2\nTable of Contents\n•\nProperty Management\n \n–\n Oversee delivery and quality of the housing provided to our tenants and manage the properties financial performance.\n•\nCapital Preservation – \nThe Company’s asset management services are responsible for the planning, budgeting and completion of major capital improvement projects at the Company’s communities.\n•\nBusiness Planning and Control –\n Comprehensive business plans are implemented in conjunction with significant investment decisions. These plans include benchmarks for future financial performance based on collaborative discussions between property operations teams and the senior leadership team.\n•\nDevelopment and Redevelopment –\n The Company focuses on acquiring and developing apartment communities in supply constrained markets, and redeveloping its existing communities to improve the financial and physical aspects of the Company’s communities.\nCURRENT BUSINESS ACTIVITIES\nAcquisitions of Real Estate Interests\n \nThe table below summarizes acquisition activity for the year ended December 31, 2024 ($ in millions):\nProperty Name\nLocation\nApartment Homes\nEssex Ownership Percentage\nContract Price at Pro Rata Share\nBEXAEW Portfolio\nCA and WA\n1,480 \n100%\n$\n252.0 \n(1)\nMaxwell Sunnyvale\nCA\n75 \n100%\n46.6\n(2)\nARLO Mountain View\nCA\n164 \n100%\n101.1\nPatina at Midtown\nCA\n269 \n100%\n58.4\n(3)\nCentury Towers\nCA\n376 \n100%\n86.8\n(4)\nBEX II Portfolio\nCA\n871 \n100%\n168.4\n(5)\nBeaumont\nWA\n344 \n100%\n136.1\nTotal acquisitions\n3,579 \n \n$\n849.4 \n(1)\nIn March 2024, the Company acquired its joint venture partner's 49.9% interest in the BEXAEW LLC’s (“BEXAEW”) portfolio comprised of four communities for a total purchase price of $505.0 million on a gross basis.  \n(2)\nIn April 2024, the Company accepted the third-party sponsor’s common equity interest affiliated with its $14.7 million preferred equity investment. The community was consolidated on the Company’s financial statements at a $46.6 million valuation.\n(3)\nIn July 2024, the Company acquired its joint venture partner's 49.9% common equity interest in Patina at Midtown for a total purchase price of $117.0 million on a gross basis.  \n(4)\nIn September 2024, the Company acquired its joint venture partner's 50% common equity interest in Century Towers for a total purchase price of $173.5 million on a gross basis. \n(5)\nIn October 2024, the Company acquired its joint venture partner’s 49.9% interest in the BEX II, LLC (“BEX II”) portfolio, comprised of four communities for a total contract price of $337.5 million on a gross basis. \nDispositions of Real Estate Interests\nAs part of its strategic plan to own quality real estate in supply-constrained markets, the Company continually evaluates all of its communities and sells those communities that no longer meet the Company’s strategic criteria. The Company may use the capital generated from the dispositions to invest in higher-return communities, other real estate investments or to fund other commitments. The Company believes that the sale of these communities will not have a material impact on its future results of operations or cash flows nor will the sale of these communities materially affect the Company’s ongoing operations. In general, the Company seeks to offset the dilutive impact on long-term earnings and funds from operations from these dispositions through the positive impact of reinvestment of proceeds.\n3\nTable of Contents\nThe table below summarizes disposition activity for the year ended December 31, 2024 ($ in millions): \nProperty Name\nLocation\nApartment Homes\nSale Price at Pro Rata Share\nHillsdale Garden\nCA\n697 \n$\n205.7 \n(1)\nTotal dispositions\n697 \n$\n205.7 \n(1)\n    In October 2024, the Company sold its 81.5% interest in a consolidated co-investment, Hillsdale Garden, a 697-unit apartment home community, for a contract price of $252.4 million on a gross basis ($205.7 million at pro rata). \nDevelopment Pipeline\nThe Company defines development projects as new communities that are being constructed, or are newly constructed and are in a phase of lease-up and have not yet reached stabilized operations. \nThe Company defines predevelopment projects as proposed communities in negotiation or in the entitlement process with an expected high likelihood of becoming entitled development projects. The Company may also acquire land for future development purposes. As of December 31, 2024, the Company’s development pipeline was comprised of various consolidated predevelopment projects with total incurred costs of $52.7 million. \nLong Term Debt\nDuring 2024, the Company made regularly scheduled principal payments of $3.1 million to its secured mortgage notes payable at an average interest rate of 3.5%.\nIn March 2024, the Operating Partnership issued $350.0 million of senior unsecured notes due on April 1, 2034 with a coupon rate of 5.500% per annum (the \"2034 Notes\"), which are payable on April 1 and October 1 of each year, beginning on October 1, 2024. The 2034 Notes were offered to investors at a price of 99.752% of the principal amount. The 2034 Notes are general unsecured senior obligations of the Operating Partnership, rank equally in right of payment with all other senior unsecured indebtedness of the Operating Partnership and are unconditionally guaranteed by Essex. The Company used the net proceeds of this offering to repay debt maturities, including to fund a portion of the repayment of its outstanding 3.875% senior unsecured notes due May 2024 and for other general corporate and working capital purposes. In August 2024, the Operating Partnership issued an additional $200.0 million of the 2034 Notes at a price of 102.871% of the principal amount, plus accrued interest from and including March 2024, up to, but excluding, the settlement date of August 21, 2024, with an effective yield of 5.110% per annum. These additional notes have substantially identical terms of the 2034 Notes issued in March 2024.\nBank Debt\nAs of December 31, 2024, Moody’s Investor Service and Standard and Poor’s (“S&P”) credit agencies rated Essex Property Trust, Inc. and Essex Portfolio, L.P. Baa1/Stable and BBB+/Stable, respectively.\nAs of December 31, 2024, the Company had two unsecured lines of credit aggregating $1.28 billion. The Company’s $1.2 billion credit facility had an interest rate of Adjusted Secured Overnight Financing Rate (“Adjusted SOFR”) plus 0.765% which is based on a tiered rate structure tied to the Company’s credit ratings, adjusted for the facility’s sustainability metric adjustment feature, and a scheduled maturity date of January 2029 with two six-month extensions, exercisable at the Company’s option. In September 2024, the scheduled maturity date was extended from January 2027 to January 2029. The Company’s $75.0 million working capital unsecured line of credit had an interest rate of Adjusted SOFR plus 0.765%, which is based on a tiered rate structure tied to the Company’s credit ratings, adjusted for the facility’s sustainability metric adjustment feature. Prior to its maturity in July 2024 the line of credit facility was amended such that the line’s capacity was increased from $35.0 million to $75.0 million and the scheduled maturity date was extended to July 2026.\n4\nTable of Contents\nEquity Transactions\nIn August 2024, the Company entered into a new equity distribution agreement pursuant to which the Company may offer and sell shares of its common stock having an aggregate gross sales price of up to $900.0 million (the “2024 ATM Program”). In connection with the 2024 ATM Program, the Company may also enter into related forward sale agreements whereby, at the Company’s discretion, it may sell shares of its common stock under the 2024 ATM Program under forward sale agreements. The use of a forward sale agreement would allow the Company to lock in a share price on the sale of shares of its common stock at the time the agreement is executed, but defer receipt of the proceeds from the sale of shares until a later date.\nThe 2024 ATM Program replaced the prior equity distribution agreement entered into in September 2021 (the “2021 ATM Program”), which was terminated upon the establishment of the 2024 ATM Program. \nDuring the year ended December 31, 2024, the Company did not issue any shares of common stock under the 2024 ATM Program or the 2021 ATM Program. As of December 31, 2024, there were no outstanding forward sale agreements, and $900.0 million of shares remained available to be sold under the 2024 ATM Program. \nIn September 2022, the Company’s Board of Directors approved a stock repurchase plan to allow the Company to acquire shares of common stock up to an aggregate value of $500.0 million. The plan supersedes the Company’s previous common stock repurchase plan announced in December 2015. During the year ended December 31, 2024, the Company did not repurchase any shares. As of December 31, 2024, the Company had $302.7 million of purchase authority remaining under the stock repurchase plan.\nCo-investments\nThe Company has entered into, and may continue in the future to enter into, joint ventures or partnerships (including limited liability companies) through which it owns an indirect economic interest in less than 100% of the community or land or other investments owned directly by the joint venture or partnership. For each joint venture the Company holds a non-controlling interest in the venture and, in most cases, may earn customary management fees, development fees, asset property management fees, and a promote interest.\nThe Company has also made, and may continue in the future to make, preferred equity investments in various multifamily stabilized communities or development projects. The Company earns a preferred rate of return on these investments.\nHUMAN CAPITAL MANAGEMENT\nCompany Overview and Values\nThe Company’s mission is to create quality communities in premier locations and it is critical to the Company’s mission that it attracts, trains and retains a talented and diverse team by providing a compelling place to work and opportunities for professional growth. The Company’s culture supports its mission and is guided by its core values: to act with integrity, to care about what matters, to do right with urgency, to lead at every level and to seek fairness. The Company is headquartered in San Mateo, CA, and has regional corporate offices in Woodland Hills, CA; Irvine, CA and Bellevue, WA. \nAs of December 31, 2024, the Company had 1,715 employees, 99.8% of whom were full-time employees. A total of 1,293 employees worked on-site at our operating communities and 422 worked in our corporate offices. The Company’s employee statistics for 2024 include the following data as of December 31, 2024: the Company’s workforce was comprised of 6 self-identified ethnically diverse groups, making up 71% of our population, 52% of the Company’s managerial employees, and included 29% of its senior executives; there were 204 women in positions of manager or higher, equating to 59% of managerial positions in the Company; the Company’s workforce self-identified as 41% female and 58% male (1% chose not to disclose their gender); and, 55% of the Company’s corporate associates self-identified as female. \nWorkplace Culture\nThe Company believes it has a broad perspective that better serves both the communities it operates in and the associates it employs due to fostering one of the most talented and diverse workforces among its peers in the real estate industry. The Company also supports employee-led resource groups which are open to all employees and intended to foster a sense of community and inclusion for associates at the Company that are intended to engage, educate, enable, and empower the Company’s employees.\n5\nTable of Contents\nTraining and Development\nThe Company values leadership at every level and enables the same by providing opportunities for all associates to develop personal and professional skills through programs that encourage associate retention and advancement. The Company currently offers training courses to its associates via Workday Learning, and its associates spent 13,122 hours learning in 2024. The Company also provides its associates with an annual $3,000 tuition reimbursement to further support outside professional growth opportunities. To identify, retain and reward top performers, the Company engages in meaningful internal succession planning and offers a tenure program, excellence awards, and a bonus recognition program to reward associates for good teamwork, good ideas, and good service. The Company encourages internal promotions and hiring for open positions, and the executive team actively mentors the Company’s top talent to ensure strong leadership at the Company for the future. 38% of the Company’s associates have approached or surpassed the Company’s average tenure of 6.57 years, with 22% reaching beyond 10 years of service.\nEmployee Safety, Health, and Wellness\nSafety is a top priority. The Company deeply cares about the wellbeing of its associates and residents. The Essex Safety Committee, comprised of key stakeholders across departments, meets quarterly and reviews the overall safety of the company in both our corporate offices and our communities. To maximize real-time responses, the Company has also established a working safety subcommittee that meets bi-weekly. The Company has implemented enhanced safety programs, which include a new Workplace Violence Prevention Program enacted companywide in 2024, regular safety inspections, emergency preparedness processes, hazard identification and control protocols, and related associate training.\nThe Company’s safety policies align with its health and wellness goals and seeks to proactively prevent workplace accidents and protect the health, wellness and safety of the Company’s associates through training and analysis of incident reports. Additionally, the Company offers retirement support, associate discount programs, a mental health program (which includes counseling and coaching sessions for mental well-being support at no cost), refresh days for our operations teams, and health benefit credits for participation in wellness programs.\nCompensation and Benefits\nThe Company offers competitive compensation to secure and retain top talent. Alongside competitive pay, the Company is committed to pay parity, and conducts a pay analysis on an annual basis which includes the development and use of a robust, multiple regression analysis model to confirm the Company’s continued achievement of gender pay parity.\nBeyond competitive compensation, the Company offers a suite of benefits, including health insurance, a retirement plan with a $6,000 annual matching potential benefit, life and disability coverage, supplemental paid parental leave, and the robust health and wellness support programs noted above. Additionally, the Company offers an associate housing discount.\nEmployee Engagement\nIn order to engage and promote communication with our associates and solicit meaningful feedback on our efforts to create a positive work environment, the Company issues engagement surveys to all associates to measure 10 key drivers of employee engagement including goal setting, organizational fit, well-being, freedom of opinion, meaningful work, management support and recognition, among others. Engagement surveys are split into three phases: new hire surveys, Company-wide annual surveys, and exit surveys. 90% of Company employees participated in the surveys in 2024. The Company’s overall engagement score on the surveys was 8 out of 10. Goal setting, Performance, and Alignment were recognized as the top three areas of strength for the organization.\nCommunity and Social Impact\nThe Company believes volunteering can create positive change in the communities where our associates live and work and that the Company’s commitment to giving back helps it attract and retain associates. The Company’s volunteer program is aimed at supporting and encouraging eligible associates to become actively involved in their communities through the Company’s support of charity initiatives and offering paid hours for volunteer time. Additionally, the Company’s “Essex Cares” program provides direct aid to the Company’s residents, associates, and local communities.\n6\nTable of Contents\nINSURANCE \nThe Company purchases general liability and property insurance coverage, including loss of rent, for each of its communities. The Company also purchases limited earthquake, terrorism, environmental and flood insurance. There are certain types of losses which may not be covered or could exceed coverage limits. The insurance programs are subject to deductibles and self-insured retentions in varying amounts. The Company utilizes a wholly owned insurance subsidiary, Pacific Western Insurance LLC (“PWI”), to self-insure certain earthquake and property losses. As of December 31, 2024, PWI had cash and marketable securities of $98.9 million, and is consolidated in the Company’s financial statements.\nAll of the Company’s communities are located in areas that are subject to earthquake activity. The Company evaluates its financial loss exposure to seismic events by using actuarial loss models developed by the insurance industry and in most cases property vulnerability analysis based on structural evaluations by seismic consultants. The Company manages this exposure, where considered appropriate, desirable, and cost-effective, by upgrading properties to increase their resistance to forces caused by seismic events, by considering available funds and coverages provided by PWI and/or by purchasing seismic insurance. In most cases the Company also purchases limited earthquake insurance for certain properties owned by the Company’s co-investments.\nIn addition, the Company carries other types of insurance coverage related to a variety of risks and exposures.  \nBased on market conditions, the Company may change or potentially eliminate insurance coverages, or increase levels of self-insurance. Further, the Company may incur losses, which could be material, due to uninsured risks, deductibles and self-insured retentions, and/or losses in excess of coverage limits.\nCOMPETITION\nThere are numerous housing alternatives that compete with the Company’s communities in attracting tenants. These include other apartment communities, condominiums and single-family homes. If the demand for the Company’s communities is reduced or if competitors develop and/or acquire competing housing, rental rates and occupancy may drop which may have a material adverse effect on the Company’s financial condition and results of operations.\nThe Company faces competition from other REITs, businesses and other entities in the acquisition, development and operation of apartment communities. Some competitors are larger and have greater resources than the Company. This competition may result in increased costs of apartment communities the Company acquires and/or develops.\nWORKING CAPITAL\nThe Company believes that cash flows generated by its operations, existing cash and cash equivalents, marketable securities balances, availability under existing lines of credit, access to capital markets and the ability to generate cash from the disposition of real estate are sufficient to meet all of its reasonably anticipated cash needs during 2025.\nThe timing, source and amounts of cash flows provided by financing activities and used in investing activities are sensitive to changes in interest rates, stock price, and other fluctuations in the capital markets environment, which can affect the Company’s plans for acquisitions, dispositions, development and redevelopment activities.\nENVIRONMENTAL CONSIDERATIONS\nAs a real estate owner and operator, we are subject to various federal, state and local environmental laws, regulations and ordinances and may be subject to liability and the costs of removal or remediation of certain potentially hazardous materials that may be present in our communities. See the discussion under the caption, “Risks Related to Our Real Estate Investments and Operations - \nThe Company’s portfolio may have environmental liabilities.\n” in Item 1A, Risk Factors, for information concerning the potential effect of environmental regulations on its operations, which discussion is incorporated by reference into this Item 1.\n7\nTable of Contents\nOTHER MATTERS\nCertain Policies of the Company\nThe Company intends to continue to operate in a manner that will not subject it to regulation under the Investment Company Act of 1940. The Company may in the future (i) issue securities senior to its common stock, (ii) fund acquisition activities with borrowings under its line of credit and (iii) offer shares of common stock and/or units of limited partnership interest in the Operating Partnership or affiliated partnerships as partial consideration for property acquisitions. The Company from time to time acquires partnership interests in partnerships and joint ventures, either directly or indirectly through subsidiaries of the Company, when such entities’ underlying assets are real estate.\nThe Company invests primarily in apartment communities that are located in predominantly coastal markets within Southern California, Northern California, and the Seattle metropolitan area. The Company currently intends to continue to invest in apartment communities in such regions. However, the geographical composition of the portfolio is evaluated periodically and may be modified by management.\n8\nTable of Contents",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis should be read in conjunction with the accompanying consolidated financial statements and notes thereto. These consolidated financial statements include all adjustments which are, in the opinion of management, necessary to reflect a fair statement of the results and all such adjustments are of a normal recurring nature.\nOVERVIEW\nEssex is a self-administered and self-managed REIT that acquires, develops, redevelops, and manages apartment communities in selected residential areas located on the West Coast of the United States. Essex owns all of its interests in its real estate investments, directly or indirectly, through the Operating Partnership. Essex is the sole general partner of the Operating Partnership and, as of December 31, 2024, had an approximately 96.5% general partner interest in the Operating Partnership.\nThe Company’s investment strategy has two components: constant monitoring of existing markets, and evaluation of new markets to identify areas with the characteristics that underlie rental growth. The Company’s strong financial condition supports its investment strategy by enhancing its ability to quickly shift acquisition, development, redevelopment, and disposition activities to markets that will optimize the performance of the Company’s portfolio.\nAs of December 31, 2024, the Company owned or had ownership interests in 255 operating apartment communities, comprising 62,157 apartment homes, excluding the Company’s ownership in preferred equity co-investments, loan investments, and two operating commercial buildings.\nThe Company’s apartment communities are predominately located in the following major regions:\nSouthern California\n (primarily Los Angeles, Orange, San Diego, and Ventura counties)\nNorthern California\n (the San Francisco Bay Area)\nSeattle Metro\n (Seattle metropolitan area)\nBy region, the Company’s operating results for 2024 and 2023 and projection for 2025 new housing supply (defined as new multifamily apartment homes and single family homes, excluding developments with fewer than 50 apartment homes as well as student, senior and 100% affordable housing) are as follows:\nSouthern California Region\n: As of December 31, 2024, this region represented 44% of the Company’s consolidated operating apartment homes. Revenues for “2024 Same-Properties” (as defined below), or “Same-Property revenues,” increased 4.0% in 2024 as compared to 2023. \n \nNorthern California Region\n: As of December 31, 2024, this region represented 36% of the Company’s consolidated operating apartment homes. 2024 Same-Property revenues increased 2.6% in 2024 as compared to 2023. \n \nSeattle Metro Region\n:\n As of December 31, 2024, this region represented 20% of the Company’s consolidated operating apartment homes. 2024 Same-Property revenues increased 2.9% in 2024 as compared to 2023. \nIn each of these regions, projected 2025 growth in new residential supply of apartment homes and single family homes is expected to be 1% or less of the total housing stock.  \nThe Company’s consolidated operating communities as of December 31, 2024 and 2023 were as follows:\nDecember 31, 2024\nDecember 31, 2023\n \nApartment Homes\n%\nApartment Homes\n%\nSouthern California\n23,817 \n44 \n%\n21,986 \n43 \n%\nNorthern California\n19,747 \n36 \n%\n19,245 \n37 \n%\nSeattle Metro\n10,899 \n20 \n%\n10,341 \n20 \n%\nTotal\n54,463 \n100 \n%\n51,572 \n100 \n%\nCo-investments, including Wesco I, Wesco III, Wesco IV, Wesco V, Wesco VI, BEX IV, and other co-investments, developments under construction, and preferred equity interest co-investment communities are not included in the table presented above for both periods. The communities previously held in the BEXAEW, BEX II, Patina at Midtown, and Century \n38\nTable of Contents\nTowers co-investments, which were consolidated in 2024, are excluded from the table as December 31, 2023 but included in the table as of December 31, 2024.\nMarket Considerations\nElevated inflation in recent years has caused an increase in consumer prices, thereby reducing purchasing power and elevating the risks of a recession. In response to increased inflation, the U.S. Federal Reserve raised the federal funds rate throughout 2022 and 2023 resulting in a significant increase of market interest rates. In the second half of 2024, the U.S. Federal Reserve lowered the federal funds rate in conjunction with the softening of U.S. inflation and short term market interest rates have declined. Concurrently, geopolitical tensions and regional conflicts have increased uncertainty during recent years. The long-term impact of these developments will largely depend on the impact on job growth, the broader economy, and reactions by consumers, companies, governmental entities and capital markets.\nThe foregoing macroeconomic conditions have not negatively impacted the Company’s ability to access traditional funding sources on the same or reasonably similar terms as were available in recent periods prior to the pandemic, as demonstrated by the Company’s financing activity during the year ended December 31, 2024 discussed in the “Liquidity and Capital Resources” section below. The Company is not at material risk of not meeting the covenants in its credit agreements and is able to timely service its debt and other obligations\n.\nRESULTS OF OPERATIONS\nComparison of Year Ended December 31, 2024 to the Year Ended December 31, 2023 \nThe average financial occupancy for the Company’s 2024 Same-Property portfolio (stabilized properties consolidated by the Company for the years ended December 31, 2024 and 2023) was 96.1% and 96.5% for the years ended December 31, 2024 and 2023, respectively. Financial occupancy is defined as the percentage resulting from dividing actual rental income by total scheduled rental income. Actual rental income represents contractual rental income pursuant to leases without considering delinquency and concessions. Total scheduled rental income represents the value of all apartment homes, with occupied apartment homes valued at contractual rental rates pursuant to leases and vacant apartment homes valued at estimated market rents. The Company believes that financial occupancy is a meaningful measure of occupancy because it considers the value of each vacant apartment home at its estimated market rate.\nMarket rates are determined using the recently signed effective rates on new leases at the property and are used as the starting point in the determination of the market rates of vacant apartment homes. The Company may increase or decrease these rates based on a variety of factors, including overall supply and demand for housing, concentration of new apartment deliveries within the same submarket which can cause periodic disruption due to greater rental concessions to increase leasing velocity, and rental affordability. Financial occupancy may not completely reflect short-term trends in physical occupancy and financial occupancy rates, and the Company’s calculation of financial occupancy may not be comparable to financial occupancy disclosed by other REITs.\nThe Company does not take into account delinquency and concessions to calculate actual rent for occupied apartment homes and market rents for vacant apartment homes. The calculation of financial occupancy compares contractual rates for occupied apartment homes to estimated market rents for unoccupied apartment homes, and thus the calculation compares the gross value of all apartment homes excluding delinquency and concessions. For apartment communities that are development properties in lease-up without stabilized occupancy figures, the Company believes the physical occupancy rate is the appropriate performance metric. While an apartment community is in the lease-up phase, the Company’s primary motivation is to stabilize the property, which may entail the use of rent concessions and other incentives, and thus financial occupancy, which is based on contractual income, is not considered the best metric to quantify occupancy.\nThe regional breakdown of the Company’s 2024 Same-Property portfolio for financial occupancy for the years ended December 31, 2024 and 2023 was as follows:\nYear Ended December 31,\n \n2024\n2023\nSouthern California\n95.8 \n%\n96.3 \n%\nNorthern California\n96.3 \n%\n96.5 \n%\nSeattle Metro\n96.7 \n%\n96.6 \n%\n39\nTable of Contents\nThe following table provides a breakdown of property revenue amounts, including the revenues attributable to 2024 Same-Properties ($ in thousands):\nNumber of Apartment Homes\nYear Ended\nDecember 31,\nDollar Change\nPercentage Change\n2024\n2023\n2024 Same-Properties:\nSouthern California\n21,573 \n$\n697,394 \n$\n670,475 \n$\n26,919 \n4.0 \n%\nNorthern California\n18,273 \n648,843 \n632,440 \n16,403 \n2.6 \n%\nSeattle Metro\n10,341 \n290,294 \n282,092 \n8,202 \n2.9 \n%\nTotal 2024 Same-Property Revenues\n50,187 \n1,636,531 \n1,585,007 \n51,524 \n3.3 \n%\n2024 Non-Same Property Revenues\n \n127,654 \n73,257 \n54,397 \n74.3 \n%\nTotal Property Revenues\n \n$\n1,764,185 \n$\n1,658,264 \n$\n105,921 \n6.4 \n%\n  \n2024 Same-Property Revenues\n increased by $51.5 million or 3.3%. The increase was primarily attributable to increases of 1.9% in average rental rates from $2,605 for 2023 to $2,655 for 2024, 0.8% in other property income, and 0.9% from a decrease in delinquencies, partially offset by a decrease of 0.4% in occupancy.\n2024 Non-Same Property Revenues\n increased by $54.4 million or 74.3% to $127.7 million in 2024 compared to $73.3 million in 2023. The increase was primarily due to acquisitions of Hacienda at Camarillo Oaks in 2023, as well as the acquisitions of ARLO Mountain View, Maxwell Sunnyvale, and Beaumont, and the acquisition of the Company’s joint venture partner’s interests in the BEXAEW and BEX II portfolios, Patina at Midtown, and Century Towers in 2024. The increases were partially offset by the sale of Hillsdale Garden in 2024. \nProperty operating expenses, excluding real estate taxes\n increased by $26.4 million or 8.8% to $326.1 million in 2024 compared to $299.7 million in 2023, primarily due to increases of $10.6 million in utilities expenses, $7.8 million in administrative expenses, $7.3 million in personnel costs, and $0.7 million in maintenance and repairs expenses. 2024 Same-Property operating expenses, excluding real estate taxes, increased by $19.5 million or 6.7% to $308.8 million in 2024 compared to $289.3 million in 2023, primarily due to increases of $7.5 million in utilities expenses, $6.9 million in insurance and other expenses, $4.5 million in personnel costs, and $1.3 million in administrative expenses, offset by a decrease of $0.7 million in maintenance and repairs expenses.\nReal estate taxes\n increased by $7.6 million or 4.1% to $193.4 million in 2024 compared to $185.8 million in 2023, primarily due to increases in tax rates in California and the Seattle Metro region and due to the purchase of Hacienda at Camarillo Oaks in 2023 and acquisitions in 2024. 2024 Same-Property real estate taxes increased by $3.4 million or 1.9% to $179.8 million in 2024 compared to $176.4 million in 2023 primarily due to increases in tax rates in California and\nthe Seattle Metro region.\nDepreciation and amortization expense\n increased by $31.8 million or 5.8% to $580.2 million in 2024 compared to $548.4 million in 2023, primarily due to acquisitions in 2023 and 2024. These increases were offset by the sale of CBC and The Sweeps in 2023 and Hillsdale Garden in 2024.\nGain on sale of real estate and land\n of $175.6 million in 2024 was attributable to the sale of Hillsdale Garden in 2024.\nInterest expense \nincreased by $22.6 million or 10.6% to $235.5 million in 2024 compared to $212.9 million in 2023\n,\n primarily due to the issuance of $550.0 million senior unsecured notes in 2024 which resulted in an increase in interest expense of $20.1 million. The increase was also due to borrowing on the $300.0 million unsecured term loan in April 2023, the $298.0 million of 10-year secured loans closed in July 2023, and increased borrowing on the Company’s unsecured lines of credit in 2024 resulting in a $16.2 million increase in interest expense. Additionally, there was a $0.6 million decrease in capitalized interest in 2024, due to a decrease in development activity as compared to the same period in 2023. These increases in interest expense were partially offset by regular principal payments and various debts that matured or were paid off, primarily due to the pay off of the $300.0 million of senior unsecured notes due May 1, 2023 and $400.0 million of senior unsecured notes due May 1, 2024 during and after 2023, which resulted in a decrease in interest expense of $14.3 million for 2024.\nInterest and other income\n increased by $34.7 million or 74.9% to $81.0 million in 2024 compared to $46.3 million in 2023, primarily due to increases of $34.8 million in legal settlements and $1.3 million in interest income, offset by a decrease of $1.7 million in realized and unrealized gains on marketable securities.\n40\nTable of Contents\nEquity income from co-investments\n increased by $37.6 million or 354.7% to $48.2 million in 2024 compared to $10.6 million in 2023, primarily due to a decrease of $30.0 million in impairment losses from unconsolidated co-investments, increases of $8.7 million in equity income from non-core co-investments, $1.5 million in co-investment promote income, and a decrease of $4.8 million in equity loss from co-investments. These increases were offset by a decrease of $6.5 million in income from preferred equity investments, including income from early redemption of preferred equity investments.\nGain on remeasurement of co-investments\n of $210.6 million resulted from the Company's acquisition of its joint venture partner's interests in the BEXAEW and BEX II portfolios, Patina at Midtown and Century Towers.\nComparison of Year Ended December 31, 2023 to the Year Ended December 31, 2022 \nFor the comparison of the years ended December 31, 2023 and December 31, 2022, refer to Part II, Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations, on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on February 23, 2024 under the subheading “Comparison of Year Ended December 31, 2023 to the Year Ended December 31, 2022.”\nLiquidity and Capital Resources \nThe following table sets forth the Company’s cash flows for the periods presented ($ in thousands):\nYear Ended December 31,\n \n2024\n2023\n2022\nCash flow provided by (used in):\nOperating activities\n$\n1,068,305 \n$\n980,064 \n$\n975,649 \nInvesting activities\n$\n(973,051)\n$\n(145,140)\n$\n145,958 \nFinancing activities\n$\n(419,742)\n$\n(477,271)\n$\n(1,137,564)\nEssex’s business is operated primarily through the Operating Partnership. Essex issues public equity from time to time, but does not otherwise generate any capital itself or conduct any business itself, other than incurring certain expenses from operating as a public company which are fully reimbursed by the Operating Partnership.\nEssex itself does not hold any indebtedness, and its only material asset is its ownership of partnership interests of the Operating Partnership. Essex’s principal funding requirement is the payment of dividends on its common stock. Essex’s sole source of funding for its dividend payments is distributions it receives from the Operating Partnership.\nAs of December 31, 2024, Essex owned a 96.5% general partner interest and the limited partners owned the remaining 3.5% interest in the Operating Partnership.\nThe liquidity of Essex is dependent on the Operating Partnership’s ability to make sufficient distributions to Essex. The primary cash requirement of Essex is its payment of dividends to its stockholders. Essex also guarantees some of the Operating Partnership’s debt, as discussed further in Note 7, “Unsecured Debt”, and Note 8, “Mortgage Notes Payable”, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K. If the Operating Partnership fails to fulfill certain of its debt requirements, which trigger Essex’s guarantee obligations, then Essex will be required to fulfill its cash payment commitments under such guarantees. However, Essex’s only significant asset is its investment in the Operating Partnership.\nFor Essex to maintain its qualification as a REIT, it must pay dividends to its stockholders aggregating annually at least 90% of its REIT taxable income, excluding net capital gains. While historically Essex has satisfied this distribution requirement by making cash distributions to its stockholders, it may choose to satisfy this requirement by making distributions of other property, including, in limited circumstances, Essex’s own stock. As a result of this distribution requirement, the Operating Partnership cannot rely on retained earnings to fund its ongoing operations to the same extent that other companies whose parent companies are not REITs can. Essex may need to continue to raise capital in the equity markets to fund the Operating Partnership’s working capital needs, acquisitions and developments.\nAs of December 31, 2024, the Company had $66.8 million of unrestricted cash and cash equivalents and $69.8 million in marketable securities, all of which were equity securities. The Company believes that cash flows generated by its operations, existing cash and cash equivalents, marketable securities balances and availability under existing lines of credit are sufficient to \n41\nTable of Contents\nmeet all of its anticipated cash needs during 2025. Additionally, the capital markets continue to be available and the Company is able to generate cash from the disposition of real estate assets to finance additional cash flow needs, including continued development and select acquisitions. In the event that economic disruptions occur, the Company may further utilize other resources such as its cash reserves, lines of credit, or decreased investment in redevelopment activities to supplement operating cash flows. The timing, source and amounts of cash flows provided by financing activities and used in investing activities are sensitive to changes in interest rates and other fluctuations in the capital markets environment, which can affect the Company’s plans for acquisitions, dispositions, development and redevelopment activities.\nAs of December 31, 2024, Moody’s Investor Service and Standard and Poor’s (“S&P”) credit agencies rated Essex Property Trust, Inc. and Essex Portfolio, L.P. Baa1/Stable and BBB+/Stable, respectively.\nAs of December 31, 2024, the Company had $5.2 billion of fixed rate public bonds outstanding at an average interest rate of 3.4% with maturity dates ranging from 2025 to 2050.\nAs of December 31, 2024, the Company’s mortgage notes payable totaled $989.9 million, net of unamortized premiums and debt issuance costs, which consisted of $674.1 million in fixed rate debt at an average interest rate of 4.3% with maturity dates ranging from 2025 to 2033 and $315.8 million of variable rate debt at an average interest rate of 4.2% with maturity dates ranging from 2026 to 2046. A total of $220.8 million of variable rate debt is tax-exempt demand notes which are subject to total return swaps and $95.0 million of variable rate mortgage notes payable has an interest rate swap that effectively converts $47.5 million to an all-in fixed rate of 2.83%.\nAs of December 31, 2024, the Company had two unsecured lines of credit aggregating $1.28 billion, including a $1.2 billion unsecured line of credit and a $75.0 million working capital unsecured line of credit. As of December 31, 2024, there was $75.0 million outstanding on the $1.2 billion unsecured line of credit. The underlying interest rate is based on a tiered rate structure tied to the Company’s credit ratings, adjusted for the Company’s sustainability metric adjustment feature, and was at the Adjusted SOFR plus 0.765% as of December 31, 2024. This facility is scheduled to mature in January 2029, with two six-month extensions, exercisable at the Company’s option. As of December 31, 2024, there was $62.9 million outstanding on the Company’s $75.0 million working capital unsecured line of credit. The underlying interest rate on the $75.0 million line is based on a tiered rate structure tied to the Company’s credit ratings, adjusted for the Company’s sustainability metric adjustment feature, and was at the Adjusted SOFR plus 0.765% as of December 31, 2024. This facility is scheduled to mature in July 2026.\nThe Company’s unsecured lines of credit and unsecured debt agreements contain debt covenants related to limitations on indebtedness and liabilities and maintenance of minimum levels of consolidated earnings before depreciation, interest and amortization. The Company was in compliance with the debt covenants as of December 31, 2024 and 2023.\nThe Company pays quarterly dividends from cash available for distribution. Until it is distributed, cash available for distribution is invested by the Company primarily in investment grade securities held available for sale or is used by the Company to reduce balances outstanding under its lines of credit.\nDerivative Activity\nThe Company uses interest rate swaps, interest rate caps, and total return swap contracts to manage certain interest rate risks. The valuation of these instruments is determined using widely accepted valuation techniques including discounted cash flow analysis on the expected cash flows of each derivative. This analysis reflects the contractual terms of the derivatives, including the period to maturity, and uses observable market-based inputs, including interest rate curves. The fair values of interest rate swaps and total return swaps are determined using the market standard methodology of netting the discounted future fixed cash receipts (or payments) and the discounted expected variable cash payments (or receipts). The variable cash payments (or receipts) are based on an expectation of future interest rates (forward curves) derived from observable market interest rate curves. The Company incorporates credit valuation adjustments to appropriately reflect both its own nonperformance risk and the respective counterparty’s nonperformance risk in the fair value measurements.\n \nThe Company has four total return swap contracts, with an aggregate notional amount of $220.8 million, that effectively converts $220.8 million of fixed mortgage notes payable to a floating interest rate based on the Securities Industry and Financial Markets Association Municipal Swap Index (“SIFMA”) plus a spread. The total return swaps provide fair market value protection on the mortgage notes payable to our counterparties during the initial period of the total return swap until the Company’s option to call the mortgage notes at par can be exercised. The Company can currently call all four of the total return swaps, with $220.8 million of the outstanding debt at par. These derivatives do not qualify for hedge accounting. The aggregate carrying and fair value of the total return swaps was zero at both December 31, 2024 and 2023.\n42\nTable of Contents\nAs of December 31, 2024 and 2023 the aggregate carrying value of the interest rate swap contracts are an asset of $5.5 million and $4.3 million, respectively, and is included in prepaid expenses and other assets in the consolidated balance sheets. \nThe Company had no interest rate cap agreements as of December 31, 2024 and 2023, respectively.\nHedge ineffectiveness related to cash flow hedges, which is reported in current year income as interest expense, net was zero for the years ended December 31, 2024, 2023 and 2022.\nIssuance of Common Stock\nIn August 2024, the Company entered into the 2024 ATM Program. In connection with the 2024 ATM Program, the Company may also enter into related forward sale agreements whereby, at the Company's discretion, it may sell shares of its common stock under the 2024 ATM Program under forward sale agreements. The use of a forward sale agreement would allow the Company to lock in a share price on the sale of shares of its common stock at the time the agreement is executed, but defer receipt of the proceeds from the sale of shares until a later date. \nThe 2024 ATM Program replaced the 2021 ATM Program, which was terminated upon the establishment of the 2024 ATM Program. For the years ended December 31, 2024, 2023 and 2022, the Company did not sell any shares of common stock through the 2024 ATM Program nor 2021 ATM Program. As of December 31, 2024, there were no outstanding forward purchase agreements, and $900.0 million of shares of common stock remained available to be sold under the 2024 ATM Program.\nCapital Expenditures\nNon-revenue generating capital expenditures are improvements and upgrades that extend the useful life of the property. For the year ended December 31, 2024, non-revenue generating capital expenditures averaged approximately $2,109 per apartment home. These expenditures do not include expenditures for deferred maintenance on acquisition properties, expenditures for property renovations and improvements which are expected to generate additional revenue or cost savings, and do not include expenditures incurred due to changes in government regulations that the Company would not have incurred otherwise, retail, furniture and fixtures, or expenditures for which the Company has been reimbursed or expects to be reimbursed. The Company expects that cash from operations and/or its lines of credit will fund such expenditures.\nDevelopment and Predevelopment Pipeline\nThe Company defines development projects as new communities that are being constructed, or are newly constructed and are in a phase of lease-up and have not yet reached stabilized operations. \n \nThe Company defines predevelopment projects as proposed communities in negotiation or in the entitlement process with an expected high likelihood of becoming entitled development projects. The Company may also acquire land for future development purposes or sale. As of December 31, 2024, the Company’s development and predevelopment pipeline was comprised of various consolidated predevelopment projects, with total incurred costs of $52.7 million. \n \nThe Company expects to fund the development and predevelopment communities by using a combination of some or all of the following sources: its working capital, amounts available on its lines of credit, construction loans, net proceeds from public and private equity and debt issuances, and proceeds from the disposition of assets, if any.\nAlternative Capital Sources\nThe Company utilizes co-investments as an alternative source of capital for acquisitions of both operating and development communities. As of December 31, 2024, the Company had an interest in 7,694 apartment homes in operating communities with joint ventures and technology co-investments for a total book value of $379.5 million.\n43\nTable of Contents\nReal Estate and Other Commitments\nThe following table summarizes the Company’s unfunded real estate and other future commitments as of December 31, 2024 ($ in thousands):\nNumber of Properties\nInvestment\nRemaining Commitment\nJoint ventures :\nPreferred equity investments\n1 \n$\n85,000 \n$\n35,000 \nNon-core co-investments\n— \n86,000 \n34,465 \n \n$\n171,000 \n$\n69,465 \nAs of December 31, 2024, the Company had operating lease commitments of $125.1 million for ground, building and garage leases with maturity dates ranging from 2025 to 2083. $6.4 million of these commitments are due within the next twelve months.\nVariable Interest Entities\nIn accordance with accounting standards for consolidation of variable interest entities (“VIEs”), the Company consolidated the Operating Partnership, 18 DownREIT entities (comprising nine communities) and five co-investments as of December 31, 2024. As of December 31, 2023, the Company consolidated the Operating Partnership, 18 DownREIT entities (comprising nine communities) and six co-investments. The Company consolidates these entities because it is deemed the primary beneficiary. Essex has no assets or liabilities other than its investment in the Operating Partnership. The consolidated total assets and liabilities related to the above consolidated co-investments and DownREIT entities, net of intercompany eliminations, were $893.0 million and $319.1 million, respectively, as of December 31, 2024, and $956.7 million and $324.5 million, respectively, as of December 31, 2023. Noncontrolling interests in these entities were $105.1 million and $121.1 million as of December 31, 2024 and 2023, respectively. The Company’s financial risk in each VIE is limited to its equity investment in the VIE. As of December 31, 2024, the Company was not deemed to be the primary beneficiary of any other VIEs.\nCritical Accounting Estimates\nThe preparation of consolidated financial statements, in accordance with U.S. GAAP, requires the Company to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosures of contingent assets and liabilities. The Company defines critical accounting estimates as those that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on the financial condition or results of operations of the Company. The Company’s critical accounting estimates relate principally to the following key areas: (i) accounting for the acquisition of investments in real estate; and (ii) evaluation of events and changes in circumstances indicating that the carrying value of any of the Company’s rental properties may not be recoverable.\nThe Company accounts for its acquisitions of investments in real estate by assessing each acquisition to determine if it meets the definition of a business or if it qualifies as an asset acquisition. We expect that acquisitions of individual operating communities will generally be viewed as asset acquisitions, and result in the capitalization of acquisition costs, and the allocation of purchase price to the assets acquired and liabilities assumed based on the relative fair value of the respective assets and liabilities.\nIn making estimates of fair values for purposes of allocating purchase price, the Company utilizes a number of sources, including independent land appraisals which consider comparable market transactions, its own analysis of recently acquired or developed comparable properties in our portfolio for land comparables and building replacement costs, and other publicly available market data. In calculating the fair value of identified intangible assets of an acquired property, the in-place leases are valued based on in-place rent rates and amortized over the average remaining term of all acquired leases. The allocation of the total consideration exchanged for a real estate acquisition between the identifiable assets and liabilities and the depreciation we recognize over the estimated useful life of the asset could be impacted by different assumptions and estimates used in the calculation. The reasonable likelihood that the estimate could have a material impact on the financial condition of the Company is based on the total consideration exchanged for real estate during any given year. \nThe Company periodically assesses its real estate investments for events or changes in circumstances that indicate the carrying value may not be recoverable. The judgments regarding the existence of impairment indicators are based on monitoring investment market conditions and performance for operating properties including the net operating income for the most recent \n44\nTable of Contents\n12 month period, monitoring estimated costs for properties under development, the Company’s ability to hold and its intent with regard to each asset, and each property’s remaining useful life. Although each of these may result in an impairment indicator, the shortening of an expected holding period due to the potential sale of a property is the most likely impairment indicator. Whenever events or changes in circumstances indicate that the carrying amount of a property held for investment may not be fully recoverable, the carrying amount is evaluated. If the sum of the property’s expected future cash flows (undiscounted and without interest charges) is less than the carrying amount of the property, then the Company will recognize an impairment loss equal to the excess of the carrying amount over the fair value of the property. Changes in operating and market conditions may result in a change of our intent to hold the property through the end of its useful life and may impact the assumptions utilized to determine the future cash flows of the real estate investment.\nThe Company bases its accounting estimates on historical experience, current market conditions and various other assumptions that are believed to be reasonable under the circumstances. Actual results may vary from those estimates made by management and those estimates could be different under different assumptions or conditions.\nFunds from Operations Attributable to Common Stockholders and Unitholders \nFunds from Operations Attributable to Common Stockholders and Unitholders (“FFO”) is a financial measure that is commonly used in the REIT industry. The Company presents FFO and FFO excluding non-core items (referred to as “Core FFO”) as supplemental operating performance measures. FFO and Core FFO are not used by the Company as, nor should they be considered to be, alternatives to net income computed under U.S. GAAP as an indicator of the Company’s operating performance or as alternatives to cash from operating activities computed under U.S. GAAP as an indicator of the Company’s ability to fund its cash needs.\nFFO and Core FFO are not meant to represent a comprehensive system of financial reporting and do not present, nor do they intend to present, a complete picture of the Company’s financial condition and operating performance. The Company believes that net income computed under U.S. GAAP is the primary measure of performance and that FFO and Core FFO are only meaningful when they are used in conjunction with net income. \nThe Company considers FFO and Core FFO to be useful financial performance measurements of an equity REIT because, together with net income and cash flows, FFO and Core FFO provide investors with additional bases to evaluate operating performance and ability of a REIT to incur and service debt and to fund acquisitions and other capital expenditures and to pay dividends. By excluding gains or losses related to sales of depreciated operating properties and land, excluding real estate depreciation (which can vary among owners of identical assets in similar condition based on historical cost accounting and useful life estimates) and excluding impairment write-downs from operating real estate and unconsolidated co-investments driven by a measurable decrease in the fair value of real estate held by the co-investment, FFO can help investors compare the operating performance of a real estate company between periods or as compared to different companies. By further adjusting for items that are not considered part of the Company’s core business operations, Core FFO allows investors to compare the core operating performance of the Company to its performance in prior reporting periods and to the operating performance of other real estate companies without the effect of items that by their nature are not comparable from period to period and tend to obscure the Company’s actual operating results. The Company believes that its consolidated financial statements, prepared in accordance with U.S. GAAP, provide the most meaningful picture of its financial condition and its operating performance.\n \nIn calculating FFO, the Company follows the definition for this measure published by NAREIT, which is the leading REIT industry association. The Company believes that, under the NAREIT FFO definition, the two most significant adjustments made to net income are (i) the exclusion of historical cost depreciation and (ii) the exclusion of gains and losses from the sale of previously depreciated properties. The Company agrees that these two NAREIT adjustments are useful to investors for the following reasons:\n \n(a)\nhistorical cost accounting for real estate assets in accordance with U.S. GAAP assumes, through depreciation charges, that the value of real estate assets diminishes predictably over time. NAREIT stated in its White Paper on Funds from Operations “since real estate asset values have historically risen or fallen with market conditions, many industry investors have considered presentations of operating results for real estate companies that use historical cost accounting to be insufficient by themselves.” Consequently, NAREIT’s definition of FFO reflects the fact that real estate, as an asset class, generally appreciates over time and depreciation charges required by U.S. GAAP do not reflect the underlying economic realities.\n45\nTable of Contents\n(b)\nREITs were created as a legal form of organization in order to encourage public ownership of real estate as an asset class through investment in firms that were in the business of long-term ownership and management of real estate.  The exclusion, in NAREIT’s definition of FFO, of gains and losses from the sales of previously depreciated operating real estate assets allows investors and analysts to readily identify the operating results of the long-term assets that form the core of a REIT’s activity and assists in comparing those operating results between periods.\nManagement believes that it has consistently applied the NAREIT definition of FFO to all periods presented. However, there is judgment involved and other REITs’ calculation of FFO may vary from the NAREIT definition for this measure, and thus their disclosure of FFO may not be comparable to the Company’s calculation.\n46\nTable of Contents\nThe table below is a reconciliation of net income available to common stockholders to FFO and Core FFO for the periods presented ($ in thousands, except per share amounts).\nYear Ended December 31,\n \n2024\n2023\n2022\nNet income available to common stockholders\n$\n741,522 \n$\n405,825 \n$\n408,315 \nAdjustments:\nDepreciation and amortization\n580,220 \n548,438 \n539,319 \nGains not included in FFO\n(386,138)\n(59,238)\n(111,839)\nCasualty loss\n— \n433 \n— \nImpairment loss from unconsolidated co-investments\n3,726 \n33,700 \n2,105 \nDepreciation and amortization from unconsolidated co-investments\n66,943 \n71,745 \n72,585 \nNoncontrolling interest related to Operating Partnership units\n26,414 \n14,284 \n14,297 \nDepreciation attributable to third party ownership and other \n(1)\n31,191 \n(1,474)\n(1,421)\nFunds from operations attributable to common stockholders and unitholders\n$\n1,063,878 \n$\n1,013,713 \n$\n923,361 \nFFO per share-diluted\n$\n15.99 \n$\n15.24 \n$\n13.70 \nNon-core items:\n \n \n \nExpensed acquisition and investment related costs\n$\n72 \n$\n595 \n$\n2,132 \nTax (benefit) expense on unconsolidated co-investments \n(2)\n(929)\n697 \n(10,236)\nRealized and unrealized (gains) losses on marketable securities, net\n(8,347)\n(10,006)\n45,547 \nProvision for credit losses\n(179)\n70 \n(381)\nEquity (income) loss from non-core co-investments \n(3)\n(10,344)\n(1,685)\n38,045 \n  Loss on early retirement of debt, net \n— \n— \n2 \nLoss on early retirement of debt from unconsolidated co-investment\n— \n— \n988 \nCo-investment promote income\n(1,531)\n— \n(17,076)\nIncome from early redemption of preferred equity investments and notes receivable\n— \n(285)\n(1,669)\nGeneral and administrative and other, net \n(4)\n39,341 \n6,629 \n2,536 \nInsurance reimbursements, legal settlements, and other, net \n(5)\n(43,794)\n(9,821)\n(5,392)\nCore funds from operations attributable to common stockholders and unitholders\n$\n1,038,167 \n$\n999,907 \n$\n977,857 \nCore FFO per share-diluted\n$\n15.60 \n$\n15.03 \n$\n14.51 \nWeighted average number of shares outstanding, diluted \n(6)\n66,533,908 \n66,514,456 \n67,374,526 \n(1)\nThe Company consolidates certain co-investments. The noncontrolling interest’s share of net operating income in these investments for the years ended December 31, 2024, 2023 and 2022 were $2.9 million, $3.3 million, and $3.3 million, respectively. For the year ended December 31, 2024, the amount includes $32.4 million of gain on sale attributable to noncontrolling interest.\n(2)\nRepresents tax related to net unrealized gains or losses on technology co-investments.\n(3)\nRepresents the Company’s share of co-investment income or loss from technology co-investments.\n(4)\nIncludes political advocacy costs of $33.3 million, $4.1 million, and $1.9 million for the years ended December 31, 2024, 2023 and 2022 respectively.\n(5)\nIncludes legal settlement gains of $42.5 million, $7.7 million, and $4.2 million for the for the years ended December 31, 2024, 2023 and 2022 respectively.\n(6)\nAssumes conversion of all outstanding OP Units into shares of the Company’s common stock and excludes DownREIT limited partnership units. \n47\nTable of Contents\nNet Operating Income\nNet operating income (“NOI”) and Same-Property NOI are considered by management to be important supplemental performance measures to earnings from operations included in the Company’s consolidated statements of income. The presentation of Same-Property NOI assists with the presentation of the Company’s operations prior to the allocation of depreciation and any corporate-level or financing-related costs. NOI reflects the operating performance of a community and allows for an easy comparison of the operating performance of individual communities or groups of communities. In addition, because prospective buyers of real estate have different financing and overhead structures, with varying marginal impacts to overhead by acquiring real estate, NOI is considered by many in the real estate industry to be a useful measure for determining the value of a real estate asset or group of assets. The Company defines Same-Property NOI as Same-Property revenues less Same-Property operating expenses, including property taxes. Please see the reconciliation of earnings from operations to NOI and Same-Property NOI, which in the table below is the NOI for stabilized properties consolidated by the Company for the periods presented ($ in thousands):\nYear Ended December 31,\n \n2024\n2023\n2022\nEarnings from operations\n$\n703,095 \n$\n584,342 \n$\n595,229 \nAdjustments:\n \n \n \nCorporate-level property management expenses\n48,218 \n45,872 \n40,704 \nDepreciation and amortization\n580,220 \n548,438 \n539,319 \nManagement and other fees from affiliates\n(10,265)\n(11,131)\n(11,139)\nGeneral and administrative\n98,902 \n63,474 \n56,577 \nExpensed acquisition and investment related costs\n72 \n595 \n2,132 \nCasualty loss\n— \n433 \n— \nGain on sale of real estate and land\n(175,583)\n(59,238)\n(94,416)\nNOI\n1,244,659 \n1,172,785 \n1,128,406 \nLess: Non Same-Property NOI\n(96,666)\n(53,485)\n(59,321)\nSame-Property NOI\n$\n1,147,993 \n$\n1,119,300 \n$\n1,069,085 \nForward-Looking Statements\nCertain statements in this “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and elsewhere in this Annual Report on Form 10-K which are not historical facts may be considered forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements regarding the Company’s expectations, estimates, assumptions, hopes, intentions, beliefs and strategies regarding the future. Words such as “expects,” “assumes,” “anticipates,” “may,” “will,” “intends,” “plans,” “projects,” “believes,” “seeks,” “future,” “estimates,” and variations of such words and similar expressions are intended to identify such forward-looking statements. Such forward-looking statements include, among other things, statements regarding expected operating performance and results (including projected Same-Property revenues and expenses), qualification as a REIT under the Internal Revenue Code of 1986, as amended, property stabilizations, property acquisition and disposition activity, joint venture and co-investment activity, development and redevelopment activity and other capital expenditures, capital raising and financing activity, revenue and expense growth, financial occupancy, interest rate and other economic expectations, included projected new housing supply.\nWhile the Company’s management believes the assumptions underlying its forward-looking statements are reasonable, such forward-looking statements involve known and unknown risks, uncertainties and other factors, many of which are beyond the Company’s control, which could cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. The Company cannot assure the future results or outcome of the matters described in these statements; rather, these statements merely reflect the Company’s current expectations of the approximate outcomes of the matters discussed. Factors that might cause the Company’s actual results, performance or achievements to differ materially from those expressed or implied by these forward-looking statements include, but are not limited to, the following: the short and long-term impact of the January 2025 California wildfires, including in relation to regulation, insurance, tenant demand and other factors; occupancy rates and rental demand may be adversely affected by competition and local economic and market conditions; there may be increased interest rates, inflation, escalated operating costs and possible recessionary impacts; geopolitical tensions and regional conflicts, and the related impacts on macroeconomic conditions, including, among other things, interest rates and inflation; the terms of any refinancing may not be as favorable as the terms of existing indebtedness; the Company’s inability to maintain its investment grade credit rating with the rating agencies; the Company may be unsuccessful in the management of its relationships with its \n48\nTable of Contents\nco-investment partners; the Company may fail to achieve its business objectives; time of actual completion and/or stabilization of development and redevelopment projects; estimates of future income from an acquired property may prove to be inaccurate; future cash flows may be inadequate to meet operating requirements and/or may be insufficient to provide for dividend payments in accordance with REIT requirements; changes in laws or regulations and the anticipated or actual impact of future changes in laws or regulations; unexpected difficulties in leasing of future development projects; volatility in financial and securities markets; the Company’s failure to successfully operate acquired properties; unforeseen consequences from cyber-intrusion; government approvals, actions and initiatives, including the need for compliance with environmental requirements; and those further risks, special considerations, and other factors discussed in Item 1A, Risk Factors, of this Form 10-K, and those risk factors and special considerations set forth in the Company’s other filings with the SEC which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. All forward-looking statements are made as of the date hereof, the Company assumes no obligation to update or supplement this information for any reason, and therefore, they may not represent the Company’s estimates and assumptions after the date of this report.",
  "item2": null
}