{
  "source_file": "etr-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.  \nBusiness\nRISK FACTORS SUMMARY\nEntergy’s business is subject to numerous risks and uncertainties that could affect its ability to successfully implement its business strategy and affect its financial results.  Carefully consider all of the information in this report and, in particular, the following principal risks and all of the other specific factors described in Part I, Item 1A of this report, “Risk Factors,” before deciding whether to invest in Entergy or the Registrant Subsidiaries.\nUtility Regulatory Risks\n•\nThe terms and conditions of service, including electric and gas rates, of the Registrant Subsidiaries are determined through regulatory approval proceedings that can be lengthy and subject to appeal, potentially resulting in lengthy litigation, and uncertainty as to ultimate results.\n•\nEntergy’s business could experience adverse effects related to changes to state or federal legislation or regulation, including increased tariffs, as well as changes to governmental policies and programs, including tax credits, loans, grants, guarantees, and other subsidies, or experience risks associated with participation in the MISO markets and allocation of transmission upgrade costs.\n•\nThe Utility operating companies recover fuel, purchased power, and associated costs through rate mechanisms that are subject to risks of delay or disallowance in regulatory proceedings.\n•\nA delay or failure in recovering amounts for storm restoration costs incurred as a result of severe weather could have material effects on Entergy and its Utility operating companies affected by severe weather.\n•\nWeather, economic conditions, technological developments, and other factors may have a material impact on electricity and gas usage and otherwise materially affect the Utility operating companies’ results of operations.\nNuclear Operating, Shutdown, and Regulatory Risks\n•\nThe results of operations, financial condition, and liquidity of Entergy Arkansas, Entergy Louisiana, and System Energy could be materially affected by the following:\n◦\ninability to consistently operate their nuclear power plants at high capacity factors;\n◦\nrefueling outages that last materially longer than anticipated or unplanned outages;\n◦\nrisks related to the purchase of uranium fuel (and its conversion, enrichment, and fabrication);\n◦\nthe risk that the NRC will change or modify its regulations, suspend or revoke their licenses, or increase oversight of their nuclear plants;\n◦\nrisks and costs related to operating and maintaining their nuclear power plants;\n◦\nthe costs associated with the storage of the spent nuclear fuel, as well as the costs of and their ability to fully decommission their nuclear power plants;\n◦\nthe potential requirement to pay substantial retrospective premiums and/or assessments imposed under the Price-Anderson Act and/or by Nuclear Electric Insurance Limited (NEIL) in the event of a nuclear incident, and losses not covered by insurance;\n◦\nthe risk that the decommissioning trust fund assets may not be adequate to meet decommissioning obligations if market performance and other changes decrease the value of assets in the decommissioning trusts and/or actual decommissioning costs are higher than estimated; and\n◦\nnew or existing safety concerns regarding operating nuclear power plants and nuclear fuel.\nBusiness Risks\n•\nEntergy and the Registrant Subsidiaries depend on access to the capital markets and, at times, may face potential liquidity constraints.  Disruptions in the capital and credit markets or a downgrade in Entergy’s or its Registrant Subsidiaries’ credit ratings could, among other things, adversely affect their ability to meet liquidity needs, or to access capital to operate and grow their businesses, and the cost of capital.\n240\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\n•\nThe reputation of Entergy or its Registrant Subsidiaries may be materially adversely affected by negative publicity or the inability to meet their stated goals or commitments, among other potential causes.\n•\nChanges in tax legislation and taxation as well as the inherent difficulty in quantifying potential tax effects of business decisions could negatively impact Entergy’s and the Registrant Subsidiaries’ results of operations, financial condition, and liquidity.\n•\nEntergy and its subsidiaries’ ability to successfully execute on their business strategies, including their ability to execute on their growth strategies and to complete strategic transactions, is subject to significant risks, and, as a result, they may be unable to achieve some or all of the anticipated results of such strategies.\n•\nThe success of certain Utility operating companies’ investments in new generation and transmission assets to support large-scale data centers depends on a limited number of customers, the continued demand for electricity to power data centers and the successful completion of the associated generation and transmission projects.  Any reduction in the demand for electricity to power data centers or delays or unexpected costs associated with such projects may harm the growth prospects, future operating results and financial condition of Entergy and these Utility operating companies.\n•\nEntergy may not be able to attract, retain, and manage an appropriately staffed and qualified workforce, which could negatively affect Entergy or its subsidiaries’ results of operations.\n•\nEntergy and its subsidiaries, including the Utility operating companies and System Energy, may incur substantial costs (i) to fulfill their obligations related to environmental and other matters or (ii) related to reliability standards.\n•\nEntergy could be negatively affected by the effects of climate change, including physical risks, such as increased frequency and intensity of hurricanes, availability of water, droughts, and other severe weather and wildfires, and transition risks, such as environmental and regulatory obligations intended to combat the effects of climate change, including by compelling greenhouse gas emission reductions or reporting, or increasing clean or renewable energy requirements, or placing a price on greenhouse gas emissions.\n•\nMarket performance, interest rate changes, and other changes may decrease the value of employee benefit plan assets, which then could require additional funding of such benefit plans and result in increased benefit plan costs.\n•\nThe litigation environment in the states in which the Registrant Subsidiaries operate poses a significant risk to those businesses.\n•\nTerrorist attacks and sabotage, physical attacks, cyber attacks, system failures, data breaches or other disruptions of Entergy’s and its subsidiaries’ or their suppliers’ physical infrastructure or technology systems may adversely affect Entergy’s business and results of operations.\n•\nEntergy and the Registrant Subsidiaries are subject to risks associated with their ability to obtain adequate insurance at acceptable costs.\n•\nSignificant increases in commodity prices, other materials and supplies, and operation and maintenance expenses may adversely affect Entergy’s results of operations, financial condition, and liquidity.\n•\nThe effect of higher purchased gas cost charges to customers taking gas service may adversely affect Entergy New Orleans’s results of operations and liquidity.\n•\nSystem Energy owns and, through an affiliate, operates a single nuclear generating facility, and it is dependent on sales to affiliated companies for all of its revenues.  Certain contractual arrangements relating to System Energy, the affiliated companies, and these revenues are the subject of ongoing and potential future litigation and regulatory proceedings.\n•\nAs a holding company, Entergy Corporation depends on cash distributions from its subsidiaries to meet its debt service and other financial obligations and to pay dividends on its common stock, and has provided, and may continue to provide, capital contributions or debt financing to its subsidiaries, which would reduce the funds available to meet its other financial obligations.\n•\nThe hazardous activities associated with power generation and delivery could adversely impact our results of operations and financial condition.\n241\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nENTERGY’S BUSINESS\nEntergy is an integrated energy company engaged primarily in electric power production and retail distribution operations.  Entergy owns and operates power plants with approximately 25,000 MW of electric generating capacity.  Entergy delivers electricity to approximately 3 million Utility customers in Arkansas, Louisiana, Mississippi, and Texas.  Entergy had annual revenues of $11.9 billion in 2024 and had approximately 12,000 employees as of December 31, 2024.\nEntergy operates primarily through a single reportable segment, Utility.  The Utility segment includes the generation, transmission, distribution, and sale of electric power in portions of Arkansas, Mississippi, Texas, and Louisiana, including the City of New Orleans; and operation of a small natural gas distribution business in portions of Louisiana.  See “\nHeld for Sale\n - \nNatural Gas Distribution Businesses\n” in Note 14 to the financial statements for discussion of the planned sale of the Entergy New Orleans and Entergy Louisiana natural gas distribution businesses.  Entergy completed its multi-year strategy to exit the merchant nuclear power business in 2022.  See Note 13 to the financial statements for discussion of and financial information regarding Entergy’s business segments.\nStrategy\nEntergy’s strategy is to operate and grow its utility business through a customer-centric approach designed to understand and meet customer needs, creating value for all of its key stakeholders, including customers, communities, employees, and owners.  As part of its strategy, Entergy invests significant capital to support customer growth and its customers’ growing demands for greater reliability, resilience, and clean energy, while remaining focused on affordability.  Entergy manages risks by ensuring its Utility investments are customer-driven, the result of robust analysis, supported by broad stakeholder outreach and progressive regulatory constructs, and executed with disciplined project management.  Further, Entergy continues to integrate key sustainability elements, including social responsibility and good governance, into every decision it makes.\nUtility\nThe Utility segment includes five retail electric utility subsidiaries: Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, Entergy New Orleans, and Entergy Texas.  These companies generate, transmit, distribute, and sell electric power to retail and wholesale customers in Arkansas, Louisiana, Mississippi, and Texas.  Entergy Louisiana and Entergy New Orleans also provide natural gas utility services to customers in and around Baton Rouge, Louisiana, and New Orleans, Louisiana, respectively.  See “\nHeld for Sale\n - \nNatural Gas Distribution Businesses\n” in Note 14 to the financial statements for discussion of the planned sale of the Entergy New Orleans and Entergy Louisiana natural gas distribution businesses.  Also included in the Utility is System Energy, a wholly-owned subsidiary of Entergy Corporation that owns or leases 90 percent of Grand Gulf.  System Energy sells its power and capacity from Grand Gulf at wholesale to Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans.  Effective January 1, 2025, Entergy Louisiana divested all of its 14% share of capacity and energy from Grand Gulf and all of the capacity and energy from Grand Gulf that it purchases from Entergy Arkansas (approximately 2.43%) to Entergy Mississippi.  This divestiture is being effectuated initially under a designated PPA between Entergy Louisiana and Entergy Mississippi, effective as of January 1, 2025.  The five retail utility subsidiaries are each regulated by the FERC and by state utility commissions, or, in the case of Entergy New Orleans, the City Council.  System Energy is regulated by the FERC because all of its transactions are at wholesale.  The Utility has a diverse power generation portfolio, including increasingly carbon-free energy sources, which is consistent with Entergy’s strong support for the environment.\n242\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nCustomers\nAs of December 31, 2024, the Utility operating companies provided retail electric and gas service to customers in Arkansas, Louisiana, Mississippi, and Texas, as follows:\n \n \nElectric Customers\nGas Customers\n \nArea Served\n(In Thousands)\n(%)\n(In Thousands)\n(%)\nEntergy Arkansas\nPortions of Arkansas\n735 \n24 \n \n \nEntergy Louisiana\nPortions of Louisiana\n1,110 \n37 \n96 \n47 \nEntergy Mississippi\nPortions of Mississippi\n459 \n15 \n \n \nEntergy New Orleans\nCity of New Orleans \n209 \n7 \n108 \n53 \nEntergy Texas\nPortions of Texas\n524 \n17 \n \n \nTotal\n \n3,037 \n100 \n204 \n100 \nElectric and Natural Gas Energy Sales\nElectric Energy Sales\nThe total electric energy sales of the Utility operating companies are subject to seasonal fluctuations, with the peak sales period normally occurring during the third quarter of each year.  On August 6, 2024, Entergy reached a 2024 peak demand of 22,697 MWh, compared to the 2023 peak of 23,319 MWh recorded on August 23, 2023.  Selected electric energy sales data for 2024 is shown in the table below:\n \nEntergy Arkansas\nEntergy Louisiana\nEntergy Mississippi\nEntergy New Orleans\nEntergy Texas\nSystem Energy\nEntergy (a)\n \n(GWh)\nSales to retail customers\n23,605 \n60,703 \n12,744 \n5,597 \n21,202 \n— \n123,851 \nSales for resale:\n \n \n \nAffiliates\n2,039 \n5,808 \n— \n— \n— \n9,586 \n— \nOthers\n4,058 \n1,574 \n5,568 \n2,123 \n687 \n— \n14,010 \nTotal\n29,702 \n68,085 \n18,312 \n7,720 \n21,889 \n9,586 \n137,861 \nAverage use per residential customer (kWh)\n12,549 \n14,602 \n14,167 \n12,457 \n14,276 \n— \n13,844 \n(a)\nIncludes the effect of intercompany eliminations.\nThe following table illustrates the Utility operating companies’ 2024 combined electric sales volume as a percentage of total electric sales volume, and 2024 combined electric revenues as a percentage of total 2024 electric revenue, each by customer class.\nCustomer Class\n% of Sales Volume\n% of Revenue\nResidential\n26.1\n38.8\nCommercial\n20.5\n25.4\nIndustrial (a)\n41.4\n27.5\nGovernmental\n1.8\n2.3\nWholesale/Other\n10.2\n6.0\n(a)\nMajor industrial customers are primarily in the petroleum refining and chemical industries.\n243\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nNatural Gas Energy Sales\nEntergy New Orleans and Entergy Louisiana provide both electric power and natural gas to retail customers.  Entergy New Orleans and Entergy Louisiana sold 8,872,535 Mcf and 6,816,140 Mcf, respectively, of natural gas to retail customers in 2024.  In 2024, 99% of Entergy Louisiana’s operating revenue was derived from the electric utility business and only 1% from the natural gas distribution business.  For Entergy New Orleans, 87% of operating revenue was derived from the electric utility business and 13% from the natural gas distribution business in 2024.\nFollowing is data concerning Entergy New Orleans’s 2024 retail operating revenue sources:\nCustomer Class\n% of Electric Operating Revenue\n% of Natural Gas Operating Revenue\nResidential\n48\n56\nCommercial\n35\n26\nIndustrial\n5\n5\nGovernmental/Municipal\n12\n13\nRetail Rate Regulation\nGeneral\n (Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, Entergy New Orleans, Entergy Texas, System Energy)\nEach Utility operating company regularly participates in retail rate proceedings.  The status of material retail rate proceedings is described in Note 2 to the financial statements.  Certain aspects of the Utility operating companies and System Energy’s retail rate mechanisms are discussed below.\nRate base (in billions)\nCurrent authorized return on common equity\nWeighted-average cost of capital (after-tax)\nEquity ratio\nRegulatory construct\nEntergy Arkansas\n$11.3 (a)\n9.15% - 10.15%\n5.58%\n37.9% (b)\n -  forward test year formula rate plan\n -  riders: fuel and purchased power, MISO, capacity, Grand Gulf, energy efficiency\nEntergy Louisiana (electric)\n$16.4 (c)\n9.3% - 10.1%\n6.81%\n50.81%\n -  formula rate plan through 2023 test year\n -  riders: fuel, capacity, MISO, transmission, distribution, resilience plan\nEntergy Louisiana (gas)\n$0.16 (d)\n9.3% - 10.3%\n7.08%\n54.35%\n -  gas rate stabilization plan\n -  rider: gas infrastructure\nEntergy Mississippi\n$4.5 (e)\n9.91% - 11.92%\n7.52%\n49.67%\n -  formula rate plan with forward-looking features\n -  riders: fuel, Grand Gulf, MISO, unit power cost, storm damage mitigation and restoration, ad valorem tax adjustment, grid modernization, restructuring credit, power management\n244\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nRate base (in billions)\nCurrent authorized return on common equity\nWeighted-average cost of capital (after-tax)\nEquity ratio\nRegulatory construct\nEntergy New Orleans (electric)\n$1.3 (f)\n8.85% - 9.85% \n7.28%\n55% (g)\n -  formula rate plan with forward-looking features\n -  riders: fuel and purchased power, MISO, energy efficiency, environmental, capacity costs\nEntergy New Orleans (gas)\n$0.2 (f)\n8.85% - 9.85%\n7.28%\n55% (g)\n -  formula rate plan with forward-looking features\n -  rider: purchased gas\nEntergy Texas\n$4.4 (h)\n9.57%\n6.61%\n51.2%\n -  historical test year rate case and interim rate base riders (distribution, transmission, and generation cost recovery riders)\n -  riders: fuel, capacity, cost recovery riders (distribution, transmission, and generation), rate case expenses, and advanced metering infrastructure surcharge, among others\nSystem Energy\n$1.83 (i)\n9.65%\n7.41%\n52.0%\n -  monthly cost of service\n(a)\nBased on 2025 test year.\n(b)\nBased on $2.0 billion in accumulated deferred income taxes at a 0% cost rate included in the weighted-average cost of capital calculation.\n(c)\nBased on December 31, 2023 test year and excludes approximately $100 million of transmission plant investment included in the transmission recovery mechanism and approximately $300 million of distribution plant investment included in the distribution recovery mechanism, as well as approximately $400 million of net accumulated deferred tax liability items included in the tax adjustment mechanism.\n(d)\nBased on September 30, 2023 test year.\n(e)\nBased on 2024 forward test year.\n(f)\nBased on December 31, 2023 test year and known and measurables through December 31, 2024.\n(g)\nIn October 2023 the City Council approved a three-year extension of Entergy New Orleans’s formula rate plan, modified to reflect a 55% equity ratio for rate setting purposes.\n(h)\nBased on December 31, 2021 test year and excludes $0.5 billion in cost recovery riders.\n(i)\nBased on calculation as of December 31, 2024 for Entergy Arkansas, Entergy Louisiana, and Entergy New Orleans.  Effective July 2022, Entergy Mississippi’s bills from System Energy reflect a rate base reduction for the advance collection of sale-leaseback rental costs, resulting in a calculation of $1.82 billion as of December 31, 2024.  See Note 2 to the financial statements for discussion of the System Energy settlement agreements.\nEntergy Arkansas\nFormula Rate Plan\nBetween base rate cases, Entergy Arkansas is able to adjust base rates annually, subject to certain caps, through formula rate plans that utilize a forward test year.  Entergy Arkansas is subject to a maximum rate change of 4% of the filing year total retail revenue.  In addition, Entergy Arkansas is subject to a true-up of projection to actuals netted with future projection.  In response to Entergy Arkansas’s application for a general change in rates in \n245\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\n2015, the APSC approved the formula rate plan tariff proposed by Entergy Arkansas including its use of a projected year test period and an initial five-year term.  The initial five-year term expired in 2021.  As granted by Arkansas law, Entergy Arkansas obtained APSC approval of the extension of the formula rate plan tariff for an additional five-year term, through 2026.  As part of the settlement of the 2023 formula rate plan proceeding, Entergy Arkansas agreed to file its next base rate case no later than February 2026.  As part of Entergy Arkansas’s base rate case in 2026, Entergy Arkansas may include a request for continued regulation under a formula rate review mechanism.\nFuel and Purchased Power Cost Recovery\nEntergy Arkansas’s rate schedules include an energy cost recovery rider to recover fuel and purchased power costs in monthly bills.  The rider utilizes prior calendar year energy costs and projected energy sales for the twelve-month period commencing on April 1 of each year to develop an energy cost rate, which is redetermined annually and includes a true-up adjustment reflecting the over-recovery or under-recovery, including carrying charges, of the energy cost for the prior calendar year.  The energy cost recovery rider tariff also allows an interim rate request depending upon the level of over- or under-recovery of fuel and purchased energy costs.  In December 2007 the APSC issued an order stating that Entergy Arkansas’s energy cost recovery rider will remain in effect, and any future termination of the rider would be subject to eighteen months advance notice by the APSC, which would occur following notice and hearing.\nProduction Cost Allocation Rider\nEntergy Arkansas has in place an APSC-approved production cost allocation rider for recovery from customers of the retail portion of the costs allocated to Entergy Arkansas as a result of System Agreement proceedings.\nOther\nIn June 2022 the APSC approved Entergy Arkansas’s compliance tariff filing for a proposed green tariff designed to help participating customers meet their renewable and sustainability goals and to enhance economic development efforts in Arkansas.  The APSC has approved offerings of 280 MW of solar capacity to be made available under this tariff.\nIn June 2023 the APSC approved Entergy Arkansas’s Go ZERO tariff, which provides participating industrial and commercial customers the opportunity to choose from a number of clean energy options to help them achieve their sustainability goals.  The APSC has approved offerings of 240 MW to be made available under this tariff.\nEntergy Louisiana\nFormula Rate Plan\nEntergy Louisiana historically sets electric base rates annually through a formula rate plan using a historic test year.  The form of the formula rate plan, on a combined basis, was approved in connection with the business combination of Entergy Louisiana and Entergy Gulf States Louisiana and largely followed the formula rate plans that were approved by the LPSC in connection with the full electric base rate cases filed by those companies in February 2013.  In 2021 the LPSC approved a settlement extending the formula rate plan for test years 2020, 2021, and 2022.  Certain modifications were made in that extension, including a decrease to the allowed return on equity, narrowing of the earnings “dead band” around the mid-point allowed return on equity, elimination of sharing above and below the earnings “dead band,” and the addition of a distribution cost recovery mechanism.  The formula rate plan continues to include exceptions from the rate cap and sharing requirements for certain large capital investment projects, including acquisition or construction of generating facilities and purchase power agreements approved by the LPSC, certain transmission investments, and certain distribution investments, among other items.  In August \n246\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\n2024 the LPSC approved a settlement further extending the formula rate plan for test years 2023, 2024, and 2025.  Certain modifications were made in that extension, including expansion of the tax adjustment mechanism (formerly the tax reform adjustment mechanism), a more streamlined and defined process for resolving formula rate plan test years, a narrowed “earnings” dead band, removal of certain legacy provisions that pre-dated the business combination, and the addition of a dedicated cost recovery mechanism for renewable resources.\nFuel and Purchased Power Cost Recovery\nEntergy Louisiana’s rate schedules include a fuel adjustment clause designed to recover the cost of fuel and purchased power costs.  The fuel adjustment clause contains a surcharge or credit for deferred fuel expense and related carrying charges arising from the monthly reconciliation of actual fuel costs incurred with fuel cost revenues billed to customers, including carrying charges.  See Note 2 to the financial statements for a discussion of proceedings related to audits of Entergy Louisiana’s fuel adjustment clause filings.\nTo help stabilize electricity costs, Entergy Louisiana received approval from the LPSC to hedge its exposure to natural gas price volatility through the use of financial instruments.  Entergy Louisiana historically hedged approximately one-third of the projected exposure to natural gas price changes for the gas used to serve its native electric load for all months of the year.  The hedge quantity was reviewed on an annual basis.  In November 2018, Entergy Louisiana received approval from the LPSC to suspend these seasonal hedging programs and implement financial hedges with terms up to five years for a portion of its natural gas exposure.  In May 2024, following the conclusion of its five-year hedging program, Entergy Louisiana filed an application with the LPSC for a permanent hedging program.  The permanent gas hedging program would also utilize financial hedges for a portion of Entergy Louisiana’s non-industrial natural gas exposure.  In February 2025, Entergy Louisiana filed a motion to suspend the procedural schedule, with a status conference requested for May 2025.\nEntergy Louisiana’s gas rates include a purchased gas adjustment clause based on estimated gas costs for the billing month adjusted by a surcharge or credit that arises from an annual reconciliation of fuel costs incurred with fuel cost revenues billed to customers, including carrying charges.\nRetail Rates - Gas\nIn accordance with the settlement of Entergy Gulf States Louisiana’s gas rate stabilization plan for the test year ended September 30, 2012, in August 2014, Entergy Gulf States Louisiana submitted for consideration a proposal for implementation of an infrastructure rider to recover expenditures associated with strategic plant investment and relocation projects mandated by local governments.  After review by the LPSC staff and inclusion of certain customer safeguards required by the LPSC staff, in December 2014, Entergy Gulf States Louisiana and the LPSC staff submitted a joint settlement for implementation of an accelerated gas pipe replacement program providing for the replacement of approximately 100 miles of pipe over the next ten years, as well as relocation of certain existing pipe resulting from local government-related infrastructure projects, and for a rider to recover the investment associated with these projects.  The rider allows for recovery of approximately $65 million over ten years.  The rider recovery will be adjusted on a quarterly basis to include actual investment incurred for the prior quarter and is subject to the following conditions, among others:  a ten-year term; application of any earnings in excess of the upper end of the earnings band as an offset to the revenue requirement of the infrastructure rider; adherence to a specified spending plan, within plus or minus 20% annually; annual filings comparing actual versus planned rider spending with actual spending and explanation of variances exceeding 10%; and an annual true-up.  The joint settlement was approved by the LPSC in January 2015.  Implementation of the infrastructure rider commenced with bills rendered on and after the first billing cycle of April 2015.  In April 2022, Entergy Louisiana submitted for consideration a proposal to extend the infrastructure rider to address replacement of an additional 187 miles of pipe.  In December 2022, Entergy Louisiana and the LPSC staff submitted an uncontested settlement that extends the rider for an additional ten years beginning after the end of the current term of the rider in 2025.  The extension is subject to the same customer safeguards and conditions as the original term of the rider.  The extension \n247\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nallows for recovery of approximately $95 million over ten years.  In February 2023 the uncontested settlement was approved by the LPSC.\nStorm Cost Recovery\nSee Note 2 to the financial statements for a discussion of Entergy Louisiana’s filings to recover storm-related costs.\nLPSC Customer-Centered Options Rulemaking\nIn December 2019, an LPSC commissioner issued an unopposed directive to the LPSC staff to research customer-centered options for all customer classes, as well as other regulatory environments and recommend a plan for how to ensure customers are the focus.  Since 2020, the LPSC staff has issued several requests for information on proposed scope and information related to retail open access, and interested parties filed responses to the requests.\nIn June 2024 the LPSC staff issued its Final Phase 1 Report setting forth a recommendation on sleeved PPAs, including many features similar to utility green tariffs previously approved by the LPSC, and adopting numerous limits and safeguards that had been proposed in comments by LPSC-jurisdictional utilities.  The Final Phase 1 Report also addressed various new reporting requirements for all LPSC-jurisdictional utilities, including reliability metrics, customer counts, customers receiving federal Low-Income Home Energy Assistance Program aid, utility authorized and earned returns on equity, and other items.  The report also recommended that the LPSC adopt requirements that, with each rate filing, a utility report certain information regarding bill impacts and similar matters.  In June 2024 the LPSC voted unanimously to approve the LPSC staff’s Final Phase 1 Report and proposal, and an order was issued in August 2024.\nIn December 2024 the LPSC staff issued its Phase 2 Report, addressing enhanced combined heat and power options, energy displacement sleeved PPAs, and other matters.  The LPSC staff also issued various data requests to be answered by all jurisdictional utilities.  The LPSC staff has indicated that the Phase 3 Report, which will address partial or full retail open access and other issues that were deferred from the Phase 2 Report, is expected to be completed by the third quarter 2025.  In January 2025, Entergy Louisiana filed a motion asking the LPSC to provide renewed guidance as to whether the inquiry in this proceeding into the remaining issues in the Phase 3 Report is appropriate and consistent with the LPSC’s current policy objectives, or whether the docket has achieved its purpose and may be closed.  The LPSC is expected to consider the motion at its March 2025 meeting.\nOther\nIn March 2016 the LPSC opened two dockets to examine, on a generic basis, issues that it identified in connection with its review of Cleco Corporation’s acquisition by third party investors.  The first docket is captioned “In re: Investigation of double leveraging issues for all LPSC-jurisdictional utilities,” and the second is captioned “In re: Investigation of tax structure issues for all LPSC-jurisdictional utilities.”  In April 2016 the LPSC clarified that the concerns giving rise to the two dockets arose as a result of its review of the structure of the Cleco-Macquarie transaction and that the specific intent of the directives is to seek more information regarding intra-corporate debt financing of a utility’s capital structure as well as the use of investment tax credits to mitigate the tax obligation at the parent level of a consolidated entity.  No schedule has been set for either docket, and limited discovery has occurred.\nIn September 2019 the LPSC issued an order modifying its rule regarding net metering installations.   Among other things, the rule provides for 2-channel billing for net metering with excess energy put to the grid being compensated at the utility’s avoided cost.  However, the rule does provide that net meter installations in place as of December 31, 2019 will be subject to 1:1 net metering with excess energy put to the grid being compensated at the \n248\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nfull retail rate for a period of 15 years (through December 31, 2034), after which those installations will be subject to 2-channel billing.  The rule also eliminates the existing limit on the cumulative number of net meter installations.\nEntergy Mississippi\nFormula Rate Plan\nSince the conclusion in 2015 of Entergy Mississippi’s most recent base rate case, Entergy Mississippi has set electric base rates annually through a formula rate plan.  Between base rate cases, Entergy Mississippi is able to adjust base rates annually, subject to certain caps, through formula rate plans that utilize forward-looking features.  In addition, Entergy Mississippi is subject to an annual “look-back” evaluation.  Entergy Mississippi is allowed a maximum rate increase of 4% of each test year’s retail revenue.  Any increase above 4% requires a base rate case.  If Entergy Mississippi’s formula rate plan were terminated without replacement, it would revert to the more traditional rate case environment or seek approval of a new formula rate plan.\nIn August 2012 the MPSC opened inquiries to review whether the then-current formulaic methodology used to calculate the return on common equity in both Entergy Mississippi’s formula rate plan and Mississippi Power Company’s annual formula rate plan was still appropriate or could be improved to better serve the public interest.  The intent of this inquiry and review was for informational purposes only; the evaluation of any recommendations for changes to the existing methodology would take place in a general rate case or in the existing formula rate plan proceeding.  In March 2013 the Mississippi Public Utilities Staff filed its consultant’s report which noted the return on common equity estimation methods used by Entergy Mississippi and Mississippi Power Company are commonly used throughout the electric utility industry.  The report suggested ways in which the methods used by Entergy Mississippi and Mississippi Power Company might be improved, but did not recommend specific changes in the return on common equity formulas or calculations at that time.  In June 2014 the MPSC expanded the scope of the August 2012 inquiry to study the merits of adopting a uniform formula rate plan that could be applied, where possible in whole or in part, to both Entergy Mississippi and Mississippi Power Company in order to achieve greater consistency in the plans.  The MPSC directed the Mississippi Public Utilities Staff to investigate and review Entergy Mississippi’s formula rate plan rider schedule and Mississippi Power Company’s Performance Evaluation Plan by considering the merits and deficiencies and possibilities for improvement of each and then to propose a uniform formula rate plan that, where possible, could be applicable to both companies.  No procedural schedule has been set.  In October 2014 the Mississippi Public Utilities Staff conducted a public technical conference to discuss performance benchmarking and its potential application to the electric utilities’ formula rate plans.  The docket remains open.\nIn December 2019 the MPSC approved Entergy Mississippi’s proposed revisions to its formula rate plan to provide for a mechanism in the formula rate plan, the interim capacity rate adjustment mechanism, to recover the non-fuel related costs of additional owned capacity acquired by Entergy Mississippi as well as to allow similar cost recovery treatment for other capacity acquisitions that are approved by the MPSC.  The MPSC must approve recovery through the interim capacity rate adjustment for each new resource.  In addition, the MPSC approved revisions to the formula rate plan which allows Entergy Mississippi to begin billing rate adjustments effective April 1 of the filing year on a temporary basis subject to refund or credit to customers, subject to final MPSC order.  The MPSC also authorized Entergy Mississippi to remove vegetation management costs from the formula rate plan and recover these costs through the establishment of a vegetation management rider, which was superseded in June 2024 with the approval of the storm damage mitigation and restoration rider.  See Note 2 to the financial statements for a discussion of proceedings regarding recovery of Entergy Mississippi’s storm-related costs.\nIn November 2020 the MPSC approved Entergy Mississippi’s revisions to its formula rate plan providing for the realignment of energy efficiency costs to its formula rate plan, the deferral of energy efficiency expenditures into a regulatory asset, and the elimination of its energy efficiency cost recovery rider effective with the January 2022 billing cycle.\n249\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nIn June 2023 the MPSC approved Entergy Mississippi’s revisions to its formula rate plan to realign the recovery of certain long-term service agreement and conductor handling costs to the annual power management and grid modernization riders effective January 2023.\nIn May 2024 the MPSC approved Entergy Mississippi’s revisions to its formula rate plan to comply with state legislation passed in January 2024 allowing Entergy Mississippi to make interim rate adjustments to recover the non-fuel related annual ownership cost of certain facilities that directly or indirectly provide service to customers who own certain data processing center projects as specified in the legislation.\nFuel and Purchased Power Cost Recovery\nEntergy Mississippi’s rate schedules include energy cost recovery riders to recover fuel and purchased power costs.  The energy cost rate for each calendar year is redetermined annually and includes a true-up adjustment reflecting the over-recovery or under-recovery of the energy costs as of the 12-month period ended September 30.  Entergy Mississippi’s fuel cost recoveries are subject to annual audits conducted pursuant to the authority of the MPSC.  The energy cost recovery riders allow interim rate adjustments depending on the level of over- or under-recovery of fuel and purchased energy costs.\nTo help stabilize electricity costs, Entergy Mississippi received approval from the MPSC to hedge its exposure to natural gas price volatility through the use of financial instruments.  Entergy Mississippi hedges approximately one-third of the projected exposure to natural gas price changes for the gas used to serve its native electric load for all months of the year.  The hedge quantity is reviewed on an annual basis.\nStorm Cost Recovery\nSee Note 2 to the financial statements for a discussion of proceedings regarding recovery of Entergy Mississippi’s storm-related costs.\nOther\nIn October 2022 the MPSC adopted the Distributed Generation Rule.  The Distributed Generation Rule maintains the 3% net metering participation cap.  The Distributed Generation Rule grandfathers a 2.5 cents per kWh distributed generation benefits adder for 25 years and expands eligibility for the 2 cents per kWh low-income benefits adder to households up to 225% of the federal poverty level and grandfathers that adder for 25 years.  The Distributed Generation Rule also directs utilities to make rate filings implementing up-front incentives for distributed generating systems and demand response battery systems, and to establish a public K-12 solar for schools program.  In August 2023 the MPSC approved Entergy Mississippi’s proposed solar for schools rate schedule under the Distributed Generation Rule.\nIn December 2022 the MPSC approved Entergy Mississippi’s RenewABLE Community Option (Schedule RCO), an offering for qualifying non-residential customers to subscribe to renewable resource capacity to satisfy their environmental, sustainability, and governance goals.  Registration for the Schedule RCO launched in May 2023.\nEntergy New Orleans\nFormula Rate Plan\nAs part of its determination of rates in the base rate case filed by Entergy New Orleans in 2018, in November 2019, the City Council issued a resolution resolving the rate case, with rates to become effective retroactive to August 2019.  The resolution allows Entergy New Orleans to implement a three-year formula rate plan, beginning with the 2019 test year as adjusted for forward-looking known and measurable changes, with the \n250\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nfiling for the first test year to be made in 2020.  In October 2020 the City Council approved an agreement in principle filed by Entergy New Orleans that results in Entergy New Orleans forgoing its 2020 formula rate plan filing and shifting the three-year formula rate plan to filings in 2021, 2022, and 2023.  In September 2023, Entergy New Orleans filed a motion seeking City Council approval of a three-year extension of Entergy New Orleans’s electric and gas formula rate plans, for filings in 2024, 2025, and 2026.  In October 2023 the City Council granted Entergy New Orleans’s request for an extension, subject to minor modifications.\nFuel and Purchased Power Cost Recovery\nEntergy New Orleans’s electric rate schedules include a fuel adjustment tariff designed to reflect no more than targeted fuel and purchased power costs, adjusted by a surcharge or credit for deferred fuel expense arising from the monthly reconciliation of actual fuel and purchased power costs incurred with fuel cost revenues billed to customers, including carrying charges.\nEntergy New Orleans’s gas rate schedules include a purchased gas adjustment to reflect estimated gas costs for the billing month, adjusted by a surcharge or credit similar to that included in the electric fuel adjustment clause, including carrying charges.\nTo help stabilize gas costs, Entergy New Orleans seeks approval annually from the City Council to continue implementation of its natural gas hedging program consistent with the City Council’s stated policy objectives.  The program uses financial instruments to hedge exposure to volatility in the wholesale price of natural gas purchased to serve Entergy New Orleans gas customers.  Entergy New Orleans hedges up to 25% of actual gas sales made during the winter months.\nStorm Cost Recovery\nIn January 2025, Entergy New Orleans filed an application with the City Council requesting the establishment of a standard procedural timeline for consideration of future applications by Entergy New Orleans that seek securitization financing of storm restoration costs, including replenishment of storm recovery reserves, in furtherance of the goals of promoting efficiency of restoration and helping mitigate customer exposure to carrying costs following expenditures for future storm restoration. To support this objective, Entergy New Orleans proposed a procedural schedule that would allow for the issuance of a financing order no later than four months or 120 days from the date that Entergy New Orleans files any future applications seeking securitization financing of storm restoration costs, including storm recovery reserves, with the City Council.  Entergy New Orleans also requested that the City Council approve an amendment to the storm recovery reserve escrow agreement to increase flexibility in the timing of certain disbursements of escrow funds to prepare for anticipated storms.\nSee Note 2 to the financial statements for a discussion of Entergy New Orleans’s filings to recover storm-related costs.\nEntergy Texas\nBase Rates\nThe base rates of Entergy Texas are established largely in traditional base rate case proceedings.  Between base rate proceedings, Entergy Texas has available rate riders to recover the revenue requirements associated with certain incremental costs.  Entergy Texas is required to file full base rate case proceedings every four years and within eighteen months of utilizing its generation cost recovery rider for investments above $200 million.\n251\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nFuel and Purchased Power Cost Recovery\nEntergy Texas’s rate schedules include a fixed fuel factor to recover fuel and purchased power costs, including interest, that are not included in base rates.  Historically, semi-annual revisions of the fixed fuel factor have been made in March and September based on the market price of natural gas and changes in fuel mix.  The amounts collected under Entergy Texas’s fixed fuel factor and any interim surcharge or refund are subject to fuel reconciliation proceedings before the PUCT.  In the course of this reconciliation, the PUCT determines whether eligible fuel and fuel-related expenses and revenues are necessary and reasonable and makes a prudence finding for each of the fuel-related contracts entered into during the reconciliation period.  In 2023 the Texas legislature modified the Texas Utilities Code to provide that material over- and under-recovered fuel balances are to be refunded or surcharged through interim fuel adjustments and that fuel reconciliations must be filed at least once every two years.  Entergy Texas expects the PUCT to undertake a rulemaking to effectuate the new legislation in 2025.\nAt the PUCT’s April 2013 open meeting, the PUCT Commissioners discussed their view that a purchased power capacity rider was good public policy.  The PUCT issued an order in May 2013 adopting the rule allowing for a purchased power capacity rider, subject to an offsetting adjustment for load growth.  The rule, as adopted, also includes a process for obtaining pre-approval by the PUCT of purchased power agreements to be recovered through a purchased power capacity rider.  No Texas utility, including Entergy Texas, has exercised the option to recover capacity costs under the rider mechanism, but Entergy Texas will continue to evaluate the benefits of utilizing the rider to recover future capacity costs.  In 2023, the Texas legislature modified the Texas Utilities Code to permit a utility to seek pre-approval from the PUCT for a purchased power agreement of three years or more if such approval is a precondition to the effectiveness of such agreements, regardless of whether the utility intends to recover costs associated with the purchased power agreement through a purchased power capacity rider.\nTransmission, Distribution, and Generation Cost Recovery\nAs discussed above, Entergy Texas has available rate riders to recover the revenue requirements associated with certain incremental costs.  These riders include a transmission cost recovery factor rider mechanism for the recovery of transmission-related capital investments, a distribution cost recovery factor rider mechanism for the recovery of distribution-related capital investment, and a generation cost recovery rider mechanism for the recovery of generation-related capital investments.\nIn June 2009 a law was enacted in Texas containing provisions that allow Entergy Texas to take advantage of a cost recovery mechanism that permits annual filings for the recovery of reasonable and necessary expenditures for transmission infrastructure improvement and changes in wholesale transmission charges.  This mechanism was previously available to other non-ERCOT Texas utility companies, but not to Entergy Texas.\nIn September 2011 the PUCT adopted a proposed rule implementing a distribution cost recovery factor to recover capital and capital-related costs related to distribution infrastructure.  The distribution cost recovery factor permitted utilities once per year to implement an increase or decrease in rates above or below amounts reflected in base rates to reflect distribution-related depreciation expense, federal income tax and other taxes, and return on investment.  In 2023, the Texas Legislature modified the Texas Utilities Code to permit utilities to update their distribution cost recovery factors up to twice per year and to require the PUCT to issue an order on such update applications within 60 days, with a 15-day extension permitted for good cause.\nIn September 2019 the PUCT initiated a rulemaking to promulgate a generation cost recovery rider rule, implementing legislation passed in the 2019 Texas legislative session intended to allow electric utilities to recover generation investments between base rate proceedings.  The PUCT approved the final rule in July 2020.\n252\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nStorm Cost Recovery\nSee Note 2 to the financial statements for a discussion of Entergy Texas’s filings to recover storm-related costs.\nOther\nIn January 2022, Entergy Texas filed an application requesting approval to implement two voluntary renewable option tariffs, Rider Small Volume Renewable Option (Rider SVRO) and Rider Large Volume Renewable Option (Rider LVRO).  Both tariffs are voluntary offerings that give customers the ability to match some or all of their monthly electricity usage with renewable energy credits that are purchased by Entergy Texas and retired on the customer’s behalf.  Voluntary participation in either Rider SVRO or Rider LVRO and the charges assessed under the respective tariff would be in addition to the charges paid by customers under their otherwise applicable rate schedules and riders.  In April 2022, Entergy Texas filed on behalf of the parties an unopposed settlement agreement supporting approval of Entergy Texas’s proposed voluntary renewable option tariffs.  As part of the settlement agreement, Entergy Texas agreed to revise the cost allocation between the rate tiers of Rider SVRO and committed to collaborating with and considering the input of customers to develop an asset-backed green tariff program.  The PUCT approved the settlement agreement in August 2022.\nAs part of its rate case application filed with the PUCT in July 2022, Entergy Texas requested approval of Schedule Green Future Option (Schedule GFO), an asset-backed green tariff that would allow Entergy Texas’s customers to voluntarily subscribe to a portion of the underlying solar facility’s capacity in exchange for energy credits.  In August 2023 the PUCT approved an unopposed settlement in the proceeding that included approval of Schedule GFO.\nElectric Industry Restructuring\nIn June 2009 a law was enacted in Texas that required Entergy Texas to cease all activities relating to Entergy Texas’s transition to competition.  The law allows Entergy Texas to remain a part of the SERC Reliability Corporation (SERC) Region, although it does not prevent Entergy Texas from joining another power region.  The law provides that proceedings to certify a power region that Entergy Texas belongs to as a qualified power region can be initiated by the PUCT, or on motion by another party, when the conditions supporting such a proceeding exist.  Under the law, the PUCT may not approve a transition to competition plan for Entergy Texas until the expiration of four years from the PUCT’s certification of a qualified power region for Entergy Texas.\nThe law further amended already existing law that had required Entergy Texas to propose for PUCT approval a tariff to allow eligible customers the ability to contract for competitive generation.  The amending language in the law provides, among other things, that: (1) the tariff shall not be implemented in a manner that harms the sustainability or competitiveness of manufacturers who choose not to participate in the tariff; (2) Entergy Texas shall “purchase competitive generation service, selected by the customer, and provide the generation at retail to the customer;” and (3) Entergy Texas shall provide and price transmission service and ancillary services under that tariff at a rate that is unbundled from its cost of service.  The law directs that the PUCT may not issue an order on the tariff that is contrary to an applicable decision, rule, or policy statement of a federal regulatory agency having jurisdiction.  The PUCT determined that unrecovered costs that may be recovered through the rider consist only of those costs necessary to implement and administer the competitive generation program and do not include lost revenues or embedded generation costs.  The amount of customer load that may be included in the competitive generation service program is limited to 115 MW.\n253\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nSystem Energy\nCost of Service\nThe rates of System Energy are established by the FERC, and the costs allowed to be charged pursuant to these rates are, in turn, passed through to the participating Utility operating companies through the Unit Power Sales Agreement, which has monthly billings that reflect the current operating costs of, and investment in, Grand Gulf.  Retail regulators and other parties may seek to initiate proceedings at FERC to investigate the prudence of costs included in the rates charged under the Unit Power Sales Agreement and examine, among other things, the reasonableness or prudence of the operation and maintenance practices, level of expenditures, allowed rates of return and rate base, and previously incurred capital expenditures, to the extent that claims concerning such issues have not been released by a party to one of the System Energy settlement agreements.  Beginning in 2021, System Energy implemented annual billing protocols to provide retail regulators with information regarding rates billed under the Unit Power Sales Agreement.  See Note 2 to the financial statements for discussion of the System Energy settlement agreements.\nFranchises\nEntergy Arkansas holds exclusive franchises to provide electric service in approximately 308 incorporated cities and towns in Arkansas.  These franchises generally are unlimited in duration and continue unless the municipalities purchase the utility property.  In Arkansas, franchises are considered to be contracts and, therefore, are governed pursuant to the terms of the franchise agreement and applicable statutes.\nEntergy Louisiana holds non-exclusive franchises to provide electric service in approximately 175 incorporated municipalities and in the unincorporated areas of approximately 59 parishes of Louisiana.  Entergy Louisiana holds non-exclusive franchises to provide natural gas service to customers in the City of Baton Rouge and in East Baton Rouge Parish.  Municipal franchise agreement terms range from 25 to 60 years while parish franchise terms range from 25 to 99 years.\nEntergy Mississippi has received from the MPSC certificates of public convenience and necessity to provide electric service to areas within 45 counties, including a number of municipalities, in western Mississippi.  Under Mississippi statutory law, such certificates are exclusive.  Entergy Mississippi may continue to serve in such municipalities upon payment of a statutory franchise fee, regardless of whether an original municipal franchise is still in existence.\nEntergy New Orleans provides electric and gas service in the City of New Orleans pursuant to indeterminate permits set forth in city ordinances.  These ordinances contain a continuing option for the City of New Orleans to purchase Entergy New Orleans’s electric and gas utility properties.\nEntergy Texas holds a certificate of convenience and necessity from the PUCT to provide electric service to areas within approximately 27 counties in eastern Texas and holds non-exclusive franchises to provide electric service in approximately 70 incorporated municipalities.  Entergy Texas typically obtains 25-year franchise agreements as existing agreements expire.  Entergy Texas’s electric franchises expire over the period 2025-2058.\nThe business of System Energy is limited to wholesale power sales.  It has no distribution franchises.\n254\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nProperty and Other Generation Resources\nOwned Generating Stations\nThe total capability of the generating stations owned and leased by the Utility operating companies and System Energy as of December 31, 2024 is indicated below:\n \nOwned and Leased Capability MW(a)\nCompany\nTotal\nCT / CCGT (b)\nLegacy Gas/Oil\nNuclear (c)\nCoal\nHydro (c)\nSolar (c)\nEntergy Arkansas\n5,559 \n1,547 \n522 \n1,821 \n967 \n72 \n630 \nEntergy Louisiana\n10,809 \n5,629 \n2,789 \n2,052 \n339 \n— \n— \nEntergy Mississippi\n2,964 \n1,739 \n707 \n— \n416 \n— \n102 \nEntergy New Orleans\n662 \n635 \n— \n— \n— \n— \n27 \nEntergy Texas\n3,234 \n990 \n1,994 \n— \n250 \n— \n— \nSystem Energy\n1,251 \n— \n— \n1,251 \n— \n— \n— \nTotal\n24,479 \n10,540 \n6,012 \n5,124 \n1,972 \n72 \n759 \n(a)\n“Owned and Leased Capability” is the dependable summer load carrying capability as demonstrated under actual operating conditions based on the primary fuel (assuming no curtailments) that each station was designed to utilize.\n(b)\nRepresents Simple Cycle Combustion Turbine units and Combined Cycle Gas Turbine units.\n(c)\nThe percentage of nuclear and renewable energy includes energy procured or produced for the benefit of certain customers through special tariffs, contracts, or renewable program subscriptions, and those customers retain the exclusive claims to all associated environmental attributes, renewable energy credits, and other relevant clean energy certifications.\nSummer peak load for the Utility has averaged 21,998 MW over the previous decade.\nThe Utility operating companies’ load and capacity projections are reviewed periodically to assess the need and timing for additional generating capacity and interconnections.  These reviews consider existing and projected demand, the availability and price of power, the location of new load, the economy, Entergy’s clean energy and other public policy goals, environmental regulations, and the age and condition of Entergy’s existing infrastructure.\nThe Utility operating companies’ long-term resource strategy (Portfolio Transformation Strategy) calls for the bulk of capacity needs to be met through long-term resources, whether owned or contracted.  Over the past decade, the Portfolio Transformation Strategy has resulted in the addition of about 8,702 MW of new long-term resources and the deactivation of about 4,242 MW of legacy generation.  As MISO market participants, the Utility operating companies also participate in MISO’s Day Ahead and Real Time Energy and Ancillary Services markets to economically dispatch generation and purchase energy to serve customers reliably and at the lowest reasonable cost.\nOther Generation Resources\nRFP Procurements\nThe Utility operating companies from time-to-time issue requests for proposals (RFP) to procure supply-side resources from sources other than the spot market to meet the unique regional needs of the Utility operating companies.  The RFPs issued by the Utility operating companies have sought resources needed to meet near-term MISO reliability requirements as well as long-term requirements through a broad range of wholesale power \n255\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nproducts, including long-term contractual products and asset acquisitions.  The RFP process has resulted in selections or acquisitions, including, among other things:\n•\nIn November 2018, Entergy Mississippi signed an agreement for the purchase of an approximately 100 MW to-be-constructed solar photovoltaic energy facility, Sunflower Solar facility, located in Sunflower County, Mississippi.  Entergy Mississippi received regulatory approval from the MPSC in April 2020, and closed on the acquisition, through use of a tax equity partnership, in May 2022.  The Sunflower Solar facility commenced commercial operation in September 2022;\n•\nIn March 2019, Entergy Arkansas signed an agreement for the purchase of an approximately 100 MW to-be-constructed solar photovoltaic energy facility, Searcy Solar facility, located in White County near Searcy, Arkansas.  Entergy Arkansas received regulatory approval from the APSC in April 2020, and closed on the acquisition, through use of a tax equity partnership, in December 2021.  The Searcy Solar facility commenced commercial operation in January 2022;\n•\nIn June 2020, Entergy Arkansas signed an agreement for the purchase of an approximately 100 MW to-be-constructed solar photovoltaic energy facility, Walnut Bend Solar facility, located in Lee County, Arkansas.  In July 2021 the APSC issued an order approving the acquisition of the Walnut Bend Solar facility.  In February 2024, Entergy Arkansas acquired the facility.  The Walnut Bend Solar facility commenced commercial operation in September 2024;\n•\nIn September 2020, Entergy Arkansas signed an agreement for the purchase of an approximately 180 MW to-be-constructed solar photovoltaic energy facility, West Memphis Solar facility, located in Crittenden County, Arkansas.  In October 2021 the APSC issued an order approving the acquisition of the West Memphis Solar facility.  In August 2024, Entergy Arkansas acquired the facility.  The West Memphis Solar facility commenced commercial operation in December 2024;\n•\nIn December 2020, Entergy Texas selected the 1,158 MW self-build alternative, Orange County Advanced Power Station, out of the 2020 Entergy Texas combined-cycle, gas turbine RFP.  Regulatory approval was received in November 2022 and construction has commenced.  The facility is expected to be in service by mid-2026;\n•\nIn November 2021, Entergy Louisiana signed an agreement for the purchase of an approximately 150 MW to-be-constructed solar photovoltaic energy facility, St. Jacques facility, to be sited in St. James Parish near Vacherie, Louisiana.  In September 2022 the LPSC issued an order approving the St. Jacques facility; however, following the LPSC approval, the St. James Parish council issued a moratorium on new land use permits for solar facilities.  In November 2023, St. James Parish lifted the moratorium and adopted an ordinance modifying the parish’s land use plan to establish solar as an approved land use and defining corresponding solar regulations.  In June 2024 the St. James Parish council denied the project developer’s solar energy facility farm permit application and following this denial, the project developer and one of the project’s ground lessors filed separate lawsuits seeking to overturn the council’s decision.  Entergy Louisiana is currently monitoring the status of the aforementioned lawsuits and also considering alternate paths forward;\n•\nIn August 2022, Entergy Arkansas signed an agreement for the purchase of an approximately 250 MW to-be-constructed solar photovoltaic energy facility, Driver Solar facility, located near Osceola, Arkansas.  Also in August 2022, Entergy Arkansas received regulatory approval from the APSC for the Driver Solar facility.  In August 2024, Entergy Arkansas acquired the facility.  The Driver Solar facility commenced commercial operation in December 2024;\n•\nEntergy Louisiana began construction on the 49 MW Sterlington solar project in December 2024, located in Sterlington, Louisiana.  The facility is expected to achieve commercial operation in January 2026;\n•\nEntergy Mississippi will begin construction on the Delta Solar facility, an 80 MW solar facility to be located in Bolivar County, Mississippi, in April 2026.  The facility is expected to achieve commercial operation by the end of 2027; and\n•\nEntergy Mississippi will begin construction on the Penton Solar facility, a 190 MW solar facility in December 2025.  The facility is expected to achieve commercial operation by early 2028.\n256\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nThe RFP process has also resulted in the selection, or confirmation of the economic merits of, long-term purchased power agreements (PPAs), including, among others:\n•\nRiver Bend’s 30% life-of-unit PPA between Entergy Louisiana and Entergy New Orleans for 100 MW related to Entergy Louisiana’s unregulated portion of the River Bend nuclear station, which portion was formerly owned by Cajun;\n•\nEntergy Arkansas’s wholesale base load capacity life-of-unit PPAs executed in 2003 totaling approximately 220 MW between Entergy Arkansas and Entergy Louisiana (110 MW) and between Entergy Arkansas and Entergy New Orleans (110 MW) related to the sale of a portion of Entergy Arkansas’s coal and nuclear base load resources (which had not been included in Entergy Arkansas’s retail rates);\n•\nIn September 2012, Entergy Gulf States Louisiana and Rain CII Carbon LLC executed a 20-year agreement for 28 MW, with the potential to purchase an additional 9 MW when available, from a petroleum coke calcining facility in Sulphur, Louisiana.  The facility began commercial operation in May 2013.  Entergy Louisiana, as successor in interest to Entergy Gulf States Louisiana, now holds the agreement with the facility;\n•\nIn March 2013, Entergy Gulf States Louisiana and Agrilectric Power Partners, LP executed a 20-year agreement for 8.5 MW from a refurbished rice hull-fueled electric generation facility located in Lake Charles, Louisiana.  Entergy Louisiana, as successor in interest to Entergy Gulf States Louisiana, now holds the agreement with Agrilectric;\n•\nEntergy Mississippi’s cost-based purchase, beginning in January 2013, of 90 MW from Entergy Arkansas’s share of Grand Gulf (only 60 MW of this PPA came through the RFP process).  Cost recovery for the 90 MW was approved by the MPSC in January 2013;\n•\nIn April 2015, Entergy Arkansas and Stuttgart Solar, LLC executed a 20-year agreement for 81 MW from a solar photovoltaic electric generation facility located near Stuttgart, Arkansas.  The APSC approved the project and deliveries pursuant to that agreement commenced in June 2018;\n•\nIn November 2016, Entergy Louisiana and LS Power executed a 10-year agreement for 485 MW from the Carville Energy Center located in St. Gabriel, Louisiana.  In November 2019, LS Power sold and transferred the Carville Energy Center and facility to Argo Infrastructure Partners, which included the power purchase agreement.  The PPA delivery term began in June 2022;\n•\nIn November 2016, Entergy Louisiana and Occidental Chemical Corporation executed a 10-year agreement for 500 MW from the Taft Cogeneration facility located in Hahnville, Louisiana.  The transaction received regulatory approval and began in June 2018;\n•\nIn June 2017, Entergy Arkansas and Chicot Solar, LLC executed a 20-year agreement for 100 MW from a to-be-constructed solar photovoltaic electric generating facility located in Chicot County, Arkansas.  The transaction received regulatory approval and the PPA began in November 2020;\n•\nIn February 2018, Entergy Louisiana and LA3 West Baton Rouge, LLC (Capital Region Solar project) executed a 20-year agreement for 50 MW from a to-be-constructed solar photovoltaic electric generating facility located in West Baton Rouge Parish, Louisiana.  The transaction received regulatory approval in February 2019 and the PPA began in October 2020;\n•\nIn July 2018, Entergy New Orleans and St. James Solar, LLC executed a 20-year agreement for 20 MW from a to-be-constructed solar photovoltaic electric generating facility located in St. James Parish, Louisiana.  The transaction received regulatory approval in July 2019 and the PPA began in February 2023 after the facility reached commercial operation in March 2023;\n•\nIn August 2018, Entergy Louisiana and South Alexander Development I, LLC executed a 5-year agreement for 5 MW from a solar photovoltaic electric generating facility located in Livingston Parish, Louisiana.  The PPA began in December 2020 and received regulatory approval in January 2021;\n•\nIn February 2019, Entergy New Orleans and Iris Solar, LLC executed a 20-year agreement for 50 MW from a to-be-constructed solar photovoltaic electric generating facility located in Washington Parish, Louisiana.  The transaction received regulatory approval in July 2019 and achieved commercial operation in November 2022;\n257\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\n•\nIn August 2020, Entergy Texas and Umbriel Solar, LLC executed a 20-year agreement for 150 MW from a to-be-constructed solar photovoltaic electric generating facility located in Polk County, Texas.  The facility achieved commercial operation in November 2023;\n•\nIn June 2021, Entergy Louisiana and Sunlight Road Solar, LLC executed a 20-year agreement for 50 MW from a to-be-constructed solar photovoltaic electric generating facility located in Washington Parish, Louisiana.  The facility achieved commercial operation in November 2024 and the PPA delivery term began in December 2024;\n•\nIn June 2021, Entergy Louisiana and Vacherie Solar Energy Center, LLC executed a 20-year PPA for 150 MW from a to-be-constructed solar photovoltaic electric generating facility located in St. James Parish, Louisiana.  In September 2022 the LPSC voted to issue an order approving the Vacherie facility; however, following the LPSC approval, the St. James Parish council issued a moratorium on new land use permits for solar facilities.  In November 2023, St. James Parish lifted the moratorium and adopted an ordinance modifying the parish’s land use plan to establish solar as an approved land use and defining corresponding solar regulations.  In June 2024 the St. James Parish council denied the project developer’s solar energy facility farm permit application and following this denial, the project developer and one of the project’s ground lessors filed separate lawsuits seeking to overturn the council’s decision.  Entergy Louisiana is currently monitoring the status of the aforementioned lawsuits and also considering alternate paths forward;\n•\nIn December 2022, Entergy Mississippi and Hinds Solar, LLC executed a 20-year PPA for approximately 150 MW from a to-be-constructed solar photovoltaic energy facility located in Hinds County, Mississippi.  In August 2023 the MPSC approved the PPA;\n•\nIn October 2022, Entergy Mississippi and Wildwood Solar, LLC executed a 20-year PPA for approximately 100 MW from a to-be-constructed solar photovoltaic energy facility located in Tallahatchie County, Mississippi.  In August 2023 the MPSC approved the PPA, and the facility is expected to reach commercial operation in 2026;\n•\nIn October 2022, Entergy Mississippi and Greer Solar, LLC executed a 20-year PPA for approximately 170 MW from a to-be-constructed solar photovoltaic energy facility located in Washington County, Mississippi.  In August 2023 the MPSC approved the PPA, and the facility is expected to reach commercial operation as early as December 2026;\n•\nIn October 2022, Entergy Arkansas and Flat Fork Solar, LLC executed a 20-year PPA for approximately 200 MW from a to-be-constructed solar photovoltaic energy facility located in St. Francis County, Arkansas.  In September 2023 the APSC approved the PPA, and the facility is expected to reach commercial operation as early as September 2025;\n•\nIn October 2022, Entergy Arkansas and Forgeview Solar, LLC executed a 15-year PPA for approximately 200 MW from a to-be-constructed solar photovoltaic energy facility located in Mississippi County, Arkansas.  In September 2023 the APSC approved the PPA, and the facility is expected to reach commercial operation as early as November 2025;\n•\nIn January 2023, Entergy Louisiana and Coastal Prairie Solar, LLC executed a 20-year PPA for approximately 175 MW from a to-be-constructed solar photovoltaic energy facility located in Iberville Parish, Louisiana.  In January 2024 the LPSC approved the PPA, and the facility is expected to reach commercial operation as early as December 2027; and\n•\nIn October 2023, Entergy Louisiana and Mondu Solar, LLC executed a 20-year PPA for approximately 100 MW from a to-be-constructed solar photovoltaic energy facility located in Point Coupee Parish, Louisiana.  In September 2024 the LPSC approved the PPA, and the facility is expected to reach commercial operation as early as June 2026.\nIn July 2021, Entergy Services, on behalf of Entergy Texas, issued an RFP for solar generation resources.  Entergy Te\nxas selected a combination of PPA and owned resources in March 2022.  The PPA negotiations were terminated after failure to reach agreement on terms.  \nIn July 2024, Entergy Texas filed an application with the PUCT seeking regulatory approval for the owned resource, the 141 MW Votaw Solar facility.  Subject to receipt of required regulatory approval and other conditions, the Votaw Solar facility is expected to be in service by mid-2028.\n258\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nIn April 2022, Entergy Services, on behalf of Entergy Arkansas, issued an RFP for solar photovoltaic and wind resources.  Entergy Arkansas selected a combination of PPA and build-own-transfer resources in February 2023.  One PPA project was terminated after failure to reach agreement on terms, and negotiation of definitive agreements for the remaining resources are in progress.\nIn October 2022, Entergy Services, on behalf of Entergy Texas, issued an RFP for solar photovoltaic and wind resources.  Entergy Texas selected a combination of PPA, build-own-transfer, and owned resources in July 2023.  The PPA and build-own-transfer negotiations were terminated after failure to reach agreement on terms.  In July 2024, Entergy Texas filed an application with the PUCT seeking regulatory approval for the owned resource, the 170 MW Segno Solar facility.  Subject to receipt of required regulatory approval and other conditions, the Segno Solar facility is expected to be in service by early 2027.\nIn April 2024, Entergy Services, on behalf of Entergy Louisiana, issued an RFP for capacity and energy from existing generation resources.  Entergy Louisiana selected a PPA resource in December 2024, and negotiation of a definitive agreement is in progress.\nIn August 2024, Entergy Services, on behalf of Entergy Louisiana, issued the 3 GW Alternative Market-based Mechanism Process Solar RFP which solicits up to 3,000 MW of solar photovoltaic resources across four procurement windows.  The RFP is expected to continue through 2026 with selections expected throughout the process at the conclusion of each procurement window, as applicable.\nIn November 2024, Entergy Services, on behalf of Entergy Louisiana, issued a Combined Cycle Combustion Turbine capacity and energy resources RFP which solicits up to 2,000 MW of generation.  The RFP is expected to continue through 2025 with selections expected in third quarter 2025.\nOther Procurements From Third Parties\nThe Utility operating companies have also made resource acquisitions outside of the RFP process and have also entered various limited- and long-term contracts in recent years as a result of bilateral negotiations, including among others:\n•\nIn March 2016, Entergy Arkansas (Power Block 2), Entergy Louisiana (Power Blocks 3 and 4), and Entergy New Orleans (Power Block 1) completed their respective acquisitions of the 1,980 MW (summer rating), natural gas-fired, combined-cycle gas turbine Union Power Station power blocks, each rated at 495 MW (summer rating).  The facility is located near El Dorado, Arkansas and has been in operation since July 2003;\n•\nIn October 2019, Entergy Mississippi acquired the Choctaw Generating Station, an 810 MW combined-cycle, natural gas-fired power plant.  The facility is located in Choctaw County and has been in operation since July 2003;\n•\nIn November 2020, Entergy Louisiana acquired the Washington Parish Energy Center, a 361 MW natural gas-fired peaking power plant.  The facility is located approximately 60 miles north of New Orleans on a site Entergy Louisiana purchased from Calpine in 2019.  Calpine began construction on the plant in early 2019 and Entergy Louisiana purchased the plant upon completion in November 2020;\n•\nIn June 2021, Entergy Texas acquired the Hardin County Peaking Facility, an existing 147 MW simple-cycle gas-fired peaking power plant in Kountze, Texas, previously owned by East Texas Electric Cooperative.  The facility has been in operation since January 2010;\n•\nIn November 2021, Entergy Louisiana and Elizabeth Solar, LLC executed a 20-year PPA for approximately 125 MW from a to-be-constructed solar photovoltaic energy facility located in Allen Parish, Louisiana.  In September 2022 the LPSC voted to approve this project and i\nn September 2023, Entergy Louisiana reported to the LPSC that it had entered into amended agreements related to the Elizabeth Solar facility\n.  The facility achieved commercial operation in December 2024;\n259\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\n•\nIn February 2024, Entergy Louisiana and Magnolia Power executed a 10-year Capacity Credit Purchase Agreement (CCPA) for 290 MW of MISO Zone 9, Zonal Resource Credits (ZRC) associated with the Magnolia Power Generating Station.  In December 2024 the LPSC approved the CCPA, with the delivery term set to commence on the first day of the 2025-2026 MISO planning year; and\n•\nIn May 2024, Entergy Mississippi and Cooperative Energy executed a one-year ZRC Purchase and Sale Agreement for a minimum of 300 MW of MISO Zone 10, ZRCs during the 2025-2026 MISO planning year.  This agreement was followed by a similar agreement between the parties in November 2024 for a minimum of 350 MW of MISO Zone 10, ZRCs to be transferred over the 2026-2027, 2027-2028, and 2028-2029 planning years.\nPower Through Programs\nIn February 2019, Entergy Mississippi proposed a new technologies pilot to the MPSC, which was approved in December 2019.  The pilot, previously referred to as the Power Through program, further modernized the energy grid and met customers’ evolving expectations by offering utility-owned, natural gas-fired backup generators to customers.  Following conclusion of the three-year pilot, in October 2023, Entergy Mississippi proposed full-scale implementation of commercial scale, natural gas-fired resilient distributed generation, to be installed in front of the meter at commercial and industrial customer premises.  The full-scale offering was approved by the MPSC in December 2023 along with an associated rate schedule, the Resiliency as a Service Rider Schedule.  Entergy Mississippi can dispatch the units at times of peak demand, which can mitigate the typically higher energy and capacity costs borne by all customers during times of peak energy usage.\nIn December 2020, Entergy Texas filed an application with the PUCT to amend its certificate of convenience and necessity to own and operate up to 75 MW of natural gas-fired distributed generation to be installed at commercial and industrial customer premises.  Under this proposal, Entergy Texas would own and operate a fleet of generators ranging from 100 kW to 10 MW that would supply a portion of Entergy Texas’s long-term resource needs and enhance the resiliency of Entergy Texas’s electric grid.  This fleet of generators would also be available to customers during outages to supply backup electric service as part of a program known as “Power Through.”  In its 2021 session, the Texas legislature modified the Texas Utilities Code to exempt generators under 10 megawatts from the requirement to obtain a certificate of convenience and necessity.  In addition, the PUCT announced an intent to conduct a broad rulemaking related to distributed generation and recommended that utilities with pending applications addressing distributed generation withdraw them.  Accordingly, Entergy Texas withdrew its application for a certificate of convenience and necessity and associated tariff from the PUCT without prejudice to refiling.  Entergy Texas continues to deploy certain customer-sited distributed generators under an existing PUCT-approved tariff.  In August 2022, Entergy Texas filed an application for PUCT approval of voluntary Rate Schedule Utility Owned Distributed Generation through which it would charge host customers for back-up service from customer-sited Power Through generators.  Based on the exemption enacted by the Texas legislature in 2021, Entergy Texas’s application was not required to, and did not, seek an amendment to its certificate of convenience and necessity in order to continue deploying Power Through generators.  In October 2022 two intervenors filed requests for a hearing on Entergy Texas’s application.  In October 2022 the PUCT staff filed a request that the proceeding be referred to the State Office of Administrative Hearings.  In January 2023 the PUCT announced an intent to develop certain broadly applicable reliability metrics against which to measure distributed generation resources and directed Entergy Texas to withdraw its application.  However, the PUCT did allow Entergy Texas to continue its pilot program for Power Through generators.  Entergy Texas withdrew its application.  In its 2023 session, the Texas legislature modified the Texas Utilities Code to confirm Entergy Texas’s ability to provide back-up generation service using customer-sited utility-owned distributed generation and directing the PUCT to approve rates for such service upon application by Entergy Texas.  In February 2024, Entergy Texas resubmitted its application for PUCT approval of voluntary Rate Schedule Utility Owned Distributed Generation.  Texas cities, the Office of Public Utility Counsel, Texas Industrial Energy Consumers, and Wal-Mart, Inc. have intervened as parties.  In July 2024 the proceeding was referred to the State Office of Administrative Hearings and a procedural schedule was established.  In November 2024, Entergy Texas filed an unopposed settlement agreement consistent with its as-filed request and a motion to admit evidence and remand the proceeding to the PUCT.  Also in \n260\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nNovember 2024, the ALJ with the State Office of Administrative Hearings granted the motion and remanded the proceeding to the PUCT.  In December 2024 the PUCT’s Office of Policy and Docket Management filed a proposed order for the PUCT’s consideration that would adopt the unopposed settlement.  A PUCT decision is expected in the first quarter of 2025.\nIn August 2021, Entergy Arkansas filed with the APSC an application seeking authority for a “Power Through” offering to deploy natural gas-fired distributed generation.  The application was supported by a number of letters of interest from Entergy Arkansas customers.  In May 2023 the APSC issued an order approving the Power Through offering with some modifications.  In December 2023 the APSC approved a streamlined approval process for the individual Power Through generators.  In July 2024, Entergy Arkansas filed tariff revisions to comply with the APSC’s order.  In November 2024 the APSC approved Entergy Arkansas’s compliance tariff.\nIn July 2021, Entergy Louisiana filed with the LPSC an application for authority to deploy natural gas-fired distributed generation.  The application was supported by a number of letters of interest from Entergy Louisiana customers.  In June 2022 the parties reached an uncontested settlement which, among other things, recommended approval of 120 MW of natural gas fired distributed generation and an additional 30 MW of solar and battery distributed generation, for a total distributed generation program of 150 MW.  Pursuant to the terms of the settlement agreement, Entergy Louisiana may seek to expand the distributed generation program following the earlier of two years after issuance of an order approving the settlement or the installation of 60 MW of distributed generation pursuant to this program.  The settlement was approved by the LPSC in November 2022.\nProvision of Service to Large-Scale Data Center Customers\nSubject to pending regulatory approvals, certain Utility operating companies are planning to make significant infrastructure investments in new solar projects, natural gas power plants, and other transmission and generation assets to power new large-scale data centers.  These infrastructure investments are being made primarily in connection with electric service agreements with a small number of new customers to provide power for new data centers being constructed to support artificial intelligence and other technology capabilities.\nIn January 2024, Amazon Web Services announced its plan to invest in two data centers located in Madison County, Mississippi.  In March 2024, Entergy Mississippi executed a large customer supply and service agreement to serve the two data centers.  In February 2025, Entergy Mississippi entered into a new large customer supply and service agreement with a customer.  See the “\nLiquidity and Capital Resources\n \n– \nUses of Capital\n – \nAdditional Generation and Transmission Resources\n” section of Management’s Financial Discussion and Analysis for Entergy Mississippi for additional discussion of the agreements and the investments proposed in connection with service to these facilities.\nIn October 2024, Entergy Louisiana filed an application with the LPSC requesting approval of certain generation and transmission assets proposed in connection with service to a new large-scale data center being developed by a subsidiary of Meta Platforms, Inc. in north Louisiana.  See the “\nLiquidity and Capital Resources\n \n– \nUses of Capital\n – \nAdditional Generation and Transmission Resources\n” section of Management’s Financial Discussion and Analysis for Entergy Louisiana for additional discussion of this filing and the investments proposed in connection with new service to this data center facility.\nIn addition, some of the Utility operating companies are engaged in discussions with other prospective customers concerning potential service to other data center projects.  Because of the significant demand and energy needs associated with these facilities, which generally require power at levels near their maximum level of demand for sustained periods throughout the day and throughout the year, extending service to these facilities often requires investment in incremental generation and transmission facilities, with a resulting risk of stranded costs if expected demand does not materialize, although this risk can potentially be mitigated through appropriate commercial terms subject to negotiations with the customer.  Often it is therefore necessary and appropriate for the Utility operating companies, in the electric service agreements negotiated with these customers, to include terms that provide for the \n261\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nprospective customer to contribute significant funds toward the cost of these incremental investments and that include other terms and safeguards to balance reasonably the interests of existing customers with the interests of the prospective customer.  Such safeguards take many forms but may include minimum payment obligations, lengthy contract durations, customer advances for construction, and credit and collateral requirements, among other terms.  Extending service to large data center customers also may carry significant potential benefits to the Utility operating companies’ existing customer base as well as significant economic development benefits for the states and communities in which the new data centers are sited.  These benefits include the potential for substantial contributions to the Utility operating companies’ fixed costs, which may have the effect of reducing electricity rates for all customers, as well as creating new jobs, tax revenues to local governments, indirect economic benefits, and similar benefits.  Investments in significant new generation and transmission assets, such as those necessary to serve proposed large-scale data center customers, are often subject to the requirement of receiving applicable regulatory approvals from the APSC, the LPSC, the MPSC, the City Council, or the PUCT, depending on applicable regulatory rules and laws and the circumstances of the proposed investments.\nLarge-scale data center customers often have sustainability goals and commitments that require the sourcing of power for these facilities from renewable or emissions-free resources, such as solar, wind, or nuclear resources, or installation of carbon capture or other technologies to reduce emissions.  Many of these data center customers are willing to contribute a significant portion of the cost of these facilities in order to access these sustainable or emissions-free resources, which arrangements have the potential to lower the costs of such resources as reflected in the rates of the Utility operating companies to the benefit of their other customers.  This interest of prospective large-scale data center customers in sustainable and clean generating resources coincides with the Entergy’s own sustainability commitments and informs the Utility operating companies’ strategies and resource planning solutions to serve these prospective customers’ needs.  There can be no assurance that prospective large-scale data center customers will continue to prioritize sustainability or clean generating resources, which may affect the Utility operating companies’ strategies in the future.\nInterconnections\nThe Utility operating companies’ generating units are interconnected to the electric system which operates at various voltages up to 500 kV.  These generating units consist of steam-turbine generators fueled by natural gas, coal, and pressurized and boiling water nuclear reactors; combustion-turbine generators, combined-cycle combustion turbine generators and reciprocating internal combustion engine generators that are fueled by natural gas; \nan\nd inverter-based resources interconnecting both solar photovoltaic systems and energy storage devices that participate in the MISO wholesale electric market.  Additionally, some of the Utility operating companies also offer customer services and products that include load-modifying and demand response resources that are interconnected to both the distribution and transmission systems and that also participate in the wholesale market.  Entergy’s Utility operating companies are MISO market participants and the companies’ transmission systems are interconnected with those of many neighboring utilities.  MISO is an essential link in the safe, cost-effective delivery of electric power across all or parts of 15 U.S. states and the Canadian province of Manitoba.  In addition, the Utility operating companies are members of the SERC Reliability Corporation (SERC), the Regional Entity with delegated authority from the North American Electric Reliability Corporation (NERC) for the purpose of proposing and enforcing Bulk Electric System reliability standards within 16 central and southeastern states.\nGas Property\nAs of December 31, 2024, Entergy New Orleans distributed and transported natural gas for distribution within New Orleans, Louisiana, through approximately 2,600 miles of gas pipeline.  As of December 31, 2024, the gas properties of Entergy Louisiana, which are located in and around Baton Rouge, Louisiana, were not material to Entergy Louisiana’s financial position.  See “\nHeld for Sale\n - \nNatural Gas Distribution Businesses\n” in Note 14 to the financial statements for discussion of the planned sale of the Entergy New Orleans and Entergy Louisiana natural gas distribution businesses.\n262\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nTitle\nThe Utility operating companies’ generating stations are generally located on properties owned in fee simple.  Most of the substations and transmission and distribution lines are constructed on private property or public rights-of-way pursuant to easements, servitudes, or appropriate franchises.  Some substation properties are owned in fee simple.  The Utility operating companies generally have the right of eminent domain, whereby they may perfect title to, or secure easements or servitudes on, private property for their utility operations.\nSubstantially all of the physical properties and assets owned by Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, Entergy New Orleans, Entergy Texas, and System Energy are subject to the liens of mortgages securing bonds issued by those companies.  The Lewis Creek generating station of Entergy Texas was acquired by merger with a subsidiary of Entergy Texas and is currently not subject to the lien of the Entergy Texas indenture.\nFuel Supply\nThe average fuel cost per kWh for the Utility operating companies and System Energy for the years 2022-2024 were:\nYear\nNatural Gas\nNuclear\nCoal\nRenewables (a)\nPurchased Power\nMISO Purchases (b)\n2024\n(Cents Per kWh)\nEntergy Arkansas\n2.02 \n0.57 \n3.04 \n1.67 \n10.21 \n0.37 \nEntergy Louisiana\n2.30 \n0.73 \n3.34 \n11.48 \n3.70 \n2.32 \nEntergy Mississippi\n1.86 \n— \n2.60 \n0.11 \n2.36 \n2.89 \nEntergy New Orleans (c)\n2.26 \n— \n— \n3.60 \n— \n2.75 \nEntergy Texas\n2.04 \n— \n3.33 \n3.53 \n6.80 \n2.80 \nSystem Energy\n— \n0.65 \n— \n— \n— \n— \nUtility\n2.14 \n0.65 \n3.00 \n5.85 \n3.73 \n2.38 \n2023\nEntergy Arkansas\n1.98 \n0.50 \n3.09 \n1.98 \n11.57 \n0.77 \nEntergy Louisiana\n2.34 \n0.60 \n3.22 \n10.38 \n3.76 \n2.50 \nEntergy Mississippi\n2.21 \n— \n2.82 \n0.03 \n5.86 \n1.84 \nEntergy New Orleans (c)\n2.05 \n— \n— \n3.24 \n— \n2.33 \nEntergy Texas\n2.29 \n— \n3.17 \n2.25 \n5.64 \n3.18 \nSystem Energy\n— \n0.68 \n— \n— \n— \n— \nUtility\n2.25 \n0.58 \n3.06 \n6.14 \n4.03 \n2.61 \n2022\nEntergy Arkansas\n4.98 \n0.52 \n2.93 \n2.11 \n10.90 \n(2.65)\nEntergy Louisiana\n5.50 \n0.57 \n2.84 \n10.70 \n6.95 \n6.45 \nEntergy Mississippi\n4.38 \n— \n2.85 \n0.04 \n6.53 \n6.68 \nEntergy New Orleans (c)\n5.10 \n— \n— \n(5.16)\n— \n7.21 \nEntergy Texas\n5.77 \n— \n2.83 \n6.26 \n5.61 \n6.68 \nSystem Energy\n— \n0.65 \n— \n— \n— \n— \nUtility\n5.27 \n0.57 \n2.89 \n7.00 \n6.54 \n5.95 \n(a)\nIncludes average fuel costs from both owned and purchased power resources.\n263\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\n(b)\nIncludes activity from financial transmission rights.  See Note 15 to the financial statements for discussion of financial transmission rights.\n(c)\nEntergy New Orleans’s renewables include liquidated damage payments of $0.5 million in 2024, $0.1 million in 2023, and $2.9 million in 2022 due to the delay of in-service dates related to purchased power agreements.\nActual 2024 and projected 2025 sources of generation for the Utility operating companies and System Energy, including certain power purchases from affiliates under life of unit power purchase agreements, including the Unit Power Sales Agreement, are:\n2024\n \nCT / CCGT (b)\nLegacy Gas\nNuclear (c)\nCoal\nRenewables (c) (d)\nPurchased Power (e)\nMISO Purchases (f) \nEntergy Arkansas \n29 \n%\n1 \n%\n56 \n%\n6 \n%\n4 \n%\n— \n%\n4 \n%\nEntergy Louisiana\n45 \n%\n10 \n%\n20 \n%\n1 \n%\n2 \n%\n8 \n%\n14 \n%\nEntergy Mississippi\n65 \n%\n2 \n%\n20 \n%\n7 \n%\n1 \n%\n— \n%\n5 \n%\nEntergy New Orleans\n46 \n%\n2 \n%\n41 \n%\n1 \n%\n2 \n%\n1 \n%\n7 \n%\nEntergy Texas\n32 \n%\n28 \n%\n11 \n%\n3 \n%\n2 \n%\n— \n%\n24 \n%\nSystem Energy (a)\n— \n%\n— \n%\n100 \n%\n— \n%\n— \n%\n— \n%\n— \n%\nUtility\n42 \n%\n10 \n%\n27 \n%\n3 \n%\n2 \n%\n4 \n%\n12 \n%\n2025\n \nCT / CCGT (b)\nLegacy Gas\nNuclear (c)\nCoal\nRenewables (c) (d)\nPurchased Power (e)\nMISO Purchases (f)\nEntergy Arkansas\n28 \n%\n— \n%\n59 \n%\n5 \n%\n8 \n%\n— \n%\n— \n%\nEntergy Louisiana\n52 \n%\n4 \n%\n23 \n%\n2 \n%\n3 \n%\n16 \n%\n— \n%\nEntergy Mississippi\n60 \n%\n— \n%\n30 \n%\n9 \n%\n1 \n%\n— \n%\n— \n%\nEntergy New Orleans\n51 \n%\n1 \n%\n43 \n%\n1 \n%\n3 \n%\n1 \n%\n— \n%\nEntergy Texas\n46 \n%\n32 \n%\n14 \n%\n6 \n%\n2 \n%\n— \n%\n— \n%\nSystem Energy (a)\n— \n%\n— \n%\n100 \n%\n— \n%\n— \n%\n— \n%\n— \n%\nUtility\n47 \n%\n6 \n%\n32 \n%\n4 \n%\n4 \n%\n7 \n%\n— \n%\n(a)\nCapacity and energy from System Energy’s interest in Grand Gulf is allocated as follows under the Unit Power Sales Agreement: Entergy Arkansas - 36%; Entergy Louisiana - 14%; Entergy Mississippi - 33%; and Entergy New Orleans - 17%.  Pursuant to purchased power agreements, Entergy Arkansas is selling a portion of its owned capacity and energy from Grand Gulf to Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans.  Effective January 1, 2025, Entergy Louisiana has divested all of its 14% share of capacity and energy from Grand Gulf and all of the capacity and energy from Grand Gulf that it purchases from Entergy Arkansas (approximately 2.43%) to Entergy Mississippi.  This divestiture is being effectuated initially under a designated PPA between Entergy Louisiana and Entergy Mississippi, effective as of January 1, 2025.  See Note 8 to the financial statements for discussion of Entergy Louisiana’s divestiture from the Unit Power Sales Agreement.\n(b)\nRepresents natural gas sourced for Simple Cycle Combustion Turbine units and Combined Cycle Gas Turbine units.\n(c)\nThe percentage of nuclear and renewable energy includes energy procured or produced for the benefit of certain customers through special tariffs, contracts, or renewable program subscriptions, and those customers retain the exclusive claims to all associated environmental attributes, renewable energy credits, and other relevant clean energy certifications.\n(d)\nIncludes generation from both owned and purchased power resources.\n(e)\nExcludes MISO purchases and renewables purchased through purchased power agreements.\n264\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\n(f)\nIn December 2013, Entergy integrated its transmission system into the MISO RTO.  Entergy offers all of its generation into the MISO energy market on a day-ahead and real-time basis and bids for power in the MISO energy market to serve the demand of its customers, with MISO making dispatch decisions.  The MISO purchases metric provided for 2024 is not projected for 2025.\nSome of the Utility’s gas-fired plants are also capable of using fuel oil, if necessary.  Although based on current economics the Utility does not expect fuel oil use in 2025, it is possible that various operational events including weather or pipeline maintenance may require the use of fuel oil.\nNatural Gas\nThe Utility operating companies have long-term and short-term firm and interruptible gas contracts for both supply and transportation.  Over 70% of the Utility operating companies’ power plants maintain some level of long-term firm transportation.  Long-term, short-term, and spot-market purchases satisfy gas requirements.  Entergy Texas owns a gas storage facility and Entergy Louisiana has a firm storage service agreement that provide reliable and flexible natural gas service to certain generating stations.\nMany factors, including wellhead deliverability, storage, pipeline capacity, and demand requirements of end users, influence the availability and price of natural gas supplies for power plants.  Demand is primarily tied to weather conditions as well as to the prices and availability of other energy sources.  Pursuant to federal and state regulations, gas supplies to power plants may be interrupted during periods of shortage.  To the extent natural gas supplies are disrupted or natural gas prices significantly increase, the Utility operating companies may in some instances use alternate fuels, such as oil when available, or rely to a larger extent on coal, nuclear generation, and purchased power.\nCoal\nEntergy Arkansas has committed to seven one- to three-year contracts that will supply at least 85% of the total coal supply needs in 2025.  These contracts are staggered in term so that not all contracts have to be renewed the same year.  If needed, additional Powder River Basin (PRB) coal will be purchased through contracts with a term of less than one year to provide the remaining supply needs.  Based on the high cost of alternate sources, modes of transportation, and infrastructure improvements necessary for its delivery, no alternative coal consumption is expected at Entergy Arkansas during 2025.  Coal will be transported to Arkansas via an existing Union Pacific transportation agreement that is expected to provide all of Entergy Arkansas’s rail transportation requirements for 2025.\nEntergy Louisiana has committed to three two- to three-year contracts that will supply at least 90% of Nelson Unit 6 coal needs in 2025.  If needed, additional PRB coal will be purchased through contracts with a term of less than one year to provide the remaining supply needs.  For the same reasons as the Entergy Arkansas plants, no alternative coal consumption is expected at Nelson Unit 6 during 2025.  Coal will be transported to Nelson via an existing transportation agreement that is expected to provide all of Entergy Louisiana’s rail transportation requirements for 2025.\nFor the year ended December 31, 2024, coal transportation delivery rates to Entergy Arkansas- and Entergy Louisiana-operated coal-fired units were able to fully meet supply needs and obligations, and delivery rates in 2025 are expected to continue to be consistent with 2024 delivery rates in meeting supply needs and obligations.  Both Entergy Arkansas and Entergy Louisiana control a sufficient number of railcars to satisfy the rail transportation requirement.\nThe operator of Big Cajun 2 - Unit 3, Louisiana Generating, LLC, has advised Entergy Louisiana and Entergy Texas that it has adequate rail car and barge capacity to meet the volumes of PRB coal requested for 2025.  \n265\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nEntergy Louisiana’s and Entergy Texas’s coal nomination requests to Big Cajun 2 - Unit 3 are made on an annual basis.\nNuclear Fuel\nThe nuclear fuel cycle consists of the following:\n•\nmining and milling of uranium ore to produce a concentrate;\n•\nconversion of the concentrate to uranium hexafluoride gas;\n•\nenrichment of the uranium hexafluoride gas;\n•\nfabrication of nuclear fuel assemblies for use in fueling nuclear reactors; and\n•\ndisposal of spent fuel.\nThe Registrant Subsidiaries that own nuclear plants, Entergy Arkansas, Entergy Louisiana, and System Energy, are responsible through a shared regulated uranium pool for contracts to acquire nuclear material to be used in fueling Entergy’s Utility nuclear units.  These companies own the materials and services in this shared regulated uranium pool on a pro rata fractional basis determined by the nuclear generation capability of each company.  Any liabilities for obligations of the pooled contracts are on a several but not joint basis.  The shared regulated uranium pool maintains inventories of nuclear materials during the various stages of processing.  The Registrant Subsidiaries purchase enriched uranium hexafluoride for their nuclear plant reload requirements at the average inventory cost from the shared regulated uranium pool.  Entergy Operations, Inc. contracts separately for the fabrication of nuclear fuel as agent on behalf of each of the Registrant Subsidiaries that owns a nuclear plant.  All contracts for the disposal of spent nuclear fuel are between the DOE and the owner of a nuclear power plant.\nBased upon currently planned fuel cycles, the Utility nuclear units have a diversified portfolio of contracts and inventory that provides substantially adequate nuclear fuel materials and conversion and enrichment services at what Entergy believes are reasonably predictable or fixed prices through 2027.  Entergy’s ability to purchase nuclear fuel at reasonably predictable prices, however, depends upon the performance reliability of uranium miners, including their ability to work through supply disruptions caused by global events, such as the COVID-19 pandemic, or national events, such as political disruption, or trade-related governmental actions, such as tariffs and other measures.  There are a number of possible supply alternatives that may be accessed to mitigate any supplier performance failure, including potentially drawing upon Entergy’s inventory intended for later generation periods depending upon its risk management strategy at that time, although the pricing of any alternate uranium supply from the market will be dependent upon the market for uranium supply at that time.  In addition, some nuclear fuel contracts are on a non-fixed price basis subject to prevailing prices at the time of delivery.\nEntergy’s ability to assure nuclear fuel supply also depends upon the performance reliability of conversion, enrichment, and fabrication services providers.  There are fewer of these providers than for uranium.  For conversion and enrichment services, like uranium, Entergy diversifies its supply by supplier and country and may take special measures as needed to ensure supply of enriched uranium for the reliable fabrication of nuclear fuel.  For fabrication services, each plant is dependent upon the effective performance of the fabricator of that plant’s nuclear fuel, therefore, Entergy provides additional monitoring, inspection, and oversight for the fabrication process to assure reliability and quality.\nThe effects of market price changes may be reduced and deferred by risk management strategies, such as negotiation of floor and ceiling amounts for long-term contracts, buying for inventory or entering into forward physical contracts at fixed prices when Entergy believes it is appropriate and useful.  Entergy buys uranium and conversion and enrichment services from a diversified mix of sellers located in a diversified mix of countries, and from time to time purchases from nearly all qualified reliable major market participants worldwide that sell into the United States.\n266\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nEntergy Arkansas, Entergy Louisiana, and System Energy each have made arrangements to lease nuclear fuel and related equipment and services.  The lessors, which are consolidated in the financial statements of Entergy and the applicable Registrant Subsidiary, finance the acquisition and ownership of nuclear fuel through credit agreements and the issuance of notes.  These credit facilities are subject to periodic renewal, and the notes are issued periodically, typically for terms between three and seven years.\nNatural Gas Purchased for Resale\nEntergy New Orleans has several suppliers of natural gas.  Its system is interconnected with one interstate and three intrastate pipelines.  Entergy New Orleans has a “no-notice” service gas purchase contract with Symmetry Energy Solutions which ensures Entergy New Orleans gas delivery at specific delivery points and at any volume within the minimum and maximum set forth in the contract amounts.  The Symmetry Energy Solutions gas supply is transported to Entergy New Orleans pursuant to a transportation service agreement with Gulf South Pipeline Co.  This service is subject to FERC-approved rates.  Entergy New Orleans also makes interruptible spot market purchases.\nEntergy Louisiana has been purchasing natural gas for resale since April 2024 under a firm contract with Symmetry Energy Solutions.  Entergy Louisiana’s prior contract with Sequent Energy Management L.P. was not renewed and ended in March 2024.  The gas is delivered through a combination of intrastate and interstate pipelines.\nAs a result of the implementation of FERC-mandated interstate pipeline restructuring in 1993, curtailments of interstate gas supply could occur if Entergy Louisiana’s or Entergy New Orleans’s suppliers failed to perform their obligations to deliver gas under their supply agreements.  Gulf South Pipeline Co. could curtail transportation capacity only in the event of pipeline system constraints.\nFederal Regulation of the Utility\nState or local regulatory authorities, as described above, regulate the retail rates of the Utility operating companies.  The FERC regulates wholesale sales of electricity rates and interstate transmission of electricity, including System Energy’s sales of capacity and energy from Grand Gulf to Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans pursuant to the Unit Power Sales Agreement.  See Note 2 to the financial statements for further discussion of federal regulation proceedings.\nTransmission and MISO Markets\nIn December 2013 the Utility operating companies integrated into the MISO RTO.  Although becoming a member of MISO did not affect the ownership by the Utility operating companies of their transmission facilities or the responsibility for maintaining those facilities, MISO maintains functional control over the combined transmission systems of its members and administers wholesale energy and ancillary services markets for market participants in the MISO region, including the Utility operating companies.  MISO also exercises functional control of transmission planning and congestion management and provides schedules and pricing for the commitment and dispatch of generation that is offered into MISO’s markets, as well as pricing for load that bids into the markets.  The Utility operating companies sell capacity, energy, and ancillary services on a bilateral basis to certain wholesale customers and offer available electricity production of their owned and controlled generating facilities into the MISO resource adequacy construct (the annual Planning Resource Auction), as well as the MISO day-ahead and real-time energy markets pursuant to the MISO tariff and market rules.  The resource adequacy construct provided under the MISO tariff confers certain rights and imposes certain obligations upon load-serving entities, including the Utility operating companies, that are served from the transmission systems subject to MISO’s functional control, including the transmission facilities of the Utility operating companies. \n The MISO tariff is subject to change and has recently undergone significant changes, including changes to its overall capacity accreditation methodology.  MISO is now pursuing a larger scale reassessment of its overall accreditation practices, including accreditation of renewable resources.\n267\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nMISO administers a process governed by the MISO tariff and subject to the FERC regulation that governs the interconnection of new generation resources to the transmission system under MISO’s functional control.  This process generally involves parties that wish to interconnect new generation resources submitting to MISO requests to do so, which are then studied and analyzed by MISO, with the participation of its member transmission owners, to determine if the interconnection of such generators requires new transmission facilities to ensure the continued reliable operations of the grid.  Under MISO’s current tariff, these requests are studied and considered in clusters, generally in the order in which they are received – a system of priority known as the MISO interconnection queue.\nEach Utility operating company has its own transmission pricing zone and a formula rate template (included as Attachment O to the MISO tariff) used to establish transmission rates within MISO.  The terms and conditions of the MISO tariff, including provisions related to the design and implementation of wholesale markets and the allocation of transmission upgrade costs, are subject to regulation by the FERC.\nIn addition, orders from each of the Utility operating companies’ respective retail regulators generally require that the Utility operating companies make periodic filings, or generally allow the retail regulator to direct the making of such filings, setting forth the results of analysis of the costs and benefits realized from MISO membership as well as the projected costs and benefits of continued membership in MISO and/or requesting approval of their continued membership in MISO.\nSystem Energy and Related Agreements\nSystem Energy recovers costs related to its interest in Grand Gulf through rates charged to Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans for capacity and energy under the Unit Power Sales Agreement (described below).  In 1998 the FERC approved requests by Entergy Arkansas and Entergy Mississippi to accelerate a portion of their Grand Gulf purchased power obligations.  Entergy Arkansas’s and Entergy Mississippi’s acceleration of Grand Gulf purchased power obligations ceased effective July 2001 and July 2003, respectively, as approved by the FERC.  See Note 2 to the financial statements for discussion of proceedings at the FERC related to System Energy.\nUnit Power Sales Agreement\nThe Unit Power Sales Agreement allocates capacity, energy, and the related costs from System Energy’s ownership and leasehold interests in Grand Gulf to Entergy Arkansas (36%), Entergy Louisiana (14%), Entergy Mississippi (33%), and Entergy New Orleans (17%).  Effective January 1, 2025, Entergy Louisiana is divesting all of its rights, entitlements, and interests in such capacity and energy to Entergy Mississippi.  See Note 8 to the financial statements for discussion of Entergy Louisiana’s divestiture from the Unit Power Sales Agreement.  Each of these companies is obligated to make payments to System Energy for its entitlement of capacity and energy on a full cost-of-service basis regardless of the quantity of energy delivered.  Payments under the Unit Power Sales Agreement are System Energy’s only source of operating revenue.  The financial condition of System Energy depends upon the continued commercial operation of Grand Gulf and the receipt of such payments.  Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans generally recover payments made under the Unit Power Sales Agreement through rates charged to their customers; however, as discussed further below, for the majority of 2025 and until it is removed from the Unit Power Sales Agreement, Entergy Louisiana will recover its payments made under the Unit Power Sales Agreement from Entergy Mississippi under a designated PPA in connection with Entergy Louisiana’s divesting to Entergy Mississippi its 14% share of capacity and energy from Grand Gulf under the Unit Power Sales Agreement and its 2.43% share of capacity and energy from Entergy Arkansas under the MSS-4 replacement tariff.\nIn the case of Entergy Arkansas and Entergy Louisiana, payments are also recovered through sales of electricity from their respective retained shares of Grand Gulf.  Under a settlement agreement entered into with the APSC in 1985 and amended in 1988, Entergy Arkansas retains 22% of its 36% share of Grand Gulf-related costs \n268\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nand recovers the remaining 78% of its share in retail rates.  In the event that Entergy Arkansas is not able to sell its retained share to third parties, it may sell such energy to its retail customers at a price equal to its avoided cost, which is currently less than Entergy Arkansas’s cost from its retained share.  Entergy Arkansas has life-of-resources purchased power agreements with Entergy Louisiana and Entergy New Orleans that sell a portion of the output of Entergy Arkansas’s retained share of Grand Gulf to those companies.  The remainder of Entergy Arkansas’s retained share is sold to Entergy Mississippi through a separate life-of-resource purchase power agreement with Entergy Mississippi.  Entergy Arkansas also has a life-of-resources purchased power agreement with Entergy Mississippi to sell a portion of the output of Entergy Arkansas’s non-retained share of Grand Gulf.  Entergy Mississippi was granted cost recovery for those purchases by the MPSC through its annual unit power cost rate mechanism.\nIn a series of LPSC orders, court decisions, and agreements from late 1985 to mid-1988, Entergy Louisiana was granted cost recovery with respect to costs associated with Entergy Louisiana’s share of capacity and energy from Grand Gulf, subject to certain terms and conditions.  Prior to the divestiture of Grand Gulf energy and capacity to Entergy Mississippi, Entergy Louisiana retained and did not recover from retail ratepayers 18% of its 14% share of the costs of Grand Gulf capacity and energy and recovers the remaining 82% of its share in rates.  Entergy Louisiana was also allowed to recover through the fuel adjustment clause at 4.6 cents per kWh for the energy related to its retained portion of these costs.  Alternatively, Entergy Louisiana was permitted to sell such energy to non-affiliated parties at prices above the fuel adjustment clause amount, subject to the LPSC’s approval.\nEffective January 1, 2025, Entergy Louisiana has divested all of its 14% share of capacity and energy from Grand Gulf and all of the capacity and energy from Grand Gulf that it purchases from Entergy Arkansas (approximately 2.43%) to Entergy Mississippi.  This divestiture is being effectuated initially under a designated PPA between Entergy Louisiana and Entergy Mississippi, which was accepted by the FERC in November 2024.  The MPSC approved the MSS-4 replacement PPA, effective as of January 1, 2025.  In 2025, System Energy, Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans expect to file an amendment to the UPSA that will modify the purchasers’ entitlements to capacity and energy from System Energy’s share of Grand Gulf to reflect Entergy Louisiana’s divestiture, and when that amendment becomes effective, the designated PPA between Entergy Louisiana and Entergy Mississippi will terminate and Entergy Louisiana will cease to be a System Energy customer.  The effectiveness of that amendment to the Unit Power Sales Agreement will be subject to the review and acceptance of the FERC.\nAvailability Agreement\nThe Availability Agreement among System Energy and Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans was entered into in 1974 in connection with the original financing by System Energy of Grand Gulf.  The Availability Agreement provides that System Energy make available to Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans all capacity and energy available from System Energy’s share of Grand Gulf.\nEntergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans also agreed severally to pay System Energy monthly for the right to receive capacity and energy from Grand Gulf in amounts that (when added to any amounts received by System Energy under the Unit Power Sales Agreement) would at least equal System Energy’s total operating expenses for Grand Gulf (including depreciation at a specified rate and expenses incurred in a permanent shutdown of Grand Gulf) and interest charges.\nThe allocation percentages under the Availability Agreement are fixed as follows: Entergy Arkansas - 17.1%; Entergy Louisiana - 26.9%; Entergy Mississippi - 31.3%; and Entergy New Orleans - 24.7%.  The allocation percentages under the Availability Agreement would remain in effect and would govern payments made under such agreement in the event of a shortfall of operating expense funds available to System Energy from other sources, including payments under the Unit Power Sales Agreement.\n269\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nSystem Energy has assigned its rights to payments and advances from Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans under the Availability Agreement as security for all of its outstanding series of first mortgage bonds, as well as for its outstanding term loan and the pollution control revenue refunding bonds issued on its behalf.  In these assignments, Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans further agreed that, in the event they were prohibited by governmental action from making payments under the Availability Agreement (for example, if the FERC reduced or disallowed such payments as constituting excessive rates), they would then make subordinated advances to System Energy in the same amounts and at the same times as the prohibited payments.  System Energy would not be allowed to repay these subordinated advances so long as it remained in default under the related indebtedness or in other similar circumstances.\nEach of the assignment agreements relating to the Availability Agreement provides that Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans will make payments directly to System Energy.  However, if there is an event of default, those payments must be made directly to the holders of indebtedness that are the beneficiaries of such assignment agreements.  The payments must be made pro rata according to the amount of the respective obligations secured.\nThe obligations of Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans to make payments under the Availability Agreement are subject to the receipt and continued effectiveness of all necessary regulatory approvals.  Sales of capacity and energy under the Availability Agreement would require that the Availability Agreement be submitted to the FERC for approval with respect to the terms of such sale.  No such filing with the FERC has been made because sales of capacity and energy from Grand Gulf are being made pursuant to the Unit Power Sales Agreement.  If, for any reason, sales of capacity and energy are made in the future pursuant to the Availability Agreement, the jurisdictional portions of the Availability Agreement would be submitted to the FERC for approval.\nSince commercial operation of Grand Gulf began, payments under the Unit Power Sales Agreement to System Energy have exceeded the amounts payable under the Availability Agreement and, therefore, no payments under the Availability Agreement to System Energy have ever been required.  However, if Entergy Arkansas or Entergy Mississippi fails to make its Unit Power Sales Agreement payments, and System Energy is unable to obtain funds from other sources, Entergy Louisiana and Entergy New Orleans could become subject to claims or demands by System Energy or certain of its creditors for payments or advances under the Availability Agreement (or the assignments thereof) equal to the difference between their required Unit Power Sales Agreement payments and their required Availability Agreement payments because their allocated shares under the Availability Agreement exceed their allocated shares under the Unit Power Sales Agreement.\nThe Availability Agreement may be terminated, amended, or modified by mutual agreement of the parties thereto, without further consent of any assignees or other creditors.  Effective January 1, 2025, Entergy Mississippi entered into a Reimbursement Agreement with Entergy Louisiana, under which it agreed to assume Entergy Louisiana’s rights and obligations under and to hold Entergy Louisiana harmless with respect to the Availability Agreement.  That Reimbursement Agreement is intended to be in effect until the Unit Power Sales Agreement is modified to reflect Entergy Mississippi’s increased entitlements to System Energy’s share of Grand Gulf energy and capacity, following Entergy Louisiana’s divestiture of its combined 16.43% share of the Unit Power Sales Agreement and purchased power agreement entitlements to energy and capacity to Entergy Mississippi.  When the Unit Power Sales Agreement modifications become effective, System Energy also anticipates implementing an Availability Agreement that reflects the Unit Power Sales Agreement entitlements of Entergy Arkansas, Entergy Louisiana, and Entergy New Orleans.\nIn December 2024, System Energy, Entergy Louisiana, Entergy Arkansas, Entergy Mississippi, and Entergy New Orleans agreed to terminate the Reallocation Agreement.  See Note 8 to the financial statements for further discussion of the reallocation agreement.\n270\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nService Companies\nEntergy Services, a limited liability company wholly-owned by Entergy Corporation, provides management, administrative, accounting, legal, engineering, and other services primarily to the Utility operating companies, as well as to Entergy’s non-utility operations business.  Entergy Operations is also wholly-owned by Entergy Corporation and provides nuclear management, operations, and maintenance services under contract for ANO, River Bend, Waterford 3, and Grand Gulf, subject to the owner oversight of Entergy Arkansas, Entergy Louisiana, and System Energy, respectively.  Entergy Services and Entergy Operations provide their services to the Utility operating companies and System Energy on an “at cost” basis, pursuant to cost allocation methodologies for these service agreements that were approved by the FERC.\nJurisdictional Separation of Entergy Gulf States, Inc. into Entergy Gulf States Louisiana and Entergy Texas\nEffective December 31, 2007, Entergy Gulf States, Inc. completed a jurisdictional separation into two vertically integrated utility companies, one operating under the sole retail jurisdiction of the PUCT, Entergy Texas, and the other operating under the sole retail jurisdiction of the LPSC, Entergy Gulf States Louisiana.  Entergy Texas owns all Entergy Gulf States, Inc. distribution and transmission assets located in Texas, the gas-fired generating plants located in Texas, undivided 42.5% ownership shares of Entergy Gulf States, Inc.’s 70% ownership interest in Nelson Unit 6 and 42% ownership interest in Big Cajun 2, Unit 3, which are coal-fired generating plants located in Louisiana, and other assets and contract rights to the extent related to utility operations in Texas.  Entergy Louisiana, as successor in interest to Entergy Gulf States Louisiana, owns all of the remaining assets that were owned by Entergy Gulf States, Inc.  On a book value basis, approximately 58.1% of the Entergy Gulf States, Inc. assets were allocated to Entergy Gulf States Louisiana and approximately 41.9% were allocated to Entergy Texas.\nEntergy Texas purchases from Entergy Louisiana pursuant to a life-of-unit purchased power agreement a 42.5% share of capacity and energy from the 70% of River Bend subject to retail regulation.  Entergy Texas was allocated a share of River Bend’s nuclear and environmental liabilities that is identical to the share of the plant’s output purchased by Entergy Texas under the purchased power agreement.  In connection with the termination of the System Agreement effective August 31, 2016, the purchased power agreements that were put in place for certain legacy units at the time of the jurisdictional separation were also terminated at that time.\nEntergy Louisiana and Entergy Gulf States Louisiana Business Combination\nOn October 1, 2015, the businesses formerly conducted by Entergy Louisiana (Old Entergy Louisiana) and Entergy Gulf States Louisiana (Old Entergy Gulf States Louisiana) were combined into a single public utility.  In order to effect the business combination, under the Texas Business Organizations Code (TXBOC), Old Entergy Louisiana allocated substantially all of its assets to a new subsidiary, Entergy Louisiana Power, LLC, a Texas limited liability company (New Entergy Louisiana), and New Entergy Louisiana assumed the liabilities of Old Entergy Louisiana, in a transaction regarded as a merger under the TXBOC.  Under the TXBOC, Old Entergy Gulf States Louisiana allocated substantially all of its assets to a new subsidiary (New Entergy Gulf States Louisiana) and New Entergy Gulf States Louisiana assumed the liabilities of Old Entergy Gulf States Louisiana, in a transaction regarded as a merger under the TXBOC.  New Entergy Gulf States Louisiana then merged into New Entergy Louisiana with New Entergy Louisiana surviving the merger.  Thereupon, Old Entergy Louisiana changed its name from “Entergy Louisiana, LLC” to “EL Investment Company, LLC” and New Entergy Louisiana changed its name from “Entergy Louisiana Power, LLC” to “Entergy Louisiana, LLC” (Entergy Louisiana).  With the completion of the business combination, Entergy Louisiana holds substantially all of the assets, and has assumed the liabilities, of Old Entergy Louisiana and Old Entergy Gulf States Louisiana.\n271\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nOther Business Activities\nEntergy’s non-utility operations business includes the ownership of interests in non-nuclear power plants that sell the electric power produced by those plants to wholesale customers.  Entergy’s non-utility operations business also provides decommissioning-related services to nuclear power plants owned by non-affiliated entities.\nProperty\nEntergy’s non-utility operations business owns interests in the following non-nuclear power plants:\nPlant\nLocation\nOwnership\nNet Owned Capacity (a)\nType\nIndependence Unit 2; 842 MW\nNewark, AR\n14%\n121 MW(b)\nCoal\nNelson Unit 6; 550 MW\nWestlake, LA\n11%\n60 MW(b)\nCoal\n(a)\n“Net Owned Capacity” refers to the nameplate rating on the generating unit.\n(b)\nThe owned MW capacity is the portion of the plant capacity owned by Entergy’s non-utility operations business.  For a complete listing of Entergy’s jointly-owned generating stations, refer to “\nJointly-Owned Generating Stations\n” in Note 1 to the financial statements.\nAll generation owned by Entergy’s non-utility operations business falls under the authority of MISO.  Customers for the sale of both energy and capacity from its owned generation and contracted power purchases include retail power providers, utilities, electric power co-operatives, power trading organizations, and other power generation companies.  The majority of the non-utility operations businesses’ owned generation and contracted power purchases are sold under a cost-based contract.\nTLG Services, a subsidiary in Entergy’s non-utility operations business, offers decommissioning, engineering, and related services to nuclear power plant owners.\nRegulation of Entergy’s Business\nFederal Power Act\nThe Federal Power Act provides the FERC the authority to regulate:\n•\nthe transmission and wholesale sale of electric energy in interstate commerce;\n•\nthe reliability of the high voltage interstate transmission system through reliability standards;\n•\nsale or acquisition of certain assets;\n•\nsecurities issuances;\n•\nthe licensing of certain hydroelectric projects;\n•\ncertain other activities, including accounting policies and practices of electric and gas utilities; and\n•\nchanges in control of FERC jurisdictional entities or rate schedules.\nThe Federal Power Act gives the FERC jurisdiction over the rates charged by System Energy for Grand Gulf capacity and energy provided to Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans.  The FERC also has jurisdiction over the rates charged by Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, Entergy New Orleans, and Entergy Texas to unaffiliated wholesale customers.  In addition, the FERC also regulates wholesale power sales between the Utility operating companies.  Moreover, the FERC regulates the MISO RTO, an independent entity that maintains functional control over the combined transmission systems of its members and administers wholesale energy, capacity, and ancillary services markets for market participants in the MISO region, including the Utility operating companies.  FERC regulation of the MISO RTO includes regulation of the design and implementation of the wholesale markets administered by the MISO RTO, as well as the rates, terms, \n272\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nand conditions of open access transmission service over the member systems and the allocation of costs associated with transmission upgrades.\nEntergy Arkansas holds a FERC license that expires in 2053 for two hydroelectric projects totaling 65 MW of capacity.\nState Regulation\nUtility\nEntergy Arkansas is subject to regulation by the APSC as to the following:\n•\nutility service;\n•\nutility service areas;\n•\nretail rates and charges, including depreciation rates;\n•\nfuel cost recovery, including audits of the energy cost recovery rider;\n•\nterms and conditions of service;\n•\nservice standards;\n•\nthe acquisition, sale, or lease of any public utility plant or property constituting an operating unit or system;\n•\ncertificates of convenience and necessity and certificates of environmental compatibility and public need, as applicable, for generating and transmission facilities;\n•\navoided cost payments to non-exempt Qualifying Facilities;\n•\nnet energy metering;\n•\nintegrated resource planning;\n•\nutility mergers and acquisitions and other changes of control; and\n•\nthe issuance and sale of certain securities.\nAdditionally, Entergy Arkansas serves a limited number of retail customers in Tennessee.  Pursuant to legislation enacted in Tennessee, Entergy Arkansas is subject to complaints before the Tennessee Regulatory Authority only if it fails to treat its retail customers in Tennessee in the same manner as its retail customers in Arkansas.  Additionally, Entergy Arkansas maintains limited facilities in Missouri but does not provide retail electric service to customers in Missouri.  Although Entergy Arkansas obtained a certificate with respect to its Missouri facilities, Entergy Arkansas is not subject to retail ratemaking jurisdiction in Missouri.\nEntergy Louisiana’s electric and gas business is subject to regulation by the LPSC as to the following:\n•\nutility service;\n•\nretail rates and charges, including depreciation rates;\n•\nfuel cost recovery, including audits of the fuel adjustment clause, environmental adjustment charge, and purchased gas adjustment charge;\n•\nterms and conditions of service;\n•\nservice standards;\n•\ncertification of certain transmission projects;\n•\ncertification of capacity acquisitions, both for owned capacity and for purchase power contracts that exceed either 5 MW or one year in term;\n•\nprocurement process to acquire capacity at or above 50 MW;\n•\naudits of the energy efficiency rider;\n•\navoided cost payment to non-exempt Qualifying Facilities;\n•\nintegrated resource planning;\n•\nnet energy metering; and\n•\nutility mergers and acquisitions and other changes of control.\n273\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nEntergy Mississippi is subject to regulation by the MPSC as to the following:\n•\nutility service;\n•\nutility service areas;\n•\nretail rates and charges, including depreciation rates;\n•\nfuel cost recovery, including audits of the energy cost recovery mechanism;\n•\nterms and conditions of service;\n•\nservice standards;\n•\ncertification of generating facilities, certain transmission projects, and certain distribution projects with construction costs greater than $10 million;\n•\navoided cost payments to non-exempt Qualifying Facilities;\n•\nintegrated resource planning;\n•\nnet energy metering; and\n•\nutility mergers, acquisitions, and other changes of control.\nEntergy Mississippi is also subject to regulation by the APSC as to the certificate of environmental compatibility and public need for the Independence Station, which is located in Arkansas.\nEntergy New Orleans is subject to regulation by the City Council as to the following:\n•\nutility service;\n•\nretail rates and charges, including depreciation rates;\n•\nfuel cost recovery, including audits of the fuel adjustment charge and purchased gas adjustment charge;\n•\nterms and conditions of service;\n•\nservice standards;\n•\naudit of the environmental adjustment charge;\n•\ncertification of the construction or extension of any new plant, equipment, property, or facility that comprises more than 2% of the utility’s rate base;\n•\nintegrated resource planning;\n•\nnet energy metering;\n•\navoided cost payments to non-exempt Qualifying Facilities;\n•\nissuance and sale of certain securities; and\n•\nutility mergers and acquisitions and other changes of control.\nTo the extent authorized by governing legislation, Entergy Texas is subject to the original jurisdiction of the municipal authorities of a number of incorporated cities in Texas with appellate jurisdiction over such matters residing in the PUCT.  Entergy Texas is also subject to regulation by the PUCT as to the following:\n•\nretail rates and charges, including depreciation rates, and terms and conditions of service in unincorporated areas of its service territory, and in municipalities that have ceded jurisdiction to the PUCT;\n•\nfuel recovery, including reconciliations (audits) of the fuel adjustment charges;\n•\nservice standards;\n•\ncertification of certain transmission and generation projects;\n•\nutility service areas, including extensions into new areas;\n•\navoided cost payments to non-exempt Qualifying Facilities;\n•\nnet energy metering; and\n•\nutility mergers, sales/acquisitions/leases of plants over $10 million, sales of greater than 50% voting stock of utilities, and transfers of controlling interest in or operation of utilities.\n274\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nRegulation of the Nuclear Power Industry\nAtomic Energy Act of 1954 and Energy Reorganization Act of 1974\nUnder the Atomic Energy Act of 1954 and the Energy Reorganization Act of 1974, the operation of nuclear plants is heavily regulated by the NRC, which has broad power to impose licensing and safety-related requirements.  The NRC has broad authority to impose civil penalties or shut down a unit, or both, depending upon its assessment of the severity of the situation, until compliance is achieved.  Entergy Arkansas, Entergy Louisiana, and System Energy, as owners of all or portions of ANO, River Bend and Waterford 3, and Grand Gulf, respectively, and Entergy Operations, as the licensee and operator of these units, are subject to the jurisdiction of the NRC.\nNuclear Waste Policy Act of 1982\nSpent Nuclear Fuel\nUnder the Nuclear Waste Policy Act of 1982, the DOE is required, for a specified fee, to construct storage facilities for, and to dispose of, all spent nuclear fuel and other high-level radioactive waste generated by domestic nuclear power reactors.  Entergy’s nuclear owner/licensee subsidiaries have been charged fees for the estimated future disposal costs of spent nuclear fuel in accordance with the Nuclear Waste Policy Act of 1982.  The affected Entergy companies entered into contracts with the DOE, whereby the DOE is to furnish disposal services at a cost of one mill per net kWh generated and sold after April 7, 1983, plus a one-time fee for generation prior to that date.  Entergy Arkansas is the only one of the Utility operating companies that generated electric power with nuclear fuel prior to that date and has a recorded liability as of December 31, 2024 of $216 million for the one-time fee.  The fees payable to the DOE may be adjusted in the future to assure full recovery.  Entergy considers all costs incurred for the disposal of spent nuclear fuel, except accrued interest, to be proper components of nuclear fuel expense.  Provisions to recover such costs have been or will be made in applications to regulatory authorities for the Utility plants.  Entergy’s total spent fuel fees to date, including the one-time fee liability of Entergy Arkansas, have surpassed $1.7 billion (exclusive of amounts relating to Entergy plants that were paid or are owed by prior owners of those plants).\nThe permanent spent fuel repository in the U.S. has been legislated to be Yucca Mountain, Nevada.  The DOE is required by law to proceed with the licensing of the Yucca Mountain repository (the DOE filed the license application in June 2008) and, after the license is granted by the NRC, proceed with the repository construction and commencement of receipt of spent fuel.  Because the DOE has not begun accepting spent fuel, it is in non-compliance with the Nuclear Waste Policy Act of 1982 and is in partial breach of its spent fuel disposal contracts.  The DOE continues to delay meeting its obligation.  Specific steps were taken to discontinue the Yucca Mountain project, including a motion to the NRC to withdraw the license application with prejudice and the establishment of a commission to develop recommendations for alternative spent fuel storage solutions.  In August 2013 the U.S. Court of Appeals for the D.C. Circuit ordered the NRC to continue with the Yucca Mountain license review, but only to the extent of funds previously appropriated by Congress for that purpose and not yet used.  Although the NRC completed the safety evaluation report for the license review in 2015, the previously appropriated funds are not sufficient to complete the review, including required hearings.  The government has taken no effective action to date related to the recommendations of the appointed spent fuel study commission.  Accordingly, large uncertainty remains regarding the time frame under which the DOE will begin to accept spent fuel from Entergy’s facilities for storage or disposal.  As a result, continuing future expenditures will be required to increase spent fuel storage capacity at Entergy’s nuclear sites.\nFollowing the defunding of the Yucca Mountain spent fuel repository program, the National Association of Regulatory Utility Commissioners and others sued the government seeking cessation of collection of the one mill per net kWh generated and sold after April 7, 1983 fee.  In November 2013 the D.C. Circuit ordered the DOE to submit a proposal to Congress to reset the fee to zero until the DOE complies with the Nuclear Waste Policy Act or \n275\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nCongress enacts an alternative waste disposal plan.  In January 2014 the DOE submitted the proposal to Congress under protest, and also filed a petition for rehearing with the D.C. Circuit.  The petition for rehearing was denied.  The zero spent fuel fee went into effect prospectively in May 2014.\nAs a result of the DOE’s failure to begin disposal of spent nuclear fuel in 1998 pursuant to the Nuclear Waste Policy Act of 1982 and the spent fuel disposal contracts, Entergy’s nuclear owner/licensee subsidiaries have incurred and will continue to incur damages.  These subsidiaries have been, and continue to be, involved in litigation to recover the damages caused by the DOE’s delay in performance.  See Note 8 to the financial statements for discussion of final judgments recorded by Entergy in 2022, 2023, and 2024 related to Entergy’s nuclear owner/licensee subsidiaries’ litigation with the DOE.\n  Through \n2024\n, Entergy’s subsidiaries have won and collected on judgments against the government totaling approximately\n $1.2 billion.\nPending DOE acceptance and disposal of spent nuclear fuel, the owners of nuclear plants are providing their own spent fuel storage.  Storage capability additions using dry casks began operations at ANO in 1996, at River Bend in 2005, at Grand Gulf in 2006, and at Waterford 3 in 2011.  These facilities will be expanded as needed.\nNuclear Plant Decommissioning\nEntergy Arkansas, Entergy Louisiana, and System Energy are entitled to recover from customers through electric rates the estimated decommissioning costs for ANO, Waterford 3, and Grand Gulf, respectively.  In addition, Entergy Louisiana and Entergy Texas are entitled to recover from customers through electric rates the estimated decommissioning costs for the portion of River Bend subject to retail rate regulation.  The collections are deposited in trust funds that can only be used in accordance with NRC and other applicable regulatory requirements.  Entergy periodically reviews and updates the estimated decommissioning costs to reflect inflation and changes in regulatory requirements and technology, and then makes applications to the regulatory authorities to reflect, in rates, the changes in projected decommissioning costs.\nIn December 2018 the APSC ordered collections in rates for decommissioning ANO 2 and found that ANO 1’s decommissioning was adequately funded without additional collections.  In November 2021, Entergy Arkansas filed a revised decommissioning cost recovery tariff for ANO indicating that both ANO 1 and 2 decommissioning trusts were adequately funded without further collections, and in December 2021 the APSC ordered zero collections for ANO 1 and 2 decommissioning.  In November 2022, Entergy Arkansas filed a revised decommissioning cost recovery tariff for ANO indicating that ANO 1’s decommissioning trust was adequately funded, but that ANO 2’s fund had a projected shortage as a result of a decline in decommissioning trust fund investment values over the past year.  The filing proposed a reinstatement of decommissioning cost recovery for ANO 2.  In December 2022 the APSC ordered reinstatement of decommissioning collections for ANO 2 in accordance with the request in the November 2022 filing.  In November 2023, Entergy Arkansas filed a further revised decommissioning cost recovery tariff for ANO indicating that ANO 1’s decommissioning trust continued to be adequately funded, but that ANO 2’s fund continued to require collections higher than those in effect.  In December 2023 the APSC approved the proposed higher decommissioning collections for ANO 2.  In October 2024, Entergy Arkansas filed a revised cost recovery tariff indicating the decommissioning trusts for both ANO 1 and 2 were adequately funded and proposing suspension of decommissioning collections for both ANO 1 and 2.  In December 2024 the APSC approved suspension of decommissioning collections for both ANO 1 and 2.\nIn July 2010 the LPSC approved increased decommissioning collections for Waterford 3 and the Louisiana regulated share of River Bend to address previously identified funding shortfalls.  This LPSC decision contemplated that the level of decommissioning collections could be revisited should the NRC grant license extensions for both Waterford 3 and River Bend.  In July 2021, Entergy Louisiana made a filing with the LPSC to adjust Waterford 3 and River Bend decommissioning collections based on the latest site-specific decommissioning cost estimates for those plants.  The filing sought to increase Waterford 3 decommissioning collections and decrease River Bend decommissioning collections.  In August 2023, Entergy Louisiana made another filing with the LPSC requesting to maintain the same total decommissioning funding collections as currently in effect for both Waterford 3 and River \n276\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nBend combined, but also requesting to reallocate that same amount of funding by increasing the contributions for Waterford 3 and reducing the contributions for River Bend. \n \nIn August 2024 the LPSC approved a stipulation settling the case involving Waterford 3 and River Bend decommissioning.  The stipulation, among other things, increased Waterford 3 decommissioning collections and decreased River Bend decommissioning collections, as requested.\nIn December 2010 the PUCT approved increased decommissioning collections for the Texas share of River Bend to address previously identified funding shortfalls.  In December 2018 the PUCT approved a settlement that eliminated River Bend decommissioning collections for the Texas jurisdictional share of the plant based on a determination by Entergy Texas that the existing decommissioning fund was adequate following license renewal.  In July 2022, Entergy Texas filed a base rate case that proposed continuation of the cessation of River Bend decommissioning collections.  In May 2023, Entergy Texas filed on behalf of the parties to the base rate case an unopposed settlement, which included an agreement to maintain Entergy Texas’s decommissioning funding for River Bend at a revenue requirement of $0.  In August 2023 the PUCT issued an order accepting the unopposed settlement, including the proposed decommissioning funding settlement terms.\nIn December 2016 the NRC issued a 20-year operating license renewal for Grand Gulf.  In a 2017 filing at the FERC, System Energy stated that with the renewed operating license, Grand Gulf’s decommissioning trust was sufficiently funded, and proposed, among other things, to cease decommissioning collections for Grand Gulf effective October 1, 2017.  The FERC accepted a settlement including the proposed decommissioning revenue requirement by letter order in August 2018.\nEntergy currently believes its decommissioning funding will be sufficient for its nuclear plants subject to retail rate regulation, although decommissioning cost inflation and trust fund performance will ultimately determine the adequacy of the funding amounts.\nPlant owners are required to provide the NRC with a biennial report (annually for units that have shut down or will shut down within five years), based on values as of December 31, addressing the owners’ ability to meet the NRC minimum funding levels.  Depending on the value of the trust funds, plant owners may be required to take steps, such as providing financial guarantees through letters of credit or parent company guarantees or making additional contributions to the trusts, to ensure that the trusts are adequately funded and that NRC minimum funding requirements are met.  In March 2023 filings with the NRC were made reporting on decommissioning funding for all of Entergy’s subsidiaries’ nuclear plants.  Those reports showed that decommissioning funding for each of the nuclear plants met the NRC’s financial assurance requirements.\nAdditional information with respect to Entergy’s decommissioning costs and decommissioning trust funds is found in Note 9 and Note 16 to the financial statements.\nPrice-Anderson Act\nThe Price-Anderson Act requires that reactor licensees purchase and maintain the maximum amount of nuclear liability insurance available and participate in an industry assessment program called Secondary Financial Protection in order to protect the public in the event of a nuclear power plant accident.  The costs of this insurance are borne by the nuclear power industry.  Congress passed legislation in 2024 extending the Price-Anderson Act for a term through 2065.  The Price-Anderson Act limits the contingent liability for a single nuclear incident to a maximum assessment of approximately $165.9 million per reactor (with 95 nuclear industry reactors currently participating).  In the case of a nuclear event in which Entergy Arkansas, Entergy Louisiana, or System Energy is liable, protection is afforded through a combination of insurance and the Secondary Financial Protection program.  In addition to this, insurance for property damage, costs of replacement power, and other risks relating to nuclear generating units is also purchased.  The Price-Anderson Act and insurance applicable to the nuclear programs of Entergy are discussed in more detail in Note 8 to the financial statements.\n277\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nNRC Reactor Oversight Process\nThe NRC’s Reactor Oversight Process is a program to collect information about plant performance, assess the information for its safety significance, and provide for appropriate licensee and NRC response.  The NRC evaluates plant performance by analyzing two distinct inputs: inspection findings resulting from the NRC’s inspection program and performance indicators reported by the licensee.  The evaluations result in the placement of each plant in one of the NRC’s Reactor Oversight Process Action Matrix columns: “licensee response column,” or Column 1, “regulatory response column,” or Column 2, “degraded cornerstone column,” or Column 3, “multiple/repetitive degraded cornerstone column,” or Column 4, and “unacceptable performance,” or Column 5.  Plants in Column 1 are subject to normal NRC inspection activities.  Plants in Column 2, Column 3, or Column 4 are subject to progressively increasing levels of inspection by the NRC with, in general, progressively increasing levels of associated costs.  Continued plant operation is not permitted for plants in Column 5.  All of the nuclear generating plants owned and operated by Entergy’s Utility business are currently in Column 1.\nEnvironmental Regulation\nEntergy’s facilities and operations are subject to regulation by various governmental authorities having jurisdiction over air quality, water quality, control of toxic substances and hazardous and solid wastes, and other environmental matters.  Management believes that Entergy’s businesses are in substantial compliance with environmental regulations currently applicable to its facilities and operations, with reference to possible exceptions noted below.  Because environmental regulations are subject to change, future compliance requirements and costs cannot be precisely estimated.  Except to the extent discussed below, at this time compliance with federal, state, and local provisions regulating the discharge of materials into the environment, or otherwise protecting the environment, is incorporated into the routine cost structure of Entergy’s businesses and is not expected to have a material effect on their competitive position, results of operations, cash flows, or financial position.\nClean Air Act and Subsequent Amendments\nThe Clean Air Act and its amendments establish several programs that currently or in the future may affect Entergy’s fossil-fueled generation facilities and, to a lesser extent, certain operations at nuclear and other facilities.  Individual states also operate similar independent state programs or delegated federal programs that may include requirements more stringent than federal regulatory requirements.  These programs include:\n•\nnew source review and preconstruction permits for new sources of criteria air pollutants, greenhouse gases, and significant modifications to existing facilities;\n•\nacid rain program for control of sulfur dioxide (SO\n2\n) and nitrogen oxides (NO\nx\n);\n•\nnonattainment area programs for control of criteria air pollutants, which could include fee assessments for air pollutant emission sources under Section 185 of the Clean Air Act if attainment is not reached in a timely manner;\n•\nhazardous air pollutant emissions reduction programs;\n•\ninterstate air transport;\n•\noperating permit programs and enforcement of these and other Clean Air Act programs;\n•\nregional haze programs; and\n•\nnew and existing source standards for greenhouse gas and other air emissions.\nNational Ambient Air Quality Standards\nThe Clean Air Act requires the EPA to set National Ambient Air Quality Standards (NAAQS) for ozone, carbon monoxide, lead, nitrogen dioxide, particulate matter, and sulfur dioxide and requires periodic review of those standards.  When an area fails to meet an ambient standard, it is considered to be in nonattainment and is classified as “marginal,” “moderate,” “serious,” or “severe.”  When an area fails to meet the ambient air standard, the EPA \n278\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nrequires state regulatory authorities to prepare state implementation plans meant to cause progress toward bringing the area into attainment with applicable standards.\nOzone Nonattainment\nEntergy Texas operates two fossil-fueled generating facilities (Lewis Creek and Montgomery County Power Station) in a geographic area that is not in attainment with the applicable NAAQS for ozone.  The ozone nonattainment area that affects Entergy Texas is the Houston-Galveston-Brazoria area.  Both Lewis Creek and the Montgomery County Power Station hold all necessary permits for operation and comply with applicable air quality program regulations.  Measures enacted to return the area to ozone attainment could make these program regulations more stringent.  Entergy will continue to work with state environmental agencies on appropriate methods for assessing attainment and nonattainment with the ozone NAAQS.\nRevised Fine Particulate (PM\n2.5\n) NAAQS\nIn March 2024 the EPA issued a final rule which revised the primary annual NAAQS for fine particulate matter, also known as PM\n2.5\n, from 12 ug/m\n3\n to 9 ug/m\n3\n.  This new standard was effective May 2024 and initial attainment/nonattainment designations for areas with available information are due within two years, by May 2026.  For any areas designated as nonattainment for this revised standard, State Implementation Plans (SIPs) to address nonattainment requirements will be due within 18 months of the effective date of any initial nonattainment designations.  Within the areas in which the Utility operating companies operate, regulatory agency air monitor data from 2021-2023 for Pulaski County and Union County, Arkansas, West Baton Rouge Parish, Louisiana, Harris County, Texas and Hinds County, Mississippi reflect annual average PM\n2.5\n concentrations in excess of this new standard and monitors for several other areas reflect concentrations between 8-9 ug/m\n3\n.  Initial attainment and nonattainment designations will be based on data from 2022-2024.  Entergy will continue to work with state environmental agencies on appropriate methods for assessing attainment and nonattainment with this revised fine particulate NAAQS.\nHazardous Air Pollutants\nThe EPA released the final Mercury and Air Toxics Standard (MATS) rule in December 2011, which had a compliance date, with a widely granted one-year extension, of April 2016.  The required controls have been installed and are operational at all affected Entergy units.  In May 2024 the EPA issued a final rule revising portions of the MATS rule, including a reduction to the emission limit for filterable particulate matter.  The revised standard will become effective July 2027 and could require additional capital investment and/or additional other operation and maintenance costs at Entergy’s coal-fired generating units.  An additional one-year extension is possible for the installation of controls, if necessary.  Entergy is currently evaluating its coal units to determine whether additional controls are necessary to comply with this new lower limit.\nGood Neighbor Plan/Cross-State Air Pollution Rule\nIn March 2005 the EPA finalized the Clean Air Interstate Rule (CAIR), which was intended to reduce SO\n2\n and NO\nx\n emissions from electric generation plants in order to improve air quality in twenty-nine eastern states.  The rule required a combination of capital investment to install pollution control equipment and increased operating costs through the purchase of emission allowances.  Entergy began implementation in 2007, including installation of controls at several facilities and the development of an emission allowance procurement strategy.  Based on several court challenges, CAIR and its subsequent versions, now known as the Cross-State Air Pollution Rule (CSAPR), have been remanded to and modified by the EPA on multiple occasions.\nIn June 2023 the EPA published its final Federal Implementation Plan (FIP), known as the Good Neighbor Plan, to address interstate transport for the 2015 ozone NAAQS which would increase the stringency of the CSAPR program in all four of the states where the Utility operating companies operate.  The FIP would significantly reduce \n279\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nozone season NO\nx\n emission allowance budgets and allocations for electric generating units.  Prior to issuance of the FIP, in February 2023 the EPA issued related SIP disapprovals for many states, including the four states in which the Utility operating companies operate, and these SIP disapprovals are the subject of many legal challenges, including a petition for review filed by Entergy Louisiana challenging the disapproval of Louisiana’s SIP.  Stays of the SIP disapprovals have been granted in all four states in which the Utility operating companies operate, and the FIP will not go into effect while the stays are in place.  Decisions on the merits regarding the respective SIP disapprovals are expected in 2025.  The FIP is also subject to numerous legal challenges in various federal circuit courts of appeals, and in June 2024 the U.S. Supreme Court issued an order, in challenges filed in the D.C. Circuit, staying enforcement of the FIP pending the D.C. Circuit’s review of the rule.  Entergy is monitoring this litigation and assessing its compliance options in the event that the FIP becomes effective.\nRegional Haze\nIn June 2005 the EPA issued its final Clean Air Visibility Rule (CAVR) regulations that potentially could result in a requirement to install SO\n2\n and NO\nx\n pollution control technology as Best Available Retrofit Control Technology to continue operating certain of Entergy’s fossil generation units.  The rule leaves certain CAVR determinations to the states.  This rule establishes a series of 10-year planning periods, with states required to develop SIPs for each planning period, with each SIP including such air pollution control measures as may be necessary to achieve the ultimate goal of the CAVR by the year 2064.  The various states are currently in the process of developing SIPs to implement the second planning period of the CAVR, which addresses the 2018-2028 planning period.\nThe second planning period (2018-2028) for the regional haze program requires states to examine sources for impacts on visibility and to prepare SIPs by July 31, 2021 to ensure reasonable progress is being made to attain visibility improvements.  Entergy received information collection requests from the Arkansas and Louisiana Departments of Environmental Quality requesting an evaluation of technical and economic feasibility of various NO\nx\n and SO\n2\n control technologies for Independence, Nelson 6, NISCO, and Ninemile.  Responses to the information collection requests were submitted to the respective state agencies.  Louisiana issued its draft SIP which did not propose any additional air emissions controls for the affected Entergy units in Louisiana.  Some public commenters, however, believe additional air controls are cost-effective.  In August 2024, Louisiana issued a revised SIP proposal for public comment.  The revised proposed SIP would not require any additional pollution control installations on any Entergy-owned units in Louisiana.  Comments on the revised SIP were due in September 2024 and the Louisiana Department of Environmental Quality (LDEQ) is currently reviewing comments received on the revised proposal.  The agency, like many other state agencies, did not meet the July 31, 2021 deadline to submit a SIP to the EPA for review.\nSimilar to the LDEQ, the Arkansas Department of Energy and Environment, Division of Environmental Quality (ADEQ) did not meet the July 31, 2021 SIP submission deadline, but subsequently submitted a final SIP to the EPA for review.  The ADEQ reviewed Entergy’s Independence plant but determined that additional air emission controls would not be cost-effective considering the facility’s commitment to cease coal-fired combustion by December 31, 2030.\nThe Texas Commission on Environmental Quality has completed its second-planning period SIP and submitted it to the EPA for review.  There were no Entergy sources selected for additional emission controls.  In June 2024, the EPA entered into a consent decree that sets deadlines for the EPA to take final action on 34 states’ SIP submittals.  This includes Arkansas and Texas, which are due August 2026 and May 2025, respectively.\nThe Mississippi Department of Environmental Quality also did not meet the July 31, 2021 SIP submission deadline.   In June 2023 Mississippi issued its proposed SIP for public notice and comment but did not propose additional pollution controls for Entergy sources.\n280\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nIn August 2022 the EPA issued findings of failure to submit regional haze SIPs to 15 states, including Louisiana and Mississippi.  These findings were effective September 2022, which started the two-year period for the EPA to either approve a SIP submitted by the state or issue a final federal plan.  That two-year period expired in September 2024, but EPA has not yet proposed a FIP for Louisiana or Mississippi.\nGreenhouse Gas Emissions\nIn May 2024 the EPA finalized rules regulating greenhouse gas emissions from new combustion turbine electric generating units (EGUs) under Section 111(b) of the Clean Air Act and from certain existing coal- and gas-fired EGUs under Section 111(d) of the Clean Air Act.\nFor new gas combustion turbine EGUs, the final rule includes three subcategories of emission standards based on the unit’s annual capacity factor.  Applicable emission standards for each subcategory are:  a heat-input based CO\n2\n emission standard for low load (<20% annual capacity factor) EGUs; an output-based CO\n2\n efficiency standard for intermediate load (>20% but <40% annual capacity factor) EGUs; and, for base load (>40% annual capacity factor) EGUs, a Phase 1 output-based CO\n2\n efficiency standard followed by a more stringent Phase 2 CO\n2\n standard which will apply beginning January 1, 2032.  The Phase 2 standard was established based on an EPA determination that carbon capture and sequestration represents the best system of emission reduction for new base load combustion turbine EGUs.  The final rule allows for a possible one-year extension to the compliance date for the Phase 2 standard in circumstances where a source faces a delay in installation of controls due to factors outside of the control of the EGU owner/operator.\nFor existing generating units, the final rule includes emission guidelines issued under Section 111(d) of the Clean Air Act and allows states two years to develop a plan to implement the new emission guidelines with respect to subject emission units within their state.  The final emission guidelines require reductions in CO\n2\n emissions from existing coal-fired generating units which plan to operate beyond January 1, 2032 and exempts coal-fired units which plan to permanently cease operations prior to this date.  Due to Entergy’s commitment to cease burning coal by the end of 2030, Entergy’s coal-fired generating units are expected to be exempt from this aspect of the final rule.  The emission guidelines also include CO\n2\n efficiency standards for existing gas-fired steam EGUs.  These emission standards will apply beginning January 1, 2030.  Entergy’s existing gas-fired steam generating units are expected to meet these CO\n2\n emission standards.  The EPA did not finalize emission guidelines for existing gas turbine EGUs and has announced plans to conduct a subsequent rulemaking for such units.  Numerous lawsuits were filed in the D.C. Circuit challenging the final rule, and oral argument was held in December 2024.  Entergy continues to monitor the status of the litigation.\nEntergy continues to support national legislation that would most efficiently reduce economy-wide greenhouse gas emissions and increase planning certainty for electric utilities.  By virtue of its proportionally large investment in low-emitting generation technologies, Entergy has a low overall carbon dioxide emission “intensity,” or rate of carbon dioxide emitted per megawatt-hour of electricity generated.  In anticipation of the imposition of carbon dioxide emission limits on the electric industry, Entergy initiated actions designed to reduce its exposure to potential new governmental requirements related to carbon dioxide emissions.  These voluntary actions included a formal program to stabilize owned power plant carbon dioxide emissions at 2000 levels through 2005, and Entergy succeeded in reducing emissions below 2000 levels.  In 2006, Entergy started including emissions from controllable power purchases in addition to its ownership share of generation and established a second formal voluntary program to stabilize power plant carbon dioxide emissions and emissions from controllable power purchases, cumulatively over the period, at 20% below 2000 levels through 2010.  In 2011, Entergy extended this commitment through 2020, which it ultimately outperformed by approximately 8% both cumulatively and on an annual basis.  In 2019, in connection with a climate scenario analysis following the recommendations of the Task Force on Climate-related Financial Disclosures describing climate-related governance, strategy, risk management, and metrics and targets, Entergy announced a 2030 carbon dioxide emission rate goal focused on a 50% reduction from Entergy’s base year - 2000.\n281\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nIn September 2020, Entergy announced a commitment to achieve net-zero greenhouse gas emissions by 2050 inclusive of all businesses, all applicable gases, and all emission scopes.  In 2022, Entergy enhanced its commitment to include an interim goal of 50% carbon-free energy generating capacity by 2030 and expanded its interim emission rate goal to include all purchased power.  Due to stronger than initially expected sales growth, likely necessitating the development of new generation capacity that is not carbon-free, Entergy expects that achievement of the 50% carbon-free energy generating capacity goal will be delayed for a period beyond 2030 that has not yet been determined.  In addition, while current planning assumptions indicate the 2030 emission rate goal remains achievable, its achievement could also be challenged as a result of the forecasted and future sales growth.  See “\nRisk Factors\n” in Part I, Item 1A for discussion of the risks associated with achieving these climate goals.  Entergy’s comprehensive, third party verified greenhouse gas inventory and progress against its voluntary goals are published on its website.\nPotential Legislative, Regulatory, and Judicial Developments\nIn addition to the specific instances described above, there are a number of legislative and regulatory initiatives that are or have recently been under consideration at the federal, state, and local level.  Because of the nature of Entergy’s business, the imposition of any of these initiatives could affect Entergy’s operations.  Entergy continues to monitor these initiatives and activities in order to analyze their potential operational and cost implications.  These initiatives have included:\n•\nreconsideration and revision of ambient air quality standards downward which could lead to additional areas of nonattainment;\n•\ndesignation by the EPA and state environmental agencies of areas that are not in attainment with national ambient air quality standards;\n•\nintroduction of bills in Congress and development of regulations by the EPA proposing further limits on SO\n2\n, mercury, carbon dioxide, and other air emissions.  New legislation or regulations applicable to stationary sources could take the form of market-based cap-and-trade programs, direct requirements for the installation of air emission controls onto air emission sources, or other or combined regulatory programs;\n•\nefforts in Congress or at the EPA to establish a federal carbon dioxide emission tax, control structure, or unit performance standards;\n•\nrevisions to the estimates of the Social Cost of Carbon and its use for regulatory impact analysis of federal laws and regulations;\n•\nimplementation of the regional cap and trade programs to limit carbon dioxide and other greenhouse gases;\n•\nefforts on the local, state, and federal level to codify renewable portfolio standards, clean energy standards, or a similar mechanism requiring utilities to produce or purchase a certain percentage of their power from defined renewable energy sources or energy sources with lower emissions;\n•\nefforts to develop more stringent state water quality standards, effluent limitations for Entergy’s industry sector, stormwater runoff control regulations, and cooling water intake structure requirements;\n•\nefforts to restrict the previously-approved continued use of oil-filled equipment containing certain levels of polychlorinated biphenyls (PCBs) and increased regulation of per- and polyfluorinated substances or other chemicals;\n•\nefforts by certain external groups to encourage reporting and disclosure of environmental, social, and governance risk;\n•\nthe listing of additional species as threatened or endangered, the protection of critical habitat for these species, and developments in the legal protection of eagles and migratory birds;\n•\nthe regulation of the management, disposal, and beneficial reuse of coal combustion residuals; and\n•\nthe regulation of the management and disposal and recycling of equipment associated with renewable and clean energy sources such as used solar panels, wind turbine blades, hydrogen usage, or battery storage.\n282\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nComprehensive Environmental Response, Compensation, and Liability Act of 1980\nThe Comprehensive Environmental Response, Compensation, and Liability Act of 1980, as amended (CERCLA), authorizes the EPA to mandate clean-up by, or to collect reimbursement of clean-up costs from, owners or operators of sites at which hazardous substances may be or have been released.  Certain private parties also may use CERCLA to recover response costs.  Parties that transported hazardous substances to these sites or arranged for the disposal of the substances are also deemed liable by CERCLA.  CERCLA has been interpreted to impose strict, joint, and several liability on responsible parties.  Many states have adopted programs similar to CERCLA.  Entergy subsidiaries have sent waste materials to various disposal sites over the years, and releases have occurred at Entergy facilities including nuclear facilities that have been sold to decommissioning companies.  In addition, environmental laws now regulate certain of Entergy’s operating procedures and maintenance practices that historically were not subject to regulation.  Some disposal sites used by Entergy subsidiaries have been the subject of governmental action under CERCLA or similar state programs, resulting in site clean-up activities.  Entergy subsidiaries have participated to various degrees in accordance with their respective potential liabilities in such site clean-ups and have developed experience with clean-up costs.  The affected Entergy subsidiaries have established provisions for the liabilities for such environmental clean-up and restoration activities.  Details of potentially material CERCLA and similar state program liabilities are discussed in the “\nOther Environmental Matters\n” section below.\nCoal Combustion Residuals\nIn April 2015 the EPA published the final coal combustion residuals (CCR) rule (2015 CCR Rule) regulating CCRs destined for disposal in landfills or surface impoundments as non-hazardous wastes regulated under Resource Conservation and Recovery Act Subtitle D.  The final regulations created new compliance requirements including modified storage, new notification and reporting practices, product disposal considerations, and CCR unit closure criteria but excluded CCRs that are beneficially reused in certain processes.  Entergy believes that on-site disposal options will be available at its facilities, to the extent needed.\nPursuant to the 2015 CCR Rule, Entergy operates groundwater monitoring systems surrounding its CCR landfills located at White Bluff, Independence, and Nelson.  Monitoring to date has detected concentrations of certain listed constituents in the area but has not indicated that these constituents originated at the active landfill cells.  Reporting and detection monitoring will continue as the rule requires.  In late-2017, Entergy determined that certain in-ground wastewater treatment system recycle ponds at its White Bluff and Independence facilities required management under the 2015 CCR Rule.  Consequently, in order to move away from using the recycle ponds, White Bluff and Independence each installed a new permanent bottom ash handling system.  As of November 2020, both sites are operating the new system and no longer are sending waste to the recycle ponds.  Each site commenced closure of its two recycle ponds (four ponds total) prior to the April 11, 2021 deadline for unlined recycle ponds and the ponds were certified closed in October 2023.\nIn May 2024 the EPA finalized a rule (2024 CCR Rule) establishing management standards for legacy CCR surface impoundments (i.e., inactive surface impoundments at inactive power plants) and establishing a new class of units referred to as CCR management units (CCRMUs) (i.e., non-containerized CCR located at a regulated CCR facility).  CCR utilized in roadbeds and embankments is excluded from the CCRMU definition.  Entergy does not have any legacy impoundments; however, the definition of CCR management units includes on-site areas where CCR was beneficially used.  This is contrary to the 2015 CCR Rule which exempted beneficial uses that met certain criteria.  Under this expanded rule, all facilities must identify and delineate any CCRMU greater than one ton and submit a facility evaluation report by February 2026.  Any potential requirements for corrective action or operational changes under the 2015 CCR Rule and the 2024 CCR Rule continue to be assessed.  Notably, ongoing litigation has resulted in the EPA’s continuing review of the rules.  Consequently, the nature and cost of additional corrective action requirements may depend, in part, on the outcome of the litigation and further EPA review.  Given the complexity and recency of the EPA guidance, Entergy is still evaluating the level of work that will ultimately be required to comply with the 2024 CCR Rule.  Based on initial estimates of multiple possible remediation scenarios, Entergy recorded in 2024 a $42 million increase in its decommissioning cost liabilities for White Bluff and \n283\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nIndependence, along with corresponding increases in the related asset retirement cost assets that will be depreciated over the remaining useful lives of the unit.  Entergy will continue to update the asset retirement obligation as the requirements of the 2024 CCR Rule are clarified.  As of December 31, 2024, Entergy has recorded asset retirement obligations related to CCR management of $73 million.  Additionally, all three sites (White Bluff, Independence, and Nelson) are preparing to implement measures to meet the new and updated Effluent Limitation Guidelines discussed below.\nClean Water Act\nThe 1972 amendments to the Federal Water Pollution Control Act (known as the Clean Water Act) provide the statutory basis for the National Pollutant Discharge Elimination System permit program, section 402, and the basic structure for regulating the discharge of pollutants from point sources to waters of the United States.  The Clean Water Act requires virtually all discharges of pollutants to waters of the United States to be permitted.  Section 316(b) of the Clean Water Act regulates cooling water intake structures, section 401 of the Clean Water Act requires a water quality certification from the state in support of certain federal actions and approvals, and section 404 of the Clean Water Act regulates the dredge and fill of waters of the United States, including jurisdictional wetlands.\nFederal Jurisdiction of Waters of the United States\nIn June 2020 the EPA’s revised definition of waters of the United States in the Navigable Waters Protection Rule (NWPR) became effective, narrowing the scope of Clean Water Act jurisdiction, as compared to a 2015 definition which had been stayed by several federal courts.  In August 2021 a federal district court vacated and remanded the NWPR for further consideration.  The EPA and the U.S. Army Corps of Engineers (Corps) subsequently issued a statement that the agencies would revert to pre-2015 regulations pending a new rulemaking.  In December 2022 the EPA and the Corps released a final definition of waters of the United States (the 2022 Rule) that replaces the NWPR with a definition that is consistent with the pre-2015 regulatory regime as interpreted by several United States Supreme Court decisions.  The 2022 Rule was subject to multiple legal challenges and was enjoined from implementation or enforcement throughout Entergy’s utility service territory.  In May 2023 the U.S. Supreme Court issued a decision limiting the scope of federal jurisdiction over wetlands, and in September 2023 the EPA and the Corps issued a final rule incorporating the Supreme Court decision.  Most notably, the exclusion for waste treatment systems is retained.\nEffluent Limitation Guidelines\nThe 2015 Steam Electric Effluent Limitations Guidelines required, among other things, that there be no discharge of bottom ash transport water.  In 2020 the EPA finalized the Reconsideration Rule, allowing limited discharges of bottom ash transport water up to 10% of system volume, under certain defined circumstances including significant (10-year, 24-hour) rain events.  The 2020 rule also created a subcategory for units that permanently cease coal combustion by December 31, 2028.  Entergy’s White Bluff facility filed a notice of planned participation for this subcategory in October 2021.  In May 2024 the EPA finalized a supplemental rule that retains the “retirement by 2028” subcategory, creates a new “retirement by 2034” subcategory, otherwise reinstates the zero-discharge requirement for bottom ash transport water, and imposes new requirements for leachate after the facility ceases to burn coal.  Thus, units which permanently cease combustion of coal by December 31, 2028 or December 31, 2034 are exempt from the zero-discharge requirement.  However, for units in the 2034 subcategory, the 10% discharge allowance must be incorporated into the facility’s discharge permit.  To be covered by this exemption, both Independence and Nelson Unit 6 will need to file Notices of Planned Participation in the 2034 subcategory by December 31, 2025.  To help ensure facilities cease combustion of coal by the required subcategory 2028 and 2034 dates, zero discharge of bottom ash transport water is required after April 30, 2029 and April 30, 2035, respectively.  Entergy continues to evaluate the compliance pathways and obligations of this rule.\n284\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nOther Environmental Matters\nEntergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy Texas\nThe EPA notified Entergy that the EPA believes Entergy is a PRP concerning PCB contamination at the F.J. Doyle Salvage facility in Leonard, Texas.  The facility operated as a scrap salvage business during the 1970s to the 1990s.  In May 2018 the EPA investigated the site surface and sub-surface soils, and in November 2018 the EPA conducted a removal action, including disposal of PCB contaminated soils.  Entergy responded to the EPA’s information requests in May and July 2019.  In November 2020 the EPA sent Entergy and other PRPs a demand letter seeking reimbursement for response costs totaling $4 million expended at the site.  Liability and PRP allocation of response costs are yet to be determined.  In December 2020, Entergy responded to the demand letter, without admitting liability or waiving any rights, indicating that it would engage in good faith negotiations with the EPA with respect to the demand.  An initial meeting between the EPA and the PRPs took place in June 2021.  Negotiations between the PRPs and the EPA are ongoing.\nLitigation\nEntergy and its subsidiaries use legal and appropriate means to contest litigation threatened or filed against them, but the states in which Entergy and the Registrant Subsidiaries operate have proven to be unusually litigious environments.  Judges and juries in these states have demonstrated a willingness to grant large verdicts, including punitive damages, to plaintiffs in personal injury, property damage, and business tort cases.  The litigation environment in these states poses a significant business risk to Entergy.\nAsbestos Litigation (Entergy Arkansas, Entergy Louisiana, Entergy New Orleans, and Entergy Texas)\nSee Note 8 to the financial statements for a discussion of this litigation.\nEmployment and Labor-related Proceedings (Entergy Corporation, Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, Entergy New Orleans, Entergy Texas, and System Energy)\nSee Note 8 to the financial statements for a discussion of these proceedings.\nHuman Capital\nEmployees\nEmployees are an integral part of Entergy’s commitment to serving customers.  As of December 31, 2024, Entergy subsidiaries employed 12,267 people.\nEntergy Arkansas\n1,314 \nEntergy Louisiana\n1,669 \nEntergy Mississippi\n770 \nEntergy New Orleans\n302 \nEntergy Texas\n741 \nSystem Energy\n— \nEntergy Operations\n3,211 \nEntergy Services\n4,245 \nEntergy Nuclear Operations\n13 \nOther subsidiaries\n2 \nTotal Entergy\n12,267 \n285\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nThere are 3,105 employees represented by the International Brotherhood of Electrical Workers, the United Government Security Officers of America, and the International Union, Security, Police, and Fire Professionals of America.\nBelow is the breakdown of Entergy’s employees by gender and race/ethnicity:\nGender (%) (a)\n2024\n2023\nFemale\n23.0\n23.0\nMale\n77.0\n77.0\nRace/Ethnicity (%) (a)\n2024\n2023\nWhite\n73.2\n73.1\nBlack/African American\n18.4\n18.2\nHispanic/Latino\n3.3\n3.2\nAsian\n2.5\n2.4\nOther\n2.6\n3.1\n(a)\nBased on employees who self-identify.\nEntergy’s Approach to Human Resources\nEntergy’s people and culture enable its success; that is why acquiring, retaining, and developing talent are important components of Entergy’s human resources strategy.  Entergy focuses on an approach that includes, among other things, governance and oversight; safety; organizational health, including diversity, inclusion, and belonging; and talent management.\nGovernance and Oversight\nEnsuring that workplace processes support the desired culture and strategy begins with the Board of Directors and the Office of the Chief Executive.  The Talent and Compensation Committee is responsible for overseeing and monitoring the effectiveness of Entergy’s human capital strategies and initiatives, including those pertaining to talent management, diversity, inclusion and belonging, organizational health, retention, safety, and executive compensation and performance, and receives briefings on these and other topics.  The Talent and Compensation Committee establishes and regularly reviews priorities, strategies, and performance on these topics.\nOther committees of the Board oversee other key aspects of Entergy’s culture.  For example, the Audit Committee reviews reports on enterprise risks, ethics, and compliance training and performance, as well as regular reports on calls made to Entergy’s ethics line and related investigations.  To maximize the sharing of information and facilitate the participation of all Board members in these discussions, the Board schedules its regular committee meetings in a manner such that all directors can attend.\nThe Office of the Chief Executive, which includes Entergy’s Chief Human Resources Officer, ensures annual business plans are designed to support Entergy’s talent objectives, reviews workforce-related metrics, and regularly discusses the development, succession planning, and performance of their direct reports and other company officers.\nSafety\nEntergy’s safety objective is: Everyone Safe.  All Day.  Every Day.  In 2024, Entergy set a record for its total recordable incident rate, reaching a new low of 0.41 combined employee and contractor results.  This was a \n286\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nsignificant improvement on the company’s performance of 0.48 in 2023 and 0.51 in 2022.  The recordable incident rate equals the number of recordable incidents per 100 full-time equivalents.  Recordable incidents include fatalities, lost-time accidents, restricted-duty accidents, and medical attentions.  Despite an active storm season in 2024, Entergy was able to manage restoration during the two named storms in Entergy’s service territory with only a single contractor heat related injury.  The results of 2024 unfortunately included an increase in significant injuries and fatalities, including four contractor fatalities after almost 900 days without experiencing a single employee or contractor fatality.  In response to the increase in significant injuries and fatalities, Entergy has enhanced its focused training, leadership efforts, and field presence for employees and contractors to further the objective of zero fatalities, which the company had been able to achieve in 2022 and 2023.\nOrganizational Health\nEntergy believes that organizational health fosters an engaged and productive culture that positions Entergy to deliver sustainable value to its stakeholders.  Entergy measures its progress in this area through an organizational health survey coordinated by an external third party.  Since initially administering the survey in 2014, Entergy improved from an initial score of 49 (fourth quartile) to a score in 2022 of 61 (third quartile), in 2023 of 62 (third quartile), and in 2024 of 65 (third quartile).  Improvement in behavioral expectations, which Entergy believes are the leading indicators of outcome improvements, suggests that Entergy is continuing to move in a positive direction.\nEntergy believes that creating a culture of diversity, inclusion, and belonging drives engagement for all employees.  Entergy is committed to developing and retaining a top-performing workforce with a wide variety of backgrounds, experiences, and perspectives.  Entergy’s human resources department focuses on, among other things, talent management, workforce development, talent attraction/pipeline development, retention, organizational health, and diversity, inclusion, and belonging.  Among other strategies, Entergy partners with colleges and vocational-technical schools to develop a more viable pipeline of future talent, while also expanding efforts to increase employee engagement and cultivate an inclusive culture with high performance\n.  \nEntergy has several employee resource groups, open to all employees, offers leadership development programs to support all employees, and facilitates skills training from the executive leadership ranks down to the frontline.  Through these efforts, Entergy aspires to create greater understanding and accountability regarding the behaviors and outcomes that are indicative of a premier utility.\nTalent Management\nEntergy’s focus on talent management is organized in three areas: developing and attracting a highly qualified workforce with a broad range of backgrounds, skill sets, and experiences, equipping its leaders to develop the organization, and building premier utility capability through employee performance management and succession programs.  Entergy believes that developing a workforce with a wide variety of backgrounds, experiences, and perspectives equipped with the skills needed, today and in the future, will give it a long-term competitive advantage.  The focus of Entergy’s leadership development programs is to equip managers with the skills needed to effectively develop their teams and improve the leader-employee relationship.  Entergy’s talent development infrastructure, which includes a combination of business function-specific and enterprise-wide learning and development programs, is designed to ensure Entergy has qualified employees with the skills, experiences, and behaviors needed to perform today and prepare for the future.  Entergy strives to achieve its strategic priorities by aligning and enhancing team and individual performance with business objectives, effectively deploying talent through succession planning, and managing workforce transitions.\nAvailability of SEC filings and other information on Entergy’s website\nEntergy electronically files reports with the SEC, including annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements, and amendments to such filings.  The SEC maintains an internet website that contains reports, proxy and information statements, and other information regarding \n287\nTable of Contents\nPart I Item 1\nEntergy Corporation, Utility operating companies, and System Energy\nregistrants that file electronically with the SEC at https://www.sec.gov.  Copies of the reports that Entergy files with the SEC can be obtained at the SEC’s website.\nEntergy uses its website, https://www.entergy.com, as a routine channel for distribution of important information, including news releases, analyst presentations, and financial information.  Filings made with the SEC are posted and available without charge on Entergy’s website as soon as reasonably practicable after they are electronically filed with, or furnished to, the SEC.  These filings include annual and quarterly reports on Forms 10-K and 10-Q and current reports on Form 8-K (including related filings in XBRL format), proxy statements, and any amendments to such filings.  All such postings and filings are available on Entergy’s Investor Relations website free of charge.  Entergy is providing the address to its internet website solely for the information of investors and does not intend the address to be an active link.  Notwithstanding this reference or any references to the website in this report, the contents of the website are not incorporated into this report.\n288\nTable of Contents\nPart I Item 1A, 1B, and 1C\nEntergy Corporation, Utility operating companies, and System Energy",
  "item7": null,
  "item2": null
}