{
  "source_file": "evrg-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.  MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following combined Management's Discussion and Analysis of Financial Condition and Results of Operations (MD&A) should be read in conjunction with the consolidated financial statements and accompanying notes in this combined Quarterly Report on Form 10-Q and the Evergy Companies' combined 2024 Form 10-K.  None of the registrants make any representation as to information related solely to Evergy, Evergy Kansas Central or Evergy Metro other than itself.   \nEVERGY, INC.\nEXECUTIVE SUMMARY\nEvergy is a public utility holding company incorporated in 2017 and headquartered in Kansas City, Missouri.  Evergy operates primarily through the following wholly-owned direct subsidiaries listed below. \n•\nEvergy Kansas Central is an integrated, regulated electric utility that provides electricity to customers in the state of Kansas.  Evergy Kansas Central has one active wholly-owned subsidiary with significant operations, Evergy Kansas South.  \n•\nEvergy Metro is an integrated, regulated electric utility that provides electricity to customers in the states of Missouri and Kansas.\n•\nEvergy Missouri West is an integrated, regulated electric utility that provides electricity to customers in the state of Missouri.\n•\nEvergy Transmission Company owns 13.5% of Transource with the remaining 86.5% owned by AEP Transmission Holding Company, LLC, a subsidiary of AEP.  Transource is focused on the development of competitive electric transmission projects.  Evergy Transmission Company accounts for its investment in Transource under the equity method. \nEvergy Kansas Central also owns a 50% interest in Prairie Wind, which is a joint venture between Evergy Kansas Central and subsidiaries of AEP and Berkshire Hathaway Energy Company.  Prairie Wind owns a 108-mile, 345 kV double-circuit transmission line that provides transmission service in the SPP.  Evergy Kansas Central accounts for its investment in Prairie Wind under the equity method.\nEvergy Kansas Central, Evergy Kansas South, Evergy Metro and Evergy Missouri West conduct business in their respective service territories using the name Evergy.  Collectively, the Evergy Companies have approximately 15,800 MWs of owned generating capacity and renewable power purchase agreements and engage in the generation, transmission, distribution and sale of electricity to approximately 1.7 million customers in the states of Kansas and Missouri.  The Evergy Companies assess financial performance and allocate resources on a consolidated basis (i.e., operate in one segment).\nEvergy Kansas Central's 2025 Rate Case Proceeding\nIn January 2025, Evergy Kansas Central filed an application with the KCC to request an increase to its retail revenues of approximately $196 million.  Evergy Kansas Central's request reflected a return on equity of 10.5% (with a capital structure composed of 52% equity) and increases related to the recovery of infrastructure investments made to improve reliability and enhance customer service and the update of expenses to current levels of spend.  \nIn July 2025, Evergy Kansas Central, the KCC staff and other intervenors in the case reached a unanimous settlement agreement to settle all outstanding issues in the case.  The unanimous settlement provides for an increase to retail revenues of $128.0 million after rebasing property tax expense and not including costs recoverable through KCC-approved riders for Evergy Kansas Central.  In September 2025, the KCC approved the unanimous settlement agreement and new rates took effect in October 2025.  See Note 4 to the consolidated financial statements for additional information.\n59\nTable of Contents\n \nLarge Load Power Service (LLPS) Rate Plan\nIn February 2025, Evergy Kansas Central and Evergy Metro filed an application with the KCC and Evergy Metro and Evergy Missouri West filed an application with the MPSC seeking expedited approval of new comprehensive LLPS rate plans.  The proposed LLPS rate plans are designed to establish a tariff framework for large load customers while including protections for existing customers.\nIn August 2025, Evergy Kansas Central, Evergy Metro, the KCC staff and other intervenors reached a unanimous settlement agreement for the LLPS rate plan.  The unanimous settlement agreement is subject to the approval of the KCC.  In September 2025, Evergy Metro, Evergy Missouri West and other intervenors agreed to a non-unanimous global stipulation and agreement for the LLPS rate plan.  The non-unanimous global stipulation and agreement is subject to the approval of the MPSC.  Final orders from the KCC and the MPSC are expected in the fourth quarter of 2025.\nFederal Tax Reform\nIn July 2025, the One Big Beautiful Bill Act (OBBBA) was signed into law by President Trump.  The OBBBA contains a wide variety of tax reforms affecting businesses, including changes to clean energy production tax credits which could impact the Evergy Companies' long-term generation resource planning.  The Evergy Companies do not expect a material impact to their operations and consolidated financial results.\nMissouri Legislation\nIn April 2025, Missouri SB 4 was signed into law by the Governor of Missouri.  Most notably, SB 4 establishes new mechanisms for Missouri electric utilities to recover the costs associated with the construction of new natural gas-fired generating units.  The utilities will be able to include certain costs of CWIP in rate base.  The inclusion of CWIP will be in lieu of AFUDC applicable to the construction of the new natural gas-fired generating units.  The MPSC will determine the amount of CWIP that may be included in rate base.  Additionally, amounts collected arising from the inclusion of CWIP in rate base are subject to refund under certain circumstances.  These provisions are scheduled to expire at the end of 2035.\nAdditionally, the law extends Missouri's existing PISA provisions to include certain natural gas-fired generating units as qualifying electric plant and extends the sunset date of these provisions through the end of 2035.  These provisions allow electric utilities to defer to a regulatory asset for recovery in a subsequent general rate case 85% of depreciation expense and the associated return on investment for qualifying electric plant rate base additions for assets placed in-service between general rate cases.\nKansas Legislation\nIn April 2025, Kansas House Bill (HB) 2107 was signed into law by the Governor of Kansas.  Most notably, HB 2107 establishes a two-year statute of limitations for wildfire-related claims against a Kansas electric public utility and a $5.0 million limit for punitive damages awarded under a fire claim.  The law also requires the plaintiff to establish the burden of proof for fire claims by a preponderance of evidence.\nNatural Gas Plant Investments\nThe Evergy Companies use a triennial IRP, a detailed analysis that estimates factors that influence the future supply and demand for electricity, to inform the manner in which they supply electricity. The most recent IRPs incorporate the latest SPP resource adequacy requirements and anticipated load growth.  Based on these and other factors, the IRP indicated the addition of new supply side resources, including combined and simple cycle natural gas plants, would be needed.\nIn October 2024, Evergy announced its plan to construct two combined-cycle natural gas plants located in Kansas.  Evergy Kansas Central and Evergy Missouri West will jointly-own each plant and expect each plant to have an initial generating capacity of approximately 705 MW.  The first plant is expected to begin operations by summer of 2029 and the second plant is expected to begin operations by summer of 2030.\nAdditionally, Evergy Missouri West plans to construct a 440 MW simple-cycle natural gas plant located in Missouri. The plant is expected to begin operations in 2030.\n60\nTable of Contents\n \nIn 2024, Evergy Kansas Central and Evergy Missouri West requested predetermination from the KCC and a CCN from the MPSC, respectively, for their planned natural gas investments.  In July 2025, the KCC approved a non-unanimous partial settlement agreement regarding Evergy Kansas Central's investments in its planned natural gas plants.  In July 2025, the MPSC approved a non-unanimous stipulation and agreement regarding Evergy Missouri West's investments in its planned natural gas plants.  See \"Applications for Predetermination\" and \"Requests for Certificate of Convenience and Necessity\" in Note 4 to the consolidated financial statements for information regarding Evergy Kansas Central's and Evergy Missouri West's applications for predetermination and CCN for their investments in these natural gas plants.\nRenewable Plant Investments\nEvergy Kansas Central intends to construct and own an approximately 159 MW solar generation facility to be located in Kansas called Kansas Sky.  Kansas Sky is expected to begin operations by summer of 2027 and construction is subject to the granting by the KCC of predetermination with reasonably acceptable terms and other closing conditions.  In July 2025, the KCC approved a unanimous partial settlement agreement for the Kansas Sky solar investment.  See \"Applications for Predetermination\" in Note 4 to the consolidated financial statements for additional information regarding Evergy Kansas Central's application for predetermination for its investment in this renewable generating plant.\nIn 2024, Evergy Missouri West entered into agreements to own two solar generation facilities currently under development.  The first facility, to be called Sunflower Sky, is a solar generation facility to be located in Kansas with an expected generating capacity of approximately 65 MW.  In September 2025, Evergy Missouri West acquired the Sunflower Sky solar facility assets from the developer and will complete construction of the facility.  The second facility, to be called Foxtrot, is a solar generation facility to be located in Missouri with an expected generating capacity of approximately 100 MW.  In November 2025, Evergy Missouri West acquired the Foxtrot solar facility assets from the developer and will complete construction of the facility.  The solar generation facilities are expected to begin operations by summer of 2027.  In July 2025, the MPSC approved a unanimous stipulation and agreement regarding Evergy Missouri West's planned investments in the solar generation facilities.  See \"Requests for Certificate of Convenience and Necessity\" in Note 4 to the consolidated financial statements for information regarding Evergy Missouri West's application for a CCN for its investment in these renewable generating plants. \nRegulatory Proceedings\nSee Note 4 to the consolidated financial statements for information regarding other regulatory proceedings.\nWolf Creek Refueling Outage\nWolf Creek's most recent refueling outage began in October 2025 and the unit is expected to return to service in November 2025.\nEarnings Overview\nThe following table summarizes Evergy's net income and diluted EPS.\nThree Months Ended\nSeptember 30\nYear to Date \nSeptember 30\n2025\nChange\n2024\n2025\nChange\n2024\n(millions, except per share amounts)\nNet income attributable to Evergy, Inc.\n$\n475.0 \n$\n9.4 \n$\n465.6 \n$\n771.3 \n$\n(24.0)\n$\n795.3 \nEarnings per common share, diluted\n2.03 \n0.01 \n2.02 \n3.31 \n(0.14)\n3.45 \nNet income attributable to Evergy, Inc. increased for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to new Evergy Missouri West retail rates effective in January 2025 and higher retail sales in the third quarter of 2025 driven by higher weather-normalized demand; partially offset by higher interest and depreciation expenses and lower proceeds from corporate-owned life insurance (COLI).\n61\nTable of Contents\n \nDiluted EPS was nearly flat for the three months ended September 30, 2025, compared to the same period in 2024, with the increase in net income attributable to Evergy, Inc. discussed above mostly offset by a $0.03 per share decrease due to dilution from Evergy's convertible notes.\nNet income attributable to Evergy, Inc. decreased year to date September 30, 2025, compared to the same period in 2024, primarily due to higher interest, depreciation and operating and maintenance expenses, lower proceeds from COLI and losses from investments in early-stage clean energy and energy solution companies; partially offset by new Evergy Missouri West retail rates effective in January 2025 and higher transmission revenues.\nDiluted EPS decreased year to date September 30, 2025, compared to the same period in 2024, primarily due to the decrease in net income attributable to Evergy, Inc. discussed above and a $0.04 per share decrease due to dilution from Evergy's convertible notes.\nFor additional information regarding the change in net income, refer to the Evergy Results of Operations section within this MD&A.\nNon-GAAP Measures\nEvergy Utility Gross Margin (non-GAAP)\nUtility gross margin (non-GAAP) is a financial measure that is not calculated in accordance with GAAP.  Utility gross margin (non-GAAP), as used by the Evergy Companies, is defined as operating revenues less fuel and purchased power costs and amounts billed by the SPP for network transmission costs.  Expenses for fuel and purchased power costs, offset by wholesale sales margin, are subject to recovery through cost adjustment mechanisms.  As a result, changes in fuel and purchased power costs are offset in operating revenues with minimal impact on net income.  In addition, SPP network transmission costs fluctuate primarily due to investments by SPP members for upgrades to the transmission grid within the SPP RTO.  As with fuel and purchased power costs, changes in SPP network transmission costs are mostly reflected in the prices charged to customers with minimal impact on net income.  The Evergy Companies' definition of utility gross margin (non-GAAP) may differ from similar terms used by other companies.\nUtility gross margin (non-GAAP) is intended to aid an investor's overall understanding of results.  Management believes that utility gross margin (non-GAAP) provides a meaningful basis for evaluating the Evergy Companies' operations across periods because utility gross margin (non-GAAP) excludes the revenue effect of fluctuations in fuel and purchased power costs and SPP network transmission costs.  Utility gross margin (non-GAAP) is used internally to measure performance against budget and in reports for management and the Evergy Board.  Utility gross margin (non-GAAP) should be viewed as a supplement to, and not a substitute for, gross margin, which is the most directly comparable financial measure prepared in accordance with GAAP.  Gross margin under GAAP is defined as the excess of sales over cost of goods sold.\nUtility gross margin (non-GAAP) differs from the GAAP definition of gross margin due to the exclusion of operating and maintenance expenses determined to be directly attributable to revenue-producing activities, depreciation and amortization and taxes other than income tax.  See the Evergy Companies' Results of Operations for a reconciliation of utility gross margin (non-GAAP) to gross margin, the most comparable GAAP measure.\nAdjusted Earnings (non-GAAP) and Adjusted EPS (non-GAAP)\nManagement believes that adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) are representative measures of Evergy's recurring earnings, assist in the comparability of results and are consistent with how management reviews performance.\nEvergy's adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) for the three months ended and year to date September 30, 2025, were $475.1 million or $2.03 per share and $794.0 million or $3.41 per share, respectively.  For the three months ended and year to date September 30, 2024, Evergy's adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) were $465.6 million or $2.02 per share and $797.3 million or $3.46 per share, respectively.  \n62\nTable of Contents\n \nIn addition to net income attributable to Evergy, Inc. and diluted EPS, Evergy's management uses adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) to evaluate earnings and EPS without:\ni.\nthe unrealized losses and impairment losses from non-regulated investments in early-stage clean energy and energy solution companies and costs related to the disposal of these investments; and\nii.\nthe mark-to-market impacts of economic hedges related to Evergy Kansas Central's 8% ownership share of JEC.\nAdjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) are intended to aid an investor's overall understanding of results.  Management believes that adjusted earnings (non-GAAP) provides a meaningful basis for evaluating Evergy's operations across periods because it excludes certain items that management does not believe are indicative of Evergy's ongoing perf\normance or that can create period to period earnings volatility.  \nAd\njusted earnings (non-GAAP) and adjusted EPS (non-GAAP) are used internally to measure performance against budget and in reports for management and the Evergy Board.  Adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) are financial measures that are not calculated in accordance with GAAP and may not be comparable to other companies' presentations or more useful than the GAAP information provided elsewhere in this report. \nThe following tables provide a reconciliation between net income attributable to Evergy, Inc. and diluted EPS as determined in accordance with GAAP and adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP), respectively.\nEarnings (Loss)\nEarnings (Loss) per Diluted Share\nEarnings (Loss)\nEarnings (Loss) per Diluted Share\nThree Months Ended September 30\n2025\n2024\n(millions, except per share amounts)\nNet income attributable to Evergy, Inc.\n$\n475.0 \n$\n2.03 \n$\n465.6 \n$\n2.02 \nNon-GAAP reconciling items:\nLosses from investments in early-stage clean energy and energy solution companies, pre-tax\n(a)\n0.1 \n— \n— \n— \nAdjusted earnings (non-GAAP)\n$\n475.1 \n$\n2.03 \n$\n465.6 \n$\n2.02 \nEarnings (Loss)\nEarnings (Loss) per Diluted Share\nEarnings (Loss)\nEarnings (Loss) per Diluted Share\nYear to Date September 30\n2025\n2024\n(millions, except per share amounts)\nNet income attributable to Evergy, Inc.\n$\n771.3 \n$\n3.31 \n$\n795.3 \n$\n3.45 \nNon-GAAP reconciling items:\nLosses from investments in early-stage clean energy and energy solution companies, pre-tax\n(a)\n29.1 \n0.13 \n— \n— \nMark-to-market impact of JEC economic hedges, pre-tax\n(b)\n— \n— \n2.6 \n0.01 \nIncome tax benefit\n(c)\n(6.4)\n(0.03)\n(0.6)\n— \nAdjusted earnings (non-GAAP)\n$\n794.0 \n$\n3.41 \n$\n797.3 \n$\n3.46 \n(a)\nReflects unrealized losses and impairment losses year to date September 30, 2025, of $29.0 million from non-regulated investments in early-stage clean energy and energy solution companies that are included in investment earnings (loss) on the consolidated statements of comprehensive income and $0.1 million for the three months ended and year to date September 30, 2025, of costs related to the disposal of these investments that are included in operating and maintenance expense on the consolidated statements of comprehensive income.  Evergy has initiated a process to dispose of these investments.\n(b)\nReflects mark-to-market gains or losses related to forward contracts for natural gas and electricity entered into as economic hedges against fuel price volatility related to Evergy Kansas Central's 8% ownership share of JEC that are included in operating revenues on the consolidated statements of comprehensive income.\n(c)\nReflects an income tax effect calculated at a statutory rate of approximately 22%.\n63\nTable of Contents\n \nENVIRONMENTAL MATTERS\nSee Note 11 to the consolidated financial statements for information regarding environmental matters.\nRELATED PARTY TRANSACTIONS\nSee Note 12 to the consolidated financial statements for information regarding related party transactions.\nEVERGY RESULTS OF OPERATIONS\n \nThe following table summarizes Evergy's comparative results of operations.\nThree Months Ended\nSeptember 30\nYear to Date \nSeptember 30\n2025\nChange\n2024\n2025\nChange\n2024\n \n(millions)\nOperating revenues\n$\n1,809.9 \n$\n(1.5)\n$\n1,811.4 \n$\n4,621.4 \n$\n31.5 \n$\n4,589.9 \nFuel and purchased power\n393.1 \n(40.6)\n433.7 \n1,078.8 \n(90.3)\n1,169.1 \nSPP network transmission costs\n110.7 \n11.0 \n99.7 \n322.0 \n49.6 \n272.4 \nOperating and maintenance\n252.8 \n1.2 \n251.6 \n739.9 \n19.1 \n720.8 \nDepreciation and amortization\n290.3 \n8.0 \n282.3 \n866.8 \n28.3 \n838.5 \nTaxes other than income tax\n104.5 \n(12.1)\n116.6 \n320.0 \n(23.3)\n343.3 \nIncome from operations\n658.5 \n31.0 \n627.5 \n1,293.9 \n48.1 \n1,245.8 \nOther income (expense), net\n(4.4)\n(7.4)\n3.0 \n(14.8)\n(23.1)\n8.3 \nInterest expense\n152.0 \n8.1 \n143.9 \n458.3 \n37.6 \n420.7 \nIncome tax expense\n26.0 \n6.0 \n20.0 \n45.6 \n10.9 \n34.7 \nEquity in earnings of equity method investees, net of income taxes\n1.9 \n(0.1)\n2.0 \n5.3 \n(0.5)\n5.8 \nNet income\n478.0 \n9.4 \n468.6 \n780.5 \n(24.0)\n804.5 \nLess: Net income attributable to noncontrolling interests\n3.0 \n— \n3.0 \n9.2 \n— \n9.2 \nNet income attributable to Evergy, Inc.\n$\n475.0 \n$\n9.4 \n$\n465.6 \n$\n771.3 \n$\n(24.0)\n$\n795.3 \n64\nTable of Contents\n \nGross Margin (GAAP) and Utility Gross Margin (non-GAAP)\nThe following tables summarize Evergy's gross margin (GAAP) and MWhs sold and reconcile Evergy's gross margin (GAAP) to Evergy's utility gross margin (non-GAAP).  See \"Executive Summary - Non-GAAP Measures\", above for additional information regarding gross margin (GAAP) and utility gross margin (non-GAAP).\n \nRevenues and Expenses\nMWhs Sold\nThree Months Ended September 30\n2025\nChange\n2024\n2025\nChange\n2024\nRetail revenues\n(millions)\n(thousands)\nResidential\n$\n733.9 \n$\n3.1 \n$\n730.8 \n4,967 \n151 \n4,816 \nCommercial\n598.8 \n(16.4)\n615.2 \n5,323 \n158 \n5,165 \nIndustrial\n180.3 \n(8.6)\n188.9 \n2,188 \n(23)\n2,211 \nOther retail revenues\n12.7 \n1.8 \n10.9 \n23 \n(2)\n25 \nTotal electric retail\n1,525.7 \n(20.1)\n1,545.8 \n12,501 \n284 \n12,217 \nWholesale revenues\n103.3 \n(11.4)\n114.7 \n4,701 \n123 \n4,578 \nTransmission revenues\n128.9 \n5.8 \n123.1 \nN/A\nN/A\nN/A\nOther revenues\n52.0 \n24.2 \n27.8 \nN/A\nN/A\nN/A\nOperating revenues\n1,809.9 \n(1.5)\n1,811.4 \n17,202 \n407 \n16,795 \nFuel and purchased power\n(393.1)\n40.6 \n(433.7)\nSPP network transmission costs\n(110.7)\n(11.0)\n(99.7)\nOperating and maintenance\n(a)\n(128.9)\n(2.2)\n(126.7)\nDepreciation and amortization\n(290.3)\n(8.0)\n(282.3)\nTaxes other than income tax\n(104.5)\n12.1 \n(116.6)\nGross margin (GAAP)\n782.4\n \n30.0\n \n752.4\n \nOperating and maintenance\n(a)\n128.9 \n2.2 \n126.7 \nDepreciation and amortization\n290.3 \n8.0 \n282.3 \nTaxes other than income tax\n104.5 \n(12.1)\n116.6 \nUtility gross margin (non-GAAP)\n$\n1,306.1\n \n$\n28.1\n \n$\n1,278.0\n \n(a)\n Operating and maintenance expenses which are deemed to be directly attributable to revenue-producing activities include plant operating and maintenance expenses at generating units and transmission and distribution operating and maintenance expenses and have been separately presented in order to calculate gross margin as defined under GAAP.  These amounts exclude general and administrative expenses not directly attributable to revenue-producing activities of $123.9 million and $124.9 million for the three months ended September 30, 2025 and 2024, respectively.\n65\nTable of Contents\n \n \nRevenues and Expenses\nMWhs Sold\nYear to Date September 30\n2025\nChange\n2024\n2025\nChange\n2024\nRetail revenues\n(millions)\n(thousands)\nResidential\n$\n1,735.7 \n$\n(10.8)\n$\n1,746.5 \n12,570 \n188 \n12,382 \nCommercial\n1,502.9 \n(30.8)\n1,533.7 \n14,249 \n235 \n14,014 \nIndustrial\n485.8 \n(38.2)\n524.0 \n6,143 \n(239)\n6,382 \nOther retail revenues\n33.5 \n0.5 \n33.0 \n70 \n(7)\n77 \nTotal electric retail\n3,757.9 \n(79.3)\n3,837.2 \n33,032 \n177 \n32,855 \nWholesale revenues\n243.1 \n(15.9)\n259.0 \n12,272 \n1,058 \n11,214 \nTransmission revenues\n391.2 \n30.3 \n360.9 \nN/A\nN/A\nN/A\nOther revenues\n229.2 \n96.4 \n132.8 \nN/A\nN/A\nN/A\nOperating revenues\n4,621.4 \n31.5 \n4,589.9 \n45,304 \n1,235 \n44,069 \nFuel and purchased power\n(1,078.8)\n90.3 \n(1,169.1)\nSPP network transmission costs\n(322.0)\n(49.6)\n(272.4)\nOperating and maintenance\n(a)\n(394.8)\n5.0 \n(399.8)\nDepreciation and amortization\n(866.8)\n(28.3)\n(838.5)\nTaxes other than income tax\n(320.0)\n23.3 \n(343.3)\nGross margin (GAAP)\n1,639.0\n \n72.2\n \n1,566.8\n \nOperating and maintenance\n(a)\n394.8 \n(5.0)\n399.8 \nDepreciation and amortization\n866.8 \n28.3 \n838.5 \nTaxes other than income tax\n320.0 \n(23.3)\n343.3 \nUtility gross margin (non-GAAP)\n$\n3,220.6\n \n$\n72.2\n \n$\n3,148.4\n \n(a)\n Operating and maintenance expenses which are deemed to be directly attributable to revenue-producing activities include plant operating and maintenance expenses at generating units and transmission and distribution operating and maintenance expenses and have been separately presented in order to calculate gross margin as defined under GAAP.  These amounts exclude general and administrative expenses not directly attributable to revenue-producing activities of $345.1 million and $321.0 million year to date September 30, 2025 and 2024, respectively.\nEvergy's gross margin (GAAP) increased $30.0 million for the three months ended September 30, 2025, compared to the same period in 2024 and \nEvergy's utility gross margin (non-GAAP) increased $28.1 million for the three months ended September 30, 2025, compared to the same period in 2024, both measures were driven by:\n•\na $33.9 million increase from new Evergy Missouri West retail rates effective in January 2025; and\n•\nan $8.1 million increase primarily due to higher retail sales driven by higher weather-normalized residential and commercial demand; partially offset by\n•\na $13.9 million decrease in revenue from the Kansas property tax rider, which is offset in taxes other than income tax.\nAdditionally, the increase in Evergy's gross margin (GAAP) was also impacted by: \n•\na $12.1 million decrease in taxes other than income tax as further described below; partially offset by\n•\nan $8.0 million increase in depreciation and amortization as further described below; and\n•\na $2.2 million increase in operating and maintenance expenses which are determined to be directly attributable to revenue producing activities.\nEv\nergy's gross margin (GAAP) increased $72.2 million year to date September 30, 2025, compared to the same period in 2024 and Evergy's utility gross margin (non-GAAP) increased $72.2 million year to date September 30, 2025, compared to the same period in 2024, both measures were driven by:\n•\nan $82.7 million increase from new Evergy Missouri West retail rates effective in January 2025; and\n•\na $30.3 million increase in transmission revenue primarily due to updated transmission costs reflected in Evergy Kansas Central's FERC TFR effective in January 2025; partially offset by\n66\nTable of Contents\n \n•\na $29.6 million decrease in revenue from the Kansas property tax rider, which is offset in taxes other than income tax.\nAdditionally, the increase in Evergy's gross margin (GAAP) was also impacted by: \n•\na $23.3 million decrease in taxes other than income tax as further described below; and\n•\na $5.0 million decrease in operating and maintenance expenses which are determined to be directly attributable to revenue producing activities; offset by\n•\na $28.3 million increase in depreciation and amortization as further described below.\nOperating and Maintenance\nEvergy's operating and maintenance expense increased $19.1 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by:\n•\na $15.2 million increase in general and administrative labor and employee benefits expense, including higher medical claims; and\n•\na $5.6 million increase in credit loss expense.\nDepreciation and Amortization\nEvergy's depreciation and amortization increased $8.0 million for the three months ended September 30, 2025 and $28.3 million year to date September 30, 2025, compared to the same periods in 2024, primarily due to capital additions.\nTaxes Other than Income Tax\nEvergy's taxes other than income tax decreased $12.1 million for the three months ended September 30, 2025 and $23.3 million year to date September 30, 2025, compared to the same periods in 2024, primarily driven by a 2024 over-collection of property taxes in Kansas and subsequent amortization of a refund to customers through the Kansas property tax rider, which is offset in utility gross margin; partially offset by higher assessed property tax values in 2025.\nOther Income (Expense), Net\nEvergy's other income, net for the three months ended September 30, 2024, became other expense, net for the three months ended September 30, 2025, resulting in a $7.4 million increase in net other expense, primarily driven by recording lower Evergy Kansas Central COLI benefits in the third quarter of 2025. \nEvergy's other income, net year to date September 30, 2024, became other expense, net year to date September 30, 2025, resulting in a $23.1 million increase in net other expense, primarily driven by:\n•\n$29.0 million of unrealized losses and impairment losses from non-regulated investments in early-stage clean energy and energy solution companies; and\n•\na $7.8 million increase primarily due to recording lower Evergy Kansas Central COLI benefits in 2025; partially offset by\n•\n$11.6 million of income related to the sale of a commercial solar generation project completed in 2025.\nInterest Expense\nEvergy's interest expense increased $8.1 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily driven by:\n•\nan $18.3 million increase due to issuances of long-term debt; partially offset by\n•\na $5.8 million decrease due to increases in carrying costs deferred to a regulatory asset in accordance with PISA due to a higher outstanding balance of qualified PISA additions; and\n•\na $5.7 million decrease due to the repayment of long-term debt.\n67\nTable of Contents\n \nEvergy's interest expense increased $37.6 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by:\n•\na $57.3 million increase due to issuances of long-term debt; and\n•\na $4.5 million increase due to lower debt AFUDC primarily driven by lower CWIP balances and lower short-term interest rates in 2025; partially offset by \n•\na $15.5 million decrease due to the repayment of long-term debt; and\n•\na $14.6 million decrease due to increases in carrying costs deferred to a regulatory asset in accordance with PISA due to Evergy Kansas Central and Evergy Metro electing into Kansas PISA beginning July 2024.\nIncome Tax Expense\nEvergy's income tax expense increased\n \n$6.0 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily driven by:\n•\na $3.4 million increase primarily due to higher pre-tax income in the third quarter of 2025; and\n•\na $2.4 million increase primarily due to lower recognition of amortization of excess deferred income taxes.\nEvergy's income tax expense increased $10.9 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by an $8.3 million increase due to lower recognition of amortization of excess deferred income taxes.\nLIQUIDITY AND CAPITAL RESOURCES\nEvergy relies primarily upon cash from operations, short-term borrowings, long-term debt and equity and equity-like issuances and its existing cash and cash equivalents to fund its capital requirements.  Evergy's capital requirements primarily consist of capital expenditures, payment of contractual obligations and other commitments, and the payment of dividends to shareholders.  Evergy expects cash flows to be sufficient to meet existing short-term capital requirements.  See the Evergy Companies' combined 2024 Form 10-K for more information on Evergy's sources and uses of cash. \nShort-Term Borrowings\nAs of September 30, 2025, Evergy had $1,263.5 million of available borrowing capacity under its master credit facility.  The available borrowing capacity under the master credit facility consisted of $254.2 million for Evergy, Inc., $495.3 million for Evergy Kansas Central, $402.1 million for Evergy Metro and $111.9 million for Evergy Missouri West.  The Evergy Companies' borrowing capacity under the master credit facility also supports their issuance of commercial paper.  See Note 7 to the consolidated financial statements for more information regarding the master credit facility.  \nAlong with cash flows from operations and receivable sales facilities, Evergy generally uses borrowings under its master credit facility and the issuance of commercial paper to meet its day-to-day cash flow requirements.  Evergy may also utilize these short-term borrowings to repay maturing long-term debt until the long-term debt is able to be refinanced.\nSignificant Debt Issuances\nSee Note 8 to the consolidated financial statements for information regarding significant debt issuances.\n68\nTable of Contents\n \nCredit Ratings\nIn April 2025, Moody's Investor Service changed Evergy Missouri West's outlook from Negative to Stable and lowered credit ratings as detailed in the following table.\nMoody's\nInvestors Service\n(a)\nEvergy Missouri West\nCorporate Credit Rating\nBaa3\nSenior Secured Debt \nBaa1\nCommercial Paper \nP-3\n(a)\nA securities rating is not a recommendation to buy, sell or hold securities and may be subject to revision or withdrawal at any time by the assigning rating agency.\nPensions\nSee Note 6 to the consolidated financial statements for information regarding Evergy's pension and post-retirement plan contributions.\nATM Program\nIn May 2025, Evergy entered into an equity distribution agreement, pursuant to which Evergy may sell, from time to time, up to an aggregate of $1.2 billion of its common stock through an ATM Program, which may utilize optional forward sales agreements.  Evergy subsequently entered into forward sale agreements under the ATM program and as of September 30, 2025, the ATM Program had approximately $1.1 billion of common stock available for issuance.  As of September 30, 2025, Evergy has not received any proceeds related to the ATM Program.  See Note 13 to the consolidated financial statements for more information.\nDebt Covenants\nAs of September 30, 2025, Evergy was in compliance with all debt covenants under the master credit facility and certain debt instruments that contain restrictions that require the maintenance of certain capitalization and leverage ratios.  See Note 7 to the consolidated financial statements for more information.\nCash Flows\nThe following table presents Evergy's cash flows from operating, investing and financing activities. \nYear to Date September 30\n2025\n2024\n(millions)\nCash Flows from Operating Activities\n$\n1,711.2 \n$\n1,588.1 \nCash Flows used in Investing Activities\n(1,902.0)\n(1,790.3)\nCash Flows from Financing Activities\n204.5 \n231.2 \nCash Flows from Operating Activities\nEvergy's cash flows from operating activities increased $123.1 million year to date September 30, 2025, compared to the same perio\nd in 2024, primarily driven by an increase in cash receipts for retail electric sales in 2025 and a decrease in payments made for a Wolf Creek refueling outage in 2024. \n69\nTable of Contents\n \nCash Flows used in Investing Activities\nEvergy's cash flows used in investing activities increased $111.7 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by \na $110.0 million increase in additions to property, plant and equipment, due to increased spending for a variety of capital projects. \nCash Flows from Financing Activities\nEvergy's cash flows from financing activities decreased $26.7 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by:\n•\na $447.9 million decrease in short-term borrowings primarily due to the Evergy Kansas Central repayment of commercial paper borrowings with proceeds from long-term debt issuances; partially offset by\n•\na $382.6 million increase due to lower retirements of long-term debt, primarily comprised of Evergy Metro's repayment of $350.0 million of 3.65% Senior Notes in August 2025 and Evergy Missouri West's $36.0 million of 3.49% Senior Notes in August 2025, as compared to Evergy's repayment of $800.0 million of 2.45% Senior Notes in September 2024; and \n•\na $27.0 million increase due to proceeds from refundable advances for construction related to the procurement of long-lead time materials.    \nEVERGY KANSAS CENTRAL, INC.\nMANAGEMENT'S NARRATIVE ANALYSIS OF RESULTS OF OPERATIONS\nThe below results of operations and related discussion for Evergy Kansas Central is presented in a reduced disclosure format in accordance with General Instruction (H)(2)(a) to Form 10-Q.\nThe following table summarizes Evergy Kansas Central's comparative results of operations. \nYear to Date September 30\n2025\nChange\n2024\n \n(millions)\nOperating revenues\n$\n2,328.6 \n$\n(9.4)\n$\n2,338.0 \nFuel and purchased power\n406.9 \n(38.8)\n445.7 \nSPP network transmission costs\n322.0 \n49.6 \n272.4 \nOperating and maintenance\n352.5 \n(3.4)\n355.9 \nDepreciation and amortization\n431.9 \n9.6 \n422.3 \nTaxes other than income tax\n171.9 \n(18.5)\n190.4 \nIncome from operations\n643.4 \n(7.9)\n651.3 \nOther income, net\n8.5 \n(5.3)\n13.8 \nInterest expense\n178.9 \n5.7 \n173.2 \nIncome tax expense\n22.3 \n9.3 \n13.0 \nEquity in earnings of equity method investees, net of income taxes\n2.6 \n0.2 \n2.4 \nNet income\n453.3 \n(28.0)\n481.3 \nLess: Net income attributable to noncontrolling interests\n9.2 \n— \n9.2 \nNet income attributable to Evergy Kansas Central, Inc.\n$\n444.1 \n$\n(28.0)\n$\n472.1 \n70\nTable of Contents\n \nEvergy Kansas Central Gross Margin (GAAP) and Utility Gross Margin (non-GAAP)\nThe following table summarizes Evergy Kansas Central's gross margin (GAAP) and MWhs sold and reconciles Evergy Kansas Central's gross margin (GAAP) to Evergy Kansas Central's utility gross margin (non-GAAP).  See \"Executive Summary - Non-GAAP Measures\" for additional information regarding gross margin (GAAP) and utility gross margin (non-GAAP).\n \nRevenues and Expenses\nMWhs Sold\nYear to Date September 30\n2025\nChange\n2024\n2025\nChange\n2024\nRetail revenues\n(millions)\n(thousands)\nResidential\n$\n743.3 \n$\n(36.5)\n$\n779.8 \n5,275 \n(16)\n5,291 \nCommercial\n618.9 \n(34.0)\n652.9 \n5,750 \n45 \n5,705 \nIndustrial\n310.9 \n(31.5)\n342.4 \n3,859 \n(171)\n4,030 \nOther retail revenues\n18.1 \n(0.8)\n18.9 \n29 \n(1)\n30 \nTotal electric retail\n1,691.2 \n(102.8)\n1,794.0 \n14,913 \n(143)\n15,056 \nWholesale revenues\n213.3 \n18.4 \n194.9 \n7,750 \n319 \n7,431 \nTransmission revenues\n362.7 \n22.6 \n340.1 \nN/A\nN/A\nN/A\nOther revenues\n61.4 \n52.4 \n9.0 \nN/A\nN/A\nN/A\nOperating revenues\n2,328.6 \n(9.4)\n2,338.0 \n22,663 \n176 \n22,487 \nFuel and purchased power\n(406.9)\n38.8 \n(445.7)\nSPP network transmission costs\n(322.0)\n(49.6)\n(272.4)\nOperating and maintenance \n(a)\n(172.7)\n17.2 \n(189.9)\nDepreciation and amortization\n(431.9)\n(9.6)\n(422.3)\nTaxes other than income tax\n(171.9)\n18.5 \n(190.4)\nGross margin (GAAP)\n823.2\n \n5.9\n \n817.3\n \nOperating and maintenance \n(a)\n172.7 \n(17.2)\n189.9 \nDepreciation and amortization\n431.9 \n9.6 \n422.3 \nTaxes other than income tax\n171.9 \n(18.5)\n190.4 \nUtility gross margin (non-GAAP)\n$\n1,599.7\n \n$\n(20.2)\n$\n1,619.9\n \n(a) \nOperating and maintenance expenses which are deemed to be directly attributable to revenue-producing activities include plant operating and maintenance expenses at generating units and transmission and distribution operating and maintenance expenses and have been separately presented in order to calculate gross margin as defined under GAAP.  These amounts exclude general and administrative expenses not directly attributable to revenue-producing activities of $179.8 million and $166.0 million year to date September 30, 2025 and 2024, respectively.\nEvergy Kansas Central's gross margin (GAAP) increased $5.9 million year to date September 30, 2025, compared to the same period in 2024, and Evergy Kansas Central's utility gross margin (non-GAAP) decreased $20.2 million year to date September 30, 2025, compared to the same period in 2024, both measures were driven by: \n•\na $22.6 million increase in transmission revenue primarily due to updated transmission costs reflected in Evergy Kansas Central's FERC TFR effective in January 2025; partially offset by\n•\na $24.5 million decrease in revenue from the Kansas property tax rider, which is offset in taxes other than income tax; and\n•\nan $18.3 million decrease primarily due to lower retail sales driven by unfavorable weather (cooling degree days decreased 15%, partially offset by a 24% increase in heating degree days); partially offset by higher weather-normalized residential and commercial demand.\nAdditionally, the increase in Evergy Kansas Central's gross margin (GAAP) was also impacted by:\n•\nan $18.5 million decrease in taxes other than income tax as described further below; and\n•\na $17.2 million decrease in operating and maintenance expenses which are determined to be directly attributable to revenue producing activities primarily driven by a $9.9 million decrease in transmission and distribution operating and maintenance expense as further described below; partially offset by\n•\na $9.6 million increase in depreciation and amortization as described further below.\n71\nTable of Contents\n \nEvergy Kansas Central Operating and Maintenance\nEvergy Kansas Central's operating and maintenance expense decreased $3.4 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by:\n•\na $9.9 million decrease in transmission and distribution operating and maintenance expenses primarily driven by a $10.1 million decrease in non-labor expense primarily due to a $4.5 million increase in costs billed for common use assets primarily from Evergy Kansas Central to Evergy Missouri West and a $2.7 million decrease in vegetation management costs; partially offset by\n•\na $6.1 million increase in general and administrative labor and employee benefits expense, including higher medical claims; and\n•\na $2.7 million increase in credit loss expense.\nEvergy Kansas Central Depreciation and Amortization\nEvergy Kansas Central's depreciation and amortization expense increased $9.6 million year to date September 30, 2025, compared to the same period in 2024, primarily due to capital additions.\nEvergy Kansas Central Taxes Other than Income Tax\nEvergy Kansas Central's taxes other than income tax decreased $18.5 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by a 2024 over-collection of property taxes in Kansas and subsequent amortization of a refund to customers through the Kansas property tax rider, which is offset in utility gross margin; partially offset by higher assessed property tax values in 2025.\nEvergy Kansas Central Other Income, Net\nEvergy Kansas Central's other income, net decreased $5.3 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by a $7.4 million decrease due to recording lower Evergy Kansas Central COLI benefits in 2025. \nEvergy Kansas Central Interest Expense\nEvergy Kansas Central's interest expense increased $5.7 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by:\n•\na $16.5 million increase due to issuances of long-term debt; and\n•\na $4.0 million increase due to lower debt AFUDC primarily driven by lower CWIP balances and short-term interest rates in 2025; partially offset by \n•\na $12.0 million decrease due to increases in carrying costs deferred to a regulatory asset in accordance with PISA due to Evergy Kansas Central electing into Kansas PISA beginning July 2024.\nEvergy Kansas Central Income Tax Expense\nEvergy Kansas Central's income tax expense increased $9.3 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by:\n•\na $5.8 million increase due to lower recognition of amortization of excess deferred income taxes; and\n•\na $4.3 million increase due to lower recognition of wind income tax credits in 2025.\n72\nTable of Contents\n \nEVERGY METRO, INC.\nMANAGEMENT'S NARRATIVE ANALYSIS OF RESULTS OF OPERATIONS\nThe below results of operations and related discussion for Evergy Metro is presented in a reduced disclosure format in accordance with General Instruction (H)(2)(a) to Form 10-Q.\nThe following table summarizes Evergy Metro's comparative results of operations. \nYear to Date September 30\n2025\nChange\n2024\n \n(millions)\nOperating revenues\n$\n1,514.8 \n$\n11.6 \n$\n1,503.2 \nFuel and purchased power\n432.6 \n1.4 \n431.2 \nOperating and maintenance\n224.3 \n14.0 \n210.3 \nDepreciation and amortization\n304.6 \n1.4 \n303.2 \nTaxes other than income tax\n106.6 \n(5.3)\n111.9 \nIncome from operations\n446.7 \n0.1 \n446.6 \nOther expense, net\n(0.7)\n0.1 \n(0.8)\nInterest expense\n105.1 \n(6.9)\n112.0 \nIncome tax expense\n43.4 \n0.9 \n42.5 \nNet income\n$\n297.5 \n$\n6.2 \n$\n291.3 \n73\nTable of Contents\n \nEvergy Metro Gross Margin (GAAP) and Utility Gross Margin (non-GAAP)\nThe following table summarizes Evergy Metro's gross margin (GAAP) and MWhs sold and reconciles Evergy Metro's gross margin (GAAP) to Evergy Metro's utility gross margin (non-GAAP).  See \"Executive Summary - Non-GAAP Measures\" for additional information regarding gross margin (GAAP) and utility gross margin (non-GAAP).\n \nRevenues and Expenses\nMWhs Sold\nYear to Date September 30\n2025\nChange\n2024\n2025\nChange\n2024\nRetail revenues\n(millions)\n(thousands)\nResidential\n$\n601.5 \n$\n8.6 \n$\n592.9 \n4,419 \n115 \n4,304 \nCommercial\n610.4 \n0.1 \n610.3 \n5,697 \n72 \n5,625 \nIndustrial\n102.6 \n(1.2)\n103.8 \n1,286 \n(18)\n1,304 \nOther retail revenues\n8.6 \n0.7 \n7.9 \n31 \n(3)\n34 \nTotal electric retail\n1,323.1 \n8.2 \n1,314.9 \n11,433 \n166 \n11,267 \nWholesale revenues\n20.8 \n(44.0)\n64.8 \n4,196 \n496 \n3,700 \nTransmission revenues\n19.4 \n4.4 \n15.0 \nN/A\nN/A\nN/A\nOther revenues\n151.5 \n43.0 \n108.5 \nN/A\nN/A\nN/A\nOperating revenues\n1,514.8 \n11.6 \n1,503.2 \n15,629 \n662 \n14,967 \nFuel and purchased power\n(432.6)\n(1.4)\n(431.2)\nOperating and maintenance \n(a)\n(156.4)\n(5.7)\n(150.7)\nDepreciation and amortization\n(304.6)\n(1.4)\n(303.2)\nTaxes other than income tax\n(106.6)\n5.3 \n(111.9)\nGross margin (GAAP)\n514.6\n \n8.4\n \n506.2\n \nOperating and maintenance \n(a)\n156.4 \n5.7 \n150.7 \nDepreciation and amortization\n304.6 \n1.4 \n303.2 \nTaxes other than income tax \n106.6 \n(5.3)\n111.9 \nUtility gross margin (non-GAAP)\n$\n1,082.2\n \n$\n10.2\n \n$\n1,072.0\n \n(a) \nOperating and maintenance expenses which are deemed to be directly attributable to revenue-producing activities include plant operating and maintenance expenses at generating units and transmission and distribution operating and maintenance expenses and have been separately presented in order to calculate gross margin as defined under GAAP.  These amounts exclude general and administrative expenses not directly attributable to revenue-producing activities of $67.9 million and $59.6 million year to date September 30, 2025 and 2024, respectively.\nEvergy Metro's gross margin (GAAP) increased $8.4 million year to date September 30, 2025, compared to the same period in 2024, and Evergy Metro's utility gross margin (non-GAAP) increased $10.2 million year to date September 30, 2025, compared to the same period in 2024, both measures were driven by:\n•\na $10.8 million increase primarily due to higher retail sales driven by favorable weather (heating degree days increased 17%); and\n•\na $4.4 million increase in transmission revenue; partially offset by\n•\na $5.0 million decrease in revenue from the Kansas property tax rider, which is offset in taxes other than income tax; and\nAdditionally, the increase in Evergy Metro's gross margin (GAAP) was also impacted by:\n•\na $5.3 million decrease in taxes other than income tax, as further described below; partially offset by\n•\na $5.7 million increase in operating and maintenance expenses which are determined to be directly attributable to revenue producing activities; and\n•\na $1.4 million increase in depreciation and amortization.\n74\nTable of Contents\n \nEvergy Metro Operating and Maintenance\nEvergy Metro's operating and maintenance expense increased $14.0 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by:\n•\na $10.0 million increase in general and administrative labor and employee benefits expense, including higher medical claims; and\n•\na $1.2 million increase in credit loss expense.\nEvergy Metro Taxes Other than Income Tax\nEvergy Metro's taxes other than income tax decreased $5.3 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by a 2024 over-collection of property taxes in Kansas and subsequent amortization of a refund to customers through the Kansas property tax rider, which is offset in utility gross margin; partially offset by higher assessed property tax values in 2025.\nEvergy Metro Interest Expense\nEvergy Metro's interest expense decreased $6.9 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by:\n•\nan $8.7 million decrease due to increases in carrying costs deferred to a regulatory asset in accordance with PISA due to a higher outstanding balance of qualified PISA additions and Evergy Metro electing into Kansas PISA beginning July 2024; and\n•\na $5.5 million decrease in interest expense on short-term borrowings primarily due to lower weighted-average interest rates; partially offset by\n•\na $6.9 million increase due to issuances of long-term debt."
}