{
  "source_file": "exe-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\nBusiness\nUnless the context otherwise requires, references to “Expand Energy,” the “Company,” “us,” “we,” “our” and “ours” in this report are to Expand Energy Corporation together with its subsidiaries. Our principal executive offices are located at 6100 North Western Avenue, Oklahoma City, Oklahoma 73118, and our main telephone number at that location is (405) 848-8000.\nOur Business\nExpand Energy is the largest independent natural gas producer in the U.S., based on net daily production, and is focused on responsibly developing an abundant supply of natural gas, oil and NGL to expand energy access for all. Our operations are located in Louisiana in the Haynesville and Bossier Shales (“Haynesville”), in Pennsylvania in the Marcellus Shale (“Northeast Appalachia”) and in West Virginia and Ohio in the Marcellus and Utica Shales (“Southwest Appalachia”) and include interests in approximately 8,000 gross natural gas and oil wells.\nOn October 1, 2024, we completed the Southwestern Merger, creating a premier energy company that we believe is underpinned by a leading natural gas portfolio adjacent to the highest demand markets, premium inventory, a resilient financial foundation and an investment grade balance sheet. We believe that we are uniquely positioned to deliver affordable, lower-carbon energy to meet growing domestic and international demand while creating sustainable value for stakeholders. \nDuring 2023, we completed our exit from Eagle Ford through three separate divestiture transactions, with aggregate proceeds from these transactions exceeding $3.5 billion, subject to customary post-closing adjustments. \nOn March 25, 2022, we sold our Powder River Basin assets in Wyoming to Continental Resources, Inc. for approximately $450 million. \nOn March 9, 2022, we completed our acquisition of Chief, Radler and associated non-operated interests held by affiliates of Tug Hill. Chief, Radler and Tug Hill held producing assets and an inventory of premium drilling locations in the Marcellus Shale in Northeast Pennsylvania.\nInformation About Us\nWe make available, free of charge on our website at expandenergy.com\n,\n our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. From time to time, we also post announcements, updates, events, investor information and presentations on our website in addition to copies of all recent news releases. Documents and information on our website are not incorporated by reference herein.\nThe SEC maintains a website at www.sec.gov that contains reports, proxy and information statements, and other information regarding issuers, including Expand Energy, that file electronically with the SEC.\nBusiness Strategy\nOur strategy is to create shareholder value through the responsible development of our significant resource plays while continuing to be a leading provider of natural gas to markets in need. We continue to focus on improving margins through operating efficiencies and financial discipline and improving our ESG performance. To accomplish these goals, we intend to allocate our human resources and capital expenditures to projects we believe offer the highest cash return on capital invested, to deploy leading drilling and completion technology throughout our portfolio, and to take advantage of acquisition and divestiture opportunities to strengthen our portfolio. We also intend to continue to dedicate capital to projects designed to reduce the environmental impact of our production activities.\n10\nTABLE OF CONTENTS\nOperating Areas\nWe focus our acquisition, exploration, development and production efforts in the geographic operating areas described below.\nHaynesville - \nHaynesville and Bossier Shales in Louisiana.\nNortheast Appalachia - \nMarcellus Shale in Pennsylvania.\nSouthwest Appalachia - \nMarcellus and Utica Shales in Ohio and West Virginia.\nWell Data\nAs of December 31, 2024, we held an interest in approximately 8,000 gross productive wells, including 6,200 (4,300 net) wells in which we held a working interest and 1,800 wells in which we held an overriding or royalty interest. Of the 6,200 (4,300 net) wells in which we held a working interest, substantially all were classified as productive natural gas wells. During 2024, we operated 5,500 gross wells and held a non-operating working interest in 700 gross wells. We also completed 81 gross (62 net) wells as operator and participated in another 6 gross and less than one net well completed by other operators. We operate approximately 99% of our current daily production volumes.\nDrilling Activity\nThe following table sets forth the wells we completed or participated in during the periods indicated. In the table, \"gross\" refers to the total wells in which we had a working interest and \"net\" refers to gross wells multiplied by our working interest: \n2024\n2023\n2022\nGross\n%\nNet\n%\nGross\n%\nNet\n%\nGross\n%\nNet\n%\nDevelopment:\nProductive\n87 \n100 \n62 \n100 \n194 \n100 \n109 \n100 \n237 \n100 \n151 \n100 \nDry\n— \n— \n— \n— \n— \n— \n— \n— \n— \n— \n— \n— \nTotal\n87 \n100 \n62 \n100 \n194 \n100 \n109 \n100 \n237 \n100 \n151 \n100 \nExploratory:\nProductive\n— \n— \n— \n— \n— \n— \n— \n— \n— \n— \n— \n— \nDry\n— \n— \n— \n— \n— \n— \n— \n— \n1 \n100 \n1 \n100 \nTotal\n— \n— \n— \n— \n— \n— \n— \n— \n1 \n100 \n1 \n100 \nThe following table shows the wells we completed or participated in by operating area:\n2024\n2023\n2022\nGross Wells\nNet Wells\nGross Wells\nNet Wells\nGross Wells\nNet Wells\nHaynesville\n48 \n41 \n84 \n51 \n83 \n61 \nNortheast Appalachia\n38 \n20 \n78 \n37 \n103 \n59 \nSouthwest Appalachia\n1 \n1 \n— \n— \n— \n— \nEagle Ford\n— \n— \n32 \n21 \n52 \n32 \nTotal\n87 \n62 \n194 \n109 \n238 \n152 \nAs of December 31, 2024, we had 162 gross (128 net) wells in the process of being drilled or completed. \n11\nTABLE OF CONTENTS\nProduction Volumes, Sales Prices, Production Expenses and Gathering, Processing and Transportation Expenses\nThe following tables present information regarding our net production volumes, average sales price received for our production, and production and gathering, processing and transportation expenses per Mcfe for the periods indicated for our significant fields:\nProduction\nNatural Gas (Bcf)\nOil (MMBbl)\nNGL (MMBbl)\nTotal (Bcfe)\n2024\nHaynesville\n561\n— \n— \n561\nNortheast Appalachia\n662\n— \n— \n662\nSouthwest Appalachia\n98\n1.2 \n7.8 \n152\nTotal Production\n1,321\n1.2\n7.8\n1,375\n2023\nHaynesville\n566\n— \n— \n566\nNortheast Appalachia\n669\n— \n— \n669\nEagle Ford\n31\n7.7\n3.8\n100\nTotal Production\n1,266\n7.7\n3.8\n1,335\n2022\nHaynesville\n588\n— \n— \n588\nNortheast Appalachia\n670\n— \n— \n670\nEagle Ford\n46\n18.7\n5.8\n193\nTotal Production\n1,308 \n19.4\n6.0\n1,461\n12\nTABLE OF CONTENTS\nAverage Sales Price of Production\n(a)\nExpenses ($/Mcfe)\nNatural Gas ($/Mcf)\nOil ($/Bbl)\nNGL ($/Bbl)\nTotal ($/Mcfe)\nProduction\nGP&T\n2024\nHaynesville\n$\n2.14 \n$\n— \n$\n— \n$\n2.14 \n$\n0.30 \n$\n0.58 \nNortheast Appalachia\n$\n1.88 \n$\n— \n$\n— \n$\n1.88 \n$\n0.15 \n$\n0.77 \nSouthwest Appalachia\n$\n2.42 \n$\n60.41 \n$\n27.44 \n$\n3.42 \n$\n0.32 \n$\n1.33 \nTotal\n$\n2.03 \n$\n60.41 \n$\n27.44 \n$\n2.16 \n$\n0.23 \n$\n0.75 \n2023\nHaynesville\n$\n2.30 \n$\n— \n$\n— \n$\n2.30 \n$\n0.33 \n$\n0.46 \nNortheast Appalachia\n$\n2.22 \n$\n— \n$\n— \n$\n2.22 \n$\n0.12 \n$\n0.65 \nEagle Ford\n$\n2.25 \n$\n77.80 \n$\n25.62 \n$\n7.64 \n$\n0.91 \n$\n1.57 \nTotal\n$\n2.25 \n$\n77.80 \n$\n25.62 \n$\n2.66 \n$\n0.27 \n$\n0.64 \n2022\nHaynesville\n$\n5.92 \n$\n— \n$\n— \n$\n5.92 \n$\n0.26 \n$\n0.53 \nNortheast Appalachia\n$\n6.03 \n$\n— \n$\n— \n$\n6.03 \n$\n0.11 \n$\n0.57 \nEagle Ford\n$\n5.64 \n$\n96.10 \n$\n36.76 \n$\n11.76 \n$\n1.22 \n$\n1.78 \nTotal\n$\n5.96 \n$\n96.07 \n$\n37.48 \n$\n6.77 \n$\n0.33 \n$\n0.73 \n___________________________________________\n(a) Excludes the effect of hedging.\n13\nTABLE OF CONTENTS\nNatural Gas, Oil and NGL Reserves\n \nThe tables below set forth information as of December 31, 2024, with respect to our estimated proved reserves, the associated estimated future net revenue, the present value of estimated future net revenue and the standardized measure of discounted future net cash flows. None of the estimated future net revenue, PV-10 nor the standardized measure are intended to represent the current market value of the estimated natural gas, oil and NGL reserves we own. All of our estimated reserves are located within the United States.\nDecember 31, 2024\nNatural Gas\nOil\nNGL\nTotal\n(Bcf)\n(MMBbl)\n(MMBbl)\n(Bcfe)\nProved developed\n14,418 \n40.3 \n383.0 \n16,958 \nProved undeveloped\n2,506 \n27.6 \n195.1 \n3,842 \nTotal proved\n(a)\n16,924 \n67.9 \n578.1 \n20,800 \nProved \nDeveloped\nProved \nUndeveloped\nTotal \nProved\nStandardized measure\n(b) \n$\n7,531 \nEstimated future net revenue\n(b)\n$\n10,620 \n$\n3,049 \n$\n13,669 \nPresent value of estimated future net revenue (PV-10)\n(b)\n$\n6,519 \n$\n1,048 \n$\n7,567 \n___________________________________________\n(a)    Haynesville, Northeast Appalachia and Southwest Appalachia accounted for approximately 19%, 39% and 42%, respectively, of our estimated proved reserves by volume as of December 31, 2024.\n(b)    Estimated future net revenue represents the estimated future revenue to be generated from the production of proved reserves, net of estimated production and future development costs, using pricing differentials and costs under existing economic conditions as of December 31, 2024, and assuming commodity prices as set forth below. For the purpose of determining prices used in our reserve reports, we used the unweighted arithmetic average of the prices on the first day of each month within the 12-month period ended December 31, 2024. The price used in our PV-10 measure was $2.13 per Mcf of natural gas and $75.48 per Bbl of oil and NGL, before basis differential adjustments. These prices should not be interpreted as a prediction of future prices, nor do they reflect the value of our commodity derivative instruments in place as of December 31, 2024. The amounts shown do not give effect to non-property-related expenses, such as corporate general and administrative expenses and debt service, or to depreciation, depletion and amortization. The present value of estimated future net revenue typically differs from the standardized measure because the former does not include the effects of estimated future income tax expense of $36 million as of December 31, 2024.\nManagement uses PV-10, which is calculated without deducting estimated future income tax expenses, as a measure of the value of the Company's current proved reserves and to compare relative values among peer companies. We also understand that securities analysts and rating agencies use this measure in similar ways. While estimated future net revenue and the present value thereof are based on prices, costs and discount factors which may be consistent from company to company, the standardized measure of discounted future net cash flows is dependent on the unique tax situation of each individual company. PV-10, a non-GAAP measure, should not be considered in isolation or as a substitute for the standardized measure of discounted future net cash flows or any other measure of a company's financial or operating performance presented in accordance with GAAP.\nA comparison of the standardized measure of discounted future net cash flows to PV-10 is presented above. Neither PV-10 nor the standardized measure of discounted future net cash flows purport to represent the fair value of our proved natural gas and oil reserves.\n14\nTABLE OF CONTENTS\nAs of December 31, 2024, our proved reserve estimates included 3,842 Bcfe of reserves classified as proved undeveloped, compared to 3,325 Bcfe as of December 31, 2023. Presented below is a summary of changes in our proved undeveloped reserves for 2024:\nTotal\n(Bcfe)\nProved undeveloped reserves, beginning of period\n3,325 \nExtensions and discoveries\n55 \nRevisions of previous estimates\n(1,625)\nConversion to proved developed reserves\n(1,050)\nPurchase of reserves-in-place\n3,137 \nSales of reserves-in-place\n— \nProved undeveloped reserves, end of period\n3,842 \nAs of December 31, 2024, all PUDs were planned to be developed within five years of original recording. In 2024, we invested approximately $395 million to convert 1,050 Bcfe of PUDs to proved developed reserves. We added 55 Bcfe of PUD reserves through extensions and discoveries due to new PUDs added in Northeast Appalachia. We had a net downward revision in previous estimates of 1,625 Bcfe. The net downward revision primarily consisted of 2,022 Bcfe of downward revisions due to lower natural gas, oil and NGL prices in 2024, and a downward revision of 183 Bcfe due to development plan changes in Northeast Appalachia and Haynesville, partially offset by 462 Bcfe of positive revisions on existing PUD locations primarily related to increased production forecasts, increased ownership interest in the locations, and improved differentials in the Haynesville, as well as 118 Bcfe of PUDs added in areas previously categorized as proved in Northeast Appalachia and Haynesville. We added 3,137 Bcfe of PUDs through purchase of reserves-in-place, primarily as a result of the Southwestern Merger. \nThe future net revenue attributable to our estimated PUDs was $3.0 billion, and the present value was $1.0 billion as of December 31, 2024. These values were calculated assuming that we will expend approximately $1.8 billion to develop these reserves ($739 million in 2025, $546 million in 2026, $530 million in 2027, $8 million in 2028 and $7 million in 2029). The amount and timing of these expenditures will depend on a number of factors, including actual drilling results, service costs, commodity prices and the availability of capital. Our developmental drilling schedules are subject to revision and reprioritization throughout the year resulting from unknowable factors such as commodity prices, unexpected developmental drilling results, title issues and infrastructure availability or constraints.\nAs of December 31, 2024, approximately 1,606 Bcfe, or 8%, of our total proved reserves were developed and non-producing, primarily due to our deferred turn in line program.\nOur ownership interest used for calculating proved reserves and the associated estimated future net revenue assumes maximum participation by other parties to our farm-out and participation agreements.\nOur estimated proved reserves and the standardized measure of discounted future net cash flows of the proved reserves as of December 31, 2024, 2023 and 2022, along with the changes in quantities and standardized measure of the reserves for each of the three years then ended, are shown in \nSupplemental Disclosures About Natural Gas, Oil and NGL Producing Activities\n included in \nItem 8 of Part II\n of this report. No estimates of proved reserves comparable to those included herein have been included in reports to any federal agency other than the SEC.\nThere are numerous uncertainties inherent in estimating quantities of proved reserves and in projecting future rates of production and timing of development expenditures, including many factors beyond our control. The reserve data represents only estimates. Reserve engineering is a subjective process of estimating underground accumulations of natural gas and oil that cannot be measured exactly, and the accuracy of any reserve estimate is a function of the quality of available data and of engineering and geological interpretation and judgment. As a result, estimates made by different engineers often vary. Accordingly, reserve estimates often differ from the actual quantities of natural gas, oil and NGL that are ultimately recovered. Furthermore, the estimated future net revenue from proved reserves and the associated present value are based upon certain assumptions, including prices, future production levels and costs that may not prove correct. Future prices and costs may be materially higher or \n15\nTABLE OF CONTENTS\nlower than the prices and costs as of the date of any estimate. See \nSupplemental Disclosures About Natural Gas, Oil and NGL Producing Activities\n included in \nItem 8 of Part II\n of this report for further discussion of our reserve quantities. \nReserves Estimation\nWe engaged Netherland, Sewell & Associates, Inc., a third-party engineering firm, to audit our total proved reserves as of December 31, 2024. A copy of the audit letter issued by the engineering firm is filed with this report as Exhibit 99.1. The qualifications of the technical persons at the firm primarily responsible for overseeing the audit of our reserve estimates are set forth below.\n•\nOver 43 combined years of practical experience in the estimation and evaluation of reserves;\n•\nLicensed Professional Engineer in the State of Texas and Bachelor of Science degree in Chemical Engineering;\n•\nLicensed Professional Geoscientist in the State of Texas and Bachelor of Science and Master of Science degrees in Geology.\nOur Corporate Reserves Department prepared our estimated proved reserves as of December 31, 2024 disclosed in this report. Those estimates were established utilizing standard geological and engineering technologies, which are generally accepted by the petroleum industry and were based upon the best available production, engineering and geologic data. These technologies, including computational methods, provide reasonable certainty in our reserves estimation and include technologies and inputs such as drilling results and well performance, decline curve analysis of wells in analogous reservoirs, material balance, volumetric calculation, statistical analysis, well logs, geologic maps and seismic data.\nOur Manager – Corporate Reserves, who is in charge of our Corporate Reserves Department, is the technical person primarily responsible for overseeing the preparation of our reserve estimates and for coordinating any reserves work conducted by a third-party engineering firm. His qualifications include the following:\n•\nOver 17 years of practical experience in the oil and gas industry, with over 15 years in reservoir engineering;\n•\nLicensed Professional Engineer (Petroleum) in the State of Oklahoma;\n•\nMember in good standing of the Society of Petroleum Evaluation Engineers;\n•\nBachelor of Science in Mechanical Engineering; and\n•\nMasters of Business Administration.\nWe ensure that the key members of our Corporate Reserves Department have appropriate technical qualifications to oversee the preparation of reserve estimates. Our engineering technicians have a minimum of a four-year degree in mathematics, economics, finance or other technical/business/science field. We maintain a continuous education program for our engineers and technicians on new technologies and industry advancements as well as refresher training on basic skills and analytical techniques.\nWe maintain internal controls such as the following to ensure the reliability of reserves estimations:\n•\nWe follow comprehensive SEC-compliant internal policies to estimate and report proved reserves. Reserve estimates are made by experienced reservoir engineers or under their direct supervision. All material changes are reviewed and approved by the Manager – Corporate Reserves. \n•\nThe Corporate Reserves Department reviews our proved reserves at the close of each quarter.\n•\nEach quarter, Reservoir Managers, the Manager – Corporate Reserves, the Vice Presidents of each operating area and the Vice President of Corporate and Strategic Planning review all significant reserves changes and all new proved undeveloped reserves additions.    \n•\nThe Corporate Reserves Department reports independently of our operations.\n•\nThe five-year PUD development plan is reviewed and approved annually by the Manager – Corporate Reserves and the Vice President of Corporate and Strategic Planning.\n16\nTABLE OF CONTENTS\nAcreage\nThe following table sets forth our gross and net developed and undeveloped natural gas and oil leasehold and fee mineral acreage as of December 31, 2024. Gross acres are the total number of acres in which we own a working interest. Net acres refer to gross acres multiplied by our fractional working interest.\nDeveloped Leasehold\nUndeveloped Leasehold\nTotal\nGross Acres\nNet Acres\nGross Acres\nNet Acres\nGross Acres\nNet Acres\n(in thousands)\nHaynesville\n698 \n586 \n91 \n78 \n789 \n664 \nNortheast Appalachia\n754 \n501 \n242 \n199 \n996 \n700 \nSouthwest Appalachia\n267 \n204 \n493 \n362 \n760 \n566 \nOther\n(a)\n310 \n290 \n1,346 \n1,265 \n1,656 \n1,555 \nTotal\n2,029 \n1,581 \n2,172 \n1,904 \n4,201 \n3,485 \n___________________________________________\n(a)  Includes 1.2 million net acres retained in the 2016 divestiture of our Devonian Shale assets, in which we retained all rights below the base of the Kope formation.\nMost of our leases have a three- to five-year primary term, and we manage lease expirations to ensure that we do not experience unintended material expirations. Our leasehold management efforts include scheduling our drilling to establish production in paying quantities in order to hold leases by production, timely exercising our contractual rights to pay delay rentals to extend the terms of leases we value, planning non-core divestitures to high-grade our lease inventory and letting some leases expire that are no longer part of our development plans. We do not anticipate any material lease expirations within the next three years. \nMarketing\nThe principal function of our marketing operations is to provide natural gas, oil and NGL marketing services, including commodity price structuring, securing and negotiating of gathering, hauling, processing and transportation services, contract administration and nomination services for us and other interest owners in Expand Energy-operated wells. The marketing operations also provide other services for our exploration and production activities, including services to enhance the value of natural gas and oil production by aggregating volumes sold to various intermediary markets, end markets and pipelines. This aggregation allows us to attract larger, more creditworthy customers that in turn assist in maximizing the prices received.\nGenerally, our natural gas and NGL production are sold to purchasers under index contracts or daily spot price contracts. Under our index contracts, the price we receive is tied to published indices. Under our daily spot price contracts, we receive the daily spot price at the location where the gas or NGL are sold. Oil production is sold under short-to-long-term market-sensitive and spot price contracts using a differential to NYMEX WTI. \nWe have entered into long-term gathering, processing, and transportation contracts with various parties that require us to deliver fixed, determinable quantities of production over specified periods of time. Certain of our contracts require us to make payments for any shortfalls in delivering or transporting minimum volumes under these commitments. See \nNote \n5\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion of commitments. \nAs of December 31, 2024, we had delivery commitments for gas and NGLs of approximately 6,900 Bcf and 45 MMBbls over the next 16 and 18 years, respectively. These delivery commitments vary each year. Additionally, we have delivery commitments of approximately 1 MMBbls of oil during 2025. We expect to fulfill these commitments primarily with production from our proved developed reserves.\n17\nTABLE OF CONTENTS\n \nOilfield Services Vertical Integration\nThe Company also operates drilling rigs and provides certain oilfield products and services, principally serving the Company’s E&P operations through vertical integration.\nMajor Customers\nFor the year ended December 31, 2024, we had no purchaser that accounted for 10% or greater of our total revenues (before the effects of hedging). For the year ended December 31, 2023, we had sales to two purchasers that accounted for approximately 17% and 10% of total revenues (before the effects of hedging). For the year ended December 31, 2022, we had sales to two purchasers that accounted for approximately 13% and 10% of total revenues (before the effects of hedging). No other purchasers accounted for more than 10% of our total revenues during the years ended December 31, 2023 or 2022.\nCompetition\n \nWe compete with both major integrated and other independent natural gas and oil companies in all aspects of our business to explore, develop and operate our properties and market our production. Some of our competitors may have larger financial and other resources than us. Competitive conditions may be affected by future legislation and regulations as the United States develops new energy and climate-related policies. In addition, some of our competitors may have a competitive advantage when responding to factors that affect demand for natural gas and oil production, such as changing prices, domestic and foreign political conditions, weather conditions, the price and availability of alternative fuels, the proximity and capacity of natural gas pipelines and other transportation facilities and overall economic conditions. We also face indirect competition from alternative energy sources, including wind, solar and electric power. We believe that our technological expertise, combined with our exploration, land, drilling and production capabilities and the experience of our management team, enables us to compete effectively.\nPublic Policy and Government Regulation\n \nAll of our operations are conducted onshore in the United States. Our industry is subject to a wide range of regulations, laws, rules, taxes, fees and other policy implementation actions that are under constant review for amendment or expansion. Numerous government agencies have issued extensive regulations that are binding on our industry, some of which carry substantial penalties for failure to comply. These laws and regulations increase the cost of doing business. We anticipate that compliance with existing laws and regulations governing our current operations will not have a material adverse effect on our capital expenditures, earnings or competitive position. However, additional proposals that affect the oil and gas industry are regularly considered by Congress, the states, regulatory agencies and the courts, and we cannot predict when or whether any such proposals may become effective or the effect that such proposals may have on us. We actively monitor regulatory developments applicable to our industry in order to anticipate, design and implement required compliance activities and systems. The following is a summary of the existing laws, rules and regulations to which our operations are subject.\nExploration and Production, Environmental, Health and Safety and Occupational Laws and Regulations\nOur operations are subject to federal, tribal, state, and local laws and regulations. These laws and regulations relate to matters that include, but are not limited to, the following:\n•\nreporting of workplace injuries and illnesses;\n•\nindustrial hygiene monitoring;\n•\nworker protection and workplace safety;\n•\napproval or permits to drill and to conduct operations;\n•\nprovision of financial assurances (such as bonds) covering drilling and well operations;\n18\nTABLE OF CONTENTS\n•\ncalculation and disbursement of royalty payments and production taxes;\n•\nseismic operations/data;\n•\nlocation, drilling, cementing and casing of wells;\n•\nwell design and construction of pad and equipment;\n•\nconstruction and operations activities in sensitive areas, such as wetlands, coastal regions or areas that contain endangered or threatened species, their habitats, or sites of cultural significance;\n•\nmethod of well completion and hydraulic fracturing;\n•\nwater withdrawal;\n•\nwell production and operations, including processing and gathering systems;\n•\nemergency response, contingency plans and spill prevention plans;\n•\nemissions and discharges permitting;\n•\nclimate change;\n•\nuse, transportation, storage and disposal of fluids and materials incidental to natural gas and oil operations;\n•\nsurface usage, maintenance, monitoring and the restoration of properties associated with well pads, pipelines, impoundments and access roads;\n•\nplugging and abandoning of wells; and\n•\ntransportation of production.\nIn November 2021, the Environmental Protection Agency (the “EPA”) proposed new regulations to establish comprehensive standards of performance and emission guidelines for methane and volatile organic compound emissions from new, modified, reconstructed and existing facilities in the oil and gas sector. The EPA issued a supplemental proposed rule in November 2022 to update, strengthen and expand its November 2021 proposed rule. The proposed rules sought to make the existing regulations in Subpart OOOOa more stringent and create a Subpart OOOOb to expand reduction requirements for new, modified, and reconstructed oil and gas sources, including standards focusing on certain source types that have never been regulated under the Clean Air Act (“CAA”) (including intermittent vent pneumatic controllers, associated gas, and liquids unloading facilities). The November 2022 supplemental proposed rule removed an emissions monitoring exemption for small wellhead-only sites and created a new third-party monitoring program to flag large emissions events, referred to in the proposed rule as “super emitters”. In addition, the proposed rules sought to establish “Emissions Guidelines,” creating a Subpart OOOOc that would require states to develop plans to reduce methane emissions from existing sources that must be at least as effective as presumptive standards set by the EPA. In December 2023, the EPA issued the final rule, which imposes more stringent requirements on the natural gas and oil industry, requiring all well sites and compressor stations to be routinely monitored for leaks and eliminating or minimizing emissions from common pieces of equipment used in oil and gas operations, such as process controllers, pumps, and storage tanks. Notably, the EPA updated the applicability date for Subparts OOOOb and OOOOc to December 6, 2022, meaning that sources constructed prior to that date will be considered existing sources with later compliance dates under state plans. The final rule gives states, along with federal tribes that wish to regulate existing sources, until March 2026 to develop and submit their plans for reducing methane from existing sources. The final emissions guidelines under Subpart OOOOc provide until 2029 for existing sources to comply. Fines and penalties for violation of these rules can be substantial. However, the final rule is subject to ongoing litigation but remains in effect. Additionally, in January 2025, the Department of Transportation’s Pipeline and Hazardous Materials Safety Administration (the “PHMSA”) finalized a rule that requires pipelines, underground natural gas storage facilities, and liquefied natural gas facilities to update leak detection and repair programs to require companies to use commercially available technologies to find and fix methane leaks from pipelines and other facilities. These rules and policy priorities could have a material adverse effect on our financial position, results of operations and cash flows. However, in January 2025, the current Presidential Administration issued an executive order directing the heads of all federal agencies to identify and begin the process to suspend, revise, or rescind all agency actions that are unduly burdensome on the identification, development, or use of domestic energy resources. Consequently, the future implementation and enforcement of these rules remain uncertain at this time.\n19\nTABLE OF CONTENTS\nThe Inflation Reduction Act (“IRA”), signed into law in August 2022, provides significant funding and incentives for research, development and implementation of low-carbon energy production methods, carbon capture, and other programs directed at addressing climate change. The IRA also includes a Methane Emissions Reduction Program that amends the CAA to require the EPA to impose a “Waste Emissions Charge” on methane emissions from certain natural gas and oil sources that are already required to report under EPA’s Greenhouse Gas Reporting Program. In May 2024, the EPA finalized revisions to the Greenhouse Gas Reporting Program for petroleum and natural gas facilities. Among other things, the final rule expands the emissions events that are subject to reporting requirements to include \"other large release events\" and applies reporting requirements to certain new sources and sectors. The emissions reported under the Greenhouse Gas Reporting Program will be the basis for any payments under the Methane Emissions Reduction Program in the IRA. However, petitions for reconsideration to the EPA are pending and litigation in the D.C. Circuit Court of Appeals has commenced. In addition, in November 2024, the EPA finalized a rule to implement the IRA’s Waste Emissions Charge that became effective in January 2025. The Waste Emissions Charge imposed under the Methane Emissions Reduction Program for 2024 reported amounts is $900 per metric ton emitted over permitted methane emissions thresholds, and increases to $1,200 for 2025 reported amounts, and $1,500 for 2026 reported amounts. In January 2025, industry associations challenged the Waste Emissions Charge rule in the D.C. Circuit Court of Appeals. Additionally, based on the timing of the rule’s finalization, the Waste Emissions Charge rule is potentially vulnerable to repeal by Congress under the Congressional Review Act. To the extent the rule is implemented, the emissions fee and funding provisions of the law could increase operating costs within the oil and gas industry and accelerate the transition away from fossil fuels, which could in turn adversely affect our business and results of operations. However, in January 2025, the current Presidential Administration issued an executive order directing the heads of all federal agencies to identify and begin the processes to suspend, revise, or rescind all agency actions that are unduly burdensome on the identification, development, or use of domestic energy resources. The Inflation Reduction Act may also be subject to amendment or repeal through Congressional budget reconciliation. Consequently, future implementation and enforcement of these rules remains uncertain at this time.\nIn January 2024, the previous Presidential Administration announced a temporary pause on pending decisions on exports of LNG to non-free trade agreement countries until the Department of Energy (“DOE”) can update the underlying analyses for authorizations, including an assessment of the impact of greenhouse gas (“GHG”) emissions. In December 2024, the DOE released its report on LNG exports, which report is subject to a 60-day public comment period ending in February 2025. However, in January 2025, the current Presidential Administration issued an executive order directing the DOE to restart reviews of applications for approvals of LNG export projects as expeditiously as possible. \nIn addition, several states and geographic regions in the United States have adopted legislation and regulations regarding climate change-related matters, and additional legislation or regulation by these states and regions, U.S. federal agencies, including the EPA, and/or international agreements to which the United States may become a party could result in increased compliance costs for us and our customers. Failure to comply with these laws and regulations can lead to the imposition of remedial liabilities, administrative, civil or criminal fines or penalties or injunctions limiting our operations in affected areas. In 2021, the previous Presidential Administration recommitted the United States to the Paris Agreement and announced a goal of reducing the United States’ GHG emissions by 50-52% below 2005 levels by 2030. In November 2021, at the 26th Conference of the Parties on the UN Framework Convention on Climate Change (“COP26”), the United States and the European Union jointly announced the Global Methane Pledge, an initiative committing to a collective goal of reducing global methane emissions by at least 30% from 2020 levels by 2030, including “all feasible reductions” in the energy sector. COP26 concluded with the finalization of the Glasgow Climate Pact, which stated long-term global goals (including those in the Paris Agreement) to limit the increase in the global average temperature and emphasized reductions in GHG emissions. At the 27th Conference of the Parties (“COP27”), the previous Presidential Administration announced the EPA’s then-proposed standards to reduce methane emissions from new, modified and existing oil and gas sources, and the United States agreed, in conjunction with the European Union and several other partner countries, to develop standards for monitoring and reporting methane emissions to help create a market for low methane-intensity natural gas. At the 28th Conference of the Parties (“COP28”), member countries entered into an agreement that calls for actions toward achieving, at a global scale, a tripling of renewable energy capacity and doubling energy efficiency improvements by 2030. In April 2024, the European Union adopted a regulation to track and reduce methane emissions in the energy sector, including requiring new monitoring, reporting and verification measures to be applied by importers of oil, natural gas and coal into the European Union by January 1, 2027, and \n20\nTABLE OF CONTENTS\nthe “maximum methane intensity values” must be met by 2030 and every year thereafter. Each member state will have the power to impose administrative penalties for failure to comply and the standard will be mandatory for supply contracts signed after the law takes effect. On January 20, 2025, the current Presidential Administration issued an executive order directing the immediate notice to the United Nations of the United States’ withdrawal from the Paris Agreement and all other agreements made under the United Nations Framework Convention on Climate Change. However, various state and local governments in the U.S. have publicly committed to furthering the goals of the Paris Agreement and many of these efforts at the local, state and international levels are expected to continue.\nMoreover, multiple environmental laws provide for citizen suits, which allow environmental organizations to act in the place of the government and sue operators for alleged violations of environmental law. We consider the responsibility and costs of environmental protection and safety and health compliance fundamental parts of our business. To date, we have been able to plan for and comply with environmental, safety and health laws and regulations without materially altering our operating strategy or incurring significant unreimbursed expenditures. However, based on regulatory trends and increasingly stringent laws, as well as the increasing number of climate-related commitments by capital providers, our capital expenditures and operating expenses related to compliance with environmental and safety and health regulations have increased over time and may continue to increase. In addition, in March 2024, the SEC released its final rule requiring public companies to disclose information regarding material climate-related risks. However, the SEC voluntarily stayed the final rule in April 2024 pending judicial review of multiple petitions challenging the rules and it is unclear when the rule will become effective, if ever. Although future implementation of the final rule and impact on our business is uncertain, compliance with the rule, as finalized, may result in additional legal, accounting and financial compliance costs, make some activities more difficult, time-consuming and costly, and place strain on our personnel, systems and resources. For more information, see Item \n1A. Risk Factors - “We are subject to extensive governmental regulation, which can change and could adversely impact our business.”\nOur operations also are subject to conservation regulations, including the regulation of the size of drilling and spacing units or proration units, the number of wells that may be drilled in a unit, the rate of production allowable from gas and oil wells, and the unitization or pooling of gas and oil properties. In the United States, some states allow the statutory pooling or integration of tracts to facilitate exploration, while other states rely on voluntary pooling of lands and leases, which may make it more difficult to develop gas and oil properties. In addition, federal and state conservation laws generally limit the venting or flaring of natural gas, and state conservation laws impose certain requirements regarding the ratable purchase of production. These regulations limit the amounts of gas and oil we can produce from our wells and the number of wells or the locations at which we can drill. For further discussion, see Item \n1A. Risk Factors - “We are subject to extensive governmental regulation, which can change and could adversely impact our business.”\nRegulatory proposals in some states and local communities have been initiated to require or make more stringent the permitting and compliance requirements for hydraulic fracturing operations. Federal and state agencies have continued to assess the potential impacts of hydraulic fracturing, which could result in additional federal, state and/or local legislation and regulation. Further restrictions of hydraulic fracturing could make it difficult or impossible to conduct our drilling and completion operations, and thereby reduce the amount of natural gas, oil and NGLs that we are ultimately able to produce from our properties.\nCertain of our U.S. natural gas and oil leases are granted or approved by the federal government and administered by the U.S. Department of the Interior (“DOI”). Such leases require compliance with detailed federal regulations and orders that regulate, among other matters, drilling and operations on lands covered by these leases and calculation and disbursement of royalty payments to the federal government, tribes or tribal members. The federal government has increased its review in recent years in evaluating and, in some cases, promulgating new rules and regulations regarding competitive lease bidding, venting and flaring, gas and oil measurement and royalty payment obligations for production from federal lands. In January 2021, the previous Presidential Administration temporarily paused new oil and gas leases on federal lands and waters pending completion of a comprehensive review of the federal government’s existing oil and gas leasing and permitting program. In June 2021, a federal district court enjoined the DOI from implementing the pause and leasing resumed subject to certain limitations. In August 2022, a federal appeals court vacated and remanded the federal district court’s decision to block the pause on new oil and gas leasing, and the federal district court shortly thereafter enjoined the DOI from implementing the pause in the thirteen plaintiff states, including Louisiana and West Virginia. Litigation over leasing remains ongoing. \n21\nTABLE OF CONTENTS\nHowever, in January 2025, current Presidential Administration issued executive orders (i) reversing the previous Presidential Administration’s leasing pause and executive orders withdrawing certain lands and waters from federal oil and gas leasing and (ii) directing the heads of all federal agencies to facilitate the leasing, siting, and generation of domestic energy resources, including on federal lands and waters.\nIn April 2024, the BLM finalized regulations to reduce the waste of natural gas from gas and oil operations on federal and Tribal land. The rule became effective in June 2024. However, in May 2024, North Dakota, Texas, Montana, Wyoming and Utah challenged the rule in federal district court. In September 2024, the court granted a preliminary injunction enjoining BLM from enforcing the rule against the plaintiff states pending the outcome of the litigation, and the litigation remains ongoing. In January 2025, the current Presidential Administration issued an executive order directing the heads of all federal agencies to identify and begin the processes to suspend, revise, or rescind all agency actions that are unduly burdensome on the identification, development, or use of domestic energy resources. Accordingly, future implementation and enforcement of this rule is uncertain at this time. Any future restrictions surrounding onshore drilling and restrictions on the ability to obtain required permits could have a material adverse impact on our operations.\nObtaining environmental permits has the potential to delay the development and operation of natural gas and oil projects. Delays in obtaining permits or an inability to obtain new permits or permit modifications or renewals could inhibit our ability to execute our drilling and production plans. Failure to comply with applicable regulations or permit requirements could result in revocation of our permits, inability to obtain new permits and the imposition of fines and penalties.\nFor further discussion, see Item \n1A. Risk Factors - “Natural gas and oil operations are uncertain and involve substantial costs and risks.”\nTitle to Properties\n \nOur title to properties is subject to royalty, overriding royalty, carried, net profits, working and other similar interests and contractual arrangements customary in the natural gas and oil industry, to liens for current taxes not yet due and to other encumbrances. As is customary in the industry in the case of undeveloped properties, only cursory investigation of record title is made at the time of acquisition. Drilling title opinions are usually prepared before commencement of drilling operations. We believe we have satisfactory title to substantially all of our active properties in accordance with standards generally accepted in the natural gas and oil industry. Nevertheless, we are involved in title disputes from time to time that may result in litigation.\n22\nTABLE OF CONTENTS\nOperating Hazards and Insurance\n \nThe natural gas and oil business involves a variety of operating risks, including the risk of fire, explosions, blow-outs, pipe failure, abnormally pressured formations and environmental hazards such as oil spills, natural gas leaks, ruptures or discharges of materials or pollutants. Any of these events could adversely affect our ability to conduct operations or result in substantial loss to us as a result of defending against claims by government agencies or third parties, injury or loss of life, damage to or destruction of property, natural resources and equipment, pollution or other environmental damage, clean-up responsibilities, regulatory investigation and penalties, and suspension of operations. Our horizontal and deep drilling activities involve greater risk of mechanical problems than vertical and shallow drilling operations.\nWe maintain a control of well insurance policy with a $50 million single well limit and a $100 million multiple wells limit that insures against certain sudden and accidental risks associated with drilling, completing and operating our wells. This insurance may not be adequate to cover all losses or exposure to liability. We also carry a $305 million comprehensive general liability umbrella insurance policy. In addition, we maintain a $50 million pollution liability insurance policy providing coverage for gradual pollution related risks and in excess of the general liability policy for sudden and accidental pollution risks. We provide workers' compensation insurance coverage to employees in all states in which we operate. While we believe these policies are customary in the industry, they do not provide complete coverage against all operating risks, and policy limits scale to our working interest percentage in certain situations. In addition, our insurance does not cover penalties or fines that may be assessed by a governmental authority. A loss not fully covered by insurance could have a material adverse effect on our financial position, results of operations and cash flows. Our insurance coverage may not be sufficient to cover every claim made against us or may not be commercially available for purchase in the future. \nFacilities\n \nWe own an office complex in Oklahoma City, Oklahoma and lease an office building in Spring, Texas. Additionally, we own or lease various field offices in cities or towns in the areas where we conduct our operations.\n23\nTABLE OF CONTENTS\nExecutive Officers\n \nDomenic J. Dell'Osso, Jr., \nPresident, Chief Executive Officer and Director\nDomenic J. (“Nick”) Dell'Osso, Jr., \n48, has served as President and Chief Executive Officer since October 2021. Prior to being named as CEO, Mr. Dell’Osso served as our Executive Vice President and Chief Financial Officer since November 2010. Mr. Dell'Osso served as our Vice President – Finance and Chief Financial Officer of our wholly owned midstream subsidiary, Chesapeake Midstream Development, L.P., from August 2008 to November 2010. Before joining Expand Energy, Mr. Dell’Osso was an energy investment banker with Jefferies & Co. from 2006 to 2008 and Banc of America Securities from 2004 to 2006. Mr. Dell’Osso graduated from Boston College and earned his M.B.A. from the University of Texas at Austin.\nMohit Singh, \nExecutive Vice President and Chief Financial Officer\nMohit Singh,\n 48, has served as Executive Vice President and Chief Financial Officer since December 2021. Prior to joining Expand Energy, Mr. Singh served for six years on the executive leadership team at BPX Energy, the United States onshore subsidiary of BP plc (NYSE: BP). He most recently led the M&A, corporate land and reserves functions, having previously served as Head of Business Development and Exploration and as Senior Vice President – North Business Unit. Prior to joining BPX, Mr. Singh worked as an investment banker focused on oil and gas transactions for RBC Capital Markets and Goldman Sachs. A chemical engineer by training, he began his career at Shell Exploration & Production Company where he held business planning, reservoir engineering and research engineering roles of increasing importance. Mr. Singh earned a PhD in Chemical Engineering from the University of Houston, an MBA from the University of Texas at Austin and a BTech in Chemical Engineering from the Indian Institute of Technology.\nJoshua J. Viets, \nExecutive Vice President and Chief Operating Officer\nJoshua J. (“Josh”) Viets,\n 46, has served as Executive Vice President and Chief Operating Officer since February 2022. Prior to joining Expand Energy, Mr. Viets worked for 20 years in operational positions of increasing importance at ConocoPhillips (NYSE: COP). He most recently served as Vice President, Delaware Basin and previously held leadership positions in operations, engineering, subsurface, and capital project across the ConocoPhillips portfolio. Mr. Viets earned a Bachelor of Science in Petroleum Engineering from Colorado School of Mines.\nChristopher W. Lacy, \nExecutive Vice President - General Counsel and Corporate Secretary\nChristopher W. (“Chris”) Lacy,\n 47, has served as Executive Vice President – General Counsel and Corporate Secretary since October 2024. Prior to that time, he served as Senior Vice President, General Counsel and Secretary at Southwestern Energy Company. Mr. Lacy joined Southwestern in 2014 as Chief Litigation Counsel and held various roles of progressively increasing responsibility. Before joining Southwestern, Chris was with Dewey & LeBouef, LLP and Ahmad, Zavitsanos, Anaipakos, Alavi & Mensing P.C. with a practice focused on high value and high stakes litigation. He has nearly 20 years of experience representing clients in the energy industry. Mr. Lacy earned his B.A. in Communication from the University of Texas and his juris doctorate from the University of Houston Law Center.\nDaniel F. Turco, \nExecutive Vice President - Marketing and Commercial\nDaniel F. (“Dan”) Turco,\n 45, has served as Executive Vice President – Marketing and Commercial since February 2025. Prior to joining Expand Energy, Mr. Turco served as Head of Global LNG Trading / Head of Asia Gas & Power Marketing in Singapore for ExxonMobil. Mr. Turco joined ExxonMobil in 2006 and has since held positions of increasing responsibility in upstream natural gas marketing and trading, spanning LNG, U.S., Europe and Asia gas markets. Mr. Turco began his career in oil and gas as an engineer. Mr. Turco earned an M.B.A. from Wilfrid Laurier University (Canada) and an Honors Bachelor of Applied Science, Civil Engineering & Management Science from the University of Waterloo (Canada).\n24\nTABLE OF CONTENTS\nHuman Capital Resources\n \nEmployees\nWe had approximately 1,700 employees as of December 31, 2024, inclusive of approximately 200 employees temporarily assisting in our efforts to integrate Southwestern. None of our employees were covered by collective bargaining agreements, and our management works to maintain good relations with our employees.\nValues-Driven Culture\nAt Expand Energy, our core values are the foundation of our company. Serving as the lens through which we evaluate business decisions, our commitment to these values, in both words and actions builds a stronger, healthier Expand Energy, benefiting all our stakeholders. Our core values are:\n•\nStewardship - Safety and environmental stewardship requires excellence in the ordinary\n•\nCharacter - Integrity in every action\n•\nCollaborate - Commit to continuous improvement through humility, curiosity and constant learning\n•\nLearn - Embrace diverse perspectives, confront the brutal facts, and speak with radical candor\n•\nDisrupt - Challenge the status quo to achieve better outcomes for energy consumers \nDiversity, Equity and Inclusion (DEI)\nWe are committed to supporting inclusion and diversity within our organization. We believe building a diverse workforce and an equitable, inclusive work culture are key drivers of our long-term success. We embrace the variety of backgrounds, perspectives and talents within our organization, leveraging strengths to pursue results and meaningful change for our company, employees, and stakeholders. To support this commitment, we offer education and training for our employees on topics related to inclusion and diversity to help ensure our team is equipped to contribute to an environment of respect, inclusion and collaboration. \nOwn Safety, Lead Safety\nSafety is more than a company metric. It is core to our commitment to leading a responsible energy future. We set and deliver robust safety standards, prioritizing the well-being of our employees and contractors. Our safety culture is championed by our Board of Directors and executive leadership team, owned by every employee and contractor and managed by our Health, Safety, Environmental and Regulatory (HSER) team. Maintaining a safe work environment and promoting safe behaviors is a commitment that each of our employees and contractors own together. We hold each other accountable to keeping our sites, our co-workers and our contractors safe. \nOne program that reinforces this philosophy of personal responsibility is Stop Work Authority. Through Stop Work Authority, every employee and contractor has the right, responsibility and authority to stop work if conditions are unsafe or could cause harm to the environment. Creating an incident-free work environment starts with setting clear expectations among employees and contractors regarding our Safe and Compliant Operations Policy, safety standards, and working to empower and equip individuals with the skills necessary to promote safety in their areas of work. The foundation of our safety culture is our \nOwn Safety, Lead Safety\n motto, which encourages all workers on our locations to take personal responsibility for their safety and the safety of those around them. We have transitioned companywide to our Serious Incident and Fatality prevention model for more proactive hazard identification of exposures that could lead to a life-altering injury with verification processes that check for controls in place for these exposures.\nEvery year our HSER team provides targeted trainings based on safety performance analysis, job functions and location specific factors. Our training program includes a mix of in-person and virtual training, with greater emphasis on in-person instruction and includes all employees. Job-specific learning paths aim to exceed regulatory requirements and ensure employees are holistically prepared to execute their job functions safely and responsibly. \nExpand Energy’s training philosophy values contractor training in the same manner as employees. We design contractor training to align as much as possible with employee training, encouraging synchronized knowledge sharing and understanding, critical to decreasing our cumulative incidents.\n25\nTABLE OF CONTENTS\nEthical Business Conduct\nExpand Energy works hard to maintain the confidence of our stakeholders. We earn this trust by striving to act in an ethical manner to protect our people, the environment and the communities where we operate. This starts by driving accountability through all levels of the company and having systems in place to uphold our high standards for conduct. Strong governance practices begin at the top, providing our organization with clear guidelines to define standards for ethical behavior at every level. Each Expand Energy director or employee, regardless of position, must abide by Expand Energy’s Code of Business Conduct (the \"Code\"), which is structured around our core values. Each year all employees must sign a Code certification acknowledging that they have reviewed the Code and related policies, the high standards expected of them and that they will report actual or potential ethics concerns or Code violations. \nEmployee Wellness and Benefits\nSupporting the individual well-being of our employees is foundational to our safety culture and success as a company. We champion healthy lifestyles and offer health resources. Across the company, employees are offered preventive programs and are encouraged to complete an annual screening for common health-related issues. We support our employees’ and their families’ health by offering full medical, dental, vision, prescription drug insurance for employees and their families, life insurance, short- and long-term disability coverage, and health savings and dependent care flexible spending accounts. We offer parental leave for the birth or adoption of a child, an adoption assistance program, alternate work schedules, a 401(k) savings plan with company match and discretionary contributions, flexible work hours, generous paid time off, including a well-being day, where each employee is encouraged to relax and recharge for a day once per calendar year and 12 company-paid holidays, tuition reimbursement and access to a child development center and fitness center at market rates. Additionally, Expand Energy provides employees and their families access to a confidential Employee Assistance Program, which connects employees with trained counselors and other support professionals. \n26\nTABLE OF CONTENTS",
  "item7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations is intended to provide a reader of our financial statements with management’s perspective on our financial condition, liquidity, results of operations and certain other factors that may affect our future results. This information is intended to provide investors with an understanding of our past performance, current financial condition and outlook for the future and should be read in conjunction with",
  "item2": null
}