{
  "source_file": "exr-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.     Business\nGeneral\nExtra Space Storage Inc. (“we,” “our,” “us” or the “Company”) is a fully integrated, self-administered and self-managed real estate investment trust (“REIT”) formed as a Maryland corporation on April 30, 2004. We closed our initial public offering (“IPO”) on August 17, 2004. Our common stock is traded on the New York Stock Exchange under the symbol “EXR.”\nWe were formed to continue the business of Extra Space Storage LLC and its subsidiaries, which had engaged in the self-storage business since 1977. These companies were reorganized after the consummation of our IPO and various formation transactions. Our executive management team and board of directors have extensive experience and ownership positions in the Company. \nSubstantially all of our business is conducted through Extra Space Storage LP (the “Operating Partnership”). Our primary assets are general partner and limited partner interests in the Operating Partnership. This structure is commonly referred to as an umbrella partnership REIT, or UPREIT. We have elected to be taxed as a REIT under the Internal Revenue Code of 1986, as amended (the “Internal Revenue Code”). To the extent we continue to qualify as a REIT, we will not be subject to U.S. federal tax, with certain exceptions, on our REIT taxable income that is distributed to our stockholders.\nOur principal offices are located at 2795 East Cottonwood Parkway, Suite 300, Salt Lake City, Utah 84121, telephone number (801) 365-4600.\nOur internet address is www.extraspace.com. We file our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all amendments to those reports with the Securities and Exchange Commission (the “SEC”). You may obtain copies of these documents by visiting the SEC’s website at www.sec.gov. In addition, as soon as reasonably practicable after such materials are furnished to the SEC, we make copies of these documents available to the public free of charge through the Investor Relations section of our website. \nSelf-Storage Operations\nWe own, operate, manage, provide lending to, acquire, develop and redevelop self-storage properties (“stores”). We operate and manage our business by evaluating the operating performance of the properties for our entire portfolio which includes wholly-owned stores, stores in which we have a partial ownership interest and managed stores. Stores offer month-to-month rental of storage space for personal or business use.\nAs of December 31, 2024, we owned and/or operated 4,011 stores in 42 states, and Washington, D.C., comprising approximately 308.4 million square feet of net rentable space in approximately 2.8 million units.\nOther Operations\nOur tenant reinsurance activities include the reinsurance of risks relating to the loss of goods stored by tenants in our stores. Our customers have the option of purchasing insurance from a non-affiliated insurance company to cover certain losses to their goods stored at our facilities, as well as those we manage for third parties. A wholly-owned, consolidated subsidiary fully reinsures such policies and thereby assumes all risk of losses under these policies and receives reinsurance premiums, substantially equal to the premiums collected from our tenants, from the non-affiliated insurance company.\nAs of December 31, 2024, we managed 1,575 stores for third party owners. Our management business enables us to generate increased revenues through management fees as well as expand our geographic footprint, data sophistication and scale with little capital investment. We believe this expanded footprint enables us to reduce our operating costs through economies of scale. In addition, our management business is a potential future acquisition pipeline.\nWe have a bridge lending program, under which we provide financing to third party self storage owners for operating properties that we manage. This program helps us increase our management business, create additional potential future acquisition opportunities, and strengthen our relationships with partners, all while generating interest and fee income. We generally originate mortgage loans and mezzanine loans with the option to sell a portion of the mortgage loans to third parties, while retaining our interests in the mezzanine loans. As of December 31, 2024, the total balance of bridge loans receivable was $1.2 billion.\n5\nWe have made investments in preferred stock of other self-storage companies. These investments benefit us by providing dividend income, creating additional potential future acquisition opportunities through relationships with the companies in which we invest, or increasing our management business.\nOperating Segments\nWe operate in two distinct segments: (1) self-storage operations; and (2) tenant reinsurance. Our self-storage operations activities include rental operations of wholly-owned stores. Tenant reinsurance activities include the reinsurance of risks relating to the loss of goods stored by tenants in our stores. For more information and comparative financial and other information on our reportable business segments, refer to the segment information footnote in the notes to the consolidated financial statements in Item 8 of this Form 10-K.\nLong-Term Growth and Investment Strategies\nOur primary business objectives are to maximize cash flow available for distribution to our stockholders and to achieve sustainable long-term growth in cash flow per share in order to maximize long-term stockholder value both at acceptable levels of risk. We continue to evaluate a range of growth initiatives and opportunities. Our primary strategies include the following:\nMaximize the performance of our stores through strategic, efficient and proactive management\nWe pursue revenue-generating and expense-minimizing opportunities in our operations. We seek to maximize revenue by responding to changing market conditions through our advanced technology systems' ability to provide real-time, interactive rental rate and discount management. We have implemented one of the most dynamic online marketing programs in the industry, which we believe will attract more customers to our stores at a lower net cost compared with our competitors.\nWe continually analyze our portfolio to look for long-term value-enhancing opportunities. We proactively redevelop properties to add units or modify existing unit mix to better meet the demand in a given market and to maximize revenue. We also redevelop properties to extend their useful life, increase visual appeal, enhance security and improve brand consistency across the portfolio.\nAcquire self-storage stores\nOur acquisitions team continues to pursue the acquisition of multi-store portfolios and single stores which can range from fully occupied to various stages of lease-up that we believe can provide stockholder value. We have established a reputation as a reliable, ethical buyer, which we believe enhances our ability to negotiate and close acquisitions. In addition, we believe our status as an UPREIT enables flexibility when structuring deals. We remain a disciplined buyer and only execute acquisitions that we believe will strengthen our portfolio and increase stockholder value.\nIn addition to the pursuit of operating stores, from time to time we develop stores from the ground up, frequently in a joint venture with a developer, and provide the construction capital. We also purchase stores at the completion of construction from third party developers, who build to our specifications. These stores purchased at completion of construction (a “Certificate of Occupancy store”) create additional long-term value for our stockholders. We are typically able to acquire these assets at a lower price than a stabilized store, and we expect greater long term returns on these stores on average. However, in the short term, these acquisitions cause dilution to our earnings during the two-to-four year period required to lease up the Certificate of Occupancy stores. We expect that this trend will continue as we continue to acquire Certificate of Occupancy stores.\nFinancing of Our Long-Term Growth Strategies\nAs a REIT, we are required to distribute at least 90% of our REIT taxable income to our stockholders. Consequently, we require access to additional sources of capital to fund our growth. We expect to maintain a flexible approach to financing growth. We plan to finance future acquisitions, store development and re-development, capital expenditures and our bridge loan program through a diverse capital optimization strategy which includes, but is not limited to, the following: cash generated from operations, borrowings under our revolving lines of credit (the “Credit Lines”), commercial paper, secured and unsecured financing, equity offerings, joint ventures and the sale of stores.\nCredit Lines - \nWe have two credit lines which we primarily use as short-term bridge financing until we obtain longer-term financing through either debt or equity. As of December 31, 2024, our Credit Lines had available capacity of $2.1 billion, of which $1.3 billion was undrawn.\n6\nCommercial Paper\n - We have a commercial paper program which we use as short-term financing until we obtain longer-term financing through either debt or equity. As of December 31, 2024, our commercial paper program had available capacity of $1.0 billion, of which $500 million was undrawn.\nSecured and Unsecured Debt -\n We primarily use public bonds, unsecured private placement bonds and unsecured bank term loans to finance store acquisitions and development efforts. We will continue to utilize a combination of secured and unsecured financing for future store acquisitions and development. As of December 31, 2024, we had $1.0 billion of secured notes payable and $10.2 billion of unsecured notes payable outstanding.\nEquity - \nWe have an active “at the market” (“ATM”) program for selling stock. We sell stock under the ATM program from time to time to raise capital when we believe conditions are advantageous. During the year ended December 31, 2024, we did not issue or sell any shares of common stock.\nWe view equity interests in our Operating Partnership as another source of capital that can provide an attractive tax planning opportunity to sellers of real estate. We issue common and preferred Operating Partnership units to sellers in certain acquisitions. Common Operating Partnership units receive distributions equal to the dividends on common stock, while Preferred Operating Partnership units receive distributions at various negotiated rates. We may issue additional units in the future when circumstances are favorable. During the year ended December 31, 2024, we issued 623,621 Operating Partnership units.\nJoint Ventures - \nAs of December 31, 2024, we owned 460 of our stores through unconsolidated joint ventures with third parties. Our joint venture partners typically provide most of the equity capital required for the acquisition of stores owned in these joint ventures. Most joint venture agreements include buy-sell rights, as well as rights of first offer in connection with the sale of stores by the joint venture. We manage the day-to-day operations of the stores owned in these joint ventures and have the right to participate in major decisions relating to sales of stores or financings by the applicable joint venture, but we do not control the joint ventures.\nSale of Properties - \nWe have not historically sold a high volume of stores, as we generally believe we are able to optimize the cash flow from stores through continued operations. However, we may sell more stores or interests in stores in the future in response to changing economic, financial or investment conditions. For the year ended December 31, 2024, we sold six stores for $102.5 million. For the year ended December 31, 2023, we did not sell any stores.\nIndustry & Competition\nWe are the largest self-storage operator in the United States. Our three primary competitors who are public self-storage REITs are CubeSmart, National Storage Affiliates and Public Storage.\nStores offer month-to-month rental of storage space for personal or business use. Tenants typically rent fully enclosed spaces that vary in size and typically range from 5 feet by 5 feet to 20 feet by 20 feet, with an interior height of 8 feet to 12 feet.  Tenants have responsibility for moving their items into and out of their units. Stores generally have on-site managers who supervise and run the day-to-day operations, providing tenants with assistance as needed.\nSelf-storage provides a convenient way for individuals and businesses to store their possessions due to life changes, or simply because of a need for storage space. The mix of residential tenants using a store is determined by a store’s local demographics and often includes people who are experiencing life changes such as downsizing their living space or others who are not yet settled into a permanent residence. Items that tenants place in self-storage may include furniture, household items and appliances. Commercial tenants tend to include small business owners who require easy and frequent access to their goods, records, inventory or storage for seasonal goods.\nOur research has shown that tenants choose a store based primarily on price and the convenience of the site to their home or business, making high-density, high-traffic population centers ideal locations for stores. A store’s visibility on the internet, perceived security, cleanliness, and the general professionalism of the store managers and staff are also contributing factors to a store’s ability to successfully secure rentals. Although most stores are leased to tenants on a month-to-month basis, tenants tend to continue their leases for extended periods of time.\nThe self-storage business is subject to seasonal fluctuations. A greater portion of revenues and profits are typically realized from May through September. Historically, our highest level of occupancy has been at the end of July, while our lowest level of occupancy has been in late February and early March. The self-storage industry is a mature industry with average occupancies that are typically at or above 90%. Our average occupancy for our same-store pool for 2024 was 93.9%.\n7\nThe self-storage industry is characterized by fragmented ownership, where the largest companies in the industry own a fraction of the operating stores. The remainder of the industry is characterized by numerous small, local operators. The scarcity of capital available to small operators for acquisitions and expansions, internet marketing, call centers, and the potential for savings through economies of scale are factors that are leading to consolidation in the industry. We believe that, as a result of this trend, significant growth opportunities exist for operators with proven management systems and sufficient capital resources to grow through acquisitions and/or third-party management platforms. \nWe believe that we are well positioned to compete for acquisitions. We have encountered competition when we have sought to acquire existing operating stores, especially for brokered portfolios. Competitive bidding practices have been commonplace between both public and private entities, and this will likely continue.  \nRegulation\nGenerally, stores are subject to various laws, ordinances and regulations, including regulations relating to lien sale rights and procedures and the Americans with Disabilities Act of 1990. Changes in any of these laws or regulations, as well as changes in laws, such as the Comprehensive Environmental Response and Compensation Liability Act, which increases the potential liability for environmental conditions or circumstances existing or created by tenants or others on stores, or laws affecting development, construction, operation, limitations on rent increases due to state of emergency or similar orders, upkeep, safety and taxation may result in significant unanticipated expenditures, loss of stores or other impairments to operations, which would adversely affect our financial position, results of operations or cash flows. In addition, noncompliance with any of these laws, ordinances or regulations could result in the imposition of fines or an award of damages to private litigants and also could require substantial capital expenditures to ensure compliance.\nInsurance activities are subject to state insurance laws and regulations as determined by the particular insurance commissioner for each state in accordance with the McCarran-Ferguson Act and are subject to the Gramm-Leach-Bliley Act and the privacy regulations promulgated by the Federal Trade Commission pursuant thereto. Store management activities may be subject to state real estate brokerage laws and regulations as determined by the particular real estate commission for each state. Our collection and processing of personal information may be subject to various data privacy and security laws, which govern the collection, use, and disclosure of personal information and are constantly evolving, may conflict with each other to complicate compliance efforts and can result in investigations, proceedings, or actions that lead to significant civil and/or criminal penalties and restrictions on data processing. Changes in any of the laws governing our conduct could have an adverse impact on our ability to conduct our business or could materially affect our financial position, results of operations or cash flows.\nHuman Capital\nAt Extra Space, our culture is driven by our belief that our people are a key driver in our success. We believe that if we focus on attracting, developing, and retaining diverse top talent at all levels of the organization, our employees will take care of our customers and drive growth for our shareholders.\nAs of December 31, 2024, we had 8,012 employees and believe our relationship with our employees is good. Our employees are not represented by a collective bargaining agreement. In 2024, we invited our employees to participate in an employee satisfaction survey and achieved an overall satisfaction score of 75% with 94% of our employees participating in our survey. \nCompensation, Health and Well Being\nWe offer competitive health benefits and encourage our employees to participate in employee health and wellness programs. We offer our employees a health concierge service that helps them navigate their healthcare, from finding providers, comparing costs and resolving complex claims issues. We also offer other health-oriented benefits such as a fitness program that allows for reimbursements to employees for expenses incurred relating to fit-friendly activities, sports or exercise equipment. We also provide employees access to a network of childcare and elder care providers.\nTraining and Development\nIn order to attract and retain diverse top talent, we believe strongly that development is a continuous journey throughout the employee's career. We provide formal development programs which are available to employees who are ready for an intense structured experience. In 2024, we invested in training and development for our employees, which included leadership training, communication training, individual development plans, site manager training and mentorship programs. Our field employees received an aver\nage of 17 ho\nurs of training and each new hire received an average of 82 hours of training in 2024. \n8\nInclusion and Values\n•\nWe are committed to fostering an inclusive culture and living our core values of integrity, teamwork, excellence, passion and innovation. In \n2024\n, we continued to expand participation in our employee resource groups, which provide employees with opportunities to build connections, celebrate culture, access mentoring, and engage in educational initiatives that strengthen our workplace community. \n•\nInclusion is central to our values and culture at Extra Space. We believe that excellence and innovation stem from diverse perspectives, integrity is upheld through equitable practices, and optimal teamwork thrives in an inclusive environment. We strive to ensure every employee feels engaged and empowered to bring their whole selves to work, fueling their passion and commitment to our shared goals.  \nWe believe that our emphasis on training and development, employee safety, employee health and well-being, and a commitment to our values leads to an increase in employee engagement and positions us to attract and retain top diverse talent.",
  "item7": "Item 7.     Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the financial statements and notes thereto appearing elsewhere in this report. We make statements in this section that are forward-looking statements within the meaning of the federal securities laws. For a complete discussion of forward-looking statements, see the section in this Form 10-K entitled “Statements Regarding Forward-Looking Information.” Certain risk factors may cause actual results, performance or achievements to differ materially from those expressed or implied by the following discussion. For a discussion of such risk factors, see the section in this Form 10-K entitled “Risk Factors.” Dollar amounts are in thousands, except share and per share data, unless otherwise stated.\nOVERVIEW\nWe are a fully integrated, self-administered and self-managed REIT, formed to own, operate, manage, acquire, develop and redevelop self-storage properties (“stores”). We derive substantially all of our revenues from our two segments: self-storage operations and tenant reinsurance. Primary sources of revenue for our self-storage operations segment include rents received from tenants under leases at each of our wholly-owned stores. Our operating results depend materially on our ability to lease available self-storage units, to actively manage unit rental rates, and on the ability of our tenants to make required rental payments. Consequently, management spends a significant portion of their time maximizing cash flows from our diverse portfolio of stores. Revenue from our tenant reinsurance segment consists of insurance revenues from the reinsurance of risks relating to the loss of goods stored by tenants in our stores.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \nOur stores are generally situated in highly visible locations clustered around large population centers. The clustering of our assets around these population centers enables us to reduce our operating costs through economies of scale. To maximize the performance of our stores, we employ industry-leading revenue management systems. Developed by our management team, these systems enable us to analyze, set and adjust rental rates daily across our portfolio in order to respond to changing market conditions. We believe our systems and processes allow us to more pro-actively manage revenues.\nWe operate in competitive markets, often where consumers have multiple stores from which to choose. Competition has impacted, and will continue to impact, our store results. We experience seasonal fluctuations in occupancy levels, with occupancy levels generally higher in the summer months due to increased moving activity. We believe that we are able to respond quickly and effectively to changes in local, regional and national economic conditions by adjusting rental rates through the combination of our revenue management team and our industry-leading technology systems. We consider a store to be in the lease-up stage after it has been issued a certificate of occupancy, but before it has achieved stabilization. We consider a store to be stabilized once it has achieved either an 80% occupancy rate for a full year measured as of January 1 of the current year, or has been open for three years prior to January 1 of the current year.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur financial statements have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amount of assets and liabilities at the date of the financial statements and the reported amount of revenues and expenses during the reporting period. On an ongoing basis, we evaluate our estimates and assumptions, including those that impact our most critical accounting policies. We base our estimates and assumptions on historical experience and on various other factors that we believe are reasonable under the circumstances. A summary of significant accounting policies is also provided in the notes to our consolidated financial statements (see Note 2 to our consolidated financial statements). Actual results may differ from these estimates. We believe the following are our most critical accounting policies and estimates:\nCONSOLIDATION:\n Arrangements that are not controlled through voting or similar rights are accounted for as variable interest entities (“VIEs”). An enterprise is required to consolidate a VIE if it is the primary beneficiary of the VIE.\nUnder certain circumstances when we enter into arrangements for the formation of joint ventures, a VIE may be created.  The primary factors that require the most judgment in determining whether the joint venture is a VIE are whether the decisions that most significantly impact the entity’s economic performance were controlled by the equity holders as a group and whether the joint venture has sufficient equity to finance its activities without additional subordinated support.\nIf the joint venture is determined to be a VIE, we perform a qualitative analysis, including considering which party, if any, has the power to direct the activities most significant to the economic performance of each VIE and whether that party has the obligation to absorb losses of the VIE or the right to receive benefits from the VIE that could be significant to the VIE. If we are determined to be the primary beneficiary of the VIE, the assets, liabilities and operations of the VIE are consolidated within \n21\nour financial statements. Otherwise, our investment is generally accounted for under the equity method. Our ability to correctly assess the influence or control over an entity affects the presentation of the investment in our consolidated financial statements.\nREAL ESTATE ASSETS: \nWe account for the acquisition of stores, including by merger and other acquisitions of real estate, in accordance with ASC 805-10, “\nBusiness Combinations.\n”\n \nWe use our judgment to determine if assets acquired meet the definition of a business or if the acquisition should be considered an asset acquisition. We must make significant assumptions and estimates in determining the fair value of the tangible and intangible assets and liabilities acquired and consideration transferred. These fair value estimates are sensitive to price of land per square foot and current replacement cost estimates, including adjustments for the age, class, height, square footage, condition, location, and turnkey factor. These assumptions and estimates require judgment, and therefore others could come to materially different conclusions as to the estimated fair values, which could result in differences in depreciation and amortization expense, gains and losses on the sale of real estate assets, and real estate and intangible asset values. \nEVALUATION OF ASSET IMPAIRMENT:\n Long lived assets held for use are evaluated for impairment when events or circumstances indicate that there may be impairment. We review each store at least annually to determine if any such events or circumstances have occurred or exist. We focus on stores where occupancy and/or rental income have decreased by a significant amount. For these stores, we determine whether the decrease is temporary or permanent and whether the store will likely recover the lost occupancy and/or revenue in the short term. In addition, we review stores in the lease-up stage and compare actual operating results to original projections. We may not have identified all material facts and circumstances that affect impairment of our stores. No material impairments were recorded in the year ended December 31, 2024.\nWe evaluate goodwill for impairment at least annually and whenever events, circumstances, and other related factors indicate that fair value of the related reporting unit may be less than the carrying value. If the fair value of the reporting unit is determined to exceed the aggregate carrying amount, no impairment charge is recorded. Otherwise, an impairment charge is recorded for the amount in which the carrying value of the reporting unit exceeds the fair value. No impairments were recorded in our evaluations for any period presented herein.\nDERIVATIVE INSTRUMENTS AND HEDGING ACTIVITIES:\n We hold a number of derivative instruments which we use to hedge our exposure to variability in expected future cash flows, mainly related to our interest rates on variable interest debt. We do not use derivatives for trading or speculative purposes. We assess our derivatives both at inception and on an ongoing quarterly basis for whether the derivatives used in hedging transactions are effective. The rules and interpretations relating to the accounting for derivatives are complex. Failure to apply this guidance correctly may require us to recognize all changes in fair value of the hedged derivative in earnings, which may materially impact our results. \nINCOME TAXES:\n We have elected to be treated as a REIT under Sections 856 through 860 of the Internal Revenue Code. In order to maintain our qualification as a REIT, among other requirements, we are required to distribute at least 90% of our REIT taxable income to our stockholders and meet certain tests regarding the nature of our income and assets. As a REIT, we are not subject to U.S. federal income tax with respect to that portion of our income which meets certain criteria and is distributed annually to our stockholders. We plan to continue to operate so that we meet the requirements for taxation as a REIT. Many of these requirements, however, are highly technical and complex. For any taxable year that we fail to qualify as a REIT and for which applicable statutory relief provisions did not apply, we would be subject to U.S. federal corporate income tax on all of our taxable income for at least that year and the ensuing four years. We could also be subject to penalties and interest, and our net income may be materially different from the amounts reported in our financial statements.\nWe have elected to treat certain corporate subsidiaries, including Extra Space Management, Inc., as a TRS. In general, a TRS may perform additional services for tenants and generally may engage in any real estate or non-real estate related business. A TRS is subject to U.S. federal corporate income tax and may also be subject to state and local income taxes. Interest and penalties relating to uncertain tax positions will be recognized in income tax expense when incurred. If tax authorities determine that amounts paid by any of our TRSs to us are not reasonable compared to similar arrangements among unrelated parties, we could be subject to a penalty tax on the excess payments. \nRECENT ACCOUNTING PRONOUNCEMENTS\nFor a discussion of recent accounting pronouncements affecting our business, see Item 8, “Financial Statements and Supplementary Data–Recently Issued Accounting Standards.”\n22\nRESULTS OF OPERATIONS\nComparison of the Year Ended December 31, 2024 to the Year Ended December 31, 2023 \nOverview\nResults for the year ended December 31, 2024 included the operations of 2,436 stores (1,967 wholly-owned, nine in consolidated joint ventures, and 460 in joint ventures accounted for using the equity method) compared to the results for the year ended December 31, 2023, which included the operations of 2,377 stores (1,903 wholly-owned, two in consolidated joint ventures, and 472 in joint ventures accounted for using the equity method). Material or unusual changes in the results of our operations are discussed below:\nRevenues\nThe following table presents information on revenues earned for the years indicated:\n \nFor the Year Ended December 31,\n \n2024\n2023\n$ Change\n% Change\nProperty rental\n$\n2,803,252 \n$\n2,222,578 \n$\n580,674 \n26.1 \n%\nTenant reinsurance\n332,795 \n235,680 \n97,115 \n41.2 \n%\nManagement fees and other income\n120,855 \n101,986 \n18,869 \n18.5 \n%\nTotal revenues\n$\n3,256,902 \n$\n2,560,244 \n$\n696,658 \n27.2 \n%\nProperty Rental—\nThe increase in property rental revenue for the year ended December 31, 2024 was primarily the result of an increase of $570,407 associated with our merger with Life Storage on July 20, 2023, (the “Life Storage Merger” or “Merger”) and other acquisitions completed in 2023 and 2024. We acquired 757 wholly-owned stores in the Merger and an additional 14 stores during the year ended December 31, 2023. We acquired 58 stores during the year ended December 31, 2024. The increase is also attributed to the Life Storage stores being on our platform for a full 12 months in 2024 in comparison with five months in 2023. In addition to the increase attributable to the Merger, property rental revenue increased by $5,440 due to operating results at our same-store pool and increased by $4,892 as a result of increases in occupancy at our lease-up stores.\nTenant Reinsurance\n—The increase in tenant reinsurance revenue was due primarily to an increase in the number of stores operated, as well as the Life Storage stores being on our platform for a full 12 months in 2024 in comparison with five months in 2023. We operated 4,011 stores at December 31, 2024, compared to 3,714 stores at December 31, 2023. \nManagement Fees and Other Income\n—Management fees and other income represent the fees collected for our management of stores owned by third parties and unconsolidated joint ventures and other transaction fee income. The increase for the year ended December 31, 2024 was primarily due to an increase in the number of stores managed. As of December 31, 2024, we managed 2,044 stores for third parties and unconsolidated joint ventures, compared to 1,811 stores as of December 31, 2023.\n23\nExpenses\nThe following table presents information on expenses for the years indicated:\n \nFor the Year Ended December 31,\n \n2024\n2023\n$ Change\n% Change\nProperty operations\n$\n831,566 \n$\n612,036 \n$\n219,530 \n35.9 \n%\nTenant reinsurance \n73,886 \n58,874 \n15,012 \n25.5 \n%\nLife Storage Merger transition costs\n— \n66,732 \n(66,732)\n(100.0)\n%\nGeneral and administrative\n167,398 \n146,408 \n20,990 \n14.3 \n%\nDepreciation and amortization\n783,023 \n506,053 \n276,970 \n54.7 \n%\nTotal expenses\n$\n1,855,873 \n$\n1,390,103 \n$\n465,770 \n33.5 \n%\nProperty Operations\n—The increase in property operations expense consists primarily of an increase of $186,294  associated with the Life Storage Merger and other acquisitions completed in 2023 and 2024. We acquired 757 wholly-owned stores in the merger and an additional 14 stores during the year ended December 31, 2023. We acquired 58 stores during the year ended December 31, 2024. The increase is also attributed to the Life Storage stores being on our platform for a full 12 months in 2024 in comparison with five months in 2023. Additionally, property operations expense increased $23,122 at our same-store pool due to increased marketing expense, payroll, and property taxes. \nTenant Reinsurance\n—Tenant reinsurance expense represents the costs that are incurred to provide tenant reinsurance.  The increase in tenant reinsurance expense for the year ended December 31, 2024 was due primarily to the increase in total number of stores operated compared to the prior year. We operated 4,011 stores at December 31, 2024, compared to 3,714 stores at December 31, 2023. \nLife Storage Merger Transition Costs—\nRepresents the costs that were incurred as part of the Life Storage Merger  primarily consisting of severance paid as part of employment agreements with certain employees and officers of  Life Storage.\nGeneral and Administrative—\nGeneral and administrative expenses primarily include all expenses not directly related to our stores, including corporate payroll, travel and professional fees. These expenses are recognized as incurred. Our overall General and Administrative expense has increased primarily as a result of our increased size through acquisitions, business combinations and growth through our joint venture partners and managed portfolio. No other material trends in specific travel or other expenses were observed. \nDepreciation and Amortization\n—Depreciation and amortization expense increased primarily as a result of the acquisition of new stores. We acquired 58 wholly-owned stores during the year ended December 31, 2024. We acquired 757 wholly-owned stores in the Life Storage Merger and an additional 14 wholly-owned stores during the year ended December 31, 2023. \n24\nOther Income and Expenses\nThe following table presents information on other revenues and expenses for the years indicated:\n \nFor the Year Ended December 31,\n \n2024\n2023\n$ Change\n% Change\nLoss on real estate assets held for sale and sold, net\n$\n(25,906)\n$\n— \n$\n(25,906)\n100.0 \n%\nImpairment of Life Storage trade name\n(51,763)\n— \n(51,763)\n100.0 \n%\nInterest expense\n(551,354)\n(419,035)\n(132,319)\n31.6 \n%\nNon-cash interest expense related to amortization of discount on Life Storage unsecured senior notes\n(43,720)\n(18,786)\n(24,934)\n132.7 \n%\nInterest income\n124,422 \n84,857 \n39,565 \n46.6 \n%\nEquity in earnings and dividend income from unconsolidated real estate entities\n67,272 \n54,835 \n12,437 \n22.7 \n%\nEquity in earnings of unconsolidated real estate ventures - gain on sale of real estate assets and sale of a joint venture interest\n13,730 \n— \n13,730 \n100.0 \n%\nIncome tax expense\n(33,478)\n(21,559)\n(11,919)\n55.3 \n%\nTotal other expense, net\n$\n(500,797)\n$\n(319,688)\n$\n(181,109)\n56.7 \n%\nLoss on Real Estate Assets Held for Sale and Sold, Net—\nDuring the year ended December 31, 2024, we had 18 stores classified as held for sale. Of the 18 stores, 10 had an estimated fair value, net of selling costs, which was less than the carrying value of the asset. As a result, we recorded an estimated loss of $63,250. On our consolidated statements of operations, this amount is shown net of the sale of a property which generated a gain of $37,344 within gain (loss) on real estate assets held for sale and sold, net.\nImpairment of Life Storage Trade Name—\nDuring the year ended December 31, 2024, we decided to operate all stores under a single brand. As a result of that decision, we deemed the Life Storage trade name intangible asset to be impaired and recognized a loss for the full value of the asset.\nInterest Expense—\nThe increase in interest expense during the year ended December 31, 2024 was primarily the result of higher outstanding debt compared to the same period in the prior year. Information on the total face value of debt and the weighted average interest rate for the years ended December 31, 2024 and December 31, 2023 is set forth in the following table:\n \nFor the Year Ended December 31,\n \n2024\n2023\nTotal face value of debt\n$\n12,600,661 \n$\n11,346,105 \nWeighted average interest rate\n4.4 \n%\n4.6 \n%\nNon-cash Interest Expense Related to Amortization of Discount on Life Storage Unsecured Senior Notes—\nRepresents the amortization of the discount assigned to the fair value of the Life Storage unsecured senior notes assumed as part of the Life Storage Merger.\nInterest Income—\nInterest income represents interest earned on variable interest rate bridge loans, debt securities and on notes receivable from common and preferred Operating Partnership unit holders. The increase in interest income during the year ended December 31, 2024 was primarily the result of an increase in the amount of bridge loans outstanding. The balance of bridge loans was $1,244,575 as of December 31, 2024, compared to $594,727 as of December 31, 2023.\n25\nEquity in Earnings and Dividend Income from Unconsolidated Real Estate Entities—\nEquity in earnings of unconsolidated real estate entities represents the income earned through our ownership interests in unconsolidated joint ventures. In these joint ventures, we and our joint venture partners generally receive a preferred return on our invested capital. To the extent that cash or profits in excess of these preferred returns are generated, we receive a higher percentage of the excess cash or profits. The increase compared to 2023 is mainly attributed to the Life Storage stores being on our platform for 12 months in 2024 in comparison with five months in 2023. Additionally, in November 2024 we acquired additional ownership interest in the HF1 Sovran HHF Storage Holdings LLC and HF2 Sovran HHF Storage Holdings II LLC from our partner in the unconsolidated joint ventures. The transaction increased our equity ownership percentages from 20% and 15%, respectively, to 49% in each unconsolidated joint venture. Dividend income represents dividends from our investment in preferred stock of SmartStop Self Storage REIT, Inc. and Strategic Storage Trust VI, Inc.\nEquity in Earnings of Unconsolidated Real Estate Ventures - Gain on Sale of Real Estate Assets and Sale of a Joint Venture Interest—\nIn August 2024, the ESS Bristol Investments LLC joint venture sold five of its eight stores to another unconsolidated joint venture, and we recognized a gain of $10,324 for our pro rata share of the transaction. In September 2024, we sold our membership interest in the Alan Jathoo JV LLC unconsolidated joint venture, which held nine stores, to our partner and recognized a gain of $3,406 on the transaction.\nIncome Tax Expense—\nThe increase in income tax expense for the year ended December 31, 2024 was primarily the result of a full year of TRS book income for Life Storage stores, compared to a partial year in 2023, as well as a decrease in permanent tax deductions related to stock awards. \nComparison of the Year Ended December 31, 2023 to the Year Ended December 31, 2022 \nThe results of operations for the years ended December 31, 2023 compared to December 31, 2022 was included in our Annual Report on Form 10-K for the year ended December 31, 2023 on page 23, under Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” which was filed with the Securities and Exchange Commission (the “SEC”) on February 29, 2024.\nFUNDS FROM OPERATIONS\nFunds from operations (“FFO”) provides relevant and meaningful information about our operating performance that is necessary, along with net income and cash flows, for an understanding of our operating results. We believe FFO is a meaningful disclosure as a supplement to net earnings. Net earnings assume that the values of real estate assets diminish predictably over time as reflected through depreciation and amortization expenses. The values of real estate assets fluctuate due to market conditions, and we believe FFO more accurately reflects the value of our real estate assets. FFO is defined by the National Association of Real Estate Investment Trusts, Inc. (“NAREIT”) as net income computed in accordance with U.S. generally accepted accounting principles (“GAAP”), excluding gains or losses on sales of operating stores and impairment write-downs of depreciable real estate assets, plus real estate related depreciation and amortization and after adjustments to record unconsolidated partnerships and joint ventures on the same basis. We believe that to further understand our performance, FFO should be considered along with the reported net income and cash flows in accordance with GAAP, as presented in the consolidated financial statements. FFO should not be considered a replacement of net income computed in accordance with GAAP.\nThe computation of FFO may not be comparable to FFO reported by other REITs or real estate companies that do not define the term in accordance with the current NAREIT definition or that interpret the current NAREIT definition differently. FFO does not represent cash generated from operating activities determined in accordance with GAAP and should not be considered as an alternative to net income as an indication of our performance, as an alternative to net cash flow from operating activities, as a measure of our liquidity, or as an indicator of our ability to make cash distributions.\n26\nThe following table presents the calculation of FFO for the periods indicated:\n \nFor the Year Ended December 31,\n \n2024\n2023\n2022\nNet income attributable to common stockholders\n$\n854,681 \n$\n803,198 \n$\n860,688 \nAdjustments:\nReal estate depreciation\n618,189 \n418,149 \n263,923 \nAmortization of intangibles\n113,886 \n59,295 \n13,623 \n(Gain) loss on real estate assets held for sale and sold, net\n25,906 \n— \n(14,249)\nUnconsolidated joint venture real estate depreciation and amortization\n32,678 \n24,400 \n16,644 \nUnconsolidated joint venture gain on sale of real estate assets\n(13,730)\n— \n— \nDistributions paid on Series A Preferred Operating Partnership units\n— \n(159)\n(2,288)\nIncome allocated to Operating Partnership noncontrolling interests \n45,551 \n47,255 \n60,468 \nFunds from operations attributable to common stockholders and unit holders\n$\n1,677,161 \n$\n1,352,138 \n$\n1,198,809 \nSAME-STORE RESULTS\nComparison of the Year Ended December 31, 2024 to the Year Ended December 31, 2023 \nOur same-store pool for the periods presented consists of 1,071 stores that are wholly-owned and operated and that were stabilized by the first day of the earliest calendar year presented. We consider a store to be stabilized once it has been open for three years or has sustained average square foot occupancy of 80% or more for one calendar year. We believe that by providing same-store results from a stabilized pool of stores, with accompanying operating metrics including, but not limited to, occupancy, rental revenue growth, operating expense growth, net operating income growth, etc., stockholders and potential investors are able to evaluate operating performance without the effects of non-stabilized occupancy levels, rent levels, expense levels, acquisitions or completed developments. Same-store results should not be used as a basis for future same-store performance or for the performance of our stores as a whole. The following table presents operating data for our same-store portfolio: \n \nFor the Year Ended December 31,\nPercent\n \n2024\n2023\nChange\nSame-store rental revenues\nNet rental income\n$\n1,601,455 \n$\n1,596,015 \n0.3%\nOther operating income\n$\n64,300 \n$\n65,689 \n(2.1)%\nTotal same-store rental revenues\n$\n1,665,755 \n$\n1,661,704 \n0.2%\nSame-store operating expenses\nPayroll and benefits\n$\n95,696 \n$\n91,329 \n4.8%\nMarketing\n$\n34,038 \n$\n30,237 \n12.6%\nOffice expense\n$\n51,606 \n$\n51,655 \n(0.1)%\nProperty operating expense\n$\n37,646 \n$\n38,491 \n(2.2)%\nRepairs and maintenance\n$\n27,934 \n$\n26,469 \n5.5%\nProperty taxes\n$\n165,617 \n$\n152,028 \n8.9%\nInsurance\n$\n19,512 \n$\n18,718 \n4.2%\nTotal same-store operating expenses\n$\n432,049 \n$\n408,927 \n5.7%\nSame-store net operating income\n$\n1,233,706 \n$\n1,252,777 \n(1.5)%\n27\n \nSame-store square foot occupancy as of year end\n93.7 \n%\n92.5 \n%\nProperties included in same-store\n1,071 \n1,071 \nThe following table presents additional information for our same-store portfolio:\n \nFor the Year Ended December 31,\nSame-store portfolio\n2024\n2023\nAverage annual rent per occupied square foot, net of discounts and bad debt\n$\n21.68 \n$\n21.83 \nNew leases average annual rent per square foot\n$\n14.49 \n$\n16.18 \nAverage discounts as a percentage of rental revenues\n2.1 \n%\n2.4 \n%\nThe following table presents a reconciliation of same-store net operating income to net income as presented on our consolidated statements of operations for the periods indicated:\nFor the Year Ended December 31,\n2024\n2023\nNet Income\n$\n900,232 \n$\n850,453 \nAdjusted to exclude:\nLoss on real estate assets held for sale and sold, net\n25,906 \n— \nEquity in earnings and dividend income from unconsolidated real estate entities\n(67,272)\n(54,835)\nEquity in earnings of unconsolidated real estate ventures - gain on sale of real estate assets and sale of a joint venture interest\n(13,730)\n— \nInterest expense\n551,354 \n419,035 \nNon-cash interest expense related to amortization of discount on Life Storage unsecured senior notes\n43,720 \n18,786 \nDepreciation and amortization\n783,023 \n506,053 \nIncome tax expense\n33,478 \n21,559 \nLife Storage Merger transition costs\n— \n66,732 \nGeneral and administrative\n167,398 \n146,408 \nImpairment of Life Storage trade name\n51,763 \n— \nManagement fees, other income and interest income\n(245,277)\n(186,843)\nNet tenant insurance\n(258,909)\n(176,806)\nNon same-store rental revenue\n(1,137,497)\n(560,874)\nNon same-store operating expense\n399,517 \n203,109 \nTotal same-store net operating income\n$\n1,233,706 \n$\n1,252,777 \nComparison of the Year Ended December 31, 2023 to the Year Ended December 31, 2022\nThe same-store results for the years ended\n \nDecember 31, 2023 compared to December 31, 2022 was included in our Annual Report on Form 10-K for the year ended December 31, 2023 on page 27, under Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” which was filed with the SEC on February 29, 2024.\n28\nCASH FLOWS\nCash flows from operating activities increased as expected due to our continued growth in revenues and through the increase in the number of properties we own and operate. Cash flows used in investing activities relate primarily to our acquisition and development of new stores, sales of stores, investments in unconsolidated real estate entities, and notes receivable from bridge loans and fluctuate depending on our actions in those areas. Cash flows from financing activities depend primarily on our debt and equity financing activities. A summary of cash flows along with significant components are as follows:\nFor the Year Ended December 31,\n2024\n2023\n2022\nNet cash provided by operating activities\n$\n1,887,430 \n$\n1,402,474 \n$\n1,238,139 \nNet cash used in investing activities\n(1,646,920)\n(1,818,256)\n(1,648,459)\nNet cash (used in) provided by financing activities\n(202,290)\n423,130 \n431,861 \nSignificant components of net cash flow included:\nNet income\n$\n900,232 \n$\n850,453 \n$\n921,156 \nDepreciation and amortization\n783,023 \n506,053 \n288,316 \nAcquisition and development of real estate assets\n(779,153)\n(420,892)\n(1,353,510)\nLife Storage Merger, net of cash acquired\n— \n(1,182,411)\n— \nImpairment of Life Storage trade name\n51,763 \n— \n— \nInvestment in unconsolidated real estate entities\n(301,917)\n(180,279)\n(118,963)\nIssuance of notes receivable, net of sales and principal payments\n(635,677)\n(20,812)\n(35,561)\nProceeds from unsecured term loans, senior notes, revolving lines of credit and commercial paper\n8,685,933 \n7,113,003 \n5,188,011 \nPrincipal payments on unsecured term loans, senior notes, revolving lines of credit and commercial paper\n(8,724,444)\n(7,088,984)\n(4,207,700)\nProceeds from issuance of public bonds, net\n1,300,000 \n1,550,000 \n396,100 \nDividends paid on common stock\n(1,375,003)\n(1,046,341)\n(805,311)\nWe believe that cash flows generated by operations, along with our existing cash and cash equivalents, the availability of funds under our existing lines of credit, and our access to capital markets will be sufficient to meet all of our reasonably anticipated cash needs during the next twelve months. These cash needs include operating expenses, monthly debt service payments, recurring capital expenditures, acquisitions, funding for the bridge loan program, building redevelopments and expansions, distributions to unit holders and dividends to stockholders necessary to maintain our REIT qualification.\nWe expect to generate positive cash flow from operations, and we consider projected cash flows in our sources and uses of cash. These cash flows are principally derived from rents paid by our tenants. A significant deterioration in projected cash flows from operations could cause us to increase our reliance on available funds under our existing lines of credit, curtail planned capital expenditures, or seek other additional sources of financing.\n29\nLIQUIDITY AND CAPITAL RESOURCES\nFinancing Strategy\nWe will continue to employ leverage in our capital structure in amounts reviewed from time to time by our board of directors. Although our board of directors has not adopted a policy which limits the total amount of indebtedness that we may incur, we will consider a number of factors in evaluating our level of indebtedness from time to time, as well as the amount of such indebtedness that will be either fixed or variable rate. In making financing decisions, we will consider factors including but not limited to the following:\n \n•\nthe interest rate of the proposed financing;\n•\nthe extent to which the financing impacts flexibility in managing our stores;\n•\nprepayment penalties and restrictions on refinancing;\n•\nthe purchase price of stores acquired with debt financing;\n•\nlong-term objectives with respect to the financing;\n•\ntarget investment returns;\n•\nthe ability of particular stores, and our company as a whole, to generate cash flow sufficient to cover expected debt service payments;\n•\noverall level of consolidated indebtedness;\n•\ntiming of debt maturities;\n•\nprovisions that require recourse and cross-collateralization; and\n•\ncorporate credit ratios including fixed charge coverage ratio and max secured/unsecured indebtedness.\nOur indebtedness may be recourse, non-recourse, cross-collateralized, cross-defaulted, secured or unsecured. In addition, we may invest in stores subject to existing loans collateralized by mortgages or similar liens, or we may refinance stores acquired on a leveraged basis. We may use the proceeds from any borrowings to refinance existing indebtedness, to refinance investments, including the redevelopment of existing stores, for general working capital or to purchase additional interests in partnerships or joint ventures or for other purposes when we believe it is advisable.\nThe following table presents information relating to our debt:\nDecember 31, 2024\nDecember 31, 2023\nTotal face value of debt\n$\n12,600,661\n$\n11,346,105\nTotal enterprise value ratio\n28.4 \n%\n24.2 \n%\nTotal fixed-rate debt and other instruments to total debt\n75.8% \n(1)\n73.4% \n(2)\nWeighted average interest rate of total debt\n4.4 \n%\n4.6 \n%\nWeighted average interest rate for fixed rate debt\n4.1 \n%\n3.9 \n%\nWeighted average interest rate for variable rate debt\n5.4 \n%\n6.6 \n%\n(1) $9,555,406 total fixed-rate debt including $1,381,834 on which we have interest rate swaps that have been included as fixed-rate debt.\n(2) $8,322,953 total fixed-rate debt including $1,448,566 on which we have interest rate swaps that have been included as fixed-rate debt.\nIn November 2024, we established our commercial paper program, under which we may issue, repay and re-issue short-term unsecured commercial paper notes. The aggregate principal amount outstanding under the program at any time cannot exceed $1.0 billion, and the net proceeds of the commercial paper notes are expected to be used for general corporate purposes. The maturities of the notes generally range from overnight to three months, with a maximum of up to 13 months. The commercial paper notes are issued under customary terms in the commercial paper market and are issued at a discount from par or, alternatively, can be issued at par and bear varying interest rates on a fixed or floating basis. At any point in time, we expect to maintain available commitments under our Credit Facilities in an amount at least equal to the amount of commercial paper notes outstanding. At December 31, 2024, we had $500 million in issuances outstanding under the commercial paper program. \n30\nIn January 2021, we received a Baa2 rating from Moody's Investors Service, and in July 2019, we obtained a BBB/Stable rating from S&P which was upgraded to BBB+/Stable in July 2023 in connection with the Life Storage Merger. We intend to manage our balance sheet to maintain these ratings. Certain of our real estate assets are pledged as collateral for our debt. As of December 31, 2024, we had a total of 1,745 unencumbered stores as defined by our public bonds. Our unencumbered asset value was calculated as $29,846,899 and our total asset value was calculated as $35,767,585 according to the calculations as defined by our public bonds. We are subject to certain restrictive covenants relating to our outstanding debt. We were in compliance with all financial covenants at December 31, 2024.\nAs of December 31, 2024, we had $138,222 available in cash and cash equivalents. Our cash and cash equivalents are held in accounts managed by third party financial institutions and consist of invested cash and cash in our operating accounts. During 2024 and 2023, we experienced no loss or lack of access to our cash and cash equivalents; however, there can be no assurance that access to our cash and cash equivalents will not be impacted by adverse conditions in the financial markets.\nWe expect to fund our short-term and long-term liquidity requirements, including operating expenses, recurring capital expenditures, dividends to stockholders, distributions to holders of Operating Partnership units and interest on our outstanding indebtedness, out of our operating cash flow, cash on hand and borrowings under our revolving lines of credit and commercial paper. In addition, we are pursuing additional sources of financing based on anticipated funding needs and growth assumptions.\nOur liquidity needs consist primarily of operating expenses, monthly debt service payments, recurring capital expenditures, distributions to unit holders and dividends to stockholders necessary to maintain our REIT qualification. We may from time to time seek to repurchase our outstanding debt, shares of common stock or other securities in open market purchases, privately negotiated transactions or otherwise. Such repurchases, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. In addition, we evaluate, on an ongoing basis, the merits of strategic acquisitions and other relationships, which may require us to raise additional funds. We may also use Operating Partnership units as currency to fund acquisitions from self-storage owners who desire tax-deferral in their exiting transactions.\nOn April 15, 2024, we entered into an equity distribution agreement (the “Equity Distribution Agreement”) with certain sales agents and forward purchasers named therein. Under the terms of the Equity Distribution Agreement, we may issue and sell, and the forward purchasers may sell, from time to time through or to the sales agents, shares of our common stock having an aggregate offering price of up to $800 million. The shares of common stock will be offered pursuant to our effective registration statement on Form S-3 (Registration Statement No. 333-278690) previously filed with and declared effective by the SEC and a prospectus supplement and accompanying prospectus, filed with the SEC. As of December 31, 2024, no shares had been sold under the Equity Distribution Agreement, which we refer to as our “at the market” equity program.\nCONTRACTUAL OBLIGATIONS\nFor more information on our contractual obligations related to real estate acquisitions, refer to our commitments and contingencies footnote in the notes to the consolidated financial statements in Item 8 of this Form 10-K.\nSEASONALITY\nThe self-storage business has been subject to seasonal fluctuations. A greater portion of revenues and profits is typically realized from May through September. Historically, our highest level of occupancy has been at the end of July, while our lowest level of occupancy has been in late February and early March. Results for any quarter may not be indicative of the results that may be achieved for the full fiscal year.\n31",
  "item2": null
}