{
  "source_file": "f-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. \nBusiness.\nFord Motor Company was incorporated in Delaware in 1919.  We acquired the business of a Michigan company, also known as Ford Motor Company, which had been incorporated in 1903 to produce and sell automobiles designed and engineered by Henry Ford.  We are a global company based in Dearborn, Michigan.  With about 171,000 employees worldwide, the Company is committed to helping build a better world, where every person is free to move and pursue their dreams.  The Company’s Ford+ plan for growth and value creation combines existing strengths, new capabilities, and always-on relationships with customers to enrich experiences for customers and deepen their loyalty.  Ford develops and delivers innovative, must-have Ford trucks, sport utility vehicles, commercial vans and cars, and Lincoln luxury vehicles, along with connected services.  The Company offers freedom of choice through three customer-centered business segments:  Ford Blue, engineering iconic gas-powered and hybrid vehicles; Ford Model e, inventing breakthrough electric vehicles (“EVs”) along with embedded software that defines always-on digital experiences for all customers; and Ford Pro, helping commercial customers transform and expand their businesses with vehicles and services tailored to their needs.  Additionally, the Company provides financial services through Ford Motor Credit Company LLC (“Ford Credit”).\nIn addition to the information about Ford and our subsidiaries contained in this Annual Report on Form 10-K for the year ended December 31, 2024 (“2024 Form 10-K Report” or “Report”), extensive information about our Company can be found at \nhttps://corporate.ford.com\n, including information about our management team, brands, products, services, and corporate governance principles.\nThe corporate governance information on our website includes our Corporate Governance Principles, Code of Ethics for Senior Financial Personnel, Code of Ethics for the Board of Directors, Code of Corporate Conduct for all employees, and the Charters for each of the Committees of our Board of Directors.  In addition, any amendments to our Code of Ethics or waivers granted to our directors and executive officers will be posted on our corporate website.  All of these documents may be accessed by going to our corporate website, or may be obtained free of charge by writing to our Shareholder Relations Department, Ford Motor Company, One American Road, P.O. Box 1899, Dearborn, Michigan 48126-1899.\nOur recent periodic reports filed with the Securities and Exchange Commission (“SEC”) pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, are available free of charge at \nhttps://shareholder.ford.com\n.  This includes recent Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, and Current Reports on Form 8-K, as well as any amendments to those reports, and our Section 16 filings.  We post each of these documents on our website as soon as reasonably practicable after it is electronically filed with the SEC.  Our reports filed with the SEC also may be found on the SEC’s website at \nwww.sec.gov\n.\nOur Integrated Sustainability and Financial Report, which details our performance and progress toward our sustainability and corporate responsibility goals, is available at \nhttps://sustainability.ford.com\n.\nThe foregoing information regarding our websites and their content is for convenience only and not deemed to be incorporated by reference into this Report nor filed with the SEC.\n1\nItem 1.  Business (Continued) \nOVERVIEW\nBelow is a description of our reportable segments and other activities as of December 31, 2024.  \nFORD BLUE SEGMENT\nFord Blue primarily includes the sale of Ford and Lincoln internal combustion engine (“ICE”) and hybrid vehicles, service parts, accessories, and digital services for retail customers, together with the associated costs of development, manufacture, and distribution of the vehicles, parts, accessories, and services.  This segment focuses on developing Ford and Lincoln ICE and hybrid vehicles.  Additionally, this segment provides hardware engineering and manufacturing capabilities to Ford Model e and manufactures vehicles on behalf of Ford Pro and, in certain cases, Ford Model e.  Ford Blue also includes:\n•\nAll sales for markets not presently in scope for Ford Model e or Ford Pro (as further described below)\n•\nIn markets outside of the United States and Canada, sales to commercial, government, and rental customers of ICE and hybrid vehicles not considered core to Ford Pro\n•\nSales of EVs by our unconsolidated affiliates in China\n•\nAll sales of vehicles manufactured and sold to other OEMs\nFORD MODEL E SEGMENT\nFord Model e primarily includes the sale of our electric vehicles, service parts, accessories, and digital services for retail customers, together with the associated costs of development, manufacture, and distribution of the vehicles, parts, accessories, and services.  This segment focuses on developing EV and digital vehicle technologies, as well as software development.  Additionally, Ford Model e provides software and connected vehicle technologies on behalf of the enterprise, and manufactures certain EVs, including for Ford Pro.  Ford Model e operates in North America, Europe, and China.  Ford Model e also includes EV and related sales not considered core to Ford Pro to commercial, government, and rental customers in Europe, China, and Mexico.\nFORD PRO SEGMENT\nFord Pro primarily includes the sale of Ford and Lincoln vehicles, service parts, accessories, and services for commercial, government, and rental customers.  Included in this segment are sales of all core Ford Pro vehicles, such as Super Duty and the Transit range of vans in North America and Europe and all sales of Ranger in Europe.  In the United States and Canada, Ford Pro also includes all vehicle sales to commercial, government, and rental customers.  This segment focuses on selling ICE, hybrid, and electric vehicles, and providing digital and physical services to optimize and maintain fleets, including telematics and EV charging solutions.  This segment reflects external sales of vehicles produced by Ford Blue and Ford Model e and the costs (including intersegment markup) associated with acquiring vehicles for sale and providing services.  Ford Pro operates in North America and Europe.\nGeneral\nOur vehicle brands are Ford and Lincoln.  In 2024, we sold approximately 4,470,000 vehicles at wholesale throughout the world.  See “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” (“Item 7”) for a discussion of our calculation of wholesale unit volumes.\nSubstantially all of our vehicles, parts, and accessories are sold through distributors and dealers (collectively, “dealerships”), the substantial majority of which are independently owned.  At December 31, the approximate number of dealerships worldwide distributing our vehicle brands was as follows:\nBrand\n2023\n2024\nFord\n8,639 \n8,212 \nFord-Lincoln (combined)\n503 \n451 \nLincoln\n385 \n343 \nTotal\n9,527 \n9,006 \nWe do not depend on any single customer or a few customers to the extent that the loss of such customers would have a material adverse effect on our business. \n2\nItem 1.  Business (Continued) \nIn addition to the products we sell to our dealerships for retail sale, we also sell vehicles to our dealerships for sale to fleet customers, including commercial fleet customers, daily rental car companies, and governments.  We also sell parts and accessories, primarily to our dealerships (which, in turn, sell these products to retail customers) and to authorized parts distributors (which, in turn, primarily sell these products to retailers).  We also offer extended service contracts. \nThe worldwide automotive industry is affected significantly by general economic and political conditions over which we have little control.  Vehicles are durable goods, and consumers and businesses have latitude in determining whether and when to replace an existing vehicle.  The decision whether to purchase a vehicle may be affected significantly by slowing economic growth, geopolitical events, and other factors (including the cost of purchasing and operating cars, trucks, and utility vehicles, the availability and cost of financing, cost of fuel, and electric vehicle charging availability and cost).  As a result, the number of cars, trucks, and utility vehicles sold may vary substantially from year to year.  Further, the automotive industry is a highly competitive business that has a wide and growing variety of product and service offerings from a growing number of manufacturers.\nOur wholesale unit volumes vary with the level of total industry demand and our share of that industry demand.  Our wholesale unit volumes also are influenced by the level of dealer inventory, and our ability to maintain sufficient production levels to support desired dealer inventory in the event of supplier disruptions or other types of disruptions affecting our production.  Our share is influenced by how our products are perceived by customers in comparison to those offered by other manufacturers based on many factors, including price, quality, styling, reliability, safety, fuel efficiency, functionality, sustainability, and reputation.  Our share also is affected by the timing and frequency of new model introductions.  Our ability to satisfy changing consumer and business preferences with respect to type or size of vehicle, as well as design and performance characteristics and the services our vehicles offer, affects our sales and earnings significantly.\nAs with other manufacturers, the profitability of our business is affected by many factors, including:\n•\nWholesale unit volumes\n•\nMargin of profit on each vehicle sold - which, in turn, is affected by many factors, such as:\n◦\nMarket factors - volume and mix of vehicles and options sold, and net pricing (reflecting, among other factors, incentive programs)  \n◦\nCosts of components and raw materials necessary for production of vehicles\n◦\nCosts for customer warranty claims and additional service actions\n◦\nCosts for safety, emissions, and fuel economy technology and equipment\n•\nA high proportion of relatively fixed structural costs, so that small changes in wholesale unit volumes can significantly affect overall profitability\nAlthough supply disruptions have resulted in a higher level of new vehicle prices, our industry has historically had a very competitive pricing environment, driven in part by excess capacity.  For the past several decades, manufacturers typically have offered price discounts and other marketing incentives to provide value for customers and maintain market share and production levels, and we saw some of these actions resume as industry production and inventories improved in recent quarters.  The decline in value of foreign currencies can also contribute significantly to competitive pressures in many of our markets.  \nCompetitive Position.\n  The worldwide automotive industry consists of many producers, with no single dominant producer.  Certain manufacturers, however, account for the major percentage of total sales within particular countries, especially their countries of origin. \nSeasonality.\n  We manage our vehicle production schedule based on a number of factors, including retail sales (i.e., units sold by our dealerships to their customers at retail) and dealer stock levels (i.e., the number of units held in inventory by our dealerships for sale to their customers).  Historically, we have experienced some seasonal fluctuation in the business, with production in many markets tending to be higher in the first half of the year to meet demand in the spring and summer (typically the strongest sales months of the year); however, that may not be the case in a particular year depending on the circumstances, e.g., if we have a higher number of vehicle launches (particularly for our higher volume vehicles) in the first half of the year, we would expect production in the second half of the year to be higher.\n3\nItem 1.  Business (Continued) \nRaw Materials.\n  We purchase a wide variety of raw materials from numerous suppliers around the world for use in the production of, and development of technologies in, our vehicles.  These materials include base metals (e.g., steel and aluminum), precious metals (e.g., palladium), energy (e.g., natural gas), and plastics/resins (e.g., polypropylene).  As we transition to a greater mix of electric vehicles, we expect to increase our reliance on lithium, cobalt, and nickel, among other materials, for batteries.  We expect to have adequate supplies or sources of availability of raw materials necessary to meet our needs; however, there always are risks and uncertainties with respect to the supply of raw materials that could impact availability in sufficient quantities and at cost effective prices to meet our needs.  See “Item 1A. Risk Factors” for a discussion of the risks associated with a shortage of components or raw materials, supplier disruptions, and inflationary pressures, the “Key Trends and Economic Factors Affecting Ford and the Automotive Industry” section of Item 7 for a discussion of commodity and energy price changes, and “Item 7A. Quantitative and Qualitative Disclosures about Market Risk” (“Item 7A”) for a discussion of commodity price risks.\nIntellectual Property.\n  We own or hold licenses to use numerous patents, trade secrets, copyrights, and trademarks on a global basis.  We expect to continue building this portfolio as we actively pursue innovation in every part of our business.  We also own numerous trademarks and service marks that contribute to the identity and recognition of our Company and its products and services globally.  While our intellectual property rights in the aggregate are important to the operation of each of our businesses, we do not believe that our business would be materially affected by the expiration of any particular intellectual property right or termination of any particular intellectual property agreement.\nWarranty Coverage, Field Service Actions, and Customer Satisfaction Actions.\n  We provide warranties on vehicles we sell.  Warranties are offered for specific periods of time and/or mileage and vary depending upon the type of product and the geographic location of its sale.  Pursuant to these warranties, we will repair, replace, or adjust parts on a vehicle that are defective in factory-supplied materials or workmanship during the specified warranty period.  In addition to the costs associated with this warranty coverage provided on our vehicles, we also incur costs as a result of field service actions (i.e., safety recalls, emission recalls, and other product campaigns) and for customer satisfaction actions.  Software updates are increasingly a component of vehicle service and may be performed during warranty coverage repairs, through field service actions, or through over-the-air updates.\nFor additional information regarding warranty and related costs, see “Critical Accounting Estimates” in Item 7 and Note 24 of the Notes to the Financial Statements.\nWholesales\nWholesales consist primarily of vehicles sold to dealerships.  For the majority of such sales, we recognize revenue when we ship the vehicles to our dealerships from our manufacturing facilities.  See Item 7 for additional discussion of revenue recognition practices.  Wholesales in certain key markets during the past three years were as follows:\n \nWholesales (a)\n(in thousands of units)\n \n2022\n2023\n2024\nUnited States\n2,012 \n2,097 \n2,200 \nChina (b)\n495 \n467 \n442 \nCanada\n258 \n260 \n269 \nUnited Kingdom\n263 \n243 \n242 \nGermany\n182 \n162 \n155 \nTürkiye\n85 \n124 \n114 \nItaly\n107 \n122 \n109 \nAustralia (c)\n71 \n89 \n104 \nFrance \n90 \n104 \n78 \nOther Markets\n668 \n745 \n757 \nTotal Company\n4,231 \n4,413 \n4,470 \n__________\n(a)\nWholesale unit volumes include sales of medium and heavy trucks.  Wholesale unit volumes also include all Ford and Lincoln badged units (whether produced by Ford or by an unconsolidated affiliate) that are sold to dealerships or others, units manufactured by Ford that are sold to other manufacturers, units distributed by Ford for other manufacturers, local brand units produced by our unconsolidated Chinese joint venture Jiangling Motors Corporation, Ltd. (“JMC”) that are sold to dealerships or others, and Ford badged vehicles produced in Taiwan by Lio Ho Group.  Vehicles sold to daily rental car companies that are subject to a guaranteed repurchase option (i.e., rental repurchase), as well as other sales of finished vehicles for which the recognition of revenue is deferred (e.g., consignments), also are included in wholesale unit volumes.  Revenue from certain vehicles in wholesale unit volumes (specifically, Ford badged vehicles produced and distributed by our unconsolidated affiliates, as well as JMC brand vehicles) are not included in our revenue.\n(b)\nChina includes Taiwan.\n(c)\nNot previously presented.\n4\nItem 1.  Business (Continued) \nSales, Industry Volume, and Market Share\nSales, industry volume, and market share in certain key markets during the past three years were as follows:\n \nSales (a)\nIndustry Volume (b)\nMarket Share (c)\n(in millions of units)\n(in millions of units)\n(as a percentage)\n \n2022\n2023\n2024\n2022\n2023\n2024\n2022\n2023\n2024\nUnited States\n1.9 \n2.0 \n2.1 \n14.2 \n16.1 \n16.4 \n13.1 \n%\n12.4 \n%\n12.6 \n%\nChina (d)\n0.5 \n0.5 \n0.4 \n23.9 \n25.1 \n27.1 \n2.1 \n1.8 \n1.6 \nCanada\n0.2 \n0.2 \n0.3 \n1.6 \n1.8 \n1.9 \n15.2 \n13.7 \n14.7 \nUnited Kingdom\n0.2 \n0.2 \n0.2 \n1.9 \n2.3 \n2.4 \n12.1 \n10.8 \n9.6 \nGermany\n0.2 \n0.2 \n0.2 \n3.0 \n3.2 \n3.2 \n5.7 \n5.1 \n5.0 \nTürkiye\n0.1 \n0.1 \n0.1 \n0.8 \n1.3 \n1.3 \n10.5 \n8.9 \n8.8 \nItaly \n0.1 \n0.1 \n0.1 \n1.5 \n1.8 \n1.8 \n6.4 \n6.1 \n5.8 \nAustralia (e)\n0.1 \n0.1 \n0.1 \n1.1 \n1.2 \n1.2 \n6.2 \n7.2 \n8.2 \nFrance \n0.1 \n0.1 \n0.1 \n2.0 \n2.3 \n2.2 \n3.9 \n3.9 \n3.5 \n__________\n(a)\nRepresents primarily sales by dealers, sales to the government, and leases to Ford management, and is based, in part, on estimated vehicle registrations; includes medium and heavy trucks.\n(b)\nIndustry volume is an internal estimate based on publicly available data collected from various government, private, and public sources around the globe; includes medium and heavy trucks.\n(c)\nMarket share represents reported retail sales of our brands as a percent of total industry volume in the relevant market or region.\n(d)\nChina includes Taiwan; China market share includes Ford brand and JMC brand vehicles produced and sold by our unconsolidated affiliates.\n(e)\nNot previously presented.  \nU.S. Sales by Type\nThe following table shows U.S. sales volume and U.S. wholesales (consisting primarily of vehicles sold to dealerships) segregated by electric, hybrid, and internal combustion vehicles.  U.S. sales volume represents primarily sales by dealers, sales to the government, and leases to Ford management, and is based, in part, on estimated vehicle registrations and includes medium and heavy trucks.      \nU.S. Sales\nU.S. Wholesales\n2023\n2024\n2023\n2024\nElectric Vehicles\n72,608 \n97,865 \n99,928 \n68,990 \nHybrid Vehicles\n133,743 \n187,426 \n146,249 \n215,735 \nInternal Combustion Vehicles\n1,789,561 \n1,793,541 \n1,850,448 \n1,914,862 \nTotal Vehicles\n1,995,912 \n2,078,832 \n2,096,625 \n2,199,587 \nFORD NEXT SEGMENT\nIn 2024, the Ford Next segment primarily included expenses and investments for emerging business initiatives aimed at creating value for Ford in vehicle-adjacent market segments.  As of January 1, 2025, Ford Next is no longer a reportable segment, and those expenses and investments are now reflected in either the reportable segments that benefit from those expenses and investments or Corporate Other.\n5\nItem 1.  Business (Continued) \nFORD CREDIT SEGMENT\nThe Ford Credit segment is comprised of the Ford Credit business on a consolidated basis, which is primarily vehicle-related financing and leasing activities.  \nFord Credit offers a wide variety of automotive financing products to and through automotive dealers throughout the world.  The predominant share of Ford Credit’s business consists of financing our vehicles and supporting our dealers.  Ford Credit earns its revenue primarily from payments made under retail installment sale and finance lease (retail financing) and operating lease contracts that it originates and purchases; interest rate supplements and other support payments from us and our affiliates; and payments made under dealer financing programs.\nAs a result of these financing activities, Ford Credit has a large portfolio of finance receivables and operating leases which it classifies into two portfolios —“consumer” and “non-consumer.”  Finance receivables and operating leases in the consumer portfolio include products offered to individuals and businesses that finance the acquisition of our vehicles from dealers for personal and commercial use.  Retail financing includes retail installment sale contracts for new and used vehicles and finance leases (comprised of sales-type and direct financing leases) for new vehicles to retail and commercial customers, including leasing companies, government entities, daily rental companies, and fleet customers.  Finance receivables in the non-consumer portfolio include products offered to automotive dealers.  Ford Credit makes wholesale loans to dealers to finance the purchase of vehicle inventory, also known as floorplan financing, as well as loans to dealers to finance working capital and improvements to dealership facilities, finance the purchase of dealership real estate, and finance other dealer vehicle programs.  Ford Credit also purchases receivables generated by us and our affiliates, primarily related to the sale of parts and accessories to dealers and certain used vehicles from daily rental fleet companies.  Ford Credit also provides financing to us for vehicles that we lease to our employees.\nThe majority of Ford Credit’s business is in the United States and Canada.  Outside of the United States, Europe is Ford Credit’s largest operation.  Ford Credit’s European operations are managed primarily through its United Kingdom-based subsidiary, FCE Bank plc (“FCE”), and its Germany-based subsidiary, Ford Bank GmbH (“Ford Bank”).  Within Europe, Ford Credit’s largest markets are the United Kingdom and Germany.\nSee Item 7 and Notes 10 and 12 of the Notes to the Financial Statements for a detailed discussion of Ford Credit’s receivables, credit losses, allowance for credit losses, loss-to-receivables ratios, funding sources, and funding strategies.  See Item 7A for a discussion of how Ford Credit manages its financial market risks.\nWe routinely sponsor special retail financing and lease incentives to dealers’ customers who choose to finance or lease our vehicles from Ford Credit.  In order to compensate Ford Credit for the lower interest or lease payments offered to the retail customer, we pay the discounted value of the incentive directly to Ford Credit when it originates the retail finance or lease contract with the dealer’s customer.  These programs increase Ford Credit’s financing volume and share.  See Note 2 of the Notes to the Financial Statements for information about our accounting for these programs.\nWe have a Third Amended and Restated Relationship Agreement with Ford Credit, pursuant to which, if Ford Credit’s financial statement leverage for a calendar quarter were to be higher than 12.5:1 (as reported in its most recent periodic report), Ford Credit could require us to make or cause to be made a capital contribution to it in an amount sufficient to have caused such financial statement leverage to have been 12.5:1.  No capital contributions have been made pursuant to this agreement.  In a separate agreement with FCE, Ford Credit has agreed to maintain FCE’s net worth in excess of $500 million.  No payments have been made pursuant to that agreement.\nFord Credit files periodic reports with the SEC that contain additional information regarding Ford Credit.  The reports are available through Ford Credit’s website located at \nwww.ford.com/finance/investor-center\n and can also be found on the SEC’s website located at \nwww.sec.gov\n.\nThe foregoing information regarding Ford Credit’s website and its content is for convenience only and not deemed to be incorporated by reference into this Report nor filed with the SEC.\n6\nItem 1.  Business (Continued) \nCORPORATE OTHER\nCorporate Other primarily includes corporate governance expenses, past service pension and other postretirement employee benefits (“OPEB”) income and expense, interest income (excluding Ford Credit interest income and interest earned on our extended service contract portfolio) and gains and losses from our cash, cash equivalents, and marketable securities (excluding gains and losses on investments in equity securities), and foreign exchange derivatives gains and losses associated with intercompany lending.  Corporate governance expenses are primarily administrative, delivering benefit on behalf of the global enterprise, that are not allocated to operating segments.  These include expenses related to setting and directing global policy, providing oversight and stewardship, and promoting the Company’s interests.  Corporate Other assets include:  cash, cash equivalents and marketable securities, tax related assets, defined benefit pension plan net assets, and other assets managed centrally.  \nINTEREST ON DEBT\nInterest on Debt consists of interest expense on Company debt excluding Ford Credit.\nGOVERNMENTAL STANDARDS\nMany governmental standards and regulations relating to safety, fuel economy, air pollution emissions control, noise control, vehicle recycling, substances of concern, vehicle damage, and theft prevention are applicable to new motor vehicles, engines, and equipment.  In addition, manufacturing and other automotive assembly facilities are subject to stringent standards regulating air emissions, water discharges, and the handling and disposal of hazardous substances.  The most significant of the standards and regulations affecting us are discussed below:\nU.S. Vehicle Emissions Standards and Fuel Economy\nFederal and California Emissions Standards.  \nBoth the U.S. Environmental Protection Agency (“EPA”) and the California Air Resources Board (“CARB”) have motor vehicle tailpipe and evaporative emissions standards that become increasingly stringent over time.  In addition to regulating emissions of certain pollutants—known as “criteria pollutants”—for which EPA has adopted ambient health-based standards (e.g., oxides of nitrogen), EPA and CARB also regulate greenhouse gases (“GHGs”) from vehicles (e.g., carbon dioxide).  EPA and CARB also require:  that vehicles and engines are durable enough to meet emissions standards for prescribed amounts of time; that vehicles and engines be equipped with on-board diagnostic (“OBD”) systems that monitor emissions-related systems and components; and that manufacturers offer and honor warranties on certain emissions-related components.  Vehicles and engines must be certified by EPA prior to sale in the United States and by CARB prior to sale in California and those states that have adopted California’s standards. \nManufacturers generally demonstrate compliance with emissions standards on a fleet-wide, production-volume-weighted basis, and over time through a system based on credits.  Manufacturers may generate credits insofar as their products emit less than the emissions standards, and may incur and carry credit deficits for a limited amount of time insofar as their products emit more than the emissions standards.  Under certain circumstances, manufacturers may sell credits to other manufacturers, who may then use the purchased credits to cure a deficit.  If a manufacturer fails to comply with applicable emissions standards, even after considering its ability to carry deficits and use credits, then EPA and CARB may take various actions, including withholding approvals to sell new vehicles and engines and/or enforcement actions for civil penalties and injunctive relief. \nFor light-duty cars and trucks, EPA and CARB each maintain emissions standards for both criteria pollutants and GHGs.  In 2021, EPA promulgated emissions standards for GHGs for the 2023 through 2026 model years, and then in 2024 promulgated emission standards for criteria pollutants and GHGs for the 2027 through 2032 model years.  Both sets of standards are subject to pending legal challenges.  CARB also has emissions standards for criteria pollutants and GHGs in place through the 2025 model year.  In 2022, CARB promulgated emissions standards for criteria pollutants for the 2026 through 2035 model years.  Currently, CARB is considering adopting emissions standards for GHGs for future model years.  These EPA and CARB standards also include updates to durability, warranty, and OBD requirements.  \n7\nItem 1.  Business (Continued) \nFor heavy-duty vehicles and engines, EPA maintains emissions standards for criteria emissions and GHGs.  In 2022, EPA promulgated emissions standards for criteria emissions for 2027 and beyond.  In 2024, EPA promulgated emissions standards for GHGs for the 2027 through 2032 model years, and these GHG standards are subject to pending legal challenges.  CARB also has emissions standards for criteria pollutants and GHGs.  CARB has adopted emissions standards for criteria pollutants for 2024 and later model years.  CARB has also adopted emissions standards for GHGs for 2027 and beyond.  These EPA and CARB standards also include updates to durability, warranty, and OBD requirements.  \nSeventeen states (referenced as “opt-in” states) have adopted CARB’s light-duty emissions standards, and nine opt-in states have adopted California’s heavy-duty emissions standards.  The list of opt-in states changes over time, based on the legislative, executive, and regulatory actions by each individual state.\nCalifornia ZEV Requirements.  \nCalifornia requires manufacturers to produce and deliver for sale zero-emission vehicles (“ZEVs”), which include electric vehicles.  This is in addition to the emissions standards outlined above.  California’s regulations, which use a system based on credits (whether generated by us or purchased from another manufacturer) that can be banked and carried forward, require annual percentage increases in the production and sale of ZEVs.  For light-duty vehicles, in the 2025 model year, CARB regulations require that approximately 22% of a manufacturer’s California light-duty vehicle sales volume be ZEVs.  In the 2026 model year, this grows to 35%, and the requirements continue to grow each year, rising to 100% by the 2035 model year.  For heavy-duty vehicles, CARB regulations likewise require year-over-year increases in the percentage of a manufacturer’s California sales volume that must be ZEVs, with current percentages in the single digits growing to well over 50% by 2035. \nSixteen opt-in states have adopted California’s ZEV requirements for light-duty vehicles, and 10 opt-in states have adopted California’s ZEV requirements for heavy-duty vehicles.  The list of opt-in states changes over time, based on the legislative, executive, and regulatory actions by each individual state.\nCalifornia Waivers of Clean Air Act Preemption.\n  The federal Clean Air Act preempts states from establishing their own standards, except the Act provides that the EPA shall waive that preemption and thereby allow California to establish its own standards if, among other requirements, those standards will be at least as protective of public health and welfare as federal standards. \nFor decades, California has requested, and EPA has granted, waivers to allow California to implement emissions standards (and, likewise, allow opt-in states to implement those same standards within their borders).  In some cases, EPA withheld approval of waivers.  In 2019, during the first Trump administration, in an unprecedented move, the EPA rescinded a previously granted waiver (for California’s emissions standards for GHGs through the 2025 model year).  Then, in 2022, during the Biden administration, the EPA reinstated that waiver, allowing California to enforce the relevant standards as though the waiver was never rescinded.  These actions reflect policy differences between subsequent presidential administrations and remain the subject of ongoing legal challenges.  Such rescissions and reinstatements, and pending and future legal challenges concerning California’s authority, create significant uncertainty for regulated manufacturers about the need to comply with California and opt-in state requirements. \nTo manage the uncertainty from the 2019 waiver rescission, pending legal challenges, and other considerations, Ford reached an agreement with California and opt-in states on a set of terms for an alternative framework in which Ford committed to meet a designated set of GHG standards on a national basis for the 2021 through 2026 model years that were more stringent than the then-rolled back federal standards in lieu of the California regulatory program.  This framework enabled Ford to continue its product planning on a nationwide basis.  EPA’s emissions standards for GHGs, as finalized in 2021 and currently in place through the 2026 model year, get stricter over time and become more stringent than this California framework agreement.  Such framework agreements are a possibility for manufacturers to manage similar uncertainty in the future. \nEPA has issued waivers for the emissions standards and ZEV requirements outlined above.  The incoming administration has stated an intent to rescind one or more of these waivers.  \n8\nItem 1.  Business (Continued) \nFederal Fuel Economy Requirements.\n \nThe National Highway Traffic Safety Administration (“NHTSA”) requires that light-duty vehicles meet minimum corporate average fuel economy (“CAFE”) standards, and that certain heavy-duty vehicles meet fuel efficiency standards.  For CAFE standards, NHTSA establishes separate standards applicable to three subsets of manufacturers’ products:  domestic passenger cars, imported passenger cars, and light-duty trucks.  In 2022, NHTSA promulgated fuel economy standards for the 2024 through 2026 model years.  In 2024, NHTSA promulgated fuel economy standards for light-duty vehicles for the 2027 through 2031 model years, as well as standards for heavy-duty pickup trucks and vans for the 2030 through 2035 model years.  These recently finalized standards are the subject of ongoing legal challenges.  Manufacturers are subject to pre-determined civil penalties if they fail to meet fuel economy standards in any model year, after taking into account all available credits for the preceding five model years and expected credits for the three succeeding model years.\nAlignment and Misalignment of Standards.  \nBecause the vast majority of GHGs emitted by a vehicle are the result of fuel combustion, GHG emissions correspond closely with fuel economy.  Before approximately the 2020 model year, NHTSA and EPA aligned their standards, and California agreed that compliance with the federal program would satisfy compliance with its own GHG requirements, thereby avoiding a patchwork of federal and state standards.  Since approximately the 2021 model year, EPA and NHTSA have independently promulgated GHG and fuel economy standards, and while they generally avoided material inconsistencies between the standards, they nonetheless created complexity and redundancy for manufacturers that must meet both sets of standards.  Also since approximately the 2021 model year, California and opt-in states have maintained emissions standards and ZEV requirements, outlined above, which are not aligned with and are generally more stringent than the federal requirements and are outside the scope of the existing framework agreement with California described above. \nImplications for Ford.  \nThe requirements for light-duty vehicles outlined above apply to most cars, sport utility vehicles, and light-duty pickup trucks that Ford sells in the United States.  The requirements for heavy-duty vehicles and engines outlined above apply to most heavy-duty pickup trucks, vans, cab-chassis products, and vocational vehicles that Ford sells in the United States.  Ford is subject to each separate regulatory regime, and in general, this means separate compliance measures for each regulator and for each regulated pollutant and performance standard.  EPA, NHTSA, and CARB have requirements that govern the same aspects of the same products at the same time, as outlined above.  Different standards pose additional compliance burdens, including complexity and costs, and these burdens are heightened when these various requirements are misaligned or change, e.g., when there is a change in administration or as a result of a legal challenge.\nCompliance with emissions standards, ZEV requirements, fuel economy standards, OBD requirements, emissions warranty requirements, and related regulations can be challenging and can drive increased product development costs, production costs, higher retail prices, warranty costs, and vehicle recalls.  Compliance depends in part on the widespread availability of high-quality and consistent automotive fuels that internal combustion vehicles are designed to use.  Insofar as regulatory requirements get increasingly stringent, manufacturers must comply by increasing their sales of electric vehicles and other ZEVs, as a portion of overall sales.  This is directly required by California’s ZEV requirements, but is also required to comply with the emissions and fuel economy standards described above, which are not achievable solely through sales of internal combustion engines with today’s technology.  Sales of electric vehicles continue to grow, however there are factors limiting faster and future growth including:  supportive public policy; consumer acceptance and understanding of electric vehicles; upfront costs; technology cost and readiness; battery raw material availability and cost; and the availability of adequate infrastructure to support vehicle charging.\nStringent requirements that are misaligned with market conditions could force Ford to take various product-led actions that could have substantial adverse effects on its sales volumes and operations.  Such actions could include:  restricting offerings of certain products and popular options; taking actions to increase sales of Ford’s lowest-emitting and most fuel-efficient vehicles; and curtailing the production and sale of certain internal combustion vehicles.  For example, in those opt-in states that have adopted California’s ZEV requirements for light-duty vehicles, industrywide sales of ZEVs are growing but generally are not on track to meet the ZEV requirements as early as the 2026 model year, and product-led actions may be necessary to ensure compliance.  \n9\nItem 1.  Business (Continued) \nTo some extent, Ford can manage and is managing these risks in the United States and elsewhere by purchasing emissions credits from other vehicle manufacturers when the cost of those credits is less than the financial impact of the product-led actions listed above.  Such credits are available only from other manufacturers and only to the extent those manufacturers exceed compliance requirements.  Credits will have limited availability and may not be adequate to completely eliminate the need for product-led actions.  Accordingly, we have made a strategic decision to enter into agreements to purchase regulatory compliance credits for current and future model years in various regions.  Our obligations under these agreements are dependent on the continued existence of an underlying regulatory compliance requirement in the applicable jurisdiction.  Further, the number of credits we may ultimately purchase is dependent on the sellers’ delivery of the credits.  In the fourth quarter of 2024, we entered into agreements for the purchase of about $500 million of regulatory compliance credits, and for full year 2024, we entered into agreements for the purchase of about $4.3 billion of such credits.  As of December 31, 2024, our outstanding purchase obligations under our compliance credit purchase agreements totaled about $4.2 billion.  During 2024, we recorded about $200 million of expense for our estimated utilization of regulatory compliance credits related to current compliance period volumes (e.g., model year, calendar year), which was allocated to Ford Blue and Ford Pro results.\nFord’s ability to optimize investments and planning for compliance is hampered by sudden or frequent changes in applicable emissions and fuel economy standards and ZEV requirements.  Such changes can include rescissions and reinstatements of Clean Air Act waivers for California, court decisions that change applicable regulatory requirements, and significant changes to the stringency of federal requirements with each subsequent administration.\nGlobal Vehicle Emissions Standards and Fuel Economy\nEuropean Emissions Standards.\n  EU and U.K. regulations, directives, and related legislation limit the amount of regulated pollutants that may be emitted by new motor vehicles and engines sold in the European Union and the United Kingdom.  Regulatory stringency has increased significantly with the application of Stage VI emission standards (first introduced in 2014) and the implementation of a laboratory test cycle for CO\n2\n and emissions and the introduction of on-road emission testing using portable emission analyzers (Real Driving Emission or “RDE”).  These on-road emission tests are in addition to the laboratory-based tests (first introduced in 2017).  The divergence between the regulatory limit that is tested in laboratory conditions and the allowed values measured in RDE tests will ultimately be reduced to zero as the regulatory demands increase.  In addition, new requirements for tailpipe and non-tailpipe emissions will be included in the upcoming Euro 7 regulation and will be phased in beginning in November 2026 for new vehicle types and for all vehicles in November 2027.  The costs associated with complying with all of these requirements are significant, and following the EU Commission’s indication of its intent to accelerate emissions rules in its road map publication “EU Green Deal” as well as the EU sustainable mobility action plan, these challenges will continue in European markets, including the United Kingdom.  In addition, the Whole Vehicle Type Approval (“WVTA”) regulation has been updated to increase the stringency of in-market surveillance.  Moreover, following the U.K.’s withdrawal from the European Union, we may be subject to diverging requirements in our European markets, which could increase vehicle complexity and duties.\nThere continues to be an increasing trend of city access restrictions for internal combustion engine powered vehicles.  These access rules are developed by individual cities based on their specific concerns, resulting in rapid deployment of access rules that differ greatly among cities.  The speed of implementation of access rules may directly influence customer vehicle residual values and choice of next purchase.  In an effort to support the Paris Accord, some countries are adopting yearly increases in CO\n2\n taxes, where such a system is in place, and publishing dates by when internal combustion powered vehicles may no longer be registered, e.g., Norway in 2025 and the Netherlands in 2030.\nOther National Emissions Control Requirements.\n  Many countries, in an effort to address air quality and climate change concerns, have adopted previous versions of European or United Nations Economic Commission for Europe (“UN-ECE”) mobile source emission regulations.  Some countries have adopted more advanced regulations based on the most recent version of European or U.S. regulations.  For example, the China Stage VI light-duty vehicle emission standards, based on European Stage VI emission standards for light-duty vehicles, U.S. evaporative and refueling emissions standards, and CARB OBD II requirements, incorporate two levels of stringency for tailpipe emissions.  Under the level one (VI(a)) standard, the emissions limits are comparable to the EU Stage VI limits, except for carbon monoxide, which is 30% lower than the EU Stage VI limit.  The more stringent level two (VI(b)) standard’s emissions limits, which are currently in place nationwide in China, are approximately 30-50% lower than the EU Stage VI limits, depending on the pollutants.  China’s Ministry of Ecology and Environment is currently drafting the China Stage VII emission standards, which are expected to impose significantly lower allowable emission levels for pollutants as compared to the Stage VI limits and be expanded to add GHGs.  Detailed proposals for these new standards are expected by the end of 2025.  Mexico and most countries in Central America, the Caribbean, and South America continue to evolve and implement more stringent requirements accepting Europe and U.S. regulations, except Brazil, which has a unique local process called PROCONVE based on U.S. regulations for light-duty vehicles and European regulations for heavy-duty vehicles.  Other \n10\nItem 1.  Business (Continued) \ncountries across Southeast Asia, the Middle East, and Australasia expect to introduce regulations based on EU Stage VI standards in the near term.  Canadian criteria emissions regulations are largely aligned with U.S. requirements, and Canada accepts U.S. EPA certifications of vehicles and engines prior to their sale in Canada.\nElsewhere, there is a mix of regulations and processes based on U.S. and EU standards.  Not all countries have adopted appropriate fuel quality standards to accompany the stringent emission standards adopted.  This could lead to compliance problems, particularly if OBD or in-use surveillance requirements are implemented.\nGlobal Developments.\n  Vehicle emissions regulators continue to focus on the use of “defeat devices.”  Defeat devices are elements of design (typically embedded in software) that improperly cause the emission control system to function less effectively during normal on-road driving than during an official laboratory emissions test, without justification.  They are prohibited by law in many jurisdictions, and we do not use defeat devices in our vehicles.\nRegulators around the world continue to scrutinize automakers’ emission testing, which has led to a number of defeat device settlements by various manufacturers.  EPA is carrying out additional non-standard tests as part of its vehicle certification program.  CARB has also been conducting extensive non-standard emission tests, which in some cases have resulted in certification delays for diesel vehicles.  In the past, several European countries have conducted non-standard emission tests and published the results, and, in some cases, this supplemental testing has triggered investigations of manufacturers for possible defeat devices.  Testing is expected to continue on an ongoing basis, with new testing methods continually under development.  In addition, plaintiffs’ attorneys are pursuing consumer class action lawsuits based on alleged excessive emissions from cars and trucks, which could, in turn, prompt further investigations by regulators.\nEuropean GHG Requirements.\n \nThe European Union regulates passenger car and light commercial vehicle CO\n2\n emissions using sliding scales with different CO\n2 \ntargets for each manufacturer based on the respective average vehicle weight for its fleet of vehicles first registered in a calendar year, with separate targets for passenger cars and light commercial vehicles.  A penalty system applies to manufacturers failing to meet the individual CO\n2\n targets.  Pooling agreements between manufacturers to utilize credits are possible under certain conditions, and Ford has entered into such pooling agreements in order to comply with fuel economy regulations without paying a penalty and to enable other manufacturers to benefit from our positive CO\n2\n performance.  For “multi-stage vehicles” (e.g., Ford’s Transit chassis cabs), the base manufacturer (e.g., Ford) is fully responsible for the CO\n2\n performance of the final up-fitted vehicles.  The initial target levels get significantly more stringent every five years (2025, 2030, and 2035), after which all new passenger cars and light commercial vehicles must be zero emission, requiring significant investments in alternative propulsion technologies and extensive fleet management to enable low CO\n2\n emissions for our fleet.  EU heavy-duty CO\n2\n regulations are being finalized and will also limit CO\n2\n fleet performance, with slightly different requirements.  The United Kingdom and Switzerland have introduced similar rules for light-duty vehicles, and the United Kingdom has adopted a ZEV mandate as well as CO\n2\n fleet limits for non-ZEV vehicles starting in 2024.\nThe EU Commission has introduced mandatory requirements for national authorities to conduct in-service verification testing on vehicles to measure their actual CO\n2\n emissions in the field.  It is also investigating the introduction of Real Driving CO\n2\n and Life Cycle Assessment elements, and heavy-duty vehicles are addressed in separate regulations with analogous requirements and challenges.  As discussed above, the EU Commission has announced a “Green Deal” with more stringent requirements for CO\n2\n emissions (including stricter CO\n2\n fleet regulations) and other regulated emissions and include recycling and substance restrictions.  While the EU Commission targets net climate neutrality by 2050 and an ambitious 2030 interim target (a 55% CO\n2\n reduction across all industries compared to 1990), several countries, such as Germany, have adopted stricter interim targets and earlier net climate neutrality targets.\nFord also faces the risk of advance premium payments for both passenger cars and light commercial vehicles in all European markets due to, for example, unexpected market fluctuations and shorter lead times impacting average fleet performance.   \nThe United Nations developed a technical regulation for passenger car emissions and CO\n2\n.  This world light-duty test procedure (“WLTP”) is focused primarily on better aligning laboratory CO\n2\n and fuel consumption figures with customer-reported figures.  The introduction of WLTP in Europe started in September 2017 and requires updates to CO\n2\n labeling, thereby impacting taxes in countries with a CO\n2\n tax scheme as well as CO\n2\n fleet regulations for passenger cars and light commercial vehicles.  Costs associated with new or incremental testing for WLTP are significant.\n11\nItem 1.  Business (Continued) \nSome European countries have implemented or are considering other initiatives for reducing CO\n2\n vehicle emissions, including fiscal measures and CO\n2\n labeling to address country specific targets associated with the Paris Accord.  For example, the United Kingdom, France, Germany, Spain, Portugal, and the Netherlands, among others, have introduced taxation based on CO\n2\n emissions.  The EU CO\n2\n requirements are likely to trigger further measures.  In addition, delayed vehicle launches and supply shortages, as well as an insufficient charging infrastructure and lower demand for ZEV and low CO\n2\n emission vehicles as certain electric vehicle incentives are reduced or eliminated or for other reasons, can trigger compliance risks in all European markets.\nEuropean regulators are also starting to look beyond tailpipe CO\n2\n emissions with new requirements for battery electric vehicles and life cycle assessments.  For example, the EU Battery Regulation, which came into effect in August 2024, introduces a range of new requirements, including that manufacturers calculate and declare the carbon footprint of their EV batteries and track their environmental performance throughout their life cycles.  Maximum carbon footprint thresholds are expected to be set in 2028.  Compliance with regulations like these will require manufacturers to navigate complex data collection, calculation, and reporting processes.\nIn addition to imposing strict emissions requirements, European regulations are increasingly including other sustainability requirements, such as reporting obligations and supply chain due diligence.  While these regulations are applicable in European jurisdictions, they often apply to global corporations across jurisdictions and require adjustments in corporate processes, policies, and strategies, which may be costly.  For example, the Corporate Sustainability Reporting Directive requires companies to disclose the compatibility of their business model and strategy with limiting global warming to 1.5°C in line with the Paris Agreement.  Companies that fail to comply with these requirements could face significant monetary penalties and suffer reputational harm.\nIn 2023, the EU adopted the Carbon Border Adjustment Mechanism (“CBAM”), which will subject certain imported materials (such as iron, steel, and aluminum) to a carbon levy linked to the carbon price payable on domestic goods under the European Trading Scheme.  The EU CBAM could increase our costs of importing such materials from 2026 onwards and/or limit our ability to import lower cost materials from non-EU countries.  A similar CBAM is expected to be introduced in the United Kingdom in 2027.\nOther National GHG and Fuel Economy Requirements. \n The Canadian federal government regulates vehicle GHG emissions under the Canadian Environmental Protection Act.  A majority of the U.S. EPA light-duty vehicle standards are automatically adopted in Canada by reference to the United States Code of Federal Regulations, with a few standalone administrative elements.  Similarly, heavy-duty vehicle and engine GHG emissions regulations in Canada also incorporate U.S. EPA rules by reference; however, while currently aligned, model year emission targets are standalone in Canada’s heavy-duty vehicle and engine regulations and, therefore, are not automatically updated with any updates to U.S. law.  Ford expects that the federal government in Canada will continue to align its standards with the new EPA standards for the 2027 model year and beyond.  In 2023, the Canadian federal government also published light-duty ZEV sales requirements through amendments to the Passenger Automobile and Light Truck Greenhouse Gas Emission Regulations.  The amendments require annual sales percentages starting with 20% for the 2026 model year to 100% by the 2035 model year.  The provinces of Quebec and British Columbia have regulations requiring that 100% of new vehicle sales be ZEVs by 2035.  Both provinces have also started developing heavy-duty ZEV mandates based on CARB’s standards.  Compliance with ZEV and emissions requirements depends heavily on market conditions that promote consumer preference for EVs, such as technology readiness, purchase incentives, and affordability, as well as the availability and reliability of adequate infrastructure to support vehicle charging.  In addition to the ZEV mandate, Quebec is also developing a regulation to ban the sale of light-duty internal combustion engine vehicles as of 2035.\nRegional governments across the globe have adopted or are considering implementing, and in some cases introducing, emissions regulations that align with CAFE standards.  For example, China’s Corporate Average Fuel Consumption and New Energy Vehicle (“NEV”) Credits Administrative Rules contain fuel consumption requirements as well as credit mandates for NEV passenger vehicles, i.e., plug-in hybrids, electric vehicles, or fuel cell vehicles.  The fuel consumption requirement, which is based on the WLTP, uses a weight-based approach to establish targets, with year-over-year target reductions.  The credit mandates require OEMs to generate a specific amount of NEV credits each year based on a percentage of the OEM’s annual ICE vehicle production or import volume, with the percentage increasing year over year.  China also imposes a national standard governing fuel consumption limits for passenger vehicles that are produced and to be sold domestically in China.  An updated version of this national standard, which will impose more stringent fuel consumption limits, will be implemented in January 2026.  China is also drafting mandatory national standards for limits on electrical energy consumption of battery electric vehicles, which are expected to be implemented in early 2026.  It is also expected that later in 2025, China will start drafting a new national standard imposing electrical energy consumption limits on PHEVs as well.\n12\nItem 1.  Business (Continued) \nSouth American countries are implementing stricter standards for vehicle energy efficiency and sustainability as well. For example, in 2024, Brazil introduced its MOVER Program, which aims to significantly reduce carbon emissions from Brazil’s automotive fleet through financial incentives for investments in sustainable technologies.  In addition to setting stricter fuel economy targets starting in 2027, MOVER mandates new requirements for recyclability and GHG emission reporting. \nAs discussed above and below in Item 1A. Risk Factors under “\nFord may need to substantially modify its product plans and facilities to comply with safety, emissions, fuel economy, autonomous driving technology, environmental, and other regulations,”\n in addition to the rates of EV growth, production disruptions, stop ships, supply chain limitations, lower-than-planned market acceptance of our vehicles, and/or other circumstances may cause us to modify product plans or, in some cases, purchase credits in order to comply with emissions standards, fuel economy standards, or ZEV requirements.\nVehicle Safety\nU.S. Requirements.  \nThe National Traffic and Motor Vehicle Safety Act of 1966 (the “Safety Act”) regulates vehicles and vehicle equipment in two primary ways.  First, the Safety Act prohibits the sale in the United States of any new vehicle or equipment that does not conform to applicable vehicle safety standards established by NHTSA.  Meeting or exceeding many safety standards is costly and has continued to evolve as global compliance requirements and public domain (e.g., New Car Assessment Programs (“NCAPs”), Insurance Institute for Highway Safety (“IIHS”), and the China Insurance Auto Safety Index) ratings and assessments continue to evolve, are increasing in demands, and lack harmonization globally.  As we expand our business priorities to include autonomous vehicle technologies and broader mobility products and services, our financial exposure has increased.  Similarly, federal and state regulatory requirements are growing quickly as lawmakers and regulators adapt to advancements in automation, ranging from driver-assistance technologies such as automatic braking to fully autonomous vehicles.  Autonomous vehicle and driver assist technologies continue to be scrutinized by the government, and actual or perceived failures or misuse of these technologies and features have led to government investigations and inquiries, including of Ford, which has responded to information requests from NHTSA and the National Transportation Safety Board about our hands-free highway driving system, BlueCruise.  Ford and other OEMs are required to report to NHTSA any crashes that meet NHTSA-defined criteria and occur when certain advanced driver assistance system features are in use.  Second, the Safety Act requires that defects related to motor vehicle safety be remedied through safety recall campaigns.  A manufacturer is obligated to recall vehicles if it or NHTSA determines the vehicles contain a non-compliance or a defect resulting in an unreasonable risk to safety.  Should we or NHTSA determine that either a safety defect or noncompliance issue exists with respect to any of our vehicles, the cost of such recall campaigns could be substantial.\nEuropean Requirements. \n The EU has established vehicle safety standards and regulations and is likely to adopt additional or more stringent requirements in the future, especially in the areas of access to in-vehicle data, artificial intelligence, and autonomous vehicle technologies.  \nThe European General Safety Regulation (“GSR”) introduced UN-ECE regulations, which are required for the European Type Approval process.  The GSR includes the mandatory introduction of multiple active and passive safety features, including cybersecurity requirements for all registrations, which began in 2024.  EU regulators are focusing on active safety features, such as lane departure warning systems, electronic stability control, and automatic brake assist.  Electric vehicle safety continues to be an active area of regulation in the EU, with UN-ECE Regulation No. 100 establishing safety requirements for EVs and mandating certain testing of electrical powertrains.  Furthermore, mobile network providers in certain EU Member States have begun shutting down their 2G and 3G networks, which form the basis for e-Call system functionality in existing vehicles.  The e-Call systems in existing vehicles may need to be updated as these systems are phased out.  It is also possible that the EU may mandate Member States to maintain these networks to allow for the continued functionality of existing e-Call systems.\nOther National Requirements. \n Globally, governments generally have been adopting UN-ECE based regulations with minor variations to address local concerns.  Any difference between North American and UN-ECE based regulations can add complexity and costs to the development of global platform vehicles, and we continue to support efforts to harmonize regulations to reduce vehicle design complexity while providing a common level of safety performance; we are seeking new opportunities in bilateral negotiations that can potentially contribute to this goal.\n13\nItem 1.  Business (Continued) \nSafety and recall requirements in Brazil, China, India, South Korea, and Gulf Cooperation Council (“GCC”) countries may add substantial costs and complexity to our global recall practice.  Brazil has set mandatory fleet safety targets and penalties are applied if these levels are not maintained, while a tax reduction may be available for over-performance.  In Canada, regulatory requirements are mostly aligned with U.S. regulations; however, under the Canadian Motor Vehicle Safety Act, the Minister of Transport has broad powers to order manufacturers to submit a notice of defect or non-compliance when the Minister considers it to be in the interest of safety.  In 2021, Canada started preliminary consultations on several new proposed regulations.  Final regulations for Administrative Monetary Penalties took effect in 2023.  Draft regulations for Analysis of Technical Information for Vehicles and Equipment are expected to be released in 2025 and will likely contain some reporting requirements that are unique to Canada.  In China, new standards related to electronic architecture and devices (including e-Call and radio systems) are expected to take effect in 2027 or 2028, and will be more comprehensive than UN-ECE requirements.  Additionally, new mandatory national standards for intelligent connected vehicles governing vehicle information security, software updates, and autonomous driving data recording systems are currently under development in China and will take effect in January 2026.  Similarly, in the Middle East and Southeast Asia, legislators are focusing on regulating driver assistance and autonomous driving technologies, as well as cyber and data security for connected vehicles.  In Malaysia and South Korea, mandatory e-Call requirements are being drafted.  E-Call is mandatory in the UAE for new vehicles, and, following an update to its next generation e-Call regulations, will be required in Saudi Arabia beginning with the 2027 model year.\nNew Car Assessment Programs. \n Organizations around the world rate and compare motor vehicles in NCAPs to provide consumers and businesses with additional information about the safety of new vehicles.  NCAPs use crash tests and other evaluations that are different and often more stringent than what is required by applicable regulations.  Vehicle safety is rated using stars, with five stars awarded for the highest safety rating and one for the lowest.  Achieving high NCAP ratings, which may vary by country or region, can add complexity and cost to vehicles.  Similarly, environmental rating systems exist in various regions, e.g., Green NCAP in Europe.  In China, updated NCAP protocols were implemented in 2024, requiring more stringent assessment methods for both passive and active safety technologies and expanding the scope of such assessments to pick-up trucks and commercial vans.  In Southeast Asia and Latin America, an updated NCAP test and rating protocol is similarly forecast to be effective beginning in 2026 and is expected to put greater emphasis on assessment of driver assistance technologies.  These protocols impose additional requirements relating to testing, evaluation, and mandatory safety features, and compliance with them (or any subsequent updates to them) may be costly.\nHUMAN CAPITAL RESOURCES\nPeople Strategy and Governance\nWe strive to create an employee experience that enables an inclusive environment of excellence, focus, and collaboration among team members, allowing us to deliver short- and long-term business success.  Ford maintains an Executive People Forum consisting of the CEO and top leadership team that meets monthly with a specific focus on people and organizational topics that will enable and accelerate delivery of our Ford+ plan.  Key topic areas include Compensation & Retention; Organization Design; Talent Planning & Development; and Inclusion and Culture.\nOur Board of Directors and Board committees provide important oversight on human capital matters, including items discussed at the Executive People Forum.  The Compensation, Talent and Culture Committee maintains responsibility to review, discuss, and set strategic direction for various people-related business strategies, including:  compensation and benefit programs, leadership succession planning, inclusive culture, and talent development programs.  The Sustainability, Innovation and Policy Committee is responsible for discussing and advising management on maintaining and improving sustainability strategies, the implementation of which creates value consistent with the long-term preservation and enhancement of shareholder value and social wellbeing, including human rights, working conditions, and responsible sourcing.  Collective recommendations to the Board and its committees are an important part of how we proactively manage our human capital and create an employee experience that allows employees and our organization to thrive.\nEmployee Health and Safety\nNothing is more important than the health, safety, and wellbeing of our employees and we consistently strive to achieve world-class levels of safety through the application of sound policies and best practices.  We maintain a robust safety culture designed to reduce workplace injuries, supported by effective communication, reporting, and external benchmarking.  \n14\nItem 1.  Business (Continued) \nWe verify compliance with regulatory requirements as well as our internal safety standards.  To prevent recurrence of workplace injuries, regular updates are provided to Company management on key safety issues, including safety key performance indicators (“KPI”), significant incidents, and high potential near misses.  As a Company, we participate in multi-industry benchmarking groups, within and outside the automotive sector, to share safety best practices and collaborate on common health and safety concerns.\nIn 2024, there were zero employee fatality incidents globally.  Proactive initiatives and leading safety metrics have been implemented as we strive to prevent workplace injuries and reduce risk to our employees and contractors. \nBuilding a Diverse and Inclusive Workplace\nAt Ford, we are committed to supporting and sustaining a respectful and inclusive workplace for all employees.  We believe this empowers every person to do their best work and ultimately achieve the Ford+ plan.  We actively recruit and hire the best talent and are proud that our workforce is made up of people with different backgrounds, perspectives, and experiences so we can deliver the best products and services for our customers around the world.\nFord offers 10 global Employee Resource Groups (“ERGs”) that represent various dimensions of our employee population, including, race, ethnicity, gender, religion, LGBTQ+, disability, veterans, and generation with chapters throughout the world.\n \nAll ERGs are open to all employees and are instrumental in providing a voice to our global workforce, while also providing valuable insights into the employee experience and product and service development.\nWe work to strengthen collaboration across the organization by embedding inclusion in the leadership behaviors that support the Ford operating system.  We also leverage the benefit of diversity by listening to the voices of our employees and stakeholders, which strengthen our workplace, systems, and offerings and ultimately drive value for the business.\nOur workforce statistics include the following as of December 31, 2024:\n \n28.0% of our salaried employees worldwide are women; 25.7% of our total salaried and hourly employees in the United States are women; and 36.5% of our total salaried and hourly employees in the United States are underrepresented racial and ethnic groups.\nTalent Attraction, Growth, and Capability Assessment\nTalent attraction at Ford is evolving with the transformation of our business.  We are sourcing and attracting candidates from multiple industries and regions of the world.  We continue to recruit talent from traditional industries, such as manufacturing and consulting, and have been successful in attracting talent from non-traditional industries, specifically the technology industry.  This is important as we build our expertise in growth areas such as software, electrification, and integrated services.\nFrom a capability perspective, we leverage best practices in assessments and talent management to strengthen our current capabilities and future pipeline while reinforcing a culture of excellence, focus, and collaboration.  The performance management process is reviewed regularly to ensure we set clear expectations, measure individual performance, and reward appropriately.  Our process includes a semi-annual review of each individual’s performance to objectives and demonstration of expected behaviors of excellence, focus, and collaboration.\nFinally, the extent to which our People Leaders are equipped to drive our transformation plays a vital role in our strategy, and we are committed to helping our leaders strengthen their capabilities with dedicated traditional and non-traditional learning opportunities.  Our leadership strategy equips our leaders with the capabilities to deliver business results and grow the talent needed to meet our organizational needs.\nCompetitive Benefit Programs\nWe provide employees with a competitive, comprehensive, and flexible set of benefits and resources to support their financial, social, mental/emotional, physical, and professional health.  Our comprehensive global benefits programs are designed to attract and retain top talent worldwide.  These programs include a wide range of resources and solutions to educate, empower, and support individual and organizational goals while being tailored to local regulations and employee needs across our diverse global workforce.  This comprehensive approach is integral to our total rewards strategy, addressing business and employee challenges through a multi-channel approach that provides diverse populations and global regions with flexible options to meet their specific goals.\n15\nItem 1.  Business (Continued) \nWe use data-driven insights gathered through surveys, focus groups, and claims data to understand employee challenges and prioritize our programs and resources.  Our benefits are regularly reviewed and adjusted to remain competitive within our respective markets and reflect evolving employee expectations.  We are committed to creating an environment where employees and People Leaders care for each other as we deliver Ford+.\nEmployee Sentiment Strategy\nWe gather feedback from our employees through a variety of channels throughout the year.  Our approach is designed to capture sentiment and make it actionable for managers, leadership, and for the teams designing the tools, processes, and policies that impact the employee experience.  We use a mix of annual and real-time surveys designed to understand employee sentiment in areas such as people leader effectiveness, job satisfaction, inclusion, wellbeing, overall satisfaction, strategy and execution, and Ford Operating System behaviors.\nA critical element of measuring sentiment is ensuring the data gets to those who are best positioned to use it to drive improvements in the employee experience.  We design dashboards and tools for managers to view the results from their teams, help them to generate meaningful insights, and convert those insights into guided actions.  We share the results with senior executives to identify broader trends and themes and to inform larger strategic decisions across the Company. \nEmployment Data\nThe approximate number of individuals employed by us and entities that we consolidated as of December 31 was as follows (in thousands):\n2023\n2024\nUnited States\n87 \n87 \nRest of World\n84 \n78 \nCompany excluding Ford Credit\n171 \n165 \nFord Credit\n6 \n6 \nTotal Company\n177 \n171 \nIn the United States, approximately 99% of our unionized hourly employees are covered by collective bargaining agreements and represented by the International Union, United Automobile, Aerospace and Agricultural Implement Workers of America (“UAW” or “United Auto Workers”).  At December 31, 2024, approximately 56,500 hourly employees in the United States were represented by the UAW.\n16",
  "item7": "Item 7\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n41\nKey Trends and Economic Factors Affecting Ford and the Automotive Industry\n41\nResults of Operations - 2024\n44\nFord Blue Segment\n46\nFord Model e Segment\n47\nFord Pro Segment\n47\nFord Next Segment\n49\nFord Credit Segment\n49\nCorporate Other\n52\nInterest on Debt\n52\nTaxes\n52\nResults of Operations - 2023\n53\nFord Blue Segment\n55\nFord Model e Segment\n56\nFord Pro Segment\n56\nFord Next Segment\n57\nFord Credit Segment\n57\nCorporate Other\n58\nInterest on Debt\n58\nTaxes\n58\nLiquidity and Capital Resources\n59\nCredit Ratings\n71\nOutlook\n72\nCautionary Note on Forward-Looking Statements\n73\nNon-GAAP Financial Measures That Supplement GAAP Measures\n75\nTable of Contents\n(continued)\nNon-GAAP Financial Measure Reconciliations\n77\n2024 Supplemental Financial Information\n79\nCritical Accounting Estimates\n83\nAccounting Standards Issued But Not Yet Adopted\n90",
  "item2": null
}