{
  "source_file": "fang-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis should be read in conjunction with our unaudited condensed consolidated financial statements and notes thereto presented in this report as well as our audited financial statements and notes thereto included in our \nAnnual Report on Form 10-K\n for the year ended December 31, 2024. The following discussion contains “forward-looking statements” that reflect our future plans, estimates, beliefs and expected performance. Actual results and the timing of events may differ materially from those contained in these forward-looking statements due to a number of factors. See \nPart II. Item 1A. Risk Factors\n and \nCautionary Statement Regarding Forward-Looking Statements\n.\nOverview\nWe are an independent oil and natural gas company currently focused on the acquisition, development, exploration and exploitation of unconventional, onshore oil and natural gas reserves in the Permian Basin in West Texas. As discussed in Note 1—\nDescription of the Business and Basis of Presentation\n and Note 18—\nSegment Information\n of the notes to the condensed consolidated financial statements, as of September 30, 2025, we have one reportable segment, the upstream segment.\nThird Quarter 2025 Financial and Operating Highlights\n•\nRecorded net income of $1.0 billion.\n•\nPaid dividends to stockholders of $289 million during the third quarter of 2025 and declared a base cash dividend payable in the fourth quarter of 2025 of $1.00 per share of common stock.\n•\nIncreased our common stock repurchase program authorization to $8.0 billion, excluding excise taxes, repurchased $603 million of our common stock, excluding excise taxes, and had approximately $3.1 billion available for future repurchases under our common stock repurchase program at September 30, 2025.\n•\nOur cash operating costs were $10.05 per BOE, including lease operating expenses of $5.65 per BOE, cash general and administrative expenses of $0.55 per BOE and production and ad valorem taxes of $2.44 per BOE and gathering, processing and transportation expenses of $1.41 per BOE.\n•\nOur average production was 942.9 MBOE/d.\n•\nDrilled 107 gross horizontal wells in the Midland Basin and one gross horizontal well in the Delaware Basin and turned 137 gross operated horizontal wells (137 in the Midland Basin and none in the Delaware Basin) to production.\n•\nCash capital expenditures, excluding acquisitions, were $774 million.\nTransactions and Recent Developments\nAcquisitions and Divestitures\nDiamondback Divestitures\nEPIC Divestiture\nOn October 31, 2025, we divested our 27.5% equity interest in EPIC pursuant to a definitive purchase and sale agreement with Plains for approximately $504 million in cash and an additional $96 million in contingent consideration. On October 31, 2025, we used $500 million of the cash proceeds received from the EPIC Divestiture to partially repay principal borrowings under the Company’s 2025 Term Loan.\nDivestiture of Water Assets to Deep Blue\nOn October 1, 2025, we divested EDS to Deep Blue, which was originally acquired in connection with the Endeavor Acquisition, in exchange for upfront net cash proceeds of $694 million and the potential for us to earn up to an additional $200 million in contingent consideration based on the achievement of certain completion thresholds for the years 2026 through 2028. As part of the divestiture, the Company renewed its 15-year dedication to Deep Blue for its produced water and supply water within a 12-county area of mutual interest in the Midland Basin. The cash proceeds from the divestiture were used to repay borrowings under the Credit Agreement and for general corporate purposes.\n34\nTable of Contents\nViper Acquisitions and Divestitures\nPending Viper Divestiture of Non-Permian Assets\nOn October 30, 2025, Viper entered into an equity interest purchase agreement to divest all its non-Permian assets, including those acquired from Sitio, for a purchase price of approximately $670 million, subject to customary purchase price adjustments. The properties to be divested consist of approximately 9,400 net royalty acres in the Denver-Julesburg, Eagle Ford and Williston basins with current production of approximately 4,750 BO/d. The Pending Viper Non-Permian Divestiture is subject to customary closing conditions and is expected to close in the first quarter of 2026.\nSitio Acquisition\nOn August 19, 2025, Viper and Viper LLC completed the Sitio Acquisition in an all-equity transaction valued at approximately $4.0 billion, subject to further adjustments for transaction costs and certain customary post-closing adjustments, including the retirement of Sitio’s net debt of $1.2 billion. The mineral and royalty interests acquired in the Sitio Acquisition represent approximately 25,300 net royalty acres in the Permian Basin and approximately 9,000 net royalty acres in the Denver-Julesburg, Eagle Ford and Williston basins, for total acreage of approximately 34,300 net royalty acres.\nCapital Transactions\nViper 2025 Notes Offering and Redemption of Notes\nOn July 23, 2025, Viper LLC issued the Viper 2025 Notes for an aggregate principal amount of $1.6 billion. Viper used a portion of the net proceeds from the issuance of the Viper 2025 Notes to redeem or satisfy and discharge, as applicable, approximately $780 million in aggregate principal amount of their previously outstanding senior notes, including accrued interest paid and redemption premiums. The Viper 2027 Notes were subsequently redeemed in full on November 1, 2025. Viper used the remaining net proceeds (i) to retire Sitio’s 7.875% senior notes due 2028, (ii) to repay borrowings under Sitio’s revolving credit facility, (iii) to pay fees, costs and expenses related to the redemption or repayment of such debt, and (iv) for general corporate purposes. \nViper Term Loan\nIn connection with the closing of the Sitio Acquisition, Viper LLC entered into the $500 million Viper Term Loan, which Viper drew in a single borrowing to partially fund the retirement of Sitio’s debt.\nSee Note 9—\nDebt\n of the notes to the condensed consolidated financial statements for further discussion of the capital transactions above.\nRetirement of Notes\nIn the fourth quarter of 2025, we opportunistically repurchased principal amounts of $152 million of our 4.400% Senior Notes due 2051 and $51 million of our 4.250% Senior Notes due 2052 in open market transactions for total cash consideration of $167 million, including accrued interest paid, at an average of 82.3% of par value.\nSee Note 4—\nAcquisitions and Divestitures\n and Note 17—\nSubsequent Events\n of the notes to the condensed consolidated financial statements for further discussion of the transactions above.\nCommodity Prices and Impairment\nPrices for oil, natural gas and natural gas liquids are determined primarily by prevailing market conditions. Regional and worldwide economic activity, changes in trade or other government policies or regulations, including with respect to tariffs or other trade barriers, and any resulting trade tensions, extreme weather conditions and other substantially variable factors influence market conditions for these products. These factors are beyond our control and are difficult to predict. During the first nine months of 2025 and 2024, WTI prices averaged $66.65 and $77.61 per Bbl, respectively, and Henry Hub prices averaged $3.48 and $2.22 per MMBtu, respectively.\n35\nTable of Contents\nGiven the overall decline in SEC Prices through the first three quarters of 2025 and into the fourth quarter of 2025 as compared to 2024, we believe a material non-cash impairment of our assets is reasonably likely to occur in the fourth quarter of 2025. In addition to commodity prices, our production rates, levels of proved reserves, future development costs, transfers of unevaluated properties, income tax rate assumptions and other factors will determine our actual ceiling test calculation and impairment analysis in future periods. Based on the number of factors that may impact our future estimate of proved reserves, we are currently unable to determine an estimate of the amount or range of amounts of any potential impairment charge in the fourth quarter of 2025. Impairment charges affect our results of operations but do not reduce our cash flow.\nFor additional information around risks related to commodity prices, see \nPart II. Item 3. Quantitative and Qualitative Disclosures About Market Risk—Commodity Price Risk\n.\nUpstream Operations\nOur activities are primarily directed at the horizontal development of the Wolfcamp and Spraberry formations in the Midland Basin and the Wolfcamp and Bone Spring formations in the Delaware Basin within the Permian Basin. Additionally, our publicly-traded subsidiary, Viper, is focused on owning and acquiring mineral interests and royalty interests in oil and natural gas properties primarily in the Permian Basin and derives royalty income and lease bonus income from such interests.\nAs of September 30, 2025, we had approximately 862,019 net acres in the Permian Basin, which primarily consisted of approximately 751,146 net acres in the Midland Basin and 110,873 net acres in the Delaware Basin.\nThe following table sets forth the total number of operated horizontal wells drilled and completed during the periods indicated:\nThree Months Ended September 30, 2025\nNine Months Ended September 30, 2025\nDrilled\nCompleted\n(1)\nDrilled\nCompleted\n(2)\nArea:\nGross\nNet\nGross\nNet\nGross\nNet\nGross\nNet\nMidland Basin\n107 \n97 \n137 \n127 \n352 \n326 \n361 \n342 \nDelaware Basin\n1 \n1 \n— \n— \n4 \n4 \n15 \n13 \nTotal\n108 \n98 \n137 \n127 \n356 \n330 \n376 \n355 \n(1)\nThe average lateral length for the wells completed during the third quarter of 2025 was 11,020 feet. Operated completions during the third quarter of 2025 consisted of 28 Lower Spraberry wells, 27 Wolfcamp A wells, 27 Wolfcamp B wells, 26 Jo Mill wells, 11 Middle Spraberry wells, 10 Dean wells, four Barnett wells, three Upper Spraberry wells and one Wolfcamp D.\n(2)\nThe average lateral length for the wells completed during the nine months ended September 30, 2025, was 12,060 feet. Operated completions during the nine months ended September 30, 2025, consisted of 80 Wolfcamp B wells, 77 Lower Spraberry wells, 71 Wolfcamp A wells, 54 Jo Mill wells, 32 Middle Spraberry wells, 22 Dean wells, 13 Upper Spraberry wells, 10 Barnett wells, eight Third Bone Spring wells, seven Wolfcamp D wells and two Second Bone Spring wells.\nAs of September 30, 2025, we operated the following wells:\nAs of September 30, 2025\nVertical Wells\nHorizontal Wells\nTotal\nArea:\nGross\nNet\nGross\nNet\nGross\nNet\nMidland Basin\n4,437 \n4,216 \n4,744 \n4,441 \n9,181 \n8,657 \nDelaware Basin\n105 \n93 \n516 \n477 \n621 \n570 \nTotal\n4,542 \n4,309 \n5,260 \n4,918 \n9,802 \n9,227 \nAs of September 30, 2025, we and Viper held interests in 54,868 gross (9,571 net) wells, including 1,988 gross (332 net) wells in which we have a non-operated working interest.\nConsistent with our previously announced expected levels of activity for the remainder of 2025, we ran 13 rigs and five completion crews during the third quarter of 2025 to execute on our capital and operating plan, including holding oil production volumes relatively flat. While our development plan during the first two quarters of 2025 had reduced capital expenditure budgets compared to our original 2025 guidance, capital expenditures are expected to increase moderately in the fourth quarter of 2025 as part of our effort to hold oil production relatively flat. A core tenet of our plan to remain disciplined on our expenditures and moderating oil production is maximizing the consistency of our ability to operate efficiently at scale.\n36\nTable of Contents\nGuidance\nOur revised development plan is presented below. Under the revised development plan, we target maintaining maximum operational flexibility in anticipation of the market revealing a stronger signal regarding the future of commodity prices. We currently plan to continue moderating oil production volumes through the end of 2025, while also improving per share metrics through increased efficiency and the use of our enhanced stock repurchase plan. As a result, we are raising our annual BOE guidance by approximately 2%, primarily to reflect the successful closing of the Sitio merger, coupled with continued improvements in gas capture efficiency. Additionally, we expect to reduce our debt in the fourth quarter of 2025 through the generation of cash flow from operations as well as from proceeds from the divestiture of non-core assets.\nThe following table presents our updated estimates of certain financial and operating results for the full year of 2025 and the fourth quarter of 2025:\n2025 Guidance\nNet production - MBOE/d\n910 - 920 (from 890 - 910)\nOil production - MBO/d\n495 - 498 (from 485 - 492)\nQ4 2025 oil production - MBO/d (total - MBOE/d)\n505 - 515 (927 - 963)\n(Unit costs $/BOE):\nLease operating expenses, including workovers\n$5.40 - $5.70 (from $5.30 - $5.70)\nGeneral and administrative expenses - cash\n$0.60 - $0.75\nNon-cash stock-based compensation\n$0.25 - $0.35\nDepreciation, depletion, amortization and accretion\n$14.50 - $15.50 \nInterest expense (net of interest income)\n$0.60 - $0.80 \nGathering, processing and transportation\n$1.45 - $1.60 (from $1.60 - $1.75)\nProduction and ad valorem taxes (% of revenue)\n~7%\nQ4 2025 cash taxes (in millions)\n(1)(2)\n$270 - $350\n(1)\nIncludes approximately $175 million in tax impacts from asset divestitures in the fourth quarter.\n(2)\nIncludes estimated favorable impact on the year-to-date period of tax legislation enacted in the third quarter.\n37\nTable of Contents\nResults of Operations\nComparison of the Three Months Ended September 30, 2025, and June 30, 2025\nAs noted in “\n—\nCommodity Prices\n,\n” the markets for oil and natural gas are highly volatile and are influenced by a number of factors which can lead to significant changes in our results of operations and management’s operational strategy on a quarterly basis. Accordingly, our results of operations discussion focuses on a comparison of the current quarter’s results of operations with those of the immediately preceding quarter. We believe our discussion provides investors with a more meaningful analysis of material operational and financial changes which occurred during the quarter based on current market and operational trends.\nThe following table sets forth selected operating data for the periods indicated:\nThree Months Ended\nSeptember 30, 2025\nJune 30, 2025\nRevenues (In millions):\nOil sales\n$\n2,994 \n$\n2,852 \nNatural gas sales\n87 \n97 \nNatural gas liquid sales\n366 \n367 \nTotal oil, natural gas and natural gas liquid revenues\n$\n3,447 \n$\n3,316 \nProduction Data:\nOil (MBbls)\n46,345 \n45,108 \nNatural gas (MMcf)\n115,353 \n110,119 \nNatural gas liquids (MBbls)\n21,180 \n20,248 \nCombined volumes (MBOE)\n(1)\n86,751 \n83,709 \nDaily oil volumes (BO/d)\n503,750 \n495,692 \nDaily combined volumes (BOE/d)\n942,946 \n919,879 \nAverage Prices:\nOil ($ per Bbl)\n$\n64.60 \n$\n63.23 \nNatural gas ($ per Mcf)\n$\n0.75 \n$\n0.88 \nNatural gas liquids ($ per Bbl)\n$\n17.28 \n$\n18.13 \nCombined ($ per BOE)\n$\n39.73 \n$\n39.61 \nOil, hedged ($ per Bbl)\n(2)\n$\n63.70 \n$\n62.34 \nNatural gas, hedged ($ per Mcf)\n(2)\n$\n1.75 \n$\n1.45 \nNatural gas liquids, hedged ($ per Bbl)\n(2)\n$\n17.28 \n$\n18.13 \nAverage price, hedged ($ per BOE)\n(2)\n$\n40.58 \n$\n39.89 \n(1)\nBbl equivalents are calculated using a conversion rate of six Mcf per Bbl.\n(2)\nHedged prices reflect the effect of our commodity derivative transactions on our average sales prices and include gains and losses on cash settlements for matured commodity derivatives, which we do not designate for hedge accounting. Hedged prices exclude gains or losses resulting from the early settlement of commodity derivative contracts.\nProduction Data. \nSubstantially all of our revenues are generated through the sale of oil, natural gas and natural gas liquids production. The following tables provide information on the mix of our production for the periods indicated:\nThree Months Ended\nSeptember 30, 2025\nJune 30, 2025\nOil (MBbls)\n54 \n%\n54 \n%\nNatural gas (MMcf)\n22 \n22 \nNatural gas liquids (MBbls)\n24 \n24 \n100 \n%\n100 \n%\n38\nTable of Contents\nThree Months Ended September 30, 2025\nThree Months Ended June 30, 2025\nMidland Basin\nDelaware Basin\nOther\nTotal\nMidland Basin\nDelaware Basin\nOther\nTotal\nProduction Data:\nOil (MBbls)\n42,979 \n3,322 \n44 \n46,345 \n41,639 \n3,417 \n52 \n45,108 \nNatural gas (MMcf)\n107,507 \n7,807 \n39 \n115,353 \n100,981 \n8,785 \n353 \n110,119 \nNatural gas liquids (MBbls)\n19,927 \n1,227 \n26 \n21,180 \n18,846 \n1,390 \n12 \n20,248 \nTotal (MBOE)\n80,824 \n5,850 \n77 \n86,751 \n77,315 \n6,271 \n123 \n83,709 \nOil, Natural Gas and Natural Gas Liquids Revenues.\n Our revenues are a function of oil, natural gas and natural gas liquids production volumes sold and average sales prices received for those volumes.\nOur oil, natural gas and natural gas liquids revenues for the third quarter of 2025 increased by $131 million to $3.4 billion compared to the second quarter of 2025. The increase consisted of $100 million attributable to the 4% growth in our combined production volumes, and $31 million attributable to higher average prices received primarily for our oil production.\nApproximately 53% of the increase in our combined production volumes is attributable to Viper’s Sitio Acquisition. The remainder of production growth is largely attributable to new wells added between periods.\nNet Sales of Purchased Oil\n. We have entered into purchase transactions and separate sales transactions with third parties to satisfy certain of our unused oil pipeline capacity commitments. The following table presents the net sales of purchased oil from third parties for the periods indicated:\nThree Months Ended\n(In millions)\nSeptember 30, 2025\nJune 30, 2025\nSales of purchased oil\n$\n459 \n$\n335 \nPurchased oil expense\n455 \n331 \nNet sales of purchased oil\n$\n4 \n$\n4 \nOther Revenues.\n The following table presents other insignificant revenue for the periods indicated:\nThree Months Ended\n(In millions)\nSeptember 30, 2025\nJune 30, 2025\nOther operating income\n$\n18 \n$\n27 \nLease Operating Expenses.\n The following table shows lease operating expenses for the periods indicated:\nThree Months Ended\nSeptember 30, 2025\nJune 30, 2025\n(In millions, except per BOE amounts)\nAmount\nPer BOE\nAmount\nPer BOE\nLease operating expenses\n$\n490 \n$\n5.65 \n$\n440 \n$\n5.26 \nLease operating expenses increased for the third quarter of 2025 compared to the second quarter of 2025 primarily due to $14 million in additional electrical generation and artificial lift costs and $10 million in additional well workover costs. The remainder of the change is primarily due to the second quarter of 2025 including reductions in prior period water disposal cost estimates for properties acquired in the Endeavor Acquisition.\n39\nTable of Contents\nProduction and Ad Valorem Tax Expense.\n The following table shows production and ad valorem tax expense for the periods indicated:\nThree Months Ended\nSeptember 30, 2025\nJune 30, 2025\n(In millions, except per BOE amounts)\nAmount\nPer BOE\nPercentage of oil, natural gas and natural gas liquids revenue\nAmount\nPer BOE\nPercentage of oil, natural gas and natural gas liquids revenue\nProduction taxes\n$\n163 \n$\n1.88 \n4.8 \n%\n$\n156 \n$\n1.86 \n4.7 \n%\nAd valorem taxes\n49 \n0.56 \n1.4 \n58 \n0.70 \n1.8 \nTotal production and ad valorem expense\n$\n212 \n$\n2.44 \n6.2 \n%\n$\n214 \n$\n2.56 \n6.5 \n%\nIn general, production taxes are directly related to production revenues and are based upon current year commodity prices. Production taxes as a percentage of oil, natural gas and natural gas liquids revenue remained consistent from the second quarter of 2025 to the third quarter of 2025.\nAd valorem taxes are based, among other factors, on property values driven by prior year commodity prices. Ad valorem taxes during the third quarter of 2025 compared to the second quarter of 2025 reflect a $14 million reduction to the accrual for 2024 based on actual assessments received in the third quarter of 2025 and other individually insignificant changes, which were partially offset by a $2 million increase related to properties acquired in Viper’s Sitio Acquisition.\nGathering, Processing and Transportation Expense.\n The following table shows gathering, processing and transportation expenses for the periods indicated:\nThree Months Ended\nSeptember 30, 2025\nJune 30, 2025\n(In millions, except per BOE amounts)\nAmount\nPer BOE\nAmount\nPer BOE\nGathering, processing and transportation\n$\n122 \n$\n1.41 \n$\n145 \n$\n1.73 \nThe decrease in gathering, processing and transportation expenses primarily reflects a net reduction of $22 million due primarily to the second quarter of 2025 including $11 million of gathering and transportation charges related to the Double Eagle Acquisition, which were subsequently reclassified to revenue in the third quarter of 2025 as we integrated and conformed contracts to the Company’s financial statement presentation and other individually insignificant items.\nDepreciation, Depletion, Amortization and Accretion.\n The following table provides the components of our depreciation, depletion, amortization and accretion expense for the periods indicated:\nThree Months Ended\n(In millions, except BOE amounts)\nSeptember 30, 2025\nJune 30, 2025\nDepletion of proved oil and natural gas properties\n$\n1,250 \n$\n1,230 \nDepreciation and amortization of other property and equipment\n24 \n23 \nOther amortization\n3 \n4 \nAsset retirement obligation accretion\n9 \n9 \nDepreciation, depletion, amortization and accretion\n$\n1,286 \n$\n1,266 \nOil and natural gas properties depletion rate per BOE\n$\n14.41 \n$\n14.69 \nDepreciation, depletion, amortization and accretion per BOE\n$\n14.82 \n$\n15.12 \n40\nTable of Contents\nGeneral and Administrative Expenses.\n The following table shows general and administrative expenses for the periods indicated:\nThree Months Ended\nSeptember 30, 2025\nJune 30, 2025\n(In millions, except per BOE amounts)\nAmount\nPer BOE\nAmount\nPer BOE\nGeneral and administrative expenses\n$\n48 \n$\n0.55 \n$\n46 \n$\n0.55 \nNon-cash stock-based compensation\n22 \n0.25 \n21 \n0.25 \nTotal general and administrative expenses\n$\n70 \n$\n0.80 \n$\n67 \n$\n0.80 \nOther Operating Costs and Expenses.\n The following table shows other operating costs and expenses for the periods indicated:\nThree Months Ended\n(In millions)\nSeptember 30, 2025\nJune 30, 2025\nMerger and transaction expenses\n$\n17 \n$\n40 \nOther operating expenses\n$\n36 \n$\n36 \nMerger and transaction expenses for the third quarter of 2025 primarily consisted of (i) approximately $15 million of employee severance payments made in connection with Viper’s Sitio Acquisition, and (ii) other individually insignificant items. Merger and transaction expenses for the second quarter of 2025 primarily consisted of (i) $29 million of advisory, legal and filing fees related to the 2025 Drop Down, and (ii) $13 million of employee severance and other costs incurred in connection with the Endeavor Acquisition. \nDerivative Instruments.\n The following table shows the net gain (loss) on derivative instruments and the net cash receipts (payments) on settlements of derivative instruments for the periods indicated:\nThree Months Ended\n(In millions)\nSeptember 30, 2025\nJune 30, 2025\nGain (loss) on derivative instruments, net\n(1)\n$\n120 \n$\n(197)\nNet cash received (paid) on settlements\n(1)\n$\n60 \n$\n(37)\n(1)\nThe three months ended September 30, 2025, and June 30, 2025, include cash paid on interest rate swaps terminated prior to their contractual maturity of $15 million, and $52 million, respectively.\nThe change from a loss to a gain on derivative instruments for the third quarter of 2025 compared to the second quarter of 2025 primarily reflects (i) a $330 million increase in the value of our unsettled natural gas contracts due to a decrease in market prices for natural gas compared to our contract prices, (ii) a $51 million increase in cash received on the settlement of natural gas contracts, (iii) a $37 million reduction in cash payments made to partially terminate $150 million of notional amount of our interest rate swaps during the third quarter of 2025 compared to partially terminating $450 million of notional amount of interest rate swaps during the second quarter of 2025, and (iv) other individually insignificant changes. These gains were partially offset by losses attributable to (i) a $64 million decrease in the value of our unsettled oil contracts due to an increase in market prices for oil compared to our contract prices, and (ii) a $53 million reduction in the value of our remaining interest rate swap contracts due to the early termination of additional notional value discussed above.\nSee Note 13—\nDerivatives\n of the notes to the condensed consolidated financial statements for further details regarding our derivative instruments.\nOther Income (Expense).\n The following table shows other income and expenses for the periods indicated:\nThree Months Ended\n(In millions)\nSeptember 30, 2025\nJune 30, 2025\nInterest expense, net\n$\n(70)\n$\n(56)\nOther income (expense), net\n$\n108 \n$\n(2)\nGain (loss) on extinguishment of debt\n$\n(32)\n$\n55 \nIncome (loss) from equity investments, net\n$\n8 \n$\n4 \n41\nTable of Contents\nThe increase in interest expense, net for the third quarter of 2025 compared to the second quarter of 2025 primarily consists of (i) $16 million from the Viper 2025 Notes issued in July 2025, (ii) an $8 million decrease in capitalized interest costs, which increased interest expense, and (iii) $3 million of interest expense on the Viper Term Loan issued in connection with Viper’s Sitio Acquisition. These increases were partially offset by reductions of (i) $6 million attributable to Viper’s redemption of the Viper 2031 Notes, (ii) $5 million attributable to the repayment of the Tranche A Loans in May 2025, (iii) $5 million on the Company’s revolving credit facility due to lower average outstanding borrowings during the third quarter of 2025, and (iv) other individually insignificant changes.\nSee Note 9—\nDebt\n of the notes to the condensed consolidated financial statements for further details regarding outstanding borrowings.\nThe increase in other income (expense), net for the third quarter of 2025 compared to the second quarter of 2025 is primarily due to the third quarter of 2025 including (i) a $99 million gain on the sale of an equity method investment, (ii) a net gain of $23 million related to the receipt of additional proceeds in connection with the WTG Midstream Transaction, and (iii) other individually insignificant offsetting items.\nSee Note 4—\nAcquisitions and Divestitures\n of the notes to the condensed consolidated financial statements for further details regarding the Company’s divestiture activity.\nThe loss on extinguishment of debt in the third quarter of 2025 of $32 million was recorded on the redemption of the Viper 2031 Notes. The gain on extinguishment of debt in the second quarter of 2025 is due to the Company opportunistically repurchasing an aggregate principal amount of $252 million of its senior notes for total cash consideration, including accrued interest paid, of approximately $196 million.\nSee Note 9—\nDebt\n of the notes to the condensed consolidated financial statements for further details regarding the Company’s retirement of a portion of its senior notes during the third quarter of 2025.\nProvision for (Benefit from) Income Taxes. \nThe following table shows the provision for (benefit from) income taxes for the periods indicated:\nThree Months Ended\n(In millions)\nSeptember 30, 2025\nJune 30, 2025\nProvision for (benefit from) income taxes\n$\n287 \n$\n204 \nThe change in our income tax provision for the third quarter of 2025 compared to the second quarter of 2025 was primarily due to the increase in pre-tax income between the periods which resulted largely from gains on derivative contracts and gains on the divestiture of equity method investments recorded during the third quarter of 2025 as discussed above. See Note 12—\nIncome Taxes\n of the notes to the condensed consolidated financial statements for further discussion of our income tax expense.\n42\nTable of Contents\nComparison of the Nine Months Ended September 30, 2025, and 2024\nThe following table sets forth selected operating data for the periods indicated:\nNine Months Ended September 30,\n2025\n2024\nRevenues (In millions):\nOil sales\n$\n8,885 \n$\n6,025 \nNatural gas sales\n396 \n38 \nNatural gas liquid sales\n1,139 \n566 \nTotal oil, natural gas and natural gas liquid revenues\n$\n10,420 \n$\n6,629 \nProduction Data:\nOil (MBbls)\n134,288 \n79,540 \nNatural gas (MMcf)\n326,050 \n168,431 \nNatural gas liquids (MBbls)\n58,389 \n30,085 \nCombined volumes (MBOE)\n(1)\n247,019 \n137,697 \nDaily oil volumes (BO/d)\n491,897 \n290,292 \nDaily combined volumes (BOE/d)\n904,832 \n502,544 \nAverage Prices:\nOil ($ per Bbl)\n$\n66.16 \n$\n75.75 \nNatural gas ($ per Mcf)\n$\n1.21 \n$\n0.23 \nNatural gas liquids ($ per Bbl)\n$\n19.51 \n$\n18.81 \nCombined ($ per BOE)\n$\n42.18 \n$\n48.14 \nOil, hedged ($ per Bbl)\n(2)\n$\n65.27 \n$\n74.86 \nNatural gas, hedged ($ per Mcf)\n(2)\n$\n2.14 \n$\n0.96 \nNatural gas liquids, hedged ($ per Bbl)\n(2)\n$\n19.51 \n$\n18.81 \nAverage price, hedged ($ per BOE)\n(2)\n$\n42.92 \n$\n48.53 \n(1)\nBbl equivalents are calculated using a conversion rate of six Mcf per Bbl.\n(2)\nHedged prices reflect the effect of our commodity derivative transactions on our average sales prices and include gains and losses on cash settlements for matured commodity derivatives, which we do not designate for hedge accounting. Hedged prices exclude gains or losses resulting from the early settlement of commodity derivative contracts.\nProduction Data. \nSubstantially all of our revenues are generated through the sale of oil, natural gas and natural gas liquids production. The following tables set forth the mix of our production data by product and basin for the periods indicated:\nNine Months Ended September 30,\n2025\n2024\nOil (MBbls)\n54 \n%\n58 \n%\nNatural gas (MMcf)\n22 \n20 \nNatural gas liquids (MBbls)\n24 \n22 \n100 \n%\n100 \n%\n43\nTable of Contents\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nMidland Basin\nDelaware Basin\nOther\nTotal\nMidland Basin\nDelaware Basin\nOther\nTotal\nProduction Data:\nOil (MBbls)\n123,959 \n10,199 \n130 \n134,288 \n65,741 \n13,722 \n77 \n79,540 \nNatural gas (MMcf)\n298,829 \n26,553 \n668 \n326,050 \n128,978 \n39,033 \n420 \n168,431 \nNatural gas liquids (MBbls)\n54,542 \n3,772 \n75 \n58,389 \n24,008 \n6,043 \n34 \n30,085 \nTotal (MBOE)\n228,306 \n18,397 \n316 \n247,019 \n111,245 \n26,271 \n181 \n137,697 \nOil, Natural Gas and Natural Gas Liquids Revenues.\n Our revenues are a function of oil, natural gas and natural gas liquids production volumes sold and average sales prices received for those volumes.\nOur oil, natural gas and natural gas liquids revenues for the nine months ended September 30, 2025, increased by $3.8 billion, or 57%, to $10.4 billion from the same period in 2024 primarily due to a $4.7 billion increase driven by the 79% growth in our combined production volumes. This increase was partially offset by a net reduction of $924 million primarily due to lower average prices received for our oil production for the nine months ended September 30, 2025. \nApproximately 56% of the increase in our combined production volumes is attributable to the Endeavor Acquisition and 8% is attributable to the Double Eagle Acquisition. The remainder of production growth is largely attributable to new wells added between periods.\nNet Sales of Purchased Oil\n. We entered into purchase transactions and separate sale transactions with third parties to satisfy certain of our unused oil pipeline capacity commitments. The following table presents the net sales of purchased oil from third parties for the periods indicated:\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nSales of purchased oil\n$\n1,168 \n$\n698 \nPurchased oil expense\n1,168 \n696 \nNet sales of purchased oil\n$\n— \n$\n2 \nOther Revenues.\n The following table shows the other revenues for the periods indicated:\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nOther operating income\n$\n62 \n$\n28 \nOther operating income increased for the nine months ended September 30, 2025, compared to the same period in 2024 primarily due to (i) recording $30 million in midstream and service revenues attributable to assets acquired in the Endeavor Acquisition, and (ii) a $17 million increase in lease bonus income received during 2025. These increases were partially offset by a $13 million reduction in midstream revenues following the divestiture of certain midstream assets in connection with the TRP Exchange that closed in the fourth quarter of 2024.\nLease Operating Expenses.\n The following table shows lease operating expenses for the periods indicated:\nNine Months Ended September 30,\n2025\n2024\n(In millions, except per BOE amounts)\nAmount\nPer BOE\nAmount\nPer BOE\nLease operating expenses\n$\n1,338 \n$\n5.42 \n$\n825 \n$\n5.99 \nLease operating expenses increased for the nine months ended September 30, 2025, compared to the same period in 2024 primarily due to (i) $368 million of costs associated with operating wells acquired in the Endeavor Acquisition, (ii) an additional $55 million of costs from higher legacy production volumes, (iii) $44 million in additional well workover costs, (iv) $34 million of costs attributable to operating wells acquired in the Double Eagle Acquisition, (v) a $25 million increase in maintenance costs, and (vi) individually insignificant offsetting changes. The decrease in the overall rate per BOE for the nine \n44\nTable of Contents\nmonths ended September 30, 2025, compared to the same period in 2024 was primarily the result of lower disposal costs associated with properties acquired in connection with the Endeavor Acquisition and the Double Eagle Acquisition.\nProduction and Ad Valorem Tax Expense.\n The following table shows production and ad valorem tax expense for the periods indicated:\nNine Months Ended September 30,\n2025\n2024\n(In millions, except per BOE amounts)\nAmount\nPer BOE\nPercentage of oil, natural gas and natural gas liquids revenue\nAmount\nPer BOE\nPercentage of oil, natural gas and natural gas liquids revenue\nProduction taxes\n$\n490 \n$\n1.98 \n4.7 \n%\n$\n294 \n$\n2.14 \n4.4 \n%\nAd valorem taxes\n164 \n0.67 \n1.6 \n119 \n0.86 \n1.8 \nTotal production and ad valorem expense\n$\n654 \n$\n2.65 \n6.3 \n%\n$\n413 \n$\n3.00 \n6.2 \n%\nIn general, production taxes are directly related to production revenues and are based upon current year commodity prices. Production taxes as a percentage of revenue from sales of oil, natural gas and natural gas liquids increased in 2025 compared to 2024 due primarily to the 2024 period including a $17 million refund for the settlement of an audit, which reduced production taxes in the prior year period.\nAd valorem taxes are based, among other factors, on property values driven by prior year commodity prices. Ad valorem taxes for the nine months ended September 30, 2025, as compared to the same period in 2024 increased by $45 million, primarily due to additional taxes incurred on properties acquired since September 30, 2024. The rate of ad valorem taxes per BOE and as a percentage of revenue declined due to a reduction in expected ad valorem tax rates on legacy properties for 2025 compared to the rates during 2024.\nGathering, Processing and Transportation Expense.\n The following table shows gathering, processing and transportation expenses for the periods indicated:\nNine Months Ended September 30,\n2025\n2024\n(In millions, except per BOE amounts)\nAmount\nPer BOE\nAmount\nPer BOE\nGathering, processing and transportation\n$\n378 \n$\n1.53 \n$\n261 \n$\n1.90 \nThe increase in gathering, processing and transportation expenses for the nine months ended September 30, 2025, compared to the same period in 2024 is attributable primarily to (i) $36 million incurred on additional production acquired in the Endeavor Acquisition, (ii) $30 million associated with production from new wells completed between the nine months ended September 30, 2025, and September 30, 2024, (iii) $29 million associated with transportation costs incurred to meet our minimum volume commitments on certain pipelines, (iv) $19 million related to new firm transportation contracts that became effective during the nine months ended September 30, 2025, (v) $10 million related to properties acquired in the TRP Exchange, and (vi) other individually insignificant changes. The decrease in the overall rate per BOE for the nine months ended September 30, 2025, compared to the same period in 2024 was driven by recording gathering, processing and transportation charges for the majority of production from the Endeavor Acquisition, and to a lesser extent, the Double Eagle Acquisition, as a reduction to revenue in accordance with the terms of the acquired contracts.\n45\nTable of Contents\nDepreciation, Depletion, Amortization and Accretion.\n The following table provides the components of our depreciation, depletion, amortization and accretion expense for the periods indicated:\nNine Months Ended September 30,\n(In millions, except BOE amounts)\n2025\n2024\nDepletion of proved oil and natural gas properties\n$\n3,545 \n$\n1,638 \nDepreciation and amortization of other property and equipment\n70 \n36 \nOther amortization\n7 \n6 \nAsset retirement obligation accretion\n27 \n14 \nDepreciation, depletion, amortization and accretion\n$\n3,649 \n$\n1,694 \nOil and natural gas properties depletion rate per BOE\n$\n14.35 \n$\n11.90 \nDepreciation, depletion, amortization and accretion per BOE\n$\n14.77 \n$\n12.30 \nThe increase in depletion of proved oil and natural gas properties of $1.9 billion for the nine months ended September 30, 2025, as compared to the same period in 2024 consists primarily of $1.3 billion from growth in production volumes and $605 million due to an increase in the depletion rate resulting largely from the addition of higher value leasehold costs and proved reserves from the Endeavor Acquisition, the Double Eagle Acquisition and, to a lesser extent, Viper’s Sitio Acquisition and TWR Acquisition subsequent to the third quarter of 2024.\nAdditionally, depreciation and amortization of other property and equipment increased in connection with the acquisition of other assets in the Endeavor Acquisition.\nGeneral and Administrative Expenses.\n The following table shows general and administrative expenses for the periods indicated:\nNine Months Ended September 30,\n2025\n2024\n(In millions, except per BOE amounts)\nAmount\nPer BOE\nAmount\nPer BOE\nGeneral and administrative expenses\n$\n149 \n$\n0.60 \n$\n92 \n$\n0.67 \nNon-cash stock-based compensation\n61 \n0.25 \n49 \n0.36 \nTotal general and administrative expenses\n$\n210 \n$\n0.85 \n$\n141 \n$\n1.03 \nGeneral and administrative expenses increased for the nine months ended September 30, 2025, compared to the same period in 2024 primarily due to (i) a $45 million increase in employee compensation and benefit costs related to increasing headcount largely from the Endeavor Acquisition and annual discretionary compensation adjustments, (ii) an $11 million increase in software, contract labor and professional services costs, and (iii) other individually insignificant items.\nOther Operating Costs and Expenses.\n The following table shows the other operating costs and expenses for the periods indicated:\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nMerger and transaction expenses\n$\n94 \n$\n273 \nOther operating expenses\n$\n111 \n$\n68 \nMerger and transaction expenses for the nine months ended September 30, 2025, were primarily comprised of (i) $38 million of employee severance and other costs incurred in connection with the Endeavor Acquisition, (ii) $21 million in advisory, legal and filing fees incurred by the Company and $10 million incurred by Viper related to the 2025 Drop Down, (iii) $15 million of employee severance payments made in connection with Viper’s Sitio Acquisition, (iv) $10 million in advisory and legal fees related to the TRP Exchange, and (v) other individually insignificant costs. Merger and transaction expenses for the nine months ended September 30, 2024, relate to costs incurred for the Endeavor Acquisition.\nSee Note 5—\nEndeavor Energy Resources, LP Acquisition\n and Note 4—\nAcquisitions and Divestitures\n of the notes to the condensed consolidated financial statements for further details regarding the Endeavor Acquisition as well as the Sitio Acquisition and TRP Exchange, respectively.\n46\nTable of Contents\nThe increase in other operating expenses for the nine months ended September 30, 2025, compared to the same period in 2024 primarily resulted from a $70 million increase in midstream service costs related to additional production from the Endeavor Acquisition, which was partially offset by an $11 million net decrease in loss on the sale of property, plant and equipment, and a $12 million reduction in impairment charges taken on certain midstream assets in 2024 as well as other individually insignificant items.\nDerivative Instruments.\n The following table shows the net gain (loss) on derivative instruments and the net cash receipts (payments) on settlements of derivative instruments for the periods indicated:\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nGain (loss) on derivative instruments, net\n(1)\n$\n149 \n$\n101 \nNet cash received (paid) on settlements\n(1)\n$\n108 \n$\n(36)\n(1)\nThe nine months ended September 30, 2025, and 2024 include cash paid on interest rate swaps terminated prior to their contractual maturity of $67 million and $37 million, respectively.\nThe increase in gain on derivative instruments for the nine months ended September 30, 2025, compared to the same period in 2024 primarily reflects (i) a $177 million increase in cash received on the settlement of natural gas contracts, (ii) a $40 million increase in the value of our unsettled interest rate swap contracts primarily due to a decline in expected future interest rates and the early termination of $600 million in notional amount of the interest rate swaps in 2025 which was in a liability position, and (iii) a $20 million decrease in cash paid for the semi-annual settlement of our interest rate derivatives. These gains were partially offset by losses attributable primarily to (i) a $126 million decrease in the value of our unsettled natural gas contracts primarily due to an increase in market prices for natural gas compared to our contract prices, (ii) a $49 million increase in cash paid for the settlement of our oil contracts primarily related to premiums on our oil puts, (iii) a $14 million decrease in the value of our unsettled oil contracts primarily due to an increase in market prices for oil compared to our contract prices, and (iv) other individually insignificant changes. See Note 13—\nDerivatives\n of the notes to the condensed consolidated financial statements for further details regarding our derivative instruments.\nOther Income (Expense).\n The following table shows other income and expenses for the periods indicated:\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nInterest expense, net\n$\n(166)\n$\n(101)\nOther income (expense), net\n$\n133 \n$\n87 \nGain (loss) on extinguishment of debt\n$\n23 \n$\n2 \nIncome (loss) from equity investments, net\n$\n20 \n$\n23 \nInterest expense, net increased by $65 million for the nine months ended September 30, 2025, compared to the same period in 2024. This increase primarily consisted of (i) a $129 million reduction in interest income attributable to holding funds raised for the Endeavor Acquisition in cash in short-term interest bearing accounts during the nine months ended September 30, 2024, which reduced interest expense, (ii) $91 million of additional interest expense on the April 2024 Notes, (iii) $43 million of interest expense on the 2025 Term Loan issued in March 2025, (iv) $35 million of interest expense on the 2035 Notes issued in March 2025, (v) $16 million of interest expense on the Viper 2025 Notes issued in July 2025, (vi) $16 million of additional interest expense on the Company’s revolving credit facility due to higher average outstanding borrowings, and (vii) $14 million of additional interest expense on the Tranche A Loans that were repaid in May 2025. These increases were partially offset by (i) a $250 million increase in capitalized interest costs, which reduces interest expense, (ii) a $28 million reduction attributable to the amortization of debt issuance costs related to our terminated bridge facility being fully amortized in 2024, and (iii) other individually insignificant changes.\nSee Note 9—\nDebt\n of the notes to the condensed consolidated financial statements for further details regarding outstanding borrowings.\nOther income (expense), net for the nine months ended September 30, 2025, increased compared to the same period in 2024, primarily due to an increase of $62 million in the gain recognized on the sale of various equity method investments in 2025 compared to 2024. This net gain was partially offset by a $15 million decrease in the value of an investment recorded at fair value during the nine months ended September 30, 2025, compared to the same period in 2024 and other individually insignificant items.\n47\nTable of Contents\nThe increase in gain (loss) on extinguishment of debt is primarily attributable to the Company opportunistically repurchasing a portion of its senior notes during the second quarter of 2025 net of the loss recognized on the redemption of Viper’s 2031 Notes as discussed in \n“\n—Results of Operations\n \n- \nComparison of the Three Months Ended September 30, 2025, and June 30, 2025.”\nSee Note 9—\nDebt\n of the notes to the condensed consolidated financial statements for further details regarding the Company’s retirement of a portion of its senior notes during the second quarter of 2025. \nProvision for (Benefit from) Income Taxes. \nThe following table shows the provision for (benefit from) income taxes for the periods indicated:\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nProvision for (benefit from) income taxes\n$\n894 \n$\n685 \nThe change in our income tax provision for the nine months ended September 30, 2025, compared to the same period in 2024 was primarily due to the increase in pre-tax income resulting largely from higher revenues attributable to properties acquired in connection with the Endeavor Acquisition. See Note 12—\nIncome Taxes\n of the notes to the condensed consolidated financial statements for further discussion of our income tax expense.\nLiquidity and Capital Resources\nOverview of Sources and Uses of Cash\nHistorically, our primary sources of liquidity have included cash flows from operations, proceeds from our public equity offerings, borrowings under our revolving credit facility, borrowings under term loans, proceeds from the issuance of senior notes and sales of non-core assets. Our primary uses of capital have been for the acquisition, development and exploration of oil and natural gas properties, repayment of debt and returning capital to stockholders. At September 30, 2025, we had approximately $2.4 billion of liquidity consisting of $106 million in standalone cash and cash equivalents and $2.3 billion available under our credit facility. As discussed above, we have revised our capital budget guidance for 2025 to $3.45 billion to $3.55 billion to prioritize free cash flow generation. At September 30, 2025, we had approximately $14 million of senior notes, excluding the Viper 2027 Notes, maturing in the next 12 months.\nFuture cash flows are subject to a number of variables, including the level of oil and natural gas production and volatility of commodity prices. Further, significant additional capital expenditures will be required to more fully develop our properties. Prices for our commodities are determined primarily by prevailing market conditions, regional and worldwide economic activity, weather and other substantially variable factors. These factors are beyond our control and are difficult to predict as discussed further in \nPart I, Item 1A. Risk Factors in our Annual Report on Form 10-K\n for the year ended December 31, 2024, and \nin our Quarterly Report on Form 10-Q\n for the quarterly period ended March 31, 2025, filed with the SEC on May 7, 2025. In order to mitigate this volatility, we enter into derivative contracts with a number of financial institutions, all of which are participants in our credit facility, to economically hedge a portion of our estimated future crude oil and natural gas production as discussed further in Note 13—\nDerivatives\n of the notes to the condensed consolidated financial statements and"
}