{
  "source_file": "fast-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2 — MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following is management's discussion and analysis of certain significant factors which have affected our financial position and operating results during the periods included in the accompanying condensed consolidated financial statements and should be read in conjunction with the condensed consolidated financial statements. Dollar amounts are stated in millions except for share and per share amounts and where otherwise noted. All historical common stock share and per share information in this quarterly report on Form 10-Q have been retroactively adjusted to reflect the two-for-one stock split effective at the close of business on May 21, 2025. Percentage and dollar change calculations, which are based on non-rounded dollar values, may not be able to be recalculated using the dollar values in this document due to the rounding of those dollar values. References to daily sales rate (DSR) change may reflect either growth (positive) or contraction (negative) for the applicable period. Prior to June 30, 2025, we disclosed the number of in-market locations which comprised the total number of branch and Onsite locations. As our focus shifts from metrics primarily addressing development of capabilities to metrics addressing customer sites served by our selling locations, we intend to disclose only the number of branch locations.\nBusiness\nFastenal is a global leader in the wholesale distribution of industrial and construction supplies. We distribute these supplies through a network of approximately 1,600 branch locations. Our largest end market is manufacturing. Sales to these customers include products for both original equipment manufacturing (OEM), where our products are consumed in the final products of our customers, and manufacturing, repair, and operations (MRO), where our products are consumed to support the facilities and ongoing operations of our customers. We also service general and commercial contractors in non-residential end markets as well as farmers, truckers, railroads, oil exploration companies, oil production and refinement companies, mining companies, federal, state, and local government entities, schools, warehouse and storage, data centers, and certain retail trades. Geographically, our branch locations and customers are primarily in North America, though we continue to grow our non-North American presence as well.\nOur motto is \nGrowth Through Customer Service\n®\n and our tagline is \nWhere Industry Meets Innovation\n™\n.\n \nWe are a customer- and growth-centric organization focused on identifying unique technologies, capabilities, and supply chain solutions that get us closer to our customers and reduce the total cost of their global supply chain. We believe this close-to-the-customer, 'high-touch, high-tech' partnership approach is differentiated in the marketplace and allows us to gain market share in what remains a fragmented industrial distribution market.\nThe global economy continues to experience elevated levels of volatility and uncertainty, including within the commodity, labor, and transportation markets, driven by a combination of geopolitical developments and macroeconomic factors. Recent imposition of new and expanded tariffs have further contributed to disruptions in global capital markets and global supply chains. These developments may impact our operations, financial condition, and results of operations. We are actively monitoring economic conditions in the U.S. and internationally, including the potential ramifications of evolving trade policies, changes in interest rates, foreign currency exchange rate fluctuations, inflationary pressures, and the risk of a global or regional economic recession. In response to these factors, we have implemented various strategies designed to mitigate certain adverse effects of changing inflationary conditions and supply chain challenges, while continuing to maintain market price competitiveness and price/cost neutrality. Historically, our broad and diverse customer base combined with our ability to innovate with our customers have provided a degree of resilience during periods of economic contraction in the industrial market. However, the ultimate impact of ongoing macroeconomic conditions, including recent tariff-related developments, remains uncertain and cannot be predicted at this time.\n13\nTable of Contents\nExecutive Overview\nThe following table presents a performance summary of our results of operations for the nine- and three-month periods ended \nSeptember 30, 2025\n and \n2024\n.\n \nNine-month Period\nThree-month Period\n \n2025\n2024\nChange\n2025\n2024\nChange\nNet sales\n$\n6,173.1 \n5,721.5 \n7.9\n%\n$\n2,133.3 \n1,910.2 \n11.7\n%\nBusiness days\n191 \n192 \n64 \n64 \nDaily sales\n$\n32.3 \n29.8 \n8.5\n%\n$\n33.3 \n29.8 \n11.7\n%\nGross profit\n$\n2,792.5 \n2,583.7 \n8.1\n%\n$\n965.8 \n858.6 \n12.5\n%\n % of net sales\n45.2\n%\n45.2\n%\n45.3\n%\n44.9\n%\nSG&A expenses \n$\n1,521.1 \n1,418.5 \n7.2\n%\n$\n524.3 \n470.5 \n11.5\n%\n% of net sales\n24.6\n%\n24.8\n%\n24.6\n%\n24.6\n%\nOperating income\n$\n1,271.4 \n1,165.2 \n9.1\n%\n$\n441.5 \n388.1 \n13.7\n%\n % of net sales\n20.6\n%\n20.4\n%\n20.7\n%\n20.3\n%\nIncome before income taxes\n$\n1,270.4 \n1,163.8 \n9.2\n%\n$\n440.6 \n387.6 \n13.7\n%\n % of net sales\n20.6\n%\n20.3\n%\n20.7\n%\n20.3\n%\nNet income\n$\n964.4 \n888.5 \n8.5\n%\n$\n335.5 \n298.1 \n12.6\n%\nDiluted net income per share\n$\n0.84 \n0.77 \n8.4\n%\n$\n0.29 \n0.26 \n12.3\n%\nNote – Daily sales are defined as the total net sales for the period divided by the number of business days (in the U.S.) in the period.\nThe table below summarizes our absolute and full time equivalent (FTE; based on 40 hours per week) employee headcount, number of branch locations, number of $50k+ customer sites, and weighted Fastenal Managed Inventory (FMI) devices at the end of the periods presented and the percentage change compared to the end of the prior periods.\nChange\nSince:\nChange \nSince:\nChange \nSince:\nQ3\n2025\nQ2\n2025\nQ2\n2025\nQ4\n2024\nQ4\n2024\nQ3 \n2024\nQ3 \n2024\nSelling personnel - absolute employee headcount\n (1)\n17,196 \n17,192 \n0.0 \n%\n16,669 \n3.2 \n%\n16,620 \n3.5 \n%\nSelling personnel - FTE employee headcount \n(1)\n15,414 \n15,660 \n-1.6 \n%\n15,014 \n2.7 \n%\n15,035 \n2.5 \n%\nTotal personnel - absolute employee headcount\n24,438 \n24,362 \n0.3 \n%\n23,702 \n3.1 \n%\n23,518 \n3.9 \n%\nTotal personnel - FTE employee headcount\n21,568 \n21,807 \n-1.1 \n%\n20,958 \n2.9 \n%\n20,894 \n3.2 \n%\nNumber of branch locations\n1,590 \n1,596 \n-0.4 \n%\n1,597 \n-0.4 \n%\n1,597 \n-0.4 \n%\nNumber of $50k+ customer sites\n2,771 \n2,683 \n3.3 \n%\n2,330 \n18.9 \n%\n2,401 \n15.4 \n%\nWeighted FMI devices (MEU installed count) \n133,910 \n132,174 \n1.3 \n%\n126,957 \n5.5 \n%\n123,193 \n8.7 \n%\n(1)    \nIn the fourth quarter of 2024, we realigned certain employees as a result of a routine review of our organizational structure. While there was no change to total absolute or total FTE headcount, it produced minor shifts between headcount categories. Historical numbers have been adjusted to reflect this realignment.\nDuring the last twelve months, we increased our total FTE employee headcount by 674. Our total FTE selling and sales support personnel increased by 3\n79 to support growth and sales initiatives to target customer acquisition. We \nhad an increase in our distribution and transportat\nion FTE personnel of 106 to support increased product throughput at our distribution facilities. W\ne had an increase in our remaining FTE personnel of 189, which related primarily to personnel investments in IT, quality control, and strategy and communications.\n14\nTable of Contents\nTHIRD QUARTER OF 2025 VERSUS THIRD QUARTER OF 2024\nResults of Operations\nThe following table sets forth condensed consolidated statements of income information (as a percentage of net sales) for the periods ended September 30:\nThree-month Period\n \n2025\n2024\nNet sales\n100.0 \n%\n100.0 \n%\nGross profit\n45.3 \n%\n44.9 \n%\nSG&A expenses\n24.6 \n%\n24.6 \n%\nOperating income\n20.7 \n%\n20.3 \n%\nNet interest\n0.0 \n%\n0.0 \n%\nIncome before income taxes\n20.7 \n%\n20.3 \n%\nNote – Amounts may not foot due to rounding difference.\nSales\nThe table below sets forth net sales and daily sales for the periods ended September 30, and changes in such sales from the prior period to the more recent period:\n \nThree-month Period\n \n2025\n2024\nNet sales\n$\n2,133.3 \n1,910.2 \nPercentage change\n11.7\n%\n3.5\n%\nBusiness days\n64 \n64 \nDaily sales\n$\n33.3 \n29.8 \nPercentage change\n11.7\n%\n1.9\n%\nDaily sales impact of currency fluctuations\n0.1\n%\n-0.1\n%\nNet sales increased $223.2, or 11.7%, in the third quarter of 2025 when compared to the third quarter of 2024. Both periods had the same number of selling days. Even though industrial production was still sluggish in the third quarter of 2025, t\nhe performance reflects the contribution from improved customer contract signings since the first quarter of 2024. Chang\nes in foreign exchange rates positively affected sales in the third quarter of 2025 by approximately 10 basis points and negatively affected sales in the third quarter of 2024 by approximately 10 basis points.\nWe experienced an increase in unit sales in the third quarter of 2025. This was due to growth in the number of customer sites spending $10k or more per month with Fastenal and, to a lesser degree, growth in average monthly sales per customer site across all customer spend categories. The im\npact of product pricing on net sal\nes in the third quarter of 2025 was an increase of \n240 to 270 basis point\ns, in contrast to the third quarter of 2024, when the impact of product pricing was not material.\nFrom a product standpoint, we have three categories: fasteners, including fasteners used in OEM and MRO, safety supplies, and other product lines, the latter of which includes eight smaller product categories, such as tools, janitorial supplies, and cutting tools.\n Industrial production was still sluggish in the third quarter of 2025; however, the performance of our fastener product line outperformed our non-fastener product lines. The fastener category experienced improved growth in the third quarter of 2025, as compared to the third quarter of 2024, driven by easier comparisons, increased contribution from large customer signings, better product availability in our distribution centers, and pricing actions implemented in the second and third quarters of 2025. We achieved growth in our safety category reflecting the lower volatility of PPE demand, which tends to be utilized in more MRO than OEM applications, growth of our vending installed base, and success with data center customers. Other product lines experienced higher growth from MRO-oriented lines, such as janitorial, and from OEM-oriented lines, such as welding/\n15\nTable of Contents\nabrasives, despite continued soft manufacturing demand.\n The DSR change when compared to the same period in the prior year and the percent of sales in the period were as follows: \nDSR Change\nThree-month Period\n% of Sales\nThree-month Period\n2025\n2024\n2025\n2024\nOEM fasteners\n15.9\n%\n-3.1\n%\n19.8\n%\n19.0\n%\nMRO fasteners\n12.0\n%\n-5.3\n%\n11.2\n%\n11.2\n%\nTotal fasteners\n14.4\n%\n-4.0\n%\n31.0\n%\n30.2\n%\nSafety supplies\n9.8\n%\n6.8\n%\n22.1\n%\n22.5\n%\nOther product lines\n10.7\n%\n3.7\n%\n46.9\n%\n47.3\n%\nTotal non-fasteners\n10.4\n%\n4.7\n%\n69.0\n%\n69.8\n%\nFrom an end market standpoint, we have four categories: heavy manufacturing, other manufacturing, non-residential construction, and other, the latter of which includes reseller, government/education, transportation, warehousing and storage, and data centers. \nOur manufacturing end markets outperformed primarily due to the relative strength we are experiencing with key account customers with significant managed spend where our service model and technology are particularly impactful. This disproportionately benefits manufacturing customers. The non-residential construction end market experienced growth for the second time in twelve consecutive quarters. Other end market sales were favorably impacted by growth with education and healthcare, transportation, and data center customers. These were partially offset by declining sales with resellers, although at a lower decline than we've historically seen. The D\nSR change when compared to the same period in the prior year and the percent of sales in the period were as follows:\nDSR Change\nThree-month Period\n% of Sales\nThree-month Period\n2025\n2024\n2025\n2024\nHeavy manufacturing\n12.4 \n%\n0.7 \n%\n43.1 \n%\n42.7 \n%\nOther manufacturing \n12.9 \n%\n6.2 \n%\n32.8 \n%\n32.4 \n%\nTotal manufacturing\n12.7 \n%\n3.0 \n%\n75.9 \n%\n75.1 \n%\nNon-residential construction\n7.5 \n%\n-3.6 \n%\n8.3 \n%\n8.6 \n%\nOther end markets\n8.9 \n%\n-0.3 \n%\n15.8 \n%\n16.3 \n%\nTotal non-manufacturing\n8.4 \n%\n-1.5 \n%\n24.1 \n%\n24.9 \n%\nFrom a customer standpoint, we have two categories: contracts, which include national multi-site, local and regional, and government customers with significant revenue potential, and non-contracts, which include all other customers. Sales with our contract customers continue to outperform as we realize incremental sales from implementing strong customer signings that we have achieved since the first quarter of 2024, which was partially offset by subdued business activity. Non-contract customers tend to be smaller and utilize fewer of our tools and capabilities, providing fewer avenues for share gains and therefore more closely reflect overall business trends, which remain sluggish. The DSR change when compared to the same period in the prior y\near and the percent of sales in the period were as follows:\nDSR Change\nThree-month Period\n% of Sales\nThree-month Period\n2025\n2024\n2025\n2024\nContract sales\n13.2\n%\n6.3\n%\n73.8\n%\n72.0\n%\nNon-contract sales\n7.2\n%\n-8.1\n%\n26.2\n%\n28.0\n%\n16\nTable of Contents\nSupplemental Data\nPrior to 2025, our disclosed metrics primarily addressed development of capabilities, including branch openings, geographic expansion, growth of national accounts, growth of non-fastener products, FMI installations, and Onsite signings, to name a few. The data provided in the chart below measures the number of customer sites that are served throughout our in-market network, categorizing them by monthly customer spend categories and end market, and the sales and average sales per site. We believe this supplemental information may be useful to investors in evaluating Fastenal's business trends and whether and to what degree we are being successful. Historical end market sales have been updated in the table below to categorize by customer site and may not be able to be recalculated due to the rounding of those dollar values.\nThree-month Period\n2025\nThree-month Period\n2024\nCustomer Sites (#) \n(1) (2)\nSales\nMo. Sales per Customer Site \n(3)\nCustomer Sites (#) \n(1) (2)\nSales\nMo. Sales per Customer Site \n(3)\nManufacturing\n$50k+/Mo. \n(4)\n2,304\n$971.8 \n$140,596 \n2,025 \n$827.9 \n$136,280 \n$10k+/Mo.\n8,913\n1,411.5 \n52,788 \n8,318 \n1,240.2 \n49,699 \n$5k-$10k/Mo.\n4,472\n96.1 \n7,163 \n4,465 \n95.5 \n7,130 \n<$5k/Mo.\n28,936\n100.8 \n1,161 \n31,245 \n103.6 \n1,105 \nOther sales \n(5)\n—\n2.2 \n— \n— \n11.7 \n— \nTotal manufacturing\n42,321\n$1,610.6 \n$12,668 \n44,028 \n$1,451.0 \n$10,897 \nNon-manufacturing\n$50k+/Mo. \n(4)\n467\n$170.1 \n$121,413 \n376 \n$122.9 \n$108,954 \n$10k+/Mo.\n3,282\n340.5 \n34,583 \n2,962 \n277.0 \n31,173 \n$5k-$10k/Mo.\n2,852\n60.4 \n7,059 \n2,862 \n60.5 \n7,046 \n<$5k/Mo.\n50,368\n110.1 \n729 \n56,424 \n113.5 \n671 \nOther sales \n(5)\n—\n11.7 \n— \n— \n8.2 \n— \nTotal non-manufacturing\n56,502\n$522.7 \n$3,015 \n62,248 \n$459.2 \n$2,415 \nTotal\n$50k+/Mo. \n(4)\n2,771\n$1,141.9 \n$137,363 \n2,401 \n$950.8 \n$132,001 \n$10k+/Mo.\n12,195\n1,752.0 \n47,888 \n11,280 \n1,517.2 \n44,835 \n$5k-$10k/Mo.\n7,324\n156.5 \n7,123 \n7,327 \n156.0 \n7,097 \n<$5k/Mo.\n79,304\n210.9 \n886 \n87,669 \n217.1 \n825 \nOther sales \n(5)\n—\n13.9 \n— \n— \n19.9 \n— \nTotal\n98,823\n$2,133.3 \n$7,149 \n106,276 \n$1,910.2 \n$5,929 \n(1)\nCustomer sites represent the number of customer locations served by our in-market network. Individual customers with multiple locations across multiple in-market locations will have multiple customer sites. \n(2)\nCustomer sites are an average of the number of customer sites calculated each month. \n(3)\nMonthly sales per customer site totals do not include the sales from other sales lines, as there is no customer site count associated with it. This column is not rounded to the millions and represents the exact dollar amount. \n(4)\n$50k+ customer sites are disclosed as a representation of Onsite-like customers and are also a subset of $10k+ customer sites. \n(5)\nOther sales represent impacts to sales that are not tied to a specific site or in-market location. This includes certain service fees, cash sales, direct product sales, etc. \n17\nTable of Contents\nFMI Technology comprises our FASTStock\n℠\n (scanned stocking locations), FASTBin\n®\n (infrared, RFID, and scaled bins), and FASTVend\n®\n (vending devices) offerings. FASTStock's fulfillment processing technology is not embedded, is relatively less expensive and highly flexible in application, and is delivered using our proprietary mobility technology. FASTBin and FASTVend incorporate highly efficient and powerful embedded data tracking and fulfillment processing technologies. The first statistic below is a \nweighted FMI\n®\n measure\n, which combines the signings and installations of FASTBin and FASTVend in a standardized machine equivalent unit (MEU) based on the expected output of each type of device. We do not include FASTStock in this measurement because scanned stocking locations can take many forms, such as bins, shelves, cabinets, pallets, etc., that cannot be converted into a standardized MEU. The second statistic is \nsales through FMI Technology\n, which combines the sales through FASTStock, FASTBin, and FASTVend. A portion of the growth in sales experienced by FMI, particularly FASTStock and FASTBin, reflects the migration of products from less efficient non-digital stocking locations to more efficient, digital stocking locations.\n \nWe signed 7,050 weighted FASTBin and FASTVend devices in the third quarter of 2025. Our goal for weighted FASTBin and FASTVend device signings in 2025 remains between 25,000 to 26,000 MEUs.\nThe table below summarizes signings and installations of our FMI devices and sales through our FMI devices, eBusiness \n(1)\n tools, and Digital Footprint \n(2)\n.\nThree-month Period\n2025\n2024\nDSR\nChange \n(3)\nWeighted FASTBin/FASTVend signings (MEUs)\n7,050 \n7,281 \n-3.2\n%\nSignings per day\n110 \n114 \nWeighted FASTBin/FASTVend installations (MEUs; end of period)\n133,910 \n123,193 \n8.7\n%\nFASTStock sales\n$\n274.8 \n244.7 \n12.3\n%\n% of sales\n12.7\n%\n12.7\n%\nFASTBin/FASTVend sales\n$\n703.6 \n586.8 \n19.9\n%\n% of sales\n32.6\n%\n30.3\n%\nFMI sales\n$\n978.4 \n831.5 \n17.7\n%\nFMI daily sales\n$\n15.3 \n13.0 \n% of sales\n45.3\n%\n43.0\n%\n eBusiness sales\n$\n628.7 \n582.3 \n8.0\n%\n% of sales\n29.1\n%\n30.1\n%\nLess: eBusiness and FMI sales overlap\n$\n283.3 \n231.9 \n22.1\n%\n% of sales\n13.1\n%\n12.0\n%\nDigital Footprint sales\n$\n1,323.8 \n1,181.9 \n12.0\n%\n% of sales\n61.3\n%\n61.1\n%\n(1)\nOur eBusiness includes eProcurement activities, which are integrated transactions, including electronic data interchange (EDI), and eCommerce (transactional website sales).\n(2)\nDigital Footprint is a combination of our sales through FMI (FASTStock, FASTBin, and FASTVend) plus that portion of our eBusiness sales that does not represent billings of FMI services.\n(3)\nWeighted FASTBin/FASTVend signings and installations reflects the percent change compared to the same period in the prior year.\nGross Profit\nOur gross prof\nit, as a percentage of net sales, increased to 45.3% in the third quarter of 2025 from 44.9% in the third\n quarter of \n2024. \nThe fastener expansion project, other supplier-focused initiatives, and improvements in customer and supplier incentives contributed to the gross profit percentage increase in the third quarter of 2025. The aforementioned positive effects on our gross profit percentage were partially offset by a couple of variables. First, c\nustomer mix diluted our gross profit percentage. This reflects relatively stronger growth from large customers, including Onsite-like customers, which tend to have a lower gross profit percentage tha\nn our business as a whole. Second, we experienced higher organizational/overhead costs, primarily due to certain working capital being relieved from inventory generating higher period costs. Price/cost had a neutral impact on our gross profit percentage. \n18\nTable of Contents\nSG&A Expenses\nOur SG&A expenses, as a percentage of net sales, were unchanged at 24.6% in the third quarter of 2025 from 24.6% in the third quarter of 2024.\nTh\ne percentage change in employee-\nrelated, occupancy-related, and all other SG&A expenses compared to the same period in the preceding year, is outlined in the table below. \nApproximate Percentage of Total SG&A Expenses\nThree-month Period\n2025\nEmployee-related expenses\n70% to 75%\n12.9\n%\nOccupancy-related expenses\n15% to 20%\n5.3\n%\nAll other SG&A expenses\n10% to 15%\n10.9\n%\nEmployee-related expenses include: (1) payroll (which includes cash compensation, stock option expense, and profit sharing), (2) health care, (3) personnel development, and (4) social taxes. \nIn the \nthird\n quarter of 2025, our employee-relate\nd expenses increased when com\npared to the \nthird\n quarter of 2024. We experienced an increase in employee base pay, although at a rate below the growth in sales, due to higher average FTE during the period, and, to a lesser degree, higher average wages during the period. Bonuses and commissions and profit sharing increased at a rate greater than sales as a result of improved business activity and financial performance versus the year-ago period.\nThe table below summarizes our FTE headcount at the end of the periods presented and\n the percentage change compared to the end of the prior periods:\nChange\nSince:\nChange\nSince:\nQ3\n2025\nQ2\n2025\nQ2\n2025\nQ3\n2024 \n(1)\nQ3 \n2024\nSelling personnel\n (2)\n15,414 \n15,660 \n-1.6 \n%\n15,035 \n2.5 \n%\nDistribution/Transportation personnel\n3,057 \n3,098 \n-1.3 \n%\n2,951 \n3.6 \n%\nManufacturing personnel\n973 \n966 \n0.7 \n%\n914 \n6.5 \n%\nOrganizational support personnel \n(3)\n2,124 \n2,083 \n2.0 \n%\n1,994 \n6.5 \n%\nTotal personnel\n21,568 \n21,807 \n-1.1 \n%\n20,894 \n3.2 \n%\n(1)\nIn the fourth quarter of 2024, we realigned certain employees as a result of a routine review of our organizational structure. While there was no change to total absolute or total FTE headcount, it produced minor shifts between headcount categories. Historical numbers have been adjusted to reflect this realignment.\n(2)\nOf our Selling personnel, 80%-85% are attached to a specific in-market location.\n(3)\nOrganizational support personnel consists of: (1) Sales Support personnel (37% to 42% of category), which includes sourcing, purchasing, supply chain, product development, etc.; (2) information technology (IT) personnel (35% to 40% of category); and (3) Administrative Support personnel (22% to 27% of category), which includes human resources, Fastenal School of Business, accounting and finance, senior management, etc.\nOccupancy-related expenses include: (1) building rent and depreciation, (2) building utility costs, (3) equipment related to our branches and distribution locations, and (4) industrial vending equipment and bins utilized as part of FMI services (we consider this hardware to be a logical extension of our in-market operations and classify the depreciation and repair costs as occupancy expenses). \nIn the third quarter of 2025, our occupancy-related expenses increased when compared to the third quarter of 2024. \nThis was driven by general inflation in branch rental costs and, to a lesser degree, higher depreciation from an increase in the installed base of FMI hardware. \nAll other SG&A expenses include: (1) selling-related transportation, (2) IT expenses, (3) general corporate expenses, which consist of legal expenses, general insurance expenses, travel and marketing expenses, etc., and (4) sales of property and equipment. \n19\nTable of Contents\nCombined, all other SG&A expenses increased in the\n \nthird quarter of 2025 when compared to the third quarter of 2024. Selling-related transportation costs were higher, reflecting higher lease costs, which were only partially offset by lower fuel expense. We had relatively smaller increases in IT, realized losses on currency conversion, sales-related travel expense, and bad debt expense, which were partially offset by reductions in general insurance expense and increases in joint marketing efforts with our suppliers.\n \nOperating Income\nOur operating income, as a percentage of net sales, increased to 20.7% in the third quarter of 2025 from 20.3% in the third quarter of 2024.\nNet Interest\nWe had lower interest income earned during the third quarter of 2025 and lower interest expense in the third quarter of 2025. The decrease in interest income relative to interest expense resulted in net interest expense of $0.9 in the third quarter of 2025, which compared to net interest expense of $0.5 in the third quarter of 2024.\nIncome Taxes\nWe recorded income tax expense of $105.1 in the third quarter of 2025, or\n 23.9% of in\ncom\ne before income taxes. Income tax expense was $\n89.5\n in the third quarter of 2024, or 23.1% of income before income taxes. Our tax rate in the third quarter of 2025 was below our expected ongoing tax rate due to a decrease in our liability for unrecognized tax benefits in the third quarter of 2025, and the tax benefits associated with the exercise of stock options during the period. These reductions were partially offset by the return to provision adjustments processed in the third quarter of 2025. We believe our ongoing tax rate, absent any discrete tax items or broader changes to tax law, will be approximately 24.5%.\nOn July 4, 2025, the U.S. enacted the One Big Beautiful Bill Act (OBBBA). The impact of the OBBBA enactment is immaterial to our Condensed Consolidated Financial Statements.\nNet Income\nOur net income during the third quarter of 2025 was $333.5, an increase of 12.6% compared to the third quarter of 2024. Our diluted net income per share was $0.29 in the third quarter of 2025, compared to $0.26 in the third quarter of 2024.\nLiquidity and Capital Resources\nCash flow activity was as follows for the periods ended September 30:\n \nThree-month Period\n \nFive-Year Average\n (1)\n2025\n2024\nChange\nNet cash provided by operating activities\n$\n386.9 \n296.9 \n30.3\n%\n% of net income\n104.2\n%\n115.3\n%\n99.6\n%\nNet cash used in investing activities\n$\n54.8 \n55.9 \n-1.9\n%\n% of net income\n16.3\n%\n16.3\n%\n18.8\n%\nNet cash used in financing activities\n$\n280.9 \n210.7 \n33.4\n%\n(1)  \nFive-year average includes 2020 to 2024.\n20\nTable of Contents\nNet Cash Provided by Operating Activities\nNet cash provided by operating activities increased $90.0 in the third quarter of 2025 when compared to the third quarter of 2024. \nThe increase in operating cash flow, as a percent of net income, primarily reflects a reduction in estimated income tax payments relating to the reinstatement of bonus depreciation in 2025 and working capital being a modest source of cash in the third quarter of 2025, as opposed to a use of cash in the third quarter of 2024.\nThe dollar and percentage change in accounts receivable, net, inventories, and accounts payable as of September 30, 2025 when compared to September 30, 2024 were as follows:\n \nSeptember 30\nTwelve-month Dollar Change\nTwelve-month Percentage Change\n \n2025\n2024\n2025\n2025\nAccounts receivable, net\n$\n1,347.3 \n1,200.6 \n$\n146.6 \n12.2 \n%\nInventories\n1,722.8 \n1,559.5 \n163.3 \n10.5 \n%\nTrade working capital\n$\n3,070.1 \n2,760.1 \n$\n309.9 \n11.2 \n%\nAccounts payable\n$\n344.8 \n301.7 \n$\n43.1 \n14.3 \n%\nTrade working capital, net\n$\n2,725.3 \n2,458.4 \n$\n266.8 \n10.9 \n%\nNet sales in last three months\n$\n2,133.3 \n1,910.2 \n$\n223.2 \n11.7 \n%\nNote - Amounts may not foot due to rounding differences.\nThe increase in our accounts receivable balance in the third quarter of 2025 was primarily attributable to\n growth in sales with our customers, including relative growth with larger customers that tend to carry longer payment terms. \nThe increase in our inventory balance in the third quarter of 2025 was primarily attributable \nto two factors. First, we added inventory to support projected growth in our business. Second, and to a lesser extent, tariffs and general inflation have led to increased inventory valuation. \nThe increase in our accounts payable balance in the third quarter of 2025 was primarily attributable\n to an increase in our product purchases as reflected in the growth in inventories.\nNet Cash Used in Investing Activities\nNet cash used in investi\nng activities decreased $1.1 in the third quarter of 2025 when compared to the third quarter of 2024. \nThis was primarily related to an increase in spending for FMI hardware to support growth in our installed base, facility construction and upgrades, IT, and vehicles that was partially offset by an increase in proceeds from sales of vehicles and property.\nOur capital spending typically falls into five categories: (1) purchases related to FMI hardware, (2) purchases of property and equipment related to expansion of and enhancements to distribution centers, owned or leased branch properties, and other company facilities, (3) spending on software and hardware for our information processing systems, (4) the addition of fleet vehicles, and (5) the addition of manufacturing equipment. Proceeds from the sales of property and equipment, typically for the planned disposition of pick-up trucks as well as distribution vehicles and trailers in the normal course of business, are netted against these purchases and additions. During the third quarter of 2025, our net capital expenditures (purchases of property and equipment, net of proceeds from sales of property and equipment) were $54.7, which was a slight decrease from $55.8 in the third quarter of 2024. \nThis was primarily related to an increase in spending for FMI hardware to support growth in our installed base, facility construction and upgrades, IT, and vehicles that was partially offset by an increase in proceeds from sales of vehicles and property.\nCash requirements for capital expenditures were \nsatisfied from cash generated from operations, available cash and cash equivalents, our borrowing capacity, and the proceeds of disposals. For 2025, we\n expect our\n net capital expenditures \nto be within a range of $235.0 to $255.0, an increase from $214.1 in 2024.\n \nThe expected growth on a year-to-year basis reflects three items. First, we had higher distribution center spending as we completed construction of our replacement Utah hub facility in the third quarter of 2025, began construction on a replacement Atlanta hub facility, and improved our picking capacity and efficiency across our hub network. Second, we expect greater outlays for FMI hardware. Third, we expect elevated IT spending as projects that were expected in 2024 experienced delays and are expected to continue throughout 2025.\n21\nTable of Contents\nNet Cash Used in Financing Activities\nNet cash used in financin\ng activities increased $70.2 in the third quarter of 2025 when compared to the third quarter of 2024. \nIn the third quarter of 2025, we ha\nd higher \naverage borrowings outstanding and were using capital to reduce those balances. In contrast, during the third quarter of 2024, we had lower average borrowings and a smaller proportion of those balances were part of a facility that was eligible for repayment. As a result, we used significantly more capital to reduce debt balances in the third quarter of 2025 relative to the third quarter of 2024. We also increased capital returned to shareholders through dividends in the period.\nDuring the third quarter of 2025, we returned $\n252.5\n to our shareholders in the form of dividends, compared to the third quart\ner of 2024 when we returned $223.4 to our shareholders in the form of dividends. We did not repurchase any of our common stock in either period.\nWe have authority to purchase up to 12,400,000 shares of our common stock under the July 12, 2022 authorization. This authorization does not have an expiration date. \nTotal debt on our balance sheet was $195.0 at the end of the third quarter of 2025, or 4.8% of total capital (the sum of stockholders' equity and total debt). This compares to $240.0, or 6.3% of total capital, at the end of the third quarter of 2024. \nThe reduction in debt at the end of the third quarter of 2025 versus the prior period reflects strong generation of net cash provided by operating activities over the last 12 months in excess of what was necessary to finance net capital expenditures, payment of dividends, and other investing and financing cash needs.\nOur material cash requirements for known contractual ob\nligations include capital exp\nenditures, debt, and lease obligations, each of which are discussed in more detail earlier in this report in the Notes to Condensed Consolidated Financial Statements and in our \n2024\n annual report on Form 10-K.\nAn overview of our cash dividends paid or declared in 2025 and 2024 is contained in Note 3 of the Notes to Condensed Consolidated Financial Statements. \n22\nTable of Contents\nNINE MONTHS ENDED SEPTEMBER 30, 2025 VERSUS NINE MONTHS ENDED SEPTEMBER 30, 2024\nResults of Operations\nThe following table sets forth condensed consolidated statements of income information (as a percentage of net sales) for the periods ended September 30:\nNine-month Period\n \n2025\n2024\nNet sales\n100.0 \n%\n100.0 \n%\nGross profit\n45.2 \n%\n45.2 \n%\nSG&A expenses\n24.6 \n%\n24.8 \n%\nOperating income\n20.6 \n%\n20.4 \n%\nNet interest\n0.0 \n%\n0.0 \n%\nIncome before income taxes\n20.6 \n%\n20.3 \n%\nNote – Amounts may not foot due to rounding differences.\nSales\nThe table below sets forth net sales and daily sales for the periods ended September 30, and changes in such sales from the prior period to the more recent period:\n \nNine-month Period\n \n2025\n2024\nNet sales\n$\n6,173.1 \n5,721.5 \nPercentage change\n7.9\n%\n2.4\n%\nBusiness days\n191 \n192 \nDaily sales\n$\n32.3 \n29.8 \nPercentage change\n8.5\n%\n1.9\n%\nDaily sales impact of currency fluctuations\n-0.1\n%\n-0.1\n%\nNet sales increased $451.6, or 7.9%, in the first nine months of 2025 when compared to the first nine months of 2024. The \neffect from adverse weather in the first nine months of 2025 was not material compared to the first nine months of 2024, when the effect of adverse weather was a reduction in sales by 10 to 30 basis points. \nChanges in foreign exchange rates negatively affected sales by approximately 10 basis points in the first nine months of 2025 and 2024.\nWe experienced an increase in unit sales in the first nine months of 2025 when compared to the first nine months of 2024. This was primarily due to growth with large customers, both those operating out of Onsite locations that have been opened in the last two years and, to a lesser degree, those being serviced from traditional branch operations. The impact of product pricing on net sales in the first nine months of 2025 w\nas\n an increase of 130 to\n 160 basis points, compared to the first nine months of 2024, which experienced a decline of 10 to 40 basis points. \nThe increase reflects pricing actions implemented in the\n \nsecond and third quarters of 2025 to address additional tariffs enacted beginning in February 2025.\n23\nTable of Contents\nFrom a product standpoint, we have three categories: fasteners, including fasteners used in OEM and MRO, safety supplies, and other product lines, the latter of which includes eight smaller product categories, such as tools, janitorial supplies, and cutting tools. \nWith industrial production still sluggish in the first nine months of 2025, the performance of our fastener product line continued to lag our non-fastener product lines. The fastener category experienced improved growth in the first nine months of 2025 driven by easier comparisons, increased contribution from large customer signings, better product availability in our distribution centers, and pricing actions implemented in the second and third quarters of 2025. We achieved growth in our safety category reflecting the lower volatility of PPE demand, which tends to be utilized in more MRO than OEM applications, growth of our vending installed base, and success with warehousing and data center customers. Other product lines experienced higher growth from MRO-oriented lines, such as janitorial and material handling, rather than from OEM-oriented lines, such as cutting tools and welding/abrasives, reflecting continued soft manufacturing demand. The DSR change when compared to the same period in the prior year and the percent of sales in the period were as follows: \nDSR Change\nNine-month Period\n% of Sales\nNine-month Period\n2025\n2024\n2025\n2024\nOEM fasteners\n9.4\n%\n-3.1\n%\n19.5\n%\n19.4\n%\nMRO fasteners\n3.9\n%\n-5.0\n%\n11.1\n%\n11.5\n%\nTotal fasteners\n7.3\n%\n-3.8\n%\n30.6\n%\n30.9\n%\nSafety supplies\n9.2\n%\n7.4\n%\n22.1\n%\n22.0\n%\nOther product lines\n8.8\n%\n3.5\n%\n47.3\n%\n47.1\n%\nTotal non-fasteners\n9.0\n%\n4.7\n%\n69.4\n%\n69.1\n%\nFrom an end market standpoint, we have four categories: heavy manufacturing, other manufacturing, non-residential construction, and other, the latter of which includes reseller, government/education, transportation, warehousing and storage, and data centers. \nOur manufacturing end markets are outperforming primarily due to the relative strength we are experiencing with key account customers with significant managed spend where our service model and technology is particularly impactful. This disproportionately benefits manufacturing customers. Other end market sales are improving primarily as a result of strength with transportation, education and healthcare, and data center customers due to market share gains and product mix. The DSR change when compared to the same period in the prior year and the percent of sales in the period were as follows:\nDSR Change\nNine-month Period\n% of Sales\nNine-month Period\n2025\n2024\n2025\n2024\nHeavy manufacturing\n8.2\n%\n1.7\n%\n43.1\n%\n43.2\n%\nOther manufacturing \n11.4\n%\n4.2\n%\n32.9\n%\n32.0\n%\nTotal manufacturing\n9.6\n%\n2.8\n%\n76.0\n%\n75.2\n%\nNon-residential construction\n2.4\n%\n-5.2\n%\n8.1\n%\n8.6\n%\nOther end markets\n6.2\n%\n1.7\n%\n15.9\n%\n16.2\n%\nTotal non-manufacturing\n4.9\n%\n-0.8\n%\n24.0\n%\n24.8\n%\nFrom a customer standpoint, we have two categories: contracts, which include national multi-site, local and regional, and government customers with significant revenue potential, and non-contracts, which include all other customers. Sales with our contract customers continue to outperform as we realize incremental sales from implementing strong customer signings that we have achieved since the first quarter of 2024, which was partially offset by subdued business activity. Non-contract customers tend to be smaller and utilize fewer of our tools and capabilities, providing fewer avenues for share gains and therefore more closely reflect overall business trends, which remain sluggish. The DSR change when compared to the same period in the prior y\near and the percent of sales in the period were as follows:\nDSR Change\nNine-month Period\n% of Sales\nNine-month Period\n2025\n2024\n2025\n2024\nContract sales\n11.0\n%\n6.8\n%\n73.4\n%\n71.3\n%\nNon-contract sales\n2.0\n%\n-8.6\n%\n26.6\n%\n28.7\n%\n24\nTable of Contents\nWe signed \n19,925 weighted FASTBin and FASTVend devices in the first nine months of 2025.\nThe table below summarizes signings and installations of our FMI devices and sales through our FMI devices, eBusiness\n(1)\n tools, and Digital Footprint\n(2)\n.\nNine-month Period\n2025\n2024\nDSR\nChange \n(3)\nWeighted FASTBin/FASTVend signings (MEUs)\n19,925 \n21,194 \n-6.0\n%\nSignings per day\n104 \n110 \nWeighted FASTBin/FASTVend installations (MEUs; end of period)\n133,910 \n123,193 \n8.7\n%\nFASTStock sales\n$\n777.2 \n728.9 \n7.2\n%\n% of sales\n12.4\n%\n12.6\n%\nFASTBin/FASTVend sales\n$\n1,988.8 \n1,710.7 \n16.9\n%\n% of sales\n31.8\n%\n29.5\n%\nFMI sales\n$\n2,766.0 \n2,439.6 \n14.0\n%\nFMI daily sales\n$\n14.5 \n12.7 \n% of sales\n44.3\n%\n42.1\n%\n eBusiness sales\n$\n1,868.3 \n1,686.1 \n11.4\n%\n% of sales\n29.9\n%\n29.1\n%\nLess: eBusiness and FMI sales overlap\n$\n817.8 \n658.4 \n24.9\n%\n% of sales\n13.1\n%\n11.4\n%\nDigital Footprint sales\n$\n3,816.5 \n3,467.3 \n10.6\n%\n% of sales\n61.1\n%\n59.9\n%\n(1)\nOur eBusiness includes eProcurement activities, which are integrated transactions, including electronic data interchange (EDI), and eCommerce (transactional website sales).\n(2)\nDigital Footprint is a combination of our sales through FMI (FASTStock, FASTBin, and FASTVend) plus that portion of our eBusiness sales that does not represent billings of FMI services.\n(3)\nWeighted FASTBin/FASTVend signings and installations reflects the percent change compared to the same period in the prior year.\nGross Profit\nOur gross profit, as a percentage of net sales, was 45.2% in the first nine months of 2025 and the first nine months of 2024. T\nhe fastener expansion project, other supplier-focused initiatives, slightly favorable price/cost, and improvements in customer and supplier incentives increased our gross profit percentage in the first nine months of 2025. The aforementioned positive effects on our gross profit percentage were offset by a number of variables. First, customer and product mix diluted our gross profit percentage. This reflects relatively stronger growth from large customers, including Onsite-like customers, and non-fastener products, each of which tend to have a lower gross profit percentage than our business as a whole. Second, we experienced higher freight costs. Third, we experienced higher organizational/overhead costs, primarily due to certain working capital being relieved from inventory generating higher period costs. \n25\nTable of Contents\nSG&A Expenses\nOur SG&A expenses, as a percentage of net sales, were 24.6% in the first nine months of 2025 down from 24.8% in the first nine months of 2024. \nEfforts to control growth in operating expenses in the first nine months of 2025 produced a 7.2% expansion of total SG&A expenses in the period. Growth in net sales was above growth in SG&A expenses, resulting in our leveraging of costs in the first nine months of 2025.\nThe percentage change in employee-related, occupancy-related, and all other SG&A expenses compared to the same period in the preceding year, is outlined in the table below. \nApproximate Percentage of Total SG&A Expenses\nNine-month Period\n2025\nEmployee-related expenses\n70% to 75%\n8.5\n%\nOccupancy-related expenses\n15% to 20%\n4.9\n%\nAll other SG&A expenses\n10% to 15%\n2.8\n%\nIn the first nine months of 2025, our employee-related expenses increased when compared to the first nine months of 2024.\n Bonus and commission expense grew faster than the increase in net sales, as a result of improved sales and profit growth versus the prior year period. We experienced an increase in employee base pay due to higher average FTE and average wages during the period. Additionally, healthcare costs increased. \nThe table below summarizes our FTE headcount at the end of the periods presented and the percentage change compared to the end of the prior\n period:\nChange\nSince:\nQ3\n2025\nQ4\n2024 \n(1)\nQ4\n2024\nSelling personnel \n(2)\n15,414 \n15,014 \n2.7\n%\nDistribution/Transportation personnel\n3,057 \n2,997 \n2.0\n%\nManufacturing personnel\n973 \n936 \n4.0\n%\nOrganizational support personnel \n(3)\n2,124 \n2,011 \n5.6\n%\nTotal personnel\n21,568 \n20,958 \n2.9\n%\n(1)\nIn the fourth quarter of 2024, we realigned certain employees as a result of a routine review of our organizational structure. While there was no change to total absolute or total FTE headcount, it produced minor shifts between headcount categories. Historical numbers have been adjusted to reflect this realignment.\n(2)\nOf our Selling personnel, 80%-85% are attached to a specific in-market location.\n(3)\nOrganizational support personnel consists of: (1) Sales Support personnel (37% to 42% of category), which includes sourcing, purchasing, supply chain, product development, etc.; (2) IT personnel (35% to 40% of category); and (3) Administrative Support personnel (22% to 27% of category), which includes human resources, Fastenal School of Business, accounting and finance, senior management, etc.\nIn the first nine months of 2025, our occupancy-related expense\ns increased wh\nen compared to the first nine months of 2024. We had moderate increases in branch costs related to inflation, as well as non-branch expenses from incremental depreciation and other costs associated with hub investments and upgrades. FMI FASTBin depreciation and expense increased, reflecting higher installations. \nCombined, all other SG&A expenses increased in the first nine months of 2025 when compared to the first nine months of 2024. \nThis reflects a number of items. \nSelling-related transportation costs were higher, reflecting higher lease costs, which were only partially offset by lower fuel expense. We had relatively smaller increases in IT, sales-related travel expense, bad debt expense, and realized losses on currency conversion, which were partially offset by increases in joint marketing efforts with our suppliers and reductions in general insurance expense.\nOperating Income\nOur operating income, as a percentage of net sales, increased to 20.6% in the first nine months of 2025 from 20.4% in the first nine months of 2024. \n26\nTable of Contents\nNet Interest\nWe had slightly higher interest income in the first nine months of 2025 and lower interest expense in the first nine months of 2025\n. Th\ne increase i\nn interest income relative to interest expense resulted in net interest\n expense of $1.0 in the first nine months of 2025, compared to net interest expense of $1.4 in the first nine months of 2024.\nIncome Taxes\nWe recorded income tax expense of $306.0 in the first nine months of 2025, or 24.1% of income before income taxes. Income tax expense was $275.3 in the first nine months of 2024, or 23.7% of income before income taxes. Our tax rate in the first nine months of 2025 was below our expected ongoing tax rate due to the tax benefits associated with the exercise of stock options during the period, and a decrease in our liability for unrecognized tax benefits in the third quarter of 2025. These reductions were partially offset by the return to provision adjustments processed in the third quarter of 2025. We\n believe our ongoing tax rate, absent any discrete tax items or broader changes to tax law, will be approximately 24.5%. \nNet Income\nOur net income during the first nine months of 2025 was $964.4, an increase of 8.5% compared to the first nine months of 2024. Our diluted net income per share was $0.84 in the first nine months of 2025, compared to $0.77 in the first nine months of 2024.\nLiquidity and Capital Resources\nCash flow activity was as follows for the periods ended September 30:\n \nNine-month Period\n \nFive-Year Average\n (1)\n2025\n2024\nChange\nNet cash provided by operating activities\n$\n927.8 \n890.5 \n4.2\n%\n% of net income\n100.8\n%\n96.2\n%\n100.2\n%\nNet cash used in investing activities\n$\n173.1 \n157.0 \n10.3\n%\n% of net income\n19.6\n%\n17.9\n%\n17.7\n%\nNet cash used in financing activities\n$\n732.7 \n663.6 \n10.4\n%\n(1)  \nFive-year average includes 2020 to 2024.\nNet Cash Provided by Operating Activities\nNet cash provided by op\nerating activities increased $37.3 in the first nine\n months of \n2025\n when compared to the first \nnine\n months of \n2024\n.\n \nThe decrease in operating cash flow, as a percent of net income, primarily reflects our operating assets and liabilities being a more significant use of cash, which was only partially offset by a reduction in estimated income tax payments in the first nine months of 2025 than in the first nine months of 2024.\nNet Cash Used in Investing Activities\nNet \ncash used in investing activities increased $16.1 in the first nine months of 2025 when compared to the first nine months of 2024.\nDuring the first nine months of 2025, our net capital expenditures were $172.8, which was an increase from $156.7 in the first nine months of 2024. \nThis was primarily related to an increase in spending on FMI hardware to support growth in our installed base, facility construction and upgrades, IT, and vehicles.\nNet Cash Used in Financing Activities\nNet cash used in financing activities increased $69.1 in the first nine months of 2025 when \ncompared to the first \nnine\n months of 2024. This was primarily due to reducing our net indebtedness less in the first nine months of 2025 than we did in the first nine months of 2024. This was partly offset by an increase in capital returned to shareholders through dividends in the period.\nDuring the first nine months of 2025, we ret\nurned $751.6 to o\nur shareholders in the f\norm of dividends, compared to the first nine months of 2024 when we returned $669.9 to our shareholders in the form of dividends. We did not repurchase any of our common stock in either period.\n27\nTable of Contents\nCritical Accounting Policies and Estimates – \nA discussion of our critical accounting policies and estimates is contained in our 2024 annual report on Form 10-K. There have been no material changes from the critical accounting policies and estimates disclosed in our annual report on Form 10-K.\nRecently Issued and Adopted Accounting Pronouncements – \nA description of recently issued and adopted accounting pronouncements, if any, is contained in Note 1 of the Notes to Condensed Consolidated Financial Statements. \nForward-Looking Statements –\n Certain statements contained in this quarterly report on Form 10-Q do not relate strictly to historical or current facts. As such, they are considered 'forward-looking statements' that provide current expectations or forecasts of future events. These forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements can be identified by the use of terminology such as anticipate, believe, should, estimate, expect, intend, may, will, plan, goal, project, hope, trend, target, opportunity, and similar words or expressions, or by references to typical outcomes. Any statement that is not a purely historical fact, including estimates, projections, trends, and the outcome of events that have not yet occurred, is a forward-looking statement. Our forward-looking statements generally relate to our expectations and beliefs regarding the business environment in which we operate, our projections of future performance, our perceived marketplace opportunities, our strategies, goals, mission and vision, our expectations related to future capital expenditures, future investment in property and equipment, future tax rates, including anticipated tax impacts from recent legislation, future inventory levels, the declaration and payment of dividends, pricing, weighted FMI device signings, the impact of inflation on our cost of goods or SG&A expenses, the impact of price increases on overall sales growth or margin performance, and our ability to grow our business through the enhancement of sales through our Digital Footprint. You should understand that forward-looking statements involve a variety of risks and uncertainties, known and unknown, and may be affected by inaccurate assumptions. Consequently, no forward-looking statement can be guaranteed and actual results may vary materially. Factors that could cause our actual results to differ from those discussed in the forward-looking statements include, but are not limited to, economic downturns, weakness in the manufacturing or commercial construction industries or any of our end markets, competitive pressure on selling prices, changes in our current mix of products, customers, or geographic locations, changes in our average branch size, changes in our purchasing patterns, changes in customer needs, changes in fuel or commodity prices, inclement weather, changes in foreign currency exchange rates, difficulty in adapting our business model to different foreign business environments and the challenges of operating in foreign business environments, failure to accurately predict the market potential of our business strategies, the introduction or expansion of new business strategies, weak acceptance or adoption of our FMI offering, increased competition in FMI, difficulty in maintaining installation quality as our FMI business expands, the leasing to customers of a significant number of additional FMI devices, the failure to meet our goals and expectations regarding branch openings, branch closings, or expansion of our FMI offering, the failure to realize expected benefits from the completion of our strategic rationalization, changes in the implementation objectives of our business strategies, challenges in developing and expanding our digital capabilities, difficulty in hiring, relocating, training, or retaining qualified personnel, difficulty in controlling SG&A expenses, including FTE growth, difficulty in collecting receivables or accurately predicting future inventory needs, dramatic changes in sales trends, changes in supplier production lead times, short-term inefficiencies in our supply chain may not normalize or result in certain warehousing customer growth, changes in our cash position or our need to make capital expenditures, credit market volatility, changes in tax law or the impact of any such changes on future tax rates, changes in tariffs or the impact of any such changes on our financial results, changes in the availability or price of commercial real estate, changes in the nature, price, or availability of distribution, supply chain, or other technology (including software licensed from third parties) and services related to that technology, cyber-security incidents, potential liability and reputational damage that can arise if our products are defective, difficulties measuring the contribution of price increases on sales growth, acts of war, and other risks and uncertainties detailed in our filings with the Securities and Exchange Commission, including our most recent annual and quarterly reports. Each forward-looking statement speaks only as of the date on which such statement is made, and we undertake no obligation to update any such statement to reflect events or circumstances arising after such date.\n28\nTable of Contents"
}