{
  "source_file": "fcx-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nIn Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A), “we,” “us” and “our” refer to Freeport-McMoRan Inc. (FCX) and its consolidated subsidiaries. You should read this discussion in conjunction with our consolidated financial statements, the related MD&A and the discussion of our Business and Properties in our annual report on Form 10-K for the year ended December 31, 2024 (2024 Form 10-K), filed with the United States (U.S.) Securities and Exchange Commission (SEC). The results of operations reported and summarized below include forward-looking statements that are not guarantees of future performance and are not necessarily indicative of future operating results (refer to “Cautionary Statement” for further discussion). References to “Notes” are Notes included in our Notes to Consolidated Financial Statements (Unaudited). Throughout MD&A, all references to income or losses per share are on a diluted basis. Any references to our website are for information only and the contents of our website or information connected thereto are not incorporated in, or otherwise to be regarded as part of, this Form 10-Q.\nOVERVIEW\nWe are a leading international metals company with the objective of being foremost in copper. Headquartered in Phoenix, Arizona, we operate large, long-lived, geographically diverse assets with significant proven and probable mineral reserves of copper, gold and molybdenum. We are one of the world’s largest publicly traded copper producers. Our portfolio of assets includes the Grasberg minerals district in Indonesia, one of the world’s largest copper and gold deposits; and significant operations in the U.S. and South America, including the large-scale Morenci minerals district in Arizona and the Cerro Verde operation in Peru.\nAs a leading global supplier of copper and other metals with large-scale production, significant reserves and resources and an attractive pipeline for future growth, we are focused on the important role we play to provide copper, gold and molybdenum reliably and responsibly to a world with growing demand for metals.\nWe continue to incorporate new applications, technologies and data analytics into our leaching processes, and are applying operational enhancements on a larger scale and advancing testing of innovative technology to increase production from these initiatives. We are targeting annual production of 300 million pounds of copper in 2026 from these initiatives and believe we have the potential for further significant increases in recoverable metal beyond the current target run rate. Continued success with these initiatives would be expected to contribute to favorable adjustments in recoverable copper in leach stockpiles and favorably impact average unit net cash costs.\nOur third-quarter 2025 results were impacted by the tragic mud rush incident that occurred on September 8, 2025, in the Grasberg minerals district. The entire FCX organization is grieving the loss of our seven team members and we remain steadfast in our commitment to prioritize the safety of our workforce above all else. Refer to further discussion of the mud rush incident below.\nNet income attributable to common stockholders totaled $674 million in third-quarter 2025 and $1.8 billion for the first nine months of 2025, compared with $526 million in third-quarter 2024 and $1.6 billion for first nine months of 2024. Higher net income in the 2025 periods, compared to the 2024 periods, primarily reflects higher operating income from our U.S. and South America mining operations, partly offset by lower financial results from Indonesia operations as a result of the mud rush incident. Refer to “Consolidated Results” for further discussion.\nAt September 30, 2025, we had consolidated debt of $9.3 billion and consolidated cash and cash equivalents of $4.3 billion. Net debt totaled $1.75 billion, excluding $3.2 billion of debt for PT Freeport Indonesia’s (PTFI) new smelter and precious metals refinery (PMR) (collectively, PTFI’s downstream processing facilities). Refer to “Net Debt” for a reconciliation of consolidated debt and consolidated cash and cash equivalents to net debt.\nAt September 30, 2025, we had $3.0 billion of availability under our revolving credit facility, and PTFI and Cerro Verde had $1.5 billion and $350 million, respectively, of availability under their revolving credit facilities.\nRefer to Note 4 and “Capital Resources and Liquidity” for further discussion.\n24\nTable of Contents\n                  \nGRASBERG MINERALS DISTRICT MUD RUSH INCIDENT\nOn September 8, 2025, PTFI experienced a mud rush incident that resulted in seven fatalities. During the incident, which was unprecedented in PTFI’s multi-decade history of block cave mining in the Grasberg minerals district, a sudden rush of approximately 800,000 metric tons of wet material entered the Grasberg Block Cave underground mine from the former Grasberg open pit and traveled rapidly to multiple levels of the mine, including a service level where seven team members were later found deceased. \nMining operations were temporarily suspended following the incident to prioritize the recovery of the seven team members fatally injured during the incident and to conduct an investigation into the root cause of the incident. The recovery efforts were completed on October 5, 2025, and the investigation is advancing toward completion. Damage assessments, which are expected to be completed by year-end 2025, are being conducted in parallel with ongoing mud removal activities. \nIn late October 2025, PTFI restarted operations at the unaffected Big Gossan and Deep Mill Level Zone (DMLZ) underground mines. A phased restart and ramp-up of the Grasberg Block Cave underground mine is anticipated to begin during 2026.\nSmelting operations in Indonesia operated with limited availability since the incident, and both smelters are currently on stand-by status pending the delivery of copper concentrate. We expect higher variability between PTFI production and sales until PTFI’s downstream processing facilities achieve normalized operating rates.    \nWe and PTFI, including external experts, are completing an investigation of the root cause of the incident and to identify actions required to safeguard against recurrence. In parallel, and in coordination with Indonesia government authorities, future production plans are being evaluated and damage assessments are being completed. \nDuring third-quarter 2025, PTFI recorded charges totaling $195 million associated with the mud rush incident, including $152 million for idle facility costs and $43 million related to recovery efforts. During the phased restart and ramp-up of operations in fourth-quarter 2025 and in 2026, a portion of PTFI’s cost of sales are expected to be recognized as idle facility costs, which are non-inventoriable costs. \nAs of September 30, 2025, PTFI had limited access to the area where the incident occurred and was unable to adequately assess damage to the impacted assets. Accordingly, no impairment charges were recorded in third-quarter 2025. Upon completion of damage assessments and evaluation of the affected infrastructure in fourth-quarter 2025, PTFI expects to write-off the carrying value of assets determined to be damaged beyond repair. Furthermore, we do not believe the incident indicates a broader impairment of PTFI’s long-lived mining assets based on PTFI’s reserve life, favorable market outlook for metal prices and expected resumption of operations at the Grasberg Block Cave underground mine in the near term. \nWhile evaluation of PTFI’s operating plans, including production and sales estimates and cost and capital budgets are ongoing, and revised plans are expected to be finalized following completion of the investigation and damage assessments, we expect the incident to have a significant impact on our fourth-quarter 2025 and 2026 operating and financial results. FCX plans to hold a conference call with analysts and investors on November 18, 2025, to provide a report on the investigation of the mud rush incident and present FCX’s multi-year operational and financial outlook, including for PTFI.\nPTFI is seeking recovery of damages under its property and business interruption insurance policies, which cover up to $1.0 billion in losses (subject to a limit of $0.7 billion on underground incidents), after a $0.5 billion deductible. PTFI’s ability to recover damages under its insurance coverage with respect to the mud rush incident is subject to certain conditions. Any amounts recoverable under PTFI’s insurance policies will be reflected in future periods in which recovery is considered realizable in accordance with the gain contingency accounting guidance.\nAs a result of the incident and impact on operations, PTFI has also notified certain commercial counterparties of a force majeure under its contracts.\n25\nTable of Contents\n                  \nOUTLOOK\nOur financial results vary as a result of fluctuations in market prices primarily for copper, gold and, to a lesser extent, molybdenum, as well as other factors. World market prices for these commodities have fluctuated historically and are affected by numerous factors beyond our control. Refer to “Markets” below and “Risk Factors” in Part I, Item 1A. of our 2024 Form 10-K for further discussion. Because we cannot control the prices of our products, the key measures that management focuses on in operating our business are sales volumes, unit net cash costs, operating cash flows and capital expenditures. In addition, as a result of the September 2025 mud rush incident at PTFI, our consolidated sales volumes, unit net cash costs, operating cash flows and capital expenditures for the year 2025 have been revised, compared to the guidance provided in our quarterly report on Form 10-Q for the quarter ended June 30, 2025. \nThe forward-looking statements in the below section and elsewhere in this quarterly report on Form 10-Q are based on current market conditions, are as of the filing date of this quarterly report on Form 10-Q, are based on several assumptions and are subject to significant risks and uncertainties. Refer to “Cautionary Statement” below.\nConsolidated Sales Volumes\nFollowing are our projected consolidated sales volumes for the year 2025:\nCopper\n (millions of recoverable pounds):\n \nU.S. copper mines\n1,289 \nSouth America operations\n1,058 \nIndonesia operations\n1,153 \nTotal\n3,500 \nGold\n (millions of recoverable ounces)\n1.05 \nMolybdenum\n (millions of recoverable pounds)\n82 \na\n \na.\nIncludes 46 million pounds produced by our U.S. copper mines and Cerro Verde mine and 36 million pounds produced by our primary molybdenum mines.\nProjected consolidated sales volumes in fourth-quarter 2025 reflect minimal volumes from Indonesia operations and are expected to approximate 635 million pounds of copper, 60 thousand ounces of gold and 21 million pounds of molybdenum. \nProjected sales volumes are dependent on operational performance; the timing of restarting and ramping up mining and smelting operations at PTFI following the September 2025 mud rush incident; weather-related conditions; timing of shipments and other factors detailed in the “Cautionary Statement” below. For other important factors that could cause results to differ materially from projections, refer to “Risk Factors” contained in Part I, Item 1A. of our 2024 Form 10-K.\nConsolidated Unit Net Cash Costs\n \nConsolidated unit net cash costs (net of by-product credits and excluding estimated expenses attributable to the September 2025 mud rush incident at PTFI for idle facility costs and recovery efforts) for our copper mines are expected to average $1.68 per pound of copper for the year 2025, based on achievement of current sales volume and cost estimates, and assuming average prices of $4,000 per ounce of gold and $25.00 per pound of molybdenum in fourth-quarter 2025. Quarterly unit net cash costs vary with fluctuations in sales volumes by region, including the ratio of copper and gold sales within a period, and realized prices, primarily for gold and molybdenum. The impact of price changes during fourth-quarter 2025 on consolidated unit net cash costs for the year 2025 would approximate $0.01 per pound of copper for each $2 per pound change in the average price of molybdenum. \nConsolidated Operating Cash Flows\nOur consolidated operating cash flows vary with sales volumes; prices realized from copper, gold and molybdenum sales; production costs; income taxes; other working capital changes; and other factors, including the timing of restarting and ramping up mining and smelting operations at PTFI following the September 2025 mud rush incident. Consolidated operating cash flows are estimated to approximate $5.5 billion for the year 2025, net of $0.7 billion of working capital and other uses, based on current sales volume and cost estimates, and assuming prices of $4.75 per pound of copper, $4,000 per ounce of gold and $25.00 per pound of molybdenum in fourth-quarter 2025. Estimated consolidated operating cash flows for the year 2025 also reflect a projected income tax provision of $2.2 \n26\nTable of Contents\n                  \nbillion (refer to “Consolidated Results – Income Taxes” for further discussion of our projected income tax rate for the year 2025). The impact of price changes in fourth-quarter 2025 on consolidated operating cash flows are estimated to approximate $80 million for each $0.10 per pound change in the average price of copper, $15 million for each $100 per ounce change in the average price of gold and $30 million for each $2 per pound change in the average price of molybdenum. \nConsolidated Capital Expenditures\n \nFollowing is a summary of expected capital expenditures for the year 2025 (in billions):\nMajor projects\n$\n2.3 \na\nPTFI’s downstream processing facilities\n0.6 \nSustaining capital and other\n1.6 \nTotal\n$\n4.5 \na.\nIncludes $950 million for planned projects, primarily associated with underground mine development, supporting mill and power capital costs and a portion of spending on a new gas-fired combined cycle facility in the Grasberg minerals district, and potential U.S. expansion projects, and $1.35 billion for discretionary growth projects, primarily in the Grasberg minerals district for the continued development of Kucing Liar and at the Bagdad mine for tailings infrastructure.\nWe are carefully managing operating costs and near-term capital expenditures in connection with revised operating plans at the Grasberg minerals district to manage cash flow and liquidity during the phased ramp-up period. \nMARKETS\nPrices for copper, gold and molybdenum are affected by numerous factors beyond our control and can fluctuate significantly (for further discussion refer to “Risk Factors” contained in Part I, Item 1A. of our 2024 Form 10-K). The following graphs present the London Metal Exchange (LME) and Commodity Exchange Inc. (COMEX) copper settlement prices, the London Bullion Market Association (London) PM gold prices, and the \nPlatts Metals Daily\n Molybdenum Dealer Oxide weekly average prices since January 2015.\nThis graph presents LME and COMEX copper settlement prices and the combined reported stocks of copper at the LME, COMEX and the Shanghai Futures Exchange from January 2015 through September 2025. LME and COMEX \n27\nTable of Contents\n                  \ncopper prices are market-driven and subject to change based on current and future tariff rates, additional changes in trade policies, domestic inventory levels, supply and demand, and other factors. \nCopper priced on the LME and COMEX exchanges have historically traded in a narrow range with no material differential. Following U.S. trade policy announcements earlier in 2025, including proposed tariff announcements, the two benchmark prices began to differ and the spread significantly widened during July 2025. Effective August 1, 2025, a 50% tariff was imposed under Section 232 of the Trade Expansion Act, targeting U.S. imports of semi-finished copper products and copper-intensive derivative products. However, refined copper, including cathodes, concentrates and scrap, was exempted from the tariff and the U.S. government has indicated it will reassess by mid-2026 the potential for a refined copper tariff of 15% beginning in January 2027 and rising to 30% in 2028. Differences between COMEX and LME copper prices were present during third-quarter 2025, with the average COMEX copper settlement price 9% higher than the average LME copper settlement price. Both COMEX and LME copper prices have risen following the September 2025 mud rush incident, with LME settlement copper price hitting an all-time high of $5.02 per pound in October 2025. As of October 31, 2025, the COMEX copper settlement price of $5.07 per pound was 3% higher than the LME copper settlement price of $4.94 per pound.\nCopper sales from our South America and Indonesia operations are generally based on quoted LME monthly average copper settlement prices. During third-quarter 2025, LME copper settlement prices averaged $4.44 per pound (ranging from a low of $4.33 per pound to a high of $4.68 per pound) and closed at $4.67 per pound on September 30, 2025. \nCopper sales from our U.S. copper mines are generally based on prevailing COMEX monthly average copper settlement prices. During third-quarter 2025, COMEX copper settlement prices averaged $4.84 per pound (ranging from a low of $4.33 per pound to an all-time high of $5.80 per pound) and closed at $4.81 per pound on September 30, 2025. \nWe believe fundamentals for copper are favorable with growing demand supported by copper’s critical role in the global transition to renewable power, electric vehicles and other carbon-reduction initiatives, continued urbanization in developing countries, data centers, increased defense spending and growing connectivity globally.\nThis graph presents London PM gold prices from January 2015 through September 2025. During third-quarter 2025, London PM gold prices averaged $3,457 per ounce (ranging from a low of $3,299 per ounce to a high of $3,827 per ounce) and closed at $3,825 per ounce on September 30, 2025. The prospect of additional U.S. interest rate reductions, geopolitical tensions, trade uncertainty and strong demand from central banks around the world \n28\nTable of Contents\n                  \ncontinue to drive gold prices to record highs, with the London PM gold price reaching an all-time high of $4,294 per ounce in October 2025 and closing at $4,012 per ounce on October 31, 2025. \nThis graph presents the \nPlatts Metals Daily \nMolybdenum Dealer Oxide weekly average prices from January 2015 through September 2025. During third-quarter 2025, the weekly average prices for molybdenum averaged $24.33 per pound (ranging from a low of $22.10 per pound to a high of $25.93 per pound) and closed at $25.05 per pound on September 30, 2025. Overall global demand for molybdenum is driven by energy, power generation, aerospace, defense and construction sectors. We believe fundamentals for molybdenum are positive with favorable demand drivers and limited supply. The \nPlatts Metals Daily \nMolybdenum Dealer Oxide weekly average price closed at $24.09 per pound on October 31, 2025.\nCONSOLIDATED RESULTS\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nSUMMARY FINANCIAL DATA\n \n(in millions, except per share amounts)\nRevenues\na,b\n$\n6,972 \n$\n6,790 \n$\n20,282 \n$\n19,735 \nOperating income\na,c\n$\n1,972 \n$\n1,938 \n$\n5,707 \n$\n5,621 \nNet income attributable to common stock\nb,c\n$\n674 \nd\n$\n526 \ne\n$\n1,798 \nd\n$\n1,615 \ne\nDiluted net income per share of common stock\nb,c\n$\n0.46 \n$\n0.36 \n$\n1.24 \n$\n1.11 \nDiluted weighted-average shares of common stock outstanding\n1,443 \n1,444 \n1,443 \n1,445 \nOperating cash flows\nf\n$\n1,664 \n$\n1,872 \n$\n4,917 \n$\n5,724 \nCapital expenditures\n$\n1,056 \n$\n1,199 \n$\n3,489 \n$\n3,569 \nAt September 30:\nCash and cash equivalents\n$\n4,318 \n$\n5,000 \n$\n4,318 \n$\n5,000 \nTotal debt, including current portion\n$\n9,298 \n$\n9,679 \n$\n9,298 \n$\n9,679 \na.\nRefer to Note 8 for a summary of revenues and operating income by operating division. \n29\nTable of Contents\n                  \nb.\nIncludes favorable (unfavorable) adjustments to prior period provisionally priced concentrate and cathode copper sales totaling $11 million ($1 million to net income attributable to common stock or less than $0.01 per share) in third-quarter 2025, $(32) million ($(13) million to net income attributable to common stock or $(0.01) per share) in third-quarter 2024, $63 million ($21 million to net income attributable to common stock or $0.01 per share) for the first nine months of 2025 and $28 million ($9 million to net income attributable to common stock or $0.01 per share) for the first nine months of 2024. Refer to Note 5 for further discussion.\nc.\nWe defer recognizing profits on intercompany sales until final sales to third parties occur. Changes in these deferrals attributable to variability in intercompany volumes resulted in net additions (reductions) to operating income totaling $13 million ($15 million to net income attributable to common stock or $0.01 per share) in third-quarter 2025, $(42) million ($(13) million to net income attributable to common stock or $(0.01) per share) in third-quarter 2024, $161 million ($58 million to net income attributable to common stock or $0.04 per share) for the first nine months of 2025 and $79 million ($23 million to net income attributable to common stock or $0.02 per share) for the first nine months of 2024. Refer to “Operations – Downstream Processing Facilities\n.”\nd.\nIncludes net charges totaling $48 million in third-quarter 2025 and $72 million for the first nine months of 2025, primarily related to idle facility costs and recovery efforts associated with the September 2025 mud rush incident at PTFI, PTFI smelter fire repair costs not recoverable by insurance, and oil and gas impairments, partly offset by net favorable adjustments to environmental obligations and a gain on sales of assets. The first nine months of 2025 also include charges for previously capitalized costs associated with PTFI’s downstream processing facilities, partly offset by an adjustment to PTFI’s asset retirement obligation. \ne.\nIncludes net charges totaling $30 million in third-quarter 2024 and $81 million for the first nine months of 2024, primarily associated with impairments for legacy oil and gas matters and nonrecurring labor-related charges at Cerro Verde associated with new collective labor agreements (CLA), partly offset by a reduction in accruals for uncertain U.S. tax positions. The first nine months of 2024 also included charges associated with assumed oil and gas abandonment obligations resulting from bankruptcies of other companies, revisions to environmental obligation estimates and related litigation reserves, and inventory adjustments/write-offs.\nf.\nCash used for working capital totaled $168 million in third-quarter 2025, $5 million in third-quarter 2024, $510 million for the first nine months of 2025 and $29 million for the first nine months of 2024.\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nSUMMARY OPERATING DATA\nCopper \n(millions of recoverable pounds)\n \n \nProduction\n912 \n1,051 \n2,743 \n3,173 \nSales, excluding purchases\n977 \n1,035 \n2,865 \n3,074 \nAverage realized price per pound\n$\n4.68 \n$\n4.30 \n$\n4.55 \n$\n4.26 \nSite production and delivery costs per pound\na\n$\n2.71 \nb\n$\n2.61 \n$\n2.67 \nb\n$\n2.49 \nUnit net cash costs per pound\na\n$\n1.40 \nb\n$\n1.39 \n$\n1.51 \nb\n$\n1.53 \nGold \n(thousands of recoverable ounces)\n \n \nProduction \n287 \n456 \n891 \n1,448 \nSales, excluding purchases \n336 \n558 \n986 \n1,487 \nAverage realized price per ounce\n$\n3,539 \n$\n2,568 \n$\n3,359 \n$\n2,362 \nMolybdenum\n (millions of recoverable pounds)\n \n \nProduction \n22 \n20 \n67 \n58 \nSales, excluding purchases \n19 \n19 \n61 \n60 \nAverage realized price per pound\n$\n24.07 \n$\n22.88 \n$\n22.22 \n$\n21.63 \na.\nReflects per pound weighted-average production and delivery costs and unit net cash costs (net of by-product credits) for all copper mines, before net noncash and other costs. For reconciliations of per pound unit net cash costs (credits) by operating division to production and delivery costs applicable to sales reported in our consolidated financial statements, refer to “Product Revenues and Production Costs.”  \nb.\nExcludes $171 million of idle facility costs and recovery expenses associated with the September 2025 mud rush incident at PTFI. Refer to “Grasberg Minerals District Mud Rush Incident” for further discussion. \n30\nTable of Contents\n                  \nRevenues\nConsolidated revenues totaled $7.0 billion in third-quarter 2025, $6.8 billion in third-quarter 2024, $20.3 billion for the first nine months of 2025 and $19.7 billion for the first nine months of 2024. Revenues from our mining operations and processing facilities primarily include the sale of copper cathode, copper in concentrate, copper rod, gold in concentrate and anode slimes, gold bars and molybdenum. Refer to Note 8 for a summary of product revenues. \nFollowing is a summary of changes in our consolidated revenues between periods (in millions):\nThree Months Ended September 30\nNine Months Ended September 30\nConsolidated revenues – 2024 period\n$\n6,790 \n$\n19,735 \n(Lower) higher sales volumes:\nCopper\n(252)\n(893)\nGold\n(573)\n(1,186)\nMolybdenum\n9 \n21 \nHigher average realized prices:\nCopper\n371 \n831 \nGold\n325 \n982 \nMolybdenum\n23 \n36 \nAdjustments for prior period provisionally priced copper sales\n43 \n35 \nHigher Atlantic Copper revenues\n9 \n9 \nLower revenues from purchased copper\n(132)\n(69)\nLower treatment charges\n97 \n273 \nLower royalties and export duties\n18 \n57 \nOther, including intercompany eliminations\n244 \n451 \nConsolidated revenues – 2025 period\n$\n6,972 \n$\n20,282 \nSales Volumes.\n Consolidated copper and gold sales volumes decreased in the 2025 periods, compared to the 2024 periods, primarily reflecting the temporary suspension of operations in Indonesia since the September 2025 mud rush incident at PTFI and lower ore grades in Indonesia. Lower copper and gold sales volumes for the first nine months of 2025, compared to the first nine months of 2024, also reflect the impact of lower operating rates in Indonesia resulting from planned major maintenance projects.\nRealized Prices.\n Our consolidated revenues can vary significantly as a result of fluctuations in the market prices of copper, gold and molybdenum. Our average realized prices in third-quarter 2025, compared with third-quarter 2024, were 9% higher for copper, 38% higher for gold and 5% higher for molybdenum. Average realized prices for the first nine months of 2025, compared with the first nine months of 2024, were 7% higher for copper, 42% higher for gold and 3% higher for molybdenum.\nDuring the third quarter and first nine months of 2025, our average U.S. copper price realization, which is generally based on COMEX settlement prices, was approximately 7% to 9% higher than the average copper price realizations for our South America and Indonesia operations, which are generally based on LME settlement prices. Refer to “Markets” for further discussion of COMEX and LME copper prices.\n \nAverage realized copper prices benefited from net favorable adjustments to current period provisionally priced copper sales totaling $71 million in third-quarter 2025, $61 million in third-quarter 2024, $169 million for the first nine months of 2025 and $248 million for the first nine months of 2024. As discussed in Note 5, certain sales contracts for copper and gold provide final pricing in a specified future month (generally one to four months from the shipment date). We record revenues and invoice customers at the time of shipment based on then-current LME prices for copper or London PM prices for gold, which results in an embedded derivative on provisionally priced sales that is adjusted to fair value through earnings each period, using the period-end forward prices, until final pricing on the date of settlement. To the extent final prices are higher or lower than what was recorded on a provisional basis, an increase or decrease to revenues is recorded each reporting period until the date of final pricing. Accordingly, in times of rising copper and gold prices, our revenues benefit from adjustments to the final pricing of provisionally priced sales pursuant to contracts entered into in prior periods; in times of falling copper and gold prices, the opposite occurs.\n31\nTable of Contents\n                  \nPrior Period Provisionally Priced Copper Sales.\n \nNet favorable (unfavorable) adjustments to prior periods’ provisionally priced copper sales (\ni.e.\n, provisionally priced sales at June 30, 2025 and 2024, and December 31, 2024 and 2023) recorded in consolidated revenues totaled $11 million in third-quarter 2025, $(32) million in third-quarter 2024, $63 million for the first nine months of 2025 and $28 million for the first nine months of 2024. Refer to Notes 5 and 8 for a summary of total adjustments to prior period and current period provisionally priced sales. \nAt September 30, 2025, we had provisionally priced copper sales totaling 205 million pounds (net of intercompany sales and noncontrolling interests) recorded at an average price of $4.65 per pound, subject to final pricing over the next several months. We estimate that each $0.05 change in the price realized from the September 30, 2025, recorded provisional price would have an approximate $20 million effect on 2025 revenues ($6 million to 2025 net income attributable to common stock). The LME copper settlement price closed at $4.94 per pound on October 31, 2025. \nAtlantic Copper Revenues.\n \nAtlantic Copper revenues totaled $774 million in third-quarter 2025, $765 million in third-quarter 2024 and $2.3 billion for each of the first nine months of 2025 and 2024.\nPurchased Copper.\n \nWe purchase copper cathode primarily for processing by our U.S. Rod & Refining operations. The volumes of copper purchases vary depending on cathode production from our operations and totaled 9 million pounds in third-quarter 2025, 36 million pounds in third-quarter 2024, 110 million pounds for the first nine months of 2025 and 142 million pounds for the first nine months of 2024. During 2025, we have been able to meet customer demand for copper rod primarily using copper cathode produced by our U.S. and South America mining operations, resulting in a decrease in purchased copper volumes.\nTreatment Charges.\n Revenues from our copper concentrate sales are recorded net of treatment charges, which will vary with the sales volumes and the price of copper. The decrease in treatment charges in the 2025 periods, compared to the 2024 periods, primarily reflects lower treatment charge rates as a result of favorable market conditions and copper concentrate sales volumes in Indonesia and South America.\nExport Duties and Royalties.\n Prior to the expiration of its export license on September 16, 2025, PTFI was assessed export duties on copper concentrate sales at a rate of 7.5%. PTFI pays royalties on all copper and gold sales, the amount of which varies with sales volumes and metal prices. \nProduction and Delivery Costs\nConsolidated production and delivery costs totaled $4.2 billion in third-quarter 2025, $4.1 billion in third-quarter 2024, $12.2 billion for the first nine months of 2025 and $11.8 billion for the first nine months of 2024. Production and delivery costs in the 2025 periods include $171 million of idle facility costs and recovery expenses\nassociated with the September 2025 mud rush incident at PTFI. The first nine months of 2025 also included charges totaling $73 million associated with planned maintenance turnaround costs at the Miami smelter and $39 million of tolling fees that were recognized as idle facility costs associated with PT Smelting’s planned maintenance turnaround (PT Smelting is PTFI’s 66%-owned smelter and refinery in Gresik, Indonesia). The first nine months of 2024 included charges of $99 million associated with assumed oil and gas abandonment obligations (and related adjustments) resulting from bankruptcies of other companies and $99 million for non-recurring labor-related charges at Cerro Verde associated with new CLAs. \nAs discussed in Note 7, as of September 30, 2025, PTFI had limited access to the area where the mud rush incident occurred and was unable to adequately assess damage to the impacted assets. Accordingly, no impairment charges were recorded in third-quarter 2025. Upon completion of damage assessments and evaluation of the affected infrastructure in fourth-quarter 2025, PTFI expects to write-off the carrying value of assets determined to be damaged beyond repair. Furthermore, we do not believe the incident indicates a broader impairment of PTFI’s long-lived mining assets based on PTFI’s reserve life, favorable market outlook for metal prices and expected resumption of operations at the Grasberg Block Cave underground mine in the near term. \nSite Production and Delivery Costs Per Pound.\n Site production and delivery costs for our copper mining operations primarily include labor, energy and other commodity-based inputs, such as sulfuric acid, steel, reagents, liners, tires and explosives. Consolidated site production and delivery costs (before net noncash and other costs) for our copper mines averaged $2.71 per pound of copper in third-quarter 2025, $2.61 per pound of copper in third-quarter 2024, $2.67 per pound of copper for the first nine months of 2025 and $2.49 per pound of copper for the first nine months of 2024. Consolidated site production and delivery costs per pound of copper exclude idle facility costs and recovery expenses associated with the September 2025 mud rush incident at PTFI (refer to “Product Revenues and \n32\nTable of Contents\n                  \nProduction Costs” for a summary of other amounts that are removed from site production and delivery costs and reflected as noncash and other costs, net, in the calculation of unit net cash costs). \nRefer to “Operations – Unit Net Cash Costs” and “Operations – Unit Net Cash (Credits) Costs” for further discussion of unit net cash costs (credits) associated with our operating divisions and to “Product Revenues and Production Costs” for reconciliations of per pound costs (credits) by operating division to production and delivery costs applicable to sales reported in our consolidated financial statements.\nDepreciation, Depletion and Amortization\nDepreciation will vary under the unit-of-production (UOP) method as a result of changes in sales volumes and the related UOP rates at our mining operations. Consolidated depreciation, depletion and amortization (DD&A) totaled $625 million in third-quarter 2025, $600 million in third-quarter 2024, $1.8 billion for the first nine months of 2025 and $1.7 billion for the first nine months of 2024. DD&A for the 2025 periods includes $24 million associated with idle facilities following the September 2025 mud rush incident at PTFI. \nWe currently expect DD&A to approximate $2.2 billion for the year 2025, which will include depreciation associated with capitalized costs for PTFI’s downstream processing facilities.\nEnvironmental Obligations and Shutdown Costs\nEnvironmental obligation costs reflect net revisions to our long-term environmental obligations, which vary from period to period because of changes to environmental laws and regulations, the settlement of environmental matters and/or circumstances affecting our operations that could result in significant changes in our estimates. Shutdown costs include care-and-maintenance costs and any litigation, remediation or related expenditures associated with closed facilities or operations.\nRefer to Note 7 for further discussion of updates to environmental obligations. \nInterest Expense, Net\nConsolidated interest costs (before capitalization) totaled $182 million in third-quarter 2025, $173 million in third-quarter 2024, $537 million for the first nine months of 2025 and $529 million for the first nine months of 2024. \nCapitalized interest, which primarily related to our mining operations’ capital projects, including construction and development of PTFI’s downstream processing facilities, totaled $75 million in third-quarter 2025, $101 million in third-quarter 2024, $278 million for the first nine months of 2025 and $280 million for the first nine months of 2024. Refer to “Capital Resources and Liquidity – Investing Activities” for discussion of capital expenditures associated with our major development projects.\nOther Income, Net\nOther income, net, which totaled $59 million in third-quarter 2025, $97 million in third-quarter 2024, $158 million for the first nine months of 2025 and $295 million for the first nine months of 2024, primarily includes amounts associated with interest income, currency exchange gains and losses, and mark-to-market impacts of trust assets used to satisfy financial assurance obligations for our New Mexico mining operations. Lower other income, net, in the 2025 periods, compared to the 2024 periods, primarily reflects lower interest income. The first nine months of 2024 also included a credit of $26 million associated with the reduction in the accrual to indemnify PT Mineral Industri Indonesia (MIND ID) from potential losses arising from PTFI’s historical tax disputes.\n33\nTable of Contents\n                  \nIncome Taxes \nFollowing is a summary of the approximate amounts used in the calculation of our consolidated income tax provision (in millions, except percentages):\nNine Months Ended September 30,\n2025\n2024\nIncome (Loss)\na\nEffective\nTax Rate\nIncome Tax (Provision) Benefit\nIncome (Loss)\na\nEffective\nTax Rate\nIncome Tax (Provision) Benefit\nU.S.\nb\n$\n153 \n3%\n$\n(4)\n$\n(393)\n8%\n$\n30 \nSouth America\n1,398 \n39%\n(546)\n1,196 \n40%\n(475)\nIndonesia\n3,953 \n36%\n(1,433)\n4,709 \n36%\n(1,706)\nPTFI historical tax matters\n5 \nN/A\n2 \n16 \nN/A\n182 \nEliminations and other\n97 \nN/A\n(60)\n139 \nN/A\n(46)\nRate adjustment\nc\n— \nN/A\n22 \n— \nN/A\n12 \nConsolidated FCX\n$\n5,606 \n36%\n$\n(2,019)\n$\n5,667 \n35%\n$\n(2,003)\na.\nRepresents income before income taxes, equity in affiliated companies' net (losses) earnings and noncontrolling interests.\nb.\nIn addition to our U.S. copper and molybdenum mines, which had operating income of $1.1 billion for the first nine months of 2025 and $558 million for the first nine months of 2024 (refer to Note 8), the U.S. jurisdiction reflects non-operating sites and corporate-level expenses, which include interest expense associated with our senior notes and general and administrative expenses. The U.S. jurisdiction also includes net revisions to environmental obligation estimates and charges associated with oil and gas abandonment obligations and impairments.\nc.\nIn accordance with applicable accounting rules, we adjust our interim provision for income taxes equal to our consolidated tax rate.\nAs discussed in Note 3, we do not expect H.R.1, which was signed into law on July 4, 2025, to have a material impact on our consolidated financial results.\nAssuming achievement of current sales volume and cost estimates and prices of $4.75 per pound of copper, $4,000 per ounce of gold and $25.00 per pound of molybdenum in fourth-quarter 2025, we estimate our consolidated effective tax rate for the year 2025 would approximate 36%. Changes in projected sales volumes and average prices during fourth-quarter 2025 would incur tax impacts at estimated effective rates of 39% for Peru, 36% for Indonesia and 0% for the U.S. \nNoncontrolling Interests\nNet income attributable to noncontrolling interests, which is primarily associated with our noncontrolling shareholders at PTFI, Cerro Verde and El Abra, totaled $573 million in third-quarter 2025, $710 million in third-quarter 2024, $1.8 billion for the first nine months of 2025 and $2.1 billion for the first nine months of 2024. Refer to Note 8 for net income attributable to noncontrolling interests for each of our business segments. \nOur economic and ownership interest in PTFI is 48.76%, except for net income associated with the settlement of historical tax matters, which is attributed based on the economics prior to January 1, 2023 (\ni.e.\n, approximately 81% to FCX and 19% to MIND ID).\nIn September 2024, we increased our ownership interest in Cerro Verde to 55.08% from 53.56%.\nBased on achievement of current sales volume and cost estimates, and assuming prices of $4.75 per pound of copper, $4,000 per ounce of gold and $25.00 per pound of molybdenum in fourth-quarter of 2025, we estimate that net income attributable to noncontrolling interests will approximate $2.0 billion for the year 2025. The impact of price changes on net income attributable to noncontrolling interests for the year 2025 would approximate $50 million for each $0.25 per pound change in the average LME copper settlement price in fourth-quarter 2025 (net income attributable to noncontrolling interests is not impacted by changes in the COMEX copper price). The actual amount will depend on various factors, including relative performance of each business segment, commodity prices, costs and other factors.\n34\nTable of Contents\n                  \nOPERATIONS\nLeaching and Technology Innovation Initiatives\nWe are continuing to incorporate new applications, technologies and data analytics into our leaching processes across our U.S. and South America operations. Incremental copper production from these initiatives totaled 56 million pounds in third-quarter 2025 and 154 million pounds for the first nine months of 2025. \nWe continue to apply operational enhancements on a larger scale and are advancing testing of innovative technology to increase production from these initiatives. We are targeting annual production of 300 million pounds of copper in 2026 from these initiatives and believe we have the potential for further significant increases in recoverable metal beyond the current target run rate. We are performing large-scale testing at our Morenci operations of an internally developed additive product with the potential to enhance copper recovery. In addition, we have identified other possible additives with strong potential and plan to apply heat with the new additives to further enhance recoveries. Continued success with these initiatives would be expected to contribute to favorable adjustments in recoverable copper in leach stockpiles and favorably impact average unit net cash costs.\nIn addition to our innovative leaching initiatives, we are pursuing opportunities to leverage new technologies and analytic tools in automation and operating practices with a goal of improving operating efficiencies and reducing costs and capital intensity of our current operations and future development projects. We believe these leaching and technology initiatives are particularly important to our U.S. operations, which have lower ore grades.\nResponsible Production\nWe demonstrate our responsible production performance through the Copper Mark, a comprehensive assurance framework developed specifically for the copper industry and extended to other metals, including molybdenum. To achieve the Copper Mark, each site is required to complete an independent external assurance process to assess conformance with various environmental, social and governance criteria. Awarded sites must be revalidated every three years. We achieved, and are committed to maintaining, the Copper Mark and Molybdenum Mark, as applicable, at all of our operating sites globally.\nFeasibility and Optimization Studies\nWe are engaged in various studies associated with potential future expansion projects primarily at our mining operations. We are also undertaking optimization projects at our current mining operations to enhance efficiencies and reduce costs. The costs for these studies are charged to production and delivery costs as incurred and totaled $43 million in third-quarter 2025, $45 million in third-quarter 2024, $131 million for the first nine months of 2025 and $117 million for the first nine months of 2024. We estimate the costs of these studies will approximate $200 million for the year 2025, subject to market conditions and other factors.\nU.S. Tariffs \nOur third-quarter 2025 costs were not significantly impacted by U.S. tariffs, and we are continuing to monitor impacts on our business, cost structure and supply chains associated with tariffs on U.S. imports. Based on our current supply chains and discussions with suppliers, we estimate that the tariffs in effect and announced to date could have the potential to increase the costs of goods purchased in the U.S. by approximately 5%, primarily reflecting the potential pass-through of tariffs incurred by suppliers. Efforts continue to evaluate alternative sourcing options to mitigate potential impacts. \nEffective August 1, 2025, a 50% tariff was imposed under Section 232 of the Trade Expansion Act, targeting U.S. imports of semi-finished copper products and copper-intensive derivative products. However, refined copper, including cathodes, concentrates and scrap, was exempted from the tariff, and the U.S. government has indicated it will reassess by mid-2026 the potential for a refined copper tariff of 15% beginning in January 2027 and rising to 30% in 2028. Refer to “Markets” for further discussion of the differential between LME and COMEX copper prices as a result of U.S. trade policy announcements. \nAdditionally, the U.S. Secretary of Commerce was directed to impose requirements that 25% of copper cathode and concentrate produced in the U.S. be sold domestically in 2027, potentially increasing to 30% in 2028 and 40% in 2029.\nWe are the leading copper supplier in the U.S., providing approximately 70% of total U.S. refined copper production through our integrated domestic mining and processing facilities. For the nine months ended September 30, 2025, copper from our U.S. mining operations was sold 68% as rod, 24% as cathode and 8% in concentrate. We are well \n35\nTable of Contents\n                  \npositioned in the U.S. with sizeable resources and opportunities to leverage existing infrastructure through brownfield expansions.\nFor the year 2025, copper sales from our U.S. mining operations are expected to approximate 1.3 billion pounds, which are primarily sold domestically. Copper produced from our South America and Indonesia mining operations is primarily sold internationally.\nGovernmental action related to tariffs and other controls on imports and exports or trade agreements or policies are difficult to predict and may continue to cause significant volatility in our financial performance and in the trading prices of our common stock. Refer to “Risk Factors” in Part I, Item 1A. of our 2024 Form 10-K for further discussion.\nUnited States \nWe manage seven copper operations in the U.S. – Morenci, Bagdad, Safford (including Lone Star), Sierrita and Miami in Arizona, and Chino and Tyrone in New Mexico. We also operate a copper smelter and rod mill in Miami, Arizona, and copper refinery and rod mill in El Paso, Texas. All of our U.S. operations are wholly owned, except for Morenci. We record our 72% undivided joint venture interest in Morenci using the proportionate consolidation method. \nOur U.S. copper operations include open-pit mining, sulfide-ore concentrating, leaching and solution extraction/electrowinning (SX/EW) facilities. A majority of the copper produced at our U.S. copper operations is cast into copper rod by our U.S. Rod & Refining segment. The remainder of our U.S. copper production is sold as copper cathode or copper concentrate, a portion of which is shipped to Atlantic Copper (our wholly owned smelter and refinery in Spain). Molybdenum concentrate, gold and silver are also produced by certain of our U.S. copper operations\n.\n \nDevelopment Activities.\n We have substantial reserves, resources and future opportunities for organic growth in the U.S. associated with existing operations. Several initiatives are under way to target anticipated significant future growth in our U.S. copper operations, including the leaching and technology innovation initiatives discussed above.\nWe have a potential expansion project to more than double the concentrator capacity of the Bagdad operation in northwest Arizona. Bagdad’s reserve life currently exceeds 80 years and supports an expanded operation. We completed technical and economic studies in late 2023 and continue to monitor capital cost trends and opportunities for value engineering. These studies indicate the opportunity to construct new concentrating facilities to increase copper production by 200 to 250 million pounds per year. Estimated incremental project capital costs, which continue to be reviewed, approximate $3.5 billion. Expanded operations would provide improved efficiency and reduce unit net cash costs through economies of scale. Project economics indicate that the expansion would require an incentive copper price of less than $4.00 per pound and three to four years to complete. The decision to proceed with and timing of the potential expansion will take into account overall copper market conditions and other factors.\nIn October 2025, the conversion of Bagdad’s haul truck fleet to autonomous haulage was substantially complete, making Bagdad the first major mine in the U.S. to operate a fully autonomous haulage fleet. We expect to continue to optimize the performance of the new autonomous fleet, and Bagdad is advancing projects to expand tailings facilities and local infrastructure to enhance optionality in the future expansion opportunity.\nWe continue to advance pre-feasibility studies in the Safford/Lone Star district to define a potential significant expansion opportunity. Positive drilling conducted in recent years indicates a large, mineralized district with opportunities to pursue a further expansion project. We expect to complete these studies in 2026. The decision to proceed with and timing of the potential expansion will take into account results of technical and economic studies, overall copper market conditions and other factors.\n36\nTable of Contents\n                  \nOperating Data.\n Following is summary consolidated operating data for our U.S. copper mines:\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nOperating Data, Net of Joint Venture Interests\n \n \nCopper\n (millions of recoverable pounds)\n \n \nProduction\n330 \n313 \n967 \n925 \nSales, excluding purchases\n339 \n316 \n954 \n939 \nAverage realized price per pound\na\n$\n4.92 \n$\n4.32 \n$\n4.78 \n$\n4.29 \nMolybdenum\n (millions of recoverable pounds)\n \n \nProduction\nb\n8 \n8 \n25 \n22 \n100% Operating Data\n \n \nLeach operations\n \n \nLeach ore placed in stockpiles (metric tons per day)\n609,200 \n551,200 \n604,800 \n606,100 \nAverage copper ore grade (%)\n0.21 \n0.21 \n0.21 \n0.21 \nCopper production (millions of recoverable pounds)\n213 \n213 \n607 \n633 \nMill operations\n \n \nOre milled (metric tons per day)\n332,700 \n314,700 \n330,100 \n304,200 \nAverage ore grade (%):\nCopper\n0.31 \n0.29 \n0.31 \n0.30 \nMolybdenum\n0.02 \n0.02 \n0.02 \n0.02 \nCopper recovery rate (%)\n82.4 \n83.1 \n84.0 \n82.6 \nCopper production (millions of recoverable pounds)\n166 \n149 \n503 \n440 \na.\nDuring the third quarter and first nine months of 2025, our average U.S. copper price realization, which is generally based on COMEX settlement prices, was approximately 7% to 9% higher than the average copper price realizations for our South America and Indonesia operations, which are generally based on LME settlement prices. Refer to “Markets.”\nb.\nRefer to “Consolidated Results” for our consolidated molybdenum sales volumes, which include sales of molybdenum produced at our U.S. copper mines.\nHigher consolidated copper sales volumes from our U.S. mines in the 2025 periods, compared to the 2024 periods, primarily reflect higher operating rates and ore grades.\nConsolidated copper sales from our U.S. mines are expected to approximate 1.3 billion pounds for the year 2025. Refer to “Outlook” for projected molybdenum sales volumes.\nUnit Net Cash Costs.\n We believe unit net cash costs per pound of copper is a measure that provides investors with information about the cash-generating capacity of our mining operations expressed on a basis relating to the primary metal product for our respective operations. We use this measure for the same purpose and for monitoring operating performance by our mining operations. This information differs from measures of performance determined in accordance with generally accepted accounting principles (GAAP) in the U.S. and should not be considered in isolation or as a substitute for measures of performance determined in accordance with U.S. GAAP. This measure is presented by other metals mining companies, although our measure may not be comparable to similarly titled measures reported by other companies.\n37\nTable of Contents\n                  \nGross Profit per Pound of Copper and Molybdenum\nThe following tables summarize unit net cash costs and gross profit per pound at our U.S. copper mines for the third quarters and first nine months of 2025 and 2024. Refer to “Product Revenues and Production Costs” for an explanation of the “by-product” and “co-product” methods and a reconciliation of unit net cash costs per pound to production and delivery costs applicable to sales reported in our consolidated financial statements.\nThree Months Ended September 30,\n \n2025\n2024\n \nBy- Product Method\nCo-Product Method\nBy- Product Method\nCo-Product Method\nCopper\nMolyb-\ndenum\na\nCopper\nMolyb-\ndenum\na\nRevenues\n$\n4.92 \n$\n4.92 \n$\n23.66 \n$\n4.32 \n$\n4.32 \n$\n21.33 \nSite production and delivery, before net noncash \n    and other costs shown below\n3.59 \n3.17 \n17.94 \n3.64 \n3.25 \n16.83 \nBy-product credits\n(0.61)\n— \n— \n(0.53)\n— \n— \nTreatment charges\n0.13 \n0.13 \n— \n0.13 \n0.12 \n— \nUnit net cash costs\n3.11 \n3.30 \n17.94 \n3.24 \n3.37 \n16.83 \nDD&A\n0.40 \n0.35 \n1.51 \n0.35 \n0.31 \n1.22 \nNoncash and other costs, net\n0.18 \nb\n0.17 \n0.40 \n0.16 \nb\n0.15 \n0.40 \nTotal unit costs\n3.69 \n3.82 \n19.85 \n3.75 \n3.83 \n18.45 \nGross profit per pound\n$\n1.23 \n$\n1.10 \n$\n3.81 \n$\n0.57 \n$\n0.49 \n$\n2.88 \nCopper sales (millions of recoverable pounds)\n341 \n341 \n317 \n317 \n \nMolybdenum sales (millions of recoverable pounds)\na\n8 \n \n \n8 \nNine Months Ended September 30,\n \n2025\n2024\n \nBy- Product Method\nCo-Product Method\nBy- Product Method\nCo-Product Method\nCopper\nMolyb-\ndenum\na\nCopper\nMolyb-\ndenum\na\nRevenues, excluding adjustments\n$\n4.78 \n$\n4.78 \n$\n21.25 \n$\n4.29 \n$\n4.29 \n$\n19.97 \nSite production and delivery, before net noncash \n    and other costs shown below\n3.51 \n3.11 \n16.73 \n3.45 \n3.10 \n16.52 \nBy-product credits\n(0.56)\n— \n— \n(0.45)\n— \n— \nTreatment charges\n0.14 \n0.13 \n— \n0.13 \n0.13 \n— \nUnit net cash costs\n3.09 \n3.24 \n16.73 \n3.13 \n3.23 \n16.52 \nDD&A\n0.39 \n0.35 \n1.28 \n0.35 \n0.32 \n1.23 \nNoncash and other costs, net\n0.16 \nb\n0.15 \n0.38 \n0.14 \nb\n0.13 \n0.39 \nTotal unit costs\n3.64 \n3.74 \n18.39 \n3.62 \n3.68 \n18.14 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n0.01 \n0.01 \n— \n— \n— \n— \nGross profit per pound\n$\n1.15 \n$\n1.05 \n$\n2.86 \n$\n0.67 \n$\n0.61 \n$\n1.83 \nCopper sales (millions of recoverable pounds)\n957 \n957 \n943 \n943 \n \nMolybdenum sales (millions of recoverable pounds)\na\n25 \n \n \n22 \na.\nReflects sales of molybdenum produced by certain of our U.S. copper mines to our molybdenum sales company at market-based pricing. \nb.\nIncludes charges for feasibility and optimization studies totaling $0.07 per pound of copper in third-quarter 2025, $0.06 per pound of copper in third-quarter 2024, $0.07 per pound of copper for the first nine months of 2025 and $0.05 per pound of copper for the first nine months of 2024. \nOur U.S. copper mines have varying cost structures because of differences in ore grades and characteristics, processing costs, by-product credits and other factors. Average unit net cash costs (net of by-product credits) for our U.S. copper mines totaled $3.11 per pound of copper in third-quarter 2025, $3.24 per pound of copper in third-quarter 2024, $3.09 per pound of copper for the first nine months of 2025 and $3.13 per pound of copper for the first nine months of 2024. Lower average unit net cash costs in the 2025 periods, compared to the 2024 periods, reflect higher copper volumes and higher molybdenum by-product credits. \nBecause certain assets are depreciated on a straight-line basis, the average unit depreciation rate for our U.S. copper mines may vary with asset additions and the level of copper production and sales.\n38\nTable of Contents\n                  \nWe expect our average unit net cash costs (net of by-product credits) for our U.S. copper mines to continue to trend lower for the year 2025 and in 2026, compared to 2024 levels, reflecting the projected impact of efficiencies, improved volumes and cost reduction plans currently in progress.\nAverage unit net cash costs (net of by-product credits) for our U.S. copper mines are expected to approximate $3.03 per pound of copper for the year 2025, based on achievement of current sales volume and cost estimates, and assuming an average price of $25.00 per pound of molybdenum in fourth-quarter 2025. Our U.S. copper mines’ average unit net cash costs for the year 2025 would change by approximately $0.01 per pound for each $2 per pound change in the average price of molybdenum in fourth-quarter 2025.\nSouth America\nWe manage two copper operations in South America – Cerro Verde in Peru (55.08%-owned) and El Abra in Chile (51%-owned), which are consolidated in our financial statements.\nSouth America operations include open-pit mining, sulfide-ore concentrating, leaching and SX/EW facilities. Production from our South America operations is sold as copper concentrate or cathode under long-term contracts. \nOur South America operations also sell a portion of their copper concentrate production to Atlantic Copper. In addition to copper, the Cerro Verde mine produces molybdenum concentrate and silver.\nDevelopment Activities.\n At the El Abra operations in Chile, we have completed substantial drilling and evaluations to define a large sulfide resource that could support a potential major mill project similar to the large-scale concentrator at Cerro Verde. The estimated resource approximates 20 billion recoverable pounds of copper, which could result in the addition of 750 million pounds of copper production per year. We have advanced stakeholder engagement and preparation of our permitting application and plan to submit an environmental impact statement in first-quarter 2026. Preliminary estimates, which remain under review, indicate that the project economics would be supported using an incentive copper price of less than $4.00 per pound. The decision to proceed with and timing of the potential project will take into account overall copper market conditions, required permitting and other factors.\nOperating Data.\n Following is summary consolidated operating data for South America operations:\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nCopper\n (millions of recoverable pounds)\n \n \nProduction\n271 \n299 \n810 \n877 \nSales\n278 \n293 \n818 \n879 \nAverage realized price per pound\n$\n4.60 \n$\n4.29 \n$\n4.46 \n$\n4.25 \nMolybdenum\n (millions of recoverable pounds)\n \n \nProduction\na\n6 \n6 \n16 \n15 \nLeach operations\n \n \nLeach ore placed in stockpiles (metric tons per day)\n124,500 \n157,100 \n158,400 \n167,800 \nAverage copper ore grade (%)\n0.47 \n0.43 \n0.40 \n0.41 \nCopper production (millions of recoverable pounds)\n57 \n72 \n203 \n218 \nMill operations\n \nOre milled (metric tons per day)\n421,000 \n423,700 \n412,400 \n415,700 \nAverage ore grade (%):\nCopper\n0.31 \n0.33 \n0.30 \n0.33 \nMolybdenum\n0.01 \n0.01 \n0.01 \n0.01 \nCopper recovery rate (%)\n83.8 \n84.2 \n83.8 \n83.8 \nCopper production (millions of recoverable pounds)\n214 \n227 \n607 \n659 \na.\nRefer to “Consolidated Results” for our consolidated molybdenum sales volumes, which include sales of molybdenum produced at the Cerro Verde mine.\nConsolidated copper sales volumes from our South America operations were lower in the 2025 periods, compared to the 2024 periods, primarily reflecting anticipated lower leach production and mill ore grades.\n39\nTable of Contents\n                  \nCopper sales from South America operations are expected to approximate 1.1 billion pounds for the year 2025. Refer to “Outlook” for projected molybdenum sales volumes.\nUnit Net Cash Costs.\n We believe unit net cash costs per pound of copper is a measure that provides investors with information about the cash-generating capacity of our mining operations expressed on a basis relating to the primary metal product for our respective operations. We use this measure for the same purpose and for monitoring operating performance by our mining operations. This information differs from measures of performance determined in accordance with U.S. GAAP and should not be considered in isolation or as a substitute for measures of performance determined in accordance with U.S. GAAP. This measure is presented by other metals mining companies, although our measure may not be comparable to similarly titled measures reported by other companies.\nGross Profit per Pound of Copper\nThe following tables summarize unit net cash costs and gross profit per pound at our South America operations for the third quarters and first nine months of 2025 and 2024. Unit net cash costs per pound of copper are reflected under the by-product and co-product methods as the South America operations also had sales of molybdenum and silver. Refer to “Product Revenues and Production Costs” for an explanation of the “by-product” and “co-product” methods and a reconciliation of unit net cash costs per pound to production and delivery costs applicable to sales reported in our consolidated financial statements.\nThree Months Ended September 30,\n \n2025\n2024\nBy-Product\nMethod\nCo-Product\nMethod\nBy-Product\nMethod\nCo-Product\nMethod\nRevenues, excluding adjustments\n$\n4.60 \n$\n4.60 \n$\n4.29 \n$\n4.29 \nSite production and delivery, before net noncash\n    and other costs shown below\n2.75 \n2.49 \n2.65 \na\n2.43 \nBy-product credits\n(0.52)\n— \n(0.37)\n— \nTreatment charges\n0.06 \n0.06 \n0.15 \n0.15 \nRoyalty on metals\n0.01 \n0.01 \n0.01 \n0.01 \nUnit net cash costs\n2.30 \n2.56 \n2.44 \n2.59 \nDD&A\n0.41 \n0.36 \n0.37 \n0.34 \nNoncash and other costs, net\n0.10 \nb\n0.09 \n0.10 \nb\n0.09 \nTotal unit costs\n2.81 \n3.01 \n2.91 \n3.02 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n— \n— \n(0.06)\n(0.06)\nGross profit per pound\n$\n1.79 \n$\n1.59 \n$\n1.32 \n$\n1.21 \nCopper sales (millions of recoverable pounds)\n278 \n278 \n293 \n293 \nNine Months Ended September 30,\n \n2025\n2024\nBy-Product\nMethod\nCo-Product\nMethod\nBy-Product\nMethod\nCo-Product\nMethod\nRevenues, excluding adjustments\n$\n4.46 \n$\n4.46 \n$\n4.25 \n$\n4.25 \nSite production and delivery, before net noncash\n    and other costs shown below\n2.75 \n2.50 \n2.67 \na\n2.47 \nBy-product credits\n(0.45)\n— \n(0.34)\n— \nTreatment charges\n0.07 \n0.07 \n0.16 \n0.16 \nRoyalty on metals\n0.01 \n0.01 \n0.01 \n0.01 \nUnit net cash costs\n2.38 \n2.58 \n2.50 \n2.64 \nDD&A\n0.42 \n0.37 \n0.38 \n0.35 \nNoncash and other costs, net\n0.07 \nb\n0.07 \n0.07 \nb\n0.07 \nTotal unit costs\n2.87 \n3.02 \n2.95 \n3.06 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n0.07 \n0.07 \n0.04 \n0.04 \nGross profit per pound\n$\n1.66 \n$\n1.51 \n$\n1.34 \n$\n1.23 \nCopper sales (millions of recoverable pounds)\n818 \n818 \n879 \n879 \na.\nIncludes $0.12 per pound of copper in third-quarter 2024 and $0.11 per pound of copper for the first nine months of 2024 for nonrecurring labor-related charges at Cerro Verde associated with new CLAs. \n40\nTable of Contents\n                  \nb.\nIncludes charges for feasibility and optimization studies totaling $0.06 per pound of copper in third-quarter 2025, third-quarter 2024 and for the first nine months of 2025, and $0.05 per pound of copper for the first nine months of 2024.\nOur South America operations have varying cost structures because of differences in ore grades and characteristics, processing costs, by-product credits and other factors. Average unit net cash costs (net of by-product credits) for South America operations totaled $2.30 per pound of copper in third-quarter 2025, $2.44 per pound of copper in third-quarter 2024, $2.38 per pound of copper for the first nine months of 2025 and $2.50 per pound of copper for the first nine months of 2024. Lower average unit net cash costs in the 2025 periods, compared to the 2024 periods, reflect higher by-product credits and lower treatment charges, partly offset by the impact of lower copper volumes.\nRevenues from Cerro Verde’s copper concentrate sales are recorded net of treatment charges, which will vary with its sales volumes and the price of copper. \nBecause certain assets are depreciated on a straight-line basis, South America’s unit depreciation rate may vary with asset additions and the level of copper production and sales. \nRevenue adjustments primarily result from changes in prices on provisionally priced copper sales recognized in prior periods. Refer to “Consolidated Results – Revenues” for further discussion of adjustments to prior period provisionally priced copper sales.\nAverage unit net cash costs (net of by-product credits) for our South America operations are expected to approximate $2.45 per pound of copper for the year 2025, based on achievement of current sales volume and cost estimates, and assuming an average price of $25.00 per pound of molybdenum in fourth-quarter 2025.\nIn October 2025, El Abra and its two workers' unions signed new CLAs, which expire on April 30, 2029. No significant charges are expected to be recorded in fourth-quarter 2025 associated with the new CLAs.\nIndonesia\nPTFI operates one of the world’s largest copper and gold mines at the Grasberg minerals district in Central Papua, Indonesia. PTFI produces copper concentrate that contains significant quantities of gold and silver. We have a 48.76% ownership interest in PTFI and manage its operations. PTFI's results are consolidated in our financial statements. With the completion of PTFI’s newly constructed downstream processing facilities, PTFI became a fully integrated producer of refined copper and gold.\nOperating, Development and Exploration Activities.\n Over a multi-year investment period, PTFI has successfully commissioned three large-scale underground mines in the Grasberg minerals district (Grasberg Block Cave, DMLZ and Big Gossan) and related expansion of the milling facilities. At normal operating rates, PTFI’s underground operations produce approximately 1.7 billion pounds of copper and 1.4 million ounces of gold per year and are among the lowest cost operations in the world.\nPTFI is also conducting exploration in the Grasberg minerals district targeting the potential extension of significant mineralization below the DMLZ underground mine.\nGrasberg Minerals District Mud Rush Incident.\n On September 8, 2025, PTFI experienced a mud rush incident, which was unprecedented in its multi-decade history of block cave mining in the Grasberg minerals district. During the incident, a sudden rush of approximately 800,000 metric tons of wet material entered the Grasberg Block Cave underground mine from the former Grasberg open pit and traveled rapidly to multiple levels of the mine, including a service level where seven team members were later found deceased.\nMining operations were temporarily suspended following the incident to prioritize the recovery of the seven team members fatally injured during the incident and to conduct an investigation into the root cause of the incident. The recovery efforts were completed on October 5, 2025, and the investigation is advancing toward completion. Damage assessments, which are expected to be completed by year-end 2025, are being conducted in parallel with ongoing mud removal activities. \nIn late October 2025, PTFI restarted operations at the unaffected Big Gossan and DMLZ underground mines. A phased restart and ramp-up of the Grasberg Block Cave underground mine is anticipated to begin during 2026. We and PTFI, including external experts, are completing an investigation of the root cause of the incident and to identify \n41\nTable of Contents\n                  \nactions required to safeguard against recurrence. In parallel, and in coordination with Indonesia government authorities, future production plans are being evaluated and damage assessments are being completed.\nRefer to Note 7 and “Grasberg Minerals District Mud Rush Incident” for further discussion.\nKucing Liar.\n PTFI is conducting long-term mine development activities at its Kucing Liar deposit in the Grasberg minerals district. Kucing Liar is expected to produce over 7 billion pounds of copper and 6 million ounces of gold between 2029 and the end of 2041, and an extension of PTFI’s operating rights beyond 2041 would extend the life of the project. Development activities commenced in 2022 and are expected to continue over an approximate 10-year timeframe. As of September 30, 2025, PTFI has incurred approximately $1.0 billion for Kucing Liar, and capital investments are estimated to total $4 billion over the next seven to eight years (averaging approximately $0.5 billion per year). At full operating rates, annual production from Kucing Liar is expected to approximate 560 million pounds of copper and 520 thousand ounces of gold, providing PTFI with sustained long-term, large-scale and low-cost production. Kucing Liar will benefit from substantial shared infrastructure and PTFI’s experience and long-term success in block-cave mining.\nPTFI’s Downstream Processing Facilities.\n In July 2025, PTFI’s new smelter in Eastern Java, Indonesia, produced its first copper cathode. The PMR, which commenced operations in December 2024, continued its ramp-up during third-quarter 2025, processing anode slimes from PT Smelting.\nFollowing the September 2025 mud rush incident and related suspension of mining activities at the Grasberg minerals district, smelting and refining operations at PTFI’s downstream processing facilities and at PT Smelting have operated with limited availability and are currently on stand-by status, pending the delivery of copper concentrate.\nNatural Gas Facilities.\n PTFI plans to transition its existing energy source from coal to natural gas, which would meaningfully reduce PTFI’s greenhouse gas emissions at the Grasberg minerals district. Following the September 2025 mud rush incident, PTFI’s planned investments for a new gas-fired combined cycle facility have been deferred by 18 months. Once complete, PTFI’s dual-fuel power plant and the new gas-fired combined cycle facility will be fueled by natural gas supplied by a floating liquefied natural gas storage and regassification unit.\nLong-term Mining Rights.\n With the completion of PTFI’s downstream processing facilities during 2025, FCX and PTFI have advanced discussions with the Indonesia government for a long-term extension of PTFI’s operating rights beyond the current expiration in 2041. An extension would enable continuity of large-scale operations for the benefit of all stakeholders and provide growth options through additional resource development opportunities in the highly attractive Grasberg minerals district.\nPTFI is preparing its application for a long-term extension expected to cover the life of the resource, which is expected to be submitted in fourth-quarter 2025. In connection with the extension, PTFI expects to pursue additional exploration, conduct studies for future additional development and expand its social programs. We expect to maintain our ownership interest of approximately 49% through 2041 and would transfer an additional interest in PTFI to a state-owned enterprise beginning in 2042, leaving us to hold an approximately 37% interest. We also expect the existing governance agreements would continue over the life of the resource.\n42\nTable of Contents\n                  \nOperating Data.\n Following is summary consolidated operating data for Indonesia operations:\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nCopper\n (millions of recoverable pounds)\n \n \nProduction\n311 \n439 \n966 \n1,371 \nSales\n360 \n426 \n1,093 \n1,256 \nAverage realized price per pound\n$\n4.52 \n$\n4.29 \n$\n4.42 \n$\n4.24 \nGold\n (thousands of recoverable ounces)\n \n \nProduction\n281 \n451 \n876 \n1,433 \nSales\n332 \n554 \n975 \n1,474 \nAverage realized price per ounce\n$\n3,535 \n$\n2,569 \n$\n3,357 \n$\n2,362 \nOre extracted and milled (metric tons per day):\n \n \nGrasberg Block Cave\n104,200 \n133,400 \n104,100 \n132,100 \nDMLZ\n49,100 \n63,200 \n56,900 \n65,000 \nBig Gossan\n5,300 \n8,500 \n6,400 \n8,400 \nAdjustments\n(1,100)\n700 \n(200)\n1,900 \nTotal\n157,500 \n205,800 \n167,200 \n207,400 \nAverage ore grades:\n \n \nCopper (%)\n1.15 \n1.26 \n1.14 \n1.29 \nGold (grams per metric ton)\n0.81 \n0.95 \n0.80 \n1.03 \nRecovery rates (%):\n \nCopper\n88.0 \n88.1 \n88.0 \n88.8 \nGold\n76.1 \n77.2 \n75.7 \n77.3 \nHistorically, PTFI recognized concentrate sales upon loading of shipments; however, PTFI’s future concentrate production will be processed by PT Smelting and its smelter, and refined sales will be recognized after processing and sale of the metal. Accordingly, PTFI may experience higher variability between production and sales.\nPTFI’s consolidated copper and gold production and sales volumes for the third quarter and first nine months of 2025 were impacted by the temporary suspension of operations following the September 2025 mud rush incident. Lower production and sales volumes for the 2025 periods, compared to the 2024 periods, also reflected anticipated lower ore grades and operating rates.\nConsolidated sales volumes from PTFI are expected to approximate 1.2 billion pounds of copper and 1.0 million ounces of gold for the year 2025, which assumes minimal fourth-quarter 2025 sales prior to a phased ramp-up of refined copper and gold sales in 2026. We expect higher variability between PTFI production and sales until PTFI’s downstream processing facilities achieve normalized operating rates.\nProjected sales volumes are dependent on operational performance; the timing of restarting and ramping up mining and smelting operations at PTFI following the September 2025 mud rush incident; weather-related conditions; and other factors detailed in the “Cautionary Statement” below.\nUnit Net Cash (Credits) Costs.\n We believe unit net cash (credits) costs per pound of copper is a measure that provides investors with information about the cash-generating capacity of our mining operations expressed on a basis relating to the primary metal product for our respective operations. We use this measure for the same purpose and for monitoring operating performance by our mining operations. This information differs from measures of performance determined in accordance with U.S. GAAP and should not be considered in isolation or as a substitute for measures of performance determined in accordance with U.S. GAAP. This measure is presented by other metals mining companies, although our measure may not be comparable to similarly titled measures reported by other companies.\n43\nTable of Contents\n                  \nGross Profit per Pound of Copper and per Ounce of Gold\nThe following tables summarize the unit net cash (credits) costs and gross profit per pound of copper and per ounce of gold at our Indonesia mining operations for the third quarters and first nine months of 2025 and 2024. Refer to “Product Revenues and Production Costs” for an explanation of “by-product” and “co-product” methods and a reconciliation of unit net cash (credits) costs per pound to production and delivery costs applicable to sales reported in our consolidated financial statements.\nThree Months Ended September 30,\n \n2025\n2024\n \nBy-Product Method\nCo-Product Method\nBy-Product Method\nCo-Product Method\n \nCopper\nGold\nCopper\nGold\nRevenues, excluding adjustments\n$\n4.52 \n$\n4.52 \n$\n3,535 \n$\n4.29 \n$\n4.29 \n$\n2,569 \nSite production and delivery, before net noncash\n    and other costs shown below\n1.84 \n1.04 \n813 \n1.82 \n1.00 \n599 \nBy-product credits\n(3.52)\n— \n— \n(3.50)\n— \n— \nTreatment charges\n0.09 \na\n0.05 \n39 \n0.37 \n0.20 \n122 \nExport duties\n0.38 \n0.21 \n166 \n0.30 \n0.17 \n99 \nRoyalty on metals\n0.29 \n0.17 \n125 \n0.30 \n0.17 \n95 \nUnit net cash (credits) costs\n(0.92)\n1.47 \n1,143 \n(0.71)\n1.54 \n915 \nDD&A\n0.92 \nb\n0.52 \n404 \n0.80 \n0.44 \n263 \nNoncash and other costs, net\n0.88 \nc,d\n0.49 \n386 \n0.12 \nd\n0.07 \n41 \nTotal unit costs\n0.88 \n2.48 \n1,933 \n0.21 \n2.05 \n1,219 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n0.04 \n0.04 \n11 \n(0.03)\n(0.03)\n6 \nGross profit per pound/ounce\n$\n3.68 \n$\n2.08 \n$\n1,613 \n$\n4.05 \n$\n2.21 \n$\n1,356 \nCopper sales (millions of recoverable pounds)\n360 \n360 \n \n426 \n426 \n \nGold sales (thousands of recoverable ounces)\n \n \n332 \n \n \n554 \nNine Months Ended September 30,\n \n2025\n2024\n \nBy-Product Method\nCo-Product Method\nBy-Product Method\nCo-Product Method\n \nCopper\nGold\nCopper\nGold\nRevenues, excluding adjustments\n$\n4.42 \n$\n4.42 \n$\n3,357 \n$\n4.24 \n$\n4.24 \n$\n2,362 \nSite production and delivery, before net noncash\n    and other costs shown below\n1.88 \n1.10 \n834 \n1.64 \n0.98 \n542 \nBy-product credits\n(3.16)\n— \n— \n(2.90)\n— \n— \nTreatment charges\n0.16 \na\n0.09 \n71 \n0.36 \n0.21 \n119 \nExport duties\n0.31 \n0.18 \n138 \n0.29 \n0.17 \n95 \nRoyalty on metals\n0.28 \n0.16 \n125 \n0.27 \n0.16 \n89 \nUnit net cash (credits) costs\n(0.53)\n1.53 \n1,168 \n(0.34)\n1.52 \n845 \nDD&A\n0.82 \nb\n0.49 \n367 \n0.73 \n0.44 \n243 \nNoncash and other costs, net\n0.45 \nc,d\n0.26 \n199 \n0.11 \nd\n0.06 \n36 \nTotal unit costs\n0.74 \n2.28 \n1,734 \n0.50 \n2.02 \n1,124 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n0.01 \n0.01 \n16 \n— \n— \n(3)\nGross profit per pound/ounce\n$\n3.69 \n$\n2.15 \n$\n1,639 \n$\n3.74 \n$\n2.22 \n$\n1,235 \nCopper sales (millions of recoverable pounds)\n1,093 \n1,093 \n \n1,256 \n1,256 \n \nGold sales (thousands of recoverable ounces)\n \n \n975 \n \n \n1,474 \na.\nExcludes costs associated with PT Smelting’s planned maintenance and idle facility related tolling fees (refer to note c below). \nb.\nIncludes idle facility costs resulting from the September 2025 mud rush incident totaling $0.07 per pound of copper in third-quarter 2025 and $0.02 per pound of copper for the first nine months of 2025 (refer to note c below for additional idle facility costs included in noncash and other costs, net). \nc.\nIncludes charges (i) for idle facility costs and recovery efforts associated with the September 2025 mud rush incident totaling $0.47 per pound of copper in third-quarter 2025 and $0.16 per pound of copper for the first nine months of 2025, (ii) tolling fees that were recognized as idle facility costs associated with PT Smelting’s planned maintenance turnaround totaling $0.11 per pound of copper in third-quarter 2025 and $0.04 per pound of copper for the first nine months of 2025 and (iii) \n44\nTable of Contents\n                  \nremediation costs related to the October 2024 fire incident at the smelter not recoverable under PTFI’s construction insurance program totaling $0.07 per pound of copper in third-quarter 2025 and $0.05 per pound of copper for the first nine months of 2025.\nd.\nIncludes charges for operational readiness and startup costs associated with PTFI’s downstream processing facilities totaling $0.23 per pound of copper in third-quarter 2025, $0.09 per pound of copper in third-quarter 2024, $0.17 per pound of copper for the first nine months of 2025 and $0.06 per pound of copper for the first nine months of 2024. Also includes charges for amounts capitalized in prior years associated with the construction of PTFI’s downstream processing facilities totaling $0.02 per pound of copper for the first nine months of 2025 and $0.03 per pound of copper for the first nine months of 2024.\nA significant portion of PTFI’s costs are fixed and unit costs will vary depending on volumes and other factors. PTFI’s unit net cash credits (including by-product credits) were $0.92 per pound of copper in third-quarter 2025, $0.71 per pound of copper in third-quarter 2024, $0.53 per pound of copper for the first nine months of 2025 and $0.34 per pound of copper for the first nine months of 2024. Favorable unit net cash credits in the 2025 periods, compared with the 2024 periods, primarily reflect lower treatment charges, partly offset by the impact of lower copper volumes and higher export duties. In addition, the first nine months of 2025 benefited from higher gold credits. \nAdditionally, PTFI's site production and delivery costs for the 2025 periods exclude $171 million of idle facility costs and recovery expenses associated with the September 2025 mud rush incident and $39 million of tolling fees that were recognized as idle facility costs associated with PT Smelting’s planned maintenance turnaround. During the phased restart and ramp-up of operations in fourth-quarter 2025 and in 2026, a portion of PTFI’s cost of sales is expected to be recognized as idle facility costs, which are non-inventoriable costs. \nTreatment charges vary with the volume of metals sold and the price of copper, and royalties vary with the volume of metals sold and the prices of copper and gold. The decrease in treatment charges in the 2025 periods, compared to the 2024 periods, primarily reflects lower treatment charge rates as a result of favorable market conditions.\nPrior to the expiration of PTFI’s export license on September 16, 2025, export duties were assessed on its copper concentrate sales at a rate of 7.5%.\nBecause certain assets are depreciated on a straight-line basis, PTFI’s unit depreciation rate may vary with asset additions, the level of copper volumes and changes in gold inventory. \nRevenue adjustments primarily result from changes in prices on provisionally priced copper sales recognized in prior periods. Refer to “Consolidated Results – Revenues” for further discussion of adjustments to prior period provisionally priced copper sales.\nAverage unit net cash credits (including by-product credits and excluding estimated expenses attributable to the September 2025 mud rush incident at PTFI for idle facility costs and recovery efforts) for PTFI are expected to approximate $0.53 per pound of copper for the year 2025, based on achievement of current sales volumes and cost estimates, and assuming an average price of $4,000 per ounce of gold in fourth-quarter 2025. PTFI’s average unit net cash credits for the year 2025 would change by approximately $0.01 per pound of copper for each $100 per ounce change in the average price of gold in fourth-quarter 2025. \nPTFI’s projected production and sales volumes and unit net cash credits for the year 2025 are dependent on operational performance; the timing of restarting and ramping up mining and smelting operations at PTFI following the September 2025 mud rush incident; weather-related conditions; and other factors. Refer to “Cautionary Statement” below, and Item 1A. “Risk Factors” contained in Part I of our 2024 Form 10-K for further discussion of factors that could cause results to differ materially from projections.\nMolybdenum Mines \nWe operate two wholly owned primary molybdenum operations in Colorado – the Climax open-pit mine and the Henderson underground mine. The Climax and Henderson mines produce high-purity, chemical-grade molybdenum concentrate, which is typically further processed into value-added molybdenum chemical products. The majority of the molybdenum concentrate produced at the Climax and Henderson mines and at our U.S. copper mines and Cerro Verde mine is processed at our conversion facilities.\n45\nTable of Contents\n                  \nOperating and Development Activities.\n Production from the Molybdenum mines totaled 8 million pounds of molybdenum in third-quarter 2025, 6 million pounds in third-quarter 2024, 26 million pounds for the first nine months of 2025 and 21 million pounds for the first nine months of 2024. Refer to “Consolidated Results” for our consolidated molybdenum operating data, which includes sales of molybdenum produced at our primary molybdenum mines and from our U.S. copper mines and Cerro Verde mine. Refer to “Outlook” for projected consolidated molybdenum sales volumes and to “Markets” for a discussion of molybdenum prices.\nUnit Net Cash Costs Per Pound of Molybdenum.\n We believe unit net cash costs per pound of molybdenum is a measure that provides investors with information about the cash-generating capacity of our mining operations expressed on a basis relating to the primary metal product for our respective operations. We use this measure for the same purpose and for monitoring operating performance by our mining operations. This information differs from measures of performance determined in accordance with U.S. GAAP and should not be considered in isolation or as a substitute for measures of performance determined in accordance with U.S. GAAP. This measure is presented by other metals mining companies, although our measure may not be comparable to similarly titled measures reported by other companies.\nAverage unit net cash costs for our Molybdenum mines were $19.41 per pound of molybdenum in third-quarter 2025, $21.06 per pound of molybdenum in third-quarter 2024, $15.60 per pound of molybdenum for the first nine months of 2025 and $18.59 per pound of molybdenum for the first nine months of 2024. Lower average unit net cash costs in the 2025 periods, compared with the 2024 periods, primarily reflect higher volumes and lower contract labor costs. \nBased on achievement of current sales volumes and cost estimates, average unit net cash costs for the Molybdenum mines are expected to average approximately $15.61 per pound of molybdenum for the year 2025. Refer to “Product Revenues and Production Costs” for a reconciliation of unit net cash costs per pound to production and delivery costs applicable to sales reported in our consolidated financial statements.\nDownstream Processing Facilities\nThrough our downstream integration, we are able to place a significant portion of our copper concentrate production. PTFI’s downstream processing facilities in Eastern Java, Indonesia, are wholly owned and operated, and PTFI has a 66% ownership interest in PT Smelting (39.5% prior to June 30, 2024), which is operated by Mitsubishi Materials Corporation. We wholly own and operate the Miami smelter and rod mill in Arizona, the El Paso refinery and rod mill in Texas, and the Atlantic Copper smelter and refinery in Huelva, Spain. \nWe manufacture continuous cast copper rod at our U.S. rod facilities primarily using copper produced at our U.S. copper mines and processing facilities. Rod production from these facilities approximated one billion pounds for each of the last three years, and is expected to approximate one billion pounds for the year 2025.\nPTFI smelts and refines copper concentrate from its mining operations and operates a PMR to process anode slimes from its smelter and PT Smelting. With the completion of its newly constructed downstream processing facilities, PTFI became a fully integrated producer of refined copper and gold. Treatment charges reflecting the cost of smelting and refining operations are recorded in production and delivery costs. \nDuring third-quarter 2025, PT Smelting completed a planned major maintenance turnaround. However, operational challenges with a third-party oxygen plant caused a delay in the restart of operations. As a result, $39 million of tolling fees paid by PTFI in third-quarter 2025 were recognized as idle facility costs.\nPTFI recorded charges for operational readiness and startup costs associated with its downstream processing facilities totaling $83 million in third-quarter 2025, $39 million in third-quarter 2024, $185 million for the first nine months of 2025 and $74 million for the first nine months of 2024. We estimate that operational readiness and startup costs associated with PTFI’s downstream processing facilities will approximate $190 million for the year 2025.\nOur Miami smelter in Arizona has been operating for over 100 years and has been upgraded numerous times during that period to implement new technologies, improve production and comply with air quality requirements. We performed a major maintenance turnaround for the Miami smelter in first-quarter 2025 and incurred maintenance charges and idle facility costs totaling $73 million for the first nine months of 2025.\n46\nTable of Contents\n                  \nAtlantic Copper smelts and refines copper concentrate and markets refined copper and precious metals in slimes. During the first nine months of 2025, Atlantic Copper’s copper concentrate purchases included 22% from our copper mining operations and 78% from third parties. Atlantic Copper’s treatment charges, which consist of a base rate per pound of copper and per ounce of gold, are generally fixed and represent a cost to our mining operations and income to Atlantic Copper (\ni.e.\n, higher treatment charges benefit our Atlantic Copper operations). Our U.S. copper mines are less significantly affected by changes in treatment charges because these operations are largely integrated with our Miami smelter and El Paso refinery. \nWe defer recognizing profits on sales from our mining operations to Atlantic Copper until final sales to third parties occur. Changes in these deferrals attributable to variability in intercompany volumes resulted in net additions (reductions) to operating income totaling $13 million ($15 million to net income attributable to common stock) in third-quarter 2025, $(42) million ($(13) million to net income attributable to common stock) in third-quarter 2024, $161 million ($58 million to net income attributable to common stock) for the first nine months of 2025 and $79 million ($23 million to net income attributable to common stock) for the first nine months of 2024. Our net deferred profits on our inventories at Atlantic Copper to be recognized in future periods’ operating income totaled $52 million ($17 million to net income attributable to common stock) at September 30, 2025. Quarterly variations in ore grades, the timing of intercompany shipments and changes in product prices will result in variability in our net deferred profits and quarterly earnings.\nCAPITAL RESOURCES AND LIQUIDITY\nOur consolidated operating cash flows vary with sales volumes; prices realized from copper, gold and molybdenum sales; production costs; income taxes; other working capital changes; and other factors.\nWe remain focused on managing operating and capital costs efficiently and continue to advance several important value-enhancing initiatives. We believe the actions we have taken in recent years to build a solid balance sheet, successfully expand low-cost operations and maintain flexible organic growth options while maintaining sufficient liquidity, will allow us to continue to execute our business plans in a prudent manner during periods of economic uncertainty while preserving substantial future asset values. We closely monitor market and business conditions and adjust our operating plans to protect liquidity and preserve our asset values, when necessary. We expect to maintain a strong balance sheet and liquidity position as we focus on building long-term value in our business, executing our operating plans safely, responsibly and efficiently, and prudently managing operating costs and capital expenditures.\nBased on current sales volume, cost and metal price estimates and planned capital expenditures discussed in “Outlook,” our available cash and cash equivalents plus our projected consolidated operating cash flows of $5.5 billion for the year 2025 exceed our expected consolidated capital expenditures of $4.5 billion. While evaluation of PTFI’s operating plans, including production and sales estimates and cost and capital budgets are ongoing following the September 2025 mud rush incident, and revised plans are expected to be finalized following completion of the investigation and damage assessments, we expect the incident to have a significant impact on our fourth-quarter 2025 and 2026 operating and financial results (refer to “Grasberg Minerals District Mud Rush Incident” for further discussion).\nWe expect to have cash on hand and the financial flexibility to fund capital expenditures and our other cash requirements for the next 12 months, including noncontrolling interest distributions, income tax payments, current common stock dividends (base and variable) and any share or debt repurchases. Planned capital expenditures for major projects over the next few years are primarily associated with underground mine development in the Grasberg minerals district and expansion projects in the U.S. At September 30, 2025, we had $4.3 billion in consolidated cash and cash equivalents, and FCX, PTFI and Cerro Verde have $3.0 billion, $1.5 billion and $350 million, respectively, of availability under their revolving credit facilities. \nFinancial Policy.\n Our financial policy is aligned with our strategic objectives of maintaining a strong balance sheet, providing cash returns to shareholders and advancing opportunities for future growth. The policy includes a base dividend and a performance-based payout framework, whereby up to 50% of available cash flows generated after planned capital spending and distributions to noncontrolling interests would be allocated to shareholder returns and the balance to debt reduction and investments in value enhancing growth projects, subject to us maintaining our net debt at a level not to exceed the net debt target of $3.0 billion to $4.0 billion (excluding debt for PTFI’s downstream processing facilities). Our Board of Directors (Board) reviews the structure of the performance-based payout framework at least annually.\n47\nTable of Contents\n                  \nAt September 30, 2025, our net debt totaled $1.7 billion, which excludes $3.2 billion of debt for PTFI’s downstream processing facilities. Refer to \"Net Debt\" for further discussion.\nOn September 24, 2025, our Board declared cash dividends totaling $0.15 per share on our common stock (including a $0.075 per share quarterly base cash dividend and a $0.075 per share quarterly variable, performance-based cash dividend), which were paid on November 3, 2025, to shareholders of record as of October 15, 2025. The base and variable dividends on our common stock totaled $0.60 per share for 2025, comprised of a $0.30 per share base dividend and $0.30 per share variable dividend.\nAs of October 31, 2025, we have acquired a total of 52 million shares ($38.51 average cost per share) and have $3.0 billion available under our current share repurchase program. We had 1.4 billion shares of common stock outstanding at October 31, 2025. Refer to Note 4 for further discussion.\nThe declaration and payment of dividends (base or variable) and timing and amount of any share repurchases are at the discretion of our Board and management, respectively, and are subject to a number of factors, including not exceeding our net debt target, capital availability, financial results, cash requirements, global economic conditions, changes in laws, contractual restrictions and other factors deemed relevant by our Board or management, as applicable. Our share repurchase program may be modified, increased, suspended or terminated at any time at our Board’s discretion.\nCash\nFollowing is a summary of the U.S. and international components of consolidated cash and cash equivalents available to the parent company, net of noncontrolling interests’ share and withholding taxes, at September 30, 2025 (in billions):\nCash at domestic companies\n$\n1.8 \nCash at international operations\n2.5 \nTotal consolidated cash and cash equivalents\n4.3 \nNoncontrolling interests’ share\n(1.2)\nCash, net of noncontrolling interests’ share\n3.1 \nWithholding taxes \n(0.1)\nNet cash available\n$\n3.0 \nCash held at our international operations is generally used to support our foreign operations’ capital expenditures, operating expenses, debt repayments, working capital or other cash needs. Management believes that sufficient liquidity is available in the U.S. from cash balances and availability from our revolving credit facility. We elected to not permanently reinvest earnings from our foreign subsidiaries, and we recorded deferred tax liabilities for foreign earnings that are available to be repatriated to the U.S. From time to time, our foreign subsidiaries distribute earnings to the U.S. through dividends that are subject to applicable withholding taxes and noncontrolling interests’ share.\nDebt\nAt September 30, 2025, consolidated debt totaled $9.3 billion, with a weighted-average interest rate of 5.2%. Substantially all of our outstanding debt is fixed rate and our total debt has an average remaining duration of approximately nine years. There are no senior note maturities scheduled in 2026 and $1.3 billion scheduled in 2027. Refer to Note 4 for further discussion of debt. \nOperating Activities\nWe generated operating cash flows of $4.9 billion (net of $0.5 billion for working capital and other uses) for the first nine months of 2025 and $5.7 billion for the first nine months of 2024. Operating cash flows in the first nine months of 2025, compared with the first nine months of 2024, primarily reflect lower copper and gold sales volumes, which were impacted by the temporary suspension of operations at PTFI since the September 2025 mud rush incident, partly offset by higher copper and gold prices. Operating cash flows for the first nine months of 2025 were also impacted by an increase in accounts receivable associated with the timing of collections in the normal course of business and higher tax payments in Indonesia, partly offset by reserves associated with asbestos and talc claims (refer to Note 7).\n48\nTable of Contents\n                  \nInvesting Activities\nCapital Expenditures.\n Capital expenditures, including capitalized interest, totaled $3.5 billion for the first nine months of 2025 and $3.6 billion for the first nine months of 2024, and include amounts for major projects ($1.7 billion for the first nine months of 2025 and $1.3 billion for the first nine months of 2024), primarily associated with underground development activities in the Grasberg minerals district and for PTFI’s downstream processing facilities ($0.6 billion for the first nine months of 2025 and $1.0 billion for the first nine months of 2024).\nInsurance Recoveries.\n During third-quarter 2025, PTFI collected $25 million under its construction insurance program associated with the 2024 smelter fire incident. Additional recoveries are expected by early 2026. \nAcquisition of additional ownership interest in Cerro Verde.\n In September 2024, we purchased 5.3 million shares of Cerro Verde common stock for a total cost of $210 million, increasing our ownership interest in Cerro Verde to 55.08% from 53.56%.\nFinancing Activities\nDebt Transactions.\n Net proceeds from debt totaled $337 million for the first nine months of 2025, primarily related to borrowings by Atlantic Copper under short-term lines of credit used for working capital requirements. Net proceeds from debt totaled $249 million for the first nine months of 2024, primarily related to borrowings under the PTFI revolving credit facility that were used to fund capital expenditures for its downstream processing facilities.\nCash Dividends on Common Stock.\n We paid cash dividends on our common stock totaling $0.6 billion during each of the first nine months of 2025 and 2024. Refer to Note 4, Item 1A. “Risk Factors” contained in Part I of our 2024 Form 10-K, “Cautionary Statement” below and the discussion of our financial policy above.\nCash Dividends and Distributions Paid to Noncontrolling Interests.\n Cash dividends and distributions paid to noncontrolling interests at our international operations totaled $1.3 billion (including $1.0 billion from PTFI) for the first nine months of 2025 and $1.3 billion (including $1.1 billion from PTFI) for the first nine months of 2024. Cash dividends and distributions to noncontrolling interests vary based on the operating results and cash requirements of our consolidated subsidiaries.\nTreasury Stock Purchases.\n In the first nine months of 2025, we acquired 2.9 million shares of our common stock for a total cost of $107 million ($36.41 average cost per share). Refer to Note 4 for further discussion. \nCONTRACTUAL OBLIGATIONS\nThere have been no material changes in our contractual obligations since\n \nDecember 31, 2024. Refer to Note 11 and Part II, Items 7. and 7A. in our 2024 Form 10-K for information regarding our contractual obligations.\nCONTINGENCIES\nEnvironmental Obligations and Asset Retirement Obligations (AROs)\nOur current and historical operating activities are subject to various environmental laws and regulations. We perform a comprehensive annual review of our environmental obligations and AROs and also review changes in facts and circumstances associated with these obligations at least quarterly. \nThere have been no significant updates to our environmental obligations and AROs since December 31, 2024, other than as disclosed in Note 7. Refer to Note 10 of our 2024 Form 10-K, as updated in Note 7, for further discussion regarding environmental contingencies and AROs.\nLitigation and Other Contingencies\nThere have been no significant updates to our contingencies associated with legal proceedings and other matters since December 31, 2024, other than as disclosed in Note 7. Refer to Note 10 and “Legal Proceedings” contained in Part I, Item 3. of our 2024 Form 10-K, as updated by Note 7, for further information regarding litigation and other contingencies.\nNEW ACCOUNTING STANDARDS\nThere were no significant updates to previously reported accounting standards included in Note 1 of our 2024 Form 10-K. \n49\nTable of Contents\n                  \nCRITICAL ACCOUNTING ESTIMATES\nMD&A is based on our consolidated financial statements, which have been prepared in conformity with U.S. GAAP. The preparation of these statements requires that we make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses. We base these estimates on historical experience and on assumptions that we consider reasonable under the circumstances; however, reported results could differ from those based on the current estimates under different assumptions or conditions. For a description of our critical accounting estimates that require us to make the most difficult, subjective or complex judgments, refer to our 2024 Form 10-K. We have not changed any of these policies from those previously disclosed in that report.\nNET DEBT\nWe believe that net debt provides investors with information related to the performance-based payout framework in our financial policy, which requires us to maintain our net debt at a level not to exceed the net debt target of $3 billion to $4 billion (excluding project debt for PTFI’s downstream processing facilities). We define net debt as consolidated debt less consolidated cash and cash equivalents. This information differs from consolidated debt determined in accordance with U.S. GAAP and should not be considered in isolation or as a substitute for consolidated debt determined in accordance with U.S. GAAP. Our net debt, which may not be comparable to similarly titled measures reported by other companies, follows (in millions):\nAs of September 30, 2025\nCurrent portion of debt\n$\n383 \nLong-term debt, less current portion\n8,915 \nConsolidated debt\n9,298 \nLess: consolidated cash and cash equivalents\n4,318 \nFCX net debt\n4,980 \nLess: debt for PTFI’s downstream processing facilities\n3,235 \na\nFCX net debt, excluding debt for PTFI’s downstream processing facilities\n$\n1,745 \na.\nRepresents PTFI’s senior notes and $250 million of borrowings under PTFI’s revolving credit facility.\n50\nTable of Contents\n                  \nPRODUCT REVENUES AND PRODUCTION COSTS\nMining Product Revenues and Unit Net Cash Costs (Credits)\nWe believe unit net cash costs (credits) per pound of copper and molybdenum are measures intended to provide investors with information about the cash-generating capacity of our mining operations expressed on a basis relating to the primary metal product for the respective operations. We use this measure for the same purpose and for monitoring operating performance by our mining operations. This information differs from measures of performance determined in accordance with U.S. GAAP and should not be considered in isolation or as a substitute for measures of performance determined in accordance with U.S. GAAP. These measures are presented by other metals mining companies, although our measures may not be comparable to similarly titled measures reported by other companies.\nWe present gross profit per pound of copper in the following tables using both a “by-product” method and a “co-product” method. We use the by-product method in our presentation of gross profit per pound of copper because (i) the majority of our revenues are copper revenues, (ii) we mine ore, which contains copper, gold, molybdenum and other metals, (iii) it is not possible to specifically assign all of our costs to revenues from the copper, gold, molybdenum and other metals we produce and (iv) it is the method used by our management and Board to monitor our mining operations and to compare mining operations in certain industry publications. In the co-product method presentations, shared costs are allocated to the different products based on their relative revenue values, which will vary to the extent our metals sales volumes and realized prices change.\nWe show revenue adjustments for prior period open sales as a separate line item. Because these adjustments do not result from current period sales, these amounts have been reflected separately from revenues on current period sales. Noncash and other costs, net, which are removed from site production and delivery costs in the calculation of unit net cash costs, consist of items such as ARO accretion and other adjustments, inventory write-offs and adjustments, stock-based compensation costs, long-lived asset impairments, idle facility costs, feasibility and optimization study costs, operational readiness and startup costs, restructuring and/or unusual charges. As discussed above, gold, molybdenum and other metal revenues at copper mines are reflected as credits against site production and delivery costs in the by-product method. The following schedules are presentations under both the by-product and co-product methods together with reconciliations to amounts reported in our consolidated financial statements.\n51\nTable of Contents\n                  \nU.S. Copper Mines Product Revenues, Production Costs and Unit Net Cash Costs\nThree Months Ended September 30, 2025\n \n \n(In millions)\nBy-Product\nCo-Product Method\nMethod\nCopper\nMolybdenum\na\nOther\nb\nTotal\nRevenues\n$\n1,677 \n$\n1,677 \n$\n199 \n$\n60 \n$\n1,936 \nSite production and delivery, before net noncash\n    and other costs shown below\n1,225 \n1,081 \n151 \n44 \n1,276 \nBy-product credits\n(208)\n— \n— \n— \n— \nTreatment charges \n45 \n43 \n— \n2 \n45 \nNet cash costs \n1,062 \n1,124 \n151 \n46 \n1,321 \nDD&A\n135 \n119 \n13 \n3 \n135 \nNoncash and other costs, net\n63 \nc\n59 \n3 \n1 \n63 \nTotal costs \n1,260 \n1,302 \n167 \n50 \n1,519 \nGross profit\n$\n417 \n$\n375 \n$\n32 \n$\n10 \n$\n417 \nCopper sales (millions of recoverable pounds)\n341 \n341 \nMolybdenum sales (millions of recoverable pounds)\na\n8 \nGross profit per pound of copper/molybdenum:\nRevenues\n$\n4.92 \n$\n4.92 \n$\n23.66 \nSite production and delivery, before net noncash \n    and other costs shown below\n3.59 \n3.17 \n17.94 \nBy-product credits\n(0.61)\n— \n— \nTreatment charges\n0.13 \n0.13 \n— \nUnit net cash costs\n3.11 \n3.30 \n17.94 \nDD&A\n0.40 \n0.35 \n1.51 \nNoncash and other costs, net\n0.18 \nc\n0.17 \n0.40 \nTotal unit costs\n3.69 \n3.82 \n19.85 \nGross profit per pound\n$\n1.23 \n$\n1.10 \n$\n3.81 \nReconciliation to Amounts Reported\n \n \n \n \n \nRevenues\nProduction and Delivery\nDD&A\nTotals presented above\n$\n1,936 \n$\n1,276 \n$\n135 \nTreatment charges\n1 \n46 \n— \n \nNoncash and other costs, net\n— \n63 \n— \nEliminations and other\n3 \n9 \n(1)\nU.S. copper mines\n1,940 \n1,394 \n134 \nOther mining\nd\n6,826 \n4,502 \n476 \nCorporate, other & eliminations\n(1,794)\n(1,691)\n15 \nAs reported in our consolidated financial statements\n$\n6,972 \n$\n4,205 \n$\n625 \na.\nReflects sales of molybdenum produced by certain of the U.S. copper mines to our molybdenum sales company at market-based pricing.\nb.\nIncludes gold and silver product revenues and production costs.\nc.\nIncludes charges totaling $23 million ($0.07 per pound of copper) for feasibility and optimization studies. \nd.\nRepresents the combined total for our other mining operations as presented in Note 8.\n52\nTable of Contents\n                  \nU.S. Copper Mines Product Revenues, Production Costs and Unit Net Cash Costs\nThree Months Ended September 30, 2024\n \n \n(In millions)\nBy-Product\nCo-Product Method\nMethod\nCopper\nMolybdenum\na\nOther\nb\nTotal\nRevenues, excluding adjustments\n$\n1,373 \n$\n1,373 \n$\n168 \n$\n46 \n$\n1,587 \nSite production and delivery, before net noncash\n    and other costs shown below\n1,153 \n1,030 \n132 \n39 \n1,201 \nBy-product credits\n(166)\n— \n— \n— \n— \nTreatment charges \n42 \n40 \n— \n2 \n42 \nNet cash costs \n1,029 \n1,070 \n132 \n41 \n1,243 \nDD&A\n110 \n98 \n10 \n2 \n110 \nNoncash and other costs, net\n51 \nc\n48 \n3 \n— \n51 \nTotal costs \n1,190 \n1,216 \n145 \n43 \n1,404 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n(1)\n(1)\n— \n— \n(1)\nGross profit\n$\n182 \n$\n156 \n$\n23 \n$\n3 \n$\n182 \nCopper sales (millions of recoverable pounds)\n317 \n317 \nMolybdenum sales (millions of recoverable pounds)\na\n8 \nGross profit per pound of copper/molybdenum:\nRevenues, excluding adjustments\n$\n4.32 \n$\n4.32 \n$\n21.33 \nSite production and delivery, before net noncash\n    and other costs shown below\n3.64 \n3.25 \n16.83 \nBy-product credits\n(0.53)\n— \n— \nTreatment charges\n0.13 \n0.12 \n— \nUnit net cash costs\n3.24 \n3.37 \n16.83 \nDD&A\n0.35 \n0.31 \n1.22 \nNoncash and other costs, net\n0.16 \nc\n0.15 \n0.40 \nTotal unit costs\n3.75 \n3.83 \n18.45 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n— \n— \n— \nGross profit per pound\n$\n0.57 \n$\n0.49 \n$\n2.88 \nReconciliation to Amounts Reported\n \n \n \n \n \nRevenues\nProduction and Delivery\nDD&A\n \nTotals presented above\n$\n1,587 \n$\n1,201 \n$\n110 \n \nTreatment charges\n(2)\n40 \n— \n \nNoncash and other costs, net\n— \n51 \n— \n \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n(1)\n— \n— \n \nEliminations and other\n7 \n11 \n(1)\n \nU.S. copper mines\n1,591 \n1,303 \n109 \n \nOther mining\nd\n6,766 \n4,191 \n477 \nCorporate, other & eliminations\n(1,567)\n(1,417)\n14 \n \nAs reported in our consolidated financial statements\n$\n6,790 \n$\n4,077 \n$\n600 \n \na.\nReflects sales of molybdenum produced by certain of the U.S. copper mines to our molybdenum sales company at market-based pricing.\nb.\nIncludes gold and silver product revenues and production costs.\nc.\nIncludes charges totaling $18 million ($0.06 per pound of copper) for feasibility and optimization studies.\nd.\nRepresents the combined total for our other mining operations as presented in Note 8.\n53\nTable of Contents\n                  \nU.S. Copper Mines Product Revenues, Production Costs and Unit Net Cash Costs\nNine Months Ended September 30, 2025\n(In millions)\nBy-Product\nCo-Product Method\nMethod\nCopper\nMolybdenum\na\nOther\nb\nTotal\nRevenues, excluding adjustments\n$\n4,579 \n$\n4,579 \n$\n525 \n$\n152 \n$\n5,256 \nSite production and delivery, before net noncash\n    and other costs shown below\n3,358 \n2,976 \n413 \n117 \n3,506 \nBy-product credits\n(530)\n— \n— \n— \n— \nTreatment charges \n130 \n124 \n— \n6 \n130 \nNet cash costs \n2,958 \n3,100 \n413 \n123 \n3,636 \nDD&A\n376 \n337 \n31 \n8 \n376 \nNoncash and other costs, net\n153 \nc\n141 \n10 \n2 \n153 \nTotal costs \n3,487 \n3,578 \n454 \n133 \n4,165 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n4 \n4 \n— \n1 \n5 \nGross profit \n$\n1,096 \n$\n1,005 \n$\n71 \n$\n20 \n$\n1,096 \nCopper sales (millions of recoverable pounds)\n957 \n957 \nMolybdenum sales (millions of recoverable pounds)\na\n25 \nGross profit per pound of copper/molybdenum:\nRevenues, excluding adjustments\n$\n4.78 \n$\n4.78 \n$\n21.25 \nSite production and delivery, before net noncash \n    and other costs shown below\n3.51 \n3.11 \n16.73 \nBy-product credits\n(0.56)\n— \n— \nTreatment charges\n0.14 \n0.13 \n— \nUnit net cash costs\n3.09 \n3.24 \n16.73 \nDD&A\n0.39 \n0.35 \n1.28 \nNoncash and other costs, net\n0.16 \nc\n0.15 \n0.38 \nTotal unit costs\n3.64 \n3.74 \n18.39 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n0.01 \n0.01 \n— \nGross profit per pound\n$\n1.15 \n$\n1.05 \n$\n2.86 \nReconciliation to Amounts Reported\nProduction\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n5,256 \n$\n3,506 \n$\n376 \nTreatment charges\n(9)\n121 \n— \nNoncash and other costs, net\n— \n153 \n— \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n5 \n— \n— \nEliminations and other\n32 \n40 \n— \nU.S. copper mines\n5,284 \n3,820 \n376 \nOther mining\nd\n19,713 \n12,850 \n1,343 \nCorporate, other & eliminations\n(4,715)\n(4,427)\n40 \nAs reported in our consolidated financial statements\n$\n20,282 \n$\n12,243 \n$\n1,759 \n \na.\nReflects sales of molybdenum produced by certain of the U.S. copper mines to our molybdenum sales company at market-based pricing.\nb.\nIncludes gold and silver product revenues and production costs.\nc.\nIncludes charges totaling $63 million ($0.07 per pound of copper) for feasibility and optimization studies. \nd.\nRepresents the combined total for our other segments as presented in Note 8.\n54\nTable of Contents\n                  \nU.S. Copper Mines Product Revenues, Production Costs and Unit Net Cash Costs\nNine Months Ended September 30, 2024\n(In millions)\nBy-Product\nCo-Product Method\nMethod\nCopper\nMolybdenum\na\nOther\nb\nTotal\nRevenues\n$\n4,048 \n$\n4,048 \n$\n433 \n$\n127 \n$\n4,608 \nSite production and delivery, before net noncash\n    and other costs shown below\n3,250 \n2,928 \n358 \n104 \n3,390 \nBy-product credits\n(420)\n— \n— \n— \n— \nTreatment charges \n125 \n120 \n— \n5 \n125 \nNet cash costs \n2,955 \n3,048 \n358 \n109 \n3,515 \nDD&A\n327 \n295 \n26 \n6 \n327 \nNoncash and other costs, net\n133 \nc\n123 \n9 \n1 \n133 \nTotal costs \n3,415 \n3,466 \n393 \n116 \n3,975 \nGross profit\n$\n633 \n$\n582 \n$\n40 \n$\n11 \n$\n633 \nCopper sales (millions of recoverable pounds)\n943 \n943 \nMolybdenum sales (millions of recoverable pounds)\na\n22 \nGross profit per pound of copper/molybdenum:\nRevenues\n$\n4.29 \n$\n4.29 \n$\n19.97 \nSite production and delivery, before net noncash \n    and other costs shown below\n3.45 \n3.10 \n16.52 \nBy-product credits\n(0.45)\n— \n— \nTreatment charges\n0.13 \n0.13 \n— \nUnit net cash costs\n3.13 \n3.23 \n16.52 \nDD&A\n0.35 \n0.32 \n1.23 \nNoncash and other costs, net\n0.14 \nc\n0.13 \n0.39 \nTotal unit costs\n3.62 \n3.68 \n18.14 \nGross profit per pound\n$\n0.67 \n$\n0.61 \n$\n1.83 \nReconciliation to Amounts Reported\nProduction\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n4,608 \n$\n3,390 \n$\n327 \nTreatment charges\n(4)\n121 \n— \nNoncash and other costs, net\n— \n133 \n— \nEliminations and other\n25 \n34 \n— \nU.S. copper mines\n4,629 \n3,678 \n327 \nOther mining\nd\n19,565 \n12,298 \n1,330 \nCorporate, other & eliminations\n(4,459)\n(4,180)\n47 \nAs reported in our consolidated financial statements\n$\n19,735 \n$\n11,796 \n$\n1,704 \na.\nReflects sales of molybdenum produced by certain of the U.S. copper mines to our molybdenum sales company at market-based pricing.\nb.\nIncludes gold and silver product revenues and production costs.\nc.\nIncludes charges totaling $48 million ($0.05 per pound of copper) for feasibility and optimization studies.\nd.\nRepresents the combined total for our other segments as presented in Note 8.\n55\nTable of Contents\n                  \nSouth America Operations Product Revenues, Production Costs and Unit Net Cash Costs\nThree Months Ended September 30, 2025\n(In millions)\nBy-Product\nCo-Product Method\nMethod\nCopper\nOther\na\nTotal\nRevenues, excluding adjustments\n$\n1,278 \n$\n1,278 \n$\n154 \n$\n1,432 \nSite production and delivery, before net noncash\n    and other costs shown below\n764 \n690 \n86 \n776 \nBy-product credits\n(144)\n— \n— \n— \nTreatment charges\n18 \n18 \n— \n18 \nRoyalty on metals\n2 \n2 \n— \n2 \nNet cash costs\n640 \n710 \n86 \n796 \nDD&A\n114 \n101 \n13 \n114 \nNoncash and other costs, net\n26 \nb\n25 \n1 \n26 \nTotal costs\n780 \n836 \n100 \n936 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n— \n— \n2 \n2 \nGross profit \n$\n498 \n$\n442 \n$\n56 \n$\n498 \nCopper sales (millions of recoverable pounds)\n278 \n278 \nGross profit per pound of copper:\nRevenues, excluding adjustments\n$\n4.60 \n$\n4.60 \nSite production and delivery, before net noncash\n    and other costs shown below\n2.75 \n2.49 \nBy-product credits\n(0.52)\n— \nTreatment charges\n0.06 \n0.06 \nRoyalty on metals\n0.01 \n0.01 \nUnit net cash costs\n2.30 \n2.56 \nDD&A\n0.41 \n0.36 \nNoncash and other costs, net\n0.10 \nb\n0.09 \nTotal unit costs\n2.81 \n3.01 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n— \n— \nGross profit per pound\n$\n1.79 \n$\n1.59 \nReconciliation to Amounts Reported\nProduction\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n1,432 \n$\n776 \n$\n114 \nTreatment charges\n(18)\n— \n— \nRoyalty on metals\n(2)\n— \n— \nNoncash and other costs, net\n— \n26 \n— \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n2 \n— \n— \nSouth America operations\n1,414 \n802 \n114 \nOther mining\nc\n7,352 \n5,094 \n496 \nCorporate, other & eliminations\n(1,794)\n(1,691)\n15 \nAs reported in our consolidated financial statements\n$\n6,972 \n$\n4,205 \n$\n625 \na.\nIncludes silver sales of 0.9 million ounces ($44.89 per ounce average realized price). Also reflects sales of molybdenum produced by Cerro Verde to our molybdenum sales company at market-based pricing.\nb.\nIncludes charges totaling $18 million ($0.06 per pound of copper) for feasibility and optimization studies.\nc.\nRepresents the combined total for our other mining operations as presented in Note 8.\n56\nTable of Contents\n                  \nSouth America Operations Product Revenues, Production Costs and Unit Net Cash Costs\nThree Months Ended September 30, 2024\n(In millions)\nBy-Product\nCo-Product Method\nMethod\nCopper\nOther\na\nTotal\nRevenues, excluding adjustments\n$\n1,257 \n$\n1,257 \n$\n122 \n$\n1,379 \nSite production and delivery, before net noncash\n    and other costs shown below\n776 \nb\n711 \n78 \n789 \nBy-product credits\n(109)\n— \n— \n— \nTreatment charges\n45 \n45 \n— \n45 \nRoyalty on metals\n2 \n2 \n— \n2 \nNet cash costs\n714 \n758 \n78 \n836 \nDD&A\n109 \n99 \n10 \n109 \nNoncash and other costs, net\n28 \nc\n28 \n— \n28 \nTotal costs\n851 \n885 \n88 \n973 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n(18)\n(18)\n— \n(18)\nGross profit \n$\n388 \n$\n354 \n$\n34 \n$\n388 \nCopper sales (millions of recoverable pounds)\n293 \n293 \nGross profit per pound of copper:\nRevenues, excluding adjustments\n$\n4.29 \n$\n4.29 \nSite production and delivery, before net noncash\n    and other costs shown below\n2.65 \nb\n2.43 \nBy-product credits\n(0.37)\n— \nTreatment charges\n0.15 \n0.15 \nRoyalty on metals\n0.01 \n0.01 \nUnit net cash costs\n2.44 \n2.59 \nDD&A\n0.37 \n0.34 \nNoncash and other costs, net\n0.10 \nc\n0.09 \nTotal unit costs\n2.91 \n3.02 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n(0.06)\n(0.06)\nGross profit per pound\n$\n1.32 \n$\n1.21 \nReconciliation to Amounts Reported\nProduction\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n1,379 \n$\n789 \n$\n109 \nTreatment charges\n(45)\n— \n— \nRoyalty on metals\n(2)\n— \n— \nNoncash and other costs, net\n— \n28 \n— \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n(18)\n— \n— \nEliminations and other\n2 \n— \n1 \nSouth America operations\n1,316 \n817 \n110 \nOther mining\nd\n7,041 \n4,677 \n476 \nCorporate, other & eliminations\n(1,567)\n(1,417)\n14 \nAs reported in our consolidated financial statements\n$\n6,790 \n$\n4,077 \n$\n600 \na.\nIncludes silver sales of 0.9 million ounces ($30.59 per ounce average realized price). Also reflects sales of molybdenum produced by Cerro Verde to our molybdenum sales company at market-based pricing.\nb.\nIncludes $34 million ($0.12 per pound of copper) of nonrecurring labor-related charges at Cerro Verde associated with new CLAs.\n \nc.\nIncludes charges totaling $18 million ($0.06 per pound of copper) for feasibility studies. \nd.\nRepresents the combined total for our other mining operations as presented in Note 8.\n57\nTable of Contents\n                  \nSouth America Operations Product Revenues, Production Costs and Unit Net Cash Costs\nNine Months Ended September 30, 2025\n(In millions)\nBy-Product\nCo-Product Method\nMethod\nCopper\nOther\na\nTotal\nRevenues, excluding adjustments\n$\n3,649 \n$\n3,649 \n$\n406 \n$\n4,055 \nSite production and delivery, before net noncash\n    and other costs shown below\n2,254 \n2,050 \n248 \n2,298 \nBy-product credits\n(364)\n— \n— \n— \nTreatment charges\n54 \n54 \n— \n54 \nRoyalty on metals\n6 \n5 \n1 \n6 \nNet cash costs\n1,950 \n2,109 \n249 \n2,358 \nDD&A\n338 \n304 \n34 \n338 \nNoncash and other costs, net\n61 \nb\n59 \n2 \n61 \nTotal costs\n2,349 \n2,472 \n285 \n2,757 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n53 \n54 \n1 \n55 \nGross profit \n$\n1,353 \n$\n1,231 \n$\n122 \n$\n1,353 \nCopper sales (millions of recoverable pounds)\n818 \n818 \nGross profit per pound of copper:\nRevenues, excluding adjustments\n$\n4.46 \n$\n4.46 \nSite production and delivery, before net noncash\n    and other costs shown below\n2.75 \n2.50 \nBy-product credits\n(0.45)\n— \nTreatment charges\n0.07 \n0.07 \nRoyalty on metals\n0.01 \n0.01 \nUnit net cash costs\n2.38 \n2.58 \nDD&A\n0.42 \n0.37 \nNoncash and other costs, net\n0.07 \nb\n0.07 \nTotal unit costs\n2.87 \n3.02 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n0.07 \n0.07 \nGross profit per pound\n$\n1.66 \n$\n1.51 \nReconciliation to Amounts Reported\nProduction\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n4,055 \n$\n2,298 \n$\n338 \nTreatment charges\n(54)\n— \n— \nRoyalty on metals\n(6)\n— \n— \nNoncash and other costs, net\n— \n61 \n— \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n55 \n— \n— \nEliminations and other\n1 \n(1)\n— \nSouth America operations\n4,051 \n2,358 \n338 \nOther mining\nc\n20,946 \n14,312 \n1,381 \nCorporate, other & eliminations\n(4,715)\n(4,427)\n40 \nAs reported in our consolidated financial statements\n$\n20,282 \n$\n12,243 \n$\n1,759 \na.\nIncludes silver sales of 2.5 million ounces ($39.10 per ounce average realized price). Also reflects sales of molybdenum produced by Cerro Verde to our molybdenum sales company at market-based pricing.\nb.\nIncludes charges totaling $51 million ($0.06 per pound of copper) for feasibility and optimization studies.\nc.\nRepresents the combined total for our other segments as presented in Note 8.\n58\nTable of Contents\n                  \nSouth America Operations Product Revenues, Production Costs and Unit Net Cash Costs\nNine Months Ended September 30, 2024\n(In millions)\nBy-Product\nCo-Product Method\nMethod\nCopper\nOther\na\nTotal\nRevenues, excluding adjustments\n$\n3,737 \n$\n3,737 \n$\n342 \n$\n4,079 \nSite production and delivery, before net noncash\n    and other costs shown below\n2,347 \nb\n2,169 \n217 \n2,386 \nBy-product credits\n(302)\n— \n— \n— \nTreatment charges\n144 \n144 \n— \n144 \nRoyalty on metals\n6 \n5 \n1 \n6 \nNet cash costs\n2,195 \n2,318 \n218 \n2,536 \nDD&A\n331 \n303 \n28 \n331 \nNoncash and other costs, net\n66 \nc\n64 \n2 \n66 \nTotal costs\n2,592 \n2,685 \n248 \n2,933 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n33 \n33 \n(1)\n32 \nGross profit\n$\n1,178 \n$\n1,085 \n$\n93 \n$\n1,178 \nCopper sales (millions of recoverable pounds)\n879 \n879 \nGross profit per pound of copper:\nRevenues, excluding adjustments\n$\n4.25 \n$\n4.25 \nSite production and delivery, before net noncash\n    and other costs shown below\n2.67 \nb\n2.47 \nBy-product credits\n(0.34)\n— \nTreatment charges\n0.16 \n0.16 \nRoyalty on metals\n0.01 \n0.01 \nUnit net cash costs\n2.50 \n2.64 \nDD&A\n0.38 \n0.35 \nNoncash and other costs, net\n0.07 \nc\n0.07 \nTotal unit costs\n2.95 \n3.06 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n0.04 \n0.04 \nGross profit per pound\n$\n1.34 \n$\n1.23 \nReconciliation to Amounts Reported\nProduction\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n4,079 \n$\n2,386 \n$\n331 \nTreatment charges\n(144)\n— \n— \nRoyalty on metals\n(6)\n— \n— \nNoncash and other costs, net\n— \n66 \n— \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n32 \n— \n— \nEliminations and other\n2 \n(2)\n1 \nSouth America operations\n3,963 \n2,450 \n332 \nOther mining\nd\n20,231 \n13,526 \n1,325 \nCorporate, other & eliminations\n(4,459)\n(4,180)\n47 \nAs reported in our consolidated financial statements\n$\n19,735 \n$\n11,796 \n$\n1,704 \na.\nIncludes silver sales of 2.7 million ounces ($29.18 per ounce average realized price). Also reflects sales of molybdenum produced by Cerro Verde to our molybdenum sales company at market-based pricing.\nb.\nIncludes $99 million ($0.11 per pound of copper) of nonrecurring labor-related charges at Cerro Verde associated with new CLAs.\nc.\nIncludes charges totaling $41 million ($0.05 per pound of copper) for feasibility studies.\nd.\nRepresents the combined total for our other segments as presented in Note 8.\n59\nTable of Contents\n                  \nIndonesia Operations Product Revenues, Production Costs and Unit Net Cash (Credits) Costs\nThree Months Ended September 30, 2025\n(In millions)\nCo-Product Method\nBy-Product Method\nCopper\nGold\nSilver & Other\na\nTotal\nRevenues, excluding adjustments\n$\n1,624 \n$\n1,624 \n$\n1,172 \n$\n88 \n$\n2,884 \nSite production and delivery, before net noncash\n    and other costs shown below\n663 \n373 \n270 \n20 \n663 \nBy-product credits\n(1,265)\n— \n— \n— \n— \nTreatment charges\n32 \n18 \n13 \n1 \n32 \nExport duties\n135 \n77 \n55 \n3 \n135 \nRoyalty on metals\n105 \n62 \n41 \n2 \n105 \nNet cash (credits) costs\n(330)\n530 \n379 \n26 \n935 \nDD&A\n330 \nb\n186 \n134 \n10 \n330 \nNoncash and other costs, net\n315 \nc\n177 \n128 \n10 \n315 \nTotal costs\n315 \n893 \n641 \n46 \n1,580 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n13 \n13 \n4 \n1 \n18 \nGross profit \n$\n1,322 \n$\n744 \n$\n535 \n$\n43 \n$\n1,322 \nCopper sales (millions of recoverable pounds)\n360 \n360 \nGold sales (thousands of recoverable ounces)\n332 \nGross profit per pound of copper/per ounce of gold:\nRevenues, excluding adjustments\n$\n4.52 \n$\n4.52 \n$\n3,535 \nSite production and delivery, before net noncash\n    and other costs shown below\n1.84 \n1.04 \n813 \nBy-product credits\n(3.52)\n— \n— \nTreatment charges\n0.09 \n0.05 \n39 \nExport duties\n0.38 \n0.21 \n166 \nRoyalty on metals\n0.29 \n0.17 \n125 \nUnit net cash (credits) costs\n(0.92)\n1.47 \n1,143 \nDD&A\n0.92 \nb\n0.52 \n404 \nNoncash and other costs, net\n0.88 \nc\n0.49 \n386 \nTotal unit costs\n0.88 \n2.48 \n1,933 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n0.04 \n0.04 \n11 \nGross profit per pound/ounce\n$\n3.68 \n$\n2.08 \n$\n1,613 \nReconciliation to Amounts Reported\nProduction\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n2,884 \n$\n663 \n$\n330 \nTreatment charges\n13 \n45 \nd\n— \nExport duties\n(135)\n— \n— \nRoyalty on metals\n(105)\n— \n— \nNoncash and other costs, net\n— \n315 \n— \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n18 \n— \n— \nEliminations and other\n— \n1 \n1 \nIndonesia operations\n2,675 \n1,024 \n331 \nOther mining\ne\n6,091 \n4,872 \n279 \nCorporate, other & eliminations\n(1,794)\n(1,691)\n15 \nAs reported in our consolidated financial statements\n$\n6,972 \n$\n4,205 \n$\n625 \na.\nIncludes silver sales of 1.8 million ounces ($40.81 per ounce average realized price). \nb.\nIncludes $24 million ($0.07 per pound of copper) associated with idle facility costs following the September 2025 mud rush incident.\nc.\nIncludes charges totaling (i) $171 million ($0.47 per pound of copper) for idle facility costs and recovery efforts associated with the September 2025 mud rush incident, (ii) $83 million ($0.23 per pound of copper) for operational readiness and startup costs associated with PTFI’s downstream processing facilities, (iii) $39 million ($0.11 per pound of copper) associated with PT Smelting planned maintenance and idle facility related tolling fees and (iv) $26 million ($0.07 per pound of copper) for remediation costs related to the October 2024 fire incident at the smelter not recoverable under PTFI’s construction insurance program. \nd.\nRepresents tolling costs paid to PT Smelting and excludes $39 million of tolling fees that were recognized as idle facility costs in noncash and other costs, net (refer to note c above) associated with PT Smelting’s planned maintenance turnaround.\ne.\nRepresents the combined total for our other mining operations as presented in Note 8.\n60\nTable of Contents\n                  \nIndonesia Operations Product Revenues, Production Costs and Unit Net Cash (Credits) Costs\nThree Months Ended September 30, 2024\n(In millions)\nCo-Product Method\nBy-Product Method\nCopper\nGold\nSilver & Other\na\nTotal\nRevenues, excluding adjustments\n$\n1,826 \n$\n1,826 \n$\n1,421 \n$\n68 \n$\n3,315 \nSite production and delivery, before net noncash\n    and other costs shown below\n774 \n426 \n332 \n16 \n774 \nBy-product credits\n(1,493)\n— \n— \n— \n— \nTreatment charges\n157 \n87 \n67 \n3 \n157 \nExport duties\n129 \n71 \n55 \n3 \n129 \nRoyalty on metals\n129 \n74 \n53 \n2 \n129 \nNet cash (credits) costs\n(304)\n658 \n507 \n24 \n1,189 \nDD&A\n340 \n187 \n146 \n7 \n340 \nNoncash and other costs, net\n52 \nb\n29 \n22 \n1 \n52 \nTotal costs\n88 \n874 \n675 \n32 \n1,581 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n(14)\n(14)\n4 \n— \n(10)\nGross profit \n$\n1,724 \n$\n938 \n$\n750 \n$\n36 \n$\n1,724 \nCopper sales (millions of recoverable pounds)\n426 \n426 \nGold sales (thousands of recoverable ounces)\n554 \nGross profit per pound of copper/per ounce of gold:\nRevenues, excluding adjustments\n$\n4.29 \n$\n4.29 \n$\n2,569 \nSite production and delivery, before net noncash\n    and other costs shown below\n1.82 \n1.00 \n599 \nBy-product credits\n(3.50)\n— \n— \nTreatment charges\n0.37 \n0.20 \n122 \nExport duties\n0.30 \n0.17 \n99 \nRoyalty on metals\n0.30 \n0.17 \n95 \nUnit net cash (credits) costs\n(0.71)\n1.54 \n915 \nDD&A\n0.80 \n0.44 \n263 \nNoncash and other costs, net\n0.12 \nb\n0.07 \n41 \nTotal unit costs\n0.21 \n2.05 \n1,219 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n(0.03)\n(0.03)\n6 \nGross profit per pound/ounce\n$\n4.05 \n$\n2.21 \n$\n1,356 \nReconciliation to Amounts Reported\nProduction\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n3,315 \n$\n774 \n$\n340 \nTreatment charges\n(65)\n92 \nc\n— \nExport duties\n(129)\n— \n— \nRoyalty on metals\n(129)\n— \n— \nNoncash and other costs, net\n— \n52 \n— \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n(10)\n— \n— \nIndonesia operations\n2,982 \n918 \n340 \nOther mining\nd\n5,375 \n4,576 \n246 \nCorporate, other & eliminations\n(1,567)\n(1,417)\n14 \nAs reported in our consolidated financial statements\n$\n6,790 \n$\n4,077 \n$\n600 \na.\nIncludes silver sales of 2.1 million ounces ($30.11 per ounce average realized price).\nb.\nIncludes charges totaling $39 million ($0.09 per pound of copper) for operational readiness and startup costs associated with PTFI’s downstream processing facilities. \nc.\nRepresents tolling costs paid to PT Smelting.\nd.\nRepresents the combined total for our other mining operations as presented in Note 8.\n61\nTable of Contents\n                  \nIndonesia Operations Product Revenues, Production Costs and Unit Net Cash (Credits) Costs\nNine Months Ended September 30, 2025\n(In millions)\nCo-Product Method\nBy-Product Method\nCopper\nGold\nSilver & Other\na\nTotal\nRevenues, excluding adjustments\n$\n4,827 \n$\n4,827 \n$\n3,273 \n$\n159 \n$\n8,259 \nSite production and delivery, before net noncash\n    and other costs shown below\n2,052 \n1,199 \n813 \n40 \n2,052 \nBy-product credits\n(3,449)\n— \n— \n— \n— \nTreatment charges\n175 \n103 \n69 \n3 \n175 \nExport duties\n337 \n196 \n134 \n7 \n337 \nRoyalty on metals\n304 \n179 \n122 \n3 \n304 \nNet cash (credits) costs\n(581)\n1,677 \n1,138 \n53 \n2,868 \nDD&A\n905 \nb\n529 \n358 \n18 \n905 \nNoncash and other costs, net\n490 \nc\n286 \n195 \n9 \n490 \nTotal costs\n814 \n2,492 \n1,691 \n80 \n4,263 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n19 \n19 \n16 \n1 \n36 \nGross profit \n$\n4,032 \n$\n2,354 \n$\n1,598 \n$\n80 \n$\n4,032 \nCopper sales (millions of recoverable pounds)\n1,093 \n1,093 \nGold sales (thousands of recoverable ounces)\n975 \nGross profit per pound of copper/per ounce of gold:\nRevenues, excluding adjustments\n$\n4.42 \n$\n4.42 \n$\n3,357 \nSite production and delivery, before net noncash\n    and other costs shown below\n1.88 \n1.10 \n834 \nBy-product credits\n(3.16)\n— \n— \nTreatment charges\n0.16 \n0.09 \n71 \nExport duties\n0.31 \n0.18 \n138 \nRoyalty on metals\n0.28 \n0.16 \n125 \nUnit net cash (credits) costs\n(0.53)\n1.53 \n1,168 \nDD&A\n0.82 \nb\n0.49 \n367 \nNoncash and other costs, net\n0.45 \nc\n0.26 \n199 \nTotal unit costs\n0.74 \n2.28 \n1,734 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n0.01 \n0.01 \n16 \nGross profit per pound/ounce\n$\n3.69 \n$\n2.15 \n$\n1,639 \nReconciliation to Amounts Reported\nProduction\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n8,259 \n$\n2,052 \n$\n905 \nTreatment charges\n9 \n184 \nd\n— \nExport duties\n(337)\n— \n— \nRoyalty on metals\n(304)\n— \n— \nNoncash and other costs, net\n— \n490 \n— \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n36 \n— \n— \nEliminations and other\n(1)\n— \n1 \nIndonesia operations\n7,662 \n2,726 \n906 \nOther mining\ne\n17,335 \n13,944 \n813 \nCorporate, other & eliminations\n(4,715)\n(4,427)\n40 \nAs reported in our consolidated financial statements\n$\n20,282 \n$\n12,243 \n$\n1,759 \na.\nIncludes silver sales of 3.3 million ounces ($37.82 per ounce average realized price).\nb.\nIncludes $24 million ($0.02 per pound of copper) \nassociated with idle facility costs following the September 2025 mud rush incident\n. \nc.\nIncludes charges totaling (i) $185 million ($0.17 per pound of copper) for operational readiness and startup costs associated with PTFI’s downstream processing facilities, (ii) $171 million ($0.16 per pound of copper) for idle facility costs and recovery efforts associated with the September 2025 mud rush incident, (iii) $56 million ($0.05 per pound of copper) of remediation costs related to the October 2024 fire incident at the smelter not recoverable under PTFI’s construction insurance program, (iv) $39 million ($0.04 per pound of copper) associated with PT Smelting planned maintenance and idle facility related tolling fees and (v) $24 million ($0.02 per pound of copper) related to the reversal of previously capitalized land lease costs at PTFI’s downstream processing facilities.\nd.\nRepresents tolling costs paid to PT Smelting and excludes $39 million of tolling fees that were recognized as idle facility costs in noncash and other costs, net (refer to note c above) associated with PT Smelting’s planned maintenance turnaround.\ne.\nRepresents the combined total for our other segments as presented in Note 8.\n62\nTable of Contents\n                  \nIndonesia Operations Product Revenues, Production Costs and Unit Net Cash (Credits) Costs\nNine Months Ended September 30, 2024\n(In millions)\nCo-Product Method\nBy-Product Method\nCopper\nGold\nSilver & Other\na\nTotal\nRevenues, excluding adjustments\n$\n5,325 \n$\n5,325 \n$\n3,477 \n$\n169 \n$\n8,971 \nSite production and delivery, before net noncash\n    and other costs shown below\n2,062 \n1,224 \n799 \n39 \n2,062 \nBy-product credits\n(3,645)\n— \n— \n— \n— \nTreatment charges\n453 \n269 \n176 \n8 \n453 \nExport duties\n360 \n213 \n140 \n7 \n360 \nRoyalty on metals\n338 \n203 \n130 \n5 \n338 \nNet cash (credits) costs\n(432)\n1,909 \n1,245 \n59 \n3,213 \nDD&A\n923 \n548 \n358 \n17 \n923 \nNoncash and other costs, net\n139 \nb\n82 \n54 \n3 \n139 \nTotal costs\n630 \n2,539 \n1,657 \n79 \n4,275 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n6 \n6 \n(1)\n— \n5 \nGross profit \n$\n4,701 \n$\n2,792 \n$\n1,819 \n$\n90 \n$\n4,701 \nCopper sales (millions of recoverable pounds)\n1,256 \n1,256 \nGold sales (thousands of recoverable ounces)\n1,474 \nGross profit per pound of copper/per ounce of gold:\nRevenues, excluding adjustments\n$\n4.24 \n$\n4.24 \n$\n2,362 \nSite production and delivery, before net noncash\n    and other costs shown below\n1.64 \n0.98 \n542 \nBy-product credits\n(2.90)\n— \n— \nTreatment charges\n0.36 \n0.21 \n119 \nExport duties\n0.29 \n0.17 \n95 \nRoyalty on metals\n0.27 \n0.16 \n89 \nUnit net cash (credits) costs\n(0.34)\n1.52 \n845 \nDD&A\n0.73 \n0.44 \n243 \nNoncash and other costs, net\n0.11 \nb\n0.06 \n36 \nTotal unit costs\n0.50 \n2.02 \n1,124 \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n— \n— \n(3)\nGross profit per pound/ounce\n$\n3.74 \n$\n2.22 \n$\n1,235 \nReconciliation to Amounts Reported\nProduction\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n8,971 \n$\n2,062 \n$\n923 \nTreatment charges\n(203)\n250 \nc\n— \nExport duties\n(360)\n— \n— \nRoyalty on metals\n(338)\n— \n— \nNoncash and other costs, net\n— \n139 \n— \nOther revenue adjustments, primarily for pricing\n    on prior period open sales\n5 \n— \n— \nIndonesia operations\n8,075 \n2,451 \n923 \nOther mining\nd\n16,119 \n13,525 \n734 \nCorporate, other & eliminations\n(4,459)\n(4,180)\n47 \nAs reported in our consolidated financial statements\n$\n19,735 \n$\n11,796 \n$\n1,704 \na.\nIncludes silver sales of 5.5 million ounces ($28.01 per ounce average realized price).\nb.\nIncludes charges totaling (i) $74 million ($0.06 per pound of copper) for operational readiness and startup costs associated with PTFI’s downstream processing facilities, (ii) $34 million ($0.03 per pound of copper) related to the reversal of previously capitalized land lease costs at PTFI’s downstream processing facilities and (iii) $22 million ($0.02 per pound of copper) for feasibility and optimization studies.\nc.\nRepresents tolling costs paid to PT Smelting.\nd.\nRepresents the combined total for our other segments as presented in Note 8.\n63\nTable of Contents\n                  \nMolybdenum Mines Product Revenues, Production Costs and Unit Net Cash Costs\nThree Months Ended September 30,\n(In millions)\n2025\n2024\nRevenues, excluding adjustments\na\n$\n186 \n$\n138 \nSite production and delivery, before net noncash\n    and other costs shown below\n144 \n131 \nTreatment charges and other\n9 \n6 \nNet cash costs\n153 \n137 \nDD&A\n22 \n19 \nNoncash and other costs, net\n6 \n9 \nTotal costs\n181 \n165 \nGross profit (loss)\n$\n5 \n$\n(27)\nMolybdenum sales (millions of recoverable pounds)\na\n8 \n6 \nGross profit (loss) per pound of molybdenum:\nRevenues, excluding adjustments\na\n$\n23.57 \n$\n21.20 \nSite production and delivery, before net noncash\n    and other costs shown below\n18.32 \n20.15 \nTreatment charges and other\n1.09 \n0.91 \nUnit net cash costs\n19.41 \n21.06 \nDD&A\n2.72 \n2.85 \nNoncash and other costs, net\n0.80 \n1.46 \nTotal unit costs\n22.93 \n25.37 \nGross profit (loss) per pound\n$\n0.64 \n$\n(4.17)\nReconciliation to Amounts Reported\nProduction\nThree Months Ended September 30, 2025\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n186 \n$\n144 \n$\n22 \nTreatment charges and other\n(9)\n— \n— \nNoncash and other costs, net\n— \n6 \n— \nMolybdenum mines\n177 \n150 \n22 \nOther mining\nb\n8,589 \n5,746 \n588 \nCorporate, other & eliminations\n(1,794)\n(1,691)\n15 \nAs reported in our consolidated financial statements\n$\n6,972 \n$\n4,205 \n$\n625 \nThree Months Ended September 30, 2024\nTotals presented above\n$\n138 \n$\n131 \n$\n19 \nTreatment charges and other\n(6)\n— \n— \nNoncash and other costs, net\n— \n9 \n— \nMolybdenum mines\n132 \n140 \n19 \nOther mining\nb\n8,225 \n5,354 \n567 \nCorporate, other & eliminations\n(1,567)\n(1,417)\n14 \nAs reported in our consolidated financial statements\n$\n6,790 \n$\n4,077 \n$\n600 \na.\nReflects sales of the Molybdenum mines’ production to our molybdenum sales company at market-based pricing. On a consolidated basis, realizations are based on the actual contract terms for sales to third parties; as a result, our consolidated average realized price per pound of molybdenum will differ from the amounts reported in this table.\nb.\nRepresents the combined total for our other mining operations as presented in Note 8. Also includes amounts associated with the molybdenum sales company, which includes sales of molybdenum produced by the Molybdenum mines and by certain of the U.S. copper mines and the Cerro Verde mine.\n64\nTable of Contents\n                  \nMolybdenum Mines Product Revenues, Production Costs and Unit Net Cash Costs\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nRevenues, excluding adjustments\na\n$\n561 \n$\n434 \nSite production and delivery, before net noncash\n    and other costs shown below\n382 \n376 \nTreatment charges and other\n27 \n19 \nNet cash costs\n409 \n395 \nDD&A\n74 \n51 \nNoncash and other costs, net\n18 \n17 \nTotal costs\n501 \n463 \nGross profit (loss) \n$\n60 \n$\n(29)\nMolybdenum sales (millions of recoverable pounds)\na\n26 \n21 \nGross profit (loss) per pound of molybdenum:\nRevenues, excluding adjustments\na\n$\n21.37 \n$\n20.40 \nSite production and delivery, before net noncash\n    and other costs shown below\n14.56 \n17.71 \nTreatment charges and other\n1.04 \n0.88 \nUnit net cash costs\n15.60 \n18.59 \nDD&A\n2.80 \n2.39 \nNoncash and other costs, net\n0.68 \n0.80 \nTotal unit costs\n19.08 \n21.78 \nGross profit (loss) per pound\n$\n2.29 \n$\n(1.38)\nReconciliation to Amounts Reported\nProduction\nNine Months Ended September 30, 2025\nRevenues\nand Delivery\nDD&A\nTotals presented above\n$\n561 \n$\n382 \n$\n74 \nTreatment charges and other\n(27)\n— \n— \nNoncash and other costs, net\n— \n18 \n— \nMolybdenum mines\n534 \n400 \n74 \nOther mining\nb\n24,463 \n16,270 \n1,645 \nCorporate, other & eliminations\n(4,715)\n(4,427)\n40 \nAs reported in our consolidated financial statements\n$\n20,282 \n$\n12,243 \n$\n1,759 \nNine Months Ended September 30, 2024\nTotals presented above\n$\n434 \n$\n376 \n$\n51 \nTreatment charges and other\n(19)\n— \n— \nNoncash and other costs, net\n— \n17 \n— \nMolybdenum mines\n415 \n393 \n51 \nOther mining\nb\n23,779 \n15,583 \n1,606 \nCorporate, other & eliminations\n(4,459)\n(4,180)\n47 \nAs reported in our consolidated financial statements\n$\n19,735 \n$\n11,796 \n$\n1,704 \na.\nReflects sales of the Molybdenum mines’ production to our molybdenum sales company at market-based pricing. On a consolidated basis, realizations are based on the actual contract terms for sales to third parties; as a result, our consolidated average realized price per pound of molybdenum will differ from the amounts reported in this table.\nb.\nRepresents the combined total for our other mining operations as presented in Note 8. Also includes amounts associated with the molybdenum sales company, which includes sales of molybdenum produced by the Molybdenum mines and by certain of the U.S. copper mines and the Cerro Verde mine.\n65\nTable of Contents\n                  \nCAUTIONARY STATEMENT \nOur discussion and analysis contain forward-looking statements in which we discuss our potential future performance, operations and projects. Forward-looking statements are all statements other than statements of historical facts, such as plans, projections or expectations relating to business outlook, strategy, goals or targets; the underlying assumptions and estimated impacts on our business and stakeholders related to the mud rush incident at PTFI’s Grasberg Block Cave underground mine; global market conditions, including trade policies; ore grades and milling rates; production and sales volumes; higher variability between PTFI production and sales; unit net cash costs (credits) and operating costs; capital expenditures; operating plans, including mine sequencing; cash flows; liquidity; investigations, repair efforts, and phased restart and ramp-up of production and downstream processing following the mud rush incident at PTFI’s Grasberg Block Cave underground mine and the anticipated impact on future production, sales, results of operations and operating plans, and recoveries under insurance policies; potential extension of PTFI’s special mining business license (IUPK) beyond 2041; timing of shipments of inventoried production; our sustainability-related commitments and targets; our overarching commitment to deliver responsibly produced copper and molybdenum, including plans to implement, validate and maintain validation of our operating sites under specific frameworks; achievement of our 2030 climate targets and our 2050 net zero aspiration; improvements in operating procedures and technology innovations and applications; exploration efforts and results; development and production activities, rates and costs; future organic growth opportunities; tax rates; the impact of copper, gold and molybdenum price changes; the impact of deferred intercompany profits on earnings; mineral reserve and mineral resource estimates; final resolution of settlements associated with ongoing legal and environmental proceedings; debt repurchases; and the ongoing implementation of our financial policy and future returns to shareholders, including dividend payments (base or variable) and share repurchases. The words “anticipates,” “may,” “can,” “plans,” “believes,” “estimates,” “expects,” “projects,” “targets,” “intends,” “likely,” “will,” “should,” “could,” “to be,” “potential,” “assumptions,” “guidance,” “aspirations,” “future,” “commitments,” “pursues,” “initiatives,” “objectives,” “opportunities,” “strategy” and any similar expressions are intended to identify those assertions as forward-looking statements. The declaration and payment of dividends (base or variable), and timing and amount of any share repurchases are at the discretion of our Board and management, respectively, and are subject to a number of factors, including not exceeding our net debt target, capital availability, our financial results, cash requirements, global economic conditions, changes in laws, contractual restrictions and other factors deemed relevant by our Board or management, as applicable. Our share repurchase program may be modified, increased, suspended or terminated at any time at the Board’s discretion. \nWe caution readers that forward-looking statements are not guarantees of future performance and actual results may differ materially from those anticipated, expected, projected or assumed in the forward-looking statements. Important factors that can cause our actual results to differ materially from those anticipated in the forward-looking statements include, but are not limited to, supply of and demand for, and prices of the commodities we produce, primarily copper and gold; changes in export duties and tariff rates; production rates; timing of shipments and sales; price and availability of consumables and components we purchase as well as constraints on supply and logistics, and transportation services; changes in cash requirements, financial position, financing or investment plans; changes in general market, economic, geopolitical, regulatory or industry conditions, including market volatility regarding trade policies and tariff uncertainty; reductions in liquidity and access to capital; PTFI’s ability to repair mud rush incident-related damage, complete the investigation to the satisfaction of the Indonesian government authorities and implement any recommendations therefrom, safely restart, phase-in ramp-up and achieve full operating rates of production and downstream processing on the expected timeline and optimize production plans; recover amounts under insurance policies; resolve force majeure declarations and maintain relationships with commercial counterparties; changes in tax laws and regulations; political and social risks, including the potential effects of violence in Indonesia, civil unrest in Peru, and relations with local communities and Indigenous Peoples; operational risks inherent in mining, with higher inherent risks in underground mining; mine sequencing; changes in mine plans or operational modifications, delays, deferrals or cancellations, including the ability to smelt and refine or inventory; results of technical, economic or feasibility studies; potential inventory adjustments; potential impairment of long-lived mining assets; satisfaction of requirements in accordance with PTFI’s IUPK to extend mining rights from 2031 through 2041; process relating to the extension of PTFI’s IUPK beyond 2041; cybersecurity risks; any major public health crisis; labor relations, including labor-related work stoppages and increased costs; compliance with applicable environmental, health and safety laws and regulations; weather- and climate-related risks; environmental risks, including availability of secure water supplies; impacts, expenses or results from litigation or investigations; tailings management; our ability to comply with our responsible production commitments under specific frameworks and any changes to such frameworks and other factors described in more detail under the heading “Risk Factors” contained in Part I, Item 1A. of our 2024 Form 10-K.\n66\nTable of Contents\n                  \nInvestors are cautioned that many of the assumptions upon which our forward-looking statements are based are likely to change after the date the forward-looking statements are made, including for example commodity prices, which we cannot control, and production volumes and costs or technological solutions and innovations, some aspects of which we may not be able to control. Further, we may make changes to our business plans that could affect our results. We undertake no obligation to update any forward-looking statements, which are as of the date made, notwithstanding any changes in our assumptions, changes in business plans, actual experience or other changes.\nThis report on Form 10-Q also contains measures such as net debt and unit net cash costs (credits) per pound of copper and molybdenum, which are not recognized under U.S. GAAP. Refer to “Operations – Unit Net Cash Costs” and “Operations – Unit Net Cash (Credits) Costs” for further discussion of unit net cash costs (credits) associated with our operating divisions, and to “Product Revenues and Production Costs” for reconciliations of per pound costs (credits) by operating division to production and delivery costs applicable to sales reported in our consolidated financial statements. Refer to “Net Debt” for reconciliations of consolidated debt, and consolidated cash and cash equivalents to net debt. For forward-looking unit net cash costs (credits) per pound of copper and molybdenum measures, we are unable to provide a reconciliation to the most comparable U.S. GAAP measure without unreasonable effort because estimating such U.S. GAAP measures and providing a meaningful reconciliation is extremely difficult and requires a level of precision that is unavailable for these future periods, and the information needed to reconcile these measures is dependent upon future events, many of which are outside of our control as described above. Forward-looking non-U.S. GAAP measures are estimated consistent with the relevant definitions and assumptions."
}