{
  "source_file": "fds-20250831.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nCorporate History\nFactSet Research Systems Inc. and its wholly-owned subsidiaries (\"we,\" \"our,\" \"us,\" the \"Company\" or \"FactSet\") was founded in 1978 and has been publicly traded since June 1996. We are dual-listed on the New York Stock Exchange (\"NYSE\") and the NASDAQ Stock Market (\"NASDAQ\") under the symbol \"FDS\". FactSet has been a member of the S&P 500 since December 2021.\nBusiness Overview\nFactSet is a global financial digital platform and enterprise solutions provider with open and flexible technologies that deliver financial intelligence to investment professionals worldwide. \nOur platform delivers expansive data, sophisticated analytics, and flexible, artificial intelligence (\"AI\")-powered technologies used by global financial professionals to power their critical investment workflows. As of August 31, 2025, we had approximately 9,000 clients comprised of over 237,000 investment professionals, including institutional asset managers, bankers, wealth managers, asset owners, partners, hedge funds, corporate users, and private equity and venture capital professionals. Our revenues are primarily derived from subscriptions to our multi-asset class data and solutions powered by our connected data and technology platform. Our products and services include workstations, portfolio analytics and enterprise data solutions. We also offer managed services that operate as an extension of our clients' internal teams to support data, performance, risk and reporting workflows.\nWe drive our business based on a detailed understanding of our clients’ workflows, which helps us to solve their most complex challenges. We provide financial data and market intelligence on securities, companies, industries and people to enable our clients to research investment ideas and analyze, monitor and manage their portfolios. Our solutions span the investment lifecycle of investment research, portfolio construction and analysis, trade execution, performance measurement, risk management and reporting. We provide open and flexible technology offerings, including a configurable desktop and mobile platform, comprehensive data feeds, cloud-based digital solutions, and application programming interfaces (\"APIs\"). AI is embedded across these offerings to enhance data discovery, automate routine workflows and improve the speed and accuracy of client insights. The CUSIP Global Services (\"CGS\") business supports security master files relied on by the investment industry for critical front, middle and back-office functions. All of our platforms and solutions are supported by our dedicated client service team. \nWe operate our business through three reportable segments (\"segments\"): the Americas, EMEA and Asia Pacific. Within each segment, we offer data, products and analytical applications by firm type: Institutional Buyside, Dealmakers, Wealth, and Partnerships and CGS. \nSegments\nOur segment revenues are based on the geographic region where the sale originated: \n•\nAmericas: The Americas segment primarily sells to clients in North, Central and South America. In the Americas, we have offices in nine states in the United States (\"U.S.\"), including our corporate headquarters located in Norwalk, Connecticut. Additionally, we have data centers in two states in the U.S. and an office in each of Brazil and Canada. Revenues from the Americas represented 65% of total revenues during fiscal 2025.\n•\nEMEA: The EMEA segment primarily sells to clients in Europe, the Middle East and Africa via offices in Bulgaria, England, France, Germany, Italy, Latvia, Luxembourg, the Netherlands, Sweden and the United Arab Emirates. Revenues from EMEA represented 25% of total revenues during fiscal 2025.\n•\nAsia Pacific: The Asia Pacific segment primarily sells to clients in Asia and Australasia via office locations in Australia, China, Hong Kong Special Administrative Region (\"SAR\") of China, India, Japan, the Philippines and Singapore. Revenues from Asia Pacific represented 10% of total revenues during fiscal 2025.\nRefer to Part II, Item 8. Note 17, \nSegment Information, \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for more information on our segments.\n5\nTable of Contents\nFirm Types\nInstitutional Buyside\nInstitutional Buyside focuses on multi-asset class solutions, including AI-powered workflows and insights, for global asset managers, asset owners and hedge fund professionals across the investment portfolio lifecycle. This firm type includes workflows for research analysts, portfolio managers, and traders in the front office, as well as performance analysts, risk managers, and client service and marketing professionals in the middle office. Our front office on-platform solutions are designed for research management, order management, portfolio construction, and trade execution capabilities. Our middle office on-platform solutions are designed for performance measurement, attribution, reporting and risk management capabilities, and are complemented by our middle office managed services. In addition to our on-platform workstation offerings, we offer comprehensive off-platform data and technology solutions including data feeds, APIs, and programmatic access for clients to engage with us in the environment best suited to them.\nDealmakers\nDealmakers focuses on workflow solutions for investment bankers, sell-side research analysts, corporate users, investor relations officers, and private equity and venture capital professionals. We provide comprehensive solutions to our clients including workstations, mobile solutions, data feeds, APIs, proprietary and third-party data, and productivity tools for Microsoft® Office. We also deliver firm type tailored solutions for client relationship management (\"CRM\") and AI-powered solutions to bring automation to time-consuming and manual aspects of our clients’ daily workflows. Our tools are used to analyze companies and markets, perform fundamental research, generate ideas, build and distribute presentations and monitor investments. We offer global coverage of public and private markets, granular industry metrics, deep history, and transparency through proprietary and third-party sourced databases. \nWealth\nWealth focuses on comprehensive solutions to wealth management clients including our web-based workstation, book-of-business dashboards for advisors, data feeds, APIs, proprietary and third-party data, and productivity tools for Microsoft® Office. We also offer AI-powered prospecting, monitoring and proposal generation tools that enable financial advisors to grow and enhance existing client relationships. Our Wealth solution enables our clients to easily integrate our products into their CRM software and internally developed applications. Wealth clients use our advisory tools to provide support for their businesses, including home office, advisory, and client engagement work. We continue to focus on expanding our relevant data offerings and increasing workflow efficiency across the investment portfolio lifecycle for wealth management firms. \nPartnerships and CGS\nPartnerships delivers solutions such as data and technology solutions, workstations, and digital or analytics solutions to firms in the financial services ecosystem including data, analytics and technology platform providers. This includes curated datasets and turnkey APIs to enable technologists and developers to power new AI-based workflows with programmatic access to FactSet’s high-quality, connected content. CGS is the exclusive issuer of CUSIP and CINS identifiers globally. CGS also acts as the official numbering agency for International Securities Identification Number (\"ISIN\") identifiers in the U.S. and as a substitute ISIN agency for more than 30 other countries.\nBusiness Strategy\nWe strive to be a trusted enterprise partner and service provider to our clients across the financial services spectrum, delivering relevant intelligence, insights and execution solutions tailored to our clients’ business models. \nWe are focused on growing our global business through three strategically aligned geographic segments: the Americas, EMEA and Asia Pacific. This approach allows us to better manage resources, target solutions and interact with clients effectively.\n To execute our strategy, we are focused on three core pillars and primary areas of investment:\n•\nExpanding our data offerings and delivery capabilities: \nWe continue to scale up our data ecosystem to provide a comprehensive inventory of industry, proprietary and third-party data. This includes granular data for key industry verticals, real-time market data, fund data and sustainable finance. In addition to using our growing data catalog to drive our AI-powered workstation products, we aim to continue to expand our data delivery capabilities in the cloud and through other methods to advance our position as an enterprise data provider for our clients.\n6\nTable of Contents\n•\nEmbedding deeper in client workflows: \nThrough continued innovation, we aim to deepen our integration into our clients' workflows. We are focused on expanding further into the buy-side front office by leveraging our expertise in portfolio performance, analytics, and risk management. In addition, we are building on our strong presence on advisor desktops by expanding into prospecting and digital reporting workflows. We are also working to introduce next-generation automation in research, financial modeling, and pitch creation.\n•\nInnovating with AI:\n Our AI roadmap, driven by our FactSet AI Blueprint, is resonating with our clients, and FactSet's AI solutions are generating usage, demand and commercial transactions. We continue to advance a pragmatic, open, and flexible strategy for integrating AI and natural language processing into our clients’ workflows, aiming to boost productivity by surfacing actionable insights throughout the portfolio lifecycle and automating routine research and content processing tasks. FactSet is delivering AI embedded workflow solutions for various personas including research analysts, bankers, portfolio managers, wealth advisors and engineering teams across our clients. These outcomes accelerate decision making for our clients and will differentiate FactSet from our competitors and drive growth.\nExecutive Leadership Transition\nOn September 8, 2025, Sanoke Viswanathan assumed the role of Chief Executive Officer and joined FactSet’s Board of Directors. Mr. Viswanathan succeeds F. Philip Snow, who retired from these roles effective on Mr. Viswanathan's start date. To support a smooth leadership transition, Mr. Snow is continuing employment with FactSet in an advisory capacity until December 31, 2025.\nRevenues and Annual Subscription Value (\"ASV\")\nThe majority of our revenues are derived from client access to our multi-asset solutions powered by our platform of connected data and technology that is available over the contractual term. We offer expansive data, sophisticated analytics, and flexible technology through our platform. \nWe believe ASV reflects our ability to grow recurring revenues and generate positive cash flows, and thus serves as a key indicator of the successful execution of our business strategy. ASV at any point in time represents our forward-looking revenues for the next 12 months from all subscription services currently being supplied to clients. Organic ASV at any point in time represents ASV excluding ASV from acquisitions and dispositions completed within the last 12 months and the effects of foreign currency movements.\nFactSet Clients and Users\nWe had 8,996 clients and 237,324 professionals using FactSet as of August 31, 2025. Our client count includes clients with ASV of $10,000 and above and our user count does not reflect users associated with our fiscal 2025 acquisitions. For the year ended August 31, 2025, annual ASV retention was greater than 95% and, when expressed as a percentage of clients, annual retention was 91%.\nBuy-side\nBuy-side clients continue to shift toward multi-asset class investment strategies and investing in their front- and middle office solutions, where we are well-positioned to be a partner of choice. We are able to compete for greater market share given our ability to provide enterprise-wide solutions to our clients by leveraging their portfolio data for multiple asset classes. Buy-side clients primarily include institutional asset managers, wealth managers, asset owners, partners, hedge funds and corporate clients. These clients access our multi-asset class tools through our workstations, analytics and trading tools, proprietary and third-party content, data feeds, APIs and portfolio services. Buy-side clients accounted for approximately 82% of our Organic ASV as of August 31, 2025. \nSell-side\nWe deliver comprehensive solutions to sell-side clients including workstations, data feeds, web and mobile solutions, APIs, proprietary and third-party content, and productivity tools for Microsoft® Office. Our focus remains on expanding the depth of content offered and increasing workflow efficiency for sell-side firms. These firms primarily include broker-dealers, banking and advisory firms, and private equity and venture capital firms. Sell-side clients accounted for approximately 18% of our Organic ASV as of August 31, 2025.\n7\nTable of Contents\nThird-Party Content\nWe aggregate content from third-party data suppliers, news sources, exchanges, brokers and contributors into our dedicated managed databases, which our clients access through our flexible delivery platforms. We seek to maintain contractual relationships with a minimum of two content providers for each major type of financial data, though certain data sets on which we rely have a limited number of suppliers. We make every effort to assure that, where reasonable, alternative sources are available. We have entered into third-party content agreements of varying lengths, which in some cases can be terminated with one year’s notice, at predefined dates, and in other cases on shorter notice. We are not dependent on any one third-party data supplier to meet the needs of our clients, with two data suppliers each representing more than 10% of our total data costs during fiscal 2025. \nData Centers and Cloud Computing\nOur business is dependent on our ability to process substantial volumes of data and transactions rapidly and efficiently on our networks and systems. Our global technology infrastructure supports our operations and is designed to facilitate reliable and efficient processing and delivery of data and analytics to our clients. As part of our hybrid cloud strategy, we operate two fully redundant, physically separated data centers in the U.S. that provide client services, while also using market-leading cloud providers to run products and services to best benefit from the cloud's elasticity, resiliency, security, and regionalization. We currently use several cloud providers; however, one supplier provided the majority of our cloud computing support for fiscal 2025. Our physical data centers provide layers of redundancy to enhance system performance, including maintaining, processing and storing data at multiple locations. In the event of a single site failure or localized disaster, client workloads will automatically move to unaffected sites. We continue to focus on maintaining a global technological infrastructure that allows us to support our growing business.\nIntellectual Property\nWe have registered trademarks and copyrights for many of our products and services and will continue to evaluate the registration of additional trademarks and copyrights as appropriate. We enter into confidentiality agreements with our employees, clients, data suppliers and vendors. We strive to protect our workflow solutions, documentation and other written materials under trade secret, copyright and patent laws. While we do not believe we are dependent on any one of our intellectual property rights, we do rely on the combination of intellectual property rights and other measures to protect our proprietary rights. Despite these efforts, existing intellectual property laws may afford only limited protection.\nResearch and Product Development Costs\nA key aspect of our growth strategy is to offer new solutions and enhance our existing products by making them faster and more robust with deeper data and insights. We continue to invest in AI solutions that adapt as our clients’ workflows evolve, helping professionals leverage automation, generative intelligence, and dynamic analytics—rapidly embracing new technologies to improve discoverability and usability of our products and services. \nThe Competitive Landscape\nWe are a part of the financial information services industry focused on delivering expansive data, sophisticated analytics, and flexible technology through our open platform to the global investment community. We offer clients comprehensive solutions with a broad set of products delivered through a desktop or mobile user interface, cloud-based platforms, or through standardized or bespoke data feeds, as well as APIs. In addition, our applications, client support and service offerings are entrenched in the workflow of many financial professionals given the data management, portfolio analysis and screening capabilities offered. We are entrusted with significant amounts of our clients' own proprietary data, including portfolio holdings. As a result, we believe our products are central to our clients’ investment analysis, decision-making and operations. \nWe operate in a highly competitive environment. Our current competitive market is comprised of both large, well-capitalized companies and smaller, niche firms including market data suppliers, news and information providers, technology firms, and many third-party content providers that supply us with financial information included in our products. Our largest competitors are Bloomberg L.P., S&P's Market Intelligence division, and London Stock Exchange Group's (\"LSEG's\") Data & Analytics division (formerly known as Refinitiv). Other competitors and competitive products include online database suppliers and integrators and their applications, such as BlackRock Aladdin, MSCI Inc. and Morningstar Inc. Many of these firms provide products or services similar to our offerings. \n8\nTable of Contents\nHuman Capital Management\nAt FactSet, our people are central to delivering long-term value to our clients, stockholders, and communities. We view human capital as a strategic asset and prioritize the health, engagement, safety, and well-being of our workforce. FactSet’s human capital strategy is designed to align our workforce with our mission. Through strategic hiring, focused upskilling, and transparent career pathways, we position our people and teams to deliver on our business objectives and create sustainable growth. By emphasizing innovation, agility, recognition, and connectedness, we foster a culture where employees thrive while advancing outcomes for our clients, our communities, and our stockholders. Our human capital strategy focuses on attracting and retaining top talent, developing future-ready skills, fostering an inclusive and purpose-driven culture, and providing comprehensive wellbeing programs. We align our workforce initiatives with business priorities, so that employees are equipped, empowered, and motivated to contribute meaningfully to FactSet’s mission and long-term objectives. \nOur Employees\nAs of August 31, 2025, we had 35 offices in 19 countries with 12,800 employees, representing an increase of 3.2% compared with August 31, 2024. Of our total employees, 8,854 (69%) were located in Asia Pacific, 2,510 (20%) in the Americas and 1,436 (11%) in EMEA. To support sustainable growth, we continue to invest in our global centers of excellence (\"COEs\"), primarily located in India and the Philippines, which accounted for approximately 68% of our employees. \nFunctionally, as of August 31, 2025, 47% of our employees were in Content Operations, 28% were in Technology and Product Development, 21% were in Sales and Client Solutions and 4% were in Corporate Support. As of August 31, 2025, 434 of our employees were represented by mandatory works councils in our French and German locations and 25 of our employees were represented by collective bargaining agreements in the U.S. Our global workforce enables scale, operational efficiency, and delivery of specialized expertise across the enterprise.\nWorkforce Strategy and Talent Development \nFactSet invests strategically in attracting, developing, and retaining top talent to support growth and innovation. Key initiatives include: \n•\nStrategic Hiring: Recruitment in critical roles, including data solutions, AI, machine learning, product management, and client-facing positions.\n•\nFuture-Ready Skills: In fiscal 2025, 94% of employees participated in learning programs, completing 339,000 hours globally. Programs include mentorship, leadership development, department-specific training, and the EXCEL program. \n•\nAI Capabilities: A major focus in fiscal 2025 was enhancing our AI capabilities that were aligned with our innovation and AI monetization goals. Employees advanced skills in prompt engineering, coding, vector databases, and data querying, enabling teams to embed AI across product design, client solutions, and internal efficiency initiatives. \n•\nCareer Pathways: To encourage employees to apply their skills toward long-term careers at FactSet, we refreshed our job architecture, offering transparent career pathways and consistent role expectations across functions. \nEmployee Engagement and Culture\nFactSet fosters a culture where employees feel empowered, recognized, and connected to the Company’s mission. Key initiatives and outcomes include: \n•\nEngagement and Feedback: We conduct an annual confidential employee engagement survey to assess satisfaction, gather feedback, and identify opportunities for improvement. In fiscal 2025, our engagement survey achieved an 88% response rate, significantly outpacing typical third-party benchmark response rates, reflecting strong employee engagement in the process. The survey results indicated employees are closely aligned with the Company's purpose and confident that their work contributes meaningful value to the organization.\n•\nCorporate Responsibility and Purpose: We foster a culture of service that enriches our communities and enhances the employee experience. In fiscal 2025, FactSet employees contributed 17,200 volunteer hours across 391 events, with more than 85% of employees participating in philanthropic initiatives focused on education, hunger alleviation, environmental protection, and disaster response. \n9\nTable of Contents\n•\nFlagship Initiatives: Programs such as Hunger Awareness, one of FactSet’s largest annual initiatives, have resulted in over 9 million meals donated since 2019, reinforcing a culture of purpose while enhancing employee engagement and collective impact. \n•\nEmployee-Led Engagement Programs: FactSet supports a network of site-level culture committees, business resource groups open to all employees, and wellness champions, empowering employees to drive inclusion, well-being, and local engagement initiatives. \nWell-being and Benefits\nEmployee wellbeing is a central component of FactSet’s human capital strategy. Our programs are designed to support physical, mental, and financial health while fostering a safe, inclusive, and resilient workplace. Key initiatives include: \n•\nComprehensive Health and Wellness Programs: FactSet provides robust health benefits, as well as a range of wellness initiatives that support physical, emotional, social, and financial health. In fiscal 2025, we expanded mental health resources through Journey, a global platform providing access to on-demand clinical experts, confidential counseling, and personalized wellness content. \n•\nFlexible Work Arrangements: Policies and programs support work-life integration, including remote and hybrid work options, parental leave, and time-off programs tailored to employee needs. \nGovernment Regulation\nWe are subject to reporting requirements, disclosure obligations and other recordkeeping requirements of the Securities and Exchange Commission (\"SEC\") and the various local authorities that regulate each location in which we operate. Our P.A.N. Securities, LP subsidiary is a member of the Financial Industry Regulatory Authority, Inc. and is a registered broker-dealer under Section 15 of the Securities Exchange Act of 1934. P.A.N. Securities, LP, as a registered broker-dealer, is subject to Rule 15c3-1 under the Securities Exchange Act of 1934, which requires that we maintain minimum net capital requirements. We claim exemption under Rule 15c3-3(k)(2)(i). \nCorporate Contact Information\nFactSet was founded as a Delaware corporation in 1978, and our principal executive office is in \nNorwalk\n, \nConnecticut\n.\nMailing address of FactSet's headquarters: 45 Glover Avenue, Norwalk, CT 06850 \nTelephone number: +1 (203) 810-1000\nWebsite address: www.factset.com\nAvailable Information\nThrough the Investor Relations section of our website (https://investor.factset.com), we make available free of charge the following filings as soon as practicable after they are electronically filed with, or furnished to, the SEC: our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, Proxy Statements for the annual stockholder meetings, Reports on Forms 3, 4 and 5, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended. The SEC maintains a website that contains reports, proxy and information statements and other information that we file with the SEC at www.sec.gov.\nAdditionally, we broadcast our quarterly earnings calls live via the investor relations section of our website. We also provide notifications of news or announcements regarding our financial performance, including investor events and press and earnings releases on our investor relations website. The contents of this website section are not intended to be incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the SEC and any reference to this section of our website is intended to be inactive textual references only.\n10\nTable of Contents\nExecutive Officers of the Registrant\nThe following table shows our current executive officers:\nName of Officer\nAge\nOffice Held with FactSet \nOfficer Since\nSanoke Viswanathan\n50\nChief Executive Officer\n2025\nHelen L. Shan\n58\nExecutive Vice President, Chief Financial Officer\n2018\nRobert J. Robie\n46\nExecutive Vice President, Head of Institutional Buyside\n2018\nGoran Skoko\n64\nExecutive Vice President, Chief Revenue Officer, Managing Director EMEA and Asia Pacific\n2019\nKristina W. Karnovsky\n46\nExecutive Vice President, Head of Dealmakers and Wealth\n2021\nJohn Costigan\n56\nExecutive Vice President, Chief Data Officer\n2022\nKatherine M. Stepp\n40\nExecutive Vice President, Chief Technology Officer\n2022\nCatrina Harding\n52\nExecutive Vice President, Chief People Officer\n2023\nChristopher R. Ellis\n53\nExecutive Vice President, Head of Strategic Initiatives and Partnerships\n2023\nChristopher McLoughlin\n46\nExecutive Vice President, Chief Legal Officer and Corporate Secretary\n2024\nSanoke Viswanathan\n \n–\n \nChief Executive Officer\n.\n Mr. Viswanathan was appointed Chief Executive Officer effective September 8, 2025. Mr. Viswanathan has held a range of leadership roles, most recently served as the Chief Executive Officer of International Consumer and Wealth of JPMorgan and as a member of JPMorgan’s Operating Committee where he oversaw international consumer businesses as well as the International Private Bank and Workplace Solutions. Prior to that, Viswanathan served as JPMorgan’s Chief Strategy and Growth Officer from 2022 to 2024 and Chief Administrative Officer of the Corporate and Investment Bank. Earlier in his career, he was a Managing Director and Head of Corporate Strategy for JPMorgan and a Partner and Co-Head of Global Corporate and Investment Banking for McKinsey & Company. Mr. Viswanathan holds a post-graduate diploma in management from the Indian Institute of Management, Ahmedabad, and a bachelors in Mechanical Engineering from the Indian Institute of Technology, Chennai.\nHelen\n \nL.\n \nShan –\n \nExecutive Vice President, Chief Financial Officer.\n Ms. Shan was appointed Executive Vice President, Chief Financial Officer effective July 23, 2024. As the Chief Financial Officer, she is responsible for FactSet's global finance organization and oversees all financial functions, including accounting, corporate development, financial planning and analysis, investor relations, real estate, tax, and treasury. She also served in this role from September 2018 through October 2021. From May 2021 through August 2024, Ms. Shan served as Executive Vice President, Chief Revenue Officer. Previously, she was at Marsh McLennan Companies, where she served in a variety of roles, including as the company's Corporate Treasurer and as Chief Financial Officer for Mercer. Preceding that, Ms. Shan held executive positions at Pitney Bowes Inc. and J.P. Morgan. In September 2018, Ms. Shan joined the Board of Directors of EPAM Systems, Inc. and currently is the Chairperson of the Audit Committee and also serves on the Compensation Committee. Ms. Shan holds dual degrees with a Bachelor of Science and a Bachelor of Applied Science from the University of Pennsylvania’s Wharton School of Business and School of Applied Science and Engineering. Ms. Shan also has a Master of Business Administration from Cornell University’s SC Johnson College of Business.\nRobert\n \nJ.\n \nRobie – Executive Vice President, Head of Institutional Buyside.\n Mr. Robie was appointed Executive Vice President, Head of Institutional Buyside, effective September 1, 2023. In his current role, he oversees strategy, research, development and engineering for Institutional Buyside solutions. Prior to that, he served as Executive Vice President, Head of Analytics & Trading Solutions starting in September 2018. Mr. Robie joined FactSet in July 2000 as a Product Sales Specialist. During his tenure at FactSet, Mr. Robie has held several positions of increased responsibility, including Senior Director of Analytics and Director of Global Fixed Income. Although Mr. Robie joined FactSet in 2000, he did work at BTN Partners from 2004 through 2005 in their quantitative portfolio management and performance division, before returning to continue his career with FactSet. Mr. Robie holds a Bachelor of Arts in Economics and Fine Arts from Beloit College.\n11\nTable of Contents\nGoran Skoko – Executive Vice President, Chief Revenue Officer, Managing Director EMEA and Asia Pacific. \nMr. Skoko was appointed Executive Vice President, Chief Revenue Officer, Managing Director EMEA and Asia Pacific effective September 1, 2024. In this role, he is responsible for driving revenue growth by managing global sales, client solutions, marketing and media relations. Prior to this, Mr. Skoko served as Executive Vice President, Managing Director EMEA and Asia Pacific, Head of Dealmakers & Wealth, and was responsible for providing direction to address the product and content needs for EMEA and Asia Pacific clients while also focusing on increased deployment and building community within our Dealmakers & Wealth space. He also previously served as Executive Vice President, Managing Director EMEA and Asia Pacific and Head of Research & Advisory Solutions and Executive Vice President, Managing Director EMEA and Asia Pacific and Head of Wealth Solutions. He joined FactSet in 2004 as a Senior Product developer and has held a number of positions of increased responsibility. Prior to FactSet, he spent 16 years in various engineering and product management roles at Thomson Financial. Mr. Skoko earned his B.S. in Physics and Computer Science from Fordham University.\nKristina W. Karnovsky – Executive Vice President, Head of Dealmakers and Wealth. \nMs. Karnovsky was appointed Executive Vice President, Head of Dealmakers and Wealth effective September 1, 2024. Since joining FactSet in 2001, she has held leadership roles spanning sales, product and strategy, including roles as Global Head of Research Solutions (2017-2021), and Chief Product Officer (2021-2024). In her current position, she is responsible for setting strategy, and leading execution across product development and engineering for FactSet's solutions for wealth management, banking, and dealmaking clients worldwide. Over her tenure, she has played a key role in growing FactSet's sell-side business, advancing enterprise AI capabilities, and strengthening relationships with clients. Ms. Karnovsky holds a B.S. from the University of Scranton.\nJohn Costigan – Executive Vice President, Chief Data Officer. \nMr. Costigan was appointed Executive Vice President, Chief Data Officer of FactSet effective June 1, 2023. As Chief Data Officer, he is responsible for FactSet's enterprise-wide data strategy and leads data development from planning through production. This includes data digital transformation using modern techniques and technology to drive timeliness, accuracy, coverage, consistency and usability across all FactSet data assets. Prior to that, he served as Chief Content Officer of FactSet starting in April 2022. Mr. Costigan has been at FactSet since September 2007 in a variety of roles. Prior to joining FactSet, Mr. Costigan served as Vice President, Product Management at Thomson Financial, and spent 11 years in a variety of Product Management roles at First Call, Autex, ILX, and Tradeweb. Mr. Costigan earned a Bachelor's degree in Economics from St. Michael's College.\nKatherine M. Stepp – Executive Vice President, Chief Technology Officer. \nMs. Stepp was appointed Executive Vice President, Chief Technology Officer, effective September 1, 2022. As Chief Technology Officer, she is responsible for leading FactSet's technology organization and overseeing its digital transformation strategy. Ms. Stepp joined FactSet in 2008 and previously served as Senior Director of Product Management within FactSet's Research and Advisory workflow solutions. Prior to that role, she was Senior Director of Engineering within FactSet's Research workflow solutions. Ms. Stepp holds a B.S. in Computer Science from Carnegie Mellon University.\nCatrina Harding - Executive Vice President, Chief People Officer.\n Ms. Harding was appointed Executive Vice President, Chief People Officer in July 2023. Prior to that, Ms. Harding served as Chief Human Resources Officer at Gerson Lehrman Group, a financial and global information services company, and Senior Vice President of Human Resources at Synchrony Financial, a consumer financial services company and former division of GE Capital. She has more than 20 years of experience in senior human resources roles at major companies, including U.S. Steel Corporation, General Electric Company, and Ford Motor Company. Ms. Harding holds a Bachelor of Science from Western Michigan University and a Masters in Industrial and Organizational Psychology from the University of Detroit Mercy.\nChristopher R. Ellis - Executive Vice President, Head of Strategic Initiatives and Partnerships.\n Mr. Ellis was appointed Executive Vice President, Head of Strategic Initiatives and Partnerships effective November 1, 2023. In this role, he collaborates on a range of initiatives to help FactSet better address the needs of our clients, most specifically asset managers and asset owners. Mr. Ellis joined FactSet in 1994 in Client Solutions. His career path since then has included successfully defining and expanding the Portfolio Manager Workstation Sales solutions, ultimately becoming its Vice President before assuming the position of Director of Portfolio Analytics. He subsequently led the development team for FactSet's core workstation. Prior to his current role, he led the business development function at FactSet through a series of successful acquisitions and strategic partnerships. Mr. Ellis is a graduate of Stanford University and a CFA charterholder.\nChristopher McLoughlin - Executive Vice President, Chief Legal Officer and Corporate Secretary.\n \nMr. McLoughlin was appointed Executive Vice President, Chief Legal Officer effective December 2, 2024. In this role, he oversees the global legal, compliance, and risk functions for the Company, together with government and regulatory affairs. Previously, Mr. McLoughlin served as the General Counsel of S&P Global Market Intelligence, where he led a global team providing legal and compliance support to the entire division and served as a member of the S&P Global Market Intelligence Operating Committee. Prior, he was Deputy General Counsel and Company Secretary of IHS Markit Ltd. He has also worked at various international law firms \n12\nTable of Contents\non a range of corporate, transactional, and advisory matters. Mr. McLoughlin has earned a legal degree LLB (Hons), from the University of Manchester and attended Nottingham Law School.\nAdditional Information\nAdditional information with respect to our business is included in the following pages and is incorporated herein by reference:\nPage(s)\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n29\nQuantitative and Qualitative Disclosures about Market Risk\n47\nNotes to the Consolidated Financial Statements\n62\n13\nTable of Contents",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\") should be read in conjunction with the Consolidated Financial Statements and related Notes included in Part II, Item 8. \nFinancial Statements and Supplementary Data\n, of this Annual Report on Form 10-K, our Current Reports on Form 8-K and our other filings with the Securities and Exchange Commission. For a similar detailed discussion comparing fiscal 2024 and 2023, refer to Part II, Item 7. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n within our Annual Report on Form 10-K for the fiscal year ended August 31, 2024. This discussion contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those discussed below. Factors that could cause such differences include, but are not limited to, those identified below and those discussed in Part I, Item 1A. \nRisk Factors \nof this Annual Report on Form 10-K. \nOur MD&A is designed to provide a reader of our financial statements with a narrative from the perspective of our management on our financial condition, results of operations, liquidity and certain other factors that may affect our future results. Our MD&A is presented in the following sections:\n•\nExecutive Overview\n•\nAnnual Subscription Value (\"ASV\")\n•\nClient and User Additions\n•\nEmployee Headcount\n•\nResults of Operations\n•\nNon-GAAP Financial Measures\n•\nLiquidity and Capital Resources\n•\nOff-Balance Sheet Arrangements\n•\nForeign Currency Exposure\n•\nCritical Accounting Estimates\n•\nNew Accounting Pronouncements\nExecutive Overview\nFactSet is a global financial digital platform and enterprise solutions provider with open and flexible technologies that deliver financial intelligence to investment professionals worldwide. \nOur platform delivers expansive data, sophisticated analytics, and flexible, AI-powered technologies used by global financial professionals to power their critical investment workflows. As of August 31, 2025, we had approximately 9,000 clients comprised of over 237,000 investment professionals, including institutional asset managers, bankers, wealth managers, asset owners, partners, hedge funds, corporate users, and private equity and venture capital professionals. Our revenues are primarily derived from subscriptions to our multi-asset class data and solutions powered by our connected data and technology platform. Our products and services include workstations, portfolio analytics and enterprise data solutions. We also offer managed services that operate as an extension of our clients' internal teams to support data, performance, risk and reporting workflows.\nWe drive our business based on a detailed understanding of our clients’ workflows, which helps us to solve their most complex challenges. We provide financial data and market intelligence on securities, companies, industries and people to enable our clients to research investment ideas and analyze, monitor and manage their portfolios. Our solutions span the investment lifecycle of investment research, portfolio construction and analysis, trade execution, performance measurement, risk management and reporting. We provide open and flexible technology offerings, including a configurable desktop and mobile platform, comprehensive data feeds, cloud-based digital solutions, and APIs. AI is embedded across these offerings to enhance data discovery, automate routine workflows and improve the speed and accuracy of client insights. The CGS business supports security master files relied on by the investment industry for critical front, middle and back-office functions. All of our platforms and solutions are supported by our dedicated client service team. \nWe operate our business through three segments: the Americas, EMEA and Asia Pacific. Within each segment, we offer data, products and analytical applications by firm type: Institutional Buyside, Dealmakers, Wealth, and Partnerships and CGS. \nRefer to Part I, Item 1. \nBusiness - Business Overview \nand\n Business Strategy\n and Part II, Item 8. Note 17, \nSegment Information\n, in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for more information. \n29\nTable of Contents\nFiscal 2025 in Review\nRevenues for fiscal 2025 were $2,321.7 million, an increase of 5.4% from the comparable prior year. The growth in revenues was driven by a 4.4% increase in organic revenues, a 0.9% increase from acquisition-related revenues and a net increase of 0.1% from foreign currency exchange rate fluctuations. Revenues increased in all our segments, primarily in the Americas. Revenues increased primarily from workstations and to a lesser extent, CGS and front office solutions. Refer to Part II, Item 7. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations, Non-GAAP Financial Measures, \nof this Annual Report on Form 10-K for a definition of organic revenues and a reconciliation between revenues and organic revenues.\nAs of August 31, 2025, organic annual subscription value (\"Organic ASV\") totaled $2,370.9 million, an increase of 5.7% over the prior year. Organic ASV increased in all our segments, with the majority of the increase in the Americas. Organic ASV growth was mainly driven by workstations, data solutions and, to a lesser extent, CGS. Refer to Part II, Item 7. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations, Annual Subscription Value, \nof this Annual Report on Form 10-K for the definition of Organic ASV.\nOperating margin was 32.2% for fiscal 2025, compared with 31.8% for fiscal 2024. This increase in operating margin was mainly due to growth in revenues and, when expressed as a percentage of revenues, charges related to the Sales Tax Dispute that were recorded in the prior year, partially offset by higher amortization of intangible assets in the current year. Refer to Part II, Item 8. Note 12, \nCommitments and Contingencies \nin the Notes to the Consolidated Financial Statements of this Annual Report on Form 10-K for more information on the Sales Tax Dispute.\nNet income for fiscal 2025 was $597.0 million, an increase of 11.2% from the prior year. Diluted earnings per common share (\"Diluted EPS\") for fiscal 2025 was $15.55, an increase of 11.8% compared with the prior year. The increase in Net income and Diluted EPS was primarily driven by higher operating income and a gain from the divestiture of a business.\nWe returned $460.4 million to our stockholders in the form of share repurchases and dividends during fiscal 2025.\nAs of August 31, 2025, our client and user counts were 8,996 and 237,324, respectively. Our employee headcount was 12,800 as of August 31, 2025, up 3.2% compared to the prior year. This increase was driven by net headcount growth of 6.0% in the Americas and 2.6% in each of EMEA and Asia Pacific. \nAnnual Subscription Value (\"ASV\")\nWe believe ASV reflects our ability to grow recurring revenues and generate positive cash flows, and thus serves as a key indicator of the successful execution of our business strategy. \n–\nASV at any point in time represents our forward-looking revenues for the next 12 months from all subscription services currently being supplied to clients.\n–\nOrganic ASV at any point in time equals our ASV excluding ASV from acquisitions and dispositions completed within the last 12 months and the effects of foreign currency movements.\nBeginning in fiscal 2025, we are reporting Organic ASV, rather than Organic ASV plus professional services, to focus on the recurring nature of our revenues. This underscores the shift of our offerings toward providing more managed services and less project-based services. \n30\nTable of Contents\nOrganic ASV\nThe following table presents the calculation of Organic ASV as of August 31, 2025. With proper notice provided as contractually required, our clients can add to, delete portions of, or terminate service, subject to certain limitations. \n(dollar amounts in millions)\nAs of August 31, 2025\nASV\n$\n2,405.6 \nImpact from foreign currency movements\n(0.6)\nAcquisition ASV\n(1\n)\n(34.1)\nOrganic ASV\n$\n2,370.9 \nOrganic ASV annual growth rate\n(2)\n5.7 \n%\n(1)  ASV from acquisitions completed within the last 12 months.\n(2) For comparability purposes, in calculating the organic ASV annual growth rate, the prior year excludes ASV from dispositions completed in the last 12 months.\nAs of August 31, 2025, Organic ASV was $2,370.9 million, an increase of 5.7% compared with August 31, 2024. Organic ASV increased in all our segments, with the majority of the increase in the Americas. The increase in Organic ASV was primarily due to higher sales to existing clients and, to a lesser extent, sales to new clients and price increases to existing clients, all primarily attributable to workstations, data solutions and, to a lesser extent, CGS. This increase was partially offset by existing client cancellations. \nSegment ASV\nAs of August 31, 2025, ASV from the Americas represented 65% of total ASV and was $1,570.1 million, an increase from $1,455.4 million as of August 31, 2024. Americas Organic ASV was $1,541.9 million as of August 31, 2025, a 6.0% increase from the prior year. The Organic ASV increase in the Americas was primarily driven by workstations and, to a lesser extent, data solutions. \nAs of August 31, 2025, ASV from EMEA represented 25% of total ASV and was $591.6 million, an increase from $569.7 million as of August 31, 2024. EMEA Organic ASV was $586.3 million as of August 31, 2025, a 4.2% increase from the prior year. The EMEA Organic ASV increase was mainly from data solutions.\nAs of August 31, 2025, ASV from Asia Pacific represented 10% of total ASV and was $243.9 million, an increase from $230.3 million as of August 31, 2024. Asia Pacific Organic ASV was $242.7 million as of August 31, 2025, a 7.2% increase from the prior year. The Asia Pacific Organic ASV increase was primarily driven by data solutions and workstations. \nBuy-side and Sell-side Organic ASV Growth\nThe buy-side and sell-side Organic ASV annual growth rates as of August 31, 2025 were 5.5% and 4.3%, respectively. Buy-side clients account for approximately 82% of our Organic ASV, consistent with the prior year, and primarily include institutional asset managers, wealth managers, asset owners, partners, hedge funds and corporate clients. The remaining Organic ASV is derived from sell-side firms and primarily include broker-dealers, banking and advisory firms, and private equity and venture capital firms. \nClient and User Additions\nThe table below presents our total clients and users:\nAs of August 31,\n2025\n2024\n% Change\nClients\n(1)\n8,996 \n8,217 \n9.5 \n%\nUsers\n(2)\n237,324 \n216,381 \n9.7 \n%\n(1)\nThe client count includes clients with ASV of $10,000 and above.\n(2)\nThe user count does not reflect users associated with our fiscal 2025 acquisitions. \n31\nTable of Contents\nOur total client count was 8,996 as of August 31, 2025, a net increase of 9.5% or 779 clients in the last 12 months, mainly due to an increase in corporate clients, primarily driven by clients from the Platform Group Limited (\"Irwin\") acquisition. \nAs of August 31, 2025, there were 237,324 professionals using FactSet, representing a net increase of 9.7% or 20,943 users in the last twelve months, primarily driven by an increase in wealth management users. The user count does not reflect our fiscal 2025 acquisitions.\nAnnual ASV retention was greater than 95% of ASV as of August 31, 2025 and August 31, 2024. When expressed as a percentage of clients, annual retention was 91% as of August 31, 2025, compared with 90% as of August 31, 2024.\nEmployee Headcount\nAs of August 31, 2025, our net employee headcount increased by 3.2% to 12,800, compared with 12,398 employees as of August 31, 2024. This net headcount increase was primarily in the technology and sales groups mainly driven by continued investment in our COEs, through an increase in employees based in the Philippines and India, and our Irwin and Liquid Holdings, LLC (\"LiquidityBook\") acquisitions. \nAs of August 31, 2025, compared to August 31, 2024, our net headcount growth was 6.0% in the Americas and 2.6% in each of EMEA  and Asia Pacific. As of August 31, 2025, we had 8,854 employees located in Asia Pacific, 2,510 in the Americas and 1,436 in EMEA. Approximately 68% of our employees are located in our COEs. \nResults of Operations\nFor an understanding of the significant factors that influenced our performance during fiscal 2025 and 2024, the following discussion should be read in conjunction with the Consolidated Financial Statements and related Notes presented in Part II, Item 8. in this Annual Report on Form 10-K.\nThe following table summarizes the results of operations for the years presented:\n \nYears ended August 31,\n(in thousands, except per share data)\n2025\n2024\n% Change\nRevenues\n$\n2,321,748 \n$\n2,203,056 \n5.4 \n%\nCost of services\n1,097,782 \n1,011,945 \n8.5 \n%\nSelling, general and administrative\n475,663 \n489,812 \n(2.9)\n%\nOperating income\n$\n748,303 \n$\n701,299 \n6.7 \n%\nNet income\n$\n597,040 \n$\n537,126 \n11.2 \n%\nDiluted weighted average common shares\n38,385 \n38,618 \nDiluted EPS\n$\n15.55\n$\n13.91\n11.8 \n%\nRevenues\nRevenues in fiscal 2025 were $2,321.7 million, an increase of 5.4%. This 5.4% growth in revenues was driven by a 4.4% increase in organic revenues which totaled $2,300.2 million for fiscal 2025, a 0.9% increase from acquisition-related revenues and a net increase of 0.1% from foreign currency exchange rate fluctuations. Revenues increased in all our geographic segments, primarily in the Americas. The increase in revenues was mainly from workstations and, to a lesser extent, CGS and front office solutions.\n32\nTable of Contents\nRevenues by Segment\nThe following table summarizes our revenues by segment:\nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n% Change\nAmericas\n$\n1,506,108\n$\n1,419,901\n6.1 \n%\n% of revenues\n64.9 \n%\n64.4 \n%\nEMEA\n$\n580,284\n$\n563,128\n3.0 \n%\n% of revenues\n25.0 \n%\n25.6 \n%\nAsia Pacific\n$\n235,356\n$\n220,027\n7.0 \n%\n% of revenues\n10.1 \n%\n10.0 \n%\nConsolidated\n$\n2,321,748\n$\n2,203,056\n5.4 \n%\nAmericas\nRevenues from the Americas increased 6.1% to $1,506.1 million in fiscal 2025, compared with $1,419.9 million in fiscal 2024. This 6.1% growth in revenues was driven by a 4.9% increase in organic revenues and a 1.2% increase from acquisition-related revenues. The increase in revenues was mainly driven by workstations and, to a lesser extent, front office solutions.\nEMEA\nRevenues from EMEA increased 3.0% to $580.3 million in fiscal 2025, compared with $563.2 million in fiscal 2024. This  3.0% growth in revenues was driven by a 2.5% increase in organic revenues, a 0.4% increase from acquisition-related revenues and a 0.1% net increase from foreign currency exchange rate fluctuations. The increase in revenues was primarily from data solutions and middle office solutions. \nAsia Pacific\nRevenues from Asia Pacific increased 7.0% to $235.3 million in fiscal 2025, compared with $220.0 million in fiscal 2024. This 7.0% was driven by a 6.3% increase in organic revenues, a 0.5% increase from acquisition-related revenues and a 0.2% net increase from foreign currency exchange rate fluctuations. The increase in revenues was mainly driven by data solutions, workstations and, to a lesser extent, front office solutions.\nOperating Expenses\nPrincipal Operating Expenses\nCost of services\n is mainly comprised of employee compensation costs and also includes expenses related to data costs, computer-related expenses, amortization of intangible assets, royalty fees, telecommunication costs and computer depreciation.\nSelling, general and administrative \n(\"\nSG&A\")\n consists primarily of employee compensation costs and also includes expenses related to occupancy costs, professional fees, depreciation of furniture and fixtures, amortization of leasehold improvements, travel and entertainment expenses, marketing costs, other employee-related expenses, internal communication costs, bad debt expense, the impact from our foreign currency forward contracts and asset impairments.\nEmployee compensation costs are a major component of both our Cost of services and SG&A. These expenses primarily include costs related to salaries, incentive compensation and sales commissions, stock-based compensation, benefits, employment taxes and restructuring costs.\nWe assign employee compensation costs between Cost of services and SG&A based on the roles and activities associated with each employee. We categorize employees within the content collection, consulting, product development, software and systems engineering groups as Cost of services personnel. Employees included in our sales department and those that serve in various other support departments, including marketing, finance, legal, human resources and administrative services, are classified as SG&A.\n33\nTable of Contents\nThe following table summarizes the components of our total operating expenses and operating margin:\n(dollar amounts in thousands)\nYears ended August 31,\n2025\n2024\n% Change\nCost of services\n$\n1,097,782\n$\n1,011,945\n8.5 \n%\nSG&A\n475,663\n489,812\n(2.9)\n%\nTotal operating expenses\n$\n1,573,445\n$\n1,501,757\n4.8 \n%\nOperating income\n$\n748,303\n$\n701,299\n6.7 \n%\nOperating margin\n32.2 \n%\n31.8 \n%\n1.2 \n%\nCost of Services\nCost of services increased 8.5% to $1,097.8 million in fiscal 2025, compared with $1,011.9 million in fiscal 2024, primarily due to an increase in amortization of intangible assets, employee compensation costs and computer-related expenses.\nCost of services, when expressed as a percentage of revenues, was 47.3% for fiscal 2025, an increase of 130 basis points compared with fiscal 2024. This increase was primarily from higher amortization of intangible assets, mainly driven by a 100 basis point increase in amortization from our capitalized internal-use software development costs.\nSelling, General and Administrative\n \nSG&A expenses decreased 2.9% to $475.7 million during fiscal 2025, compared with $489.8 million in fiscal 2024. The decrease was primarily attributable to charges related to the Sales Tax Dispute recorded in the prior year, partially offset by higher employee compensation costs and professional fees in the current year.\nSG&A expenses, when expressed as a percentage of revenues, were 20.5% for fiscal 2025, a decrease of 170 basis points compared with fiscal 2024. This decrease was primarily due to charges associated with the Sales Tax Dispute recorded in the prior year, partially offset by higher employee compensation costs and professional fees in the current year.\nWhen expressed as a percentage of revenues:\n•\nThe charges related to the Sales Tax Dispute recorded in the prior year decreased SG&A by 240 basis points. Refer to Part II, Item 8. Note 12, \nCommitments and Contingencies \nin the Notes to the Consolidated Financial Statements of this Annual Report on Form 10-K for more information on the Sales Tax Dispute.\n•\nEmployee compensation costs increased by 80 basis points, mainly due to higher variable compensation costs driven by a lower bonus accrual during fiscal 2024.\n•\nProfessional fees increased by 60 basis points, mainly due to acquisition-related costs.\nOperating Income and Operating Margin\nOperating income increased 6.7% to $748.3 million in fiscal 2025, compared with $701.3 million in fiscal 2024. This increase was primarily driven by  growth in revenues and charges associated with the Sales Tax Dispute recorded in the prior year, partially offset by higher employee compensation costs and amortization of intangible assets in the current year.\nOperating margin increased to 32.2% in fiscal 2025, compared with 31.8% in the prior year. This increase was primarily driven by growth in revenues and, when expressed as a percentage of revenues, charges associated with the Sales Tax Dispute recorded in the prior year, partially offset by higher amortization of intangible assets in the current year.\n34\nTable of Contents\nOperating Income by Segment\nWe operate our business through three segments: the Americas; EMEA; and Asia Pacific. Refer to Part II, Item 8. Note 17, \nSegment Information \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further discussion regarding our segments. The following table summarizes our operating income by segment:\n \nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n% Change\nAmericas\n$\n305,963 \n$\n261,790 \n16.9 \n%\nEMEA\n274,002 \n282,963 \n(3.2)\n%\nAsia Pacific\n168,338 \n156,546 \n7.5 \n%\nTotal Operating Income\n$\n748,303 \n$\n701,299 \n6.7 \n%\nAmericas\nAmericas operating income increased 16.9% to $306.0 million during fiscal 2025, compared with $261.8 million from the prior year. This increase was primarily due to growth in revenues of 6.1% and charges associated with the Sales Tax Dispute recorded in the prior year, partially offset by higher amortization of intangible assets and employee compensation costs in the current year.\n•\nThe charge related to the Sales Tax Dispute in the prior year is discussed in Part II, Item 8. Note 12, \nCommitments and Contingencies\n in the Notes to the Consolidated Financial Statements of this Annual Report on Form 10-K.\n•\nAmortization of intangible assets increased mainly due to higher amortization from our capitalized internal-use software development costs.\n•\nEmployee compensation costs increased primarily due to higher variable compensation costs driven by a lower bonus accrual during fiscal 2024. \nEMEA\nEMEA operating income decreased 3.2% to $274.0 million during fiscal 2025, compared with $283.0 million from the prior year. This decrease was primarily due to higher employee compensation costs, partially offset by growth in revenues of 3.0%. Employee compensation costs increased primarily due to higher annual base salaries, driven by an increase in annual merit and net headcount growth of 37 employees, and, to a lesser extent, variable compensation costs mainly due to a lower bonus accrual during fiscal 2024.\nAsia Pacific\nAsia Pacific operating income increased 7.5% to $168.3 million during fiscal 2025, compared with $156.5 million from the prior year. This increase was mainly due to growth in revenues of 7.0%, partially offset by higher employee compensation costs. Employee compensation costs increased primarily due to higher annual base salaries, driven by annual merit increases and a net headcount increase of 222 employees, and higher variable compensation costs mainly due to a lower bonus accrual during fiscal 2024. \nIncome Taxes\nThe provision for income taxes and the effective tax rate are as follows:\n \nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n% Change\nIncome before income taxes\n$\n720,958 \n$\n651,503 \n10.7 \n%\nProvision for income taxes\n$\n123,918 \n$\n114,377 \n8.3 \n%\nEffective tax rate\n17.2 \n%\n17.6 \n%\n(2.1)\n%\nWe are subject to taxation in the U.S. and various state, local and foreign jurisdictions in which we conduct our business. Our effective tax rate will vary based on, among other factors, changes in levels of foreign income, as well as other non-recurring events.\n35\nTable of Contents\nOur effective tax rate for fiscal 2025 was 17.2% compared with 17.6% for fiscal 2024. This decrease was primarily due to a lower U.S. tax impact of foreign earnings. All local, federal and foreign taxes payable were paid in a timely manner, subject to normal audits of open years.\nFor the periods presented, our effective tax rates were lower than the applicable U.S. corporate income tax rate. This was primarily attributable to excess tax benefits from stock-based compensation, a lower U.S. tax impact of foreign earnings, research and development (\"R&D\") tax credits and a foreign derived intangible income (\"FDII\") tax deduction, partially offset by our state income taxes.\nNet Income and Diluted EPS\n \nYears ended August 31,\n(in thousands, except per share data)\n2025\n2024\n% Change\nNet income\n$\n597,040 \n$\n537,126 \n11.2 \n%\nDiluted weighted average common shares\n38,385 \n38,618 \n(0.6)\n%\nDiluted EPS\n$\n15.55 \n$\n13.91 \n11.8 \n%\nThe increase in Net income and Diluted EPS for fiscal 2025, compared with fiscal 2024, was primarily driven by higher operating income and a gain from the divestiture of a business. \nNon-GAAP Financial Measures\nTo supplement the financial measures prepared in accordance with generally accepted accounting principles in the United States (\"GAAP\"), we use non-GAAP financial measures including organic revenues, adjusted operating income, adjusted operating margin, adjusted net income, EBITDA, adjusted EBITDA, adjusted Diluted EPS and free cash flow. Reconciliations from our financial measures calculated and presented in accordance with GAAP to these non-GAAP financial measures are shown in the tables below, and the reconciliation of free cash flow is included in the \nLiquidity and Capital Resources \nsection. These non-GAAP financial measures should not be considered in isolation from, as a substitute for, or superior to, financial measures reported in accordance with GAAP. Moreover, these non-GAAP financial measures have limitations in that they do not reflect all the items associated with the operations of our business as determined in accordance with GAAP. Other companies may calculate similarly titled non-GAAP financial measures differently than we do, limiting the usefulness of those measures for comparative purposes.\nDespite the limitations of these non-GAAP financial measures, we believe these adjusted financial measures and the information they provide are useful in viewing our performance using the same tools that management uses to gauge progress in achieving our goals. Adjusted measures may also facilitate comparisons to our historical performance.\nOrganic revenues excludes the current year impact of revenues from acquisitions and dispositions completed within the past 12 months (\"Acquisition revenues\" and \"Disposition revenues\", respectively) and the current year impact from changes in foreign currency. In addition, for our year to date comparisons, organic revenues also excludes current year revenues that were incurred prior to the first anniversary date of an acquisition. The table below provides an unaudited reconciliation of revenues to organic revenues:\n \nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n% Change\nRevenues\n$\n2,321,748 \n$\n2,203,056 \n5.4 \n%\nAcquisition revenues\n(20,663)\n— \nCurrency impact\n(901)\n— \nOrganic revenues\n$\n2,300,184 \n$\n2,203,056 \n4.4 \n%\nThe table below provides an unaudited reconciliation of Operating income, operating margin, Net income and Diluted EPS to adjusted operating income, adjusted operating margin, adjusted net income, EBITDA, adjusted EBITDA and adjusted Diluted EPS. Adjusted operating income and margin, adjusted net income, and adjusted Diluted EPS exclude the impact of acquisition-related intangible asset amortization and non-recurring items. EBITDA represents earnings before interest expense, provision for income taxes and depreciation and amortization, while adjusted EBITDA further excludes non-recurring non-cash expenses.\n36\nTable of Contents\nYears ended August 31, \n(in thousands, except per share data)\n2025\n2024\n% Change\nOperating income\n$\n748,303 \n$\n701,299 \n6.7 \n%\nIntangible asset amortization\n73,036 \n67,383 \nBusiness divestiture, acquisitions and related costs\n17,761 \n884 \nSales Tax Dispute\n(1)\n2,398 \n54,048 \n \nExecutive search costs\n1,675 \n— \nRestructuring/severance\n259 \n5,596 \nAsset impairment\n— \n3,443 \nAdjusted operating income\n$\n843,432 \n$\n832,653 \n1.3 \n%\nOperating margin\n32.2 \n%\n31.8 \n%\nAdjusted operating margin\n(2)\n36.3 \n%\n37.8 \n%\nNet income\n$\n597,040 \n$\n537,126 \n11.2 \n%\nIntangible asset amortization\n54,074 \n49,529 \nGain on business divestiture\n(17,205)\n— \nBusiness divestiture, acquisitions and related costs\n13,150 \n650 \nSales Tax Dispute\n(1)\n1,775 \n39,727 \n \nExecutive search costs\n1,240 \n— \nRestructuring/severance\n192 \n4,113 \nAsset impairment\n— \n2,531 \nIncome tax items\n1,351 \n1,397 \n \nAdjusted net income\n(3)\n$\n651,617 \n$\n635,073 \n2.6 \n%\nNet income\n$\n597,040 \n$\n537,126 \n11.2 \n%\nInterest expense\n56,324 \n65,778 \nIncome taxes\n123,918 \n114,377 \nDepreciation and amortization expense\n157,691 \n125,187 \nEBITDA\n$\n934,973 \n$\n842,468 \n11.0 \n%\nNon-recurring non-cash expenses\n— \n5,070 \nAdjusted EBITDA\n$\n934,973 \n$\n847,538 \n10.3 \n%\nDiluted EPS\n$\n15.55 \n$\n13.91 \n11.8 \n%\nIntangible asset amortization\n1.41 \n1.27 \nGain on business divestiture\n(0.45)\n— \nBusiness divestiture, acquisitions and related costs\n0.34 \n0.02 \nSales Tax Dispute\n(1)\n0.05 \n1.03 \n \nExecutive search costs\n0.03 \n— \nRestructuring/severance\n0.01 \n0.11 \nAsset impairment\n— \n0.07 \nIncome tax items\n0.04 \n0.04 \n \nAdjusted Diluted EPS\n(3)\n$\n16.98 \n$\n16.45 \n3.2 \n%\nWeighted average common shares (diluted)\n38,385 \n38,618 \n \n(1)\nRelated to a resolved matter with the Massachusetts Department of Revenue. Refer to Note 12, \nCommitments and Contingencies\n in the Notes to the Consolidated Financial Statements included in Part II, Item 8. of this Annual Report on Form 10-K, for further discussion on this matter.\n(2)\nAdjusted operating margin is calculated as Adjusted operating income divided by Revenues.\n(3)\nFor purposes of calculating Adjusted net income and Adjusted Diluted EPS, all adjustments were taxed at an adjusted tax rate of 26.0% and 26.5% for fiscal 2025 and fiscal 2024, respectively.\n37\nTable of Contents\nLiquidity and Capital Resources\nAs of August 31, 2025, Cash and cash equivalents were $337.7 million and restricted cash was $14.0 million, compared with Cash and cash equivalents of $423.0 million as of August 31, 2024. Refer to \nSummary of Cash Flows\n within this section below, for more information on cash flows during fiscal 2025 and 2024. Our Cash and cash equivalents as of August 31, 2025 are held in numerous locations throughout the world, with $169.8 million in EMEA (with the largest balance held in the UK), $106.1 million in the Americas and the remaining $61.8 million in Asia Pacific (with the largest balance held in the Philippines). \nAs of \nAugust 31, 2025\n, we had $486.9 million of undistributed foreign earnings of which $69.1 million are permanently reinvested. It is our intent to permanently reinvest all foreign undistributed earnings, except in jurisdictions where earnings can be repatriated substantially free of tax. It is not practicable to determine the deferred tax liability that would be payable if these earnings were repatriated to the U.S. \nOur cash flows provided by operating activities, existing cash and cash equivalents, supplemented with our debt borrowings, have been sufficient to fund our operations while allowing us to invest in activities that support the long-term growth of our operations. Generally, some or all of our remaining available cash flows have been used to, among other things, service our existing and future debt obligations, satisfy our working capital requirements and fund various activities, including our capital expenditures, acquisitions, investments, dividend payments and repurchases of our common stock. Based on past performance and current expectations, we believe our sources of liquidity, including the available capacity under our existing revolving credit facility and other financing alternatives, will provide us the necessary capital to fund these transactions and achieve our planned growth for the next 12 months and the foreseeable future. We are exposed to credit risk for our cash, cash equivalents and restricted cash held in financial institutions in the event of a default, to the extent that such amounts are in excess of applicable insurance limits; however, we do not believe our concentration of cash, cash equivalents and restricted cash presents a significant credit risk as the counterparties to the instruments consist of multiple high-quality, credit-worthy financial institutions.\nSources of Liquidity\nDebt and Swap Agreements\n2025 Credit Agreement\nOn April 8, 2025, we entered into a credit agreement (the \"2025 Credit Agreement\") and borrowed $500.0 million under a senior unsecured term loan credit facility (the \"2025 Term Facility\"). We used the proceeds from the 2025 Term Facility borrowing to repay the outstanding balance under the 2022 Revolving Facility (as defined below). The 2025 Credit Agreement also provides for a $1.0 billion senior unsecured revolving credit facility (the \"2025 Revolving Facility\"). The 2025 Revolving Facility, together with the 2025 Term Facility, are referred to as the \"2025 Credit Facilities\".\nThe 2025 Term Facility matures on April 8, 2028, and the 2025 Revolving Facility matures on April 8, 2030. The 2025 Revolving Facility provides for up to $100.0 million in the form of letters of credit and up to $100.0 million in the form of swingline loans. We may seek additional commitments of up to $1.0 billion under the 2025 Revolving Facility from lenders or other financial institutions.\nThe 2025 Term Facility is subject to scheduled quarterly principal payments, commencing on August 31, 2025, with each quarterly principal payment equal to 1.25% of the original principal amount of the 2025 Term Facility. The 2025 Credit Facilities are not otherwise subject to any other mandatory repayments. We may voluntarily prepay loans under the 2025 Credit Facilities at any time without premium or penalty. Prepayments of the 2025 Term Facility shall be applied to reduce the subsequent scheduled quarterly principal payments in direct order of maturity. \nDuring fiscal 2025, we repaid $125.0 million under the 2025 Term Facility. This included $68.8 million to satisfy all scheduled quarterly principal payments from loan inception through maturity, eliminating any future mandatory quarterly principal payment requirements. The remaining $56.2 million was made as a voluntary prepayment. From the effective date of the 2025 Revolving Facility through August 31, 2025, we have had no borrowings under the 2025 Revolving Facility.\nFrom the borrowing date through August 31, 2025, the outstanding borrowings under the 2025 Credit Facilities bore interest at a rate equal to the applicable one-month Term Secured Overnight Financing Rate (\"SOFR\") plus a 0.975% spread (comprised of a 0.875% interest rate margin, based on a pricing grid determined by reference to our senior unsecured non-credit enhanced long-term debt rating and our total leverage ratio, plus a 0.1% credit spread adjustment). \n38\nTable of Contents\nWe pay a commitment fee on the daily unused amount of the 2025 Revolving Facility using a pricing grid based on our senior unsecured non-credit enhanced long-term debt rating and our total leverage ratio. The commitment fee remained consistent at 0.1% through August 31, 2025.\nDebt issuance costs related to the 2025 Credit Facilities were $3.4 million. These debt issuance costs are presented in the Consolidated Balance Sheets as a direct deduction from the carrying amount of the debt liability for the 2025 Term Facility and within Other assets for the 2025 Revolving Facility. Debt issuance costs are amortized to Interest expense in the Consolidated Statements of Income on a straight-line basis over the contractual term of the debt (which approximates the effective interest method for the 2025 Term Facility).\nThe 2025 Credit Agreement contains usual and customary event of default provisions for facilities of this type, which are subject to usual and customary grace periods and materiality thresholds. If an event of default occurs under the 2025 Credit Agreement, the lenders may, among other things, terminate their commitments and declare all outstanding borrowings immediately due and payable. \nThe 2025 Credit Agreement contains usual and customary affirmative and negative covenants for facilities of this type, including a financial covenant requiring maintenance of a total leverage ratio of no greater than 3.75 to 1.00 as of the last day of each fiscal quarter (subject to an increase to 4.25 to 1.00 for five consecutive fiscal quarters in connection with certain material acquisitions). We were in compliance with all covenants and requirements of the 2025 Credit Agreement as of August 31, 2025.\n2022 Credit Agreement\nOn March 1, 2022, we entered into a credit agreement (the \"2022 Credit Agreement\") and borrowed $1.0 billion under a senior unsecured term loan credit facility (the \"2022 Term Facility\") and $250.0 million of the available $500.0 million under a senior unsecured revolving credit facility (the \"2022 Revolving Facility\"). The 2022 Revolving Facility, together with the 2022 Term Facility, are referred to as the \"2022 Credit Facilities\". On January 31, 2025, we entered into a joinder agreement to our 2022 Credit Agreement pursuant to which commitments under the 2022 Revolving Facility were increased by $100.0 million, to a total of $600.0 million. All other terms of the 2022 Credit Agreement remained unchanged. \nThe 2022 Term Facility, originally due to mature on March 1, 2025, was repaid in full following $125.0 million of repayments made during the six months ended February 28, 2025. During fiscal 2025, we borrowed $305.0 million and repaid $555.0 million under the 2022 Revolving Facility. The 2022 Credit Agreement was terminated on April 8, 2025, concurrent with entering into the 2025 Credit Agreement.\nBorrowings previously outstanding under the 2022 Credit Facilities bore interest at a rate equal to the applicable one-month Term SOFR plus a spread, using a debt leverage pricing grid and a credit spread adjustment (with total spread ranging from 0.975% to 1.1% over the term of the debt). \nInterest Rate Swap Agreements\nWe leverage interest rate swap agreements to manage our floating interest rate exposure with a fixed interest rate. Our interest rate swap agreements are designated as cash flow hedges at inception.\n2025 Swap Agreement\nOn April 24, 2025, we entered into an interest rate swap agreement (\"2025 Swap Agreement\") with a notional amount of $200.0 million to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of 4.086%. The notional amount of the 2025 Swap Agreement declines by $50.0 million on a quarterly basis beginning May 31, 2025 and matures on February 28, 2026. As of August 31, 2025, the notional amount of the 2025 Swap Agreement was $100.0 million.\n2024 Swap Agreement\nOn March 1, 2024, we entered into an interest rate swap agreement (\"2024 Swap Agreement\") with a notional amount of $200.0 million to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of 5.145%. The notional amount of the 2024 Swap Agreement declined by $50.0 million on a quarterly basis beginning May 31, 2024. The 2024 Swap Agreement matured on February 28, 2025.\n39\nTable of Contents\n2022 Swap Agreement\nOn March 1, 2022, we entered into an interest rate swap agreement (\"2022 Swap Agreement\") with a notional amount of $800.0 million to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of 1.162%. The notional amount of the 2022 Swap Agreement declined by $100.0 million on a quarterly basis beginning May 31, 2022. The 2022 Swap Agreement matured on February 28, 2024. \nRefer to Part II, Item 7A. \nQuantitative and Qualitative Disclosures About Market Risk\n, in this Annual Report on Form 10-K, for further discussion of our exposure to interest rate risk on our outstanding floating rate debt.\nSenior Notes\nOn March 1, 2022, we completed a public offering issuing $500.0 million of 2.900% Senior Notes due March 1, 2027 (the \"2027 Notes\") and $500.0 million of 3.450% Senior Notes due March 1, 2032 (the \"2032 Notes\" and, together with the 2027 Notes, the \"Senior Notes\"). The Senior Notes were issued pursuant to an indenture, dated as of March 1, 2022, by and between us and U.S. Bank Trust Company, National Association, as trustee (the \"Trustee\"), as supplemented by the supplemental indenture, dated as of March 1, 2022, between us and the Trustee (the \"Supplemental Indenture\").\nThe Senior Notes were issued at an aggregate discount of $2.8 million and we incurred approximately $9.1 million in debt issuance costs during fiscal 2022. Debt discounts and debt issuance costs are presented in the Consolidated Balance Sheets as a net direct deduction from the carrying amount of the debt liability. The debt discounts and debt issuance costs are amortized to Interest expense in the Consolidated Statements of Income over the contractual term of the debt, leveraging the effective interest method.\nInterest on the Senior Notes is payable semiannually in arrears on March 1 and September 1 of each year. \nWe may redeem the Senior Notes, in whole or in part, at any time at specified redemption prices, plus any accrued and unpaid interest. Upon the occurrence of a change of control triggering event (as defined in the Supplemental Indenture), we must offer to repurchase the Senior Notes at 101% of their principal amount, plus any accrued and unpaid interest. \nUses of Liquidity\nReturning Value to Stockholders\nWe returned $460.4 million and $385.9 million to our stockholders in the form of share repurchases and dividends during fiscal 2025 and 2024, respectively. \nShare Repurchase Program\nWe may repurchase shares of our common stock under our share repurchase program from time-to-time in the open market or via privately negotiated transactions, subject to market conditions. During fiscal 2025 and 2024, we repurchased 684,960 shares for $300.5 million and 537,800 shares for $235.2 million, respectively.\nThere is no defined number of shares to be repurchased over a specified timeframe through the life of our share repurchase program. On September 17, 2024, our Board of Directors approved a new share repurchase authorization of up to $300 million in aggregate, which was available during fiscal 2025. This authorization expired upon the conclusion of fiscal 2025 and was not available for share repurchases after that date.\nOn June 17, 2025, our Board of Directors authorized up to $400 million for share repurchases on or after September 1, 2025 through September 30, 2026. \nRefer to Part III, Item 12, \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\n, of this Annual Report on Form 10-K for further discussion on our share repurchase program. \nDividends\nDuring fiscal 2025 and 2024, we paid dividends of $160.0 million and $150.7 million, respectively. In the third quarter of fiscal 2025, our Board of Directors approved a 6% increase in the regular quarterly dividend from $1.04 to $1.10 per share. Fiscal 2025 marked the 26th consecutive fiscal year we have increased dividends on a stock split-adjusted basis, highlighting our continued commitment to returning value to our stockholders. Future cash dividend payments are subject to final determination by our Board of Directors and will depend on our earnings, capital requirements, financial condition and other relevant factors.\n40\nTable of Contents\nCapital Expenditures\nFor the year ended August 31, 2025, capital expenditures increased by 27.0% to $108.8 million, compared with $85.7 million in fiscal 2024. This increase was primarily due to higher capitalized costs related to the development of our internal-use software.\nAcquisitions\nOur acquisitions with the most significant cash flows from fiscal 2023 through fiscal 2025 included Liquid Holdings, LLC (\"LiquidityBook\") and Platform Group Limited (\"Irwin\"). Refer to Part II, Item 8. Note 5, \nAcquisitions \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further discussion of these acquisitions.\nLiquidityBook\nOn February 7, 2025 we completed the acquisition of LiquidityBook for a purchase price of $243.2 million, net of cash acquired, and inclusive of preliminary working capital adjustments. The purchase price includes contingent consideration of $11.9 million, which reflects the acquisition date fair value of potential future payments that are contingent upon the achievement of certain specified milestones. \nLiquidityBook provides cloud-native trading solutions to hedge fund, asset and wealth management, outsourced trading, and sell-side middle office clients. LiquidityBook operates a proprietary FIX network that enables streamlined connectivity to over 200 brokers and order routing to more than 1,600 destinations across 80 markets globally. This acquisition adds technology-forward order management and investment book of record capabilities and enhances FactSet’s ability to serve the integrated workflow needs of clients across the portfolio life cycle.\nIrwin\nOn November 5, 2024, we completed the acquisition of Irwin for a purchase price of $120.2 million, net of cash acquired, and inclusive of working capital adjustments. The purchase price includes contingent consideration of $9.6 million, which reflects the acquisition date fair value of potential future payments that are contingent upon the achievement of certain specified milestones. We finalized the purchase accounting for the Irwin acquisition during the third quarter of fiscal 2025. \nIrwin is a leading investor relations and capital markets platform for public companies and their advisors. This acquisition builds on a recent successful partnership between FactSet and Irwin, and expands our ability to address the holistic workflow needs of investor relations professionals with an integrated, modern solution.\nContractual Obligations\nPurchase obligations represent our legally-binding agreements to purchase fixed or minimum quantities at determinable prices. As of August 31, 2025 and 2024, we had total purchase obligations with suppliers and vendors of approximately $352 million and $383 million, respectively. Our total purchase obligations as of August 31, 2025 and 2024 primarily related to hosting services, acquisition of data and, to a lesser extent, third-party software providers.\nWe also have contractual obligations related to our lease liabilities and outstanding debt. Refer to Part II, Item 8. Note 10, \nLeases\n and Note 11, \nDebt\n in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for information regarding our lease commitments and outstanding debt obligations, respectively.\nSummary of Cash Flows\nThe following table provides a summary of our net cash flow activity for the fiscal years presented:\nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n $ Change\nNet cash provided by operating activities\n$\n726,260 \n$\n700,338 \n$\n25,922 \nNet cash provided by (used in) investing activities\n(392,773)\n(144,317)\n(248,456)\nNet cash provided by (used in) financing activities\n(407,821)\n(560,850)\n153,029 \nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n3,050 \n2,364 \n686 \nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n(71,284)\n$\n(2,465)\n$\n(68,819)\n41\nTable of Contents\nOperating\nFor fiscal 2025, net cash provided by operating activities was $726.3 million, which included net income of $597.0 million, non-cash charges of $235.0 million and a net cash outflow of $105.7 million to support our working capital requirements. The non-cash charges were primarily driven by depreciation and amortization. The change in our working capital was primarily driven by cash outflows related to payments to resolve the Sales Tax Dispute, timing of vendor payments and client collections, as well as lease payments.\nFor fiscal 2024, net cash provided by operating activities was $700.3 million, which included net income of $537.1 million, non-cash charges of $201.6 million and a net cash outflow of $38.4 million to support our working capital requirements. The non-cash charges were primarily driven by depreciation and amortization and, to a lesser extent, stock-based compensation expense. The change in our working capital was primarily driven by cash outflows related to lease payments and prepaid expenses, partially offset by the timing of payments to vendors.\nInvesting\nFor fiscal 2025, net cash used in investing activities was $392.8 million. The cash used in investing activities primarily consisted of $348.3 million of acquisition-related consideration related mainly to the Irwin and LiquidityBook transactions, $108.8 million of\n \ncapital expenditures mainly driven by the capitalization of internal-use software development costs, partially offset by $58.2 million in proceeds from our investments in mutual funds.\nFor fiscal 2024, net cash used in investing activities was $144.3 million. The cash used in investing activities was primarily related to capital expenditures of $85.7 million, mainly driven by the capitalization of internal-use software development costs and $58.6 million in investments, primarily related to the purchase of mutual funds.\nFinancing\nFor fiscal 2025, net cash used in financing activities was $407.8 million, consisting mainly of $805.0 million related primarily to the repayment of the 2022 Credit Facilities, $300.5 million of share repurchases and $160.0 million of dividend payments, partially offset by $803.4 million of proceeds from borrowings under the 2025 Term Facility and the 2022 Revolving Facility, in periods prior to its termination, and $81.7 million of proceeds from employee stock plans. \nFor fiscal 2024, net cash used in financing activities was $560.9 million, consisting mainly of $250.0 million related to the partial repayment of the 2022 Term Facility, $235.2 million of share repurchases and $150.7 million of dividend payments, partially offset by $91.7 million of proceeds from employee stock plans.\nFree Cash Flow\nWe define free cash flow, a non-GAAP financial measure, as cash provided by operating activities, less purchases of property, equipment and leasehold improvements (\"PPE\") and capitalized internal-use software. We believe free cash flow is a liquidity measure that provides useful information to management and investors about the amount of cash generated by the business that, after capital expenditures, can be used for strategic opportunities, including returning value to stockholders, investing in our business, making strategic acquisitions, and strengthening the balance sheet. Free cash flow should be considered in addition to consolidated net income and net cash provided by operating activities, but should not be used as a substitute for these key measures of our performance and liquidity.\nThe following table reconciles our net cash provided by operating activities to free cash flow:\nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n$ Change\nNet cash provided by operating activities\n$\n726,260 \n$\n700,338 \n$\n25,922 \nLess: purchases of property, equipment, leasehold improvements and capitalized internal-use software\n(108,806)\n(85,681)\n(23,125)\nFree cash flow\n$\n617,454 \n$\n614,657 \n$\n2,797 \nWe generated free cash flow of $617.5 million during fiscal 2025, an increase of $2.8 million compared with fiscal 2024. This increase was driven by $25.9 million in cash provided by operating activities, partially offset by higher PPE mainly from capitalized costs related to the development of our internal-use software.\n42\nTable of Contents\nOff-Balance Sheet Arrangements\nAs of August 31, 2025 and August 31, 2024, we had no off-balance sheet financing other than letters of credit incurred in the ordinary course of business. Refer to Part II, Item 8. Note 11, \nDebt \nand\n \nNote 12, \nCommitments and Contingencies \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for more information on our letters of credit. \nAs of August 31, 2025 and August 31, 2024, we also had no other arrangements with unconsolidated entities or financial partnerships (such as entities often referred to as structured finance or special purpose entities) established for purposes of facilitating off-balance sheet financing, other debt arrangements, or other contractually limited purposes.\nForeign Currency Exposure\nAs we operate globally, we are exposed to the risk that our financial condition, results of operations and cash flows could be impacted by changes in foreign currency exchange rates. During fiscal 2025 and 2024, we maintained a series of foreign currency forward contracts to hedge a portion of our projected operating expenses in our primary currency exposures, namely the British Pound Sterling, Euro, Indian Rupee, and Philippine Peso. As of August 31, 2025, the hedge maturity periods of our outstanding foreign currency forward contracts range from the first quarter of fiscal 2026 through the fourth quarter of fiscal 2026. \nRefer to Part II, Item 7A. \nQuantitative and Qualitative Disclosures About Market Risk\n in this Annual Report on Form 10-K for more information on our foreign currency exposures.\nCritical Accounting Estimates\nWe prepare the Consolidated Financial Statements in conformity with GAAP, which requires us to make certain estimates and apply judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosures. We base our estimates on historical experience and other assumptions that we believe to be reasonable at the time the Consolidated Financial Statements are prepared and, as such, they may ultimately differ materially from actual results.\nWe describe our significant accounting policies in Part II, Item 8. Note 2, \nSummary of Significant Accounting Policies\n in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K. \nThe Audit Committee of our Board of Directors reviews the development and selection of our critical accounting estimates. The critical accounting estimates and judgments that we believe to have the most significant impacts to our Consolidated Financial Statements are described below.\nIncome Taxes\nWe are subject to taxation in the U.S. and various state, local and foreign jurisdictions in which we conduct our business. Our provision for income taxes is an estimate based on our understanding of laws in these federal, state, local and foreign tax jurisdictions. These laws can be complicated and are difficult to apply to any business. The tax laws also require us to allocate our taxable income to many jurisdictions based on subjective allocation methodologies and information collection processes.\nOur provision for income taxes is subject to volatility and could be adversely impacted by numerous factors such as changes in earnings or tax laws, regulations, or accounting principles, including accounting for uncertain tax positions or interpretations of them. Significant judgment is required in determining our provision for income taxes, deferred tax assets and liabilities and unrecognized tax benefits. \nFurther, as a result of certain ongoing employment and capital investment actions and commitments, our income in certain countries is subject to reduced tax rates. Our failure to meet these employment and capital investment actions and commitments could adversely affect our provision for income taxes. In addition, we are subject to the continuous examination of our income tax returns by the Internal Revenue Service and other tax authorities. We regularly assess the likelihood of adverse outcomes resulting from these examinations to determine the adequacy of our provision for income taxes. There can be no assurance that the outcomes from these continuous examinations will not adversely impact our operating results and financial condition. \nSignificant judgment is required in determining our uncertain tax positions. We follow a two-step approach in recognizing and measuring uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not (defined as a likelihood of more than 50%) that a tax position will be sustained based on its technical merits as of the reporting date. The second step, for those positions that meet the recognition \n43\nTable of Contents\ncriteria, is to measure and recognize the largest amount of benefit that is greater than 50% likely of being realized upon effective settlement with a taxing authority. As the determination of liabilities related to uncertain tax positions and associated interest and penalties requires significant estimates and assumptions, there can be no assurance that we will accurately predict the outcomes of these audits. For this reason and due to ongoing audits by multiple tax authorities, we regularly engage in discussions and negotiations with tax authorities regarding tax matters in various jurisdictions. We adjust these reserves in light of changing facts and circumstances, such as the closing of a tax audit or the refinement of an estimate. To the extent that the final outcome of these matters is different than the amounts recorded, such differences will affect the provision for income taxes in the period in which such determination is made. \nWe accrue interest on all tax exposures for which reserves have been established consistent with jurisdictional tax laws. \nThe Provision for income taxes on our Consolidated Statements of Income includes the impact of changes to reserves and any related interest. We have no reason to believe that such audits will result in the payment of additional taxes and/or penalties that would have a material adverse effect on our results of operations or financial position, beyond current estimates. \nRefer to Part II, Item 8. Note 9, \nIncome Taxes\n in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information.\nStock-based Compensation\nWe measure and recognize stock-based compensation expense for all stock-based awards and purchases of common stock under the employee stock purchase plan (\"ESPP\") based on their estimated grant date fair value.\nWe utilize a lattice-binomial option-pricing model (\"binomial model\") to estimate the grant date fair value for our employee stock options and the Black-Scholes model to estimate the grant date fair value for stock options granted to the members of the Board of Directors (\"non-employee directors\") and common stock purchased by eligible employees under our ESPP.\nBoth the binomial model and Black-Scholes model involve certain estimates and assumptions such as:\n•\nRisk-free interest rate\n \n-\n based on the U.S. Treasury yield curve in effect at the time of grant with maturities equal to the expected terms of the stock-based awards granted. \n•\nExpected life\n -\n \nthe weighted average period the stock-based awards are expected to remain outstanding.\n•\nExpected volatility\n \n- based on a blend of historical volatility of the stock-based award's useful life and the weighted average implied volatility for call option contracts traded in the 90 days preceding the stock-based award's valuation date. \n•\nDividend yield\n -\n \nthe expectation of dividend payouts based on our history. \nThe binomial model also incorporates market conditions, vesting restrictions and exercise patterns.\nFor our performance share units (\"PSUs\"), management makes quarterly assessments of the probability of achieving specified performance criteria established at the time of grant. The ultimate number of common shares that may be earned from a PSU is determined pursuant to a payout range based on the achievement of specified performance levels.\nWe estimate expected forfeitures of equity awards at the date of grant and recognize compensation expense only for those awards expected to vest. The forfeiture assumption is revised if actual forfeitures differ from those estimates.\nThe assumptions we use to calculate and account for stock-based compensation awards represent management's best estimates, which involve inherent uncertainties. As a result, if we revise our assumptions and estimates, our stock-based compensation expense could differ from amounts recorded. \nRefer to Part II, Item 8. Note 15, \nStock-Based Compensation\n in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information.\nGoodwill \nGoodwill represents the excess of the purchase price over the fair value of identifiable net assets acquired at the acquisition date. Goodwill is not amortized as it is estimated to have an indefinite life. We test goodwill annually for impairment during the fourth quarter of each fiscal year or more frequently if events and circumstances occur indicating that it is more likely than not that the fair value of any one of our reporting units is less than its respective carrying value. Impairment is tested at the reporting unit level and if the carrying value of the reporting unit exceeds the fair value, then the goodwill is considered impaired and written down to the reporting unit’s fair value. The impairment loss for the reporting unit cannot exceed the carrying value of the goodwill allocated to that reporting unit.\n44\nTable of Contents\nWe may elect to perform a qualitative analysis for the reporting units to determine whether it is more likely than not (a likelihood of more than 50%) that the fair value of the reporting unit is less than its carrying value. In performing a qualitative assessment, we consider such factors as macro-economic conditions, industry and market conditions in which we operate, including the competitive environment and significant changes in demand for our products or services. We also consider the share price both in absolute terms and in relation to peer companies. If the qualitative analysis indicates that it is more likely than not the fair value of a reporting unit is less than its carrying value or if we elect not to perform a qualitative analysis, a quantitative analysis is performed to determine whether a goodwill impairment exists.\nThe quantitative goodwill impairment analysis is used to identify potential impairment by comparing the carrying value of a reporting unit with its fair value. To perform this analysis, we apply the income approach which utilizes discounted cash flows and other relevant market information. Significant judgment is involved in determining the assumptions used in estimating future cash flows, such as: expected sales, working capital needs to support each reporting unit, capital expenditures and related depreciation and amortization, operating expenses, expected tax rates and the weighted average cost of capital for each reporting unit. Our cost of capital is based on assumptions about interest rates, as well as a risk-adjusted rate of return required by our equity investors. These estimates and judgments are critical, as they directly influence the calculated fair value of our reporting units and, consequently, the results of our goodwill impairment assessment. \nRefer to Part II, Item 8. Note 7, \nGoodwill \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further details.\nBusiness Combinations\nWe account for business combinations using the purchase method of accounting. Under this method, the acquisition purchase price is allocated to the underlying identified tangible and intangible assets acquired, and liabilities assumed, based on their respective estimated fair values on the acquisition date. The excess of the purchase consideration over the fair value of the identified assets and liabilities is recorded as goodwill and assigned to one or more reporting units. The value and useful life assigned to acquisition-related tangible and intangible assets impact the amount and timing of future amortization expense. Determining the fair value of assets acquired and liabilities assumed and the expected useful life requires management’s judgment and often involves the use of significant estimates and assumptions, including assumptions with respect to future cash inflows and outflows, discount rates, asset lives and market multiples, among other items. Acquisition-related expenses and restructuring costs, if any, are recognized separately from the business combination and are expensed as incurred.\nRefer to Part II, Item 8. Note 5, \nAcquisitions \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information.\nPPE and Intangible Assets \nWe amortize our PPE and identifiable intangible assets over their estimated useful lives. Determining the useful life requires judgment and an understanding of our planned use of the asset, among other factors. If different useful lives had been used, the resulting amortization or depreciation expense recognized may be materially different. If the estimate of the remaining useful life is changed, the remaining carrying amount of the PPE and intangible asset is, respectively, amortized or depreciated, prospectively over that revised remaining useful life. \nWe review our PPE and intangible assets to determine if any indicators of impairment are present on a quarterly basis or whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. If indicators of impairment are present, the asset group is tested for impairment by comparing the carrying value to undiscounted cash flows and, if impaired, written down to fair value based on discounted cash flows. In performing this assessment, significant judgment is involved in determining the assumptions used in estimating future cash flows and the discount rate. \nRefer to Part II, Item 8. Note 6, \nProperty, Equipment and Leasehold Improvements \nand\n \nNote 8, \nIntangible Assets \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information.\nContingencies\nWe are subject to various legal proceedings, claims and litigation that have arisen in the ordinary course of business, which involve inherent uncertainties. We accrue for contingencies when we believe that a loss is probable and the amount can be reasonably estimated. Judgment is required to determine both the probability and the estimated amount of loss. If the reasonable estimate of a probable loss is a range, we record an accrual for the most probable estimate of the loss or the minimum amount when no amount within the range is a better estimate than any other amount. We review these accruals on a quarterly basis and adjust, as necessary, to reflect the impact of negotiations, settlements, rulings, advice of legal counsel and other current information. If actual results differ from our assessments, our financial position, results of operations, or cash flows would be \n45\nTable of Contents\naffected. Refer to Part II, Item 8. Note 12, \nCommitments and Contingencies \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for more information on our contingent matters.\nFor more information on the accounting of our income tax contingencies, refer to Part II, Item 8. Note 9, \nIncome Taxes\n in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K.\nNew Accounting Pronouncements\nFor a discussion of accounting pronouncements recently adopted and those issued but not yet adopted, refer to Part II, Item 8. Note 2, Summary of Significant Accounting Policies in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K. \n46\nTable of Contents",
  "item2": null
}