{
  "source_file": "fds-20250531.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\") should be read in conjunction with the Consolidated Financial Statements and related Notes included in this Quarterly Report on Form 10-Q, our Annual Report on Form 10-K for the fiscal year ended August 31, 2024, our Current Reports on Form 8-K and our other filings with the Securities and Exchange Commission. This discussion contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those discussed below. Factors that could cause such differences include, but are not limited to, those identified below and those discussed in Part I, Item 1A. \nRisk Factors \nin our Annual Report on Form 10-K for the fiscal year ended August 31, 2024 and those discussed in Part II, Item 1A. \nRisk Factors\n in this Quarterly Report on Form 10-Q. \nOur MD&A is designed to provide a reader of our financial statements with a narrative from the perspective of our management on our financial condition, results of operations, liquidity and certain other factors that may affect our future results. Our MD&A is presented in the following sections:\n•\nExecutive Overview\n•\nAnnual Subscription Value (\"ASV\")\n•\nClient and User Additions\n•\nEmployee Headcount\n•\nResults of Operations\n•\nNon-GAAP Financial Measures\n•\nLiquidity and Capital Resources\n•\nOff-Balance Sheet Arrangements\n•\nForeign Currency Exposure\n•\nCritical Accounting Estimates\n•\nNew Accounting Pronouncements\nExecutive Overview\nFactSet Research Systems Inc. and its wholly-owned subsidiaries (\"we,\" \"our,\" \"us,\" or \"FactSet\") is a global financial digital platform and enterprise solutions provider with open and flexible technologies that deliver financial intelligence to investment professionals worldwide. \nOur platform delivers expansive data, sophisticated analytics, and flexible technology used by global financial professionals to power their critical investment workflows. As of May 31, 2025, we had more than 8,800 clients comprised of over 220,000 investment professionals, including institutional asset managers, bankers, wealth managers, asset owners, partners, hedge funds, corporate users, and private equity and venture capital professionals. Our revenues are primarily derived from subscriptions to our multi-asset class data and solutions powered by our connected data and technology platform. Our products and services include workstations, portfolio analytics and enterprise data solutions. We also offer managed services that operate as an extension of our clients' internal teams to support data, performance, risk and reporting workflows.\nWe drive our business based on our detailed understanding of our clients' workflows, which helps us to solve their most complex challenges. We provide financial data and market intelligence on securities, companies, industries and people to enable our clients to research investment ideas and analyze, monitor and manage their portfolios. Our solutions span the investment lifecycle of investment research, portfolio construction and analysis, trade execution, performance measurement, risk management and reporting. We provide open and flexible technology offerings, including a configurable desktop and mobile platform, comprehensive data feeds, cloud-based digital solutions, and application programming interfaces (\"APIs\"). The CUSIP Global Services (\"CGS\") business supports security master files relied on by the investment industry for critical front, middle and back-office functions. All of our platforms and solutions are supported by our dedicated client service team.\nWe operate our business through three reportable segments (\"segments\"): the Americas, EMEA and Asia Pacific. Within each segment, we offer data, products and analytical applications by firm type: \n•\n\"Institutional Buyside\" focuses on global asset managers, asset owners, and hedge fund professionals,\n•\n\"Dealmakers\" focuses on investment bankers, sell-side research analysts, corporate users, investor relations officers and private equity and venture capital professionals, \n•\n\"Wealth\" focuses on wealth management clients, and\n36\nTable of Contents\n•\n\"Partnerships and CGS\": \"Partnerships\" delivers solutions to firms in the financial services ecosystem including data, analytics and technology platform providers. \"CGS\" is an originator of securities identification, managed on behalf of the American Bankers Association, for all sectors of the global financial markets.\nRefer to Note 16, \nSegment Information, \nin the Notes to the Consolidated Financial Statements included in Part I, Item 1. of this Quarterly Report on Form 10-Q for more information on our segments.\nBusiness Strategy\nWe strive to be a trusted enterprise partner and service provider to our clients across the financial services spectrum, delivering relevant intelligence, insights and execution solutions tailored to our clients' business models. \nWe are focused on growing our global business through three strategically aligned geographic segments: the Americas, EMEA and Asia Pacific. This approach allows us to better manage resources, target solutions and interact with clients effectively. \nTo execute our strategy, we are focused on three core pillars and primary areas of investment: \n•\nExpanding our data offerings: \nWe continue to scale up our data ecosystem to provide a comprehensive inventory of industry, proprietary and third-party data. This includes granular data for key industry verticals, real-time market data, fund data and sustainable finance. We believe that our breadth of high-quality, connected data will serve as critical raw material for large language models. In addition to using our growing data catalog to power our artificial intelligence (\"AI\") powered workstation products, we aim to continue to expand our data delivery capabilities in the cloud and through other methods to advance our position as an enterprise data provider for our clients.\n•\nEmbedding deeper in client workflows\n: Through continued innovation, we aim to deepen our integration into our clients' workflows. We are focused on expanding further into the buy-side front office by leveraging our expertise in portfolio performance, analytics, and risk management. In addition, we are building on our strong presence on advisor desktops by expanding into prospecting and digital reporting workflows. We are also working to introduce next-generation automation in research, financial modeling, and pitch creation.\n•\nInnovating with AI\n: Our artificial intelligence roadmap, driven by our FactSet AI Blueprint, continues to resonate with our clients. We recently launched new AI-powered solutions for generating portfolio performance commentary, analyzing earnings call transcripts, and requesting FactSet data using natural language queries in client-built environments and chatbots. We believe that our pragmatic, open and flexible approach to leveraging AI to enhance our clients’ workflows will differentiate FactSet from our competitors and drive growth.\nExecutive Leadership Transition\nOn June 3, 2025, FactSet announced the appointment of Sanoke Viswanathan as Chief Executive Officer and that he will join FactSet’s Board of Directors, effective on September 1, 2025, or such other mutually agreed date. Mr. Viswanathan will succeed F. Philip Snow, who will retire from these roles effective on Mr. Viswanathan's start date. To support a smooth leadership transition, Mr. Snow will continue employment with FactSet in an advisory capacity until November 15, 2025 or such later date as mutually agreed.  \nFiscal 2025 Third Quarter in Review\nRevenues in the third quarter of fiscal 2025 were $585.5 million, an increase of 5.9% from the comparable prior year period. This 5.9% growth in revenues was driven by a 4.4% increase in organic revenues, a 1.4% increase from acquisition-related revenues and a 0.1% net increase from foreign currency exchange rate fluctuations. Revenues increased in all our segments, primarily in the Americas. Revenues increased primarily from workstations and, to a lesser extent, front office solutions and CGS. Refer to Part I, Item 2. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations, Non-GAAP Financial Measures,\n of this Quarterly Report on Form 10-Q for the definition of organic revenues and a reconciliation between revenues and organic revenues.\nAs of May 31, 2025, organic annual subscription value (\"Organic ASV\") totaled $2,296.9 million, an increase of 4.5% over the prior year. Organic ASV increased in all our segments, with the majority of the increase in the Americas. The Organic ASV increase was mainly driven by workstations and, to a lesser extent, CGS and data solutions. Refer to Part I, Item 2. \nManagement's Discussion and\n37\nTable of Contents\n Analysis of Financial Condition and Results of Operations, Annual Subscription Value, \nof this Quarterly Report on Form 10-Q for the definition of Organic ASV.\nOperating margin was 33.2% for the third quarter of fiscal 2025, compared to 36.6% in the prior year period. When expenses are expressed as a percentage of revenues, this decrease in operating margin was mainly due to higher employee compensation costs and amortization of intangible assets, partially offset by growth in revenues and a benefit from the net settlement of our foreign currency forward contracts. Diluted earnings per common share (\"Diluted EPS\") was $3.87 for the third quarter of fiscal 2025, a decrease of 5.4% from the comparable prior year period, primarily driven by lower operating income.\nWe returned $120.2 million to our stockholders in the form of share repurchases and dividends during the three months ended May 31, 2025.\nAs of May 31, 2025, our client and user count was 8,811 and 220,496, respectively. Our employee headcount was 12,579 as of May 31, 2025, up 2.6% compared to the prior year. This increase was driven by net headcount growth of 5.2% in Americas, 3.4% in EMEA and 1.7% in Asia Pacific.\nAnnual Subscription Value (\"ASV\")\nWe believe ASV reflects our ability to grow recurring revenues and generate positive cash flows, and thus serves as a key indicator of the successful execution of our business strategy. \n–\n\"ASV\" at any point in time represents our forward-looking revenues for the next 12 months from all subscription services currently being supplied to clients.\n–\n\"Organic ASV\" at any point in time equals our ASV excluding ASV from acquisitions and dispositions completed within the last 12 months and the effects of foreign currency movements.\nBeginning in fiscal 2025, we are reporting Organic ASV, rather than Organic ASV plus professional services, to focus on the recurring nature of our revenues. This underscores the shift of our offerings toward providing more managed services and less project-based services. \nOrganic ASV \nThe following table presents the calculation of Organic ASV as of May 31, 2025. With proper notice provided as contractually required, our clients can add to, delete portions of, or terminate service, subject to certain limitations.\n(dollar amounts in millions)\nAs of May 31, 2025\nASV\n$\n2,335.1 \nCurrency impact\n(1)\n(5.7)\nAcquisition ASV\n(\n2)\n(32.5)\nOrganic ASV\n$\n2,296.9 \nOrganic ASV annual growth rate\n4.5 \n%\n(1)\nThe impact from foreign currency movements. \n(2)\nAcquired ASV from acquisitions completed within the last 12 months.\nAs of May 31, 2025, Organic ASV was $2,296.9 million, an increase of 4.5% compared with May 31, 2024. Organic ASV increased in all our segments, with the majority of the increase in the Americas. The increase in Organic ASV was primarily due to higher sales to existing clients and to a lesser extent, price increases to existing clients and sales to new clients, all primarily driven by workstations and, to a lesser extent, CGS and data solutions. This increase was partially offset by existing client cancellations. \nSegment ASV\nAs of May 31, 2025, ASV from the Americas represented 65% of total ASV and was $1,513.1 million, an increase from $1,415.3 million as of May 31, 2024. Americas Organic ASV was $1,486.0 million as of May 31, 2025, a 5.0% increase from the prior year period. The Organic ASV increase in the Americas was primarily driven by workstations and, to a lesser extent, CGS.\n38\nTable of Contents\nAs of May 31, 2025, ASV from EMEA represented 25% of total ASV and was $581.9 million, an increase from $565.0 million as of May 31, 2024. EMEA Organic ASV was $575.2 million as of May 31, 2025, a 2.1% increase from the prior year period. The EMEA Organic ASV increase was mainly from CGS and data solutions.\nAs of May 31, 2025, ASV from Asia Pacific represented 10% of total ASV and was $240.1 million, an increase from $218.8 million as of May 31, 2024. Asia Pacific Organic ASV was $235.7 million as of May 31, 2025, a 7.1% increase from the prior year period. The Asia Pacific Organic ASV increase was primarily driven by workstations and data solutions.\nBuy-side and Sell-side Organic ASV Growth\nThe buy-side and sell-side Organic ASV annual growth rates as of May 31, 2025 were each 4.0%. Buy-side clients account for approximately 82% of our Organic ASV, consistent with the prior year period, and primarily include institutional asset managers, wealth managers, asset owners, partners, hedge funds and corporate clients. The remaining Organic ASV is derived from sell-side firms, primarily including broker-dealers, banking and advisory firms, and private equity and venture capital firms. \nClient and User Additions\nThe table below presents our total clients and users:\nAs of May 31, 2025\nAs of May 31, 2024\nChange\nClients\n(1)\n8,811 \n8,029 \n9.7 \n%\nUsers\n(2)\n220,496 \n208,140 \n5.9 \n%\n(1)\nThe client count includes clients with ASV of $10,000.\n(2)\nThe user count does not reflect users associated with our fiscal 2025 acquisitions. \nOur total client count was 8,811 as of May 31, 2025, a net increase of 9.7% or 782 clients in the last 12 months, mainly due to an increase in corporates, primarily driven by clients from the Platform Group Limited (\"Irwin\") acquisition.\nAs of May 31, 2025, there were 220,496 professionals using FactSet, representing a net increase of 5.9% or 12,356 users in the last 12 months, primarily driven by an increase in wealth management users. The user count does not reflect our fiscal 2025 acquisitions.\nAnnual ASV retention was greater than 95% of ASV as of May 31, 2025 and May 31, 2024. When expressed as a percentage of clients, annual retention was 91% as of May 31, 2025, compared with 90% as of May 31, 2024.\nEmployee Headcount\nAs of May 31, 2025, our net employee headcount increased by 2.6% to 12,579, compared with 12,262 employees as of May 31, 2024. This net headcount growth was primarily driven by our Irwin and Liquid Holdings, LLC (\"LiquidityBook\") acquisitions and continued investment in our centers of excellence (\"COEs\") through an increase in employees based in the Philippines and India. Approximately 67% of our employees are located in our COEs.\nAs of May 31, 2025, compared to May 31, 2024, our net headcount growth was 5.2% in the Americas, 3.4% in EMEA and 1.7% in Asia Pacific. As of May 31, 2025, we had 8,668 employees located in Asia Pacific, 2,466 in the Americas and 1,445 in EMEA.\nResults of Operations\nFor an understanding of the significant factors that influenced our performance for the three and nine months ended May 31, 2025 and May 31, 2024, the following discussion should be read in conjunction with the Consolidated Financial Statements and related Notes presented in Part I, Item 1. in this Quarterly Report on Form 10-Q. \n39\nTable of Contents\nThe following table summarizes the results of operations for the periods described:\nThree Months Ended\nNine Months Ended\n \nMay 31,\n% Change\nMay 31,\n% Change\n(in thousands, except per share data)\n2025\n2024\n2025\n2024\nRevenues\n$\n585,520 \n$\n552,708 \n5.9 \n%\n$\n1,724,847 \n$\n1,640,869 \n5.1 \n%\nCost of services\n280,729 \n246,986 \n13.7 \n%\n809,112 \n753,749 \n7.3 \n%\nSelling, general and administrative\n110,636 \n103,263 \n7.1 \n%\n344,753 \n313,679 \n9.9 \n%\nOperating income\n$\n194,155 \n$\n202,459 \n(4.1)\n%\n$\n570,982 \n$\n573,441 \n(0.4)\n%\nNet income\n$\n148,542 \n$\n158,135 \n(6.1)\n%\n$\n443,424 \n$\n447,630 \n(0.9)\n%\nDiluted weighted average common shares\n38,344 \n38,640 \n38,457 \n38,644 \nDiluted EPS\n$\n3.87 \n$\n4.09 \n(5.4)\n%\n$\n11.53 \n$\n11.58 \n(0.4)\n%\nRevenues\nThree months ended May 31, 2025 compared with three months ended May 31, 2024\nRevenues for the three months ended May 31, 2025 were $585.5 million, an increase of 5.9%. This 5.9% growth in revenues was driven by a 4.4% increase in organic revenues, which totaled $577.2 million for the three months ended May 31, 2025, and a 1.4% increase from acquisition-related revenues, partially offset by a net increase of 0.1% from foreign currency exchange rate fluctuations. Revenues increased in all our segments, primarily in the Americas. The increase in revenues was primarily driven by workstations and, to a lesser extent, front office solutions and CGS.\nNine months ended May 31, 2025 compared with nine months ended May 31, 2024\nRevenues for the nine months ended May 31, 2025 were $1,724.8 million, an increase of 5.1%. This 5.1% growth in revenues was driven by a 4.4% increase in organic revenues, which totaled $1,712.9 million for the nine months ended May 31, 2025, and a 0.7% increase from acquisition-related revenues. Revenues increased in all our segments, primarily in the Americas. The increase in revenues was mainly from workstations and, to a lesser extent, CGS.\nRevenues by Segment\nThe following table summarizes our revenues by segment:\n \nThree Months Ended\nNine Months Ended\nMay 31,\n% Change\nMay 31,\n% Change\n(dollar amounts in thousands)\n2025\n2024\n2025\n2024\nAmericas\n$\n380,501 \n$\n356,468 \n6.7 \n%\n$\n1,117,404 \n$\n1,057,453 \n5.7 \n%\n% of revenues\n65.0 \n%\n64.5 \n%\n64.8 \n%\n64.4 \n%\nEMEA\n$\n145,741 \n$\n141,279 \n3.2 \n%\n$\n432,853 \n$\n420,016 \n3.1 \n%\n% of revenues\n24.9 \n%\n25.6 \n%\n25.1 \n%\n25.6 \n%\nAsia Pacific\n$\n59,278 \n$\n54,961 \n7.9 \n%\n$\n174,590 \n$\n163,400 \n6.8 \n%\n% of revenues\n10.1 \n%\n9.9 \n%\n10.1 \n%\n10.0 \n%\nConsolidated\n$\n585,520 \n$\n552,708 \n5.9 \n%\n$\n1,724,847 \n$\n1,640,869 \n5.1 \n%\n40\nTable of Contents\nThree months ended May 31, 2025 compared with three months ended May 31, 2024 \nAmericas\nAmericas revenues increased 6.7% to $380.5 million during the three months ended May 31, 2025, compared with $356.5 million from the same period a year ago. This 6.7% growth in revenues was driven by a 5.0% increase in organic revenues and a 1.8% increase from acquisition-related revenues, partially offset by a 0.1% net decrease from foreign currency exchange rate fluctuations. The increase in revenues was driven by workstations and front office solutions.\nEMEA\nEMEA revenues increased 3.2% to $145.7 million during the three months ended May 31, 2025, compared with $141.2 million from the same period a year ago. This 3.2% growth in revenues was driven by a 2.3% increase in organic revenues, a 0.6% increase from acquisition-related revenues and a 0.3% net increase from foreign currency exchange rate fluctuations. The increase in revenues was mainly from CGS, data solutions and front office solutions.\nAsia Pacific\nAsia Pacific revenues increased 7.9% to $59.3 million during the three months ended May 31, 2025, compared with $55.0 million from the same period a year ago. This 7.9% growth in revenues was driven by a 6.4% increase in organic revenues, a 0.9% increase from acquisition-related revenues and a 0.6% net benefit from foreign currency exchange rate fluctuations. The increase in revenues was driven by data solutions and workstations.\nNine months ended May 31, 2025 compared with nine months ended May 31, 2024 \nAmericas\nRevenues from the Americas increased 5.7% to $1,117.4 million during the nine months ended May 31, 2025, compared with $1,057.5 million from the same period a year ago. This 5.7% growth in revenues was driven by a 4.7% increase in organic revenues and a 1.0% increase from acquisition-related revenues. The increase in revenues was driven by workstations and, to a lesser extent, CGS and front office solutions.\nEMEA\nRevenues from EMEA increased 3.1% to $432.9 million during the nine months ended May 31, 2025, compared with $420.0 million from the same period a year ago. This 3.1% growth in revenues was driven by a 2.7% increase in organic revenues, a 0.3% increase from acquisition-related revenues and a 0.1% net increase from foreign currency exchange rate fluctuations. The increase in revenues was mainly from CGS, data solutions and middle office solutions. \nAsia Pacific\nRevenues from Asia Pacific increased 6.8% to $174.6 million during the nine months ended May 31, 2025, compared with $163.4 million from the same period a year ago. This 6.8% growth in revenues was driven by a 6.5% increase in organic revenues and a 0.3% increase from acquisition-related revenues. The increase in revenues was driven by data solutions and workstations.\nOperating Expenses\nPrincipal Operating Expenses\nCost of services\n is mainly comprised of employee compensation costs and also includes expenses related to data costs, computer-related expenses, amortization of intangible assets, royalty fees, telecommunication costs and computer depreciation.\nSelling, general and administrative (\"SG&A\")\n consists primarily of employee compensation costs and also includes expenses related to occupancy costs, professional fees, depreciation of furniture and fixtures, amortization of leasehold improvements, travel and entertainment expenses, marketing costs, other employee-related expenses, internal communication costs, bad debt expense and the impact from our foreign currency forward contracts.\nEmployee compensation costs are a major component of both our Cost of services and SG&A. These expenses primarily include costs related to salaries, incentive compensation and sales commissions, stock-based compensation, benefits, employment taxes, and any applicable restructuring costs.\n41\nTable of Contents\nWe assign employee compensation costs between Cost of services and SG&A based on the roles and activities associated with each employee. We categorize employees within the content collection, consulting, product development, software and systems engineering groups as Cost of services personnel. Employees included in our sales department and those that serve in various other support departments, including marketing, finance, legal, human resources and administrative services, are classified as SG&A.\nThe following table summarizes the components of our total operating expenses and operating margin:\n \nThree Months Ended\nNine Months Ended\nMay 31,\nMay 31,\n% Change\n(dollar amounts in thousands)\n2025\n2024\n% Change\n2025\n2024\nCost of services\n$\n280,729 \n$\n246,986 \n13.7 \n%\n$\n809,112 \n$\n753,749 \n7.3 \n%\nSG&A\n110,636 \n103,263 \n7.1 \n%\n344,753 \n313,679 \n9.9 \n%\nTotal operating expenses\n$\n391,365 \n$\n350,249 \n11.7 \n%\n$\n1,153,865 \n$\n1,067,428 \n8.1 \n%\nOperating income\n$\n194,155 \n$\n202,459 \n(4.1)\n%\n$\n570,982 \n$\n573,441 \n(0.4)\n%\nOperating margin\n33.2 \n%\n36.6 \n%\n33.1 \n%\n34.9 \n%\nCost of Services\nThree months ended May 31, 2025\n \ncompared with three months ended\n \nMay 31, 2024\nCost of services increased 13.7% to $280.7 million for the three months ended May 31, 2025, compared with $247.0 million for the same period a year ago, primarily due to an increase in employee compensation costs and amortization of intangible assets.\nCost of services, when expressed as a percentage of revenues, was 47.9% for the three months ended May 31, 2025, an increase of 330 basis points compared with the same period a year ago. This increase was primarily due to higher employee compensation costs and amortization of intangible assets.\nWhen expressed as a percentage of revenues:\n•\nEmployee compensation costs increased by 150 basis points, primarily due to higher variable compensation costs driven by a lower bonus accrual in the prior year period and an increase in annual base salaries. The increase in annual base salaries was primarily driven by annual merit increases and a net headcount increase in cost of services of 251 employees, primarily driven by our fiscal 2025 acquisitions.\n•\nAmortization of intangible assets increased by 100 basis points, mainly due to higher amortization from our  capitalized internal-use software development costs.\nNine months ended May 31, 2025 compared with nine months ended May 31, 2024 \nCost of services increased 7.3% to $809.1 million for the nine months ended May 31, 2025, compared with $753.7 million in the same period a year ago, primarily due to an increase in amortization of intangible assets, computer-related expenses, and employee compensation costs. \nCost of services, when expressed as a percentage of revenues, was 46.9% for the nine months ended May 31, 2025, an increase of 100 basis points compared with the same period a year ago. This increase was primarily driven by an increase in amortization of intangible assets, partially offset by lower employee compensation costs.\nWhen expressed as a percentage of revenues:\n•\nAmortization of intangible assets increased 100 basis points, mainly due to higher amortization from our capitalized internal-use software development costs.\n•\nEmployee compensation costs decreased 80 basis points primarily due to revenues outpacing the increase in employee compensation costs and a decrease in restructuring charges, partially offset by higher variable compensation costs driven by a lower bonus accrual in the prior year period.\n42\nTable of Contents\nSelling, General and Administrative\nThree months ended\n \nMay 31, 2025\n \ncompared with three months ended\n \nMay 31, 2024\nSG&A increased 7.1% to $110.6 million for the three months ended May 31, 2025, compared with $103.3 million in the same period a year ago, primarily driven by higher employee compensation costs, partially offset by a benefit from the net settlement of our foreign currency forward contracts.\nSG&A, when expressed as a percentage of revenues, was 18.9% for the three months ended May 31, 2025, an increase of 20 basis points compared with the same period a year ago. This increase was primarily driven by higher employee compensation costs, partially offset by a benefit from the net settlement of our foreign currency forward contracts.\nWhen expressed as a percentage of revenues:\n•\nEmployee compensation costs increased by 80 basis points, mainly due to higher variable compensation costs driven by a lower bonus accrual in the prior year period and an increase in payroll taxes due to a one-time payroll tax adjustment that occurred in the prior year period.\n•\nThe net settlement of foreign currency forward contracts decreased SG&A by 30 basis points.\nNine months ended May 31, 2025 compared with nine months ended May 31, 2024 \nSG&A expenses increased 9.9% to $344.8 million for the nine months ended May 31, 2025, compared with $313.7 million for the same period a year ago, primarily driven by higher employee compensation costs and professional fees.\nSG&A expenses, when expressed as a percentage of revenues, were 20.0% for the nine months ended May 31, 2025, an increase of 90 basis points compared with the same period a year ago. This increase was primarily due to higher professional fees and employee compensation costs.\nWhen expressed as a percentage of revenues:\n•\nProfessional fees increased by 80 basis points, mainly due to acquisition-related costs.\n•\nEmployee compensation costs increased by 50 basis points, mainly due to higher variable compensation costs driven by a lower bonus accrual in the prior year period.\nOperating Income and Operating Margin\nThree months ended\n \nMay 31, 2025\n \ncompared with three months ended\n \nMay 31, 2024\nOperating income decreased 4.1% to $194.2 million for the three months ended May 31, 2025, compared with $202.5 million in the prior year period. This decrease was primarily driven by higher employee compensation costs and amortization of intangible assets, partially offset by growth in revenues. \nOperating margin decreased to 33.2% during the three months ended May 31, 2025, compared with 36.6% in the prior year period. When expenses are expressed as a percentage of revenues, this decrease in operating margin was mainly due to higher  employee compensation costs and amortization of intangible assets, partially offset by growth in revenues and a benefit from the net settlement of our foreign currency forward contracts.\nNine months ended May 31, 2025 compared with nine months ended May 31, 2024 \nOperating income decreased 0.4% to $571.0 million for the nine months ended May 31, 2025, compared with $573.4 million in the prior year period. This decrease was primarily due to higher employee compensation costs and amortization of intangible assets, partially offset by growth in revenues. \nOperating margin decreased to 33.1% for the nine months ended May 31, 2025, compared with 34.9% in the prior year period. When expenses are expressed as a percentage of revenues, this decrease was primarily due to higher amortization of intangible assets and professional fees, partially offset by growth in revenues. \n43\nTable of Contents\nOperating Income by Segment\nWe operate our business through three segments: the Americas; EMEA; and Asia Pacific. Refer to Note 16, \nSegment Information\n in the Notes to the Consolidated Financial Statements included in Part I, Item 1. of this Quarterly Report on Form 10-Q for further discussion regarding our segments. The following table summarizes our operating income by segment:\n \nThree Months Ended\nNine Months Ended\nMay 31,\n% Change\nMay 31,\n% Change\n(dollar amounts in thousands)\n2025\n2024\n2025\n2024\nAmericas\n$\n81,565 \n$\n87,696 \n(7.0)\n%\n$\n236,490 \n$\n250,255 \n(5.5)\n%\nEMEA\n69,027 \n75,463 \n(8.5)\n%\n208,633 \n207,167 \n0.7 \n%\nAsia Pacific\n43,563 \n39,300 \n10.8 \n%\n125,859 \n116,019 \n8.5 \n%\nTotal Operating Income\n$\n194,155 \n$\n202,459 \n(4.1)\n%\n$\n570,982 \n$\n573,441 \n(0.4)\n%\nThree months ended\n \nMay 31, 2025\n \ncompared with three months ended\n \nMay 31, 2024\nAmericas\nAmericas operating income decreased 7.0% to $81.6 million during the three months ended May 31, 2025, compared with $87.7 million in the same period a year ago. This decrease was primarily due to higher employee compensation costs and amortization of intangible assets, partially offset by growth in revenues of 6.7%.\n•\nEmployee compensation costs increased mainly due to higher variable compensation costs driven by a lower bonus accrual in the prior year period and an increase in payroll taxes due to a one-time payroll tax adjustment that occurred in the prior year period.\n•\nAmortization of intangible assets increased mainly due to higher amortization from our capitalized internal-use software development costs.\nEMEA\nEMEA operating income decreased 8.5% to $69.0 million during the three months ended May 31, 2025, compared with $75.5 million in the same period a year ago. This decrease was primarily due to higher employee compensation costs mainly due to higher annual base salaries and an increase in variable compensation costs driven by a lower bonus accrual in the prior year period, partially offset by growth in revenues of 3.2%. The increase in annual base salaries was primarily driven by annual merit increases and a net headcount increase of 47 employees.\nAsia Pacific\nAsia Pacific operating income increased 10.8% to $43.6 million during the three months ended May 31, 2025, compared with $39.3 million in the same period a year ago. This increase was mainly due to growth in revenues of 7.9%, partially offset by an increase in employee compensation costs primarily due to higher annual base salaries and an increase in variable compensation costs driven by a lower bonus accrual in the prior year period. The increase in annual base salaries was primarily driven by annual merit increases and a net headcount increase of 147 employees.\nNine months ended May 31, 2025 compared with nine months ended May 31, 2024 \nAmericas\nAmericas operating income decreased 5.5% to $236.5 million during the nine months ended May 31, 2025, compared with $250.3 million in the same period a year ago. This decrease was primarily due to higher amortization of intangible assets, employee compensation costs and professional fees, partially offset by growth in revenues of 5.7%.\n•\nAmortization of intangible assets increased mainly due to higher amortization from our capitalized internal-use software development costs.\n•\nEmployee compensation costs increased mainly due to higher variable compensation costs driven by a lower bonus accrual in the prior year period.\n•\nProfessional fees increased mainly due to acquisition-related costs.\n44\nTable of Contents\nEMEA\nEMEA operating income increased 0.7% to $208.6 million during the nine months ended May 31, 2025, compared with $207.1 million in the same period a year ago. This increase was primarily due to growth in revenues of 3.1%, partially offset by higher employee compensation expense. Employee compensation costs increased primarily due to an increase in annual base salaries driven by annual merit increases and a net headcount increase of 47 employees.\nAsia Pacific\nAsia Pacific operating income increased 8.5% to $125.9 million during the nine months ended May 31, 2025, compared with $116.0 million in the same period a year ago. This increase was mainly due to growth in revenues of 6.8%, partially offset by higher employee compensation costs. Employee compensation costs increased primarily due to higher annual base salaries driven by annual merit increases and a net headcount increase of 147 employees.  \nIncome Taxes\nThe provision for income taxes and the effective tax rate are as follows:\nThree Months Ended\nNine Months Ended\nMay 31,\nMay 31,\n(dollar amounts in thousands)\n2025\n2024\n% Change\n2025\n2024\n% Change\nIncome before income taxes\n$\n179,948 \n$\n190,532 \n(5.6)\n%\n$\n532,007 \n$\n534,373 \n(0.4)\n%\nProvision for income taxes\n$\n31,406 \n$\n32,397 \n(3.1)\n%\n$\n88,583 \n$\n86,743 \n2.1 \n%\nEffective tax rate\n17.5 \n%\n17.0 \n%\n16.7 \n%\n16.2 \n%\nWe are subject to taxation in the United States (\"U.S.\") and various foreign jurisdictions in which we conduct our business.\nOur provision for income taxes for interim periods is calculated by applying an estimate of our annual effective tax rate to our quarter and year-to-date results, adjusted for discrete items recorded in the period. The computation of the annual estimated effective tax rate at each interim period requires certain estimates and assumptions including, but not limited to, the expected pretax income (or loss) for the year, projections of the proportion of income (or loss) earned and taxed in foreign jurisdictions, permanent and temporary differences and the likelihood of recovering deferred tax assets, then adjusted for any discrete items. On a quarterly basis, we update the estimate of our annual effective tax rate as new events occur, assumptions change, or additional information is obtained.\nOur effective tax rate for the three months ended May 31, 2025 and May 31, 2024 was 17.5% and 17.0%, respectively, and for the nine months ended May 31, 2025 and May 31, 2024 was 16.7% and 16.2%, respectively. The increase in the effective tax rate for the periods presented was primarily due to certain discrete items, mainly lower excess tax benefits related to stock-based compensation, as well as a higher overall foreign tax rate, partially offset by a lower U.S. tax impact of foreign earnings.\nFor the periods presented, our effective tax rates were lower than the applicable U.S. corporate income tax rate. This was primarily attributable to excess tax benefits from stock-based compensation, a lower U.S. tax impact of foreign earnings, research and development (\"R&D\") tax credits and a foreign derived intangible income (\"FDII\") deduction, partially offset by our state income taxes.\n45\nTable of Contents\nNet Income and Diluted EPS\n \nThree Months Ended\nNine Months Ended\nMay 31,\nMay 31,\n(in thousands, except per share data)\n2025\n2024\n% Change\n2025\n2024\n% Change\nNet income\n$\n148,542 \n$\n158,135 \n(6.1)\n%\n$\n443,424 \n$\n447,630 \n(0.9)\n%\nDiluted weighted average common shares\n38,344 \n38,640 \n(0.8)\n%\n38,457 \n38,644 \n(0.5)\n%\nDiluted EPS\n$\n3.87 \n$\n4.09 \n(5.4)\n%\n$\n11.53 \n$\n11.58 \n(0.4)\n%\nThe decrease in Net income and Diluted EPS for the three months ended May 31, 2025, compared to the respective prior year period, was primarily driven by lower operating income. \nThe decrease in Net income and Diluted EPS for the nine months ended May 31, 2025, compared to the respective prior year period, was primarily driven by lower interest income and operating income, partially offset by lower interest expense.\nNon-GAAP Financial Measures\nTo supplement the financial measures prepared in accordance with generally accepted accounting principles in the United States (\"GAAP\"), we use non-GAAP financial measures including organic revenues, adjusted operating income, adjusted operating margin, adjusted net income, EBITDA, adjusted EBITDA, adjusted Diluted EPS and free cash flow. The reconciliations from our financial measures calculated and presented in accordance with GAAP to these non-GAAP financial measures are shown in the tables below and refer to\n Liquidity and Capital Resources\n within this section below, for our free cash flow reconciliation.. These non-GAAP financial measures should not be considered in isolation from, as a substitute for, or superior to, financial measures reported in accordance with GAAP. Moreover, these non-GAAP financial measures have limitations in that they do not reflect all the items associated with the operations of our business as determined in accordance with GAAP. Other companies may calculate similarly titled non-GAAP financial measures differently than we do, limiting the usefulness of those measures for comparative purposes.\nDespite the limitations of these non-GAAP financial measures, we believe these adjusted financial measures and the information they provide are useful in viewing our performance using the same tools that management uses to gauge progress in achieving our goals. Adjusted measures may also facilitate comparisons to our historical performance.\nOrganic revenues excludes the current year impact of revenues from acquisitions and dispositions completed within the past 12 months (\"Acquisition revenues\" and \"Disposition revenues\", respectively) and the current year impact from changes in foreign currency. In addition, for year to date comparisons, organic revenues excludes current year revenues that were incurred prior to the first anniversary date of an acquisition. The table below provides an unaudited reconciliation of revenues to organic revenues:\n \nThree Months Ended\nNine Months Ended\nMay 31,\n% Change\nMay 31,\n% Change\n(dollar amounts in thousands)\n2025\n2024\n2025\n2024\nRevenues\n$\n585,520 \n$\n552,708 \n5.9 \n%\n$\n1,724,847 \n$\n1,640,869 \n5.1 \n%\nAcquisition revenues\n(7,781)\n— \n(12,270)\n— \nCurrency impact\n(539)\n— \n281 \n— \nOrganic revenues\n$\n577,200 \n$\n552,708 \n4.4 \n%\n$\n1,712,858 \n$\n1,640,869 \n4.4 \n%\n46\nTable of Contents\nThe table below provides an unaudited reconciliation of Operating income, operating margin, Net income and Diluted EPS to adjusted operating income, adjusted operating margin, adjusted net income, EBITDA, adjusted EBITDA and adjusted Diluted EPS. Adjusted operating income and margin, adjusted net income, and adjusted Diluted EPS exclude the impact of acquisition-related intangible asset amortization and non-recurring items. EBITDA represents earnings before interest expense, provision for income taxes and depreciation and amortization, while adjusted EBITDA further excludes non-recurring non-cash expenses.\n \nThree Months Ended\nNine Months Ended\nMay 31,\nMay 31,\n(in thousands, except per share data)\n2025\n2024\n% Change\n2025\n2024\n% Change\nOperating income\n$\n194,155\n$\n202,459\n(4.1)%\n$\n570,982\n$\n573,441\n(0.4)%\nIntangible asset amortization\n19,182\n16,674\n53,900\n50,692\nBusiness acquisitions and related costs\n1,976\n423\n14,769\n423\nSales tax dispute\n(1)\n—\n—\n2,398\n—\nRestructuring/severance\n—\n(1,596)\n(317)\n6,695\nAdjusted operating income\n$\n215,313\n$\n217,960\n(1.2)%\n$\n641,732\n$\n631,251\n1.7%\nOperating margin\n33.2%\n36.6%\n33.1%\n34.9%\nAdjusted operating margin\n(2)\n36.8%\n39.4%\n37.2%\n38.5%\nNet income\n$\n148,542 \n$\n158,135 \n(6.1)\n%\n$\n443,424 \n$\n447,630 \n(0.9)\n%\nIntangible asset amortization\n13,943 \n11,466 \n39,809 \n36,791 \nBusiness acquisitions and related costs\n1,436 \n291 \n10,908 \n307 \nSales tax dispute\n(1)\n— \n— \n1,771 \n— \nRestructuring/severance\n— \n(1,096)\n(234)\n4,859 \nIncome tax items\n— \n— \n1,351 \n1,397 \nAdjusted net income\n(3)\n$\n163,921 \n$\n168,796 \n(2.9)\n%\n$\n497,029 \n$\n490,984 \n1.2 \n%\nNet income\n$\n148,542 \n$\n158,135 \n(6.1)\n%\n$\n443,424 \n$\n447,630 \n(0.9)\n%\nInterest expense\n15,122 \n16,894 \n43,438 \n50,231 \nIncome taxes\n31,406 \n32,397 \n88,583 \n86,743 \nDepreciation and amortization expense\n40,845 \n32,504 \n114,972 \n91,154 \nEBITDA\n$\n235,915 \n$\n239,930 \n(1.7)\n%\n$\n690,417 \n$\n675,758 \n2.2 \n%\nNon-recurring non-cash expenses\n(4)\n— \n— \n— \n1,285 \nAdjusted EBITDA\n$\n235,915 \n$\n239,930 \n(1.7)\n%\n$\n690,417 \n$\n677,043 \n2.0 \n%\nDiluted EPS\n$\n3.87 \n$\n4.09 \n(5.4)\n%\n$\n11.53 \n$\n11.58 \n(0.4)\n%\nIntangible asset amortization\n0.36 \n0.30 \n1.03 \n0.94 \nBusiness acquisitions and related costs\n0.04 \n0.01 \n0.28 \n0.01 \nSales tax dispute\n(1)\n— \n— \n0.05 \n— \nRestructuring/severance\n— \n(0.03)\n(0.01)\n0.14 \nIncome tax items\n— \n0.00 \n0.04 \n0.04 \nAdjusted Diluted EPS\n(3)\n$\n4.27 \n$\n4.37 \n(2.3)\n%\n$\n12.92 \n$\n12.71 \n1.7 \n%\nWeighted average common shares (diluted)\n38,344 \n38,640 \n38,457 \n38,644 \n(1)\nRelated to a resolved matter with the Massachusetts Department of Revenue. Refer to Note 12, \nCommitments and Contingencies\n in the Notes to the Consolidated Financial Statements included in Part I, Item 1. of this Quarterly Report on Form 10-Q, for further discussion on this matter.\n(2)\nAdjusted operating margin is calculated as Adjusted operating income divided by Revenues.\n(3)\nFor purposes of calculating Adjusted net income and Adjusted diluted EPS, all adjustments for the three months ended May 31, 2025 and May 31, 2024 were taxed at an adjusted tax rate of 27.3% and 31.2%, respectively. The nine months ended May 31, 2025 and May 31, 2024 were taxed at an adjusted tax rate of 26.1% and 27.4%, respectively.\n(4)\nRelated to the accelerated vesting of stock awards for certain employees.\n47\nTable of Contents\nLiquidity and Capital Resources\nAs of May 31, 2025, Cash and cash equivalents were $356.4 million and restricted cash was $14.0 million, compared with Cash and cash equivalents of $423.0 million as of August 31, 2024. Refer to \nSummary of Cash Flows \nwithin this section below, for more information on cash flows during the third quarter of fiscal 2025.\n \nOur cash and cash equivalents are held in numerous locations throughout the world, with $158.3 million in the Americas, $138.3 million in EMEA (predominantly in the UK) and the remaining $59.8 million in Asia Pacific (predominantly in the Philippines and India) as of May 31, 2025. \nOur cash flows provided by operating activities, existing cash and cash equivalents, supplemented with our debt borrowings, have been sufficient to fund our operations while allowing us to invest in activities that support the long-term growth of our operations. Generally, some or all of our remaining available cash flows have been used to, among other things, service our existing and future debt obligations, satisfy our working capital requirements and fund various activities, including our capital expenditures, acquisitions, investments, dividend payments and repurchases of our common stock. Based on past performance and current expectations, we believe our sources of liquidity, including the available capacity under our existing revolving credit facility and other financing alternatives, will provide us the necessary capital to fund these transactions and achieve our planned growth for the next 12 months and the foreseeable future. We are exposed to credit risk for our cash, cash equivalents and restricted cash held in financial institutions in the event of a default, to the extent that such amounts are in excess of applicable insurance limits; however, we do not believe our concentration of cash, cash equivalents and restricted cash presents a significant credit risk as the counterparties to the instruments consist of multiple high-quality, credit-worthy financial institutions.\nSources of Liquidity\nDebt and Swap Agreements\n2025 Credit Agreement\nOn April 8, 2025, we entered into a credit agreement (the \"2025 Credit Agreement\") and borrowed $500.0 million under a senior unsecured term loan credit facility (the \"2025 Term Facility\"). We used the proceeds from the 2025 Term Facility borrowing to repay the outstanding balance under the 2022 Revolving Facility (as defined below). The 2025 Credit Agreement also provides for a $1.0 billion senior unsecured revolving credit facility (the \"2025 Revolving Facility\"). The 2025 Revolving Facility, together with the 2025 Term Facility, are referred to as the \"2025 Credit Facilities\".\nThe 2025 Term Facility matures on April 8, 2028, and the 2025 Revolving Facility matures on April 8, 2030. The 2025 Revolving Facility provides for up to $100.0 million in the form of letters of credit, up to $100.0 million in the form of swingline loans. We may seek additional commitments of up to $1.0 billion under the 2025 Revolving Facility from lenders or other financial institutions.  \nThe 2025 Term Facility is subject to scheduled quarterly amortization payments, commencing on August 31, 2025, with each amortization payment equal to 1.25% of the original principal amount of the 2025 Term Facility. The 2025 Credit Facilities are not otherwise subject to any mandatory prepayments. We may voluntarily prepay loans under the 2025 Credit Facilities at any time without premium or penalty. Prepayments of the 2025 Term Facility shall be applied to reduce the subsequent scheduled amortization payments in direct order of maturity. \nDuring the three and nine months ended May 31, 2025, we voluntarily prepaid $62.5 million under the 2025 Term Facility. From the effective date of the 2025 Revolving Facility through May 31, 2025, we have had no borrowings under the 2025 Revolving Facility. \nAs of May 31, 2025, the outstanding borrowings under the 2025 Credit Facilities bore interest at a rate equal to the applicable one-month Term SOFR plus a 0.975% spread (comprised of a 0.875% interest rate margin based on a pricing grid determined by reference to our senior unsecured non-credit enhanced long-term debt rating and our total leverage ratio, plus a 0.1% credit spread adjustment).  \nWe pay a commitment fee on the daily unused amount of the 2025 Revolving Facility using a pricing grid based on our senior unsecured non-credit enhanced long-term debt rating and our total leverage ratio. The commitment fee remained consistent at 0.1% through May 31, 2025. Debt issuance costs related to the 2025 Credit Facilities were $3.4 million.\n48\nTable of Contents\n2022 Credit Agreement\nOn March 1, 2022, we entered into a credit agreement (the \"2022 Credit Agreement\") and borrowed $1.0 billion under a senior unsecured term loan credit facility (the \"2022 Term Facility\") and $250.0 million of the available $500.0 million under a senior unsecured revolving credit facility (the \"2022 Revolving Facility\"). The 2022 Revolving Facility, together with the 2022 Term Facility, are referred to as the \"2022 Credit Facilities\". On January 31, 2025, we entered into a joinder agreement to our 2022 Credit Agreement pursuant to which commitments under the 2022 Revolving Facility were increased by $100.0 million, to a total of $600.0 million. All other terms of the 2022 Credit Agreement remained unchanged. \nThe 2022 Term Facility, originally due to mature on March 1, 2025, was repaid in full following $125.0 million of repayments made during the six months ended February 28, 2025. During the nine months ended May 31, 2025, we borrowed $305.0 million and repaid $555.0 million under the 2022 Revolving Facility. The 2022 Credit Agreement was terminated on April 8, 2025, concurrent with entering into the 2025 Credit Agreement.\nBorrowings previously outstanding under the 2022 Credit Facilities bore interest at a rate equal to the applicable one-month Term SOFR plus a spread using a debt leverage pricing grid and a credit spread adjustment (with total spread ranging from 0.975% to 1.1% over the term of the debt). \nInterest Rate Swap Agreements\n2025 Swap Agreement\nOn April 24, 2025, we entered into an interest rate swap agreement (\"2025 Swap Agreement) to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of 4.086%. The 2025 Swap Agreement matures on February 28, 2026.\n2024 Swap Agreement\nOn March 1, 2024, we entered into an interest rate swap agreement (\"2024 Swap Agreement\") to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of 5.145%. The 2024 Swap Agreement matured on February 28, 2025. \n2022 Swap Agreement\nOn March 1, 2022, we entered into an interest rate swap agreement (the \"2022 Swap Agreement\") to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of 1.162%. The 2022 Swap Agreement matured on February 28, 2024. \nRefer to Note 5, \nDerivative Instruments\n, in the Notes to the Consolidated Financial Statements included in Part I, Item 1. of this Quarterly Report on Form 10-Q, for more information on our interest rate swap agreements.\nSenior Notes\nOn March 1, 2022, we completed a public offering issuing $500.0 million of 2.900% Senior Notes due March 1, 2027 (the \"2027 Notes\") and $500.0 million of 3.450% Senior Notes due March 1, 2032 (the \"2032 Notes\" and, together with the 2027 Notes, the \"Senior Notes\"). The Senior Notes were issued pursuant to an indenture, dated as of March 1, 2022, by and between us and U.S. Bank Trust Company, National Association, as trustee (the \"Trustee\"), as supplemented by the supplemental indenture, dated as of March 1, 2022, between us and the Trustee (the \"Supplemental Indenture\"). \nWe may redeem the Senior Notes, in whole or in part, at any time at specified redemption prices, plus any accrued and unpaid interest. Upon the occurrence of a change of control triggering event (as defined in the Supplemental Indenture), we must offer to repurchase the Senior Notes at 101% of their principal amount, plus any accrued and unpaid interest. \nUses of Liquidity\nReturning Value to Stockholders\nWe returned $312.2 million and $283.2 million to our stockholders in the form of share repurchases and dividends during the nine months ended May 31, 2025 and May 31, 2024, respectively. Over the last 12 months, we returned $414.9 million to our stockholders in the form of share repurchases and dividends.\nShare Repurchase Program\nWe may repurchase shares of our common stock under our share repurchase program from time-to-time in the open market or via privately negotiated transactions, subject to market conditions. During the three and nine months ended May 31, 202\n49\nTable of Contents\n5, we repurchased 184,050 shares for $80.7 million and 425,239 shares for $193.8 million, respectively. For the three and nine months ended May 31, 2024, we repurchased 135,150 shares for $59.8 million and 384,150 shares for $171.9 million, respectively. \nThere is no defined number of shares to be repurchased over a specified timeframe through the life of our share repurchase program. On September 17, 2024, our Board of Directors authorized up to $300 million for share repurchases during fiscal 2025. As of May 31, 2025, $106.2 million remained authorized under our share repurchase program. On June 17, 2025, our Board of Directors authorized up to $400 million for share repurchases on or after September 1, 2025 through September 30, 2026. Refer to Part II, Item 2.\n Unregistered Sales of Equity Securities and Use of Proceeds\n, of this Quarterly Report on Form 10-Q for further discussion on our share repurchase program.\nDividends\nIn the third quarter of fiscal 2025, our Board of Directors approved a 6% increase in the regular quarterly dividend from $1.04 to $1.10 per share. Fiscal 2025 marks the 26th consecutive fiscal year we have increased dividends on a stock split-adjusted basis, highlighting our continued commitment to returning value to our stockholders. During the nine months ended May 31, 2025 and May 31, 2024, we paid dividends of $118.3 million and $111.3 million, respectively. Future cash dividend payments are subject to final determination by our Board of Directors and will depend on our earnings, capital requirements, financial condition and other relevant factors. \nCapital Expenditures\nFor the nine months ended May 31, 2025, capital expenditures increased by 25.3% to $74.8 million, compared with $59.7 million for the same period a year ago. This increase was primarily due to higher capitalized costs related to the development of our internal-use software. \nAcquisitions\nOur acquisitions with the most significant cash flows during fiscal 2024 through the third quarter of fiscal 2025 included Liquid Holdings, LLC (\"LiquidityBook\") and Platform Group Limited (\"Irwin\"). Refer to Note 6, \nAcquisitions \nin the Notes to the Consolidated Financial Statements included in Part I, Item 1. of this Quarterly Report on Form 10-Q for further discussion on these acquisitions.\nLiquidityBook\nOn February 7, 2025 we completed the acquisition of LiquidityBook for a purchase price of $243.2 million, net of cash acquired, and inclusive of preliminary working capital adjustments. The purchase price includes contingent consideration of $11.9 million which reflects the acquisition date fair value of potential future payments that are contingent upon the achievement of certain specified milestones. \nLiquidityBook provides cloud-native trading solutions to hedge fund, asset and wealth management, outsourced trading, and sell-side middle office clients. LiquidityBook operates a proprietary FIX network that enables streamlined connectivity to over 200 brokers and order routing to more than 1,600 destinations across 80 markets globally. This acquisition adds technology-forward order management and investment book of record capabilities and enhances FactSet’s ability to serve the integrated workflow needs of clients across the portfolio life cycle.\nIrwin\nOn November 5, 2024, we completed the acquisition of Irwin for a purchase price of $120.2 million, net of cash acquired, and inclusive of working capital adjustments. The purchase price includes contingent consideration of $9.6 million which reflects the acquisition date fair value of potential future payments that are contingent upon the achievement of certain specified milestones. We finalized the purchase accounting for the Irwin acquisition during the third quarter of fiscal 2025. \nIrwin is a leading investor relations and capital markets platform for public companies and their advisors. This acquisition builds on a recent successful partnership between FactSet and Irwin, and expands our ability to address the holistic workflow needs of investor relations professionals with an integrated, modern solution.\nContractual Obligations\nPurchase obligations represent our legally-binding agreements to purchase fixed or minimum quantities at determinable prices. As of August 31, 2024, we had total purchase obligations with suppliers and vendors of $382.6 million. Our total purchase obligatio\n50\nTable of Contents\nns as of August 31, 2024 primarily related to hosting services, acquisition of data and, to a lesser extent, third-party software providers. For the nine months ended May 31, 2025, we had no new material purchase obligations.\nWe also have contractual obligations related to our lease liabilities and outstanding debt. Refer to Note 10, \nLeases\n and Note 11, \nDebt\n in the Notes to the Consolidated Financial Statements included in Part I, Item 1. of this Quarterly Report on Form 10-Q for information regarding lease commitments and outstanding debt obligations, respectively. \nSummary of Cash Flows\nThe following table provides a summary of our net cash flow activity for the periods presented:\nNine Months Ended\nMay 31,\n(dollar amounts in thousands)\n2025\n2024\n$ Change\nNet cash provided by operating activities\n$\n514,160 \n$\n537,177 \n$\n(23,017)\nNet cash provided by (used in) investing activities\n(369,373)\n(104,658)\n(264,715)\nNet cash provided by (used in) financing activities\n(199,327)\n(402,908)\n203,581 \nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n1,966 \n(1,911)\n3,877 \nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n(52,574)\n$\n27,700 \n$\n(80,274)\nOperating\nFor the nine months ended May 31, 2025, net cash provided by operating activities was $514.2 million, which included net income of $443.4 million, non-cash charges of $195.9 million and a net cash outflow of $125.1 million to support our working capital requirements. The non-cash charges were primarily driven by depreciation and amortization. The change in our working capital was primarily driven by cash outflows related to payments to resolve an outstanding sales tax dispute and timing of client collections.\nFor the nine months ended May 31, 2024, net cash provided by operating activities was $537.2 million, which included net income of $447.6 million, non-cash charges of $161.6 million and a net cash outflow of $72.0 million to support our working capital requirements. The non-cash charges were primarily driven by depreciation and amortization and stock-based compensation expense. The change in our working capital was primarily driven by cash outflows related to our annual variable compensation payment and lease payments. \nInvesting\nFor the nine months ended May 31, 2025, net cash used in investing activities was $369.4 million. The cash used in investing activities primarily consisted of $348.3 million of acquisition-related consideration related mainly to the Irwin and LiquidityBook transactions and $74.8 million of capital expenditures driven by the capitalization of internal-use software development costs, partially offset by $58.2 million in proceeds from our investments in mutual funds.\nFor the nine months ended May 31, 2024, net cash used in investing activities was $104.7 million. The cash used in investing activities was primarily related to capital expenditures of $59.7 million mainly driven by the capitalization of internal-use software development costs and $44.9 million in investments, primarily related to the purchase of mutual funds.\nFinancing\nFor the nine months ended May 31, 2025, net cash used in financing activities was $199.3 million, consisting mainly of $742.5 million related primarily to the repayment of the 2022 Credit Facilities, $193.8 million of share repurchases and $118.3 million of dividend payments, partially offset by $803.4 million of proceeds from borrowings under the 2025 Term Facility and the 2022 Revolving Facility, in periods prior to its termination, and $72.6 million of proceeds from employee stock plans.\nFor the nine months ended May 31, 2024, net cash used in financing activities was $402.9 million, consisting mainly of $187.5 million related to the partial repayment of the 2022 Term Facility, $171.9 million of share repurchases and $111.3 million of dividend payments, partially offset by $83.5 million of proceeds from employee stock plans.\n51\nTable of Contents\nFree Cash Flow\nWe define free cash flow, a non-GAAP financial measure, as cash provided by operating activities less purchases of property, equipment and leasehold improvements (\"PPE\") and capitalized internal-use software. We believe free cash flow is a liquidity measure that provides useful information to management and investors about the amount of cash generated by the business that, after capital expenditures, can be used for strategic opportunities, including returning value to stockholders, investing in our business, making strategic acquisitions and strengthening the balance sheet. Free cash flow should be considered in addition to, rather than as a substitute for, consolidated net income as a measure of our performance and net cash provided by operating activities as a measure of our liquidity.\nThe following table reconciles our net cash provided by operating activities to free cash flow:\nNine Months Ended\nMay 31,\n(dollar amounts in thousands)\n2025\n2024\n$ Change\nNet cash provided by operating activities\n$\n514,160 \n$\n537,177 \n$\n(23,017)\nLess: purchases of property, equipment, leasehold improvements and capitalized internal-use software \n(74,840)\n(59,722)\n(15,118)\nFree cash flow\n$\n439,320 \n$\n477,455 \n$\n(38,135)\nWe generated free cash flow of $439.3 million during the nine months ended May 31, 2025, a decrease of $38.1 million compared with the same period a year ago. This decrease was driven by a $23.0 million reduction in cash provided by operating activities due to an increase in working capital requirements and higher PPE mainly from capitalized costs related to the development of our internal-use software. The increase in working capital requirements was mainly due to the resolution of a sales tax dispute and timing of client collections.\nOff-Balance Sheet Arrangements\nAs of May 31, 2025 and August 31, 2024, we had no off-balance sheet financing other than letters of credit incurred in the ordinary course of business. Refer to Note 11, \nDebt \nand\n \nNote 12, \nCommitments and Contingencies \nin the Notes to the Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information on our letters of credit.\nAs of May 31, 2025 and August 31, 2024, we also had no other arrangements with unconsolidated entities or financial partnerships (such as entities often referred to as structured finance or special purpose entities) established for purposes of facilitating off-balance sheet financing, other debt arrangements, or other contractually limited purposes.\nForeign Currency Exposure\nAs we operate globally, we are exposed to the risk that our financial condition, results of operations and cash flows could be impacted by changes in foreign currency exchange rates. During the nine months ended May 31, 2025 and May 31, 2024, we maintained a series of foreign currency forward contracts to hedge a portion of our projected operating expenses in our primary currency exposures, namely the British Pound Sterling, Euro, Indian Rupee and Philippine Peso. As of May 31, 2025, the hedge maturity periods of our outstanding foreign currency forward contracts range from the fourth quarter of fiscal 2025 through the third quarter of fiscal 2026.\n52\nTable of Contents\nThe following table summarizes the gross notional value of our foreign currency forward contracts to purchase the respective local currency with U.S. dollars as of May 31, 2025 and August 31, 2024:\nMay 31, 2025\nAugust 31, 2024\n(in thousands)\nLocal Currency Amount\nNotional Contract Amount (USD)\nLocal Currency Amount\nNotional Contract Amount (USD)\nBritish Pound Sterling\n£\n42,800 \n$\n55,079 \n£\n41,200 \n$\n52,372 \nIndian Rupee\nRs\n4,573,733 \n52,700 \nRs\n4,651,351 \n55,200 \nEuro\n€\n36,900 \n40,917 \n€\n43,800 \n48,183 \nPhilippine Peso\n₱\n2,009,542 \n34,900 \n₱\n1,850,674 \n32,400 \nTotal\n$\n183,596 \n$\n188,155 \nRefer to Part I, Item 3. \nQuantitative and Qualitative Disclosures About Market Risk\n of this Quarterly Report on Form 10-Q for more information on our foreign currency exposures. \nCritical Accounting Estimates\nWe prepare the Consolidated Financial Statements in conformity with GAAP, which requires us to make certain estimates and apply judgements that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosures. We base our estimates on historical experience and other assumptions that we believe to be reasonable at the time the Consolidated Financial Statements are prepared and, as such, they may ultimately differ materially from actual results. \nWe describe our significant accounting policies in Note 2, \nSummary of Significant Accounting Policies\n in the Notes to the Consolidated Financial Statements included in Part II, Item 8. of our Annual Report on Form 10-K for the fiscal year ended August 31, 2024. These accounting policies were consistently applied in preparing our Consolidated Financial Statements for the nine months ended May 31, 2025.\nWe disclosed our critical accounting estimates in Part II, Item 7. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations, Critical Accounting Estimates, \nof our Annual Report on Form 10-K for the fiscal year ended August 31, 2024. There were no significant changes in our critical accounting estimates during the nine months ended May 31, 2025.\nNew Accounting Pronouncements\nFor a discussion of accounting pronouncements recently adopted and those issued but not yet adopted, refer to Note 2, \nSummary of Significant Accounting Policies\n, in the Notes to the Consolidated Financial Statements included in Part I, Item 1. of this Quarterly Report on Form 10-Q, which we include herein by reference."
}