{
  "source_file": "fdx-20250831.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF RESULTS OF OPERATIONS AND FINANCIAL CONDITION\nGENERAL\nThe following Management’s Discussion and Analysis of Results of Operations and Financial Condition (“MD&A”) describes the principal factors affecting the results of operations, liquidity, capital resources, and critical accounting estimates of FedEx Corporation (“FedEx”). This discussion should be read in conjunction with the accompanying quarterly unaudited condensed consolidated financial statements and our Annual Report on Form 10-K for the year ended May 31, 2025 (“Annual Report”). Our Annual Report includes additional information about our significant accounting policies, practices, and the transactions that underlie our financial results, as well as a detailed discussion of the most significant risks and uncertainties associated with our financial condition and operating results.\nWe provide a broad portfolio of transportation, e-commerce, and business services, offering integrated business solutions utilizing our flexible, efficient, and intelligent global network. Our primary operating companies are Federal Express Corporation (“Federal Express”), the world’s largest express transportation company and a leading North American provider of small-package ground delivery services, and FedEx Freight, Inc. (“FedEx Freight”), a leading North American provider of less-than-truckload (“LTL”) freight transportation services. \nSee “Reportable Segments” for further discussion. Additional information on our businesses can be found in our Annual Report.\nFollowing our one FedEx consolidation\n, Federal Express operates a unified, fully integrated air-ground express network under the respected FedEx brand. FedEx Freight provides LTL freight transportation services as a separate subsidiary. Federal Express and FedEx Freight represent our major service lines and constitute our reportable segments.\nIn December 2024, we announced that FedEx’s Board of Directors decided to pursue a full separation of FedEx Freight throu\ngh the capital markets, creating a new publicly traded company. The transaction, which will be implemented through the spin-off of shares of the new company to FedEx stockholders, is expected to be tax-free for U.S. federal income tax purposes for FedEx stockholders and be completed by June 2026.\nIn January 2025, the Board of Directors approved a change in FedEx’s fiscal year end from May 31 to December 31. The planned fiscal year change is expected to be effective June 1, 2026.\nExcept as otherwise specified, references to years indicate our fiscal year ending May 31, 2026 or ended May 31 of the year referenced, and comparisons are to the corresponding period of the prior year. References to our transportation segments include, collectively, the Federal Express segment and the FedEx Freight segment.\nThe key indicators necessary to understand our operating results include:\n•\nthe overall customer demand for our various services based on macroeconomic factors and the global economy;\n•\nthe volumes of transportation services provided through our networks, primarily measured by our average daily volume and shipment weight and size;\n•\nthe mix of services purchased by our customers;\n•\nthe prices we obtain for our services, primarily measured by yield (revenue per package or pound, revenue per shipment, or hundredweight for LTL freight shipments);\n•\nour ability to manage our cost structure (capital expenditures and operating expenses) to match shifting volume levels; and\n•\nthe timing and amount of fluctuations in fuel prices and our ability to recover incremental fuel costs through our fuel surcharges.\nTrends Affecting Our Business\nThe following trends significantly affect the indicators discussed above, as well as our business and operating results. See the risk factors identified under Part I, Item 1A. “Risk Factors” in our Annual Report, as updated by our quarterly reports on Form 10-Q, for more information. Additionally, see “\nResults of Operations\n – Consolidated Results – Business Optimization Costs and – Outlook” and “\nFinancial Condition – Liquidity Outlook\n” below for additional information on efforts we are taking to mitigate adverse trends.\nMacroeconomic Conditions\nWhile macroeconomic risks apply to most companies, we are particularly vulnerable. The transportation industry is highly cyclical and especially susceptible to trends in economic activity. Our primary business is to transport goods, so our business levels are directly tied to the purchase and production of goods and the rate of global trade growth. The decline in U.S. imports of consumer goods that \n-22-\nTable of Contents\nstarted in late 2022, along with slowed global industrial production, has contributed to weakened business conditions for the transportation industry. Consequently, this environment has led to lower shipments at FedEx Freight, negatively affecting our results in the first quarter of 2026. \nAdditionally, since the third quarter of 2025 there have been significant changes within the global trade environment, such as the August 2025 removal of the de minimis exemption for goods imported into the U.S. from countries other than China. The uncertain and evolving global trade environment has contributed to lower international export package volumes, negatively affecting our results in the first quarter of 2026. Continued uncertainty and volatility in the global trade environment could lead to further weakened business conditions for the transportation industry.\nInflation and Interest Rates\nDuring the first quarter of 2026, global inflation moderated year-over-year but continued to be elevated. Additionally, global interest rates remained steady in an effort to curb inflation. We are experiencing pressure on demand for our transportation services, particularly our priority services, as stagnant inflation and interest rates continue to negatively affect consumer and business spending. We expect inflation and elevated interest rates to continue to negatively affect our results of operations for the remainder of 2026. The changes in trade policy discussed above under “Macroeconomic Conditions” could also exacerbate global inflation.\nFuel\nWe must purchase large quantities of fuel to operate our aircraft and vehicles, and the price and availability of fuel is beyond our control and can be highly volatile. The timing and amount of fluctuations in fuel prices and our ability to recover incremental fuel costs through our fuel surcharges can significantly affect our operating results either positively or negatively in the short-term. During the first quarter of 2026, lower fuel prices negatively affected yields due to lower fuel surcharges and led to reduced fuel expense at both of our transportation segments.\nGeopolitical Conflicts\nGiven the nature of our business and global operations, geopolitical conflicts may adversely affect our business and results of operations. While we do not expect ongoing geopolitical conflicts between Russia and Ukraine and in the Middle East, or escalations thereof, to have a direct material effect on our business or results of operations, the broader consequences are adversely affecting the global economy and may also have the effect of heightening other risks disclosed under \nPart I, Item 1A. “Risk Factors.”\nRESULTS OF OPERATIONS\nMany of our operating expenses are directly affected by revenue and volume levels, and we expect these operating expenses to fluctuate on a year-over-year basis consistent with changes in revenue and volumes. Therefore, the discussion of operating expense captions focuses on the key drivers and trends affecting expenses other than those factors strictly related to changes in revenue and volumes. The line item “Other” includes costs associated with outside service contracts (such as information technology services, temporary labor, security, and facilities services), insurance, professional fees, and credit losses.\n-23-\nTable of Contents\nCONSOLIDATED RESULTS\nThe following tables compare summary operating results and changes in revenue and operating income (loss) (dollars in millions, except per share amounts) for the periods ended August 31, 2025 and 2024:\nThree Months Ended\nPercent\n2025\n2024\nChange\nRevenue\n$\n22,244 \n$\n21,579 \n3 \nOperating income (loss):\nFederal Express segment\n1,138 \n953 \n19 \nFedEx Freight segment\n360 \n439 \n(18)\nCorporate, other, and eliminations\n(312)\n(312)\n— \nConsolidated operating income\n1,186 \n1,080 \n10 \nOperating margin:\nFederal Express segment\n6.0 \n%\n5.2 \n%\n80 \n bp\nFedEx Freight segment\n16.0 \n%\n18.8 \n%\n(280)\n bp\nConsolidated operating margin\n5.3 \n%\n5.0 \n%\n30 \n bp\nConsolidated net income\n$\n824 \n$\n794 \n4 \nDiluted earnings per share\n$\n3.46 \n$\n3.21 \n8 \nYear-over-Year Changes\nRevenue\nOperating Income (Loss)\nFederal Express segment\n$\n811 \n$\n185 \nFedEx Freight segment\n(72)\n(79)\nCorporate, other, and eliminations\n(74)\n— \n$\n665 \n$\n106 \nOverview\nOperating income increased 10% in the first quarter of 2026 primarily due to improved yields for our U.S. domestic and international priority package services, structural cost reductions from business optimization initiatives, including from DRIVE initiatives commenced in prior years, and higher U.S. domestic package demand at Federal Express. Operating income for the first quarter of 2026 was negatively affected by increased operating expenses, decreased yields for our international economy package services, lower international package export volume reflecting the negative impacts from the volatile global trade environment, the expiration of our contract with the U.S. Postal Service (“USPS”) on September 29, 2024, and lower revenue at FedEx Freight primarily due to macroeconomic conditions.\nOperating income includes business optimization costs of $67 million ($52 million, net of tax, or $0.22 per diluted share) in the first quarter of 2026 related to initiatives to reduce structural and overhead costs and to drive efficiency through Network 2.0. We incurred business optimization costs of $128 million ($98 million, net of tax, or $0.39 per diluted share) in the first quarter of 2025 related to our transformation initiatives. See the “Business Optimization Costs” section of this MD&A for more information.\nWe incurred costs related to the planned spin-off of FedEx Freight of $43 million ($33 million, net of tax, or $0.14 per diluted share) in the \nfirst quarter of 2026. \nThese costs consist of $41 million primarily related to professional services included in the “Separation and other costs” caption of the accompanying unaudited condensed consolidated statements of income, and $2 million included in the “Other, net” caption of the accompanying unaudited condensed consolidated statements of income. These costs are included in Corporate, other, and eliminations; FedEx Freight; and Federal Express. We did not incur any FedEx Freight spin-off costs in the \nfirst quarter \nof 2025.\nWe repurchased $500 million of our common stock in the first quarter of 2026 through open market transactions. Share repurchases had a benefit of $0.02 per diluted share for the first quarter of 2026. As of \nAugust 31, 2025\n, $1.6 billion re\nmained a\nvailable to be used for repurchases under the 2024 stock repurchase program. See \nNote \n1\n of the accompanying unaudited condensed consolidated financial statements, “Financial Condition – \nLiquidity\n and – \nLiquidity Outlook\n” below, and \nPart II, Item 2. “Unregistered Sales of Equity Securities and Use of Proceeds”\n of this Form 10-Q for additional information.\n-24-\nTable of Contents\nThe following graphs for Federal Express and FedEx Freight show selected volume trends (in thousands)\n calculated on a 5-day-per-week basis\n over the five most recent quarters:\n(1)\nInternational domestic average daily package volume relates to our international intra-country operations. International export average daily package volume relates to our international priority and economy services. \n(2)\nInternational average daily freight pounds relate to our international priority and economy services. \n-25-\nTable of Contents\nThe following graphs for Federal Express and FedEx Freight show selected yield trends over the five most recent quarters: \n(1)\nInternational export revenue per package relates to our international priority and economy services. International domestic revenue per package relates to our international intra-country operations.\n(2)\nInternational freight revenue per pound relates to our international priority and economy services. \n-26-\nTable of Contents\nRevenue\nRevenue increased 3% in the first quarter of 2026 primarily due to base yield improvements, higher volume, and favorable exchange rates at Federal Express, partially offset by the expiration of our contract with the USPS, lower fuel surcharges, and lower shipments and base yields at FedEx Freight.\nFederal Express segment revenue increased 4% in the first quarter of 2026 primarily due to improved base yields, increased U.S. domestic and international economy package volumes, and favorable exchange rates, partially offset by the expiration of our contract with the USPS, lower international priority package volume including the negative impacts from global trade policies, and lower fuel surcharges. FedEx Freight revenue decreased 3% in the first quarter of 2026 primarily due to due to lower volume and lower base yields. Revenue at Corporate, other, and eliminations decreased in the first quarter of 2026 primarily due to lower yields and demand at FedEx Logistics, Inc. (“FedEx Logistics”).\nOperating Expenses\nThe following table compares operating expenses expressed as dollar amounts (in millions) and as a percent of revenue for the periods ended August 31, 2025 and August 31, 2024:\nThree Months Ended\nPercent\n2025\n2024\nChange\nOperating expenses:\nSalaries and employee benefits\n$\n8,062 \n$\n7,785 \n4 \n    \nPurchased transportation\n5,488 \n5,275 \n4 \nRentals and landing fees\n1,192 \n1,161 \n3 \nDepreciation and amortization\n1,092 \n1,078 \n1 \nFuel\n873 \n1,075 \n(19)\nMaintenance and repairs\n843 \n829 \n2 \nSeparation and other costs\n45 \n— \nNM\nBusiness optimization costs\n67 \n128 \n(48)\nOther\n3,396 \n3,168 \n7 \nTotal operating expenses\n21,058 \n20,499 \n3 \nOperating income\n$\n1,186 \n$\n1,080 \n10 \nPercent of Revenue\nThree Months Ended\n2025\n2024\nOperating expenses:\nSalaries and employee benefits\n36.2 \n%\n36.1 \n%\nPurchased transportation\n24.7 \n24.4 \nRentals and landing fees\n5.4 \n5.4 \nDepreciation and amortization\n4.9 \n5.0 \nFuel\n3.9 \n5.0 \nMaintenance and repairs\n3.8 \n3.8 \nSeparation and other costs\n0.2 \n— \nBusiness optimization costs\n0.3 \n0.6 \nOther\n15.3 \n14.7 \nTotal operating expenses\n94.7 \n95.0 \nOperating margin\n5.3 \n%\n5.0 \n%\nOperating income increased 10% in the first quarter of 2026 primarily due to improved yields for our U.S. domestic and international priority package services, structural cost reductions from business optimization initiatives, including from DRIVE initiatives commenced in prior years, and increased U.S. domestic package demand for Federal Express. Operating income for the first quarter of 2026 was negatively affected by increased operating expenses, decreased yields for our international economy package services, lower international package volume including the negative impacts from global trade policies, the expiration of our contract with the USPS, and lower revenue at FedEx Freight primarily due to macroeconomic conditions.\n-27-\nTable of Contents\nSalaries and employee benefits expense increased 4% in the first quarter of 2026 primarily due to an increase in wage rates, unfavorable exchange rates, and higher employee benefits, partially offset by lower variable incentive compensation. Purchased transportation expense increased 4% in the first quarter of 2026 primarily due to higher rates and volume. Other operating expenses increased 7% in the first quarter of 2026 primarily due to higher professional fees, credit losses, and self-insurance accruals. Fuel expense decreased 19% in the first quarter of 2026 due to lower fuel prices and the expiration of our contract with the USPS.\nBusiness Optimization Costs\nOur business optimization costs related to transformation initiatives aimed to improve long-term profitability, drive efficiency within and between our transportation segments, lower our overhead and support costs, and transform our digital capabilities. Costs included in the “Business optimization costs” caption of the accompanying unaudited condensed consolidated statements of income relate to our Network 2.0 program, the Europe workforce reduction plan, and other DRIVE initiatives commenced in prior years. \nWe incurred business optimization costs of $67 million ($52 million, net of tax, or $0.22 per diluted share) in the first quarter of 2026, and $128 million ($98 million, net of tax, or $0.39 per diluted share) in the first quarter of 2025. These costs were primarily related to professional services and severance and are included in Corporate, other, and eliminations and Federal Express.\nNetwork 2.0\nNetwork 2.0 is our multi-year effort to improve the efficiency with which FedEx picks up, transports, and delivers packages in the U.S. and Canada. Through Network 2.0, we continue to consolidate our sortation facilities and equipment, reduce pickup-and-delivery routes, and optimize our enterprise linehaul network by moving beyond discrete collaboration to an end-to-end optimized network. We have implemented Network 2.0 optimization in approximately 360 locations in the U.S and Canada as of August 31, 2025. Service providers will handle the pickup and delivery of Federal Express packages in some locations while employee couriers will handle others. We completed Canada’s implementation of Network 2.0 in the fourth quarter of 2025 and expect to complete the U.S. implementation by the end of calendar 2027.\nEurope workforce reduction plan\nOur workforce reduction plan in Europe to reduce structural costs continues and is expected to impact approximately 1,400 employees across back-office and commercial functions. The execution of the plan is subject to a consultation process that is expected to occur over an 18-month period in accordance with local country processes and regulations. We expect savings from the plan to be approximately $150 million on an annualized basis beginning in calendar 2026. \nWe expect the pre-tax cost of the severance benefits and legal and professional fees to be provided under and related to the plan to be approximately $250 million in cash expenditures. These charges are expected to be incurred through fiscal year 2026 and will be classified as business optimization expenses. In the first quarter of 2026, we incurred $3 million of costs related to this plan. The timing and amount of our business optimization expenses and the related cost savings from the workforce reduction plan may change as we revise and implement our plans. \nSeparation and Other Costs\nFedEx Freight separation\nWe incurred costs related to the planned spin-off of FedEx Freight of $43 million ($33 million, net of tax, or $0.14 per diluted share) in the first quarter of 2026. These costs consist of $41 million primarily related to professional services included in the “Separation and other costs” caption of the accompanying unaudited condensed consolidated statements of income, and $2 million included in the “Other, net” caption of the accompanying unaudited condensed consolidated statements of income. These costs are included in Corporate, other, and eliminations; FedEx Freight; and Federal Express. We did not incur any FedEx Freight spin-off costs in the first quarter of 2025.\nFiscal year change\nWe incurred costs related to the fiscal year change of $4 million ($3 million, net of tax, or $0.01 per diluted share) in the first quarter of 2026. These costs were primarily related to professional fees and are included in Federal Express. We did not incur any fiscal year change costs in the first quarter of 2025.\nIncome Taxes\nOur effective tax rate was 27.3% for the first quarter of 2026 compared to 24.8% for the first quarter of 2025. The first quarter 2026 tax rate was unfavorably impacted by a non-recurring income tax expense of $16 million ($0.07 per diluted share) primarily as the result of an examination of prior year tax return filings. \n-28-\nTable of Contents\nOn July 4, 2025, the One Big Beautiful Bill Act was signed into law. Certain provisions within the act are interdependent and have implications for both the effective tax rate and cash taxes. We are currently in the process of evaluating these provisions. \nWe are subject to taxation in the U.S. and various U.S. state, local, and foreign jurisdictions. We are currently under examination by the Internal Revenue Service for the 2016 through 2021 tax years. It is reasonably possible that certain income tax return proceedings will be completed during the next 12 months and could result in a change in our balance of unrecognized tax benefits. However, we believe we have recorded adequate amounts of tax, including interest and penalties, for any adjustments expected to occur. \nDuring 2021, we filed suit in U.S. District Court for the Western District of Tennessee challenging the validity of a tax regulation related to the one-time transition tax on unrepatriated foreign earnings, which was enacted as part of the Tax Cuts and Jobs Act (“TCJA”). Our lawsuit sought to have the court declare this regulation invalid and order the refund of overpayments of U.S. federal income taxes for 2018 and 2019 attributable to the denial of foreign tax credits under the regulation. We have recorded a cumulative benefit of $249 million attributable to our interpretation of the TCJA and the Internal Revenue Code. In March 2023, the District Court ruled that the regulation is invalid and contradicts the plain terms of the tax code. On February 13, 2025, the District Court ruled again in our favor with regard to a new argument raised by the U.S. government. On June 4, 2025, the District Court validated the amount of refunds owed for 2018 and 2019, which includes the foreign tax credits previously denied. On August 1, 2025, the U.S. government filed a notice to appeal the decision to the U.S. Court of Appeals for the Sixth Circuit. If we are ultimately unsuccessful in defending our position, we may be required to reverse the benefit previously recorded.\nOutlook\nThe uncertainty over the current trade and geopolitical environment and the impact it may continue to have on customer demand and shipping patterns globally makes expectations for our 2026 operating and financial performance inherently less clear. However, based on the current trends, we expect the industrial economy to continue pressuring demand for our higher-yielding business-to-business services in the near term, and service mix to continue shifting further toward deferred service offerings. We also expect the global trade environment to continue pressuring demand for our services, both internationally and in the U.S. \nTo mitigate demand challenges, we will continue to execute on our revenue quality strategy through surcharge management and optimizing our customer and service mix and alignment of our cost base with demand. We will also continue our focus on business optimization, where we expect to see an incremental $1.0 billion in structural cost reduction benefits from DRIVE and Network 2.0 in 2026.\nSee the “Business Optimization Costs” section of this MD&A for additional information on our transformation initiatives, including our Network 2.0 program and workforce reduction plan in Europe.\nOur capital expenditures for 2026 are expected to be approximately $4.5 billion, $0.4 billion higher than 2025. The increase is driven by investment in Network 2.0 initiatives and other efforts to modernize our facilities and package handling equipment in the U.S. and international locations. Aircraft spend is expected to decline to approximately $1.0 billion, $0.3 billion lower than 2025.\nWe will continue to evaluate our investments in critical long-term strategic projects to ensure our capital expenditures are expected to generate high returns on investment and are balanced with our outlook for global economic conditions. For additional details on key \n2026\n capital projects, refer to the \n“Financial Condition – Capital Resources”\n and \n“Financial Condition – Liquidity Outlook”\n sections of this MD&A.\nIn December 2024, we announced that FedEx’s management and Board of Directors had decided to pursue a full separation of FedEx Freight through the capital markets, creating a new publicly traded company. The separation is expected to be executed by June 2026.\nThe uncertainty of a slowdown in the global economy, global inflation, geopolitical challenges, developments in international trade, and the effects these factors will have on the rate of growth of global trade, supply chains, fuel prices, and our business in particular, make any expectations for the remainder of 2026 inherently less certain. See Part I “Item 1A. Risk Factors” in our Annual Report for more information.\nSee the \n“Trends Affecting Our Business,”\n \n“Critical Accounting Estimates,”\n and \n“Forward-Looking Statements”\n sections of this MD&A for additional information.\nRECENT ACCOUNTING GUIDANCE\nSee \nNote \n1\n of the accompanying unaudited condensed consolidated financial statements for a discussion of recent accounting guidance. \n-29-\nTable of Contents\nREPORTABLE SEGMENTS\nFederal Express and FedEx Freight represent our major service lines and constitute our reportable segments. Our reportable segments include the following businesses:\nFederal Express Segment\nFederal Express (express transportation, small-package ground delivery, and freight transportation)\nFedEx Freight Segment\nFedEx Freight (LTL freight transportation)\nFedEx Custom Critical, Inc. (time-critical transportation)\nThe Federal Express segment operates combined sales, marketing, administrative, and information-technology functions in shared service operations for U.S. customers of our major business units and certain back-office support to FedEx Freight and our other operating segments which allows us to obtain synergies from the combination of these functions. We allocate the net operating costs of these services to reflect the full cost of operating our businesses in the results of those segments. We review and evaluate the performance of FedEx Freight and our other operating segments based on operating income inclusive of these allocations.\nOperating expenses for our FedEx Freight segment include allocations of these services from the Federal Express segment. These allocations also include charges and credits for administrative services provided between operating companies. The allocations of net operating costs are based on metrics such as relative revenue or estimated services provided. We believe these allocations approximate the net cost of providing these functions. Our allocation methodologies are refined periodically, as necessary, to reflect changes in our businesses.\nCORPORATE, OTHER, AND ELIMINATIONS\nCorporate and other includes corporate headquarters costs for executive officers and certain legal and finance functions, certain other costs and credits not attributed to our core business, and certain costs associated with developing integrated business solutions through our FedEx Dataworks, Inc. (“FedEx Dataworks”) operating segment. FedEx Dataworks is focused on creating solutions to transform the digital and physical experiences of our customers and team members.\nAlso included in Corporate and other are the FedEx Office and Print Services, Inc. (“FedEx Office”) operating segment, which provides an array of document and business services and retail access to our customers for our package transportation businesses, and the FedEx Logistics operating segment, which provides integrated supply chain management solutions, specialty transportation, customs brokerage, and global ocean and air freight forwarding.\nThe results of Corporate, other, and eliminations are not allocated to the other business segments.\nOperating results in Corporate, other, and eliminations were flat in the first quarter of 2026 primarily due to decreased purchased transportation costs at FedEx Logistics, offset by higher professional fees at corporate headquarters and FedEx Dataworks in the first quarter of 2026.\nCertain FedEx operating companies provide transportation and related services for other FedEx companies outside their reportable segment in order to optimize our resources. For example, during the \nfirst quarter of \n2026 FedEx Freight provided road and intermodal support for \nFederal Express\n. In addition, \nFederal Express\n works with FedEx Logistics to secure air charters and other cargo space for U.S. customers. Billings for such services are based on negotiated rates and are reflected as revenue of the billing segment. These rates are adjusted from time to time based on market conditions. Such intersegment revenue and expenses are eliminated in our consolidated results and are not separately identified in the following segment information because the amounts are not material.\n-30-\nTable of Contents\nFEDERAL EXPRESS SEGMENT\nFederal Express offers a wide range of U.S. domestic and international shipping services for delivery of packages and freight including priority, deferred, and economy services, which provide delivery on a time-definite or day-definite basis. The following table compares revenue, operating expenses, operating income (dollars in millions), operating margin, and operating expenses as a percent of revenue for the periods ended August 31, 2025 and 2024:\nThree Months Ended\nPercent\n2025\n2024\nChange\nRevenue:\nPackage:\nU.S. priority\n$\n2,767\n$\n2,591\n7 \nU.S. deferred\n1,273\n1,151\n11 \nU.S. ground\n8,654\n8,056\n7 \nTotal U.S. domestic package revenue\n12,694\n11,798\n8 \nInternational priority\n2,258\n2,206\n2 \nInternational economy\n1,354\n1,360\n— \nTotal international export package revenue\n3,612\n3,566\n1 \nInternational domestic\n(1)\n1,135\n1,112\n2 \nTotal package revenue\n17,441\n16,476\n6 \nFreight:\nU.S.\n303\n569\n(47)\nInternational priority\n595\n526\n13 \nInternational economy\n528\n463\n14 \nTotal freight revenue\n1,426\n1,558\n(8)\nOther\n249\n271\n(8)\nTotal revenue\n19,116\n18,305\n4 \nOperating expenses:\nSalaries and employee benefits\n6,516\n6,201\n5 \nPurchased transportation\n5,073\n4,801\n6 \nRentals and landing fees\n1,013\n986\n3 \nDepreciation and amortization\n954\n935\n2 \nFuel\n760\n954\n(20)\nMaintenance and repairs\n737\n719\n3 \nSeparation and other costs\n5\n—\nNM\nBusiness optimization costs\n21\n43\n(51)\nIntercompany allocations\n(233)\n(187)\n25 \nOther\n3,132\n2,900\n8 \nTotal operating expenses\n17,978\n17,352\n4 \nOperating income\n$\n1,138\n$\n953\n19 \nOperating margin\n6.0 \n%\n5.2 \n%\n80 \nbp\n(1)\nInternational domestic revenue relates to our international intra-country operations.\n-31-\nTable of Contents\nPercent of Revenue\nThree Months Ended\n2025\n2024\nOperating expenses:\nSalaries and employee benefits\n34.1 \n%\n33.9 \n%\nPurchased transportation\n26.4 \n26.2 \nRentals and landing fees\n5.3 \n5.4 \nDepreciation and amortization\n5.0 \n5.1 \nFuel\n4.0 \n5.2 \nMaintenance and repairs\n3.9 \n3.9 \nSeparation and other costs\n— \n— \nBusiness optimization costs\n0.1 \n0.2 \nIntercompany allocations\n(1.2)\n(1.0)\nOther\n16.4 \n15.9 \nTotal operating expenses\n94.0 \n94.8 \nOperating margin\n6.0 \n%\n5.2 \n%\n-32-\nTable of Contents\nThe following table compares selected statistics (in thousands, except yield amounts) for the periods ended August 31, 2025 and 2024:\nThree Months Ended\nPercent\n2025\n2024\nChange\nPackage Statistics\nAverage daily package volume (ADV)\n(1)\n:\nU.S. priority\n1,654 \n1,600 \n3 \n   \nU.S. deferred\n1,061 \n968 \n10 \nU.S. ground commercial\n4,290 \n4,289 \n— \nU.S. ground home delivery/economy\n6,915 \n6,438 \n7 \nTotal U.S. domestic ADV\n13,920 \n13,295 \n5 \nInternational priority\n562 \n622 \n(10)\nInternational economy\n518 \n491 \n5 \nTotal international export ADV\n1,080 \n1,113 \n(3)\nInternational domestic\n(2)\n1,806 \n1,823 \n(1)\nTotal ADV\n16,806 \n16,231 \n4 \nRevenue per package (yield):\nU.S. priority\n$\n26.13 \n$\n25.30 \n3 \nU.S. deferred\n18.76 \n18.59 \n1 \nU.S. ground\n12.07 \n11.73 \n3 \nU.S. domestic composite\n14.25 \n13.87 \n3 \nInternational priority\n62.77 \n55.37 \n13 \nInternational economy\n40.87 \n43.33 \n(6)\nInternational export composite\n52.27 \n50.06 \n4 \nInternational domestic\n(2)\n9.81 \n9.53 \n3 \nComposite package yield\n16.22 \n15.86 \n2 \nFreight Statistics\nAverage daily freight pounds:\nU.S.\n2,165 \n5,319 \n(59)\nInternational priority\n4,647 \n4,465 \n4 \nInternational economy\n11,222 \n10,706 \n5 \nTotal average daily freight pounds\n18,034 \n20,490 \n(12)\nRevenue per pound (yield):\nU.S.\n$\n2.18 \n$\n1.67 \n31 \nInternational priority\n2.00 \n1.84 \n9 \nInternational economy\n0.74 \n0.68 \n9 \nComposite freight yield\n1.24 \n1.19 \n4 \n(1)\nADV is calculated on a 5-day-per-week basis.\n(2)\nInternational domestic statistics relate to our international intra-country operations.\n-33-\nTable of Contents\nFederal Express Segment Revenue\nFederal Express segment revenue increased 4% in the first quarter of 2026 primarily due to improved base yields, increased U.S. domestic and international economy package volumes, and favorable exchange rates, partially offset by the expiration of our contract with the USPS, lower international priority package volume including the negative impacts from global trade policies, and lower fuel surcharges.\nVolume:\nU.S. domestic package volume increased 5% primarily due to strong demand for our U.S. economy package services. Growth in our international economy package volume of 5% in the first quarter of 2026 was more than offset by a 10% decline in international priority package volume reflecting the negative impact of global trade policies. U.S. average daily freight pounds decreased 59% in the first quarter of 2026 primarily due to the expiration of our contract with the USPS. \nYield\nU.S. domestic composite package yield increased 3% in the first quarter of 2026 primarily due to improved base yields, partially offset by decreased fuel surcharges. International priority package yield increased by 13% due to increased base yields and favorable exchange rates, partially offset by decreased fuel surcharges. International economy package yields decreased 6% due to decreased base yields, partially offset by favorable exchange rates.\nFederal Express Segment Operating Income\nFederal Express segment operating income increased 19% in the first quarter of 2026 due to higher U.S. domestic and international priority package yields, structural cost reductions from business optimization initiatives, including from DRIVE initiatives commenced in prior years, and higher U.S. domestic package demand, partially offset by increased operating expenses and the expiration of our contract with the USPS. The increase in operating expenses in the first quarter of 2026 was primarily driven by higher wage and purchased transportation rates and higher credit losses. \nSalaries and employee benefits expense increased 5% in the first quarter of 2026 primarily due to higher wage rates, unfavorable exchange rates, increased volume, and higher employee benefits. Purchased transportation expense increased 6% in the first quarter of 2026 primarily due to higher rates, increased volume, and unfavorable exchange rates, partially offset by increased efficiency. Other operating expense increased 8% in the first quarter of 2026 primarily due to higher credit losses and self-insurance accruals. Fuel expense decreased 20% in the first quarter of 2026 due to lower fuel prices and the expiration of the USPS contract.\nFederal Express segment results include business optimization costs of $21 million and $43 million in the first quarter of 2026 and 2025, respectively. In the first quarter of 2026, Federal Express segment results include $4 million of costs associated with our planned fiscal year change and $1 million of costs associated with the planned spin-off of FedEx Freight. Federal Express did not incur costs related to the fiscal year change or FedEx Freight spin-off in 2025. See the “Business Optimization Costs” and “Separation and Other Costs” sections of this MD&A for more information.\nIn July 2023, Federal Express’s pilots failed to ratify the tentative successor agreement that was approved by the Air Line Pilots Association, International’s FedEx Master Executive Council in the prior month. Negotiations have continued, and the ongoing bargaining process has no effect on our operations. See \nNote \n1\n of the accompanying unaudited condensed consolidated financial statements for additional information.\n-34-\nTable of Contents\nFEDEX FREIGHT SEGMENT\nFedEx Freight LTL service offerings include priority services when speed is critical and economy services when time can be traded for savings. The following table compares revenue, operating expenses, operating income (dollars in millions), operating margin, selected statistics, and operating expenses as a percent of revenue for the periods ended August 31, 2025 and 2024:\nThree Months Ended\nPercent\n2025\n2024\nChange\nRevenue\n$\n2,257\n$\n2,329\n(3)\nOperating expenses:\nSalaries and employee benefits\n975\n984\n(1)\nPurchased transportation\n201\n203\n(1)\nRentals\n74\n71\n4 \nDepreciation and amortization\n110\n110\n— \nFuel\n113\n121\n(7)\nMaintenance and repairs\n81\n82\n(1)\nSeparation and other costs\n9\n—\nNM\nIntercompany charges\n162\n148\n9 \nOther\n172\n171\n1 \nTotal operating expenses\n1,897\n1,890\n— \nOperating income\n$\n360\n$\n439\n(18)\nOperating margin\n16.0 \n%\n18.8 \n%\n(280)\n bp\nAverage daily shipments (in thousands):\nPriority\n62.0 \n62.9 \n(1)\nEconomy\n28.0 \n29.1 \n(4)\nTotal average daily shipments\n90.0 \n92.0 \n(2)\nWeight per shipment (lbs):\nPriority\n933 \n956 \n(2)\nEconomy\n907 \n868 \n4 \nComposite weight per shipment\n925 \n928 \n— \nRevenue per shipment:\nPriority\n$\n359.54 \n$\n363.97 \n(1)\nEconomy\n408.05 \n408.60 \n— \nComposite revenue per shipment\n$\n374.62 \n$\n378.09 \n(1)\nRevenue per hundredweight:\nPriority\n$\n38.54 \n$\n38.06 \n1 \nEconomy\n44.98 \n47.09 \n(4)\nComposite revenue per hundredweight\n$\n40.50 \n$\n40.73 \n(1)\n-35-\nTable of Contents\nPercent of Revenue\nThree Months Ended\n2025\n2024\nOperating expenses:\nSalaries and employee benefits\n43.2 \n%\n42.3 \n%\nPurchased transportation\n8.9 \n8.7 \nRentals\n3.3 \n3.1 \nDepreciation and amortization\n4.9 \n4.7 \nFuel\n5.0 \n5.2 \nMaintenance and repairs\n3.5 \n3.5 \nSeparation and other costs\n0.4 \n— \nIntercompany charges\n7.2 \n6.4 \nOther\n7.6 \n7.3 \nTotal operating expenses\n84.0 \n81.2 \nOperating margin\n16.0 \n%\n18.8 \n%\nFedEx Freight Segment Revenue\nFedEx Freight segment revenue decreased 3% in the first quarter of 2026 primarily due to lower volume and lower base yields.\nAverage daily shipments decreased 2% in the first quarter of 2026 due to reduced demand for our services, primarily resulting from macroeconomic conditions. Revenue per shipment decreased 1% in the first quarter of 2026 primarily due to lower base yields, including weight per shipment, and fuel surcharges.\nFedEx Freight\n Segment Operating Income\nFedEx Freight segment operating income decreased 18% in the first quarter of 2026 primarily due to the decline in revenue and increase in intercompany charges and wage rates.\nIntercompany charges increased 9% in the first quarter of 2026 primarily due to increased sales staffing to prepare for the planned spin-off of FedEx Freight. Fuel expense decreased 7% in the first quarter of 2026 due to fewer shipments and a decrease in fuel price. Salaries and employee benefits expense decreased 1% in the first quarter of 2026 primarily due to lower volume, partially offset by higher wage rates.\nFedEx Freight segment results include costs associated with our planned spin-off of FedEx Freight of $9 million in the first quarter of 2026. FedEx Freight did not incur costs related to the FedEx Freight spin-off in 2025. See the “Separation and Other Costs” section of this MD&A for more information.\n-36-\nTable of Contents\nFINANCIAL CONDITION\nLIQUIDITY\nCash and cash equivalents totaled $6.2 billion\n at\n August 31, 2025, compared to $5.5 billion at May 31, 2025. The following table provides a summary of our cash flows for the three-month periods ended August 31, 2025 and 2024 (in millions):\n2025\n2024\nOperating activities:\nNet income\n$\n824 \n$\n794 \nBusiness optimization costs, net of payments\n(110)\n(69)\nOther noncash charges and credits\n2,112 \n2,072 \nChanges in assets and liabilities\n(1,110)\n(1,610)\nCash provided by operating activities\n1,716 \n1,187 \nInvesting activities:\nCapital expenditures\n(623)\n(767)\nPurchase of investments\n(34)\n(61)\nProceeds from sale of investments\n30 \n13 \nProceeds from asset dispositions, and other investing activities, net\n8 \n13 \nCash used in investing activities\n(619)\n(802)\nFinancing activities:\nProceeds from debt issuances\n997 \n— \nPrincipal payments on debt\n(625)\n(34)\nProceeds from stock issuances\n18 \n404 \nDividends paid\n(345)\n(339)\nPurchases of common stock\n(500)\n(1,000)\nOther\n(5)\n— \nCash used in financing activities\n(460)\n(969)\nEffect of exchange rate changes on cash\n27 \n26 \nNet increase (decrease) in cash and cash equivalents\n664 \n(558)\nCash and cash equivalents at the end of period\n$\n6,166 \n$\n5,943 \nCash Provided by Operating Activities. \nCash flows from operating activitie\ns in\ncreased $0.5 billion\n \nin the first quarter of \n2026\n primarily due to working capital changes driven by an increase in accrued income taxes, professional fees, variable incentive compensation, and self-insurance. \nCash Used in Investing Activities. \nCapital expenditures decreased during the first quarter of \n2026\n primarily due to decreased spending on aircraft and related equipment, vehicles and trailers, and information and technology investments. See “\nCapital Resources\n” for a discussion of capital expenditures during \n2026\n.\nCash Used in Financing Activities. \nCash used in financing activities decreased $0.5 billion in the first quarter of \n2026\n primarily due to the repurchase of $500 million o\nf our common stock through\n open market transactions d\nuring the \nfirst quarter\n of 2026,\n a decrease of $500 million compared to the first quarter of 2025. Additionally, we issued €850 million of senior unsecured debt in July 2025 and used a portion of the net proceeds to repay the €500 million aggregate principal amount outstanding of our 0.45% notes at maturity in August 2025. See\n \nNote \n1\n and \nNot\ne 4\n of the accompanying unaudited condensed consolidated financial statements, “\nLiquidity Outlook\n” below, and \nPart II, Item 2. “Unregistered Sales of Equity Securities and Use of Proceeds”\n for additional information.\nCAPITAL RESOURCES\nOur operations are capital intensive, characterized by significant investments in aircraft, package handling and sort equipment, technology, vehicles and trailers, and facilities. The amount and timing of capital investments depend on various factors, including pre-existing contractual commitments, anticipated volume growth, domestic and international economic conditions, new or enhanced services, geographical expansion of services, availability of satisfactory financing, and actions of regulatory authorities.\n-37-\nTable of Contents\nThe following table compares capital expenditures by asset category and reportable segment for the three-month periods ended August 31, 2025 and 2024 (in millions):\n2025\n2024\nPercent Change\nAircraft and related equipment\n$\n60 \n$\n181 \n(67)\nPackage handling and ground support equipment\n205 \n197 \n4 \nInformation technology\n118 \n153 \n(23)\nVehicles and trailers\n47 \n90 \n(48)\nFacilities and other\n193 \n146 \n32 \nTotal capital expenditures\n$\n623 \n$\n767 \n(19)\nFederal Express segment\n$\n568 \n$\n703 \n(19)\nFedEx Freight segment\n32 \n35 \n(9)\nOther\n23 \n29 \n(21)\nTotal capital expenditures\n$\n623 \n$\n767 \n(19)\nCapital expenditu\nr\nes decreased i\nn th\ne first quarter of 2026 primarily due to decreased spending on aircraft and related equipment at Federal Express, vehicles and trailers at Federal Express and FedEx Freight, and information and technology investments at Federal Express and FedEx Freight as a result of continuing to prioritize investments that support increasing efficiency and reducing our cost to serve. These reductions were partially offset by increased spending on facilities and other at Federal Express and FedEx Freight.\nGUARANTOR FINANCIAL INFORMATION \nWe are providing the following information in compliance with Rule 13-01 of Regulation S-X, “Financial Disclosures about\n \nGuarantors and Issuers of Guaranteed Securities” with respect to our senior unsecured debt securities and Pass-Through Certificates, Series 2020-1AA (the “Certificates”).\nTh\ne \n$19.9 billion\n \nprincipal amount of the senior unsecured notes were issued by FedEx under a shelf registration statement and are guaranteed by certain direct and indirect subsidiaries of FedEx (“Guarantor Subsidiaries”). FedEx owns, directly or indirectly, 100% of each Guarantor Subsidiary. The guarantees are (1) unsecured obligations of the respective Guarantor Subsidiary, (2) rank equally with all of their other unsecured and unsubordinated indebtedness, and (3) are full and unconditional and joint and several. If we sell, transfer, or otherwise dispose of all of the capital stock or all or substantially all of the assets of a Guarantor Subsidiary to any person that is not an affiliate of FedEx, the guarantee of that Guarantor Subsidiary will terminate, and holders of debt securities will no longer have a direct claim against such subsidiary under the guarantee. See \nNote 4\n of the accompanying unaudited condensed consolidated financial statements for information regarding the issuance by FedEx of its 3.500% Notes due 2032 and 4.125% Notes due 2037 guaranteed by the Guarantor Subsidiaries that was completed during the first quarter of 2026.\nAdditionally, FedEx fully and unconditionally guarantees the payment obligation of Federal Express in respect of the $711 million principal amount of the Certificates. See \nNote\n 4\n of the accompanying unaudited condensed consolidated financial statements and \nNote 6\n to the financial statements included in our Annual Report for additional information regarding the terms of the Certificates.\nThe following tables present summarized financial information for FedEx (as Parent) and the Guarantor Subsidiaries on a combined basis after transactions and balances within the combined entities have been eliminated\n. \nParent and Guarantor Subsidiaries\nThe following table presents the summarized balance sheet information as of August 31, 2025 and May 31, 2025 (in millions):\nAugust 31, 2025\nMay 31, 2025\nCurrent Assets\n$\n9,924 \n$\n9,514 \nIntercompany Receivable\n5,145 \n4,278 \nTotal Assets\n84,186 \n83,125 \nCurrent Liabilities\n11,439 \n11,202 \nIntercompany Payable\n— \n— \nTotal Liabilities\n$\n53,492 \n$\n52,324 \n-38-\nTable of Contents\nThe following table presents the summarized statement of income information for the three-month period ended August 31, 2025 (in millions):\nRevenue\n$\n16,643 \nIntercompany Charges, net\n(1,106)\nOperating Income\n1,265 \nIntercompany Charges, net\n71 \nIncome Before Income Taxes\n1,043 \nNet Income\n$\n691 \nThe following tables present summarized financial information for FedEx (as Parent Guarantor) and Federal Express (as Subsidiary Issuer) on a combined basis after transactions and balances within the combined entities have been eliminated. \nParent Guarantor and Subsidiary Issuer \nThe following table presents the summarized balance sheet information as of August 31, 2025 and May 31, 2025 (in millions):\nAugust 31, 2025\nMay 31,\n2025\nCurrent Assets\n$\n9,856 \n$\n9,504 \nIntercompany Receivable\n1,187 \n581 \nTotal Assets\n73,227 \n72,044 \nCurrent Liabilities\n10,598 \n10,310 \nIntercompany Payable\n— \n— \nTotal Liabilities\n$\n50,346 \n$\n49,200 \nThe following table presents the summarized statement of income information for the three-month period ended August 31, 2025 (in millions):\nRevenue\n$\n14,302 \nIntercompany Charges, net\n(1,261)\nOperating Income\n894 \nIntercompany Charges, net\n10 \nIncome Before Income Taxes\n1,035 \nNet Income\n$\n772 \nLIQUIDITY OUTLOO\nK\nIn response to current business and economic conditions as referenced above in the “Outlook” section of this MD&A, we are continuing to actively manage and optimize our capital allocation in response to the slowdown in the economy, inflationary pressures, changing fuel prices, geopolitical conflicts, and uncertainty regarding international trade, including the impact of global trade policies. We held $6.2 billion in cash and cash equivalents at August 31, 2025 and had $3.5 billion in available liquidity under our $1.75 billion three-year credit agreement (the “Three-Year Credit Agreement”) and $1.75 billion five-year credit agreement (the “Five-Year Credit Agreement” and together with the Three-Year Credit Agreement, the “Credit Agreements”), and we believe that our cash and cash equivalents, cash from operations, and available financing sources will be adequate to meet our liquidity needs, which include operational requirements, expected capital expenditures, voluntary pension contributions, dividend payments, and stock repurchases. In the third quarter of 2025, we began incurring costs and expenses related to the planned spin-off of FedEx Freight, which are expected to be significant but are not expected to adversely affect our liquidity.\nWe repurchased an aggregate of $500 million of our common stock in the first quarter of 2026 through open market transactions. See \nNote\n 1\n of the accompanying unaudited condensed consolidated financial statements and \n“Item 2. Unregistered Sales of Equity Securities and Use of Proceeds”\n for more information. Subject to market conditions, our liquidity needs, and other factors, we expect to continue repurchasing additional shares of our common stock during the remainder of 2026.\nOur cash and cash equivalents balance at August 31, 2025 includes $4.0 billion of cash in foreign jurisdictions associated with our permanent reinvestment strategy. We are able to access the majority of this cash without a material tax cost and do not believe that the indefinite reinvestment of these funds impairs our ability to meet our U.S. domestic debt or working capital obligations. \n-39-\nTable of Contents\nOur capital expenditures for 2026 are expected to be approximately $4.5 billion, $0.4 billion higher than 2025.The increase is driven by investment in Network 2.0 initiatives and other efforts to modernize our facilities and package handling equipment in the U.S. and internationally. Aircraft spend is expected to decline to approximately $1.0 billion, $0.3 billion lower than 2025.\nThere have been no material changes to the contractual commitments described in Part II, Item 7 in our Annual Report. We do not have any guarantees or other off-balance sheet financing arrangements, including variable interest entities, which we believe could have a material effect on our financial condition or liquidity. \nWe have several aircraft modernization programs under way that are supported by the purchase of Boeing 777 Freighter (“B777F”) and Boeing 767-300 Freighter (“B767F”) aircraft. These aircraft are significantly more fuel-efficient per unit than the aircraft types previously utilized, and these expenditures are necessary to achieve significant long-term operating savings and to replace older aircraft. Our ability to delay the timing of these aircraft-related expenditures is limited without incurring significant costs to modify existing purchase agreements. \nThe Three-Year Credit Agreement and the Five-Year Credit Agreement expire in March 2027 and March 2029, respectively. Each of the Credit Agreements has a $125 million letter of credit sublimit. The Credit Agreements are available to finance our operations and other cash flow needs. See \nNote \n4\n of the accompanying unaudited condensed consolidated financial statements for more information.\nWe have a shelf registration statement filed with the Securities and Exchange Commission (“SEC”) that allows us to sell, in one or more future offerings, any combination of our unsecured debt securities and common stock and allows pass-through trusts formed by \nFederal Express\n to sell, in one or more future offerings, pass-through certificates.\nDuring the first three months of 2026, we made voluntary contributi\nons of $200 million to our tax-qualified U.S. domestic pension plan (“U.S. Pension Plan”) and anticipate making up to $200 million of additional voluntary contributions during the remainder of \n2026. There are currently no required minimum contributions to our U.S. Pension Plan, and we maintain a credit balance related to our cumulative excess voluntary pension contributions over those required that\n exceeds $3.0 billion. The c\nredit balance is subtracted from plan assets to determine the minimum funding requirements. Therefore, we have the flexibility to eliminate all required contributions to our U.S. Pension Plan for several years. Our U.S. Pension Plan has ample funds to meet expected benefit payments. \nOn August 7, 2025, our Board of Directors declared a quarterly cash dividend of $1.45 per share of common stock. The dividend will be paid on October 1, 2025 to stockholders of record as of the close of business on September 8, 2025\n.\n Each quarterly dividend payment is subject to review and approval by our Board of Directors, and we evaluate our dividend payment amount on an annual basis.\nStandard & Poor’s has assigned us a senior unsecured debt credit rating of BBB, a Certificates rating of AA-, a commercial paper rating of A-2, and a ratings outlook of “stable.” Moody’s Investors Service has assigned us an unsecured debt credit rating of Baa2, a Certificates rating of Aa3, a commercial paper rating of P-2, and a ratings outlook of “stable.” Our interest expense may increase in the event of a reduction in our credit rating. If our unsecured debt or commercial paper ratings are reduced to below investment grade, our access to the capital markets may become limited.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States requires management to make significant judgments and estimates to develop amounts reflected and disclosed in the financial statements. In many cases, there are alternative policies or estimation techniques that could be used. We maintain a thorough process to review the application of our accounting policies and to evaluate the appropriateness of the many estimates that are required to prepare the financial statements of a complex, global corporation. However, even under optimal circumstances, estimates routinely require adjustment based on changing circumstances and new or better information.\nGOODWILL.\n Goodwill is tested for impairment between annual tests whenever events or circumstances make it more likely than not that the fair value of a reporting unit has fallen below its carrying value\n. We do not believe there has been any additional change of events or circumstances that would indicate that additional reevaluation of the goodwill of our reporting units is required as of August 31, 2025, nor do we believe the goodwill of our reporting units is at risk of failing impairment testing.\n For additional details on goodwill impairment testing, refer to Note 1 to the financial statements included in our Annual Report.\nInformation regarding our critical accounting estimates can be found in our Annual Report, including Note 1 to the financial statements therein. Management has discussed the development and selection of these critical accounting estimates with the Audit and Finance Committee of our Board of Directors and with our independent registered public accounting firm.\nFORWARD-LOOKING STATEMENTS\nCertain statements in this report, including (but not limited to) those contained in “General,” “Trends Affecting Our Business,” “Business Optimization Costs,” “Income Taxes,” “Outlook,” “Liquidity Outlook,” “Legal Proceedings,” and “Risk Factors” and the \n-40-\nTable of Contents\n“Description of Business Segments and Summary of Significant Accounting Policies,” “Financing Arrangements,” “Retirement Plans,” “Commitments,” and “Contingencies” notes to our unaudited condensed consolidated financial statements, are “forward-looking” statements within the meaning of the Private Securities Litigation Reform Act of 1995 (the “PSLRA”) with respect to our financial condition, results of operations, cash flows, plans, objectives, future performance, and business and the assumptions underlying such statements. Forward-looking statements include those preceded by, followed by, or that include the words “will,” “may,” “could,” “would,” “should,” “believes,” “expects,” “anticipates,” “plans,” “estimates,” “targets,” “forecasts,” “projects,” “intends,” or similar expressions. These forward-looking statements, which are intended to enjoy the protection of the safe harbor for forward-looking statements provided by the PSLRA as well as protections afforded by other federal securities laws, involve risks and uncertainties. Actual results may differ materially from those contemplated (expressed or implied) by such forward-looking statements because of, among other things, potential risks and uncertainties, such as:\n•\neconomic conditions in the global markets in which we operate;\n•\nsignificant changes in the volumes of shipments transported through our networks, customer demand for our various services, or the prices we obtain for our services;\n•\ngeopolitical developments and uncertainty and/or additional volatility in the global trade environment;\n•\nthe price and availability of jet and vehicle fuel;\n•\nfailure to successfully implement our business strategy and effectively respond to changes in market dynamics and customer preferences; \n•\nour ability to execute our transformation initiatives, including Network 2.0 and the redesign of the Federal Express international air network, in the expected time frame and at the expected cost and achieve the expected operational efficiencies and network flexibility, alignment of our cost base with demand, cost savings and reductions to our permanent cost structure, and other benefits while managing the potential risks; \n•\nour ability to successfully implement the planned tax-free spin-off of the FedEx Freight business into a new publicly traded company and achieve the anticipated benefits of such transaction;\n•\nthe timing and amount of any costs or benefits or any specific outcome, transaction, or change (of which there can be no assurance), or the terms, timing, and structure thereof, related to our global transformation program and other ongoing reviews and initiatives;\n•\nour ability to successfully implement our workforce reduction in Europe;\n•\na significant data breach or other disruption to our technology infrastructure, and our ability to mitigate the technological, operational, legal and regulatory, and reputational risks related to emerging technologies such as autonomous technology and artificial intelligence; \n•\nthe future rate of e-commerce growth and our ability to successfully expand our e-commerce services portfolio;\n•\nincreased insurance and claims expenses related to vehicle accidents, workers’ compensation claims, property and cargo loss, general business liabilities, and benefits paid under employee disability programs;\n•\nfailure to receive or collect expected insurance coverage;\n•\nthe effect of any international conflicts or terrorist activities on the United States and global economies in general, the transportation industry, or FedEx in particular;\n•\nfailure of third-party service providers to perform as expected, or disruptions in our relationships with those providers or their provision of services to FedEx;\n•\nwidespread outbreak of an illness or any other communicable disease or public health crisis;\n•\ndamage to our reputation or loss of brand equity;\n•\nthe effect of intense competition on our ability to maintain or increase our prices (including our fuel surcharges) or to maintain or grow our revenue and market share;\n•\nour ability to manage our network capacity and cost structure for capital expenditures and operating expenses, and match it to shifting and future customer volume levels;\n-41-\nTable of Contents\n•\nour ability to execute and effectively operate, integrate, leverage, and grow acquired businesses, and to continue to support the value we allocate to these acquired businesses;\n•\nnoncash impairment charges related to our goodwill and certain deferred tax assets;\n•\nfailure to attract and retain employee talent and our ability to meet our labor and purchased transportation needs while controlling related costs and maintain our company culture;\n•\nour ability to maintain good relationships with our employees and avoid attempts by labor organizations to organize groups of our employees, which could significantly increase our operating costs and reduce our operational flexibility, as well as the outcome of negotiations to reach new collective bargaining agreements (including with the pilots of Federal Express);\n•\nincreasing costs, the volatility of costs and funding requirements, and other legal mandates for employee benefits, especially pension and healthcare benefits;\n•\nthe effects of global climate change;\n•\nour ability to achieve or demonstrate progress on our goal of carbon neutrality for our global operations by calendar 2040;\n•\nour ability to quickly and effectively restore operations following adverse weather or a localized disaster or disturbance in a key geography;\n•\nany effects on our businesses resulting from evolving or new U.S. domestic or international government regulations, laws, policies, and actions, which could be unfavorable to our business, including labor (such as joint employment standards or changes to the Railway Labor Act of 1926, as amended, affecting Federal Express employees); regulatory or other actions affecting data protection; global aviation or other transportation rights; increased air cargo, pilot flight and duty time, and other security or safety requirements; import and export controls; the use of new technology and accounting; changes to  global trade policies; foreign exchange intervention in response to currency volatility; environmental (such as global climate change legislation); or postal rules;\n•\nadverse changes in tax laws, regulations, and interpretations or challenges to our tax positions;\n•\nincreasing costs related to changing and heightened regulations and enforcement related to data protection;\n•\nthe increasing costs of compliance with federal, state, and foreign governmental agency mandates (including the Foreign Corrupt Practices Act and the U.K. Bribery Act) and defending against inappropriate or unjustified enforcement or other actions by such agencies;\n•\nchanges in foreign currency exchange rates, especially in the euro, Chinese yuan, British pound, Canadian dollar, Australian dollar, Mexican peso, Hong Kong dollar, and Japanese yen, which can affect our sales levels and foreign currency sales prices;\n•\nloss or delay in the collection of accounts receivable;\n•\nany liability resulting from and the costs of defending against class-action, derivative, and other litigation, such as wage-and-hour, joint employment, securities, vehicle accident, and discrimination and retaliation claims, claims related to our reporting and disclosure of environmental and sustainability topics, and any other legal or governmental proceedings, including the matters discussed in \nNote \n9\n of the accompanying unaudited condensed consolidated financial statements;\n•\nthe sufficiency of insurance coverage we purchase;\n•\nthe effect of technology developments (including artificial intelligence and machine learning) on our operations and on demand for our services, and our ability to continue to identify and eliminate unnecessary information-technology redundancy and complexity throughout the organization;\n•\ndisruptions in global supply chains, which can limit the access of FedEx and our service providers to vehicles and other key capital resources and increase our costs;\n•\ndifficulties experienced by the companies with which we contract to fly smaller regional “feeder” aircraft in attracting and retaining pilots, which could cause a reduction of service offered to certain locations, service disruptions, increased costs of operations, and other difficulties;\n-42-\nTable of Contents\n•\ngovernmental underinvestment in transportation infrastructure, which could increase our costs and adversely affect our service levels due to traffic congestion, prolonged closure of key thoroughfares, or sub-optimal routing of our vehicles and aircraft;\n•\nsuccessful completion of our planned stock repurchases;\n•\nconstraints, volatility, or disruption in the capital markets, our ability to maintain our current credit ratings, commercial paper ratings, and senior unsecured debt and pass-through certificate credit ratings, and our ability to meet credit agreement financial covenants; and\n•\nother risks and uncertainties you can find in our press releases and SEC filings, including the risk factors identified under Part I, Item IA. “Risk Factors” in our Annual Report, as updated by our quarterly reports on Form 10-Q and current reports on Form 8-K.\nAs a result of these and other factors, no assurance can be given as to our future results and achievements. Accordingly, a forward-looking statement is neither a prediction nor a guarantee of future events or circumstances and those future events or circumstances may not occur. You should not place undue reliance on the forward-looking statements, which speak only as of the date of this report. We are under no obligation, and we expressly disclaim any obligation, to update or alter any forward-looking statements, whether as a result of new information, future events, or otherwise."
}