{
  "source_file": "fe-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.        Management’s Discussion and Analysis of Financial Condition and Results of Operations\nFIRSTENERGY CORP.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\nEXECUTIVE SUMMARY AND RECENT DEVELOPMENTS\nCompany Overview \nFirstEnergy is dedicated to integrity, safety, reliability and operational excellence and is principally involved in the transmission, distribution and generation of electricity through its reportable segments: Distribution, Integrated and Stand-Alone Transmission. Its EDCs form one of the nation's largest investor-owned electric systems, serving over six million customers in Ohio, Pennsylvania, New Jersey, West Virginia, Maryland and New York. FirstEnergy’s transmission subsidiaries operate more than 24,000 miles of transmission lines that connect the Midwest and Mid-Atlantic regions and two regional transmission operation centers. As of September 30, 2025, AGC and MP control 3,610 MWs of net maximum generation capacity. \nFIRSTENERGY’S CONSOLIDATED RESULTS OF OPERATIONS \nThird Quarter of 2025 Compared with Third Quarter of 2024 \n(In millions)\nFor the Three Months Ended September 30,\n2025\n2024\nIncrease (Decrease)\nRevenues\n$\n4,148 \n$\n3,729 \n$\n419 \n11 \n%\nOperating expenses\n(3,318)\n(3,002)\n316 \n11 \n%\nOther expenses, net\n(220)\n(167)\n53 \n32 \n%\nIncome taxes\n(78)\n(94)\n(16)\n(17)\n%\nIncome attributable to noncontrolling interest\n(91)\n(47)\n44 \n94 \n%\nEarnings attributable to FE\n$\n441 \n$\n419 \n$\n22 \n5 \n%\nEarnings attributable to FE were $441 million or $0.76 per share (basic and diluted) in the third quarter of 2025 compared to $419 million or $0.73 per share (basic and diluted) in the third quarter of 2024, representing an increase of $22 million that was primarily due to the following:\n•\nHigher revenues associated with the implementation of the Pennsylvania base rate case;\n•\nHigher earnings from regulated capital investments that increased rate base;\n•\nThe absence of the $62 million (pre-tax) impairment charge related to the Akron general office in the third quarter of 2024; and \n•\nHigher income tax benefits related to a remeasurement of excess deferred income taxes in the third quarter 2025, partially offset by lower deductions associated with certain equity method investments and updates to deferred income taxes on the FET Equity Interest Sale.\nThese factors were partially offset by the following: \n•\nThe expected elimination of the 50 basis point ROE adder associated with ATSI’s RTO membership as a result of the Sixth Circuit ruling in January 2025;\n•\nHigher planned other operating expense, primarily due to higher employee benefit costs, planned vegetation management expenses, and higher uncollectible expense, partially offset by increased construction support and lower maintenance work;\n•\n$21 million (pre-tax) of lower investment earnings related to FEV’s equity method investment in Global Holding, which, as discussed above, was sold on July 16, 2025; and\n•\nHigher interest expenses from debt issuances since the third quarter of 2024.\nDetailed segment reporting explanations are included below.\n53\nDistribution services by customer class are summarized in the following table:\nFor the Three Months Ended September 30,\n(In thousands)\nActual\nWeather-Adjusted\nElectric Distribution MWh Deliveries\n2025\n2024\nIncrease (Decrease)\n2025\n2024\nIncrease\nResidential\n15,448 \n15,415 \n0.2 \n%\n15,295 \n15,078 \n1.4 \n%\nCommercial\n(1)\n10,597 \n10,681 \n(0.8)\n%\n10,634 \n10,563 \n0.7 \n%\nIndustrial\n13,667 \n13,630 \n0.3 \n%\n13,667 \n13,630 \n0.3 \n%\nTotal Electric Distribution MWh Deliveries\n39,712 \n39,726 \n— \n%\n39,596 \n39,271 \n0.8 \n%\n (1)\n Includes street lighting.\nActual distribution deliveries for each customer class were essentially flat in the third quarter of 2025 compared to the same period of 2024. Cooling degree days in the third quarter of 2025 were 7% below the same period of 2024 and 2% below normal. Heating degree days in the third quarter of 2025 were 66% above the same period of 2024 and 30% below normal.\nFirst Nine Months of 2025 Compared with First Nine Months of 2024 \n(In millions)\nFor the Nine Months Ended September 30, \n2025\n2024\nIncrease (Decrease)\nRevenues\n$\n11,293 \n$\n10,296 \n$\n997 \n10 \n%\nOperating expenses\n(9,063)\n(8,534)\n529 \n6 \n%\nOther expenses, net\n(674)\n(637)\n37 \n6 \n%\nIncome taxes\n(292)\n(294)\n(2)\n(1)\n%\nIncome attributable to noncontrolling interest\n(195)\n(114)\n81 \n71 \n%\nEarnings attributable to FE\n$\n1,069 \n$\n717 \n$\n352 \n49 \n%\nEarnings attributable to FE were $1,069 million or $1.85 per share (basic and diluted) in the first nine months of 2025 compared to $717 million or $1.25 per basic share ($1.24 per share diluted) in the first nine months of 2024, representing an increase of $352 million that was primarily due to the following:\n•\nThe absence of the previously-disclosed $100 million civil penalty resulting from the SEC investigation and the $19.5 million settlement with the OAG’s office, which were both recorded as loss contingencies in the second quarter of 2024;\n•\nThe absence of $207 million (pre-tax) in charges related to changes in ARO liabilities associated with CCR rules and McElroy’s Run in the second quarter of 2024;\n•\nThe absence of a $53 million (pre-tax) charge at JCP&L in connection with the base rate case settlement agreement in the first quarter of 2024, as further discussed below;\n•\nThe absence of a $32.5 million (pre-tax) contribution commitment by the Ohio Companies, as a result of the PUCO’s ESP V order in the second quarter of 2024;\n•\nHigher earnings associated with the implementation of base rate cases in New Jersey, West Virginia and Pennsylvania; \n•\nHigher customer usage and demand, primarily due to colder weather temperatures in the first quarter of 2025;\n•\nHigher revenues from regulated capital investments that increased rate base;\n•\nLower customer credits associated with the PUCO-approved Ohio Stipulation;\n•\nThe absence of the $62 million (pre-tax) impairment charge related to the Akron general office in the third quarter of 2024;\n•\nLower debt redemptions costs of $61 million (pre-tax); and\n•\nHigher income tax benefits related to a remeasurement of excess deferred income taxes in the third quarter of 2025 and the absence of discrete tax charges related to the FET Equity Interest Sale and PA Consolidation in the first quarter of 2024, partially offset by lower deductions associated with certain equity method investments.\nThese factors were partially offset by the following: \n•\nThe absence of $151 million (pre-tax) net proceeds from the shareholder derivative lawsuit settlement received in the second quarter of 2024;\n•\nThe absence of a $60 million (pre-tax) benefit associated with the approval by the WVPSC to recover costs of certain retired generation stations in the first quarter of 2024;\n•\nThe expected elimination of the 50 basis point ROE adder associated with ATSI’s RTO membership as a result of the Sixth Circuit ruling in January 2025;\n54\n•\nHigher depreciation expense due to a higher asset base;\n•\nHigher other operating expenses, primarily due to higher employee benefit costs, planned vegetation management expenses, and higher uncollectible expense, partially offset by increased construction support and lower maintenance work;\n•\nLower customer usage and demand in the second quarter of 2025;\n•\nLower investment earnings of $63 million (pre-tax) related to FEV’s equity method investment in Global Holding, which, as discussed above, was sold on July 16, 2025;\n•\nThe absence of $24 million (pre-tax) of interest income related to the FET Equity Interest Sale, the purchase price of which was paid in part by the issuance of promissory notes;\n•\nCosts associated with the announced organizational changes; and\n•\nThe dilutive effect of the FET Equity Interest Sale that closed in March 2024.\nDetailed segment reporting explanations are included below.\nDistribution services by customer class are summarized in the following table:\nFor the Nine Months Ended September 30, \n(In thousands)\nActual\nWeather-Adjusted\nElectric Distribution MWh Deliveries\n(1)\n2025\n2024\nIncrease (Decrease)\n2025\n2024\nIncrease (Decrease)\nResidential\n42,896 \n42,038 \n2.0 \n%\n42,429 \n42,478 \n(0.1)\n%\nCommercial\n(2)\n30,025 \n29,706 \n1.1 \n%\n30,038 \n29,927 \n0.4 \n%\nIndustrial\n39,474 \n40,090 \n(1.5)\n%\n39,474 \n40,090 \n(1.5)\n%\nTotal Electric Distribution MWh Deliveries\n112,395 \n111,834 \n0.5 \n%\n111,941 \n112,495 \n(0.5)\n%\n (1)\n Reflects the reclassification of certain Pennsylvania customers from Industrial to Commercial. Due to the January 2024 consolidation of the Pennsylvania Companies, certain customers are required to be classified as Commercial effective June 1, 2024. The MWh deliveries prior to the effective date have been adjusted for comparability. \n (2)\n Includes street lighting.\nActual distribution deliveries for each customer class were slightly impacted by higher customer usage and demand. Cooling degree days in the first nine months of 2025 were 11% below the same period of 2024 and 1% above normal. Heating degree days in the first nine months of 2025 were 18% above the same period of 2024 and 1% below normal.\nThe financial results discussed below in Segment Results of Operations include revenues and expenses from transactions among FirstEnergy’s business segments. A reconciliation of segment financial results is provided in Note 11, “Segment Information,” of the Notes to Consolidated Financial Statements.\nRecent Developments\nInvestment Strategy\nFirstEnergy recently increased its Energize365 2025 planned capital investments to $5.5 billion, a 10% increase from its original 2025 plan of $5.0 billion. Additionally, FirstEnergy expects planned transmission capital investments in its 2026 through 2030 planning period to increase by 30% compared to planned transmission capital investments in its current 5-year plan.\nSignal Peak Disposition\nOn July 16, 2025, FEV sold its entire 33-1/3% equity ownership in Global Holding, the holding company for a joint venture in the Signal Peak mining and coal transportation operations, at book value to WMB Marketing Ventures, LLC and Pinesdale LLC for $47.5 million.\nAsset Retirement Obligations\nAs further discussed below in “Outlook – Environmental Matters – Regulation of Waste Disposal,” on May 8, 2024, the EPA finalized changes to the CCR regulations addressing inactive surface impoundments at inactive electric utilities, known as legacy CCR surface impoundments, and in November 2024 and January 2025, the EPA made several technical corrections to the rule. The rule extends 2015 CCR rule requirements for groundwater monitoring and protection procedures, operational and reporting procedures, as well as closure requirements for impoundments and landfills that were not originally included for coverage by the 2015 CCR rule. As a result, during 2024, FirstEnergy performed a preliminary assessment of former CCR disposal sites and calculated an initial estimate applying historical experience in remediating comparable sites and recorded a $139 million increase to its ARO in 2024. JCP&L did not have any legacy CCR disposal sites that were applicable to the 2024 CCR rules.\nDuring 2024, as a result of the evaluation of closure options for McElroy’s Run and the adjacent landfill, AE Supply reviewed its ARO and future expected costs to remediate, resulting in an increase to the ARO liability of $87 million. AE Supply transferred \n55\nthe McElroy’s Run CCR impoundment facility and adjacent dry landfill and related remediation obligations on March 4, 2025, pursuant to the environmental liability transfer agreement dated February 3, 2025, with a subsidiary of IDA Power, LLC. Pursuant to the agreement, AE Supply established a $160 million escrow account that AE Supply will fund over five years and is secured by a surety bond, which is guaranteed by FE. In connection with the transfer, AE Supply recognized a $130 million liability, based on a 4.8% weighted average discount rate over the contract term, associated with its remaining obligation to fund the escrow account over the next five years, and derecognized the ARO, resulting in an immaterial impact to earnings. During the nine months ended September 30, 2025, AE Supply made $46 million of cash payments to the escrow account.\nOn March 12, 2025, the EPA announced a series of planned deregulatory actions, including reconsideration of the final legacy CCR rules. We continue to monitor EPA's actions related to CCR; however, the ultimate impact is unknown at this time and subject to the outcome of the litigation and any future state regulatory actions.\nValley Link\nOn July 26, 2024, FE, VEPCO and Transource Energy, LLC, a subsidiary of AEP, entered into a joint proposal agreement in connection with PJM’s 2024 Regional Transmission Expansion Plan Open Window 1 process. Pursuant to such joint proposal agreement, FET, VEPCO and Transource Energy, LLC jointly proposed certain regional electric transmission projects for PJM's consideration during the Open Window process. On November 25, 2024, FET, Dominion High Voltage MidAtlantic, Inc., an affiliate of VEPCO, and Transource Energy, LLC, formed Valley Link, which is the holding company responsible for managing and executing any projects awarded by PJM, and entered into a limited liability agreement. On February 26, 2025, PJM selected certain of the joint proposed projects, which included approximately $3 billion in investments for Valley Link to both build new and upgrade existing transmission infrastructure. On May 13, 2025, FERC issued an initial order that, among other things, accepted the requested abandonment rate incentive, CWIP rate incentive, RTO participation adder incentive, and precommercial regulatory asset rate incentive, and allowed the formula rate to go into effect on May 14, 2025, as requested, subject to refund, pending further settlement and hearing proceedings. An initial settlement conference was held on June 26, 2025, and a procedural schedule for the initial phase of the settlement process was agreed upon. The capital structure incentive and the other open rate design matters are being addressed in confidential settlement negotiations.\nReorganization \nOn March 24, 2025, FirstEnergy internally announced organizational changes to FirstEnergy employees. These organizational changes are intended to align FirstEnergy’s organization with its new business model, which is designed to make FE more efficient and sustainable while placing responsibility and accountability closer to customers, employees and regulators. The changes are also consistent with FirstEnergy’s focus on operations and maintenance expense discipline. These organizational changes resulted in approximately two hundred employees being reassigned and FirstEnergy reducing its workforce by less than three percent. As a result, FirstEnergy recognized a pre-tax charge of approximately $26 million ($5 million at JCP&L) during the first quarter of 2025, which is included within “Other operating expenses” on each of the Registrant’s Statements of Income and Comprehensive Income.\nDividend Growth\nFirstEnergy continues to return value to shareholders. In March 2025, the FE Board declared a $0.02 per share increase to the quarterly common stock dividend payable June 1, 2025, to $0.445 per share, which represents an increase of more than 11% in annual dividend declarations since 2023. Modest dividend growth is expected to enable enhanced shareholder returns, while still allowing for continued substantial regulated investments. Dividend payments are subject to declaration by the FE Board, and future dividend decisions determined by the FE Board may be impacted by earnings growth, credit metrics and other business conditions. On September 23, 2025, the FE Board declared a quarterly dividend of $0.445 per share of outstanding common stock payable December 1, 2025, to shareholders of record at the close of business on November 7, 2025.\nRegulatory Matters - New Jersey\nOn November 9, 2023, JCP&L filed a petition for approval of its EnergizeNJ with the NJBPU that would, among other things, support grid modernization, system resiliency and substation modernization in technologies designed to provide enhanced customer benefits. On February 14, 2024, the NJBPU approved the stipulated settlement between JCP&L and various parties, resolving JCP&L’s request for a distribution base rate increase. On February 27, 2024, as part of the stipulated settlement, JCP&L amended its pending EnergizeNJ petition following receipt of NJBPU approval of the base rate case settlement, to remove the high-priority circuits that are to be addressed in the first phase of its reliability improvement plan and to include the second phase of its reliability improvement plan that is expected to further address certain high-priority circuits that require additional upgrades. On April 10, 2025, JCP&L, joined by various parties, filed a stipulated settlement with the NJBPU resolving JCP&L’s amended EnergizeNJ petition. The settlement provides for total program costs of $339 million, including capital investments in JCP&L’s electric distribution system of approximately $203 million, $132 million of matching capital investments and approximately $4 million of O&M expense. Pursuant to the settlement, the program began on July 1, 2025, and will continue through December 31, 2028, and JCP&L has agreed to file a base rate case no later than January 1, 2030.\n56\nRegulatory Matters - Ohio\nOn April 5, 2023, the Ohio Companies sought approval from the PUCO for their ESP V. The proposed plan would maintain an eight-year term beginning June 1, 2024, and continue riders recovering costs associated with distribution infrastructure investments and approved grid modernization investments. ESP V additionally proposed new riders that would support reliability, and included provisions supporting affordability and enhancing the customer experience. On May 15, 2024, the PUCO issued an order approving ESP V with modifications, which are described below in “Outlook - State Regulation - Ohio”. On June 14, 2024, the Ohio Companies filed an Application for Rehearing, which was denied by operation of law as the PUCO did not rule on the applications for rehearing within 30 days of filing. Due to the risks and uncertainty resulting from the Ohio Companies’ application for rehearing being denied by operation of law, on October 29, 2024, the Ohio Companies filed a notice of their intent to withdraw ESP V and proposed the terms under which they would resume operating under ESP IV, which was approved by the PUCO on December 18, 2024. On January 22, 2025, the PUCO approved the Ohio Companies’ ESP IV compliance tariffs with an effective date of February 1, 2025, at which point the Ohio Companies resumed operating under ESP IV with modifications, as described below in “Outlook - State Regulation - Ohio”. On April 7, 2025, certain intervenors filed an appeal to the Supreme Court of Ohio challenging the Ohio Companies’ return to ESP IV. On May 22, 2025, the Supreme Court of Ohio granted the Ohio Companies motion to intervene in the appeal as appellees. On July 7, 2025, OCC and NOAC filed their Appellants’ brief. Appellees, including the Ohio Companies, filed their briefs on August 26, 2025, to which the OCC and NOAC replied on September 15, 2025.\nOn January 31, 2025, the Ohio Companies filed an application with the PUCO for ESP VI, which would begin concurrently with the effective date of any new base distribution rates resulting from the Ohio Companies’ pending base rate case and continue through May 31, 2028. ESP VI proposes to continue existing riders to support continued maintenance of the distribution system, and to reestablish riders to recover vegetation management and storm restoration expenses. ESP VI also includes provisions supporting affordability and enhancing the customer experience. The PUCO held a technical conference on March 12, 2025. Pending legislation in Ohio would, if enacted, eliminate the PUCO’s ability to authorize future ESPs; therefore, ESP VI could not move forward. Under such legislation, the Ohio Companies would be allowed to continue ESP IV until their final auction delivery period, which is May 31, 2029, and then ESP IV must terminate.\nOn May 31, 2024, the Ohio Companies filed their application for an increase in base distribution rates, based on a 2024 calendar year test period. The Ohio Companies requested a net increase in base distribution revenues of approximately $94 million with a return on equity of 10.8% and capital structures of 44% debt and 56% equity for CEI, 46% debt and 54% equity for OE, and 45% debt and 55% equity for TE, which reflects a roll-in of current riders such as DCR and AMI. The net increase represented a 1.5% average residential monthly bill increase. Key components of the base rate case filing include a proposal to change pension and OPEB recovery to the delayed recognition method and to implement a mechanism to establish a regulatory asset (or liability) to recover (or refund) net differences between the amount of pension and OPEB expense requested in the proceeding and the actual amount each year using this method. Additionally, the Ohio Companies requested recovery of certain incurred costs, including the impact of major storms, a program to convert streetlights to LEDs, and others. On June 14, 2024, the Ohio Companies filed supporting testimony and on July 31, 2024, filed an update with an adjusted net increase of base distribution revenues of approximately $190 million and to incorporate matters in the rate case as directed by the PUCO’s ESP V order. On December 18, 2024, the PUCO issued an order approving the Ohio Companies’ withdrawal of ESP V. On January 22, 2025, the PUCO approved the Ohio Companies’ revised ESP IV tariffs, effective February 1, 2025, at which time the Ohio Companies resumed operating under ESP IV. On January 27, 2025, the Ohio Companies notified the PUCO of their intention to update their application for an increase in base distribution rates to remove ESP V related provisions from the base rate case. The PUCO staff hired a third-party auditor to assist in the review of the Ohio Companies’ base rate case filing and on February 21, 2025, PUCO staff and the third-party auditor each filed their reports. The auditor’s report recommended adjustments which would result in a net increase of the Ohio Companies’ base distribution revenues of approximately $8 million with a return on equity of 9.63% and capital structures of 48.8% debt and 51.2% equity for each of the Ohio Companies. PUCO staff’s report takes limited positions on the auditor’s finding and recommendations and makes additional findings. On March 24, 2025, the Ohio Companies, OCC, and other parties filed objections to the PUCO’s staff report and the auditor’s report. In addition, the Ohio Companies filed certain pieces of supplemental testimony and intervenors filed direct testimony. The Ohio Companies and various parties are engaged in settlement discussions with respect to the pending base rate case. Evidentiary hearings were held between May 5, 2025, and May 29, 2025, with the ALJ granting the joint motion to take administrative notice in part and denied it in part. Initial and reply briefs were filed on June 20, 2025 and July 7, 2025, respectively. On July 21, 2025, the Ohio Companies filed a motion to strike, to which the PUCO staff and other intervenors responded on August 5, 2025. The Ohio Companies filed their reply brief on August 12, 2025. An order is anticipated in November 2025.\nOn May 15, 2025, the Ohio Governor signed legislation known as HB 15 that, among other things, eliminates ESPs, requires triennial base rate cases and allows them to be based on a three-year forecasted test period, expedites PUCO review and disposition of future base rate cases, imposes annual reliability reporting, increases protections for customers shopping with third-party suppliers, requires EDUs to develop and publicly share distribution system hosting capacity maps, and reduces certain transmission and distribution property taxes beginning with property in-serviced in 2026. The legislation became effective August 14, 2025.\nRegulatory Matters - West Virginia\nOn October 1, 2025, MP and PE filed their integrated resource plan with the WVPSC. To ensure that MP and PE can meet their PJM adequacy requirements, the plan proposes, among other things, near-term market capacity purchases, and the addition of \n57\n70 MWs of solar generation by 2028 and 1,200 MWs of natural gas combined cycle generation by 2031, which are expected to require a capital investment that is currently estimated to total approximately $2.5 billion. A procedural order is expected from the WVPSC by the end of 2025, and MP and PE expect to seek approval to build or acquire a natural gas combined cycle plant from the WVPSC in the first quarter of 2026.\nHB 6 and Related Investigations\nOn July 21, 2021, FE entered into a three-year DPA with the U.S. Attorney’s Office that, subject to court proceedings, resolves the U.S. Attorney’s Office investigation into FirstEnergy relating to FirstEnergy’s lobbying and governmental affairs activities concerning HB 6 related to the federal criminal allegations made in July 2020, against former Ohio House Speaker Larry Householder and other individuals and entities allegedly affiliated with Mr. Householder. Among other things under the DPA, FE paid a $230 million monetary penalty in 2021 and agreed to the filing of a criminal information charging FE with one count of conspiracy to commit honest services wire fraud. The $230 million payment will neither be recovered in rates or charged to FirstEnergy customers, nor will FirstEnergy seek any tax deduction related to such payment. As of July 22, 2024, FirstEnergy had successfully completed the obligations required within the three-year term of the DPA. Under the DPA, FirstEnergy has an obligation to continue: (i) publishing quarterly a list of all payments to 501(c)(4) entities and all payments to entities known by FirstEnergy operating for the benefit of a public official, either directly or indirectly; (ii) not making any statements that contradict the DPA; (iii) notifying the U.S. Attorney’s Office of any changes in FirstEnergy’s corporate form; and (iv) cooperating with the U.S. Attorney’s Office until the conclusion of any related investigation, criminal prosecution, and civil proceeding brought by the U.S. Attorney’s Office, including the January 17, 2025, indictment against two former FirstEnergy senior officers, as described below in “Outlook -- Other Legal Proceedings - \nU.S. v. Larry Householder, et al.\n”. Within 30 days of those matters concluding, and FirstEnergy’s successful completion of its remaining obligations, the U.S. Attorney’s Office will dismiss the criminal information.\nDespite these events, FirstEnergy has faced, the leadership team remains committed and focused on executing its strategy and running the business. See “Outlook - Other Legal Proceedings” below for additional details on the government investigations, the DPA, and ongoing litigation surrounding the investigation of HB 6. See also “Outlook - State Regulation - Ohio” below for details on the PUCO proceeding reviewing political and charitable spending and legislative activity in response to the investigation of HB 6. The outcome of the PUCO proceedings, legislative activity, and any of these lawsuits is uncertain and could have a material adverse effect on FirstEnergy’s financial condition, results of operations and cash flows.\n58\nSummary of Results of Operations — Third Quarter 2025 Compared with Third Quarter 2024 \nFinancial results for FirstEnergy’s business segments for the third quarter of 2025 and 2024 were as follows:\nThird Quarter 2025 Financial Results\n(In millions)\nDistribution\nIntegrated\nStand-Alone Transmission\nCorporate/Other and Reconciling Adjustments\nFirstEnergy Consolidated\nRevenues:\n \n \n \nElectric\n$\n1,977 \n$\n1,640 \n$\n483 \n$\n4 \n$\n4,104 \nOther\n43 \n13 \n5 \n(17)\n44 \nTotal Revenues\n2,020 \n1,653 \n488 \n(13)\n4,148 \nOperating Expenses:\n \n \n \n \nFuel\n— \n163 \n— \n— \n163 \nPurchased power\n681 \n655 \n— \n5 \n1,341 \nOther operating expenses\n570 \n337 \n75 \n(6)\n976 \nProvision for depreciation\n165 \n141 \n92 \n19 \n417 \nAmortization of regulatory assets, net\n46 \n42 \n1 \n— \n89 \nGeneral taxes\n209 \n37 \n73 \n13 \n332 \nTotal Operating Expenses\n1,671 \n1,375 \n241 \n31 \n3,318 \nOther Income (Expense):\n \n \n \n \nEquity method investment earnings, net\n— \n— \n— \n— \n— \nMiscellaneous income (expense), net\n22 \n22 \n4 \n(7)\n41 \nInterest expense\n(101)\n(75)\n(83)\n(53)\n(312)\nCapitalized financing costs\n8 \n18 \n24 \n1 \n51 \nTotal Other Expense\n(71)\n(35)\n(55)\n(59)\n(220)\nIncome taxes (benefits)\n48 \n60 \n(21)\n(9)\n78 \nIncome attributable to noncontrolling interest\n— \n— \n91 \n— \n91 \nEarnings (Loss) Attributable to FE\n$\n230 \n$\n183 \n$\n122 \n$\n(94)\n$\n441 \nThird Quarter 2024 Financial Results\n(In millions)\nDistribution\nIntegrated\nStand-Alone Transmission\nCorporate/Other and Reconciling Adjustments\nFirstEnergy Consolidated\nRevenues:\n \n \n \nElectric\n$\n1,775 \n$\n1,432 \n$\n470 \n$\n2 \n$\n3,679 \nOther\n42 \n20 \n5 \n(17)\n50 \nTotal Revenues\n1,817 \n1,452 \n475 \n(15)\n3,729 \nOperating Expenses:\n \n \n \n \nFuel\n— \n139 \n— \n— \n139 \nPurchased power\n571 \n508 \n— \n7 \n1,086 \nOther operating expenses\n644 \n349 \n113 \n(7)\n1,099 \nProvision for depreciation\n163 \n132 \n84 \n21 \n400 \nAmortization (deferral) of regulatory assets, net\n(55)\n20 \n2 \n— \n(33)\nGeneral taxes\n196 \n34 \n70 \n11 \n311 \nTotal Operating Expenses\n1,519 \n1,182 \n269 \n32 \n3,002 \nOther Income (Expense):\n \n \n \n \nEquity method investment earnings, net\n— \n— \n— \n21 \n21 \nMiscellaneous income, net\n28 \n13 \n7 \n5 \n53 \nInterest expense\n(106)\n(62)\n(70)\n(38)\n(276)\nCapitalized financing costs\n7 \n12 \n16 \n— \n35 \nTotal Other Expense\n(71)\n(37)\n(47)\n(12)\n(167)\nIncome taxes (benefits)\n34 \n36 \n40 \n(16)\n94 \nIncome attributable to noncontrolling interest\n— \n— \n47 \n— \n47 \nEarnings (Loss) Attributable to FE\n$\n193 \n$\n197 \n$\n72 \n$\n(43)\n$\n419 \n59\nChanges Between Third Quarter 2025 and Third Quarter 2024 Financial Results\n(In millions)\nDistribution\nIntegrated\nTransmission\nCorporate/Other and Reconciling Adjustments\nFirstEnergy Consolidated\nRevenues:\n \n \n \nElectric\n$\n202 \n$\n208 \n$\n13 \n$\n2 \n$\n425 \nOther\n1 \n(7)\n— \n— \n(6)\nTotal Revenues\n203 \n201 \n13 \n2 \n419 \nOperating Expenses:\n \n \n \n \nFuel\n— \n24 \n— \n— \n24 \nPurchased power\n110 \n147 \n— \n(2)\n255 \nOther operating expenses\n(74)\n(12)\n(38)\n1 \n(123)\nProvision for depreciation\n2 \n9 \n8 \n(2)\n17 \nAmortization (deferral) of regulatory assets, net\n101 \n22 \n(1)\n— \n122 \nGeneral taxes\n13 \n3 \n3 \n2 \n21 \nTotal Operating Expenses\n152 \n193 \n(28)\n(1)\n316 \nOther Income (Expense):\n \n \n \n \nEquity method investment earnings, net\n— \n— \n— \n(21)\n(21)\nMiscellaneous income (expense), net\n(6)\n9 \n(3)\n(12)\n(12)\nInterest expense\n5 \n(13)\n(13)\n(15)\n(36)\nCapitalized financing costs\n1 \n6 \n8 \n1 \n16 \nTotal Other Expense\n— \n2 \n(8)\n(47)\n(53)\nIncome taxes (benefits)\n14 \n24 \n(61)\n7 \n(16)\nIncome attributable to noncontrolling interest\n— \n— \n44 \n— \n44 \nEarnings (Loss) Attributable to FE\n$\n37 \n$\n(14)\n$\n50 \n$\n(51)\n$\n22 \n60\nDistribution Segment — Third Quarter of 2025 Compared with Third Quarter of 2024\nDistribution segment’s earnings attributable to FE increased $37 million in the third quarter of 2025, as compared to the same period of 2024, primarily resulting from higher revenues associated with the implementation of the Pennsylvania base rate case, higher customer usage and demand and the absence of an impairment charge related to the Akron general office in the third quarter of 2024, partially offset by higher planned operating expenses.\nRevenues — \nDistribution segment’s total revenues increased $203 million as a result of the following sources: \nFor the Three Months Ended September 30,\nRevenues by Type of Service\n2\n2025\n2024\nIncrease\n(In millions)\nDistribution services\n$\n1,239 \n2 \n$\n1,133 \n$\n106 \nGeneration sales:\nRetail\n732 \n640 \n92 \nWholesale\n6 \n2 \n4 \nTotal generation sales\n738 \n642 \n96 \nOther\n43 \n42 \n1 \nTotal Revenues\n$\n2,020 \n$\n1,817 \n$\n203 \n \nDistribution services revenues increased $106 million in the third quarter of 2025, as compared to the same period of 2024, primarily resulting from higher revenues associated with the implementation of the Pennsylvania base rate case, higher customer usage and demand and lower customer credits associated with the PUCO-approved Ohio Stipulation. Additionally, revenues increased due to the higher recovery of transmission expenses, which have no material impact to earnings. \nGeneration sales revenues increased $96 million in the third quarter of 2025, as compared to the same period in 2024, primarily due to higher retail generation sales as a result of higher non-shopping generation auction rates in Pennsylvania and higher sales volumes due to lower shopping and higher customer usage and demand. Total generation provided by alternative suppliers as a percentage of total MWh deliveries for the Ohio Companies and FE PA decreased to 89% from 90% in Ohio and to 62% from 63% in Pennsylvania in the third quarter of 2025, as compared to the same period of 2024. Retail and wholesale generation sales revenues have no material impact to earnings. \nOperating Expenses —\nTotal operating expenses increased $152 million, primarily due to:\n•\nPurchased power costs, which have no material impact to earnings, increased $110 million during the third quarter of 2025, as compared to the same period of 2024, primarily due to higher unit costs and sales volumes. \n•\nOther operating expenses decreased $74 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to:\n•\nLower storm restoration expenses of $113 million, which were mostly deferred for future recovery; and\n•\nThe absence of a $31 million impairment charge related to the Akron general office in the third quarter of 2024.\nThe decrease was partially offset by:\n•\nHigher network transmission expenses of $13 million, which are deferred for future recovery, resulting in no material impact to earnings;\n•\nHigher planned vegetation management expenses of $12 million, primarily in Pennsylvania as approved and recovering in the base rate case;\n•\nHigher uncollectible expenses of $14 million, of which $4 million were deferred for future recovery; \n•\nHigher energy efficiency and other state mandated program costs of $15 million, which were deferred for future recovery, resulting in no material impact to earnings; and\n•\nHigher other operating expenses of $16 million, primarily due to higher employee benefit costs and higher material and contractor spend, partially offset by increased construction support and lower maintenance work.\n•\nDepreciation expense increased $2 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to a higher asset base. \n•\nDeferral of regulatory assets decreased $101 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to a $107 million decrease from lower deferred storm restoration expenses and a $21 million net decrease in other deferrals, partially offset by a $17 million net increase in generation and transmission related deferrals and $10 million of higher net amortization expenses resulting from recovery of previously deferred storm costs and customer assistance programs from the implementation of the Pennsylvania base rate case in 2025.\n•\nGeneral taxes increased $13 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to higher property and gross receipts taxes. \nOther Expense —\nOther expense was flat in the third quarter of 2025, as compared to the same period of 2024, primarily due to lower interest expense as a result of long-term debt redemptions since the third quarter of 2024 and lower average short-term borrowings being offset by lower interest income on regulated money pool investments. \nIncome Taxes —\nDistribution segment’s effective tax rate was 17.3% and 15.0% for the three months ended September 30, 2025 and 2024, respectively. The increase in the effective tax rate was primarily due to a lesser impact of permanent tax benefits on pre-tax book income.\nIntegrated Segment — Third Quarter of 2025 Compared with Third Quarter of 2024 \nIntegrated segment’s earnings attributable to FE decreased $14 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to higher revenues from regulated investment programs, the absence of a tax benefit recognized in 2024, lower customer usage and demand, and higher planned operating expenses.\nRevenues — \nIntegrated segment’s total revenues increased $201 million as a result of the following sources:\nFor the Three Months Ended September 30,\nRevenues by Type of Service\n2\n2025\n2024\nIncrease (Decrease)\n(In millions)\nDistribution services\n$\n498 \n$\n504 \n$\n(6)\nGeneration sales:\nRetail\n904 \n792 \n112 \nWholesale\n129 \n50 \n79 \nTotal generation sales\n$\n1,033 \n$\n842 \n$\n191 \nTransmission revenues:\nJCP&L\n67 \n56 \n11 \nMP & PE\n42 \n30 \n12 \nTotal transmission revenues\n$\n109 \n$\n86 \n$\n23 \nOther\n13 \n20 \n(7)\nTotal Revenues\n$\n1,653 \n$\n1,452 \n$\n201 \n \nDistribution services revenues decreased $6 million in the third quarter of 2025, as compared to the same period of 2024, primarily resulting from lower customer usage and demand.\nGeneration sales revenues increased $191 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to:\n•\nRetail generation sales increased $112 million in the third quarter of 2025, as compared to the same period in 2024, primarily due to higher non-shopping generation auction rates, partially offset by lower customer usage. Retail generation sales, other than those in West Virginia, have no material impact to earnings. \n•\nWholesale generation revenues increased $79 million in the third quarter of 2025, as compared to the same period in 2024, primarily due to higher capacity revenues and wholesale rates, partially offset by lower sales volumes. The \ndifference between current wholesale generation revenues and certain energy costs incurred is deferred for future recovery or refund, with no material impact to earnings. \nTransmission revenues increased $23 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to regulated capital investments that increased rate base, partially offset by recovery of lower transmission operating expenses.\nOperating Expenses —\nTotal operating expenses increased $193 million, primarily due to:\n•\nFuel costs increased $24 million during the third quarter of 2025, as compared to the same period of 2024, primarily due to higher unit costs, partially offset by lower consumption volumes. Due to the ENEC, fuel expense has no material impact to earnings. \n•\nPurchased power costs, which have no material impact to earnings, increased $147 million during the third quarter of 2025, as compared to the same period of 2024, primarily due to higher unit costs and capacity expenses, partially offset by lower sales volumes. \n•\nOther operating expenses decreased $12 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to:\n•\nThe absence of a $17 million impairment charge related to the Akron general office in the third quarter of 2024; and\n•\nLower storm restoration expenses of $37 million, which were mostly deferred for future recovery.\nThe decrease was partially offset by:\n•\nHigher energy efficiency and other state mandated program costs of $20 million, which were deferred for future recovery, resulting in no material impact to earnings; and\n•\nHigher other operating expenses of $22 million, primarily due to higher employee benefit costs, higher material and contractor spend and higher regulated generation outage spend, partially offset by increased construction support and lower maintenance work. \n•\nDepreciation expense increased $9 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to a higher asset base. \n•\nAmortization of regulatory assets increased $22 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to $27 million in lower deferral of storm related expenses and a $1 million net decrease from lower generation and transmission related deferrals, partially offset by a $6 million net increase in other deferrals.\nOther Expense —\nOther expense decreased $2 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to lower interest expense as a result of lower average short-term borrowings and higher capitalized interest, partially offset by higher interest from new debt issuances since the third quarter of 2024.\nIncome Taxes —\nIntegrated segment’s effective tax rate was 24.7% and 15.5% for the three months ended September 30, 2025 and 2024, respectively. The increase in the effective tax rate was primarily due to the absence of a tax benefit related to a remeasurement of excess deferred income taxes recognized in 2024.\n61\nStand-Alone Transmission Segment — Third Quarter of 2025 Compared with Third Quarter of 2024\nStand-Alone Transmission Segment’s earnings attributable to FE increased $50 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to a discrete tax benefit related to a remeasurement of excess deferred income taxes and higher revenues from regulated capital investments that increased rate base, partially offset by the expected elimination of the 50 basis point ROE adder associated with ATSI’s RTO membership as a result of the Sixth Circuit ruling in January 2025.\nRevenues —\nStand-Alone Transmission’s total revenues increased $13 million, primarily due to higher rate base, partially offset by the recovery of lower operating expenses and the expected elimination of the 50 basis point ROE adder associated with ATSI’s RTO membership as a result of the Sixth Circuit ruling in January 2025. \n The following table shows revenues by transmission asset owner:\nFor the Three Months Ended September 30,\nRevenues by Transmission Asset Owner\n1\n2025\n2024\nIncrease (Decrease)\n(In millions)\nATSI\n$\n275 \n$\n265 \n$\n10 \nTrAIL\n68 \n69 \n(1)\nMAIT\n121 \n117 \n4 \nKATCo\n24 \n24 \n— \nTotal Revenues\n$\n488 \n$\n475 \n$\n13 \nOperating Expenses —\nTotal operating expenses decreased $28 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to lower operating and maintenance expenses and the absence of an $11 million impairment charge associated with the Akron general office in the third quarter of 2024, partially offset by higher depreciation and property tax expenses from a higher asset base. Other than the impairment charge, nearly all operating expenses are recovered through formula rates. \nOther Expense —\nTotal other expense increased $8 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to higher interest expenses from new long-term debt issuances, partially offset by higher capitalized financing costs.\nIncome Taxes —\nStand-Alone Transmission’s effective tax rate was (10.9)% and 25.2% for the three months ended September 30, 2025 and 2024, respectively. The decrease in the effective tax rate was primarily due to a tax benefit related to a remeasurement of excess deferred income taxes recognized in 2025. \nCorporate / Other — Third Quarter 2025 Compared with Third Quarter 2024\nFinancial results at Corporate/Other resulted in a $51 million increase in losses attributable to FE in the third quarter of 2025, as compared to the same period of 2024, primarily due to:\n•\n$16 million (after-tax) in lower investment earnings related to FEV’s equity method investment in Global Holding, which, as discussed above, was sold on July 16, 2025;\n•\nThe absence of income tax benefits recognized in 2024 related to deductions associated with certain equity method investments and tax expense recognized in 2025 related to the FET Equity Interest Sale;\n•\n$7 million (after-tax) due to higher interest expense as a result of the issuance of the 2029 Convertible Notes and the 2031 Convertible Notes;\n•\n$6 million (after-tax) due to higher investigation-related legal and advisory expenses associated with the government investigations; and\n•\n$5 million (after-tax) due to lower pension/OPEB non-service credits.\n62\nSummary of Results of Operations — First Nine Months of 2025 Compared with First Nine Months of 2024\nFinancial results for FirstEnergy’s business segments for the first nine months of 2025 and 2024 were as follows:\nFirst Nine Months 2025 Financial Results\n(In millions)\nDistribution\nIntegrated\nStand-Alone Transmission\nCorporate/Other and Reconciling Adjustments\nFirstEnergy Consolidated\nRevenues:\n \n \n \nElectric\n$\n5,508 \n$\n4,228 \n$\n1,420 \n$\n12 \n$\n11,168 \nOther\n123 \n35 \n15 \n(48)\n125 \nTotal Revenues\n5,631 \n4,263 \n1,435 \n(36)\n11,293 \nOperating Expenses:\n \n \n \n \nFuel\n— \n480 \n— \n— \n480 \nPurchased power\n1,808 \n1,559 \n— \n15 \n3,382 \nOther operating expenses\n1,831 \n980 \n247 \n(53)\n3,005 \nProvision for depreciation\n490 \n418 \n275 \n60 \n1,243 \nAmortization (deferral) of regulatory assets, net\n(71)\n47 \n4 \n— \n(20)\nGeneral taxes\n605 \n108 \n222 \n38 \n973 \nTotal Operating Expenses\n4,663 \n3,592 \n748 \n60 \n9,063 \nOther Income (Expense):\n \n \n \n \nDebt redemption costs\n— \n— \n— \n(24)\n(24)\nEquity method investment earnings\n— \n— \n— \n— \n— \nMiscellaneous income (expense), net \n73 \n59 \n17 \n(31)\n118 \nInterest expense\n(301)\n(208)\n(237)\n(153)\n(899)\nCapitalized financing costs\n20 \n48 \n61 \n2 \n131 \nTotal Other Expense\n(208)\n(101)\n(159)\n(206)\n(674)\nIncome taxes (benefits)\n151 \n135 \n55 \n(49)\n292 \nIncome attributable to noncontrolling interest\n— \n— \n195 \n— \n195 \nEarnings (Loss) Attributable to FE\n$\n609 \n$\n435 \n$\n278 \n$\n(253)\n$\n1,069 \nFirst Nine Months 2024 Financial Results\n(In millions)\nDistribution\nIntegrated\nStand-Alone Transmission\nCorporate/Other and Reconciling Adjustments\nFirstEnergy Consolidated\nRevenues:\n \n \n \nElectric\n$\n5,110 \n$\n3,676 \n$\n1,367 \n$\n6 \n$\n10,159 \nOther\n122 \n49 \n14 \n(48)\n137 \nTotal Revenues\n5,232 \n3,725 \n1,381 \n(42)\n10,296 \nOperating Expenses:\n \n \n \n \nFuel\n— \n372 \n— \n— \n372 \nPurchased power\n1,723 \n1,260 \n— \n16 \n2,999 \nOther operating expenses\n1,871 \n1,041 \n280 \n83 \n3,275 \nProvision for depreciation\n486 \n386 \n249 \n57 \n1,178 \nAmortization (deferral) of regulatory assets, net\n(152)\n(58)\n5 \n— \n(205)\nGeneral taxes\n569 \n104 \n209 \n33 \n915 \nTotal Operating Expenses\n4,497 \n3,105 \n743 \n189 \n8,534 \nOther Income (Expense):\n \n \n \n \nDebt redemption costs\n— \n— \n— \n(85)\n(85)\nEquity method investment earnings\n— \n— \n— \n64 \n64 \nMiscellaneous income, net\n101 \n39 \n12 \n4 \n156 \nInterest expense\n(331)\n(198)\n(201)\n(136)\n(866)\nCapitalized financing costs\n17 \n33 \n43 \n1 \n94 \nTotal Other Expense\n(213)\n(126)\n(146)\n(152)\n(637)\nIncome taxes (benefits)\n96 \n107 \n141 \n(50)\n294 \nIncome attributable to noncontrolling interest\n— \n— \n114 \n— \n114 \nEarnings (Loss) Attributable to FE\n$\n426 \n$\n387 \n$\n237 \n$\n(333)\n$\n717 \n63\nChanges Between First Nine Months 2025 and First Nine Months 2024 Financial Results\n(In millions)\nDistribution\nIntegrated\nStand-Alone Transmission\nCorporate/Other and Reconciling Adjustments\nFirstEnergy Consolidated\nRevenues:\n \n \n \nElectric\n$\n398 \n$\n552 \n$\n53 \n$\n6 \n$\n1,009 \nOther\n1 \n(14)\n1 \n— \n(12)\nTotal Revenues\n399 \n538 \n54 \n6 \n997 \nOperating Expenses:\n \n \n \n \nFuel\n— \n108 \n— \n— \n108 \nPurchased power\n85 \n299 \n— \n(1)\n383 \nOther operating expenses\n(40)\n(61)\n(33)\n(136)\n(270)\nProvision for depreciation\n4 \n32 \n26 \n3 \n65 \nAmortization (deferral) of regulatory assets, net\n81 \n105 \n(1)\n— \n185 \nGeneral taxes\n36 \n4 \n13 \n5 \n58 \nTotal Operating Expenses\n166 \n487 \n5 \n(129)\n529 \nOther Income (Expense):\n \n \n \n \nDebt redemption costs\n— \n— \n— \n61 \n61 \nEquity method investment earnings\n— \n— \n— \n(64)\n(64)\nMiscellaneous income (expense), net\n(28)\n20 \n5 \n(35)\n(38)\nInterest expense\n30 \n(10)\n(36)\n(17)\n(33)\nCapitalized financing costs\n3 \n15 \n18 \n1 \n37 \nTotal Other Expense\n5 \n25 \n(13)\n(54)\n(37)\nIncome taxes (benefits)\n55 \n28 \n(86)\n1 \n(2)\nIncome attributable to noncontrolling interest\n— \n— \n81 \n— \n81 \nEarnings (Loss) Attributable to FE\n$\n183 \n$\n48 \n$\n41 \n$\n80 \n$\n352 \n64\nDistribution Segment — First Nine Months of 2025 Compared with First Nine Months of 2024 \nDistribution segment’s earnings attributable to FE increased $183 million in the first nine months of 2025, as compared to the same period of 2024, primarily resulting from higher customer usage due to colder weather temperatures in the first quarter, higher revenues associated with the implementation of the Pennsylvania base rate case and lower operating expenses, partially offset by milder weather temperatures in the second quarter that lowered customer usage and demand.\nRevenues — \nDistribution segment’s total revenues increased $399 million as a result of the following sources:\nFor the Nine Months Ended September 30, \nRevenues by Type of Service\n2025\n2024\nIncrease\n(In millions)\nDistribution services\n$\n3,474 \n$\n3,169 \n$\n305 \nGeneration sales:\nRetail\n2,024 \n1,937 \n87 \nWholesale\n10 \n4 \n6 \nTotal generation sales\n2,034 \n1,941 \n93 \nOther\n123 \n122 \n1 \nTotal Revenues\n$\n5,631 \n$\n5,232 \n$\n399 \n \nDistribution services revenues increased $305 million in the first nine months of 2025, as compared to the same period of 2024, primarily resulting from higher customer usage due to colder weather temperatures in the first quarter, lower customer credits associated with the PUCO-approved Ohio Stipulation, and higher revenues associated with the implementation of the Pennsylvania base rate case, partially offset by milder weather temperatures in the second quarter that lowered customer usage and demand. Additionally, revenues increased due to the higher recovery of transmission expenses, which have no material impact to earnings.\nGeneration sales revenues increased $93 million in the first nine months of 2025, as compared to the same period in 2024, primarily due to higher non-shopping generation auction rates, higher retail generation sales volumes as a result of colder weather temperatures in the first quarter, and lower shopping, which increased sales volumes. Total generation provided by alternative suppliers as a percentage of total MWh deliveries for the Ohio Companies and FE PA decreased to 89% from 90% in Ohio and to 62% from 63% in Pennsylvania in the first nine months of 2025, as compared to the same period of 2024. Retail and wholesale generation sales revenue have no material impact to earnings. \nOperating Expenses —\nTotal operating expenses increased $166 million, primarily due to:\n•\nPurchased power costs, which have no material impact to earnings, increased $85 million during the first nine months of 2025, as compared to the same period of 2024, primarily due to higher unit costs and generation sales volumes as described above. \n•\nOther operating expenses decreased $40 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to:\n•\nThe absence of a $46 million charge during the second quarter of 2024 related to changes in ARO liabilities associated with CCR rules;\n•\nThe absence of a $32.5 million contribution commitment by the Ohio Companies, as a result of the PUCO’s ESP V order in the second quarter of 2024; \n•\nThe absence of a $31 million impairment charge related to the Akron general office in the third quarter of 2024; and\n•\nLower storm restoration expenses of $97 million, which were mostly deferred for future recovery.\nThe decrease was partially offset by:\n•\nHigher network transmission expenses of $57 million, which are deferred for future recovery, resulting in no material impact to earnings;\n•\nHigher planned vegetation management expenses of $20 million, primarily in Pennsylvania as approved and recovering in the base rate case;\n•\nHigher uncollectible expenses of $23 million, of which $12 million were deferred for future recovery; and\n•\nHigher energy efficiency and other state mandated program costs of $49 million, which were deferred for future recovery, resulting in no material impact to earnings; and\n•\nHigher other operating expense of $18 million, primarily due to severance and related costs associated with FirstEnergy’s organizational changes announced in the first quarter of 2025 and higher employee benefit costs, partially offset by increased construction support and lower maintenance work.\n•\nDepreciation expense increased $4 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to a higher asset base. \n•\nDeferral of regulatory assets decreased $81 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to an $85 million decrease from lower deferred storm restoration expenses, a $21 million net decrease in generation and transmission related deferrals, and a $7 million net decrease in other deferrals, partially offset by $32 million of higher net amortization expenses resulting from recovery of previously deferred storm costs and customer assistance programs from the implementation of the Pennsylvania base rate case in 2025.\n•\nGeneral taxes increased $36 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to higher property and gross receipts taxes. \nOther Expense —\nOther expense decreased $5 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to lower interest expense as a result of debt redemptions since the third quarter of 2024 and higher capitalized interest, partially offset by lower interest income on regulated money pool investments and new debt issuances since the third quarter of 2024.\nIncome Taxes —\nDistribution segment’s effective tax rate was 19.9% and 18.4% for the nine months ended September 30, 2025 and 2024, respectively. \nIntegrated Segment — First Nine Months of 2025 Compared with First Nine Months of 2024 \nIntegrated segment’s earnings attributable to FE increased $48 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to the implementation of base rate cases in New Jersey and West Virginia, higher customer usage and demand, higher revenues from regulated investment programs, and the absence of a $53 million charge at JCP&L in connection with the base rate case settlement agreement in the first quarter of 2024, as further discussed below, partially offset by costs associated with the announced organizational changes and the absence of a benefit associated with the approval by the WVPSC to recover costs of certain retired generation stations in the first quarter of 2024.\nRevenues — \nIntegrated segment’s total revenues increased $538 million as a result of the following sources:\nFor the Nine Months Ended September 30, \nRevenues by Type of Service\n2025\n2024\nIncrease (Decrease)\n(In millions)\nDistribution services\n1,312 \n1,224 \n$\n88 \nGeneration sales:\nRetail\n2,342 \n2,051 \n291 \nWholesale\n254 \n118 \n136 \nTotal generation sales\n2,596 \n2,169 \n427 \nTransmission revenues:\nJCP&L\n191 \n175 \n16 \nMP & PE\n129 \n108 \n21 \nTotal transmission revenues\n320 \n283 \n37 \nOther\n35 \n49 \n(14)\nTotal Revenues\n$\n4,263 \n$\n3,725 \n$\n538 \n \nDistribution services revenues increased $88 million in the first nine months of 2025, as compared to the same period of 2024, primarily resulting from higher customer usage as a result of colder weather temperatures in the first quarter, higher revenues \nfrom the implementation of base rate cases, and higher rider revenues associated with certain regulated investment programs, partially offset by lower customer usage as a result of the milder weather temperatures in the second and third quarter. Additionally, revenues increased due to the higher recovery of transmission expenses, which have no material impact to earnings. \nGeneration sales revenues increased $427 million in the first nine months of 2025, as compared to the same period of 2024. \n•\nRetail generation sales increased $291 million in the first nine months of 2025, as compared to the same period in 2024, primarily due to higher non-shopping generation auction rates and higher volumes as a result of colder weather temperatures in the first quarter. Retail generation sales, other than those in West Virginia, have no material impact to earnings. \n•\nWholesale generation revenues increased $136 million in the first nine months of 2025, as compared to the same period in 2024, primarily due to higher sales volumes, wholesale rates and capacity revenues. The difference between current wholesale generation revenues and certain energy costs incurred is deferred for future recovery or refund, with no material impact to earnings. \nTransmission revenues increased $37 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to higher rate base from regulated investment programs, partially offset by recovery of lower transmission operating expenses.\nOperating Expenses —\nTotal operating expenses increased $487 million, primarily due to:\n•\nFuel costs increased $108 million during the first nine months of 2025, as compared to the same period of 2024, primarily due to higher unit costs and higher consumption volumes. Due to the ENEC, fuel expense has no material impact to earnings. \n•\nPurchased power costs, which have no material impact to earnings, increased $299 million during the first nine months of 2025, as compared to the same period of 2024, primarily due to higher unit costs and capacity expenses.\n•\nOther operating expenses decreased $61 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to:\n•\nThe absence of a $53 million pre-tax charge at JCP&L in the first quarter 2024 associated with certain corporate support costs recorded to capital accounts from the FERC Audit that were determined, as a result of the base rate case settlement agreement, to be disallowed from future recovery;\n•\nThe absence of a $16 million charge related to changes in ARO liabilities associated with CCR rules in 2024;\n•\nThe absence of a $17 million impairment charge related to the Akron general office in the third quarter of 2024;\n•\nLower storm restoration expenses of $55 million, which were mostly deferred for future recovery; and\n•\nLower formula rate transmission operating and maintenance expenses of $5 million, which have no material impact to earnings.\nThe decrease was partially offset by:\n•\nHigher network transmission expenses of $21 million, which were deferred for future recovery, resulting in no material impact to earnings;\n•\nHigher uncollectible expenses of $3 million, which were deferred for future recovery; \n•\nHigher other operating expenses of $11 million, primarily due to severance and related costs associated with FirstEnergy’s organizational changes announced in the first quarter of 2025, higher employee benefit costs, higher material and contractor spend and regulated generation outage spend, partially offset by increased construction support and lower maintenance work; and\n•\nHigher energy efficiency and other state mandated program costs of $50 million, which were deferred for future recovery, resulting in no material impact to earnings.\n•\nDepreciation expense increased $32 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to a higher asset base and new depreciation rates that went into effect on April 1, 2024.\n•\nDeferral of regulatory assets decreased $105 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to the absence of the approval in the first quarter of 2024 to recover $60 million in costs of certain retired generation stations approved by the WVPSC, $61 million in lower deferral of storm related expenses including the absence of the approval in the first quarter of 2024 to recover $11 million in previously incurred storm costs, and a $23 million decrease due to the absence of the amortization of a regulatory liability related to customer refunds in 2024, partially offset by $6 million related to net increases in other deferrals and a $33 million net increase from higher \ngeneration and transmission related deferrals.\n•\nGeneral taxes increased $4 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to higher gross receipts taxes. \nOther Expense —\nOther expense decreased $25 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to the absence of certain nonrecoverable charges recognized in the first quarter of 2024, lower interest expense as a result of lower average short-term borrowings and higher capitalized interest, partially offset by higher interest from debt issuances since the third quarter of 2024. \nIncome Taxes —\nIntegrated segment’s effective tax rate was 23.7% and 21.7% for the nine months ended September 30, 2025 and 2024, respectively. The increase in the effective tax rate was primarily due to the absence of a tax benefit related to a remeasurement of excess deferred income taxes recognized in the third quarter of 2024, partially offset by the absence of a tax charge recognized in the first quarter of 2024 related to the remeasurement of a valuation allowance for the expected utilization of certain NOL carryforwards.\nStand-Alone Transmission Segment — First Nine Months of 2025 Compared with First Nine Months of 2024\nStand-Alone Transmission Segment’s earnings attributable to FE increased $41 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to a discrete tax benefit related to a remeasurement of excess deferred income taxes in the third quarter of 2025, the absence of a discrete tax charge related to the FET Equity Interest Sale in the first quarter of 2024, and higher revenues from regulated capital investments that increased rate base, partially offset by the dilutive effect of the FET Equity Interest Sale that closed in March 2024, the expected elimination of the 50 basis point ROE adder associated with ATSI’s RTO membership as a result of the Sixth Circuit ruling in January 2025, and true-up adjustments from the annual forward looking transmission rate filings.\nRevenues —\nStand-Alone Transmission’s total revenues increased $54 million, primarily due to a higher rate base and recovery of higher transmission operating expenses, partially offset by the expected elimination of the 50 basis point ROE adder associated with ATSI’s RTO membership as a result of the Sixth Circuit ruling in January 2025, and true-up adjustments from the annual forward looking transmission rate filings.\n The following table shows revenues by transmission asset owner:\nFor the Nine Months Ended September 30, \nRevenues by Transmission Asset Owner\n2025\n2024\nIncrease (Decrease)\n(In millions)\nATSI\n$\n799 \n$\n774 \n$\n25 \nTrAIL\n201 \n209 \n(8)\nMAIT\n367 \n333 \n34 \nKATCo\n68 \n67 \n1 \nOther\n— \n(2)\n2 \nTotal Revenues\n$\n1,435 \n$\n1,381 \n$\n54 \nOperating Expenses —\nTotal operating expenses increased $5 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to higher depreciation and property tax expenses from a higher asset base, partially offset by lower operating and maintenance expenses and the absence of an $11 million impairment charge associated with the Akron general office in the third quarter of 2024. Other than the impairment charge, nearly all operating expenses are recovered through formula rates.\nOther Expense —\nTotal other expense increased $13 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to higher interest expenses from new long-term debt issuances, partially offset by higher capitalized financing costs and the absence of a prior year non-recoverable charge.\nIncome Taxes —\nStand-Alone Transmission’s effective tax rate was\n \n10.4% and 28.7% for the nine months ended September 30, 2025 and 2024, respectively. The decrease in the effective tax rate was primarily due to a tax benefit related to a remeasurement of excess deferred income taxes recognized in the third quarter of 2025, and the absence of a tax charge related to the FET Equity Interest Sale in the first quarter of 2024. \nCorporate / Other — First Nine Months of 2025 Compared with First Nine Months of 2024\nFinancial results at Corporate/Other resulted in a $80 million decrease in losses attributable to FE in the first nine months of 2025, as compared to the same period of 2024, primarily due to:\n•\nThe absence of the previously-disclosed $100 million civil penalty resulting from the SEC investigation and the $19.5 million settlement with the OAG’s office, which were both recorded as loss contingencies in the second quarter of 2024;\n•\n$115 million (after-tax) due to the absence of a charge related to changes in ARO liabilities associated with CCR rules and McElroy’s Run in the second quarter of 2024; and\n•\n$46 million (after-tax) of lower debt redemption costs.\nThe decrease in losses were partially offset by:\n•\n$116 million (after-tax) due to the absence of net proceeds from the shareholder derivative lawsuit settlement received in the second quarter of 2024;\n•\n$49 million (after-tax) in lower investment earnings related to FEV’s equity method investment in Global Holding, which as discussed above, was sold on July 16, 2025;\n•\nThe absence of $19 million (after-tax) of interest income related to the FET Equity Interest Sale, the purchase price of which was paid in part by the issuance of promissory notes; \n•\n$14 million (after-tax) due to lower pension/OPEB non-service credits; and\n•\nThe absence of income tax benefits recognized in 2024 related to deductions associated with certain equity method investments and tax expense recognized in 2025 related to the FET Equity Interest Sale, partially offset by the absence of a discrete tax charge related to the PA Consolidation in the first quarter of 2024.\nREGULATORY ASSETS AND LIABILITIES\nRegulatory assets represent incurred costs that have been deferred because of their probable future recovery from customers through regulated rates. Regulatory liabilities represent amounts that are expected to be credited to customers through future regulated rates or amounts collected from customers for costs not yet incurred. FirstEnergy, the Electric Companies and the Transmission Companies net their regulatory assets and liabilities based on federal and state jurisdictions.\nManagement assesses the probability of recovery of regulatory assets, and settlement of regulatory liabilities, at each balance sheet date and whenever new events occur. Factors that may affect probability relate to changes in the regulatory environment, issuance of a regulatory commission order or passage of new legislation. Upon material changes to these factors, where applicable, FirstEnergy will record new regulatory assets and liabilities and will assess whether it is probable that currently recorded regulatory assets and liabilities will be recovered or settled in future rates.\n65\nThe following table provides information about the composition of FirstEnergy’s net regulatory assets and liabilities as of September 30, 2025, and December 31, 2024, and the changes during the nine months ended September 30, 2025: \nNet Regulatory Assets (Liabilities) by Source - FirstEnergy\nSeptember 30, 2025\nDecember 31,\n2024\nChange\n \n(In millions)\nCustomer payables for future income taxes\n$\n(2,050)\n$\n(2,234)\n$\n184 \nSpent nuclear fuel disposal costs\n(74)\n(72)\n(2)\nAsset removal costs\n(669)\n(681)\n12 \nDeferred transmission costs\n29 \n190 \n(161)\nDeferred generation costs\n420 \n481 \n(61)\nDeferred distribution costs\n456 \n287 \n169 \nStorm-related costs\n1,028 \n1,015 \n13 \nEnergy efficiency program costs\n406 \n349 \n57 \nNew Jersey societal benefit costs\n77 \n87 \n(10)\nVegetation management costs\n149 \n125 \n24 \nOther\n50 \n75 \n(25)\nNet Regulatory Liabilities included on FirstEnergy’s Consolidated Balance Sheets\n$\n(178)\n$\n(378)\n$\n200 \nThe following table provides information about the composition of JCP&L’s net regulatory assets and liabilities as of September 30, 2025, and December 31, 2024, and the changes during the nine months ended September 30, 2025: \nNet Regulatory Assets (Liabilities) by Source - JCP&L\nSeptember 30, 2025\nDecember 31,\n2024\nChange\n \n(In millions)\nCustomer payables for future income taxes\n$\n(396)\n$\n(410)\n$\n14 \nSpent nuclear fuel disposal costs\n(74)\n(72)\n(2)\nAsset removal costs\n(72)\n(83)\n11 \nDeferred transmission costs\n(23)\n(3)\n(20)\nDeferred generation costs\n(30)\n(12)\n(18)\nDeferred distribution costs\n322 \n206 \n116 \nStorm-related costs\n291 \n310 \n(19)\nEnergy efficiency program costs\n284 \n208 \n76 \nNew Jersey societal benefit costs\n77 \n87 \n(10)\nVegetation management costs\n8 \n7 \n1 \nOther\n23 \n27 \n(4)\nNet Regulatory Assets included on JCP&L’s Balance Sheets\n$\n410 \n$\n265 \n$\n145 \nThe following is a description of the regulatory assets and liabilities described above:\nCustomer payables for future income taxes \n- Reflects amounts to be recovered or refunded through future rates to pay income taxes that become payable when rate revenue is provided to recover items such as AFUDC equity and depreciation of property, plant and equipment for which deferred income taxes were not recognized for ratemaking purposes, including amounts attributable to federal and state tax rate changes such as the TCJA and Pennsylvania House Bill 1342. These amounts are being amortized over the period in which the related deferred tax assets reverse, which is generally over the expected life of the underlying asset.\nSpent nuclear fuel disposal costs \n- Reflects amounts collected from customers, and the investment income, losses and changes in fair value of the trusts for spent nuclear fuel disposal costs related to former nuclear generating facilities, Oyster Creek and Three Mile Island Unit 1.\nAsset removal costs \n- Primarily represents the rates charged to customers that include a provision for the cost of future activities to remove assets, including obligations for which an ARO has been recognized, that are expected to be incurred at the time of retirement.\n66\nDeferred transmission costs \n- Reflects differences between revenues earned based on actual costs for the formula-rate Transmission Companies and the amounts billed. Also included is the recovery of non-market based costs or fees charged to certain of the Electric Companies by various regulatory bodies including FERC and RTOs, which can include PJM charges and credits for service including, but not limited to, procuring transmission services and transmission enhancement.\nDeferred generation costs\n - Primarily relates to regulatory assets associated with the securitized recovery of certain fuel and purchased power regulatory assets at the Ohio Companies (amortized through 2034) as well as the ENEC at MP and PE. MP and PE recover net power supply costs, including fuel costs, purchased power costs and related expenses, net of related market sales revenue through the ENEC. Generally, the ENEC rate is updated annually.\nDeferred distribution costs\n - Primarily relates to New Jersey temporary residential bill credits (amortized though February 2026), the Ohio Companies' deferral of certain distribution-related expenses, including interest (amortized through 2034) and JCP&L’s AMI program costs.\nStorm-related costs\n - Relates to the deferral of storm costs, which vary by jurisdiction. Approximately $335 million and $65 million for FirstEnergy and JCP&L, respectively, are currently being recovered through rates as of September 30, 2025. Approximately $402 million and $41 million for FirstEnergy and JCP&L, respectively, and are currently being recovered through rates as of December 31, 2024.\nEnergy efficiency program costs\n - Relates to the recovery of costs in excess of revenues associated with energy efficiency programs including New Jersey energy efficiency and renewable energy programs, FE PA's Energy Efficiency and Conservation programs, the Ohio Companies' Demand Side Management and Energy Efficiency Rider, and PE's EmPOWER Maryland Surcharge. Investments in certain of these energy efficiency programs earn a long-term return.\nNew Jersey societal benefit costs\n - Primarily relates to regulatory assets associated with MGP remediation, universal service and lifeline funds, and the New Jersey Clean Energy Program.\nVegetation management costs\n - Relates to regulatory assets associated with the recovery of certain distribution vegetation management costs in New Jersey, certain distribution and transmission vegetation management costs in West Virginia, and certain transmission vegetation management costs at ATSI (amortized through 2030) and KATCo (amortized through 2036).\nThe following table provides information about the composition of FirstEnergy’s net regulatory assets that do not earn a current return as of September 30, 2025 and December 31, 2024, of which approximately $812 million and $698 million, respectively, are currently being recovered through rates over varying periods, through 2068, depending on the nature of the deferral and the jurisdiction: \nRegulatory Assets by Source Not Earning a Current Return - FirstEnergy\nSeptember 30, 2025\nDecember 31,\n2024\nChange\n(In millions)\nDeferred transmission costs\n$\n18 \n$\n8 \n$\n10 \nDeferred generation costs\n284 \n314 \n(30)\nDeferred distribution costs\n228 \n153 \n75 \nStorm-related costs\n760 \n694 \n66 \nVegetation management costs\n27 \n16 \n11 \nOther\n64 \n58 \n6 \nFirstEnergy Regulatory Assets Not Earning a Current Return\n$\n1,381 \n$\n1,243 \n$\n138 \nThe following table provides information about the composition of JCP&L’s net regulatory assets that do not earn a current return as of September 30, 2025 and December 31, 2024, of which approximately $69 million and $45 million, respectively, are currently being recovered through rates over varying periods, through 2068, depending on the nature of the deferral: \n67\nRegulatory Assets by Source Not Earning a Current Return - JCP&L\nSeptember 30, 2025\nDecember 31,\n2024\nChange\n(In millions)\nDeferred generation costs\n$\n1 \n$\n4 \n$\n(3)\nDeferred distribution costs\n172 \n101 \n71 \nStorm-related costs\n291 \n310 \n(19)\nVegetation management costs\n8 \n7 \n1 \nOther\n14 \n17 \n(3)\nJCP&L Regulatory Assets Not Earning a Current Return\n$\n486 \n$\n439 \n$\n47 \nCAPITAL RESOURCES AND LIQUIDITY\nThe Registrants’ business is capital intensive, requiring significant resources to fund operating expenses, construction and other investment expenditures, scheduled debt maturities and interest payments, dividend payments and potential contributions to its pension plan.\nThe Registrants expect their existing sources of liquidity to remain sufficient to meet their respective anticipated obligations. In addition to internal sources to fund liquidity and capital requirements for the remainder of 2025 and beyond, the Registrants expect to rely on external sources of funds. Short-term cash requirements not met by cash provided from operations are generally satisfied through short-term borrowings. Long-term cash needs may be met through the issuance of long-term debt by the Registrants to, among other things, fund capital expenditures and other capital-like investments, and refinance short-term and maturing long-term debt, subject to market conditions and other factors. FE may utilize instruments other than senior notes to fund its liquidity and capital requirements, including hybrid securities. Energize365 capital investments included in the current 5-year plan are expected to be funded through organic internal cash flows and the issuance of debt. Should FirstEnergy significantly increase these investments in its 2026 through 2030 planning period, FE may issue common equity or equity-like instruments to fund up to 30% of such investment increases.\nIn alignment with FirstEnergy’s strategy to invest in its segments as a fully regulated company, FirstEnergy is focused on maintaining balance sheet strength and flexibility. Specifically, at the regulated businesses, regulatory authority has been obtained for various regulated subsidiaries to issue and/or refinance debt.\nAny financing plans by FE or any of its subsidiaries, including the issuance of equity and debt, and the refinancing of short-term and maturing long-term debt are subject to market conditions and other factors. No assurance can be given that any such issuances, financing or refinancing, as the case may be, will be completed as anticipated or at all. Any delay in the completion of financing plans could require FE or any of its subsidiaries to utilize short-term borrowing capacity, which could impact available liquidity. In addition, FE and its subsidiaries expect to continually evaluate any planned financings, which may result in changes from time to time.\nWhile supply lead times have not fully returned to pre-pandemic levels, FirstEnergy continues to monitor the situation in light of demand increases across the industry, including due to data center usage, and the imposition of tariffs by the U.S. government and retaliatory tariffs that have been, and may be, imposed in response. FirstEnergy continues to implement mitigation strategies to address supply constraints and does not expect any corresponding service disruptions or any material impact on its capital investment plan. However, the situation remains fluid and a prolonged continuation or further increase in demand, or the continuation of uncertain or adverse macroeconomic conditions, including inflationary pressures and new or increased existing tariffs, could lead to an increase in supply chain disruptions that could, in turn, have an adverse effect on the Registrants’ results of operations, cash flow and financial condition. For example, in April 2025, the U.S. government began imposing tariffs intended to address trade deficits and inconsistent economic treatment of importation between the United States and other countries. In response, China, among other countries, has announced retaliatory tariffs against certain imports from the United States. In August 2025, certain country-specific “reciprocal tariffs” went into effect, and additional measures from the U.S. government, as well as other foreign governments, have occurred since that time. The scope and duration of global tariffs continue to evolve, which creates sustained uncertainty in global trade policy. The imposition of new, modified or increased tariffs or resultant trade wars, and the uncertainties associated with the same, could have an adverse effect on the Registrants’ consolidated results of operations, cash flow and financial condition.\nIn January 2025, FirstEnergy executed a lift-out transaction with MetLife, which transferred approximately $640 million of plan assets and $652 million of plan obligations, associated with approximately 2,000 former competitive generation employees, who will assume future and full responsibility to fund and administer their benefit payments. There was no change to the pension benefits for any participant as a result of the transfer, and the transaction was funded by pension plan assets. FirstEnergy believes that this lift-out transaction, in addition to the lift-out in 2023, further de-risked potential volatility with the pension plan assets and liabilities, and will continue to evaluate other lift-outs in the future based on market and other conditions.\n68\nAs of September 30, 2025, FirstEnergy’s net deficit in working capital (current assets less current liabilities) was primarily due to current portion of long-term debt, accounts payable, short-term borrowings and accrued interest, taxes, and compensation and benefits. FirstEnergy believes its cash from operations and available liquidity will be sufficient to meet its current working capital needs. See further discussion on cash from operations below.\nShort-Term Borrowings / Revolving Credit Facilities\nOn October 27, 2025, FE, JCP&L, the Ohio Companies, FE PA, MP and PE, KATCo, FET and ATSI, MAIT and TrAIL, entered into amendments to their respective credit facilities (collectively, and as amended on October 27, 2025, the “Amended Credit Facilities”) to, among other things: (i) remove the 10 basis point credit spread adjustment from the interest rate calculation; (ii) permit a one-week interest period for any Term Benchmark Advance (as defined under each of the credit facilities) based upon daily simple SOFR; and (iii) extend the maturity date of each credit facility for an additional one-year period (a) from October 20, 2028 to October 20, 2029 for the KATCo credit facility, (b) from October 20, 2029 to October 20, 2030 for the FET credit facility and (c) from October 18, 2028 to October 18, 2029 for the remaining Amended Credit Facilities.\nThe foregoing description of the Amended Credit Facilities are qualified in their entirety by reference to each such amendment entered into by FE, JCP&L, the Ohio Companies, FE PA, MP and PE, ATSI, MAIT and TrAIL, FET and KATCo, each of which is filed hereto as Exhibits 10.5, 10.6, 10.7, 10.8, 10.9, 10.10, 10.11 and 10.12, respectively, and incorporated herein by reference. \nBorrowings under these credit facilities may be used for working capital and other general corporate purposes. Generally, borrowings under each of the credit facilities are available to each borrower separately and mature on the earlier of 364 days from the date of borrowing or the commitment termination date, as the same may be extended. Each of the credit facilities contain financial covenants requiring each borrower, with the exception of FE, to maintain a consolidated debt-to-total-capitalization ratio (as defined under each of the credit facilities) of no more than 65%, and 75% for FET, measured at the end of each fiscal quarter. FE is required under its credit facility to maintain a consolidated interest coverage ratio of not less than 2.50 times, measured at the end of each fiscal quarter for the last four fiscal quarters.\nEach of the credit facilities bear interest at fluctuating interest rates, primarily based on SOFR, including term SOFR and daily simple SOFR. FirstEnergy has not hedged its interest rate exposure with respect to its floating rate debt. Accordingly, FirstEnergy’s interest expense for any particular period will fluctuate based on SOFR and other variable interest rates. Restricted access to capital markets and/or increased borrowing costs could have an adverse effect on FirstEnergy’s results of operations, cash flows, financial condition and liquidity.\nFirstEnergy had $291 million and $550 million of outstanding short-term borrowings as of September 30, 2025, and December 31, 2024, respectively. FirstEnergy’s available liquidity from external sources as of October 27, 2025, was as follows\n:\nRevolving Credit Facilities\nMaturity\nCommitment\nAvailable Liquidity \n \n \n(In millions)\nFE\nOctober 2029\n$\n1,000 \n$\n997 \nFET\nOctober 2030\n1,000 \n720 \nOhio Companies\nOctober 2029\n800 \n762 \nFE PA\nOctober 2029\n950 \n931 \nJCP&L\nOctober 2029\n750 \n722 \nMP and PE\nOctober 2029\n400 \n348 \nATSI, MAIT and TrAIL\nOctober 2029\n850 \n837 \nKATCo\nOctober 2029\n150 \n150 \nSubtotal\n$\n5,900 \n$\n5,467 \nCash and cash equivalents\n— \n775 \nTotal\n$\n5,900 \n$\n6,242 \n69\nThe following table summarizes the limitations on short-term indebtedness applicable to each borrower under current regulatory approvals and applicable statutory and/or charter limitations as of September 30, 2025: \nIndividual Borrower\nRegulatory Debt Limitations\nCredit Facility Commitment\nDebt-to-Total-Capitalization Ratio\n \n(In millions)\nFE\nN/A\n$\n1,000 \nN/A\n(2)\nATSI\n(1)\n$\n500 \n350 \n40.0 \n%\nCEI\n(1)\n500 \n300 \n40.3 \n%\nFET\nN/A\n1,000 \n66.0 \n%\nFE PA\n(1)\n1,250 \n950 \n46.2 \n%\nJCP&L\n(1)\n1,500 \n750 \n42.1 \n%\nKATCo\n(1)\n200 \n150 \n29.4 \n%\nMAIT\n(1)\n400 \n350 \n37.1 \n%\nMP\n(1)\n500 \n250 \n50.0 \n%\nOE\n(1)\n500 \n300 \n51.2 \n%\nPE\n(1)\n150 \n150 \n50.0 \n%\nTE\n(1)\n300 \n200 \n49.6 \n%\nTrAIL\n(1)\n400 \n150 \n37.8 \n%\n(1)\n Regulatory debt limitations include amounts which may be borrowed under the regulated companies’ money pool.\n(2) \nFE is not required to maintain a debt-to-total-capitalization ratio under its credit facility. However, FE is required to maintain a consolidated interest coverage ratio of not less than 2.50 times, measured at the end of each fiscal quarter for the last four fiscal quarters beginning with the quarter ended December 31, 2021. FE's consolidated interest coverage ratio as of September 30, 2025, was approximately 5.1 times.\nSubject to each borrower’s sublimit, the amounts noted below are available for the issuance of LOCs (subject to borrowings drawn under the credit facilities) expiring up to one year from the date of issuance. The stated amount of outstanding LOCs will count against total commitments available under each of the credit facilities and against the applicable borrower’s borrowing sublimit. As of September 30, 2025, FirstEnergy had $185 million in outstanding LOCs, $153 million of which are issued under the revolving credit facilities.\nRevolving Credit Facility\nLOC Availability as of September 30, 2025\nLOC Utilized as of September 30, 2025\n(In millions)\nFE\n$\n100 \n$\n3 \nFET\n100 \n— \nOhio Companies\n150 \n38 \nFE PA\n200 \n19 \nJCP&L\n100 \n28 \nMP and PE\n100 \n52 \nATSI, MAIT and TrAIL\n200 \n13 \nKATCo\n35 \n— \nEach of the credit facilities do not contain provisions that restrict the ability to borrow or accelerate payment of outstanding advances in the event of any change in credit ratings of the borrowers. Pricing is defined in “pricing grids,” whereby the cost of funds borrowed under the credit facilities are related to the credit ratings of the company borrowing the funds. Additionally, borrowings under each of the credit facilities are subject to the usual and customary provisions for acceleration upon the occurrence of events of default, including a cross-default for other indebtedness in excess of $100 million.\nAs of September 30, 2025, FE was in compliance with its applicable consolidated interest coverage ratio and the borrowers, in each case as defined under the credit facilities, were in compliance with their debt-to-total-capitalization ratio covenants.\n70\nFirstEnergy Money Pools \nFirstEnergy’s regulated operating subsidiary companies also have the ability to borrow from each other and FE to meet their short-term working capital requirements. Effective September 23, 2024, AGC and KATCo became participants in the regulated companies’ money pool. Similar but separate arrangements exist among FirstEnergy’s unregulated companies with AE Supply, FE, FET, FEV and certain other unregulated subsidiaries. As of June 1, 2024, FET no longer participated in the unregulated money pool. FESC administers these money pools and tracks surplus funds of FE and the respective regulated and unregulated subsidiaries, as the case may be, as well as proceeds available from bank borrowings. Companies receiving a loan under the money pool agreements must repay the principal amount of the loan, together with accrued interest, within 364 days of borrowing the funds. The rate of interest is the same for each company receiving a loan from their respective pool and is based on the average cost of funds available through the pool.\nAverage Interest Rates\nRegulated Companies’ Money Pool\nUnregulated Companies’ Money Pool\n2025\n2024\n2025\n2024\nFor the Three Months Ended September 30,\n4.35 \n%\n5.43 \n%\n4.34 \n%\n6.35 \n%\nFor the Nine Months Ended September 30, \n4.67 \n%\n5.99 \n%\n5.16 \n%\n6.71 \n%\nLong-Term Debt Capacity\nFE’s and its subsidiaries’ access to capital markets and costs of financing are influenced by the credit ratings of their securities. The following table displays FE’s and its subsidiaries’ credit ratings as of October 27, 2025:\nCorporate Credit Rating\nSenior Secured\nSenior Unsecured\nOutlook/Credit/Watch\n(1)\nIssuer\nS&P\nMoody’s\nFitch\nS&P\nMoody’s\nFitch\nS&P\nMoody’s\nFitch\nS&P\nMoody’s\nFitch\nFE\nBBB\nBaa3\nBBB\n—\n—\n—\nBBB-\nBaa3\nBBB\nP\nS\nS\nDistribution:\nCEI\nBBB\nBaa3\nBBB+\n—\n—\n—\nBBB\nBaa3\nA-\nP\nS\nP\nOE\nBBB+\nA3\nBBB+\nA\nA1\nA\nBBB+\nA3\nA-\nP\nS\nP\nTE\nBBB+\nBaa2\nBBB+\nA\nA3\nA\n—\n—\n—\nP\nS\nP\nFE PA\nBBB+\nA3\nA-\nA\nA1\n—\nBBB+\nA3\nA\nP\nS\nS\nIntegrated:\nJCP&L\nBBB\nA3\nA-\n—\n—\n—\nBBB\nA3\nA\nP\nS\nS\nMP\nBBB\nBaa2\nA-\nA-\nA3\nA+\nBBB\nBaa2\n—\nS\nS\nS\nAGC\nBBB-\nBaa2\nA-\n—\n—\n—\n—\n—\n—\nS\nS\nS\nPE\nBBB\nBaa2\nBBB+\nA-\nA3\nA\n—\n—\n—\nS\nS\nS\nStand-Alone Transmission:\nFET\nA-\nBaa2\nBBB+\n—\n—\n—\nBBB+\nBaa2\nBBB+\nP\nS\nS\nATSI\nA-\nA3\nA\n—\n—\n—\nA-\nA3\nA+\nP\nS\nS\nMAIT\nA-\nA3\nA\n—\n—\n—\nA-\nA3\nA+\nP\nS\nS\nTrAIL\nA-\nA3\nA\n—\n—\n—\nA-\nA3\nA+\nP\nS\nS\nKATCo\n—\nA3\nA-\n—\n—\n—\n—\n—\n—\n—\nS\nS\n (1) \nS = Stable, P = Positive\nOn September 23, 2025, Fitch upgraded FE PA’s corporate credit rating to A- from BBB+, its senior unsecured rating to A from A- and updated its ratings outlook to stable. Additionally, Fitch affirmed the ratings and outlooks of FE and its other subsidiaries.\nThe applicable undrawn and drawn margin on the credit facilities are subject to ratings-based pricing grids. The applicable fee paid on the undrawn commitments under the credit facilities are based on each borrower’s senior unsecured non-credit enhanced debt ratings as determined by S&P and Moody’s. The fees paid on actual borrowings are determined based on each borrower’s senior unsecured non-credit enhanced debt ratings as determined by S&P and Moody’s.\nThe interest rates payable on approximately $2.1 billion in FE’s senior unsecured notes are subject to adjustments from time to time if the ratings on the notes from any one or more of S&P, Moody’s and Fitch decreases to a rating set forth in the applicable governing documents. Generally, a one-notch downgrade by the applicable rating agency may result in a 25 basis point coupon rate increase beginning at BB, Ba1, and BB+ for S&P, Moody’s and Fitch, respectively, to the extent such rating is applicable to \n71\nthe series of outstanding senior unsecured notes, during the next interest period, subject to an aggregate cap of 2% from issuance interest rate.\nDebt capacity is subject to the consolidated interest coverage ratio in FE's credit facility. As of September 30, 2025, FirstEnergy could incur approximately $1.2 billion of incremental interest expense or incur a $3.1 billion reduction to the consolidated interest coverage earnings numerator, as defined under the covenant, and FE would remain within the limitations of the financial covenant requirements of FE's credit facility.\nCash Requirements and Commitments\nFirstEnergy has certain obligations and commitments to make future payments under contracts. For an in-depth discussion of FirstEnergy’s cash requirements and commitments, see “Capital Resources and Liquidity - Cash Requirements and Commitments\" in Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" within FirstEnergy’s Form 10-K for the year ended December 31, 2024 (filed on February 27, 2025).\nChanges in Cash Position\nAs of September 30, 2025, FirstEnergy had $1,404 million of cash and cash equivalents and $27 million of restricted cash as compared to $111 million of cash and cash equivalents and $43 million of restricted cash as of December 31, 2024, on the Consolidated Balance Sheets.\nThe following table summarizes the major classes of cash flow items:\nFor the Nine Months Ended September 30, \n(In millions)\n2025\n2024\nChange\nNet cash provided from operating activities\n$\n2,564 \n$\n1,847 \n$\n717 \nNet cash used for investing activities\n(3,805)\n(2,961)\n(844)\nNet cash provided from financing activities\n2,518 \n1,400 \n1,118 \nNet change in cash, cash equivalents, and restricted cash\n1,277 \n286 \n991 \nCash, cash equivalents, and restricted cash at beginning of period\n154 \n179 \n(25)\nCash, cash equivalents, and restricted cash at end of period\n$\n1,431 \n$\n465 \n$\n966 \nCash Flows From Operating Activities\nFirstEnergy’s most significant sources of cash are derived from electric service provided by its operating subsidiaries. The most significant use of cash from operating activities is buying electricity to serve non-shopping customers, return of cash collateral associated with certain generation suppliers that serve shopping customers, and paying fuel suppliers, employees, tax authorities, lenders and others for a wide range of materials and services. \nNet cash provided from operating activities was $2,564 million in the first nine months of 2025, as compared to net cash provided from operating activities of $1,847 million in the first nine months of 2024. The increase in cash provided from operating activities in 2025, compared to the same period of 2024, is primarily due to:\n•\nHigher revenues from the implementation of base rate cases in Pennsylvania, New Jersey, and West Virginia;\n•\nHigher return on regulated capital investment programs;\n•\nIncreased working capital due to the timing of account receivable receipts and lower employee benefit payments in 2025 in comparison to 2024;\n•\nHigher net transmission revenue collection based on the timing of formula rate collections;\n•\nHigher customer usage and demand; and\n•\nAbsence of the payment of the SEC civil penalty and OAG settlement in the third quarter of 2024.\nThe increase in cash provided from operating activities was partially offset by:\n•\nThe absence of net proceeds from the shareholder derivative lawsuit settlement in the second quarter of 2024;\n•\nTemporary rate credits that were provided to JCP&L residential customers during the third quarter of 2025, net of recoveries, as further discussed below;\n•\nLower dividend distribution received by FEV from its equity investment in Global Holding; and\n•\nDecreased cash collateral received from suppliers due to changes in power prices.\n72\nCash Flows From Investing Activities\nCash used for investing activities in the first nine months of 2025 principally represented cash used for capital investments. The following table summarizes investing activities for the first nine months of 2025 and 2024:\nFor the Nine Months Ended September 30, \nInvesting Activities\n2025\n2024\nChange\n(In millions)\nCapital investments:\nDistribution Segment\n$\n976 \n$\n758 \n$\n218 \nIntegrated Segment\n1,336 \n1,045 \n291 \nStand-Alone Transmission Segment\n1,161 \n875 \n286 \nCorporate / Other\n66 \n58 \n8 \nAsset removal costs\n290 \n212 \n78 \nOther\n(24)\n13 \n(37)\n$\n3,805 \n$\n2,961 \n$\n844 \nNet cash used for investing activities for the first nine months of 2025 increased $844 million, compared to the same period of 2024, primarily due to capital investments.\nCash Flows From Financing Activities\nIn the first nine months of 2025 and 2024, cash provided from financing activities was $2,518 million and $1,400 million, respectively. The following table summarizes financing activities for the first nine months of 2025 and 2024:\nFor the Nine Months Ended September 30, \nFinancing Activities\n2025\n2024\nChange\n \n(In millions)\nNew Issues:\n \n \nUnsecured convertible notes\n$\n2,500 \n$\n— \n$\n2,500 \nSenior unsecured notes\n3,125 \n1,200 \n1,925 \nSenior secured notes\n100 \n— \n100 \nFMBs\n200 \n— \n200 \n$\n5,925 \n$\n1,200 \n$\n4,725 \nRedemptions / Repayments:\n \n \nUnsecured convertible notes\n$\n(1,206)\n$\n— \n$\n(1,206)\nUnsecured notes\n(925)\n(963)\n38 \nFMBs\n— \n(700)\n700 \nSenior secured notes\n(48)\n(47)\n(1)\n \n$\n(2,179)\n$\n(1,710)\n$\n(469)\nShort-term borrowings, net\n$\n(259)\n$\n(700)\n$\n441 \nProceeds from FET Equity Interest Sale \n— \n3,500 \n(3,500)\nNoncontrolling interest cash distributions\n(74)\n(51)\n(23)\nCommon stock dividend payments\n(759)\n(725)\n(34)\nDebt issuance and redemption costs, and other\n(136)\n(114)\n(22)\n$\n2,518 \n$\n1,400 \n$\n1,118 \n73\nFirstEnergy and JCP&L had the following issuances and redemptions during the nine months ended September 30, 2025:\nCompany\nType\nRedemption / Issuance Date\nInterest Rate\nMaturity\nAmount \n(In millions)\nDescription\nRedemptions\nFE\nSenior Unsecured Notes\nMarch, 2025\n2.05%\n2025\n$300\nFE redeemed unsecured notes that became due.\nTrAIL\nSenior Unsecured Notes\nMay, 2025\n3.76%\n2025\n$75\nTrAIL redeemed unsecured notes that became due.\nTrAIL\nSenior Unsecured Notes\nJune, 2025\n3.85%\n2025\n$550\nTrAIL redeemed unsecured notes that became due.\nFE\nSenior Unsecured Convertible Notes\nJune, 2025\n4.00%\n2026\n$1,206\nFE repurchased approximately $1,206 million of the principal amount of its 2026 Convertible Notes for $1,225 million, including a premium of approximately $19 million.\nIssuances\nTrAIL\nSenior Unsecured Notes\nApril, 2025\n5.00%\n2031\n$600\nProceeds were used to redeem senior notes that came due in 2025, to refinance existing debt, for working capital, and for other general corporate purposes.\nATSI\nSenior Unsecured Notes\nMay, 2025\n5.00%\n2030\n$225\nProceeds were used to refinance existing debt, to finance capital expenditures, for working capital, and for other general corporate purposes.\nOE\nSenior Unsecured Notes\nMay, 2025\n4.95%\n2029\n$300\nProceeds were used to refinance existing debt, to finance capital expenditures, for working capital, and for other general corporate purposes.\nMAIT\nSenior Unsecured Notes\nJune, 2025\n5.00%\n2031\n$200\nProceeds were used to refinance existing debt, to finance capital expenditures, for working capital, and for other general corporate purposes.\nPE\nFMBs\nJune, 2025\n5.00%\n2030\n$200\nProceeds were used to refinance existing debt, to finance capital expenditures, for working capital, and for other general corporate purposes.\nTE\nSenior Secured Notes\nJune, 2025\n5.18%\n2030\n$100\nProceeds were used to refinance existing debt, to finance capital expenditures, and for other general corporate purposes.\nFE \nSenior Unsecured Convertible Notes\nJune, 2025\n3.63%\n2029\n$1,350\nProceeds were used to refinance existing debt, to repurchase a portion of its 2026 Convertible Notes, and for other general corporate purposes.\nFE \nSenior Unsecured Convertible Notes\nJune, 2025\n3.88%\n2031\n$1,150\nProceeds were used to refinance existing debt, to repurchase a portion of its 2026 Convertible Notes, and for other general corporate purposes.\nFET\nSenior Unsecured Notes\nAugust, 2025\n4.75%\n2033\n$450\nProceeds were used to refinance existing debt, to finance capital expenditures, for working capital, and for other general corporate purposes.\nJCP&L\nSenior Unsecured Notes\nSeptember, 2025 \n4.15%\n2029\n$350\nProceeds were used to refinance existing debt, including the repayment of all of the remaining $650 million aggregate principal amount of JCP&L’s 4.30% senior notes due 2026, to finance capital expenditures, and for other general corporate purposes.\nJCP&L\nSenior Unsecured Notes\nSeptember, 2025\n4.40%\n2031\n$500\nProceeds were used to refinance existing debt, including the repayment of all of the remaining $650 million aggregate principal amount of JCP&L’s 4.30% senior notes due 2026, to finance capital expenditures, and for other general corporate purposes.\nJCP&L\nSenior Unsecured Notes\nSeptember, 2025\n5.15%\n2036\n$500\nProceeds were used to refinance existing debt, including the repayment of all of the remaining $650 million aggregate principal amount of JCP&L’s 4.30% senior notes due 2026, to finance capital expenditures, and for other general corporate purposes.\nFE or its affiliates may, from time to time, seek to retire or purchase outstanding debt through open-market purchases, privately negotiated transactions or otherwise. Such repurchases, if any, will be upon such terms and at such prices as FE or its affiliates may determine, and will depend on prevailing market conditions, liquidity requirements, contractual restrictions and other factors.\n74\nConvertible Notes Issuance\nAs set forth above, on June 12, 2025, FE issued $1.35 billion aggregate principal amount of its 2029 Convertible Notes and $1.15 billion aggregate principal amount of its 2031 Convertible Notes.\nThe 2029 Convertible Notes and 2031 Convertible Notes bear interest at a rate of 3.625% per year and 3.875% per year, respectively, payable semiannually in arrears on January 15 and July 15 of each year, beginning on January 15, 2026. The 2029 Convertible Notes and 2031 Convertible Notes are unsecured and unsubordinated obligations of FE and will mature on January 15, 2029 and January 15, 2031, respectively, unless earlier converted or repurchased in accordance with their terms.\nThe notes are included within “Long-term debt and other long-term obligations” on the FirstEnergy Consolidated Balance Sheets. Proceeds from the issuance were approximately $2.47 billion, net of issuance costs.\nHolders may convert notes at their option at any time prior to the close of business on the business day immediately preceding: (i) October 15, 2028, with respect to the 2029 Convertible Notes; and (ii) October 15, 2030, with respect to the 2031 Convertible Notes, only under certain conditions: \n•\nDuring any calendar quarter, if the last reported sale price of FE’s common stock for at least 20 trading days during the period of 30 consecutive trading days ending on, and including, the last trading day of the immediately preceding calendar quarter is greater than or equal to 130% of the conversion price on each applicable trading day;\n•\nDuring the five consecutive business day period immediately after any 10 consecutive trading day period in which the trading price per $1,000 principal amount of the 2029 Convertible Notes and 2031 Convertible Notes for each trading day of such 10 trading-day period was less than 98% of the product of the last reported sale price of FE’s common stock and the conversion rate on each such trading day; or\n•\nUpon the occurrence of certain corporate events specified in the indenture governing the 2029 Convertible Notes and 2031 Convertible Notes. \nOn or after October 15, 2028, in the case of the 2029 Convertible Notes, and on or after October 15, 2030, in the case of the 2031 Convertible Notes, until the close of business on the second scheduled trading day immediately preceding the maturity date of the relevant series of notes, holders may convert all or any portion of their notes of such series at any time, regardless of the foregoing conditions. FE will settle conversions of such notes by paying cash up to the aggregate principal amount of the notes to be converted and paying or delivering, as the case may be, cash, shares of its common stock or a combination of cash and shares of its common stock, at its election, in respect of the remainder, if any, of its conversion obligation in excess of the aggregate principal amount of the notes being converted, subject to the applicable terms of the indentures.\nThe conversion rate for each of the series of notes will initially be 20.9275 shares of FE’s common stock per $1,000 principal amount of such notes (equivalent to an initial conversion price of approximately $47.78 per share of FE’s common stock). The initial conversion price of such notes represents a premium of approximately 20% over the last reported sale price of FE’s common stock on the New York Stock Exchange on June 9, 2025. The conversion rate and the corresponding conversion price will be subject to adjustment in some events but will not be adjusted for any accrued and unpaid interest. In addition, following certain corporate events that occur prior to the maturity date with respect to a series of notes (and, in the case of the 2031 Convertible Notes, if FE delivers a notice of redemption with respect to the 2031 Convertible Notes), FE will, in certain circumstances, increase the conversion rate for a holder who elects to convert its notes of such series in connection with such corporate event or redemption as applicable.\nFE may not redeem the 2029 Convertible Notes prior to the maturity date of the 2029 Convertible Notes. On or after January 15, 2029 and prior to the 40th trading day immediately before the maturity date of the 2031 Convertible Notes, FE may redeem for cash all or any of the portion of the 2031 Convertible Notes, subject to certain partial redemption limitations and only under certain conditions. \nIf FE undergoes a fundamental change (as defined in the relevant indenture), subject to certain conditions, holders of the 2029 Convertible Notes and/or 2031 Convertible Notes may require FE to repurchase for cash all or any portion of their notes at a repurchase price equal to 100% of the principal amount of the convertible notes to be repurchased, plus accrued and unpaid interest to, but excluding, the fundamental change repurchase date (as defined in the relevant indenture). In addition, following certain corporate events that occur prior to the maturity date with respect to a series of convertible notes (and, in the case of the 2031 Convertible Notes, if FE delivers a notice of redemption with respect to the 2031 Convertible Notes), FE will, in certain circumstances, increase the conversion rate for a holder who elects to convert its notes of such series in connection with such corporate event or redemption, as applicable.\nFE Convertible Notes Repurchase\nSeparate from the issuance of the 2029 Convertible Notes and 2031 Convertible Notes, FE repurchased approximately \n$1.2 billion \naggregate principal amount of the 2026 Convertible Notes, using a portion of the proceeds from the offering of the 2029 Convertible Notes and 2031 Convertible Notes described above. FE may, in the future, effect additional repurchases of remaining outstanding 2026 Notes.\n75\nFET Senior Notes and Registration Rights\nOn August 13, 2025, FET issued $450 million of senior unsecured notes due in 2033, in a private offering that included a registration rights agreement in which FET agreed to conduct an exchange offer of these senior notes for the like principal amounts registered under the Securities Act within 366 days of closing of the offering.\nJCP&L Senior Notes and Registration Rights\nOn December 5, 2024, JCP&L issued $700 million of senior unsecured notes due in 2035 in a private offering that included a registration rights agreement in which JCP&L agreed to conduct an exchange offer of these senior notes for like principal amounts registered under the Securities Act. On April 1, 2025, JCP&L filed a registration statement on Form S-4 with the SEC, which became effective on April 11, 2025.\nOn September 4, 2025, JCP&L issued: (i) $350 million of senior unsecured notes due in 2029; (ii) $500 million of senior unsecured notes due in 2031; and (iii) $500 million of senior unsecured notes due in 2036, in a private offering that included a registration rights agreement in which JCP&L agreed to conduct an exchange offer of these senior notes for the like principal amounts registered under the Securities Act within 366 days of closing of the offering.\nOn October 16, 2025, JCP&L redeemed $650 million of its 4.30% senior unsecured notes due 2026 from proceeds of the September 2025 senior unsecured notes issuances discussed above.\nFIRSTENERGY - GUARANTEES AND OTHER ASSURANCES\nFirstEnergy has various financial and performance guarantees and indemnifications, which are issued in the normal course of business. These contracts include performance guarantees, stand-by LOCs, debt guarantees, surety bonds and indemnifications. FirstEnergy enters into these arrangements to facilitate commercial transactions with third parties by enhancing the value of the transaction to the third party. As of September 30, 2025, outstanding guarantees and other assurances aggregated approximately $1.1 billion, consisting of parental guarantees on behalf of its consolidated subsidiaries ($615 million) and other assurances of ($436 million).\nCollateral and Contingent-Related Features\nIn the normal course of business, FE and its subsidiaries may enter into physical or financially settled contracts for the sale and purchase of electric capacity, energy, fuel and emission allowances. Certain agreements contain provisions that require FE or its subsidiaries to post collateral. This collateral may be posted in the form of cash or credit support with thresholds contingent upon FE’s or its subsidiaries’ credit rating from each of the major credit rating agencies. The collateral and credit support requirements vary by contract and by counterparty.\nAs of September 30, 2025, $185 million of collateral, in the form of LOCs, has been posted by FE or its subsidiaries. FE or its subsidiaries are holding $32 million of net cash collateral as of September 30, 2025, from certain generation suppliers, and such amount is included in “Other current liabilities” on FirstEnergy’s Consolidated Balance Sheets.\nThese credit-risk-related contingent features stipulate that if the subsidiary were to be downgraded or lose its investment grade credit rating (based on its senior unsecured debt rating), it would be required to provide additional collateral. The following table discloses the potential additional credit rating contingent contractual collateral obligations as of September 30, 2025:\nPotential Collateral Obligations\nElectric Companies and Transmission Companies\nFE \nTotal\n(In millions)\nContractual obligations for additional collateral\nUpon downgrade \n$\n90 \n$\n1 \n$\n91 \nSurety bonds (collateralized amount)\n(1)\n110 \n153 \n263 \nTotal Exposure from Contractual Obligations\n$\n200 \n$\n154 \n$\n354 \n(1)\n Surety bonds are not tied to a credit rating. Surety bonds’ impact assumes maximum contractual obligations, which is ordinarily 100% of the face amount of the surety bond except with respect to $22 million of surety bond obligations for which the collateral obligation is capped at 60% of the face amount, and typical obligations require 30 days to cure.\n76\nJCP&L - GUARANTEES AND OTHER ASSURANCES\nJCP&L has various financial and performance guarantees and indemnifications which are issued in the normal course of business. These contracts include stand-by LOCs and surety bonds. JCP&L enters into these arrangements to facilitate commercial transactions with third parties by enhancing the value of the transaction to the third party. The maximum potential amount of future payments JCP&L could be required to make under these guarantees as of September 30, 2025, was $46 million. \nCollateral and Contingent-Related Features\nIn the normal course of business, JCP&L may enter into physical or financially settled contracts for the sale and purchase of electric capacity, energy, fuel and emission allowances. Certain agreements contain provisions that require JCP&L to post collateral. This collateral may be posted in the form of cash or credit support with thresholds contingent upon JCP&L's credit rating from each of the major credit rating agencies. The collateral and credit support requirements vary by contract and by counterparty.\nJCP&L has posted $28 million of collateral in the form of LOCs as of September 30, 2025. JCP&L is holding $7 million of net cash collateral as of September 30, 2025, from certain generation suppliers, and such amount is included in \"Other current liabilities\" on JCP&L's Balance Sheets.\nThese credit-risk-related contingent features stipulate that if JCP&L were to be downgraded or lose its investment grade credit rating (based on its senior unsecured debt rating), it would be required to provide additional collateral. The following table discloses the potential additional credit rating contingent contractual collateral obligations as of September 30, 2025: \nPotential Collateral Obligations\nJCP&L\n(In millions)\nContractual obligations for additional collateral\nUpon downgrade \n$\n58 \nSurety bonds (collateralized amount)\n(1)\n17 \nTotal Exposure from Contractual Obligations\n$\n75 \n(1)\n Surety bonds are not tied to a credit rating, and their impact assumes maximum contractual obligations, which is ordinarily 100% of the face amount of the surety bond except with respect to $1 million as of September 30, 2025 of surety bond obligations for which the collateral obligation is capped at 60% of the face amount, and typical obligations require 30 days to cure.\nMARKET RISK INFORMATION\nFirstEnergy uses various market risk sensitive instruments, including derivative contracts, primarily to manage the risk of price and interest rate fluctuations. FirstEnergy’s Enterprise Risk Management Committee, comprised of members of senior management, provides general oversight for risk management activities throughout FirstEnergy, including market risk.\nCommodity Price Risk\nFirstEnergy has limited exposure to financial risks resulting from fluctuating commodity prices, including prices for electricity, coal and energy transmission. \nThe valuation of derivative contracts is based on observable market information. See Note 6, “Fair Value Measurements,” of the Combined Notes to Financial Statements of the Registrants for additional detail on FirstEnergy’s FTRs. \nEquity Price Risk\nAs of September 30, 2025, the FirstEnergy pension plan assets were allocated approximately as follows: 32% in equity securities, 19% in fixed income securities, 5% in alternatives, 9% in real estate, 23% in private debt/equity, 9% in derivatives and 3% in cash and short-term securities. FirstEnergy does not currently expect to have a required contribution to the pension plan until 2027, which, based on various assumptions, including an expected rate of return on assets of 8.5% for 2025, is expected to be approximately $300 million. However, FirstEnergy may elect to contribute to the pension plan voluntarily. JCP&L is not expected to make a contribution. \nAs of September 30, 2025, FirstEnergy’s OPEB plan assets were allocated approximately as follows: 57% in equity securities, 38% in fixed income securities and 5% in cash and short-term securities. See Note 4, “Pension and Other Post-Employment Benefits,” of the Combined Notes to Financial Statements of the Registrants for additional details on FirstEnergy’s pension and OPEB plans.\n77\nIn the nine months ended September 30, 2025, FirstEnergy’s pension plan assets have gained approximately 13.7% as compared to an annual expected return on plan assets of 8.5%. In the nine months ended September 30, 2025, FirstEnergy’s qualified OPEB plan assets have gained approximately 13.1% as compared to an annual expected return on plan assets of 7%.\nInterest Rate Risk\nFirstEnergy recognizes net actuarial gains or losses for its pension and OPEB plans in the fourth quarter of each fiscal year and whenever a plan is determined to qualify for a remeasurement. A primary factor contributing to these actuarial gains and losses are changes in the discount rates used to value pension and OPEB obligations as of the measurement date and the difference between expected and actual returns on the plans’ assets. \nThe remaining components of pension and OPEB expense, primarily service costs, interest cost on obligations, expected return on plan assets and amortization of prior service costs, are set at the beginning of the calendar year (unless a remeasurement is triggered) and are recorded on a monthly basis. Changes in asset performance and discount rates will not impact these pension and OPEB costs for 2025, unless an additional remeasurement were to be triggered during the year, however, future years could be impacted by changes in the market.\nFirstEnergy utilizes a spot rate approach in the estimation of the components of benefit cost by applying specific spot rates along the full yield curve to the relevant projected cash flows. As of September 30, 2025, the spot rate was 5.45% and 5.25% for pension and OPEB obligations, respectively, as compared to 5.72% and 5.60% as of December 31, 2024, respectively.\nThe final discount rate and return or loss on plan assets as of the year-end remeasurement date is difficult to predict based on the currently volatile equity markets and interest rate environment. As a result, FirstEnergy is unable to determine or meaningfully project the mark-to-market adjustment, or estimate a reasonable range of adjustment, that will be recorded as of December 31, 2025.\nEach of the credit facilities bear interest at fluctuating interest rates, primarily based on SOFR, including term SOFR and daily simple SOFR. FirstEnergy has not hedged its interest rate exposure with respect to its floating rate debt. Accordingly, FirstEnergy’s interest expense for any particular period will fluctuate based on SOFR and other variable interest rates.\nEconomic Conditions \nWhile supply lead times have not fully returned to pre-pandemic levels, FirstEnergy continues to monitor the situation in light of demand increases across the industry, including due to data center usage, and the imposition of tariffs by the U.S. government and retaliatory tariffs that have been, and may be, imposed in response. FirstEnergy continues to implement mitigation strategies to address supply constraints and does not expect any corresponding service disruptions or any material impact on its capital investment plan. However, the situation remains fluid and a prolonged continuation or further increase in demand, or the continuation of uncertain or adverse macroeconomic conditions, including inflationary pressures and new or increased existing tariffs, could lead to an increase in supply chain disruptions that could, in turn, have an adverse effect on the Registrants’ results of operations, cash flow and financial condition. For example, in April 2025, the U.S. government began imposing tariffs intended to address trade deficits and inconsistent economic treatment of importation between the United States and other countries. In response, China, among other countries, has announced retaliatory tariffs against certain imports from the United States. In August 2025, certain country-specific “reciprocal tariffs” went into effect, and additional measures from the U.S. government, as well as other foreign governments, have occurred since that time. The scope and duration of global tariffs continue to evolve, which creates sustained uncertainty in global trade policy. The imposition of new, modified or increased tariffs or resultant trade wars, and the uncertainties associated with the same, could have an adverse effect on the Registrants’ consolidated results of operations, cash flow and financial condition.\nCREDIT RISK\nCredit risk is the risk that FirstEnergy would incur a loss as a result of nonperformance by counterparties of their contractual obligations. FirstEnergy maintains credit policies and procedures with respect to counterparty credit (including requirements that counterparties maintain specified credit ratings) and require other assurances in the form of credit support or collateral in certain circumstance in order to limit counterparty credit risk. FirstEnergy has concentrations of suppliers and customers among electric utilities, financial institutions and energy marketing and trading companies. These concentrations may impact FirstEnergy's overall exposure to credit risk, positively or negatively, as counterparties may be similarly affected by changes in economic, regulatory or other conditions. In the event an energy supplier of the Ohio Companies, FE PA, JCP&L or PE defaults on its obligation, the affected company would be required to seek replacement power in the market. In general, subject to regulatory review or other processes, it is expected that appropriate incremental costs incurred by these entities would be recoverable from customers through applicable rate mechanisms, thereby mitigating the financial risk for these entities. FirstEnergy's credit policies to manage credit risk include the use of an established credit approval process, daily credit mitigation provisions, such as margin, prepayment or collateral requirements. FirstEnergy and its subsidiaries may request additional credit assurance, in certain circumstances, in the event that the counterparties' credit ratings fall below investment grade, their tangible net worth falls below specified percentages or their exposures exceed an established credit limit.\n78\nOUTLOOK \n    INCOME TAXES\nAs a result of several IRS private letter rulings issued during 2024 to another taxpayer, FERC recently issued orders to a non-affiliate that concluded that certain NOL carryforward deferred tax assets, as computed on a separate return basis, should be included in rate base for ratemaking purposes. FirstEnergy determined in the third quarter of 2025 that these rulings and orders also would apply to certain of its subsidiaries, resulting in a benefit from a reduction in regulatory liabilities, reflected as the remeasurement of excess deferred income taxes, and an increase in accumulated deferred income tax assets for ratemaking purposes, which will increase overall rate base. FirstEnergy is in the process of making the appropriate updates in its annual formula rates for the impacted subsidiaries. See Note 5, “Income Taxes” of the Combined Notes to Financial Statements.\nOn July 4, 2025, President Trump signed into law the OBBBA, which, among other things, makes permanent certain corporate tax incentives that were set to expire in the TCJA, and terminates tax credits for most wind and solar projects placed in service after 2027. Because many of the provisions of the TCJA will be continued under the OBBBA, and as FirstEnergy is not materially impacted by tax incentives associated with wind and solar projects, FirstEnergy does not expect to be materially impacted by the OBBBA.\nOn September 30, 2025, the IRS issued additional guidance on the corporate AMT. FirstEnergy is assessing this additional guidance and while it continues to believe, more likely than not, it will be subject to corporate AMT, the additional guidance provides certain adjustments to regulated utilities in calculating corporate AMT, which may reduce FirstEnergy’s AMT estimates. Additionally, the future issuance of the U.S. Treasury’s revised proposed AMT regulations and, ultimately, the final AMT regulations, as well as additional future federal tax legislation or presidential executive orders, could significantly change FirstEnergy’s AMT estimates or its conclusions as to whether it is an AMT payer. JCP&L is party to an intercompany income tax allocation agreement with FirstEnergy and, accordingly, may be allocated a share of any corporate AMT paid by the FirstEnergy consolidated tax group. Any adverse developments concerning corporate AMT liability, including guidance from the U.S. Treasury and/or the IRS or unfavorable regulatory treatment by FERC and/or applicable state regulatory authorities, could negatively impact FirstEnergy’s cash flows, results of operations and financial condition.\nSTATE REGULATION\nEach of the Electric Companies’ retail rates, conditions of service, issuance of securities and other matters are subject to regulation in the states in which it operates - in Maryland by the MDPSC, in New Jersey by the NJBPU, in Ohio by the PUCO, in Pennsylvania by the PPUC, in West Virginia by the WVPSC and in New York by the NYPSC. The transmission operations of PE and TrAIL in Virginia, ATSI in Ohio, the Transmission Companies in Pennsylvania, PE and MP in West Virginia, and PE in Maryland are subject to certain regulations of the VSCC, PUCO, PPUC, WVPSC, and MDPSC, respectively. In addition, under Ohio law, municipalities may regulate rates of a public utility, subject to appeal to the PUCO if not acceptable to the utility. Further, if any of the FirstEnergy affiliates were to engage in the construction of significant new transmission facilities, depending on the state, they may be required to obtain state regulatory authorization to site, construct and operate the new transmission facility.\nMARYLAND\nPE operates under MDPSC-approved distribution base rates that were effective as of October 19, 2023, and that were subsequently modified by an MDPSC order dated January 3, 2024, which became effective as of March 1, 2024. PE also provides SOS pursuant to a combination of settlement agreements, MDPSC orders and regulations, and statutory provisions. SOS supply is competitively procured in the form of rolling contracts of varying lengths through periodic auctions that are overseen by the MDPSC and a third-party monitor. Although settlements with respect to SOS supply for PE customers have expired, service continues in the same manner until changed by order of the MDPSC. PE recovers its costs plus a return for providing SOS.\nThe EmPOWER Maryland program, following passage of the Climate Solutions Now Act of 2022, required annual incremental energy efficiency targets of 2% per year from 2022 through 2024, 2.25% per year in 2025 and 2026, and 2.5% per year in 2027 and thereafter. On August 1, 2023, PE filed its proposed plan for the 2024-2026 cycle as required by the MDPSC. Additionally, at the direction of the MDPSC, PE together with other Maryland utilities were required to address GHG reductions in addition to energy efficiency. In compliance with the MDPSC directive, PE submitted three scenarios with projected costs over a three-year cycle of $311 million, $354 million, and $510 million, respectively. On December 29, 2023, the MDPSC issued an order approving the $311 million scenario for most programs, with some modifications. On August 15, 2024, PE filed a revised plan for the remainder of the 2024-2026 cycle to comply with refined GHG reduction targets with a total budget of $314 million, which the MDPSC approved on December 27, 2024. PE recovers EmPOWER Maryland program costs with carrying costs on unamortized balances through an annually reconciled surcharge, with certain costs subject to recovery over a five-year amortization period. Lost distribution revenue attributable to energy efficiency or demand reduction is recovered only through base rates. Consistent with an MDPSC order dated December 29, 2022, phasing out the unamortized balances of EmPOWER investments, PE is required to expense 67% of its EmPOWER Maryland program costs in 2025, and 100% in 2026 and beyond. All previously unamortized costs for prior cycles are to be collected by the end of 2030, consistent with the 2024-2026 order issued on \n79\nDecember 29, 2023. New legislation which took effect on July 1, 2024 is expected to reduce the carrying costs on the EmPOWER unamortized balances for PE by a total of $25 to $30 million over the period of 2024-2030. On July 31, 2024, the MDPSC issued an order implementing revised EmPOWER surcharge rates for PE in accordance with the new law, denying PE’s request for a hearing that sought to challenge certain portions of the law. On August 30, 2024, PE filed a petition seeking judicial review of its challenge to the law in the Circuit Court for Washington County, Maryland. On August 6, 2025, the Circuit Court for Washington County, Maryland issued an order granting PE’s petition, finding that the legislature may not change terms to apply retroactively to monies already expended. MDPSC and the Maryland Office of People’s Counsel have each appealed the decision.\nNEW JERSEY\nJCP&L operates under NJBPU approved rates that took effect as of February 15, 2024, and became effective for customers as of June 1, 2024. JCP&L provides BGS for retail customers who do not choose a third-party EGS and for customers of third-party EGSs that fail to provide the contracted service. All New Jersey EDCs participate in this competitive BGS procurement process and recover BGS costs directly from customers as a charge separate from base rates.\nThe settlement of the distribution rate case in 2020, provided among other things, that JCP&L would be subject to a management audit, which began in May 2021. On April 12, 2023, the NJBPU accepted the final management audit report for filing purposes and ordered that interested stakeholders file comments on the report by May 22, 2023, which deadline was extended until July 31, 2023. JCP&L and one other party filed comments on July 31, 2023. On July 16, 2025, the NJBPU issued its final order, directing 100 of the 105 recommendations be implemented, including certain modifications. JCP&L filed its implementation plan on September 22, 2025, and began quarterly progress reporting in October 2025.\nOn September 17, 2021, in connection with Mid-Atlantic Offshore Development, LLC, a transmission company jointly owned by Shell New Energies US and EDF Renewables North America, JCP&L submitted a proposal to the NJBPU and PJM to build transmission infrastructure connecting offshore wind-generated electricity to the New Jersey power grid. On October 26, 2022, the JCP&L proposal was accepted, in part, in an order issued by NJBPU. The proposal, as accepted, included approximately $723 million in investments for JCP&L to both build new and upgrade existing transmission infrastructure. JCP&L’s proposal projects an investment ROE of 10.2% and includes the option for JCP&L to acquire up to a 20% equity stake in Mid-Atlantic Offshore Development, LLC. The resulting rates associated with the project are expected to be shared among the ratepayers of all New Jersey electric utilities. On April 17, 2023, JCP&L applied for the FERC “abandonment” transmission rates incentive, which would provide for recovery of 100% of the cancelled prudent project costs that are incurred after the incentive is approved, and 50% of the costs incurred prior to that date, in the event that some or all of the project is cancelled for reasons beyond JCP&L’s control. On August 21, 2023, FERC approved JCP&L’s application, effective August 22, 2023. \nOn October 31, 2023, offshore wind developer, Orsted, announced plans to cease development of two offshore wind projects in New Jersey—Ocean Wind 1 and 2—having a combined planned capacity of 2,248 MWs. On January 30, 2025, and February 25, 2025, Shell New Energies and EDF Renewables North America respectively announced that each was exiting its Atlantic Shores partnership to construct wind energy off the shore of New Jersey. On June 4, 2025, Atlantic Shores filed a petition with the NJBPU, requesting consent to terminate its 1.5 GW offshore wind project. These cancellations are not expected to directly affect JCP&L’s awarded projects, and JCP&L remains under an obligation to begin construction in 2025 based on current NJBPU direction.\nOn May 23, 2025, JCP&L filed with the NJBPU a motion seeking declaratory guidance in view of recent offshore wind developments, including a shift in federal energy policy toward more traditional energy resources. JCP&L requested that the NJBPU provide guidance either affirming the current project schedule or, alternatively, authorizing JCP&L to modify the schedule. On June 9, 2025, responses to JCP&L’s motion were filed with the NJBPU, including a cross-motion by the New Jersey Division of Rate Counsel to reopen the offshore wind transmission proceeding, which JCP&L opposed. JCP&L advised that it intended to comply with its contractual obligations to construct the transmission project, and that its motion was limited to seeking guidance on the construction milestones. While the motion and cross-motion are pending decision, JCP&L will continue to construct the project per the milestones that are described in JCP&L’s contract with PJM. On July 28, 2025, the New Jersey Division of Rate Counsel asked the NJBPU to take judicial notice of a recent NYPSC order terminating its offshore wind transmission infrastructure process in the interest of protecting ratepayers. On August 13, 2025, the NJBPU issued an order requesting that JCP&L delay expenditures of certain of the transmission investment planned by JCP&L for a 2.5-year period, and directing that JCP&L work with NJBPU staff and PJM to ensure alignment as to the work that is to be continued on the original timeline and the work that is to be delayed consistent with the order.\nConsistent with the commitments made in its proposal to the NJBPU, JCP&L formally submitted in November 2023 the first part of its application to the DOE to finance a substantial portion of the project using low-interest rate loans available under the DOE’s Energy Infrastructure Reinvestment Program of the IRA. JCP&L submitted the second part of its two-part application on March 13, 2024, which was approved on May 17, 2024. The DOE Loan Program Office initiated a due diligence review of the application shortly thereafter. On January 16, 2025, the DOE announced a conditional commitment to JCP&L for a loan guarantee of up to approximately $716 million for the project. On August 20, 2025, the DOE terminated its conditional commitment to JCP&L due to the DOE’s determination that a condition precedent could not be satisfied.\n80\nOn November 9, 2023, JCP&L filed a petition for approval of its EnergizeNJ with the NJBPU that would, among other things, support grid modernization, system resiliency and substation modernization in technologies designed to provide enhanced customer benefits. JCP&L proposes EnergizeNJ will be implemented over a five-year budget period with estimated costs of approximately $935 million over the deployment period, of which, $906 million is capital investments and $29 million is operating and maintenance expenses. Under the proposal, the capital costs of EnergizeNJ would be recovered through JCP&L’s base rates via annual and semi-annual base rate adjustment filings. The 2023 base rate case stipulation that was filed on February 2, 2024, necessitated amendments to the EnergizeNJ program. On February 14, 2024, the NJBPU approved the stipulated settlement between JCP&L and various parties, resolving JCP&L’s request for a distribution base rate increase. On February 27, 2024, as part of the stipulated settlement, JCP&L amended its pending EnergizeNJ petition following receipt of NJBPU approval of the base rate case settlement, to remove the high-priority circuits that are to be addressed in the first phase of its reliability improvement plan and to include the second phase of its reliability improvement plan that is expected to further address certain high-priority circuits that require additional upgrades. On April 10, 2025, JCP&L, joined by various parties, filed a stipulated settlement with the NJBPU resolving JCP&L’s amended EnergizeNJ petition, which the NJBPU approved on April 23, 2025. The settlement provides for total program costs of $339 million, including capital investments in JCP&L’s electric distribution system of approximately $203 million, $132 million of matching capital investment and approximately $4 million of O&M expense. Pursuant to the settlement, the program began on July 1, 2025, and will continue through December 31, 2028. JCP&L has agreed to file a base rate case no later than January 1, 2030.\nIn February 2025, the NJBPU certified the results of its annual basic generation service auctions through which New Jersey’s four EDCs – including JCP&L – satisfy their generation supply requirements for BGS customers for the period beginning June 1, 2025 through May 31, 2026. The certified results resulted in significant rate increases for New Jersey EDC customers and, by order dated April 23, 2025, the NJBPU directed the four EDCs to submit proposals to mitigate the impact of the rate increases that affected residential customers beginning June 1, 2025. On May 7, 2025, JCP&L filed a petition in response to the April 2025 order, modeling four potential mitigation scenarios. On June 18, 2025, the NJBPU approved a stipulation that included JCP&L, NJBPU Staff and New Jersey Division of Rate Counsel, pursuant to which, among other things, JCP&L agreed to apply a temporary rate credit of $30.00 to each residential electric customer’s monthly bill in July and August 2025 that would be deferred in a regulatory asset and recovered with a charge of $10 applied to each residential bill from September 2025 through February 2026 to recover the amounts deferred, without carry charges, subject to a final reconciliation. As of September 30, 2025, JCP&L's regulatory asset associated with this temporary rate credit was approximately $50 million.\nOn August 13, 2025, the NJBPU issued an Order to Show Cause reviewing JCP&L’s 2024 Annual System Performance Report, which includes information regarding JCP&L’s systems level of electric service reliability performance during the prior calendar year. Failure to attain NJBPU’s minimum reliability levels may subject JCP&L to a penalty. The NJBPU order alleges JCP&L has failed to achieve minimum reliability levels for calendar years 2022, 2023, and 2024, and directed JCP&L to file an answer demonstrating why the NJBPU should not impose certain penalties upon JCP&L for such failure, which JCP&L filed on October 10, 2025.\nOHIO\nThe Ohio Companies operate under PUCO-approved base distribution rates that became effective in 2009. The Ohio Companies operated under ESP IV through May 31, 2024, which provided for the supply of power to non-shopping customers at a market-based price set through an auction process. From June 1, 2024, until January 31, 2025, the Ohio Companies operated under ESP V, as modified by the PUCO, and as further described below. On December 18, 2024, the PUCO approved the Ohio Companies’ notice to withdraw ESP V and approved the Ohio Companies’ proposal for returning to ESP IV, with modifications. ESP IV, as modified, continues the DCR rider, which supports continued investment related to the distribution system for the benefit of customers, with an annual revenue cap of $390 million. In addition, ESP IV, as modified, includes: (1) continuation of a base distribution rate freeze until ESP VI becomes effective or the Ohio Companies’ obtain the PUCO’s staff agreement; (2) a goal across FirstEnergy to reduce CO\n2\n emissions by 90% below 2005 levels by 2045; and (3) contributions, totaling $6.39 million per year to: (a) fund energy conservation, economic development and job retention programs in the Ohio Companies’ service territories; and (b) establish fuel-funds in each of the Ohio Companies’ service territories to assist low-income customers.\nOn April 5, 2023, the Ohio Companies filed an application with the PUCO for approval of ESP V, for an eight-year term beginning June 1, 2024, and continuing through May 31, 2032. On May 15, 2024, the PUCO issued an order approving ESP V with modifications, which became effective June 1, 2024, and would have continued through May 31, 2029. ESP V, as modified by the PUCO, provided for, among other things, the continuation of existing riders related to purchased power, transmission and uncollectibles, the continuation of the DCR rider with proposed annual revenue cap increases until new base rates are established, the continuation of the AMI rider, and the addition of new riders for recovery of storm and vegetation management expenses. Many of the terms and conditions were to be reconsidered in the base rate case. The ESP V order additionally directed the Ohio Companies to file another base distribution rate case not later than May 31, 2028, and contribute $32.5 million during the term of ESP V to fund low-income customer bill assistance programs and bill assistance for income-eligible senior citizens, and to develop an electric vehicle education program to assist customers in transitioning to electric vehicles which was recognized in the second quarter of 2024 within “Other operating expenses” at the Regulated Distribution segment and on FirstEnergy’s Consolidated Statements of Income. Due to the risks and uncertainty resulting from the Ohio Companies’ application for rehearing being denied by operation of law, on October 29, 2024, the Ohio Companies filed a notice of their intent to withdraw ESP V and proposed the terms under which they would resume operating under ESP IV. On December 18, 2024, the \n81\nPUCO approved the Ohio Companies’ notice of withdrawal. Also on December 18, 2024, the PUCO approved the Ohio Companies’ proposal for returning to ESP IV, with modifications. Consistent with ESP IV, the PUCO authorized the Ohio Companies’ reinstatement of the DCR rider, with an annual revenue cap of $390 million, and denied the Ohio Companies’ request to continue ESP IV’s DCR rider revenue cap increases of $15 million per year. Additionally, the PUCO ordered that storm costs deferred under ESP V since June 1, 2024, remain on the Ohio Companies’ books and subject to review in a future case. The PUCO also denied the Ohio Companies’ request to lift the base rate freeze in ESP IV, permitting the Ohio Companies’ pending base rate case to continue, but prohibiting new rates from going into effect until either the effective date of ESP VI, or the staff agrees that the freeze be lifted and new rates be implemented. On January 22, 2025, the PUCO approved the Ohio Companies’ revised ESP IV tariffs, effective February 1, 2025, at which time the Ohio Companies resumed operating under ESP IV. On April 7, 2025, certain intervenors filed an appeal to the Supreme Court of Ohio challenging the Ohio Companies’ return to ESP IV. On May 22, 2025, the Ohio Supreme Court granted the Ohio Companies motion to intervene in the appeal. On July 7, 2025, OCC and NOAC filed their Appellants’ brief. Appellees, including the PUCO and the Ohio Companies, filed their briefs on August 26, 2025, to which OCC and NOAC replied on September 15, 2025.\nOn January 31, 2025, the Ohio Companies filed an application with the PUCO for ESP VI, for a term beginning on the date new base distribution rates from the pending base rate case go into effect, in an effort to align with the ongoing base distribution rate case, and continuing through May 31, 2028. ESP VI proposes to continue providing power to non-shopping customers at market-based prices set through an auction process, and proposes to continue riders supporting investment in the Ohio Companies’ distribution system, including Rider DCR with annual reliability performance-based revenue cap increases of $37 million to $43 million, and an AMI rider for recovery of approved grid modernization investments. ESP VI additionally proposes riders to support continued maintenance of the distribution system, including recovery of vegetation management and storm restoration operations and maintenance expenses. In addition, ESP VI proposes energy efficiency programs for low-income customers, and includes a commitment to spend $6.5 million annually over the ESP VI term, without recovery from customers, on initiatives to assist low-income customers, as well as education and incentives to help ensure customers have good experiences with electric vehicles. The PUCO held a technical conference on March 12, 2025.\nOn March 14, 2025, as directed by the PUCO in its December 18, 2024, order approving the Ohio Companies’ revised ESP IV tariffs, the Ohio Companies filed with the PUCO a request to commence their statutorily required quadrennial review of ESP IV and establish a proposed schedule. On July 10, 2025, the Ohio Companies withdrew the request for the PUCO to establish a procedural schedule following the May 15, 2025 signing by the Ohio Governor of HB 15 ending the statutory mandate to conduct the quadrennial review, effective August 14, 2025. The OCC filed its response to the Ohio Companies of notice of withdrawal on July 25, 2025, to which the Ohio Companies replied on August 1, 2025. The matter remains pending before the PUCO.\nOn May 31, 2024, the Ohio Companies filed their application for an increase in base distribution rates based on a 2024 calendar year test period. The Ohio Companies requested a net increase in base distribution revenues of approximately $94 million, with a return on equity of 10.8% and capital structures of 44% debt and 56% equity for CEI, 46% debt and 54% equity for OE, and 45% debt and 55% equity for TE, which reflects a roll-in of current riders such as DCR and AMI. Key components of the base rate case filing include a proposal to change pension and OPEB recovery to the delayed recognition method and to implement a mechanism to establish a regulatory asset (or liability) to recover (or refund) net differences between the amount of pension and OPEB expense requested in the proceeding and the actual amount each year using this method. Additionally, the Ohio Companies request recovery of certain incurred costs, including the impact of major storms, a program to convert streetlights to LEDs, and others. On June 14, 2024, the Ohio Companies filed supporting testimony. On July 31, 2024, the Ohio Companies filed an update that adjusted the net increase in base distribution revenues to approximately $190 million and incorporated matters in the rate case as directed by the PUCO’s ESP V order. On January 27, 2025, the Ohio Companies filed a notice in the base rate case notifying parties that they will update their application for an increase in base distribution rates to reflect the withdrawal of ESP V and the reversion to ESP IV. The PUCO staff hired a third-party to assist in the review of the Ohio Companies' base rate case filing, and on February 21, 2025, PUCO staff and the third-party auditor each filed their reports. The auditor’s report recommended adjustments which would result in a net increase of the Ohio Companies’ base distribution revenues of approximately $8 million, with a return on equity of 9.63% and capital structures of 48.8% debt and 51.2% equity for each of the Ohio Companies. The PUCO staff’s report takes limited positions on the auditor’s finding and recommendations and makes additional findings. On March 24, 2025, the Ohio Companies, OCC, and other parties filed objections to the PUCO’s staff report and the auditor’s report. In addition, the Ohio Companies filed certain pieces of supplemental testimony and intervenors filed direct testimony. The Ohio Companies and various parties are engaged in settlement discussions with respect to the pending base rate case. Evidentiary hearings were held between May 5, 2025, and May 29, 2025. Initial and reply briefs were filed on June 20, 2025 and July 7, 2025, respectively. On July 21, 2025, the Ohio Companies filed a motion to strike, to which the PUCO staff and other intervenors responded on August 5, 2025. The Ohio Companies filed their reply on August 12, 2025. An order is anticipated in November 2025.\nOn May 16, 2022, May 15, 2023, and May 15, 2024, the Ohio Companies filed their SEET applications for determination of the existence of significantly excessive earnings under ESP IV for calendar years 2021, 2022, and 2023, respectively. On May 15, 2025, the Ohio Companies filed their SEET application for determination of the existence of significantly excessive earnings under ESPs IV and V for calendar year 2024. Each application demonstrated that each of the individual Ohio Companies did not have significantly excessive earnings. These matters remain pending before the PUCO.\n82\nOn September 8, 2020, the OCC filed motions in the Ohio Companies’ corporate separation audit and DMR audit dockets, requesting the PUCO to open an investigation and management audit, hire an independent auditor, and require FirstEnergy to show it did not improperly use money collected from consumers or violate any utility regulatory laws, rules or orders in its activities regarding HB 6. On December 30, 2020, in response to the OCC's motion, the PUCO reopened the DMR audit docket, and directed PUCO staff to solicit a third-party auditor and conduct a full review of the DMR to ensure funds collected from customers through the DMR were only used for the purposes established in ESP IV. On June 2, 2021, the PUCO selected an auditor, and the auditor filed the final audit report on January 14, 2022, which made certain findings and recommendations. The report found that spending of DMR revenues was not required to be tracked, and that DMR revenues, like all rider revenues, are placed into the regulated money pool as a matter of routine, where the funds lose their identity. Therefore, the report could not suggest that DMR funds were used definitively for direct or indirect support for grid modernization. The report also concluded that there was no documented evidence that ties revenues from the DMR to lobbying for the passage of HB 6, but also could not rule out with certainty uses of DMR funds to support the passage of HB 6. The report further recommended that the regulated companies' money pool be audited more frequently and the Ohio Companies adopt formal dividend policies. Final comments and responses were filed by parties during the second quarter of 2022. The proceeding was stayed in its entirety, including discovery and motions, continuously at the request of the U.S. Attorney for the Southern District of Ohio beginning in August 2022 and was lifted on February 26, 2024. On February 26, 2024, the Attorney Examiner consolidated this proceeding with the expanded DCR rider audit proceeding described below and on November 22, 2024, the administrative law judge ordered that the bifurcated portion of the corporate separation audit, discussed further below, be consolidated with the already-consolidated DMR audit and expanded DCR rider audit proceeding. Evidentiary hearings were held between June 10, 2025, and June 27, 2025. Initial and reply briefs were filed by the parties on July 21, 2025, and August 4, 2025, respectively.\nOn September 15, 2020, the PUCO opened a new proceeding to review the political and charitable spending by the Ohio Companies in support of HB 6 and the subsequent referendum effort, and directed the Ohio Companies to show cause, demonstrating that the costs of any political or charitable spending in support of HB 6, or the subsequent referendum effort, were not included, directly or indirectly, in any rates or charges paid by customers. The Ohio Companies initially filed a response stating that the costs of any political or charitable spending in support of HB 6, or the subsequent referendum effort, were not included, directly or indirectly, in any rates or charges paid by customers, but on August 6, 2021, filed a supplemental response explaining that, in light of the facts set forth in the DPA and the findings of the DCR rider audit report further discussed below, political or charitable spending in support of HB 6, or the subsequent referendum effort, affected pole attachment rates paid by approximately $15,000. On October 26, 2021, the OCC filed a motion requesting the PUCO to order an independent external audit to investigate FE’s political and charitable spending related to HB 6, and to appoint an independent review panel to retain and oversee the auditor. In November and December 2021, parties filed comments and reply comments regarding the Ohio Companies’ original and supplemental responses to the PUCO’s September 15, 2020, show cause directive. On May 4, 2022, the PUCO selected a third-party auditor to determine whether the show cause demonstration submitted by the Ohio Companies is sufficient to ensure that the cost of any political or charitable spending in support of HB 6 or the subsequent referendum effort was not included, directly or indirectly, in any rates or charges paid by ratepayers. The proceeding was stayed in its entirety, including discovery and motions, continuously at the request of the U.S. Attorney for the Southern District of Ohio beginning in August 2022 and the stay was lifted on February 26, 2024. On September 30, 2024, the third-party auditor’s report was filed. The audit examined 53 payments totaling approximately $75 million made in support of the passage of HB 6 and subsequent referendum efforts, and concluded that less than $5 million was allocated to the Ohio Companies. The audit report affirmed the Ohio Companies’ conclusion in its August 6, 2021 filing that a rate impact of less than $15,000 was charged to the Ohio Companies’ pole attachment customers associated with political and charitable spending in support of HB 6. On October 22, 2024, parties filed comments on the audit report, and on November 5, 2024, parties filed reply comments. The parties' comments remain pending with the PUCO. The administrative law judge set a procedural schedule on September 5, 2025. Evidentiary hearings are scheduled to begin on February 24, 2026.\nIn connection with an ongoing audit of the Ohio Companies’ policies and procedures relating to the code of conduct rules between affiliates, on November 4, 2020, the PUCO initiated an additional corporate separation audit as a result of the FirstEnergy leadership transition announcement made on October 29, 2020, as further discussed below. The additional audit is to ensure compliance by the Ohio Companies and their affiliates with corporate separation laws and the Ohio Companies’ corporate separation plan. The additional audit is for the period from November 2016 through October 2020. The final audit report was filed on September 13, 2021. The audit report makes no findings of major non-compliance with Ohio corporate separation requirements, minor non-compliance with eight requirements, and findings of compliance with 23 requirements. Parties filed comments and reply comments on the audit report. The proceeding was stayed in its entirety, including discovery and motions, continuously at the request of the U.S. Attorney for the Southern District of Ohio beginning in August 2022 and the stay was lifted on February 26, 2024. On September 10, 2024, the Ohio Companies filed testimony describing their compliance with Ohio corporate separation laws and the implementation of the recommendations made in the audit reports. On September 20, 2024, intervenors filed testimony recommending fines for alleged violations of the Ohio corporate separation requirements. Evidentiary hearings were held on October 9 and 10, 2024; the scope of the hearings excluded allegations involving activities related to the passage of HB 6 and the former PUCO chairman, which were later addressed in hearings held between June 10, 2025, and June 27, 2025, as further described below. Initial and reply briefs have been filed by the Ohio Companies, PUCO staff and the intervening parties. To the extent the PUCO ultimately accepts the intervenors’ recommendations and issues a fine to the Ohio Companies, such amount is not expected to be material.\n83\nOn September 3, 2024, the Ohio Companies filed an application to amend their corporate separation plan to incorporate certain recommendations from prior audit reports, which include, but are not limited to, improving controls for non-regulated competitive employees’ physical space and access to data, updating and implementing a process to annually review the cost allocation manual, developing state specific codes of conduct practices, and implementing additional training related to the cost allocation manual and the state codes of conduct. On October 23, 2024, the administrative law judge issued an entry suspending automatic approval of the amended corporate separation plan and establishing a procedural schedule. \nIn connection with an ongoing annual audit of the Ohio Companies’ DCR rider for 2020, and as a result of disclosures in FirstEnergy’s Form 10-K for the year ended December 31, 2020 (filed on February 18, 2021), the PUCO expanded the scope of the audit on March 10, 2021, to include a review of certain transactions that were either improperly classified, misallocated, or lacked supporting documentation, and to determine whether funds collected from customers were used to pay the vendors, and if so, whether or not the funds associated with those payments should be returned to customers through the DCR rider or through an alternative proceeding. On August 3, 2021, the auditor filed its final report on this phase of the audit, and the parties submitted comments and reply comments on this audit report in October 2021. Additionally, on September 29, 2021, the PUCO expanded the scope of the audit in this proceeding to determine if the costs of the naming rights for FirstEnergy Stadium have been recovered from the Ohio Companies’ customers. On November 19, 2021, the auditor filed its final report, in which the auditor concluded that the FirstEnergy Stadium naming rights expenses were not recovered from Ohio customers. On December 15, 2021, the PUCO further expanded the scope of the audit to include an investigation into an apparent nondisclosure of a side agreement in the Ohio Companies’ ESP IV settlement proceedings, but stayed its expansion of the audit until otherwise ordered by the PUCO. The proceeding was stayed in its entirety, including discovery and motions, continuously at the request of the U.S. Attorney for the Southern District of Ohio beginning in August 2022 and the stay was lifted on February 26, 2024. On February 26, 2024, the Attorney Examiner consolidated this proceeding with the Rider DMR audit proceeding described above, and further lifted the stay of the portion of the investigation relating to an apparent nondisclosure of a side agreement. On November 22, 2024, the administrative law judge ordered that the bifurcated portion of the corporate separation audit be consolidated with the already-consolidated DMR audit and the expanded DCR rider audit proceeding. Evidentiary hearings were held between June 10, 2025, and June 27, 2025. Initial and reply briefs were filed by the parties on July 21, 2025, and August 4, 2025, respectively.\nIn the fourth quarter of 2020, motions were filed with the PUCO requesting that the PUCO amend the Ohio Companies’ riders for collecting the OVEC-related charges required by HB 6 to provide for refunds in the event such provisions of HB 6 are repealed. Neither the Ohio Companies nor FE benefit from the OVEC-related charges the Ohio Companies collect. Instead, the Ohio Companies were further required by HB 6 to remit all the OVEC-related charges they collect to non-FE Ohio electric distribution utilities until August 14, 2025, at which time HB 15 became effective and the Ohio Companies stopped collecting OVEC-related charges. The Ohio Companies contested the motions, which are pending before the PUCO.\nSee below for additional details on the government investigations and ongoing litigation surrounding the investigation of HB 6.\nPENNSYLVANIA\nFE PA has five rate districts in Pennsylvania – four that correspond to the territories previously serviced by ME, PN, Penn, and WP and one rate district that corresponds to WP’s service provided to The Pennsylvania State University. The rate districts created by the PA Consolidation will not reach full rate unity until the earlier of 2033 or the conclusion of three base rate cases filed after January 1, 2025. FE PA operates under rates approved by the PPUC, effective as of January 1, 2025.\nPursuant to Pennsylvania Act 129 of 2008 and PPUC orders, the Pennsylvania Companies implemented energy efficiency and peak demand reduction programs with demand reduction targets, relative to 2007-2008 peak demands, at 2.9% MW for ME, 3.3% MW for PN, 2.0% MW for Penn, and 2.5% MW for WP; and energy consumption reduction targets, as a percentage of the Pennsylvania Companies’ historic 2009 to 2010 reference load at 3.1% MWh for ME, 3.0% MWh for PN, 2.7% MWh for Penn, and 2.4% MWh for WP. The fourth phase of FE PA’s energy efficiency and peak demand reduction program, which runs for the five-year period beginning June 1, 2021 through May 31, 2026, was approved by the PPUC on June 18, 2020, providing cost recovery of approximately $390 million to be recovered through Energy Efficiency and Conservation Phase IV Riders for each FE PA rate district.\nPennsylvania EDCs are permitted to seek PPUC approval of an LTIIP for accelerated infrastructure improvements and costs related to highway relocation projects, after which a DSIC may be approved to recover LTIIP costs. On July 22, 2024, FE PA filed its application with the PPUC seeking approval for the 2025-2029 phase of its LTIIP program, which is expected to result in approximately $1.6 billion in investments, with approximately $1.4 billion of such investments going in service during the five-year period. The PPUC approved FE PA’s application on December 19, 2024, and implementation began in January 2025.\nWEST VIRGINIA\nMP and PE provide electric service to all customers through traditional cost-based, regulated utility ratemaking and operate under WVPSC-approved rates that became effective March 27, 2024. MP and PE recover net power supply costs, including fuel costs, purchased power costs and related expenses, net of related market sales revenue through the ENEC. MP’s and PE’s \n84\nENEC rate is typically updated annually and MP and PE filed their ENEC filing on August 29, 2025, for rates effective January 1, 2026.\nOn April 21, 2022, the WVPSC issued an order approving, effective May 1, 2022, a tariff to offer solar power on a voluntary basis to West Virginia customers and requiring MP and PE to subscribe at least 85% of the planned 50 MWs of solar generation before seeking approval for surcharge cost recovery. MP and PE must seek separate approval from the WVPSC to recover any solar generation costs in excess of the approved solar power tariff. On April 24, 2023, MP and PE sought approval for surcharge cost recovery from the WVPSC for three of the five solar sites, representing 30 MWs of generation. On August 23, 2023, the WVPSC approved the customer surcharge and granted approval to construct three of the five solar sites. The surcharge went into effect January 1, 2024. Two of the five solar generation sites went into service in 2024, with the third in April 2025. On December 4, 2024, MP and PE submitted for approval a settlement agreement to increase its solar surcharge rate. The WVPSC approved the settlement without modification on December 27, 2024, and new rates went into effect on January 1, 2025.\nOn August 29, 2025, MP and PE filed with the WVPSC their annual ENEC case requesting an increase in ENEC rates by approximately $14 million, proposed to be effective January 1, 2026, which represents a 0.8% increase of total revenues. The proposed increase is driven primarily by an under-recovery balance as of June 30, 2025, and higher costs for fuel and reagents. The WVPSC scheduled a hearing for December 15, 2025. An order from the WVPSC is expected by the end of first quarter 2026. \nOn August 29, 2025, MP and PE filed with the WVPSC their biennial review of their vegetation management program and surcharge. MP and PE have proposed an approximate $3.2 million decrease in the surcharge rates due to an over-recovery balance as of June 30, 2025, and higher costs for fuel and reagents. The WVPSC scheduled a hearing for December 15, 2025. An order from the WVPSC is expected by the end of first quarter 2026. \nOn October 1, 2025, MP and PE filed their integrated resource plan with the WVPSC. To ensure that MP and PE can meet their PJM adequacy requirements, the plan proposes, among other things, near-term market capacity purchases, and the addition of 70 MWs of solar generation by 2028 and 1,200 MWs of natural gas combined cycle generation by 2031, which are expected to require a capital investment that is currently estimated to total approximately $2.5 billion. A procedural order is expected from the WVPSC by the end of 2025, and MP and PE expect to seek approval to build or acquire a natural gas combined cycle plant from the WVPSC in the first quarter of 2026.\nFERC REGULATORY MATTERS \nUnder the Federal Power Act, FERC regulates rates for interstate wholesale sales and transmission of electric power, regulatory accounting and reporting under the Uniform System of Accounts, and other matters, including construction and operation of hydroelectric projects. With respect to their wholesale services and rates, the Electric Companies, AE Supply and the Transmission Companies are subject to regulation by FERC. FERC regulations require JCP&L, MP, PE and the Transmission Companies to provide open access transmission service at FERC-approved rates, terms and conditions. Transmission facilities of JCP&L, MP, PE and the Transmission Companies are subject to functional control by PJM and transmission service using their transmission facilities is provided by PJM under the PJM Tariff.\nFERC regulates the sale of power for resale in interstate commerce in part by granting authority to public utilities to sell wholesale power at market-based rates upon showing that the seller cannot exert market power in generation or transmission or erect barriers to entry into markets. The Electric Companies and AE Supply each have the necessary authorization from FERC to sell their wholesale power, if any, in interstate commerce at market-based rates, although in the case of the Electric Companies major wholesale purchases remain subject to review and regulation by the relevant state commissions.\nFederally enforceable mandatory reliability standards apply to the bulk electric system and impose certain operating, record-keeping and reporting requirements on the Electric Companies, AE Supply, and the Transmission Companies. NERC is the Electric Reliability Organization designated by FERC to establish and enforce these reliability standards, although NERC has delegated day-to-day implementation and enforcement of these reliability standards to six regional entities, including RFC. All of the facilities that FirstEnergy operates are located within the RFC region. FirstEnergy actively participates in the NERC and RFC stakeholder processes, and otherwise monitors and manages its companies in response to the ongoing development, implementation and enforcement of the reliability standards implemented and enforced by RFC.\nFirstEnergy believes that it is in material compliance with all currently-effective and enforceable reliability standards. Nevertheless, in the course of operating its extensive electric utility systems and facilities, FirstEnergy occasionally learns of isolated facts or circumstances that could be interpreted as excursions from the reliability standards. If and when such occurrences are found, FirstEnergy develops information about the occurrence and develops a remedial response to the specific circumstances, including in appropriate cases “self-reporting” an occurrence to RFC. Moreover, it is clear that NERC, RFC and FERC will continue to refine existing reliability standards as well as to develop and adopt new reliability standards. Any inability on FirstEnergy’s part to comply with the reliability standards for its bulk electric system could result in the imposition of financial \n85\npenalties, or obligations to upgrade or build transmission facilities, that could have a material adverse effect on its financial condition, results of operations, and cash flows.\nFERC Audit\nFERC’s Division of Audits and Accounting initiated a nonpublic audit of FESC in February 2019. Among other matters, the audit is evaluating FirstEnergy’s compliance with certain accounting and reporting requirements under various FERC regulations. On February 4, 2022, FERC filed the final audit report for the period of January 1, 2015, through September 30, 2021, which included several findings and recommendations that FirstEnergy has accepted. The audit report included a finding and related recommendation on FirstEnergy’s methodology for allocation of certain corporate support costs to regulatory capital accounts under certain FERC regulations and reporting. Effective in the first quarter of 2022 and in response to the finding, FirstEnergy implemented a new methodology for the allocation of these corporate support costs to regulatory capital accounts for its regulated distribution and transmission companies on a prospective basis. With the assistance of an independent outside firm, FirstEnergy completed an analysis during the third quarter of 2022 of these costs and how it impacted certain FERC-jurisdictional wholesale transmission customer rates for the audit period of 2015 through 2021. As a result of this analysis, FirstEnergy reclassified certain transmission capital assets to operating expenses for the audit period. FirstEnergy fully recovered approximately $105 million ($13 million at JCP&L) of these costs reclassified to operating expenses in its transmission formula rate revenue requirements as of December 31, 2024. Furthermore, the Ohio Companies are in the process of addressing the outcomes of the FERC Audit with the PUCO, which includes seeking continued rate base treatment of approximately $97 million of certain corporate support costs allocated to distribution capital assets as of September 30, 2025.\nOn December 8, 2023, FERC audit staff issued a letter advising that two unresolved audit matters, primarily related to FirstEnergy’s plan to recover the reclassified operating expenses in formula transmission rates, were being referred to other offices within FERC for further review. On July 5, 2024, and September 26, 2024, the FERC Office of Enforcement issued additional data requests related to the 2022 reclassification of operating expenses, to which FirstEnergy replied. On September 10, 2024, and January 13, 2025, the FERC Office of Enforcement issued further data requests related to the classification and recovery of a since terminated fuel consulting contract, to which FirstEnergy responded. If the FERC Office of Energy Market Regulation and the FERC Office of Enforcement were to successfully challenge the recovery of the 2022 reclassified operating expenses and formula transmission rates it could have a material adverse effect on FirstEnergy financial conditions, result of operations, and cash flows.\nTransmission ROE Incentive\nOn February 24, 2022, the OCC filed a complaint with FERC against ATSI, AEP’s Ohio affiliate and American Electric Power Service Corporation, and Duke Energy Ohio, Inc. asserting that FERC should reduce the ROE utilized in the utilities’ transmission formula rates by eliminating the 50 basis point adder associated with RTO membership, effective February 24, 2022. The OCC contends that this result is required because Ohio law mandates that transmission owning utilities join an RTO and that the 50 basis point adder is applicable only where RTO membership is voluntary. On December 15, 2022, FERC denied the complaint as to ATSI and Duke Energy Ohio, Inc., but granted it as to AEP’s Ohio affiliate. AEP’s Ohio affiliate and OCC appealed FERC’s orders to the Sixth Circuit. On January 17, 2025, the Sixth Circuit ruled that the 50 basis point adder is available only where RTO membership is voluntary, that Ohio law requires Ohio’s transmission utilities to be members of an RTO, and that it was unlawful for FERC to excise the adder from AEP’s Ohio affiliate rates, but not from the Duke Energy Ohio, Inc. and ATSI rates. During 2024, as a result of the ruling, ATSI recognized a $46 million pre-tax charge, with interest, of which $42 million is reported in “Transmission Revenues” and $4 million is reported in “Miscellaneous income, net” on the FirstEnergy Consolidated Statements of Income at the Stand-Alone Transmission segment, to reflect the expected refund owed to transmission customers back to February 24, 2022. On March 3, 2025, FirstEnergy filed for rehearing en banc, and Duke Energy Ohio, Inc. and AEP’s Ohio affiliate also filed for rehearing, which was denied by the Sixth Circuit on March 26, 2025. On April 16, 2025, the Sixth Circuit agreed to hold the case pending further appeal to the Supreme Court of the U.S. On June 20, 2025 and June 24, 2025, ATSI and AEP’s Ohio affiliate, respectively, applied for the Supreme Court of the U.S. to review the Sixth Circuit’s decision. The parties submitted their briefings and the case is pending before the Supreme Court of the U.S.\nTransmission ROE Methodology\nA proposed rulemaking proceeding concerning transmission rate incentives provisions of Section 219 of the 2005 Energy Policy Act was initiated in March of 2020 and remains pending before FERC. Among other things, the rulemaking explored whether utilities should collect an “RTO membership” ROE incentive adder for more than three years. FirstEnergy is a member of PJM, and its transmission subsidiaries could be affected by the proposed rulemaking. FirstEnergy participated in comments on the supplemental rulemaking that were submitted by a group of PJM transmission owners and by various industry trade groups. If there were to be any changes to FirstEnergy's transmission incentive ROE, such changes will be applied on a prospective basis; provided however, due to the Sixth Circuit’s ruling in the Transmission ROE Incentive matter described above, ATSI is collecting the ROE incentive adder subject to refund.\n86\nTransmission Planning Supplemental Projects\nOn September 27, 2023, the OCC filed a complaint against ATSI, PJM and other transmission utilities in Ohio alleging that the PJM Tariff and operating agreement are unjust, unreasonable, and unduly discriminatory because they include no provisions to ensure PJM’s review and approval for the planning, need, prudence and cost-effectiveness of the PJM Tariff Attachment M-3 “Supplemental Projects.” Supplemental Projects are projects that are planned and constructed to address local needs on the transmission system. The OCC demands that FERC: (i) require PJM to review supplemental projects for need, prudence and cost-effectiveness; (ii) appoint an independent transmission monitor to assist PJM in such review; and (iii) require that Supplemental Projects go into rate base only through a “stated rate” procedure whereby prior FERC approval would be needed for projects with costs that exceed an established threshold. Subsequently, intervenors expanded the scope of this proceeding to all of the transmission utilities in PJM, including JCP&L. ATSI and the other transmission utilities in Ohio and PJM filed comments.\nLocal Transmission Planning Complaint\nOn December 19, 2024, the Industrial Energy Consumers of America, a group representing large industrial customers, and state consumer advocates filed a complaint at FERC that asserts that transmission owners are overbuilding “local transmission facilities” with corresponding unjustified increases in transmission rates. The complaint demands that FERC: (i) prohibit transmission owners from planning “local transmission facilities” that are rated at 100kV or higher; (ii) appoint “independent transmission monitors” to conduct such planning; and (iii) condition construction of local transmission facilities on the facility having been planned by the “independent transmission monitor.” FirstEnergy is participating in this matter through a consortium of PJM transmission owners and through certain trade groups, including EEI. FirstEnergy, together with the PJM transmission owners, filed a motion to dismiss the complaint on March 20, 2025, which is pending before FERC. FirstEnergy is unable to predict the outcome or estimate the impact that this complaint may have on its Transmission Companies, however, whether this lawsuit moves forward could have a material impact on FirstEnergy and its transmission capital investment strategy.\nGhiorzi v. PJM\nIn December 2023, PJM assigned certain baseline RTEP projects to NextEra Energy Transmission, which subsequently informed PJM that it would not construct the projects. On April 3, 2025, following the reassignment by PJM of certain baseline RTEP projects in Maryland and Virginia to PE, two individuals filed a complaint at FERC challenging this outcome. The complainants assert that PJM erred in reassigning the work to PE because such reassignment projects: (i) did not reflect the cost estimates or cost caps included in NextEra Energy Transmission’s bid; and (ii) would be constructed with different routing than as originally proposed. FERC set May 7, 2025, as the deadline for intervention and comment. PE intervened, filing a motion to dismiss and answer on May 7, 2025. FirstEnergy and PE are unable to predict the outcome or estimate the impact that this complaint may have.\nValley Link Formula Transmission Rate\nValley Link is a joint venture between FET, AEP and Dominion, and was formed to submit applications to construct transmission solutions to identified transmission reliability issues. In 2024, Valley Link submitted a portfolio of transmission solutions to the reliability issues that were the subject of the PJM 2024 RTEP Window 1 planning process. On February 26, 2025, PJM selected approximately $3 billion of the transmission solutions proposed by Valley Link for construction through PJM’s “baseline” RTEP process. On March 13, 2025, the Valley Link joint venture filed an application for forward-looking formula transmission rates to provide for cost recovery for the portfolio of selected projects. Among other things, the transmission rate application provides for a capital structure of 40% debt and 60% equity, and a base ROE of 10.9% with associated templates and protocols, as well as transmission rate incentives, including the abandonment rate incentive, the CWIP rate incentive, the RTO participation adder incentive, the hypothetical capital structure incentive, and the precommercial regulatory asset incentive. On April 4, 2025, certain parties filed protests of certain elements of the proposed formula rate and requested transmission incentives, to which Valley Link responded on April 21, 2025. On April 8, 2025, PJM also sought to intervene in the matter. On May 14, 2025, FERC issued an initial order that, among other things, accepted the requested abandonment rate incentive, CWIP rate incentive, RTO participation adder incentive, and precommercial regulatory asset rate incentive, and allowed the formula rate to go into effect on May 14, 2025, as requested, subject to refund, pending further settlement and hearing proceedings. An initial settlement conference was held on June 26, 2025, and a procedural schedule for the initial phase of the settlement process was agreed upon. The capital structure incentive and the other open rate design matters are being addressed in confidential settlement negotiations.\nAbandonment Transmission Rate Incentive\nOn February 26, 2025, PJM completed its 2024 Regional Transmission Expansion Plan Open Window 1 process and, among other actions, designated each of ATSI and PE to construct certain transmission projects. On July 11, 2025, ATSI and PE filed a joint application for the abandonment incentive with FERC, which, was approved on September 9, 2025. Effective September 10, 2025, ATSI and PE each became eligible to recover 50% of the project costs incurred prior to September 10, 2025, and 100% of the project costs incurred thereafter for any projects subsequently cancelled for reasons beyond the control of utility management.\n87\nENVIRONMENTAL MATTERS\nVarious federal, state and local authorities regulate the Registrants with regard to air and water quality, hazardous and solid waste management and disposal, and other environmental matters. While the Registrants’ environmental policies and procedures are designed to achieve compliance with applicable environmental laws and regulations, such laws and regulations are subject to periodic review and potential revision by the implementing agencies. The Registrants cannot predict the timing or ultimate outcome of any of these reviews or how any future actions taken as a result thereof may materially impact their business, results of operations, cash flows and financial condition. In general, environmental requirements applicable to the electric power sector are becoming increasingly prescriptive and stringent, and the EPA finalized a number of rules in 2024 that could impact the Registrants. However, the Trump administration has issued certain executive orders and stated its intention to rescind, revise or replace some existing environmental regulations and the ultimate impact of recently finalized rules, several of which are in litigation, and any replacement rules are uncertain.\nOn March 12, 2025, the EPA announced its intent to reevaluate or reconsider numerous environmental regulations, many of which apply to the Registrants. The specific timing or outcome of this initiative remains unknown, but regular required rulemaking processes and procedures still apply, and litigation is also anticipated to occur. The disclosures herein do not attempt to discern potential impacts of these deregulatory actions until and unless formal rulemaking or other regulatory actions are announced and the potential impacts to operations can be discerned.\nThe disclosures below apply to FirstEnergy and the disclosures under “Regulation of Waste Disposal,” are also applicable to JCP&L.\nClean Air Act\nFirstEnergy complies with SO\n2\n and NOx emission reduction requirements under the CAA and SIP by burning lower-sulfur fuel, utilizing combustion controls and post-combustion controls and/or using emission allowances.\nCSAPR requires reductions of NOx and SO\n2\n emissions in two phases (2015 and 2017), ultimately capping SO\n2\n emissions in affected states to 2.4 million tons annually and NOx emissions to 1.2 million tons annually. CSAPR allows trading of NOx and SO\n2\n emission allowances between power plants located in the same state and interstate trading of NOx and SO\n2\n emission allowances with some restrictions. On July 28, 2015, the D.C. Circuit ordered the EPA to reconsider the CSAPR caps on NOx and SO\n2\n emissions from power plants in 13 states, including West Virginia. This followed the 2014 Supreme Court of the U.S. ruling generally upholding the EPA’s regulatory approach under CSAPR but questioning whether the EPA required upwind states to reduce emissions by more than their contribution to air pollution in downwind states. The EPA issued a CSAPR Update on September 7, 2016, reducing summertime NOx emissions from power plants in 22 states in the eastern U.S., including West Virginia, beginning in 2017. Various states and other stakeholders appealed the CSAPR Update to the D.C. Circuit in November and December 2016. On September 13, 2019, the D.C. Circuit remanded the CSAPR Update to the EPA citing that the rule did not eliminate upwind states’ significant contributions to downwind states’ air quality attainment requirements within applicable attainment deadlines. \nAlso in March 2018, the State of New York filed a CAA Section 126 petition with the EPA alleging that NOx emissions from nine states (including West Virginia) significantly contribute to New York’s inability to attain the ozone National Ambient Air Quality Standards. The petition sought suitable emission rate limits for large stationary sources that are allegedly affecting New York’s air quality within the three years allowed by CAA Section 126. On September 20, 2019, the EPA denied New York’s CAA Section 126 petition. On October 29, 2019, the State of New York appealed the denial of its petition to the D.C. Circuit. On July 14, 2020, the D.C. Circuit reversed and remanded the New York petition to the EPA for further consideration. On March 15, 2021, the EPA issued a revised CSAPR Update that addressed, among other things, the remands of the prior CSAPR Update and the New York Section 126 petition. In December 2021, MP purchased NOx emissions allowances to comply with 2021 ozone season requirements. On April 6, 2022, the EPA published proposed rules seeking to impose further significant reductions in EGU NOx emissions in 25 upwind states, including West Virginia, with the stated purpose of allowing downwind states to attain or maintain compliance with the 2015 ozone National Ambient Air Quality Standards. On February 13, 2023, the EPA disapproved 21 SIPs, which was a prerequisite for the EPA to issue a final Good Neighbor Plan or FIP. On June 5, 2023, the EPA issued the final Good Neighbor Plan with an effective date 60 days thereafter. Certain states, including West Virginia, have appealed the disapprovals of their respective SIPs, and some of those states have obtained stays of those disapprovals precluding the Good Neighbor Plan from taking effect in those states. On August 10, 2023, the 4th Circuit granted West Virginia an interim stay of the disapproval of its SIP and on January 10, 2024, after a hearing held on October 27, 2023, granted a full stay which precludes the Good Neighbor Plan from going into effect in West Virginia. In addition to West Virginia, certain other states, and certain trade organizations, including the Midwest Ozone Group of which FE is a member, separately filed petitions for review and motions to stay the Good Neighbor Plan itself at the D.C. Circuit. On September 25, 2023, the D.C. Circuit denied the motions to stay the Good Neighbor Plan. On October 13, 2023, the aggrieved parties filed an Emergency Application for an Immediate Stay of the Good Neighbor Plan with the Supreme Court of the U.S. Oral argument was heard on February 21, 2024. On June 27, 2024, the Supreme Court of the U.S. granted a stay of the Good Neighbor Plan pending disposition of the petition for review in the D.C. Circuit. On February 6, 2025, the EPA filed a motion at the D.C. Circuit to hold the proceedings in abeyance for 60 days to allow the EPA time to familiarize itself with the Good Neighbor Plan and in particular, time to brief the new administration about these \n88\nconsolidated petitions and the underlying Rule to allow them to decide what action, if any, is necessary. On March 10, 2025, the EPA filed a motion for remand with the D.C. Circuit identifying issues with the Good Neighbor Plan that make reconsideration appropriate. The D.C. Circuit granted the motion for remand and cancelled oral argument. Consistent with its March 12, 2025 announcement, the EPA intends to undertake reconsideration of the rule and complete any new rulemaking by Fall 2026. \nClimate Change\nIn recent years, certain regulators in the U.S. have focused efforts on increasing disclosures by companies related to climate change and mitigation efforts. At the federal level, presidential administrations have held differing views on prioritizing actions to address GHG emissions and, by extension, climate change. Those differing views have led to policy changes, creating uncertainty about environmental requirements and associated impacts. \nIn December 2009, the EPA released its final “Endangerment and Cause or Contribute Findings for GHGs under the Clean Air Act,” concluding that concentrations of several key GHGs constitute an “endangerment” and may be regulated as “air pollutants” under the CAA and mandated measurement and reporting of GHG emissions from certain sources, including electric generating plants. Subsequently, the EPA released its final CPP regulations in August 2015 to reduce CO\n2\n emissions from existing fossil fuel-fired EGUs and finalized separate regulations imposing CO\n2\n emission limits for new, modified, and reconstructed fossil fuel-fired EGUs. Numerous states and private parties filed appeals and motions to stay the CPP with the D.C. Circuit in October 2015. On February 9, 2016, the Supreme Court of the U.S. stayed the rule during the pendency of the challenges to the D.C. Circuit and Supreme Court of the U.S. On March 28, 2017, an executive order, entitled “Promoting Energy Independence and Economic Growth,” instructed the EPA to review the CPP and related rules addressing GHG emissions and suspend, revise or rescind the rules if appropriate. On June 19, 2019, the EPA repealed the CPP and replaced it with the ACE rule that established guidelines for states to develop standards of performance to address GHG emissions from existing coal-fired generation. On January 19, 2021, the D.C. Circuit vacated and remanded the ACE rule declaring that the EPA was “arbitrary and capricious” in its rulemaking and, as such, the ACE rule is no longer in effect and all actions thus far taken by states to implement the federally mandated rule are now null and void. Vacating the ACE rule had the unintended effect of reinstating the CPP because the repeal of the CPP was a provision within the ACE rule. The D.C. Circuit decision was appealed by several states and interested parties, including West Virginia, arguing that the EPA did not have the authorization under Section 111(d) of the CAA to require “generation shifting” as a way to limit GHGs. On June 30, 2022, the Supreme Court of the U.S. in \nWest Virginia v. Environmental Protection Agency\n held that the method the EPA used to regulate GHGs (generation shifting) under Section 111(d) of the CAA (the CPP) was not authorized by Congress and remanded the rule to the EPA for further reconsideration. In response, on May 23, 2023, the EPA published a proposed rule pursuant to CAA Section 111 (b) and (d) in line with the decision in \nWest Virginia v. Environmental Protection Agency\n intended to reduce power sector GHG emissions (primarily CO\n2\n emissions) from fossil fuel based EGUs. The rule, which proposed stringent GHG emissions limitations based on fuel type and unit retirement date, was issued as final by the EPA on April 25, 2024. In May 2024, a group of 25 states, including West Virginia, filed a challenge to the rule in the D.C. Circuit. Also in May 2024, other utility groups, including the Midwest Ozone Group and Electric Generators for a Sensible Transition, both of which MP is a member, filed petitions for review of the GHG rule as well as motions to stay the rule in the D.C. Circuit. On July 19, 2024, the D.C. Circuit denied the stay motions and on July 23 and 26, 2024 the aggrieved petitioners filed emergency stay applications to the Supreme Court of the U.S. On October 16, 2024, the Supreme Court of the U.S. denied the stay applications. On December 6, 2024, oral arguments on the merits of the challenge were heard by the D.C. Circuit. On February 5, 2025, the Department of Justice filed an unopposed motion on behalf of the EPA in the D.C. Circuit, seeking to hold the litigation in abeyance, and forego issuing its opinion, for a period of 60 days while the new leadership at the EPA evaluates the rule and determines how it wishes to proceed. On February 19, 2025, the D.C. Circuit granted the EPA’s motion. The D.C. Circuit subsequently granted a second motion from the EPA placing the litigation in abeyance until further order of the Court. On June 17, 2025, the EPA published a proposed rule to repeal the GHG rule.\nAmong other deregulatory actions, Executive Order 14514 directs the EPA Administrator to make recommendations on the “legality and continuing applicability” of the EPA’s 2009 Endangerment Finding, which forms the basis for the EPA's GHG regulations. On March 12, 2025, the EPA announced a series of planned deregulatory actions that it would be taking related to such executive order, including reconsideration of the regulations to limit power plant GHG emissions. On July 29, 2025, the EPA announced a proposal to rescind its 2009 Endangerment Finding, which, if finalized, would repeal all resulting GHG emissions regulations. Depending on the outcome of any appeals and the EPA review, compliance with the GHG emissions limits could require additional capital expenditures or changes in operation at the Fort Martin and Harrison power stations. \nIn addition, there are several initiatives to reduce GHG emissions at the state and international level. Certain northeastern states are participating in the Regional Greenhouse Gas Initiative and western states, including California, have implemented programs to control emissions of certain GHGs and enhance public disclosures relating to the same. Additional policies reducing GHG emissions, such as demand reduction programs, renewable portfolio standards and renewable subsidies have been implemented across the nation.\nFirstEnergy has pledged to achieve carbon neutrality by 2050 with respect to GHGs within FirstEnergy’s direct operational control (known as Scope 1 emissions). FirstEnergy’s ability to achieve its GHG reduction goal is subject to its ability to make operational changes and is conditioned upon numerous risks, many of which are outside of its control. With respect to FirstEnergy’s coal-fired plants in West Virginia, which serve as the primary source of its Scope 1 emissions, it has identified that the end of the useful life date is 2035 for Fort Martin and 2040 for Harrison. MP filed its 10-year integrated resource plan with the \n89\nWVPSC on October 1, 2025, which highlighted, among other things, the need for new dispatchable generation in West Virginia. Determination of the useful life of the regulated coal-fired generation could result in changes in depreciation, and/or continued collection of net plant in rates after retirement, securitization, sale, impairment, or regulatory disallowances. If FirstEnergy is unable to recover these costs, it could have a material adverse effect on FirstEnergy’s financial condition, results of operations, and cash flow. FirstEnergy cannot currently estimate the financial impact of climate change policies, although potential legislative or regulatory programs restricting CO\n2\n emissions, or litigation alleging damages from GHG emissions, could require material capital and other expenditures or result in changes to its operations.\nFirstEnergy continues to monitor climate change policies at both the federal and state level. Currently, FirstEnergy anticipates continued uncertainty, and may need to make decisions even as policies shift from administration to administration. \nClean Water Act\nVarious water quality regulations, the majority of which are the result of the federal Clean Water Act and its amendments, apply to FirstEnergy’s facilities. In addition, the states in which FirstEnergy operates have water quality standards applicable to FirstEnergy’s operations. \nOn September 30, 2015, the EPA finalized new, more stringent effluent limits for the Steam Electric Power Generating category (40 CFR Part 423) for arsenic, mercury, selenium and nitrogen for wastewater from wet scrubber systems and zero discharge of pollutants in ash transport water. The treatment obligations were to phase-in as permits were renewed on a five-year cycle from 2018 to 2023. However, on April 13, 2017, the EPA granted a Petition for Reconsideration and on September 18, 2017, the EPA postponed certain compliance deadlines for two years. On August 31, 2020, the EPA issued a final rule revising the effluent limits for discharges from wet scrubber systems, retaining the zero-discharge standard for ash transport water, (with some limited discharge allowances), and extending the deadline for compliance to December 31, 2025, for both. In addition, the EPA allows for less stringent limits for sub-categories of generating units based on capacity utilization, flow volume from the scrubber system, and unit retirement date. On March 29, 2023, the EPA published proposed revised ELGs applicable to coal-fired power plants that include more stringent effluent limitations for wet scrubber systems and ash transport water, and new limits on landfill leachate. The rule was issued as final by the EPA on April 25, 2024. On May 30, 2024, the Utility Water Act Group, of which FirstEnergy is a member, filed a Petition for Review of the 2024 ELG Rule with the U.S. Court of Appeals for the Fifth and Eighth Circuit Courts, and on June 18, 2024, the Utility Water Group filed a motion to stay the rule pending disposition on the merits. A number of other parties have challenged the final rule in various petitions for review across several circuits. Those petitions and motions for stay have been consolidated in the U.S. Court of Appeals for the Eighth Circuit. On October 10, 2024, the U.S. Court of Appeals for the Eighth Circuit denied the motions for stay. On February 19, 2025, the U.S. Department of Justice filed a motion on behalf of the EPA in the U.S. Court of Appeals for the Eighth Circuit, seeking to hold the litigation in abeyance for a period of 60 days while the new leadership at the EPA evaluates the rule and determines how it wishes to proceed. On February 28, 2025, U.S. Court of Appeals for the Eighth Circuit granted the EPA’s motion. On March 12, 2025, the EPA announced a series of planned deregulatory actions, including reconsideration of the 2024 ELG rule. On October 10, 2025, the EPA published a proposed ELG Deadline Extensions Rule and companion Direct Final Rule extending certain compliance deadlines included in the 2024 ELG Rule. Depending on the outcome of appeals and the EPA’s review, compliance with the 2024 ELG rule could require additional capital expenditures or changes in operation at closed and active landfills, and at the Ft. Martin and Harrison power stations from what was approved by the WVPSC in September 2022 to comply with the 2020 ELG rule. FirstEnergy is currently assessing the impact of the final rule.\nRegulation of Waste Disposal\nFederal and state hazardous waste regulations have been promulgated as a result of the Resource Conservation and Recovery Act, as amended, and the Toxic Substances Control Act. Certain CCRs, such as coal ash, were exempted from hazardous waste disposal requirements pending the EPA’s evaluation of the need for future regulation.\nIn April 2015, the EPA finalized regulations for the disposal of CCRs (non-hazardous), establishing national standards for landfill design, structural integrity design and assessment criteria for surface impoundments, groundwater monitoring and protection procedures and other operational and reporting procedures to assure the safe disposal of CCRs from electric generating plants. On September 13, 2017, the EPA announced that it would reconsider certain provisions of the final regulations. On July 29, 2020, the EPA published a final rule again revising the date that certain CCR impoundments must cease accepting waste and initiate closure to April 11, 2021. The final rule allowed for an extension of the closure deadline based on meeting identified site-specific criteria. On November 30, 2020, AE Supply submitted a closure deadline extension request to the EPA seeking to extend the cease accepting waste date for the McElroy's Run CCR impoundment facility to October 2024, which request was withdrawn by AE Supply on July 9, 2024, prior to the completion of the technical review by the EPA. As of May 31, 2024, AE Supply ceased accepting waste at the McElroy’s Run CCR impoundment facility from Pleasants Power Station. During 2024, as a result of the evaluation of closure options for McElroy’s Run and the adjacent landfill, AE Supply reviewed its ARO and future expected costs to remediate, resulting in an increase to the ARO liability of $87 million. AE Supply transferred the McElroy’s Run CCR impoundment facility and adjacent dry landfill and related remediation obligations on March 4, 2025, pursuant to the environmental liability transfer agreement dated February 3, 2025 with a subsidiary of IDA Power, LLC. Pursuant to the agreement, AE Supply established a $160 million escrow account that AE Supply will fund over five years and is secured by a surety bond, which is guaranteed by FE. In connection with the transfer, AE Supply recognized a $130 million liability, based on a \n90\n4.8% weighted average discount rate over the contract term, associated with its remaining obligation to fund the escrow account over the next five years, and derecognized the ARO, resulting in an immaterial impact to earnings. During the nine months ended September 30, 2025, AE Supply made $46 million of cash payments to the escrow account.\nOn May 8, 2024, the EPA issued the Legacy CCR Rule, which finalized changes to the CCR regulations addressing inactive surface impoundments at inactive electric utilities, known as legacy CCR surface impoundments. The rule extends 2015 CCR Rule requirements for groundwater monitoring and protection, operational and reporting procedures as well as closure requirements to impoundments and landfills that were not originally included for coverage by the 2015 CCR Rule. Furthermore, the EPA’s interpretations of the EPA CCR regulations continue to evolve through enforcement and other regulatory actions. FirstEnergy is currently assessing the potential impacts of the final rule, including a review of additional sites to which the new rule might be applicable. On February 13, 2025, the U.S. Department of Justice filed a motion on behalf of the EPA in the D.C. Circuit, seeking to hold the litigation, which was filed on August 8, 2024, by the Utility Solid Waste Act Group with FE as a member, in abeyance for a period of 120 days while the new leadership at the EPA evaluates the rule and determines how it wishes to proceed, which the D.C. Circuit granted. On March 12, 2025, the EPA announced a series of planned deregulatory actions, including reconsideration of the final Legacy CCR Rule. FirstEnergy continues to monitor the EPA’s actions related to CCR regulations; however, the ultimate impact is unknown at this time and is subject to the outcome of the litigation and any future state regulatory actions. Depending on the outcome of appeals and the EPA’s rule, compliance with the final Legacy CCR Rule could require remedial actions, including removal of coal ash. See Note 8, “Asset Retirement Obligations,” of the Combined Notes to Financial Statements of the Registrants above for a description of the $139 million increase to its ARO that FirstEnergy recorded during 2024 as a result of its analysis. JCP&L did not have any legacy CCR disposal sites that were applicable to the 2024 CCR rules.\nCertain of the FirstEnergy companies have been named as potentially responsible parties at waste disposal sites, which may require cleanup under the CERCLA. Allegations of disposal of hazardous substances at historical sites and the liability involved are often unsubstantiated and subject to dispute; however, federal law provides that all potentially responsible parties for a particular site may be liable on a joint and several basis. Environmental liabilities that are considered probable have been recognized on FirstEnergy’s Consolidated Balance Sheets as of September 30, 2025, based on estimates of the total costs of cleanup, FirstEnergy’s proportionate responsibility for such costs and the financial ability of other unaffiliated entities to pay. Total liabilities of approximately $93 million have been accrued through September 30, 2025, of which approximately $67 million are for environmental remediation of former MGP and gas holder facilities in New Jersey, which are being recovered by JCP&L through a non-bypassable societal benefits charge. FE or its subsidiaries could be found potentially responsible for additional amounts or additional sites, but the loss or range of losses cannot be determined or reasonably estimated at this time.\nOTHER LEGAL PROCEEDINGS\nU.S. v. Larry Householder, et al.\nOn July 21, 2020, a complaint and supporting affidavit containing federal criminal allegations were unsealed against the now former Ohio House Speaker Larry Householder and other individuals and entities allegedly affiliated with Mr. Householder. In March 2023, a jury found Mr. Householder and his co-defendant, Matthew Borges, guilty and in June 2023, the two were sentenced to prison for 20 and five years, respectively. Messrs. Householder and Borges have appealed their sentences; the U.S. Court of Appeals for the Sixth Circuit recently rejected their appeal upholding their convictions. Also, on July 21, 2020, and in connection with the U.S. Attorney’s Office’s investigation, FirstEnergy received subpoenas for records from the U.S. Attorney’s Office for the Southern District of Ohio. FirstEnergy was not aware of the criminal allegations, affidavit or subpoenas before July 21, 2020. On January 17, 2025, the U.S. Attorney’s Office announced that a federal grand jury charged two former FirstEnergy senior officers with one count of participating in a Racketeer Influenced and Corrupt Organizations Act conspiracy. The allegations in the indictment are largely based on the conduct described in the DPA.\nOn July 21, 2021, FE entered into a three-year DPA with the U.S. Attorney’s Office that, subject to court proceedings, resolves this matter as to FE. Under the DPA, FE agreed to the filing of a criminal information charging FE with one count of conspiracy to commit honest services wire fraud. The DPA required that FirstEnergy, among other obligations: (i) continue to cooperate with the U.S. Attorney’s Office in all matters relating to the conduct described in the DPA and other conduct under investigation by the U.S. government; (ii) pay a criminal monetary penalty totaling $230 million within sixty days, consisting of (x) $115 million paid by FE to the U.S. Treasury and (y) $115 million paid by FE to the ODSA to fund certain assistance programs, as determined by the ODSA, for the benefit of low-income Ohio electric utility customers; (iii) publish a list of all payments made in 2021 to either 501(c)(4) entities or to entities known by FirstEnergy to be operating for the benefit of a public official, either directly or indirectly, and update the same on a quarterly basis during the term of the DPA; (iv) issue a public statement, as dictated in the DPA, regarding FE’s use of 501(c)(4) entities; and (v) continue to implement and review its compliance and ethics program, internal controls, policies and procedures designed, implemented and enforced to prevent and detect violations of U.S. laws throughout its operations, and to take certain related remedial measures. The $230 million payment will neither be recovered in rates or charged to FirstEnergy customers, nor will FirstEnergy seek any tax deduction related to such payment. The entire amount of the monetary penalty was recognized as an expense in the second quarter of 2021 and paid in the third quarter of 2021. As of July 22, 2024, FirstEnergy had successfully completed the obligations required within the three-year term of the DPA. Under the DPA, FirstEnergy has an obligation to continue: (i) publishing quarterly a list of all payments to 501(c)(4) entities and all payments to entities known by FirstEnergy operating for the benefit of a public official, either directly or indirectly; (ii) not making any \n91\nstatements that contradict the DPA; (iii) notifying the U.S. Attorney’s Office of any changes in FirstEnergy’s corporate form; and (iv) cooperating with the U.S. Attorney’s Office until the conclusion of any related investigation, criminal prosecution, and civil proceeding brought by the U.S. Attorney’s Office, including the aforementioned federal indictment against two former FirstEnergy senior officers. Within 30 days of those matters concluding, and FirstEnergy’s successful completion of its remaining obligations, the U.S. Attorney’s Office will dismiss the criminal information. On February 26, 2025, the U.S. Attorney’s Office filed a status report confirming these commitments.\nLegal Proceedings Relating to U.S. v. Larry Householder, et al.\nCertain FE stockholders and FirstEnergy customers also filed several lawsuits against FirstEnergy and certain current and former directors, officers and other employees, and the complaints in each of these suits is related to allegations in the complaint and supporting affidavit relating to HB 6 and the now former Ohio House Speaker Larry Householder and other individuals and entities allegedly affiliated with Mr. Householder. The plaintiffs in each of the below cases seek, among other things, to recover an unspecified amount of damages (unless otherwise noted).\n•\nIn re FirstEnergy Corp. Securities Litigation \n(S.D. Ohio); on July 28, 2020, and August 21, 2020, purported stockholders of FE filed putative class action lawsuits alleging violations of the federal securities laws. Those actions have been consolidated and a lead plaintiff, the Los Angeles County Employees Retirement Association, has been appointed by the court. A consolidated complaint was filed on February 26, 2021. The consolidated complaint alleges, on behalf of a proposed class of persons who purchased FE securities between February 21, 2017 and July 21, 2020, that FE and certain current or former FE officers violated Sections 10(b) and 20(a) of the Exchange Act by issuing alleged misrepresentations or omissions concerning FE’s business and results of operations. The consolidated complaint also alleges that FE, certain current or former FE officers and directors, and a group of underwriters violated Sections 11, 12(a)(2) and 15 of the Securities Act as a result of alleged misrepresentations or omissions in connection with offerings of senior notes by FE in February and June 2020. On March 30, 2023, the court granted plaintiffs’ motion for class certification. On April 14, 2023, FE filed a petition in the U.S. Court of Appeals for the Sixth Circuit seeking to appeal that order. On August 13, 2025, the Sixth Circuit vacated the S.D. Ohio’s order granting class certification. On October 14, 2025, the S.D. Ohio scheduled oral arguments for November 6, 2025, to further consider class certification in light of the Sixth Circuit’s decision. On October 17, 2025, plaintiffs filed a notice with the S.D. Ohio withdrawing their claims under Sections 10(b) and 20(a) of the Exchange Act pertaining to the FE senior notes. On July 29, 2024, FE filed in the U.S. Court of Appeals for the Sixth Circuit a Petition for Writ of Mandamus asking the Sixth Circuit to direct the S.D. Ohio to deny plaintiffs’ motion to compel disclosure of FE’s privileged internal investigation materials. On October 3, 2025, the Sixth Circuit granted FE’s Petition for Writ of Mandamus and vacated the S.D. Ohio’s order to produce privileged internal investigation materials. On October 9, 2025, plaintiffs filed a petition for rehearing of that decision. The Sixth Circuit directed FE to respond to plaintiffs’ petition by October 30, 2025. FE believes that it is probable that it will incur a loss in connection with the resolution of this lawsuit. Given the ongoing nature and complexity of such litigation, FE cannot yet reasonably estimate a loss or range of loss.\n•\nMFS Series Trust I, et al. v. FirstEnergy Corp., et al. and Brighthouse Funds II – MFS Value Portfolio, et al. v. FirstEnergy Corp., et al. \n(S.D. Ohio); on December 17, 2021 and February 21, 2022, purported stockholders of FE filed complaints against FE, certain current and former officers, and certain then-current and former officers of EH. The complaints allege that the defendants violated Sections 10(b) and 20(a) of the Exchange Act by issuing alleged misrepresentations or omissions regarding FE’s business and its results of operations, and seek the same relief as the In re FirstEnergy Corp. Securities Litigation described above. FE believes that it is probable that it will incur losses in connection with the resolution of these lawsuits. Given the ongoing nature and complexity of such litigation, FE cannot yet reasonably estimate a loss or range of loss.\nThe outcome of any of these lawsuits is uncertain and could have a material adverse effect on FE’s or its subsidiaries’ reputation, business, financial condition, results of operations, liquidity, and cash flows.\nOther Legal Matters\nThere are various lawsuits, claims (including claims for asbestos exposure) and proceedings related to the Registrants’ normal business operations pending against them or their subsidiaries. The loss or range of loss in these matters is not expected to be material to the Registrants. The other potentially material items not otherwise discussed above are described under Note 9, “Regulatory Matters” of the Combined Notes to Financial Statements of the Registrants.\nThe Registrants accrue legal liabilities only when it concludes that it is probable that it has an obligation for such costs and can reasonably estimate the amount of such costs. In cases where the Registrants determine that it is not probable, but reasonably possible that they have a material obligation, they disclose such obligations and the possible loss or range of loss if such estimate can be made. If it were ultimately determined that the Registrants have legal liability or are otherwise made subject to liability based on any of the matters referenced above, it could have a material adverse effect on the Registrants’ financial condition, results of operations, and cash flows.\n92\nNEW ACCOUNTING PRONOUNCEMENTS\nSee Note 1, \"Organization and Basis of Presentation,\" of the Combined Notes to Financial Statements of the Registrants for a discussion of new accounting pronouncements.\n93\nJERSEY CENTRAL POWER & LIGHT COMPANY\nMANAGEMENT’S NARRATIVE DISCUSSION AND \nANALYSIS OF RESULTS OF OPERATIONS\nJCP&L is a wholly owned subsidiary of FE. JCP&L conducts business in New Jersey by providing regulated electric transmission and distribution services in northern, western and east central New Jersey. JCP&L procures electric supply to serve its BGS customers through a statewide auction process approved by the NJBPU. JCP&L is subject to regulation by the NJBPU and FERC. \nJCP&L's reportable operating segments are comprised of the Distribution and Transmission segments. \nThe Distribution segment, representing $3.3 billion in rate base as of December 31, 2024, distributes electricity to approximately 1.2 million customers in New Jersey across its distribution footprint. The segment’s results reflect the costs of securing and delivering electric generation to customers, including the deferral and amortization of certain costs.\nThe Transmission segment includes transmission infrastructure owned and operated by JCP&L and used to transmit electricity, representing $1.4 billion in rate base as of December 31, 2024. The segment’s revenues are primarily derived from forward-looking formula rates, pursuant to which the revenue requirement is updated annually based on a projected rate base and projected costs, which is subject to an annual true-up based on actual rate base and costs. The segment’s results also reflect the net transmission expenses related to the delivery of electricity on JCP&L’s transmission facilities.\nFor additional information with respect to JCP&L, please see the information contained in FirstEnergy’s Management’s Discussion and Analysis of Financial Condition and Results of Operations under the following subheadings, which information is incorporated by reference herein: Executive Summary and Recent Developments, Regulatory Assets and Liabilities, Capital Resources and Liquidity, Guarantees and Other Assurances, Market Risk Information, Credit Risk, Outlook and New Accounting Pronouncements.\n94\nSummary of Results of Operations—\nThird Quarter 2025 Compared with Third Quarter 2024 \nFinancial results for JCP&L's business segments for the three months ended September 30, 2025 and 2024, respectively were as follows: \nThird Quarter 2025 Financial Results\nReconciling\n(In millions)\nDistribution\nTransmission\nAdjustments\nJCP&L\nRevenues\n$\n841 \n$\n67 \n$\n(44)\n$\n864 \nOperating Expenses:\nPurchased power\n451 \n— \n— \n451 \nOther operating expenses\n185 \n17 \n(44)\n158 \nProvision for depreciation\n53 \n13 \n— \n66 \nAmortization of regulatory assets, net\n11 \n— \n— \n11 \nGeneral taxes\n6 \n— \n— \n6 \nTotal operating expenses\n706 \n30 \n(44)\n692 \nOther Income (Expense):\nMiscellaneous income (expense), net\n14 \n(1)\n— \n13 \nInterest expense - other\n(25)\n(9)\n— \n(34)\nInterest expense - affiliates\n(3)\n— \n— \n(3)\nCapitalized financing costs\n4 \n8 \n— \n12 \nTotal other expense\n(10)\n(2)\n— \n(12)\nIncome taxes\n32 \n9 \n— \n41 \nNet Income\n$\n93 \n$\n26 \n$\n— \n$\n119 \nThird Quarter 2024 Financial Results\nReconciling\n(In millions)\nDistribution\nTransmission\nAdjustments\nJCP&L\nRevenues:\n$\n747 \n$\n57 \n$\n(39)\n$\n765 \nOperating Expenses:\nPurchased power\n384 \n— \n— \n384 \nOther operating expenses\n203 \n15 \n(39)\n179 \nProvision for depreciation\n50 \n12 \n— \n62 \nDeferral of regulatory assets, net\n(25)\n— \n— \n(25)\nGeneral taxes\n5 \n— \n— \n5 \nTotal operating expenses\n617 \n27 \n(39)\n605 \nOther Income (Expense):\nMiscellaneous income (expense), net\n12 \n(1)\n— \n11 \nInterest expense - other\n(17)\n(5)\n— \n(22)\nInterest expense - affiliates\n(5)\n— \n— \n(5)\nCapitalized financing costs\n1 \n5 \n— \n6 \nTotal other expense\n(9)\n(1)\n— \n(10)\nIncome taxes\n33 \n8 \n— \n41 \nNet Income\n$\n88 \n$\n21 \n$\n— \n$\n109 \n95\nChanges Between Third Quarter 2025 and Third Quarter 2024 Financial Results\nReconciling\n(In millions)\nDistribution\nTransmission\nAdjustments\nJCP&L\nRevenues\n$\n94 \n$\n10 \n$\n(5)\n$\n99 \nOperating Expenses:\nPurchased power\n67 \n— \n— \n67 \nOther operating expenses\n(18)\n2 \n(5)\n(21)\nProvision for depreciation\n3 \n1 \n— \n4 \nAmortization (deferral) of regulatory assets, net\n36 \n— \n— \n36 \nGeneral taxes\n1 \n— \n— \n1 \nTotal operating expenses\n89 \n3 \n(5)\n87 \nOPERATING INCOME\n5 \n7 \n— \n12 \nOther Income (Expense):\nMiscellaneous income (expense), net\n2 \n— \n— \n2 \nInterest expense - other\n(8)\n(4)\n— \n(12)\nInterest expense - affiliates\n2 \n— \n— \n2 \nCapitalized financing costs\n3 \n3 \n— \n6 \nTotal other expense\n(1)\n(1)\n— \n(2)\nIncome taxes\n(1)\n1 \n— \n— \nNet Income\n$\n5 \n$\n5 \n$\n— \n$\n10 \n96\nJCP&L’s Distribution - Results of Operations \nNet income increased $5 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to \nlower operating expenses and a lower effective tax rate, partially offset by lower customer usage and demand.\nRevenues\nThe $94 million increase in total revenues resulted from the following sources:\nFor the Three Months Ended September 30,\nRevenues by Type of Service\n2025\n2024\nIncrease / (Decrease)\n(In millions)\nDistribution services \n$\n365 \n$\n373 \n$\n(8)\nGeneration sales:\nRetail\n470 \n367 \n103 \nWholesale\n2 \n2 \n— \nTotal generation sales\n472 \n369 \n103 \nOther\n4 \n5 \n(1)\nTotal Revenues\n$\n841 \n$\n747 \n$\n94 \n \nDistribution services revenue decreased $8 million during the third quarter of 2025, as compared to the same period of 2024, primarily due to lower customer usage and demand.\nGeneration sales revenues increased $103 million during the third quarter of 2025, as compared to the same period of 2024, primarily due to higher non-shopping generation auction rates, partially offset by increased shopping, which decreased retail sales volumes. Total generation provided by alternative suppliers as a percentage of total MWh deliveries in the third quarter of 2025, as compared to the same period of 2024, increased to 37% from 35%. Retail generation sales have no material impact to earnings.\nOperating Expenses\nTotal operating expenses increased by $89 million primarily due to:\n \n•\nPurchased power costs, which have no material impact to earnings, increased by $67 million during the third quarter of 2025, as compared to the same period of 2024, primarily due to higher unit costs, partially offset by lower sales volumes. \n•\nOther operating expenses decreased $18 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to:\n•\nThe absence of a $9 million impairment charge related to the Akron general office in the third quarter of 2024; and\n•\nLower storm restoration expenses of $32 million, which were mostly deferred for future recovery.\nThe decrease was partially offset by:\n•\nHigher energy efficiency and other state mandated program costs of $11 million, which were deferred for future recovery, resulting in no material impact to earnings; and\n•\nHigher other operating expenses of $12 million, primarily due to higher employee benefit costs and higher material and contractor spend, partially offset by increased construction support and lower maintenance work.\n•\nDepreciation expense increased $3 million in the third quarter of 2025, as compared to the same period of 2024, \nprimarily due to a higher asset base.\n•\nDeferral of regulatory assets, net decreased $36 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to a $23 million decrease from lower deferral of storm restoration expenses, a $3 million decrease due to the absence of the amortization of a regulatory liability related to customer refunds in 2024, and a $13 million net \n97\ndecrease from lower generation and transmission related deferrals, partially offset by $3 million related to net increases in other deferrals. \n•\nGeneral taxes increased $1 million in the third quarter of 2025, as compared to the same period of 2024, primarily due to higher property taxes. \nOther Expenses\nTotal other expenses increased $\n1 million in the third quarter of 2025, as compared to the same period of 2024,\n \nprimarily due to long-term debt issuances since the third quarter of 2024, partially offset by higher capitalized interest and lower interest on short-term borrowings.\nIncome Taxes\nThe distribution segment's effective tax rate for the three months ended September 30, 2025 and 2024, was 25.6% and 27.3%, respectively. The decrease in the effective tax rate is primarily due to an increase in the tax benefit from AFUDC equity flow-through. \nJCP&L’s Transmission - Results of Operations\nNet income increase\nd $5 million\n in the \nthird quarter of 2025\n, as compared to the same period of \n2024\n, primarily due to higher revenues from regulated transmission investments that increased rate base and higher capitalized financing costs.\nRevenues\nTransmission revenue increased $10 million during the third quarter of 2025, as compared to the same period of 2024, primarily due to a higher rate base and the recovery of higher transmission operating expenses.\nOperating Expenses\nTotal operating expenses increased by $3 million during the third quarter of 2025, as compared to the same period of 2024, primarily due to higher operating and maintenance expenses and higher depreciation and property tax expenses from a higher asset base. Nearly all operating expenses are recovered through formula rates, resulting in no material impact on current period earnings.\nOther Expenses\nTotal other expenses increased by $1 million during the third quarter of 2025, as compared to the same period of 2024, primarily due to higher interest expenses on new long-term debt issuances, partially offset by higher capitalized financing costs.\nIncome Taxes\nThe transmission segment's effective tax rate for the three months ended September 30, 2025 and 2024, was 25.7% and 27.6%, respectively. The decrease in the effective tax rate is primarily due to an increase in the tax benefit from AFUDC equity flow-through.\n98\nSummary of Results of Operations — \nFirst\n \nNine Months of 2025 Compared with First Nine Months of 2024 \nFinancial results for JCP&L's business segments for the nine months ended September 30, 2025 and 2024, respectively, were as follows: \nFirst Nine Months 2025 Financial Results\nReconciling\n(In millions)\nDistribution\nTransmission\nAdjustments\nJCP&L\nRevenues\n$\n1,962 \n$\n191 \n$\n(131)\n$\n2,022 \nOperating Expenses:\nPurchased power\n1,052 \n— \n— \n1,052 \nOther operating expenses\n525 \n42 \n(131)\n436 \nProvision for depreciation\n159 \n37 \n— \n196 \nDeferral of regulatory assets, net\n(25)\n— \n— \n(25)\nGeneral taxes\n17 \n1 \n— \n18 \nTotal operating expenses\n1,728 \n80 \n(131)\n1,677 \nOther Income (Expense):\nMiscellaneous income (expense), net\n37 \n(1)\n— \n36 \nInterest expense - other\n(69)\n(24)\n— \n(93)\nInterest expense - affiliates\n(6)\n— \n— \n(6)\nCapitalized financing costs\n10 \n21 \n— \n31 \nTotal other expense\n(28)\n(4)\n— \n(32)\nIncome taxes\n54 \n25 \n— \n79 \nNet Income\n$\n152 \n$\n82 \n$\n— \n$\n234 \nFirst Nine Months 2024 Financial Results\nReconciling\n(In millions)\nDistribution\nTransmission\nAdjustments\nJCP&L\nRevenues:\n$\n1,728 \n$\n175 \n$\n(115)\n$\n1,788 \nOperating Expenses:\nPurchased power\n898 \n— \n— \n898 \nOther operating expenses\n593 \n46 \n(115)\n524 \nProvision for depreciation\n151 \n34 \n— \n185 \nDeferral of regulatory assets, net\n(98)\n— \n— \n(98)\nGeneral taxes\n15 \n1 \n— \n16 \nTotal operating expenses\n1,559 \n81 \n(115)\n1,525 \nOther Income (Expense):\nMiscellaneous income (expense), net\n33 \n(10)\n— \n23 \nInterest expense - other\n(57)\n(17)\n— \n(74)\nInterest expense - affiliates\n(15)\n— \n— \n(15)\nCapitalized financing costs\n5 \n14 \n— \n19 \nTotal other expense\n(34)\n(13)\n— \n(47)\nIncome taxes\n36 \n22 \n— \n58 \nNet Income\n$\n99 \n$\n59 \n$\n— \n$\n158 \n99\nChanges Between First Nine Months Ended 2025 and First Nine Months Ended 2024 Financial Results\nReconciling\n(In millions)\nDistribution\nTransmission\nAdjustments\nJCP&L\nRevenues\n$\n234 \n$\n16 \n$\n(16)\n$\n234 \nOperating Expenses:\nPurchased power\n154 \n— \n— \n154 \nOther operating expenses\n(68)\n(4)\n(16)\n(88)\nProvision for depreciation\n8 \n3 \n— \n11 \nDeferral of regulatory assets, net\n73 \n— \n— \n73 \nGeneral taxes\n2 \n— \n— \n2 \nTotal operating expenses\n169 \n(1)\n(16)\n152 \nOPERATING INCOME\n65 \n17 \n— \n82 \nOther Income (Expense):\nMiscellaneous income (expense), net\n4 \n9 \n— \n13 \nInterest expense - other\n(12)\n(7)\n— \n(19)\nInterest expense - affiliates\n9 \n— \n— \n9 \nCapitalized financing costs\n5 \n7 \n— \n12 \nTotal other expense\n6 \n9 \n— \n15 \nIncome taxes\n18 \n3 \n— \n21 \nNet Income\n$\n53 \n$\n23 \n$\n— \n$\n76 \n100\nJCP&L’s Distribution - Results of Operations\nNet income increased \n$53 million in the first nine months of 2025, as compared to the same period of 2024\n, \nprimarily due to higher revenues from the implementation of the base rate case in February 2024, the absence of a $53 million charge in connection with the base rate case settlement agreement, as further discussed below, higher customer usage and demand, and higher rider revenues associated with regulated investment programs.\nRevenues\nThe $234 million increase in total revenues resulted from the following sources:\nFor the Nine Months Ended September 30, \nRevenues by Type of Service\n2025\n2024\nIncrease / (Decrease)\n(In millions)\nDistribution services \n$\n900 \n$\n856 \n$\n44 \nGeneration sales:\nRetail\n1,046 \n852 \n194 \nWholesale\n3 \n4 \n(1)\nTotal generation sales\n1,049 \n856 \n193 \nOther\n13 \n16 \n(3)\nTotal Revenues\n$\n1,962 \n$\n1,728 \n$\n234 \n \nDistribution services revenue increased $44 million during the first nine months of 2025, as compared to the same period of 2024, primarily due to higher revenues from the implementation of the base rate case in February 2024, higher customer usage and demand, and higher rider revenues associated with certain regulated investment programs.\nGeneration sales revenues increased $193 million during the first nine months of 2025, as compared to the same period of 2024, primarily due to higher non-shopping generation auction rates, partially offset by increased shopping, which decreased sales volumes. Total generation provided by alternative suppliers as a percentage of total MWh deliveries in the first nine months of 2025, as compared to the same period of 2024, increased to 38% from 37%. Retail generation sales have no material impact to earnings.\nOperating Expenses\nTotal operating expenses increased by $169 million primarily due to:\n \n•\nPurchased power costs, which have no material impact to earnings, increased by $154 million during the first nine months of 2025, as compared to the same period of 2024, primarily due to higher unit costs. \n•\nOther operating expenses decreased $68 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to:\n•\nThe absence of a $53 million pre-tax charge at JCP&L in the first quarter 2024 associated with certain corporate support costs recorded to capital accounts from the FERC Audit that were determined, as a result of the base rate case settlement agreement, to be disallowed from future recovery; \n•\nThe absence of a $9 million impairment charge related to the Akron general office in the third quarter of 2024; and\n▪\nLower storm restoration expenses of $56 million, which were mostly deferred for future recovery.\nThe decrease was partially offset by:\n•\nHigher uncollectible expenses of $4 million, which were deferred for future recovery;\n•\nHigher energy efficiency and other state mandated program costs of $29 million, which were deferred for future recovery, resulting in no material impact to earnings; and\n•\nHigher other operating expenses of $17 million, primarily due to severance and related costs associated with FirstEnergy’s organizational changes announced in the first quarter of 2025, higher employee benefit costs, and higher material and contractor spend, partially offset by increased construction support and lower maintenance work.\n101\n•\nDepreciation expense increased $8 million in the first nine months of 2025, as compared to the same period of 2024, \nprimarily due to a higher asset base.\n•\nDeferral of regulatory assets, net decreased $73 million in the first nine months of 2025, as compared to the same period of 2024, primarily due to a $51 million decrease from lower deferral of storm restoration expenses, a $19 million decrease due to the absence of the amortization of a regulatory liability related to customer refunds in 2024, and a $11 million net decrease from lower generation and transmission related deferrals, partially offset by $12 million related to net increases in other deferrals. \nOther Expenses\nTotal other expenses decreased \n$6 million in the first nine months of 2025, as compared to the same period of 2024,\n \nprimarily due to lower interest on short-term borrowings and higher capitalized interest, partially offset by long-term debt issuances since the third quarter of 2024.\nIncome Taxes\nThe distribution segment's effective tax rate for the nine months ended September 30, 2025 and 2024, was 26.2% and 26.7%, respectively.\nJCP&L’s Transmission - Results of Operations\nNet income increase\nd $23 million\n in the \nfirst nine months of 2025, as compared to the same period of 2024\n, primarily due to higher revenues from regulated transmission investments that increased rate base, higher capitalized financing costs and the absence of a non-recoverable charge related to an abandoned transmission project in the second quarter 2024.\nRevenues\nTransmission revenue increased $16 million during the first nine months of 2025, as compared to the same period of 2024, primarily due to \nhigher revenues from regulated transmission investments that increased rate base\n, partially offset by recovery of lower transmission operating expenses.\nOperating Expenses\nTotal operating expenses decreased by $1 million during the first nine months of 2025, as compared to the same period of 2024, primarily due to lower operating and maintenance expenses, partially offset by higher depreciation and property tax expenses from a higher asset base. Nearly all operating expenses are recovered through formula rates, resulting in no material impact on current period earnings.\nOther Expenses\nTotal other expenses decreased by $9 million during the first nine months of 2025, as compared to the same period of 2024, primarily due to the absence of a non-recoverable charge related to an abandoned transmission project in the second quarter 2024 and higher capitalized financing costs, partially offset by higher interest expenses on new long-term debt issuances.\nIncome Taxes\nThe transmission segment's effective tax rate for the nine months ended September 30, 2025 and 2024, was 23.4% and 27.2%, respectively. The decrease in the effective tax rate is primarily due to an increase in the tax benefit from AFUDC equity flow-through.\n102"
}