{
  "item1": "F5 NGINX Plus software delivers cloud-native, Kubernetes-friendly solutions drive mission-critical applications APIs scalability, visibility, security, governance F5 NGINX Plus can easily integrated into enterprise application workflows CI/CD pipelines, well automation frameworks ecosystems. F5 NGINX Plus lightweight can used per-application ADC, but also scalable performant enough enterprise’s largest most critical applications. F5 NGINX Plus also offered fully managed native service Microsoft Azure Cloud allowing teams lift-and-shift applications cloud no configuration change removing operational burden self-managed instances teams. F5 NGINX One Console.",
  "item7": "Management’s Discussion Analysis Financial Condition Results Operations F5 global leader application delivery security solutions which enables its customers deploy, operate, secure, optimize, govern every application API across on-premises architectures, cloud, network edge. cloud, software, hardware solutions enable customers deliver fast, available, secure digital experiences customers scale. application services available hardware, software, SaaS, software-only solutions optimized hybrid, multicloud environments, modules can run independently, part integrated solution high-performance appliances. market sell products primarily through multiple indirect sales channels Americas; Europe, Middle East, Africa (\"EMEA\"); Asia Pacific (\"APAC\") regions.",
  "item2": "Management's Discussion Analysis Financial Condition Results Operations F5 global leader application delivery security solutions which enables its customers deploy, operate, secure, optimize, govern every application API across any architecture - on-premises, cloud, edge. cloud, software, hardware solutions enable customers deliver fast, available, secure digital experiences customers scale. enterprise-grade application services available hardware, software, software-as-a-service, software-only solutions optimized hybrid, multicloud environments, modules can run independently, part integrated solution high-performance appliances. market sell products primarily through multiple indirect sales channels Americas; Europe, Middle East, Africa (EMEA); Asia Pacific region (APAC)."
}