{
  "source_file": "ffiv-20250930.htm",
  "form_type": "10-K",
  "item1": "Item 1.\nBusiness\nGeneral\nF5 is a multicloud application delivery and security provider committed to bringing a better digital world to life. F5 partners with the world’s largest, most advanced organizations to optimize and secure every application and Application Programming Interface (\"API\") anywhere, including on-premises, in the cloud, and at the network edge. F5 enables businesses to continuously stay ahead of threats while delivering exceptional, secure digital experiences for their customers.\nOur application delivery and security solutions are available in a range of deployment and consumption models. We sell packaged software in perpetual, subscription, and usage-based consumption models. We also sell our solutions in software-as-a-service (\"SaaS\") and managed services deployment models with subscription and usage-based consumption models. In addition, we sell high-performance systems, or hardware, as well as a broad range of global services including maintenance, consulting, training and other technical support services.\nOur customers include large enterprise businesses, public sector institutions, governments, and service providers. We conduct our business globally and manage our business by geography. Our business is organized into three primary geographic regions: Americas; Europe, the Middle East, and Africa (\"EMEA\"); and the Asia Pacific region (\"APAC\"). \nF5 was incorporated in 1996 and is headquartered in Seattle, Washington. Our website is www.f5.com and through a link on the Investor Relations section of our website, we make available the following filings as soon as reasonably possible after they are electronically filed with or furnished to the Securities and Exchange Commission (\"SEC\"): our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act. All such filings are available free of charge. The information posted on our website is not incorporated into this report.\nCyber Incident\nOn October 15, 2025, we disclosed a security incident in which a threat actor maintained long-term, persistent access to F5 systems, and exfiltrated certain files, referred to as the \"Cyber Incident.\" For further information about the Cyber Incident, see \"Risk Factors\" included in Item 1A of Part I of this Annual Report on Form 10-K, and \"Management’s Discussion and Analysis of Financial Condition and Results of Operations - Cyber Incident\" included in Item 7 of Part II of this Annual Report on Form 10-K. \n3\nTable of Contents\nStrategy and Priorities\nWe deliver a broad portfolio of solutions to help customers address the complexity and risk in today’s hybrid multicloud IT environments. We are able to deliver on this strategy through our solutions portfolio, specifically our F5 BIG-IP, F5 NGINX, and F5 Distributed Cloud Services product families, which deliver a range of integrated, application and delivery services leveraging artificial intelligence and machine learning capabilities that support application performance and protect legacy, modern, and AI-powered applications and APIs across the data center, public clouds, and edge locations.\nKey components of our strategy include:\nSolving multicloud application delivery and security challenges \nOur F5 BIG-IP family delivers essential application delivery and security services, ensuring applications operate efficiently and securely. It is optimized for traditional applications whether deployed on premises, in co-located data centers, or in cloud environments. Our F5 NGINX family also delivers essential application delivery and security services but is optimized for modern, container-native and microservices-based applications and APIs. Our F5 Distributed Cloud Services is a portfolio of SaaS and managed services designed for both traditional and modern applications where a SaaS deployment model is preferred. With our comprehensive portfolio, we are the only provider capable of supporting customers’ modern and legacy application delivery and security needs across any environment — on premises, co-located, in a cloud or at the edge. \nTransforming how customers experience F5\nWe continue to leverage and grow our foundational capabilities in data and insights, digital sales, and SaaS-delivered capabilities to deliver consistent world-class customer experiences, including simple, integrated and friction-free consumption of our solutions. We will continue to improve customer awareness and understanding of F5’s portfolio with a focus on both user and buying personas, and business needs. We intend to enhance our digital customer experiences to deliver both growth and efficiency.\nF5 is leveraging AI to accelerate the strength of both our current and future offerings. F5 uses AI in its application delivery and security solutions to support performance and efficacy. Today, our customers are able to further benefit from our four-pronged AI strategy. First, our current portfolio is solving security and performance challenges associated with AI model training and inference and in support of AI-driven workloads. We are selling F5 solutions in support of AI data delivery, AI runtime security and AI factory load balancing use cases. Second, we are leveraging AI models in our current data fabric in order to enhance our existing products. Third, we are innovating to create new offerings based on the rapidly evolving application and data security landscapes and the customer needs associated with these changes. Finally, we are pursuing partnerships with global leaders in AI to help deliver and secure AI workloads.\nIn response to customers' growing preference for a platform approach, in 2025 we introduced the F5 Application Delivery and Security Platform (\"ADSP\"). The F5 ADSP aims to unify high-performance traffic management with advanced application and API security at scale across hybrid and multicloud environments. Unlike fragmented point solutions, the F5 ADSP is purpose-built to simplify hybrid multicloud complexity. With the F5 ADSP, we aim to leverage the full strength of our broad portfolio with capabilities to enhance security, scalability, and operational efficiency while enabling key capabilities such as policy management, analytics, and automation.\nCapturing growth in security and SaaS\nWe continue to invest in expanding our SaaS-based F5 Distributed Cloud Services. Our F5 Distributed Cloud Services console extends visibility and simplifies management for F5 BIG-IP and F5 NGINX customers. With F5 Distributed Cloud Services, we enable customers to optimize application deployment across public, private, and edge clouds, providing flexibility in location and architecture while reducing the operational complexity of delivering and securing applications.\nF5 Products and Solutions\nF5’s portfolio of multicloud application delivery and security technologies enables customers to address the challenges of delivering differentiated digital experiences while safeguarding their applications across complex hybrid and multicloud environments. Our infrastructure-agnostic approach ensures customers can create a unified and optimized experience across diverse IT environments. We sell application delivery and security solutions for web application and API protection, hybrid multicloud networking, enterprise AI delivery and security, application migration, application modernization, zero trust architecture and post quantum cryptography readiness. Our product portfolio includes solutions across the following product families: F5 Distributed Cloud Services, F5 NGINX, F5 BIG-IP.\n4\nTable of Contents\nF5 Distributed Cloud Services. \nA unified, security, networking, and application management service that enables customers to deploy, secure, and operate their applications wherever they may reside, regardless of platform or architecture. F5 Distributed Cloud Services leverages the F5 Global Network, a purpose-built, cloud-based, global private backbone to deliver performance, reliability, and control across hybrid, multicloud, or edge environments. F5 Distributed Cloud Service offerings are available as packaged software and SaaS-based consumption models and include the following:\n•\nF5 Distributed Cloud Web App and API Protection (\"WAAP\").\n A comprehensive SaaS-based security solution, F5 Distributed Cloud WAAP allows our customers to accelerate time-to-service, lower total cost of ownership, and increase security efficacy on a cloud native platform that is fully integrated across a single policy engine and management console. F5 Distributed Cloud WAAP can be leveraged through multiple deployment options, allowing organizations to simplify security and improve visibility while reducing operational complexity. The solution provides the following F5 application security technologies:\n•\nAdvanced Web Application Firewall (\"WAF\") capabilities through the F5 WAF engine available on BIG-IP and NGINX, allows our customers to quickly apply, secure, and manage uniform comprehensive security policies at scale, across data centers, public or private clouds, and edge computing environments. \n•\nMitigation against OSI Model Layer 3-Layer 7 application-based and volumetric DDoS attacks through advanced F5 Distributed Cloud DDoS Mitigation, a managed, cloud-delivered mitigation service that detects and mitigates large-scale network, SSL, and application-targeted attacks in real time. \n•\nEnhanced API security, which leverages machine-based learning, auto-discovery, and anomaly detection, which automates the entire process of finding, securing, and monitoring APIs for anomalous behavior.\n•\nNext-generation, AI enabled bot mitigation through F5 Distributed Cloud Bot Defense provides our customers the ability to defend applications and APIs from automated attacks. The solution leverages AI to analyze massive amounts of traffic and machine learning to ensure sustainable bot prediction models with high efficacy.\n•\nProtection from sophisticated account takeover attempts.\n•\nF5 Distributed Cloud Multi-Cloud Networking (\"MCN\"). \nOur MCN solutions simplifies networking with an integrated service stack that securely connects both networks and application workloads, lowering operational costs and increasing agility. Under our MCN solutions we offer the following product solution:\n•\nF5 Distributed Cloud Network Connect.\n A networking solution that offers easy, secure, and consolidated connectivity across public and hybrid clouds, data centers, and edge sites. It provides unified policies and single-pane-of-glass management, reducing complexity and increasing efficiency, including full multi-tenancy and segmentation, enabling self-service capabilities for DevOps, NetOps and SecOps. Network Connect automates the configuration of native public cloud networking resources and seamlessly connects multiple clouds using site-to-site connectivity over a private backbone or the F5 Global Network. \n•\nF5 Distributed Cloud App Connect. \nAn application delivery and deployment solution for application-level connectivity across various cloud providers and regions. App Connect offers orchestrated awareness for API endpoints on all connected clusters, allowing cross-cluster service discovery and advertisement for seamless app-to-app communication with fine-grained API control. Connections between sites are self-maintaining, redundant, and fully automated, which reduces the need for administrative tasks such as establishing VPNs and routing. App Connect provides end-to-end visibility for customers, who can choose their underlying transport, including the F5 Global Network. \n•\nF5 Distributed Cloud DNS. \nA cloud-based Domain Name System (\"DNS\") solution that offers DNS delivery across multicloud environments and modern applications. F5 Distributed Cloud DNS can be distributed globally as either a primary or secondary DNS, providing authoritative DDoS protection, Domain Name System Security Extensions (\"DNSSEC\"), and the flexibility to automatically scale to meet our customers growing application demands. \n•\nF5 Distributed Cloud CDN. \nA high-performance, multicloud and edge focused content delivery network (\"CDN\") solution that allows our customers to efficiently connect, secure, and optimize applications and workloads across multi- and hybrid-cloud environments through efficiently leveraging the integrated tools and technologies in the F5 Distributed Cloud Platform. F5 Distributed Cloud CDN can be purchased with other F5 Distributed Cloud offerings or as a stand-alone service. \n•\nF5 Distributed Cloud App Stack. \nA SaaS-based solution that provides our customers the ability to deploy and orchestrate applications on a managed Kubernetes platform with centralized management of distributed applications through a single pane of glass. F5 Distributed Cloud App Stack simplifies the management of application deployments as one across on-premises, cloud, and edge locations. \nF5 NGINX. \nBuilt from the F5 NGINX open-source software that powers hundreds of millions of websites and applications across the world, our F5 NGINX technology suite delivers a lightweight, agile ADC and API connectivity solution \n5\nTable of Contents\nfor modern, container-native, micro-services-based applications and APIs. F5 NGINX delivers a range of capabilities including web server, load balancer, proxy, API gateways and caches in packaged software subscription consumption models. F5 NGINX product offerings include the following:\n•\nF5 NGINX Plus. \nF5 NGINX Plus, our all-in-one, high performance load balancer, web server, content cache, and API gateway for modern applications, is offered as packaged software in a subscription consumption model.\n \nF5 NGINX Plus software delivers cloud-native, Kubernetes-friendly solutions that drive mission-critical applications and APIs with scalability, visibility, security, and governance\n.\n F5 NGINX Plus can be easily integrated into enterprise application workflows and CI/CD pipelines, as well as automation frameworks and ecosystems. F5 NGINX Plus is lightweight and can be used as a per-application ADC, but also scalable and performant enough for an enterprise’s largest and most critical applications. F5 NGINX Plus is also offered as a fully managed native service on the Microsoft Azure Cloud allowing teams to lift-and-shift their applications to the cloud with no configuration change removing the operational burden of self-managed instances from teams. \n•\nF5 NGINX One Console. \nThe F5 NGINX One Console is a unified SaaS management platform designed to streamline the deployment, configuration, monitoring, and administration of NGINX instances across hybrid and multi-cloud environments. Tailored for organizations leveraging NGINX for modern application delivery, the NGINX One Console provides centralized visibility and real-time analytics to optimize application performance, ensure security, and monitor traffic flows. Its intuitive interface simplifies the management of NGINX instances and supports automated workflows, integration with DevOps pipelines, and role-based access controls (\"RBAC\"). By empowering teams to manage containerized and microservices-based applications efficiently, the NGINX One Console enables enterprises to deliver reliable, scalable, and secure applications in increasingly distributed environments.\n•\nF5 NGINX Ingress Controller. \nThe F5 NGINX Ingress Controller provides traffic management for Kubernetes clusters. This solution is deployed at the central point of entry into a Kubernetes cluster and reduces complexity, increases uptime, and provides better insights into application health and performance at scale. This offering is sold in a subscription consumption model that scales with the customer’s Kubernetes cluster size.\n•\nF5 WAF for NGINX. \n F5 WAF for NGINX is a comprehensive WAF security and denial-of-service (\"DoS\") defense solution designed to protect applications and API’s from advanced Layer 7 attacks. It is a lightweight solution that seamlessly integrates into DevOps environments and is platform-agnostic running across distributed architectures and hybrid environments to deliver consistent protection. It can be used in a variety of the use cases where F5 NGINX Plus is deployed and integrate easily into CI/CD pipelines for automation. F5 WAF for NGINX can be added to subscriptions and is bundled into \"advanced\" offerings for F5 NGINX Ingress Controller.\nF5 BIG-IP. \nOur F5 BIG-IP family of product offerings provide feature-rich, highly programmable and configurable application delivery and security solutions for legacy applications in enterprises and service providers. Also known as traditional applications, legacy applications are based on monolithic, three-tier, or client-server architectures. Such legacy applications are the most ubiquitous application architecture today, and many organizations continue to rely exclusively on legacy applications to power the most mission-critical business applications, customer-facing digital interfaces and internally used applications. For most organizations, the priority around legacy applications is maximizing operational efficiency and minimizing the total cost of ownership. F5 BIG-IP's \"best-of-suite\" approach helps standardize and consolidate application delivery and security functions into a single solution, automating functions and reducing operational cost. The F5 BIG-IP family of products includes packaged software, which are available in subscription and perpetual consumption models, and F5 BIG-IP system offerings. \n•\nF5 BIG-IP Packaged Software.\n F5 BIG-IP packaged software includes a growing portfolio of products that provide the performance and security to deliver applications to end users. F5 BIG-IP Packaged Software offerings include the following:\n•\nF5 BIG-IP Security.\n F5 BIG-IP application security products include F5 BIG-IP Access Policy Manager that secures and protects user access to applications, F5 BIG-IP Advanced Web Application Firewall that protects applications with behavioral analytics, bot defense and application layer encryption, and F5 BIG-IP SSL Orchestrator that maximizes infrastructure security with encryption/decryption and traffic steering. We also offer F5 BIG-IP Advanced Firewall Manager which drives accurate detection with machine learning, stress monitoring, dynamic signatures, and attack mitigation, F5 BIG-IP Carrier Grade NAT which provides carrier-grade scalability with a high number of IP address translations, fast network address translation setup rates and high-speed logging, and F5 BIG-IP DDoS Hybrid Defender which delivers advanced cloud and on-premises DDoS defenses to ensure real-time protection against volumetric DDoS threats and dynamic network and applications attacks. \n•\nF5 BIG-IP Application Delivery.\n F5 BIG-IP Application Delivery products include F5 BIG-IP Local Traffic Manager which manages network traffic ensuring applications are always fast, available, and secure; F5 BIG-IP DNS which provides hyperscale and security during high query volumes and DNS DDoS attacks;  F5 BIG-IP Policy Enforcement Manager which improves network performance through effective policy management; and F5 \n6\nTable of Contents\nBIG-IP Next for Kubernetes which supports ingress and egress traffic management for integration to multiple networks.\n•\nF5 BIG-IP Automation Tool Chain. \nF5 BIG-IP Automation Tool Chain is a set of automation tools that make it faster and easier to deploy and configure F5 application services. Via the F5 Automation Tool Chain, F5 BIG-IP capabilities easily integrate into orchestration frameworks such as Ansible, HashiCorp Terraform, OpenShift, and Cloud Foundry as part of a CI/CD pipeline.\n•\nF5 BIG-IQ Centralized Management.\n F5 BIG-IQ simplifies, enhances management of, and reduces customer operational costs associated with F5 BIG-IP deployments through central management, analytics, and automation for F5 BIG-IP instances.\n•\nF5 BIG-IP Systems.\n F5 BIG-IP systems are designed to enhance the performance of our software by leveraging a combination of custom field-programmable gate array (\"FPGA\") logic and off-the-shelf silicon, providing customers a balance of cost and flexibility. All of our systems run all available F5 BIG-IP software modules. Our next-generation hardware, rSeries systems and VELOS chassis and blades are designed to enable enhanced automation and multi-tenancy, a capability that enables running multiple versions of F5 BIG-IP software on the same system thereby making it easy to migrate from one version to another with minimal or no downtime. \nCompetition\nAs F5 expands its reach and role into a broader set of hybrid multicloud application delivery and security solutions, our competitive set evolves and includes vendors with capabilities associated with application delivery, application security, and multicloud networking.\nThe principal competitive factors in the markets in which we compete include deployment model, consumption model, ecosystem integrations, features and performance, customer support, brand recognition, scope of distribution and sales channels, and pricing. We believe we generally compete favorably on the basis of these factors because of our robust solutions and services, our ability to deliver and secure any application, and any API, anywhere, and our platform approach. \nTo provide a unified experience across all our offerings, we have introduced the F5 ADSP. With the F5 ADSP, customers can leverage the full strength of our broad portfolio with capabilities to enhance security, scalability, and operational efficiency while enabling key capabilities such as policy management, analytics, and automation.\nWhile customers broadly are expressing increasing preference for a platform approach that simplifies complexity and eliminates operational burden, we also compete on a point-solution basis. Within application delivery, our customers have the best of both worlds: reliability that F5’s always been known for – across any environment from on-premises to multicloud; and agility and flexibility enabled by lightweight modern technologies, without compromising security or manageability. Our F5 BIG-IP offerings compete against Citrix and Broadcom. Our lightweight, agile, developer-friendly F5 NGINX offerings, which provide capabilities like optimizing Kubernetes traffic management and load balancing cloud-native and hybrid cloud applications compete against Amazon Web Services (\"AWS\"), Google Cloud Platform, Envoy, and HAProxy.\nIn application security, we compete with vendors that offer web application firewall, bot detection and mitigation, API protection, carrier-grade firewall, carrier-grade network address translation (\"NAT\"), SSL orchestration, access policy management, and DDoS mitigation including Akamai, Cisco, Cloudflare, Fortinet, Juniper Networks, Palo Alto, Radware, and Thales (Imperva).\nF5 Distributed Cloud Services use cases include application and API security delivered as SaaS, as well as multicloud networking. F5 competes with traditional edge players including Akamai, Cloudflare and Fastly, as well as networking vendors including Broadcom and Cisco, and pure-play vendors like Aviatrix, and public cloud providers. \nManufacturing\nWe outsource the manufacturing of our products to various manufacturing partners, including our primary third-party manufacturer service provider, Flex Ltd. (\"Flex\"), to manufacture our hardware systems according to our specifications. Assembly, quality control and systems testing are carried out at Flex's facilities in Guadalajara, Mexico and Zhuhai, China. Additionally, Flex manages material procurement and fulfillment activities on our behalf, ensuring we maintain high standards of efficiency and scalability across our operations. Systems built in Guadalajara are shipped to the Flex fulfillment center in Memphis, Tennessee for distribution primarily to distributors, value-added resellers, or end-users in the Americas and EMEA. Systems built and fulfilled in Zhuhai are distributed to partners and customers in APAC. Title to the products transfers from Flex to us and then to our customers upon shipment from a designated fulfillment location.\n7\nTable of Contents\nOur sales and operations planning cadence provides Flex and other partners with a rolling demand forecast. This approach enables our manufacturing partners to plan for the appropriate stock levels of raw materials and manufacturing line capacity, resulting in the right finished goods inventories to meet our end-user demand. The components for our hardware products consist of commodity parts and custom components. The component parts within our products are either sourced by our manufacturing partners or by us from various component suppliers. F5 has established a robust and resilient global hardware supply chain. We continuously monitor areas of potential impact within our supply chain, such as geopolitical, supplier, and other risk factors, as well as proactively take steps to minimize disruptions, including securing alternate supply when applicable.\nAcquisitions\nWe evaluate opportunities to acquire complementary businesses, technologies, services, and intellectual property to complement our organic innovation and research and development efforts, advance the development of our platforms, and enable further investment in our key priority areas. Our evaluation of acquisition opportunities seeks to confirm that any potential transaction would accelerate our strategy, represent an attractive customer opportunity, address a customer need, align with our customer base and go-to-market strategy, and present a clear timeline and path for value accretion. Our acquisitions enable us to gain access to talent, technology, products and features, and can range in size and complexity, from those that enhance or complement existing products and accelerate development of features to those that result in new offerings.\nIn September 2025, we completed the acquisition of CalypsoAI Corp. (\"CalypsoAI\") which is expected to integrate into our F5 ADSP to create a complete solution for securing AI inference. Additionally, we also completed several other immaterial acquisitions in 2025 and in prior years to enhance various aspects of our platform. \nBacklog\nBacklog is primarily systems-based and represents orders confirmed with a purchase order for products to be fulfilled and invoiced to customers with approved credit status. Orders are subject to cancellation, rescheduling by customers, or product specification changes by customers. Although we believe that the backlog orders are firm, purchase orders may be canceled by the customer prior to fulfillment without significant penalty. For this reason, we believe that our product backlog at any given date is not a reliable indicator of future revenues.\nHuman Capital Management\nF5’s commitment to its employees is to be a human-first and high-performing team equipped with the tools and expertise to deliver extraordinary impact on what matters most to F5, our customers, and our partners. This commitment is delivered through our culture and engagement, our investment in employees’ growth and development, our focus on diversity and inclusion, and our compensation, benefits, and wellbeing offerings.\nAs of September 30, 2025, we had 6,578 employees – over 99% of whom were full-time employees. Our employees are based in 47 countries with 47% of employees based in the United States. None of our employees in the United States are represented by a labor union. We have experienced no work stoppages and believe that our employee relations are in good standing, as evidenced by our annual employee engagement survey results, described in the section below entitled \"Culture and Engagement.\"\nCulture and Engagement\nWe have been able to sustain our strong company culture because BeF5 and LeadF5 behaviors are key to executing our strategy. \n8\nTable of Contents\n \nWe measure the success of and identify areas of improvement for our company culture through global surveys of employee experience and sentiment at least once each year. As of March 2025, employees reported high satisfaction with F5’s culture on several key questions:\n•\n85% of employees favorably rate \"I am proud to work for F5.\"\n•\n90% of employees favorably rate \"I trust my manager.\"\n•\n91% of employees favorably rate \"F5 shows a commitment to ethical business decisions and conduct.\" \nOne survey measure that F5 tracks closely as a gauge of our culture increased from fiscal year 2024. As of March 2025, 80% of employees favorably rate \"I feel a sense of belonging at F5.\" This increase in Belonging, compared to 73% a year prior, is critical to F5's efforts to foster the culture that is so important to our employees' and our company's performance.\nGrowth and Development\nWe provide employees with opportunities to improve their technical and professional knowledge, nurture our innovation ecosystem, strengthen management and leadership, as well as maintain our high standards of business integrity through ongoing compliance training. These development opportunities are available through both live employee events and third-party on-demand tools and are led by a mix of individual and AI coaches. In fiscal year 2025, F5 invested in tailored coaching and skills-building for its people managers to help continuously raise the bar on performance at F5.\nDiversity and Inclusion\nF5 is steadfast in its commitment to create a diverse and inclusive workplace. We believe our differences—when embraced with humility and respect—drive smarter decisions, increased innovation, stronger performance, and a culture where everyone can be themselves and reach their full potential.  \nThe most critical drivers of our diversity and inclusion efforts year after year are represented in our seven Employee Inclusion Groups (\"EIGs\") – F5 Ability, F5 Asian and Pacific Islanders, F5 Appreciates Blackness, F5 Connects Women, F5 Latinx e Hispanos Unidos, F5 Military Veterans, and F5 Pride. Since our first EIG was established in 2013, these global communities represent a space for all F5ers to collaborate, share experiences, and learn.\nCompensation, Benefits and Wellbeing\nF5 aims to attract, reward, and retain extraordinary talent from diverse backgrounds by offering a total compensation package that is equitable, flexible, and market competitive.\nThis includes the pay, incentive plans, restricted stock unit grants (\"RSUs\"), Employee Stock Purchase Plan, retirement plans, healthcare, paid time off and family leave F5 provides to employees, as well as the programs that support the diverse needs of our employees’ overall health and wellbeing. In fiscal year 2025, F5 also renewed our popular Wellness Weekends to provide one weekend a quarter when all employees have a set Friday through Monday off to reset and refresh. \nEnvironmental, Social and Governance\nF5's Environmental, Social and Governance (\"ESG\") programs are guided by our fundamental principle to \"do the right thing\" for each other, our customers, our shareholders, and our communities. \nEnvironmental.\n F5's 2030 climate target, verified by the Science Based Target Initiative, is to reduce both absolute Scope 1 and 2 emissions by 50% and absolute Scope 3 emissions by 43% from a 2021 baseline. We plan to meet this climate target by \n9\nTable of Contents\noptimizing our energy use, sourcing more renewable energy, and enhancing the sustainability of our products and supply chain processes.\nAs evidence of our progress towards our climate target, F5’s most recent annual ESG report in March 2025 disclosed a reduction in our total emissions from fiscal year 2023 to fiscal year 2024. This was driven by a 16% year-over-year reduction in Scope 1 and 2 emissions and a 10% year-over-year reduction in Scope 3 emissions. To ensure the integrity of our emissions reporting, F5 also secured third-party verification for our Scope 1 and 2 emissions data from fiscal year 2024. The auditor’s verification letter is available on page 19 of F5’s 2024 ESG report at f5.com under the ‘‘Company — Investor Relations — ESG’’ section.\nSocial.\n In addition to the employee programs and benefits outlined in the Human Capital Management section above, we continue to prioritize F5 Global Good, the community development initiative that amplifies our employee engagement and diversity and inclusion programs. We are proud that employees direct the entirety of Global Good’s donations, through both the Company matching program and grant selection committees. In fiscal year 2025, 72% of all employees worldwide participated in Global Good programs, volunteering over 13,400 hours and directing the entirety of F5’s donations, through both the Company matching program and grant selection committees. F5 and our employees donated over $3.9 million to more than 3,900 non-profits worldwide in fiscal year 2025. \nGovernance.\n In fiscal year 2025, F5 completed its second Double Materiality Assessment, to help identify and assess the most significant ESG issues impacting both our financial performance and our broader societal and environmental impact. Aligned with the definitions and required value chain scope set by the EU's Corporate Sustainability Reporting Directive (\"CSRD\"), this bi-annual assessment reflected shifts in our stakeholders’ views, as well as changes in the geopolitical and macro-economic environment over the last two years. The Double Materiality Assessment is available on page 7 of F5’s 2024 ESG report at f5.com under the \"Company — Investor Relations — ESG\" section.\nExecutive Officers of the Registrant\nThe following table sets forth certain information with respect to our executive officers as of November 25, 2025:\nName\nAge\nPosition\nFrançois Locoh-Donou\n54\nPresident, Chief Executive Officer and Director\nEdward Werner\n51\nExecutive Vice President and Chief Financial Officer\nTom Fountain\n49\nExecutive Vice President and Chief Operating Officer\nChad Whalen\n54\nExecutive Vice President and Chief Revenue Officer\nLyra Schramm\n51\nExecutive Vice President and Chief People Officer\nKunal Anand \n42\nExecutive Vice President and Chief Innovation Officer \nJohn Maddison\n62\nExecutive Vice President and Chief Product Marketing and Technology Alliances Officer\nAngelique Okeke\n50\nExecutive Vice President and General Counsel\nMichael Montoya\n54\nExecutive Vice President and Chief Technology Operations Officer\nFrançois Locoh-Donou\n has served as our President, Chief Executive Officer and member of our Board of Directors since April 2017. Prior to joining F5, Mr. Locoh-Donou served as Senior Vice President and Chief Operating Officer of Ciena Corporation. During his more than 15 years at Ciena, Mr. Locoh-Donou served in several leadership positions. From August 2011 to October 2015, he served as Ciena’s Senior Vice President, Global Products Group. Previously, he served as Ciena’s Vice President and General Manager, Europe, Middle East and Africa from June 2005 to August 2011. He holds an M.B.A. from Stanford University, a 'Mastere' in Optical Telecommunications from the National Institute of Telecommunications of Paris, and a 'Diplome d'Ingenieur' in Physics Engineering from the National Institute of Physics in Marseille, France. Mr. Locoh-Donou serves on the board of Capital One Financial Corporation. He is also the co-founder of Cajou Espoir, a cashew-processing facility that employs several hundred people in rural Togo, 80 percent of whom are women. Cajou Espoir exports more than 400 tons of cashew kernels annually to the U.S. and Europe.\n10\nTable of Contents\nEdward Werner\n has served as our Chief Financial Officer since November 2024. Mr. Werner joined F5 in 2001, and progressively took on roles of increasing responsibility. He served as F5’s Senior Vice President, Finance from 2012 until November 2024. He oversees F5's worldwide financial planning, analysis, accounting, reporting, and internal auditing procedures, as well as investor relations. Mr. Werner holds a B.A. in Business Administration with an Accounting Concentration from the Foster School of Business at the University of Washington. \nTom Fountain \nhas served as our Executive Vice President and Chief Operating Officer since September 2024. From June 2020 through August 2024, he served as Executive Vice President of Global Services and Chief Strategy Officer. Mr. Fountain joined F5 in January 2018 as Executive Vice President and Chief Strategy Officer. Mr. Fountain is responsible for overseeing F5’s global services organization, including global support, consulting, and services teams. He is also responsible for leading F5's digital transformation to accelerate critical solution delivery to customers and for driving execution, productivity and efficiency company wide. From November 2012 to January 2018, Mr. Fountain served as Senior Vice President for Strategy and Corporate Development at McAfee LLC, Vice President of Strategy and Operations at Intel Corporation, and Senior Vice President for Strategy and Corporate Development at McAfee Incorporated. Previously, Mr. Fountain served as Vice President and General Manager of the Content and Media Business Unit at Juniper Networks from December 2011 to November 2012 and Vice President of Corporate Strategy at Juniper Networks from February 2009 to December 2011. Earlier in his career, Mr. Fountain was a venture capitalist at Mayfield Fund from June 2003 to February 2009 and co-founder and engineering leader at Ingrian Networks from December 1999 to June 2004. He holds an M.B.A., an M.S. in Computer Science, an M.S. in Electrical Engineering, and a B.S. in Computer Systems Engineering, each from Stanford University.\nChad Whalen\n has served as our Executive Vice President and Chief Revenue Officer since September 2024. He is responsible for F5’s global sales go-to-market strategy and brings over 20 years of experience leading global teams across Europe, Asia, and North and South America in network infrastructure, security, and SaaS. From July 2018 to August 2024, he was Executive Vice President of Worldwide Sales. Mr. Whalen joined F5 in 2017 to lead the Cloud Sales team. Prior to joining F5, he ran strategic alliances at Fortinet, worldwide sales and services at Jasper, Americas sales and field operations at Ciena and global sales and marketing at World Wide Packets. He holds a B.A. in Business Administration and Management from Eastern Washington University. \nLyra Schramm\n has served as our Executive Vice President and Chief People Officer since April 2024. She is responsible for driving people initiatives that support F5’s purpose to help bring a better digital world to life and position the company for continued growth. Prior to joining F5, Ms. Schramm spent nine years at Google in various leadership roles including Vice President, Strategy & Innovation where she spearheaded Google’s first enterprise-wide people strategy supporting the transformation to an AI-first company. In addition, she led human resources for the Global Advisory Functions, was the Chief of Staff to the Chief Human Resource Officer, and led the people strategy for a new business line, Google Technical Services. Previously, Ms. Schramm played a pivotal HR leadership role at the Bill & Melinda Gates Foundation where she was instrumental in the Foundation’s global expansion. Her early career with Amazon set the stage for AWS’s growth, where she developed key recruitment strategies that significantly increased headcount and revenue. Ms. Schramm holds a BA in Marketing from Washington State University.\nKunal Anand \nhas served as our Executive Vice President and Chief Product Officer since October 2025. From October 2024 to October 2025, he served as our Chief Innovation Officer. He joined F5 in April 2024 as Chief Technology Officer. He is responsible for driving the Company’s technology and AI vision and innovation, with a focus on incorporating rapid AI adoption across F5’s product solutions. Prior to F5, Mr. Anand held the dual role of Chief Technology Officer and Chief Information Security Officer at Imperva. He joined Imperva in 2018 with the acquisition of Prevoty, an application security startup he co-founded in 2013. Before joining Prevoty, he was the Director of Technology at BBC Worldwide. Mr. Anand has a deep history of innovation and technical expertise, and has held roles leading security, data, technology, and engineering teams at Gravity, MySpace, and the NASA Jet Propulsion Lab. He holds a B.S. degree from Babson College.\nJohn Maddison\n has served as our Chief Marketing Officer since October 2025. He joined F5 in December 2024 as Chief Product Marketing and Technology Alliances Officer. Mr. Maddison is responsible for overseeing F5’s global marketing, business development, and corporate communications teams. He is also responsible for increasing F5’s market impact and delivering on the Company’s brand promise through its products and partnerships. Prior to joining F5, Mr. Maddison spent twelve years at Fortinet, most recently as Chief Marketing Officer and EVP of Product Strategy. He previously held leadership positions at Trend Micro, Vina Communications, and Octel Communications. Mr. Maddison holds a B.S. in Engineering from Plymouth University in Devon, England.\n11\nTable of Contents\nAngelique Okeke\n has served as our Executive Vice President and General Counsel since March 2025. She is responsible for leading F5's legal, regulatory, compliance, and corporate governance functions. Ms. Okeke brings more than 20 years of legal and operational leadership experience to F5. Prior to joining F5, she spent eight years at Nike, Inc., most recently as Global Vice President where she led strategic legal counsel on enterprise-wide initiatives that transformed Nike’s retail business model and accelerated its digital commerce strategy. Ms. Okeke has held legal leadership roles at AWS and Lotame. Okeke holds a B.A. in Political Science and Communications from Boston College, a Master of Arts in Public Communication from American University, and a Juris Doctor from Howard University School of Law.\nMichael Montoya \nhas served as our Executive Vice President and Chief Technology Operations Officer since October 2025. He previously served on our Board of Directors from 2021 to 2025. Prior to joining F5, Mr. Montoya served as Chief Operating Officer at BlueVoyant, overseeing Product, Engineering, and Operations. He previously held Chief Information Security Officer roles at Equinix and Digital Realty, leading enterprise, product, and physical security, as well as compliance. Mr. Montoya holds a B.A. in Economics from The University of New Mexico.",
  "item7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion of our financial condition and results of operations contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934 and Section 27A of the Securities Act of 1933. These statements include, but are not limited to, statements about our plans, objectives, expectations, strategies, intentions or other characterizations of future events or circumstances and are generally identified by the words \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" and similar expressions. These forward-looking statements are based on current information and expectations and are subject to a number of risks and uncertainties. Our actual results could differ materially from those expressed or implied by these forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed under \"Item 1A. Risk Factors\" herein and in other documents we file from time to time with the Securities and Exchange Commission. We assume no obligation to revise or update any such forward-looking statements.\nOverview\nF5 is a global leader in application delivery and security solutions which enables its customers to deploy, operate, secure, optimize, and govern every application and API across on-premises architectures, in the cloud, and at the network edge. Our cloud, software, and hardware solutions enable our customers to deliver fast, available, and secure digital experiences to their customers at scale. Our application services are available as hardware, software, SaaS, and software-only solutions optimized for hybrid, multicloud environments, with modules that can run independently, or as part of an integrated solution on our high-performance appliances. We market and sell our products primarily through multiple indirect sales channels in our Americas; Europe, the Middle East, and Africa (\"EMEA\"); and Asia Pacific (\"APAC\") regions. Enterprise customers (Fortune 1000 or Business Week Global 1000 companies) in the technology, financial services, transportation, education, manufacturing, and health care industries, along with government customers, and service providers continue to make up the largest percentage of our customer base.\nOur management team monitors and analyzes a number of key performance indicators in order to manage our business and evaluate our financial and operating performance on a consolidated basis. Those indicators include:\n•\nRevenues\n. Our revenue is derived from the sales of both products and services. The majority of our product revenues are derived from sales of our application delivery and security solutions including our F5 BIG-IP software and systems, F5 NGINX software, and our F5 Distributed Cloud Services offerings. Our F5 BIG-IP software solutions are sold both on a subscription and perpetual license basis. We sell F5 NGINX on a subscription basis as deployable software or SaaS. F5 Distributed Cloud Services provides security, multicloud networking, and edge-based computing solutions and are offered on a subscription basis, under a unified SaaS platform and managed service platform. Our services revenue includes annual maintenance contracts, training and consulting services.\nWe monitor the sales mix of our revenues within each reporting period. We believe customer acceptance rates of our new products, feature enhancements and consumption models are indicators of future trends. We also consider overall revenue concentration by geographic region as an additional indicator of current and future trends. In fiscal 2025, we benefited from improving customer demand, which began to stabilize and improve following macroeconomic uncertainties at the start of fiscal 2024. \n•\nCost of revenues and gross margins.\n We strive to control our cost of revenues and thereby maintain our gross margins. Significant items impacting cost of revenues are hardware costs paid to our contract manufacturers, third-party software license fees, technology costs, including cloud hosting and software licenses expenses, amortization of developed technology and personnel and overhead expenses. In addition, factors such as sales price, product and services mix, inventory obsolescence, returns, component price increases, warranty costs, and global supply chain constraints could significantly impact our gross margins.\n•\nOperating expenses.\n Operating expenses are substantially driven by personnel and related overhead expenses. Existing headcount and future hiring plans are the predominant factors in analyzing and forecasting future operating expense trends. Other significant operating expenses that we monitor include costs associated with cyber and enterprise-wide security, marketing and promotions, travel, professional fees, technology costs, including cloud hosting and software licenses expenses, related to the development of new products and provision of services, facilities and depreciation expenses.\n•\nLiquidity and cash flows.\n Our financial condition remains strong with significant cash and investments. The increase in cash and investments for fiscal year 2025 was primarily due to cash provided by operating activities of $949.7 million, partially offset by $502.1 million of cash used for the repurchase of outstanding common stock under our stock repurchase program, including the payment of related excise taxes. In addition, $171.1 million of cash was used for the acquisition of businesses during fiscal 2025, and $43.3 million of cash was used for capital expenditures related to the expansion of our facilities to support our operations worldwide, as well as investments in technology, including cloud hosting and software licenses, and equipment purchases to support our core business activities. Going forward, we believe the primary driver of cash flows will \n35\nTable of Contents\ncontinue to be net income from operations. We will continue to evaluate possible acquisitions of, or investments in businesses, products, or technologies that we believe are strategic, which may require the use of cash. Additionally, on January 31, 2020, we entered into a Revolving Credit Agreement (the \"Revolving Credit Agreement\") that provides for a senior unsecured revolving credit facility in an aggregate principal amount of $350.0 million (the \"Revolving Credit Facility\"). On January 31, 2025, the Revolving Credit Facility expired. At the time of expiration, there were no outstanding borrowings under the Revolving Credit Facility.\n•\nBalance sheet.\n We view cash, short-term and long-term investments, deferred revenue, accounts receivable balances and days sales outstanding as important indicators of our financial health. Deferred revenues continued to increase in fiscal 2025 due to an increase in deferred subscription contracts, including SaaS and maintenance associated with licensed-based subscriptions, which includes sales as part of our Flexible Consumption Program. Our days sales outstanding for the fourth quarter of fiscal year 2025 was 46. Days sales outstanding is calculated by dividing ending accounts receivable by revenue per day for a given quarter.\nCyber Incident\nOn October 15, 2025, we disclosed information about a Cyber Incident in which a highly sophisticated nation-state threat actor had gained unauthorized long-term, persistent access to certain Company systems, and exfiltrated certain files, some of which contained certain portions of our BIG-IP source code and information about undisclosed vulnerabilities that our engineering teams were working on in BIG-IP. Upon identifying the threat, we immediately activated our incident response process and took extensive actions to contain the threat actor, which included engaging leading external cybersecurity experts. Our investigation, monitoring, and related activities related to the incident are ongoing. To date, we believe our containment actions have been successful, and since the initiation of these efforts, we have not observed any evidence of new unauthorized activity. \nTo date, we are not aware of any undisclosed critical or remote code vulnerabilities, and we are not aware of active exploitation of any undisclosed vulnerabilities within our products. Further, to date, we have no evidence of modification to our software supply chain, including our source code and our build and release pipelines. This assessment has been validated through independent reviews by leading cybersecurity research firms. We have no evidence that the threat actor accessed or modified the NGINX source code or product development environment, nor do we have evidence they accessed or modified our F5 Distributed Cloud Services or Silverline systems. In response to the incident, we have prioritized delivering reliable software release updates to address all undisclosed high vulnerabilities in BIG-IP source code, with a significant number of our largest customers having completed these updates with minimal disruption. We have, and will continue to prioritize steps to bolster our security posture in implementing further measures to strengthen our security environment and protect our customers. \nTo date, this incident has not had a material impact on our operations. As a result of the incident, we anticipate near-term disruption to our sales cycles with demand impacts more pronounced in the early part of the fiscal year and normalizing in the second half of the fiscal year 2026. These disruptions may also lead to a near term impact on our operating margin within fiscal year 2026. We expect to continue to incur additional professional services and other expenses associated with incident response during fiscal year 2026. As of the date of this filing these expenses were not material. See Note 12. Commitments and Contingencies in the Notes to Consolidated Financial Statements included in Item 8 of Part II of this Annual Report on Form 10-K for more information. \nCritical Accounting Estimates\nOur consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe that, of our significant accounting policies, which are described in Note 1 of the notes to the consolidated financial statements, the following accounting policy involves a greater degree of judgment and complexity. Accordingly, we believe the following policy is the most critical to aid in fully understanding and evaluating our consolidated financial condition and results of operations.\nRevenue Recognition.\n The majority of our contracts with our customers include various combinations of our products and subscriptions and support. Our hardware products and software licenses are distinct from our subscriptions and support services as the customer can benefit from the product without these services and such services are separately identifiable within the contract. We account for multiple agreements with a single customer as a single contract if the contractual terms and/or substance of those agreements indicate that they may be so closely related that they are, in effect, parts of a single contract. The \n36\nTable of Contents\namount of consideration we expect to receive in exchange for delivering on the contract is allocated to each performance obligation based on its relative standalone selling price.\nWhen estimating standalone selling price, we first consider the prices charged for a deliverable when sold separately. If the standalone selling price is not observable through past transactions, we estimate it based on our pricing model and our go-to-market strategy, which include factors such as target gross margins, the geographies in which our offerings were sold, and offering type (products or services). As our business offerings evolve over time, we may be required to modify our estimated standalone selling prices, and as a result the timing and classification of our revenue could be affected.\nImpact of Macroeconomic Conditions\nOur overall performance depends in part on worldwide economic and geopolitical conditions and their impacts on customer behavior. Uncertain economic conditions, including inflation, tariffs and other duties, higher interest rates, slower growth, fluctuations in foreign exchange rates, and other changes in economic conditions, may adversely affect our results of operations and financial performance. For further discussion of the potential impacts of recent macroeconomic events on our business, financial condition, and operating results, see Part I, Item 1A titled \"Risk Factors.\"\nResults of Operations\nThe following discussion and analysis comparing our fiscal 2025 financial results to fiscal 2024 should be read in conjunction with our consolidated financial statements, related notes and risk factors included elsewhere in this Annual Report on Form 10-K. For discussion and analysis related to our financial results comparing fiscal 2024 to 2023, refer to Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for fiscal 2024, which was filed with the Securities and Exchange Commission on November 18, 2024.\n \nYears Ended September 30,\n \n2025\n2024\n2023\n \n(in thousands, except percentages)\nNet revenues\nProducts\n$\n1,508,640 \n$\n1,272,795 \n$\n1,334,638 \nServices\n1,579,432 \n1,543,325 \n1,478,531 \nTotal\n$\n3,088,072 \n$\n2,816,120 \n$\n2,813,169 \nPercentage of net revenues\nProducts\n48.9 \n%\n45.2 \n%\n47.4 \n%\nServices\n51.1 \n54.8 \n52.6 \nTotal\n100.0 \n%\n100.0 \n%\n100.0 \n%\nNet Product Revenues.\n Net product revenues increased 18.5% in fiscal year 2025 from fiscal year 2024. The increase of $235.8 million in net product revenues for fiscal year 2025 was due to an increase in revenues associated with systems and software of $168.2 million and $67.6 million, respectively. \nNet Service Revenues.\n Net service revenues increased 2.3% in fiscal year 2025 from fiscal year 2024. The increase of $36.1 million in service revenue for fiscal year 2025 was primarily the result of increased initial purchases and renewals of maintenance contracts. \n37\nTable of Contents\nThe following presents net product revenues by systems and software (in thousands):\n \nYears Ended September 30,\n \n2025\n2024\n2023\nNet product revenues\nSystems revenue\n$\n705,551 \n$\n537,318 \n$\n670,652 \nSoftware revenue\nSubscription\n507,585 \n430,474 \n352,615 \nSaaS and managed services\n175,641 \n193,201 \n203,326 \nPerpetual licenses\n119,863 \n111,802 \n108,045 \nTotal net product revenue\n$\n1,508,640 \n$\n1,272,795 \n$\n1,334,638 \nPercentage of net product revenues\nSystems revenue\n46.8 \n%\n42.2 \n%\n50.2 \n%\nSoftware revenue\nSubscription\n33.7 \n33.8 \n26.4 \nSaaS and managed services\n11.6 \n15.2 \n15.3 \nPerpetual licenses\n7.9 \n8.8 \n8.1 \nTotal net product revenue\n100.0 \n%\n100.0 \n%\n100.0 \n%\nTotal systems revenue increased 31.3% in fiscal year 2025 from 2024 was primarily due to increases in customer demand and pricing increases on system offerings. Total systems revenue decreased 19.9% in fiscal year 2024 from 2023 primarily due to a lower level of shipments due to 2022 supply chain constrained demand fulfilled in 2023. Total software revenue was $803.1 million, $735.5 million, and $664.0 million for fiscal years 2025, 2024, and 2023, respectively. Total software revenue increased by 9.2% in fiscal year 2025 from 2024 primarily due to increases in renewals and initial purchases of subscription offerings. Total software revenue increased by 10.8% in fiscal year 2024 from 2023 primarily due to increases in renewals and initial purchases of subscription offerings. Total SaaS and managed services revenue did not account for 10% or more of total net revenues for any period presented.\nThe following distributor customers accounted for more than 10% of total net revenue:\n \nYears Ended September 30,\n \n2025\n2024\n2023\nCustomer A\n15.8 \n%\n16.3 \n%\n15.6 \n%\nCustomer B\n17.5 \n%\n15.9 \n%\n15.0 \n%\nThe following distributor customers accounted for more than 10% of total receivables:\nSeptember 30,\n2025\n2024\nCustomer A\n11.1 \n%\n20.3 \n%\nCustomer B\n17.8 \n%\n14.8 \n%\nCustomer C\n10.9 \n%\n— \nCustomer D\n11.4 \n%\n— \nNo end-user customers accounted for more than 10% of total net revenue or receivables. No other distributor customers accounted for more than 10% of total net revenue or receivables, other than those noted above.\n \n38\nTable of Contents\n \nYears Ended September 30,\n \n2025\n2024\n2023\n \n(in thousands, except percentages)\nCost of net revenues and gross profit\nProducts\n$\n338,037 \n$\n336,237 \n$\n375,192 \nServices\n235,941 \n221,410 \n218,116 \nTotal\n573,978 \n557,647 \n593,308 \nGross profit\n$\n2,514,094 \n$\n2,258,473 \n$\n2,219,861 \nPercentage of net revenues and gross margin (as a percentage of related net revenue)\nProducts\n22.4 \n%\n26.4 \n%\n28.1 \n%\nServices\n14.9 \n14.3 \n14.8 \nTotal\n18.6 \n19.8 \n21.1 \nGross margin\n81.4 \n%\n80.2 \n%\n78.9 \n%\nCost of Net Product Revenues.\n Cost of net product revenues consist of finished products purchased from our contract manufacturers, personnel costs, including the salaries, stock-based compensation, and related benefits of our personnel, manufacturing overhead, freight, warranty, provisions for excess and obsolete inventory, technology costs, including cloud hosting and software licenses expenses, facilities and depreciation expenses, and amortization expenses in connection with developed technology from acquisitions. Cost of net product revenues increased primarily due to systems and software revenue growth. The increase was largely offset by an improvement in product margins driven by a more favorable product mix.\nCost of Net Service Revenues.\n Cost of net service revenues consist of personnel costs, including the salaries, stock-based compensation, and related benefits of our professional services personnel, travel, technology costs, including cloud hosting and software licenses expenses, facilities and depreciation expenses. Cost of net service revenues increased $14.5 million, or 6.6% in fiscal year 2025 from the prior year. The increase in cost of net service revenues was primarily due to an increase in personnel costs.\n \nYears Ended September 30,\n \n2025\n2024\n2023\n \n(in thousands, except percentages)\nOperating expenses\nSales and marketing\n$\n860,506 \n$\n832,279 \n$\n878,215 \nResearch and development\n539,815 \n490,120 \n540,285 \nGeneral and administrative\n322,340 \n268,828 \n263,405 \nRestructuring charges\n25,484 \n8,655 \n65,388 \nTotal\n$\n1,748,145 \n$\n1,599,882 \n$\n1,747,293 \nOperating expenses (as a percentage of net revenue)\nSales and marketing\n27.9 \n%\n29.6 \n%\n31.2 \n%\nResearch and development\n17.5 \n17.4 \n19.2 \nGeneral and administrative\n10.4 \n9.5 \n9.4 \nRestructuring charges\n0.8 \n0.3 \n2.3 \nTotal\n56.6 \n%\n56.8 \n%\n62.1 \n%\nSales and Marketing.\n Sales and marketing expenses consist of personnel costs, including the salaries, commissions, stock-based compensation, and related benefits of our sales and marketing personnel, the costs of our marketing programs, including public relations, advertising and trade shows, travel, facilities, technology costs, including cloud hosting and software licenses expenses, facilities and depreciation expenses. Sales and marketing expense increased $28.2 million, or 3.4% in fiscal year 2025 from the prior year. The increase in sales and marketing expense for fiscal year 2025 was primarily due to an increase of $20.6 million in personnel costs. Sales and marketing headcount at the end of fiscal year 2025 increased to 2,186 from 2,165 at the end of fiscal year 2024. In addition, technology expenditures to support the sales and marketing organization increased $6.5 million in fiscal year 2025 from the prior year. \nResearch and Development.\n Research and development expenses consist of personnel costs, including the salaries, stock-based compensation, and related benefits of our product development personnel, prototype materials and other expenses related to the development of new and improved products, technology costs, including cloud hosting and software licenses expenses, \n39\nTable of Contents\nfacilities, depreciation and amortization expenses. Research and development expense increased $49.7 million, or 10.1% in fiscal year 2025 from the prior year. The increase in research and development expense for fiscal year 2025 was primarily due to an increase of $31.4 million in personnel costs. In addition, technology costs to support the research and development organization increased $18.9 million in fiscal year 2025 from the prior year.\nGeneral and Administrative.\n General and administrative expenses consist of personnel costs, including the salaries, benefits and related costs of our executive, finance, information technology, human resource and legal personnel, third-party professional service fees, bad debt charges, technology costs, including cloud hosting and software licenses expenses, facilities and depreciation expenses. General and administrative expense increased $53.5 million, or 19.9% in fiscal year 2025 from the prior year. The increase in general and administrative expense for fiscal year 2025 was primarily due to an increase of $25.8 million in personnel costs. General and administrative headcount at the end of fiscal year 2025 increased to 898 from 875 at the end of fiscal year 2024. In addition, fees paid for professional services increased $19.7 million in fiscal year 2025 from the prior year, primarily due to activity related to acquisitions. \nRestructuring charges\n. In the first and fourth fiscal quarters of 2025, and the first fiscal quarter of 2024, we completed restructuring plans to better align strategic and financial objectives, optimize operations, and drive efficiencies for long-term growth and profitability. As a result of the first and fourth quarters of fiscal 2025 restructuring initiatives, we recorded charges of $11.3 million and $14.3 million, net of adjustments, related to reductions in workforce that are reflected in our results for fiscal 2025. As a result of the first quarter of fiscal 2024 restructuring initiative, we recorded a charge of $8.7 million, net of adjustments, related to a reduction in workforce that is reflected in our results for fiscal 2024.\n \nYears Ended September 30,\n \n2025\n2024\n2023\n \n(in thousands, except percentages)\nOther income and income taxes\nIncome from operations\n$\n765,949 \n$\n658,591 \n$\n472,568 \nOther income, net\n42,387 \n36,874 \n13,420 \nIncome before income taxes\n808,336 \n695,465 \n485,988 \nProvision for income taxes\n115,956 \n128,687 \n91,040 \nNet income\n$\n692,380 \n$\n566,778 \n$\n394,948 \nOther income and income taxes (as percentage of net revenue)\nIncome from operations\n24.8 \n%\n23.4 \n%\n16.8 \n%\nOther income, net\n1.4 \n1.3 \n0.5 \nIncome before income taxes\n26.2 \n24.7 \n17.3 \nProvision for income taxes\n3.8 \n4.6 \n3.3 \nNet income\n22.4 \n%\n20.1 \n%\n14.0 \n%\nOther Income, Net. \nThe change in other income, net for the fiscal year ended September 30, 2025 was primarily driven by interest income and expense, investment income, and foreign currency transaction gains and losses compared to the same periods in the prior year. \nProvision for Income Taxes.\n We recorded a 14.3% provision for income taxes for fiscal year 2025, compared to 18.5% in fiscal year 2024. The decrease in effective tax rate from fiscal year 2024 to 2025 is primarily due to the tax impact from stock-based compensation and tax reserves.\nWe record a valuation allowance to reduce our deferred tax assets to the amount we believe is more likely than not to be realized. In making these determinations we consider historical and projected taxable income, and ongoing prudent and feasible tax planning strategies in assessing the appropriateness of a valuation allowance. The net decrease in the valuation allowance of $5.4 million for fiscal year 2025 was primarily related to tax net operating losses and credits incurred in certain foreign jurisdictions, and state tax carryforwards. Our net deferred tax assets as of September 30, 2025 and 2024 were $444.5 million and $358.8 million, respectively.\n     Our worldwide effective tax rate may fluctuate based on a number of factors, including variations in projected taxable income in the various geographic locations in which we operate, the impact of stock-based compensation, changes in the valuation of our net deferred tax assets, resolution of potential exposures, tax positions taken on tax returns filed in the various geographic locations in which we operate, and the introduction of new accounting standards or changes in tax laws or interpretations thereof in the various geographic locations in which we operate. We have recorded liabilities to address potential tax exposures related to business and income tax positions we have taken that could be challenged by taxing authorities. The \n40\nTable of Contents\nultimate resolution of these potential exposures may be greater or less than the liabilities recorded, which could result in an adjustment to our future tax expense.\n  On July 4, 2025, the One Big Beautiful Bill Act (\"OBBBA\") was enacted into law. The new legislation did not have a material impact for fiscal year 2025. The Company is currently evaluating the impact on future years but does not expect a material impact to the consolidated financial statements. \n The Company operates in countries that have enacted, or have committed to enact, a minimum tax in accordance with the Organization for Economic Co-operation and Development’s Pillar Two framework. The Pillar Two legislation was effective for the Company starting fiscal year 2025 but did not have a material impact. The Company will continue to monitor for additional guidance but does not expect a material impact to the consolidated financial statements for future years.\nLiquidity and Capital Resources\nWe have funded our operations with our cash balances and cash generated from operations.\n \nYears Ended September 30,\n \n2025\n2024\n2023\n \n(in thousands)\nLiquidity and Capital Resources\nCash and cash equivalents and investments\n$\n1,359,966 \n$\n1,083,182 \n$\n808,391 \nCash provided by operating activities\n949,666 \n792,419 \n653,409 \nCash (used in) provided by investing activities\n(219,491)\n(59,214)\n36,393 \nCash used in financing activities\n(464,815)\n(457,002)\n(653,299)\nCash and cash equivalents, short-term investments and long-term investments totaled $1,360.0 million as of September 30, 2025, compared to $1,083.2 million as of September 30, 2024, representing an increase of $276.8 million. The increase was primarily due to cash provided by operating activities of $949.7 million for fiscal 2025, partially offset by cash used for the repurchase of outstanding common stock and the payment of related excise taxes of $502.1 million. In addition, $171.1 million of cash was used for the acquisition of businesses during fiscal 2025, and $43.3 million of cash was used for capital expenditures related to the expansion of our facilities to support our operations worldwide, as well as investments in technology, including cloud hosting and software licenses, and equipment purchases to support our core business activities. As of September 30, 2025, 64.0% of our cash and cash equivalents and investment balances were outside of the U.S. The cash and cash equivalents and investment balances outside of the U.S. are subject to fluctuation based on the settlement of intercompany balances. \nCash provided by operating activities during fiscal year 2025 was $949.7 million compared to $792.4 million in fiscal year 2024. Cash provided by operating activities resulted primarily from cash generated from net income, after adjusting for non-cash charges such as stock-based compensation, depreciation and amortization charges and changes in operating assets and liabilities. Cash provided by operating activities for fiscal year 2025 increased from the prior year primarily due to growth of our business as reflected by increases in collections during fiscal 2025, partially offset by higher cash expenditure to support our business growth.\nCash from operations could be affected by various risks and uncertainties, including, but not limited to the risks detailed in Part I, Item 1A titled \"Risk Factors.\" However, we anticipate our current cash, cash equivalents and investment balances and anticipated cash flows generated from operations will be sufficient to meet our liquidity needs.\nCash used in investing activities during fiscal year 2025 was $219.5 million compared to cash used in investing activities of $59.2 million in fiscal year 2024. Investing activities include purchases, sales and maturities of available-for-sale securities, business acquisitions and capital expenditures. Cash used in investing activities for fiscal year 2025 was primarily the result of $171.1 million in cash paid for acquisitions and $43.3 million in capital expenditures related to maintaining our operations worldwide. Cash used in investing activities for fiscal year 2024 was primarily the result of $32.9 million in cash paid for acquisitions and $30.4 million in capital expenditures related to maintaining our operations worldwide, partially offset by $6.2 million in maturities of investments.\n41\nTable of Contents\nCash used in financing activities was $464.8 million for fiscal year 2025, compared to cash used in financing activities of $457.0 million for fiscal year 2024. Cash used in financing activities for fiscal year 2025 included $502.1 million of cash used for the repurchase of outstanding common stock and the payment of related excise taxes, as well as $21.9 million in cash used for taxes related to the net share settlement of equity awards. Cash used in financing activities was partially offset by cash received from the exercise of employee stock options and stock purchases under our employee stock purchase plan of $59.2 million. Cash used in financing activities for fiscal year 2024 included $500.6 million of cash used for the repurchase of outstanding common stock and the payment of related excise taxes, as well as $11.5 million in cash used for taxes related to the net share settlement of equity awards. Cash used in financing activities was partially offset by cash received from the exercise of employee stock options and stock purchases under our employee stock purchase plan of $55.1 million.\nOn January 31, 2020, we entered into a Revolving Credit Agreement (the \"Revolving Credit Agreement\") that provides for a senior unsecured revolving credit facility in an aggregate principal amount of $350.0 million (the \"Revolving Credit Facility\"). On January 31, 2025, the Revolving Credit Facility expired. At the time of expiration, there were no outstanding borrowings under the Revolving Credit Facility.\nBased on our current operating and capital expenditure forecasts, we believe that our existing cash and investment balances, together with cash generated from operations should be sufficient to meet our operating requirements for the next twelve months. Our future capital requirements will depend on many factors, including our rate of revenue growth, the expansion of our sales and marketing activities, the timing and extent of expansion into new territories, the timing of introductions of new products and enhancements of existing products, the continuing market acceptance of our products,  cash paid for future strategic initiatives such as our share repurchase program and acquisitions, and macroeconomic events or conditions.\nObligations and Commitments\nAs of September 30, 2025, we had approximately $99.3 million of tax liabilities, including interest and penalties, related to uncertain tax positions (See Note 8 to our Consolidated Financial Statements). Because of the high degree of uncertainty regarding the settlement of these liabilities, we are unable to estimate the years in which future cash outflows may occur.\nAs of September 30, 2025, our principal commitments consisted of obligations outstanding under operating leases and purchase obligations with one of our component suppliers. \nIn October 2022, we entered into an unconditional purchase commitment with one of our suppliers for the delivery of systems components. Under the terms of the agreement, we are obligated to purchase $10 million of component inventory annually, with a total committed amount of $40 million over a four-year term. As of September 30, 2025, we had no remaining purchase commitments under the third year of the agreement. Our total non-cancelable long-term purchase commitments outstanding as of September 30, 2025 was $\n10.0\n million.\nWe have a contractual obligation to purchase inventory components procured by our primary contract manufacturer in accordance with our annual build forecast. The contractual terms of the obligation contain cancellation provisions, which reduce our liability to purchase inventory components for periods greater than one year. In order to support our build forecast, we will, from time-to-time prepay our primary contract manufacturer for inventory purchases.\nRecently Issued Accounting Pronouncements\nRefer to \"Recently Issued Accounting Pronouncements\" in Note 1. Summary of Significant Accounting Policies in Part II, Item 8 of this Annual Report on Form 10-K for a description of recent accounting pronouncements and our expectation of their impact, if any, on our results of operations and financial condition.\n42\nTable of Contents",
  "item2": null
}