{
  "source_file": "ffiv-20250630.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion of our financial condition and results of operations contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934 and Section 27A of the Securities Act of 1933. These statements include, but are not limited to, statements about our plans, objectives, expectations, strategies, intentions or other characterizations of future events or circumstances and are generally identified by the words \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" and similar expressions. These forward-looking statements are based on current information and expectations and are subject to a number of risks and uncertainties. Our actual results could differ materially from those expressed or implied by these forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed in Part II, Item 1A. \"Risk Factors\" herein and in other documents we file from time to time with the Securities and Exchange Commission. We assume no obligation to revise or update any such forward-looking statements.\nOverview \nF5 is a global leader in application delivery and security solutions which enables its customers to deploy, operate, secure, optimize, and govern every application and API across any architecture - on-premises, in the cloud, or at the edge. Our cloud, software, and hardware solutions enable our customers to deliver fast, available, and secure digital experiences to their customers at scale. Our enterprise-grade application services are available as hardware, software, and software-as-a-service, and software-only solutions optimized for hybrid, multicloud environments, with modules that can run independently, or as part of an integrated solution on our high-performance appliances. We market and sell our products primarily through multiple indirect sales channels in the Americas; Europe, the Middle East, and Africa (EMEA); and the Asia Pacific region (APAC). Enterprise customers (Fortune 1000 or Business Week Global 1000 companies) in the technology, telecommunications, financial services, transportation, education, manufacturing and health care industries, along with government customers, continue to make up the largest percentage of our customer base.\nOur management team monitors and analyzes a number of key performance indicators in order to manage our business and evaluate our financial and operating performance on a consolidated basis. Those indicators include:\n•\nRevenues.\n Our revenue is derived from the sales of both products and services. The majority of our product revenues are derived from sales of our application delivery and security solutions including our BIG-IP software and systems, F5 NGINX software, and our F5 Distributed Cloud Services offerings. Our BIG-IP software solutions are sold both on a perpetual license and a subscription basis. We sell F5 NGINX on a subscription basis. F5 Distributed Cloud Services provides security, multicloud networking, and edge-based computing solutions and are offered on a subscription basis, under a unified software-as-a-service (\"SaaS\") and managed service platform. Our services revenue includes annual maintenance contracts, training and consulting services. \nWe monitor the sales mix of our revenues within each reporting period. We believe customer acceptance rates of our new products, feature enhancements and consumption models are indicators of future trends. We also consider overall revenue concentration by geographic region as an additional indicator of current and future trends. Over the course of fiscal 2024, uncertainties in the macroeconomic environment began to stabilize and we saw improvements in customer demand during the second half of fiscal 2024, which has continued in fiscal 2025.\n21\nTable of Contents\n•\nCost of revenues and gross margins.\n We strive to control our cost of revenues and thereby maintain our gross margins. Significant items impacting cost of revenues are hardware costs paid to our contract manufacturers, third-party software license fees, software-as-a-service infrastructure costs, amortization of developed technology and personnel and overhead expenses. In addition, factors such as sales price, product and services mix, inventory obsolescence, returns, component price increases, warranty costs, and global supply chain constraints could significantly impact our gross margins.\n•\nOperating expenses.\n Operating expenses are substantially driven by personnel and related overhead expenses. Existing headcount and future hiring plans are the predominant factors in analyzing and forecasting future operating expense trends. Other significant operating expenses that we monitor include marketing and promotions, travel, professional fees, technology costs related to the development of new products and provision of services, facilities and depreciation expenses.\n•\nLiquidity and cash flows.\n Our financial condition remains strong with significant cash and investments. The increase in cash and investments for the first nine months of fiscal year 2025 was primarily due to cash provided by operating activities of $741.6 million, partially offset by $377.1 million of cash used for the repurchase of outstanding common stock under our stock repurchase program, including excise taxes. Going forward, we believe the primary driver of cash flows will be net income from operations. We will continue to evaluate possible acquisitions of, or investments in businesses, products, or technologies that we believe are strategic, which may require the use of cash. Additionally, on January 31, 2020, we entered into a Revolving Credit Agreement (the \"Revolving Credit Agreement\") that provides for a senior unsecured revolving credit facility in an aggregate principal amount of $350.0 million (the \"Revolving Credit Facility\"). On January 31, 2025, the Revolving Credit Facility expired. At the time of expiration, there were no outstanding borrowings under the Revolving Credit Facility.\n•\nBalance sheet.\n We view cash, short-term and long-term investments, deferred revenue, accounts receivable balances and days sales outstanding as important indicators of our financial health. Deferred revenues increased to $1.96 billion as of June 30, 2025 from $1.80 billion as of September 30, 2024 primarily due to an increase in maintenance renewal contracts related to our existing product installation base, in addition to increased deferred revenue associated with subscription offerings. Our days sales outstanding for the third quarter of fiscal year 2025 was 42. Days sales outstanding is calculated by dividing ending accounts receivable by revenue per day for a given quarter.\nSummary of Critical Accounting Policies and Estimates\nThe preparation of our financial condition and results of operations requires us to make judgments and estimates that may have a significant impact on our financial results. We believe that, of our significant accounting policies, revenue recognition requires estimates and assumptions that require complex, subjective judgments by management, which can materially impact reported results. Actual results may differ from these estimates under different assumptions or conditions. \nThere were no material changes to our critical accounting policies and estimates compared to the critical accounting policies and estimates described in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the Form 10-K for the fiscal year ended September 30, 2024. Refer to the \"New Accounting Pronouncements\" section of  Note 1 in this Quarterly Report on Form 10-Q for a summary of the new accounting policies.\nImpact of Macroeconomic Conditions\nOur overall performance depends in part on worldwide economic and geopolitical conditions and their impacts on customer behavior. Uncertain economic conditions, including inflation, tariffs and other duties, higher interest rates, slower growth, fluctuations in foreign exchange rates, and other changes in economic conditions, may adversely affect our results of operations and financial performance. For further discussion of the potential impacts of recent macroeconomic events on our business, financial condition, and operating results, see Part 1, Item 1A, \"Risk Factors\" of our Annual Report on Form 10-K for the fiscal year ended September 30, 2024.\n22\nTable of Contents\nResults of Operations\nThe following discussion and analysis should be read in conjunction with our consolidated financial statements, related notes and risk factors included elsewhere in this Quarterly Report on Form 10-Q.\n \nThree months ended\nJune 30,\nNine months ended\nJune 30,\n \n2025\n2024\n2025\n2024\n \n(in thousands, except percentages)\nNet revenues\nProducts\n$\n388,838 \n$\n308,489 \n$\n1,094,531 \n$\n914,510 \nServices\n391,532 \n387,006 \n1,183,451 \n1,154,936 \nTotal\n$\n780,370 \n$\n695,495 \n$\n2,277,982 \n$\n2,069,446 \nPercentage of net revenues\nProducts\n49.8 \n%\n44.4 \n%\n48.0 \n%\n44.2 \n%\nServices\n50.2 \n55.6 \n52.0 \n55.8 \nTotal\n100.0 \n%\n100.0 \n%\n100.0 \n%\n100.0 \n%\nNet Revenues.\n Total net revenues increased 12.2% and 10.1% for the three and nine months ended June 30, 2025, respectively, from the comparable periods in the prior year. The increase in total net revenues for the three months ended June 30, 2025 was primarily due to an increase in product revenues associated with systems and software. The increase in total net revenues for the nine months ended June 30, 2025 was primarily due to an increase in product revenues associated with systems and software, as well as an increase in service revenues driven by purchases of initial and renewal maintenance contracts. International revenues represented 47.3% and 47.7% of total net revenues for the three and nine months ended June 30, 2025, respectively, compared to 48.0% for the three and nine months ended June 30, 2024.\nNet Product Revenues.\n Net product revenues increased 26.0% and 19.7% for the three and nine months ended June 30, 2025, respectively, from the comparable periods in the prior year. The increase in net product revenues for the three and nine months ended June 30, 2025 was due to an increase in revenues associated with systems and software. \nThe following presents net product revenues by systems and software:\n \nThree months ended\nJune 30,\nNine months ended\nJune 30,\n \n2025\n2024\n2025\n2024\n(in thousands, except percentages)\nNet product revenues\nSystems revenue\n$\n180,855 \n$\n129,845 \n$\n519,968 \n$\n406,873 \nSoftware revenue\n207,983 \n178,644 \n574,563 \n507,637 \nTotal net product revenue\n$\n388,838 \n$\n308,489 \n$\n1,094,531 \n$\n914,510 \nPercentage of net product revenues\nSystems revenue\n46.5 \n%\n42.1 \n%\n47.5 \n%\n44.5 \n%\nSoftware revenue\n53.5 \n57.9 \n52.5 \n55.5 \nTotal net product revenue\n100.0 \n%\n100.0 \n%\n100.0 \n%\n100.0 \n%\nSystems Revenues. \nAs a component of net product revenues, systems revenues increased 39.3% and 27.8% for the three and nine months ended June 30, 2025, respectively, from the comparable periods in the prior year.\nSoftware Revenues. \nAs a component of net product revenues, software revenues increased 16.4% and 13.2% for the three and nine months ended June 30, 2025, respectively, from the comparable periods in the prior year.\nNet Service Revenues. \nNet service revenues increased 1.2% and 2.5% for the three and nine months ended June 30, 2025, respectively, from the comparable periods in the prior year. The increase in net service revenues for the three months ended June 30, 2025 was primarily the result of increased initial purchases of maintenance contracts driven by product revenue growth. The increase in net service revenues for the nine months ended June 30, 2025 was primarily the result of increased initial purchases and renewals of maintenance contracts.\n23\nTable of Contents\nThe following customers accounted for more than 10% of total net revenue:\n \nThree months ended\nJune 30,\nNine months ended\nJune 30,\n \n2025\n2024\n2025\n2024\nIngram Micro, Inc.\n17.0 \n%\n15.7 \n%\n16.7 \n%\n16.5 \n%\nSynnex Corporation\n18.4 \n%\n15.9 \n%\n17.6 \n%\n16.0 \n%\nCarahsoft Technology Corporation\n— \n10.5 \n%\n— \n— \nThe following customers accounted for more than 10% of total receivables:\nJune 30,\n2025\nSeptember 30,\n2024\nIngram Micro, Inc.\n16.8 \n%\n20.3 \n%\nSynnex Corporation\n16.6 \n%\n14.8 \n%\nNo other customers accounted for more than 10% of total net revenue or receivables.\n \n \nThree months ended\nJune 30,\nNine months ended\nJune 30,\n \n2025\n2024\n2025\n2024\n \n(in thousands, except percentages)\nCost of net revenues and gross profit\nProducts\n$\n88,782 \n$\n80,813 \n$\n252,905 \n$\n248,834 \nServices\n59,846 \n55,612 \n177,192 \n165,093 \nTotal\n148,628 \n136,425 \n430,097 \n413,927 \nGross profit\n$\n631,742 \n$\n559,070 \n$\n1,847,885 \n$\n1,655,519 \nPercentage of net revenues and gross margin (as a percentage of related net revenue)\nProducts\n22.8 \n%\n26.2 \n%\n23.1 \n%\n27.2 \n%\nServices\n15.3 \n14.4 \n15.0 \n14.3 \nTotal\n19.0 \n19.6 \n18.9 \n20.0 \nGross margin\n81.0 \n%\n80.4 \n%\n81.1 \n%\n80.0 \n%\nCost of Net Product Revenues\n. Cost of net product revenues consist of finished products purchased from our contract manufacturers, personnel costs, manufacturing overhead, freight, warranty, provisions for excess and obsolete inventory, software-as-a-service infrastructure costs and amortization expenses in connection with developed technology from acquisitions. Cost of net product revenues increased $8.0 million, or 9.9% for the three months ended June 30, 2025 and increased $4.1 million, or 1.6% for the nine months ended June 30, 2025 from the comparable periods in the prior year primarily due to systems product revenue growth.\nCost of Net Service Revenues\n. Cost of net service revenues consist of the salaries and related benefits of our professional services staff, travel, facilities and depreciation expenses. For the three and nine months ended June 30, 2025, cost of net service revenues as a percentage of net service revenues was 15.3% and 15.0%, respectively, compared to 14.4% and 14.3% for the comparable periods in the prior year, respectively. Professional services headcount at the end of June 2025 increased to 1,091 from 1,088 at the end of June 2024.\n24\nTable of Contents\n \nThree months ended\nJune 30,\nNine months ended\nJune 30,\n \n2025\n2024\n2025\n2024\n \n(in thousands, except percentages)\nOperating expenses\nSales and marketing\n$\n220,428 \n$\n205,550 \n$\n644,524 \n$\n615,277 \nResearch and development\n136,345 \n124,387 \n403,424 \n366,169 \nGeneral and administrative\n78,652 \n65,950 \n228,320 \n197,852 \nRestructuring charges\n— \n93 \n11,321 \n8,655 \nTotal\n$\n435,425 \n$\n395,980 \n$\n1,287,589 \n$\n1,187,953 \nOperating expenses (as a percentage of net revenue)\nSales and marketing\n28.2 \n%\n29.5 \n%\n28.3 \n%\n29.7 \n%\nResearch and development\n17.5 \n17.9 \n17.7 \n17.7 \nGeneral and administrative\n10.1 \n9.5 \n10.0 \n9.6 \nRestructuring charges\n— \n— \n0.5 \n0.4 \nTotal\n55.8 \n%\n56.9 \n%\n56.5 \n%\n57.4 \n%\nSales and Marketing.\n Sales and marketing expenses consist of the salaries, commissions and related benefits of our sales and marketing staff, the costs of our marketing programs, including public relations, advertising and trade shows, travel, facilities and depreciation expenses. Sales and marketing expenses increased $14.9 million, or 7.2% for the three months ended June 30, 2025 and increased $29.2 million, or 4.8% for the nine months ended June 30, 2025 from the comparable periods in the prior year. The increase in sales and marketing expense for the three and nine months ended June 30, 2025 was primarily due to an increase of $7.7 million and $18.2 million, respectively, in personnel costs from the comparable periods in the prior year. In addition, commissions for the three and nine months ended June 30, 2025 increased $3.1 million and $3.3 million, respectively, from the comparable periods in the prior year. Sales and marketing headcount at the end of June 2025 decreased to 2,150 from 2,166 at the end of June 2024. Sales and marketing expenses included stock-based compensation expense of $21.1 million and $64.1 million for the three and nine months ended June 30, 2025, respectively, compared to $20.8 million and $63.8 million for the same periods in the prior year, respectively.\nResearch and Development\n. Research and development expenses consist of the salaries and related benefits of our product development personnel, prototype materials and other expenses related to the development of new and improved products, facilities and depreciation expenses. Research and development expenses increased $12.0 million, or 9.6% for the three months ended June 30, 2025 and increased $37.3 million, or 10.2% for the nine months ended June 30, 2025 from the comparable periods in the prior year. The increase in research and development expense for the three and nine months ended June 30, 2025 was primarily due to an increase of $7.2 million and $23.5 million, respectively, in personnel costs from the comparable periods in the prior year. Research and development headcount at the end of June 2025 increased to 2,050 from 1,995 at the end of June 2024. Research and development expenses included stock-based compensation expense of $15.9 million and $48.8 million for the three and nine months ended June 30, 2025, respectively, compared to $14.8 million and $46.3 million for the same periods in the prior year, respectively.\nGeneral and Administrative\n. General and administrative expenses consist of the salaries, benefits and related costs of our executive, finance, information technology, human resource and legal personnel, third-party professional service fees, bad debt charges, facilities and depreciation expenses. General and administrative expenses increased $12.7 million, or 19.3% for the three months ended June 30, 2025 and increased $30.5 million, or 15.4% for the nine months ended June 30, 2025 from the comparable periods in the prior year. The increase in general and administrative expenses for the three and nine months ended June 30, 2025 was primarily due to an increase of $4.6 million and $10.2 million, respectively, in personnel costs from the comparable periods in the prior year. In addition, expenses for professional services increased $4.6 million and $8.3 million for the three and nine months ended June 30, 2025, respectively, from the comparable periods in the prior year. General and administrative headcount at the end of June 2025 decreased to 868 from 874 at the end of June 2024. General and administrative expenses included stock-based compensation expense of $13.0 million and $39.1 million for the three and nine months ended June 30, 2025, respectively, compared to $11.5 million and $32.9 million for the same periods in the prior year, respectively.\nRestructuring Charges\n. In the first fiscal quarters of 2025 and 2024, we completed restructuring plans to align strategic and financial objectives and optimize resources for long term growth. As a result of our restructuring initiatives, we recorded charges of $11.3 million and $8.7 million, net of adjustments, related to reductions in workforce that are reflected in our results for the nine months ended June 30, 2025 and 2024, respectively.\n25\nTable of Contents\n \nThree months ended\nJune 30,\nNine months ended\nJune 30,\n \n2025\n2024\n2025\n2024\n \n(in thousands, except percentages)\nOther income and income taxes\nIncome from operations\n$\n196,317 \n$\n163,090 \n$\n560,296 \n$\n467,566 \nOther income, net\n16,706 \n8,529 \n32,971 \n24,385 \nIncome before income taxes\n213,023 \n171,619 \n593,267 \n491,951 \nProvision for income taxes\n23,111 \n27,540 \n91,380 \n90,469 \nNet income\n$\n189,912 \n$\n144,079 \n$\n501,887 \n$\n401,482 \nOther income and income taxes (as percentage of net revenue)\nIncome from operations\n25.2 \n%\n23.4 \n%\n24.6 \n%\n22.6 \n%\nOther income, net\n2.1 \n1.3 \n1.4 \n1.2 \nIncome before income taxes\n27.3 \n24.7 \n26.0 \n23.8 \nProvision for income taxes\n3.0 \n4.0 \n4.0 \n4.4 \nNet income\n24.3 \n%\n20.7 \n%\n22.0 \n%\n19.4 \n%\nOther Income, Net.\n The change in other income, net for the three and nine months ended June 30, 2025 was primarily driven by interest income and expense, investment income, and foreign currency transaction gains and losses compared to the same periods in the prior year.\nProvision for Income Taxes. \nThe effective tax rate was 10.8% and 15.4% for the three and nine months ended June 30, 2025, respectively, compared to 16.0% and 18.4% for the three and nine months ended June 30, 2024, respectively. The decrease in the effective tax rate for the three and nine months ended June 30, 2025, as compared to the three and nine months ended June 30, 2024, is primarily due to change in unrecognized tax benefits and tax impact of stock-based compensation.\nWe record a valuation allowance to reduce our deferred tax assets to the amount we believe is more likely than not to be realized. In making these determinations we consider historical and projected taxable income, and ongoing prudent and feasible tax planning strategies in assessing the appropriateness of a valuation allowance. Our net deferred tax assets at June 30, 2025 and September 30, 2024 were $421.9 million and $358.8 million, respectively. The net deferred tax assets include valuation allowances of $32.1 million and $39.7 million as of June 30, 2025 and September 30, 2024, respectively, which are primarily related to certain foreign tax credit carryforwards and certain state net operating loss and tax credit carryforwards.\nOur worldwide effective tax rate may fluctuate based on a number of factors, including variations in projected taxable income in the various geographic locations in which we operate, the impact of stock-based compensation, changes in the valuation of our net deferred tax assets, resolution of potential exposures, tax positions taken on tax returns filed in the various geographic locations in which we operate, and the introduction of new accounting standards or changes in tax laws or interpretations thereof in the various geographic locations in which we operate. We have recorded liabilities to address potential tax exposures related to business and income tax positions we have taken that could be challenged by taxing authorities. The ultimate resolution of these potential exposures may be greater or less than the liabilities recorded, which could result in an adjustment to our future tax expense.\nLiquidity and Capital Resources\nCash and cash equivalents, short-term investments and long-term investments totaled $1,442.0 million as of June 30, 2025, compared to $1,083.2 million as of September 30, 2024, representing an increase of $358.8 million. The increase was primarily due to cash provided by operating activities of $741.6 million for the nine months ended June 30, 2025, partially offset by cash used for the repurchase of common stock, including excise taxes, during the nine months ended June 30, 2025 of $377.1 million. \nCash provided by operating activities for the first nine months of fiscal year 2025 resulted from net income of $501.9 million combined with changes in operating assets and liabilities, as adjusted for various non-cash items including stock-based compensation, deferred revenue, depreciation, impairment and amortization charges. Cash provided by operating activities for the first nine months of fiscal year 2025 increased from the comparable period in the prior year primarily due to an increase in cash received from customers and an increase in deferred revenue.\n26\nTable of Contents\nCash from operations could be affected by various risks and uncertainties, including, but not limited to, the effects of the risks detailed in Part 1, Item 1A, \"Risk Factors\" of our Annual Report on Form 10-K for the fiscal year ended September 30, 2024. However, we anticipate our current cash, cash equivalents and investment balances and anticipated cash flows generated from operations will be sufficient to meet our liquidity needs.\nCash used in investing activities was $55.7 million for the nine months ended June 30, 2025, compared to cash used in investing activities of $53.5 million for the same period in the prior year. Investing activities include purchases, sales and maturities of available-for-sale securities, business acquisitions and capital expenditures. The amount of cash used in investing activities for the nine months ended June 30, 2025 was primarily the result of $27.1 million in capital expenditures related to maintaining our operations worldwide and $24.2 million in cash paid for business acquisitions.\nCash used in financing activities was $337.7 million for the nine months ended June 30, 2025, compared to cash used in financing activities of $355.1 million for the same period in the prior year. Our financing activities for the nine months ended June 30, 2025 primarily consisted of $377.1 million of cash used to repurchase shares of common stock, including excise taxes. In addition, $19.6 million in cash was used for taxes related to net share settlement of equity awards. Cash used in financing activities was partially offset by cash received from the exercise of employee stock options and stock purchases under our employee stock purchase plan of $59.0 million.\nOn January 31, 2020, we entered into a Revolving Credit Agreement (the \"Revolving Credit Agreement\") that provides for a senior unsecured revolving credit facility in an aggregate principal amount of $350.0 million (the \"Revolving Credit Facility\"). On January 31, 2025, the Revolving Credit Facility expired. At the time of expiration, there were no outstanding borrowings under the Revolving Credit Facility.\nObligations and Commitments\nAs of June 30, 2025, our principal commitments consisted of obligations outstanding under operating leases and purchase obligations with one of our component suppliers. \nWe lease our facilities under operating leases that expire at various dates through 2036. There have been no material changes in our principal lease commitments compared to those discussed in Management’s Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the fiscal year ended September 30, 2024.\nIn October 2022, we entered into an unconditional purchase commitment with one of our suppliers for the delivery of systems components. Under the terms of the agreement, we are obligated to purchase $10 million of component inventory annually, with a total committed amount of $40 million over a four-year term. As of June 30, 2025, we had no remaining purchase commitments under the third year of the agreement. Our total non-cancelable long-term purchase commitments outstanding as of June 30, 2025 was $10.0 million.\nWe have a contractual obligation to purchase inventory components procured by our primary contract manufacturer in accordance with our annual build forecast. The contractual terms of the obligation contain cancellation provisions, which reduce our liability to purchase inventory components for periods greater than one year. In order to support our build forecast, we will, from time-to-time prepay our primary contract manufacturer for inventory purchases. \nRecent Accounting Pronouncements\nThe anticipated impact of recent accounting pronouncements is discussed in Note 1 to the accompanying Notes to Consolidated Financial Statements of this Quarterly Report on Form 10-Q."
}