{
  "source_file": "fico-20250930.htm",
  "form_type": "10-K",
  "item1": "Item 1. \nBusiness\nGENERAL\nFair Isaac Corporation (NYSE: FICO) (together with its consolidated subsidiaries, the “Company,” which may also be referred to in this report as “we,” “us,” “our,” and “FICO”) is a global analytics software leader. We were founded in 1956 on the premise that data, used intelligently, can improve business decisions. Today, FICO’s software and the widely used FICO\n®\n Score operationalize analytics, enabling thousands of businesses in more than 80 countries to uncover new opportunities, make timely decisions that matter, and execute them at scale. Most leading banks and credit card issuers rely on our solutions, as do insurers, retailers, telecommunications providers, automotive lenders, consumer reporting agencies, public agencies, and organizations in other industries. We also serve consumers through online services that enable people to access and understand their FICO Scores — the standard measure of consumer credit risk in the United States (“U.S.”) — empowering them to increase financial literacy and manage their financial health. More information about us can be found on our website, www.fico.com. We make our Annual Reports on Forms 10-K, Quarterly Reports on Forms 10-Q, and Current Reports on Forms 8-K, as well as amendments to those reports, available free of charge through our website as soon as reasonably practicable after we electronically file them with the U.S. Securities and Exchange Commission (“SEC”). References to our website address in this report do not constitute an incorporation by reference. Information on our website is not part of this report.\nPRODUCTS AND SERVICES\nOur business consists of two operating segments: Scores and Software.\n \nOur Scores segment includes our business-to-business (“B2B”) scoring solutions and services which give our clients access to predictive credit and other scores that can be easily integrated into their transaction streams and decision-making processes. This segment also includes our business-to-consumer (“B2C”) scoring solutions, including our myFICO.com subscription offerings.\nOur Software segment includes pre-configured analytic and decision management solutions designed for a specific type of business need or process — such as account origination, customer management, customer engagement, fraud detection, and marketing — as well as associated professional services. This segment also includes FICO\n®\n Platform, a modular software offering designed to support advanced analytic and decision use cases, as well as stand-alone analytic and decisioning software that can be configured by our customers to address a wide variety of business use cases. Our offerings are available to our customers as software-as-a-service (“SaaS”) or as on-premises software.\nScores\nOur B2B scoring solutions include the FICO\n®\n Score, which is the standard measure of consumer credit risk in the U.S. It is used in most U.S. credit decisions, by nearly all major banks, credit card issuers, mortgage lenders, and auto loan originators. Our B2B scoring solutions are primarily distributed through major consumer reporting agencies worldwide. Our B2C scores are sold directly to consumers through our myFICO.com website and other direct-to-consumer channels.\nThe FICO\n®\n Score is a three-digit number ranging from 300-850. Our proprietary analytic algorithms are applied to credit data collected and maintained by the three U.S. national consumer reporting agencies — Experian, TransUnion and Equifax — to produce standard scores that are used across the credit lifecycle, including in origination, account management and consumer marketing. Users of our scores generally pay the consumer reporting agencies a fee for each individual score generated by our algorithms, and the consumer reporting agencies pay an associated fee to us. Except for product development using de-personalized data, FICO does not collect or store the consumer credit data used in the calculation of our scores, and in most cases, we do not sell our scores directly to lenders or other end-users.\nSince the introduction of the FICO\n®\n Score in the U.S. in 1989, we have regularly updated the score to take advantage of newly available data and enhanced analytics. FICO\n®\n Score 9 introduced the utilization of reported rental payment history, while also de-emphasizing medical debt and disregarding paid collections. Our most recent and most predictive scores, FICO\n®\n Score 10 and 10 T, were introduced in 2020. To increase its predictive power, FICO Score 10 T builds on FICO Score 10 but also incorporates trended credit data. Trended data considers a longer historical view, giving lenders even more insight into how individuals are managing their credit. Updated versions of our FICO Scores are generally designed to provide greater predictive accuracy than the scores they replace, and to be compatible with prior versions of the FICO Score.\n3\nTable of Contents\nIn addition to the FICO\n®\n Score, we offer several other broad-based scores, including specific FICO\n®\n Industry Scores. For example, in 2021 we introduced Bankcard and Auto Industry versions of FICO\n®\n Score 10. We also develop various custom scores for our financial services clients.\nThe FICO\n®\n Resilience Index offering is designed to complement FICO\n®\n Score models by identifying those consumers who are more resilient to economic stress relative to other consumers within the same FICO Score bands. The FICO Resilience Index is designed to enable lenders to continue to lend and better manage risk by providing a more precise assessment of loan default risk during periods of economic stress.\nFICO has invested significant resources in the development of scores that can help expand credit access and lower borrowing costs for consumers that have limited credit history or who have sparse or inactive credit files. These scores use alternative data sources to enhance conventional consumer reporting agency data and generate scores for otherwise un-scorable consumers and in many cases improve the credit scores of scorable consumers.\n•\nFICO\n®\n Score XD uses public records and property data, and a consumer’s history with mobile phone, landline phone and cable payments, to generate scores on the same 300-850 scale as standard FICO\n®\n Scores. FICO Score XD is available to lenders through our distribution partners, LexisNexis Risk Solutions and Equifax. \n•\nThe UltraFICO\n®\n Score uses consumer-permissioned data such as checking, savings, or money market account data, to generate scores on the same 300-850 scale as standard FICO\n®\n Scores. Incorporating consumer-permissioned data helps empower consumers to establish or improve their creditworthiness by using data that reflects sound financial activity, but that is not part of a conventional credit report.\nBoth scores maintain the same score to risk relationship as standard FICO\n®\n Scores, enhancing their compatibility with existing credit underwriting systems and models.\nOutside the U.S., we offer FICO\n®\n Scores for consumer loans, and in some cases for small and medium business loans. These scores are typically sold to end-users through consumer reporting agencies in those countries, as they are in the U.S. FICO Scores have been made available in over 40 countries and we have also developed client-specific versions of the FICO Score in over ten countries.\nWe also provide FICO\n®\n Scores to consumers in the U.S. through our B2C scoring solutions. These Scores are distributed directly by us through our myFICO.com subscription offering and indirectly through our licensed distribution partners, including Experian and certain lenders through the FICO\n®\n Score Open Access Program. Through myFICO.com and other direct-to-consumer channels, consumers can purchase their FICO Scores, including credit reports associated with the scores, explanations of the factors affecting their scores, and customized educational information on how to manage their scores. Consumers can use products to simulate how taking specific actions could affect their FICO Score. Consumers can also subscribe to credit monitoring, which delivers alerts via email and text when changes to a user’s FICO Scores or other credit report content are detected. In addition, consumers can purchase identity theft monitoring products that alert them to potential risks of identity fraud.\nSoftware\nOur software harnesses the power of analytics and digital decisioning technology to help businesses automate, improve, and connect decisions across their enterprise. Most of our solutions address customer engagement, including acquisition and pricing, onboarding, servicing and management, and fraud protection. We also help businesses improve non-customer facing decisions such as supply chain optimization, scheduling management and policy adherence. \nFICO provides software solutions to business customers in more than 80 countries around the world. Our software can be deployed in the cloud utilizing third-party cloud services, or on-premises using our customers’ IT infrastructure. We typically sell our software as multi-year subscriptions, with payments based on usage metrics such as the number of accounts, transactions or decisioning use cases deployed, often subject to contracted minimum payments. \nA significant and growing number of our software solutions run natively on FICO\n®\n Platform, a modular software offering designed to support advanced analytics and decisioning use cases. While not all our software runs on FICO Platform today, we are continuing to invest significant development resources to enable substantially all of our software to run on FICO Platform in the future.\n4\nTable of Contents\nPrincipal Areas of Expertise\n \nWe specialize in solutions that empower businesses to operationalize analytics to uncover new opportunities, make timely decisions that matter, and execute them at scale. With more than 65 years of analytics and software experience, we have found that bringing human and digital intelligence together allows our customers to target and acquire customers more efficiently, increase customer value, reduce fraud and credit losses, lower operating expenses, and enter new markets more profitably.\nOur principal areas of research and development expertise are focused on the following four analytic domains.\n•\nPredictive Modeling\nPredictive modeling identifies and mathematically represents underlying relationships in historical data to make predictions or classifications about future events. Predictive models typically analyze current and historical data about individuals to produce easily understood metrics such as scores. These scores rank-order individuals or specific transactions against a particular variable such as the likelihood of making credit payments on time, the likelihood of a transaction being fraudulent or the probability of responding to a particular offer for services. Our predictive models are frequently used in mission-critical transactional systems and drive decisions and actions in near real time.\nSeveral analytic methodologies underlie our products in this area. These include proprietary applications of both linear and nonlinear optimization algorithms, advanced neural systems, machine learning and artificial intelligence (“AI”). We also apply various statistical techniques for analysis and pattern detection within large datasets and can derive insights and predictive features from various forms of data, including unstructured data.\n•\nDecision Analysis and Optimization\nDecision analysis refers to the broad quantitative field that deals with modeling, analyzing, and optimizing decisions made by individuals, groups, and organizations. Whereas predictive models analyze multiple aspects of individual behavior to forecast future behavior, decision analysis analyzes multiple aspects of a given decision to identify the most effective action to take to reach a desired result. This is often referred to as prescriptive analytics. Our integrated approach to decision analysis incorporates a decision model that mathematically maps the entire decision structure; proprietary optimization technology that identifies the most effective strategies, given both the performance objective and constraints; testing and simulation required for active, continuous learning; and the robust extrapolation of an optimized strategy to a wider set of scenarios than historically encountered. Our optimization capabilities also include native support for Python modeling, as well as our own proprietary mathematical modeling and programming language, an easy-to-use authoring environment, a configurable business simulation and scenario management interface and a set of pre-built optimization algorithms.\n•\nTransaction Profiling\nTransaction profiling is a patent-protected technique used to extract meaningful information and reduce the complexity of transaction data used in modeling. Many of our products operate using transactional data, such as credit card purchase transactions, consumer interactions, or other types of data that change over time. In its raw form, this data is very difficult to use in predictive models for several reasons. First, an isolated transaction contains very little information about the behavior of the individual who generated the transaction. Second, transaction patterns change rapidly over time. Third, this type of data can often be highly complex. To overcome these issues, we have developed a set of techniques that transform raw transactional data into a mathematical representation that reveals latent information, and which make the data more usable by predictive models. This profiling technology accumulates data across multiple transactions of many types to create and update profiles of transaction patterns. These profiles enable our neural network models to efficiently and effectively make accurate assessments of, for example, fraud risk and credit risk within real-time transaction streams.\n•\nCustomer Data Integration\nDecisions made about customers or prospects can benefit from data stored in multiple sources, both inside and outside the enterprise. In the areas of analytics and digital decisioning, more data is generally better. We have developed proprietary data ingestion and management tools that are able to assemble and integrate disparate data sources into a unified view of the customer, household, or other subject through the application of persistent keying technology. This data can include structured or unstructured data. In addition, our technology can integrate multiple data sources in real-time and make them available for rapid analysis and decisions such as credit approval, fraud detection and “next best offer” workflows.\n5\nTable of Contents\nWe believe our analytic tools and solutions are among the best commercially available, and that we are uniquely positioned to integrate advanced analytic, software and data technologies into mission-critical business solutions that offer superior returns on investment.\nFICO\n®\n Platform\nFICO\n® \nPlatform is an analytic and decisioning environment that empowers businesses to configure solutions that orchestrate and operationalize high velocity decisions that matter, at scale. Users of FICO Platform can bring together data from multiple sources, apply advanced analytics to derive insights, and translate those insights into actions and workflows that can be executed in real-time. Based on a modular cloud architecture, FICO Platform can be configured by our customers to solve a vast array of business challenges. FICO Platform delivers increasing value to our customers over time as they add additional analytic capabilities, configure their own solutions or utilize pre-configured solutions to address a diverse set of use cases and integrate disparate analytic and decisioning silos onto a centralized, scalable platform. This drives additional subscription software revenue for FICO over time as customers purchase more FICO Platform capabilities and pay for more usage of those capabilities.\nOur goal is to move substantially all of FICO’s current software products onto FICO\n®\n Platform. Many capabilities of FICO’s current software products are now part of FICO Platform, addressing use cases such as origination, fraud detection, customer management, and next best action, among others. We believe this strategy of moving our software products to FICO Platform will result in revenue growth through follow-on “land and expand” sales to existing FICO Platform customers and more sales to medium-sized businesses typically served through value-added resellers and systems integrators. \nOur annual recurring revenue (“ARR”) from FICO\n®\n Platform based products was $263.6 million as of September 30, 2025, representing 35% of our total software ARR. For information about ARR, refer to Part II, Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations, Annual Recurring Revenue\n, in this Annual Report on Form 10-K.  \nOur Offerings\nWe sell our software primarily as analytic and decisioning software or pre-configured solutions. Our software offerings are sold both individually and as integrated bundles of multiple products.\nAnalytic and Decisioning Software\nFICO analytic and decisioning software offerings use proprietary and open source microservices and capabilities to enable both business users and data scientists to develop and execute advanced analytics and decision modeling. Our key products in this category include:\n•\nFICO\n®\n Decision Modeler and FICO\n®\n Blaze Advisor\n®\n are our core decision rules modeling tools, which enable users to flexibly author and manage decision rules and strategies. FICO Decision Modeler delivers the functionality of our industry leading FICO Blaze Advisor product, with the added benefit of seamless integration into FICO\n®\n Platform. FICO Blaze Advisor, the predecessor to FICO Decision Modeler, is available as an off-platform product.\n•\nFICO\n®\n Xpress Optimization provides operations research professionals and business analysts with world-class solvers and productivity tools to determine optimal outcomes for a wide range of industry problems. FICO Xpress Optimization includes a powerful modeling and programming language to quickly model and solve even the largest optimization problems. FICO Xpress Optimization runs on FICO\n®\n Platform.\n•\nFICO\n®\n Analytics Workbench is a predictive analytics tool that allows businesses to create and deploy explainable machine learning models for use in decisions that typically require strict governance and compliance, often including regulatory oversight. FICO Analytics Workbench runs on FICO\n®\n Platform.\n•\nFICO\n®\n Data Orchestrator is a data retrieval and mapping solution that can access, gather, and transform data from corporate or public facing information services. FICO Data Orchestrator runs on FICO\n®\n Platform.\n•\nFICO\n®\n DMP Streaming is a real-time and batch data ingestion solution that uniquely delivers in-stream analytics for real-time data insights and complex event processing.\n•\nFICO\n®\n Business Outcome Simulator enables business users to run a wide variety of insightful scenarios to assess how their business is likely to perform under varying conditions and assumptions. It unlocks insights into how key outcomes will likely shift in the face of changing competitor strategy, macroeconomic changes, evolving customer preferences, and more. FICO Business Outcome Simulator runs on FICO\n®\n Platform.\n6\nTable of Contents\n•\nFICO\n®\n Decision Optimizer helps business users understand how different customers will react to a variety of different actions that are being considered. Once that link is understood, FICO Decision Optimizer identifies the combination of actions most likely to lead to the desired portfolio outcomes through decisions such as who to offer a new product, what limit and/or price to offer, or how to treat delinquent customers. FICO Decision Optimizer runs on FICO\n®\n Platform.\nPre-Configured Solutions\nFICO's pre-configured solutions optimize customer interactions in real-time, driving greater customer engagement and improving business results. They enable acquisition and growth marketing, account activation and management, omni-channel communication, risk assessment, and fraud detection and prevention. Key FICO solutions currently offered include:\n•\nFICO\n®\n Fraud Solutions empower organizations to safeguard the business and their customers from payments fraud and application fraud. Leveraging advanced analytic capabilities on a large scale and in real-time, FICO Fraud Solutions identify fraud and enable strategies designed to prevent fraud across payment cards, money transfers, and instances where stolen or synthetic identities are exploited to open accounts. Our models are continually improved using a proprietary, global data set of transaction data contributed by more than 10,000 institutions that participate in the FICO\n®\n Falcon\n®\n Intelligence Network. Certain Fraud Solutions capabilities are available on FICO\n®\n Platform today, and we plan to make additional Fraud Solutions capabilities available on FICO Platform in the future. \n•\nFICO\n®\n Originations Solution is an application-to-decision credit originations solution. It enables banks, credit unions, finance companies, online lenders, auto lenders, and other companies to automate and improve the processing of requests for credit. Our Originations Solution increases the speed, consistency and efficiency with which requests are handled, reducing losses, and increasing approval rates through the application of sophisticated policies and analytics that assess applicant risk and reduce the need for manual review by underwriters. Originations capabilities are available on FICO\n®\n Platform.\n•\nFICO\n®\n Customer Communication Service is an intelligent omnichannel digital communication manager for resolving customer interactions. It enables businesses to automate individualized customer dialogues with the same consistency and regulatory compliance as their human agents. With Customer Communication Service, businesses can be available 24/7 for one-way or two-way communication through any channel their consumers choose. Businesses can rapidly launch mobile alerts, messaging, virtual agents, self-service options, and other auto-resolution capabilities. It helps make the full customer journey more efficient and raises the level of data-driven digital intelligence behind lifecycle communications. Customer Communication capabilities are available on FICO\n®\n Platform. \n•\nFICO\n®\n Strategy Director and FICO\n®\n TRIAD\n®\n Customer Manager enable businesses to automate and improve risk-based decisions for their existing credit customers. These products help businesses apply advanced analytics in credit account and customer decisions to increase portfolio revenue and reduce risk exposure and losses, while improving customer retention. They also allow users to manage risk and communications at both the account and customer level from a single place. FICO Strategy Director runs on FICO\n®\n Platform. FICO TRIAD Customer Manager, the predecessor to FICO Strategy Director, is available as an off-platform product.\nFICO\n®\n Professional Services\nFICO offers a range of professional services designed to help customers install and configure our software, develop and deploy advanced analytics using our software, and improve customer satisfaction and retention.\n•\nFICO\n®\n Implementation Services. We often sell software implementation and configuration services in conjunction with our on-premises and SaaS subscriptions, and our license sales. The FICO implementation services team leverages their deep expertise in our products and their extensive industry-specific knowledge to help our customers implement and configure FICO software rapidly and effectively.\n•\nFICO\n®\n Analytic Services. We build custom analytics, decision models and related analytics, and perform machine learning projects for clients in multiple industries. These analytic services help to improve critical business processes and operationalize analytics using FICO software products. Most of our engagements utilize predictive analytics, decision modeling and optimization to provide greater insight into customer preferences and help predict future customer behavior.\nOur professional services are sold on an hourly time and materials basis or for a fixed project fee.\n7\nTable of Contents\nMARKETS AND CUSTOMERS\nOur scores and software products and services serve clients in multiple industries, including banking, insurance, retail, healthcare and public agencies. End users of our products include three-quarters of each of the largest 100 financial institutions in the U.S. and the largest 100 banks in the world. Our clients also include more than 600 insurers, including eight of the top ten U.S. property and casualty insurers; more than 300 retailers and general merchandisers; and more than 200 government or public agencies. Seven of the top ten companies on the 2025 Fortune 500 list use one or more of our solutions. In addition, our consumer solutions are marketed to more than 200 million U.S. consumers whose credit relationships are reported to the three major U.S. consumer reporting agencies.\nThe majority of our scores are marketed and sold through consumer reporting agencies. During fiscal 2025, 2024 and 2023, revenues generated from our agreements with Experian, TransUnion and Equifax collectively accounted for 51%, 45% and 41% of our total revenues, respectively. We also sell our scores and credit monitoring directly to consumers through our myFICO.com on-line subscription offerings. Outside of the U.S., we sell our scores through consumer reporting agencies, other third-party distributors, and in some cases directly to large end-users.\nWe market our software products and services primarily through our own direct sales organization that is organized around vertical and geographic markets. Sales teams are based in our headquarters and in field offices strategically located around the world. We also market our products through indirect channels, including alliance partners and other resellers. As more capabilities are made available on FICO\n®\n Platform, we expect our sales through indirect channels to grow. We are investing significant resources to develop our indirect channel relationships. \nOur largest market segment is financial services, representing 92% of our total revenue during fiscal 2025. Our largest geographic market is the Americas, representing 87% of our total revenue during fiscal 2025. \nCOMPETITION\nThe market for our solutions is intensely competitive and is constantly changing. Our competitors vary both in size and in the scope of the products and services they offer. We encounter competition from several sources, including: \n•\nin-house analytic and systems developers; \n•\ndevelopers and providers of neural networks, machine learning, and AI systems;\n•\nfraud solutions providers;\n•\nscoring model builders; \n•\nproviders of credit reports and credit scores, including consumer reporting agencies;\n•\nsoftware companies supplying predictive analytic modeling, rules, or analytic development tools; \n•\nentity resolution and social network analysis solutions providers; \n•\nproviders of customer engagement and risk management solutions; \n•\nproviders of account workflow management software;\n•\nbusiness process management and decision rules management providers; \n•\nenterprise resource planning and customer relationship management solutions providers;\n•\nbusiness intelligence solutions providers;\n•\nproviders of automated application processing services; and\n•\nthird-party professional services and consulting organizations.\nWe believe we offer customers a unique mix of products, expertise and capabilities that allows us to compete effectively in our target markets. However, many of our competitors are larger than FICO, have more development, sales and marketing resources than FICO, and some have larger shares of our target geographic or product markets.\n \nWe believe the principal competitive factors affecting our markets include technical performance; access to unique proprietary analytical models and data; product attributes like adaptability, scalability, interoperability, functionality, and ease-of-use; on-premises and SaaS product availability; product price; customer service and support; the effectiveness of sales and marketing efforts; existing market penetration; and reputation. Although we believe our products and services compete favorably with respect to these factors, we may not be able to maintain our competitive position against current and future competitors.\n8\nTable of Contents\nScores \nIn our Scores segment, we compete with both outside suppliers and in-house analytics. Primary competitors among outside suppliers of scoring models are the three major consumer reporting agencies in the U.S. and Canada, which are also our partners in offering our scoring solutions, and VantageScore (a joint venture entity established by the three major U.S. consumer reporting agencies), which is selling a credit scoring product competitive with our products. Additional competitors include consumer reporting agencies outside the U.S. like CRIF Ratings, which operates in the European Union, and other data providers like LexisNexis and ChoicePoint, some of which also are our partners.\nFor our offerings that deliver credit scores, credit reports and consumer credit education solutions directly to consumers, we compete with other direct to consumer credit and identity services such as Credit Karma, Credit Sesame, Experian and TransUnion, some of which are also our partners. \nSoftware\nThe competition in our Software segment varies by application. In the fraud solutions market for banking, we compete primarily with Nice Actimize, Experian, Pegasystems, BAE Systems Applied Intelligence, SAS, ACI Worldwide, IBM, Feedzai and Featurespace. In the customer origination market, we compete with Experian, Equifax, Moody’s, Meridian Link, and CGI, among others. In the customer management market, we compete with Experian and SAS, among others. In the marketing services market, we compete with Pegasystems, Equifax, Experian, SAS, Adobe and Salesforce, among others. In the decision platform market, we compete with Pegasystems, IBM and SAS, among others.\nPRODUCT PROTECTION AND TRADEMARKS\nWe rely on a combination of patent, copyright, trademark and trade secret laws and confidentiality agreements and procedures to protect our proprietary rights.\nWe retain the title to and protect the suite of models and software used to develop scoring models as a trade secret. We also restrict access to our source code and limit access to and distribution of our software, documentation, and other proprietary information. We have generally relied upon the laws protecting trade secrets and upon contractual nondisclosure safeguards and restrictions on transferability to protect our software and proprietary interests in our product and service methodology and know-how. Our confidentiality procedures include invention assignment and proprietary information agreements with our employees and independent contractors, and nondisclosure agreements with our distributors, strategic partners, and customers. We also claim copyright protection for certain proprietary software and documentation.\nWe have patents on many of our technologies and have patent applications pending on other technologies. The patents we hold may not be upheld as valid and may not prevent the development of competitive products. In addition, patents may never be issued on our pending patent applications or on any future applications that we may submit.  As of September 30, 2025, we held 204 U.S. and 26 foreign patents, with 79 applications pending.\nDespite our precautions, it may be possible for competitors or users to copy or reproduce aspects of our software or to obtain information that we regard as trade secrets. In addition, the laws of some foreign countries do not protect proprietary rights to the same extent as do the laws of the U.S. Patents and other protections for our intellectual property are important, but we believe our success and growth will depend principally on such factors as the knowledge, ability, experience and creative skills of our personnel, new products, frequent product enhancements and name recognition. \nWe have developed technologies for research projects conducted under agreements with various U.S. government agencies or their subcontractors. Although we have acquired commercial rights to these technologies, the U.S. government typically retains ownership of intellectual property rights and licenses in the technologies that we develop under these contracts. In some cases, the U.S. government can terminate our rights to these technologies if we fail to commercialize them on a timely basis. In addition, under U.S. government contracts, the government may make the results of our research public, which could limit our competitive advantage with respect to future products based on funded research. \nWe have used, registered and/or applied to register certain trademarks and service marks for our technologies, products and services. As of September 30, 2025, we had 23 trademarks registered in the U.S. and select foreign countries.\n9\nTable of Contents\nGOVERNMENTAL REGULATION\nWe are subject to a number of U.S. federal, state, local and foreign laws and regulations that involve matters central to our business. Laws and governmental regulation affect how our business is conducted and, in some cases, subject us to the possibility of government supervision or enforcement and future lawsuits arising from our products and services. Laws and governmental regulations also influence our current and prospective customers’ activities, as well as their expectations and needs in relation to our products and services. Laws and regulations that may affect our business and our current and prospective customers’ activities include, but are not limited to, those summarized below.\nMany U.S. and foreign jurisdictions have passed, or are currently contemplating, a variety of consumer protection, data privacy, and cyber and data security laws and regulations that may relate to our business or the business of our customers or affect the demand for our products and services. For example, the General Data Protection Regulation (the “GDPR”) in the United Kingdom (“U.K.”) and the European Union (“E.U.”) imposes, among other things, strict obligations and restrictions on the collection and use of U.K. and E.U. personal data, a requirement for prompt notice of data breaches in certain circumstances, a requirement for implementation of certain approved safeguards (such as the use of approved “standard contractual clauses” and the performance of appropriate data transfer impact assessments) for transfers of personal data to other countries that have not been determined by the E.U. or the U.K. to provide adequate data privacy protections, and possible substantial fines for any violations. Our implementation of processes to meet such requirements for affected data flows, which may involve interpretive issues, and may have an adverse impact on cross-border transfers of personal data, may subject us or our customers to additional scrutiny from E.U. and U.K. regulators or may increase our costs of compliance associated with maintaining appropriate certifications, performing any necessary assessments, engaging in contract negotiations with third parties and implementing approved standard contractual clauses, and/or (if appropriate) localizing certain data processing activities. Numerous other countries have introduced and, in some cases, enacted, similar data privacy and cyber and data security laws.\nThe California Consumer Privacy Act of 2018 (“CCPA”) gives California residents certain privacy rights in the collection and disclosure of their personal information and requires businesses to make certain disclosures and take certain other acts in furtherance of those rights. Additionally, effective January 1, 2023, the California Privacy Rights Act (the “CPRA”) revised and significantly expanded the scope of the CCPA. The CPRA also created a new agency, the California Privacy Protection Agency, authorized to implement and enforce the CCPA and the CPRA. Numerous other U.S. states have passed similar privacy laws, and other states are considering such legislation.\nThe Gramm-Leach-Bliley Act (\"GLBA\") regulates, among other things, the receipt, use, disclosure, and security of non-public personal information of consumers held by “financial institutions” and applies indirectly to companies that provide services to financial institutions. As a provider of services to financial institutions, portions of our business are subject to obligations to comply with certain GLBA provisions, including limitations on the use or disclosure of the underlying data and rules relating to the technological, physical and administrative safeguarding of non-public personal information.\nThe Health Insurance Portability and Accountability Act of 1996, as amended by the American Recovery and Reinvestment Act of 2009 (“HIPAA”) and the Health Information Technology for Economic and Clinical Health Act (“HITECH”), and their respective implementing regulations impose specified requirements relating to the privacy, security and transmission of individually identifiable health information. Among other things, HITECH makes HIPAA’s security standards directly applicable to “business associates.” We function as a business associate for certain of our customers that are HIPAA-covered entities and service providers and, in that context, we are regulated as a business associate for the purposes of HIPAA.\nThe Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”) prohibits unfair, deceptive, or abusive acts or practices (“UDAAP”) with respect to the offering of consumer financial products and services and provides the Consumer Financial Protection Bureau (the “CFPB”) with authority to enforce those provisions as well as certain enumerated federal consumer financial laws. In certain circumstances, the CFPB also has examination and supervision powers with respect to service providers who provide a material service to a covered financial institution offering consumer financial products and services. Further, the CFPB has authority to issue rules designating non-depository “larger participants” in certain markets for consumer financial services and products for purposes of the CFPB’s supervisory authority under the Dodd-Frank Act, which the CFPB has done for several markets including the consumer reporting market. Such designated “larger participants” are subject to reporting and on-site compliance examinations by the CFPB, which may result in increased compliance costs and potentially greater enforcement risks based on these supervisory activities. In addition, the laws and regulations issued by U.S. and foreign regulators of some of our largest financial institution customers may require them to flow down certain contractual obligations, exercise greater oversight, and perform more rigorous audits of their key service providers such as us.\n10\nTable of Contents\nThe Federal Trade Commission Act (the “FTC Act”) prohibits unfair methods of competition and unfair or deceptive acts or practices. Under the FTC Act, the FTC’s jurisdiction includes the ability to bring enforcement actions based on the security measures we employ to safeguard the personal data of consumers. Allegations that we failed to safeguard or handle such data in a reasonable manner may subject us to regulatory scrutiny or enforcement action.\nThe U.S. Fair Credit Reporting Act (the “FCRA”) applies to consumer reporting agencies, as well as data furnishers, and users of consumer reports such as banks and other companies, many of which are our customers. The FCRA provisions govern the accuracy, fairness and privacy of information in the files of consumer reporting agencies that engage in the practice of assembling or evaluating information relating to consumers for certain specified purposes. The FCRA limits the type of information that may be reported by consumer reporting agencies, limits the distribution and use of consumer reports, establishes consumer rights to access and dispute their own credit files, includes provisions designed to prevent identity theft and assist fraud victims, requires consumer reporting agencies to make a free annual credit report available to consumers and imposes many other requirements on consumer reporting agencies, data furnishers and users of consumer report information. These requirements can affect the manner and extent to which our customers use our products and services.\nA number of states have enacted requirements similar to the FCRA. Some of these state laws impose additional, or more stringent, requirements than the FCRA, especially in connection with investigations and responses to reported inaccuracies in consumer reports. The FCRA preempts some of these state laws, but the scope of preemption continues to be defined by the courts. Various consumer credit laws and regulations in the foreign countries where we conduct business also affect the products and services we offer to our customers.\nThe Credit Repair Organizations Act (the “CROA”) regulates companies that claim to be able to assist consumers in improving their credit standing. There have been efforts to apply the CROA to credit monitoring services offered by consumer reporting agencies and others, which may impact certain of our products and services.\nSpecial requirements may apply to us when providing services directly or indirectly to U.S. federal, state and local government agencies. The applicable requirements depend upon the monetary value of the awarded contract, the particular government agency awarding or funding the contract, the scope of services to be delivered, and the level of access that the agency will need to provide to us to enable us to perform the contract. For example, we may need to abide by the Privacy Act of 1974, the Internal Revenue Service’s Publication 4812, and the Federal Acquisition Regulation and associated supplemental contract clauses. Each of these laws, regulations and contract clauses imposes certain requirements, including measures for the protection of personal information or information that is otherwise categorized as sensitive by the government. Government agencies frequently modify or supplement these requirements, and consequences for violations of applicable requirements may include penalties, civil liability and for severe infractions, criminal liability.\nThere has been an increased focus on laws and regulations related to our business and the business of our customers relating to policy concerns regarding the operation of consumer reporting agencies, the use and accuracy of credit and alternative data, the costs of consumer reports and credit scores, the use of credit scores and fair lending, and the use, transparency, and fairness of algorithms, AI, and machine learning in business processes.\nThe European Commission has finalized the EU AI Act, which establishes requirements for the provision and use of products that leverage AI systems, including in credit scoring. The EU AI Act entered into force on August 1, 2024 and its provisions take effect between six and 36 months after that date, with most of those provisions becoming effective in 2026. Other countries, as well as the executive branch of the U.S. government and a number of U.S. states, are considering or have implemented laws, regulations, or standards applicable to AI technologies.\nAdditional laws and regulations in the U.S. and abroad that may affect our business and our current and prospective customers’ activities include, but are not limited to, those in the following significant regulatory areas:\n•\nLaws and regulations that limit the use of credit scoring models (e.g., state “mortgage trigger” or “inquiries” laws, state insurance restrictions on the use of credit-based insurance scores, and the E.U. Consumer Credit Directive).\n•\nFair lending laws (e.g., the Equal Credit Opportunity Act and Regulation B, and the Fair Housing Act) and laws and regulations that may impose requirements relating to algorithmic fairness or accountability.\n•\nLaws and regulations related to data and cybersecurity, such as the Cybersecurity Act of 2015; the U.S. Department of Commerce’s National Institute of Standards and Technology’s Cybersecurity Framework; the Clarifying Lawful Overseas Use of Data Act; cyber incident notice requirements for banks and their service providers under rules and regulations issued by federal banking regulators; cybersecurity incident disclosure requirements for public companies under regulations issued by the SEC; and identity theft, file freezing, and similar state privacy laws.\n•\nLaws and regulations related to extension of credit to consumers through the Electronic Fund Transfers Act and Regulation E, as well as non‑governmental VISA and MasterCard electronic payment standards.\n11\nTable of Contents\n•\nLaws and regulations applicable to secondary market participants (e.g., The Federal National Mortgage Association (“Fannie Mae”) and The Federal Home Loan Mortgage Corporation (“Freddie Mac”)) that could have an impact on our scoring products and revenues, including 12 CFR Part 1254 (Validation and Approval of Credit Score Models) issued by the Federal Housing Finance Agency in accordance with Section 310 of the Economic Growth, Regulatory Relief, and Consumer Protection Act (Public Law 115-174), and any regulations, standards or criteria established pursuant to such laws or regulations, including the ongoing validation and approval of the use of the FICO\n®\n Score by Fannie Mae, Freddie Mac, and the Federal Housing Finance Agency.\n•\nLaws and regulations applicable to our customer communication clients and their use of our products and services (e.g., the Telemarketing Sales Rule, the Telephone Consumer Protection Act, the CAN-SPAM Act, the Fair Debt Collection Practices Act, and regulations promulgated thereunder, and similar state laws and similar laws in other countries).\n•\nLaws and regulations applicable to our insurance clients and their use of our insurance products and services.\n•\nThe application or extension of consumer protection laws, including implementing regulations (e.g., the Consumer Financial Protection Act, the Truth In Lending Act and Regulation Z, the Fair Debt Collection Practices Act and Regulation F, the Servicemembers Civil Relief Act, and the Military Lending Act, and similar state consumer protection laws).\n•\nLaws and regulations governing the use of the Internet and social media, telemarketing, advertising, endorsements and testimonials.\n•\nAnti-money laundering laws and regulations (e.g., the Bank Secrecy Act and the USA PATRIOT Act).\n•\nLaws and regulations restricting transactions with sanctioned parties and regarding export controls as they apply to FICO products delivered in non-U.S. countries or to foreign nationals (e.g., Office of Foreign Asset Control sanctions and Export Administration Regulations).\n•\nFinancial regulatory standards (e.g., Sarbanes-Oxley Act requirements to maintain and verify internal process controls, including controls for material event awareness and notification).\n•\nLaws and regulations that apply to outsourcing of services by our clients, and that set forth requirements for managing third parties (e.g., vendors, contractors, suppliers and distributors).\n•\nLaws and regulations relating to the environmental, social and governance, or sustainability, practices of companies, including enhanced climate-related disclosure requirements from regulators, such as California’s climate disclosure rules and the E.U.’s Corporate Sustainability Reporting Directive.\nWe are also subject to federal and state laws that are generally applicable to any U.S. business with national or international operations, such as antitrust and unfair competition laws, the Foreign Corrupt Practices Act, the Americans with Disabilities Act, state unfair or deceptive practices acts and various employment laws.\nHUMAN CAPITAL RESOURCES\nOur People\nAs of September 30, 2025, we employed 3,811 persons across 28 countries. Of these, our largest representation included 1,335 (35%) based in the U.S., 1,506 (40%) based in India and 271 (7%) based in the U.K. Other than to the extent mandated by applicable law in certain foreign jurisdictions, none of our employees are covered by a collective bargaining agreement, and no work stoppages were experienced during fiscal 2025.\nOur Board of Directors (our “Board”) and executive leadership team believe that our people are vital to our success. The Leadership Development and Compensation Committee (the “LDCC”) of our Board oversees all human capital management policies, programs, and strategies, including but not limited to those regarding talent recruitment, development, retention, succession planning, health and safety, organizational culture, employee engagement, diversity, and compensation and benefit programs.\n \nThe LDCC also periodically reviews and reports to the Board with respect to succession planning for our Chief Executive Officer and other senior management positions. In addition, our Chief Human Resources Officer reports to our Board periodically on people-focused programs.\n12\nTable of Contents\nEmployee Engagement\nFor the past decade, we have conducted quarterly workforce surveys to measure employee engagement and gain feedback and insights from our people about ways to improve the employee experience and the effectiveness of our business operations. Detailed findings from these surveys are promptly communicated to all employees, individual managers, the executive team and our Board and the findings are leveraged to drive positive organizational change. We involve designated human resources business partners and learning consultants who work with senior leaders to explore findings, identify high value actions and amplify messaging to help our people understand how survey participation can connect to positive change. \nExamples of organizational changes that have been driven by the insights from these surveys include investments in expanded workforce capacity, broadened and more frequent company-wide communications, increased employee stock ownership by significantly expanding the recipients of equity-based awards and encouraging all employees to take advantage of our Employee Stock Purchase Plan, expanded benefit programs including paid parental leave, well-being, family building, childcare reimbursement and company-funded transportation programs, enhanced incentive plan funding, and expanded investments in professional development targeting leadership and technical skills, as well as initiatives to promote a culture where all employees feel welcome at work.\nOur engagement scores have steadily strengthened and we have enjoyed strong workforce retention over the past year. Each of 22 engagement driver scores from our most recent surveys are at or above our external benchmark scores. \nOrganizational Culture\nFICO is committed to building and reinforcing a culture where all employees feel welcome and where individual perspectives are valued. FICO believes that a highly talented workforce that includes people with a wide range of backgrounds, experiences and perspectives drives innovation while helping us relate to our global customer base. Our goal is to achieve this innovation and connection to our customer base through a culture that attracts the broadest talent audience possible, while always striving to select the most qualified individuals. We also believe that promoting a culture where each individual is truly valued allows our people to reach their full potential. \nOur FICO Cares organization encourages our people to connect with and contribute to their community. We encourage employees to participate in volunteer activities by providing work schedule flexibility and paid Community Volunteer Leave. We also encourage and match employee cash donations and volunteer time to qualified charitable organizations through our Corporate Matching Gift Program.\nAcross our global workforce, as of September 30, 2025, the percentage of males and females was 67% and 33%, respectively. Looking at our U.S. workforce, as of September 30, 2025, 46% were racially/ethnically diverse employees who are members of a protected class.\nAdditional information on our talent programs is available on the Corporate Responsibility page of our website at \nwww.fico.com/en/corporate-responsibility\n. Information contained on our website is not deemed part of or incorporated by reference into this Annual Report on Form 10-K.\nTalent Recruitment\nWe leverage organizational culture as a competitive advantage in our efforts to attract people from the broadest possible talent pool. We deploy selection practices designed to ensure strong alignment between candidate qualifications and knowledge and skills needed for success in each role, and we invest in hiring manager training focused on effective selection strategies. Further, in the U.S., we detail our targeted base pay ranges on all public job postings and prohibit our recruiters from inquiring about a candidate’s current level of compensation. Our focus on the professional development of our people drives the internal posting of virtually all job opportunities. And, consistent with our remarkably low undesired attrition rate, FICO has significantly strengthened its position as an employer of choice, resulting in attractive external candidate pools.\nProfessional Development\nTo support professional development, we offer a structured onboarding program with training specific to a variety of identified career paths to help new employees become rapidly engaged and productive. We have invested in building the FICO Integrated Learning Organization (“ILO”), which is led by our Chief Learning Officer. The ILO develops customized learning content for colleagues, clients and partners around the world. We deliver high quality, targeted new hire onboarding, technology and product skill training, compliance and management and leadership education through this “FICO Learning” platform. This allows our employees to obtain the knowledge and skills to effectively perform in their current roles, while also preparing them for new opportunities. We also offer financial support for degreed or certificated programs through a tuition reimbursement program.\n13\nTable of Contents\nWe have defined specific career paths for all major functions in our organization so that our people understand how they can progress in their career by expanding their knowledge and skills. In doing so, our job titling system reflects both individual contributor (or technical) career tracks and people management career tracks to reinforce our philosophy that people can grow professionally in either track.  \nTo further consistent administration, we conduct annual company-wide performance reviews supported by the use of performance rubrics for each major function. These rubrics set forth clear behavioral expectations for each function through a set of objective descriptors organized across our three levels of performance (Improvement Needed, Achieved Expectations, and Outstanding). In addition to rubrics, outcome-based goals are established for each individual based upon his/her specific role and priorities. Evaluation across both behavioral and outcome-based dimensions yields an overall performance assessment.\nWe define a “promotion” as an increase in pay band linked to the proven ability to be successful in the next level of responsibility. Our structured promotion process takes place twice annually with promotions to all job levels including senior job levels occurring with our year-end cycle (October/November) and promotions to lower and middle job levels taking place with our mid-year cycle (April/May). This process supports an integrated approach yielding improved consistency in promotion decisions, including that all groups are representatively recognized. Approximately 25% of our people are recognized via promotion each year.\nSuccession Planning\nOur Board spends considerable time each year reviewing CEO and key leadership succession and development plans. These discussions include an annual dedicated review of CEO succession, as well as discussions at multiple meetings, including in executive session as needed, regarding broader key leader succession, organizational health and scenario planning in the event of unexpected leadership changes. The Board also has regular and direct exposure to senior leadership and high potential officers through formal and informal avenues throughout the year. Beyond the C-suite, we actively assess talent across the organization to optimize deployment of resources, encourage professional development, drive accountability, and identify and take actions to mitigate undesired attrition risk. At the mid-point of each fiscal year, talent assessments are performed by people managers for each team member. These assessments include a mid-year performance rating and a leadership strength rating, the combination of which yields a Talent Management Score ranging from one to nine with recommended follow-up actions associated with each score. In addition, managers identify any significant attrition risks and underlying drivers and develop related mitigation plans. Finally, for each senior leader role, managers identify potential successor candidates along with targeted development needs to encourage readiness.\nFor vice president-level roles, the executive team plays a central role through a process we refer to as “Session C.” This process involves a detailed evaluation of each vice president incumbent using several tools including a personal biography written by the incumbent identifying key accomplishments, career growth aspirations, and champions that can articulate their contributions. In addition, managers complete a Leader Profile for each vice president incumbent highlighting key strengths, development progress over the past year, go-forward development plans, attrition risks and drivers, and succession insights. All of these materials are centrally reviewed and discussed by the executive team during a multi-day meeting. After discussing incumbent vice presidents, the executive team evaluates any proposed candidates for promotion to vice president using a combination of promotion recommendation forms prepared by the sponsoring manager, a 360-degree performance evaluation involving self-evaluation, manager evaluation, direct report evaluation, and insights gathered from key stakeholders.  Candidates for vice president-level promotion are placed “on-deck” for a one- to three-year period for observation prior to any promotion decision being finalized. This approach drives high quality, consistent decisions while ensuring our highest potential candidates are properly developed and ready when promoted.\nCompensation and Benefit Programs\nWe regularly participate in market-based compensation surveys, seek the advice of outside experts, and leverage new hire, peer equity, and unplanned attrition trend data to ensure that our base pay and incentive structures are competitive. We create a strong sense of shared purpose by having our CEO and each member of our executive leadership team participate in the same annual cash incentive bonus design as all non-sales employees across our organization.\nBeyond our structured promotion cycles, all compensation actions are determined in November following the conclusion of the year-end performance review process in October. This includes promotion and market-based base pay adjustments, annual bonus awards, and long-term incentive awards. This rewards-planning cycle ensures strong linkage between performance and rewards, and it allows for centralized review and refinement of reward recommendations leading to high quality and representative decisions.\n14\nTable of Contents\nOver the course of the past decade, we’ve steadily and significantly expanded participation in our annual performance-based equity program from 7% to just over 33% of our workforce. In addition, we offer an Employee Stock Purchase Plan for eligible employees, which is designed to promote even broader equity participation.\nWe offer competitive health and welfare benefit plans with significant company subsidies to offset premiums, retirement plans with a competitive company match to encourage participation and flexible paid-time-off programs including vacation, sick time and disability time. We have paid Maternity and Parental Leave benefits totaling up to 12 weeks, and we have adopted a Well-Being Program designed to provide broad-based physical and mental health education and personal health coaching, as well as quarterly cash Wellness Awards designed to help employees fund wellness-related purchases which they find most valuable. In addition, we have a global Family Building Benefit program, which provides infertility, cryopreservation, surrogacy and adoption support services. In India, we have a Childcare Reimbursement program to assist parents of young children.\nPromoting a Healthy and Safe Work Environment\nWe are committed to providing a safe and healthy workplace. We continuously strive to meet or exceed compliance with all laws, regulations and accepted practices pertaining to workplace safety. All employees and contractors are required to comply with established safety policies, standards, and procedures.\nWe foster a healthy work/life balance for our people including both remote and hybrid work location policies that provide significant flexibility surrounding work location and work schedules.\n15\nTable of Contents\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nOur executive officers as of September 30, 2025 were as follows:\nName\nPositions Held\nAge\nWilliam J. Lansing\nJanuary 2012–present, Chief Executive Officer and member of the Board of Directors of the Company. February 2009–November 2010, Chief Executive Officer and President, Infospace, Inc. 2004–2007, Chief Executive Officer and President, ValueVision Media, Inc. 2001–2003, General Partner, General Atlantic LLC. 2000–2001, Chief Executive Officer, NBC Internet, Inc. 1998–2000, President/Chief Executive Officer, Fingerhut Companies, Inc. 1996–1998, Vice President, Corporate Business Development, General Electric Company. 1996, Executive Vice President, Chief Operating Officer, Prodigy, Inc. 1986–1995, various positions, McKinsey & Company, Inc.\n67\nSteven P. Weber\nMay 2023–present, Executive Vice President, Chief Financial Officer of the Company. January 2023–May 2023, Vice President, Interim Chief Financial Officer of the Company. March 2021–January 2023, Vice President, Treasurer, Tax and Investor Relations of the Company. November 2010–March 2021, Vice President of Investor Relations and Treasurer of the Company. April 2003–November 2010, various positions with the Company. September 2001–April 2003, Senior Financial Analyst, Metris Companies. 1990–2001, various positions, Foodservice News.\n62\nNikhil Behl\nMarch 2025–present, President, Software of the Company. July 2024–March 2025, Executive Vice President, Software of the Company. August 2023–July 2024, Executive Vice President, Chief Marketing Officer of the Company. April 2014–August 2023, Vice President, Chief Marketing Officer of the Company. October 2013–April 2014, Consultant to the Company. February 2012–October 2013, Chief Executive Officer of Supplizer. August 2011–January 2012, Chief Executive Officer of Zoostores.com. July 2010–August 2011, Chief Executive Officer, Mercantila Business Unit of Infospace. 2007–2010, Chief Merchandising Officer of Mercantila. 1995–June 2007, various positions, including VP Sales & Operations and VP Sales & Customer Service, Home & Home Office Store of Hewlett Packard.\n51\nThomas A. Bowers\nAugust 2020–present, Executive Vice President, Corporate Strategy of the Company. September 2019–August 2020, Vice President, Business Consulting of the Company. April 2018–September 2019, Founder and Managing Partner, M Cubed Development, LLC. August 2012–March 2018, Executive Vice President, American Savings Bank. 1987–2012, Senior partner and various positions, McKinsey & Company, Inc.\n70\nRichard S. Deal\nNovember 2015–present, Executive Vice President, Chief Human Resources Officer of the Company. August 2007–November 2015, Senior Vice President, Chief Human Resources Officer of the Company. January 2001–August 2007, Vice President, Human Resources of the Company. 1998–2001, Vice President, Human Resources, Arcadia Financial, Ltd. 1993–1998, managed broad range of human resources corporate and line consulting functions with U.S. Bancorp.\n58\nMichael S. Leonard\nNovember 2011–present, Vice President, Chief Accounting Officer of the Company. November 2007–November 2011, Senior Director, Finance of the Company. July 2000–November 2007, Director, Finance of the Company. 1998–2000, Controller of Natural Alternatives International, Inc. 1994–1998, various audit staff positions at KPMG LLP.\n60\nMark R. Scadina\nFebruary 2009–present, Executive Vice President, General Counsel and Corporate Secretary of the Company. June 2007–February 2009, Senior Vice President, General Counsel and Corporate Secretary of the Company. 2003–2007, various senior positions including Executive Vice President, General Counsel and Corporate Secretary, Liberate Technologies, Inc. 1999–2003, various leadership positions including Vice President and General Counsel, Intertrust Technologies Corporation. 1994–1999, Associate, Pennie and Edmonds LLP.\n56\n16\nTable of Contents",
  "item7": "Item 7.\n \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nOur Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) includes the following: a business overview that provides a high-level summary of our strategies and initiatives, highlights from fiscal year 2025 and key performance metrics for our Software segment; a more detailed analysis of our results of operations; our capital resources and liquidity, which discusses key aspects of our statements of cash flows, changes in our balance sheets and our financial commitments; and a summary of our critical accounting estimates that involve a significant level of estimation uncertainty. Our MD&A should be read in conjunction with Item 8, \nFinancial Statements and Supplementary Data\n, of this Annual Report on Form 10-K. The following discussion contains forward-looking statements that are subject to risks and uncertainties. Actual results may differ from those referred to herein due to a number of factors, including but not limited to risks described in Item 1A, \nRisk Factors\n, in this Annual Report on Form 10-K.\nOur MD&A focuses on discussion of year-over-year comparisons between fiscal 2025 and fiscal 2024. Discussion of fiscal 2023 results and year-over-year comparisons between fiscal 2024 and fiscal 2023 that are not included in this Annual Report on Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended September 30, 2024.\nBUSINESS OVERVIEW\nStrategies and Initiatives\nIn fiscal 2025, our B2B scoring solutions, including the flagship FICO\n®\n Score, continued to be the standard measure of consumer credit risk in the U.S. The adoption of our most predictive scores, FICO\n®\n Score 10 and FICO\n®\n Score 10 T, gained increased traction for non-conforming mortgages and was approved for conforming mortgages by the Federal Housing Finance Agency for enterprise credit scoring requirements. In addition, we launched FICO® Score 10 BNPL and FICO\n®\n Score 10 T BNPL, the first credit scores from a leading credit scoring provider to incorporate Buy Now, Pay Later (“BNPL”) data. These innovative scores represent a significant advancement in credit scoring, accounting for the growing importance of BNPL loans in the U.S. credit ecosystem. Internationally, we launched a FICO Score in Kenya, which leverages TransUnion data and CreditVision variables to redefine risk management and help expand access to financial services across Kenya. In fiscal 2025, in support of our B2C business and financial inclusion, we launched the FICO\n®\n Score Mortgage Simulator, which is the only simulator in the market built by FICO data scientists and powered by the FICO Score algorithm. We also introduced our Lenders Leading Financial Inclusion program that aims to expand credit access for underserved communities and we hosted free Score A Better Future\n®\n financial education workshops for students and adults from traditionally underserved communities.\nDuring fiscal 2025, the strategy for our Software segment continued to advance and drive growth through our platform-first products. We expanded our FICO\n®\n Platform reach, both by geography and customer type, with the launch of FICO\n®\n Marketplace, enabling organizations to operationalize analytics, power customer connections, and make decisions at scale. Marketplace offers easy access to data, artificial intelligence (“AI”) models, optimization tools, decision rulesets, and machine learning models, which deliver enterprise business outcomes from AI. We continue to innovate and bring new capabilities to FICO Platform, demonstrating its value with new customers and expanding use cases with existing customers and partners. We announced newly granted patents around advancing responsible AI, machine learning, and applied intelligence technology. Additionally, we continue to expand our FICO\n®\n Educational Analytics Challenge program that was created to empower students and help educate the next generation of data scientists.\nWe also continued to enhance stockholder value by returning cash to stockholders through our stock repurchase program. During fiscal 2025, we repurchased 0.8 million shares at a total repurchase price of $1.4 billion.\nHighlights from Fiscal 2025\n•\nTotal revenues were $2.0 billion during fiscal 2025, a 16% increase from fiscal 2024.\n•\nRevenues for our Scores segment were $1.2 billion during fiscal 2025, a 27% increase from fiscal 2024.\n•\nAnnual Recurring Revenue for our Software segment as of September 30, 2025 was $747.3 million, a 4% increase from September 30, 2024.\n•\nDollar-Based Net Retention Rate for our Software segment was 102% as of September 30, 2025.\n•\nOperating income was $924.9 million during fiscal 2025, a 26% increase from fiscal 2024.\n•\nNet income was $651.9 million during fiscal 2025, a 27% increase from fiscal 2024.\n•\nDiluted EPS was $26.54 during fiscal 2025, a 30% increase from fiscal 2024.\n•\nCash flow from operating activities was $778.8 million during fiscal 2025, compared with $633.0 million during fiscal 2024.\n36\nTable of Contents\n•\nCash and cash equivalents were $134.1 million as of September 30, 2025, compared with $150.7 million as of September 30, 2024.\n•\nWe issued $1.5 billion of senior notes and used the net proceeds to repay all the outstanding balances on our term loans. We also amended our credit agreement to increase our borrowing capacity under the unsecured revolving line of credit to $1.0 billion and extended its maturity. Total debt balance was $3.1 billion as of September 30, 2025, compared with $2.2 billion as of September 30, 2024.\n•\nTotal share repurchases during fiscal 2025 were $1.4 billion, compared with $0.8 billion during fiscal 2024.\nKey performance metrics for Software segment\nAnnual Contract Value Bookings (“ACV Bookings”)\nManagement regards ACV Bookings as an important indicator of future revenues, but it is not comparable to, nor is it a substitute for, an analysis of our revenues and other U.S. generally accepted accounting principles (“U.S. GAAP”) measures. We define ACV Bookings as the average annualized value of software contracts signed in the current reporting period that generate current and future on-premises and SaaS software revenue. We only include contracts with an initial term of at least 24 months and we exclude perpetual licenses and other software revenues that are non-recurring in nature. For renewals of existing software subscription contracts, we count only incremental annual revenue expected over the current contract as ACV Bookings.\nACV Bookings is calculated by dividing the total expected contract value by the contract term in years. The expected contract value equals the fixed amount — including guaranteed minimums, if any — stated in the contract, plus estimates of future usage-based fees. We develop estimates from discussions with our customers and examinations of historical data from similar products and customer arrangements. Differences between estimates and actual results occur due to variability in the estimated usage. This variability can be the result of the economic trends in our customers’ industries, individual performance of our customers relative to their competitors, and regulatory and other factors that affect the business environment in which our customers operate. For the periods presented, ACV Bookings related to estimates of future usage-based fees was approximately 30% of the total ACV Bookings amount on an annualized basis. Differences between the initial estimates of future usage-based fees and actual results historically have not been material and we do not currently expect that they will be materially different in the future.\nWe disclose estimated revenue expected to be recognized in the future related to remaining performance obligations in Note 9 to the accompanying consolidated financial statements. However, we believe ACV Bookings is a useful supplemental measure of our business as it includes estimated revenues and future billings excluded from Note 9, such as usage-based fees and guaranteed minimums derived from our on-premises software licenses, among others.\nThe following table summarizes our ACV Bookings during the periods indicated:\nQuarter Ended September 30,\nYear Ended September 30,\n2025\n2024\n2025\n2024\n(In millions)\nTotal on-premises and SaaS software\n$\n32.7 \n$\n22.1 \n$\n102.4 \n$\n84.7 \nAnnual Recurring Revenue (“ARR”)\nAccounting Standards Codification Topic 606, \nRevenue from Contracts with Customers,\n requires us to recognize a significant portion of revenue from our on-premises software subscriptions at the point in time when the software is first made available to the customer, or at the beginning of the subscription term, despite\n \nthe fact that our contracts typically call for billing these amounts ratably over the life of the subscription. The remaining portion of our on-premises software subscription revenue including maintenance and usage-based fees are recognized over the life of the contract. This point-in-time recognition of a portion of our on-premises software subscription revenue creates significant variability in the revenue recognized period to period based on the timing of the subscription start date and the subscription term. Furthermore, this point-in-time revenue recognition can create a significant difference between the timing of our revenue recognition and the actual customer billing under the contract. We use ARR to measure the underlying performance of our subscription-based contracts and mitigate the impact of this variability. ARR is defined as the annualized revenue run-rate of on-premises and SaaS software agreements within a quarterly reporting period, and as such, is different from the timing and amount of revenue recognized. All components of our software licensing and subscription arrangements that are not expected to recur (primarily perpetual licenses) are excluded.\n \nWe calculate ARR as the quarterly recurring revenue run-rate multiplied by four.\n37\nTable of Contents\nThe following table summarizes our ARR for on-premises and SaaS software exiting each of the dates presented:\nDecember 31, \n2023\nMarch 31, \n2024\nJune 30, \n2024\nSeptember 30, 2024\nDecember 31, \n2024\nMarch 31, \n2025\nJune 30, \n2025\nSeptember 30, 2025\nARR \n(In millions)\nPlatform\n$\n190.3\n$\n201.4\n$\n215.1\n$\n227.0\n$\n227.7\n$\n234.7\n$\n254.2\n$\n263.6\nNon-platform\n497.4\n495.6\n494.5\n494.2\n501.6\n479.9\n484.9\n483.7\n    Total\n$\n687.7\n$\n697.0\n$\n709.6\n$\n721.2\n$\n729.3\n$\n714.6\n$\n739.1\n$\n747.3\nPercentage\nPlatform\n28 \n%\n29 \n%\n30 \n%\n31 \n%\n31 \n%\n33 \n%\n34 \n%\n35 \n%\nNon-platform\n72 \n%\n71 \n%\n70 \n%\n69 \n%\n69 \n%\n67 \n%\n66 \n%\n65 \n%\n    Total\n100 \n%\n100 \n%\n100 \n%\n100 \n%\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nYoY Change\nPlatform\n43 \n%\n32 \n%\n31 \n%\n31 \n%\n20 \n%\n17 \n%\n18 \n%\n16 \n%\nNon-platform\n11 \n%\n8 \n%\n3 \n%\n— \n%\n1 \n%\n(3)\n%\n(2)\n%\n(2)\n%\n    Total\n18 \n%\n14 \n%\n10 \n%\n8 \n%\n6 \n%\n3 \n%\n4 \n%\n4 \n%\nDollar-Based Net Retention Rate (“DBNRR”)\nWe consider DBNRR to be an important measure of our success in retaining and growing revenue from our existing customers. To calculate DBNRR for any period, we compare the ARR at the end of the prior comparable quarter (“base ARR”) to the ARR from that same cohort of customers at the end of the current quarter (“retained ARR”); we then divide the retained ARR by the base ARR to arrive at the DBNRR. Our calculation includes the positive impact among this cohort of customers of selling additional products, price increases and increases in usage-based fees, and the negative impact of customer attrition, price decreases, and decreases in usage-based fees during the period. However, the calculation does not include the positive impact from sales to any new customers acquired during the period. Our DBNRR may increase or decrease from period to period as a result of various factors, including the timing of new sales and customer renewal rates.\nThe following table summarizes our DBNRR for on-premises and SaaS software exiting each of the dates presented:\nDecember 31, \n2023\nMarch 31, \n2024\nJune 30, \n2024\nSeptember 30, 2024\nDecember 31, \n2024\nMarch 31, \n2025\nJune 30, \n2025\nSeptember 30, 2025\nDBNRR\nPlatform\n136 \n%\n126 \n%\n124 \n%\n123 \n%\n112 \n%\n110 \n%\n115 \n%\n112 \n%\nNon-platform\n108 \n%\n106 \n%\n101 \n%\n99 \n%\n100 \n%\n96 \n%\n97 \n%\n97 \n%\n     Total\n114 \n%\n112 \n%\n108 \n%\n106 \n%\n105 \n%\n102 \n%\n103 \n%\n102 \n%\nRESULTS OF OPERATIONS\nWe are organized into two reportable segments: Scores and Software. Although we sell solutions and services into a large number of end user product and industry markets, our reportable business segments reflect the primary method in which management organizes and evaluates internal financial information to make operating decisions and assess performance. \nSegment revenues, operating income, and related financial information, including disaggregation of revenue, for the years ended September 30, 2025, 2024 and 2023 are set forth in Note 9 and Note 15 to the accompanying consolidated financial statements.\nRevenues\nThe following tables set forth certain summary information on a segment basis related to our revenues for fiscal 2025, 2024 and 2023:\n \n38\nTable of Contents\n \nYear Ended September 30,\nPeriod-to-Period Change\nPeriod-to-Period\nPercentage Change\nSegment\n2025\n2024\n2023\n2025 to 2024\n2024 to 2023\n2025 to 2024\n2024 to 2023\n \n(In thousands)\n(In thousands)\n \n \nScores\n$\n1,168,575 \n$\n919,650 \n$\n773,828 \n$\n248,925 \n$\n145,822 \n27 \n%\n19 \n%\nSoftware\n822,294 \n797,876 \n739,729 \n24,418 \n58,147 \n3 \n%\n8 \n%\n     Total \n$\n1,990,869 \n$\n1,717,526 \n$\n1,513,557 \n273,343 \n203,969 \n16 \n%\n13 \n%\n \nPercentage of Revenues\nYear Ended September 30,\nSegment\n2025\n2024\n2023\nScores\n59 \n%\n54 \n%\n51 \n%\nSoftware\n41 \n%\n46 \n%\n49 \n%\n      Total\n100 \n%\n100 \n%\n100 \n%\nScores\n \nScores\n segment revenues increased $248.9 million in fiscal 2025 from 2024 due to an increase of $236.7 million in our business-to-business scores revenue and an increase of $12.2 million in our business-to-consumer scores revenue. The increase in business-to-business scores revenue was primarily attributable to a higher unit price, an increase in volume of mortgage originations and a multi-year license renewal in the U.S. recognized on our insurance score product during fiscal 2025. The increase in business-to-consumer scores revenue was primarily attributable to an increase in royalties derived from scores sold indirectly to consumers through consumer reporting agencies.\nSoftware\nThe following table provides information about disaggregated revenue for our Software segment by revenue types:\n \nYear Ended September 30,\nPeriod-to-Period Change\nPeriod-to-Period\nPercentage Change\n \n2025\n2024\n2023\n2025 to 2024\n2024 to 2023\n2025 to 2024\n2024 to 2023\n \n(In thousands)\n(In thousands)\n \n \nOn-premises and SaaS software\n$\n740,145 \n$\n711,340 \n$\n640,182 \n$\n28,805 \n$\n71,158 \n4 \n%\n11 \n%\nProfessional services\n82,149 \n86,536 \n99,547 \n(4,387)\n(13,011)\n(5)\n%\n(13)\n%\nTotal\n$\n822,294 \n$\n797,876 \n$\n739,729 \n24,418 \n58,147 \n3 \n%\n8 \n%\nThe following table provides information about disaggregated revenue for on-premises and SaaS software within our Software segment by timing of revenue recognition:\nYear Ended September 30,\nPeriod-to-Period Change\nPeriod-to-Period\nPercentage Change\n2025\n2024\n2023\n2025 to 2024\n2024 to 2023\n2025 to 2024\n2024 to 2023\n(In thousands)\n(In thousands)\nSoftware recognized at a point in time \n(1)\n$\n90,238 \n$\n76,284 \n$\n72,843 \n$\n13,954 \n$\n3,441 \n18 \n%\n5 \n%\nSoftware recognized over contract term\n (2)\n649,907 \n635,056 \n567,339 \n14,851 \n67,717 \n2 \n%\n12 \n%\nTotal\n$\n740,145 \n$\n711,340 \n$\n640,182 \n$\n28,805 \n71,158 \n4 \n%\n11 \n%\n(1)\nIncludes license portion of our on-premises subscription software and perpetual licenses, both of which are recognized when the software is made available to the customer, or at the start of the subscription. \n(2)\nIncludes maintenance portion and usage-based fees of our on-premises subscription software, maintenance revenue on perpetual licenses, as well as SaaS revenue.\n39\nTable of Contents\nSoftware \nsegment revenues increased $24.4 million in fiscal 2025 from 2024 due to a $28.8 million increase in on-premises and SaaS software revenue, partially offset by a $4.4 million decrease in professional services revenue. The increase in our on-premises and SaaS software revenue was primarily attributable to an increase in revenue recognized over time largely driven by SaaS growth for our Platform products and an increase in license revenue recognized at a point in time due to a large license renewal.\nOperating Expenses and Other Income (Expense), Net\nThe following tables set forth certain summary information related to our consolidated statements of income and comprehensive income for fiscal 2025, 2024 and 2023:\n \nYear Ended September 30,\nPeriod-to-Period Change\nPeriod-to-Period\nPercentage Change\n \n2025\n2024\n2023\n2025 to 2024\n2024 to 2023\n2025 to 2024\n2024 to 2023\n \n(In thousands, except employees)\n(In thousands, except\nemployees)\n \nRevenues\n$\n1,990,869 \n$\n1,717,526 \n$\n1,513,557 \n$\n273,343 \n$\n203,969 \n16 \n%\n13 \n%\nOperating expenses:\nCost of revenues\n353,722 \n348,206 \n311,053 \n5,516 \n37,153 \n2 \n%\n12 \n%\nResearch and development\n188,347 \n171,940 \n159,950 \n16,407 \n11,990 \n10 \n%\n7 \n%\nSelling, general and administrative\n513,028 \n462,834 \n400,565 \n50,194 \n62,269 \n11 \n%\n16 \n%\nAmortization of intangible assets\n— \n917 \n1,100 \n(917)\n(183)\n(100)\n%\n(17)\n%\nRestructuring charges\n10,922 \n— \n— \n10,922 \n— \n— \n%\n— \n%\nGain on product line asset sale\n— \n— \n(1,941)\n— \n1,941 \n— \n%\n(100)\n%\nTotal operating expenses\n1,066,019 \n983,897 \n870,727 \n82,122 \n113,170 \n8 \n%\n13 \n%\nOperating income\n924,850 \n733,629 \n642,830 \n191,221 \n90,799 \n26 \n%\n14 \n%\nInterest expense, net\n(133,647)\n(105,638)\n(95,546)\n(28,009)\n(10,092)\n27 \n%\n11 \n%\nOther income, net\n11,392 \n14,034 \n6,340 \n(2,642)\n7,694 \n(19)\n%\n121 \n%\nIncome before income taxes\n802,595 \n642,025 \n553,624 \n160,570 \n88,401 \n25 \n%\n16 \n%\nProvision for income taxes\n150,649 \n129,214 \n124,249 \n21,435 \n4,965 \n17 \n%\n4 \n%\nNet income\n$\n651,946 \n$\n512,811 \n$\n429,375 \n139,135 \n83,436 \n27 \n%\n19 \n%\nNumber of employees at fiscal year-end\n3,811 \n3,586 \n3,455 \n225 \n131 \n6 \n%\n4 \n%\n \n40\nTable of Contents\n \nPercentage of Revenues\nYear Ended September 30,\n \n2025\n2024\n2023\nRevenues\n100 \n%\n100 \n%\n100 \n%\nOperating expenses:\nCost of revenues\n18 \n%\n20 \n%\n21 \n%\nResearch and development\n9 \n%\n10 \n%\n11 \n%\nSelling, general and administrative\n26 \n%\n27 \n%\n26 \n%\nAmortization of intangible assets\n— \n%\n— \n%\n— \n%\n       Restructuring charges\n1 \n%\n— \n%\n— \n%\nGain on product line asset sale\n— \n%\n— \n%\n— \n%\nTotal operating expenses\n54 \n%\n57 \n%\n58 \n%\nOperating income\n46 \n%\n43 \n%\n42 \n%\nInterest expense, net\n(7)\n%\n(6)\n%\n(6)\n%\nOther income, net\n1 \n%\n1 \n%\n— \n%\nIncome before income taxes\n40 \n%\n38 \n%\n36 \n%\nProvision for income taxes\n7 \n%\n8 \n%\n8 \n%\nNet income\n33 \n%\n30 \n%\n28 \n%\nCost of Revenues\nCost of revenues consists primarily of employee salaries, incentives, and benefits for personnel directly involved in delivering software products, operating SaaS infrastructure, and providing support, implementation and consulting services; overhead, facilities and data center costs; software royalty fees; consumer reporting agency data and processing services; third-party hosting fees related to our SaaS services; travel costs; and outside services.\nThe fiscal 2025 over 2024 increase in cost of revenues of $5.5 million was primarily attributable to an $8.7 million increase in infrastructure and facilities costs, partially offset by a $2.1 million decrease in outside services costs and a $1.4 million decrease in personnel and labor costs. The increase in infrastructure and facilities costs was primarily attributable to an increase in third-party data center hosting costs and an increase in depreciation on data center computer hardware. The decrease in outside services costs was primarily attributable to decreased third-party contractor costs. The decrease in personnel and labor costs was primarily attributable to decreased incentive expense. Cost of revenues as a percentage of revenues decreased to 18\n%\n during fiscal 2025 from 20% during fiscal 2024, primarily due to increased sales of our higher-margin Scores products.\nResearch and Development\nResearch and development expenses include personnel and related overhead costs incurred in the development of new products and services, including research of mathematical and statistical models and development of new versions of Software products.\nThe fiscal 2025 over 2024 increase in research and development expenses of $16.4 million was primarily attributable to a $6.9 million increase in infrastructure and facilities costs, a $5.7 million increase in outside services costs, and a $3.8 million increase in personnel and labor costs. The increase in infrastructure and facilities costs was primarily attributable to increased third-party data center hosting costs and \nthird-party SaaS services costs.\n The increase in outside services costs was primarily attributable to increased third-party contractor costs. The increase in personnel and labor costs was primarily attributable to increased headcount. Research and development expenses as a percentage of revenues decreased to\n 9% \nduring fiscal 2025 from 10% during fiscal 2024.\nSelling, General and Administrative\nSelling, general and administrative expenses consist principally of employee salaries, incentives, commissions and benefits; travel costs; overhead costs; advertising and other promotional expenses; corporate facilities expenses; legal expenses; and business development expenses.\n41\nTable of Contents\nThe fiscal 2025 over 2024 increase in selling, general and administrative expenses of $50.2 million was primarily attributable to a $23.7 million increase in personnel and labor costs, a $22.4 million increase in advertising and other promotional costs, and a $3\n.3 \nmillion increase in travel costs. The increase in personnel and labor costs was primarily attributable to increased headcount, market base-pay adjustments, commission expense, and share-based compensation expense, partially offset by decreased fringe benefit costs related to our supplemental retirement and savings plan. The increase in advertising and other promotional costs was primarily attributable to increased costs for advertising campaigns and corporate events. The increase in travel costs was primarily attributable to promotional and corporate events. Selling, general and administrative expenses as a percentage of revenues decreased to 26\n%\n during fiscal 2025 from 27% during fiscal 2024.\nRestructuring Charges\nDuring the fourth quarter of fiscal 2025, we incurred charges of \n$10.9\n million in employee separation costs due to the elimination of 226 positions throughout the Company. Cash payments for all the employee separation costs will be paid by the end of our fiscal 2026. \nInterest Expense, Net\nInterest expense includes interest on the senior notes issued in May 2025, December 2021, December 2019, and May 2018, as well as interest and credit agreement fees on the revolving line of credit and term loans. On our consolidated statements of income and comprehensive income, interest expense is netted with interest income, which is derived primarily from the investment of funds in excess of our immediate operating requirements.\nThe fiscal 2025 over 2024 increase in net interest expense of $28.0 million was primarily attributable to the $1.5 billion of 2025 Senior Notes (as defined below), partially offset by a lower average outstanding balance and a lower average interest rate on borrowings under our credit agreement during fiscal 2025.\nOther Income, Net\nOther income, net consists primarily of unrealized investment gains/losses and realized gains/losses on marketable securities classified as trading securities, exchange rate gains/losses resulting from remeasurement of foreign-currency-denominated receivable and cash balances held by our various reporting entities into their respective functional currencies at period-end market rates, net of the impact of offsetting foreign currency forward contracts, and other non-operating items.\nThe fiscal 2025 over 2024 decrease in other income, net of $2.6 million was primarily attributable to a \ndecrease\n in net unrealized gains on investments classified as trading securities in our supplemental retirement and savings plan, partially offset by an \nincrease\n in net exchange rate gains resulting from remeasurement of foreign-currency-denominated receivable and cash balances held by our various reporting entities into their respective functional currencies at period-end market rates, net of the impact of offsetting foreign currency forward contracts.\nProvision for Income Taxes\nOur effective income tax rates were 18.8%, 20.1% and 22.4% in fiscal 2025, 2024 and 2023, respectively.\nThe decrease in our effective tax rate in fiscal 2025 compared to fiscal 2024 was due to an increase in excess tax benefits related to share-based compensation.\n \n42\nTable of Contents\nOperating Income\nThe following tables set forth certain summary information on a segment basis related to our operating income for fiscal 2025, 2024 and 2023:\n \n \nYear Ended September 30,\nPeriod-to-Period\nChange\nPeriod-to-Period\nPercentage Change\nSegment\n2025\n2024\n2023\n2025 to 2024\n2024 to 2023\n2025 to 2024\n2024 to 2023\n \n(In thousands)\n(In thousands)\n \n \nScores\n$\n1,026,243 \n$\n813,354 \n$\n681,071 \n$\n212,889 \n$\n132,283 \n26 \n%\n19 \n%\nSoftware\n247,694 \n257,529 \n241,191 \n(9,835)\n16,338 \n(4)\n%\n7 \n%\nTotal segment operating income\n1,273,937 \n1,070,883 \n922,262 \n203,054 \n148,621 \n19 \n%\n16 \n%\nUnallocated corporate expenses\n(181,498)\n(186,898)\n(156,426)\n5,400 \n(30,472)\n(3)\n%\n19 \n%\nUnallocated share-based compensation\n(156,667)\n(149,439)\n(123,847)\n(7,228)\n(25,592)\n5 \n%\n21 \n%\nUnallocated amortization expense\n— \n(917)\n(1,100)\n917 \n183 \n(100)\n%\n(17)\n%\nUnallocated restructuring charges\n(10,922)\n— \n— \n(10,922)\n— \n— \n%\n— \n%\nGain on product line asset sale\n— \n— \n1,941 \n— \n(1,941)\n— \n%\n(100)\n%\nOperating income\n$\n924,850 \n$\n733,629 \n$\n642,830 \n191,221 \n90,799 \n26 \n%\n14 \n%\nScores\n \n \nYear Ended September 30,\nPercentage of Revenues\n \n2025\n2024\n2023\n2025\n2024\n2023\n \n(In thousands)\n \n \n \nSegment revenues\n$\n1,168,575 \n$\n919,650 \n$\n773,828 \n100 \n%\n100 \n%\n100 \n%\nSegment operating expenses\n(142,332)\n(106,296)\n(92,757)\n(12)\n%\n(12)\n%\n(12)\n%\nSegment operating income\n$\n1,026,243 \n$\n813,354 \n$\n681,071 \n88 \n%\n88 \n%\n88 \n%\nSoftware\n \n \nYear Ended September 30,\nPercentage of Revenues\n \n2025\n2024\n2023\n2025\n2024\n2023\n \n(In thousands)\n \n \n \nSegment revenues\n$\n822,294 \n$\n797,876 \n$\n739,729 \n100 \n%\n100 \n%\n100 \n%\nSegment operating expenses\n(574,600)\n(540,347)\n(498,538)\n(70)\n%\n(68)\n%\n(67)\n%\nSegment operating income\n$\n247,694 \n$\n257,529 \n$\n241,191 \n30 \n%\n32 \n%\n33 \n%\nThe fiscal 2025 over 2024 increase in operating income of $191.2 million was primarily attributable to a $273.3 million increase in segment revenues and a $5.4 million decrease in corporate expenses, partially offset by a $70.2 million increase in segment operating expenses, a $10.9 million increase in restructuring charges, and a $7.2 million increase in share-based compensation cost.\nAt the segment level, the $203.1 million increase in segment operating income was the result of a $212.9 million increase in our Scores segment operating income, partially offset by a $9.8 million decrease in our Software segment operating income.\nThe $212.9 million increase in our Scores segment operating income was attributable to a $248.9 million increase in segment revenue, partially offset by a $36.0 million increase in segment operating expenses. Segment operating income as a percentage of segment revenue for Scores was 88%, consistent with fiscal 2024.\n43\nTable of Contents\nThe $9.8 million decrease in our Software segment operating income was attributable to a $34.2 million increase in segment operating expenses, partially offset by a $24.4 million increase in segment revenue. Segment operating income as a percentage of segment revenue for Software decreased to 30% from 32%, primarily attributable to the increases in third-party data center hosting costs and in personnel and labor costs.\nCAPITAL RESOURCES AND LIQUIDITY\nOutlook\nAs of September 30, 2025, we had $134.1 million in cash and cash equivalents, which included $118.8 million held by our foreign subsidiaries. We believe our cash and cash equivalents balances, including those held by our foreign subsidiaries, as well as available borrowings from our $1.0 billion revolving line of credit and anticipated cash flows from operating activities, will be sufficient to fund our working and other capital requirements for at least the next 12 months and thereafter for the foreseeable future, including the $400.0 million principal payment on the 2018 Senior Notes (as defined below) due over the next 12 months. Under our current financing arrangements, we have no other significant debt obligations maturing over the next 12 months. For jurisdictions outside the U.S. where cash may be repatriated in the future, the Company expects the net impact of any repatriations to be immaterial to the Company’s overall tax liability. \nIn the normal course of business, we evaluate the merits of acquiring technology or businesses, or establishing strategic relationships with or investing in these businesses. We may elect to use available cash and cash equivalents to fund such activities in the future. In the event additional needs for cash arise, or if we refinance our existing debt, we may raise additional funds from a combination of sources, including the potential issuance of debt or equity securities. Additional financing might not be available on terms favorable to us, or at all. If adequate funds were not available or were not available on acceptable terms, our ability to take advantage of unanticipated opportunities or respond to competitive pressures could be limited.\nSummary of Cash Flows\n \n \nYear Ended September 30,\n \n2025\n2024\n2023\n \n(In thousands)\nCash provided by (used in):\nOperating activities\n$\n778,807 \n$\n632,964 \n$\n468,915 \nInvesting activities\n(43,719)\n(27,993)\n(15,954)\nFinancing activities\n(750,329)\n(592,923)\n(455,001)\nEffect of exchange rate changes on cash\n(1,290)\n1,841 \n5,616 \nIncrease (decrease) in cash and cash equivalents\n$\n(16,531)\n$\n13,889 \n$\n3,576 \nCash Flows from Operating Activities\nOur primary method for funding operations and growth has been through cash flows generated from operating activities. Net cash provided by operating activities totaled $778.8 million in fiscal 2025 compared to $633.0 million in fiscal 2024. The $145.8 million increase was attributable to a $139.1 million increase in net income, a $4.8 million increase in non-cash items, and a $1.9 million increase that resulted from timing of receipts and payments in our ordinary course of business.\nCash Flows from Investing Activities\nNet cash used in investing activities totaled $43.7 million in fiscal 2025 compared to $28.0 million in fiscal 2024. The $15.7 million increase was attributable to a $13.8 million increase in capitalized internal-use software costs and a $1.9 million decrease in proceeds from sales, net of purchases, of marketable securities.\nCash Flows from Financing Activities\nNet cash used in financing activities totaled $750.3 million in fiscal 2025 compared to $592.9 million in fiscal 2024. The $157.4 million increase was primarily attributable to a $988.8 million increase in payments, net of proceeds, on our revolving line of credit and term loans, a $592.8 million increase in repurchases of common stock, a $65.4 million increase in taxes paid related to net share settlement of equity awards, and a $16.5 million increase in debt issuance costs, partially offset by the proceeds from the issuance of our $1.5 billion 2025 Senior Notes (as defined below).\n44\nTable of Contents\nRepurchases of Common Stock\nIn July 2024, our Board approved a stock repurchase program (the “July 2024 program”), replacing our previously authorized January 2024 stock repurchase program, which was terminated prior to its expiration. The July 2024 program was open-ended and authorized repurchases of shares of our common stock from time to time up to an aggregate cost of $1.0 billion in the open market or in negotiated transactions. In June 2025, our Board approved a new stock repurchase program (the “June 2025 program”), replacing the July 2024 program, which was terminated prior to its expiration. The June 2025 program is open-ended and authorizes repurchases of shares of our common stock from time to time up to an aggregate cost of $1.0 billion in the open market or in negotiated transactions. The June 2025 program remains in effect until the total authorized amount is expended or until further action by our Board. As of September 30, 2025, we had $343.6 million remaining under the June 2025 program. During fiscal 2025 and 2024, we expended $1.4 billion and $0.8 billion, respectively, under the June 2025 program and previously authorized stock repurchase programs, as applicable.\nRevolving Line of Credit and Term Loans\nOn May 13, 2025, we amended our credit agreement with a syndicate of banks, increasing our borrowing capacity under the unsecured revolving line of credit from $600 million to $1.0 billion and extending its maturity to May 13, 2030. Also on May 13, 2025, we repaid in full and terminated the $300 million unsecured term loan (the “$300 Million Term Loan”) and the $450 million unsecured term loan (the “$450 Million Term Loan”) outstanding under our credit agreement, utilizing proceeds from the issuance of the 2025 Senior Notes (as defined below). Borrowings under the revolving line of credit can be used for working capital and general corporate purposes and may also be used for the refinancing of existing debt, acquisitions, and the repurchase of our common stock. Interest rates on amounts borrowed under the revolving line of credit are based on (i) an adjusted base rate, which is the greatest of (a) the prime rate, (b) the Federal Funds rate plus 0.5%, and (c) the Daily Simple Secured Overnight Financing Rate (“SOFR”) plus 1%, plus, in each case, an applicable margin, (ii) the Daily Simple SOFR plus an applicable margin (or, if such rate is no longer available, a successor benchmark rate determined in accordance with the terms of the credit agreement), or (iii) term SOFR (without a credit spread adjustment) plus an applicable margin (or, if such rate is no longer available, a successor benchmark rate determined in accordance with the terms of the credit agreement). The applicable margin for base rate borrowings and for SOFR borrowings is determined based on our consolidated leverage ratio. The applicable margin for base rate borrowings ranges from 0% to 0.75% per annum and for SOFR borrowings ranges from 1% to 1.75% per annum. In addition, we must pay certain credit facility fees. The credit agreement contains certain restrictive covenants including a maximum consolidated leverage ratio of 3.5 to 1.0, subject to a step up to 4.0 to 1.0 following certain permitted acquisitions and subject to certain conditions, and contains other covenants typical of an unsecured credit facility.\nAs of September 30, 2025, we had $275.0 million in borrowings outstanding under the revolving line of credit at a weighted-average interest rate of 5.423% and we were in compliance with all financial covenants under the credit agreement.\nSenior Notes\nOn May 8, 2018, we issued $400 million of senior notes in a private offering to qualified institutional investors (the “2018 Senior Notes”). The 2018 Senior Notes require interest payments semi-annually at a rate of 5.25% per annum and will mature on May 15, 2026. On December 6, 2019, we issued $350 million of senior notes in a private offering to qualified institutional investors (the “2019 Senior Notes”). The 2019 Senior Notes require interest payments semi-annually at a rate of 4.00% per annum and will mature on June 15, 2028. On December 17, 2021, we issued $550 million of additional senior notes of the same class as the 2019 Senior Notes in a private offering to qualified institutional investors (the “2021 Senior Notes”). The 2021 Senior Notes require interest payments semi-annually at a rate of 4.00% per annum and will mature on June 15, 2028, the same date as the 2019 Senior Notes. On May 13, 2025, we issued $1.5 billion of senior notes in a private offering to qualified institutional investors (the “2025 Senior Notes,” and collectively with the 2018 Senior Notes, the 2019 Senior Notes and the 2021 Senior Notes, the “Senior Notes”). The 2025 Senior Notes require interest payments semi-annually at a rate of 6.00% per annum and will mature on May 15, 2033. The indentures for the Senior Notes contain certain covenants typical of unsecured obligations. As of September 30, 2025, the carrying value of the Senior Notes was $2.8 billion and we were in compliance with all financial covenants under these obligations.\n45\nTable of Contents\nContractual Obligations\nThe following table presents a summary of our contractual obligations at September 30, 2025:\n \n \nYear Ending September 30,\nThereafter\nTotal\n \n2026\n2027\n2028\n2029\n2030\n \n(In thousands)\nSenior Notes \n(1)\n$\n400,000 \n$\n— \n$\n900,000 \n$\n— \n$\n— \n$\n1,500,000 \n$\n2,800,000 \nRevolving line of credit \n(1)\n— \n— \n— \n— \n275,000 \n— \n275,000 \nInterest due on Senior Notes\n147,500 \n126,000 \n126,000 \n90,000 \n90,000 \n270,000 \n849,500 \nOperating lease obligations\n11,214 \n8,125 \n5,576 \n3,767 \n1,917 \n2,191 \n32,790 \nFinance lease obligations\n3,625 \n3,625 \n441 \n— \n— \n— \n7,691 \nPurchase obligations \n(2)\n$\n72,128 \n19,437 \n5,035 \n2,375 \n273 \n— \n99,248 \nUnrecognized tax benefits \n(3)\n— \n— \n— \n— \n— \n— \n19,505 \n     Total commitments\n$\n634,467 \n$\n157,187 \n$\n1,037,052 \n$\n96,142 \n$\n367,190 \n$\n1,772,191 \n$\n4,083,734 \n(1)\nRepresents the unpaid principal payments due under the Senior Notes and revolving line of credit.\n(2)\nRepresents purchase obligations primarily consisting of commitments to purchase certain services. For services that have been delivered under these arrangements as of September 30, 2025, we recorded related liabilities within accounts payable or other accrued liabilities on our consolidated balance sheet, which are excluded from the purchase obligations amount.\n(3)\nRepresents unrecognized tax benefits related to uncertain tax positions. As we are not able to reasonably estimate the timing of the payments or the amount by which the liability will increase or decrease over time, the related balances have not been reflected in the section of the table showing payment by fiscal year.\nCRITICAL ACCOUNTING ESTIMATES\nWe prepare our consolidated financial statements in conformity with U.S. GAAP. These accounting principles require management to make certain judgments and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities as of the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. We periodically evaluate our estimates including those relating to revenue recognition, goodwill resulting from business combinations and other long-lived assets – impairment assessment, share-based compensation, income taxes, and contingencies and litigation. We base our estimates on historical experience and various other assumptions that we believe to be reasonable based on the specific circumstances, the results of which form the basis for making judgments about the carrying value of certain assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates and such differences could be material to our financial condition and results of operations. Critical accounting estimates are those that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on our financial condition and results of operations.\nWhile our significant accounting policies are more fully described in Note 1 and Note 9 to our consolidated financial statements included elsewhere in this report, we believe the following accounting policies require the most critical accounting estimates, which involve significant subjectivity and judgment, and changes to such estimates or assumptions could have a material impact on our financial condition or operating results. Therefore, we consider an understanding of the variability and judgment required in making these estimates and assumptions to be critical in fully understanding and evaluating our reported financial results.\n46\nTable of Contents\nRevenue Recognition\nFor our SaaS subscriptions, we estimate the total variable consideration at contract inception — subject to any constraints that may apply — and update the estimates as new information becomes available and recognize the amount ratably over the SaaS service period, unless we determine it is appropriate to allocate the variable amount to each distinct service period and recognize revenue as each distinct service period is performed. Variable consideration is included in the transaction price if, in our judgment, it is probable that a significant future reversal of cumulative revenue recognized under the contract will not occur. Variable consideration is estimated based on either the expected value or the most likely amount method depending on which method we expect to better predict the amount of consideration to which we will be entitled. Our estimates of variable consideration are based largely on an assessment of our anticipated performance and all information (historical, current and forecasted) that is reasonably available to us at contract inception and require judgment. For the periods presented, we have not experienced significant changes to our estimates and judgments related to variable consideration in our contracts.\nOur contracts with customers often include promises to transfer multiple products and services to a customer. Determining whether products and services are considered distinct and should be accounted for separately may require significant judgment. Specifically, when implementation service is included in the original software or SaaS offerings, judgment is required to determine if the implementation service significantly modifies or customizes the software or SaaS service in such a way that the risks of providing it and the customization service are inseparable. In rare instances, contracts may include significant modification or customization of the software of SaaS service and will result in the combination of software or SaaS service and implementation service as one performance obligation. For the periods presented, we have not experienced significant changes to our estimates and judgments related to the identification of performance obligations for our contracts.\nWe determine the standalone selling prices (“SSP”) using data from our historical standalone sales, or, in instances where such information is not available (such as when we do not sell the product or service separately), we consider factors such as the stated contract prices, our overall pricing practices and objectives, go-to-market strategy, size and type of the transactions, and effects of the geographic area on pricing, among others. When the selling price of a product or service is highly variable, we may use the residual approach to determine the SSP of that product or service. Significant judgment may be required to determine the SSP for each distinct performance obligation when it involves the consideration of many market conditions and entity-specific factors discussed above. For the periods presented, we have not experienced significant changes to our estimates and judgments related to the determination of our SSPs.\nGoodwill and Other Long-Lived Assets - Impairment Assessment\nGoodwill represents the excess of cost over the fair value of identifiable assets acquired and liabilities assumed in business combinations. We assess goodwill for impairment for each of our reporting units on an annual basis during our fourth fiscal quarter using a July 1 measurement date unless circumstances require a more frequent measurement.\n We have determined that our reporting units are the same as our reportable segments. When evaluating goodwill for impairment, we may first perform an assessment qualitatively whether it is more likely than not that a reporting unit's carrying amount exceeds its fair value, referred to as a “step zero” approach. If, based on the review of the qualitative factors, we determine it is not more likely than not that the fair value of a reporting unit is less than its carrying value, we would bypass the two-step impairment test. Events and circumstances we consider in performing the “step zero” qualitative assessment include macro-economic conditions, market and industry conditions, internal cost factors, share price fluctuations, and the operational stability and overall financial performance of the reporting units. If we conclude that it is more likely than not that a reporting unit's fair value is less than its carrying amount, we would perform the first step (“step one”) of the two-step impairment test and calculate the estimated fair value of the reporting unit by using discounted cash flow valuation models and by comparing our reporting units to guideline publicly-traded companies. These methods require estimates of our future revenues, profits, capital expenditures, working capital, and other relevant factors, as well as selecting appropriate guideline publicly-traded companies for each reporting unit. We estimate these amounts by evaluating historical trends, current budgets, operating plans, industry data, and other relevant factors. Alternatively, we may bypass the qualitative assessment described above for any reporting unit in any period and proceed directly to performing step one of the goodwill impairment test.\n47\nTable of Contents\nOur other long-lived assets are assessed for potential impairment when there is evidence that events and circumstances related to our financial performance and economic environment indicate the carrying amount of the assets may not be recoverable. When impairment indicators are identified, we test for impairment using undiscounted projected cash flows. If such tests indicate impairment, then we measure and record the impairment as the difference between the carrying value of the asset and the fair value of the asset. Significant management judgment is required in forecasting future operating results used in the preparation of the projected cash flows. Should different conditions prevail, material write downs of our other long-lived assets could occur. \nAs discussed above, while we believe that the assumptions and estimates utilized were appropriate based on the information available to management, different assumptions, judgments and estimates could materially affect our impairment assessments for our goodwill and other long-lived assets. For the periods presented, we have not experienced significant changes to our estimates and judgments related to our goodwill or other long-lived assets impairment assessment. We believe our projected operating results and cash flows would need to be significantly less favorable to have a material impact on our impairment assessment. However, based upon our historical experience with operations, we do not believe there is a reasonable likelihood of a significant change in our projections.\nShare-Based Compensation\nWe measure share-based compensation cost at the grant date based on the fair value of the award and recognize it as expense, net of estimated forfeitures, over the vesting or service period, as applicable, of the stock award (generally three to four years). We use the Black-Scholes valuation model to determine the fair value of our stock options and a Monte Carlo valuation model to determine the fair value of our market share units. Our valuation models and generally accepted valuation techniques require us to make assumptions and to apply judgment to determine the fair value of our awards. These assumptions and judgments include estimating the volatility of our stock price, expected dividend yield, employee turnover rates and employee stock option exercise behaviors. For the periods presented, we have not experienced significant changes to our estimates and judgments related to the fair value of our awards. See Note 13 to the accompanying consolidated financial statements for further discussion of our share-based employee benefit plans.\nIncome Taxes\nWe estimate our income taxes based on the various jurisdictions where we conduct business, which involves significant judgment in determining our income tax provision. We estimate our current tax liability using currently enacted tax rates and laws and assess temporary differences that result from differing treatments of certain items for tax and accounting purposes. These differences result in deferred tax assets and liabilities recorded on our consolidated balance sheets using the currently enacted tax rates and laws that will apply to taxable income for the years in which those tax assets are expected to be realized or settled. We then assess the likelihood our deferred tax assets will be realized and to the extent we believe realization is not more likely than not, we establish a valuation allowance. When we establish a valuation allowance or increase this allowance in an accounting period, we record a corresponding income tax expense in our consolidated statements of income and comprehensive income. In assessing the need for the valuation allowance, we consider future taxable income in the jurisdictions we operate; our ability to carry back tax attributes to prior years; an analysis of our deferred tax assets and the periods over which they will be realizable; and ongoing prudent and feasible tax planning strategies. An increase in the valuation allowance would have an adverse impact, which could be material, on our income tax provision and net income in the period in which we record the increase.\nWe recognize and measure benefits for uncertain tax positions using a two-step approach. The first step is to evaluate the tax position taken or expected to be taken in a tax return by determining if the technical merits of the tax position indicate it is more likely than not that the tax position will be sustained upon audit, including resolution of any related appeals or litigation processes. For tax positions more likely than not of being sustained upon audit, the second step is to measure the tax benefit as the largest amount more than 50% likely of being realized upon settlement. Significant judgment is required to evaluate uncertain tax positions and they are evaluated on a quarterly basis. Our evaluations are based upon a number of factors, including changes in facts or circumstances, changes in tax law, correspondence with tax authorities during the course of audits and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in material increases or decreases in our income tax expense in the period in which we make the change, which could have a material impact on our effective tax rate and operating results.\n48\nTable of Contents\nContingencies and Litigation\nWe are subject to various proceedings, lawsuits and claims relating to products and services, technology, labor, stockholder and other matters. We are required to assess the likelihood of any adverse outcomes and the potential range of probable losses in these matters. If the potential loss is considered probable and the amount can be reasonably estimated, we accrue a liability for the estimated loss. If the potential loss is considered less than probable or the amount cannot be reasonably estimated, disclosure of the matter is considered. The amount of loss accrual or disclosure, if any, is determined after analysis of each matter, and is subject to adjustment if warranted by new developments or revised strategies. Due to uncertainties related to these matters, accruals or disclosures are based on the best information available at the time. Significant judgment is required in both the assessment of likelihood and in the determination of a range of potential losses. Revisions in the estimates of the potential liabilities could have a material impact on our consolidated financial position or consolidated results of operations. For the periods presented, we have not experienced significant changes to our estimates and judgments related to the assessment of likelihood and in the determination of a range of potential losses. \nNew Accounting Pronouncements\nFor information about recent accounting pronouncements recently adopted and not yet adopted and the impact on our consolidated financial statements, refer to Part II, Item 8, \nFinancial Statements and Supplementary Data\n, Note 1, \nNature of Business and Summary of Significant Accounting Policies,\n in our accompanying Notes to Consolidated Financial Statements in this Annual Report on Form 10-K.",
  "item2": null
}