{
  "source_file": "fico-20250630.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nFORWARD-LOOKING STATEMENTS\nStatements contained in this report that are not statements of historical fact should be considered forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 (the “PSLRA”). In addition, certain statements in our future filings with the Securities and Exchange Commission (“SEC”), in press releases, and in oral and written statements made by us or with our approval that are not statements of historical fact constitute forward-looking statements within the meaning of the PSLRA. Examples of forward-looking statements include, but are not limited to: (i) projections of revenue, income or loss, expenses, earnings or loss per share, the payment or nonpayment of dividends, share repurchases, capital structure and other statements concerning future financial performance; (ii) statements of our plans and objectives by our management or Board of Directors, including those relating to products or services, research and development, and the sufficiency of capital resources; (iii) statements of assumptions underlying such statements, including those related to economic conditions; (iv) statements regarding results of business combinations or strategic divestitures; (v) statements regarding business relationships with vendors, customers or collaborators, including the proportion of revenues generated from international as opposed to domestic customers; and (vi) statements regarding products and services, their characteristics, performance, sales potential or effect in use by customers. Words such as “believes,” “anticipates,” “expects,” “intends,” “targeted,” “should,” “potential,” “goals,” “strategy,” “outlook,” “plan,” “estimated,” “will,” variations of these terms and similar expressions are intended to identify forward-looking statements, but are not the exclusive means of identifying such statements. Forward-looking statements involve risks and uncertainties that may cause actual results to differ materially from those in such statements. Factors that could cause actual results to differ from those discussed in the forward-looking statements include, but are not limited to, those described in Part I, Item 1A \n“\nRisk Factors\n”\n of our Annual Report on Form 10-K for the fiscal year ended September 30, 2024 and in subsequent filings with the SEC. The performance of our business and our securities may be adversely affected by these factors and by other factors common to other businesses and investments, or to the general economy. Forward-looking statements are qualified by some or all of these risk factors. Therefore, you should consider these risk factors with caution and form your own critical and independent conclusions about the likely effect of these risk factors on our future performance. Such forward-looking statements speak only as of the date on which statements are made, and we undertake no obligation to update any forward-looking statement to reflect events or circumstances after the date on which such statement is made to reflect the occurrence of unanticipated events or circumstances. Readers should carefully review the disclosures and the risk factors described in this and other documents we file from time to time with the SEC, including our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K.\nOVERVIEW\nWe were founded in 1956 on the premise that data, used intelligently, can improve business decisions. Today, FICO’s software and the widely used FICO\n®\n Score operationalize analytics, enabling thousands of businesses in more than 80 countries to uncover new opportunities, make timely decisions that matter, and execute them at scale. Most leading banks and credit card issuers rely on our solutions, as do insurers, retailers, telecommunications providers, automotive lenders, consumer reporting agencies, public agencies, and organizations in other industries. We also serve consumers through online services that enable people to access and understand their FICO\n®\n Scores — the standard measure in the United States (“U.S.”) of consumer credit risk — empowering them to increase financial literacy and manage their financial health.\nOur business consists of two operating segments: Scores and Software.\n \nOur Scores segment includes our business-to-business (“B2B”) scoring solutions and services which give our clients access to predictive credit and other scores that can be easily integrated into their transaction streams and decision-making processes. This segment also includes our business-to-consumer (“B2C”) scoring solutions, including our myFICO.com subscription offerings.\nOur Software segment includes pre-configured analytic and decision management solutions designed for a specific type of business need or process — such as account origination, customer management, customer engagement, fraud detection, and marketing — as well as associated professional services. This segment also includes FICO\n®\n Platform, a modular software offering designed to support advanced analytic and decision use cases, as well as stand-alone analytic and decisioning software that can be configured by our customers to address a wide variety of business use cases. Our offerings are available to our customers as software-as-a-service (“SaaS”) or as on-premises software.\n18\nTable of Contents\nHighlights from the quarter and nine months ended June 30, 2025 \n•\nTotal revenues were $536.4 million during the quarter ended June 30, 2025, a 20% increase from the quarter ended June 30, 2024, and $1.5 billion during the nine months ended June 30, 2025, a 17% increase from the nine months ended June 30, 2024.\n•\nRevenues for our Scores segment were $324.3 million during the quarter ended June 30, 2025, a 34% increase from the quarter ended June 30, 2024, and $857.0 million during the nine months ended June 30, 2025, a 28% increase from the nine months ended June 30, 2024.\n•\nAnnual Recurring Revenue for our Software segment as of June 30, 2025 was $739.1 million, a 4% increase from June 30, 2024.\n•\nDollar-Based Net Retention Rate for our Software segment was 103% as of June 30, 2025.\n•\nOperating income was $262.5 million during the quarter ended June 30, 2025, a 38% increase from the quarter ended June 30, 2024, and $687.7 million during the nine months ended June 30, 2025, a 28% increase from the nine months ended June 30, 2024.\n•\nNet income was $181.8 million during the quarter ended June 30, 2025, a 44% increase from the quarter ended June 30, 2024, and $496.9 million during the nine months ended June 30, 2025, a 32% increase from the nine months ended June 30, 2024.\n•\nDiluted EPS was $7.40 during the quarter ended June 30, 2025, a 47% increase from the quarter ended June 30, 2024, and $20.12 during the nine months ended June 30, 2025, a 34% increase from the nine months ended June 30, 2024.\n•\nCash flows from operating activities were $555.1 million during the nine months ended June 30, 2025, compared with $406.5 million during the nine months ended June 30, 2024.\n•\nCash and cash equivalents were $189.0 million as of June 30, 2025, compared with $150.7 million as of September 30, 2024.\n•\nWe issued $1.5 billion of senior notes and used the net proceeds to repay all the outstanding balances on our term loans and revolving line of credit. We also amended our credit agreement to increase our borrowing capacity under the unsecured revolving line of credit to $1.0 billion and extended its maturity. Total debt balance was $2.8 billion as of June 30, 2025, compared with $2.2 billion as of September 30, 2024. \n•\nTotal share repurchases during the quarter ended June 30, 2025 were $511.3 million, compared with $255.5 million during the quarter ended June 30, 2024, and during the nine months ended June 30, 2025 were $878.1 million, compared with $506.8 million during the nine months ended June 30, 2024.\nKey performance metrics for Software segment\nAnnual Contract Value Bookings (“ACV Bookings”)\nManagement regards ACV Bookings as an important indicator of future revenues, but it is not comparable to, nor is it a substitute for, an analysis of our revenues and other U.S. generally accepted accounting principles (“U.S. GAAP”) measures. We define ACV Bookings as the average annualized value of software contracts signed in the current reporting period that generate current and future on-premises and SaaS software revenue. We only include contracts with an initial term of at least 24 months and we exclude perpetual licenses and other software revenues that are non-recurring in nature. For renewals of existing software subscription contracts, we count only incremental annual revenue expected over the current contract as ACV Bookings.\nACV Bookings is calculated by dividing the total expected contract value by the contract term in years. The expected contract value equals the fixed amount — including guaranteed minimums, if any — stated in the contract, plus estimates of future usage-based fees. We develop estimates from discussions with our customers and examinations of historical data from similar products and customer arrangements. Differences between estimates and actual results occur due to variability in the estimated usage. This variability can be the result of the economic trends in our customers’ industries, individual performance of our customers relative to their competitors, and regulatory and other factors that affect the business environment in which our customers operate. For the periods presented, ACV Bookings related to estimates of future usage-based fees was approximately 30% of the total ACV Bookings amount on an annualized basis. Differences between the initial estimates of future usage-based fees and actual results historically have not been material and we do not currently expect that they will be materially different in the future.\n19\nTable of Contents\nWe disclose estimated revenue expected to be recognized in the future related to remaining performance obligations in Note 7 to the accompanying condensed consolidated financial statements. However, we believe ACV Bookings is a useful supplemental measure of our business as it includes estimated revenues and future billings excluded from Note 7, such as usage-based fees and guaranteed minimums derived from our on-premises software licenses, among others.\nThe following table summarizes our ACV Bookings during the periods indicated:\nQuarter Ended June 30,\nNine Months Ended June 30,\n2025\n2024\n2025\n2024\n(In millions)\nTotal on-premises and SaaS software\n$\n26.7 \n$\n27.5 \n$\n69.7 \n$\n62.6 \nAnnual Recurring Revenue (“ARR”)\nAccounting Standards Codification Topic 606, \nRevenue from Contracts with Customers\n, requires us to recognize a significant portion of revenue from our on-premises software subscriptions at the point in time when the software is first made available to the customer, or at the beginning of the subscription term, despite\n \nthe fact that our contracts typically call for billing these amounts ratably over the life of the subscription. The remaining portion of our on-premises software subscription revenue including maintenance and usage-based fees are recognized over the life of the contract. This point-in-time recognition of a portion of our on-premises software subscription revenue creates significant variability in the revenue recognized period to period based on the timing of the subscription start date and the subscription term. Furthermore, this point-in-time revenue recognition can create a significant difference between the timing of our revenue recognition and the actual customer billing under the contract. We use ARR to measure the underlying performance of our subscription-based contracts and mitigate the impact of this variability. ARR is defined as the annualized revenue run-rate of on-premises and SaaS software agreements within a quarterly reporting period, and as such, is different from the timing and amount of revenue recognized. All components of our software licensing and subscription arrangements that are not expected to recur (primarily perpetual licenses) are excluded.\n \nWe calculate ARR as the quarterly recurring revenue run-rate multiplied by four.\nThe following table summarizes our ARR for on-premises and SaaS software exiting each of the dates presented:\nSeptember 30, 2023\nDecember 31, \n2023\nMarch 31, \n2024\nJune 30, \n2024\nSeptember 30, 2024\nDecember 31, \n2024\nMarch 31, \n2025\nJune 30, \n2025\nARR\n(In millions)\nPlatform\n$\n173.2\n$\n190.3\n$\n201.4\n$\n215.1\n$\n227.0\n$\n227.7\n$\n234.7\n$\n254.2\nNon-platform\n496.2\n497.4\n495.6\n494.5\n494.2\n501.6\n479.9\n484.9\n     Total\n$\n669.4\n$\n687.7\n$\n697.0\n$\n709.6\n$\n721.2\n$\n729.3\n$\n714.6\n$\n739.1\nPercentage\nPlatform\n26 \n%\n28 \n%\n29 \n%\n30 \n%\n31 \n%\n31 \n%\n33 \n%\n34 \n%\nNon-platform\n74 \n%\n72 \n%\n71 \n%\n70 \n%\n69 \n%\n69 \n%\n67 \n%\n66 \n%\n     Total\n100 \n%\n100 \n%\n100 \n%\n100 \n%\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nYoY Change\nPlatform\n53 \n%\n43 \n%\n32 \n%\n31 \n%\n31 \n%\n20 \n%\n17 \n%\n18 \n%\nNon-platform\n14 \n%\n11 \n%\n8 \n%\n3 \n%\n— \n%\n1 \n%\n(3)\n%\n(2)\n%\n     Total\n22 \n%\n18 \n%\n14 \n%\n10 \n%\n8 \n%\n6 \n%\n3 \n%\n4 \n%\n20\nTable of Contents\nDollar-Based Net Retention Rate (“DBNRR”)\nWe consider DBNRR to be an important measure of our success in retaining and growing revenue from our existing customers. To calculate DBNRR for any period, we compare the ARR at the end of the prior comparable quarter (“base ARR”) to the ARR from that same cohort of customers at the end of the current quarter (“retained ARR”); we then divide the retained ARR by the base ARR to arrive at the DBNRR. Our calculation includes the positive impact among this cohort of customers of selling additional products, price increases and increases in usage-based fees, and the negative impact of customer attrition, price decreases, and decreases in usage-based fees during the period. However, the calculation does not include the positive impact from sales to any new customers acquired during the period. Our DBNRR may increase or decrease from period to period as a result of various factors, including the timing of new sales and customer renewal rates.\nThe following table summarizes our DBNRR for on-premises and SaaS software exiting each of the dates presented:\nSeptember 30, 2023\nDecember 31, \n2023\nMarch 31, \n2024\nJune 30, \n2024\nSeptember 30, 2024\nDecember 31, \n2024\nMarch 31, \n2025\nJune 30, \n2025\nDBNRR\nPlatform\n145 \n%\n136 \n%\n126 \n%\n124 \n%\n123 \n%\n112 \n%\n110 \n%\n115 \n%\nNon-platform\n111 \n%\n108 \n%\n106 \n%\n101 \n%\n99 \n%\n100 \n%\n96 \n%\n97 \n%\n     Total\n120 \n%\n114 \n%\n112 \n%\n108 \n%\n106 \n%\n105 \n%\n102 \n%\n103 \n%\nRESULTS OF OPERATIONS\nWe are organized into two reportable segments: Scores and Software. Although we sell solutions and services into a large number of end user product and industry markets, our reportable business segments reflect the primary method in which management organizes and evaluates internal financial information to make operating decisions and assess performance. \nSegment revenues, operating income, and related financial information, including disaggregation of revenue, are set forth in Note 7 and Note 10 to the accompanying condensed consolidated financial statements. \nRevenues\nThe following tables set forth certain summary information on a segment basis related to our revenues for the quarters and nine-month periods ended June 30, 2025 and 2024:\nQuarter Ended June 30,\nPercentage of Revenues\nPeriod-to-Period Change\nPeriod-to-Period\nPercentage Change\nSegment\n2025\n2024\n2025\n2024\n \n(In thousands)\n \n \n(In thousands)\n \nScores\n$\n324,309 \n$\n241,450 \n60 \n%\n54 \n%\n$\n82,859 \n34 \n%\nSoftware\n212,106 \n206,399 \n40 \n%\n46 \n%\n5,707 \n3 \n%\nTotal\n$\n536,415 \n$\n447,849 \n100 \n%\n100 \n%\n88,566 \n20 \n%\n \n \n \n \n \nNine Months Ended June 30,\nPercentage of Revenues\nPeriod-to-Period Change\nPeriod-to-Period\nPercentage Change\nSegment\n2025\n2024\n2025\n2024\n \n(In thousands)\n \n \n(In thousands)\n \nScores\n$\n857,023 \n$\n670,447 \n58 \n%\n53 \n%\n$\n186,576 \n28 \n%\nSoftware\n618,095 \n593,270 \n42 \n%\n47 \n%\n24,825 \n4 \n%\nTotal\n$\n1,475,118 \n$\n1,263,717 \n100 \n%\n100 \n%\n211,401 \n17 \n%\n21\nTable of Contents\nQuarter Ended June 30, 2025 Compared to Quarter Ended June 30, 2024\n \nScores\nScores segment revenues increased $82.9 million due to an increase of $79.7 million in our business-to-business scores revenue and an increase of $3.2 million in our business-to-consumer revenue. The increase in business-to-business scores revenue was primarily attributable to a higher unit price, an increase in volume of mortgage originations and a multi-year license renewal in the U.S. recognized on our insurance score product during the quarter ended June 30, 2025. The increase in business-to-consumer revenue was primarily attributable to an increase in royalties derived from scores sold indirectly to consumers through credit reporting agencies.\nSoftware\nThe following table provides information about disaggregated revenue for our Software segment by revenue types:\nQuarter Ended June 30,\nPeriod-to-Period Change\nPeriod-to-Period\nPercentage Change\n \n2025\n2024\n \n(In thousands)\n(In thousands)\n \nOn-premises and SaaS software\n$\n187,915 \n$\n183,785 \n$\n4,130 \n2 \n%\nProfessional services\n24,191 \n22,614 \n1,577 \n7 \n%\nTotal\n$\n212,106 \n$\n206,399 \n5,707 \n3 \n%\nSoftware\n \nsegment revenues increased $5.7 million due to a $4.1 million increase in our on-premises and SaaS software revenue and a $1.6 million increase in professional services revenue. The increase in our on-premises and SaaS software revenue was primarily attributable to an increase in revenue recognized over time largely driven by SaaS growth for our Platform products.\nNine Months Ended June 30, 2025 Compared to Nine Months Ended June 30, 2024 \nScores\nScores segment revenues increased $186.6 million due to an increase of $178.7 million in our business-to-business scores revenue and an increase of $7.9 million in our business-to-consumer revenue. The increase in business-to-business scores revenue was primarily attributable to a higher unit price, an increase in volume of mortgage originations and a multi-year license renewal in the U.S. recognized on our insurance score product during the nine months ended June 30, 2025. The increase in business-to-consumer revenue was primarily attributable to an increase in royalties derived from scores sold indirectly to consumers through credit reporting agencies.\nSoftware\nNine Months Ended June 30,\nPeriod-to-Period Change\nPeriod-to-Period\nPercentage Change\n \n2025\n2024\n \n(In thousands)\n(In thousands)\n \nOn-premises and SaaS software\n$\n557,752 \n$\n529,633 \n$\n28,119 \n5 \n%\nProfessional services\n60,343 \n63,637 \n(3,294)\n(5)\n%\nTotal\n$\n618,095 \n$\n593,270 \n24,825 \n4 \n%\nSoftware\n \nsegment revenues increased $24.8 million due to a $28.1 million increase in our on-premises and SaaS software revenue, partially offset by a $3.3 million decrease in professional services revenue. The increase in our on-premises and SaaS software revenue was primarily attributable to an increase in license revenue recognized at a point in time due to a large license renewal and an increase in revenue recognized over time largely driven by SaaS growth for our Platform products.\n22\nTable of Contents\nOperating Expenses and Other Income (Expense), Net\nThe following tables set forth certain summary information related to our condensed consolidated statements of income and comprehensive income for the quarters and nine-month periods ended June 30, 2025 and 2024:\n \nQuarter Ended June 30,\nPercentage of Revenues\nPeriod-to-Period Change\nPeriod-to-\nPeriod\nPercentage Change\n \n2025\n2024\n2025\n2024\n \n(In thousands, except\nemployees)\n \n \n(In thousands,\nexcept employees)\n \nRevenues\n$\n536,415 \n$\n447,849 \n100 \n%\n100 \n%\n$\n88,566 \n20 \n%\nOperating expenses:\nCost of revenues\n87,571 \n88,225 \n16 \n%\n20 \n%\n(654)\n(1)\n%\nResearch and development\n47,212 \n44,217 \n9 \n%\n10 \n%\n2,995 \n7 \n%\nSelling, general and administrative\n139,114 \n124,881 \n26 \n%\n28 \n%\n14,233 \n11 \n%\nAmortization of intangible assets\n— \n275 \n— \n%\n— \n%\n(275)\n(100)\n%\nTotal operating expenses\n273,897 \n257,598 \n51 \n%\n58 \n%\n16,299 \n6 \n%\nOperating income\n262,518 \n190,251 \n49 \n%\n42 \n%\n72,267 \n38 \n%\nInterest expense, net\n(32,899)\n(26,868)\n(6)\n%\n(6)\n%\n(6,031)\n22 \n%\nOther income, net\n7,372 \n3,935 \n1 \n%\n1 \n%\n3,437 \n87 \n%\nIncome before income taxes\n236,991 \n167,318 \n44 \n%\n37 \n%\n69,673 \n42 \n%\nProvision for income taxes\n55,202 \n41,062 \n10 \n%\n9 \n%\n14,140 \n34 \n%\nNet income\n$\n181,789 \n$\n126,256 \n34 \n%\n28 \n%\n55,533 \n44 \n%\nNumber of employees at quarter end\n3,855 \n3,588 \n267 \n7 \n%\n \nNine Months Ended June 30,\nPercentage of Revenues\nPeriod-to-Period Change\nPeriod-to-\nPeriod\nPercentage Change\n \n2025\n2024\n2025\n2024\n \n(In thousands)\n \n \n(In thousands)\n \nRevenues\n$\n1,475,118 \n$\n1,263,717 \n100 \n%\n100 \n%\n$\n211,401 \n17 \n%\nOperating expenses:\nCost of revenues\n262,546 \n258,632 \n18 \n%\n21 \n%\n3,914 \n2 \n%\nResearch and development\n137,394 \n127,732 \n9 \n%\n10 \n%\n9,662 \n8 \n%\nSelling, general and administrative\n387,484 \n340,077 \n26 \n%\n27 \n%\n47,407 \n14 \n%\nAmortization of intangible assets\n— \n825 \n— \n%\n— \n%\n(825)\n(100)\n%\nTotal operating expenses\n787,424 \n727,266 \n53 \n%\n58 \n%\n60,158 \n8 \n%\nOperating income\n687,694 \n536,451 \n47 \n%\n42 \n%\n151,243 \n28 \n%\nInterest expense, net\n(93,765)\n(77,123)\n(6)\n%\n(6)\n%\n(16,642)\n22 \n%\nOther income, net\n6,207 \n11,314 \n— \n%\n1 \n%\n(5,107)\n(45)\n%\nIncome before income taxes\n600,136 \n470,642 \n41 \n%\n37 \n%\n129,494 \n28 \n%\nProvision for income taxes\n103,204 \n93,522 \n7 \n%\n7 \n%\n9,682 \n10 \n%\nNet income\n$\n496,932 \n$\n377,120 \n34 \n%\n30 \n%\n119,812 \n32 \n%\n23\nTable of Contents\nCost of Revenues\nCost of revenues consists primarily of employee salaries, incentives, and benefits for personnel directly involved in delivering software products, operating SaaS infrastructure, and providing support, implementation and consulting services; overhead, facilities and data center costs; software royalty fees; credit bureau data and processing services; third-party hosting fees related to our SaaS services; travel costs; and outside services.\nThe quarter-over-prior year quarter decrease in cost of revenues of $0.7 million was primarily attributable to a $1.6 million decrease in personnel and labor costs and a $1.1 million decrease in outside services costs, partially offset by a $2.3 million increase in infrastructure and facilities costs. The decrease in personnel and labor costs was primarily attributable to decreased incentive expense. The decrease in outside services costs was primarily attributable to decreased third-party contractor costs. The increase in infrastructure and facilities costs was primarily attributable to an increase in third-party data center hosting costs. Cost of revenues as a percentage of revenues decreased to 16% during the quarter ended June 30, 2025 from 20% during the quarter ended June 30, 2024, primarily due to increased sales of our higher-margin Scores products. \nThe year-to-date period-over-period increase in cost of revenues of $3.9 million was primarily attributable to a $7.4 million increase in infrastructure and facilities costs, partially offset by a $1.5 million decrease in outside services costs and a $1.5 million decrease in personnel and labor costs. The increase in infrastructure and facilities costs was primarily attributable to an increase in third-party data center hosting costs and an increase in depreciation on data center computer hardware. The decrease in outside services costs was primarily attributable to decreased third-party contractor costs. The decrease in personnel and labor costs was primarily attributable to decreased incentive expense and headcount. Cost of revenues as a percentage of revenues decreased to 18% during the nine months ended June 30, 2025 from 21% during the nine months ended June 30, 2024, primarily due to increased sales of our higher-margin Scores products.\nResearch and Development\nResearch and development expenses include personnel and related overhead costs incurred in the development of new products and services, including research of mathematical and statistical models and development of new versions of Software products.\nThe quarter-over-prior year quarter increase in research and development expenses of $3.0 million was primarily attributable to a $1.9 million increase in outside services costs and a $1.1 million increase in infrastructure and facilities costs. The increase in outside services costs was primarily attributable to increased third-party contractor costs. The increase in infrastructure and facilities costs was primarily attributable to increased third-party data center hosting costs. Research and development expenses as a percentage of revenues decreased to 9% during the quarter ended June 30, 2025 from 10% during the quarter ended June 30, 2024.\nThe year-to-date period-over-period increase in research and development expenses of $9.7 million was primarily attributable to a $5.5 million increase in outside services costs and a $4.0 million increase in infrastructure and facilities costs. The increase in outside services costs was primarily attributable to increased third-party contractor costs. The increase in infrastructure and facilities costs was primarily attributable to increased third-party data center hosting costs and software royalty fees. Research and development expenses as a percentage of revenues decreased to 9% during the nine months ended June 30, 2025 from 10% during the nine months ended June 30, 2024.\nSelling, General and Administrative\nSelling, general and administrative expenses consist principally of employee salaries, incentives, commissions and benefits; travel costs; overhead costs; advertising and other promotional expenses; corporate facilities expenses; legal expenses; and business development expenses.\nThe quarter-over-prior year quarter increase in selling, general and administrative expenses of $14.2 million was primarily attributable to a $7.0 million increase in advertising and other promotional expenses, a $5.1 million increase in personnel and labor costs, a $1.3 million increase in travel expenses, and a $1.1 million increase in non-income tax costs. The increase in advertising and other promotional expenses was primarily attributable to increased costs for advertising campaigns and corporate events. The increase in personnel and labor costs was primarily attributable to increased headcount, market base-pay adjustments, fringe benefit costs related to our supplemental retirement and savings plan, and commission expense, partially offset by decreased incentive expense and share-based compensation expense. The increase in travel costs was primarily attributable to promotional and corporate events. The increase in non-income tax costs was attributable to a foreign tax law change related to transfer pricing, effective during the quarter ended June 30, 2025, that impacted a non-U.S. subsidiary. Selling, general and administrative expenses as a percentage of revenues decreased to 26% during the quarter ended June 30, 2025 from 28% during the quarter ended June 30, 2024.\n24\nTable of Contents\nThe year-to-date period-over-period increase in selling, general and administrative expenses of $47.4 million was primarily attributable to a $23.6 million increase in personnel and labor costs, a $17.2 million increase in advertising and other promotional costs, a $4.0 million increase in non-income tax costs, and a $2.6 million increase in travel costs. The increase in personnel and labor costs was primarily attributable to increased share-based compensation expense, headcount, market base-pay adjustments, and commission expense, partially offset by decreased fringe benefits costs related to our supplemental retirement and savings plan. The increase in advertising and other promotional expenses was primarily attributable to increased costs for advertising campaigns and corporate events. The increase in non-income tax costs was attributable to a foreign tax law change related to transfer pricing, effective during the nine months ended June 30, 2025, that impacted a non-U.S. subsidiary. The increase in travel costs was primarily attributable to promotional and corporate events. Selling, general and administrative expenses as a percentage of revenues decreased to 26% during the nine months ended June 30, 2025 from 27% during the nine months ended June 30, 2024.\nInterest Expense, Net\nInterest expense includes interest on the senior notes issued in May 2025, December 2021, December 2019 and May 2018, as well as interest and credit agreement fees on the revolving line of credit and term loans. On our condensed consolidated statements of income and comprehensive income, interest expense is netted with interest income, which is derived primarily from the investment of funds in excess of our immediate operating requirements. \nThe quarter-over-prior year quarter increase in interest expense of $6.0 million was primarily attributable to the $1.5 billion of 6.00% senior notes issued in May 2025, partially offset by a lower average outstanding balance and a lower average interest rate on borrowings under our credit agreement during the quarter ended June 30, 2025.\nThe year-to-date period-over-period increase in interest expense of $16.6 million was primarily attributable to the $1.5 billion of 6.00% senior notes issued in May 2025 and a higher average outstanding balance on borrowings under our credit agreement during the nine months ended June 30, 2025, partially offset by a lower average interest rate on borrowings under our credit agreement during the nine months ended June 30, 2025.\nOther Income, Net\nOther income, net consists primarily of unrealized investment gains/losses and realized gains/losses on marketable securities classified as trading securities, exchange rate gains/losses resulting from remeasurement of foreign-currency-denominated receivable and cash balances held by our various reporting entities into their respective functional currencies at period-end market rates, net of the impact of offsetting foreign currency forward contracts, and other non-operating items.\nThe quarter-over-prior year quarter increase in other income, net of $3.4 million was primarily attributable to an increase in net unrealized gains on investments classified as trading securities in our supplemental retirement and savings plan.\nThe year-to-date period-over-period decrease in other income, net of $5.1 million was primarily attributable to a decrease in net unrealized gains on investments classified as trading securities in our supplemental retirement and savings plan, partially offset by an increase in net exchange rate gains resulting from remeasurement of foreign-currency-denominated receivable and cash balances held by our various reporting entities into their respective functional currencies at period-end market rates, net of the impact of offsetting foreign currency forward contracts.\nProvision for Income Taxes\nThe effective income tax rate was 23.3% and 24.5% during the quarters ended June 30, 2025 and 2024, respectively, and 17.2% and 19.9% during the nine months ended June 30, 2025 and 2024, respectively. The provision for income taxes during interim quarterly reporting periods is based on our estimates of the effective tax rates for the full fiscal year. The effective tax rate in any quarter can also be affected positively or negatively by adjustments that are required to be reported in the specific quarter of resolution. The effective tax rates for the quarter and nine months ended June 30, 2025 were favorably impacted by the excess tax benefit relating to share-based compensation.\n25\nTable of Contents\nOperating Income\nThe following tables set forth certain summary information on a segment basis related to our operating income for the quarters and nine-month periods ended June 30, 2025 and 2024:\n \nQuarter Ended June 30,\nPeriod-to-Period Change\nPeriod-to-Period\nPercentage Change\nSegment\n2025\n2024\n \n(In thousands)\n(In thousands)\n \nScores\n$\n284,711 \n$\n212,989 \n$\n71,722 \n34 \n%\nSoftware\n67,942 \n70,340 \n(2,398)\n(3)\n%\nUnallocated corporate expenses\n(48,205)\n(50,368)\n2,163 \n(4)\n%\nTotal segment operating income\n304,448 \n232,961 \n71,487 \n31 \n%\nUnallocated share-based compensation\n(41,930)\n(42,435)\n505 \n(1)\n%\nUnallocated amortization expense\n— \n(275)\n275 \n(100)\n%\nOperating income\n$\n262,518 \n$\n190,251 \n72,267 \n38 \n%\nScores\nSoftware\n \nQuarter Ended  \nJune 30,\nPercentage of\nRevenues\nQuarter Ended  \nJune 30,\nPercentage of\nRevenues\n \n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\n \n(In thousands)\n \n \n(In thousands)\n \n \nSegment revenues\n$\n324,309 \n$\n241,450 \n100 \n%\n100 \n%\n$\n212,106 \n$\n206,399 \n100 \n%\n100 \n%\nSegment operating expense\n(39,598)\n(28,461)\n(12)\n%\n(12)\n%\n(144,164)\n(136,059)\n(68)\n%\n(66)\n%\nSegment operating income\n$\n284,711 \n$\n212,989 \n88 \n%\n88 \n%\n$\n67,942 \n$\n70,340 \n32 \n%\n34 \n%\nThe quarter-over-prior year quarter increase in operating income of $72.3 million was primarily attributable to an $88.6 million increase in segment revenues and a $2.2 million decrease in corporate expenses, partially offset by a $19.2 million increase in segment operating expenses.\nAt the segment level, the quarter-over-prior year quarter increase in segment operating income of $71.5 million was the result of a $71.7 million increase in our Scores segment operating income and a $2.2 million decrease in corporate expenses, partially offset by a $2.4 million decrease in our Software segment operating income.\nThe quarter-over-prior year quarter increase in Scores segment operating income of $71.7 million was due to an $82.8 million increase in segment revenue, partially offset by an $11.1 million increase in segment operating expenses. Scores segment operating income as a percentage of segment revenue was 88%, consistent with the quarter ended June 30, 2024.\nThe quarter-over-prior year quarter decrease in Software segment operating income of $2.4 million was due to an $8.1 million increase in segment operating expenses, partially offset by a $5.7 million increase in segment revenue. Software segment operating income as a percentage of segment revenue decreased to 32% from 34%, primarily attributable to the increase in third-party data center hosting costs. \n \nNine Months Ended June 30,\nPeriod-to-Period Change\nPeriod-to-Period\nPercentage Change\nSegment\n2025\n2024\n \n(In thousands)\n(In thousands)\n \nScores\n$\n753,452 \n$\n593,851 \n$\n159,601 \n27 \n%\nSoftware\n192,008 \n189,624 \n2,384 \n1 \n%\nUnallocated corporate expenses\n(133,478)\n(136,742)\n3,264 \n(2)\n%\nTotal segment operating income\n811,982 \n646,733 \n165,249 \n26 \n%\nUnallocated share-based compensation\n(124,288)\n(109,457)\n(14,831)\n14 \n%\nUnallocated amortization expense\n— \n(825)\n825 \n(100)\n%\nOperating income\n$\n687,694 \n$\n536,451 \n151,243 \n28 \n%\n26\nTable of Contents\nScores\nSoftware\n \nNine Months Ended  \nJune 30,\nPercentage of\nRevenues\nNine Months Ended  \nJune 30,\nPercentage of\nRevenues\n \n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\n \n(In thousands)\n \n \n(In thousands)\n \n \nSegment revenues\n$\n857,023 \n$\n670,447 \n100 \n%\n100 \n%\n$\n618,095 \n$\n593,270 \n100 \n%\n100 \n%\nSegment operating expense\n(103,571)\n(76,596)\n(12)\n%\n(11)\n%\n(426,087)\n(403,646)\n(69)\n%\n(68)\n%\nSegment operating income\n$\n753,452 \n$\n593,851 \n88 \n%\n89 \n%\n$\n192,008 \n$\n189,624 \n31 \n%\n32 \n%\nThe year-to-date period-over-period increase of $151.2 million in operating income was primarily attributable to a $211.4 million increase in segment revenues and a $3.3 million decrease in corporate expenses, partially offset by a $49.4 million increase in segment operating expenses and a $14.8 million increase in share-based compensation cost.\nAt the segment level, the year-to-date period-over-period increase of $165.2 million in segment operating income was the result of a $159.6 million increase in our Scores segment operating income, a $3.3 million decrease in corporate expenses, and a $2.4 million increase in our Software segment operating income.\nThe year-to-date period-over-period $159.6 million increase in Scores segment operating income was attributable to a $186.6 million increase in segment revenue, partially offset by a $27.0 million increase in segment operating expenses. Scores segment operating income as a percentage of segment revenue was 88%, materially consistent with the nine months ended June 30, 2024.\nThe year-to-date period-over-period $2.4 million increase in Software segment operating income was attributable to a $24.8 million increase in segment revenue, partially offset by a $22.4 million increase in segment operating expenses. Software segment operating income as a percentage of segment revenue was 31%, materially consistent with the nine months ended June 30, 2024.\nCAPITAL RESOURCES AND LIQUIDITY\nOutlook\nAs of June 30, 2025, we had $189.0 million in cash and cash equivalents, which included $121.9 million held by our foreign subsidiaries. We believe our cash and cash equivalents balances, including those held by our foreign subsidiaries, as well as available borrowings from our $1.0 billion revolving line of credit and anticipated cash flows from operating activities, will be sufficient to fund our working and other capital requirements for at least the next 12 months and thereafter for the foreseeable future, including the $400.0 million principal payment on the 2018 Senior Notes (as defined below) due over the next 12 months. Under our current financing arrangements, we have no other significant debt obligations maturing over the next 12 months. For jurisdictions outside the U.S. where cash may be repatriated in the future, the Company expects the net impact of any repatriations to be immaterial to the Company’s overall tax liability.\nIn the normal course of business, we evaluate the merits of acquiring technology or businesses, or establishing strategic relationships with or investing in these businesses. We may elect to use available cash and cash equivalents to fund such activities in the future. In the event additional needs for cash arise, or if we refinance our existing debt, we may raise additional funds from a combination of sources, including the potential issuance of debt or equity securities. Additional financing might not be available on terms favorable to us, or at all. If adequate funds were not available or were not available on acceptable terms, our ability to take advantage of unanticipated opportunities or respond to competitive pressures could be limited.\n27\nTable of Contents\nSummary of Cash Flows\n \n \nNine Months Ended June 30,\nPeriod-to-Period Change\n \n2025\n2024\n \n(In thousands)\nCash provided by (used in):\nOperating activities\n$\n555,138 \n$\n406,486 \n$\n148,652 \nInvesting activities\n(30,390)\n(20,434)\n(9,956)\nFinancing activities\n(486,792)\n(364,981)\n(121,811)\nEffect of exchange rate changes on cash\n426 \n(1,806)\n2,232 \nIncrease in cash and cash equivalents\n$\n38,382 \n$\n19,265 \n19,117 \nCash Flows from Operating Activities\nOur primary method for funding operations and growth has been through cash flows generated from operating activities. Net cash provided by operating activities increased to $555.1 million during the nine months ended June 30, 2025 from $406.5 million during the nine months ended June 30, 2024. The $148.7 million increase was attributable to a $119.8 million increase in net income, a $19.1 million increase in non-cash items, and a $9.8 million increase due to the timing of receipts and payments in our ordinary course of business.\nCash Flows from Investing Activities\nNet cash used in investing activities increased to $30.4 million for the nine months ended June 30, 2025 from $20.4 million for the nine months ended June 30, 2024. The $10.0 million increase was primarily attributable to a $10.5 million increase in capitalized internal-use software costs.\nCash Flows from Financing Activities\nNet cash used in financing activities increased to $486.8 million for the nine months ended June 30, 2025 from $365.0 million for the nine months ended June 30, 2024. The $121.8 million increase was primarily attributable to a $1.2 billion increase in payments, net of proceeds, on our revolving line of credit and term loans, a $368.3 million increase in repurchases of common stock, a $66.0 million increase in taxes paid related to net share settlement of equity awards, and a $16.5 million increase in debt issuance costs, partially offset by the proceeds from issuance of $1.5 billion senior notes.\nRepurchases of Common Stock\nIn July 2024, our Board of Directors approved a stock repurchase program (the “July 2024 program”), replacing our previously authorized January 2024 stock repurchase program, which was terminated prior to its expiration. The July 2024 program was open-ended and authorized repurchases of shares of our common stock from time to time up to an aggregate cost of $1.0 billion in the open market or in negotiated transactions. In June 2025, our Board of Directors approved a new stock repurchase program (the “June 2025 program”), replacing the July 2024 program, which was terminated prior to its expiration. The June 2025 program is open-ended and authorizes repurchases of shares of our common stock from time to time up to an aggregate cost of $1.0 billion in the open market or in negotiated transactions. The June 2025 program remains in effect until the total authorized amount is expended or until further action by our Board of Directors. As of June 30, 2025, we had $880.1 million remaining under the June 2025 program. We expended $511.3 million and $878.1 million during the quarter and nine months ended June 30, 2025, respectively, under the July 2024 program and the June 2025 program. We expended $255.5 million and $506.8 million during the quarter and nine months ended June 30, 2024, respectively, under previously authorized stock repurchase programs.\n28\nTable of Contents\nRevolving Line of Credit\nOn May 13, 2025, we amended our credit agreement with a syndicate of banks, increasing our borrowing capacity under the unsecured revolving line of credit from $600 million to $1.0 billion and extending its maturity to May 13, 2030. Also on May 13, 2025, we repaid in full and terminated the $300 million unsecured term loan (the “$300 Million Term Loan”) and the $450 million unsecured term loan (the “$450 Million Term Loan”) outstanding under our credit agreement, utilizing proceeds from the issuance of the 2025 Senior Notes (as defined below). Borrowings under the revolving line of credit can be used for working capital and general corporate purposes and may also be used for the refinancing of existing debt, acquisitions, and the repurchase of our common stock. Interest rates on amounts borrowed under the revolving line of credit are based on (i) an adjusted base rate, which is the greatest of (a) the prime rate, (b) the Federal Funds rate plus 0.5%, and (c) the Daily Simple Secured Overnight Financing Rate (“SOFR”) plus 1%, plus, in each case, an applicable margin, (ii) the Daily Simple SOFR plus an applicable margin (or, if such rate is no longer available, a successor benchmark rate determined in accordance with the terms of the credit agreement), or (iii) term SOFR (without a credit spread adjustment) plus an applicable margin (or, if such rate is no longer available, a successor benchmark rate determined in accordance with the terms of the credit agreement). The applicable margin for base rate borrowings and for SOFR borrowings is determined based on our consolidated leverage ratio. The applicable margin for base rate borrowings ranges from 0% to 0.75% per annum and for SOFR borrowings ranges from 1% to 1.75% per annum. In addition, we must pay certain credit facility fees. The credit agreement contains certain restrictive covenants including a maximum consolidated leverage ratio of 3.5 to 1.0, subject to a step up to 4.0 to 1.0 following certain permitted acquisitions and subject to certain conditions, and contains other covenants typical of an unsecured credit facility.\nAs of June 30, 2025, there were no borrowings outstanding under the revolving line of credit and we were in compliance with all financial covenants under the credit agreement.\nSenior Notes\nOn May 8, 2018, we issued $400 million of senior notes in a private offering to qualified institutional investors (the “2018 Senior Notes”). The 2018 Senior Notes require interest payments semi-annually at a rate of 5.25% per annum and will mature on May 15, 2026. On December 6, 2019, we issued $350 million of senior notes in a private offering to qualified institutional investors (the “2019 Senior Notes”). The 2019 Senior Notes require interest payments semi-annually at a rate of 4.00% per annum and will mature on June 15, 2028. On December 17, 2021, we issued $550 million of additional senior notes of the same class as the 2019 Senior Notes in a private offering to qualified institutional investors (the “2021 Senior Notes”). The 2021 Senior Notes require interest payments semi-annually at a rate of 4.00% per annum and will mature on June 15, 2028, the same date as the 2019 Senior Notes. On May 13, 2025, we issued $1.5 billion of senior notes in a private offering to qualified institutional investors (the “2025 Senior Notes,” and collectively with the 2018 Senior Notes, the 2019 Senior Notes and the 2021 Senior Notes, the “Senior Notes”). The 2025 Senior Notes require interest payments semi-annually at a rate of 6.00% per annum and will mature on May 15, 2033. The indentures for the Senior Notes contain certain covenants typical of unsecured obligations. As of June 30, 2025, the carrying value of the Senior Notes was $2.8 billion and we were in compliance with all financial covenants under these obligations.\nCRITICAL ACCOUNTING ESTIMATES\nWe prepare our condensed consolidated financial statements in conformity with U.S. GAAP. These accounting principles require management to make certain judgments and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities as of the date of the condensed consolidated financial statements, and the reported amounts of revenues and expenses during the reporting period. We periodically evaluate our estimates including those relating to revenue recognition, goodwill resulting from business combinations and other long-lived assets — impairment assessment, share-based compensation, income taxes, and contingencies and litigation. We base our estimates on historical experience and various other assumptions that we believe to be reasonable based on the specific circumstances, the results of which form the basis for making judgments about the carrying value of certain assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates and such differences could be material to our financial condition and results of operations. Critical accounting estimates are those that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on our financial condition and results of operations.\nYou should carefully consider the critical accounting estimates disclosed in Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our Annual Report on Form 10-K for the fiscal year ended September 30, 2024 (“Annual Report on Form 10-K”). There have been no significant changes from the critical accounting estimates disclosed in our Annual Report on Form 10-K. \n29\nTable of Contents\nNew Accounting Pronouncements\nFor information about recent accounting pronouncements not yet adopted and the impact on our consolidated financial statements, refer to Part I, Item 1, “Unaudited Financial Statements,” Note 1, “Nature of Business” in our accompanying Notes to Condensed Consolidated Financial Statements."
}