{
  "item1": "Banking Solutions (1) Capital Market Solutions Total Consolidated Revenue During 2024, Company revised its previously issued consolidated financial statements annual periods ended December 31, 2023 2022, correct certain immaterial misstatements. See Note 24 consolidated financial statements information about revision prior-period consolidated financial statements. Banking Solutions (\"Banking\") Banking segment focused serving financial institutions core processing software, transaction processing software complementary applications services, many which interact directly core processing software. sell these solutions either bundled stand-alone basis.",
  "item7": "Management's Discussion Analysis Financial Condition Results Operations following section discusses management's view financial condition results operations FIS its consolidated subsidiaries December 31, 2024 2023, years ended December 31, 2024, 2023 2022, unless otherwise noted. section should read conjunction audited consolidated financial statements related notes included elsewhere Annual Report. Management's Discussion Analysis Financial Condition Results Operations contains forward-looking statements. See \"Statement Regarding Forward-Looking Information\" \" Annual Report discussion uncertainties, risks assumptions associated these forward-looking statements could cause future results differ materially those reflected section.",
  "item2": "Item 2. Management's Discussion Analysis Financial Condition Results Operations Unless stated otherwise context otherwise requires, all references \"FIS,\" \"we,\" \"our,\" \"us,\" \"Company\" \"registrant\" Fidelity National Information Services, Inc., Georgia corporation, its subsidiaries. Actual results, performance achievement could differ materially these forward-looking statements. risks uncertainties which forward-looking statements subject include following, without limitation: changes general economic, business political conditions, recession, intensified expanded international hostilities, acts terrorism, increased rates inflation interest, effects announced future tariff increases any resulting regulatory changes global trade relations, changes consumer business confidence; changes either both United States international lending, capital financial markets currency fluctuations; risk acquired businesses will not integrated successfully integration will more costly more time-consuming complex than anticipated; risk cost savings synergies anticipated realized acquisitions may not fully realized may take longer realize than expected costs may greater than anticipated; risks doing business internationally; effect legislative initiatives proposals, statutory changes, governmental applicable regulations and/or changes industry requirements, including privacy, data protection, cybersecurity, cyber resilience AI laws regulations; ability comply climate change legal regulatory requirements maintain practices meet stakeholders' evolving expectations; risks reduction revenue elimination existing potential customers due consolidation in, new laws regulations affecting, banking, retail financial services industries due financial failures other setbacks suffered firms those industries; changes growth rates markets solutions; amount, declaration payment future dividends discretion Board Directors depends on, among other things, investment opportunities, results operations, financial condition, cash requirements, future prospects, other factors may considered relevant Board Directors, including legal contractual restrictions; amount timing any future share repurchases subject to, among other things, share price, other investment opportunities cash requirements, results operations financial condition, future prospects other factors may considered relevant Board Directors management; failures adapt solutions changes technology marketplace; internal external security privacy breaches systems, including those relating unauthorized access, theft, corruption loss personal information computer viruses other malware affecting software platforms, reactions customers, card associations, government regulators others any such events; risk implementation software, including software updates, customers customer locations employee error monitoring software platforms may result corruption loss data customer information, interruption business operations, outages, exposure liability claims loss customers; risk partners third parties may fail satisfy legal obligations us; risks associated managing pension cost, cybersecurity issues, outages data privacy; ability navigate opportunities risks associated using and/or incorporating AI technologies into business; reaction current potential customers communications us regulators regarding information security, risk management, internal audit other matters; risk pending acquisition Issuer Solutions will not completed will not provide expected benefits, including anticipated cost revenue synergies, within expected timeframe, full all; risk integration Issuer Solutions will more difficult, time-consuming expensive than anticipated; competitive pressures pricing related decreasing number community banks U.S., development new disruptive technologies competing one more solutions, increasing presence international competitors U.S."
}