{
  "source_file": "fis-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nUnless stated otherwise or the context otherwise requires, all references to \"FIS,\" \"we,\" \"our,\" \"us,\" the \"Company\" or the \"registrant\" are to Fidelity National Information Services, Inc., a Georgia corporation, and its subsidiaries.\nThe following discussion should be read in conjunction with Item 1. Condensed Consolidated Financial Statements (Unaudited) and the Notes thereto included elsewhere in this report. The statements contained in this Form 10-Q or in our other documents or in oral presentations or other management statements that are not purely historical are forward-looking statements within the meaning of the U.S. federal securities laws. Statements that are not historical facts, as well as other statements about our expectations, beliefs, intentions, or strategies regarding the future, or other characterizations of future events or circumstances, are forward-looking statements. Forward-looking statements include statements about anticipated financial outcomes, including any earnings outlook or projections, projected revenue or expense synergies or dis-synergies, business and market conditions, outlook, foreign currency exchange rates, deleveraging plans, expected dividends and share repurchases of the Company, the Company's sales pipeline and anticipated profitability and growth, plans, strategies and objectives for future operations, strategic value creation, risk profile and investment strategies, any statements regarding future economic conditions or performance and any statements with respect to the future impacts of the pending acquisition of Global Payments' Issuer Solutions business (\"Issuer Solutions\") and the pending sale of our remaining equity interest in Worldpay. These statements may be identified by words such as \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"believe,\" \"will,\" \"should,\" \"could,\" \"would,\" \"project,\" \"continue,\" \"likely,\" and similar expressions, and include statements reflecting future results or outlook, statements of outlook and various accruals and estimates. These statements relate to future events and our future results and involve a number of risks and uncertainties. Forward-looking statements are based on management's beliefs as well as assumptions made by, and information currently available to, management.\nActual results, performance or achievement could differ materially from these forward-looking statements. The risks and uncertainties to which forward-looking statements are subject include the following, without limitation:\n•\nchanges in general economic, business and political conditions, a recession, intensified or expanded international hostilities, acts of terrorism, increased rates of inflation or interest, effects of announced or future tariff increases and any resulting regulatory changes in global trade relations, changes in consumer or business confidence;\n•\nchanges in either or both the United States and international lending, capital and financial markets or currency fluctuations;\n•\nthe risk that acquired businesses will not be integrated successfully or that the integration will be more costly or more time-consuming and complex than anticipated;\n•\nthe risk that cost savings and synergies anticipated to be realized from acquisitions may not be fully realized or may take longer to realize than expected or that costs may be greater than anticipated;\n•\nthe risks of doing business internationally;\n•\nthe effect of legislative initiatives or proposals, statutory changes, governmental or applicable regulations and/or changes in industry requirements, including privacy, data protection, cybersecurity, cyber resilience and AI laws and regulations; \n•\nour ability to comply with climate change legal and regulatory requirements and to maintain practices that meet our stakeholders' evolving expectations;\n•\nthe risks of reduction in revenue from the elimination of existing and potential customers due to consolidation in, or new laws or regulations affecting, the banking, retail and financial services industries or due to financial failures or other setbacks suffered by firms in those industries; \n•\nchanges in the growth rates of the markets for our solutions; \n•\nthe amount, declaration and payment of future dividends is at the discretion of our Board of Directors and depends on, among other things, our investment opportunities, results of operations, financial condition, cash requirements, future prospects, and other factors that may be considered relevant by our Board of Directors, including legal and contractual restrictions;\n•\nthe amount and timing of any future share repurchases is subject to, among other things, our share price, our other investment opportunities and cash requirements, our results of operations and financial condition, our future prospects and other factors that may be considered relevant by our Board of Directors and management;\n•\nfailures to adapt our solutions to changes in technology or in the marketplace; \n•\ninternal or external security or privacy breaches of our systems, including those relating to unauthorized access, theft, corruption or loss of personal information and computer viruses and other malware affecting our software or platforms, and the reactions of customers, card associations, government regulators and others to any such events; \n•\nthe risk that implementation of software, including software updates, for customers or at customer locations or employee error in monitoring our software and platforms may result in the corruption or loss of data or customer information, interruption of business operations, outages, exposure to liability claims or loss of customers; \n31\nTable of Contents\n•\nthe risk that partners and third parties may fail to satisfy their legal obligations to us;\n•\nrisks associated with managing pension cost, cybersecurity issues, IT outages and data privacy;\n•\nour ability to navigate the opportunities and risks associated with using and/or incorporating AI technologies into our business;\n•\nthe reaction of current and potential customers to communications from us or regulators regarding information security, risk management, internal audit or other matters; \n•\nthe risk that the pending acquisition of Issuer Solutions will not be completed or will not provide the expected benefits, including the anticipated cost or revenue synergies, within the expected timeframe, in full or at all;\n•\nthe risk that the integration of Issuer Solutions will be more difficult, time-consuming or expensive than anticipated;\n•\ncompetitive pressures on pricing related to the decreasing number of community banks in the U.S., the development of new disruptive technologies competing with one or more of our solutions, increasing presence of international competitors in the U.S. market and the entry into the market by global banks and global companies with respect to certain competitive solutions, each of which may have the impact of unbundling individual solutions from a comprehensive suite of solutions we provide to many of our customers;\n•\nthe failure to innovate in order to keep up with new emerging technologies, which could impact our solutions and our ability to attract new, or retain existing, customers; \n•\nan operational or natural disaster at one of our major operations centers; \n•\nfailure to comply with applicable requirements of payment networks or changes in those requirements;\n•\nfraud by bad actors; and \n•\nother risks detailed elsewhere in the \"Risk Factors\" section and other sections of this report, and in our other filings with the Securities and Exchange Commission.\nOther unknown or unpredictable factors also could have a material adverse effect on our business, financial condition, results of operations and prospects. Accordingly, readers should not place undue reliance on these forward-looking statements. These forward-looking statements are inherently subject to uncertainties, risks and changes in circumstances that are difficult to predict. Except as required by applicable law or regulation, we do not undertake (and expressly disclaim) any obligation and do not intend to publicly update or review any of these forward-looking statements, whether as a result of new information, future events or otherwise.\nRevision of Prior-Period Consolidated Financial Statements\nDuring the third quarter of 2024, we identified immaterial misstatements affecting the Company’s previously issued consolidated financial statements as of and for the annual periods ended December 31, 2023 and 2022, and the quarterly periods ended March 31 and June 30, 2024. The misstatements related primarily to the timing of the recognition of expenses associated with inventory-related accruals, along with their related balance sheet impacts, and the presentation of certain value-added tax balances in the consolidated financial statements. We have revised our prior-period financial statements to correct these misstatements as well as other unrelated immaterial misstatements, including adjustments to Revenue and Other income (expense), net. The revisions ensure comparability across all periods reflected herein. \nOverview\nAbout FIS\nFIS is a financial technology company providing solutions to financial institutions, businesses and developers. We unlock financial technology to the world across the money lifecycle underpinning the world's financial systems. Our people are dedicated to advancing the way the world pays, banks and invests, by helping our clients to confidently run, grow and protect their businesses. Our expertise comes from decades of experience helping financial institutions and businesses of all sizes adapt to meet the needs of their customers by harnessing where reliability meets innovation in financial technology. Headquartered in Jacksonville, Florida, FIS is a member of the Fortune 500® and the Standard & Poor’s 500® Index. FIS is incorporated under the laws of the State of Georgia as Fidelity National Information Services, Inc., and our stock is traded under the trading symbol \"FIS\" on the New York Stock Exchange.\nGrowth and Strategy Objectives\nOur growth has been driven by a number of factors, including growth of our customers' businesses, our internal development of new solutions that enhance our client offerings, and our sales and marketing efforts to expand our customer base and addressable markets. Acquisitions have also contributed additional solutions that complement or enhance our \n32\nTable of Contents\nofferings, diversify our client base, expand our geographic coverage, and provide entry into new and attractive adjacent markets that align with our strategic objectives. We continue to strategically allocate resources to both internal and external growth initiatives to enhance the long-term value of our business.\n2024 Worldpay Sale \nOn January 31, 2024, we completed the sale (the \"2024 Worldpay Sale\") of a 55% equity interest in our Worldpay Merchant Solutions business to private equity funds managed by GTCR, LLC (such funds, the \"Buyer\"). FIS retained a non-controlling 45% equity interest in a new standalone joint venture, Worldpay Holdco, LLC (\"Worldpay\"), following the closing of the 2024 Worldpay Sale. Worldpay continues to provide merchant acquiring and related services to businesses of all sizes and across any industry globally, enabling them to accept, authorize and settle electronic payment transactions. \nPending Acquisition of Issuer Solutions Business and Sale of Remaining Equity Interest in Worldpay\nAs previously disclosed, on April 17, 2025, FIS entered into a transaction agreement pursuant to which FIS has agreed to buy the Issuer Solutions business (\"Issuer Solutions\") from Global Payments Inc. (\"Global Payments\") for an enterprise value of $13.5 billion, inclusive of $1.5 billion of anticipated net present value of tax assets, or a net purchase price of $12.0 billion, subject to customary adjustments (the \"Issuer Solutions Acquisition\"). As consideration for the Issuer Solutions Acquisition, FIS has agreed to sell to Global Payments all of its equity interests in Worldpay for a pre-tax value of $6.6 billion, net of transaction fees and other costs, and to pay the remainder of the purchase price in cash. FIS intends to fund the cash portion of the purchase price with approximately $8.0 billion of new debt and on May 1, 2025, FIS entered into a fully committed term loan facility pursuant to which it can draw up to an aggregate principal amount of $8 billion of senior secured term loans to fund the acquisition, subject to certain conditions. The transaction is expected to close in the first quarter of 2026, subject to regulatory approvals and other customary closing conditions. For additional details regarding these transactions, refer to FIS' Current Report on Form 8-K filed with the SEC on April 21, 2025, and to Note 1 of the consolidated financial statements.\nBusiness Trends and Conditions\nRevenue Sources and Markets\nOur revenue from continuing operations is primarily derived from a combination of technology and processing solutions, transaction processing fees, professional services and software license fees. While we are a global company and do business around the world, the majority of our revenue is generated by clients in the U.S. The majority of our international revenue is generated by clients in the United Kingdom, Germany, Canada, Australia, Switzerland, France, Netherlands and Brazil. In addition, the majority of our revenue has historically been recurring under multi-year Banking and Capital Markets contracts that contribute relative stability to our revenue stream. These solutions, in general, are considered critical to our clients' operations. Professional services revenue is typically non-recurring, though recognition often occurs over time rather than at a point in time. Sales of software licenses are typically non-recurring with point-in-time recognition and are less predictable. \nEconomic Trends\nWe are experiencing relatively stable sales cycles and levels of client activity across our businesses. We have experienced, and continue to experience, relatively high inflation in our primary markets over the medium-term cycle. Relatively high interest rates have had, and may continue to have, a negative impact on our interest expense. During 2024, we used a portion of the net proceeds from the 2024 Worldpay Sale to repay our borrowings under our commercial paper programs and reduce our long-term debt, which has decreased our interest expense from previous levels. However, we expect to incur approximately $8.0 billion of new debt upon closing of the Issuer Solutions Acquisition expected in the first quarter of 2026, as further discussed in Note 1 to the consolidated financial statements. Given the volatility of exchange rates and the mix of currencies involved in both revenues and expenses, the direction and magnitude of future effects of currency fluctuations are uncertain. \nWe continue to  monitor the potential impacts of recently enacted and potential future tariff regimes in the U.S. and overseas. As of September 30, 2025, tariffs have not had a significant impact on our financial condition or results of operations.\n2024 Worldpay Sale\nThe Company completed the 2024 Worldpay Sale on January 31, 2024, for cash consideration in a transaction valuing the Worldpay Merchant Solutions business at an enterprise value of $18.5 billion, including $1.0 billion of consideration contingent on the returns realized by Buyer exceeding certain thresholds, which contingent consideration FIS no longer expects to receive as a result of the pending sale of its remaining equity interest in Worldpay, as discussed above. The net cash proceeds received by FIS at the closing were greater than $12 billion, net of estimated closing adjustments, debt restructuring fees, taxes and \n33\nTable of Contents\ntransaction costs. We used the proceeds from the 2024 Worldpay Sale in 2024 primarily to retire debt and repurchase shares as well as for general corporate purposes. In connection with the 2024 Worldpay Sale, FIS and Worldpay entered into commercial agreements, preserving a key value proposition for clients of both businesses and minimizing potential dis-synergies. FIS and Worldpay also entered into additional agreements as described in Note 3 to the consolidated financial statements. We account for our non-controlling 45% equity interest in Worldpay using the equity method of accounting, and our share of the net income of Worldpay subsequent to the sale is reported as Equity method investment earnings (loss), net of tax, in our consolidated statements of earnings (loss).\nAs a result of the 2024 Worldpay Sale, we recorded a cumulative loss on sale of $578 million during 2024. During 2024, we\n also recorded a cumulative tax benefit of \n$1.1 billion,\n primarily from the release of U.S. deferred tax liabilities that were not transferred in the 2024 Worldpay Sale, net of the then-estimated U.S. tax cost of the 2024 Worldpay Sale. See \nPending Sale of Remaining Equity Interest in Worldpay\n, below, for discussion of subsequent changes to our U.S. deferred tax liabilities \narising from our agreement to sell our remaining interest in Worldpay\n.\nPending Sale of Remaining Equity Interest in Worldpay\nUpon closing of the pending sale of our remaining equity interest in Worldpay, we expect to record a gain equal to the excess of the estimated $6.6 billion pre-tax net selling price over the carrying value of the Worldpay equity method investment as of the date of closing, adjusted for the impact of our share of Worldpay's cumulative translation adjustments recorded as other comprehensive earnings (loss). The carrying value of the Worldpay equity method investment, which was $3.8 billion as of September 30, 2025, will continue to be adjusted for our equity method investment earnings (loss) before application of investor-level taxes and for our pro rata share of the investee's other comprehensive earnings (loss) as well as for any distributions received from our equity method investment. \nOur investor-level tax for the nine months ended September 30, 2025, includes $539 million of expense recorded during the second quarter related to a remeasurement of our deferred tax liability. This remeasurement resulted from our agreement to sell our remaining interest in Worldpay, which constituted a change in our intent to hold the investment for the long term.\nInvestments in Innovation\nWe continue to assist financial institutions and other businesses in migrating to outsourced integrated technology solutions to improve their profitability and address increasing and ongoing regulatory requirements. We believe our integrated solutions and outsourced services are well-positioned to address this outsourcing trend across the markets we serve.\nWe continue to invest in modernization, innovation and integrated solutions to meet the demands of the markets we serve and to compete with global banks, financial and other technology providers, and emerging technology innovators. We invest both internally and through investment opportunities in companies building complementary technologies in the financial services space. Our internal development activities have related primarily to the modernization of our proprietary core systems in each of our segments, design and development of next-generation digital and innovative solutions and development of processing systems and related software applications and risk management platforms. We expect to continue to invest an appropriate level of resources to maintain, enhance and extend the functionality of our proprietary systems and existing software applications, to develop new and innovative software applications and systems to address emerging technology trends in response to the needs of our clients, and to enhance the capabilities of our outsourcing infrastructure.\nDigital One Platform\nConsumer preference, particularly in younger generations, continues to shift to digital-first banking solutions. It is increasingly clear that a priority for our clients is to provide a unified, engaging and inclusive banking experience powered by digital capabilities across all channels and customer activities. Our Digital One platform helps our clients, from top-tier large financial institutions with over $10 billion in assets to top-tier and mid-tier community banks, provide a set of modern digital solutions to support all customer types, including retail consumers, sole proprietors, small businesses and large corporations, through any channel, including desktop, tablet, smartphone, and branch. The uniform customer experience extends to support a broad range of financial services including opening new accounts, servicing existing accounts, money movement, and personal financial management, as well as other consumer, small business and commercial banking capabilities. The Digital One platform is host-agnostic, and our digital suite has been enabled across multiple FIS core banking platforms, including IBS, Horizon, Modern Banking Platform, AffinityEdge, and Systematics, in addition to non-FIS platforms run by banking financial institutions who demand market-leading digital capabilities.\n34\nTable of Contents\nBanking Industry Consolidation\nConsolidation within the banking industry has occurred and may continue to occur, primarily in the form of merger and acquisition activity among financial institutions, which generally increases competition among financial technology providers. However, consolidation resulting from specific merger and acquisition transactions may be beneficial to our business. When consolidations of financial institutions occur, merger partners often operate systems obtained from competing service providers. The newly formed entity generally makes a determination to migrate its core and payments systems to a single platform. When a financial institution processing client is involved in a consolidation, we may benefit if the client retains our solutions and expands the use of them following the consolidation to support the newly combined entity. Conversely, we may lose revenue if our solutions are not chosen to support the newly combined entity. It is also possible that larger financial institutions resulting from consolidation may have greater leverage in negotiating terms or could decide to perform in-house some or all of the solutions that we currently provide or could provide. We seek to mitigate the risks of consolidations by offering other competitive solutions to take advantage of specific opportunities at the surviving company. \nDemand in the Payments Market\nWe continue to see demand in the payments market for innovative solutions that will deliver faster, more convenient payment options in mobile channels, internet applications, in-store cards, and digital currencies. The payment processing industry is adopting new technologies, developing new solutions, evolving new business models, and is being affected by new market entrants and by an evolving regulatory environment. As financial institutions respond to these changes by seeking solutions to help them enhance their own offerings to consumers, including the ability to accept card-not-present payments in eCommerce and mobile environments, as well as contactless cards and mobile wallets at the point of sale, FIS believes that payment processors will seek to develop additional capabilities in order to serve clients' evolving needs. To facilitate this expansion, we believe that payment processors will need to enhance their technology platforms so they can deliver these capabilities and differentiate their offerings from other providers.\nWe believe that these market changes present both an opportunity and a risk for us, and we cannot predict which emerging technologies or solutions will be successful. However, FIS believes that payment processors, like FIS, that have scalable, integrated business models, provide solutions across the payment processing value chain and utilize broad distribution capabilities will be best-positioned to enable emerging alternative electronic payment technologies in the long term. Further, FIS believes that its depth of capabilities and breadth of distribution will enhance its position as emerging payment technologies are adopted by merchants and other businesses. FIS' ability to partner with non-financial institution enterprises, such as mobile payment providers and internet, retail and social media companies, continues to create attractive growth opportunities as these new entrants seek to become more active participants in the development of alternative electronic payment technologies and to facilitate the convergence of retail, online, mobile and social commerce applications.\nCybersecurity Threats and Solutions\nCyberattacks on information technology systems and the vendors and technological supply chain on which they rely continue to grow in frequency, complexity and sophistication, including the increasing use of artificial intelligence by threat actors. This is a trend we expect to continue with widespread impacts, including direct attacks on FIS, our supply chain partners, or our clients. The continued growth in the frequency, complexity and sophistication of cyberattacks, coupled with the continued interconnection in the global technology ecosystem, present both a threat and an opportunity for FIS. Using expertise we have gained from our ongoing focus and investment, we have developed and we offer fraud, security, risk management and compliance solutions to target this growth opportunity in the financial services industry. We also use certain of these solutions to manage our own risks. \nCritical Accounting Policies and Estimates\nThere have been no significant changes to our critical accounting policies and estimates as disclosed in our Annual Report on Form 10-K for the year ended December 31, 2024.\n35\nTable of Contents\nConsolidated Results of Operations - Comparisons of three-month and nine-month periods ended September 30, 2025 and 2024\nThree months ended September 30,\nNine months ended September 30,\n$\n%\n$\n%\n \n2025\n2024\nChange\nChange\n2025\n2024\nChange\nChange\n(In millions)\n(In millions)\nRevenue\n$\n2,717 \n$\n2,570 \n$\n147 \n6 \n%\n$\n7,865 \n$\n7,528 \n$\n337 \n4 \n%\nCost of revenue\n(1,689)\n(1,593)\n(96)\n6 \n(5,006)\n(4,700)\n(306)\n7 \nGross profit\n1,028 \n977 \n51 \n5 \n2,859 \n2,828 \n31 \n1 \nGross profit margin\n38 \n%\n38 \n%\n36 \n%\n38 \n%\nSelling, general and administrative expenses\n(584)\n(521)\n(63)\n12 \n(1,713)\n(1,703)\n(10)\n1 \nAsset impairments\n(2)\n(2)\n— \nNM\n(4)\n(20)\n16 \nNM\nOther operating (income) expense, net - related party\n(15)\n(36)\n21 \nNM\n(70)\n(110)\n40 \nNM\nOperating income\n$\n457 \n$\n490 \n(33)\n(7)\n$\n1,212 \n$\n1,215 \n(3)\n— \nOperating margin\n17 \n%\n19 \n%\n15 \n%\n16 \n%\nNM = Not meaningful\nRevenue\nRevenue for the three and nine months ended September 30, 2025, increased primarily due to recurring revenue growth in both the Banking and Capital Markets segments. Recurring revenue growth was driven by broad-based growth across the Banking portfolio, led by our core and digital and payments businesses, and by the implementation of new Capital Markets sales. Revenue growth for the three and nine months ended September 30, 2025, was partially offset by a decrease in our Corporate and Other segment primarily due to the divestiture of a non-strategic business during the first quarter of 2025, as well as a decrease of non-recurring revenue in our remaining non-strategic businesses. See \"Segment Results of Operations\" below for a more detailed explanation.\nCost of Revenue, Gross Profit and Gross Profit Margin\nCost of revenue for the three and nine months ended September 30, 2025, increased primarily due to increased direct cost of revenue associated with higher transaction volumes and higher amortization of internally developed software. Gross profit margin for the three months ended September 30, 2025, was flat year over year, as the cost of revenue increases noted above were in-line with the rate of revenue growth compared to the prior year. Gross profit margin for the nine months ended September 30, 2025, decreased primarily due to the increased indirect cost of revenue noted above.\nSelling\n, \nGeneral and Administrative Expenses\nSelling, general and administrative expenses for the three and nine months ended September 30, 2025, increased primarily due to higher net personnel costs, including an increase in one-time severance costs incurred as part of our enterprise-wide cost savings initiatives, as well as an increase in the amortization of deferred commissions. Selling, general and administrative expenses for the nine months ended September 30, 2025, were partially offset by lower advisory fees associated with the Worldpay Sale and other transformation activities.\nAsset Impairments\nThere were no material impairments during the three and nine months ended September 30, 2025. The three and nine months ended September 30, 2024, included impairments primarily related to the termination of certain internally developed software projects.\nOther operating (income) expense, net - related party\nAs described in Note 3 to the consolidated financial statements, under the terms of the Worldpay TSA, during the three- and nine-month periods ended September 30, 2025 and 2024, the Company provided technology infrastructure, risk and security, accounting and various other corporate services to Worldpay. The income received for these services is recorded in \n36\nTable of Contents\nOther operating (income) expense, net - related party, and the corresponding expenses are recognized in Cost of revenue and Selling, general and administrative expense in the consolidated statements of earnings (loss).\nOperating Income and Operating Margin\nThe change in operating income and operating margin for the three and nine months ended September 30, 2025, resulted from the revenue and cost variances noted above. \nTotal Other Income (Expense), Net\nThree months ended September 30,\nNine months ended September 30,\n$\n%\n$\n%\n2025\n2024\nChange\nChange\n2025\n2024\nChange\nChange\nOther income (expense):\n(In millions)\n(In millions)\nInterest expense, net\n$\n(90)\n$\n(64)\n$\n(26)\n41 \n%\n$\n(279)\n$\n(184)\n$\n(95)\n52%\nOther income (expense), net\n8 \n(38)\n46 \nNM\n(188)\n(222)\n34 \nNM\nTotal other income (expense), net\n$\n(82)\n$\n(102)\n20 \nNM\n$\n(467)\n$\n(406)\n(61)\nNM\nNM = Not meaningful\nInterest expense (net) for the three and nine months ended September 30, 2025, increased primarily due to a decrease in interest income, which was higher in the three and nine months ended September 30, 2024, as a result of unused proceeds from the 2024 Worldpay Sale. Interest expense (net) for the nine months ended September 30, 2025, also included bridge facility fees incurred to secure funding for the pending Issuer Solutions Acquisition, as discussed in Note 1 to the consolidated financial statements. \nOther income (expense), net for the periods presented consists of various income and expense items outside of the Company's operating activities, including foreign currency transaction remeasurement gains and losses; realized and unrealized gains and losses on equity security investments, including impairment losses on these investments; and fair value adjustments on certain non-operating assets and liabilities, including certain derivatives, as further described in Note 9 to the consolidated financial statements. \nThe nine-month period ended September 30, 2025, included primarily the impact of a $(108) million write-off of the contingent consideration included as part of the 2024 Worldpay Sale, which write-off was triggered by the Worldpay Minority Interest Sale agreement, and a change in fair value of interest rate swaps accounted for as economic hedges, each as discussed in Note 9 to the consolidated financial statements, as well as foreign currency transaction remeasurement losses. The nine-month period ended September 30, 2024, also included loss on extinguishment of debt of approximately $(174) million, as discussed in Note 8 to the consolidated financial statements.\nProvision (Benefit) for Income Taxes\nThree months ended September 30,\nNine months ended September 30,\n$\n%\n$\n%\n2025\n2024\nChange\nChange\n2025\n2024\nChange\nChange\n(In millions)\n(In millions)\nProvision (benefit) for income taxes\n$\n87 \n$\n108 \n$\n(21)\nNM\n$\n179 \n$\n215 \n$\n(36)\nNM\nEffective tax rate\n23 \n%\n28 \n%\n24 \n%\n27 \n%\nNM = Not meaningful\nThe decrease in the effective tax rate for the three and nine months ended September 30, 2025, was primarily driven by decreases to income tax on foreign operations. As described in Note 2 to the consolidated financial statements, the Company reflects its investor-level tax impact relating to equity method investments as a component of Equity method investment earnings (loss), net of tax in the consolidated statements of earnings (loss). Therefore, equity method investment earnings (loss) and the related investor-level tax are excluded from the calculation of FIS' annual effective tax rate.\n37\nTable of Contents\nEquity Method Investment Earnings (Loss)\nThree months ended September 30,\nNine months ended September 30,\n$\n%\n$\n%\n2025\n2024\nChange\nChange\n2025\n2024\nChange\nChange\n(In millions)\n(In millions)\nEquity method investment earnings (loss), net of tax\n$\n(23)\n$\n(33)\n$\n10 \nNM\n$\n(692)\n$\n(110)\n$\n(582)\nNM\nNM = Not meaningful\nAs discussed in Note 1 to the consolidated financial statements, the Company completed the 2024 Worldpay Sale on January 31, 2024, retaining a non-controlling equity interest in Worldpay. We account for our 45% equity interest in Worldpay using the equity method of accounting. Beginning on February 1, 2024, our share of the net income of Worldpay is reported as Equity method investment earnings (loss), net of tax, in the consolidated statements of earnings (loss) and reflects FIS' investor-level tax impact on its investment in Worldpay. The investor-level tax for the nine months ended September 30, 2025, includes $539 million of expense recorded during the second quarter related to a remeasurement of the Company's deferred tax liability. This remeasurement resulted from the Company's agreement to sell our remaining interest in Worldpay, which constituted a change in our intent to hold the investment for the long term. In accordance with the provisions of ASC 740, the deferred tax liability recognized in connection with our Worldpay equity method investment reflects the difference between the investment's current book value and its tax basis. See Note 3 to the consolidated financial statements for summary Worldpay financial information.\nDiscontinued Operations\nAs discussed in Note 1 to the consolidated financial statements, the Company completed the 2024 Worldpay Sale on January 31, 2024. The results of the Worldpay Merchant Solutions business prior to the completion of the 2024 Worldpay Sale have been presented as discontinued operations. For the three- and nine-month periods ended September 30, 2025, there was no revenue or pretax earnings from discontinued operations. For the three- and nine-month periods ended September 30, 2024, revenues from discontinued operations were $3 million and $409 million, respectively, and pretax earnings (loss) were $0 million and $184 million, respectively. An initial loss on sale of disposal group of $466 million was recorded upon closing of the 2024 Worldpay Sale to reflect the impact of the excess of the carrying value of the disposal group over the estimated fair value less cost to sell. During the three months ended September 30, 2024, an additional $25 million estimated loss on sale was recorded to reflect the impact of estimated post-closing adjustments, reflecting a cumulative estimated loss on sale of $491 million. For the nine-month period ended September 30, 2024\n, the Company recorded a tax benefit of \n$991 million\n, primarily from the write-off of U.S. deferred tax liabilities that were not transferred in the 2024 Worldpay Sale, net of the then-estimated U.S. tax cost of the 2024 Worldpay Sale.\nSegment Results of Operations - Comparisons of three- and nine-month periods ended September 30, 2025 and 2024\nFIS reports its financial performance based on the following segments: Banking Solutions, Capital Market Solutions, and Corporate and Other. \nAdjusted EBITDA is reported to our chief operating decision maker, the Company's Chief Executive Officer and President, who utilizes the measure for purposes of making decisions about allocating resources to the segments and assessing their performance. For this reason, Adjusted EBITDA, as it relates to our segments, is presented in conformity with FASB ASC Topic 280, \nSegment Reporting\n. Adjusted EBITDA is defined as net earnings (loss) before net interest expense, net other income (expense), income tax provision (benefit), equity method investment earnings (loss), and depreciation and amortization, and excludes certain costs that do not constitute normal, recurring, cash operating expenses necessary to operate our business. These excluded costs generally include purchase price amortization of acquired intangible assets, as well as acquisition, integration and certain other costs and asset impairments. These excluded costs are recorded in the Corporate and Other segment. Adjusted EBITDA for the respective segments excludes the foregoing items. Financial information, including details of Adjusted EBITDA, for each of our segments is set forth in Note 12 to the consolidated financial statements.\n38\nTable of Contents\nBanking Solutions\nThree months ended September 30,\nNine months ended September 30,\n$\n%\n$\n%\n \n2025\n2024\nChange\nChange\n2025\n2024\nChange\nChange\n \n(In millions)\n(In millions)\nRevenue\n$\n1,894 \n$\n1,779 \n$\n115 \n6 \n%\n$\n5,420 \n$\n5,174 \n$\n246 \n5 \n%\nAdjusted EBITDA\n$\n868 \n$\n804 \n64 \n8 \n$\n2,345 \n$\n2,301 \n44 \n2 \nAdjusted EBITDA margin\n45.8 \n%\n45.2 \n%\n43.3 \n%\n44.5 \n%\nAdjusted EBITDA margin basis points change\n60\n(120)\nThree months ended September 30:\nRevenue in our Banking segment increased 6% for the three months ended September 30, 2025, driven primarily by recurring revenue, which grew 6% from broad-based growth across the portfolio, led by our core and digital and payments businesses.\nAdjusted EBITDA increased year over year due to higher revenue and improved EBITDA margin. Adjusted EBITDA margin increased year over year due to continued cost discipline. \nNine months ended September 30:\nRevenue in our Banking segment increased 5% for the nine months ended September 30, 2025, driven primarily by recurring revenue, which grew 5% from broad-based growth across the portfolio, led by our core and digital and payments businesses.\nAdjusted EBITDA increased year-over-year due to higher revenue. Adjusted EBITDA margin decreased year over year primarily due to unfavorable revenue mix.\nCapital Market Solutions\nThree months ended September 30,\nNine months ended September 30,\n$\n%\n$\n%\n \n2025\n2024\nChange\nChange\n2025\n2024\nChange\nChange\n \n(In millions)\n(In millions)\nRevenue\n$\n783 \n$\n730 \n$\n53 \n7 \n%\n$\n2,313 \n$\n2,158 \n$\n155 \n7 \n%\nAdjusted EBITDA\n$\n396 \n$\n364 \n32 \n9 \n$\n1,150 \n$\n1,066 \n84 \n8 \nAdjusted EBITDA margin\n50.5 \n%\n49.9 \n%\n49.7 \n%\n49.4 \n%\nAdjusted EBITDA margin basis points change\n60\n30 \nThree months ended September 30:\nRevenue in our Capital Markets segment increased 7% for the three months ended September 30, 2025, driven primarily by recurring revenue which grew 8% largely from the implementation of new sales, favorable pricing and acquisitions.\nAdjusted EBITDA increased year over year due to higher revenue and improved EBITDA margin. Adjusted EBITDA margin increased year over year primarily due to cost management and favorable revenue mix, partially offset by the dilutive impact of a business acquired in December 2024.\nNine months ended September 30:\nRevenue in our Capital Markets segment increased 7% for the nine months ended September 30, 2025, driven primarily by recurring revenue which grew 6% largely from the implementation of new sales, favorable pricing and acquisitions.\n39\nTable of Contents\nAdjusted EBITDA increased year over year due to higher revenue and improved EBITDA margin. Adjusted EBITDA margin increased year over year primarily due to cost management and favorable revenue mix, partially offset by the dilutive impact of a business acquired in December 2024.\nCorporate and Other\nThe Corporate and Other segment results consist of selling, general and administrative expenses and depreciation and amortization not otherwise allocated to the reportable segments. Corporate and Other also includes operations from certain non-strategic businesses.\nThree months ended September 30,\nNine months ended September 30,\n$\n%\n$\n%\n \n2025\n2024\nChange\nChange\n2025\n2024\nChange\nChange\n \n(In millions)\n(In millions)\nRevenue\n$\n40 \n$\n61 \n$\n(21)\n(34)\n%\n$\n132 \n$\n196 \n$\n(64)\n(33)\n%\nAdjusted EBITDA\n$\n(129)\n$\n(108)\n(21)\n19 \n$\n(361)\n$\n(346)\n(15)\n4 \nThree months ended September 30:\nRevenue in our Corporate and Other segment decreased 34% for the three months ended September 30, 2025, primarily due to the divestiture of a non-strategic business during the first quarter of 2025, as well as a decrease of non-recurring revenue in our remaining non-strategic businesses.\nAdjusted EBITDA decreased compared to the prior year primarily due to higher corporate costs, including a reduction in income from the Worldpay TSA recognized as a contra-expense.\nNine months ended September 30:\nRevenue in our Corporate and Other segment decreased 33% for the nine months ended September 30, 2025, primarily due to the divestiture of a non-strategic business during the first quarter of 2025, as well as a decrease of non-recurring revenue in our remaining non-strategic businesses.\nAdjusted EBITDA decreased compared to the prior year primarily due to higher corporate costs, including a reduction in income from the Worldpay TSA recognized as a contra-expense.\nLiquidity and Capital Resources\nCash Requirements\nOur principal ongoing cash requirements include operating expenses, income taxes, debt service payments, capital expenditures, stockholder dividends, working capital and timing differences in settlement-related assets and liabilities and may include discretionary debt repayments, share repurchases and business acquisitions. Our principal sources of funds are cash generated by operations and borrowings, including the capacity under our Revolving Credit Facility, the U.S. commercial paper program and the Euro-commercial paper program discussed in Note 8 to the consolidated financial statements.\nAs of September 30, 2025, the Company had $2.9 billion of available liquidity, including $571 million of cash and cash equivalents and $2.4 billion of capacity available under its Revolving Credit Facility. Approximately $344 million of cash and cash equivalents is held by our foreign entities. A portion of our domestic cash and cash equivalents relates to net deposits-in-transit, which are typically settled within a few business days. Debt outstanding totaled $13.0 billion, with an effective weighted average interest rate of 2.8%. \nAlthough we continue to evaluate the optimal capital structure for our business following the completion of the 2024 Worldpay Sale and the expected closing of the Issuer Solutions Acquisition, we intend to maintain investment-grade debt ratings for FIS. \nWe believe that our current level of cash and cash equivalents plus cash flows from operations will be sufficient to fund our operating cash requirements, capital expenditures and debt service payments for the next 12 months and the foreseeable future.\n40\nTable of Contents\nA regular quarterly dividend of $0.40 per common share is payable on December 23, 2025, to shareholders of record as of the close of business on December 9, 2025. We currently expect to continue to pay quarterly dividends targeting dividend-per-share growth aligned to adjusted earnings-per-share growth. However, the amount, declaration and payment of future dividends is at the discretion of the Board of Directors and depends on, among other things, our investment opportunities (including potential mergers and acquisitions), results of operations, financial condition, cash requirements, future prospects, and other factors, including legal and contractual restrictions, that may be considered relevant by our Board of Directors. Additionally, the payment of cash dividends may be limited by covenants in certain debt agreements.\nIn August 2024, our Board of Directors approved a share repurchase program authorizing the repurchase of up to $3.0 billion in aggregate value of shares of our common stock. Repurchases under this program are made at management's discretion from time to time on the open market or in privately negotiated transactions and through Rule 10b5-1 plans. The repurchase program does not have an expiration date and may be suspended for periods, amended or discontinued at any time. The Company repurchased approximately 4.2 million shares for approximately $301 million under the repurchase program during the quarter ended September 30, 2025. Approximately $2.1 billion remained available for repurchase under the share repurchase program as of September 30, 2025. We intend to repurchase approximately $1.3 billion of our shares in the aggregate during the year ending December 31, 2025, inclusive of the $998 million in repurchases completed during the first nine months of 2025.\nCash Flows from Operations\nOur net cash provided by operating activities consists primarily of net earnings, adjusted to add back depreciation and amortization and other non-cash items, including asset impairments, loss on extinguishment of debt, and loss from equity method investment. Cash flows from operations were $1,850 million and $1,393 million for the nine-month periods ended September 30, 2025 and 2024, respectively. Cash flows from operations increased $457 million during the nine months ended September 30, 2025, primarily due to improved working capital management.\nCash Flows from Investing\nOur principal investing activity relates to capital expenditures for software (purchased and internally developed) and property and equipment. We invested approximately $665 million and $629 million in capital expenditures (excluding purchases of certain hardware and software subject to financing or other long-term payment arrangements) during the nine-month periods ended September 30, 2025 and 2024, respectively. We expect to continue investing in software and in property and equipment to support our business.\nWe also invest in acquisitions that complement and extend our existing solutions and capabilities and provide additional solutions to our portfolio, and we dispose of assets that are no longer considered strategic. We used approximately $574 million and $56 million of cash (net of cash acquired) related to new acquisitions for the nine-month periods ended September 30, 2025 and 2024, respectively. In the first three months of 2025, in connection with the conveyance of RealNet to Buyer as part of the 2024 Worldpay Sale, we divested $1.4 billion in cash, cash equivalents and restricted cash included in current assets held for sale at the date of transfer. In 2024, in connection with the 2024 Worldpay Sale, we received $12.8 billion in cash proceeds and divested $3.1 billion in cash, cash equivalents and restricted cash included in current assets held for sale at the date of sale. We expect to continue to invest in acquisitions as part of our strategy to add solutions to help win new clients and cross-sell to existing clients. After we close the Issuer Solutions Acquisition, the Company expects to temporarily pause further investment in acquisitions to accelerate deleveraging until it returns to its target leverage ratio.\nDuring the nine months ended September 30, 2025 and 2024, we received distributions of $107 million and $40 million, respectively, from Worldpay recorded as investing cash flows. We expect to continue to receive regular cash distributions from Worldpay pursuant to the terms of the Worldpay limited liability company operating agreement until the completion of the pending sale of our remaining equity interest in Worldpay in connection with the Issuer Solutions Acquisition. \nSee Note 1 to the consolidated financial statements for discussion of our recent agreement regarding the Issuer Solutions Acquisition and Worldpay Equity Sale. \nCash flows from investing also occasionally include cash received or paid relative to other activities that are not regularly recurring in nature. \n41\nTable of Contents\nCash Flows from Financing\nCash flows from financing principally involve borrowing funds, repaying debt, repurchasing shares and paying dividends. For more information regarding the Company's debt and financing activity, see \"Risk Factors—Risks Related to Our Indebtedness\" in Item 1A and \"Quantitative and Qualitative Disclosures About Market Risk\" of our Annual Report on Form 10-K filed on February 13, 2025, and \"Quantitative and Qualitative Disclosures About Market Risk—Interest Rate Risk\" in Item 3 below as well as Notes 8 and 9 to the consolidated financial statements. \nContractual Obligations\nThere were no material changes in our contractual obligations through the nine months ended September 30, 2025, in comparison to the table included in our Annual Report on Form 10-K for the year ended December 31, 2024, except as disclosed in Notes 8 and 9 to the consolidated financial statements. \nRecent Accounting Pronouncements\nSee Note 1 to the consolidated financial statements for information on recently adopted accounting guidance and recent accounting guidance not yet adopted. Certain recently issued accounting pronouncements are expected to expand our disclosures once adopted; however, no recently adopted accounting pronouncements or newly issued accounting pronouncements not yet effective during the fiscal year are expected to have a material impact on our consolidated financial statements."
}