{
  "item1": "provides products services financial institutions, joint ventures, other third party resellers which direct relationships merchants distribute products services Merchant segment businesses through variety channels, including direct sales teams, strategic partnerships agent sales forces, ISVs, independent sales organizations (“ISOs”), financial institutions other strategic partners form merchant alliances, revenue sharing alliances referral agreements. offer merchant acquiring solutions enable small businesses securely accept payment transactions online in-person. Payment transactions include credit, debit, gift card loyalty payments online through physical POS mobile device, such smartphone tablet. global point-of-sale business management platform, Clover , includes hardware software technology necessary enable small business merchants accept payments; take orders; schedule pick-up delivery services; provide vertical specific business management tools.",
  "item7": "Cost product percentage product revenue increased 69.4% 2024 compared 67.5% 2023. Cost product percentage product revenue 2024 impacted revenue mix, including increase postage revenue. Selling, general administrative expenses percentage total revenue decreased 32.1% 2024 compared 34.4% 2023. Selling, general administrative expenses percentage total revenue 2024 favorably impacted reduction amortization acquisition-related intangible assets approximately 80 basis points, well expense management initiatives.",
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS Forward-Looking Statements quarterly report contains “forward-looking statements” intended qualify safe harbor liability established Private Securities Litigation Reform Act 1995. Forward-looking statements include those express plan, belief, expectation, estimation, anticipation, intent, contingency, future development, outlook, similar expression, can generally identified forward-looking because they include words such “believes,” “anticipates,” “expects,” “could,” “should,” “confident,” “likely,” “plan,” words similar meaning. Statements describe future plans, objectives goals also forward-looking statements."
}