{
  "item1": "ITEM 1. BUSINESS Company news, sports entertainment company, which manages reports its businesses four operating segments: Cable Network Programming, Television, Credible FOX Studio Lot following two reportable segments: Cable Network Programming , which produces licenses news sports content distributed through traditional cable television systems, direct broadcast satellite operators telecommunication companies (“traditional MVPDs”), virtual multi-channel video programming distributors (“virtual MVPDs”) other digital platforms, primarily U.S. , which produces, acquires, markets distributes programming through FOX broadcast network, advertising supported video-on-demand (“AVOD”) service Tubi, 29 full power broadcast television stations, including 11 duopolies, other digital platforms, primarily U.S. Eighteen broadcast television stations affiliated FOX Network 11 affiliated MyNetworkTV.",
  "item7": "primarily due net impact October 2023 issuance $1.25 billion senior notes repayment $1.25 billion $600 million senior notes matured January 2024 April 2025, respectively (See Note 9—Borrowings accompanying Financial Statements). Stock Repurchase Program See Note 11—Stockholders’ Equity accompanying Financial Statements under heading “Stock Repurchase Program.” Dividends paid fiscal totaled $0.54 per share FOX’s Class Common Stock, par value $0.01 per share (the “Class Common Stock”), Class B Common Stock, par value $0.01 per share (the “Class B Common Stock” and, together Class Common Stock, “Common Stock”) , Company declared semi-annual dividend $0.28 per share both Class Common Stock Class B Common Stock. dividend declared payable September 24, 2025 record date determining dividend entitlements September 3, 2025. Based number shares outstanding , new annual dividend rate stated above, total aggregate cash dividends expected paid stockholders fiscal approximately $250 million.",
  "item2": "Company approximately $4.4 billion cash cash equivalents September 30, 2025 unused five-year $1.0 billion unsecured revolving credit facility (See Note 5—Borrowings accompanying Financial Statements). Company also access worldwide capital markets, subject market conditions. September 30, 2025, Company compliance all covenants under revolving credit facility, does not anticipate any noncompliance such covenants. principal uses cash affect Company’s liquidity position include following: acquisition rights related payments entertainment sports programming; operational expenditures including production costs; marketing promotional expenses; expenses related broadcasting Company’s programming; employee facility costs; capital expenditures; acquisitions, including redeemable noncontrolling interests; income taxes, interest dividend payments; debt repayments; legal settlements; stock repurchases."
}