{
  "source_file": "frt-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-Looking Statements\nThe following discussion should be read in conjunction with the consolidated interim financial statements and notes thereto appearing in Item 1 of this report and the more detailed information contained in our Annual Report on \nForm 10-K\n for the year ended December 31, 2024 filed with the Securities and Exchange Commission (the “SEC”) on February 13, 2025.\nCertain statements included in this Quarterly Report on Form 10-Q are forward-looking statements. Those statements include statements regarding the intent, belief or current expectations of the Company and members of our management team, as well as the assumptions on which such statements are based, and generally are identified by the use of words such as “may,” “will,” “seeks,” “anticipates,” “believes,” “estimates,” “expects,” “plans,” “intends,” “should” or similar expressions. Actual results may differ materially from those contemplated by such forward-looking statements. Further, forward-looking statements speak only as of the date they are made, and we undertake no obligation to update or revise forward-looking statements to reflect changed assumptions, the occurrence of unanticipated events or changes to future operating results over time, unless required by law.\nThe following are some of the risks and uncertainties, although not all risks and uncertainties, that could cause our actual results to differ materially from those presented in our forward-looking statements:\n•\nrisks that our tenants will not pay rent, may vacate early or may file for bankruptcy or that we may be unable to renew leases or re-let space at favorable rents as leases expire or to fill existing vacancy;\n•\nrisks that we may not be able to proceed with or obtain necessary approvals for any development, redevelopment or renovation project, and that completion of anticipated or ongoing property development, redevelopment, or renovation projects that we do pursue may cost more, take more time to complete or fail to perform as expected;\n•\nrisks normally associated with the real estate industry, including risks that occupancy levels at our properties and the amount of rent that we receive from our properties may be lower than expected, that new acquisitions may fail to perform \n21\nTable of Contents\nas expected, that competition for acquisitions could result in increased prices for acquisitions, that costs associated with the periodic maintenance and repair or renovation of space, insurance and other operations may increase, that environmental issues may develop at our properties and result in unanticipated costs, and, because real estate is illiquid, that we may not be able to sell properties when appropriate;\n•\nrisks that our growth will be limited if we cannot obtain additional capital, or if the costs of capital we obtain are significantly higher than historical levels;\n•\nrisks associated with general economic conditions, including inflation, tariffs, and local economic conditions in our geographic markets;\n•\nrisks of financing on terms which are acceptable to us, our ability to meet existing financial covenants and the limitations imposed on our operations by those covenants, and the possibility of increases in interest rates that would result in increased interest expense;\n•\nrisks related to the Trust's status as a real estate investment trust, commonly referred to as a REIT, for federal income tax purposes, such as the existence of complex tax regulations relating to the Trust's status as a REIT, the effect of future changes in REIT requirements as a result of new legislation, and the adverse consequences of the failure to qualify as a REIT; and\n•\nrisks related to natural disasters, climate change and public health crises (such as worldwide pandemics), and the measures that international, federal, state and local governments, agencies, law enforcement and/or health authorities implement to address them, may precipitate or materially exacerbate one or more of the above-mentioned risks, and may significantly disrupt or prevent us from operating our business in the ordinary course for an extended period.\nGiven these uncertainties, readers are cautioned not to place undue reliance on any forward-looking statements that we make, including those in this Quarterly Report on Form 10-Q. You should carefully review the risks and the risk factors included in our Annual Report on Form 10-K for the year ended December 31, 2024 and under Part II, Item 1A in this Quarterly Report on Form 10-Q, before making any investments in us.\nOverview\nFederal Realty Investment Trust (the \"Parent Company\" or the \"Trust\") is an equity real estate investment trust (\"REIT\").  Federal Realty OP LP (the \"Operating Partnership\") is the entity through which the Trust conducts substantially all of its operations and owns substantially all of its assets. The Trust owns 100% of the limited liability company interests of, and is sole member and exercises exclusive control over Federal Realty GP LLC (the \"General Partner\"), which in turn, is the sole general partner of the Operating Partnership. Unless stated otherwise or the context otherwise requires, \"we,\" \"our,\" and \"us\" means the Trust and its business and operations conducted through its directly and indirectly owned subsidiaries, including the Operating Partnership. We specialize in the ownership, operation, and redevelopment of high-quality retail-based properties. As of September 30, 2025, we owned or had a majority interest in community and neighborhood shopping centers and mixed-use properties which are operated as 103 predominantly retail real estate projects comprising approximately 27.9 million commercial square feet. In total, the real estate projects were 95.4% leased and 93.8% occupied at September 30, 2025.\nGeneral Economic Conditions\nSignificant uncertainty continues within the political and macro-economic environment including concerns over inflation risk, high interest rates, the introduction of new tariffs and their impact on trade and prices, the government shutdown, and potentially worsening economic conditions, which presents risks for our business and tenants.\n We continue to monitor and address risks related to the general state of the economy. \nWe believe that the actions we have taken to maintain a strong financial position and reinforce our liquidity will continue to mitigate the negative short term impacts of the current economic environment.\nSee further discussion of the impact of current economic conditions on our business throughout Item 2.\nCritical Accounting Policies\nThere have been no significant changes to the critical accounting policies disclosed in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our 2024 Annual Report on \nForm 10-K\n.\nProperty Acquisitions and Dispositions\nOn February 25, 2025, we acquired the fee interest in Del Monte Shopping Center, a \n675,000\n square foot, grocery anchored retail shopping center located in Monterey, California, for \n$123.5 million\n. Approximately $17.7 million and $0.8 million of net assets acquired were allocated to other assets for \"acquired lease costs\" and \"above market leases,\" respectively, and $23.5 million of net assets acquired were allocated to other liabilities for \"below market leases.\"\nOn July 1, 2025, we acquired the fee interest in Town Center Crossing and Town Center Plaza, two retail shopping centers located in Leawood, Kansas, totaling approximately 552,000 square feet for $289.0 million. Approximately $23.7 million and \n22\nTable of Contents\n$6.5 million of net assets acquired were allocated to other assets for \"acquired lease costs\" and \"above market leases,\" respectively, and $11.4 million of net assets acquired were allocated to other liabilities for \"below market leases.\"\nOn October 10, 2025, we acquired the fee interest in Annapolis Town Center, an approximately 479,000 square foot, grocery anchored retail shopping center located in Annapolis, Maryland for $187.0 million.\nDuring the nine months ended September 30, 2025, we sold a residential building at Santana Row, our Hollywood Boulevard property, and a portion of our White Marsh Other property for net proceeds of $146.3 million, resulting in a net gain of $77.1 million.\nDebt and Equity Transactions\nOn January 9, 2025 and October 1, 2025, we repaid two mortgage loans at our Hoboken property totaling $4.3 million, at par.\nOn March 20, 2025, we amended and restated our $600.0 million unsecured term loan, extending the maturity date to March 20, 2028, plus two one-year extensions, at our option. We also had the right to borrow up to an additional $150.0 million, which we exercised on September 22, 2025, bringing our total amount outstanding under this agreement to $750.0 million as of September 30, 2025. Debt issuance costs related to our term loan were $4.9 million as of September 30, 2025. Under an accordion feature, we have the right to request additional loans, subject to an aggregate maximum of $1.0 billion borrowed under the restated agreement. Additionally, on May 1, 2025, the interest rate was reduced by removing the 0.10% adjustment to SOFR.\nDuring the nine months ended September 30, 2025, the maximum amount of borrowings outstanding under our $1.25 billion revolving credit facility was $315.3 million. The weighted average amount of borrowings outstanding was $101.9 million and the weighted average interest rate, before amortization of debt fees, was 5.2% for the nine months ended September 30, 2025. At September 30, 2025, our revolving credit facility had $102.4 million outstanding. On October 30, 2025, we amended our revolving credit facility to remove the 0.10% adjustment to SOFR.\nOur revolving credit facility, term loan, and certain notes require us to comply with various financial covenants, including the maintenance of minimum shareholders' equity and debt coverage ratios and a maximum ratio of debt to net worth. As of September 30, 2025, we were in compliance with all default related debt covenants.\nOn October 30, 2025, we refinanced the $40.0 million mortgage loan at Azalea, with a new $55.0 million mortgage loan that bears interest at SOFR + 85 basis points, based on our credit rating, and matures on October 30, 2028, plus two one-year extensions at our option.\nOn February 14, 2025, we amended our existing at-the-market (\"ATM\") equity program under which we may from time to time offer and sell common shares. This amendment reset the aggregate offering price of the program to $750.0 million. Our ATM equity program also allows shares to be sold through forward sales contracts. We intend to use the net proceeds to fund potential acquisition opportunities, fund our development and redevelopment pipeline, repay indebtedness and/or for general corporate purposes. As of September 30, 2025, we have the capacity to issue up to $750.0 million in common shares under this program.\nDuring the nine months ended September 30, 2025, we settled our remaining open forward sales agreements by issuing 476,497 common shares for net cash proceeds of $54.3 million including paying $0.3 million in additional offering expenses.\nOn April 10, 2025, we announced that our Board of Trustees had approved a new common share repurchase program, under which we may purchase up to $300.0 million of our outstanding common shares of beneficial interest, $0.01 par value per share from time to time using a variety of methods, including open market, privately negotiated transactions or otherwise. The specific timing and amount of common share repurchases, if any, will depend on a number of factors, including prevailing share prices, trading volume and general market conditions, along with our working capital requirements, cash flow, and other factors. The program does not require us to repurchase any dollar amount or number of common shares and may be suspended or discontinued at any time. As of October 31, 2025, no common shares have been repurchased through the program.\nOther Transaction\nIn June 2018, we formed a joint venture to develop Freedom Plaza (formerly Jordan Downs Plaza), for which we own 92%. The investment in this development qualified for tax credits under the New Market Tax Credit (\"NMTC\") Program, established by the Community Renewal Tax Relief Act of 2000. In 2018, we transferred the earned tax credits to a third-party bank in exchange for cash proceeds. The proceeds received and related transaction costs were deferred until the end of the seven-year NMTC compliance period, which concluded in June 2025. As a result, for the nine months ended September 30, 2025, we recognized $14.2 million ($13.0 million, net of income attributable to noncontrolling interest) in income related to the sale of the new market tax credits.\n23\nTable of Contents\nRecently Issued Accounting Pronouncements\nSee Note 2 to the consolidated financial statements.\nCapitalized Costs\nCertain external and internal costs directly related to the development, redevelopment and leasing of real estate, including pre-construction costs, real estate taxes, insurance, construction costs and salaries and related costs of personnel directly involved, are capitalized. We capitalized certain external and internal costs related to both development and redevelopment activities of $121 million and $6 million, respectively, for the nine months ended September 30, 2025, and $102 million and $6 million for the nine months ended September 30, 2024. We capitalized external and internal costs related to other property improvements of $72 million and $4 million, respectively, for the nine months ended September 30, 2025, and $74 million and $4 million, respectively, for the nine months ended September 30, 2024. We capitalized external and internal costs related to leasing activities of $15 million and $3 million, respectively, for the nine months ended September 30, 2025, and $14 million and $3 million, respectively, for the nine months ended September 30, 2024. The amount of capitalized internal costs for salaries and related benefits for development and redevelopment activities, other property improvements, and leasing activities were $6 million, $3 million, and $3 million, respectively, for both the nine months ended September 30, 2025 and 2024. Total capitalized costs were $220 million and $204 million for the nine months ended September 30, 2025 and 2024, respectively.\nOutlook\nOur long-term growth strategy is focused on growth in earnings, funds from operations, and cash flows primarily through a combination of the following:\n•\ngrowth in our comparable property portfolio,\n•\nexpansion of our portfolio through property acquisitions, and\n•\ngrowth in our portfolio from property redevelopments and expansions.\nAlthough general economic impacts of elevated levels of inflation and higher interest rates are impacting us in the short-term, our long-term focus has not changed. See our Annual Report on Form 10-K filed on February 13, 2025, for additional discussion of our long-term strategies.\nOur comparable property growth is primarily driven by increases in rental rates on new leases and lease renewals, changes in portfolio occupancy, and the redevelopment of those assets. Over the long-term, \nthe infill nature and strong demographics of our properties provide a strategic advantage allowing us to maintain relatively high occupancy and generally increase rental rates. We continue to experience strong demand for our commercial space as evidenced by the\n 2.4 \nmillion\n square feet of comparable space leasing we've completed in the last twelve months, and the \n1.6%\n spread between our leased rate of 95.4% and our occupied rate of 93.8%. \nHowever, the effects of inflationary pressures and elevated interest rates continue to negatively impact our business with the largest impacts being higher interest costs, increased material costs, and higher operating costs. Additionally, significant impacts from supply chain disruptions or tariffs could also result in extended time frames and/or increased costs for completion of our projects and tenant build-outs, which could delay the commencement of rent payments under new leases. Similarly, if our tenants experience significant disruptions in supply chains and unexpected impacts of tariffs supporting their own products, staffing issues due to labor shortages, or are otherwise impacted by worsening economic conditions, their ability to pay rent may be adversely affected. We continue to monitor these macroeconomic developments and are working with our tenants and our vendors to limit the overall impact to our business. \nWe believe the locations and nature of our centers and diverse tenant base partially mitigates any potential negative changes in the economic environment. However, any significant reduction in our tenants' abilities to pay base rent, percentage rent or other charges, will adversely affect our financial condition and results of operations. We seek to maintain a mix of strong national, regional, and local retailers.\nWe continue to have several development projects in process being delivered as follows:\n•\nPhase IV at Pike & Rose is a 272,000 square foot office building (which includes 10,000 square feet of ground floor retail space). Approximately 254,000 square feet of the office space is leased, of which, 220,000 square feet is open, and all of the retail space is open. The building is expected to cost between $180 million and $190 million, and began delivering in late September 2023. \n•\nConstruction on Santana West includes an eight story 369,000 square foot office building, which is expected to cost between $325 million and $335 million. Approximately 327,000 square feet of space is leased, of which 135,000 square feet is open.\n•\nConstruction of a 258-unit residential project at Santana Row, which is expected to cost between $140 million and $148 million.\n24\nTable of Contents\n•\nThroughout the portfolio, we currently have redevelopment projects underway with a projected total cost of approximately $283 million that we expect to stabilize over the next several years.\nThe above includes our best estimates based on information currently known, however, the completion of construction, final costs, and the timing of leasing and openings may be further impacted by the current environment including the duration and severity of the economic impacts of broader, as well as local, economic conditions, inflation, tariffs, higher interest rates, and higher operating costs.\nThe development of future phases of Assembly Row, Pike & Rose, Santana Row, and other properties will be pursued opportunistically based on, among other things, market conditions, tenant demand, and our evaluation of whether those phases will generate an appropriate financial return.\nWe continue to review acquisition opportunities that complement our portfolio and provide long-term growth opportunities. Initially, some of our acquisitions do not contribute significantly to earnings growth; however, we believe they provide long-term re-leasing growth, redevelopment opportunities, and other strategic opportunities. Any growth from acquisitions is contingent on our ability to find properties that meet our qualitative standards at prices that meet our financial hurdles. Changes in interest rates may affect our success in achieving earnings growth through acquisitions by affecting both the price that must be paid to acquire a property, as well as our ability to economically finance the property acquisition. Generally, our acquisitions are initially financed by available cash and/or borrowings under our revolving credit facility which may be repaid later with funds raised through the issuance of new equity or new long-term debt. We may also finance our acquisitions through the issuance of common shares, preferred shares, or units in the Operating Partnership, as well as through assumed mortgages and property sales.\nAt September 30, 2025, the leasable commercial square feet in our properties was 95.4% leased and 93.8% occupied. The leased rate is higher than the occupied rate due to leased spaces that are being redeveloped or improved or that are awaiting permits and, therefore, are not yet ready to be occupied. Our occupancy and leased rates are subject to variability over time due to factors including acquisitions, the timing of the start and stabilization of our redevelopment projects, lease expirations and tenant closings and bankruptcies.\nLease Rollovers\nFor the third quarter of 2025, we signed retail leases for a total of 775,000 square feet of retail space including 727,000 square feet of comparable space leases (leases for which there was a prior tenant) at an average rental increase of 28% on a cash basis. New leases for comparable spaces were signed for 235,000 square feet, with an average rental increase of 27% on a cash basis. Renewals for comparable spaces were signed for 492,000 square feet at a 29% average rental increase on a cash basis. Tenant improvements and incentives for comparable spaces were $21.25 per square foot, of which $55.12 per square foot was for new leases and $5.08 per square foot was for renewals for the three months ended September 30, 2025.\nFor the nine months ended September 30, 2025, we signed retail leases for a total of 1,858,000 square feet of retail space including 1,740,000 square feet of comparable space leases (leases for which there was a prior tenant) at an average rental increase of 16% on a cash basis. New leases for comparable spaces were signed for 580,000 square feet, with an average rental increase of 16% on a cash basis. Renewals for comparable spaces were signed for 1,160,000 square feet at a 15% average rental increase on a cash basis. Tenant improvements and incentives for comparable spaces were $20.81 per square foot, of which $51.04 per square foot was for new leases and $5.70 per square foot was for renewals for the nine months ended September 30, 2025.\nThe rental increases associated with comparable spaces generally include all leases signed for retail space in arms-length transactions reflecting market leverage between landlords and tenants during the period, excluding leases at properties sold or under contract to be sold. The comparison between the rent for expiring leases and new leases is determined by including contractual rent on the expiring lease, including percentage rent considered to part of base rent, and the comparable annual rent and in some instances, projections of percentage rent, to be paid on the new lease. In atypical circumstances, management may exercise judgment as to how to most effectively reflect the comparability of spaces reported in this calculation. The change in rental income on comparable space leases is impacted by numerous factors including current market rates, location, individual tenant creditworthiness, use of space, market conditions when the expiring lease was signed, capital investment made in the space and the specific lease structure. Tenant improvements and incentives include the total dollars committed for the improvement (fit out) of a space as it relates to a specific lease. Incentives include amounts paid to tenants as an inducement to sign a lease that do not represent building improvements. Costs related to tenant improvements require judgment by management in determining what are costs specific to the tenant and not deferred maintenance on the space.\nIn the past four years, we have executed comparable space leases for 2.0 to 2.4 million square feet of retail space each year and expect the volume in 2025 will be in line with these historical averages. Although we expect overall positive increases in annual \n25\nTable of Contents\nrent for comparable spaces, changes in annual rent for any individual lease or combinations of individual leases reported in any particular period may be positive or negative and we can provide no assurance that the annual rents on comparable space leases will continue to increase at historical levels, if at all. A decline in current economic conditions could adversely impact our volume of leasing activity and the amount of rent we are able to charge to new or renewing tenants.\nThe leases signed in 2025 generally become effective over the following two years though some may not become effective until 2028 and beyond. Further, there is risk that some new tenants will not ultimately take possession of their space and that tenants for both new and renewal leases may not pay all of their contractual rent due to operating, financing or other matters. However, our historical increases in rental rates do provide information about the tenant/landlord relationship and the potential increase we may achieve in rental income over time.\nComparable Properties\nThroughout this section, we have provided certain information on a “comparable property” basis. Information provided on a comparable property basis includes the results of properties that we owned and operated for the entirety of both periods being compared except for properties that are currently under development or are being repositioned for significant redevelopment and investment. For the three and nine months ended September 30, 2025, all or a portion of 97 and 95 properties, respectively, were considered comparable properties and six and seven properties, respectively, were considered non-comparable properties. For the three months ended September 30, 2025, one property was moved from non-comparable properties to comparable properties and one property was moved from acquisitions to comparable properties; all compared to the designations as of December 31, 2024. For the nine months ended September 30, 2025, one property was moved from comparable properties to non-comparable properties, and one property and one portion of two properties were removed from comparable properties, as they were sold; all compared to the designations as of December 31, 2024. While there is judgment surrounding changes in designations, we typically move non-comparable properties to comparable properties once they have stabilized, which is typically considered 90% physical occupancy or when the growth expected from the redevelopment has been included in the comparable periods. We typically remove properties from comparable properties when the repositioning of the asset has commenced and has or is expected to have a significant impact on property operating income within the calendar year. Acquisitions are moved to comparable properties once we have owned the property for the entirety of comparable periods and the property is not under development or being repositioned for significant redevelopment and investment. \nRESULTS OF OPERATIONS - THREE MONTHS ENDED SEPTEMBER 30, 2025 AND 2024 \n \n \n \nChange\n \n2025\n2024\nDollars\n%\n \n(Dollar amounts in thousands)\nRental income\n$\n313,183 \n$\n295,119 \n$\n18,064 \n6.1 \n%\nOther property income\n8,789 \n8,233 \n556 \n6.8 \n%\nMortgage interest income\n281 \n281 \n— \n— \n%\nTotal property revenue\n322,253 \n303,633 \n18,620 \n6.1 \n%\nRental expenses\n67,481 \n63,898 \n3,583 \n5.6 \n%\nReal estate taxes\n38,178 \n36,053 \n2,125 \n5.9 \n%\nTotal property expenses\n105,659 \n99,951 \n5,708 \n5.7 \n%\nProperty operating income (1)\n216,594 \n203,682 \n12,912 \n6.3 \n%\nGeneral and administrative expense\n(11,649)\n(10,822)\n(827)\n7.6 \n%\nDepreciation and amortization\n(94,277)\n(87,028)\n(7,249)\n8.3 \n%\nOperating income\n110,668 \n105,832 \n4,836 \n4.6 \n%\nOther interest income\n845 \n978 \n(133)\n(13.6)\n%\nInterest expense\n(47,619)\n(44,237)\n(3,382)\n7.6 \n%\nIncome from partnerships\n605 \n888 \n(283)\n(31.9)\n%\nTotal other, net\n(46,169)\n(42,371)\n(3,798)\n9.0 \n%\nNet income\n64,499 \n63,461 \n1,038 \n1.6 \n%\nNet income attributable to noncontrolling interests\n(2,850)\n(2,508)\n(342)\n13.6 \n%\nNet income attributable to the Trust\n$\n61,649 \n$\n60,953 \n$\n696 \n1.1 \n%\n26\nTable of Contents\n(1)\nProperty operating income is a non-GAAP measure that consists of total property revenue, less rental expenses and real estate taxes. This measure is used internally to evaluate the performance of property operations and we consider it to be a significant measure. Property operating income should not be considered an alternative measure of operating results or cash flow from operations as determined in accordance with GAAP. The reconciliation of operating  income to property operating income for the three months ended September 30, 2025 and 2024 is as follows:\n2025\n2024\n(in thousands)\nOperating income\n$\n110,668 \n$\n105,832 \nGeneral and administrative\n11,649 \n10,822 \nDepreciation and amortization\n94,277 \n87,028 \nProperty operating income\n$\n216,594 \n$\n203,682 \nProperty Revenues\nTotal property revenue increased $18.6 million, or 6.1%, to $322.3 million in the three months ended September 30, 2025 compared to $303.6 million in the three months ended September 30, 2024. The percentage occupied at our shopping centers was 93.8% and 94.0% at September 30, 2025 and 2024, respectively. Rental income consists primarily of minimum rent, cost reimbursements from tenants and percentage rent, and is net of collectibility related adjustments. Other property income includes revenue for our Pike & Rose hotel, parking income, and other incidental income from our properties. The increase in property revenue is due primarily to the following:\n•\nan increase of $11.7 million from acquisitions, \n•\nan increase of $9.3 million from comparable properties primarily related to higher rental rates of approximately $5.6 million, a $3.0 million increase in recoveries from tenants on higher occupancy and expenses, higher average occupancy of approximately $1.2 million, and a $0.6 million increase in lease termination fee income, partially offset by a $1.4 million increase in collectibility related adjustments, and\n•\nan increase of $1.6 million from non-comparable properties primarily driven by occupancy increases,\npartially offset by\n•\na decrease of $4.1 million from property dispositions.\nProperty Expenses\nTotal property expenses increased $5.7 million, or 5.7%, to $105.7 million in the three months ended September 30, 2025 compared to $100.0 million in the three months ended September 30, 2024. Changes in the components of property expenses are discussed below.\nRental Expenses\nRental expenses increased $3.6 million, or 5.6%, to $67.5 million in the three months ended September 30, 2025 compared to $63.9 million in the three months ended September 30, 2024. This increase is primarily due to the following:\n•\nan increase of $2.2 million from acquisitions, and \n•\nan increase of $1.6 million from non-comparable properties due primarily to openings at Santana West and Pike & Rose Phase IV,\npartially offset by\n•\na decrease of $1.0 million from property dispositions.\nAs a result of the changes in rental income and rental expenses as discussed above, rental expenses as a percentage of rental income decreased to 21.5% in the three months ended September 30, 2025 from 21.7% in the three months ended September 30, 2024. \nReal Estate Taxes\nReal estate tax expense increased $2.1 million, or 5.9%, to $38.2 million in the three months ended September 30, 2025 compared to $36.1 million in the three months ended September 30, 2024. This increase is primarily due to the following:\n•\nan increase of $1.4 million from acquisitions,\n•\nan increase of $0.7 million from non-comparable properties due primarily to openings at Santana West, and\n•\nan increase of $0.5 million from comparable properties due primarily to higher assessments,\n27\nTable of Contents\npartially offset by\n•\na decrease of $0.5 million from property dispositions.\nProperty Operating Income\nProperty operating income increased $12.9 million, or 6.3%, to $216.6 million in the three months ended September 30, 2025 compared to $203.7 million in the three months ended September 30, 2024. This increase is primarily driven by acquisitions, higher rental rates and average occupancy, and lower rental expenses after recoveries from tenants, partially offset by property dispositions and higher collectibility related adjustments.\nOther Operating\nGeneral and Administrative Expense\nGeneral and administrative expense increased $0.8 million, or 7.6%, to $11.6 million in the three months ended September 30, 2025 compared to $10.8 million in the three months ended September 30, 2024. This increase is due primarily to higher personnel related costs.\nDepreciation and Amortization\nDepreciation and amortization expense increased $7.2 million, or 8.3%, to $94.3 million in the three months ended September 30, 2025 compared to $87.0 million in the three months ended September 30, 2024. This increase is due primarily to acquisitions and the opening of Santana West and Pike & Rose Phase IV, partially offset by fully depreciated lease assets related to our Grossmont property, and property dispositions.\nOperating Income\nOperating income increased $4.8 million, or 4.6%, to $110.7 million in the three months ended September 30, 2025 compared to $105.8 million in the three months ended September 30, 2024. This increase is primarily driven by higher rental rates and average occupancy, acquisitions, and lower rental expenses after recoveries from tenants, partially offset by property dispositions and higher collectibility related adjustments.\nOther\nInterest Expense\nInterest expense increased $3.4 million, or 7.6%, to $47.6 million in the three months ended September 30, 2025 compared to $44.2 million in the three months ended September 30, 2024. This increase is due primarily to the following:\n•\na decrease of $2.7 million in capitalized interest, and\n•\nan increase of $1.9 million due to higher weighted average borrowings,\npartially offset by,\n•\na decrease of $1.2 million due to a lower overall weighted average borrowing rate.\nGross interest costs were $50.2 million and $49.5 million in the three months ended September 30, 2025 and 2024, respectively. Capitalized interest was $2.5 million and $5.2 million for the three months ended September 30, 2025 and 2024, respectively.\n28\nTable of Contents\nRESULTS OF OPERATIONS - NINE MONTHS ENDED SEPTEMBER 30, 2025 AND 2024 \n \n \n \nChange\n \n2025\n2024\nDollars\n%\n \n(Dollar amounts in thousands)\nRental income\n$\n917,954 \n$\n866,199 \n$\n51,755 \n6.0 \n%\nOther property income\n24,143 \n23,973 \n170 \n0.7 \n%\nMortgage interest income\n833 \n836 \n(3)\n(0.4)\n%\nTotal property revenue\n942,930 \n891,008 \n51,922 \n5.8 \n%\nRental expenses\n196,894 \n184,448 \n12,446 \n6.7 \n%\nReal estate taxes\n111,426 \n105,402 \n6,024 \n5.7 \n%\nTotal property expenses\n308,320 \n289,850 \n18,470 \n6.4 \n%\nProperty operating income (1)\n634,610 \n601,158 \n33,452 \n5.6 \n%\nGeneral and administrative expense\n(34,449)\n(34,920)\n471 \n(1.3)\n%\nDepreciation and amortization\n(270,464)\n(255,481)\n(14,983)\n5.9 \n%\nGain on sale of real estate\n77,672 \n52,280 \n25,392 \n48.6 \n%\nNew market tax credit transaction income\n14,176 \n— \n14,176 \n100.0 \n%\nOperating income\n421,545 \n363,037 \n58,508 \n16.1 \n%\nOther interest income\n2,493 \n3,512 \n(1,019)\n(29.0)\n%\nInterest expense\n(134,692)\n(132,242)\n(2,450)\n1.9 \n%\nIncome from partnerships\n1,687 \n1,825 \n(138)\n(7.6)\n%\nTotal other, net\n(130,512)\n(126,905)\n(3,607)\n2.8 \n%\nNet income\n291,033 \n236,132 \n54,901 \n23.3 \n%\nNet income attributable to noncontrolling interests\n(9,700)\n(6,461)\n(3,239)\n50.1 \n%\nNet income attributable to the Trust\n$\n281,333 \n$\n229,671 \n$\n51,662 \n22.5 \n%\n(1)\nProperty operating income is a non-GAAP measure that consists of total property revenue, less rental expenses and real estate taxes. This measure is used internally to evaluate the performance of property operations and we consider it to be a significant measure. Property operating income should not be considered an alternative measure of operating results or cash flow from operations as determined in accordance with GAAP. The reconciliation of operating  income to property operating income for the nine months ended September 30, 2025 and 2024 is as follows:\n2025\n2024\n(in thousands)\nOperating income\n$\n421,545 \n$\n363,037 \nGeneral and administrative\n34,449 \n34,920 \nDepreciation and amortization\n270,464 \n255,481 \nGain on sale of real estate\n(77,672)\n(52,280)\nNew market tax credit transaction income\n(14,176)\n— \nProperty operating income\n$\n634,610 \n$\n601,158 \nProperty Revenues\nTotal property revenue increased $51.9 million, or 5.8%, to $942.9 million in the nine months ended September 30, 2025 compared to $891.0 million in the nine months ended September 30, 2024. The percentage occupied at our shopping centers was 93.8% and 94.0% at September 30, 2025 and 2024, respectively. Rental income consists primarily of minimum rent, cost reimbursements from tenants and percentage rent, and is net of collectibility related adjustments. Other property income includes revenue for our Pike & Rose hotel, parking income, and other incidental income from our properties. The increase in property revenues is due primarily to the following:\n•\nan increase of $30.9 million from 2025 and 2024 acquisitions,\n29\nTable of Contents\n•\nan increase of $29.2 million from comparable properties primarily related to higher rental rates of approximately $12.7 million, a $9.2 million increase in recoveries from tenants primarily on higher occupancy and expenses, higher average occupancy of approximately $7.8 million, and a $1.0 million increase in lease termination fee income, partially offset by a $1.6 million increase in collectibility related adjustments, and\n•\nan increase of $4.9 million from non-comparable properties primarily driven by occupancy increases,\npartially offset by\n•\na decrease of $11.8 million from property dispositions.\nProperty Expenses\nTotal property expenses increased $18.5 million, or 6.4%, to $308.3 million in the nine months ended September 30, 2025 compared to $289.9 million in the nine months ended September 30, 2024. Changes in the components of property expenses are discussed below.\nRental Expenses\nRental expenses increased $12.4 million, or 6.7%, to $196.9 million in the nine months ended September 30, 2025 compared to $184.4 million in the nine months ended September 30, 2024 due primarily to the following:\n•\nan increase of $6.9 million from 2025 and 2024 acquisitions\n•\nan increase of $5.3 million from comparable properties due primarily to higher snow removal costs, higher utilities, and an increase in management fees on higher revenues, and\n•\nan increase of $2.7 million from non-comparable properties due primarily to openings at Santana West, \npartially offset by\n•\na decrease of $2.5 million from property dispositions.\nAs a result of the changes in rental income and rental expenses as discussed above, rental expenses as a percentage of rental income increased to 21.4% in the nine months ended September 30, 2025 from 21.3% in the nine months ended September 30, 2024. \nReal Estate Taxes\nReal estate tax expense increased $6.0 million, or 5.7%, to $111.4 million in the nine months ended September 30, 2025 compared to $105.4 million in the nine months ended September 30, 2024 due primarily to the following:\n•\nan increase of $3.5 million from 2025 and 2024 acquisitions,\n•\nan increase of $2.1 million from comparable properties primarily due to higher assessments and prior year refunds received during 2024, and \n•\nan increase of $1.7 million from non-comparable properties primarily due to openings at Santana West and Pike & Rose Phase IV,\npartially offset by\n•\na decrease of $1.2 million from property dispositions. \nProperty Operating Income\nProperty operating income increased $33.5 million, or 5.6%, to $634.6 million in the nine months ended September 30, 2025 compared to $601.2 million in the nine months ended September 30, 2024. This increase is primarily driven by 2025 and 2024 acquisitions and higher rental rates and average occupancy, partially offset by property dispositions and higher collectibility related adjustments.\nOther Operating\nDepreciation and Amortization\nDepreciation and amortization expense increased $15.0 million, or 5.9%, to $270.5 million in the nine months ended September 30, 2025 compared to $255.5 million in the nine months ended September 30, 2024. This increase is due primarily to 2025 and 2024 acquisitions and the openings at Santana West and Pike & Rose Phase IV, partially offset by fully depreciated lease assets related to our Grossmont property and property dispositions.\n30\nTable of Contents\nGain on Sale of Real Estate\nThe $77.7 million gain on sale of real estate for the nine months ended September 30, 2025 is primarily due to the sale of a residential building at Santana Row, our Hollywood Boulevard property, and a portion of our White Marsh Other property.\nThe $52.3 million gain on sale of real estate for the nine months ended September 30, 2024 is primarily due to the sale of Third Street Promenade. \nNew Market Tax Credit Transaction Income\nThe $14.2 million new market tax credit transaction income for the nine months ended September 30, 2025 is primarily due to sale of new market tax credits related to Freedom Plaza (see Note 6 to the consolidated financial statements for additional information).\nOperating Income\nOperating income increased $58.5 million, or 16.1%, to $421.5 million in the nine months ended September 30, 2025 compared to $363.0 million in the nine months ended September 30, 2024. This increase is primarily driven by higher gains on sale of real estate, higher rental rates and average occupancy, income related to the sale of the new market tax credits, and 2025 and 2024 acquisitions, partially offset by property dispositions and higher collectibility related adjustments.\nOther\nInterest Expense \nInterest expense increased $2.5 million, or 1.9%, to $134.7 million in the nine months ended September 30, 2025 compared to $132.2 million in the nine months ended September 30, 2024. This increase is due primarily to the following:\n•\na decrease of $5.3 million in capitalized interest, and\n•\nan increase of $1.6 million due to higher weighted average borrowings,\npartially offset by,\n•\na decrease of $4.4 million due to a lower overall weighted average borrowing rate.\nGross interest costs were $145.1 million and $147.9 million in the nine months ended September 30, 2025 and 2024, respectively. Capitalized interest was $10.4 million and $15.7 million for the nine months ended September 30, 2025 and 2024, respectively.\nNet income attributable to noncontrolling interests\nNet income attributable to noncontrolling interests increased $3.2 million, or 50.1%, to $9.7 million in the nine months ended September 30, 2025 compared to $6.5 million in the nine months ended September 30, 2024. This increase is primarily attributable to the new market tax credit transaction income in 2025, as well as overall higher income at our properties where there is a noncontrolling interest.\n31\nTable of Contents\nLiquidity and Capital Resources\nDue to the nature of our business and strategy, we typically generate significant amounts of cash from operations which is largely paid to our common and preferred shareholders in the form of dividends because as a REIT, the Trust is generally required to make annual distributions to shareholders of at least 90% of our taxable income (cash dividends paid in the nine months ended September 30, 2025 were approximately $290.2 million). Remaining cash flow from operations after regular debt service requirements (including debt service relating to additional or replacement debt, as well as scheduled debt maturities) and dividend payments is used to fund recurring and non-recurring capital projects (such as tenant improvements and redevelopments). We maintain an unsecured $1.25 billion revolving credit facility to fund short term cash flow needs and also look to the public and private debt and equity markets, joint venture relationships, and property dispositions to fund capital expenditures on a long-term basis.\nOn March 20, 2025, we amended and restated our $600.0 million unsecured term loan, extending the maturity date to March 20, 2028, plus two one-year extensions, at our option. We also increased the size of our the term loan by $150.0 million (to $750.0 million in total), which was funded in September 2025. In October 2025, we refinanced our $40.0 million mortgage loan at Azalea. Therefore, in the next twelve months, we have $652.4 million of debt maturing, of which $200.0 million is the mortgage loan secured by Bethesda Row, which has two one-year extensions, at our option, that would extend the maturity date to December 28, 2027.\nAs of September 30, 2025, we had cash and cash equivalents of $111.3 million and $102.4 million outstanding on our $1.25 billion revolving credit facility. We also have the capacity to issue up to $750.0 million in common shares under our ATM equity program.\nFor the nine months ended September 30, 2025, the weighted average amount of borrowings outstanding on our revolving credit facility was $101.9 million, and the weighted average interest rate, before amortization of debt fees, was 5.2%. \nOur overall capital requirements for the remainder of 2025 will depend on acquisition opportunities, the level and general timing of our redevelopment and development activities, and the overall economic environment. We currently have development and redevelopment projects in various stages of constructions with remaining costs of $285 million. We expect to incur the majority of these costs in the next two years. We expect overall capital costs (excluding acquisitions) to be at levels slightly above 2024. Year to date through October 2025, we've acquired three properties for $599.5 million, and continue to evaluate additional opportunities.\nWe believe cash flow from operations, the cash \non our balance sheet, and our \n$1.25 billion\n revolving credit facility will allow us to continue to operate our business in the short-term. \nGiven our ability to access the capital markets, we also expect debt or equity financing to be available to us, although newly issued debt would likely be at higher interest rates than the debt we are refinancing. We also have the ability to delay the timing of certain development and redevelopment projects as well as limit future acquisitions, reduce our operating expenditures, or re-evaluate our dividend policy. We expect these sources of liquidity and opportunities for operating flexibility to allow us to meet our financial obligations over the long term. We intend to operate with and to maintain our long term commitment to a conservative capital structure that will allow us to maintain strong debt service coverage and fixed-charge coverage ratios as part of our commitment to investment-grade debt ratings.\nSummary of Cash Flows\n \nNine Months Ended September 30,\n \n2025\n2024\nChange\n \n(In thousands)\nNet cash provided by operating activities\n$\n477,531 \n$\n454,968 \n$\n22,563 \nNet cash used in investing activities\n(473,509)\n(375,452)\n(98,057)\nNet cash used in financing activities\n(11,781)\n(233,914)\n222,133 \nDecrease in cash, cash equivalents and restricted cash\n(7,759)\n(154,398)\n146,639 \nCash, cash equivalents, and restricted cash at beginning of year\n135,443 \n260,004 \n(124,561)\nCash, cash equivalents, and restricted cash at end of period\n$\n127,684 \n$\n105,606 \n$\n22,078 \nNet cash provided by operating activities increased $22.6 million to $477.5 million during the nine months ended September 30, 2025 from $455.0 million during the nine months ended September 30, 2024. The increase was primarily due to higher net income after adjusting for non-cash items and gain on sale of real estate.\nNet cash used in investing activities increased $98.1 million to $473.5 million during the nine months ended September 30, 2025 from $375.5 million during the nine months ended September 30, 2024. The increase was primarily attributable to:\n32\nTable of Contents\n•\na $126.5 million increase in acquisition of real estate primarily due to the acquisitions of the fee interest in Town Center Crossing and Town Center Plaza in July 2025 and Del Monte Shopping Center in February 2025 (see Note 3 to the consolidated financial statements for additional information), as compared to the acquisitions of the fee interest in Virginia Gateway in May 2024 and Pinole Vista Crossing in July 2024, and\n•\na $14.8 increase in capital expenditures, \npartially offset by\n•\na $44.8 million increase in net proceeds from the sale of real estate primarily due to $141.2 million of net proceeds from the sale of a residential building at Santana Row, our Hollywood Boulevard property, and a portion of our White Marsh Other property during the nine months ended September 30, 2025, as compared to $96.3 million of net proceeds from the sale of Third Street Promenade during the nine months ended September 30, 2024.\nNet cash used in financing activities decreased $222.1 million to $11.8 million during the nine months ended September 30, 2025 from $233.9 million during the nine months ended September 30, 2024. The decrease was primarily attributable to:\n•\n$600.0 million from the January 2024 repayment of our $600.0 million 3.95% senior unsecured notes at maturity, \n•\n$145.0 million in net proceeds from our unsecured term loan in 2025,\n•\n$102.4 million in borrowings on our revolving credit facility during the nine months ended September 30, 2025, and\n•\na $19.4 million premium paid for the capped call transactions entered into in connection with the issuance of $485.0 million 3.25% exchangeable senior notes in January 2024,\npartially offset by\n•\n$471.5 million in net proceeds from the issuance of $485.0 million 3.25% exchangeable senior notes in January 2024,\n•\na $167.9 million decrease in net proceeds from the issuance of common shares under our ATM program, and\n•\na $12.4 million increase in dividends paid to common and preferred shareholders due to an increase in the number of outstanding shares, as well as an increase to the common share dividend rate.\n33\nTable of Contents\nDebt Financing Arrangements\nThe following is a summary of our total debt outstanding as of September 30, 2025:\nDescription of Debt\nOriginal\nDebt\nIssued\nPrincipal Balance as of September 30, 2025\nStated Interest Rate as of\nSeptember 30, 2025\nMaturity Date\n \n(Dollars in thousands)\n \n \nMortgages payable\nSecured fixed rate\nAzalea (1)\nAcquired\n$\n40,000 \n3.73 \n%\nNovember 1, 2025\nBethesda Row (2)\n200,000\n200,000 \nSOFR + 0.95%\nDecember 28, 2025\nBell Gardens\nAcquired\n10,969 \n4.06 \n%\nAugust 1, 2026\nPlaza El Segundo\n125,000\n125,000 \n3.83 \n%\nJune 5, 2027\nThe Grove at Shrewsbury (East)\n43,600\n43,600 \n3.77 \n%\nSeptember 1, 2027\nBrook 35\n11,500\n11,500 \n4.65 \n%\nJuly 1, 2029\nHoboken (24 Buildings) (3)\n56,450\n50,957 \nSOFR + 1.95%\nDecember 15, 2029\nVarious Hoboken (13 Buildings) (4)\nAcquired\n26,927 \nVarious\nVarious through 2029\nChelsea\nAcquired\n3,212 \n5.36 \n%\nJanuary 15, 2031\nSubtotal\n512,165 \nNet unamortized debt issuance costs and discount\n(847)\nTotal mortgages payable, net\n511,318 \nNotes payable\nRevolving credit facility (5)(6)\n(8)\n102,400 \nSOFR + 0.775%\nApril 5, 2027\nTerm loan (5)(6)(7)\n600,000\n750,000 \nSOFR + 0.85%\nMarch 20, 2028\nVarious\n5,793\n1,281 \nVarious\nVarious through 2059\nSubtotal\n853,681 \nNet unamortized debt issuance costs\n(4,123)\nTotal notes payable, net\n849,558 \nSenior notes and debentures (6)\nUnsecured fixed rate\n1.25% notes\n400,000\n400,000 \n1.25 \n%\nFebruary 15, 2026\n7.48% debentures\n50,000\n29,200 \n7.48 \n%\nAugust 15, 2026\n3.25% notes\n475,000\n475,000 \n3.25 \n%\nJuly 15, 2027\n6.82% medium term notes\n40,000\n40,000 \n6.82 \n%\nAugust 1, 2027\n5.375% notes\n350,000\n350,000 \n5.375 \n%\nMay 1, 2028\n3.25% exchangeable notes\n485,000\n485,000 \n3.25 \n%\nJanuary 15, 2029\n3.20% notes\n400,000\n400,000 \n3.20 \n%\nJune 15, 2029\n3.50% notes\n400,000\n400,000 \n3.50 \n%\nJune 1, 2030\n4.50% notes\n550,000\n550,000 \n4.50 \n%\nDecember 1, 2044\n3.625% notes\n250,000\n250,000 \n3.625 \n%\nAugust 1, 2046\nSubtotal\n3,379,200 \nNet unamortized debt issuance costs and premium\n(16,732)\nTotal senior notes and debentures, net\n3,362,468 \nTotal debt, net\n$\n4,723,344 \n_____________________\n(1)\nOn October 30, 2025, we refinanced our Azalea mortgage loan with a new $55.0 million mortgage loan that bears interest at SOFR + 85 basis points, based on our credit rating, and matures on October 30, 2028.\n(2)\nThe interest rate on this mortgage loan is fixed at a weighted average interest rate of 5.03% through the initial maturity date through three interest rate swap agreements. We have two one-year extensions, at our option to extend the maturity date of this mortgage loan to December 28, 2027.\n(3)\nThe interest rate on this mortgage loan is fixed at 3.67% through two interest rate swap agreements. \n(4)\nThe interest rates on these mortgages range from 3.91% to 5.00%.\n(5)\nOur revolving credit facility SOFR loans and our term loan bear interest at Daily Simple SOFR, as defined in the respective credit agreements, plus a spread, based on our current credit rating. Our revolving credit facility also includes a 0.10% adjustment to SOFR, which was removed through an amendment to the agreement on October 30, 2025.\n34\nTable of Contents\n(6)\nThe Operating Partnership is the named obligor under our revolving credit facility, and senior notes and debentures. Effective March 20, 2025, the Operating Partnership and a wholly owned subsidiary of the Operating Partnership are both named obligors of the term loan.\n(7)\nEffective September 2, 2025, the interest rate on $300.0 million of our term loan is fixed at a weighted average interest rate of 4.21% through March 1, 2028 through four interest rate swap agreements.\n(8)\nThe maximum amount drawn under our $1.25 billion revolving credit facility during both the three and nine months ended September 30, 2025 was $315.3 million and the weighted average interest rate on borrowings under our revolving credit facility, before amortization of debt fees, was 5.2% for both periods.\nOur revolving credit facility, unsecured term loan, and other debt agreements include financial and other covenants that may limit our operating activities in the future. As of September 30, 2025, we were in compliance with all financial and other covenants related to our revolving credit facility, term loan, and senior notes. Additionally, we were in compliance with all of the financial and other covenants that could trigger a loan default on our mortgage loans. If we were to breach any of these financial and other covenants and did not cure the breach within an applicable cure period, our lenders could require us to repay the debt immediately and, if the debt is secured, could immediately begin proceedings to take possession of the property securing the loan. Many of our debt arrangements, including our public notes and our revolving credit facility, are cross-defaulted, which means that the lenders under those debt arrangements can put us in default and require immediate repayment of their debt if we breach and fail to cure a default under certain of our other debt obligations. As a result, any default under our debt covenants could have an adverse effect on our financial condition, our results of operations, our ability to meet our obligations and the market value of our shares. Our organizational documents do not limit the level or amount of debt that we may incur. \nThe following is a summary of our scheduled principal repayments as of September 30, 2025:\n \nUnsecured\nSecured\nTotal\n \n(In thousands)\n \n2025\n$\n139 \n$\n243,913 \n(1)\n$\n244,052 \n2026\n429,299 \n26,282 \n455,581 \n  \n2027\n617,443 \n(2)\n178,282 \n795,725 \n  \n2028\n1,100,000 \n(3)\n2,511 \n1,102,511 \n  \n2029\n885,000 \n60,434 \n945,434 \n  \nThereafter\n1,201,000 \n743 \n1,201,743 \n  \n$\n4,232,881 \n  \n$\n512,165 \n$\n4,745,046 \n(4)\n__________________\n    \n(1)\nOn October 1, 2025, we repaid a $3.1 million mortgage loan on our Hoboken property, at par. Additionally, our $200.0 million mortgage loan secured by Bethesda Row matures on December 28, 2025, plus two one-year extensions at our option to December 28, 2027. On October 30, 2025, we refinanced our $40.0 million mortgage loan on Azalea. The new $55.0 million mortgage loan matures on October 30, 2028, plus two one-year extensions at our option to October 30, 2030.\n(2)\nOur $1.25 billion revolving credit facility matures on April 5, 2027, plus two six-month extensions at our option to April 5, 2028. As of \nSeptember 30, 2025, there was $102.4 million outstanding under this credit facility. \n(3)\nOur $750.0 million term loan matures on March 20, 2028, plus two one-year extensions at our option to March 20, 2030.\n(4)\nThe total debt maturities differ from the total reported on the consolidated balance sheets due to the unamortized net debt issuance costs and premium/discount on mortgage loans, notes payable, and senior notes as of September 30, 2025.\nInterest Rate Hedging\nWe may use derivative instruments to manage exposure to variable interest rate risk. We generally enter into interest rate swaps to manage our exposure to variable interest rate risk and treasury locks to manage the risk of interest rates rising prior to the issuance of debt. We enter into derivative instruments that qualify as cash flow hedges and do not enter into derivative instruments for speculative purposes.\nInterest rate swaps associated with cash flow hedges are recorded at fair value on a recurring basis. Effectiveness of cash flow hedges is assessed both at inception and on an ongoing basis. The effective portion of changes in fair value of the interest rate swaps associated with cash flow hedges is recorded in other comprehensive income which is included in \"accumulated other \n35\nTable of Contents\ncomprehensive income (loss)\" on the balance sheet and statement of shareholders' equity. Cash flow hedges become ineffective if critical terms of the hedging instrument and the debt instrument do not perfectly match such as notional amounts, settlement dates, reset dates, calculation period and SOFR rate. In addition, we evaluate the default risk of the counterparty by monitoring the credit-worthiness of the counterparty which includes reviewing debt ratings and financial performance. If a cash flow hedge is deemed ineffective, the ineffective portion of changes in fair value of the interest rate swaps associated with cash flow hedges is recognized in earnings in the period affected.\nAs of September 30, 2025, we have interest rate swap agreements that effectively fix the rate on the following debt instruments:\nDebt \nNotional Amount of Related Swap Agreements\nWeighted Average Fixed Rate\nMaturity Date of Related Swap Agreements\n(in millions)\nTerm Loan\n$\n300.0 \n4.21 \n%\nMarch 1, 2028\nBethesda Row mortgage loan\n$\n200.0 \n5.03 \n%\nDecember 28, 2025\nHoboken mortgage loan\n$\n51.0 \n3.67 \n%\nDecember 15, 2029\nAdditionally, our Assembly Row hotel joint venture is a party to two interest rate swap agreements that effectively fix its outstanding $38.1 million of debt at an average rate of 6.11% through May 2028.\nAll swaps were designated and qualify as cash flow hedges. Hedge ineffectiveness has not impacted earnings as of September 30, 2025.\nREIT Qualification\nWe intend to maintain the Trust's qualification as a REIT under Section 856(c) of the Code. As a REIT, we generally will not be subject to corporate federal income taxes on income we distribute to our shareholders as long as we satisfy certain technical requirements of the Code, including the requirement to distribute at least 90% of our taxable income to our shareholders.\nFunds From Operations\nFunds from operations (“FFO”) is a supplemental non-GAAP financial measure of real estate companies’ operating performance. The National Association of Real Estate Investment Trusts (“NAREIT”) defines FFO as follows: net income, computed in accordance with U.S. GAAP, plus real estate related depreciation and amortization and excluding gains and losses on the sale of real estate or changes in control, net of tax, and impairment write-downs of certain real estate assets and investments in entities when the impairment is directly attributable to decreases in the value of depreciable real estate held by the entity. We compute FFO in accordance with the NAREIT definition, and we have historically reported our FFO available for common shareholders in addition to our net income and net cash provided by operating activities. It should be noted that FFO:\n•\ndoes not represent cash flows from operating activities in accordance with GAAP (which, unlike FFO, generally reflects all cash effects of transactions and other events in the determination of net income);\n•\nshould not be considered an alternative to net income as an indication of our performance; and\n•\nis not necessarily indicative of cash flow as a measure of liquidity or ability to fund cash needs, including the payment of dividends.\nWe consider FFO available for common shareholders a meaningful, additional measure of operating performance primarily because it excludes the assumption that the value of the real estate assets diminishes predictably over time, as implied by the historical cost convention of GAAP and the recording of depreciation. We use FFO primarily as one of several means of assessing our operating performance in comparison with other REITs. Comparison of our presentation of FFO to similarly titled measures for other REITs may not necessarily be meaningful due to possible differences in the application of the NAREIT definition used by such REITs.\nAn increase or decrease in FFO available for common shareholders does not necessarily result in an increase or decrease in aggregate distributions because our Board of Trustees is not required to increase distributions on a quarterly basis. However, we must distribute at least 90% of our annual taxable income to remain qualified as a REIT. Therefore, a significant increase in FFO will generally require an increase in distributions to shareholders although not necessarily on a proportionate basis.\n36\nTable of Contents\nThe reconciliation of net income to FFO available for common shareholders is as follows:\n \nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(In thousands, except per share data)\nNet income\n$\n64,499 \n$\n63,461 \n$\n291,033 \n$\n236,132 \nNet income attributable to noncontrolling interests\n(2,850)\n(2,508)\n(9,700)\n(6,461)\nGain on sale of real estate\n— \n— \n(77,672)\n(52,280)\nDepreciation and amortization of real estate assets\n81,155 \n76,581 \n236,251 \n225,676 \nAmortization of initial direct costs of leases\n12,029 \n8,757 \n30,464 \n24,673 \nFunds from operations\n154,833 \n146,291 \n470,376 \n427,740 \nDividends on preferred shares (1)\n(1,875)\n(1,875)\n(5,625)\n(5,625)\nIncome attributable to downREIT operating partnership units\n596 \n688 \n1,868 \n2,068 \nIncome attributable to unvested shares\n(509)\n(506)\n(1,558)\n(1,524)\nFunds from operations available for common shareholders\n$\n153,045 \n$\n144,598 \n$\n465,061 \n$\n422,659 \nWeighted average number of common shares, diluted (1)(2)\n86,599 \n84,714 \n86,463 \n83,904 \nFunds from operations available for common shareholders, per diluted share (2)\n$\n1.77 \n$\n1.71 \n$\n5.38 \n$\n5.04 \n_____________________\n(1)\nFor the three and nine months ended September 30, 2025 and 2024, dividends on our Series 1 preferred stock were not deducted in the calculation of FFO available to common shareholders, as the related shares were dilutive and included in \"weighted average number of common shares, diluted.\"\n(2)\nThe weighted average common shares used to compute FFO per diluted common share includes downREIT operating partnership units that were excluded from the computation of diluted EPS. Conversion of these operating partnership units is dilutive in the computation of FFO per diluted share for all periods presented but is anti-dilutive for the computation of diluted EPS for the three and nine months ended September 30, 2025 and 2024."
}