{
  "item1": "ITEM 1. BUSINESS Federal Realty Investment Trust (the \"Parent Company\" \"Trust\") equity real estate investment trust (\"REIT\"). Federal Realty OP LP (the \"Operating Partnership\") entity through which Trust conducts substantially all its operations owns substantially off its assets. Trust owns 100% limited liability company interest of, sole member of, exercises exclusive control over Federal Realty GP LLC (the \"General Partner\"), which turn, sole general partner Operating Partnership.",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS Forward-Looking Statements Certain statements section elsewhere report may deemed “forward-looking statements”. See “Item 1A. Risk Factors” report important information regarding these forward-looking statements certain risk uncertainties may affect us.",
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS Forward-Looking Statements following discussion should read conjunction consolidated interim financial statements notes thereto appearing Item 1 report more detailed information contained Annual Report following some risks uncertainties, although not all risks uncertainties, could cause actual results differ materially those presented forward-looking statements: risks tenants will not pay rent, may vacate early may file bankruptcy may unable renew leases re-let space favorable rents leases expire fill existing vacancy; risks may not able proceed obtain necessary approvals any development, redevelopment renovation project, completion anticipated ongoing property development, redevelopment, renovation projects do pursue may cost more, take more time complete fail perform expected; risks normally associated real estate industry, including risks occupancy levels properties amount rent receive properties may lower than expected, new acquisitions may fail perform expected, competition acquisitions could result increased prices acquisitions, costs associated periodic maintenance repair renovation space, insurance other operations may increase, environmental issues may develop properties result unanticipated costs, and, because real estate illiquid, may not able sell properties when appropriate; risks growth will limited if cannot obtain additional capital, if costs capital obtain significantly higher than historical levels; risks associated general economic conditions, including inflation, tariffs, local economic conditions geographic markets; risks financing terms which acceptable us, ability meet existing financial covenants limitations imposed operations those covenants, possibility increases interest rates would result increased interest expense; risks related Trust's status real estate investment trust, commonly referred REIT, federal income tax purposes, such existence complex tax regulations relating Trust's status REIT, effect future changes REIT requirements result new legislation, adverse consequences failure qualify REIT; risks related natural disasters, climate change public health crises (such worldwide pandemics), measures international, federal, state local governments, agencies, law enforcement and/or health authorities implement address them, may precipitate materially exacerbate one more above-mentioned risks, may significantly disrupt prevent us operating business ordinary course extended period. Federal Realty Investment Trust (the \"Parent Company\" \"Trust\") equity real estate investment trust (\"REIT\"). Federal Realty OP LP (the \"Operating Partnership\") entity through which Trust conducts substantially all its operations owns substantially all its assets."
}