{
  "source_file": "frt-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS\nGeneral\nFederal Realty Investment Trust (the \"Parent Company\" or the \"Trust\") is an equity real estate investment trust (\"REIT\"). Federal Realty OP LP (the \"Operating Partnership\") is the entity through which the Trust conducts substantially all of its operations and owns substantially off of its assets. The Trust owns 100% of the limited liability company interest of, is sole member of, and exercises exclusive control over Federal Realty GP LLC (the \"General Partner\"), which in turn, is the sole \n3\nTable of Contents\ngeneral partner of the Operating Partnership. Unless stated otherwise or the context otherwise requires, \"we,\" \"our,\" and \"us\" means the Trust and its business and operations conducted through its directly and indirectly owned subsidiaries, including the Operating Partnership. We specialize in the ownership, management, and redevelopment of high quality retail and mixed-use properties located primarily in communities where we believe retail demand exceeds supply, in strategically selected metropolitan markets in the Mid-Atlantic and Northeast regions of the United States, California, and South Florida. As of December 31, 2024, we owned or had a majority interest in community and neighborhood shopping centers and mixed-use properties which are operated as 102 predominantly retail real estate projects comprising approximately 26.8 million commercial square feet. In total, the real estate projects were 96.2% leased and 94.1% occupied at December 31, 2024. Our revenue is primarily generated from lease agreements with tenants. We have paid quarterly dividends to our shareholders continuously since our founding in 1962 and have increased our dividends per common share for 57 consecutive years.\nWe were founded in 1962 as a REIT under the laws of the District of Columbia and re-formed as a REIT in the state of Maryland in 1999. In January of 2022, we consummated the UPREIT reorganization described in the Explanatory Note at the beginning of this Annual Report. We operate in a manner intended to qualify as a REIT for tax purposes pursuant to provisions of the Internal Revenue Code of 1986, as amended (the “Code”). Our principal executive offices are located at 909 Rose Avenue, North Bethesda, Maryland 20852. Our telephone number is (301) 998-8100. Our website address is \nwww.federalrealty.com\n. The information contained on our website is not a part of this report and is not incorporated herein by reference.\nBusiness Objectives and Strategies\nOur primary business objective is to own, manage, acquire and redevelop a portfolio of high quality retail focused properties that will:\n•\nprovide increasing cash flow for distribution to shareholders;\n•\ngenerate higher internal growth than the shopping center industry over the long term;\n•\nprovide potential for capital appreciation; and\n•\nprotect investor capital.\nOur portfolio includes, and we continue to acquire and redevelop, high quality retail in many formats ranging from regional, community and neighborhood shopping centers that often are anchored by grocery stores to mixed-use properties that are typically centered around a retail component but also include residential and office components.\nOperating Strategies\nWe continuously evaluate and assess our operating strategies to ensure they are effective and put us in the best position to address changes in the market. We actively manage our properties to maximize rents and maintain occupancy levels by attracting and retaining a strong and diverse base of tenants and replacing less relevant, weaker, underperforming tenants with stronger ones. Our properties are generally located in some of the most densely populated and affluent areas of the country. These strong demographics help our tenants generate higher sales, which has generally enabled us to maintain higher occupancy rates, charge higher rental rates, and maintain steady rent growth, all of which increase the value of our portfolio. Our operating strategies also include:\n•\nincreasing rental rates through the negotiation of contractual rental increases during the term of the lease, the renewal of expiring leases or the leasing of space to new tenants at higher rental rates while limiting vacancy and down-time;\n•\nmaintaining a diversified tenant base, thereby limiting exposure to any one tenant’s financial or operating difficulties;\n•\nactively managing the merchandising mix of our tenant base to achieve a balance of strong national and regional tenants with local specialty tenants;\n•\nminimizing overhead and operating costs;\n•\nactively managing the physical appearance of our properties and the construction quality, condition and design of the buildings and other improvements located on our properties to maximize our ability to attract customers and thereby generate higher rents and occupancy rates;\n•\nmanaging our properties to take into account their impact on climate change and their resilience in the face of climate change;\n•\ndeveloping local and regional market expertise in order to capitalize on market and retailing trends;\n•\nleveraging the contacts and experience of our management team to build and maintain long-term relationships with tenants; \n•\nproviding exceptional customer service; and\n•\ncreating an experience at many of our properties that is identifiable, unique and serves the surrounding communities to help insulate these properties and the tenants at these properties from the impact of on-line retailing.\n4\nTable of Contents\nInvesting Strategies\nOur investment strategy is to deploy capital at risk-adjusted rates of return that exceed our long-term weighted average cost of capital in projects that have potential for future income growth and increased value. Our investments primarily fall into one of the following four categories:\n•\nrenovating, expanding, reconfiguring and/or retenanting our existing properties to take advantage of under-utilized land or existing square footage to increase revenue;\n•\nrenovating or expanding tenant spaces for tenants capable of producing higher sales, and therefore, paying higher rents;\n•\nacquiring quality retail and mixed-use properties located in densely populated and/or affluent areas where barriers to entry for further development are high, and that have possibilities for enhancing operating performance and creating value through renovation, expansion, reconfiguration and/or retenanting; and\n•\ndeveloping the retail portions of mixed-use properties and developing or otherwise investing in non-retail portions of mixed-use properties we already own in order to capitalize on the overall value created in these properties.\nInvestment Criteria\nWhen we evaluate potential redevelopment, retenanting, expansion, acquisition and development opportunities, we consider such factors as:\n•\nthe expected returns in relation to our short and long-term cost of capital as well as the anticipated risk we will face in achieving the expected returns;\n•\nthe anticipated growth rate of operating income generated by the property;\n•\nthe ability to increase the long-term value of the property through redevelopment and retenanting;\n•\nthe tenant mix at the property, tenant sales performance and the creditworthiness of those tenants;\n•\nthe geographic area in which the property is located, including the population density, household incomes, education levels, as well as the population and income trends in that geographic area. This may from time to time include the evaluation of new markets;\n•\ncompetitive conditions in the vicinity of the property, including gross leasable area (GLA) per capita, competition for tenants and the ability of others to create competing properties through redevelopment, new construction or renovation;\n•\naccess to and visibility of the property from existing roadways and the potential for new, widened or realigned, roadways within the property’s trade area, which may affect access and commuting and shopping patterns;\n•\nthe level and success of our existing investments in the market area;\n•\nthe current market value of the land, buildings and other improvements and the potential for increasing those market values; and\n•\nthe physical condition of the land, buildings and other improvements, including the structural and environmental condition.\nFinancing Strategies\nOur financing strategies are designed to enable us to maintain an investment grade balance sheet while retaining sufficient flexibility to fund our operating and investing activities in the most cost-efficient way possible. Our financing strategies include:\n•\nmaintaining a prudent level of overall leverage and an appropriate pool of unencumbered properties that is sufficient to support our unsecured borrowings;\n•\nmanaging our exposure to variable-rate debt;\n•\nmaintaining sufficient levels of cash and available line of credit to fund operating and investing needs on a short-term basis;\n•\ntaking advantage of market opportunities to refinance existing debt, reduce interest costs and manage our debt maturity schedule so that a significant portion of our debt relative to our size does not mature in any one year;\n•\nselling properties that have limited growth potential or are not a strategic fit within our overall portfolio and redeploying the proceeds to redevelop, renovate, retenant and/or expand our existing properties, acquire new properties or reduce debt; and\n•\nutilizing the most advantageous long-term source of capital available to us to finance redevelopment and acquisition opportunities, which may include:\n◦\nthe sale of our equity or debt securities through public offerings, including our at-the-market (\"ATM\") equity program in which we may from time to time offer and sell common shares including through forward sales contracts, or private placements,\n◦\nthe incurrence of indebtedness through unsecured or secured borrowings including exchangeable debt,\n5\nTable of Contents\n◦\nthe issuance of units in our operating partnership (generally issued in exchange for a tax deferred contribution of property); these units typically receive the same distributions as our common shares and the holders of these units have the right to exchange their units for cash or common shares at our option, or\n◦\nthe use of joint venture arrangements.\nHuman Capital\nAt February 10, 2025, we had 304 full-time employees and 5 part-time employees. None of our employees are represented by a collective bargaining unit. We believe that our relationship with our employees is good. We are an Equal Opportunity/Affirmative Action employer, and strive to maintain a workplace that is free from discrimination on the basis of race, color, religion, sex, sexual orientation, nationality, disability, or protected Veteran status.\nHealth, Safety, and Wellness\nWe are committed to the health, safety, and wellness of our employees, and foster an environment that allows our people to succeed while balancing work and life. We provide our employees with access to health and wellness programs, which includes benefits that support both physical and mental health. We have also transitioned to a hybrid work model. \nCompensation and Benefits\nWe provide competitive pay and benefits including health, dental, vision, short and long-term disability, life insurance and a 401(k) retirement program, as well as a generous paid time off program that includes vacation, sick, and personal leave. In addition to our equity awards program, we also offer a quarterly recognition program, as well as rewarding employees with spot bonuses for stellar performance or going above and beyond the base requirements of their job description.\nTalent Development\nEmployees have access to a variety of different training courses, books, book summaries and audio books, and an array of source materials covering a myriad of different business and soft skills training subjects. Additionally, we provide reimbursement for tuition and professional licensures.\nCommunity Involvement\nGiving back to the community is an integral part of who we are and what we do. We provide ample ways to give back through programs at our properties or charitable endeavors and volunteer opportunities that also serve as team building exercises for our employees.\nTax Status\nWe elected to be taxed as a REIT under the federal income tax laws when we filed our 1962 tax return. As a REIT, we are generally not subject to federal income tax on taxable income that we distribute to our shareholders. Under the Code, REITs are subject to numerous organizational and operational requirements, including the requirement to generally distribute at least 90% of taxable income each year. We will be subject to federal income tax on our taxable income (including, for our taxable years ending on or prior to December 31, 2017, any applicable alternative minimum tax) at regular corporate rates if we fail to qualify as a REIT for tax purposes in any taxable year, or to the extent we distribute less than 100% of our taxable income. We will also generally not qualify for treatment as a REIT for federal income tax purposes for four years following the year during which qualification is lost. Even if we qualify as a REIT for federal income tax purposes, we may be subject to certain state and local income and franchise taxes and to federal income and excise taxes on our undistributed taxable income.\nWe have elected to treat certain of our subsidiaries as taxable REIT subsidiaries, which we refer to as a TRS. In general, a TRS may engage in any real estate business and certain non-real estate businesses, subject to certain limitations under the Code. A TRS is subject to federal and state income taxes. Our TRS activities have not been material.\nGeneral Economic Conditions \nThe economy continues to face several issues including inflation risk, high interest rates, and potentially worsening economic conditions presenting risks for our business and tenants. We continue to monitor and address risks related to the general state of the economy. The extent of the future effects on our business, results of operations, cash flows, and growth strategies is highly uncertain and will ultimately depend on future developments, none of which can be predicted. \n6\nTable of Contents\nGovernmental Regulations Affecting Our Properties\nWe and our properties are subject to a variety of federal, state and local environmental, health, safety and similar laws. Please see Item 1A. \"Risk Factors - Risk Factors Related to our REIT Status and Other Laws and Regulations\" for further discussion of potential material effects of our compliance with government regulation, including environmental regulations and the rules governing REITs.\nThe application of these laws to a specific property that we own depends on a variety of property-specific circumstances, including the current and former uses of the property, the building materials used at the property and the physical layout of the property. Under certain environmental laws, we, as the owner or operator of properties currently or previously owned, may be required to investigate and clean up certain hazardous or toxic substances, asbestos-containing materials, or petroleum product releases at the property, we may be held liable for property damage and for investigation and clean up costs incurred in connection with the contamination, and we may be liable under common law to third parties for damages and injuries resulting from environmental contamination emanating from the real estate. Such costs or liabilities could exceed the value of the affected real estate. The presence of contamination or the failure to remediate contamination may adversely affect our ability to sell or lease real estate or to borrow using the real estate as collateral.\nNeither existing environmental, health, safety and similar laws nor the costs of our compliance with these laws has had a material adverse effect on our financial condition or results of operations, and management does not believe they will in the future. In addition, we have not incurred, and do not expect to incur, any material costs or liabilities due to environmental contamination at properties we currently own or have owned in the past. However, we cannot predict the impact of new or changed laws or regulations on properties we currently own or may acquire in the future. We have no current plans for substantial capital expenditures with respect to compliance with environmental, health, safety and similar laws and we carry environmental insurance which covers a number of environmental risks for most of our properties.\nEnergy and Emissions Regulations Affecting Our Properties\nSome jurisdictions in which we own property have enacted or may enact legislation that requires use of only certain types of energy sources, limits energy usage on site, or limits allowable emissions from buildings with fines or other costs being imposed for exceeding those limits.\n \nThis type of legislation typically includes an extended period of time from adoption to implementation to allow property owners ample opportunity to make investments and take other actions to comply with the legislation.\n \nAny investments we believe we will need to make to comply with laws that have been passed to date are being included as part of our ordinary capital improvement planning process for our properties.\n \nWe also address the potential effects of these types of laws in our energy reduction and energy efficient efforts that are described in more detail in Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations - Corporate Responsibility.\"\n \nThese types of laws have not had a material adverse effect on our financial condition or results of operations and management does not believe they will have a material adverse effect in the future.\n \nWe cannot, however, predict the impact of new or changed laws or regulations on properties we currently own or may acquire in the future.\nCompetition\nNumerous commercial developers and real estate companies compete with us with respect to the leasing and the acquisition of properties. Some of these competitors may possess greater capital resources than we do, although we do not believe that any single competitor or group of competitors in any of the primary markets where our properties are located are dominant in that market. This competition may:\n•\nreduce the number of properties available for acquisition;\n•\nincrease the cost of properties available for acquisition;\n•\ninterfere with our ability to attract and retain tenants, leading to increased vacancy rates and/or reduced rents; and\n•\nadversely affect our ability to minimize expenses of operation.\nRetailers at our properties also face increasing competition from online retailers, outlet stores, discount shopping clubs, superstores, and other forms of sales and marketing of goods and services, such as direct mail. This competition could contribute to lease defaults and insolvency of tenants.\nAvailable Information\nCopies of our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 (the “Exchange Act”) are available free of charge through the Investors section of our website at \nwww.federalrealty.com\n as soon as reasonably practicable after we electronically file the material with, or furnish the material to, the Securities and Exchange Commission, or the SEC.\n7\nTable of Contents\nOur Corporate Governance Guidelines, Code of Business Conduct, Code of Ethics applicable to our Chief Executive Officer and senior financial officers, Whistleblower Policy, organizational documents and the charters of our audit committee, compensation and human capital committee and nominating and corporate governance committee are all available in the Corporate Governance section of the Investors section of our website.\nAmendments to the Code of Ethics or Code of Business Conduct or waivers that apply to any of our executive officers or our senior financial officers will be disclosed in the Corporate Governance section of our website as well.",
  "item7": "ITEM 7.    MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis section generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed with the Securities and Exchange Commission on February 12, 2024.\nForward-Looking Statements\nCertain statements in this section or elsewhere in this report may be deemed “forward-looking statements”. See “Item 1A. Risk Factors” in this report for important information regarding these forward-looking statements and certain risk and uncertainties that may affect us. The following discussion should be read in conjunction with the consolidated financial statements and notes thereto appearing in “Item 8. Financial Statements and Supplementary Data” of this report.\nOverview\nFederal Realty Investment Trust (the \"Parent Company\" or the \"Trust\") is an equity real estate investment trust (\"REIT\"). Federal Realty OP LP (the \"Operating Partnership\") is the entity through which the Trust conducts substantially all of its operations and owns substantially all of its assets. The Trust owns 100% of the limited liability company interest of, is sole member of, and exercises exclusive control over Federal Realty GP LLC (the \"General Partner\"), which in turn, is the sole general partner of the Operating Partnership. Unless stated otherwise or the context otherwise requires, \"we,\" \"our,\" and \"us\" means the Trust and its business and operations conducted through its directly and indirectly owned subsidiaries, including the Operating Partnership. We specialize in the ownership, management, and redevelopment of high quality retail and mixed-use properties located primarily in communities where we believe demand exceeds supply, in strategically selected metropolitan markets in the Northeast and Mid-Atlantic regions of the United States, California, and South Florida. As of December 31, 2024, we owned or had a majority interest in community and neighborhood shopping centers and mixed-use properties which are operated as 102 predominantly retail real estate projects comprising approximately 26.8 million commercial square feet. In total, the real estate projects were 96.2% leased and 94.1% occupied at December 31, 2024. We have paid quarterly dividends to our shareholders continuously since our founding in 1962 and have increased our dividends per common share for 57 consecutive years.\nGeneral Economic Conditions\nThe economy continues to face several issues including inflation risk, high interest rates, and potentially worsening economic conditions, which presents risks for our business and our tenants. We continue to monitor and address risks related to the general state of the economy. We believe that the actions we have taken to improve our financial position and maximize our liquidity will continue to mitigate the impact to our cash flow caused by tenants not timely paying contractual rent.\nAdditional discussion of the impact of current economic conditions on our results and long-term operations can be found throughout Item 7 and \nItem 1A\n. Risk Factors.\nCorporate Responsibility\nWe actively endeavor to operate and develop our properties in a sustainable, responsible, and effective manner with the objective being to drive long-term growth and aid in value creation for our shareholders, tenants, employees, and local communities. We have aligned our program and efforts with the United Nations Sustainable Development Goals, as described in our Sustainability Policy and our 2023 Environmental Social and Governance Report, which are provided only for informational purposes on our website and not incorporated by reference herein.\nWe are committed to implementing sustainable business practices at our operating properties that focus on energy efficiency, water conservation and waste minimization and have established greenhouse gas (GHG) emissions reduction targets in accordance with the Science-Based Targets initiative as well as energy reduction targets. To achieve these targets, we are actively addressing energy efficiency projects on site such as upgrading to LED lighting, procuring green energy, reducing electric consumption, and increasing our onsite solar generation capacity. We have installed on-site solar systems at 28 of our properties with a capacity of 15 MW with more projects actively in progress. We also installed electric vehicle car charging \n31\nTable of Contents\nstations in numerous properties throughout our portfolio. We currently have over 400 charging stations in operation with more under construction. \nWe also understand that we face risks presented by climate change and are working to evaluate our risk exposure. In our 2023 Sustainability report, we provided a disclosure pursuant to the Task Force on Climate Related Financial Disclosure and we intend to provide that disclosure annually.\nWe are also highly committed to our employees and fostering a work environment that promotes growth, development and personal well-being. Our four core values are accountability, excellence, innovation and integrity and we seek to attract and retain talented professionals who embrace those values. All of our efforts with respect to corporate responsibility are overseen by our Board of Trustees. \nOur development activities have been heavily focused on owning, developing and operating properties that are certified under the U.S. Green Building Council’s® (“USGBC”) Leadership in Energy and Environmental Design™ (LEED®) rating system which serves as a third-party verification that a building or community was designed and built to mitigate its environmental footprint. We currently have 25 LEED certified buildings and our Pike & Rose project has achieved LEED for Neighborhood Development Stage 3 Gold certification. \nCyber Security\nOur chief information officer, who has over 30 years of experience in managing information systems for real estate companies, heads our internal team of technology professionals who are responsible for managing our cybersecurity risks, which includes identifying our primary areas of risk, establishing processes, procedures, and systems to mitigate those risks and identifying and remediating any breaches that may occur. Cybersecurity risk management falls under our general counsel as part of our overall risk management program, which is ultimately overseen by the Audit Committee of the Board of Trustees. Our team is supported by a third party company that we have retained to act as our chief information security officer based on the third party company's experience in preventing cybersecurity incidents, advising clients about appropriate cybersecurity procedures and processes, and assessing the integrity of those procedures and processes. The assessment and management of our cybersecurity risks covers all of our internal systems as well as the systems of third parties who maintain our data.\nWe rely on our management team's experience in risk management, in consultation with our third party advisor, to appropriately address cybersecurity threats. As part of our processes to manage risks from cybersecurity threats, we have developed and enforce company-wide policies related to password encryption, strength and expiration, we require multi-factor authentication where appropriate, and we conduct regular employee training about our policies and cybersecurity threats. We make use of firewalls, anti-virus software, backups, redundancies, regular penetration testing, and our systems monitor and flag irregularities in how our information systems are accessed or used. Any known cybersecurity incidents would be reported by our chief information officer to our general counsel and disclosure committee for evaluation and remediation, and for a determination of how we might develop further security systems and procedures to address evolving cybersecurity threats. Management provides written and verbal updates to the Audit Committee at least quarterly identifying our primary areas of risk, actions taken or planned to be taken to mitigate those risks, and specific activities undertaken during the quarter, including employee training and the results of that training. Management would also provide updates to seek oversight from the Audit Committee on an ad hoc basis in connection with any material cybersecurity incident, should one occur. \nWe have not experienced any cybersecurity incident that has had a material impact on our business strategy, results of operations, or financial condition. For more information, see Item 1A. Risk Factors (\"We face risks relating to cybersecurity threats that could cause loss of confidential information and other business distributions\").\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America, referred to as “GAAP”, requires management to make estimates and assumptions that in certain circumstances affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities, and revenues and expenses. These estimates are prepared using management’s best judgment, after considering past and current events and economic conditions. In addition, information relied upon by management in preparing such estimates includes internally generated financial and operating information, external market information, when available, and when necessary, information obtained from consultations with third party experts. Actual results could differ from these estimates. A discussion of possible risks which may affect these estimates is included in “Item 1A. Risk Factors” of this report. Management considers an accounting estimate to be critical if changes in the estimate could have a material impact on our consolidated results of operations or financial condition.\n32\nTable of Contents\nOur significant accounting policies are more fully described in Note 2 to the consolidated financial statements; however, the most critical accounting policies, which are most important to the portrayal of our financial condition and results of operations, and involve the use of complex estimates and significant assumptions as to future uncertainties and, therefore, may result in actual amounts that differ from estimates, are as follows:\nCollectibility of Lease Income \nOur leases with our tenants are classified as operating leases. When collection of substantially all lease payments during the lease term is considered probable, the lease qualifies for accrual accounting. When collection of substantially all lease payments during the lease term is not considered probable, total lease revenue is limited to the lesser of revenue recognized under accrual accounting or cash received. Determining the probability of collection of substantially all lease payments during a lease term requires significant judgment. This determination is impacted by numerous factors including our assessment of the tenant’s credit worthiness, economic conditions, tenant sales productivity in that location, historical experience with the tenant and tenants operating in the same industry, future prospects for the tenant and the industry in which it operates, and the length of the lease term. If leases currently classified as probable are subsequently reclassified as not probable, any outstanding lease receivables (including straight-line rent receivables) would be written-off with a corresponding decrease in rental income. For example, in the event that our collectibility determinations were not accurate and we were required to write off additional receivables equaling 1% of rental income, our rental income and net income would decrease by $11.7 million. If leases currently classified as not probable are subsequently changed to probable, any lease receivables (including straight-line rent receivables) are re-instated with a corresponding increase to rental income.\nReal Estate Acquisitions\nUpon acquisition of operating real estate properties, we estimate the fair value of assets and liabilities acquired including land, building, improvements, leasing costs, intangibles such as acquired leases, assumed debt, and current assets and liabilities, if any. Based on these estimates, we allocate the purchase price to the applicable assets and liabilities. We utilize methods similar to those used by independent appraisers in estimating the fair value of acquired assets and liabilities. The value allocated to acquired leases is amortized over the related lease term and reflected as rental income in the statement of operations. We consider qualitative and quantitative factors in evaluating the likelihood of a tenant exercising a below market renewal option and include such renewal options in the calculation of in-place lease value when we consider these to be bargain renewal options. If the value of below market lease intangibles includes renewal option periods, we include such renewal periods in the amortization period utilized. If a tenant vacates its space prior to contractual termination of its lease, the unamortized balance of any acquired lease value is written off to rental income.\nDuring 2024 and 2023, we acquired properties included in our consolidated financial statements with a total purchase price of $341.0 million. $1.8 million, or 1% of the total purchase price was allocated to above market lease assets and $18.5 million, or 5% was allocated to below market lease liabilities. If the amounts allocated in 2024 and 2023 to below market lease liabilities and building assets were each reduced by 5% of the total purchase price, annual below market lease liability amortization increasing rental income would decrease by approximately $0.8 million (using the weighted average life of below market liabilities at each respective acquired property) and annual depreciation expense would decrease by approximately $0.4 million (using a depreciable life of 35 years).\nLong-Lived Assets and Impairment\nThere are estimates and assumptions made by management in preparing the consolidated financial statements for which the actual results will be determined over long periods of time. This includes the recoverability of long-lived assets, including our properties that have been acquired or redeveloped and our investment in certain joint ventures. Management’s evaluation of impairment includes review for possible indicators of impairment as well as, in certain circumstances, undiscounted and discounted cash flow analysis. Since most of our investments in real estate are wholly-owned or controlled assets which are held for use, a property with impairment indicators is first tested for impairment by comparing the undiscounted cash flows, taking into account the anticipated hold period, including residual value, to the current net book value of the property. If the undiscounted cash flows are less than the net book value, the property is written down to expected fair value.\nThe calculation of both discounted and undiscounted cash flows requires management to make estimates of future cash flows including revenues, operating expenses, required maintenance and development expenditures, market conditions, demand for space by tenants and rental rates over long periods. Because our properties typically have a long life, the assumptions used to estimate the future recoverability of book value requires significant management judgment. We are also required to estimate the anticipated hold period. A change in the expected holding period from a long term hold to a short term would cause a significant change in the undiscounted cash flows and could result in an impairment charge. Actual results could be significantly different from the estimates. These estimates have a direct impact on net income, because recording an impairment charge results in a negative adjustment to net income.\n33\nTable of Contents\nRecently Adopted and Recently Issued Accounting Pronouncements\nSee Note 2 to the consolidated financial statements.\n2024 Acquisitions and Dispositions\nOn May 31, 2024, we acquired the fee interest in Virginia Gateway, which is comprised of five adjacent shopping centers in Gainesville, Virginia, totaling 664,000 square feet, for $215.0 million. Approximately $21.1 million and $0.4 million of net assets acquired were allocated to other assets for \"acquired lease costs\" and \"above market leases,\" respectively, and $13.3 million of net assets acquired were allocated to other liabilities for \"below market leases.\" \nOn July 31, 2024, we acquired the fee interest in Pinole Vista Crossing, a 216,000 square foot retail shopping center in Pinole, California for $60.0 million. Approximately $5.7 million of net assets acquired were allocated to other assets for \"acquired lease costs,\" and $4.0 million of net assets acquired were allocated to other liabilities for \"below market leases.\"\nDuring the year ended December 31, 2024, we sold our Third Street Promenade property and a portion of our White Marsh Other property for sales prices totaling $106.8 million, resulting in a gain on sale of $53.8 million.\n2024 Significant Debt and Equity Transactions\nOn January 11, 2024, our Operating Partnership issued $485.0 million aggregate principal amount of 3.25% Exchangeable Senior Notes due 2029 (the “Notes”) in a private placement. The notes bear interest at an annual rate of 3.25%, payable semiannually in arrears on January 15\nth\n and July 15\nth\n of each year, beginning July 15, 2024. The notes mature on January 15, 2029, unless earlier exchanged, purchased, or redeemed. Net proceeds after the initial purchaser's discount and offering costs were approximately $471.5 million. Interest expense, including $2.6 million of debt issuance cost amortization, was $17.9 million related to these Notes for the year ended December 31, 2024. Including the debt cost amortization, the current effective interest rate on these notes is approximately 3.9%. The unamortized debt issuance costs related to the Notes were $10.9 million at December 31, 2024.\nPrior to the close of business on July 15, 2028, the Notes will be exchangeable at the option of the holders only upon certain circumstances and during certain periods. On or after July 15, 2028, until the close of business on the second scheduled trading day immediately preceding the maturity date of the Notes, holders may exchange their Notes at any time. The Operating Partnership will settle exchanges of the Notes by delivering cash up to the principal amount of the Notes exchanged, and if applicable, cash, common shares of the Trust, or a combination thereof at our option, in respect of the remainder, if any, of the exchange obligation in excess of the principal amount. If we elect to settle any portion of the exchange obligation in excess of the principal amount with shares of the Trust, an equivalent number of common units will be issued by the Operating Partnership to the Trust. The exchange rate initially equals 8.1436 common shares per $1,000 principal amount of the Notes (which is equivalent to an exchange price of approximately $122.80 per common share and reflects an exchange premium of approximately 20% based on the closing price of $102.33 on January 8, 2024). The initial exchange rate is subject to adjustment upon the occurrence of certain events, including in the event of a payment of a quarterly common dividend in excess of $1.09 per share, but will not be adjusted for any accrued and unpaid interest. While our quarterly common dividend per share currently exceeds $1.09, the exchange rate has not materially changed.\nThe Operating Partnership may redeem the Notes, at its option , in whole or in part, on or after January 20, 2027 if the last reported sales price of the common shares has been at least 130% of the exchange price then in effect for at least 20 trading days (whether or not consecutive) during any 30 day consecutive trading period (including the last trading day of such period) ending on, and including, the trading day immediately preceding the date on which the Operating Partnership provides notice of redemption. The redemption price will be equal to 100% of the principal amount of the Notes to be redeemed, plus accrued and unpaid interest, if any, to, but excluding the redemption date. \nIn connection with the Notes, we entered into privately negotiated capped call transactions with certain of the initial purchasers of the notes or their affiliates or other financial institutions. The capped call transactions cover, subject to customary adjustments, the number of our common shares that initially underlie the Notes. The capped call transactions are expected generally to reduce the potential dilution to our common shares upon exchange of any Notes and/or offset any cash payments we are required to make in excess of the principal amount of the Notes, with such reduction and/or offset subject to a cap. The cap price of the capped call transaction initially is approximately $143.26 per share, which represents a premium of approximately 40% over the last reported sale price of our common shares of $102.33 on the New York Stock Exchange on January 8, 2024, and is subject to certain adjustments under the terms of the capped call transactions. A portion of the proceeds from the Notes were used to pay the capped call premium of $19.4 million, which will be recorded in shareholders' equity for the Trust and capital for the Operating Partnership.\nOn January 16, 2024, we repaid the $600.0 million 3.95% senior unsecured notes at maturity.\n34\nTable of Contents\nOn February 6, 2024, we exercised our first option and extended the maturity date of our $600.0 million unsecured term loan to April 16, 2025, with an additional one year extension at our option still available to further extend the loan to April 16, 2026.\nOn March 8, 2024, we amended our existing at-the-market (“ATM”) equity program under which we may from time to time offer and sell common shares. This amendment reset the aggregate offering price of the program to $500.0 million. Our ATM equity program also allows shares to be sold through forward sales contracts. We intend to use the net proceeds to fund potential acquisition opportunities, fund our development and redevelopment pipeline, repay indebtedness and/or for general corporate purposes. \nFor the year ended December 31, 2024, we issued 2,059,654 common shares at a weighted average price per share of $109.20 for net cash proceeds of $222.3 million including paying $2.2 million in commissions and $0.4 million in additional offering expenses related to the sales of these common shares. For the year ended December 31, 2023, we issued 1,309,994 common shares at a weighted average price per share of $101.74 for net cash proceeds of $131.7 million including paying $1.3 million in commissions and $0.2 million in additional offering expenses related to the sales of these common shares.\nWe also entered into forward sales contracts for the three months and year ended December 31, 2024 for 476,497 common shares and 1,186,422 common shares, respectively under our ATM equity program at a weighted average offering price of $115.43 and $115.72, respectively. During the three months and year ended December 31, 2024, we settled a portion of the forward sales agreements entered into during the year by issuing 709,925 common shares for net proceeds of $81.7 million. \nThe forward price that we will receive upon physical settlement of the agreements is subject to the adjustment for (i) commissions, (ii) floating interest rate factor equal to a specified daily rate less a spread, (iii) the forward purchasers' stock borrowing costs and (iv) scheduled dividends during the term of the forward sale agreements. The remaining open forward shares may be settled at any time on or before December 2025. As of December 31, 2024, we have the remaining capacity to issue up to $144.4 million in common shares under our ATM equity program.\nCapitalized Costs\nCertain external and internal costs directly related to the development, redevelopment and leasing of real estate, including pre-construction costs, real estate taxes, insurance, and construction costs and salaries and related costs of personnel directly involved, are capitalized. We capitalized external and internal costs related to both development and redevelopment activities of $136 million and $8 million, respectively, for 2024 and $183 million and $10 million, respectively, for 2023. We capitalized external and internal costs related to other property improvements of $103 million and $5 million, respectively, for 2024 and $91 million and $4 million, respectively, for 2023. We capitalized external and internal costs related to leasing activities of $27 million and $4 million, respectively, for 2024 and $21 million and $3 million, respectively, for 2023. The amount of capitalized internal costs for salaries and related benefits for development and redevelopment activities, other property improvements, and leasing activities were $8 million, $4 million, and $4 million, respectively, for 2024 and $9 million, $4 million, and $3 million, respectively, for 2023. Total capitalized costs were $283 million for 2024 and $312 million for 2023, respectively.\nOutlook\nOur long-term growth strategy is focused on growth in earnings, funds from operations, and cash flows primarily through a combination of the following:\n•\ngrowth in our comparable property portfolio,\n•\nexpansion of our portfolio through property acquisitions, and\n•\ngrowth in our portfolio from property redevelopments and expansions.\nAlthough general economic impacts of elevated levels of inflation and higher interest rates are impacting us in the short-term, our long-term focus has not changed. \nOur comparable property growth is primarily driven by increases in rental rates on new leases and lease renewals, changes in portfolio occupancy, and the redevelopment of those assets. Over the long-term, the infill nature and strong demographics of our properties provide a strategic advantage allowing us to maintain relatively high occupancy and generally increase rental rates. We continue to experience strong demand for our commercial space as evidenced by the 2.4 million square feet of comparable space leasing we've completed in 2024, and the 2.1% spread between our leased rate of 96.2% and our occupied rate of 94.1%. However, the effects of high levels of inflation and interest rates continue to negatively impact our business with the largest impacts being higher interest costs, increased material costs, and higher operating costs. We continue to see impacts of increased costs for certain construction and other materials that support our development and redevelopment activities. Worsening supply chain disruptions could also result in extended time frames and/or increased costs for completion of our projects and tenant build-outs, which could delay the commencement of rent payments under new leases. Similarly, if our tenants experience significant disruptions in supply chains supporting their own products, staffing issues due to labor shortages, or are otherwise impacted by worsening economic conditions, their ability to pay rent may be adversely affected. We continue \n35\nTable of Contents\nto monitor these macroeconomic developments and are working with our tenants and our vendors to limit the overall impact to our business. \nWe believe the locations and nature of our centers and diverse tenant base partially mitigates any potential negative changes in the economic environment. However, any significant reduction in our tenants' abilities to pay base rent, percentage rent or other charges, will adversely affect our financial condition and results of operations. We seek to maintain a mix of strong national, regional, and local retailers. At December 31, 2024, no single tenant accounted for more than 2.6% of annualized base rent. \nWe continue to have several development projects in process being delivered as follows:\n•\nPhase IV at Pike & Rose is a 276,000 square foot office building (which includes 10,000 square feet of ground floor retail space). Approximately 220,000 square feet of the office space is leased and all of the retail space is leased. The building is expected to cost between $180 million and $190 million, and began delivering in late September 2023. As of December 31, 2024, approximately 164,000 square feet of office space is open and 5,000 square feet of retail space is open.\n•\nConstruction on Santana West includes an eight story 369,000 square foot office building, which is expected to cost between $325 million and $335 million. Approximately 241,000 square feet of space is leased, of which 29,000 square feet of space is open as of December 31, 2024.\n•\nThroughout the portfolio, we currently have redevelopment projects underway with a projected total cost of approximately $271 million that we expect to stabilize over the next several years.\nThe above includes our best estimates based on information currently known, however, the completion of construction, final costs, and the timing of leasing and openings may be further impacted by the current environment including the duration and severity of the economic impacts of broader, as well as local, economic conditions, inflation, higher interest rates, and higher operating costs.\nThe development of future phases of Assembly Row, Pike & Rose, Santana Row, and other properties will be pursued opportunistically based on, among other things, market conditions, tenant demand, and our evaluation of whether those phases will generate an appropriate financial return.\nWe continue to review acquisition opportunities that complement our portfolio and provide long-term growth opportunities. Initially, some of our acquisitions do not contribute significantly to earnings growth; however, we believe they provide long-term re-leasing growth, redevelopment opportunities, and other strategic opportunities. Any growth from acquisitions is contingent on our ability to find properties that meet our qualitative standards at prices that meet our financial hurdles. Changes in interest rates may affect our success in achieving earnings growth through acquisitions by affecting both the price that must be paid to acquire a property, as well as our ability to economically finance the property acquisition. Generally, our acquisitions are initially financed by available cash and/or borrowings under our revolving credit facility which may be repaid later with funds raised through the issuance of new equity or new long-term debt. We may also finance our acquisitions through the issuance of common shares, preferred shares, or units in the Operating Partnership, as well as through assumed mortgages and property sales.\nAt December 31, 2024, the leasable commercial square feet in our properties was 96.2% leased and 94.1% occupied. The leased rate is higher than the occupied rate due to leased spaces that are being redeveloped or improved or that are awaiting permits and, therefore, are not yet ready to be occupied. Our occupancy and leased rates are subject to variability over time due to factors including acquisitions, the timing of the start and stabilization of our redevelopment projects, lease expirations and tenant closings and bankruptcies.\nComparable Properties\nThroughout this section, we have provided certain information on a “comparable property” basis. Information provided on a comparable property basis includes the results of properties that we owned and operated for the entirety of both periods being compared except for properties that are currently under development or are being repositioned for significant redevelopment and investment. For the year ended December 31, 2024 and the comparison of 2023, all or a portion of 95 properties were considered comparable properties and seven were considered non-comparable properties. For the year ended December 31, 2024, one property and two portions of properties were moved from non-comparable properties to comparable properties, two properties and one portion of a property were moved from acquisitions to comparable properties, and two properties were removed from comparable as we no longer own the properties, compared to the designations as of December 31, 2023. While there is judgment surrounding changes in designations, we typically move non-comparable properties to comparable properties once they have stabilized, which is typically considered 90% physical occupancy or when the growth expected from the redevelopment has been included in the comparable periods. We typically remove properties from comparable properties when the repositioning of the asset has commenced and has or is expected to have a significant impact to property operating income \n36\nTable of Contents\nwithin the calendar year. Acquisitions are moved to comparable properties once we have owned the property for the entirety of comparable periods and the property is not under development or being repositioned for significant redevelopment and investment. \n37\nTable of Contents\nYEAR ENDED DECEMBER 31, 2024 COMPARED TO YEAR ENDED DECEMBER 31, 2023 \n \n \n \n \nChange\n \n2024\n2023\nDollars\n%\n \n(Dollar amounts in thousands)\nRental income\n$\n1,170,078 \n$\n1,101,439 \n$\n68,639 \n6.2 \n%\nOther property income\n31,258 \n29,602 \n1,656 \n5.6 \n%\nMortgage interest income\n1,116 \n1,113 \n3 \n0.3 \n%\nTotal property revenue\n1,202,452 \n1,132,154 \n70,298 \n6.2 \n%\nRental expenses\n249,569 \n231,666 \n17,903 \n7.7 \n%\nReal estate taxes\n142,230 \n131,429 \n10,801 \n8.2 \n%\nTotal property expenses\n391,799 \n363,095 \n28,704 \n7.9 \n%\nProperty operating income \n(1)\n810,653 \n769,059 \n41,594 \n5.4 \n%\nGeneral and administrative expense\n(49,739)\n(50,707)\n968 \n(1.9)\n%\nDepreciation and amortization\n(342,598)\n(321,763)\n(20,835)\n6.5 \n%\nGain on sale of real estate\n54,040 \n9,881 \n44,159 \n446.9 \n%\nOperating income\n472,356 \n406,470 \n65,886 \n16.2 \n%\nOther interest income\n4,294 \n4,687 \n(393)\n(8.4)\n%\nInterest expense\n(175,476)\n(167,809)\n(7,667)\n4.6 \n%\nIncome from partnerships\n3,160 \n3,869 \n(709)\n(18.3)\n%\nTotal other, net\n(168,022)\n(159,253)\n(8,769)\n5.5 \n%\nNet income\n304,334 \n247,217 \n57,117 \n23.1 \n%\nNet income attributable to noncontrolling interests\n(9,126)\n(10,232)\n1,106 \n(10.8)\n%\nNet income attributable to the Trust\n$\n295,208 \n$\n236,985 \n$\n58,223 \n24.6 \n%\n(1) Property operating income is a non-GAAP measure that consists of rental income and mortgage interest income, less rental expenses and real estate taxes. This measure is used internally to evaluate the performance of property operations to the previous period and we consider it be a significant measure. We believe that property operating income is useful to investors in measuring the operating performance of our property portfolio because the definition excludes various items included in operating income that do not relate to, or are not indicative of, the operating performance of our properties, such as general and administrative expenses and depreciation and amortization, and allows us to isolate disparities in operating income caused by acquisitions, dispositions, and stabilization of properties. Property operating income may, therefore, provide a more consistent metric for comparing the operating performance of our real estate between periods. Property operating income should not be considered an alternative measure of operating results or cash flow from operations as determined in accordance with GAAP. The reconciliation of operating income to property operating income for 2024 and 2023 is as follows:\n2024\n2023\n(in thousands)\nOperating income\n$\n472,356 \n$\n406,470 \nGeneral and administrative\n49,739 \n50,707 \nDepreciation and amortization\n342,598 \n321,763 \nGain on sale of real estate\n(54,040)\n(9,881)\nProperty operating income\n$\n810,653 \n$\n769,059 \nProperty Revenues\nTotal property revenue increased $70.3 million, or 6.2%, to $1.20 billion in 2024 compared to $1.13 billion in 2023. The percentage occupied at our shopping centers was 94.1% at December 31, 2024 compared to 92.2% at December 31, 2023. Rental income consists primarily of minimum rent, cost reimbursements from tenants and percentage rent, and is net of collectibility related adjustments. Other property income includes revenue for our Pike & Rose hotel, parking income, and other incidental income from our properties. The increase in property revenues is due primarily to the following:\n38\nTable of Contents\n•\nan increase of $37.7 million from comparable properties primarily related to higher rental rates of approximately $22.8 million, a $12.4 million increase in recoveries from tenants on higher expenses, and higher average occupancy of approximately $4.4 million, partially offset by a $2.5 million decrease in lease termination fee income and a $0.8 million increase in collectibility related adjustments, \n•\nan increase of $17.7 million from non-comparable properties primarily driven by occupancy increases at Pike & Rose Phase IV, Huntington Shopping Center, Darien Commons, and Santana West,\n•\nan increase of $17.4 million from 2024 and 2023 acquisitions, and\n•\nan increase of $5.3 million from Escondido Promenade, which was reconsolidated in the second quarter of 2023 after we gained control of the property (see Note 3 to the consolidated financial statements for additional information),\npartially offset by\n•\na decrease of $9.0 million from property dispositions.\nProperty Expenses\nTotal property expenses increased $28.7 million, or 7.9%, to $391.8 million in 2024 compared to $363.1 million in 2023. Changes in the components of property expenses are discussed below.\nRental Expenses\nRental expenses increased $17.9 million, or 7.7%, to $249.6 million in 2024 compared to $231.7 million in 2023. This increase is primarily due to the following:\n•\nan increase of $11.0 million from comparable properties due primarily to higher repairs and maintenance costs, snow removal costs, utilities and insurance costs, and an increase in management fees on higher revenues,\n•\nan increase of $3.3 million from 2024 and 2023 acquisitions,\n•\nan increase of $3.2 million from non-comparable properties driven by openings at Pike & Rose Phase IV, Huntington Shopping Center, Santana West, and Darien Commons, and\n•\nan increase of $1.0 million from Escondido Promenade, which was reconsolidated in the second quarter of 2023 after we gained control of the property,\npartially offset by\n•\na decrease of $1.4 million from property dispositions.\nAs a result of the changes in rental income and rental expenses as discussed above, rental expenses as a percentage of rental income increased to 21.3% for the year ended December 31, 2024 from 21.0% for the year ended December 31, 2023.\nReal Estate Taxes\nReal estate tax expense increased $10.8 million, or 8.2% to $142.2 million in 2024 compared to $131.4 million in 2023 due primarily to the following:\n•\nan increase of $6.1 million from comparable properties due to higher assessments and successful tax appeals in 2023,\n•\nan increase of $2.8 million from non-comparable properties due primarily to successful tax appeals in 2023, and openings at Pike & Rose Phase IV, Darien Commons, and Huntington Shopping Center,\n•\nan increase of $1.9 million from 2024 acquisitions, and\n•\nan increase of $0.6 million from Escondido Promenade, which was reconsolidated in the second quarter of 2023 after we gained control of the property,\npartially offset by\n•\na decrease of $0.7 million from property dispositions.\nProperty Operating Income\nProperty operating income increased $41.6 million, or 5.4%, to $810.7 million in 2024 compared to $769.1 million in 2023. This increase is primarily driven by higher rental rates and average occupancy, 2024 acquisitions, 2023 and 2024 openings at our non-comparable properties, and the reconsolidation of Escondido Promenade during the second quarter of 2023, partially offset by property dispositions, higher rental expenses after recoveries from tenants, and lower lease termination fee income.\n39\nTable of Contents\nGeneral and administrative expenses\nGeneral and administrative expense decreased $1.0 million, or 1.9%, to $49.7 million in 2024 compared to $50.7 million in 2023. This decrease is primarily driven by lower employee compensation expense and higher amounts allocated to operations as a result of higher revenues, partially offset by a $3.7 million one-time charge related to the departure of an executive officer.\nDepreciation and amortization\nDepreciation and amortization expense increased $20.8 million, or 6.5%, to $342.6 million in 2024 from $321.8 million in 2023. This increase is due primarily to 2024 acquisitions, our investment in comparable properties, the opening of Pike & Rose Phase IV, placing redevelopment properties into service, and the reconsolidation of Escondido Promenade during the second quarter of 2023, partially offset by property dispositions.\nGain on Sale of Real Estate\nThe $54.0 million gain on sale of real estate for the year ended December 31, 2024 is due primarily to the sale of Third Street Promenade and a portion of our White Marsh Other property (see Note 3 to the consolidated financial statements for additional information).\nThe $9.9 million gain on sale of real estate for the year ended December 31, 2023 is due primarily to the sale of our Town Center of New Britain shopping center and a portion of Third Street Promenade (see Note 3 to the consolidated financial statements for additional information).\nOperating Income\nOperating income increased $65.9 million, or 16.2%, to $472.4 million in 2024 compared to $406.5 million in 2023. This increase is primarily driven by higher gains on sale of real estate, higher rental rates and average occupancy, 2024 acquisitions, 2023 and 2024 openings at our non-comparable properties, and the reconsolidation of Escondido Promenade during the second quarter of 2023, partially offset by property dispositions, higher rental expenses after recoveries from tenants, and lower lease termination fee income.\nOther\nInterest Expense\nInterest expense increased $7.7 million, or 4.6%, to $175.5 million in 2024 compared to $167.8 million in 2023. This increase is due primarily to the following:\n•\nan increase of $5.1 million due to a higher overall weighted average borrowing rate,\n•\na decrease of $2.1 million in capitalized interest, and\n•\nan increase of $0.4 due to higher weighted average borrowings.\nGross interest costs were $196.0 million and $190.4 million in 2024 and 2023, respectively. Capitalized interest was $20.5 million and $22.6 million in 2024 and 2023, respectively.\nDiscussions of year-to-year comparisons between 2023 and 2022 can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed with the Securities and Exchange Commission on February 12, 2024.\nLiquidity and Capital Resources\nDue to the nature of our business and strategy, we typically generate significant amounts of cash from operations which is largely paid to our common and preferred shareholders in the form of dividends because as a REIT, the Trust is generally required to make annual distributions to shareholders of at least 90% of our taxable income (cash dividends paid in 2024 were approximately $373.3 million). Remaining cash flow from operations after regular debt service requirements (including debt service relating to additional or replacement debt, as well as scheduled debt maturities) and dividend payments is used to fund recurring and non-recurring capital projects (such as tenant improvements and redevelopments). We maintain an unsecured $1.25 billion revolving credit facility to fund short term cash flow needs and also look to the public and private debt and equity markets, joint venture relationships, and property dispositions to fund capital expenditures on a long-term basis.\nOn January 11, 2024, we issued $485.0 million aggregate principal amount of 3.25% exchangeable senior notes, for which the proceeds were used to repay our $600.0 million of 3.95% senior unsecured notes at maturity on January 16, 2024. Our $600.0 million unsecured term loan has a maturity in April 2025, however, there is a one-year extension at our option that would extend the maturity to April 2026, if exercised. In addition to the term loan, we have $243.1 million of debt maturing during the \n40\nTable of Contents\nremainder of 2025, of which, $200.0 million is the mortgage loan secured by Bethesda Row, which has two one-year extensions, at our option, that would extend the maturity date to December 28, 2027.\nAs of December 31, 2024, we had cash and cash equivalents of $123.4 million and no balance outstanding on our $1.25 billion unsecured revolving credit facility. We also have outstanding forward sales agreements for net proceeds of $54.7 million as of  December 31, 2024, and the capacity to issue up to $144.4 million in common shares under the ATM program.\nFor the year ended 2024, the weighted average amount of borrowings outstanding on our revolving credit facility was $33.5 million, and the weighted average interest rate, before amortization of debt fees, was 6.1%. \nOur capital requirements in 2025 will depend on acquisition opportunities, the level and general timing of our redevelopment and development activities, and the overall economic environment. We currently have development and redevelopment projects in various stages of construction with remaining costs of $228 million. We expect to incur the majority of those costs in the next two years. We expect other capital costs to be at levels consistent with 2024.\nWe believe cash flow from operations, the cash on our balance sheet, and our $1.25 billion revolving credit facility will allow us to continue to operate our business in the short-term. Given our ability to access the capital markets, we also expect debt or equity to be available to us, although newly issued debt would likely be at higher interest rates than we currently have outstanding. We also have the ability to delay the timing of certain development and redevelopment projects as well as limit future acquisitions, reduce our operating expenditures, or re-evaluate our dividend policy. We expect these sources of liquidity and opportunities for operating flexibility to allow us to meet our financial obligations over the long term. We intend to operate with and to maintain our long term commitment to a conservative capital structure that will allow us to maintain strong debt service coverage and fixed-charge coverage ratios as part of our commitment to investment-grade debt ratings.\nSummary of Cash Flows\n \n \nYear Ended December 31,\n \n2024\n2023\nChange\n \n(In thousands)\nNet cash provided by operating activities\n$\n574,563 \n$\n555,830 \n$\n18,733 \nNet cash used in investing activities\n(446,826)\n(358,325)\n(88,501)\nNet cash used in financing activities\n(252,298)\n(33,849)\n(218,449)\n(Decrease) increase in cash and cash equivalents\n(124,561)\n163,656 \n(288,217)\nCash, cash equivalents, and restricted cash, beginning of year\n260,004 \n96,348 \n163,656 \nCash, cash equivalents, and restricted cash, end of year\n$\n135,443 \n$\n260,004 \n$\n(124,561)\nNet cash provided by operating activities increased $18.7 million to $574.6 million during 2024 from $555.8 million during 2023. The increase was primarily attributable to higher net income after adjusting for non-cash items and gains on sale of real estate, partially offset by the timing of interest payments.\nNet cash used in investing activities increased $88.5 million to $446.8 million during 2024 from $358.3 million during 2023. The increase was primarily attributable to:\n•\na $213.3 million increase in acquisition of real estate primarily due to the May 2024 acquisition of the Virginia Gateway and the July 2024 acquisition of Pinole Vista Crossing (see Note 3 to the consolidated financial statements for additional information), as compared to the January 2023 Huntington Square acquisition and the acquisition of our partner's 22.3% TIC interest in Escondido Promenade in May 2023,\npartially offset by,\n•\na $71.5 million increase in net proceeds from the sale of real estate primarily due to $99.9 million of net proceeds from the sale of Third Street Promenade and a portion of our White Marsh Other property in 2024, as compared to $28.5 million of net proceeds from the sale of Town Center of New Britain and a portion of Third Street Promenade in 2023, and\n•\na $64.4 million decrease in capital expenditures.\nNet cash used in financing activities increased $218.4 million to $252.3 million during 2024 from $33.8 million during 2023. The increase was primarily attributable to:\n41\nTable of Contents\n•\na $325.0 million increase in repayment of senior notes due to the January 2024 repayment of our $600.0 million 3.95% senior unsecured notes at maturity, as compared to the June 2023 repayment of our $275.0 million 2.75% senior unsecured notes,\n•\n$199.2 million in net proceeds from the mortgage loan secured by our Bethesda Row property, which was entered into in December 2023,\n•\na $19.4 million premium paid for the capped call transaction entered into in connection with the issuance of $485.0 million 3.25% exchangeable senior notes in January 2024,\n•\na $12.4 million increase in dividends paid to common and preferred shareholders due to an increase in the number of outstanding shares, as well as an increase to the common share dividend rate, and\n•\na $12.3 million increase in distributions to and redemptions of noncontrolling interests primarily related to our April 2024 acquisition of the noncontrolling interest in the partnership that owns our CocoWalk property for approximately $12.4 million, \npartially offset by,\n•\na $172.2 million increase in net proceeds from the issuance of common shares under our ATM program,\n•\na $125.8 million net increase in proceeds from the issuance of senior notes due to net proceeds of $471.5 million from the issuance of $485.0 million 3.25% exchangeable senior notes in January 2024, as compared to $345.7 million in net proceeds from the issuance of $350.0 million of 5.375% senior unsecured notes in April 2023, and\n•\na $55.0 million decrease in repayment of mortgages, finance leases, and notes payable primarily due to the October 2023 finance lease buyout (see Note 3 to the consolidated financial statements for additional information)\nCash Requirements\nThe following table provides a summary of material cash requirements comprising our fixed, noncancelable obligations as of December 31, 2024:\n \nCash Requirements by Period\nTotal\nNext Twelve Months\nGreater than Twelve Months\n(In thousands)\nFixed and variable rate debt (principal only) (1)\n$\n4,496,724 \n$\n848,130 \n$\n3,648,594 \nFixed and variable rate debt - our share of unconsolidated real estate partnerships (principal only)(2)\n62,467 \n34,877 \n27,590 \nLease obligations (minimum rental payments) (3)\n287,930 \n6,608 \n281,322 \nRedevelopments/capital expenditure contracts\n252,365 \n228,394 \n23,971 \nReal estate commitments (4)\n9,713 \n— \n9,713 \nTotal estimated cash requirements\n$\n5,109,199 \n$\n1,118,009 \n$\n3,991,190 \n _____________________\n(1)\nThe weighted average interest rate on our fixed and variable rate debt is 3.9% as of December 31, 2024. Of the $848.1 million of debt maturing in the next twelve months as of December 31, 2024, $600.0 million is related to our term loan, which has a one-year option to extend the April 2025 maturity date to April 2026. Additionally, we have two one-year extensions, at our option, to extend the December 2025 maturity date of our $200.0 million mortgage loan secured by Bethesda Row to December 2027.\n(2)\nThe weighted average interest rate on the fixed and variable rate debt related to our unconsolidated real estate partnerships is 4.36% as of December 31, 2024.\n(3)\nThis includes minimum rental payments related to both finance and operating leases. \n(4)\nThis includes the liability related to the sale under threat of condemnation at San Antonio Center as further discussed in Note 7 to the consolidated financial statements.\nIn addition to the amounts set forth in the table above and other liquidity requirements previously discussed, the following potential commitments exist:\n(a)\nUnder the terms of the Congressional Plaza partnership agreement, a minority partner has the right to require us and the other minority partner to purchase its 26.63% interest in Congressional Plaza at the interest’s then-current fair market value. If the other minority partner defaults in their obligation, we must purchase the full interest. Based on management’s current \n42\nTable of Contents\nestimate of fair market value as of December 31, 2024, our estimated liability upon exercise of the put option would range from approximately $60 million to $63 million. \n(b)\nUnder the terms of various other partnership agreements, the partners have the right to exchange their operating partnership units for cash or the same number of our common shares, at our option. As of December 31, 2024, a total of 608,348 downREIT operating partnership units are outstanding.\n(c)\nThe other member in The Grove at Shrewsbury and Brook 35 has the right to require us to purchase all of its approximately 4.1% interest in The Grove at Shrewsbury and approximately 6.5% interest in Brook 35 at the interests' then-current fair market value. Based on management's current estimate of fair market value as of December 31, 2024, our estimated maximum liability upon exercise of the put option would range from $8 million to $9 million. \n(d)\nThe other member in Hoboken has the right to require us to purchase all of its 10% ownership interest at the interest's then-current fair market value. Based on management's current estimate of fair market value as of December 31, 2024, our estimated maximum liability upon exercise of the put option would range from $11 million to $12 million.\n(e)\nEffective June 14, 2026, the other member in Camelback Colonnade and Hilton Village has the right to require us to purchase all of its 2.0% ownership interest at the interest's then-current fair market value. Based on management's current estimate of fair value as of December 31, 2024, our estimated maximum liability upon exercise of the put option would range from $4 million to $5 million.\n(f)\nEffective October 6, 2027, the other member in the partnership that owns equity method investments in Chandler Festival and Chandler Gateway has the right to require us to purchase its 2.5% net ownership interest. Based on management's current estimate of fair value as of December 31, 2024, our estimated maximum liability upon exercise of the put option would range from $1 million and $2 million.\n(g)\nEffective June 1, 2029, the other member in Grossmont Center has the right to require us to purchase all of its 40.0% ownership interest at the  interest's then-current fair market value. Based on management's current estimate of fair value as of December 31, 2024, our estimated maximum liability upon exercise of the put option would range from $68 million to $73 million.\n(h)\nAt December 31, 2024, we had letters of credit outstanding of approximately $5.9 million.\nOff-Balance Sheet Arrangements\nAt December 31, 2024, we have four real estate related equity method investments with total debt outstanding of $151.3 million, of which our share is $62.5 million. Our investment in these ventures at December 31, 2024 was $29.4 million.\nOther than the items disclosed in the Cash Requirements table, we have no off-balance sheet arrangements as of December 31, 2024 that are reasonably likely to have a current or future material effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, cash requirements, or capital resources.\n43\nTable of Contents\nDebt Financing Arrangements\nThe following is a summary of our total debt outstanding as of December 31, 2024:\nDescription of Debt\nOriginal\nDebt\nIssued\nPrincipal Balance as of December 31, 2024\nStated Interest Rate as of December 31, 2024\nMaturity Date\n \n(Dollars in thousands)\n \n \nMortgages payable\nSecured fixed rate\nAzalea\nAcquired\n$\n40,000 \n3.73 \n%\nNovember 1, 2025\nBethesda Row (1)\n200,000 \n200,000 \nSOFR + 0.95%\nDecember 28, 2025\nBell Gardens\nAcquired\n11,215 \n4.06 \n%\nAugust 1, 2026\nPlaza El Segundo\n125,000 \n125,000 \n3.83 \n%\nJune 5, 2027\nThe Grove at Shrewsbury (East)\n43,600 \n43,600 \n3.77 \n%\nSeptember 1, 2027\nBrook 35\n11,500 \n11,500 \n4.65 \n%\nJuly 1, 2029\nHoboken (24 Buildings) (2)\n56,450 \n52,123 \nSOFR + 1.95%\nDecember 15, 2029\nVarious Hoboken (14 Buildings) (3)\nAcquired\n28,838 \nVarious\nVarious through 2029\nChelsea\nAcquired\n3,568 \n5.36 \n%\nJanuary 15, 2031\nSubtotal\n515,844 \nNet unamortized debt issuance costs and discount\n(1,466)\nTotal mortgages payable, net\n514,378 \nNotes payable\nTerm Loan (4)(6)\n600,000 \n600,000 \nSOFR + 0.85%\nApril 16, 2025\nRevolving credit facility (4) (6)\n(5)\n— \nSOFR + 0.775%\nApril 5, 2027\nVarious\n6,311 \n1,680 \nVarious\nVarious through 2059\nSubtotal\n601,680 \nNet unamortized debt issuance costs\n(266)\nTotal notes payable, net\n601,414 \nSenior notes and debentures (6)\nUnsecured fixed rate\n1.25% notes\n400,000 \n400,000 \n1.25 \n%\nFebruary 15, 2026\n7.48% debentures\n50,000 \n29,200 \n7.48 \n%\nAugust 15, 2026\n3.25% notes\n475,000 \n475,000 \n3.25 \n%\nJuly 15, 2027\n6.82% medium term notes\n40,000 \n40,000 \n6.82 \n%\nAugust 1, 2027\n5.375% notes\n350,000 \n350,000 \n5.375 \n%\nMay 1, 2028\n3.25% exchangeable notes\n485,000 \n485,000 \n3.25 \n%\nJanuary 15, 2029\n3.20% notes\n400,000 \n400,000 \n3.20 \n%\nJune 15, 2029\n3.50% notes\n400,000 \n400,000 \n3.50 \n%\nJune 1, 2030\n4.50% notes\n550,000 \n550,000 \n4.50 \n%\nDecember 1, 2044\n3.625% notes\n250,000 \n250,000 \n3.625 \n%\nAugust 1, 2046\nSubtotal\n3,379,200 \nNet unamortized debt issuance costs and premium\n(21,360)\nTotal senior notes and debentures, net\n3,357,840 \nTotal debt, net\n$\n4,473,632\n \n_____________________\n(1)\nThe interest rate on this mortgage loan is fixed at a weighted average interest rate of 5.03% through the initial maturity date through three interest rate swap agreements. We have two one-year extensions, at our option to extend the maturity date of this mortgage loan to December 28, 2027.\n(2)\nThe interest rate on this mortgage loan is fixed at 3.67% through two interest rate swap agreements. \n(3)\nThe interest rates on these mortgages range from 3.91% to 5.00%.\n(4)\nOur revolving credit facility SOFR loans bear interest at Daily Simple SOFR or Term SOFR and our term loan bears interest at Term SOFR as defined in the respective credit agreements, plus 0.10%, plus a spread, based on our current credit rating.\n(5)\nThe maximum amount drawn under our $1.25 billion revolving credit facility during 2024 was $202.7 million and the weighted average effective interest rate on borrowings under our revolving credit facility, before amortization of debt fees, was 6.1%.\n(6)\nThe Operating Partnership is the obligor under our revolving credit facility, term loan, and senior notes and debentures. Effective April 1, 2024, a wholly owned subsidiary of the Operating Partnership guarantees the loan.\n44\nTable of Contents\nOur revolving credit facility, unsecured term loan, and other debt agreements include financial and other covenants that may limit our operating activities in the future. As of December 31, 2024, we were in compliance with all financial and other covenants related to our revolving credit facility, term loan, and senior notes. Additionally, we were in compliance with all of the financial and other covenants that could trigger a loan default on our mortgage loans. If we were to breach any of these financial and other covenants and did not cure the breach within an applicable cure period, our lenders could require us to repay the debt immediately and, if the debt is secured, could immediately begin proceedings to take possession of the property securing the loan. Many of our debt arrangements, including our public notes and our revolving credit facility, are cross-defaulted, which means that the lenders under those debt arrangements can put us in default and require immediate repayment of their debt if we breach and fail to cure a default under certain of our other debt obligations. As a result, any default under our debt covenants could have an adverse effect on our financial condition, our results of operations, our ability to meet our obligations and the market value of our shares. Our organizational documents do not limit the level or amount of debt that we may incur.\nThe following is a summary of our scheduled principal repayments as of December 31, 2024:\n \nUnsecured\nSecured\nTotal\n \n(In thousands)\n \n2025\n$\n600,538 \n(1)\n$\n247,592 \n(2)\n$\n848,130 \n  \n2026\n429,299 \n26,282 \n455,581 \n  \n2027\n515,043 \n(3)\n178,282 \n693,325 \n  \n2028\n350,000 \n2,511 \n352,511 \n  \n2029\n885,000 \n60,434 \n945,434 \n  \nThereafter\n1,201,000 \n  \n743 \n1,201,743 \n  \n$\n3,980,880 \n  \n$\n515,844 \n$\n4,496,724 \n(4)\n_____________________\n(1)\nOur $600.0 million term loan matures on April 16, 2025, plus one one-year extension at our option to April 16, 2026.\n(2)\nOur $200.0 million mortgage loan secured by Bethesda Row matures on December 28, 2025 plus two one-year extensions, at our option to December 28, 2027.\n(3)\nOur $1.25 billion revolving credit facility matures on April 5, 2027, plus two six-month extensions at our option to April 5, 2028. As of December 31, 2024, there was no outstanding balance under this credit facility.\n(4)\nThe total debt maturities differ from the total reported on the consolidated balance sheet due to the unamortized net debt issuance costs and premium/discount on mortgage loans, notes payable, and senior notes as of December 31, 2024.\nInterest Rate Hedging\nWe may use derivative instruments to manage exposure to variable interest rate risk. We generally enter into interest rate swaps to manage our exposure to variable interest rate risk and treasury locks to manage the risk of interest rates rising prior to the issuance of debt. We enter into derivative instruments that qualify as cash flow hedges and do not enter into derivative instruments for speculative purposes.\nInterest rate swaps associated with cash flow hedges are recorded at fair value on a recurring basis. Effectiveness of cash flow hedges is assessed both at inception and on an ongoing basis. The effective portion of changes in fair value of the interest rate swaps associated with cash flow hedges is recorded in other comprehensive income which is included in \"accumulated other comprehensive income\" on the balance sheets, statement of shareholders' equity, and statement of capital. Cash flow hedges become ineffective if critical terms of the hedging instrument and the debt instrument do not perfectly match such as notional amounts, settlement dates, reset dates, calculation period and SOFR rate. In addition, the default risk of the counterparty is evaluated by monitoring the credit worthiness of the counterparty which includes reviewing debt ratings and financial performance. If a cash flow hedge is deemed ineffective, the ineffective portion of changes in fair value of the interest rate swaps associated with cash flow hedges is recognized in earnings in the period affected.\nAs of December 31, 2024, we have two interest rate swap agreements that effectively fix the interest rate on a mortgage payable associated with our Hoboken portfolio at 3.67% and we have three interest rate swap agreements that effectively fix the interest rate on a mortgage payable associated with Bethesda Row at 5.03% through the initial maturity date. Our Assembly Row hotel joint venture is also a party to two interest rate swap agreements that effectively fix 100% of its outstanding $38.6 million of debt through May 2025 at 6.39% and 50% of its outstanding debt from June 2025 through May 2028 at 6.03%. All swaps were designated and qualify as cash flow hedges. Hedge ineffectiveness has not impacted our earnings in 2024, 2023 and 2022.\n45\nTable of Contents\nREIT Qualification\nWe intend to maintain our qualification as a REIT under Section 856(c) of the Code. As a REIT, we generally will not be subject to corporate federal income taxes on income we distribute to our shareholders as long as we satisfy certain technical requirements of the Code, including the requirement to distribute at least 90% of our taxable income to our shareholders.\nFunds From Operations\nFunds from operations (“FFO”) is a supplemental non-GAAP financial measure of real estate companies’ operating performance. The National Association of Real Estate Investment Trusts (“NAREIT”) defines FFO as follows: net income, computed in accordance with U.S. GAAP, plus real estate related depreciation and amortization, and excluding gains and losses on the sale of real estate or changes in control, net of tax, and impairment write-downs of certain real estate assets and investments in entities when the impairment is directly attributable to decreases in the value of depreciable real estate held by the entity. We compute FFO in accordance with the NAREIT definition, and we have historically reported our FFO available for common shareholders in addition to our net income and net cash provided by operating activities. It should be noted that FFO:\n•\ndoes not represent cash flows from operating activities in accordance with GAAP (which, unlike FFO, generally reflects all cash effects of transactions and other events in the determination of net income);\n•\nshould not be considered an alternative to net income as an indication of our performance; and\n•\nis not necessarily indicative of cash flow as a measure of liquidity or ability to fund cash needs, including the payment of dividends.\nWe consider FFO available for common shareholders a meaningful, additional measure of operating performance primarily because it excludes the assumption that the value of the real estate assets diminishes predictably over time, as implied by the historical cost convention of GAAP and the recording of depreciation. We use FFO primarily as one of several means of assessing our operating performance in comparison with other REITs. Comparison of our presentation of FFO to similarly titled measures for other REITs may not necessarily be meaningful due to possible differences in the application of the NAREIT definition used by such REITs.\nAn increase or decrease in FFO available for common shareholders does not necessarily result in an increase or decrease in aggregate distributions because our Board of Trustees is not required to increase distributions on a quarterly basis. However, we must distribute at least 90% of our annual taxable income to remain qualified as a REIT. Therefore, a significant increase in FFO will generally require an increase in distributions to shareholders although not necessarily on a proportionate basis.\nThe reconciliation of net income to FFO available for common shareholders is as follows:\n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In thousands, except per share data)\nNet income\n$\n304,334 \n$\n247,217 \n$\n395,661 \nNet income attributable to noncontrolling interests\n(9,126)\n(10,232)\n(10,170)\nGain on deconsolidation of a VIE\n— \n— \n(70,374)\nGain on sale of real estate \n(54,040)\n(9,881)\n(93,483)\nDepreciation and amortization of real estate assets\n302,455 \n285,689 \n266,741 \nAmortization of initial direct costs of leases\n33,377 \n31,208 \n27,268 \nFunds from operations\n577,000 \n544,001 \n515,643 \nDividends on preferred shares (1)\n(7,500)\n(7,500)\n(7,500)\nIncome attributable to downREIT operating partnership units\n2,743 \n2,767 \n2,810 \nIncome attributable to unvested shares\n(2,004)\n(1,955)\n(1,797)\nFunds from operations available for common shareholders\n$\n570,239 \n$\n537,313 \n$\n509,156 \nWeighted average number of common shares, diluted (1)(2)\n84,286 \n82,044 \n80,603 \nFunds from operations available for common shareholders, per diluted share\n$\n6.77 \n$\n6.55 \n$\n6.32 \n_____________________\n46\nTable of Contents\n(1)\nFor the years ended December 31, 2024, 2023 and 2022, dividends on our Series 1 preferred stock were not deducted in the calculation of FFO available to common shareholders, as the related shares were dilutive and included in \"weighted average number of common shares, diluted.\"\n(2)\nThe weighted average common shares used to compute FFO per diluted common share includes downREIT operating partnership units that were excluded from the computation of diluted EPS. Conversion of these operating partnership units is dilutive in the computation of FFO per diluted common share but is anti-dilutive for the computation of diluted EPS for 2024 and 2023.",
  "item2": null
}