{
  "source_file": "fslr-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n Business\nCompany Overview\nWe are America’s leading photovoltaic (“PV”) solar technology and manufacturing company. The only U.S.-headquartered company among the world’s largest solar manufacturers, First Solar is focused on competitively and reliably enabling power generation needs with our advanced, thin film PV technology. Developed at research and development (“R&D”) labs in California and Ohio, the Company’s technology represents the next generation of solar power generation, providing a competitive, high-performance, and responsibly produced alternative to conventional crystalline silicon PV solar modules. Our PV solar modules are produced using a fully integrated, continuous process that does not rely on Chinese crystalline silicon supply chains.\nWe are the world’s largest thin film PV solar module manufacturer and the largest PV solar module manufacturer in the Western Hemisphere. In addressing the overall global demand for electricity, PV solar modules provide energy at a lower levelized cost of electricity (“LCOE”), meaning the net present value of a system’s total life cycle costs divided by the quantity of energy that is expected to be produced over the system’s life, when compared to traditional forms of energy generation. With approximately $2 billion in cumulative R&D investments in the last 20 years, we have a demonstrated history of innovation and continuous improvement. We believe our strategies and points of differentiation provide the foundation for our competitive position and enable us to remain one of the preferred providers of PV solar modules.\nBusiness Strategy\nAdvanced Module Technology\nOur current module semiconductor structure is a single-junction polycrystalline thin film that uses Cadmium Telluride (“CdTe”) as the absorption layer. CdTe has absorption properties that are well matched to the solar spectrum and can deliver competitive wattage using approximately 2% to 3% of the amount of semiconductor material used to manufacture conventional crystalline silicon modules. \nIn terms of performance, in many climates our solar modules provide certain energy production advantages relative to competing crystalline silicon modules. For example, our CdTe solar technology provides:\n•\na superior temperature coefficient, which results in stronger system performance in typical high insolation climates as the majority of a system’s generation, on average, occurs when module temperatures are well above 25°C (standard test conditions);\n•\na superior spectral response in humid environments where atmospheric moisture alters the solar spectrum relative to standard test conditions;\n•\na better partial shading response than competing crystalline silicon technologies, which may experience significantly lower energy generation than CdTe solar technologies when partial shading occurs; and\n•\nan immunity to cell cracking and its resulting power output loss, a common failure often observed in crystalline silicon modules caused by poor manufacturing, handling, weather, or other conditions.\nIn addition to these technological advantages, we also warrant that our solar modules will produce at least 98% of their labeled power output rating during the first year, with the warranty coverage reducing by a degradation factor that is generally between 0.3% and 0.5%, depending on the module series, every year thereafter throughout the limited power output warranty period of up to \n30\n years. As a result of these and other factors, our solar modules can produce more annual energy in real-world operating conditions than conventional crystalline silicon modules with the same nameplate capacity.\n3\nTable of Co\nn\ntents\nManufacturing Process and Distributed Manufacturing Presence\nOur modules combine our leading-edge CdTe technology with the manufacturing excellence and quality control that comes from being the world’s most experienced producer of thin film PV solar modules. With more than 75 GW of modules sold worldwide, we have a demonstrated history of manufacturing success and innovation. Our global manufacturing footprint includes facilities in the United States, Malaysia, Vietnam, and India. During 2023, we commenced production of our Series 7\nTM\n (“Series 7”) modules at our third manufacturing facility in Ohio and our first manufacturing facility in India, which combine our thin film CdTe technology with a larger form factor and an innovative steel back rail mounting structure that reduces module installation time. During 2024, we commenced production of Series 7 modules at our first manufacturing facility in Alabama, bringing our total installed nameplate production capacity across all our facilities to approximately 21 GW. Additionally, we are in the process of expanding our manufacturing capacity by approximately 4 GW, including the construction of our fifth U.S. manufacturing facility, which is expected to commence operations in the second half of 2025.\nOur modules are manufactured in a high-throughput, automated environment that integrates all manufacturing steps into a continuous flow process. This process eliminates the multiple supply chain operators and resource-intensive batch processing steps that are used to produce crystalline silicon modules, which typically occur over several days and across multiple factories. At the outset of our module production, a sheet of glass enters the production line and in a matter of hours is transformed into a completed module ready for shipment.\nThis proprietary production process includes the following three stages: (i) the deposition stage, (ii) the cell definition and treatment stage, and (iii) the assembly and test stage. In the deposition stage, panels of transparent oxide-coated glass are robotically loaded onto the production line where they are cleaned, laser-mark identified with a serial number, heated, and coated with thin layers of semiconductor material, including CdTe, using our vapor transport deposition technology, after which the semiconductor-coated plates are cooled rapidly to increase glass strength. In the cell definition and treatment stage, we use high-speed lasers to transform the large continuous semiconductor coating on the glass plate into a series of interconnected cells that deliver the desired current and voltage output. In this stage, we also treat the semiconductor film using certain chemistries and processes to improve the device’s performance and apply a back contact. In the assembly and test stage, we apply busbars, inter-layer material, and a rear glass cover sheet that is laminated to encapsulate the device. We then apply anti-reflective coating material to the substrate glass to further improve the module’s performance by increasing its ability to absorb sunlight. Finally, junction boxes, termination wires, and a frame are applied to complete the module assembly.\nWe maintain a robust quality and reliability assurance program that monitors critical process parameters and measures product performance to ensure that industry and more stringent internal standards are met. We also conduct acceptance testing for electrical leakage, visual quality, and power measurement on a solar simulator prior to preparing a module for shipment. Our quality and reliability tests complement production surveillance with an ongoing monitoring program, subjecting production modules to accelerated life stress testing to help ensure ongoing conformance to requirements of the International Electrotechnical Commission and Underwriters Laboratories Inc. These programs and tests help assure delivery of power and performance in the field with a high level of product quality and reliability.\nResearch and Development\nOur R&D model differentiates us from much of our competition due to its vertical integration, from advanced research to product development, manufacturing, and applications. We continue to devote substantial resources to our R&D efforts, which generally focus on continually improving the wattage and energy yield of our solar modules. We also have R&D programs to improve module durability and manufacturing efficiencies, including throughput, volume ramp, and material cost reduction. We continue to invest significant financial resources in such initiatives, including the construction of a dedicated perovskite development line and a dedicated R&D innovation center in Ohio, which was formally commissioned during 2024. This R&D innovation center, which features a high-\n4\nTable of Co\nn\ntents\nvolume manufacturing scale production pilot line, is expected to enable the production of full-sized prototypes of thin film and tandem PV modules, supporting the implementation of our technology roadmap. Based on publicly available information, we are one of the leaders in R&D investment among PV solar module manufacturers.\nIn the course of our R&D activities, we explore various technologies in our efforts to sustain competitive differentiation in our modules. We primarily conduct our R&D activities and qualify process and product improvements for full production at our Perrysburg, Ohio facilities and systematically deploy them to our other facilities. We believe our systematic approach to technology change management enables continuous improvements and ensures uniform adoption across our production lines. In addition, our production lines are replicas or near replicas of each other and, as a result, a process or production improvement on one line can be rapidly and reliably replicated across other production lines.\nWe regularly produce research cells in our laboratories, some of which are tested for performance and certified by independent labs, such as the National Renewable Energy Laboratory. Cell efficiency measures the proportion of light converted to electricity in a single solar cell under standard test conditions. Our research cells are produced using laboratory equipment and methods and are not intended to be representative of our manufacturing capability. We currently hold two world records for CdTe PV cell efficiency, achieving an independently certified research cell efficiency of 23.1% and a module aperture area efficiency of 19.9%. We continue to evaluate opportunities to develop and leverage other solar cell technologies in multi-junction applications consisting of CdTe, or other materials, including thin film technologies. For example, during 2023, we acquired Evolar AB (“Evolar”), a European developer of perovskite technology. This acquisition is expected to accelerate the development of high efficiency multi-junction devices by integrating Evolar’s expertise with First Solar’s existing R&D capabilities. We believe such multi-junction applications have the potential to significantly increase the efficiency of PV modules beyond the limits of traditional single-junction devices.\nResponsible Solar\nWe are committed to enhancing the social and economic benefits of our products and reducing our carbon footprint. Our thin film modules are manufactured through an integrated process that uses less energy, water, and semiconductor material than conventional crystalline silicon modules. Our thin film module technology has the fastest energy payback time, smallest carbon footprint, and lowest water use of any commercially available PV solar technology, measured on a lifecycle basis that accounts for the energy, raw materials, water usage, and transportation across the supply chain, manufacturing process, and end-of-life module recycling.\nOur Series 7 module is our most eco-efficient product to date, with a carbon and water footprint that is approximately four times lower than conventional crystalline silicon modules manufactured in China and an energy payback time that is approximately five times faster. In just two months under high irradiation conditions, our Series 7 modules produce more energy than was required to create them. This corresponds to a 180-fold energy return on investment over a 30-year project lifetime, providing an abundant net energy gain to the electricity grid. \nFirst Solar modules are designed for high-value recycling to maximize material recovery and contribute to a circular economy. Our recycling process recovers more than 90% of module materials for reuse, providing high quality secondary resources for new solar modules and other glass, rubber, and aluminum products. First Solar has a unique and long-standing leadership position in PV recycling, having established the industry’s first global recycling program in 2005 and recycled approximately 400,000 metric tons of PV modules to date.\nFinancial Stability\nIn addition to our responsible solar commitments, we are also committed to creating long-term shareholder value through a decision-making framework that delivers a balance of growth, profitability, and liquidity. This framework has enabled us to fund our module manufacturing and capacity expansion initiatives primarily using cash flows generated by our operations and by maintaining appropriate debt levels based on cash flow expectations. Our \n5\nTable of Co\nn\ntents\nfinancial stability provides strategic optionality as we evaluate how to invest in our business and generate returns for our shareholders. Our financial stability also enables us to offer meaningful warranties, which provide us with a competitive advantage relative to many of our peers in the solar industry. Furthermore, we expect our financial discipline and ability to manage operating costs to enhance our profitability as we continue to scale our business.\nMarket Overview\nSolar energy is one of the fastest growing forms of renewable energy with numerous benefits, including economic and speed of deployment, that make it an attractive complement to or substitute for traditional forms of energy generation. In recent years, the cost of producing electricity from PV solar power systems has decreased to levels that are competitive with or below the wholesale price of electricity in many markets. Other technological developments in the renewable energy industry, such as the advancement of energy storage capabilities, have further enhanced the prospects of solar energy as an alternative to traditional forms of energy generation. As a result of these and other factors, worldwide solar markets continue to develop and expand.\nGovernment incentive programs, such as the Inflation Reduction Act of 2022 (the “IRA”), have contributed to this momentum by providing solar module manufacturers, project developers, and project owners with various incentives to accelerate the deployment of solar power generation. Among other things, the IRA (i) reinstates the 30% investment tax credit for qualifying solar projects that meet certain wage and apprenticeship requirements, (ii) extends the production tax credit (“PTC”) to include energy generated from solar projects, (iii) provides incremental investment and production tax credits for solar projects that meet certain domestic content and location requirements, and (iv) offers tax credits for solar modules and solar module components manufactured in the United States and sold to third parties. In light of such regulatory developments, we have recently commenced or completed certain manufacturing expansion activities in the United States and India and continue to evaluate opportunities for future expansion worldwide, as described below under “Global Markets.” For more information about certain risks associated with the IRA, see Item 1A. “Risk Factors – We have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.”\nInternationally, given the combination of (i) a European Union market captured by Chinese solar modules, which pricing is at levels near or below manufacturing costs, (ii) an India market effectively closed to Southeast Asian finished goods, (iii) the uncertain U.S. policy environment following the 2024 U.S. elections, and (iv) a supply and demand imbalance for Southeast Asian product, we have decided to reduce production output of our Series 6 modules at our manufacturing facilities in Malaysia and Vietnam by a combined total of 1 GW in 2025. Although module average selling prices in many global markets continue to decline, recent module pricing in the United States, our primary market, has been relatively stable due, in part, to the demand for domestically manufactured modules as a result of the IRA. In light of such market realities, we continue to advocate for industrial and trade policies that provide a level playing field for domestic manufacturers of solar cells and modules. We also continue to focus on our strategies and points of differentiation, which include our advanced module technology, our manufacturing process and distributed manufacturing presence, our R&D capabilities, our commitment to responsible solar, and our financial stability.\nGlobal Markets\nEnergy markets are, by their nature, localized, with different factors impacting electricity generation and demand in a particular region or for a particular application. Further, overall electric load growth, especially as a result of artificial intelligence (“AI”)-driven data center demand, continues to increase. Accordingly, our business is evolving worldwide and is shaped by the varying ways in which our modules can provide compelling and economically viable solutions to energy needs in various markets. We are currently focusing on markets, including those listed below, in which our CdTe solar modules provide certain advantages over conventional crystalline silicon solar modules, including (i) high insolation climates in which our modules provide a superior temperature coefficient, (ii) \n6\nTable of Co\nn\ntents\nhumid environments in which our modules provide a superior spectral response, (iii) markets that value responsible sourcing through transparent supply chain reporting and ethical business practices, and (iv) markets that promote renewable energy investments through supportive policy environments. To the extent our production capacity expands in future periods, and policy environments are supportive, we have the potential to extend our focus to additional geographic markets.\nUnited States.\n Multiple markets within the United States, which accounted for 93% of our 2024 net sales, exemplify favorable characteristics for a solar market, including (i) sizeable and growing electricity needs, driven largely by data center demand; (ii) strong demand for renewable energy generation; (iii) abundant solar resources; and (iv) demand for domestically manufactured modules. In those areas and applications in which these factors are more pronounced, our PV solar modules compete favorably on an economic basis with traditional forms of energy generation. The market penetration of PV solar is also impacted by certain federal and state incentive programs described below under “Incentive Programs.” The U.S. currently has an installed solar generation capacity of approximately 220 GW, and, in 2024 alone, the U.S. installed an estimated 32 GW of utility-scale solar capacity. Following the 2024 U.S. elections, the new U.S. Presidential administration has committed to an economic mandate focused on growth, reducing inflation, reshoring manufacturing and jobs, and championing innovation, including AI. The U.S. is expected to need approximately 128 GW of new power generation capacity by 2029 to meet high summer peak demand, the majority of which is expected to be driven by data center growth. As a result of such market opportunities, we are in the process of expanding our U.S. manufacturing capacity, including the construction of our fifth U.S. manufacturing facility, which is expected to commence operations in the second half of 2025.\nIndia.\n India continues to represent one of the largest and fastest growing markets for PV solar energy with an installed solar generation capacity of approximately 98 GW. In addition, the government has established aggressive renewable energy targets, which include increasing the country’s overall renewable energy capacity to 500 GW by 2030, becoming energy independent by 2047, and establishing a net-zero carbon emissions target by 2070. Based on these targets, it is projected that the installed solar energy generation capacity will be approximately 280 GW\n \nby 2030. The government has also announced a series of policy and regulatory measures to incentivize domestic manufacturing of PV solar modules, as described below under “Incentive Programs.” These targets, policies, and regulatory measures are expected to help create significant and sustained demand for PV solar energy. In addition to these factors, our CdTe solar technology is well suited for the India market given its hot and humid climate conditions. As a result of such market opportunities and renewable targets, we recently expanded production of Series 7 modules at our first manufacturing facility in India, bringing our total installed nameplate production capacity in the country to 3.2 GW.\nIncentive Programs\nAlthough we compete in markets that do not require solar-specific government incentive programs, our net sales and profits remain subject to variability based on the scope of tax and production incentives, renewable portfolio standards, tendering systems, and other support programs intended to stimulate economies, achieve decarbonization initiatives, and/or establish greater energy independence. Such programs continue to influence the demand for PV solar energy around the world.\nUnited States.\n In the United States, incentive programs exist at both the federal and state levels and may take the form of investment and production tax credits, sales and property tax exemptions and abatements, and/or renewable energy targets. However, the potential policies of the new U.S. presidential administration and Congress have raised some uncertainty as to such incentive programs. For more information about certain risks associated with such incentives, see Item 1A. “Risk Factors – We have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.” and “Risk Factors – Existing regulations and policies, changes thereto, and new regulations and policies may present technical, regulatory, and economic barriers to the purchase and use of PV solar products, which may \n7\nTable of Co\nn\ntents\nsignificantly reduce demand for our modules.” For more information about pending and ongoing developments related to the IRA, see Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Certain Trends and Uncertainties.” Government incentives include the following:\n•\nAdvanced Manufacturing Production Credit\n. In August 2022, the previous U.S. President signed the IRA into law, which was intended to accelerate the country’s ongoing energy transition. The provisions of the IRA are generally effective for tax years beginning after 2022. As discussed above, the IRA offers various tax credits, including the advanced manufacturing production credit, pursuant to Section 45X of the Internal Revenue Code (the “IRC”), for solar modules and certain solar module components manufactured in the United States and sold to third parties. Such credit may be refundable by the Internal Revenue Service (“IRS”) or transferable to a third party and is available from 2023 through 2032, subject to phase down beginning in 2030. For eligible components, the credit is equal to (i) $12 per square meter for a PV wafer, (ii) 4 cents multiplied by the capacity of a PV cell in watts, and (iii) 7 cents multiplied by the capacity of a PV module in watts. Such financial incentives are expected to increase both the demand for, and the domestic manufacturing of, solar modules and solar module components in the United States. For more information about certain risks associated with the benefits available to us under the IRA, see Item 1A. “Risk Factors – We have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.” For more information about pending and ongoing developments related to the IRA, see Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Certain Trends and Uncertainties.”\n•\nInvestment and Production Tax Credits\n. At the federal level, investment and production tax credits for business and residential solar systems have gone through cycles of enactment and expiration over several decades. The current federal energy investment tax credit (“ITC”) for solar energy property requires projects to meet certain wage and apprenticeship requirements and to have commenced construction by a certain date, which may be achieved by certain qualifying procurement activities. In 2022, the U.S. Congress reinstated the 30% ITC as part of the IRA discussed above. Similarly, the IRA extended the renewable electricity PTC, which provides a tax credit for electricity generated by solar and other qualifying technologies for the first 10 years of a system’s operations. Both the ITC and PTC are available until a four-year phase down is triggered, which occurs at the later of 2032 or the year in which power-sector emissions are 25% of 2022 levels. The ITC and PTC have been important economic drivers of solar installations and qualifying procurement activities in the United States. The positive impact of the ITC and PTC depends, in large part, on the availability of tax equity for project financing or the ability to transfer such credits to other taxpayers.\n•\nR&D Grants\n. The U.S. Department of Energy, though its Solar Energy Technologies Office (“SETO”), funds various solar energy R&D projects, including PV, system integration, and manufacturing initiatives, among others. In September 2023, SETO announced the Advancing U.S. Thin-Film Solar Photovoltaics Funding Opportunity, which provides incentives for qualifying solar R&D projects related to CdTe development and the manufacturing of perovskite tandem PV products. In May 2024, SETO announced the award recipients for this funding opportunity, which included First Solar. These grants are intended to accelerate and expand domestic solar R&D to strengthen U.S. solar manufacturing and contribute to renewable energy targets.\nIndia.\n In India, incentives at both the federal and state levels have contributed to growth in domestic PV solar module manufacturing and solar energy installations. Such incentives include the following:\n•\nProduction Linked Incentive.\n In March 2023, the government of India allocated financial incentives under the Production Linked Incentive (“PLI”) scheme to certain PV module manufacturers, including First Solar. The PLI scheme is expected to provide aggregate funding of INR 185 billion ($2.2 billion), which is \n8\nTable of Co\nn\ntents\nintended to promote the manufacturing of high efficiency solar modules in India and to reduce India’s dependency on foreign imports of solar modules. For more information about pending and ongoing developments related to the PLI, see Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Certain Trends and Uncertainties.”\nVarious proposed and contemplated environmental and tax policies may create regulatory uncertainty in the renewable energy sector, including the solar energy sector, and may lead to a reduction or removal of various clean energy programs and initiatives designed to curtail climate change. For more information about the risks associated with these potential government actions, see Item 1A. “Risk Factors – The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.”\nModules Business\nOur primary segment is our modules business, which involves the design, manufacture, and sale of CdTe solar modules, which convert sunlight into electricity. Since the inception of First Solar, our modules have used our advanced thin film semiconductor technology. Our Series 6 Plus module is a glass laminate approximately 4ft x 6ft in size that encapsulates thin film PV semiconductor materials. Our Series 7 module has a larger form factor of approximately 4ft x 7ft in size. At the end of 2024, our Series 6 Plus and Series 7 modules had an average power output of 459 watts and 531 watts, respectively.\nRaw Materials\nOur module manufacturing process uses approximately 30 types of raw materials and components to construct a solar module, including CdTe, front glass coated with transparent conductive oxide, other semiconductor materials, organics such as adhesives, heat-strengthened back glass, frames, packaging components such as interlayer, cord plate/cord plate cap, lead wire, and solar connectors. Before we use these materials and components in our manufacturing process, a supplier must undergo rigorous qualification procedures, and we continually evaluate new suppliers as part of our cost reduction roadmap and expansion activities. When possible, we attempt to use suppliers that can provide a raw material supply source that is near our manufacturing locations, reducing the cost and lead times for such materials. For more information about the risks associated with our supply chain, see Item 1A. “Risk Factors – Several of our key raw materials and components are either single-sourced or sourced from a limited number of suppliers, and their failure to perform could cause manufacturing delays and impair our ability to deliver solar modules to customers in the required quality and quantities and at a price that is profitable to us.”\nCustomers\nOur customers include system developers, independent power producers, utilities, commercial and industrial companies, and other system owners and operators. During 2024, our third-party module sales represented approximately 100% of our total net sales, and we sold the majority of our solar modules to customers with projects in the United States. During 2024, no customer accounted for more than 10% of our modules business net sales. For more information about risks related to our customers, see Item 1A. “Risk Factors – The loss of any of our large customers, or the inability of our customers and counterparties to perform under their contracts with us, could significantly reduce our net sales and negatively impact our results of operations.”\nWe continue to focus on certain key geographic markets, particularly in areas with abundant solar resources and sizable electricity demand, and additional customer relationships to diversify our customer base. The wholesale commercial and industrial market continues to represent a promising opportunity for the widespread adoption of PV solar technology as corporations undertake certain sustainability commitments. The demand for corporate \n9\nTable of Co\nn\ntents\nrenewables continues to accelerate, with corporations worldwide committing to the RE100 campaign. We believe we also have a competitive advantage in the commercial and industrial market due to many customers’ sensitivity to the sustainability, experience, and financial stability of their suppliers and geographically diverse operating locations. With our financial strength, global footprint, and commitment to responsible solar, we are well positioned to meet these needs.\nAdditionally, the increase of utility-owned generation and overall electric load growth, especially as a result of AI-driven data center demand, have expanded the number of potential buyers of our modules as such utility and data center customers benefit from a potentially low cost of capital available through rate-based utility investments. Given their long-term ownership profiles, these customers typically seek to partner with stable companies that can provide low-cost alternatives to, or replacements for, aging fossil fuel-based generation resources, including reliable PV solar technology, thereby mitigating their long-term ownership risks.\nCompetition\nThe solar energy and renewable energy sectors are highly competitive and continually evolving as participants in these sectors strive to distinguish themselves within their markets and compete within the larger electric power industry. Among PV solar module manufacturers, the principal method of competition is sales price per watt, which may be influenced by several module value attributes, including wattage (through a larger form factor or an improved conversion efficiency), energy yield, degradation, sustainability, and reliability. Sales price per watt may also be influenced by warranty terms, customer payment terms, and/or module content attributes. We face intense competition for sales of solar modules, which may result in reduced selling prices and loss of market share. Our primary source of competition is crystalline silicon module manufacturers, the majority of which are linked to China. Allegations of forced labor in the Chinese solar supply chain have emerged in recent years, which means we also compete on our approach to responsible sourcing and supply chain due diligence. Our differentiated technology, integrated manufacturing process, and tightly controlled supply chain help limit the risks associated with outsourcing and the multiple supply tiers of conventional crystalline silicon module manufacturing.\nWe also expect to compete with future entrants into the PV solar industry and existing market participants that offer new or differentiated technological solutions. For additional information, see Item 1A. “Risk Factors – Our failure to further refine our technology and develop and introduce improved PV products, including as a result of delays in implementing planned advancements, could render our solar modules uncompetitive and reduce our net sales, profitability, and/or market share.”\nCertain of our existing or future competitors, including many linked to China, may have direct or indirect access to sovereign capital or other forms of state support, which could enable such competitors to compromise intellectual property and operate at minimal or negative operating margins for sustained periods of time. Our results of operations could be adversely affected if competitors reduce module pricing to levels below their costs, bid aggressively low prices for module sale agreements, or are able to operate at minimal or negative operating margins for sustained periods of time. We believe the solar industry may experience periods of structural imbalance between supply and demand, which could lead to periods of low pricing and demand volatility. For additional information, see Item 1A. “Risk Factors – Competition in solar markets globally and across the solar value chain is intense and could remain that way for an extended period of time. The solar industry may experience periods of structural imbalance between global PV module supply and demand that result in periods of pricing volatility, which could have a material adverse effect on our business, financial condition, and results of operations.”\nLimited Solar Module Warranties\nWe provide a limited PV solar module warranty covering defects in materials and workmanship under normal use and service conditions for up to \n12.5\n years. We also typically warrant that modules installed in accordance with agreed-upon specifications will produce at least \n98\n% of their labeled power output rating during the first year, with the warranty coverage reducing by a degradation factor every year thereafter throughout the limited power output \n10\nTable of Co\nn\ntents\nwarranty period of up to \n30\n years. Among other things, our solar module warranty also covers the resulting power output loss from cell cracking. For additional information on our solar module warranty programs, refer to Item 1A. “Risk Factors – Problems with product quality or performance may cause us to incur significant and/or unexpected contractual damages and/or warranty and related expenses, damage our market reputation, and prevent us from maintaining or increasing our market share.”\nSolar Module Collection and Recycling\nWe are committed to mitigating the environmental impact of our products over their entire life cycle. As part of such efforts, we offer recycling services to help module owners meet their end-of-life (“EOL”) obligations. In 2005, we voluntarily established the industry’s first global and comprehensive module collection and recycling program, and in 2013 we implemented a “pay-as-you-go” recycling service. We continue to invest in module recycling technology improvements to increase recycling efficiency and reduce recycling prices for our customers. Our module recycling process is designed to maximize the recovery of materials, including the glass and encapsulated semiconductor material, for use in new modules or other products and enhances the sustainability profile of our modules. Approximately 90% of each collected First Solar module can be recycled into materials for reuse. We currently operate recycling facilities at our manufacturing sites in the United States, India, Malaysia, and Vietnam and at our former manufacturing facility in Germany.\nFor certain legacy customer sales contracts that were covered under the 2005 module collection and recycling program, which has since been discontinued, we agreed to pay the costs for the collection and recycling of qualifying solar modules, and the end users agreed to notify us, disassemble their solar power systems, package the solar modules for shipment, and revert ownership rights over the modules back to us at the end of the modules’ service lives.\nFor modules covered under our program that were previously sold into and installed in the EU, we continue to maintain a commitment to cover the estimated collection and recycling costs consistent with our historical program. The EU’s Waste Electrical and Electronic Equipment (“WEEE”) Directive places the obligation of recycling (including collection, treatment, and environmentally sound disposal) of electrical and electronic equipment products upon producers and is applicable to all PV solar modules in EU member states. As a result of the transposition of the WEEE Directive by the EU member states, we have adjusted our recycling offerings, as required, to ensure compliance with specific EU member state WEEE regulations.\nIntellectual Property\nOur success depends, in part, on our ability to maintain and protect our proprietary technology and to conduct our business without infringing on the proprietary rights of others. We rely primarily on a combination of patents, trademarks, and trade secrets, as well as associate and third-party confidentiality agreements, to safeguard our intellectual property. We regularly file patent applications to protect inventions arising from our R&D activities in the United States and other countries. Our patent applications and any future patent applications may not result in a patent being issued with the scope of the claims we seek, or at all, and any patents we may receive may be challenged, invalidated, or declared unenforceable. In addition, we have registered and/or have applied to register trademarks and service marks in the United States and a number of foreign countries for “First Solar.”\nWith respect to proprietary know-how that is not patentable and processes for which patents are difficult to enforce, we rely on, among other things, trade secret protection and confidentiality agreements to safeguard our interests. We believe that many elements of our PV solar module manufacturing processes, including our unique materials sourcing, involve proprietary know-how, technology, or data that are not covered by patents or patent applications, including technical processes, equipment designs, algorithms, and procedures. We have taken security measures to protect these elements. Our R&D personnel have entered into confidentiality and proprietary information agreements with us. These agreements address intellectual property protection issues and require our associates, to \n11\nTable of Co\nn\ntents\nthe extent permitted by law, to assign to us all of the inventions, designs, and technologies they develop during the course of their employment with us that are directed towards our actual or anticipated business.\nRegulatory, Environmental, Health, and Safety Matters\nWe are subject to various federal, state, local, and international laws and regulations, and are often subject to oversight and regulation in accordance with national and local ordinances relating to building codes, safety, and other matters. The impact of these laws and requirements may increase our overall costs and may delay, prevent, or increase the cost of manufacturing PV modules. As we operate in the U.S. and internationally, we are also subject to the application of U.S. trade laws and trade laws of other countries. Such trade laws and policies, or any other U.S. or global trade remedies or other trade barriers that apply to us given our global operations, may directly or indirectly affect our business, financial condition, and results of operations. See Item 1A. “Risk Factors – Existing regulations and policies, changes thereto, and new regulations and policies may present technical, regulatory, and economic barriers to the purchase and use of PV solar products, which may significantly reduce demand for our modules.”\nWe are also subject to the application of various anti-bribery laws, some of which prohibit improper payments to government and non-government persons and entities, and others (e.g., the U.S. Foreign Corrupt Practices Act (the “FCPA”) and the U.K. Bribery Act) that extend their application to activities outside their country of origin. We may compete for contracts in and/or source materials from countries that require substantial government contact and where norms can differ from U.S. standards, and not all competitors are subject to compliance with the same anti-bribery laws. See Item 1A. Risk Factors – “We could be adversely affected by any violations of the FCPA, the U.K. Bribery Act, and other foreign anti-bribery laws.”\nWe are also subject to various federal, state, local, and international laws and regulations relating to the protection of the environment, including those governing the discharge of pollutants into the air and water; the use, management, and disposal of hazardous materials and wastes; occupational health and safety; and the cleanup of contaminated sites. Our operations include the use, handling, storage, transportation, generation, and disposal of hazardous materials and wastes. Therefore, we could incur substantial costs, including cleanup costs, fines, and civil or criminal sanctions and costs arising from third-party property damage or personal injury claims as a result of violations of, or liabilities under, environmental and occupational health and safety laws and regulations or non-compliance with environmental permits required for our operations. We believe we are currently in substantial compliance with applicable environmental and occupational health and safety requirements and do not expect to incur material expenditures for environmental and occupational health and safety controls in the foreseeable future. However, future developments such as the implementation of new, more stringent laws and regulations, more aggressive enforcement policies, or the discovery of unknown environmental conditions may require expenditures that could have a material adverse effect on our business, financial condition, or results of operations. See Item 1A. “Risk Factors – Environmental obligations and liabilities could have a substantial negative impact on our business, financial condition, and results of operations.”\nFrom time to time, we may also be subject to government policies or laws intended to protect human rights. For example, in late 2021 the previous U.S. President signed the Uyghur Forced Labor Prevention Act, which bans the import of goods from China’s Xinjiang region into the United States due to concerns about forced labor practices in the region, which provides more than a third of the world’s polysilicon supply. While we do not use polysilicon in our solar modules, which mitigates the potential supply chain disruptions and human rights risks associated with such import ban, the implementation of similar restrictions or trade embargoes on the purchase of certain materials or equipment necessary to sustain our manufacturing operations may require expenditures and process changes to ensure our supply chain remains free of such materials, which could have a material adverse effect on our business, financial condition, or results of operations. We are committed to protecting human rights, enforcing fair labor practices, and addressing the potential risks of forced labor across our own operations and the operations of our suppliers.\n12\nTable of Co\nn\ntents\nHuman Capital\nAs of December 31, 2024, we had approximately 8,100 associates (our term for full and part-time employees), the majority of which work in the United States, Malaysia, Vietnam, and India.\nOur success depends, to a significant extent, on our ability to attract, train, and retain management, operations, sales, and technical talent, including associates in foreign jurisdictions. We strive to attract and retain qualified individuals globally to further our mission of providing cost-advantaged solar technology through rigorous safety practices, innovation, customer engagement, industry leadership, and operational excellence. We prohibit discrimination based on race, color, religion, sex, age, national origin, veteran status, disability, sexual orientation, or gender identity. As part of our global talent management process, we engage in succession planning by prioritizing the development and retention of associates in critical roles.\nWe follow a pay-for-performance model in which associates are compensated for achieving goals and associated metrics and demonstrating First Solar values. We review associate compensation on a regular basis to ensure internal and external equity, including, among other things, minimum wage and living wage assessments across our global operations. We offer competitive compensation and benefits to our associates, including, for example, health care and other insurance benefits, retirement programs, paid time off, paid parental leave, flexible work schedules, and education assistance, depending on eligibility.\nWe are committed to developing and providing career growth opportunities for our associates. We believe a strong values-based and inclusive culture is essential to the success of our company. We gather and respond to associate feedback in a variety of ways, including through anonymous, periodic associate engagement surveys, pulse surveys, town halls, and one-on-one interactions. Additionally, we have integrated career advancement, mentorship, and leadership programs to ensure the professional growth and development of our talent worldwide.\nOther than our associates in Vietnam and Sweden, none of our associates are currently represented by labor unions or covered by a collective bargaining agreement. Our associates in Vietnam are represented by the Vietnam General Confederation of Labor. Our associates in Sweden are represented by the Engineers of Sweden. As we continue to expand domestically and internationally, we may encounter regional laws that mandate union representation or associates who desire union representation or a collective bargaining agreement. We recognize that in the locations where we operate, employees have the right to freely associate or not associate with third-party labor organizations, along with the right to bargain or not to bargain collectively in accordance with local laws.\nAvailable Information\nWe maintain a website at www.firstsolar.com. We make available free of charge on our website our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, as soon as reasonably practicable after we electronically file such materials with, or furnish them to, the SEC. The information contained in or connected to our website is not incorporated by reference into this report. We use our website as one means of disclosing material non-public information and for complying with our disclosure obligations under the SEC’s Regulation FD. Such disclosures are typically included within the Investor Relations section of our website at investor.firstsolar.com. Accordingly, investors should monitor such portions of our website in addition to following our press releases, SEC filings, and public conference calls and webcasts. The SEC also maintains a website at www.sec.gov that contains reports and other information regarding issuers, such as First Solar, that file electronically with the SEC.\n13\nTable of Co\nn\ntents\nInformation about Our Executive Officers\nOur executive officers and their ages and positions as of February 25, 2025 were as follows:\nName\nAge\nPosition\nMark R. Widmar\n59\nChief Executive Officer\nAlexander R. Bradley\n43\nChief Financial Officer\nGeorges Antoun\n62\nChief Commercial Officer \nMichael Koralewski\n53\nChief Supply Chain Officer\nKuntal Kumar Verma\n52\nChief Manufacturing Officer\nPatrick Buehler\n47\nChief Product Officer\nMarkus Gloeckler\n51\nChief Technology Officer\nCaroline Stockdale\n61\nChief People and Communications Officer\nJason Dymbort\n47\nGeneral Counsel and Secretary\nMark R. Widmar was appointed Chief Executive Officer in July 2016. He joined First Solar in April 2011 as Chief Financial Officer and also served as First Solar’s Chief Accounting Officer from February 2012 through June 2015. From March 2015 to June 2016, Mr. Widmar served as the Chief Financial Officer and through June 2018, served as a director on the board of the general partner of 8point3 Energy Partners LP (“8point3”), the joint yieldco formed by First Solar and SunPower Corporation in 2015 to own and operate a portfolio of selected solar generation assets. Prior to joining First Solar, Mr. Widmar served as Chief Financial Officer of GrafTech International Ltd., a leading global manufacturer of advanced carbon and graphite materials, from May 2006 through March 2011. Prior to joining GrafTech, Mr. Widmar served as Corporate Controller of NCR Inc. from 2005 to 2006, and was a Business Unit Chief Financial Officer for NCR from November 2002 to his appointment as Controller. He also served as a Division Controller at Dell, Inc. from August 2000 to November 2002. Mr. Widmar also held various financial and managerial positions with Lucent Technologies Inc., Allied Signal, Inc., and Bristol Myers/Squibb, Inc. He began his career in 1987 as an accountant with Ernst & Young. He holds a Bachelor of Science in business accounting and a Master of Business Administration from Indiana University.\nAlexander R. Bradley was appointed Chief Financial Officer in October 2016. He joined First Solar in May 2008, and previously served as Vice President of both Treasury and Project Finance, leading or supporting the structuring, sale, and financing of over $10 billion and approximately 2.7 GW of the Company’s worldwide development assets, including several of the largest PV power plant projects in North America. From June 2016 to June 2018, Mr. Bradley also served as an officer and board member of the general partner of 8point3. Prior to joining First Solar, Mr. Bradley worked at HSBC in investment banking and leveraged finance, in London and New York, covering the energy and utilities sector. He received his Master of Arts from the University of Edinburgh, Scotland.\nGeorges Antoun was appointed Chief Commercial Officer in July 2016. He joined First Solar in July 2012 as Chief Operating Officer before being appointed as President, U.S. in July 2015. Mr. Antoun has over 30 years of operational and technical experience, including leadership positions at several global technology companies. Prior to joining First Solar, Mr. Antoun served as Venture Partner at Technology Crossover Ventures (“TCV”), a private equity and venture firm that he joined in July 2011. Before joining TCV, Mr. Antoun was the Head of Product Area IP & Broadband Networks for Ericsson, based in San Jose, California. Mr. Antoun joined Ericsson in 2007, when Ericsson acquired Redback Networks, a telecommunications equipment company, where Mr. Antoun served as the Senior Vice President of World Wide Sales & Operations. After the acquisition, Mr. Antoun was promoted to Chief Executive Officer of the Redback Networks subsidiary. Prior to Redback Networks, Mr. Antoun spent five years at Cisco Systems, where he served as Vice President of Worldwide Systems Engineering and Field Marketing, Vice President of Worldwide Optical Operations, and Vice President of Carrier Sales. Prior to Cisco Systems, he was the Director of Systems Engineering at Newbridge Networks, a data and voice networking company. Mr. Antoun started his career at Nynex (now Verizon Communications), where he was part of its Science and Technology Division. Mr. Antoun serves as a member of the board of directors of Marathon Digital Holdings. He is also the Chairman of the University of Louisiana’s College of Engineering Dean’s Advisory Council board. He earned a Bachelor of \n14\nTable of Co\nn\ntents\nScience degree in engineering from the University of Louisiana at Lafayette and a Master of Science in information systems engineering from NYU Poly.\nMichael Koralewski was appointed Chief Supply Chain Officer in November 2022 and is accountable for maintaining executive oversight of First Solar’s strategic global supply chain. He previously served as First Solar’s Chief Manufacturing Operations Officer and provides over 25 years of global operational experience to the executive leadership team. Mr. Koralewski joined First Solar in 2006, serving in several senior roles in operations and quality management, including Senior Vice President, Global Manufacturing since 2015; Vice President, Global Site Operations and Plant Manager since 2011; and Vice President, Global Quality since 2009. In all of these roles Mr. Koralewski has been significantly involved since the beginning of First Solar’s manufacturing scaling and expansion from site selection through sustaining operations and supply chain development. Prior to joining First Solar, Mr. Koralewski worked at Dana Incorporated where he held several positions with global responsibility in operations and quality management. He earned a Bachelor of Science in chemical engineering from Case Western Reserve University and a Master of Business Administration from Bowling Green State University.\nKuntal Kumar Verma was appointed Chief Manufacturing Officer in November 2022 and previously served as First Solar’s Chief Manufacturing Engineering Officer. He is responsible for First Solar’s global manufacturing operations and engineering, including its performance and improvement roadmap, global technology scaling, new plant start-ups, and strategic initiatives. Mr. Verma joined First Solar in 2002, serving in progressively more senior roles in engineering and manufacturing, including Vice President, Global Manufacturing Engineering since 2012. Prior to joining First Solar, Mr. Verma held several engineering and operations positions at Reliance Industries Limited, India. He is a Master Black Belt in Six Sigma/Lean Manufacturing with an expert certification in Taguchi Methods (Robust Engineering) and a Certification in Production and Inventory Management from American Production and Inventory Control Society. He earned a Bachelor of Science in mechanical engineering from the National Institute of Technology in India, a Master of Science in industrial engineering from the University of Toledo, and a Master of Business Administration from Bowling Green State University.\nPatrick Buehler was appointed Chief Product Officer in December 2022, having previously served as Chief Quality and Reliability Officer. Mr. Buehler has over 20 years of operational and technical experience. In his role, Mr. Buehler is responsible for all aspects of product lifecycle management, including understanding market demands, technology trends, and competition to facilitate implementation of new or enhanced products. Mr. Buehler maintains global leadership responsibility for quality and reliability, environmental, health, safety, and security, recycling technology process development and operations, customer service, program management, and strategic initiatives. Mr. Buehler joined First Solar in 2006, serving in progressively more senior technical and operations roles, including Vice President, Quality and Reliability since 2019. Prior to joining First Solar, Mr. Buehler held several roles in manufacturing, engineering, maintenance, and product development at DuPont de Nemours, Inc. and Cummins, Inc. He earned a Bachelor of Science in mechanical engineering from the University of Cincinnati and a Master of Science in mechanical engineering from Purdue University.\nMarkus Gloeckler was appointed Chief Technology Officer in November 2020 after being appointed Co-Chief Technology Officer in July 2020. He is focused on driving First Solar’s thin film PV module technology. Mr. Gloeckler has extensive experience guiding strategic research and development activities and served First Solar as Vice President and Chief Scientist before being promoted to Senior Vice President, Module Research and Development. He was instrumental in enabling First Solar’s achievement of various world records relating to conversion efficiency for CdTe solar cells. In his role as Vice President of Research, he led the thin film technology transfer from General Electric to First Solar following the intellectual property acquisition in 2013. He joined First Solar in 2005 in an engineering function supporting First Solar’s technology development after the initial launch of the Series 2 module. Mr. Gloeckler holds an undergraduate degree in microsystems engineering from the Regensburg University of Applied Sciences in Germany, and a Doctor of Philosophy in physics from Colorado State University.\n15\nTable of Co\nn\ntents\nCaroline Stockdale joined First Solar in October 2019 and serves as Chief People and Communications Officer. Prior to joining First Solar, she served as the Chief Executive Officer for First Perform, a provider of human resources services for a variety of customers, from Fortune 100 companies to start-ups. Previously, she served as Chief People Officer for Medtronic from 2010 to 2013 and EVP of Global Human Resources and Business Operations for Warner Music Group from 2005 to 2009. Before joining Warner Music Group, she served as the senior human resources leader in global divisions of American Express from 2002 to 2005 and General Electric from 1997 to 2002. Ms. Stockdale is a member of the Forbes Human Resources Council. Ms. Stockdale holds a Bachelor of Arts in political theories and institutions, and philosophy, from the University of Sheffield, England.\nJason Dymbort joined First Solar in March 2008 and was appointed General Counsel and Secretary in July 2020. He oversees First Solar’s legal department worldwide, including its transactional, trade, intellectual property, compliance, and corporate governance functions. In addition to his duties as General Counsel and Secretary, Mr. Dymbort directs the Company’s advocacy strategies, defining its responses to challenges and opportunities in areas such as trade and industrial policy. With nearly 17 years at First Solar, Mr. Dymbort’s experience covers every aspect of the solar value chain, from developing and constructing solar projects to marketing and selling utility-scale solar assets to manufacturing and supply chains. Between 2015 and 2018, Mr. Dymbort served as General Counsel and Secretary for the general partner of 8point3 Energy Partners, then a publicly-traded yieldco and affiliate of First Solar. Before joining First Solar, Mr. Dymbort was a corporate attorney at Cravath, Swaine & Moore LLP. He holds a Juris Doctor degree from the University of Pennsylvania Law School, where he was a member of the Penn Law Review, and a bachelor’s degree from Brandeis University.\n16\nTable of Co\nn\ntents",
  "item7": "Item 7. \nManagement’s Discussion and Analysis of Financial Condition and\n \nResults of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and the related notes thereto included in this Annual Report on Form 10-K. In addition to historical financial information, the following discussion and analysis contains forward-looking statements that involve risks, uncertainties, and assumptions as described under the “Note Regarding Forward-Looking Statements” that appears earlier in this Annual Report on Form 10-K. Our actual results could differ materially from those anticipated by these forward-looking statements as a result of many factors, including those discussed under Item 1A. “Risk Factors,” and elsewhere in this Annual Report on Form    10-K. This discussion and analysis does not address certain items in respect of the year ended December 31, 2022. See Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the year ended December 31, 2023 for comparative discussions of our results of operations and liquidity and capital resources for the years ended December 31, 2023 and 2022.\nExecutive Overview\nWe are America’s leading PV solar technology and manufacturing company. The only U.S.-headquartered company among the world’s largest solar manufacturers, First Solar is focused on competitively and reliably enabling power generation needs with our advanced, thin film PV technology. Developed at R&D labs in California and Ohio, the Company’s technology represents the next generation of solar power generation, providing a competitive, high-performance, and responsibly produced alternative to conventional crystalline silicon PV solar modules. Our PV solar modules are produced using a fully integrated, continuous process that does not rely on Chinese crystalline silicon supply chains.\nWe are the world’s largest thin film PV solar module manufacturer and the largest PV solar module manufacturer in the Western Hemisphere. We recently commenced operations at our fourth manufacturing facility in the United States and are in the process of expanding our manufacturing capacity, including the construction of our fifth manufacturing facility in the United States, which is expected to commence operations in the second half of 2025. With a global footprint that spans the United States, India, Malaysia, and Vietnam, we expect to have an annual manufacturing capacity of over 25 GW by 2026.\nCertain of our financial results and other key operational developments for the year ended December 31, 2024 include the following:\n•\nNet sales for 2024 increased by 27% to $4.2 billion compared to $3.3 billion in 2023. The increase in net sales was primarily driven by an increase in the volume of modules sold to third parties and an increase in termination payments associated with certain customer contract terminations in the U.S., India, and Europe, partially offset by a reduction in revenue related to manufacturing issues affecting certain Series 7 modules manufactured in 2023 and 2024. We currently believe the primary causes of the issues have been identified and we have taken actions to address such issues.\n47\nTable of Contents\n•\nGross profit as a percentage of net sales increased 5.0 percentage points to 44.2% in 2024 from 39.2% in 2023. The increase was primarily driven by a higher sales mix of modules qualifying for the advanced manufacturing production credit under Section 45X of the IRC, termination payments associated with certain customer contract terminations in the U.S., India, and Europe, and an increase in the volume of modules sold to third parties, partially offset by higher module storage costs and a reduction in revenue related to manufacturing issues affecting certain Series 7 modules manufactured in 2023 and 2024.\n•\nDuring 2024, we commenced production of Series 7 modules at our first manufacturing facility in Alabama, bringing our total installed nameplate production capacity across all our facilities to approximately 21 GW. During 2024, we produced 15.5 GW and sold 14.1 GW of solar modules. During 2025, we expect to produce between 18 GW\n \nand 19 GW and sell between 18 GW and 20 GW.\n•\nIn May 2024, we achieved a new world record CdTe research cell conversion efficiency of 23.1%, which was certified by the U.S. Department of Energy’s National Renewable Energy Laboratory.\n•\nIn July 2024, our dedicated R&D innovation center in Ohio was formally commissioned. This R&D facility features a high-volume manufacturing scale production pilot line, which is expected to enable the production of full-sized prototypes of thin film and tandem PV modules, supporting the implementation of our technology roadmap.\n•\nIn December 2024, we entered into two agreements with Visa Inc. (“Visa”) for the sale of $857.2 million of Section 45X tax credits we generated during 2024 for aggregate cash proceeds of $818.6 million and received initial cash proceeds of $616.0 million. We expect to receive the remaining cash proceeds during the first quarter of 2025.\nMarket Overview\nSolar energy is one of the fastest growing forms of renewable energy with numerous benefits, including economic and speed of deployment, that make it an attractive complement to or substitute for traditional forms of energy generation. In recent years, the cost of producing electricity from PV solar power systems has decreased to levels that are competitive with or below the wholesale price of electricity in many markets. Other technological developments in the renewable energy industry, such as the advancement of energy storage capabilities, have further enhanced the prospects of solar energy as an alternative to traditional forms of energy generation. As a result of these and other factors, worldwide solar markets continue to develop and expand. Government incentive programs, such as the IRA discussed previously, have contributed to this momentum by providing solar module manufacturers, project developers, and project owners with various incentives to accelerate the deployment of solar power generation. For more information about these incentive programs, see Item 1. “Business – Incentive Programs.”\nSupply and Demand. \nAs a result of the market opportunities described above, we recently commenced production of Series 7 modules at our first manufacturing facility in Alabama and are in the process of expanding our manufacturing capacity, including the construction of our fifth U.S. manufacturing facility, which is expected to commence operations in the second half of 2025. We continue to evaluate opportunities for future expansion worldwide. We believe manufacturers of solar cells and modules, particularly those in China, have significant installed production capacity, relative to global demand, and the ability for additional capacity expansion. Accordingly, we believe the solar industry may experience periods of structural imbalance between supply and demand, which could lead to periods of pricing volatility. Further, demand for solar energy in key markets, such as the United States and India, may be affected by the nature and extent of commitments to the renewable energy transition at the local and global levels. For example, certain large oil and gas and energy companies have experienced investor pressure to pursue returns commensurate with those currently associated with fossil fuel projects, where returns have become easier as fossil fuel prices have rebounded since the COVID-19 pandemic. Notwithstanding these considerations, utility and corporate demand for clean energy, and overall electric load growth, especially as a result of AI-driven data center demand, continue to increase. Internationally, given the \n48\nTable of Contents\ncombination of (i) a European Union market captured by Chinese solar modules, which pricing is at levels near or below manufacturing costs, (ii) an India market effectively closed to Southeast Asian finished goods, (iii) the uncertain U.S. policy environment following the 2024 U.S. elections, and (iv) a supply and demand imbalance for Southeast Asian product, we have decided to reduce production output of our Series 6 modules at our manufacturing facilities in Malaysia and Vietnam by a combined total of 1 GW in 2025. In light of such market realities, we continue to advocate for industrial and trade policies that provide a level playing field for domestic manufacturers of solar cells and modules. We also continue to focus on our strategies and points of differentiation, which include our advanced module technology, our manufacturing process and distributed manufacturing presence, our R&D capabilities, our commitment to responsible solar, and our financial stability.\nPricing Competition. \nThe solar industry has been characterized by intense pricing competition, both at the module and system levels. This competition may result in an environment in which pricing falls rapidly, which could potentially increase demand for solar energy solutions but constrain the ability for module manufacturers and project developers to sustain meaningful and consistent profitability. Our results of operations could be adversely affected if competitors reduce pricing below their costs, bid aggressively low prices for module sale agreements, or are able to operate at minimal or negative operating margins for sustained periods of time. For certain of our competitors, including many in China, these practices may be enabled by their direct or indirect access to sovereign capital or other forms of state support. Although module average selling prices in many global markets continue to decline, recent module pricing in the United States, our primary market, has been relatively stable due, in part, to the demand for domestically manufactured modules as a result of the IRA. \nDiverse Offerings. \nWe face intense competition from manufacturers of crystalline silicon solar modules and other emerging technologies. Solar module manufacturers compete with one another on sales price per watt, which may be influenced by several module value attributes, including energy yield, wattage (through a larger form factor or an improved conversion efficiency), degradation, sustainability, and reliability. Sales price per watt may also be influenced by warranty terms, customer payment terms, and/or module content attributes. We believe that utility-scale solar will continue to be a compelling offering and will continue to represent an increasing portion of the overall electricity generation mix. However, this focus on utility-scale module offerings exists within a current market environment that includes rooftop and distributed generation solar, which may influence our future offerings.\nWe continue to devote significant resources to support the implementation of our technology roadmap and improve the energy output of our modules. In the course of our R&D activities, we explore various technologies in our efforts to sustain competitive differentiation of our modules. Such technologies include the development of bifacial modules, the implementation of our CuRe program, and ongoing research and development of multi-junction solar modules.\n•\nBifacial. \nWhile conventional solar modules are monofacial, meaning their ability to produce energy is a function of direct and diffuse irradiance on their front side, most module manufacturers offer bifacial modules that also capture diffuse irradiance on the back side of a module. Bifaciality compromises nameplate efficiency, but by converting both front and rear side irradiance, such technology may improve the overall energy production of a module relative to nameplate efficiency when applied in certain applications, which could lower the overall LCOE of a system when compared to systems using monofacial solar modules. We recently began commercial production of bifacial solar modules at certain of our manufacturing facilities and delivered our first bifacial modules to customers. Our bifacial module features an innovative transparent back contact which, in addition to converting both front and rear side irradiance, allows infrared light to pass through rather than be absorbed as heat. This design lowers the operational temperature of the module, resulting in a higher energy yield.\n•\nCuRe\n. Our CuRe program is intended to improve our current semiconductor structure by replacing copper with certain other elements that are expected to enhance module performance by improving its bifaciality characteristics, improving its temperature coefficient, and improving its warranted degradation. As a result of these performance improvements, our PV solar modules are expected to produce more energy in real-\n49\nTable of Contents\nworld operating conditions over their estimated useful lives than crystalline silicon modules with the same nameplate capacity. In May 2024, we achieved a new world record CdTe research cell conversion efficiency of 23.1%, which was based on our CuRe program and certified by the U.S. Department of Energy’s National Renewable Energy Laboratory. We commenced a limited commercial production run of modules employing our CuRe technology in late 2024 and intend to begin a phased replication of the technology across our fleet in the first quarter of 2026.\n•\nMulti-junction\n. We continue to evaluate opportunities to develop and leverage other solar cell technologies in multi-junction applications that combine our thin film PV technology with another high efficiency PV semiconductor, with each layer optimized for a different range of the solar spectrum. We believe such applications, which are expected to utilize at least one thin-film semiconductor, have the potential to significantly increase the efficiency of PV modules beyond the limits of traditional single-junction devices. Our acquisition of Evolar is expected to accelerate the development of high efficiency multi-junction devices by integrating Evolar’s expertise with First Solar’s existing R&D capabilities.\nProduct Efficiencies. \nThe efficiencies gained from the vertical integration of our manufacturing model and our cost management initiatives allow us to compete favorably in markets where pricing for modules and systems is highly competitive. Our cost competitiveness is based in large part on our advanced thin film semiconductor technology, module wattage, proprietary manufacturing process (which enables us to produce a CdTe module in a matter of hours using a continuous and highly automated industrial manufacturing process, as opposed to a batch process), and focus on operational excellence. In addition, our CdTe modules use approximately 2% to 3% of the amount of semiconductor material that is used to manufacture conventional crystalline silicon solar modules. The cost of polysilicon is a significant driver of the manufacturing cost of crystalline silicon solar modules, and the timing and rate of change in the cost of silicon feedstock and polysilicon could lead to changes in solar module pricing levels.\nEnergy Performance. \nIn many climates our solar modules provide certain energy production advantages relative to competing crystalline silicon solar modules. As a result, our solar modules can produce more annual energy in real-world operating conditions than conventional crystalline silicon modules with the same nameplate capacity. For more information about these advantages, see \nItem 1. “Business – Business Strategy.”\n Additionally, we warrant that our solar modules will produce at least 98% of their labeled power output rating during the first year, with the warranty coverage reducing by a degradation factor that is generally between 0.3% and 0.5%, depending on the module series, every year thereafter throughout the limited power output warranty period of up to \n30\n years.\nWhile our modules are generally competitive in cost, reliability, and performance attributes, there can be no guarantee such competitiveness will continue to exist in the future to the same extent or at all. Any declines in the competitiveness of our products could result in further declines in the average selling prices of our modules and additional margin compression. Accordingly, we continue to focus on enhancing the competitiveness of our solar modules through our module technology and cost reduction roadmaps.\nCertain Trends and Uncertainties\nWe believe that our business, financial condition, and results of operations may be favorably or unfavorably impacted by the following trends and uncertainties. See Item 1A. “Risk Factors” and elsewhere in this Annual Report on Form 10-K for discussions of other risks that may affect us.\nOur business is evolving worldwide and is shaped by the varying ways in which our offerings can be compelling and economically viable solutions to energy needs in various markets. In addressing electricity demands, we are focused on providing utility-scale module offerings in key geographic markets that we believe have a significant need for mass-scale PV solar electricity, including markets throughout the United States and India. We closely evaluate and monitor the appropriate level of resources required to support such markets and their associated sales opportunities. When deployed in utility-scale applications, our modules provide energy at a lower LCOE compared to traditional forms of energy generation, making them an attractive alternative to or replacement for aging fossil fuel-based \n50\nTable of Contents\ngeneration resources. Accordingly, future retirements of aging energy generation resources represent a significant increase in the potential market for solar energy.\nDemand for our PV solar module offerings depends, in part, on market factors outside our control. For example, many governments have proposed or enacted policies or incentive programs intended to encourage renewable energy investments to achieve decarbonization objectives and/or establish greater energy independence. While we compete in markets that do not require solar-specific government subsidies or incentive programs, our net sales and profits remain subject to variability based on the availability and size of government subsidies and economic incentives. Adverse changes in these factors could increase the cost of utility-scale systems, which could reduce demand for our solar modules. Recent developments to government incentive programs include the following:\n•\nUnited States.\n In August 2022, the previous U.S. President signed the IRA into law, which was intended to accelerate the country’s energy transition. Among other things, the financial incentives provided by the IRA have significantly increased demand for modules manufactured in the United States. Accordingly, the demand for these solar modules is expected to increase domestic manufacturing in the near term, which may result in localized supply chain constraints and periods of inflationary pricing for certain of our key raw materials. The financial incentives provided by the IRA have also increased demand for solar modules in general due to the incremental tax credit available for the qualified production of clean hydrogen that is powered by renewable resources. Given the complexities of the IRA, we continue to evaluate the extent of benefits available to us, which we expect will favorably impact our results of operations in future periods. For example, we currently expect to qualify for the advanced manufacturing production credit under Section 45X of the IRC, which provides certain specified benefits for solar modules and solar module components manufactured in the United States and sold to third parties. See Note 9. “Government Grants” and\n \nNote 18. “Income Taxes” to our consolidated financial statements for discussion of our expectation of the financial benefits available to us under the IRA and developments to technical guidance and regulations, respectively. Also, the new presidential administration and control of the U.S. Congress present uncertainty as to the continued availability of such benefits. For example, on January 20, 2025, the U.S. President issued the executive order entitled, “Unleashing American Energy,” which, among other things, indicated a lack of support for federal funding of certain solar and solar-related projects. For more information about certain risks associated with the benefits available to us under the IRA, see Item 1A. “Risk Factors – We have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.”\n•\nIndia. \nIn March 2023, the government of India allocated financial incentives under the PLI scheme to certain PV module manufacturers, including First Solar. The PLI scheme is expected to provide aggregate funding of INR 185 billion ($2.2 billion), of which INR 11.8 billion ($138 million) was allocated to First Solar, to promote the manufacturing of high efficiency solar modules in India and to reduce India’s dependency on foreign imports of solar modules. Under the PLI scheme, manufacturers were selected through a competitive bid process and may be entitled to receive certain cash incentives over a five-year period following the commissioning of their manufacturing facilities. Among other things, such incentives are subject to attaining certain minimum thresholds for module efficiency and temperature coefficient and require that a certain proportion of raw materials be sourced from the domestic market. Such conditions will be evaluated on a quarterly basis from 2026 through 2031. At this time, it is uncertain to what extent we may qualify for such incentives.\n51\nTable of Contents\nDemand for our solar energy solutions also depends on domestic or international trade policies and government regulations, which may be proposed, revised, and/or enacted across short- and long-term time horizons with varying degrees of impact to our net sales, profit, and manufacturing operations. Changes in these policies and regulations could adversely impact the competitive landscape of solar markets, which could reduce demand for our solar modules. Recent revisions or proposed changes to trade policy and government regulations include the following:\n•\nChina.\n In early February 2025, China announced that it would tighten export controls for five key minerals, including products containing tellurium; tellurium is one of the main components of our CdTe module production process. Although tellurium and products containing tellurium are sourced globally, China is a major global producer of tellurium and products containing tellurium. Exporters of tellurium and related products may be required to obtain a license from the Chinese Ministry of Commerce. Since these export controls came into effect, we have assembled a cross-functional team to interpret the export controls, analyze how they may impact First Solar’s module production process. We have and intend to continue applying for export licenses where appropriate, as well as continuing to implement other strategic alternatives such as leveraging our alternative suppliers to mitigate potential adverse impacts from these export controls. For more information about this development, see Item 1A. “Risk Factors – A disruption in our supply chain for CdTe, tellurium, products containing tellurium, or other key raw materials, or equipment could interrupt or impair our ability to manufacture solar modules and could adversely impact our profitability and long-term growth prospects.”\n•\nUnited States.\n In April 2024, the American Alliance for Solar Manufacturing Trade Committee, which includes First Solar, filed a set of AD/CVD petitions with the USDOC and the USITC to impose duties on certain unfairly traded solar products from Cambodia, Malaysia, Thailand, and Vietnam. For more information about this development, see Item 1A. “Risk Factors – The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.”\n•\nUnited States.\n In October 2023, a coalition of U.S. aluminum extruders and a labor union filed AD/CVD petitions with the USDOC and the USITC related to aluminum extrusions from 15 countries. We import certain items that are within the scope of the investigations. The USDOC issued preliminary and final antidumping determinations in May and September 2024, respectively, both of which found that our Malaysian supplier of aluminum extrusions was not dumping. For more information about this development, see Item 1A. “Risk Factors – The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.”\n•\nIndia\n. The ALMM was introduced in 2021 as a non-tariff barrier to incentivize domestic manufacturing of PV modules by approving the list of models and manufacturers who can participate in certain solar development projects. The ALMM is approved by the MNRE, and any modifications to the ALMM and its application may affect future investments in solar module manufacturing in India. For example, in December 2024, the ALMM was amended to require nearly all solar development projects to use PV modules that contain domestically manufactured solar cells, which is expected to be effective for such projects completed on or after June 2026. For more information about the ALMM, see Item 1A. “Risk Factors – The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar \n52\nTable of Contents\ncells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.”\nOur ability to provide solar modules on economically attractive terms is also affected by the availability and cost of logistics services associated with the procurement of raw materials or equipment used in our manufacturing process and the shipping, handling, storage, and distribution of our modules. To mitigate certain logistics costs, we employ commercial contract structures that provide additional consideration to us if the cost of logistics services, excluding demurrage and detention, exceeds defined thresholds. We may also adjust our shipping plans to include additional lead times for module deliveries and/or utilize our network of U.S. distribution centers to mitigate logistics costs. Additionally, our manufacturing capacity expansions are expected to bring production activities closer to customer demand, further mitigating our exposure to the cost of ocean freight.\nWe generally price and sell our solar modules on a per watt basis. As of December 31, 2024, we had entered into contracts with customers for the future sale of 68.5 GW of solar modules for an aggregate transaction price of $\n20.5\n billion, which we expect to recognize as revenue through 2030 as we transfer control of the modules to our customers. This volume and transaction price exclude contracts with customers in India for which payment has not been fully secured. This volume includes contracts for the sale of 37.1 GW of solar modules with anticipated price adjustments for future module technology improvements, including enhancements to certain energy related attributes. Based on these potential improvements, the contracted module volume as of December 31, 2024, the expected timing of such improvements being incorporated into our manufacturing process, and the expected timing of module deliveries, such adjustments, if realized, could result in additional revenue of up to $0.7 billion, the majority of which would be recognized between 2026 and 2028. In addition to these price adjustments, certain of our contracts with customers may include favorable price adjustments associated with sales freight in excess of defined thresholds and/or favorable or unfavorable price adjustments associated with changes to (i) certain commodity prices, (ii) the module wattage committed for delivery, and (iii) the volume of modules sold that meet certain U.S. domestic content requirements. As a result, the revenue recognized from such contracts may increase or decrease in future periods relative to the original transaction price.\nWe monitor our modules’ expected performance through quality and reliability testing, as well as actual performance in certain field installation sites. Any declines in the expected performance attributes of our modules could adversely impact our financial results due to declines in the average selling prices of our modules and additional margin compression. For example, the recently identified manufacturing issues affecting certain Series 7 modules may adversely impact the average selling prices of our modules or the carrying value of our inventories. These manufacturing issues may also increase product warranty claims by our customers to resolve the premature power loss in affected modules. The remediation of any identified issues in our manufacturing process may result in increased costs as we resolve the identified issues. Any future manufacturing issues, including any additional commitment made by us to remediate the affected modules beyond our limited warranty, could also adversely impact our reputation, financial position, operating results, and cash flows. We may also be subject to certain other risks and uncertainties surrounding module performance as described in Item 1A. “Risk Factors – Problems with product quality or performance may cause us to incur significant and/or unexpected contractual damages and/or warranty and related expenses, damage our market reputation, and prevent us from maintaining or increasing our market share.”\nWe continue to increase the nameplate production capacity of our existing manufacturing facilities by improving our production throughput, increasing module wattage, and reducing manufacturing yield losses. Additionally, we are in the process of expanding our manufacturing capacity by approximately 4 GW, including the construction of our fifth manufacturing facility in the United States, as well as capacity expansion at our existing facilities. This additional capacity, and any other potential investments to add to or otherwise modify our existing manufacturing capacity in response to market demand and competition, may require significant internal and possibly external sources of capital, and may be subject to certain risks and uncertainties described in Item 1A. “Risk Factors,” including those described under the headings “Our future success depends on our ability to effectively balance manufacturing \n53\nTable of Contents\nproduction with market demand, effectively manage our cost per watt, and, when necessary, continue to build new manufacturing plants over time in response to market demand, all of which are subject to risks and uncertainties” and “If any future production lines are not built in line with committed schedules, it may adversely affect our future growth plans. If any future production lines do not achieve operating metrics similar to our existing production lines, our solar modules could perform below expectations and cause us to lose customers.”\nResults of Operations\nThe following table sets forth our consolidated statements of operations as a percentage of net sales for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended December 31,\n2024\n2023\n2022\nNet sales\n100.0 \n%\n100.0 \n%\n100.0 \n%\nCost of sales\n55.8 \n%\n60.8 \n%\n97.3 \n%\nGross profit\n44.2 \n%\n39.2 \n%\n2.7 \n%\nSelling, general and administrative\n4.5 \n%\n6.0 \n%\n6.3 \n%\nResearch and development\n4.5 \n%\n4.6 \n%\n4.3 \n%\nProduction start-up\n2.0 \n%\n2.0 \n%\n2.8 \n%\nLitigation loss\n— \n%\n1.1 \n%\n— \n%\nGain on sales of businesses, net\n— \n%\n0.2 \n%\n9.7 \n%\nOperating income (loss)\n33.2 \n%\n25.8 \n%\n(1.0)\n%\nForeign currency loss, net\n(0.6)\n%\n(0.6)\n%\n(0.6)\n%\nInterest income\n2.1 \n%\n2.9 \n%\n1.3 \n%\nInterest expense, net\n(0.9)\n%\n(0.4)\n%\n(0.5)\n%\nOther (expense) income, net\n(0.3)\n%\n(0.9)\n%\n1.2 \n%\nIncome tax expense\n(2.7)\n%\n(1.8)\n%\n(2.0)\n%\nNet income (loss)\n30.7 \n%\n25.0 \n%\n(1.7)\n%\nSegment Overview\nOur primary segment is our modules business, which involves the design, manufacture, and sale of CdTe solar modules, which convert sunlight into electricity. Third-party customers of our modules segment include system developers, independent power producers, utilities, commercial and industrial companies, and other system owners and operators. Our residual business operations include certain project development activities, operations and maintenance (“O&M”) services, the results of operations from PV solar power systems we owned and operated in certain international regions, and the sale of such systems to third-party customers.\nNet sales\nWe generally price and sell our solar modules on a per watt basis. During 2024, no customer accounted for 10% or more of our modules business net sales, and the majority of our solar modules were sold to developers and operators of systems in the United States. Substantially all of our modules business net sales during 2024 were denominated in U.S. dollars. We recognize revenue for module sales at a point in time following the transfer of control of the modules to the customer, which typically occurs upon delivery of the modules to the location specified in the terms of the underlying contract. The revenue recognition policies for module sales are further described in Note 2. “Summary of Significant Accounting Policies” to our consolidated financial statements. Net sales from our residual business operations primarily consist of revenue recognized for sales of development projects or completed systems, including any modules installed in such systems and any revenue from energy generated by such systems. In certain prior periods, our residual business operations also included O&M services we provided to third parties.\n54\nTable of Contents\nThe following table shows net sales by reportable segment for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nModules\n$\n4,202,733 \n$\n3,296,809 \n$\n2,428,278 \n$\n905,924 \n27 \n%\n$\n868,531 \n36 \n%\nOther\n3,556 \n21,793 \n191,041 \n(18,237)\n(84)\n%\n(169,248)\n(89)\n%\nNet sales\n$\n4,206,289 \n$\n3,318,602 \n$\n2,619,319 \n$\n887,687 \n27 \n%\n$\n699,283 \n27 \n%\nNet sales from our modules segment increased by $905.9 million in 2024 primarily due to a 24% increase in the volume of modules sold to third parties and an increase in termination payments of $115.0 million associated with certain customer contract terminations in the U.S., India, and Europe, partially offset by a reduction in revenue of $56.0 million related to manufacturing issues affecting certain Series 7 modules manufactured in 2023 and 2024. Net sales from our residual business operations decreased by $18.2 million in 2024 as our residual business operations continue to wind down.\nCost of sales\nOur modules business cost of sales includes the cost of raw materials and components for manufacturing solar modules, such as glass, transparent conductive coatings, CdTe and other thin film semiconductors, laminate materials, connector assemblies, edge seal materials, and frames or back rails. In addition, our cost of sales includes direct labor for the manufacturing of solar modules and manufacturing overhead, such as engineering, equipment maintenance, quality and production control, and information technology. Our cost of sales also includes depreciation of manufacturing plant and equipment, facility-related expenses, environmental health and safety costs, and costs associated with shipping, warranties, and solar module collection and recycling (excluding accretion). Cost of sales for our residual business operations includes project-related costs, such as development costs (legal, consulting, transmission upgrade, interconnection, permitting, and other similar costs), EPC costs (consisting primarily of solar modules, inverters, electrical and mounting hardware, project management and engineering, and construction labor), and site-specific costs.\nThe following table shows cost of sales by reportable segment for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nModules\n$\n2,342,045 \n$\n2,019,388 \n$\n2,312,881 \n$\n322,657 \n16 \n%\n$\n(293,493)\n(13)\n%\nOther\n6,380 \n(1,465)\n236,580 \n7,845 \nN/A\n(238,045)\nN/A\nCost of sales\n$\n2,348,425 \n$\n2,017,923 \n$\n2,549,461 \n$\n330,502 \n16 \n%\n$\n(531,538)\n(21)\n%\n% of net sales\n55.8 \n%\n60.8 \n%\n97.3 \n%\n \nCost of sales\n \nincreased $330.5 million, or 16%, and decreased 5.0 percentage points as a percent of net sales when comparing 2024 with 2023. The increase in cost of sales was driven by a $322.7 million increase in our modules segment cost of sales primarily as a result of (i) higher costs of $532.2 million from an increase in the volume of modules sold, (ii) higher module storage costs of $102.6 million, and (iii) higher sales freight charges of $43.1 million, partially offset by (iv) a higher sales mix of modules qualifying for the advanced manufacturing production credit under Section 45X of the IRC, which decreased cost of sales by $346.4 million.\nThe increase in cost of sales was also driven by a $7.8 million increase in our residual business operations cost of sales primarily due to a favorable prior period settlement with a former supplier, which resulted in an $8.4 million benefit to cost of sales. \n55\nTable of Contents\nGross profit\nGross profit may be affected by numerous factors, including the selling prices of our modules and the selling prices of projects and services included in our residual business operations, our manufacturing costs, the capacity utilization of our manufacturing facilities, and foreign exchange rates. Gross profit may also be affected by the mix of net sales from our modules business and residual business operations.\nThe following table shows gross profit for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nGross profit\n$\n1,857,864 \n$\n1,300,679 \n$\n69,858 \n$\n557,185 \n43 \n%\n$\n1,230,821 \n>500%\n% of net sales\n44.2 \n%\n39.2 \n%\n2.7 \n%\n \n \nGross profit increased 5.0 percentage points to 44.2% in 2024 from 39.2% in 2023 primarily due to (i) the advanced manufacturing credit previously discussed, (ii) the contract termination payments described above, and (iii) an increase in the volume of modules sold. These increases were partially offset by (iv) higher module storage costs and (v) a reduction in revenue related to manufacturing issues affecting Series 7 modules described above.\nSelling, general and administrative\nSelling, general and administrative expense consists primarily of salaries and other personnel-related costs, professional fees, insurance costs, and other business development and selling expenses.\nThe following table shows selling, general and administrative expense for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nSelling, general and administrative\n$\n188,262 \n$\n197,622 \n$\n164,724 \n$\n(9,360)\n(5)\n%\n$\n32,898 \n20 \n%\n% of net sales\n4.5 \n%\n6.0 \n%\n6.3 \n%\n \n \nSelling, general and administrative expense in 2024 decreased compared to 2023 primarily due to (i) lower employee bonus expense and lower share-based compensation expense, and (ii) lower costs associated with the implementation of a new global enterprise resource planning system as compared to the prior year, partially offset by (iii) higher employee compensation expense due to an increase in headcount, (iv) higher costs for certain legal matters, and (v) higher consulting fees.\nResearch and development\nResearch and development expense consists primarily of salaries and other personnel-related costs; the cost of products, materials, and outside services used in our R&D activities; and depreciation and amortization expense associated with R&D specific facilities and equipment. We maintain a number of programs and activities to improve our technology and processes in order to enhance the performance and reduce the costs of our solar modules.\nThe following table shows research and development expense for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nResearch and development\n$\n191,375 \n$\n152,307 \n$\n112,804 \n$\n39,068 \n26 \n%\n$\n39,503 \n35 \n%\n% of net sales\n4.5 \n%\n4.6 \n%\n4.3 \n%\n \n \n56\nTable of Contents\nResearch and development expense in 2024 increased compared to 2023 primarily due to higher depreciation and maintenance costs resulting from our significant investments in R&D facilities and equipment and higher employee compensation expense resulting from an increase in headcount.\nProduction start-up\nProduction start-up expense consists of costs associated with operating a production line before it is qualified for commercial production, including the cost of raw materials for solar modules run through the production line during the qualification phase, employee compensation for individuals supporting production start-up activities, and applicable facility related costs. Production start-up expense also includes costs related to the selection of a new site and implementation costs for manufacturing process improvements to the extent we cannot capitalize these expenditures.\nThe following table shows production start-up expense for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nProduction start-up\n$\n84,492 \n$\n64,777 \n$\n73,077 \n$\n19,715 \n30 \n%\n$\n(8,300)\n(11)\n%\n% of net sales\n2.0 \n%\n2.0 \n%\n2.8 \n%\n \n \nDuring 2024, we incurred production start-up expense primarily for our fourth and fifth manufacturing facilities in the U.S. and also for a limited commercial production run of modules employing our CuRe technology. During 2023, we incurred production start-up expense primarily for our first manufacturing facility in India, our third and fourth manufacturing facilities in the U.S., and certain manufacturing upgrades at our Malaysian facilities.\nLitigation loss\nThe following table shows litigation loss for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nLitigation loss\n430 \n35,590 \n— \n$\n(35,160)\n(99)\n%\n$\n35,590 \nN/A\n% of net sales\n— \n%\n1.1 \n%\n— \n%\n \n \nIn July 2021, Southern Power Company filed an arbitration demand with the American Arbitration Association against two of the Company’s subsidiaries alleging breach of the EPC agreements for five projects in the United States for which such subsidiaries served as the EPC contractor. On July 19, 2023, the arbitration panel issued an interim award letter adopting certain of Southern’s proposed individual award claims in the amount of $35.6 million. See Note 14. “Commitments and Contingencies” to our condensed consolidated financial statements for further information about this matter.\nGain on sales of businesses, net\nThe following table shows gain on sales of businesses, net for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nGain on sales of businesses, net\n$\n1,115 \n$\n6,883 \n$\n253,511 \n$\n(5,768)\n(84)\n%\n$\n(246,628)\n(97)\n%\n% of net sales\n— \n%\n0.2 \n%\n9.7 \n%\n \n \n57\nTable of Contents\nDuring 2022, we completed the sales of our Japan project development business and our Japan O&M operations to PAG Real Assets (“PAG”) and the sales of certain other international O&M operations to a subsidiary of Clairvest Group, Inc. (“Clairvest”). In 2023, we recognized certain post-closing adjustments and earnouts associated with the prior sale of our Japan project development business. In 2024, there was no significant activity related to gains on sales of businesses. See Note 4. “Sales of Businesses” to our consolidated financial statements for further information related to these transactions.\nForeign currency loss, net\nForeign currency loss, net consists of the net effect of gains and losses resulting from holding assets and liabilities and conducting transactions denominated in currencies other than our subsidiaries’ functional currencies.\nThe following table shows foreign currency loss, net for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nForeign currency loss, net\n$\n(24,976)\n$\n(21,533)\n$\n(16,414)\n$\n(3,443)\n16 \n%\n$\n(5,119)\n31 \n%\nForeign currency loss for the year ended December 31, 2024 was consistent with the prior year.\nInterest income\nInterest income is earned on our cash, cash equivalents, marketable securities, restricted cash, restricted cash equivalents, and restricted marketable securities. Interest income also includes interest earned from late customer payments.\nThe following table shows interest income for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nInterest income\n$\n89,090 \n$\n97,667 \n$\n33,284 \n$\n(8,577)\n(9)\n%\n$\n64,383 \n193 \n%\nInterest income during 2024 decreased compared to 2023 primarily due to lower interest rates on cash and cash equivalents and lower average balances of time deposits, partially offset by increased interest earned on trade receivables.\nInterest expense, net\nInterest expense, net is primarily comprised of interest incurred on debt. We may capitalize interest expense to our property, plant and equipment when such costs qualify for interest capitalization, which reduces the amount of net interest expense reported in any given period.\nThe following table shows interest expense, net for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nInterest expense, net\n$\n(38,870)\n$\n(12,965)\n$\n(12,225)\n$\n(25,905)\n200 \n%\n$\n(740)\n6 \n%\nInterest expense, net during 2024 increased compared to 2023 primarily due to additional borrowing under various arrangements in India and higher capitalized interest balances in the prior year related to the construction of our manufacturing plant in India.\n58\nTable of Contents\nOther (expense) income, net\nOther (expense) income, net is primarily comprised of miscellaneous items and realized gains and losses on the sale of marketable securities and restricted marketable securities.\nThe following table shows other (expense) income, net for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nOther (expense) income, net\n$\n(13,326)\n$\n(29,145)\n$\n31,189 \n$\n15,819 \n(54)\n%\n$\n(60,334)\nN/A\nOther expense, net decreased in 2024 compared to 2023 primarily due to the impairment of a strategic investment in 2023.\nIncome tax expense\nIncome tax expense or benefit, deferred tax assets and liabilities, and liabilities for unrecognized tax benefits reflect our best estimates of current and future taxes to be paid. We are subject to income taxes in both the United States and numerous foreign jurisdictions in which we operate, principally Singapore, Malaysia, Vietnam, and India. Significant judgments and estimates are required to determine our consolidated income tax expense. The statutory federal corporate income tax rate in the United States is 21%, and the tax rates in Singapore, Malaysia, Vietnam, and India are 17%, 24%, 20%, and 17%, respectively. In Malaysia, we have been granted a long-term tax holiday, scheduled to expire in 2027, pursuant to which substantially all of our income earned in Malaysia is exempt from income tax, conditional upon our continued compliance with certain employment and investment thresholds. In Vietnam, we have been granted a long-term tax incentive, scheduled to expire at the end of 2036, pursuant to which income earned in Vietnam is subject to reduced annual tax rates, conditional upon our continued compliance with certain revenue and R&D spending thresholds.\nThe following table shows income tax expense for the years ended December 31, 2024, 2023, and 2022:\n \nYears Ended\nChange\n(Dollars in thousands)\n2024\n2023\n2022\n2024 over 2023\n2023 over 2022\nIncome tax expense\n$\n(114,294)\n$\n(60,513)\n$\n(52,764)\n$\n(53,781)\n89 \n%\n$\n(7,749)\n15 \n%\nEffective tax rate\n8.1 \n%\n6.8 \n%\n613.7 \n%\n \n \nOur tax rate is affected by the advanced manufacturing production credit under Section 45X and recurring items such as tax rates in foreign jurisdictions and the relative amounts of income we earn in those jurisdictions. The rate is also affected by discrete items that may occur in any given period but are not consistent from period to period. Income tax expense increased by $53.8 million during 2024 compared to 2023 primarily due to higher pretax income in the current year and the impact of taxes due on U.S. inclusions in taxable income related to global intangible low-taxed income (“GILTI”), partially offset by the beneficial effects of tax law associated with the IRA and the long-term tax holiday in Malaysia.\nLiquidity and Capital Resources\nAs of December 31, 2024, we believe that our cash, cash equivalents, marketable securities, cash flows from operating activities, and contracts with customers for the future sale of solar modules will be sufficient to meet our working capital and capital expenditure needs for at least the next 12 months. In addition, we have availability under our Revolving Credit Facility, which remains unused as of December 31, 2024. To the extent we offer extended payment terms to customers, fail to collect trade receivables in a timely manner, or face other challenges in managing our working capital, we may be required to use our Revolving Capital Facility or other temporary sources of funding. For example, we have entered into factoring agreements with certain financial institutions and have sold certain trade receivables under those factoring facilities. However, we do not use factoring arrangements as an integral part of our financing for working capital. As necessary, we also believe we will have adequate access to the \n59\nTable of Contents\ncapital markets. We monitor our working capital to ensure we have adequate liquidity, both domestically and internationally. We intend to maintain appropriate debt levels based upon cash flow expectations, our overall cost of capital, and expected cash requirements for operations, including near-term construction activities and purchases of manufacturing equipment for our newest manufacturing facilities in the United States. However, our ability to raise capital on terms commercially acceptable to us could be constrained if there is insufficient lender or investor interest due to company-specific, industry-wide, or broader market concerns. Any incremental debt financing could result in increased debt service expenses and/or restrictive covenants, which could limit our ability to pursue our strategic plans. \nAs of December 31, 2024, we had $1.8 billion in cash, cash equivalents, and marketable securities compared to $2.1 billion as of December 31, 2023. This decrease was primarily driven by purchases of property, plant and equipment for our U.S. and Indian facilities and various operating expenditures, partially offset by proceeds from the sale of Section 45X tax credits, net cash receipts from module sales, and receipts from factoring of receivables. As of December 31, 2024 and 2023, $0.7 billion and $1.2 billion of our cash, cash equivalents, and marketable securities, respectively, were held by our foreign subsidiaries and were primarily based in U.S. dollar and Indian Rupee denominated holdings. Our investment policy seeks to preserve our investment principal and maintain adequate liquidity to meet our cash flow requirements, while at the same time optimizing the return on our investments. Such policy applies to all invested funds, whether managed internally or externally. Pursuant to such policy, we place our investments with a diversified group of high-quality financial institutions and limit the concentration of such investments with any one counterparty. We place significant emphasis on the creditworthiness of financial institutions and assess the credit ratings and financial health of our counterparty financial institutions when making investment decisions.\nWe utilize a variety of tax planning and financing strategies in an effort to ensure that our worldwide cash is available in the locations in which it is needed. If certain international funds were needed for our operations in the United States, we may be required to accrue and pay certain U.S. and foreign taxes to repatriate such funds. We maintain the intent and ability to permanently reinvest our accumulated earnings outside the United States, with the exception of certain subsidiaries for which applicable income taxes have been recorded as of December 31, 2024. During the year ended December 31, 2024, we reversed our position to indefinitely reinvest the accumulated earnings of a foreign subsidiary, allowing us to repatriate $1.0 billion of offshore funds to support our strategic investments in the United States. Our worldwide cash may also be affected by changes to foreign government banking regulations that restrict our ability to move funds among various jurisdictions under certain circumstances, which could negatively impact our access to capital, resulting in an adverse effect on our liquidity and capital resources.\nAlthough we compete in markets that do not require solar-specific government subsidies or incentive programs, such incentives continue to influence the demand for PV solar energy around the world. For example, the financial incentives provided by the IRA are expected to increase both the demand for, and the domestic manufacturing of, solar modules in the United States. We continue to evaluate the extent of benefits available to us by the IRA, which are expected to favorably impact our liquidity and capital resources in future periods. For example, we currently expect to qualify for the advanced manufacturing production credit under Section 45X of the IRC, which provides certain specified benefits for solar modules and solar module components manufactured in the United States and sold to third parties. Such credit may be refundable by the IRS or transferable to a third party and is available from 2023 to 2032, subject to phase down beginning in 2030. Based on the current form factor of our modules, we expect to qualify for a credit of approximately 17 cents per watt for each module produced in the United States and sold to a third party. Accordingly, we expect the advanced manufacturing production credit will provide us with a significant source of funding throughout its 10-year period. In December 2024, we entered into two agreements with Visa for the sale of $857.2 million of Section 45X tax credits we generated during 2024 for aggregate cash proceeds of $818.6 million. We received initial cash proceeds of $616.0 million in December 2024 and expect to receive the remaining cash proceeds during the first quarter of 2025. In December 2023, we entered into two agreements with Fiserv for the sale of $687.2 million of Section 45X tax credits we generated during 2023, for aggregate cash proceeds of $659.7 million. We received the full cash proceeds during 2024. For more information about certain \n60\nTable of Contents\nrisks associated with the benefits available to us under the IRA, see Item 1A. “Risk Factors – “We have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.” See Note 9. “Government Grants” to our consolidated financial statements for further information about government grants.\nAs a result of various market opportunities and increased demand for our products, we commenced production of Series 7 modules at our third manufacturing facility in Ohio and our first manufacturing facility in India during 2023 and at our first manufacturing facility in Alabama during 2024. We also completed the expansion of our manufacturing footprint at our existing facilities in Ohio and India during 2024. We are in the process of further expanding our manufacturing capacity, including the construction of our fifth U.S. manufacturing facility, which is expected to commence operations in the second half of 2025. We anticipate our remaining investment in this U.S. facility to be approximately $0.7 billion, which is expected to be incurred throughout 2025. The capital expenditures necessary to expand our capacity may be financed, in part, by cash on hand, advance payments from customers for module sales in future periods, the advanced manufacturing production credit described above, and/or near-term bridge financing instruments.\nIn addition to the expansion described above, we continue to increase the nameplate production capacity of our existing manufacturing facilities by improving our production throughput, increasing module wattage, and reducing manufacturing yield losses. We have a demonstrated history of innovation, continuous improvement, and manufacturing success driven by our significant investments in various R&D initiatives. We continue to invest significant financial resources in such initiatives, including the completion of a dedicated R&D innovation center in Ohio to support the implementation of our technology roadmap. This facility features a high-volume manufacturing scale production pilot line, which is expected to enable the production of full-sized prototypes of thin film and tandem PV modules. Such R&D facility was commissioned in July 2024. During 2025, we expect to spend between $1.3 billion and $1.5 billion for capital expenditures, including the new facilities mentioned above, and upgrades to machinery and equipment that we believe will further increase our module wattage and expand capacity and throughput at our facilities. These capital investments, and any other potential investments to implement our technology roadmap, may require significant internal and possibly external sources of capital and may be subject to certain risks and uncertainties described in Item 1A. “Risk Factors,” including those described under the headings “Our future success depends on our ability to effectively balance manufacturing production with market demand, effectively manage our cost per watt, and, when necessary, continue to build new manufacturing plants over time in response to market demand, all of which are subject to risks and uncertainties” and “If any future production lines are not built in line with committed schedules, it may adversely affect our future growth plans. If any future production lines do not achieve operating metrics similar to our existing production lines, our solar modules could perform below expectations and cause us to lose customers.”\nWe have also committed and expect to continue to commit significant working capital to purchase various raw materials used in our module manufacturing process. Our failure to obtain raw materials and components that meet our quality, quantity, and cost requirements in a timely manner could increase our manufacturing costs or interrupt or impair our ability to manufacture our solar modules. Accordingly, we may enter into long-term supply agreements to mitigate potential risks related to the procurement of key raw materials and components, and such agreements may be noncancelable or cancelable with a significant penalty. For example, we have entered into long-term supply agreements for the purchase of certain specified minimum volumes of substrate glass for our PV solar modules. We have the right to terminate certain of these agreements upon payment of specified termination penalties (which, in aggregate, are up to $475.1 million as of December 31, 2024 and decline over the remaining supply periods). Additionally, for certain strategic suppliers, we have made, and may in the future be required to make, certain advance payments to secure the raw materials necessary for our module manufacturing.\nWe have also committed certain financial resources to fulfill our solar module collection and recycling obligations and have established a trust under which these funds are put into custodial accounts with an established and reputable bank. As of December 31, 2024, such funds were comprised of restricted marketable securities of \n61\nTable of Contents\n$199.1 million and associated restricted cash and cash equivalents balances of $5.0 million. As of December 31, 2024, our module collection and recycling liability was $134.4 million. Trust funds may be disbursed for qualified module collection and recycling costs (including capital and facility related recycling costs), payments to customers for assuming collection and recycling obligations, and reimbursements of any overfunded amounts. Investments in the trust must meet certain investment quality criteria comparable to highly rated government or agency bonds. As necessary, we adjust the funded amounts for our estimated collection and recycling obligations based on the estimated costs of collecting and recycling covered modules, estimated rates of return on our restricted marketable securities, and an estimated solar module life of 25 years, less amounts already funded in prior years.\nAs of December 31, 2024, we had no off-balance sheet debt or similar obligations, other than financial assurance related instruments, which are not classified as debt. We do not guarantee any third-party debt. See Note 14. “Commitments and Contingencies” to our consolidated financial statements for further information about our financial assurance related instruments.\nCash Flows\nThe following table summarizes key cash flow activity for the years ended December 31, 2024, 2023, and 2022 (in thousands):\n \n2024\n2023\n2022\nNet cash provided by operating activities\n$\n1,217,999 \n$\n602,260 \n$\n873,369 \nNet cash used in investing activities\n(1,563,307)\n(472,791)\n(1,192,574)\nNet cash provided by financing activities\n24,849 \n336,853 \n309,392 \nEffect of exchange rate changes on cash, cash equivalents, restricted cash, and restricted cash equivalents\n(6,387)\n5,285 \n47,438 \nNet (decrease) increase in cash, cash equivalents, restricted cash, and restricted cash equivalents\n$\n(326,846)\n$\n471,607 \n$\n37,625 \nOperating Activities\nThe increase in net cash provided by operating activities during 2024 was primarily driven by proceeds from the sale of Section 45X tax credits and receipts from factoring of receivables, partially offset by an increase in payments made to suppliers compared to the prior year, and lower cash receipts from module sales in the current year.\nInvesting Activities\nThe increase in net cash used in investing activities during 2024 was primarily due to lower proceeds from the sales and maturities of marketable securities in the current year and higher purchases of property, plant and equipment compared to the prior year for our U.S. and Indian facilities, partially offset by lower purchases of marketable securities in the current year.\nFinancing Activities\nThe decrease in net cash provided by financing activities during 2024 was primarily due to repayment of debt in the current year.\n62\nTable of Contents\nRecent Accounting Pronouncements\nIn December 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2023-09, \nIncome Taxes (Topic 740) - Improvements to Income Tax Disclosures\n, which requires greater disaggregation of an entity’s income tax disclosures. Among other things, ASU 2023-09 requires entities to disclose (i) specific categories in the effective tax rate reconciliation, (ii) pretax income or loss from continuing operations, separated between domestic and foreign jurisdictions, (iii) income tax expense or benefit from continuing operations, separated by federal, state, and foreign jurisdictions, and (iv) income taxes paid to federal, state, and foreign jurisdictions. ASU 2023-09 is effective for public companies for annual periods beginning after December 15, 2024, and early adoption is permitted. We are currently evaluating the impact ASU 2023-09 will have on our consolidated financial statements and associated disclosures.\nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n, which requires additional disclosure of specific types of expenses included in the expense captions presented on the face of the income statement. ASU 2024-03 is effective for public companies for annual reporting periods beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027. Early adoption is permitted. The disclosure requirements will be applied on a prospective basis, with the option to apply retrospectively. We are currently evaluating the impact ASU 2024-03 will have on our associated disclosures.\nCritical Accounting Estimates\nIn preparing our consolidated financial statements in conformity with generally accepted accounting principles in the United States (“U.S. GAAP”), we make estimates and assumptions that affect the amounts of reported assets, liabilities, revenues, and expenses, as well as the disclosure of contingent liabilities. Some of our accounting policies require the application of significant judgment in the selection of the appropriate assumptions for making these estimates. By their nature, these judgments are subject to an inherent degree of uncertainty. We base our judgments and estimates on our historical experience, our forecasts, and other available information as appropriate. The actual results experienced by us may differ materially and adversely from our estimates. To the extent there are material differences between our estimates and the actual results, our future results of operations will be affected. Our significant accounting policies are described in Note 2. “Summary of Significant Accounting Policies” to our consolidated financial statements. The accounting policies that require the most significant judgment and estimates include the following:\nAccrued Solar Module Collection and Recycling Liability.\n We previously established a module collection and recycling program, which has since been discontinued, to collect and recycle modules sold and covered under such program once the modules reach the end of their service lives. For legacy customer sales contracts that are covered under this program, we recognized expense at the time of sale based on the estimated cost to collect and recycle the covered solar modules. We estimate the cost of our obligations based on the present value of the expected future cost of collecting and recycling the solar modules, which includes estimates for the cost of packaging materials; the cost of freight from the solar module installation sites to a recycling center; material, labor, and capital costs; and by-product credits for certain materials recovered during the recycling process. We base these estimates on our experience collecting and recycling solar modules and on certain assumptions regarding costs at the time the solar modules will be collected and recycled. In the periods between the time of sale and the related settlement of the collection and recycling obligation, we accrete the carrying amount of the associated liability and classify the corresponding expense within “Selling, general and administrative” expense on our consolidated statements of operations. \n63\nTable of Contents\nWe periodically review our estimates of expected future recycling costs and may adjust our liability accordingly. Such adjustments are presented within “Cost of Sales” on our consolidated statements of operations. During the year ended December 31, 2024, we completed our annual cost study of obligations under our module collection and recycling program and determined that no adjustment to the associated liability was necessary. As of December 31, 2024, a 10% increase in the expected future recycling costs per module would increase the liability by $14.0 million.\nProduct Warranties. \nWe provide a limited PV solar module warranty covering defects in materials and workmanship under normal use and service conditions for up to 12.5 years. We also typically warrant that modules installed in accordance with agreed-upon specifications will produce at least 98% of their labeled power output rating during the first year, with the warranty coverage reducing by a degradation factor every year thereafter throughout the limited power output warranty period of up to 30 years. Among other things, our solar module warranty also covers the resulting power output loss from cell cracking.\nWhen we recognize revenue for sales of modules, we accrue liabilities for the estimated future costs of meeting our limited warranty obligations. We make and revise these estimates based primarily on the number of solar modules under warranty installed at customer locations, our historical experience with and projections of warranty claims, and our estimated per-module replacement costs. We also monitor our expected future module performance through certain quality and reliability testing and actual performance in certain field installation sites. \nIn general, we expect the return rates for our Series 6 and Series 7 modules to be lower than our older series. Accordingly, we estimate that the return rate for such newer series of module technology will be less than 1%. As of December 31, 2024, a 100 basis point increase in the return rates across all series of module technology would increase our product warranty liability by $183.5 million.\nDuring the year ended December 31, 2024, we identified manufacturing issues affecting certain Series 7 modules manufactured in 2023 and 2024 that may cause the modules to experience premature power loss once installed in the field. As part of our monitoring of module performance through certain field installation sites, we tested over 100 Series 7 modules, which provided a preliminary view of potential levels of underperformance related to our initial production of Series 7 modules. We then estimated what subset of the entire population of Series 7 modules sold was affected by the manufacturing issues as not all Series 7 modules exhibited the variability in the production process that may lead to the identified underperformance. Accordingly, in arriving at the range of reasonably possible losses, we estimated that approximately two-thirds of Series 7 modules sold as of December 31, 2024 may have been impacted, based on the Series 7 production schedule and the dates of when the underlying manufacturing issues were addressed at each affected facility. \nBased on currently available information and certain assumptions and estimates, we believe a reasonable estimate of the aggregate losses related to these manufacturing issues will range from approximately $56 million to $100 million. The low end of the range of reasonably possible losses reflects performance data from select samples of Series 7 modules compared to warranted levels of performance, along with expectations of favorable Series 7 module energy performance attributes, such as a superior temperature coefficient and spectral response, that may partially offset underperformance from the identified issues. Such estimate of potential net underperformance was multiplied by the average selling price per watt of Series 7 modules to determine the low end of the expected costs to commercially settle warranty claims. The high end of the range of reasonably possible losses excludes any such favorable energy performance expectations from our advanced module technology and includes an estimate of incremental module underperformance beyond that exhibited in our samples of module performance data.\n64\nTable of Contents\nGiven the inherent limitations of sampling combined with the variability of module performance at different field installation sites, no individual amount within the range represented a better estimate than any other amount. Accordingly, as of December 31, 2024, we increased our product warranty liability by the low end of the range, which we recorded as a reduction to revenue. The ultimate loss we will incur for these manufacturing issues will depend on the extent of the premature power loss that is experienced in relation to the obligations under our limited product warranties, as well as any potential additional commitments we may make to remediate the affected modules. A 100 basis point decrease in the module performance data relative to nameplate capacity across our estimate of the impacted Series 7 modules would result in an additional $14 million increase in our product warranty liability. \nAs of December 31, 2024, we held approximately 0.7 GW of Series 7 modules that may potentially be impacted by the identified manufacturing issues. As we sell these modules, our product warranty liability may increase to the extent the modules exhibit the identified underperformance. Over the next 12 months, we expect to obtain additional information related to the issues affecting certain previously manufactured Series 7 modules and related to the actions we may take in response to the associated warranty claims. As such information becomes available to us, our estimate of the aggregate losses related to these manufacturing issues may change, and any change in estimate may also result in a change to our product warranty liability.\nGovernment Grants.\n We continue to evaluate the extent of benefits available to us pursuant to the IRA, which we expect will favorably impact our results of operations in future periods. For example, we currently expect to qualify for the advanced manufacturing production credit under Section 45X of the IRC, which provides certain specified benefits for solar modules and solar module components manufactured in the United States and sold to third parties. For eligible components, the credit is equal to (i) $12 per square meter for a PV wafer, (ii) 4 cents multiplied by the capacity of a PV cell in watts, and (iii) 7 cents multiplied by the capacity of a PV module in watts. Based on the current form factor of our modules, we expect to qualify for a credit of approximately 17 cents per watt for each module produced in the United States and sold to a third party. During the year ended December 31, 2024, we recognized $997.6 million of Section 45X credits as a reduction to “Cost of sales.”\nFor further information about certain key aspects of the IRA, see Item 1A. “Risk Factors – We have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.” Any modifications to the law or its effects arising, for example, through (i) technical guidance and regulations from the IRS and U.S. Treasury Department, (ii) subsequent amendments to or interpretations of the law, and/or (iii) future laws or regulations rendering certain provisions of the IRA less effective or ineffective, in whole or in part, could result in material adverse changes to the benefits we have recognized and expect to recognize.\nWe recognize grants expected to be received directly from a government entity at their stated value. When we expect to transfer grants to a third party, we recognize the grants at, or adjust their carrying value to, the amount expected to be received from the transaction. Accordingly, changes in the expected realization of the grants could affect our results of operations. Additionally, the amount expected to be received from transfers to third parties may fluctuate based on market conditions or other factors that impact whether, and for how much, buyers are willing to purchase such credits.\n65\nTable of Contents",
  "item2": null
}