{
  "source_file": "fslr-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nCautionary Statement Regarding Forward-Looking Statements\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), and the Securities Act of 1933, as amended (the “Securities Act”), which are subject to risks, uncertainties, and assumptions that are difficult to predict. All statements in this Quarterly Report on Form 10-Q, other than statements of historical fact, are forward-looking statements. These forward-looking statements are made pursuant to safe harbor provisions of the Private Securities Litigation Reform Act of 1995. The forward-looking statements include statements, among other things, concerning: effects resulting from certain module manufacturing changes; our business strategy, including anticipated trends and developments in and management plans for our business and the markets in which we operate; future financial results, operating results, module volumes produced, module volumes sold, revenues, gross margin, operating expenses, products, projected costs (including estimated future module collection and recycling costs), warranties and anticipated claims thereunder, solar module technology and cost reduction roadmaps, product reliability, investments, and capital expenditures; our ability to continue to reduce the cost per watt of our solar modules; the impact of public policies, such as tariffs, export controls, or other trade remedies; the potential impact of legislation intended to encourage renewable energy investments through tax credits; our ability to expand manufacturing capacity worldwide, including the construction of new manufacturing facilities in the United States and related increases in manufacturing capacity; the impact of supply chain disruptions, which may affect the procurement of raw materials used in our manufacturing process and the distribution of our modules; R&D programs and our ability to improve the wattage of our solar modules; our ability to enforce our intellectual property rights; and competition. In some cases, you can identify these statements by forward-looking words, such as “estimate,” “expect,” “anticipate,” “project,” “plan,” “intend,” “seek,” “believe,” “forecast,” “foresee,” “likely,” “may,” “should,” “goal,” “target,” “might,” “will,” “could,” “predict,” “continue,” “contingent,” and the negative or plural of these words, and other comparable terminology.\nForward-looking statements are only predictions based on our current expectations and our projections about future events. All forward-looking statements included in this Quarterly Report on Form 10-Q are based upon information available to us as of the filing date of the report and therefore speak only as of the filing date. You should not place undue reliance on these forward-looking statements. We undertake no obligation to update any of these forward-looking statements for any reason, whether as a result of new information, future developments, or otherwise. These forward-looking statements involve known and unknown risks, uncertainties, and other factors that may cause our actual results, levels of activity, performance, or achievements to differ materially from those expressed or implied by these statements. These factors include, but are not limited to:\n•\nstructural imbalances in global supply and demand for PV solar modules;\n•\nour competitive position and other key competitive factors;\n•\nthe modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications;\n•\nthe impact of public policies, such as tariffs, export controls, or other trade remedies imposed on solar cells and modules or related raw materials or equipment;\n•\nthe loss of any of our large customers, or the inability of our customers and counterparties to perform under their contracts with us, including through terminations by customers of any contract in part or in full;\n•\nour ability to attract new customers and to develop and maintain existing customer and supplier relationships;\n•\ninterest rate fluctuations and our customers’ ability to secure financing;\n31\nTable of Contents\n•\nour ability to execute on our long-term strategic plans, including our ability to secure financing and realize the potential benefits of strategic acquisitions and investments;\n•\nour ability to execute on our solar module technology and cost reduction roadmaps;\n•\nclaims under our limited warranty obligations;\n•\nour continued investments in R&D;\n•\nour ability to incorporate technology improvements into our manufacturing process, including the implementation of our copper replacement (“CuRe”) program;\n•\nour ability to improve the wattage of our solar modules;\n•\nour ability to construct new production facilities to support new product lines;\n•\nthe supply and price of key raw materials (including CdTe, tellurium, and tellurium compounds), components, and manufacturing equipment;\n•\nsupply chain disruptions;\n•\nour ability to avoid manufacturing interruptions, including during the ramp of new manufacturing facilities;\n•\nfuture collection and recycling costs for solar modules covered by our module collection and recycling program, or otherwise as required by external laws and regulations;\n•\nour ability to protect or successfully commercialize our intellectual property;\n•\nenvironmental responsibility, including with respect to CdTe and other semiconductor materials;\n•\nchanges in, or the failure to comply with, government regulations and environmental, health, and safety requirements;\n•\nevolving corporate governance and public disclosure regulations and expectations, including with respect to environmental, social, and governance matters;\n•\neffects arising from and results of pending litigation;\n•\ngeneral economic and business conditions, including those influenced by U.S., international, and geopolitical events and conflicts;\n•\nour ability to prevent and/or minimize the impact of cybersecurity incidents or information or security breaches;\n•\nthe severity and duration of public health threats;\n•\nour ability to attract, train, retain, and successfully integrate key talent into our team; and\n•\nall other matters discussed in Item 1A. “Risk Factors” of our Annual Report on Form 10-K for the year ended December 31, 2024, elsewhere in this Quarterly Report on Form 10-Q, and our other reports filed with the SEC.\nYou should carefully consider the risks and uncertainties described in this section. The following discussion and analysis of our business, financial condition, and results of operations should be read in conjunction with our condensed consolidated financial statements and the related notes thereto included in this Quarterly Report on Form 10-Q.\n32\nTable of Contents\nExecutive Overview\nWe are America’s leading PV solar technology and manufacturing company. The only U.S.-headquartered company among the world’s largest solar manufacturers, First Solar is focused on competitively and reliably enabling power generation needs with our advanced, thin film PV technology. Developed at R&D labs in California and Ohio, our technology represents the next generation of solar power generation, providing a competitive, high-performance, and responsibly produced alternative to conventional crystalline silicon PV solar modules. Our PV solar modules are produced using a fully integrated, continuous process that does not rely on Chinese crystalline silicon supply chains.\nWe are the world’s largest thin film PV solar module manufacturer and the largest PV solar module manufacturer in the Western Hemisphere. We recently commenced operations at our fourth and fifth manufacturing facilities in the United States and completed the expansion of our manufacturing footprint at our existing facilities in Ohio. Our global footprint spans the United States, India, Malaysia, and Vietnam.\nCertain of our financial results and other key operational developments for the three months ended September\n \n30,\n \n2025 include the following:\n•\nNet sales for the three months ended September 30, 2025 increased by 79.7% to $1.6 billion compared to $0.9 billion for the same period in 2024. The increase was primarily due to a 79.1% increase in the volume of modules sold to third parties and the prior period reduction in revenue related to manufacturing issues affecting certain Series 7 modules manufactured in 2023 and 2024.\n•\nDuring the three months ended September 30, 2025, we terminated various master supply agreements with a major oil and gas customer due to the customer’s failure to cure several breaches of its contractual obligations. These terminations triggered certain contractual termination payment provisions amounting to $384.6 million, of which we recognized $61.0 million as revenue for the advance payments previously received from the customer. In September 2025, we filed a complaint with the Supreme Court of the State of New York seeking relief and demanding payment from the customer for the remaining termination payments along with certain other receivables for solar modules previously delivered to the customer.\n•\nGross profit as a percentage of net sales for the three months ended September 30, 2025 decreased 11.9 percentage points to 38.3% from 50.2% for the same period in 2024. The decrease was primarily due to higher logistics, detention, and demurrage charges; a lower sales mix of modules qualifying for the advanced manufacturing production credit under Section 45X of the IRC; and, as a percentage of net sales, lower relative revenue associated with certain customer contract terminations; partially offset by the prior period reduction in revenue related to manufacturing issues affecting certain Series 7 modules manufactured in 2023 and 2024.\n•\nDuring the three months ended September 30, 2025, we commenced production of Series 7 modules at our new manufacturing facility in Louisiana, bringing our total installed nameplate production capacity across all our facilities to approximately 23.5 GW. During the three months ended September 30, 2025, we produced 3.6 GW and sold 5.3 GW of solar modules.\n•\nIn July 2025, we entered into an agreement for the sale of up to $391.0 million of Section 45X tax credits we expect to generate during 2025 for aggregate cash proceeds of up to $372.8 million. We received initial cash proceeds of $123.5 million and $124.2 million in July and October 2025, respectively, and we expect to receive the remaining cash proceeds in the fourth quarter of 2025.\n33\nTable of Contents\nMarket Overview\nSolar energy is one of the fastest growing forms of renewable energy with numerous benefits, including economic benefits and speed of deployment, which make it an attractive complement to or substitute for traditional forms of energy generation. In recent years, the cost of producing electricity from PV solar power systems has decreased to levels that are competitive with or below the wholesale price of electricity in many markets. Other technological developments in the renewable energy industry, such as the advancement of energy storage capabilities, have further enhanced the prospects of solar energy as an alternative to traditional forms of energy generation. As a result of these and other factors, worldwide solar markets continue to develop and expand.\nGovernment incentive programs have contributed to this momentum by providing solar module manufacturers, project developers, and project owners with various incentives to accelerate the deployment of solar power generation. Although we compete in markets that do not require solar-specific government incentive programs, our net sales and profits remain subject to variability based on the availability and size of these programs, including tax and production incentives, renewable portfolio standards, and other incentive programs intended to stimulate economies, achieve decarbonization initiatives, and/or establish greater energy independence. Such programs continue to influence the demand for PV solar energy around the world.\nSupply and Demand\nAs a result of the market opportunities described above, we recently commenced operations at our fourth and fifth manufacturing facilities in the United States and completed the expansion of our manufacturing footprint at our existing facilities in Ohio. We believe manufacturers of solar cells and modules, particularly those in China, have significant installed production capacity, relative to global demand, and the ability for additional capacity expansion. Accordingly, we believe the solar industry may experience periods of structural imbalance between supply and demand, which could lead to periods of pricing volatility. Further, demand for solar energy in key markets, such as the United States and India, may be affected by the nature and extent of commitments to the renewable energy transition at the local and global levels. Notwithstanding these considerations, utility and corporate demand for energy and overall electric load growth, especially as a result of artificial intelligence-driven data center demand, continue to increase. Further, even on an unsubsidized basis, utility-scale PV solar is cost competitive with conventional forms of energy generation, including natural gas and nuclear, and is significantly faster to deploy than a five-year natural gas project development timeline or a much longer nuclear project timeline.\nInternationally, given the combination of (i) a European market captured by Chinese solar modules, where pricing is at levels near or below manufacturing costs, (ii) an Indian market effectively closed to Southeast Asian products, (iii) a general supply and demand imbalance for Southeast Asian products, and (iv) certain tariffs on modules imported into the United States, we have reduced production of Series 6 modules at our international manufacturing facilities. \nIn light of these market realities, we continue to advocate for industrial policies that provide a level playing field for domestic manufacturers of solar cells and modules. We also continue to focus on our strategies and points of differentiation, which include our advanced module technology, our manufacturing process and distributed manufacturing presence, our localized supply chain, our R&D capabilities, our commitment to responsible solar, and our financial stability.\n34\nTable of Contents\nPricing Competition\nThe solar industry continues to be characterized by intense pricing competition, both at the module and system levels. This competition may result in an environment in which pricing falls rapidly, which could potentially increase demand for solar energy solutions but constrain the ability for module manufacturers and project developers to sustain meaningful and consistent profitability. Our results of operations could be adversely affected if competitors reduce pricing below their costs, bid aggressively low prices for module sale agreements, or are able to operate at minimal or negative operating margins for sustained periods of time. For certain of our competitors, including many in China, these practices may be enabled by their direct or indirect access to sovereign capital or other forms of state support. Module average selling prices in many global markets have declined. However, recent module pricing in the United States, our primary market, has remained relatively stable due, in part, to the rising demand for domestically manufactured modules as a result of the IRA and tariffs on modules imported into the United States.\nDiverse Offerings\nWe face intense competition from manufacturers of crystalline silicon solar modules and other emerging technologies. Solar module manufacturers compete with one another on sales price per watt, which may be influenced by several module value attributes, including energy yield, wattage (through a larger form factor or an improved conversion efficiency), degradation, sustainability, and reliability. Sales price per watt may also be influenced by warranty terms, customer payment terms, and/or module attributes. We believe that utility-scale solar will continue to be a compelling offering and will continue to represent an increasing portion of the overall electricity generation mix. However, this focus on utility-scale module offerings exists within a current market environment that includes rooftop and distributed generation solar, which may influence our future offerings.\nWe continue to devote significant resources to support the implementation of our technology roadmap and improve the energy output of our modules. In the course of our R&D activities, we explore various technologies in our efforts to sustain competitive differentiation of our modules. Such technologies include the development of bifacial modules, the implementation of our CuRe program, and the ongoing research and development of a viable and commercially scalable perovskite product.\n•\nBifacial\n. While conventional solar modules are monofacial, meaning their ability to produce energy is a function of direct and diffuse irradiance on their front side, most module manufacturers offer bifacial modules that also capture diffuse irradiance on the back side of a module. Bifaciality compromises nameplate efficiency, but by converting both front and rear side irradiance, such technology may improve the overall energy production of a module relative to nameplate efficiency when applied in certain applications, which could lower the overall levelized cost of electricity (“LCOE”) of a system when compared to systems using monofacial solar modules. Our bifacial module features an innovative transparent back contact, which, in addition to converting both front and rear side irradiance, allows infrared light to pass through rather than be absorbed as heat. This design lowers the operational temperature of the module, resulting in a higher energy yield.\n•\nCuRe\n. Our CuRe program is intended to improve our current semiconductor structure by replacing copper with certain other elements that are expected to enhance module performance by improving its bifaciality characteristics, improving its temperature coefficient, and improving its warranted degradation. As a result of these performance improvements, our PV solar modules are expected to produce more energy in real world operating conditions over their estimated useful lives than crystalline silicon modules with the same nameplate capacity. In late 2024, we commenced a limited commercial production run of modules employing our CuRe technology, and during the first half of 2025, we sold our first CuRe modules to customers. Beginning in early 2026, we intend to initiate a phased replication of the technology across certain manufacturing facilities within our fleet.\n35\nTable of Contents\n•\nPerovskite\n. We continue to research and develop our thin-film semiconductor technology, with a focus on the use of perovskite thin films. Perovskites have the potential to significantly increase the efficiency and reduce the cost of PV solar modules either through single-junction or potentially multi-junction devices. Supported by the associates at our California and European Technology Centers, we continue to advance our work on improving both the efficiency and stability of this technology in developing a viable and commercially scalable perovskite product. Our investment in this technology also includes the construction of a dedicated perovskite development line at our Ohio facility.\nProduct Efficiencies\nThe efficiencies gained from the vertical integration of our manufacturing model and our cost management initiatives allow us to compete favorably in markets where pricing for modules and systems is highly competitive. Our cost competitiveness is based in large part on our advanced thin film semiconductor technology, module wattage, proprietary manufacturing process (which enables us to produce a CdTe module in a matter of hours using a continuous and highly automated industrial manufacturing process, as opposed to a batch process), and focus on operational excellence. In addition, our CdTe modules use approximately 2% to 3% of the amount of semiconductor material that is used to manufacture conventional crystalline silicon solar modules. The cost of polysilicon is a significant driver of the manufacturing cost of crystalline silicon solar modules, and the timing and rate of change in the cost of silicon feedstock and polysilicon could lead to changes in solar module pricing levels.\nEnergy Performance\nIn many climates, our solar modules provide certain energy production advantages relative to competing crystalline silicon solar modules.\n As a result, our solar modules can produce more energy in real-world operating conditions than conventional crystalline silicon modules with the same nameplate capacity. Additionally, we generally warrant that our solar modules will produce at least 98% of their labeled power output rating during the first year, with the warranty coverage reducing by a degradation factor that is generally between 0.3% and 0.5%, depending on the module series, every year thereafter throughout the limited power output warranty period of up to 30 years.\nWhile our modules are generally competitive in cost, reliability, and performance attributes, there can be no guarantee such competitiveness will continue to exist in the future to the same extent, or at all. Any declines in the competitiveness of our products could result in further declines in the average selling prices of our modules and additional margin compression. Accordingly, we continue to focus on enhancing the competitiveness of our solar modules through our module technology and cost reduction roadmaps.\nCertain Trends and Uncertainties\nWe believe that our business, financial condition, and results of operations may be favorably or unfavorably impacted by the following trends and uncertainties. See Part II. “Other Information” Item 1A. “Risk Factors” for discussion of other risks (the “Risk Factors”) that may affect us.\nOur business is evolving worldwide and is shaped by the varying ways in which our offerings can be compelling and economically viable solutions to energy needs in our key markets. In addressing electricity demands, we are focused on providing utility-scale module offerings in markets that we believe have a significant need for mass-scale PV solar electricity, including markets primarily in the United States and India. We closely evaluate and monitor the appropriate level of resources required to support such markets and their associated sales opportunities. When deployed in utility-scale applications, our modules provide energy at a lower LCOE compared to traditional forms of energy generation.\n36\nTable of Contents\nDemand for our PV solar modules depends, in part, on certain factors outside our control. For example, many governments have proposed or enacted policies or incentive programs intended to encourage renewable energy investments to achieve decarbonization objectives and/or establish greater energy independence. While we compete in markets that do not require solar-specific government subsidies or incentive programs, our net sales and profits remain subject to variability based on the availability and size of government subsidies and economic incentives. Adverse changes in these factors could increase the cost of utility-scale systems, which could reduce demand for our solar modules. Recent developments to government incentive programs include the following:\n•\nUnited States.\n In August 2022, the previous U.S. President signed the IRA into law, which was intended to accelerate the country’s ongoing transition to clean energy. Among other things, the financial incentives provided by the IRA have significantly increased demand for modules manufactured in the United States. We expect to qualify for the advanced manufacturing production credit under Section 45X of the IRC, which provides certain specified benefits for solar modules and solar module components manufactured in the United States and sold to third parties. However, the current U.S. presidential administration and control of the U.S. Congress present uncertainty as to the continued availability of certain benefits. For example, on January 20, 2025, the U.S. President issued the executive order entitled, “Unleashing American Energy,” which, among other things, indicated a lack of support for federal funding of certain solar and solar-related projects. Further, on July 4, 2025, the U.S. President signed H.R.1 into law, commonly referred to as the “One Big Beautiful Bill,” which significantly curtails the availability of certain energy tax credits. H.R.1 includes accelerating the termination of the clean electricity Investment Tax Credit (“ITC”) and Production Tax Credit (“PTC”) in relation to solar and restricting tax credits if a taxpayer employs certain products and components produced by a supplier with ties to a foreign entity of concern (“FEOC”). H.R.1 also severely limits Section 45X tax credit eligibility for products manufactured by, or with material assistance from, a FEOC.\n•\nIndia\n. In March 2023, the government of India allocated financial incentives under the Production Linked Incentive (“PLI”) scheme to certain PV module manufacturers, including First Solar. The PLI scheme is expected to provide aggregate funding of INR 185 billion ($2.1 billion) to certain PV module manufacturers, of which INR 11.8 billion ($133 million) was allocated to First Solar, to promote the manufacturing of high efficiency solar modules in India and to reduce India’s dependency on foreign imports of solar modules. Under the PLI scheme, manufacturers were selected through a competitive bid process and may be entitled to receive certain cash incentives over a five-year period following the commissioning of their manufacturing facilities. Among other things, such incentives are subject to attaining certain minimum thresholds for module efficiency and temperature coefficient and require that a certain proportion of raw materials be sourced from the domestic market. Such conditions will be evaluated on a quarterly basis from 2026 through 2031. At this time, it is uncertain to what extent we may qualify for such incentives.\n37\nTable of Contents\nDemand for our PV solar modules also depends on domestic or international trade policies and government regulations, which may be proposed, revised, and/or enacted across short- and long-term time horizons with varying degrees of impact to our net sales, profit, and manufacturing operations. Changes in these policies and regulations could adversely impact the competitive landscape of solar markets, which could reduce demand for our solar modules. Recent revisions or proposed changes to trade policy and government regulations include the following:\n•\nUnited States\n. In April 2025, the U.S. President imposed a 10% “baseline” reciprocal tariff on nearly all U.S. trading partners, and additional, higher reciprocal tariffs on certain countries. Effective May 14, 2025, the United States entered into an agreement with China to lower the reciprocal tariff rate to 10% for 90 days. This agreement was extended for an additional 90 days on August 12, 2025. On July 2, 2025, the U.S. President announced that the United States and Vietnam had reached a preliminary trade agreement, which placed a 20% tariff on all products of Vietnam and a 40% tariff on all “transshipped” goods. On July 31, 2025, the U.S. President issued an executive order detailing new reciprocal tariff rates specific to individual countries. All countries not listed in the announcement remain subject to a 10% “baseline” reciprocal tariff except for Canada, Mexico, North Korea, Russia, and Belarus. As it pertains to the countries where we manufacture solar modules, reciprocal tariff rates apply to Vietnam (20%), India (25%), and Malaysia (19%). The executive order also imposes an additional duty of 40% instead of the reciprocal tariff that would normally apply for any article that U.S. Customs and Border Protection determines has been transshipped to evade the reciprocal tariffs. Effective August 27, 2025, the U.S. President imposed an additional 25% tariff on India over its purchases of Russian oil, resulting in an overall rate of 50%. For more information about this development, see Part II. “Other Information” Item 1A. “Risk Factors – The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.”\n•\nUnited States.\n Effective June 4, 2025, the U.S. President increased tariffs on imported aluminum and steel articles under Section 232 of the Trade Expansion Act of 1962 (“Section 232”) from 25% to 50%. Effective August 1, 2025, the U.S. President imposed tariffs of 50% on copper under Section 232. Effective October 14, 2025, the U.S. President imposed tariffs of 10% on imported softwood timber and lumber products under Section 232. Further, on April 22, 2025, the U.S. Secretary of Commerce initiated an investigation to determine the effects on the national security of imports of processed critical minerals, as well as their derivative products, under Section 232; on July 1, 2025, the U.S. Secretary of Commerce initiated a Section 232 investigation to determine whether imports of polysilicon and its derivatives impair U.S. national security; and on September 2, 2025, the U.S. Secretary of Commerce initiated an investigation to determine the effects on the national security of imports of robotics and industrial machinery under Section 232. For more information about the context of these developments, see Part II. “Other Information” Item 1A. “Risk Factors – The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.”\n38\nTable of Contents\n•\nChina.\n In February 2025, China announced that it would tighten export controls for five key minerals, including products containing tellurium, which is one of the main components of our CdTe modules. Although tellurium and products containing tellurium are sourced globally, China is a major global producer of tellurium and products containing tellurium. Exporters of tellurium and related products are generally required to obtain a license from the Chinese Ministry of Commerce. In October 2025, China expanded its rare earths export controls, adding new minerals to its restricted list and requiring foreign entities to obtain a license to export any products containing over 0.1% of rare earths from China or manufactured using China’s extraction, refining, magnet-making, or recycling technology. Since these export controls came into effect, we have assembled a cross-functional team to interpret the export controls and analyze how they may impact materials required for our module production. We have applied for and intend to continue applying for export licenses where appropriate, as well as continuing to implement other strategic alternatives, such as sourcing from other suppliers to mitigate potential adverse impacts from these export controls.\n•\nUnited States.\n In April 2024, the American Alliance for Solar Manufacturing Trade Committee, which includes First Solar, filed a set of antidumping and countervailing duty (“AD/CVD”) petitions with the U.S. Department of Commerce (“USDOC”) and the U.S. International Trade Commission (“USITC”) to impose duties on certain unfairly traded solar products from Cambodia, Malaysia, Thailand, and Vietnam. Following final affirmative determinations by the USDOC and USITC that identified final subsidy rates of 534.67% to 3,403.96% for Cambodia, 14.64% to 168.8% for Malaysia, 263.74% to 799.55% for Thailand, and 68.15% to 542.64% for Vietnam, AD/CVD orders, including the assessment of countervailing duties and suspension of liquidation of such products, were issued on June 9, 2025. On July 17, 2025, the Alliance for American Solar Manufacturing and Trade filed another set of AD/CVD petitions with the USDOC and the USITC to impose duties on unfairly traded crystalline silicon solar products from India, Indonesia, and Laos. In addition to a range of alleged illegal subsidies, the petitioners identified dumping margins of 213.96% for India, 89.65% for Indonesia, and 245.79 to 249.09% for Laos. For more information about this development, see Part II. “Other Information” Item 1A. “Risk Factors – The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.”\n39\nTable of Contents\n•\nIndia\n. The Approved List of Models and Manufacturers (“ALMM”) was introduced in 2021 as a non-tariff barrier to incentivize domestic manufacturing of PV modules by approving the list of models and manufacturers who can participate in certain solar development projects. The ALMM is approved by the Ministry of New and Renewable Energy (“MNRE”), and any modifications to the ALMM and its application may affect future investments in solar module manufacturing in India. For example, in December 2024, the ALMM was amended to require nearly all solar development projects to use PV modules that contain domestically manufactured solar cells, which is expected to be effective for such projects completed on or after June 2026; in August 2025, the relevant list of qualifying entities was released, which included First Solar as an approved manufacturer. Further, in September 2025, the MNRE released draft amendments that would require nearly all solar development projects to use PV modules that contain domestically manufactured wafers, which is expected to be effective for such projects completed on or after June 2028; the proposed list was released at that time, which included First Solar as an approved manufacturer. For more information about the ALMM, see Part II. “Other Information” Item 1A. “Risk Factors – The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.”\nOur ability to provide solar modules on economically attractive terms is also affected by the availability and cost of logistics services associated with the procurement of raw materials or equipment used in our manufacturing process and the shipping, handling, storage, and distribution of our modules. To mitigate certain logistics costs, we employ commercial contract structures that provide additional consideration to us if the cost of logistics services, excluding demurrage and detention, exceeds defined thresholds. We may also adjust our shipping plans to include additional lead times for module deliveries and/or use our network of U.S. distribution centers to mitigate logistics costs. Additionally, our manufacturing capacity expansions are expected to bring production activities closer to customer demand, further mitigating our exposure to the cost of ocean freight.\nWe generally price and sell our solar modules on a per watt basis. As of September 30, 2025, we had entered into contracts with customers for the future sale of 53.7 GW of solar modules for an aggregate transaction price of $\n16.4\n billion, which we expect to recognize as revenue through 2030 as we transfer control of the modules to our customers. This volume and transaction price exclude contracts with customers in India for which payment has not been fully secured. This volume includes contracts for the sale of 23.6 GW of solar modules with anticipated price adjustments for future module technology improvements, including enhancements to certain energy related attributes. Based on these potential improvements, the contracted module volume as of September 30, 2025, the expected timing of such improvements being incorporated into our manufacturing process, and the expected timing of module deliveries, such adjustments, if realized, could result in additional revenue of up to $0.6 billion, the majority of which would be recognized in 2027 and 2028. In addition to these price adjustments, certain of our contracts with customers may include favorable price adjustments associated with sales freight in excess of defined thresholds and/or favorable or unfavorable price adjustments associated with changes to (i) certain commodity prices, (ii) the module wattage committed for delivery, (iii) the volume of modules sold that meet certain U.S. domestic content requirements, and (iv) certain tariff structures within a defined threshold. As a result, the revenue recognized from such contracts may increase or decrease in future periods relative to the original transaction price.\n40\nTable of Contents\nWhile our contracts with customers typically have certain firm purchase commitments and may require our customers to make payments to us if a contract is terminated in certain circumstances, those contract terms have in the past and may in the future be breached by our customers or subject to renegotiation. Among other things, these contract breaches and renegotiations have and may continue to reduce the volume of modules sold under the relevant contracts and/or the extent of anticipated price adjustments for future module technology improvements, therefore reducing future sales of solar modules. Furthermore, our ability to subsequently resell solar modules sold under terminated and/or renegotiated contracts may be constrained, such as by the project lead times of our customers, under-allocation of certain solar modules, and other factors. For example, on September 30, 2025, First Solar filed a complaint in the Supreme Court of the State of New York seeking monetary damages asserting that a certain major oil and gas customer breached its contractual obligations with First Solar, having entered into various master supply agreements to purchase solar modules from First Solar and then refusing to pay the amounts owed under the purchase orders. For more information about this development, see Part II. “Other Information” Item 1. “Legal Proceedings.”\nWe monitor our modules’ expected performance through quality and reliability testing, as well as actual performance in certain field installation sites. Any declines in the expected performance attributes of our modules could adversely impact our financial results due to declines in the average selling prices of our modules and additional margin compression. For example, the recently identified manufacturing issues affecting certain Series 7 modules may adversely impact the average selling prices of our modules or the carrying value of our inventories. These manufacturing issues may also increase product warranty claims by our customers to resolve the premature power loss in affected modules. Any future manufacturing issues, including any additional commitment made by us to remediate the affected modules beyond our limited warranty, could also adversely impact our reputation, financial position, operating results, and cash flows. We may also be subject to certain other risks and uncertainties surrounding module performance as described in Item 1A. “Risk Factors” of our Annual Report on Form 10-K for the year ended December 31, 2024.\nWe continue to increase the nameplate production capacity of our existing manufacturing facilities by improving our production throughput, increasing module wattage, and reducing manufacturing yield losses. Additionally, we are in the process of expanding our domestic manufacturing capacity, which includes capacity expansions at certain existing facilities. This additional capacity, and any other potential investments to add to or otherwise modify our existing manufacturing capacity in response to market demand and competition, may require significant internal and possibly external sources of capital, and may be subject to certain risks and uncertainties described in Item 1A. “Risk Factors” of our Annual Report on Form 10-K for the year ended December 31, 2024.\n41\nTable of Contents\nResults of Operations\nThe following table sets forth our condensed consolidated statements of operations as a percentage of net sales for the three and nine months ended September 30, 2025 and 2024:\nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n2025\n2024\n2025\n2024\nNet sales\n100.0 \n%\n100.0 \n%\n100.0 \n%\n100.0 \n%\nCost of sales\n61.7 \n%\n49.8 \n%\n58.9 \n%\n52.1 \n%\nGross profit\n38.3 \n%\n50.2 \n%\n41.1 \n%\n47.9 \n%\nSelling, general and administrative\n3.0 \n%\n5.2 \n%\n4.3 \n%\n5.2 \n%\nResearch and development\n3.8 \n%\n5.7 \n%\n4.7 \n%\n5.4 \n%\nProduction start-up\n2.3 \n%\n3.0 \n%\n2.4 \n%\n2.6 \n%\nLitigation loss\n— \n%\n— \n%\n— \n%\n— \n%\nGain on sales of businesses, net\n— \n%\n— \n%\n— \n%\n— \n%\nOperating income\n29.2 \n%\n36.3 \n%\n29.7 \n%\n34.8 \n%\nForeign currency loss, net\n(0.6)\n%\n(0.6)\n%\n(0.9)\n%\n(0.7)\n%\nInterest income\n1.5 \n%\n2.5 \n%\n1.5 \n%\n2.8 \n%\nInterest expense, net\n(0.9)\n%\n(1.0)\n%\n(0.9)\n%\n(1.0)\n%\nOther expense, net\n(0.4)\n%\n(0.3)\n%\n(0.3)\n%\n(0.2)\n%\nIncome tax expense\n(0.3)\n%\n(1.6)\n%\n(0.6)\n%\n(2.3)\n%\nNet income\n28.6 \n%\n35.3 \n%\n28.5 \n%\n33.4 \n%\nSegment Overview\nFirst Solar operates as one business, which involves the design, manufacture, and sale of CdTe solar modules, which convert sunlight into electricity. As such, we operate as a single operating segment. Third-party customers of this segment include system developers, independent power producers, utilities, commercial and industrial companies, and other system owners and operators.\nNet Sales\nDuring the three and nine months ended September 30, 2025, we sold the majority of our solar modules to developers and operators of systems in the United States, and substantially all of our module sales were denominated in U.S. dollars. We recognize revenue for module sales at a point in time following the transfer of control of the modules to the customer, which typically occurs upon delivery of the modules to the location specified in the terms of the underlying contract.\nThe following table shows net sales for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nNet sales\n$\n1,594,856 \n$\n887,668 \n$\n707,188 \n79.7 \n%\n$\n3,536,594 \n$\n2,692,258 \n$\n844,336 \n31.4 \n%\nNet sales increased $707.2 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to a 79.1% increase in the volume of modules sold to third parties and the prior period reduction in revenue related to manufacturing issues affecting certain Series 7 modules manufactured in 2023 and 2024.\n42\nTable of Contents\nNet sales increased $844.3 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to a 30.3% increase in the volume of modules sold to third parties, an increase of $49.8 million in revenue associated with certain customer contract terminations, and the prior period reduction in revenue for the manufacturing issues discussed above.\nCost of Sales\nOur cost of sales includes the cost of raw materials and components for manufacturing solar modules, such as glass, transparent conductive coatings, CdTe and other thin film semiconductors, laminate materials, connector assemblies, edge seal materials, and frames or back rails. In addition, our cost of sales includes direct labor for the manufacturing of solar modules and manufacturing overhead, such as engineering, equipment maintenance, quality and production control, and information technology. Our cost of sales also includes depreciation of manufacturing plant and equipment, facility-related expenses, environmental health and safety costs, and costs associated with shipping, logistics, warranties, and solar module collection and recycling (excluding accretion).\nThe following table shows cost of sales for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nCost of sales\n$\n984,111 \n$\n442,357 \n$\n541,754 \n122.5 \n%\n$\n2,081,596 \n$\n1,402,055 \n$\n679,541 \n48.5 \n%\n% of net sales\n61.7 \n%\n49.8 \n%\n \n \n58.9 \n%\n52.1 \n%\nCost of sales increased $541.8 million, or 122.5%, and increased 11.9 percentage points as a percent of net sales for the three months ended September 30, 2025 compared to the three months ended September 30, 2024. The increase in cost of sales was primarily driven by (i) higher production costs of $453.3 million due to an increase in the volume of modules sold, (ii) higher logistics costs of $121.9 million, which includes tariffs, detention, and demurrage charges; and (iii) higher module storage costs of $43.8 million. These increases were partially offset by (iv) a higher volume of modules sold qualifying for the advanced manufacturing production credit under Section 45X of the IRC, which decreased cost of sales by $130.2 million.\nCost of sales increased $679.5 million, or 48.5%, and increased 6.8 percentage points as a percent of net sales for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. The increase in cost of sales was primarily driven by (i) higher production costs of $532.2 million due to an increase in the volume of modules sold; (ii) higher logistics costs of $248.9 million, which includes tariffs, detention, and demurrage charges; (iii) higher production costs of $113.7 million, largely due to a higher sales mix of U.S.-produced modules; and (iv) higher module storage costs of $99.0 million. These increases were partially offset by (v) a higher volume of modules sold qualifying for the advanced manufacturing production credit under Section 45X of the IRC, which decreased cost of sales by $355.5 million.\nGross Profit\nGross profit may be affected by various factors, including the selling prices of our modules, our manufacturing costs, the capacity utilization of our manufacturing facilities, and foreign exchange rates.\nThe following table shows gross profit for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nGross profit\n$\n610,745 \n$\n445,311 \n$\n165,434 \n37.2 \n%\n$\n1,454,998 \n$\n1,290,203 \n$\n164,795 \n12.8 \n%\n% of net sales\n38.3 \n%\n50.2 \n%\n \n \n41.1 \n%\n47.9 \n%\n43\nTable of Contents\nGross profit as a percentage of net sales decreased 11.9 percentage points to 38.3% during the three months ended September 30, 2025 from 50.2% during the three months ended September 30, 2024. The decrease was primarily due to (i) higher logistics, detention, and demurrage charges; (ii) a lower sales mix of modules qualifying for the advanced manufacturing production credit under Section 45X of the IRC; and (iii) as a percentage of net sales, lower relative revenue associated with certain customer contract terminations. These decreases in gross profit were partially offset by (iv) the prior period reduction in revenue related to manufacturing issues affecting certain Series 7 modules manufactured in 2023 and 2024.\nGross profit as a percentage of net sales decreased 6.8 percentage points to 41.1% during the nine months ended September 30, 2025 from 47.9% during the nine months ended September 30, 2024. The decrease was primarily due to (i) higher logistics, detention, and demurrage charges; (ii) higher costs related to a sales mix that included more U.S.-produced modules; and (iii) higher warehousing costs. These decreases in gross profit were partially offset by (iv) the recognition of the higher advanced manufacturing production credits under Section 45X of the IRC and (v) the prior period reduction in revenue for the manufacturing issues described above.\nSelling, General and Administrative\nSelling, general and administrative expense consists primarily of salaries and other personnel-related costs, professional fees, insurance costs, and other business development and selling expenses.\nThe following table shows selling, general and administrative expense for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nSelling, general and administrative\n$\n47,324 \n$\n46,293 \n$\n1,031 \n2.2 \n%\n$\n153,078 \n$\n138,680 \n$\n14,398 \n10.4 \n%\n% of net sales\n3.0 \n%\n5.2 \n%\n \n \n4.3 \n%\n5.2 \n%\nSelling, general and administrative expense for the three months ended September 30, 2025 was consistent with the three months ended September 30, 2024.\nSelling, general and administrative expense for the nine months ended September 30, 2025 increased compared to the nine months ended September 30, 2024 \nprimarily due to (i) higher expected credit losses from an increase in accounts receivable and (ii) \nhigher costs for certain legal matters.\nResearch and Development\nResearch and development expense consists primarily of salaries and other personnel-related costs; the cost of products, materials, and outside services used in our R&D activities; and depreciation and amortization expense associated with R&D specific facilities and equipment. We maintain a number of programs and activities to improve our technology and processes in order to enhance the performance and reduce the costs of our solar modules.\nThe following table shows research and development expense for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nResearch and development\n$\n60,592 \n$\n50,197 \n$\n10,395 \n20.7 \n%\n$\n167,468 \n$\n144,876 \n$\n22,592 \n15.6 \n%\n% of net sales\n3.8 \n%\n5.7 \n%\n \n \n4.7 \n%\n5.4 \n%\n44\nTable of Contents\nResearch and development expense for the three months ended September 30, 2025 increased compared to the three months ended September 30, 2024 primarily due to (i) higher depreciation expense resulting from our significant investments in R&D facilities and equipment, (ii) higher employee compensation expense resulting from an increase in headcount and \nhigher bonus expense, and (iii) higher utility charges\n.\nResearch and development expense for the nine months ended September 30, 2025 increased compared to the nine months ended September 30, 2024 primarily due to (i) higher depreciation expense resulting from our significant investments in R&D facilities and equipment, (ii) higher employee compensation expense resulting from an increase in headcount and \nhigher bonus expense, and (iii) higher facility and utility charges\n, partially offset by (iv) a reduction in testing expense.\nProduction Start-Up\nProduction start-up expense consists of costs associated with operating a production line before it is qualified for commercial production, including the cost of raw materials for solar modules run through the production line during the qualification phase, employee compensation for individuals supporting production start-up activities, and applicable facility-related costs. Production start-up expense also includes costs related to the selection of a new site and implementation costs for manufacturing process improvements to the extent we cannot capitalize these expenditures.\nThe following table shows production start-up expense for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nProduction start-up\n$\n36,734 \n$\n26,822 \n$\n9,912 \n37.0 \n%\n$\n85,506 \n$\n69,681 \n$\n15,825 \n22.7 \n%\n% of net sales\n2.3 \n%\n3.0 \n%\n \n \n2.4 \n%\n2.6 \n%\nDuring the three and nine months ended September 30, 2025, we incurred production start-up expense primarily for our fifth manufacturing facility in the United States. During the three and nine months ended September 30, 2024, we incurred production start-up expense primarily for our fourth manufacturing facility in the United States.\nForeign Currency Loss, Net\nForeign currency loss, net consists of the net effect of gains and losses resulting from holding assets and liabilities and conducting transactions denominated in currencies other than our subsidiaries’ functional currencies.\nThe following table shows foreign currency loss, net for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nForeign currency loss, net\n$\n(8,903)\n$\n(5,158)\n$\n(3,745)\n72.6 \n%\n$\n(30,224)\n$\n(17,665)\n$\n(12,559)\n71.1 \n%\nForeign currency loss, net for the three months ended September 30, 2025 was consistent with the three months ended September 30, 2024.\nForeign currency loss, net for the nine months ended September 30, 2025 increased compared to the nine months ended September 30, 2024 largely due to higher costs associated with hedging activities related to our subsidiaries in India.\n45\nTable of Contents\nInterest Income\nInterest income is earned on our cash, cash equivalents, marketable securities, restricted cash, restricted cash equivalents, and restricted marketable securities. Interest income also includes interest earned from late customer payments.\nThe following table shows interest income for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nInterest income\n$\n23,308 \n$\n22,580 \n$\n728 \n3.2 \n%\n$\n54,273 \n$\n74,424 \n$\n(20,151)\n(27.1)\n%\nInterest income for the three months ended September 30, 2025 was consistent with the three months ended September 30, 2024.\nInterest income for the nine months ended September 30, 2025 decreased compared to the nine months ended September 30, 2024 due to lower balances of marketable securities and time deposits. These decreases were partially offset by higher interest earned on late customer payments.\nInterest Expense, Net\nInterest expense, net\n \nprimarily comprises interest incurred on debt. We may capitalize interest expense to our property, plant and equipment when such costs qualify for interest capitalization, which reduces the amount of net interest expense reported in any given period.\nThe following table shows interest expense, net\n \nfor the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nInterest expense, net\n$\n(14,121)\n$\n(9,008)\n$\n(5,113)\n56.8 \n%\n$\n(32,830)\n$\n(27,983)\n$\n(4,847)\n17.3 \n%\nInterest expense, net for the three and nine months ended September 30, 2025 increased compared to the three and nine months ended September 30, 2024 primarily due to the accretion of discounts on trade receivables factored with recourse, which are accounted for as secured borrowings.\nOther Expense, Net\nOther expense, net primarily comprises miscellaneous items and financing fees.\nThe following table shows other expense, net for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nOther expense, net\n$\n(6,034)\n$\n(3,071)\n$\n(2,963)\n96.5 \n%\n$\n(10,594)\n$\n(6,435)\n$\n(4,159)\n64.6 \n%\nOther expense, net for the three and nine months ended September 30, 2025 was consistent with the three and nine months ended September 30, 2024.\n46\nTable of Contents\nIncome Tax Expense\nIncome tax expense or benefit, deferred tax assets and liabilities, and liabilities for unrecognized tax benefits reflect our best estimate of current and future taxes to be paid. We are subject to income taxes in both the United States and numerous foreign jurisdictions in which we operate, principally Singapore, Malaysia, Vietnam, and India. Significant judgments and estimates are required to determine our consolidated income tax expense. The statutory federal corporate income tax rate in the United States is 21%, and the tax rates in Singapore, Malaysia, Vietnam, and India are 17%, 24%, 20%, and 17%, respectively. In Malaysia, we have been granted a long-term tax holiday, scheduled to expire in 2027, pursuant to which substantially all of our income earned in Malaysia is exempt from income tax, conditional upon our continued compliance with certain employment and investment thresholds. In Vietnam, we have been granted a long-term tax incentive, scheduled to expire at the end of 2036, pursuant to which income earned in Vietnam is subject to reduced tax rates, conditional upon our continued compliance with certain revenue and R&D spending thresholds.\nThe following table shows income tax expense for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Dollars in thousands)\n2025\n2024\nThree Month Change\n2025\n2024\nNine Month Change\nIncome tax expense\n$\n(4,402)\n$\n(14,386)\n$\n9,984 \n(69.4)\n%\n$\n(22,225)\n$\n(61,064)\n$\n38,839 \n(63.6)\n%\nEffective tax rate\n1.0 \n%\n4.4 \n%\n \n \n2.2 \n%\n6.4 \n%\nOur tax rate is affected by the advanced manufacturing production credit under Section 45X and recurring items such as tax rates in foreign jurisdictions and the relative amounts of income we earn in those jurisdictions. The rate is also affected by discrete items that may occur in any given period but are not consistent from period to period. During the nine months ended September 30, 2024, we reversed our position to indefinitely reinvest the accumulated earnings of a foreign subsidiary and recorded discrete tax expense of approximately $6 million.\nIncome tax expense for the three months ended September 30, 2025 decreased compared to the three months ended September 30, 2024 primarily due to (i) the relative amounts of advanced manufacturing production credits earned in each period and (ii) a discrete tax benefit associated with the acceptance of a filing position on an amended tax return in a foreign jurisdiction, partially offset by (iii) higher pretax income and (iv) higher losses in certain jurisdictions for which no tax benefit could be recorded.\nIncome tax expense for the nine months ended September 30, 2025 decreased compared to the nine months ended September 30, 2024 primarily due to (i) the relative amounts of advanced manufacturing production credits earned in each period, (ii) a discrete tax benefit associated with the acceptance of a filing position on an amended tax return in a foreign jurisdiction, and (iii) the prior year discrete tax expense associated with the reversal of our indefinite reinvestment assertion described above; partially offset by (iv) higher pretax income and (v) higher losses in certain jurisdictions for which no tax benefit could be recorded.\n47\nTable of Contents\nCritical Accounting Policies and Estimates\nIn preparing our condensed consolidated financial statements in conformity with U.S. GAAP, we make estimates and assumptions that affect the amounts of reported assets, liabilities, revenues, and expenses, as well as the disclosure of contingent liabilities. Some of our accounting policies require the application of significant judgment in the selection of the appropriate assumptions for making these estimates. By their nature, these judgments are subject to an inherent degree of uncertainty. We base our judgments and estimates on our historical experience, our forecasts, and other available information, as appropriate. We believe the judgments and estimates involved in accrued solar module collection and recycling, product warranties, and government grants have the greatest potential impact on our condensed consolidated financial statements. The actual results experienced by us may differ materially and adversely from our estimates. To the extent there are material differences between our estimates and the actual results, our future results of operations will be affected. For a description of the accounting policies that require the most significant judgment and estimates in the preparation of our condensed consolidated financial statements, refer to our Annual Report on Form 10-K for the year ended December 31, 2024. There have been no material changes to our accounting policies during the nine months ended September 30, 2025.\nRecent Accounting Pronouncements\nIn December 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n, which requires greater disaggregation of an entity’s income tax disclosures. Among other things, ASU 2023-09 requires entities to disclose (i) specific categories in the effective tax rate reconciliation; (ii) pretax income or loss from continuing operations, separated between domestic and foreign jurisdictions; (iii) income tax expense or benefit from continuing operations, separated by federal, state, and foreign jurisdictions; and (iv) income taxes paid to federal, state, and foreign jurisdictions. ASU 2023-09 is effective for public companies for annual periods beginning after December 15, 2024. We plan to present the expanded income tax disclosures in our consolidated financial statements for the year ending December 31, 2025.\nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement — Reporting Comprehensive Income — Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n, which requires additional disclosure of specific types of expenses included in the expense captions presented on the face of the income statement. ASU 2024-03 is effective for public companies for annual reporting periods beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027. Early adoption is permitted. The disclosure requirements will be applied on a prospective basis, with the option to apply retrospectively. We are currently evaluating the impact ASU 2024-03 will have on our associated disclosures.\n48\nTable of Contents\nLiquidity and Capital Resources\nAs of September 30, 2025, we believe that our cash, cash equivalents, marketable securities, cash flows from operating activities, and contracts with customers for the future sale of solar modules will be sufficient to meet our working capital and capital expenditure needs for at least the next 12 months. In addition, we have availability under our Revolving Credit Facility, which remains unused as of September 30, 2025, as well as various trade receivables factoring arrangements with financial institutions. To the extent we offer extended payment terms to customers, fail to collect trade receivables in a timely manner, or face other challenges in managing our working capital, we may be required to use our Revolving Credit Facility or other temporary sources of funding. As necessary, we also believe we will have adequate access to the capital markets. We monitor our working capital to ensure we have adequate liquidity, both domestically and internationally. We intend to maintain appropriate debt levels based upon cash flow expectations, our overall cost of capital, and expected cash requirements for operations, including near-term construction activities and purchases of manufacturing equipment for our newest manufacturing facilities in the United States. However, our ability to raise capital on terms commercially acceptable to us could be constrained if there is insufficient lender or investor interest due to company-specific, industry-wide, or broader market concerns. Any incremental debt financing could result in increased debt service expenses and/or restrictive covenants, which could limit our ability to pursue our strategic plans.\nAs of September 30, 2025, we had $2.0 billion in cash, cash equivalents, and marketable securities compared to $1.8 billion as of December 31, 2024. This increase was primarily driven by (i) higher cash receipts from module sales, including advance payments for future sales, (ii) receipts from trade receivables factoring, and (iii) proceeds from the sale of Section 45X tax credits, partially offset by (iv) increases in payments made to suppliers, (v) purchases of property, plant and equipment for our U.S. facilities, (vi) various operating expenditures, and (vii) certain advance payments for raw materials. As of September 30, 2025 and December 31, 2024, $388.1 million and $694.0 million of our cash, cash equivalents, and marketable securities, respectively, were held by our foreign subsidiaries and were primarily based in U.S. dollar and Indian Rupee denominated holdings. Our investment policy seeks to preserve our investment principal and maintain adequate liquidity to meet our cash flow requirements, while at the same time optimizing the return on our investments. Pursuant to such policy, we place our investments with a diversified group of high-quality financial institutions and limit the concentration of such investments with any one counterparty. We place significant emphasis on the creditworthiness of financial institutions and assess the credit ratings and financial health of our counterparty financial institutions when making investment decisions.\nWe use a variety of tax planning and financing strategies in an effort to ensure that our worldwide cash is available in the locations in which it is needed. If certain international funds were needed for our operations in the United States, we may be required to accrue and pay certain U.S. and foreign taxes to repatriate such funds. We maintain the intent and ability to permanently reinvest our accumulated earnings outside the United States, with the exception of certain subsidiaries for which applicable income taxes have been recorded as of September 30, 2025, but we may choose to reevaluate this intent in one or more jurisdictions in the future. In addition, changes to foreign government banking regulations may restrict our ability to move funds among various jurisdictions under certain circumstances, which could negatively impact our access to capital, resulting in an adverse effect on our liquidity and capital resources.\n49\nTable of Contents\nAlthough we compete in markets that do not require solar-specific government subsidies or incentive programs, such incentives continue to significantly influence the demand for PV solar energy around the world. Further, our net sales and profits remain subject to variability based on the availability and size of government subsidies and economic incentives. For example, the financial incentives provided by the IRA have significantly increased demand for modules manufactured in the United States, and we expect the benefits made available to us by the IRA to favorably impact our liquidity and capital resources in future periods. We expect to qualify for the advanced manufacturing production credit under Section 45X of the IRC, which provides certain specified benefits for solar modules and solar module components manufactured in the United States and sold to third parties. Such credit may be refundable by the IRS or transferable to a third party and is available from 2023 to 2032, subject to phase down beginning in 2030. Based on the current form factor of our modules, we believe we qualify for a credit of approximately 17 cents per watt for each module produced in the United States and sold to a third party. Accordingly, we expect the advanced manufacturing production credit will provide us with a significant source of funding throughout its remaining period. In December 2024, we entered into two agreements for the sale of $857.2 million of Section 45X tax credits we generated during 2024 for aggregate cash proceeds of $818.6 million. We received initial cash proceeds of $616.0 million in December 2024 and received the remaining cash proceeds of $202.6 million in February 2025. In June 2025, we entered into an agreement for the sale of $311.9 million of Section 45X tax credits we generated during 2025 for aggregate cash proceeds of $296.3 million. We received the full cash proceeds in June 2025. In July 2025, we entered into an agreement for the sale of up to $391.0 million of Section 45X tax credits we expect to generate during 2025 for aggregate cash proceeds of up to $372.8 million. We received initial cash proceeds of $123.5 million and $124.2 million in July and October 2025, respectively, and we expect to receive the remaining cash proceeds in the fourth quarter of 2025. For more information about certain risks associated with the benefits available to us under the IRA, see Part II. “Other Information” Item 1A. “Risk Factors.” See Note 5. “Government Grants” to our condensed consolidated financial statements for further information about government grants.\nAs a result of various market opportunities and increased domestic demand for our products, we recently commenced operations at our fourth and fifth manufacturing facilities in the United States and completed the expansion of our manufacturing footprint at our existing facilities in Ohio. The capital expenditures necessary to expand our capacity were financed, in part, by cash on hand, advance payments from customers for module sales in future periods, and the advanced manufacturing production credit described above.\nIn addition to the expansion described above, we intend to increase the nameplate production capacity of our existing manufacturing facilities by improving our production throughput, increasing module wattage, and reducing manufacturing yield losses. During 2025, we expect to spend between $0.9 billion and $1.2 billion for capital expenditures, including the new facility mentioned above, investments in various R&D initiatives, and upgrades to machinery and equipment that we believe will further increase our module wattage and expand capacity and throughput at our facilities. These capital investments, and any other potential investments to implement our technology roadmap, may require significant internal and possibly external sources of capital, and may be subject to certain risks and uncertainties described in Item 1A. “Risk Factors” of our Annual Report on Form 10-K for the year ended December 31, 2024.\nWe have committed and expect to continue to commit significant working capital to purchase various raw materials used in our module manufacturing process. Our failure to obtain raw materials and components that meet our quality, quantity, and cost requirements in a timely manner could increase our manufacturing costs or interrupt or impair our ability to manufacture our solar modules. Accordingly, we may enter into long-term supply agreements to mitigate potential risks related to the procurement of key raw materials and components, and such agreements may be noncancelable or cancelable with a significant penalty. For example, we have entered into long-term supply agreements for the purchase of certain specified minimum volumes of substrate glass for our PV solar modules. We have the right to terminate certain of these agreements upon payment of specified termination payments (which, in aggregate, are up to $319.9 million as of September 30, 2025 and decline over the remaining supply periods). Additionally, for certain strategic suppliers, we have made, and may in the future be required to make, certain advance payments to secure the raw materials necessary for our module manufacturing.\n50\nTable of Contents\nWe have also committed certain financial resources to fulfill our solar module collection and recycling obligations and have established a trust under which these funds are put into custodial accounts with an established and reputable bank. As of September 30, 2025, such funds were comprised of restricted marketable securities of $215.5 million and associated restricted cash and cash equivalents of $6.2 million. As of September 30, 2025, our module collection and recycling liability was $145.1 million. Trust funds may be disbursed for qualified module collection and recycling costs (including capital and facility related recycling costs), payments to customers for assuming collection and recycling obligations, and reimbursements of any overfunded amounts. Investments in the trust must meet certain investment quality criteria comparable to highly rated government or agency bonds. As necessary, we adjust the funded amounts for our estimated collection and recycling obligations based on the estimated costs of collecting and recycling covered modules, estimated rates of return on our restricted marketable securities, and an estimated solar module life of 25 years, less amounts already funded in prior years.\nAs of September 30, 2025, we had no off-balance sheet debt or similar obligations, other than financial assurance related instruments, which are not classified as debt. We do not guarantee any third-party debt. See Note 10. “Commitments and Contingencies” to our condensed consolidated financial statements for further information about our financial assurance related instruments.\nCash Flows\nThe following table summarizes key cash flow activity for the nine months ended September 30, 2025 and 2024 (in thousands):\n \nNine Months Ended \nSeptember 30,\n \n2025\n2024\nNet cash provided by operating activities\n$\n815,212 \n$\n407,003 \nNet cash used in investing activities\n(577,934)\n(1,341,921)\nNet cash provided by (used in) financing activities\n124,442 \n(5,879)\nEffect of exchange rate changes on cash, cash equivalents, restricted cash, and restricted cash equivalents\n2,021 \n(2,805)\nNet increase (decrease) in cash, cash equivalents, restricted cash, and restricted cash equivalents\n$\n363,741 \n$\n(943,602)\nOperating Activities\nThe increase in net cash provided by operating activities was primarily driven by higher cash receipts from module sales, including advance payments for future sales, and receipts from factoring trade receivables, partially offset by higher payments made to suppliers.\nInvesting Activities\nThe decrease in net cash used in investing activities was primarily due to lower purchases of property, plant and equipment for our manufacturing facilities in the United States and India and higher net proceeds from sales and maturities of marketable securities.\nFinancing Activities\nThe increase in net cash provided by financing activities was primarily due to net proceeds from secured borrowings from trade receivables factoring with recourse and other borrowings under various debt agreements in the current period, partially offset by repayment of debt in the current period.\n51\nTable of Contents"
}