{
  "item1": "Fortinet leader cybersecurity, driving convergence networking security. mission secure people, devices data everywhere. integrated platform, Fortinet Security Fabric, spans secure networking, unified Secure Access Service Edge (“SASE”) artificial intelligence (“AI”)-driven security operations (“SecOps”). December 31, 2024, end-customers located over 100 countries included enterprises across wide variety market verticals, including financial services, retail, healthcare operational technology (“OT”) market verticals, communication security service providers, government organizations.",
  "item7": "trends operating expense, including sales marketing expense, research development expense, general administrative expense, expectations regarding these expenses; expected impact plans strategy acceleration data center footprint points presence deployment; expectations operating expense will increase year over year absolute dollars during 2025; expectations proceeds exercise stock options future years will adversely impacted increased mix restricted stock units performance stock units versus stock options granted decline stock price; uncertain tax benefits effective domestic global tax rates, impact interpretations changes tax law, timing tax payments; expectations regarding spending related real estate assets, acquisitions development, including data centers points presence, office building warehouse investments, well other capital expenditures impact free cash flow expenses; estimates range 2025 spending capital expenditures; expansions other changes real property holdings development; expected outcomes liabilities litigation; intentions regarding share repurchases sufficiency existing cash, cash equivalents investments meet cash needs, including debt servicing requirements, least next 12 months; other statements regarding future operations, financial condition prospects business strategies; adoption impact new accounting standards. Fortinet leader cybersecurity, driving convergence networking security. mission secure people, devices data everywhere. integrated platform, Fortinet Security Fabric, spans secure networking, unified SASE AI-driven security operations.",
  "item2": "trends operating expense, including sales marketing expense, research development expense, general administrative expense, expectations regarding these expenses; expected impact plans strategy acceleration data center footprint PoPs deployment; expectations regarding gross margins operating expenses 2025; expectations proceeds exercise stock options future years will adversely impacted increased mix restricted stock units performance stock units versus stock options granted decline stock price; uncertain tax benefits effective domestic global tax rates, impact interpretations changes tax law, timing tax payments; expectations regarding spending related real estate assets, acquisitions development, including data centers points presence, office building warehouse investments, well other capital expenditures impact free cash flow expenses; estimates range 2025 spending capital expenditures; expansions, development, improvements, operating, subleasing other real property holdings activities; expected outcomes liabilities litigation; intentions regarding share repurchases sufficiency existing cash, cash equivalents investments meet cash needs, including debt servicing requirements, least next 12 months; other statements regarding future operations, financial condition prospects business strategies; adoption impact new accounting standards. Fortinet leader cybersecurity, driving convergence networking security. mission secure people, devices data everywhere. integrated platform, Fortinet Security Fabric, spans secure networking, unified SASE AI-driven security operations (“SecOps”)."
}