{
  "item1": "own numerous patents, trademarks, copyrights, trade secrets hold licenses use intellectual property owned others. Although aggregate intellectual property important operations, do not consider any single patent, trademark, copyright, trade secret, license material importance any segment business whole. time time, engage litigation protect intellectual property rights. discussion risks related intellectual property, please refer “Item 1A.",
  "item7": "Year Ended December 31, Net cash provided operating activities Cash paid acquisitions, net cash received Purchases property, plant equipment Proceeds sale property Cash infusion into divestiture All other investing activities Net cash used investing activities Net proceeds (repayments of) commercial paper borrowings Proceeds borrowings (maturities longer than 90 days), net issuance costs Repayment borrowings (maturities greater than 90 days) Repurchase common shares Payment dividends All other financing activities Net cash provided (used in) financing activities Operating Activities Cash flows operating activities can fluctuate significantly period-to-period working capital needs timing payments income taxes, interest, pension funding, other items impact reported cash flows. Operating cash flows $1.5 billion 2024, representing increase $173 million, 12.8%, compared 2023, primarily attributable following factors: Year-over-year increases $35 million Operating cash flow net earnings, net non-cash items (Amortization, Depreciation, Stock-based compensation, Gain sale property, Loss divestiture, Loss equity investments). aggregate changes accounts receivable, inventories, trade accounts payable generated $79 million cash during 2024 compared using $9 million cash during 2023. amount cash flow generated used aggregate accounts receivable, inventories, trade accounts payable depends upon how effectively manage cash conversion cycle, which generally represents number days elapse day pay purchase raw materials components collection cash customers, can significantly impacted timing collections payments period.",
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS Fortive Corporation (“Fortive,” “Company,” “we,” “us,” “our”) innovates essential technologies keep world safe productive. strategic segments - Intelligent Operating Solutions (“IOS”) Advanced Healthcare Solutions (“AHS”) - include iconic inventor brands leading positions markets. businesses design, develop, manufacture, market products, software, services, building upon leading brand names, innovative technologies, strong market positions."
}