{
  "source_file": "gddy-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOverview\nGoDaddy is a global leader serving a large market of entrepreneurs, developing and delivering easy-to-use solutions as a one-stop shop provider, alongside personalized guidance. We serve small businesses, individuals, organizations, developers, designers and domain investors. Our vision is to radically shift the global economy toward life-fulfilling entrepreneurial ventures. Our mission is to empower entrepreneurs everywhere, making opportunity more inclusive for all. We are passionate about our mission and honored that entrepreneurs trust their ideas with us. Our 20.5 million customers are passionate and determined to transform their ideas into something meaningful. Our ability to evolve and build products to meet our customers' needs uniquely positions us to help our customers navigate their journey as small business owners.\nOur customers' journeys tend to be non-linear and each phase can be iterative in nature. We design our solutions to help across all aspects of our customers’ businesses and to assist them in improving and growing across what we call the \"Entrepreneur's Wheel.\" The Entrepreneur's Wheel represents our customers' needs within three key focuses areas: Identity, Presence and Commerce.\nOur customers often start with the most intimate of brand considerations, their Identity, which includes their company name, domain name, logo and email address. The domain name continues to be an important initial step for customers as they start and grow their business. We provide products to support their brand through our domain services that blend seamlessly into their connected social identities and online presence. In addition, with the help of GoDaddy Airo\n® \n(Airo), entrepreneurs can more easily establish their identity through AI-powered domain name searches and logo creation. \nWe also help our customers manage and grow their Presence while connecting with their customers through our expanded service offerings and access to relevant third-party products and platforms. We offer a suite of Presence-based solutions, most of which are enhanced by Airo, including website building and hosting, marketplace syndication, social media, search engine visibility, security, business products and email and other services. \nFinally, we have built a suite of Commerce solutions that enable our customers to sell directly online, in-person and across multiple channels, such as marketplaces and social platforms, and to integrate dynamic information everywhere they engage with current and potential customers. These solutions include GoDaddy Payments, point-of-sale systems that unify transaction management for both in-person and online sales, and an inventory and order dashboard for easier management of our customers' businesses.\n5\nTable of Contents\nAt GoDaddy, we believe our customers should have both great technology and great support at every point on the Entrepreneur's Wheel. With AI-powered experiences such as Airo and customer centric assistance such as our GoDaddy Guides, we can provide intelligent, proactive experiences within our GoDaddy solutions. For example, Airo can help small businesses build and grow with domain searches, logo and image creation, website and social media posts, ad design and email marketing campaigns. In addition, we help set our customers up for success with personalized guidance from our GoDaddy Guides via phone and digital experiences, thousands of daily conversations and our gathering of valuable feedback to enable us to continually evolve our products and solutions and respond to our customers' changing needs.\nOur people and unique culture have been integral to our success. We live by the same principles that enable our customers' ideas to survive and thrive, including owning outcomes, building value, joining forces, working courageously and living passionately. We take pride in delivering successful outcomes based on data-driven decisions, which we believe is a key factor driving our financial performance.\nOur Customers and Solutions\nGoDaddy is built to serve the needs of customers by providing easy-to-use products on an integrated technology platform wrapped with personalized guidance.\nOur Customers\nWe serve several customer populations: (i) Independents, (ii) WebPros, (iii) Domain Investors, and (iv) Domain Registrars, Third Party Registrars and Corporate Domain Portfolio owners. While these customer populations tend to utilize many of the same GoDaddy product offerings, there are meaningful differences in their journeys, what they value, their goals and how they communicate with their current and potential customers. We aim to establish and provide solutions that address these differences.\nOur largest customer population, Independents, consists mostly of microbusinesses and non-commercial endeavors. Microbusiness owners have an entrepreneurial spirit, strong work ethic and, above all, passion for their ideas, yet their specific needs vary depending on the type of their idea and the phase of their journey. Independents range from individuals who have an initial business idea and those thinking about starting a business, to established ventures that need help attracting customers, growing their sales, processing payments, managing their online presence or expanding their operations. Most Independents have fewer than five employees, and most self-identify as having little to no technology or design skills. These customers need our help to create a unique and secure identity, especially with the more technical aspects of their online presence. Although our customers have differing degrees of resources and technical capabilities, they all share a desire to find tools to help them bring their ideas to life, enhance connections with their audience, sell their products and services and provide a seamless experience for both existing and new customers. \nOur second largest customer population, WebPros, are website designers and developers who build websites on behalf of businesses and noncommercial organizations. We estimate that half of all global website builds occur through a third party, such as our WebPros, on a do-it-for-you basis. WebPros are often freelancers, moonlighters or teams within website design agencies that often have website design as one of multiple streams of income. WebPros generally have more technical acumen and look for tools that provide greater amounts of flexibility, such as the WordPress content management system (CMS). Although WebPros have a need for technical depth and flexibility, they also benefit from our simplicity and guidance as tools to increase their throughput and maximize the use of their time. We help our WebPros customers in a number of ways beyond our product suite and services, including providing tools to help them save time, make money and exceed client expectations. These client management applications aim to make it easier for WebPros to manage their clients' websites at any host, or on GoDaddy products such as Managed WordPress. Our solutions are built to assist WebPros in more easily managing their overall business with capabilities such as client billing, administrative access and shopping features, making it easier for them to buy and manage multiple products for their clients, as well as make use of enhanced technical support and discounts for reselling GoDaddy products. We support a variety of third-party control panels and content management tools favored by WebPros including cPanel, Plesk, Drupal, Joomla and more. \nOur third largest customer population is Domain Investors. Domain Investors are individuals or organizations who manage a portfolio of registered domains for the purpose of selling via secondary markets. These investors bring a unique and valuable resource to our business in the form of liquidity and the ability to help our other populations (Independents and WebPros) successfully find a domain name they prefer.\n6\nTable of Contents\nWe also serve Domain Registrars, Third Party Registrars and Corporate Domain Portfolio owners. Domain Registrars are organizations that have their own domain registration offerings, but who use our domain registration and management platform. These commercial arrangements provide for strategic relationships with many key platforms and enable further scale of our domain registration technology and insights. Third party registrars are served through GoDaddy Registry which provides wholesale generic top-level domains (gTLDs) and country-code top-level domains (ccTLDs) for registrars to sell to the end customer. These top-level domains (TLDs) provide alternatives to the .com domain that more closely represent the names of our customers' ideas, businesses and brands. For registry operators, we provide a fully managed registry platform, including managing the full registry technology and operating stack at scale, with approximately 180 TLDs including some of the largest brands in the world. We also serve corporate domain portfolio owners, which are organizations that maintain and manage a large portfolio of domain names, including general and international domains. These customers are looking for the most powerful, secure and intuitive technology to streamline their processes, unparalleled industry experience and expertise to navigate the complexities of managing a corporate portfolio, and a focused and dedicated team that can provide committed support with the highest levels of security, service and domain management.\nOur Solutions and Experiences\nWe designed and developed an extensive set of easy-to-use technology solutions and seamless experiences to enable our customers' journeys along the Entrepreneur's Wheel across multiple platforms and online marketplaces. We understand that no matter what our customers' needs are, or what stage of their idea they are focusing on, our customers want a \"one-stop-shop\" solution. We offer our customers products and services to meet them at every stage of their journey.\nOur domain name registration products enable us to engage customers at a common starting place for establishing an exclusive, uniquely branded identity and are often an on-ramp for our other products. Domains are a part of our Core Platform business, and we believe our Applications and Commerce products are a natural adjacency to our domain registration products. Applications and Commerce products, including our proprietary website building and commerce products as well as our productivity solutions, significantly improve our value proposition to customers, thereby improving our financial performance, growth opportunities and customer retention. \nIn addition, we have built customer experiences that provide our solutions in a seamless one-stop-shop environment. Airo helps small businesses establish an online presence and grow through AI-powered tools that assist customers with domain searches, logo and image creation, website and social media posts, ad design and email marketing campaigns. And, our GoDaddy Guides are readily available and provide care to customers who have different levels of technical sophistication.\nWe manage and report our business in the following two segments: \n•\nApplications and Commerce (A&C)\n, which primarily consists of sales of products containing proprietary software, notably our website building products, as well as our proprietary commerce solutions and third-party email and productivity solutions and sales of certain products when they are included in bundled offerings of our proprietary software products.\n•\nCore Platform (Core)\n, which primarily consists of sales of domain registrations and renewals, aftermarket domain sales, domain protection, website hosting products and website security products when not included in bundled offerings of our proprietary software products as well as sales of products not containing a software component. \nApplications and Commerce\nBringing an idea to life online, establishing and maintaining a presence and continuing to grow requires the right tools and products. Website building solutions, e-commerce tools, digital marketing capabilities and other GoDaddy solutions are designed to help our customers start, grow and scale their presence and ultimately their businesses. Our customers come to \n7\nTable of Contents\nGoDaddy to build a professional website, attract customers, sell their products and services and accept payments online and in person by engaging with our easy-to-use tools, managed in one place.\nApplications Products\nOur primary applications products include:\nWebsites + Marketing\n. Websites + Marketing is an easy-to-use, do-it-yourself, mobile-optimized online tool that enables our customers to build effective websites and e-commerce enabled online stores with minimal technical skill. We offer a variety of plans, with pricing dependent on business and marketing features. With each of these plans, customers gain access to industry-targeted professional design templates, which can be further customized using our editor by adding intent-driven sections, photos, videos or text. Our design templates cover a wide range of categories with professionally written content for small businesses, organizations, families, weddings and other ideas. We design our websites and tools to work seamlessly on mobile devices, with a focus on performance, to enable websites to appear in search engine rankings.\nManaged WordPress and Managed WooCommerce Stores.\n Managed WordPress is our streamlined, optimized website building experience that allows our customers to easily build and manage a faster WordPress site that offers more flexibility and power than our Websites + Marketing solution. With our Managed WordPress site, we manage the administrative tasks for our customers, allowing them to spend more time on building or growing their business. We offer a variety of plans, with pricing based on various features. Our Managed WordPress sites are built with automatic, regular backups and core updates, enhanced security, integrated Secure Sockets Layer (SSL), one-click migration tools, pre-installed extensions, plugins and themes, business email and backups and a staging site. We also offer Managed WooCommerce Stores, giving our customers the freedom to sell anything, anywhere online, from physical products to digital downloads, services and subscriptions.\nDigital Marketing\n. We offer a range of marketing tools and services designed to help businesses acquire and engage customers and create content. These capabilities are available in an integrated offering with our website and commerce tools, or as a stand-alone offering for customers using other website content-management systems. The tools are designed for busy customers who may lack experience with online marketing, focusing on ease of use, mobile experience and delivering business results. For example, Airo, an AI-powered experience, allows our customers to quickly create a powerful marketing campaign, including recommended, customized social media posts, better site traffic with the Airo SEO wizard, a step-by-step guide to optimizing each website page with suggested keywords and descriptions that can lead to better traffic results, and a Customer Insights dashboard that provides insights on site traffic, sales and orders and digital marketing. Our mobile application, GoDaddy Studio, helps our customers to grow their brands by easily creating impactful visual content for almost any online platform. Search Engine Optimization helps our customers get their websites found on major search sites using a simple step-by-step wizard with targeted recommendations on which search phrases are most likely to drive traffic to a customer's site. Business listings capabilities bring business information to where customers are looking, including Meta and Google My Business. Email marketing lets customers build targeted campaigns, either from scratch or using website or commerce content. Social Media Marketing helps customers create ads and boost brand awareness through a complete \"do-it-for-me\" service for managing engagement on the most popular social networks. This service combines dedicated teams of branding experts – photographers, writers, designers, marketers – with proprietary technology to manage activity on Meta, X and Yelp, among others, to help our customers acquire new customers and build stronger relationships with their existing customers.\nCommerce\nWe\n aim to lead the small business commerce market by enabling GoDaddy customers of all sizes, from those just starting out to established businesses looking to scale and grow, to sell everywhere their customers shop. We design our commerce products to help our customers sell online, in person and on leading marketplaces, while being able to manage their sales from one place. In addition to robust commerce capabilities, we offer the lowest card transaction fees in the industry when compared to similar plans from other leading providers, which allows our customers to keep more of what they make.\n \nOur primary commerce products and services include:\nOnline Store.\n Our Websites + Marketing product includes online store capabilities, which allows our customers to transact business directly on their websites. Online store capability is easy to use and offers powerful commerce features with templates for websites that are optimized for mobile shopping, integrations with GoDaddy Payments and our Smart Terminal Point-of-Sale (POS) system, inventory and product catalog management, and growth tools for marketing. It also allows customers to sell on marketplaces such as Amazon, Etsy, eBay, Walmart and Google and social media platforms such as Facebook and Instagram, with all channels managed from our centralized dashboard. As part of the GoDaddy Commerce ecosystem, Managed \n8\nTable of Contents\nWooCommerce Stores, our WordPress-based online store solutions, provide our customers with everything they need to sell online, in person, and across popular marketplaces and social media platforms from one built-in experience. Similar to our Websites + Marketing product, Managed WooCommerce Stores include our centralized dashboard, allow for marketplace selling and are integrated with GoDaddy Payments and our Smart Terminal POS system. \nPoint-of-Sale (POS) Systems.\n We offer a line of smart POS terminals for businesses with in-store operations, including our flagship countertop, Smart Terminal, and our compact Smart Terminal Flex. Our Smart Terminal devices are modern, dual screen all-in-one POS systems that allow our customers to manage in-store inventory and product catalogs and accept payments. In addition, the Smart Terminal line seamlessly integrates with both our Websites + Marketing Online Store and Managed WooCommerce Stores to unify in-person and online sales so businesses can offer “Buy online pick up in-store” experiences to their customers. The Smart Terminal line also offers access to third-party applications that meet merchants' needs that we do not address directly. \nIn addition to our Smart Terminal line of POS systems, we offer payment acceptance solutions that allow our customers to accept payments their way while seamlessly interacting with their customers wherever they may be. For example, we include Payable Domains, a default payments system that is designed to create a frictionless, out-of-the-box experience for our customers. Our Card Reader and Tap-to-Pay on the GoDaddy Mobile App (iPhone and Android) allow customers to accept payments and sell on the go. Our Virtual Terminal allows customers to accept payments from their smartphone, tablet or computer with Internet connection with no hardware needed. Our customers also have the ability to accept online payments without needing to create a website through our Online Pay Links. Customers can brand and personalize these shareable pay links with their domain, giving them another opportunity to build their brand. Pay links can be sent through text or email or shared on social media sites. We also provide merchants with QR code-based payments, allowing their customers to scan and pay through the GoDaddy Mobile App. \nGoDaddy Payments.\n As a \"payment facilitator,\" GoDaddy Payments enables our customers in both the U.S. and Canada to accept all major forms of payment, including Visa, MasterCard, American Express, Discover, and contactless payments including Apple Pay and Google Pay, with no long-term contracts or monthly minimums. This service enables our customers to start accepting payments in minutes with a simple setup and get paid, in many cases, as early as the next business day, all with the lowest fees in the industry when compared to similar plans from other leading providers. In addition, GoDaddy Payments is built-in as a payments acceptance method in all our U.S. and Canada commerce products for easy enablement\n.\nEmail and Productivity Solutions \nOur customers want to spend their time on what matters most to them, selling their products and services or helping their customers do the same. We provide them with productivity tools such as domain-specific email, telephony and online storage to help run their ventures. We offer a variety of products designed to make the business of business easier for our customers. The products we offer include those developed in-house as well as third-party applications which we distribute and support, such as Microsoft 365.\nOur primary email and productivity solutions products include:\nEmail Accounts\n. We offer a range of email service plans with a multi-feature web interface that connects to our customers' domains. The pricing of these plans depends on the customer's desire for additional features, including HIPAA- compliant email, advanced email security, archiving, and additional business applications such as Microsoft Teams. All our email accounts are ad-free and we offer added security functionality designed to protect from spam, viruses and other forms of online fraud, such as phishing.\nMicrosoft 365\n. We offer fully-supported Microsoft 365 accounts that are easy to set up and use with our customers' domains. We offer Microsoft 365 through multiple plans, ranging from email with calendar and contacts connected to a full suite of productivity tools, including file sharing and full desktop versions of Microsoft productivity applications, such as Outlook, Word, Excel and PowerPoint. For customers wanting to protect their email data, we provide an email backup service, and for customers needing to comply with regulatory requirements, we provide email add-on services such as HIPAA-enabled email, encryption services (in partnership with ProofPoint), archiving services (in partnership with Barracuda) and advanced e-mail security. Our customers can also make use of Microsoft Copilot through chat enabled features, or can purchase Microsoft 365 Copilot as an integrated solution for Microsoft Office apps. We help make Microsoft 365 and Microsoft 365 Copilot installation easy, allowing customers to be up and running in minutes, including \"do-it-for-me\" migration services to move customers' existing email data to Microsoft 365 accounts.\n9\nTable of Contents\nIn 2024, 2023 and 2022, we derived approximately 36%, 34% and 31% of our total revenue, respectively, from sales of our A&C products.\nCore Platform\nDomains\nEvery great idea needs a great name and GoDaddy is the leading global domain naming service. Staking a claim on an identity with a domain name is an integral part of establishing a concept and presence online. When inspiration strikes, we provide our customers with the broadest selection of domains and high-quality search, discovery and recommendation tools to help them find the right name for their idea. Securing a domain is a key component to creating a complete identity and our domain products often serve as the starting point in our customer relationships. We are a global leader in domain name registration, with approximately 81 million domains under management as of December 31, 2024. Based on information reported in VeriSign's most recent Domain Name Industry Brief, this represented approximately 22%\n \nof the approximately\n \n362 million\n \ndomain names registered worldwide as of December 31, 2024. As of December 31, 2024, approximately 93% of our customers purchased a domain from us. In addition, GoDaddy Registry provides a high-performance back-end registry technology platform with a portfolio of TLDs including .biz, .co, .nyc, and .us.\nOur primary domains product offerings include:\nPrimary Registrations\n. Using our website or mobile application, we offer customers the ability to search for and register available domain names with the applicable registry. Our inventory for primary registrations is defined by the number of TLDs we offer. As of December 31, 2024, 458 different generic TLDs, such as .com, .net and .biz, and 58 different country code TLDs, such as .co, .ca, .in and .jp., were available for purchase through GoDaddy. Since 2013, hundreds of new gTLDs were launched through ICANN's \"new gTLD program\" initiated in 2012 (the Expansion Program), making it easier for companies and individuals to find and register new, easy-to-remember domain names tailored to their ideas, industry or interests. ccTLDs are important to our international expansion efforts as we found international customers often prefer the ccTLD for the country or geographic market in which they operate. Our primary registration offering relies heavily on our search, discovery and recommendation tools which enable our customers to find a domain name that matches their business needs and goals. We also sell domain registrations through relationships with third-party resellers and we provide back-end registry services supporting approximately 180 TLDs.\nAftermarket\n. We operate a large domain aftermarket platform, which processes aftermarket, or secondary, domain name sales and we maintain a portfolio of more than 1.0 million domain names. We designed our aftermarket platform to enable the seamless purchase and sale of previously registered domain names through an online auction, an offer and counter offer transaction, a \"buy now\" transaction and automation and lease to own options for our customers. In addition, we allow our customers to \"List for Sale\" names under their registration, and we provide functionality for the entire registrar network to list expiring domains from their platforms and \"List for Sale\" functionality to registrar partners allowing their currently registered customers to list domain names within GoDaddy's aftermarket. These various channels provide a diverse inventory available to meet the demand from our customers. In addition, our GoDaddy Investor mobile application helps investors watch and bid on domains at auction and stay on top of their current bids from their mobile devices. We operate a cross-registrar network that automates transaction execution across registrars, thereby reducing the time required to complete a transaction.\nRegistry\n. GoDaddy Registry is a world-leading provider of domain name registry services. GoDaddy Registry operates or provides back-end registry services to approximately 180 registry TLDs including ccTLDs, such as \n.\nus, .tv and .co, city TLDs such as .nyc and .sydney, gTLDs such as .club, .health and .design, and branded TLDs such as .chase and .godaddy. Our integrated registry solutions provide policy and operational support, and domain marketing, sales and strategic planning.\nDomain Name Add-ons\n. Domain name add-ons are features that are offered for purchase concurrently with domain name registrations and have low costs associated with their delivery. For example, in addition to privacy features included at no cost with every domain registered with GoDaddy, we offer more advanced full domain and ultimate domain protection products exclusively focused on protecting our customers' domains against bad actors and online risks, as well as domain ownership products, to prevent the accidental loss of a domain name.\n10\nTable of Contents\nHosting and Security\nFor more technically sophisticated WebPros and other customers, we provide high-performance, flexible hosting and security products that can be used with a variety of open source design tools, including WordPress. We design these solutions to be easy to use, effective, reliable, flexible and provide great value. We offer a variety of hosting and security products enabling our customers to create and manage their identity, or in the case of WebPros, the identities of their end-customers. \nOur primary hosting and security products include:\nShared Website Hosting\n. The term \"shared hosting\" refers to the housing of multiple websites on the same server. Shared hosting is our most popular hosting product. We operate, maintain and support shared website hosting in our owned and operated data centers and our leased co-located data centers using either Linux or Windows operating systems. We currently offer several tiers of website hosting plans to suit the needs and resources of our customers, a majority of which use industry standard cPanel or Parallels Plesk control panels. We also bundle our hosting plans with a variety of applications and products such as web analytics and SSL certificates. WordPress is the most used CMS on our shared hosting platform.\nVirtual Private Servers\n. Our broad range of virtual private server (VPS) offerings allow our customers to select the server configuration best suited for their applications, requirements and growth. Our VPS solutions provide our customers with a single virtual machine which runs multiple other virtual machines for other customers. Our VPS is designed for customers who need greater control, more advanced technical capabilities and higher performance than offered by our shared hosting plans. Our customers can tailor their VPS plans based on a range of performance, storage, bandwidth and operating system needs.\nSecurity\n. Our security product portfolio is a comprehensive suite of tools designed to help our customers secure their online presence. The portfolio includes (i) SSL certificates to help ensure information is secure between browsers and servers through encryption; (ii) the use of a content delivery network to improve a website's performance; (iii) a proprietary web application firewall to help keep customers' websites safe from hackers; (iv) managed security with malware scanning and site cleanups; and (v) a skilled team of security professionals working to secure our services or to provide support in the event of a disruption to our solutions. \nIn 2024, 2023 and 2022, we derived approximately 64%, 66% and 69% of our total revenue, respectively, from sales of our Core Platform products.\nExperiences\nGoDaddy Airo\n®\nAiro is an intelligent experience that can help proactively build and grow our customers' businesses with the power of AI. Airo operates across the GoDaddy ecosystem and is built to activate intelligent, proactive experiences within other GoDaddy solutions. Airo aims to help our customers by anticipating their needs and providing solutions through informed interactions across the GoDaddy suite of products and services, small business industry expertise, knowledge queries and best practices. Airo can help our customers build their identity with domain searching, personalized logos, email inboxes and email templates. It also aims to help our customers grow their business with proactive email and text messages, proposed product descriptions and social media posts, conversational UI landing pages and auto-generated product catalogs.\nGoDaddy Guides\nOur GoDaddy Guides consist of approximately 5,900 specialists worldwide who are readily available to provide care to and build strong relationships with our customers throughout their lifetime. Our customers deeply value expertise and know-how that is individualized and unique to their ventures and our Guides are trained and supported to provide the high-quality, responsive and personalized guidance that our customers need. In addition, our GoDaddy Guides market our brand through their recommendations of our solutions to specifically meet the needs of our customers to support their growth. \nOur Opportunity and Advantages\nOur Opportunity—Empowering Entrepreneurs\nOur mission is to empower entrepreneurs everywhere, making opportunity more inclusive for all. Our customers represent a large and diverse market that we believe is fundamentally underserved by other companies. According to the U.S. \n11\nTable of Contents\nSmall Business Administration's Office of Advocacy, 99.9% of all firms in the U.S. are small businesses, of which there were approximately 34.8 million, based on the Census Bureau's 2021 Statistics of U.S. Businesses. These small businesses are estimated to represent approximately 43.5% of total U.S. gross domestic product (GDP). We believe a significant market exists for our products and services, and we believe our addressable market extends beyond small businesses and includes individuals and organizations, such as universities, community organizations, charities and hobbyists.\nOur customers are consumers themselves, which makes them keenly aware of the need to have an impactful online presence. While our customers' needs change depending on where they are in their journey, the most common customer needs we serve include:\n•\nIdentity\n. Our customers want to develop an identity by finding a name that distinctly identifies their business, hobby or passion. We believe their identity includes not just a simple, mobile-enabled website, but the ability to get found across various search engines, social media platforms and vertical marketplaces. And while our customers' online identities start with creating and managing these points of presence, their identities are amplified through content generation and the ability to engage and transact online with their customers and audience.\n•\nPresence\n. Presence represents the need of our customers to present themselves to their customers, which they do through an ever-expanding set of options across social media, marketing channels, email, marketplaces and through their website. Being able to seamlessly create and post content quickly is imperative. What it means for our customers to be online continues to evolve. Today, having an effective online presence often means having a combination of: (i) a secure and content-rich website viewable from any device; (ii) a presence on multiple social media channels (e.g., Meta, TikTok, Snapchat, X and WeChat); (iii) getting found by search engines (e.g., Google); and (iv) establishing a presence on: (a) an increasing number of horizontal marketplaces (e.g., Yelp and Eventbrite); (b) vertical marketplaces (e.g., Zillow, OpenTable and HomeAdvisor); and (c) e-commerce platforms (e.g., Amazon, eBay and Etsy).\n•\nCommerce\n. Commerce recognizes that our customers need commerce to work seamlessly for them both offline and online. Our customers' customer expectations are set by how they engage with enterprise-grade experiences, which means they expect to be able to buy online and pick up in the store in a matter of minutes. A customer in the store expects to be recognized online seamlessly, while a customer online expects to transition to a store experience seamlessly. For service commerce entrepreneurs, their customers expect to find products and services online, engage through online messaging, book appointments digitally and complete transactions in-person.\n•\nInteracting with customers as they grow their business.\n Our customers need to effectively communicate with existing customers and potential customers across a communication landscape that is fragmented in both form and function. This landscape includes (i) branded email communication, originating with domain registration and email creation through an email client; (ii) online marketing in a variety of content types and channels; (iii) online commerce with reservation and scheduling, product catalogs and e-commerce and payment processing capabilities, including in-person point-of-sale payment processing; (iv) messaging capabilities across SMS, Facebook Messenger, WhatsApp and other platforms; (v) email marketing for audience engagement; and (vi) telephony, for inbound and outbound voice communication. Surrounding these channels and tactics, our customers also need easy-to-use tools to run their businesses.\n•\nTechnology that is easy-to-use, reliable, secure, efficient, performance enhancing and evolves with their needs.\n Our customers vary significantly, but they remain the same in their need for an integrated platform and set of tools that enable their domain, website, marketing and commerce solutions to easily work together as their ideas grow and become more complex. Our customers expect reliable products and want to be confident that their digital presence is secure, even when customized. Our customers work on their ideas whenever and however they can and need solutions fitting their lifestyle and schedule. Our products and services provide a platform that can meet the range of needs, demands and levels of sophistication of our customers, from those that may not be technologically savvy to more sophisticated customers such as WebPros. In addition to our standalone products, Airo helps small businesses establish their online presence and grow through AI-powered tools that assist with domain searches, logo and image creation, website and social media posts, ad design and email marketing campaigns.\n•\nConnecting with a real person when they need help.\n Depending on their journey, a customer may seek guidance on setting up a website, launching new features or trying a new product or service and they need that guidance on their time. Our customers need real people who are readily available and can provide care to customers at all levels of technical sophistication. In addition to guiding our customers along their journey, we also provide support by handling the most difficult and arduous tasks for them through a collection of managed service offerings, and \n12\nTable of Contents\ncustomers who utilize Airo-enabled solutions get access to personalized support for website content, logos, ready-to-use social media posts and more.\n•\nAffordable solutions\n. Our customers often have limited financial resources and may be unable to make large, upfront investments in the latest technology. Our customers need affordable solutions that deliver impactful results to level the playing field with the tools that allow them to appear and act as bigger ventures. We aim to provide affordable products and services for our customers at every level to support their businesses. \nServing our customers’ needs creates deep relationships, where we are viewed as not just a solution provider, but also a guide and partner to their journey on the Entrepreneur's Wheel. This makes for a favorable business and economic model, aligning the interests of GoDaddy and our customers.\nOur stable and durable business model is driven by strong brand recognition, efficient customer acquisition, high customer retention rates, increasing lifetime spend of our customers and our ability to attract high intent customers. In 2024, we generated $4,573 million of revenue, up 7.5% from $4,254 million in 2023, and we generated $5,039 million in total bookings, up 9.5% from $4,603 million in 2023. We believe the breadth and depth of our product offerings, seamless ease-of-use in a one-stop shop and the high-quality, personalized guidance and responsiveness from GoDaddy Guides continues to build strong customer relationships leading to our high customer retention rates. For the year ended December 31, 2024, our customer retention rate was approximately 84%, a slight reduction from the approximate 85% in each of the four years prior, due to divestitures, migrations and the end of life of certain products as part of our efforts to streamline brands outside the GoDaddy platform. For the year ended December 31, 2024, retention for customers within the GoDaddy platform, which represents the vast majority of our customers, was approximately 87%. The retention rate for our customers who had been with us for over three years as of December 31, 2024 was approximately 90%. Greater than 89% of our total revenue was generated by customers who were also customers in the prior year. In addition, in 2024, we had over 1.8 million customers who each spent more than $500 a year on our product offerings.\nOur Advantages\nOur customers serve many roles in their business; they simultaneously run marketing, accounting, service delivery operations, customer service, people operations and many other tasks. Time is their most valuable resource and complexity is their hindrance; our customers want an impactful online presence, but may not have the time and skills to make that happen. Our goal is to be a trusted partner to these entrepreneurs, bringing together the technology, ease of use and guidance necessary to bring their ideas to life online. We believe the following strengths provide us with competitive advantages in serving these needs:\nGlobal Brand Awareness. \nOur global brand benefits from high awareness as a leading domain name provider, with approximately 81 million domains under management as of December 31, 2024. Based on information reported in VeriSign's most recent Domain Name Industry Brief, this represented approximately 22%\n \nof the approximately\n \n362 million\n \ndomain names registered worldwide as of December 31, 2024. Our global presence gives us the ability to leverage our brand — a competitive advantage when customers search for products and solutions. We have 20.5 million paying customers and a customer retention rate of approximately 84% for the year ended December 31, 2024. We market and sell to customers in over 200 markets around the world and in 2024, 49% of our customer base and approximately a third of our revenue was derived from our international presence. \nSeamlessly Intuitive Experiences. \nOur customers often self-identify as non-technical and inexperienced in areas such as marketing, content creation and customer management. Because they may lack the expertise to take full advantage of powerful tools, customers may be overwhelmed as they attempt to build and maintain their business. Our solutions aim to simplify this complexity with seamlessly intuitive experiences. \nFor example, with Managed WordPress, we help reduce the complexity of launching and managing WordPress sites so our customers can stay focused on growing their business, not managing complex WordPress hosting tasks. We provide this on a fully managed platform that delivers fast performance and AI-powered site creation. With Websites + Marketing, our proprietary CMS, we incorporate seamlessly intuitive experiences by uniting marketing, content, commerce and customer management tools into a single experience.\nAdditionally, with Airo, an experience that can help proactively build and grow our customers' businesses with AI, we aim to reduce complexities for our customers through an experience that can anticipate their needs and provide solutions through informed interactions, small business industry expertise, knowledge queries and best practices. Airo can help our customers build their identity with domain searching, personalized logos, email inboxes and email templates and aims to help our customers grow \n13\nTable of Contents\ntheir business with proactive email and text messages, proposed product descriptions and social media posts, conversational UI landing pages and auto-generated product catalogs.\nWe also seek to leverage data and insights to personalize the products and experiences of our customers as well as tailor our solutions and marketing efforts to each of our customer groups. The automation and content creation abilities inherent in these tools elevate the discoverability of and engagement with our products, creating a true one-stop-shop experience. This further enhances our customers' capacity to market their products, sell online, manage their businesses and grow, all in a seamless, low-friction manner. We constantly seek to improve our website, marketing programs and customer care to intelligently respond to each stage of our customers' lifecycles and identify their specific product needs based on experimentation. This allows us to interact more frequently with our customers and understand what products work well for them. We intend to continue investing in our technology and data platforms to harness the power of generative AI to further enable our personalization efforts and make our products even more intuitive for our customers.\nPersonalized Guidance.\n Our customers deeply value expertise and know-how, which has been part of the GoDaddy DNA since our founding. Our customers' needs are highly individualized and unique to their ventures, which we believe makes operating a guidance experience – at scale – a competitive advantage.\nIn recent years, we extended this competency into several new interfaces and subject matters. These interfaces allow us to take learnings and insights gained from customer interactions to build and grow our product and service offerings and drive more thoughtful engagements for our customers. For example, within our Websites + Marketing platform, we are now creating customized action plans for our customers as they seek to market their businesses in a number of different channels based on the type of their venture and their geography. We have also significantly increased the training and engagement content available to our customers, through a number of different content forums and across platforms like YouTube and Instagram. In addition, customers who utilizeAiro-enabled solutions get access to personalized support for website content, logos, ready-to-use social media posts and more. \nGoDaddy Venture Forward Research Initiative.\n Established in 2018, GoDaddy's Venture Forward research initiative quantifies the impact that more than 20 million online businesses (measured by a unique domain and an active website) have on their economies. Most of these businesses employ fewer than ten people, categorizing each as a microbusiness. While these microbusinesses may be small, their impact on economies is outsized even though they are often too informal or too new to show up in traditional government statistics. Venture Forward’s data helps those studying, reporting on or advocating for entrepreneurs understand developing themes and insights into microbusiness/digital entrepreneurship. The data also helps us better understand our customers' mindsets, the requirements and challenges they face from start-up through more substantial developments, their aspirations as well as their current circumstances. We can also tailor topics covered by our survey to reflect current events, providing real time updates that can inform on key insights and themes from the populations surveyed. We update this information quarterly and share it to download for free.\nOperations\nHuman Capital\nOur people embody the same grit and determination as our customers. Our world-class engineers, designers, marketers and GoDaddy Guides share a passion for technology and its ability to change our customers' lives. We live by the same principles that enable our customers' ideas to survive and thrive, including owning outcomes, building value, joining forces, working courageously and living passionately. Our relentless pursuit of building value and doing right for our customers has been a crucial ingredient of our growth.\nAs of December 31, 2024, we employed 5,518 people worldwide, made up of 2,131 in care and services (who comprise a portion of our GoDaddy Guides), 2,247 in technology and development, 367 in marketing and advertising and 773 in general and administrative functions. In addition, GoDaddy partners with various third-party providers and vendors to provide contracted care and support services to our customers; approximately 3,700 individuals are employed with or engaged by our external partners. These third-party providers are primarily located in international markets, most significantly in India, the Philippines, and Malaysia. A majority of our employees are based in the U.S. and Europe. None of our U.S. employees are represented by a labor union or are party to any collective bargaining agreement in connection with his, her or their employment with us. Certain of our employees in Germany are represented by employee works councils and some other internationally based employees are represented by worker representatives in accordance with local regulations.\n14\nTable of Contents\nAt GoDaddy, we strive for a workplace culture where everyone has the opportunity to thrive. We support this goal by focusing on key human capital initiatives including: \n•\nCompensation, Pay Parity and Benefits.\n We actively work to attract a diverse employee population and are committed to providing equitable opportunity in all aspects of employment. In line with this, our compensation programs and practices are designed to compensate our employees fairly based on the work that they perform. Our Compensation and Human Capital Committee aims to design compensation programs that align our pay for performance philosophy at each stage at which compensation decisions are made, including at hire, promotion and throughout the annual compensation cycle. Since 2015, we have published an annual diversity and pay parity report and, according to our analysis, we continue to compensate our male and female employees substantially the same for performing similar jobs across the company for all entities included in our analysis. In 2017, we began reporting on our pay practices across U.S.-based employee populations and reported each year that, according to our analysis of such data, we have paid employees of color and white employees substantially the same for performing similar jobs across the company. In addition to these pay practices, we continue to offer employees a range of comprehensive and competitive benefits and well being offerings that support our human-centered approach and that allow us to attract and retain top talent.\n•\nDiversity, Equity, Inclusion and Belonging.\n At GoDaddy, we are committed to attracting, hiring, and retaining the best talent from around the world. We strive to foster a diverse, inclusive and equitable workplace where all employees have the opportunity to learn, grow, and succeed. Our employee resource groups (ERGs) play an important role in supporting these goals. ERGs are voluntary, employee-led groups open to all employees that focus on the common topics, identities, affinities, and interests that matter to our people. Aligning with our values of joining forces and respecting one another, our ERGs help employees connect with one another, feel a sense of belonging at GoDaddy, support one another’s professional development and come together.  We also continuously work to have hiring, development, and retention practices that enable GoDaddy to be an employer of choice for top talent globally. To do so, we leverage the expertise of organizations like the Human Rights Campaign, PulseLearning and VMware Women’s Leadership Innovation Lab at Stanford University to understand best practices in these areas. As we work to make opportunity more inclusive for all, we remain committed to cultivating a workplace where our employees can thrive.\n•\nTalent and Career Development.\n We commit to providing fulfilling career development opportunities for our employees. Through our learning and development initiatives, we aim to achieve three goals: (i) align employees to our company strategy and goals; (ii) connect employees through experiential learning; and (iii) grow employee skill sets for the future. We offer extensive learning opportunities to our employees spanning leadership, sales, service and technology and compliance training through e-learning, instructor-led content, video-based and blended platforms. We offer several leadership development opportunities including new manager onboarding, a leadership development program for managers and above, and a multi-month management program for our care and services managers. In addition, for our GoDaddy Guides, we offer continuing education and training programs that are immersive with environments, technology, and tools that enable active learning. We are also supporting our employees with the latest technologies to enhance and assist in productivity and learning, including AI solutions and software, such as our Guide Assist Bot, GABI, which supports our GoDaddy Guides as they provide care to our customers. \n•\nEmployee Engagement.\n We aim to create a working environment and culture in which our employees feel respected and supported to do their best work. To that end, we ensure that we are engaging, listening and responding to employee concerns through our annual anonymous employee engagement survey known as GoDaddy Voice. Approximately 84% of our employees participated in the survey in 2024. We monitor employee responses to identify areas of opportunity and set goals and expectations for improvement to ensure employees feel connected and engaged with GoDaddy's mission, our customers and their own teams. Following a comprehensive review, the key results, areas of progress and opportunity, and plans for improvement are shared with all employees. \n•\nCommunity Engagement.\n Our social impact work, overseen by our Corporate Sustainability & ESG team, is an extension of our company vision and mission. Through our global volunteer and matching programs, we enable our employees to volunteer in their communities with paid time off, and we match employee donations to qualifying nonprofits of choice up to $1,500 per employee per year or country equivalent. In addition, our employees can earn funds for qualifying nonprofits they volunteer with through our volunteer rewards program. \nOur Board and the Compensation and Human Capital Committee oversee our human capital management programs, practices and strategies. Additional information on these matters and their oversight can be found in our annual proxy statement. \n15\nTable of Contents\nOur most recently published pay parity practices and Company-wide gender and racial/ethnic representation are published in our annual sustainability report, which is available on our website along with our recent EEO-1 Report.\nTechnology and Infrastructure\nOur products, customer experiences and business systems are enabled by our technology and infrastructure to provide scalability, security and flexibility. Technology and development expenses, including those expenses related to our technology platform, were $814 million, $840 million and $794 million in 2024, 2023 and 2022, respectively. The growth in our technology and development expenses has been driven primarily by our focus on enhancing customer experiences through the use of software-driven products. Additionally, we offer Domain Registry and Corporate Domains solutions to our customers. We built a scalable infrastructure platform allowing us to optimize for economies of scale and enable next-generation hosting architecture for our customers, while investing in faster, denser and more efficient data centers, improved network connectivity and improved resiliency, both domestically and internationally. \nWe aim to provide a reliable and secure global platform and infrastructure. Our investments in technology, including engineers, patents, online security, customer privacy, reliable infrastructure and data science capabilities, enable us to innovate and deliver personalized solutions to our customers. Our API-driven technology platform is built on state-of-the-art, open source technologies like OpenStack and other large-scale, distributed systems. Additionally, our platform allows our developers to create new and enhanced products or product features assembled from common building blocks leading to faster deployment cycles. We believe our products work well together and are more valuable and easier to use together than if our customers purchased them individually from other companies and tried to integrate them. As of December 31, 2024, we had 2,247 employees in technology and development and 368 issued patents in the U.S. and other countries covering various aspects of our product offerings. Additionally, as of December 31, 2024, we had 11 pending U.S. and international patent applications and intend to file additional patent applications in the future.\nPhysical Infrastructure and Management\nOur physical technology infrastructure supports our products, experiences and business systems through servers located in data centers around the world. As a leading website hosting platform, we invest significantly in our peering architecture and underlying infrastructure management to handle significant Internet traffic at low bandwidth costs. We invest in the automation of common physical data center components like servers, load balancers, switches and storage, and we use open source solutions when possible to automate manual processes and thereby reduce the risk of human error and lower costs. Additionally, we leverage a common automated infrastructure based on OpenStack and Kernel-based Virtual Machine (KVM) to enable next-generation services. We continue to migrate many of our non-hosting products and internal systems to Amazon Web Services (AWS) and an optimized company owned cloud infrastructure. These and other efforts have reduced our managed physical footprint by approximately 80% over the last three years, and have accelerated our ability to provide speed and reliability in both our product and customer experiences. These efforts and our technology infrastructure footprint allow us to scale and provide our customers with valuable products at affordable prices.\nCustomer Experience and Business Systems\nOur platforms provide our global customers easy-to-use products, by allowing us to experiment and quickly deploy improvements incorporating our data insights. Our investments in our platform capabilities include the following:\nE-commerce Platform and Application Services. \nWe invest in the architecture and capabilities of our e-commerce platform to create an ecosystem where we can rapidly scale up or down and integrate with third-party offerings. The platform broadens our distribution channels by being extensible and allowing resellers to easily sell our products. We seek to continuously launch new and relevant applications and streamline our existing offerings to provide the best user experience to our customers.\nData Platform. \nOur horizontal data platform helps us be a trusted source of data about our customers and their online ideas through accurate, meaningful and easily consumable data insights, which allows us to build best-in-class, personalized experiences for our customers. Our data platform is key to helping us deepen our customer and business insights, which enable innovation through instrumentation, experimentation and analysis.\nContent and Marketing Platform. \nOur content and marketing platforms leverage the latest technology, operational and production models that enable us to deliver customer-centric digital experiences at an accelerated pace through multiple touchpoints and channels. Our content platform and content creation processes help us realize efficiencies and scalability, which \n16\nTable of Contents\nenhance our ability to drive new, high-quality products and customer experiences to market faster. We focus on driving advancements in experimentation, the speed and volume of content creation, localization and content self-service, while ensuring platform availability and performance. We also deliver new engagement marketing capabilities that improve business effectiveness and customer experiences.\nProduct Development\nWe continue to expand the ways we serve our customers to adjust to their changing needs from primarily domain name registration and hosting to a broader spectrum of offerings. Our primary website building products (Websites + Marketing, Managed WordPress), website security suite, email offerings (Microsoft 365), commerce products and domain aftermarket each represent significant need states that are complementary to our long-standing offerings and benefit from our strengths as a company in human-infused technology. Our key product development initiatives include:\nPowering a Simple and Effortless Presence\n. We offer a range of solutions that help our customers publish their ideas online, including Websites + Marketing and Managed WordPress. These solutions combine mobile-optimized website builders with an integrated set of marketing and e-commerce tools, all of which is enhanced with AI. We continue to invest in Websites + Marketing and other tools, templates and technology to make building, maintaining and updating a professional looking mobile or desktop presence simple and easy. We harnessed the foundational expertise we cultivated with respect to AI to introduce multiple customer-facing capabilities in generative AI across our suite of products, including Airo to deliver personalized website content, logos, domains, ready-to-use social media posts, marketing calendars, email communications and more. The automation and content creation abilities inherent in these tools elevate the discoverability of and engagement with our products, creating a true one-stop-shop experience. This further enhances our customers' capacity to market their products, sell online, manage their businesses and grow, all in a seamless, low-friction manner.\nMaking the Business of Business Easy\n. Our business applications range from domain-specific email and email marketing to telephony services and payment tools to help our customers communicate with their customers and grow their ideas. For example, GoDaddy Conversations is a communications platform that helps small businesses support, engage and convert customers through email, text, online chat, social media, voice and video conversations. GoDaddy Conversations is also integrated with Google's Business Messages, allowing customers with Websites + Marketing plans to receive messages from their customers using Google Search and Google Maps. We intend to continue investing in the breadth of our product offerings to help our customers connect with their customers and run their ventures.\nThe Next Generation of Naming\n. We are a global leader in domain name registration, with approximately 81 million domains under management. We offer easy and efficient domain name search tools through our website and mobile application, including search using business descriptions, which enables GoDaddy to better understand intent and suggest a wide variety of creative domain and business name recommendations that suit a customer's needs. Customers can now also use Airo to generate unique domain name suggestions. In addition, through GoDaddy Registry, we operate or provide back-end registry services to approximately 180 TLDs. We also offer an expanded secondary market to help match buyers to sellers who already own domains. With GoDaddy Auctions, customers can find the perfect domain or invest in an inventory of domain listings and exclusive expired auctions, and they can even watch and bid on domains at auction and stay on top of current bids with our GoDaddy Investor mobile application. We continue to invest in search, discovery and recommendation tools and transfer protocols for both primary and secondary domains. In 2024 we started preparations for and work on an approach towards our participation in the next ICANN gTLD round. These efforts will continue throughout 2025. In addition, GoDaddy Registry now provides domain name blocking that is designed to help rights holders to take control of their online identity. \nPartnering Up.\n Our flexible platform enables us to form strategic partnerships and quickly launch new products and offerings for our customers, including through partnerships such as Microsoft 365 for productivity solutions. Additionally, we have built a robust pipeline of future partnership opportunities to continue identifying value-added product and service offerings.\nHarnessing the power of generative AI for our customers. \nWe design our generative AI-powered tools and experiences to enhance our customers' discoverability of and engagement with the full suite of our product offerings and reduce the friction inherent in establishing their online presence and growing their businesses. With such tools, our customers can go from idea to domain to fully published website and content creation abilities in just minutes. In 2023, we introduced Airo, an AI-powered experience designed to build and help grow businesses online, implemented powerful generative AI tools into Websites + Marketing and brought AI-powered solutions to GoDaddy Pros with GoDaddy's AI Assistant in the Pro Hub. In 2024, we continued to build our AI-powered solutions and capabilities with the following:\n17\nTable of Contents\n•\nGoDaddy Airo\n: Continued to build Airo with increased investments in marketing initiatives to support a broader rollout to our customers, and now include Airo for customers that start with a website purchase. Airo also now provides advanced logos and imagery, as well as marketing tools to help our customers grow their businesses. \n•\nSite Optimizer: \nIntroduced our Site Optimizer tool, which can inspect any website and provide actionable recommendations to improve performance.\n•\nManaged WordPress\n: Expanded AI generated content in Managed WordPress, including optimized and enhanced models to generate content for multiple pages of our customers' websites making it easier for customers to build and publish websites.  \nHelping customers sell anything anywhere. \nOur commerce solutions are designed to grow with our customers' businesses by enabling them to seamlessly sell both offline and online, from online marketplaces and social platforms, while easily managing their sales in one place\n. \nIn 2024, we launched and upgraded the following commerce products and services: \n•\nGoDaddy Payments Canada:\n Launched our first international market for GoDaddy Payments with the expansion into the Canadian market, offering Canadian merchants the lowest pricing compared to leading Canadian providers, and similar processing and payment acceptance solutions our U.S. merchants enjoy.\n•\nTap to Pay on GoDaddy App:\n Launched Tap-to-Pay capability in the GoDaddy Mobile App for Android phones, lowering the barrier for millions of small businesses to start accepting in-person, contactless payments in a seamless, low-friction sign-up experience.\n•\nSmart Terminal Flex\n: Launched the new GoDaddy Smart Terminal Flex, a powerful and compact POS device in the GoDaddy Smart Terminal line that is powered by GoDaddy Payments.\n•\nGoDaddy Payments' Subscription Plans\n: Launched two new subscription plans for GoDaddy Payments customers that combine lower transaction fees with advanced commerce features like customized invoices and Pay Links, online ordering, inventory management capabilities, and access to GoDaddy Payments' credit card surcharge program and rate saver.\nIn the future we will continue to innovate in commerce solutions that are easy-to-use, allow our customers to sell anywhere and at industry-low card transaction pricing.\nMarketing\nWe believe GoDaddy is one of the most recognized Internet brands in the U.S. with high brand awareness globally. We established this high level of brand awareness primarily through our advertising campaigns across various platforms including television commercials, print, online and billboards and supplemented these advertising campaigns with our own entrepreneurial customers and social media influencers. Our strong brand helped us attract and retain 20.5 million customers as of December 31, 2024. We intend to continue investing in our brand as we seek to further grow our total customers. \nWe complement our brand marketing efforts with focused and metric-driven direct response marketing to acquire new customers. We use a variety of targeted online marketing programs for lead generation, including search engine marketing, search engine optimization and targeted email and social media marketing campaigns, as well as more traditional direct marketing and indirect channel partner marketing programs, to drive interest in our products and traffic to our websites. As part of this effort, we regularly run campaigns simultaneously and constantly refine our media mix across our channels.\nCentral to our international strategy is a philosophy of scaling our product offerings and customer experience and deploying them through our global infrastructure. As of December 31, 2024, we had approximately 10.0 million customers outside of the U.S. and derived approximately 32%, 32% and 33% of our total revenue from international sales in 2024, 2023 and 2022, respectively. We built a dedicated team responsible for ensuring scaling and, when necessary, the localization of our core product offerings as well as our customer care and marketing efforts. Our historical international investments have enabled us to successfully launch and expand our business outside the U.S. and as of December 31, 2024, we market and sell to customers in over 200 markets around the world. We take a rigorous approach to managing the level of investment we make and expect to make in each geographic market where we have a presence or expect to have a presence based on a market tier approach. \n18\nTable of Contents\nCompetition\nWe provide cloud-based solutions enabling individuals, businesses and organizations to establish an online presence, connect with customers and manage their ventures. The market for our products and services is highly fragmented and competitive. These types of products and solutions continue to evolve, creating opportunity for new competitors to enter the market with point-solution products or address specific segments of the market. In some instances, we use commercial partnerships with companies with which we also compete. We consider the following to be a representative list of competitors we face in some of the major areas we operate in:\n•\nWith respect to our Core Platform products and services: Newfold Digital, Namecheap, Tucows, Dynadot, GMO, Cloudflare, Let's Encrypt, SEDO, Comodo, Hostinger and Identity Digital;\n•\nWith respect to our A&C products and services: Shopify, Block, BigCommerce, Stripe, PayPal, Liquid Web, SiteGround, WP Engine, Zoho, Mindbody, Toast, Yelp, OpenTable, TikTok, Meta and WeChat; and\n•\nWith respect to both our Core Platform and A&C products and services: Wix, Squarespace, Automattic, Ionos, Google, Amazon, Microsoft, Alibaba and Tencent.\nWe believe the principal competitive factors include product capabilities meeting customer requirements, a secure, reliable and integrated technology platform, cost-effective customer acquisition, brand awareness and reputation, customer service and support and overall customer satisfaction. We believe we compete favorably with respect to each of these factors. For additional information, see \"Risk Factors.\"\nRegulation\nOur business is subject to regulation by the Internet Corporation for Assigned Names and Numbers (ICANN), federal and state laws in the U.S. and the laws of other jurisdictions in which we do business.\nICANN\n. The registration of domain names is governed by ICANN, a multi-stakeholder private sector, not-for-profit corporation formed in 1998 for the express purposes of overseeing a number of Internet related tasks, including management of the Domain Name System (DNS), allocation of IP addresses, accreditation of domain name registrars and registries and the definition and coordination of policy development for all of these functions. We are accredited by ICANN as a domain name registrar and registry and thus our ability to offer domain name registration products is subject to our ongoing relationship with, and accreditation by, ICANN. The regulation of Internet domain names in the U.S. and in foreign countries is subject to change. \nccTLD Authorities\n. The regulation of ccTLDs is governed by national regulatory agencies of the country underlying the specific ccTLDs, such as the U.S. (.us), Colombia (.co), China (.cn), Canada (.ca) and the UK (.uk). Our ability to sell ccTLDs is dependent on our and our partners' abilities to maintain accreditation in good standing with these various international authorities.\nAdvertising and promotional information presented on our websites and in our products, and our other marketing and promotional activities, are subject to federal and state consumer protection laws regulating unfair and deceptive practices. U.S. federal, state and foreign legislatures have also adopted laws, rules and regulations regulating numerous other aspects of our business. Regulations relating to the Internet, including laws governing online content, user privacy and data protection, automatic renewal laws, taxation, and liability for third-party activities, are particularly relevant to our business. A sample of such laws, rules and regulations is discussed below.\nCommunications Decency Act (CDA)\n. The CDA regulates content of material on the Internet, and provides immunity to Internet service providers and providers of interactive computer services for certain claims based on content posted by third parties. The CDA and the case law interpreting it generally provide that domain name registrars and website hosting providers cannot be liable for defamatory or obscene content posted by customers on registrars' servers unless they participate in creating or developing the content. The Stop Enabling Sex Traffickers Act and Allow States and Victims to Fight Online Sex Trafficking Act of 2017, which became effective in April 2018, amend certain portions of the CDA, which may limit the immunity previously available to us under the CDA.\nDigital Millennium Copyright Act (DMCA)\n. The DMCA provides domain name registrars and website hosting providers a safe harbor from liability for third-party copyright infringement. To qualify for the safe harbor, however, registrars and website hosting providers must satisfy numerous requirements, including adopting a user policy providing for termination of service access of users who are repeat infringers, informing users of this policy and implementing the policy in a reasonable manner. In addition, registrars and website hosting providers must expeditiously remove or disable access to content upon receiving a proper \n19\nTable of Contents\nnotice from a copyright owner alleging infringement of its protected works. A registrar or website hosting provider failing to comply with these safe harbor requirements may be found liable for copyright infringement.\nAnti-Cybersquatting Consumer Protection Act (ACPA)\n. The ACPA was enacted to address piracy on the Internet by curtailing a practice known as \"cybersquatting,\" or the bad-faith registration of a domain name identical or similar to another party's trademark, or to the name of another living person, in order to profit from that name or mark. The ACPA provides that registrars may not be held liable for damages for registration or maintenance of a domain name for another person absent a showing of the registrar's bad faith intent to profit. Registrars may, however, be held liable if their activities are deemed outside the scope of basic registrar functions.\nLanham Act\n. The Lanham Act governs trademarks and false advertising. Case law interpreting the Lanham Act has limited liability for many Internet service providers such as search engines and domain name registrars. Nevertheless, there is no statutory safe harbor for trademark violations comparable to the provisions of the DMCA, and we may be subject to a variety of trademark claims in the future.\nPrivacy and Data Protection\n. In the areas of personal privacy and data protection, the U.S. federal and various state and foreign governments have adopted or proposed limitations on, and requirements associated with, the collection, distribution, use, storage and security of personal information of individuals. In addition, in several jurisdictions in which we operate, data protection is more highly regulated and rigidly enforced. For example, the European Union (E.U.) has enacted the General Data Protection Regulation (GDPR), which includes stringent operational requirements for processors and controllers of E.U. personal data with broad extra-territorial effect and imposes significant penalties for non-compliance. In addition, California enacted the California Consumer Privacy Act in 2018, effective January 1, 2020, which was further modified by the passage of the California Privacy Rights Act (CPRA, and collectively, CCPA). The CCPA and its associated regulations require covered companies to provide specific disclosures to California consumers and afford such consumers new abilities to opt-out of certain sales and sharing of personal information for advertising and other purposes. Numerous other U.S. states have adopted or are considering laws, rules and regulations relating to processing of personal information that apply to our business. We expect compliance with the increasing number of these laws, rules and regulations to be more burdensome and costly for us. \nPayments Regulation\n. Various U.S. federal, state and international laws, rules and regulations govern the payments industry, including the Bank Secrecy Act of 1970 and state money transmitter licensing laws. Our payments services may become subject to regulation by authorities, which would subject us to, among other things, (i) record-keeping, reporting and bonding requirements, (ii) limitations on the investment of customer funds and (iii) inspection by state and federal regulatory agencies. In order to offer retail point-of-sale solutions that connect to payment networks, retail point-of-sale providers must certify their products and services with the payment card networks, financial institutions and payment processors, as well as comply with government and telecommunications company regulations including those imposed by the U.S. Federal Communications Commission (FCC) and similar telecommunications authorities worldwide.\nArtificial Intelligence\n. AI is the subject of evolving review by various governmental and regulatory agencies around the globe. For example, the E.U. has enacted the EU AI Act, which regulates the development, deployment and use of AI systems with broad extra-territorial effect. In the U.S., various laws, regulations, rules, orders and directives have been proposed or implemented relating to the development, deployment, and use of AI. The regulatory and legal requirements relating to AI are evolving rapidly. Similarly, intellectual property ownership and license rights, including copyright, surrounding AI technologies have not been fully addressed by U.S. courts or other federal or state laws, rules or regulations. We are continually monitoring developments in global AI laws, rules and regulations to evaluate and comply with requirements applicable to our business.\nLaws, rules and regulations relating to our activities are unsettled in many jurisdictions and may prove difficult or impossible to comply with in some jurisdictions. Additionally, federal, state, local and foreign governments are also considering legislative and regulatory proposals that would regulate the Internet and our activities in more and different ways than exist today. Laws, rules and regulations in the U.S. or in foreign jurisdictions may be applied in new or different manners in pending or future litigation. Further, other existing bodies of law, including the criminal laws of various jurisdictions, may be deemed to apply to our activities, or new statutes or regulations may be adopted in the future. It is also impossible to predict whether new taxes will be imposed on our services, and depending upon the type of such taxes, whether and how we would be affected. \nIntellectual Property and Proprietary Rights\nOur intellectual property and proprietary rights are important to our business. We rely on a combination of trademark, patent, copyright and trade secret laws, confidentiality and access-related procedures and safeguards and contractual provisions to protect our proprietary technologies, confidential information, brands and other intellectual property.\n20\nTable of Contents\nAs of December 31, 2024, we had 368 issued patents in the U.S. and other countries covering various aspects of our product offerings. Additionally, as of December 31, 2024, we had 11 pending U.S. and international patent applications and intend to file additional patent applications in the future. As of December 31, 2024, we had 588 registered and 55 pending trademarks in jurisdictions including the U.S., E.U., UK, China and Germany.\nWe have non-disclosure, confidentiality and license agreements with employees, contractors, customers and other third parties, which limit access to and use of our proprietary information. Though we rely in part upon these legal and contractual protections, as well as various procedural safeguards, we believe the skill and ingenuity of our employees, the functionality and frequent enhancements to our solutions and our ability to introduce new products and features meeting the needs of our customers are more important to maintaining our competitive position in the marketplace.\nWe have an ongoing trademark and service mark registration program pursuant to which we register our brand names and product names, taglines and logos in the U.S. and other countries to the extent we determine appropriate and cost-effective. We also have common law rights in some unregistered trademarks that were established over years of use. In addition, we have a trademark and service mark enforcement program pursuant to which we monitor applications filed by third parties to register trademarks and service marks that may be confusingly similar to ours, as well as the use of our major brand names in social media, domain names and other Internet sites.\nCorporate Information\nWe were incorporated in Delaware on May 28, 2014. Our principal executive offices are located at 100 S. Mill Ave, Suite 1600, Tempe, Arizona 85281, and our telephone number is (480) 505-8800.\nAvailable Information\nOur website is located at www.godaddy.com and our investor relations website is located at investors.godaddy.net. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and our Proxy Statements (including any amendments thereto) are available through our investor relations website, free of charge, as soon as reasonably practicable after we file such reports with the SEC. We also provide a link to the section of the SEC's website at www.sec.gov that has all of the reports, proxy and information statements we file or furnish with the SEC. \n21\nTable of Contents",
  "item7": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read together with our financial statements and related notes included in \"Financial Statements and Supplementary Data.\" Some of the information contained in this discussion and analysis, including information with respect to our plans and strategies for our business, includes forward-looking statements involving significant risks and uncertainties. As a result of many factors, such as those set forth in \"Risk Factors,\" actual results may differ materially from the results described in, or implied by, these forward-looking statements.\nThis section generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussion of 2022 items and comparisons between 2023 and 2022 that are not included in this Form 10-K can be found in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Form 10-K for the year ended December 31, 2023.\n(Throughout the tables and this discussion and analysis, dollars are in millions, excluding average revenue per user (ARPU), and shares are in thousands.)\nOverview\nWe serve a large market of entrepreneurs, through the development and delivery of easy-to-use products in a one stop shop solution alongside personalized guidance. We serve small businesses, individuals, organizations, developers, designers and domain investors. We manage and report our business in the following two segments:\n•\nApplications and Commerce (A&C)\n, which primarily consists of sales of products containing proprietary software, notably our website building products, as well as our proprietary commerce solutions and third-party email and productivity solutions and sales of certain products when they are included in bundled offerings of our proprietary software products.\n•\nCore Platform (Core)\n, which primarily consists of sales of domain registrations and renewals, aftermarket domain sales, domain protection, website hosting products and website security products when not included in bundled offerings of our proprietary software products as well as sales of products not containing a software component.\nWe have developed a stable and durable business model driven by strong brand recognition, seamless technology, scale of our business and customer care. We generate bookings and revenue, which help us measure the success of our efforts, from the sales of our product subscriptions. In addition, we monitor total bookings as we believe it is an indicator of the expected growth in our revenue and is a supplemental measure of the operating performance of our business. Total bookings and revenue derived from both of our product categories have increased in each of the last three years, with many of our non-domains products growing faster in recent periods.\nThe primary factors driving growth in our business are pricing and bundling, seamless technology experience, commerce, cost optimization and retention of high intent customers. Our key priorities, developments and highlights in these areas include:\nSeamless Technology and Airo\n. We continue to expand our AI-powered experiences, including Airo, and incorporate AI innovations into our products, services and throughout our operations to make use of efficiencies and increase productivity. We remain focused on expanding our solutions and operations to stay up to date with these developments in order to maintain and grow our business.\nCost Optimization and Profitability\n. During the year ended December 31, 2024, the Company engaged in cost optimization initiatives, including reductions in headcount, decreases in rent and utilities expenses, and reductions in costs associated with data center and systems infrastructure as we continue to migrate to a cloud-based infrastructure.\n58\nTable of Contents\nPricing and Bundling\n. During the year ended December 31, 2024, pricing and bundling initiatives resulted in an increase in bookings and continued strong growth in A&C revenue. We aim to continue to experiment and utilize various pricing strategies and price points for our solutions. In addition, as we continue to incorporate AI innovations into our solutions, monetization trends could be affected.\nCommerce.\n We continue to grow our commerce offerings with tailored OmniCommerce solutions, including point-of-sale systems and SaaS plans with premium features and discounted transaction fees to merchants. We also continue to enhance our offerings with new AI-powered features that simplify operations for our customers. \nCustomer Composition.\n Strong customer retention continues to drive our business. Our marketing efforts set out to educate current and potential customers about the depth and breadth of our offerings. We aim to attract high-intent customers that attach more at the outset of our relationship and over time. Our onboarding paths and seamless technology are designed to help customers more easily navigate the solutions for their one-stop-shop experience through an integrated platform. We have focused our efforts here because we know through our long history and vast amount of data that customers with a greater number of products with us retain at higher rates and produce higher lifetime value. For the year ended December 31, 2024, our customer retention rate was approximately 84%, a slight reduction from the approximate 85% in each of the four years prior, due to divestitures, migrations and the end of life of certain products as part of our efforts to streamline brands outside the GoDaddy platform. For the year ended December 31, 2024, customer retention for customers within the GoDaddy platform, which represents the vast majority of our customers, was approximately 87%. In addition, the retention rate for our customers who had been with us for over three years as of December 31, 2024 was approximately 90%. Greater than 89% of our total revenue was generated by customers who were also customers in the prior year.\nWe believe the breadth and depth of our solutions, the intelligent and proactive AI-powered experiences and the high quality and responsiveness of our customer care team builds strong relationships with our customers and are key to our high level of customer retention. To that end, we continue to monitor our customer cohorts to ensure growth and stability of our customer base. We track revenue and retention rates generated by our annual customer cohorts over time, as well as corresponding marketing and advertising spend.\nFinancial Highlights\nBelow are our key consolidated financial highlights for 2024, with comparisons to 2023.\n•\nTotal revenue of $4,573.2 million, an increase of 7.5% on a reported and constant currency basis\n(1)\n.\n•\nInternational revenue of $1,459.8 million, an increase of 5.7%, or approximately 5.8% on a constant currency basis\n(1)\n.\n•\nTotal bookings of $5,038.8 million, an increase of 9.5%, or approximately 9.7% on a constant currency basis\n(1)\n.\n•\nOperating income of $893.5 million, an increase of 63.2%.\n(2)\n•\nNet income of $936.9 million, a decrease of 31.9%.\n(2)\n•\nNormalized EBITDA\n(3)\n of $1,395.9 million, an increase of 23.0%.\n•\nNet cash provided by operating activities of $1,287.7 million, an increase of 22.9%.\n(1) \nDiscussion of constant currency is set forth in \"Quantitative and Qualitative Disclosures about Market Risk.\"\n(2) \nOur operating results for the year ended December 31, 2024 and December 31, 2023 included $39.4 million and $90.8 million, respectively, in restructuring and other charges, as further discussed in Note 14 to our financial statements. Net income for the year ended December 31, 2023 included a $971.8 million benefit for income taxes primarily due to a $1,014.0 million release of the majority of our domestic valuation allowance\n.\n(3) \nA reconciliation of Normalized EBITDA to net income, its most directly comparable GAAP financial measure, is set forth in \"Reconciliation of NEBITDA\"\n \nbelow\n.\n59\nTable of Contents\nResults of Operations\nThe following table sets forth our results of operations for the periods presented and as a percentage of our total revenue for those periods. The period-to-period comparison of financial results is not necessarily indicative of future results.\nYear Ended December 31,\n2024\n2023\n2022\n$\n% of Total Revenue\n$\n% of Total Revenue\n$\n% of Total Revenue\nRevenue: \nA&C\n$\n1,653.0 \n36.1 \n%\n$\n1,430.4 \n33.6 \n%\n$\n1,279.7 \n31.3 \n%\nCore\n2,920.2 \n63.9 \n%\n2,823.7 \n66.4 \n%\n2,811.6 \n68.7 \n%\nTotal revenue\n4,573.2 \n100.0 \n%\n4,254.1 \n100.0 \n%\n4,091.3 \n100.0 \n%\nCosts and operating expenses:\nCost of revenue (excluding depreciation and amortization)\n1,652.0 \n36.1 \n%\n1,573.6 \n37.0 \n%\n1,484.5 \n36.3 \n%\nTechnology and development\n814.4 \n17.8 \n%\n839.6 \n19.7 \n%\n794.0 \n19.4 \n%\nMarketing and advertising\n356.9 \n7.8 \n%\n352.9 \n8.3 \n%\n412.3 \n10.1 \n%\nCustomer care\n287.5 \n6.3 \n%\n304.5 \n7.2 \n%\n305.9 \n7.5 \n%\nGeneral and administrative\n394.2 \n8.6 \n%\n374.0 \n8.9 \n%\n385.5 \n9.4 \n%\nRestructuring and other\n39.4 \n0.9 \n%\n90.8 \n2.1 \n%\n15.7 \n0.4 \n%\nDepreciation and amortization\n135.3 \n3.0 \n%\n171.3 \n3.9 \n%\n194.6 \n4.7 \n%\nTotal costs and operating expenses\n3,679.7 \n80.5 \n%\n3,706.7 \n87.1 \n%\n3,592.5 \n87.8 \n%\nOperating income\n893.5 \n19.5 \n%\n547.4 \n12.9 \n%\n498.8 \n12.2 \n%\nInterest expense\n(158.3)\n(3.5)\n%\n(179.0)\n(4.2)\n%\n(146.3)\n(3.6)\n%\nLoss on debt extinguishment\n(4.6)\n(0.1)\n%\n(1.5)\n— \n%\n(3.6)\n(0.1)\n%\nOther income (expense), net\n34.8 \n0.8 \n%\n36.9 \n0.8 \n%\n7.6 \n0.2 \n%\nIncome before income taxes\n765.4 \n16.7 \n%\n403.8 \n9.5 \n%\n356.5 \n8.7 \n%\nBenefit (provision) for income taxes\n171.5 \n3.8 \n%\n971.8 \n22.8 \n%\n(3.6)\n(0.1)\n%\nNet income\n936.9 \n20.5 \n%\n1,375.6 \n32.3 \n%\n352.9 \n8.6 \n%\nLess: net income attributable to non-controlling interests\n— \n— \n%\n0.8 \n— \n%\n0.7 \n— \n%\nNet income attributable to GoDaddy Inc. \n$\n936.9 \n20.5 \n%\n$\n1,374.8 \n32.3 \n%\n$\n352.2 \n8.6 \n%\nNon-GAAP Financial Measures, Operating Metrics and Business Metrics\nIn addition to our results determined in accordance with GAAP, we believe that the following non-GAAP financial measures, operating metrics and business metrics may be useful as supplements in evaluating our ongoing operational performance:\nYear Ended December 31, \n2024\n2023\n2022\nNormalized EBITDA\n$\n1,395.9 \n$\n1,134.5 \n$\n1,013.0 \nAnnualized recurring revenue\n$\n4,042.6 \n$\n3,729.3 \n$\n3,570.1 \nTotal bookings\n$\n5,038.8 \n$\n4,603.1 \n$\n4,413.8 \nTotal customers at period end (in thousands)\n20,511 \n21,026 \n20,897 \nARPU\n$\n220 \n$\n203 \n$\n197 \nDomains under management (in thousands)\n81,013 \n83,554 \n83,857 \n60\nTable of Contents\nNormalized EBITDA (NEBITDA). \nNEBITDA is a supplemental measure of our operating performance used by management to evaluate our business. We calculate NEBITDA as net income excluding depreciation and amortization, interest expense (net), provision or benefit for income taxes, equity-based compensation expense, acquisition-related costs, restructuring-related expenses and certain other items. We believe that the inclusion or exclusion of certain recurring and non-recurring items provides a supplementary measure of our core operating results and permits useful alternative period-over-period comparisons of our operations. NEBITDA should not be viewed as a substitute for comparable GAAP measures.\nAnnualized recurring revenue (ARR).\n ARR is an operating metric defined as annualized quarterly recurring GAAP revenue, net of refunds, from new and renewed subscription-based services. ARR is exclusive of any revenue that is non-recurring, including, without limitation, domain aftermarket, domain transfers, one-time set-up or migration fees and non-recurring professional website services fees. We believe ARR helps illustrate the scale of certain of our products and facilitates comparisons to other companies in our industry.\nTotal bookings\n. Total bookings is an operating metric representing the total value of customer contracts entered into during the period, excluding refunds. We believe total bookings provides additional insight into the performance of our business and the effectiveness of our marketing efforts since we typically collect payment at the inception of a customer contract but recognize revenue ratably over the term of the contract.\nTotal customers\n. We define a customer as an individual or entity, each with a unique account and paid transactions in the trailing twelve months or with paid subscriptions as of the end of the period. Total customers is one way we measure the scale of our business and can be a contributing factor to our ability to increase our revenue base.\nAverage revenue per user (ARPU)\n. We calculate ARPU as total revenue during the preceding 12 month period divided by the average of the number of total customers at the beginning and end of the period. ARPU is one measure that provides insight into our ability to sell additional products to our customers.\nReconciliation of NEBITDA\nThe following table reconciles NEBITDA to net income, its most directly comparable GAAP financial measure:\nYear Ended December 31, \n2024\n2023\n2022\nNet income\n$\n936.9 \n$\n1,375.6 \n$\n352.9 \nDepreciation and amortization\n135.3 \n171.3 \n194.6 \nEquity-based compensation expense\n(1)\n299.1 \n294.0 \n264.4 \nInterest expense, net of interest income\n130.4 \n155.4 \n135.0 \nAcquisition-related expenses, net of reimbursements\n0.2 \n12.1 \n35.1 \nRestructuring and other\n(2)\n65.5 \n97.9 \n27.4 \nProvision (benefit) for income taxes\n(171.5)\n(971.8)\n3.6 \nNEBITDA\n$\n1,395.9 \n$\n1,134.5 \n$\n1,013.0 \n_________________________________\n(1)\nThe year ended December 31, 2024 and 2023 excludes $0.8 million and $2.3 million, respectively, of equity-based compensation expense associated with our restructuring activities, which is included within restructuring and other.\n(2)\nIn addition to the restructuring and other in our statements of operations, other charges are primarily composed of lease-related expenses associated with closed facilities, charges related to certain legal matters, adjustments to the fair value of our equity investments, expenses incurred in relation to the refinancing of our long-term debt, and incremental expenses associated with certain professional services.\nYear-Over-Year Comparison\nRevenue\nWe generate the majority of our revenue from sales of product subscriptions, as described in Note 2 to our financial statements. Our subscriptions can range from monthly terms to multi-annual terms of up to ten years, depending on the product. Revenue is presented net of refunds, and we maintain a reserve to provide for refunds granted to customers.\n61\nTable of Contents\nThe following table presents our revenue for the periods indicated:\nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nApplications and commerce\n$\n1,653.0 \n$\n1,430.4 \n$\n1,279.7 \n$\n222.6 \n16 \n%\n$\n150.7 \n12 \n%\nCore platform\n2,920.2 \n2,823.7 \n2,811.6 \n96.5 \n3 \n%\n12.1 \n0 \n%\nTotal revenue\n$\n4,573.2 \n$\n4,254.1 \n$\n4,091.3 \n$\n319.1 \n8 \n%\n$\n162.8 \n4 \n%\nTotal revenue increased 7.5%, due to the increases in our A&C and Core revenues, as described below:\nA&C\n. The 15.6% increase in A&C revenue for the year ended December 31, 2024 was driven by: (i) 20.3% growth in revenue related to our productivity applications, most notably from our pricing and bundling initiatives; (ii) 8.7% growth in revenues due to continued customer adoption of our subscription-based products designed to establish and grow an online presence; and (iii) 40.1% growth in revenue related to our commerce solutions, as continued customer adoption has resulted in an increase in payment volume.\nCore. \nThe 3.4% increase in Core revenue for the year ended December 31, 2024 was driven by 7.1% growth in domain registration and add-on revenues and 5.0% growth in aftermarket revenues due to increasing sales volume. Partially offsetting these increases was an 11.6% decrease in hosting revenues primarily due to end-of-life and migration activities from certain products and disposition of certain hosting assets.\nBookings\nThe following table presents our total bookings for the periods indicated:\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nTotal bookings\n$\n5,038.8 \n$\n4,603.1 \n$\n4,413.8 \n$\n435.7 \n9 \n%\n$\n189.3 \n4 \n%\nThe 9.5% increase in total bookings for the year ended December 31, 2024 \nwas primarily driven by continued customer adoption of our productivity solutions and related add-ons as well as \npricing and bundling initiatives\n, strength in domains, and continued strong adoption of our website-building presence products and commerce solutions.\nCosts and Operating Expenses\nCost of revenue\nCost of revenue primarily represents the direct costs incurred in connection with selling an incremental product to our customers. Such costs primarily relate to domain registration fees, payment processing fees, third-party commissions and licensing fees for third-party productivity applications. Similar to our billing practices, we pay domain costs at the time of purchase for the life of each subscription but recognize the costs of service ratably over the term of our customer contracts. The terms for domain costs are established by agreements between registries and registrars and can vary significantly depending on the top-level domain (TLD). We expect cost of revenue to increase in absolute dollars in future periods due to increased sales of domains and third-party productivity applications. However, cost of revenue may fluctuate as a percentage of total revenue, depending on the mix of products sold in a particular period.\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nCost of revenue \n$\n1,652.0 \n$\n1,573.6 \n$\n1,484.5 \n$\n78.4 \n5 \n%\n$\n89.1 \n6 \n%\nThe 5.0% increase in cost of revenue for the year ended December 31, 2024 was driven by: (i) 7.1% growth in domain registration and add-on revenues and 5.0% growth in aftermarket revenues; (ii) 20.3% growth in revenue related to our productivity applications, most notably our pricing and bundling initiatives; (iii) 8.7% growth in revenues due to continued customer adoption of our subscription-based products designed to establish and grow an online presence; and (iv) 40.1% growth in revenue related to our commerce solutions.\n62\nTable of Contents\nTechnology and development\nTechnology and development expenses represent the costs associated with the creation, development and distribution of our products and websites. These expenses primarily consist of personnel costs associated with the design, development, deployment, testing, operation and enhancement of our products, as well as costs associated with the operation of our data centers and systems infrastructure supporting those products, excluding depreciation expense. We expect technology and development expenses to decrease as a percentage of revenue in future periods following a period of investment in product development and migration toward a unified infrastructure platform.\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nTechnology and development \n$\n814.4 \n$\n839.6 \n$\n794.0 \n$\n(25.2)\n(3)\n%\n$\n45.6 \n6 \n%\nThe 3.0% decrease in technology and development expenses for the year ended December 31, 2024 was attributable to a $13.0 million decrease in personnel costs driven by lower average headcount and acquisition related employee retention payments, and a $6.8 million decrease in legal, professional, and technology license costs. Additionally, data center and systems infrastructure costs decreased by $12.4 million, offset by a $9.3 million increase in public cloud cost as we migrate to a cloud-based infrastructure.\nMarketing and advertising\nMarketing and advertising expenses represent the costs associated with attracting and acquiring customers, primarily consisting of fees paid to third parties for marketing and advertising campaigns across a variety of channels. These expenses also include personnel costs and affiliate program commissions. We expect marketing and advertising expenses to fluctuate depending on both the mix of internal and external marketing resources used, the size and scope of our future campaigns and the level of discretionary investments we make in marketing to drive future sales.\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nMarketing and advertising \n$\n356.9 \n$\n352.9 \n$\n412.3 \n$\n4.0 \n1 \n%\n$\n(59.4)\n(14)\n%\nThe 1.1% increase in marketing and advertising for the year ended December 31, 2024 was primarily attributable to increased discretionary advertising spend in support of our strategic initiatives.\nCustomer care\nCustomer care expenses represent the costs to guide and service our customers, primarily consisting of personnel costs. We expect customer care expenses to fluctuate depending on the methods of customer interaction utilized as well as the level of personnel required to support our business.\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nCustomer care \n$\n287.5 \n$\n304.5 \n$\n305.9 \n$\n(17.0)\n(6)\n%\n$\n(1.4)\n0 \n%\nThe 5.6% decrease in customer care for the year ended December 31, 2024 was attributable to a $20.1 million decrease in personnel costs driven by lower average headcount in conjunction with cost optimization initiatives including our use of alternative technologies and an increase in hiring in lower cost regions. \nGeneral and administrative\nGeneral and administrative expenses primarily consist of personnel costs for our administrative functions, professional service fees, office rent for all locations, acquisition-related expenses and other general costs. We expect general and administrative expenses to fluctuate depending on the level of personnel and other administrative costs required to support our business as well as the significance of any strategic acquisitions we choose to pursue.\n63\nTable of Contents\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nGeneral and administrative \n$\n394.2 \n$\n374.0 \n$\n385.5 \n$\n20.2 \n5 \n%\n$\n(11.5)\n(3)\n%\nThe 5.4% increase in general and administrative expenses for the year ended December 31, 2024 was primarily attributable to a $14.8 million increase in personnel costs, driven by higher stock-based compensation, and an $11.4 million increase in legal and professional costs. These increases were partially offset by a $6.1 million reduction in rent and utilities expenses, primarily the result of closed facilities and lease abandonments during 2024.\nRestructuring and other\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nRestructuring and other\n$\n39.4 \n$\n90.8 \n$\n15.7 \n$\n(51.4)\n(57)\n%\n$\n75.1 \n478 \n%\nRestructuring and other of $39.4 million during 2024 primarily includes $18.2 million in severance, employee benefits and equity-based compensation, as well as individually immaterial amounts resulting from\n non-cash impairment charges and\n abandonment of certain operating leases.\nRestructuring and other of $90.8 million during 2023 primarily includes costs incurred pursuant to restructuring activities as further discussed in Note 14 to our financial statements, as well as a charge of $17.0 million related to the termination of a revenue sharing agreement.\nDepreciation and amortization\nDepreciation and amortization expenses consist of charges relating to the depreciation of the property and equipment used in our operations and the amortization of acquired intangible assets. These expenses may increase or decrease in absolute dollars in future periods depending on our future level of capital investments in hardware and other equipment as well as the significance of any future acquisitions.\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nDepreciation and amortization \n$\n135.3 \n$\n171.3 \n$\n194.6 \n$\n(36.0)\n(21)\n%\n$\n(23.3)\n(12)\n%\nThe 21.0% decrease for the year ended December 31, 2024 was attributable to a $26.4 million decrease in amortization of acquired intangible assets driven by certain intangible assets reaching the end of their useful life and an $8.1 million decrease in depreciation primarily due to property and equipment being fully depreciated or disposed of during the period.\nInterest expense\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nInterest expense \n$\n158.3 \n$\n179.0 \n$\n146.3 \n$\n(20.7)\n(12)\n%\n$\n32.7 \n22 \n%\nThe 11.6% decrease in interest expense for the year ended December 31, 2024 was attributable to the refinancing of the 2029 Term Loans in July 2023, January 2024 and December 2024 and the 2031 Term Loans in May 2024, each of which reduced our interest margin. See Note 10 to our financial statements for additional discussion.\nOther income (expense), net\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n% change\n$ change\n% change\nOther income (expense), net\n$\n34.8 \n$\n36.9 \n$\n7.6 \n$\n(2.1)\n(6)\n%\n$\n29.3 \n386 \n%\nThe 5.7% decrease in other income (expense), net for the year ended December 31, 2024 was attributable to the $12.1 million increase in the carrying value of one of our equity investments during the year ended December 31, 2023 which did not occur during the year ended December 31, 2024 as well as a $4.8 million decrease in foreign exchange gains, driven by the \n64\nTable of Contents\nstrengthening of the USD relative to other currencies in 2024. This decrease was partially offset by a $4.4 million increase in interest income from higher invested cash balances.\nLoss on debt extinguishment\nIn 2024, we recognized a loss on debt extinguishment of $4.6 million related to the refinancing of the 2027 and 2029 Term Loans. In 2023, we recognized a loss on debt extinguishment of $1.5 million related to the refinancing of the 2029 Term Loans. See Note 10 to our financial statements for additional discussion.\nBenefit (provision) for income taxes\nAs described below, on January 1, 2024, we completed the DNC Restructure and Desert Newco was converted from a partnership to a disregarded entity for U.S. income tax purposes, which resulted in a one-time non-cash income tax benefit in the first quarter of 2024 of $267.4 million. \nDuring 2023, we released a majority of our domestic valuation allowance on a portion of our deferred tax assets resulting in a $1,014.0 million non-cash income tax benefit. This release was related to our U.S. federal and state domestic NOLs, credit carryforwards and other deferred tax assets (DTAs).\nSegment Results of Operations\nOur two operating segments, A&C and Core, reflect the way we manage and evaluate the performance of our business. Our chief operating decision maker evaluates segment performance based upon several factors, of which the primary financial measures are revenue and Segment EBITDA, our segment measure of profitability. See Note 18 to our financial statements for a reconciliation of Segment EBITDA to net income, its most directly comparable GAAP financial measure.\nApplications and Commerce\nThe following table presents the results for our A&C segment for the periods indicated:\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n%/bps change\n$ change\n%/bps change\nRevenue\n$\n1,653.0 \n$\n1,430.4 \n$\n1,279.7 \n$\n222.6 \n16 \n%\n$\n150.7 \n12 \n%\nSegment EBITDA\n$\n739.3 \n$\n594.2 \n$\n522.8 \n$\n145.1 \n24 \n%\n$\n71.4 \n14 \n%\nSegment EBITDA Margin\n44.7 \n%\n41.5 \n%\n40.9 \n%\nn/a\n320 bps\nn/a\n60 bps\nThe 24.4% increase in A&C Segment EBITDA for the year ended December 31, 2024 was attributed to a $222.6 million increase in revenue as described above. This increase was partially offset by an increase in cost of revenue resulting from 20.3% growth in revenue related to our productivity applications, most notably our pricing and bundling initiatives and increased adoption of our products containing proprietary software, a 40.1% growth in revenue related to our commerce solutions, and a $20.4 million increase in operating expenses (excluding acquisition-related costs, equity-based compensation expense and depreciation and amortization) attributable to higher technology and development costs and marketing costs.\n65\nTable of Contents\nCore Platform\nThe following table presents the results for our Core segment for the periods indicated:\n \nYear Ended December 31,\n2024 to 2023\n2023 to 2022\n \n2024\n2023\n2022\n$ change\n%/bps change\n$ change\n%/bps change\nRevenue\n$\n2,920.2 \n$\n2,823.7 \n$\n2,811.6 \n$\n96.5 \n3 \n%\n$\n12.1 \n0 \n%\nSegment EBITDA\n$\n931.7 \n$\n816.4 \n$\n783.7 \n$\n115.3 \n14 \n%\n$\n32.7 \n4 \n%\nSegment EBITDA Margin\n31.9 \n%\n28.9 \n%\n27.9 \n%\nn/a\n300 bps\nn/a\n100 bps\nThe 14.1% increase in Core Segment EBITDA for the year ended December 31, 2024 was attributed to a $96.6 million increase in revenue as described above and a $42.1 million decrease in operating expenses (excluding acquisition-related costs and equity-based compensation expense and depreciation and amortization) attributable to lower marketing, customer care and technology and development costs. Partially offsetting these increases was an increase in cost of revenue due to 7.1% growth in domain registration and add-on revenues and 5.0% growth in aftermarket revenues.\nLiquidity and Capital Resources\nOverview\nOur principal sources of liquidity have been cash flow generated from operations and long-term debt borrowings. Our principal uses of cash have been to fund operations and capital expenditures, to make mandatory principal and interest payments on our long-term debt and to effectuate our share repurchase program. Our liquidity position also benefits from U.S. and state DTAs such that we have not historically paid a significant amount of U.S. federal or state income taxes.\nIn general, we seek to deploy our capital by focusing on requirements for our operations, on growth investments and on stockholder returns. Our strategy is to deploy capital, whether debt, equity or internally generated cash, depending on the adequacy and availability of the source of capital and which source may be used most efficiently and at the lowest cost at such time. Therefore, while cash from operations is our primary source of operating liquidity and we believe our internally-generated cash flows are sufficient to support our day-to-day operations, we may use a variety of capital sources to fund our needs for less predictable investment decisions such as strategic acquisitions and share repurchases.\nWe believe our existing cash and cash equivalents and cash generated by operating activities will be sufficient to meet our anticipated operating cash needs for at least the next 12 months. However, our future capital requirements will depend on many factors, including our growth rate, macroeconomic activity, the timing and extent of spending to support domestic and international development efforts, continued brand development and advertising spend, the level of customer care and general and administrative activities, the introduction of new and enhanced product offerings, the costs to support new and replacement capital equipment, the completion of strategic acquisitions or share repurchases. Should we pursue additional strategic acquisitions or share repurchases, we may need to raise additional capital, which may be in the form of long-term debt or equity financings.\n66\nTable of Contents\nCash Flows\nThe following table summarizes our cash flows for the periods indicated:\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNet cash provided by operating activities\n$\n1,287.7 \n$\n1,047.6 \n$\n979.7 \nNet cash provided by (used in) investing activities\n21.5 \n(102.4)\n(132.0)\nNet cash used in financing activities\n(677.4)\n(1,261.7)\n(1,326.7)\nEffect of exchange rate changes on cash and cash equivalents\n(1.6)\n1.3 \n(2.7)\nNet increase (decrease) in cash and cash equivalents\n$\n630.2 \n$\n(315.2)\n$\n(481.7)\nOperating Activities\nOur primary source of cash from operating activities has been cash collections from our customers. Our primary uses of cash from operating activities have been for domain registration costs paid to registries, software licensing fees related to third-party productivity solutions, personnel costs, discretionary marketing and advertising costs, technology and development costs and interest payments. We expect cash outflows from operating activities to be affected by the timing of payments we make to registries and other operating costs as we continue to grow our business.\nNet cash provided by operating activities increased $240.1 million from $1,047.6 million in 2023 to $1,287.7 million in 2024, primarily driven by the growth in total bookings. Bookings growth was due to strong adoption across our A&C product suite, particularly within productivity solutions as a result of our pricing and bundling initiatives, as well as continued strength in domains. The increase was also driven by lower restructuring related payments as well as lower technology and development related spending.\nInvesting Activities\nOur investing activities generally consist of strategic acquisitions, dispositions and purchases of property and equipment to support the overall growth of our business. We expect our investing cash flows to be affected by the timing of payments we make for capital expenditures, strategic acquisitions or other growth opportunities we decide to pursue.\nNet cash provided by investing activities increased $123.9 million from $102.4 million net cash used in 2023 to $21.5 million net cash provided in 2024, \ndue to maturities of short-term investments of $40.0 million, a \n$15.4 million reduction in \ncapital expenditures and \n$35.4 million of \nintangible asset purchases that occurred in 2023.\nFinancing Activities\nOur financing activities generally consist of long-term debt borrowings, the repayment of principal on long-term debt, stock option exercises, Employee Stock Purchase Plan (ESPP) proceeds and share repurchases.\nNet cash used in financing activities decreased $584.3 million from $1,261.7 million used in 2023 to $677.4 million used in 2024, primarily due to a $593.7 million decrease in share repurchases.\nDeferred Revenue\nSee Note 8 to our financial statements for details regarding the expected future recognition of deferred revenue.\nOff-Balance Sheet Arrangements\nAs of December 31, 2024 and 2023, we had no off-balance sheet arrangements that had, or which are reasonably likely to have, a material effect on our financial statements.\n67\nTable of Contents\nMaterial Cash Requirements and Uses of Cash\nCredit Facility and Senior Notes\nOur long-term debt consists of the Credit Facility, which includes two tranches of term loans and a revolving credit facility, and the Senior Notes. In December 2024, we entered into an amendment to the Credit Facility to provide for a new tranche of term loans maturing in 2029 (the 2029 Term Loans). In May 2024, we entered into an amendment to the Credit Facility to provide for a new tranche of term loans maturing in 2031 (the 2031 Terms Loans), the proceeds of which were used to refinance and extend the maturity of all outstanding 2027 Term Loans and repay a portion of our 2029 Term Loans. See Note 10 to our financial statements for additional information regarding our long-term debt.\nOur long-term debt agreements contain covenants restricting, among other things, our ability, or the ability of our subsidiaries, to incur indebtedness, issue certain types of equity, incur liens, enter into fundamental changes including mergers and consolidations, sell assets, make restricted payments including dividends, distributions and investments, prepay junior indebtedness and engage in operations other than in connection with acting as a holding company, subject to customary exceptions. As of December 31, 2024, we were in compliance with all such covenants and had $998.7 million available for borrowing under the Revolver.\nAs discussed in Note 11 to our financial statements, we have hedged a portion of our long-term debt through the use of cross-currency and interest rate swap derivative instruments. These instruments help us manage and mitigate our risk of exposure to changes in foreign currency exchange rates and interest rates. See \"Quantitative and Qualitative Disclosures About Market Risk\" for additional discussion of our hedging activities.\nShare Repurchases\nAs discussed in Note 5 to our financial statements, we are authorized to repurchase up to $4,000.0 million of our Class A common stock. During the year ended December 31, 2024, we repurchased a total of 5,179 shares of our Class A common stock in the open market and through accelerated share repurchase (ASR) transactions for an aggregate purchase price of $668.1 million.\nAs of December 31, 2024, we had $767.4 million of remaining authorization available for repurchases.\nRestructuring and Other\nAs discussed in Note 14 to our financial statements, we undertook restructuring activities in 2024. Cash payments of $24.4 million related to restructuring activities were made during 2024, with approximately $0.8 million remaining to be paid in 2024 relating to the restructuring activities undertaken during \nthe year. We expect to make substantially all remaining restructuring payments pursuant to these activities by the end of the second quarter of 2025.\nCritical Accounting Policies and Estimates\nWe prepare our financial statements in accordance with GAAP, and in doing so, we make estimates, assumptions and judgments affecting the reported amounts of assets, liabilities, revenues and expenses, as well as the related disclosure of contingent assets and liabilities. We base our estimates, assumptions and judgments on historical experience and on various other factors we believe to be reasonable under the circumstances, and we evaluate these estimates, assumptions and judgments on an ongoing basis. Different assumptions and judgments could change the estimates used in the preparation of our financial statements, which, in turn, could change our results from those reported. We refer to estimates, assumptions and judgments of this type as our critical accounting policies and estimates, which we discuss further below. We review our critical accounting policies and estimates with the audit and finance committee of our board of directors on an annual basis.\nOf our significant accounting policies, which are described in Note 2 to our financial statements, the following accounting policies and specific estimates involve a greater degree of judgement and complexity. Accordingly, these are the policies we believe are the most critical to aid in fully understanding and evaluating our consolidated financial condition and operating results.\n68\nTable of Contents\nRevenue Recognition\nRevenue is recognized when control of a promised good or service (product) is transferred to the customer, in an amount reflecting the consideration we expect to be entitled to in exchange for such product. Revenue is recognized net of allowances for returns and applicable transaction taxes collected from customers. Refunds are estimated at contract inception using the expected value method based upon historical refund experience. Domain registration and renewal revenue is recognized ratably over the registration period as the customer simultaneously receives and consumes the benefits over the contract term. For each domain registration or renewal, we have one performance obligation consisting of two promises to ensure: (1) the customer has exclusive use of the domain during the applicable registration term and (2) the domain is accessible and appropriately directed to its underlying content. After the contract term expires, unless renewed, the customer can no longer access or use the domain. We have determined these promises are not distinct within our contracts as they are highly interdependent and interrelated and are inputs to a combined benefit. Accordingly, we concluded that each domain registration or renewal represents one product offering and is a single performance obligation.\nWe sell our products directly to customers and also through a network of resellers. In certain cases, we act as a reseller of products provided by others. We record revenue on a gross basis when we are the principal in the arrangement and on a net basis when we are an agent. The determination of whether we are a principal or an agent is dependent on whether we control the specific good or service before it is transferred to the customer, including whether we have primary fulfillment responsibility and obligation to perform the services being sold to the customer, whether we have inventory risk and whether we have latitude in establishing pricing. Revenue associated with sales of certain third party solutions, including Microsoft 365, where we act as a reseller of products provided by others is recorded on a gross basis as we have determined that we control the product before transferring it to our end customers. Revenue associated with aftermarket domain sales, excluding certain immaterial reseller arrangements, is recorded on a gross basis as we have determined that we take control of the domain before transferring it to our end customers. The determination of gross or net revenue recognition is reviewed on a product-by-product basis.\nSee Notes 2 and 8 to our financial statements for additional information regarding revenue recognition and deferred revenue.\nAcquisitions\nWe determine whether substantially all of the fair value of assets acquired is concentrated in a single identifiable asset or a group of similar identifiable assets. If this threshold is met, the single asset or group of assets, as applicable, is accounted for as an asset acquisition. If the threshold is not met, further assessment is undertaken to ascertain whether the acquisition meets the definition of a business.\nWe include the results of operations of acquired businesses in our financial statements as of the respective dates of acquisition. Accounting for business acquisitions requires us to make significant estimates and assumptions, especially at the acquisition date, with respect to tangible and intangible assets acquired, liabilities assumed and pre-acquisition contingencies. The purchase price, including estimates of the fair value of contingent consideration when applicable, is allocated to the tangible and intangible assets acquired and the liabilities assumed based on their estimated fair values on the respective acquisition dates, with the excess recorded as goodwill. Critical estimates used in valuing certain acquired intangible assets include, but are not limited to, future expected cash flows (primarily from customer relationships and developed technology) and discount rates.\nContingent consideration liabilities, which relate to future earn-out payments associated with our acquisitions, are generally valued using discounted cash flow valuation methods. Critical estimates used in valuing these liabilities include estimated operating results scenarios for the applicable performance periods, probability weightings assigned to operating results scenarios and discount rates.\nWe use our best estimates and assumptions to determine acquisition-date fair values. These estimates are inherently uncertain and subject to refinement. We continue to collect information and reevaluate our preliminary estimates and assumptions and record any qualifying measurement period adjustments to goodwill. Contingent consideration is adjusted to fair value in subsequent periods as an increase or decrease in general and administrative expenses.\nSee Notes 2 and 3 to our financial statements for additional information regarding business acquisitions.\n69\nTable of Contents\nIndefinite-Lived Intangible Assets\nWe make estimates, assumptions and judgments when valuing indefinite-lived intangible assets in connection with the initial purchase price allocations of business acquisitions, as well as when evaluating the recoverability of our indefinite-lived intangible assets on an ongoing basis. We assess our indefinite-lived intangible assets for impairment at least annually during the fourth quarter. We will also perform an assessment at other times if and when events or changes in circumstances indicate the carrying value of these assets may not be recoverable.\nWe perform our impairment assessment based on qualitative analysis, which includes considering various factors including macroeconomic conditions, industry and market conditions and our historical and projected operating results. If, based on our qualitative analysis, we were to determine it is more-likely-than-not that the indefinite-lived intangible asset is impaired, a quantitative impairment test would be performed to determine if an impairment loss should be recorded.  \nOur qualitative assessment during 2024 indicated it was more-likely-than-not that certain indefinite-lived intangible assets were impaired. We performed a quantitative impairment test and recognized an immaterial non-cash impairment charge which was included within restructuring and other in our consolidated statement of operations. Our qualitative assessment during 2023 and 2022 did not indicate any impairment.\nSee Notes 2 and 4 to our financial statements for additional information regarding indefinite-lived intangible assets.\nIncome Taxes\nWe are subject to U.S. federal, state and foreign income taxes with respect to our allocable share of any taxable income or loss of Desert Newco, as well as any stand-alone income or loss we generate. On December 11, 2023, we completed a series of transactions (the DNC Restructure) designed to simplify our then-existing capital structure, commonly referred to as an \"Up-C\" structure, and provide us with additional strategic flexibility. Completion of these transactions resulted in Desert Newco becoming a wholly-owned subsidiary of GoDaddy Inc. Subsequent to the DNC Restructure, on January 1, 2024, Desert Newco was converted from a partnership to a disregarded entity and as a result we are now treated as a consolidated C corporation group for U.S. income tax purposes. Judgment is required in determining our provision or benefit for income taxes and in evaluating uncertain tax positions.\nWe account for income taxes under the asset and liability method, which requires the recognition of deferred tax assets (DTAs) \nand d\neferred tax liabilities (DTLs) for the expected future tax consequences of events included in our financial statements. Under this method, we determine DTAs and DTLs on the basis of the differences between the financial statement and tax bases of assets and liabilities by using enacted tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on DTAs and DTLs is recognized in income in the period in which the enactment date occurs.\nWe recognize DTAs to the extent we believe these assets are more-likely-than-not to be realized. In evaluating our ability to realize our DTAs, in full or in part, we consider all available positive and negative evidence, including future reversals of existing taxable temporary differences, projected future taxable income, prudent and feasible tax planning strategies and recent results of operations. The assumptions utilized in determining future taxable income require judgment and are consistent with the plans and estimates we use to manage our business. Actual operating results in future years could differ from our current assumptions, judgments and estimates, which could have a material impact on the amount of DTAs we ultimately realize. We continue to maintain a valuation allowance against t\nhe DTAs f\nor which we have concluded it is more-likely-than-not they will not be realized due to certain limitations on character or carryforward period.\nWe recognize tax benefits from uncertain tax positions only if it is more-likely-than-not the tax position will be sustained on examination by the taxing authorities based on the technical merits of the position. The tax benefits recognized from such positions are measured based on the largest benefit having a greater than 50% likelihood of being realized.\nSee Notes 2 and 16 to our financial statements for additional information regarding income taxes.\nRecent Accounting Pronouncements\nFor information regarding recent accounting pronouncements, see Note 2 to our financial statements.\n70\nTable of Contents",
  "item2": null
}