{
  "source_file": "gehc-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial results should be read in conjunction with the condensed consolidated financial statements and corresponding notes (the “financial statements”) included elsewhere in this Quarterly Report on Form 10-Q. The following discussion and analysis provide information management believes to be relevant to understanding the financial results of GE HealthCare Technologies Inc. and its subsidiaries (“GE HealthCare,” the “Company,” “our,” “us,” or “we”) for the three and nine months ended September 30, 2025 and 2024. For a full understanding of our financial condition and results of operations, the below discussion should be read alongside the Management’s Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. This discussion contains forward-looking statements that are based upon current expectations and are subject to uncertainty and changes in circumstances; see “Forward-Looking Statements.” Our actual results could differ materially from the results contemplated by these forward-looking statements due to a number of factors, including those discussed below and elsewhere in this Quarterly Report on Form 10-Q, and particularly in Item 1A,\n \n“Risk Factors” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nOn January 3, 2023, General Electric Company, which now operates as GE Aerospace (“GE”), completed the spin-off of GE HealthCare Technologies Inc. (the “Spin-Off”).\nThe following tables are presented in millions of United States (“U.S.”) dollars unless otherwise stated, except for per-share amounts which are presented in U.S. dollars. Certain columns and rows may not sum due to the use of rounded numbers. Percentages presented are calculated from the underlying whole-dollar amounts and, unless otherwise stated, represent changes year-over-year.\nGE HealthCare’s operations are organized and managed through four reportable segments: Imaging, Advanced Visualization Solutions (“AVS”), Patient Care Solutions (“PCS”), and Pharmaceutical Diagnostics (“PDx”), and we assessed their performance using Segment revenues and Segment EBIT. For additional information on our segments, refer to Note 3, “Segment Information.”\nTRENDS AND FACTORS IMPACTING OUR PERFORMANCE\nWe believe that our performance and future success depend on a number of factors that present significant opportunities for us but also pose risks and challenges, including those discussed below and particularly in Item 1A,\n \n“Risk Factors” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. \nKEY TRENDS AFFECTING RESULTS OF OPERATIONS.\nGlobal Trade and Macroeconomic Environment\nThroughout 2025, the U.S. has imposed a variety of new tariffs on most imports from all countries in the world. This in turn prompted several countries to announce tariffs on U.S. imports. While the situation continues to be fluid, tariffs materially impacted our current year profitability and cash flows, primarily the bilateral U.S. and Chinese tariffs and U.S. tariffs on all other global import suppliers. Should the tariffs continue at formally communicated levels, we expect to continue to see a material impact to our financial results through the incurrence of additional costs. Additional tariffs or other trade restrictions by the U.S. or other countries where we do significant business, or other restrictions on specific industries, such as pharmaceuticals, could further materially impact our results in the future. While we are taking actions to mitigate the impact of tariffs, we do not expect to be able to fully offset the additional costs or other negative impacts resulting from the tariffs.\nWe continue to monitor the global markets in which we operate for changes in customer behavior, changes in government spending and reimbursement, and indirect impacts from the tariffs. Should these factors dampen economic growth, slow global trade, or impact inflation, we could see adverse impacts to our business as our customers adapt to the change in economic environment. We continue to monitor potential impacts on purchasing decisions by both public and private customers in China and other markets as a result of the current trade environment, as well as other actions related to tariffs and trade frictions, investigations, or activities that could similarly increase our costs or otherwise impact our business. In addition, if negative sentiment towards U.S. companies influences the purchasing decisions of global customers, our business could be impacted materially.\nChina Market\nWe continue to monitor developments in the market in China. In March 2024, the government in China announced a stimulus program (“2024 stimulus”) that includes the healthcare sector and is being implemented through China’s provinces. We expect the 2024 stimulus program will result in opportunities for our business in China in the longer term, but it has had short-term impacts as provinces develop and announce their plans and customers begin to make purchasing decisions, which has progressed slower than originally anticipated. We expect these delays to continue to impact our orders and revenues in the near term, although we are unable to predict the exact duration or magnitude of the impact. We believe the focus of government policy in China on expanding access to healthcare should benefit our business in China in the long term.\n31\nTable of Contents\n    \n         \nRussia and Ukraine Conflict\nWe had $241 million and $162 million of assets in, or directly related to, Russia and Ukraine as of September 30, 2025 and December 31, 2024, respectively, none of which are subject to sanctions that impact the carrying value of the assets. We generated revenues of $209 million and $243 million from customers in these two countries for the nine months ended September 30, 2025 and 2024, respectively. The potential inability to repatriate earnings from these two countries will not have a material impact on our ability to operate.\nWe continue to monitor the effects of Russia’s invasion of Ukraine, including the consideration of financial impact, cybersecurity risks, the applicability and effect of sanctions, and the employee base in Ukraine and Russia. Under the current U.S. Department of Commerce regulations, we are permitted to export, re-export, or transfer medical equipment and spare parts that meet stated criteria under a License Exception, which has eliminated the need for us to obtain individual U.S. licenses in most cases; however, licenses still may be needed for some transactions. The European Union and other countries have also expanded licensing requirements for certain spare parts, services, software, and other items. We will continue to apply for licenses to supply to these customers and to support our business in Russia, as required. The implementation of these measures affected our ability to supply customers in Russia during the nine months ended September 30, 2025 and 2024 and will continue to do so as we confirm applicability of the U.S. License Exception to our transactions and continue to obtain licenses. There is no guarantee we will obtain all of the licenses for which we applied, that any approvals we obtain will be on a timely basis, or that our business in Russia will not be further disrupted due to evolving legal or operational considerations. We will continue to assess whether developments related to the conflict have had, or are reasonably likely to have, a material impact on the Company.\nGeopolitical Conflicts\nGeopolitical instability, including recent conflicts in the Middle East, could adversely impact our operations, supply chains, and logistics. These events may result in increased costs, delays in product deliveries, and challenges in maintaining service levels in affected areas. While these events have not materially impacted our operations, we continue to monitor these developments closely.\nRecent U.S. Legislation\nOn July 4, 2025, the One Big Beautiful Bill Act was signed into U.S. law, which includes, among other things, significant changes to the federal income tax system, as well as U.S. healthcare policy. While the changes did not have a material impact to the Company’s tax provision for the three months ended September 30, 2025, we continue to evaluate the non-income tax impacts on our business.\nSUMMARY OF KEY PERFORMANCE MEASURES\nManagement reviews and analyzes several key performance measures including Total revenues, Operating income, Net income attributable to GE HealthCare, Earnings per share, and Cash from (used for) operating activities. Management also reviews and analyzes Organic revenue*, Adjusted earnings before interest and taxes* (“Adjusted EBIT*”), Adjusted net income*, Adjusted tax expense*, Adjusted effective tax rate* (“Adjusted ETR*”), Adjusted earnings per share*, and Free cash flow*, which are non-GAAP financial measures. These measures are reviewed and analyzed in order to evaluate our business performance, identify trends affecting our business, allocate capital, and make strategic decisions, including those discussed below. See “Results of Operations” and “Liquidity and Capital Resources” below for further discussion on our key performance measures.\nThe non-GAAP financial measures should be considered along with the most directly comparable U.S. GAAP financial measures. Definitions of these non-GAAP financial measures, a discussion of why we believe they are useful to management and investors as well as certain of their limitations, and reconciliations to their most directly comparable U.S. GAAP financial measures are provided below under “Non-GAAP Financial Measures.”\n____________________\n*Non-GAAP Financial Measure\n32\nTable of Contents\n    \n         \nRESULTS OF OPERATIONS\nThe following tables set forth our results of operations for each of the periods presented.\nCondensed Consolidated Statements of Income (Unaudited)\nFor the three months ended September 30\nFor the nine months ended September 30\n2025\n2024\n2025\n2024\nSales of products\n$\n3,375\n$\n3,201\n$\n9,755\n$\n9,454\nSales of services\n1,769\n1,662\n5,172\n4,899\nTotal revenues\n5,143\n4,863\n14,927\n14,353\nCost of products\n2,270\n2,033\n6,392\n6,045\nCost of services\n884\n805\n2,549\n2,378\nGross profit\n1,990\n2,026\n5,987\n5,930\nSelling, general, and administrative\n1,045\n1,034\n3,114\n3,139\nResearch and development\n292\n316\n937\n967\nTotal operating expenses\n1,337\n1,350\n4,051\n4,106\nOperating income\n653\n676\n1,936\n1,824\nInterest and other financial charges – net\n111\n130\n335\n383\nNon-operating benefit (income) costs\n(75)\n(102)\n(222)\n(306)\nOther (income) expense – net\n(26)\n(9)\n(124)\n(1)\nIncome before income taxes\n643\n658\n1,947\n1,747\nBenefit (provision) for income taxes\n(179)\n(168)\n(395)\n(435)\nNet income\n464\n490\n1,552\n1,312\nNet (income) loss attributable to noncontrolling interests\n(18)\n(19)\n(57)\n(40)\nNet income attributable to GE HealthCare\n$\n446\n$\n470\n$\n1,495\n$\n1,272\nTOTAL REVENUES.\nRevenues by Segment\nFor the three months ended September 30\nFor the nine months ended September 30\n2025\n2024\n% change\n% organic* change\n2025\n2024\n % change\n % organic*\n change\nSegment revenues\nImaging\n    \n$\n2,349\n$\n2,229\n5%\n4%\n$\n6,693\n$\n6,462\n4%\n3%\nAVS\n    \n1,301\n1,216\n7%\n6%\n3,829\n3,692\n4%\n4%\nPCS\n    \n731\n779\n(6)%\n(7)%\n2,262\n2,298\n(2)%\n(2)%\nPDx\n    \n749\n625\n20%\n10%\n2,110\n1,862\n13%\n7%\nOther\n(1)\n     \n15\n15\n33\n39\nTotal revenues\n    \n$\n5,143\n$\n4,863\n6%\n4%\n$\n14,927\n$\n14,353\n4%\n3%\n(1) Financial information not presented within the reportable segments, shown within the Other category, represents HealthCare Financial Services which does not meet the definition of an operating segment.\nRevenues by Region\nFor the three months ended September 30\nFor the nine months ended September 30\n2025\n2024\n% change\n2025\n2024\n % change\nUnited States and Canada (“USCAN”)\n    \n$\n2,358\n$\n2,246\n5%\n$\n6,934\n$\n6,582\n5%\nEurope, the Middle East, and Africa (“EMEA”)\n    \n1,360\n1,237\n10%\n3,802\n3,617\n5%\nChina region\n    \n547\n564\n(3)%\n1,704\n1,745\n(2)%\nRest of World\n    \n879\n816\n8%\n2,487\n2,408\n3%\nTotal revenues\n    \n$\n5,143\n$\n4,863\n6%\n$\n14,927\n$\n14,353\n4%\nFor the \nthree months ended\n September 30, 2025\nTotal revenues were $5,143 million, growing 6% as reported and 4% organically*. Sales of products increased 5% or $174 million primarily driven by strong growth in PDx, Imaging, and AVS revenues. Sales of services increased 6% or $107 million primarily driven by growth in new and existing customer contractual agreements.\n____________________\n*Non-GAAP Financial Measure\n33\nTable of Contents\n    \n         \nThe segment revenues were as follows:\n•\nImaging segment revenues were $2,349 million, growing 5% or $120 million, led by growth in the EMEA and USCAN regions;\n•\nAVS segment revenues were $1,301 million, growing 7% or $84 million, with strength in the U.S. market;\n•\nPCS segment revenues were $731 million, decreasing 6% or $48 million, primarily driven by a product hold; and\n•\nPDx segment revenues were $749 million, growing 20% or $124 million as reported, driven by the acquisition of Nihon Medi-Physics Co., Ltd. (“NMP”) and an increase in Organic revenue*. Organic revenue* grew 10% driven by continued growth in volume and price.\nThe regional revenues were as follows:\n•\nUSCAN revenues were $2,358 million, growing 5% or $112 million with growth across AVS, PDx, and Imaging segment revenues, partially offset by a decline in PCS revenues;\n•\nEMEA revenues were $1,360 million, growing 10% or $123 million, with growth in Imaging, AVS, and PDx revenues, as well as favorable foreign currency impacts;\n•\nChina region revenues were $547 million, decreasing 3% or $17 million due to a decrease in AVS and PCS revenues, partially offset by growth in PDx revenues; and\n•\nRest of World revenues were $879 million, growing 8% or $63 million due to growth in PDx revenues, inclusive of NMP revenues, and Imaging revenues.\nFor the nine months ended September 30, 2025\nTotal revenues were $14,927 million\n, \ngrowing 4% as reported and 3% organically*. Sales of products increased 3% or $301 million primarily driven by strong growth in PDx, AVS, and Imaging revenues. \nSales of services increased \n6%\n or $\n274\n million primarily driven by\n growth in new and existing customer contractual agreements\n.\nThe segment revenues were as follows:\n•\nImaging segment revenues were $6,693 million, growing 4% or $231 million, with growth in the USCAN and EMEA regions, partially offset by continued pressure in the China market;\n•\nAVS segment revenues were $3,829 million, growing 4% or $138 million with strength in the U.S. market, partially offset by continued pressure in the China market;\n•\nPCS segment revenues were $2,262 million, decreasing 2% or $36 million, largely driven by a challenging year-over-year comparison in Life Support Solutions; and\n•\nPDx segment revenues were $2,110 million, growing 13% or $248 million as reported, driven by the acquisition of NMP and an increase in Organic revenue*. Organic revenue* grew 7% driven by continued growth in volume and price.\nThe regional revenues were as follows:\n•\nUSCAN revenues were $6,934 million, growing 5% or $352 million with growth across AVS, Imaging, and PDx segment revenues, partially offset by a decline in PCS revenues;\n•\nEMEA revenues were $3,802 million, growing 5% or $185 million with growth in Imaging, PDx, and AVS revenues, as well as favorable foreign currency impacts;\n•\nChina region revenues were $1,704 million, decreasing 2% or $41 million with declines in Imaging, AVS, and PCS revenues partially offset by growth in PDx revenues; and\n•\nRest of World revenues were $2,487 million, growing 3% or $79 million with growth in PDx revenues, inclusive of NMP revenues, partially offset by unfavorable foreign currency impacts.\n____________________\n*Non-GAAP Financial Measure\n34\nTable of Contents\n    \n         \nOPERATING INCOME, NET INCOME ATTRIBUTABLE TO GE HEALTHCARE, ADJUSTED EBIT*, AND ADJUSTED NET INCOME*.\nFor the three months ended September 30\nFor the nine months ended September 30\n2025\n% of Total revenues\n2024\n% of Total revenues\n% change\n2025\n% of Total revenues\n2024\n% of Total revenues\n % change\nOperating income\n    \n$\n653\n12.7%\n$\n676\n13.9%\n(3)%\n$\n1,936\n13.0%\n$\n1,824\n12.7%\n6%\nNet income attributable to GE HealthCare\n446\n8.7%\n470\n9.7%\n(5)%\n1,495\n10.0%\n1,272\n8.9%\n18%\nAdjusted EBIT*\n761\n14.8%\n795\n16.3%\n(4)%\n2,205\n14.8%\n2,217\n15.4%\n(1)%\nAdjusted net income*\n490\n9.5%\n521\n10.7%\n(6)%\n1,441\n9.7%\n1,393\n9.7%\n3%\nFor the \nthree months ended\n September 30, 2025\nOperating income was $653 million, a decrease of $23 million and 120 basis points as a percent of Total revenues. The decrease was due to the following factors: \n•\nGross profit decreased $36 million or 300 basis points as a percent of Total revenues primarily due to an increase in both Cost of products sold and Cost of services sold as a percent of Total revenues. Cost of products sold increased $237 million or 380 basis points as a percent of Sales of products. The increase as a percent of sales was driven primarily by cost inflation, including the impact of incremental tariffs, and investment in design follow-through. Cost of services sold increased $79 million or 160 basis points as a percent of Sales of services. The increase as a percent of sales was driven by unfavorable mix within our service offerings and cost inflation, including the impact of incremental tariffs, partially offset by an increase in pricing of our service offerings. Included in our total cost of revenues as part of our product investment was $134 million in engineering costs for design follow-through on new product introductions and product lifecycle maintenance subsequent to the initial product launch, compared to $102 million for the prior year comparable period; and\n•\nTotal operating expenses decreased $13 million primarily due to a decrease in Research and development (“R&D”) of $25 million, driven by certain programs achieving development milestones resulting in costs to be reported under cost of revenues, partially offset by an increase in Selling, general, and administrative (“SG&A”) expense of $11 million, primarily driven by increased investment in our commercial teams and the acquisition of NMP, largely offset by a decrease in Spin-Off and separation costs. R&D as a percentage of Total revenues decreased by 80 basis points and SG&A as a percentage of Total revenues decreased by 90 basis points.\nNet income attributable to GE HealthCare and Net income margin were $446 million and 8.7%, a decrease of $24 million and 100 basis points, respectively, primarily due to the following factors:\n•\nOperating income decreased $23 million, as discussed above;\n•\nInterest and other financial charges – net decreased $19 million primarily driven by debt repayment and continued optimization;\n•\nNon-operating benefit income decreased $27 million primarily due to lower expected returns on plan assets; \n•\nOther income – net increased $17 million primarily driven by an increase in Net financing income and investment income (loss) as disclosed in Note 16, “Supplemental Financial Information”; and\n•\nProvision for income taxes increased $11 million primarily due to U.S. and foreign tax law changes offset by the use of tax attributes from updating our global structure following the Spin-Off. For additional detail regarding our income taxes, see Note 10, “Income Taxes.”\nAdjusted EBIT* and Adjusted EBIT margin* were $761 million and 14.8%, a decrease of $33 million and 150 basis points, respectively, primarily due to a decrease in Operating income, as discussed above.\nAdjusted net income*\n \nwas $490 million, a decrease of $31 million primarily due to a decrease in Operating income and higher Provision for income taxes, partially offset by lower Interest and other financial charges – net.\nFor the nine months ended September 30, 2025\nOperating income was $1,936 million, an increase of $112 million and 30 basis points as a percent of Total revenues. The increase was due to the following factors: \n____________________\n*Non-GAAP Financial Measure\n35\nTable of Contents\n    \n         \n•\nGross profit increased $57 million, but decreased 120 basis points as a percent of Total revenues primarily due to an increase in both Cost of products and Cost of services as a percent of Total revenues. Cost of products sold increased $347 million or 160 basis points as a percent of Sales of products. The increase as a percent of sales was driven by cost inflation, including the impact of incremental tariffs, and investment in design follow-through, partially offset by cost productivity. Cost of services sold increased $170 million or 70 basis points as a percent of Sales of services. The increase as a percent of sales was driven by unfavorable mix within our service offerings, and cost inflation, including the impact of incremental tariffs, partially offset by an increase in pricing of our service offerings. Included in our total cost of revenues as part of our product investment was $357 million in engineering costs for design follow-through on new product introductions and product lifecycle maintenance subsequent to the initial product launch, compared to $305 million for the \nprior year comparable period\n; and\n•\nTotal operating expenses decreased $55 million, with a decrease in R&D investments of $30 million, driven by certain programs achieving development milestones resulting in costs to be reported under cost of revenues, and a decrease in SG&A expense of $25 million primarily driven by a decrease in Spin-Off and separation costs, partially offset by increased investment in our commercial teams and the acquisition of NMP. R&D as a percentage of Total revenues decreased by 50 basis points and SG&A as a percentage of Total revenues decreased by 100 basis points.\nNet income attributable to GE HealthCare and Net income margin were $1,495 million and 10.0%, an increase of $223 million and 120 basis points, respectively, primarily due to the following factors:\n•\nOperating income increased $112 million, as discussed above;\n•\nInterest and other financial charges – net decreased $49 million primarily driven by debt repayment and continued optimization;\n•\nNon-operating benefit income decreased $83 million primarily related to lower expected returns on plan assets;\n•\nOther income – net increased $123 million primarily driven by the remeasurement of the Company’s 50% interest in NMP based on the cash consideration exchanged for acquiring the remaining 50% equity interest. For additional detail on the NMP acquisition, refer to Note 7, “Acquisitions, Goodwill, and Other Intangible Assets”; and\n•\nProvision for income taxes decreased $39 million primarily due to foreign income tax reserve releases for tax years which are no longer subject to an assessment from the local taxing authorities and the use of tax attributes from updating our global structure following the Spin-Off, offset by U.S. and foreign tax law changes. For additional detail regarding our income taxes, see Note 10, “Income Taxes.”\nAdjusted EBIT* and Adjusted EBIT margin* were $2,205 million and 14.8%, a decrease of $13 million and 70 basis points, respectively, primarily due to an increase in Total operating expenses, excluding the impact of Spin-Off and separation costs, partially offset by an increase in Gross profit, as discussed above.\nAdjusted net income*\n \nwas $1,441 million, an increase of $48 million primarily due to lower Interest and other financial charges – net and lower Provision for income taxes, partially offset by a decrease in operating income when excluding the impact of lower Spin-Off and separation costs.\nRESULTS OF OPERATIONS \n–\n SEGMENTS\nWe exclude from Segment EBIT certain corporate-related expenses and certain transactions or adjustments that our Chief Operating Decision Maker (which is our Chief Executive Officer) considers to be non-operational, such as Interest and other financial charges – net, Benefit (provision) for income taxes, restructuring costs, acquisition and disposition-related benefits (charges), Spin-Off and separation costs, Non-operating benefit (income) costs, gain (loss) on business and asset dispositions, amortization of acquisition-related intangible assets, Net (income) loss attributable to noncontrolling interests, Income (loss) from discontinued operations, net of taxes, and investment revaluation gain (loss). See Note 3, “Segment Information” for additional information on our reportable segments, and “Results of Operations” above for discussion on segment revenue performance.\nSegment EBIT\nFor the three months ended September 30\nFor the nine months ended September 30\n2025\n% of segment revenues\n2024\n% of segment revenues\n% change\n2025\n% of segment revenues\n2024\n% of segment revenues\n % change\nImaging\n    \n$\n240\n10.2 \n%\n$\n287\n12.9 \n%\n(16)\n%\n$\n627\n9.4 \n%\n$\n660\n10.2 \n%\n(5)\n%\nAVS\n271\n20.9 \n%\n232\n19.0 \n%\n17 \n%\n799\n20.9 \n%\n744\n20.2 \n%\n7 \n%\nPCS\n    \n27\n3.7 \n%\n82\n10.6 \n%\n(67)\n%\n135\n6.0 \n%\n241\n10.5 \n%\n(44)\n%\nPDx\n    \n220\n29.4 \n%\n193\n30.9 \n%\n14 \n%\n638\n30.3 \n%\n571\n30.6 \n%\n12 \n%\n____________________\n*Non-GAAP Financial Measure\n36\nTable of Contents\n    \n         \nFor the \nthree months ended\n September 30, 2025\n•\nImaging Segment EBIT was $240 million, a decrease of $46 million due to cost inflation, including the impact of incremental tariffs, partially offset by a growth in sales volume;\n•\nAVS Segment EBIT was $271 million, an increase of $40 million due to growth in sales volume and cost productivity, partially offset by cost inflation, including the impact of incremental tariffs;\n•\nPCS Segment EBIT was $27 million, a decrease of $55 million due to a decline in sales volume, cost inflation, including the impact of incremental tariffs, and unfavorable mix; and\n•\nPDx Segment EBIT was $220 million, an increase of $27 million due to an increase in price and growth in sales volume, partially offset by increased investment.\nFor the nine months ended September 30, 2025\n•\nImaging Segment EBIT was $627 million, a decrease of $33 million due to cost inflation, including the impact of incremental tariffs, partially offset by a growth in sales volume, cost productivity, and an increase in price;\n•\nAVS Segment EBIT was $799 million, an increase of $55 million due to growth in sales volume and cost productivity, partially offset by cost inflation, including the impact of incremental tariffs;\n•\nPCS Segment EBIT was $135 million, a decrease of $106 million due to cost inflation, including the impact of incremental tariffs, unfavorable mix, and a decline in sales volume; and\n•\nPDx Segment EBIT was $638 million, an increase of $68 million due to an increase in price and growth in sales volume, partially offset by increased investment.\nNON-GAAP FINANCIAL MEASURES\nThe non-GAAP financial measures presented in this Quarterly Report on Form 10-Q are supplemental measures of our performance and our liquidity that we believe will help investors understand our financial condition, cash flows, and operating results, and assess our future prospects. When read in conjunction with our U.S. GAAP results, these non-GAAP financial measures provide a baseline for analyzing trends in our underlying businesses and can be used by management as one basis for making financial, operational, and planning decisions. Descriptions of the reported non-GAAP measures are included below.\nWe report Organic revenue and Organic revenue growth rate to provide management and investors with additional understanding and visibility into the underlying revenue trends of our established, ongoing operations, as well as provide insights into overall demand for our products and services. To calculate these measures, we exclude the effect of acquisitions, dispositions, and foreign currency rate fluctuations.\nWe report EBIT, Adjusted EBIT, Adjusted EBIT margin, Adjusted net income, and Adjusted earnings per share to provide management and investors with an additional understanding of our business by highlighting the results from ongoing operations and the underlying profitability factors, on a normalized basis. To calculate these measures we exclude, and reflect in the detailed reconciliations below, the following adjustments as applicable: Interest and other financial charges \n–\n net, Net (income) loss attributable to noncontrolling interests, Non-operating benefit (income) costs, Benefit (provision) for income taxes and certain tax related adjustments, and certain non-recurring and/or non-cash items. We may from time to time consider excluding other non-recurring items to enhance comparability between periods. Adjusted EBIT margin is calculated by taking Adjusted EBIT divided by Total revenues for the same period.\nWe report Adjusted tax expense and Adjusted ETR to provide management and investors with a better understanding of the normalized tax rate applicable to our business and provide more consistent comparability across periods. Adjusted tax expense excludes the income tax related to the pre-tax income adjustments included as part of Adjusted net income and certain income tax adjustments, such as adjustments to deferred tax assets or liabilities. We may from time to time consider excluding other non-recurring tax items to enhance comparability between periods. Adjusted ETR is Adjusted tax expense divided by income before income taxes less the pre-tax income adjustments referenced above.\nWe report Free cash flow to provide management and investors with an important measure of our ability to generate cash on a normalized basis and provide insight into our flexibility to allocate capital. Free cash flow is Cash from (used for) operating activities – continuing operations including cash flows related to the additions and dispositions of property, plant, and equipment (“PP&E”) and additions of internal-use software. Free cash flow does not represent residual cash flows available for discretionary expenditures, due to the fact that the measure does not deduct the capital required for debt repayments.\nManagement recognizes that these non-GAAP financial measures have limitations, including that they may be calculated differently by other companies or may be used under different circumstances or for different purposes. In order to compensate for the discussed limitations, management does not consider these measures in isolation from or as alternatives to the comparable financial measures determined in accordance with U.S. GAAP. The detailed reconciliations of each non-GAAP financial measure to the most directly comparable U.S. GAAP financial measure are provided below, and no single financial measure should be relied on to evaluate our business.\n37\nTable of Contents\n    \n         \nOrganic Revenue*\nFor the three months ended September 30\nFor the nine months ended September 30\n2025\n2024\n% change\n2025\n2024\n% change\nImaging revenues    \n$\n2,349\n$\n2,229\n5%\n$\n6,693\n$\n6,462\n4%\nLess: Acquisitions\n(1)\n    \n—\n—\n14\n—\nLess: Dispositions\n(2)\n    \n—\n—\n—\n—\nLess: Foreign currency exchange    \n27\n—\n3\n—\nImaging Organic revenue*\n$\n2,322\n$\n2,229\n4%\n$\n6,676\n$\n6,462\n3%\nAVS revenues    \n$\n1,301\n$\n1,216\n7%\n$\n3,829\n$\n3,692\n4%\nLess: Acquisitions\n(1)\n    \n—\n—\n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\n—\n—\nLess: Foreign currency exchange    \n14\n—\n6\n—\nAVS Organic revenue*    \n$\n1,286\n$\n1,216\n6%\n$\n3,823\n$\n3,692\n4%\nPCS revenues    \n$\n731\n$\n779\n(6)%\n$\n2,262\n$\n2,298\n(2)%\nLess: Acquisitions\n(1)\n    \n—\n—\n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\n—\n—\nLess: Foreign currency exchange    \n4\n—\n1\n—\nPCS Organic revenue*    \n$\n727\n$\n779\n(7)%\n$\n2,261\n$\n2,298\n(2)%\nPDx revenues    \n$\n749\n$\n625\n20%\n$\n2,110\n$\n1,862\n13%\nLess: Acquisitions\n(1)\n    \n51\n1\n104\n3\nLess: Dispositions\n(2)\n    \n—\n—\n—\n—\nLess: Foreign currency exchange    \n15\n—\n8\n—\nPDx Organic revenue*    \n$\n683\n$\n623\n10%\n$\n1,998\n$\n1,859\n7%\nOther revenues    \n$\n15\n$\n15\n(1)%\n$\n33\n$\n39\n(14)%\nLess: Acquisitions\n(1)\n    \n—\n—\n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\n—\n—\nLess: Foreign currency exchange    \n—\n—\n—\n—\nOther Organic revenue*    \n$\n14\n$\n15\n(3)%\n$\n33\n$\n39\n(15)%\nTotal revenues    \n$\n5,143\n$\n4,863\n6%\n$\n14,927\n$\n14,353\n4%\nLess: Acquisitions\n(1)\n    \n51\n1\n117\n3\nLess: Dispositions\n(2)\n    \n—\n—\n—\n—\nLess: Foreign currency exchange    \n60\n—\n18\n—\nOrganic revenue*    \n$\n5,033\n$\n4,862\n4%\n$\n14,792\n$\n14,349\n3%\n(1)\nRepresents revenues attributable to acquisitions from the date the Company completed the transaction through the end of four quarters following the transaction, excluding the impact of Foreign currency exchange already captured in lines elsewhere. \n(2)\nRepresents revenues attributable to dispositions for the four quarters preceding the disposition date.\n____________________\n*Non-GAAP Financial Measure\n38\nTable of Contents\n    \n         \nAdjusted EBIT*\nFor the three months ended September 30\nFor the nine months ended September 30\n2025\n2024\n% change\n2025\n2024\n % change\nNet income attributable to GE HealthCare\n    \n$\n446\n$\n470\n(5)%\n$\n1,495\n$\n1,272\n18%\nAdd: Interest and other financial charges – net    \n111\n130\n335\n383\nAdd: Non-operating benefit (income) costs    \n(75)\n(102)\n(222)\n(306)\nLess: Benefit (provision) for income taxes    \n(179)\n(168)\n(395)\n(435)\nLess: Net (income) loss attributable to noncontrolling interests     \n(18)\n(19)\n(57)\n(40)\nEBIT*\n    \n$\n679\n$\n685\n(1)%\n$\n2,060\n$\n1,825\n13%\nAdd: Restructuring costs\n(1)\n    \n31\n22\n71\n90\nAdd: Acquisition and disposition-related charges (benefits)\n(2)\n    \n9\n(4)\n24\n(7)\nAdd: Spin-Off and separation costs\n(3)\n    \n6\n56\n35\n182\nAdd: (Gain) loss on business and asset dispositions\n(4)\n    \n—\n1\n(5)\n—\nAdd: Amortization of acquisition-related intangible assets    \n41\n34\n116\n100\nAdd: Investment revaluation (gain) loss\n(5)\n    \n(4)\n1\n(96)\n26\nAdjusted EBIT*\n    \n$\n761\n$\n795\n(4)%\n$\n2,205\n$\n2,217\n(1)%\nNet income margin\n8.7%\n9.7%\n(100) bps\n10.0%\n8.9%\n120 bps\nAdjusted EBIT margin*\n    \n14.8%\n16.3%\n(150) bps\n14.8%\n15.4%\n(70) bps\n(1)\nConsists of severance, facility closures, and other charges associated with restructuring programs.\n(2)\nConsists of legal, consulting, and other transaction and integration fees, and adjustments to contingent consideration, as well as other purchase accounting related charges and other costs directly related to the transactions.\n(3)\nCosts incurred in the Spin-Off and separation from GE, including system implementations, audit and advisory fees, legal entity separation, Founders Grant equity awards, separation agreements with GE, and other one-time costs.\n(4)\nConsists of gains and losses resulting from the sale of assets and investments.\n(5)\nPrimarily relates to valuation adjustments for equity investments and for the nine months ended September 30, 2025, includes the impact from the revaluation of our existing 50% interest in NMP as part of the acquisition transaction.\nAdjusted Net Income*\nFor the three months ended September 30\nFor the nine months ended September 30\n2025\n2024\n% change\n2025\n2024\n % change\nNet income attributable to GE HealthCare\n    \n$\n446\n$\n470\n(5)%\n$\n1,495\n$\n1,272\n18%\nAdd: Non-operating benefit (income) costs    \n(75)\n(102)\n(222)\n(306)\nAdd: Restructuring costs\n(1)\n    \n31\n22\n71\n90\nAdd: Acquisition and disposition-related charges (benefits)\n(2)\n    \n9\n(4)\n24\n(7)\nAdd: Spin-Off and separation costs\n(3)\n    \n6\n56\n40\n182\nAdd: (Gain) loss on business and asset dispositions\n(4)\n    \n—\n1\n(5)\n—\nAdd: Amortization of acquisition-related intangible assets    \n41\n34\n116\n100\nAdd: Investment revaluation (gain) loss\n(5)\n    \n(4)\n1\n(96)\n26\nAdd: Tax effect of reconciling items\n(6)\n(2)\n(3)\n(3)\n(26)\nAdd: Spin-Off and other tax adjustments\n(7)\n    \n39\n46\n22 \n60\nAdjusted net income*    \n$\n490\n$\n521\n(6)%\n$\n1,441\n$\n1,393\n3%\n(1)\nConsists of severance, facility closures, and other charges associated with restructuring programs.\n(2)\nConsists of legal, consulting, and other transaction and integration fees, and adjustments to contingent consideration, as well as other purchase accounting related charges and other costs directly related to the transactions.\n(3)\nCosts incurred in the Spin-Off and separation from GE, including system implementations, audit and advisory fees, legal entity separation, Founders Grant equity awards, separation agreements with GE, and other one-time costs. An adjustment is included to eliminate the associated impact on Net (income) loss attributable to noncontrolling interests for applicable costs that impact earnings attributable to noncontrolling interests.\n(4)\nConsists of gains and losses resulting from the sale of assets and investments.\n(5)\nPrimarily relates to valuation adjustments for equity investments and for the nine months ended September 30, 2025, includes the impact from the revaluation of our existing 50% interest in NMP as part of the acquisition transaction.\n(6)\nThe tax effect of reconciling items is calculated using the statutory tax rate, taking into consideration the nature of the items and the relevant taxing jurisdiction.\n(7)\nConsists of certain income tax adjustments, including the release of income tax reserves in a foreign jurisdiction for tax years which are no longer subject to an assessment from the local taxing authorities, impacts from tax law changes, discrete tax impacts resulting from the Spin-Off and separation from GE, and tax impacts of the NMP acquisition.\n____________________\n*Non-GAAP Financial Measure\n39\nTable of Contents\n    \n         \nAdjusted Earnings Per Share*\nFor the three months ended September 30\nFor the nine months ended September 30\n(In dollars, except shares outstanding presented in millions)\n2025\n2024\n$ change\n2025\n2024\n $ change\nDiluted earnings per share\n$\n0.98\n$\n1.02\n$\n(0.05)\n$\n3.26\n$\n2.77\n$\n0.49\nAdd: Non-operating benefit (income) costs    \n(0.16)\n(0.22)\n(0.49)\n(0.67)\nAdd: Restructuring costs\n(1)\n    \n0.07 \n0.05 \n0.16 \n0.20 \nAdd: Acquisition and disposition-related charges (benefits)\n(2)\n    \n0.02 \n(0.01)\n0.05 \n(0.02)\nAdd: Spin-Off and separation costs\n(3)\n    \n0.01 \n0.12 \n0.09 \n0.40 \nAdd: (Gain) loss on business and asset dispositions\n(4)\n    \n— \n0.00 \n(0.01)\n— \nAdd: Amortization of acquisition-related intangible assets    \n0.09 \n0.08 \n0.25 \n0.22 \nAdd: Investment revaluation (gain) loss\n(5)\n    \n(0.01)\n0.00 \n(0.21)\n0.06 \nAdd: Tax effect of reconciling items\n(6)\n(0.00)\n(0.01)\n(0.01)\n(0.06)\nAdd: Spin-Off and other tax adjustments\n(7)\n    \n0.09 \n0.10 \n0.05 \n0.13 \nAdjusted earnings per share*\n$\n1.07\n$\n1.14\n$\n(0.06)\n$\n3.15\n$\n3.04\n$\n0.11\nDiluted weighted-average shares outstanding\n457\n459\n458\n459\n(1)\nConsists of severance, facility closures, and other charges associated with restructuring programs.\n(2)\nConsists of legal, consulting, and other transaction and integration fees, and adjustments to contingent consideration, as well as other purchase accounting related charges and other costs directly related to the transactions.\n(3)\nCosts incurred in the Spin-Off and separation from GE, including system implementations, audit and advisory fees, legal entity separation, Founders Grant equity awards, separation agreements with GE, and other one-time costs. An adjustment is included to eliminate the associated impact on Net (income) loss attributable to noncontrolling interests for applicable costs that impact earnings attributable to noncontrolling interests.\n(4)\nConsists of gains and losses resulting from the sale of assets and investments.\n(5)\nPrimarily relates to valuation adjustments for equity investments and for the nine months ended September 30, 2025, includes the impact from the revaluation of our existing 50% interest in NMP as part of the acquisition transaction.\n(6)\nThe tax effect of reconciling items is calculated using the statutory tax rate, taking into consideration the nature of the items and the relevant taxing jurisdiction.\n(7)\nConsists of certain income tax adjustments, including the release of income tax reserves in a foreign jurisdiction for tax years which are no longer subject to an assessment from the local taxing authorities, impacts from tax law changes, discrete tax impacts resulting from the Spin-Off and separation from GE, and tax impacts of the NMP acquisition.\nAdjusted Tax Expense* and Adjusted ETR*\nFor the three months ended September 30\nFor the nine months ended September 30\n2025\n2024\n2025\n2024\nBenefit (provision) for income taxes\n$\n(179)\n$\n(168)\n$\n(395)\n$\n(435)\nAdd: Tax effect of reconciling items\n(1)\n(2)\n(3)\n(3)\n(26)\nAdd: Spin-Off and other tax adjustments\n(2)\n    \n39\n46\n22\n60\nAdjusted tax expense*\n$\n(142)\n$\n(124)\n$\n(377)\n$\n(401)\nEffective tax rate\n27.8%\n25.5%\n20.3%\n24.9%\nAdjusted effective tax rate*\n21.8%\n18.7%\n20.2%\n21.9%\n(1)\nThe tax effect of reconciling items is calculated using the statutory tax rate, taking into consideration the nature of the items and the relevant taxing jurisdiction.\n(2)\nConsists of certain income tax adjustments, including the release of income tax reserves in a foreign jurisdiction for tax years which are no longer subject to an assessment from the local taxing authorities, impacts from tax law changes, discrete tax impacts resulting from the Spin-Off and separation from GE, and tax impacts of the NMP acquisition.\nFree Cash Flow*\nFor the nine months ended September 30\n2025\n2024\n % change\nCash from (used for) operating activities – continuing operations\n$\n937\n$\n1,042\n(10)%\nAdd: Additions to PP&E and internal-use software    \n(348)\n(299)\nAdd: Dispositions of PP&E    \n—\n—\nFree cash flow*\n$\n589\n$\n743\n(21)%\n____________________\n*Non-GAAP Financial Measure\n40\nTable of Contents\n    \n         \nLIQUIDITY AND CAPITAL RESOURCES\nAs of September 30, 2025, our Cash, cash equivalents, and restricted cash balance in the Condensed Consolidated Statements of Financial Position was $4,027 million. We have historically generated positive cash flows from operating activities. Additionally, we have access to revolving credit facilities of $3,500 million in aggregate, described in detail in Note 8, “Borrowings.”\nWe believe that our existing balance of Cash, cash equivalents, and restricted cash, future cash generated from operating activities, access to capital markets, and existing credit facilities will be sufficient to meet the needs of our current and ongoing operations, pay taxes due, service our existing debt, and fund investments in our business for at least the next 12 months.\nThe following table summarizes our cash flows for the periods presented:\nCash Flow\nFor the nine months ended September 30\n2025\n2024\nCash from (used for) operating activities – continuing operations\n$\n937 \n$\n1,042 \nCash from (used for) investing activities – continuing operations\n(778)\n(674)\nCash from (used for) financing activities – continuing operations\n910 \n704 \nFree cash flow*    \n589 \n743 \nOperating Activities\nCash generated from operating activities in the nine months ended September 30, 2025 was $937 million and included Net income of $1,552 million, adjusted for non-cash items including depreciation and amortization expense of $432 million, the gain on remeasurement of the NMP equity method investment of $97 million, and $949 million in net outflows from changes in assets and liabilities. The changes in assets and liabilities are primarily driven by company-funded benefit payments for postretirement benefit plans, an increase in inventories to meet business demand in the current trade environment, a decrease in accounts payable, and compensation and benefit payments.\nCash generated from operating activities in the nine months ended September 30, 2024 was $1,042 million and included Net income of $1,312 million, non-cash charges primarily for depreciation and amortization of $440 million, and $711 million in outflows from incremental changes in assets and liabilities, primarily driven by company-funded benefit payments for postretirement benefit plans, an increase in inventories mainly due to inventory build to meet higher demand, and compensation and benefit payments.\nInvesting Activities\nCash used for investing activities in the nine months ended September 30, 2025 was $778 million and primarily included Additions to PP&E and internal-use software of $348 million related mostly to investments in facilities, including manufacturing capacity expansion, and new product introductions, purchases of businesses, net of cash acquired, of $279 million largely related to the acquisition of the remaining 50% interest in NMP, and a payment of $178 million for settlement of cross-currency swaps that were designated in net investment hedges. Refer to Note 7, “Acquisitions, Goodwill, and Other Intangible Assets” for additional information on the NMP acquisition and Note 12, “Financial Instruments and Fair Value Measurements” for additional information on the settlement of cross-currency swaps.\nCash used for investing activities in the nine months ended September 30, 2024 was $674 million and primarily included Additions to PP&E and internal-use software of $299 million related mostly to manufacturing capacity expansion and new product introductions, purchases of businesses, net of cash acquired, of $259 million related to MIM Software Inc. (“MIM Software”), and payment of $94 million for settlement of cross-currency swaps that were designated in net investment hedges. Refer to Note 7, “Acquisitions, Goodwill, and Other Intangible Assets” for additional information on the MIM Software acquisition and Note 12, “Financial Instruments and Fair Value Measurements” for additional information on the settlement of cross-currency swaps.\nFinancing Activities\nCash generated from financing activities in the nine months ended September 30, 2025 was $910 million and primarily included $1,487 million of net proceeds from the issuance \nof \n$650 million\n aggregate principal amount of senior unsecured notes due in 2031 and \n$850 million\n aggregate principal amount of senior unsecured notes due in 2035\n, partially offset by repayment of $250 million of our outstanding Term Loan Facility, and repurchase of common stock for total consideration of $200 million. Refer to Note 8, “Borrowings” and Note 11, “Shareholders' Equity” for further information.\nCash generated from financing activities in the nine months ended September 30, 2024 was $704 million and primarily included $994 million of net proceeds from the issuance of $1,000 million aggregate principal amount of senior unsecured notes due in 2029, partially offset by repayment of $150 million of our outstanding Term Loan Facility.\n41\nTable of Contents\n    \n         \nFree cash flow*\nFree cash flow* was $589 million for the nine months ended September 30, 2025 and included $937 million of cash generated from operating activities, partially offset by $348 million of cash used for additions to PP&E.\nFree cash flow* was $743 million for the nine months ended September 30, 2024 and included $1,042 million of cash generated from operating activities, partially offset by $299 million of cash used for additions to PP&E.\nCapital Expenditures\nCash used for capital expenditures was $348 million and $299 million for the nine months ended September 30, 2025 and 2024, respectively. Capital expenditures were related mostly to investments in facilities, including manufacturing capacity expansion, and new product introductions.\nMaterial Cash Requirements\nIn the normal course of business, we enter into contracts and commitments that obligate us to make payments in the future. Information regarding our obligations under lease, debt, and other commitments is provided in Note 7, “Leases,” Note 9, “Borrowings,” and Note 14, “Commitments, Guarantees, Product Warranties, and Other Loss Contingencies” to the consolidated and combined financial statements contained in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. We have material cash requirements related to our pension obligations as described in Note 9, “Postretirement Benefit Plans.”\nDebt and Credit Facilities\nAs part of our capital structure, we have incurred debt. The servicing of this debt is supported by cash flows from our operations. As of September 30, 2025, we had $10,282 million of total debt compared to $8,951 million as of \nDecember 31, 2024. \nThe increase in debt was due primarily to our issuance in the second quarter of 2025 of \n$650 million\n aggregate principal amount of senior unsecured notes due in 2031 and \n$850 million\n aggregate principal amount of senior unsecured notes due in 2035, partially offset by a repayment of $250 million of the outstanding Term Loan Facility in the first quarter of 2025. On October 15, 2025, we used the net proceeds from the debt issuance referenced above, together with cash on hand, to repay the \n$1,500 million\n aggregate principal amount outstanding of the senior unsecured notes due in November 2025. Additional information on our debt and credit facilities, including definitions of the terms used above, is included in \nNote 8\n, \n“Borrowings.”\nIn addition to the Term Loan Facility, our credit facilities include a five-year senior unsecured revolving facility that provides borrowings of up to $3,000 million expiring in March 2030, and a 364-day senior unsecured revolving facility that provides borrowings of up to $500 million expiring in March 2026. As of \nSeptember 30, 2025\n, there were no outstanding borrowings on either of the two revolving facilities.\nThe Credit Facilities include various customary covenants that limit, among other things, the incurrence of liens securing debt, the entry into certain fundamental change transactions by GE HealthCare, and the maximum permitted consolidated net leverage ratio. As of \nSeptember 30, 2025\n, we were in compliance with the covenant requirements, including the maximum consolidated net leverage ratio. \nAccess to Capital and Credit Ratings\nWe plan to continue to rely on capital markets, and we expect to have access to credit facilities to fund our operations. The cost and availability of debt financing will be influenced by our credit ratings and market conditions. Moody\n’\ns Investors Service (\n“\nMoody\n’\ns\n”\n), S&P Global Ratings (\n“\nS&P\n”\n), and Fitch Ratings (\n“\nFitch\n”\n) currently issue ratings on our long-term debt. \nOur credit ratings as of \nOctober 22, 2025\n are set forth in the table below and remain unchanged since the Spin-Off.\nMoody’s\nS&P\nFitch\nLong-term rating\nBaa2\nBBB\nBBB\nOutlook\nStable\nStable\nStable\nWe are disclosing our credit ratings to enhance the understanding of our sources of liquidity and the effects of our ratings on our costs of funds and access to liquidity. Our ratings may be subject to a revision or withdrawal at any time by the assigning rating organization, a\nnd each rating should be evaluated independently of any other rating.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nFor a discussion of recently issued accounting standards, see Note 1, “Organization and Basis of Presentation.”\nCRITICAL ACCOUNTING ESTIMATES\nThere have been no material changes to the critical accounting estimates disclosed in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\n____________________\n*Non-GAAP Financial Measure\n42\nTable of Contents"
}