{
  "source_file": "gen-20250328.htm",
  "form_type": "10-K",
  "item1": "Item 1. \nBusiness\nPurpose and Mission\nPurpose: Powering Digital Freedom.\nMission: We create innovative and easy-to-use technology solutions that help people grow, manage and secure their digital and financial lives.\nOur Values\nProtecting people is what inspires us, and our people are at the core of what we do. We seek to attract talent that embraces the following values:\n•\nCustomer Driven. Community Minded.\n We are customer obsessed and drive positive impact.\n•\nThink Big. Be Bold.\n We embrace change and innovate fearlessly.\n•\nBe Scrappy. Make it Happen.\n Big or small, we get things done irrespective of title or role.\n•\nPlay to Win. Together.\n We win for our customers, with passion and integrity.\nCompany Overview\nGen is a global company powering Digital Freedom with a family of trusted brands including Norton, Avast, LifeLock and more. We bring award-winning products and services in cyber safety, covering security, privacy, identity protection and financial wellness to approximately 500 million users in more than 150 countries, empowering them to live their digital lives safely, privately, and confidently today and for generations to come.\nToday’s world is increasingly digital, and this has changed the way we live our lives every day. The last decade has brought increasingly impressive technological advances that have unlocked new ways to play and transact online, control smart homes, manage our life and more. The possibilities in the digital world will continue to unlock new possibilities. However, as our digital footprint expands, so do the risks and exposure. Cybercriminals use a mix of old and new tactics and technologies, including phishing, vishing, smishing, based on machine learning and generative artificial intelligence (AI) technologies, to execute highly advanced threats and attacks. We are our customers’ trusted ally that they can depend on to help secure and control their digital lives so they can be free to enjoy the promise of the digital world. We are committed more than ever to protecting and empowering people’s digital lives with personalized, human-centered safety.\nWe are well-positioned to drive awareness of cyber safety for individuals, families, and small businesses, fueled by an increasingly connected world. We maintain a global, omni-channel sales approach, including direct, indirect and freemium acquisition and a family of brands marketing program. This program is designed to grow our customer base by increasing brand awareness and understanding of our products and services and maximizing our global reach to prospective customers.\nWe help prevent, detect and restore potential damages caused by cybercriminals. We also make it easy for consumers to find, buy and use our products and services. To this end, we offer both free and paid subscription-based cyber safety solutions primarily direct-to-consumer through our family of brands and indirectly through partner relationships. Most of our subscriptions are offered on annual terms, but we also provide monthly subscriptions. \nAs of March 28, 2025, we have approximately 500 million total users, which come from direct, indirect and freemium channels. Of these total users, we have approximately 65 million paid cyber safety customers including over 40 million direct customers with whom we have a direct billing relationship.\n•\nDirect-to-consumer channel:\n We use advertising to elevate our family of brands, attract new customers and generate significant demand for our services. Our direct subscriptions are primarily sold through our e-commerce platform and mobile apps, and we have a direct billing relationship with the majority of these customers.\n•\nIndirect partner distribution channels:\n We use strategic and affiliate partner distribution channels to refer prospective customers to us and expand our reach to our partners’ and affiliates’ customer bases. We developed and implemented a global partner sales organization that targets new, as well as existing, partners to enhance our partner distribution channels. These channels include retailers, telecom service providers, hardware original equipment manufacturers (OEMs), employee benefit providers, strategic partners, small offices, home offices and very small businesses. Physical retail and OEM partners represent a small portion of our distribution, which minimizes the impact of supply chain disruptions.\n•\nFreemium channels:\n With the acquisitions of Avast and Avira, we have expanded our go-to-market with multiple freemium channels. We use free versions of our products to reach the broadest set of consumers globally and bring cyber safety to a larger audience, especially in international markets. The free solution offers a baseline of protection and presents premium functionalities based on the risk profile and specific needs of the user. The user can choose to add specific premium solutions or upgrade to suites that provide security, identity, and privacy across multiple platforms and devices, thereby becoming a paid customer.\n6\nTable of Contents\nSeasonality\nAs is typical for many consumer technology companies, portions of our business are impacted by seasonality. However, we believe the net impact on our business is limited. Seasonal behavior in orders primarily reflects consumer spending patterns during our fiscal third and fourth quarters, as order volume is generally higher due to the holidays in our third quarter, as well as due to follow-on holiday purchases and the U.S. tax filing season which is in our fourth quarter. Revenue generally reflects similar seasonal patterns but to a lesser extent than orders because of our subscription business model, as the majority of our in-period revenues are recognized ratably from our deferred revenue balance.\nOur Strategy\nOur strategy is focused on long-term profitable growth. To fuel our growth, our consumer-centric strategy is to provide comprehensive and easy-to-use integrated platforms, which we have built in-house or acquired. By combining and leveraging our family of trusted consumer brands, including offerings from Norton, Avast, LifeLock and more, we deliver an industry-leading cyber safety and trust-based solutions. \nWe are positioned for long-term growth and expansion. Our three primary growth levers are:\n1.\nExtending Reach:\n Leveraging an omni-channel strategy and building partnerships to broaden privacy and identity protection internationally.\n2.\nIncreasing Value:\n Cross-selling and up-selling, and expanding security, identity and privacy solutions to address consumers’ evolving needs.\n3.\nGrowing Loyalty:\n Increase customer loyalty and retention, as consumers move from point products protecting their devices towards all-in-one comprehensive cyber safety memberships.\nThe key elements of our strategy include the following:\n•\nExtend our leadership position through new products and continued enhancement of our trust-based solutions and services: \nCyber safety is a large and expanding market, which we believe provides a significant growth opportunity. Our strategy is to grow our business through innovation and acquisitions to expand the solutions and services we offer into new cohorts, territories and sectors. We believe there are many additional areas where we can both offer new solutions, as well as use our core capabilities and our integrated platform to reach new customers and markets globally.\n•\nGrow our customer base through multiple channels:\n We have multiple go-to-market channels to reach new customers globally, including direct-to-customer, indirect partnerships and freemium. We intend to leverage our expertise in digital marketing, as well as existing and new strategic partnerships, to grow our customer base. We believe that continued investments in these areas, as well as our product offerings and infrastructure, will allow us to further enhance our leading brands and superior products, increase awareness of our consumer services and enhance our ability to efficiently acquire new customers. \n•\nContinue our focus on customer retention: \nWe continue to optimize and expand the value we provide to customers which we believe can positively impact retention. We aim to continue to increase customer engagements through actionable alerts, education on timely topics and introducing new product capabilities. We also plan to continue investing in enhancing both desktop and mobile customer experiences throughout a customer’s journey with Gen, from purchase, to onboarding and beyond. \n•\nIncrease value to existing customers:\n We believe strong customer satisfaction will provide us with the opportunity to engage customers in new services offerings. We maintain the Norton 360 and Avast One platforms that have multiple tiers of membership, and we continue to engage customers with standalone products to offer membership options and show the value proposition of our premium solutions. Over time, we plan to drive further growth as we add additional offerings and services for our customers.\n•\nDraw strength from our world-class customer service support: \nOur global support team seeks to ensure the voice of the consumer is heard and that we put our customers first. We leverage frequent communication and feedback from our customers to continually improve our solutions and services. We embrace end-to-end customer experience and aim to continue to improve our Net Promoter Scores and overall customer satisfaction.\n•\nLeverage our global brands to drive growth: \nWe will work to keep building our family of trusted brands in markets globally as we strive to bring protection and empowerment to all consumers when it comes to their digital lives. According to our most recent research, Norton has 93% global brand awareness, and we are best positioned and top of mind in consumer cyber safety, according to the internal H1 2025 Gen Brand Tracker. \nOur Cyber Safety Solutions and Services\nOur broad portfolio of products and services is developed from consumer insights to help us bring to market real solutions to real problems and to engage and educate consumers about cyber safety. We continuously aim to release new products and features to outpace evolving threats and find synergies to integrate current and future technology acquisitions. \nOur cyber safety portfolio provides protection across three key categories in multiple channels and geographies, including security and performance, identity protection, and online privacy. Leveraging our technology platforms, we integrate software and service capabilities within these three categories into comprehensive and easy-to-use products and solutions across our brands. \n7\nTable of Contents\nWe have also evolved beyond traditional cyber safety to offer adjacent trust-based solutions, including digital identity and access management, digital reputation, and restoration support services.\nWe protect and empower consumers by providing solutions and services in two main ways:\n•\nComprehensive membership plans:\n Providing a comprehensive and all-in-one cyber safety portfolio of solutions for a membership fee. Plans are offered through Norton 360 and Avast One subscriptions, with both brands providing multiple levels of membership tiers that range from basic, mid-level, or premium tiers where identity theft and online privacy features are included.\n•\nPoint solutions: \nProviding individual, stand-alone products and services in security, identity and privacy, offering flexibility for consumers to choose between free or paid solutions. These products solve for a specific need, when you need it, and can add on to the value you already have. Please see below for our full set of products by category.\nWe are well positioned across three key cyber safety categories:\n•\nSecurity and Performance (Norton, Avast, Avira, AVG, and CCleaner offerings):\n Our offerings provide real-time threat protection for PCs, Macs and mobile devices against malware, viruses, adware, ransomware and other online emerging threats. These offerings monitor and block unauthorized traffic from the internet to the device to help protect private and sensitive information when customers are online. Additionally, our all-in-one cybersecurity solutions help small business owners safeguard their team’s online activities, devices and customer data. Scams have also continued to become more prevalent and sophisticated and we offer a range of AI-powered features integrated into Norton Cyber Safety products to provide always-on protection from today’s most sophisticated scams across phone calls, texts, emails, and websites. Norton Scam Protection and Scam Protection Pro utilize Norton Genie AI engine to analyze the meaning of words, not just links, helping to stop hidden scam patterns that even the most careful person can miss. We also provide performance and optimization software solutions that free up space on devices, clear online tracking and help machines run faster.\n•\nIdentity Protection (U.S.: LifeLock Identity Theft Protection, Avast and AVG Secure Identity; International: Norton Identity Theft Protection, Dark Web Monitoring):\n In the U.S., we offer Identity Theft protection as part of our LifeLock, Avast and AVG brands. All three products include monitoring of credit reports, the dark web and social media accounts to help safeguard our customers’ personal information. The LifeLock product also offers monitoring of financial accounts. In the event of identity theft, we assign an Identity Restoration Specialist to work directly with customers to help restore their identities, and all plans include reimbursements for losses and expenses incurred ranging up to $3 million. Outside the U.S., we offer Norton and have expanded Avast and AVG branded plans to additional regions. Plans include dark web monitoring in over 50 countries and monitoring of credit, social media and financial accounts, restoration support and identity theft insurance in select countries.\n•\nOnline Privacy (VPN, multiple personal data protection products, ReputationDefender):\n Our virtual private network (VPN) solutions offered through the Norton, Avast and AVG brands enhance security and online privacy by providing an encrypted data tunnel. This allows customers to securely transmit and access private information, such as passwords, bank details and credit card numbers, when using public Wi-Fi on PCs, Macs, and mobile iOS and Android devices. We offer a variety of solutions under the Norton and Avast brands to protect customers’ data either by keeping data anonymous while browsing online through our AntiTrack and Secure Browser products or helping customers remove data from public data broker sites through our Privacy Monitor Assistant and BreachGuard products. Norton offers a three-tiered VPN with advanced privacy and malware protection as well as AI-powered protection against sophisticated cyber threats, including scams and phishing attacks. ReputationDefender is a white glove service that helps customers manage all aspects of their personal branding online, including search results, social media sites and overall web presence.\nInnovation, Research and Development\nGen has a long history of innovation, and we plan to continue to invest in research and development to drive our long-term success.\nAs cyber threats evolve, we are focused on delivering a portfolio that protects each element of our customers’ digital lives. To do this, we engage and listen to our customers, and we embrace innovation by deploying a global research and development strategy across our cyber safety platform. Our engineering and product management teams are focused on delivering new versions of existing offerings, as well as developing entirely new offerings to drive the company’s global leadership in cyber safety. \nWe are committed to our innovation and research and development efforts. The Technology team at Gen is driving the company’s future technologies and innovation and helping guide the consumer cybersecurity industry. Our global technology research organization is focused on applied research projects, with the goal of rapidly creating new products to address consumer trends and grow the business, including defending consumer digital privacy and identity. We also have a global threat response and security technology organization that is comprised of our dedicated team of threat and security researchers, supported by advanced systems to innovate security technology and threat intelligence. \nWe have one of the world’s largest consumer cyber safety networks. Leveraging our capabilities, our global threat response team handles a wide variety of attacks, including social engineering attacks, file-based attacks, web and network-based attacks, privacy and data exfiltration attacks, identity theft attacks, algorithmic manipulation attacks, and more.\n8\nTable of Contents\nOur differentiated approach is powered by our global scale and visibility, geographically distributed cloud data platform, and advanced AI-based automation.\nIndustry Overview\nCyber safety is a growing market, fueled by the increase in activities online over the years as well as expected growth in the years ahead. The core markets that we participate in are security, identity and privacy. We believe the cyber safety market will continue to expand beyond these core markets and grow significantly, driven by the increasing number of people globally connected to the internet and their expanding digital lives.\nThe cyber threat landscape is larger and more complicated than ever before, exposing consumers to an increased risk to their digital lives. The digitization of the world and the overlap between the physical and digital world are growing at a fast pace. New technologies, smart devices, digital identities and an increasingly more connected world mean consumers will encounter a range of new cyber safety challenges. Consumer demands and behaviors are rapidly changing and driving more activities online, from shopping, socializing, working, banking, to other activities in healthcare, entertainment and so much more. Almost every aspect of a person’s life has a digital component. Unfortunately, many of those activities are left unprotected, and attackers are exploiting this larger opportunity and the inherent security and privacy vulnerabilities. Cybercriminals have not only expanded their reach, but the sophistication of digital threats and attacks are becoming increasingly more realistic and believable. The advancement of AI and large language model (LLM) technology is a key driver of this increased risk.\nCybercrime, and the ways in which cybercriminals target consumers, continue to evolve along with behaviors and technology. Cybercrime encompasses any crime committed with devices over the internet and includes crimes where (i) malicious software or unauthorized access is detected on a device, network or online account (such as email, social media, online banking, digital assets, online retail, gaming, online entertainment, etc.), and unauthorized access or connection to cloud service accounts; (ii) an individual is digitally victimized through a data breach, cyber theft, cyber extortion, or fraud (stolen personally identifiable information, identity theft, etc.); (iii) online stalking, bullying, or harassment is inflicted; or (iv) attacks related to privacy or disinformation (such as online tracking protection, identity impersonation, disinformation on social media, deepfakes, unsecured WiFi, EvilTwin attacks, etc.).\nCompetitive Landscape\nWe operate in a highly competitive and dynamic environment. We face global competition from a broad range of companies, including software vendors focusing on cyber safety solutions, operating system providers such as Apple, Google and Microsoft, and ‘pure play’ companies that currently specialize in one or a few particular segments of the market (many of which are expanding their product portfolios into different segments). We believe the competitive factors in our market include innovation, access to a breadth of identity and consumer transaction data, broad and effective service offerings, brand recognition, technology, effective and cost-efficient customer acquisition, strong retention rate, customer satisfaction, price, convenience of purchase, ease of use, frequency of upgrades and updates and quality and reliable customer service. Our competitors may vary by offering, geography, business model and channel. \nOur principal competitors are set forth below: \n•\nSecurity: \nOur principal competitors in this segment include Apple, Bitdefender, ESET, F-Secure, Google, Kaspersky, Malwarebytes, McAfee, Microsoft, Trend Micro, and Webroot.\n•\nIdentity Protection: \nOur principal competitors in this segment include credit bureaus such as Equifax, Experian and TransUnion, as well as certain credit monitoring and identity theft protection solutions from others such as Allstate, Aura, Generali (Iris), Intuit (Credit Karma) and Microsoft.\n•\nOnline Privacy:\n Our principal competitors in this segment include Apple, Aura, Brave, DuckDuckGo, IPVanish, Kape, Mozilla and Nord Security.\n•\nOther Competitors:\n In addition to competition from independent software vendors such as Bitdefender, Kaspersky, McAfee and Trend Micro, and from OS providers such as Apple, Google and Microsoft, we also face competition from other companies that currently focus on one or a few cyber safety or adjacent segments but are developing additional competing products and expanding their portfolios into new segments, such as ‘pure play’ companies including but not limited to, 1Password, Bark, Dashlane, LastPass, Life360, Proton, and Truecaller, internet service providers, big tech platform providers, insurance companies and financial service organizations. \nWe believe we compete favorably with our competitors on the strength of our technology, people, product offerings and presence in all of the current key cyber safety categories. However, some of our competitors have greater financial, technical, marketing, distribution or other resources than we do, including in new cyber safety and digital life segments we may enter, which consequently affords them competitive advantages. As a result, they may be able to devote greater resources to develop, promote and sell their offerings; deliver competitive offerings at lower prices or for free; and introduce new solutions and respond to market developments and customer requirements and preferences more quickly or cost effectively than we can. In addition, for individual solutions or features, smaller, well-funded competitors may be able to innovate and adapt more nimbly to the dynamic nature of the market and shifting consumer needs.\nFor more information on the risks associated with our competitors, please see “Risk Factors” – Risks Related to Our Business Strategy and Industry – “We operate in a highly competitive and dynamic environment, and if we are unable to compete effectively, we could experience a loss in market share and a reduction in revenue” and “We may need to change our pricing models to compete successfully,” in Item 1A included in this Annual Report on Form 10-K.\n9\nTable of Contents\nHuman Capital Management\nAt Gen, our mission is to build a comprehensive and easy-to-use integrated portfolio that prevents, detects and responds to cyber threats and cybercrimes in today’s digital world. Our success in helping achieve this mission depends, in large part, on the success of our employees. \n•\nGeneral Employee Demographics: \nAs of March 28, 2025, we employed just under 3,500 team members in over 20 countries worldwide. With dual headquarters in Tempe, Arizona, and in Prague, Czech Republic, we have over 1,000 active employees located in the U.S. and nearly 900 active employees in the Czech Republic. None of our U.S. employees are represented by a labor union or covered by a collective bargaining agreement.\n•\nEmployee Development and Training:\n Our people programs are designed to provide our team members with support, resources, and opportunities they need to grow, learn and thrive in their careers. We continued to focus on learning and development in fiscal 2025, investing further in digital learning via our Learn@Gen program for all employees. Leveraging an extensive breadth of content and learning opportunities, this umbrella of offerings includes LinkedIn Learning catalog, Gen Mentorship, Academics and leadership trainings.\n•\nEmployee Engagement:\n We value our people and are committed to creating a positive and fulfilling experience for everyone. Feedback from our employees is critical, and we have developed an ongoing dialogue with our teams via our Engage pulse survey on a targeted topic that drives actions and improvements.\n•\nBenefits, Health and Wellness:\n At Gen, we value our people and are committed to creating a positive and fulfilling experience for everyone through the programs and benefits we offer. Our employee value proposition, Life@Gen is centered on choice, flexibility and growth and encompasses the many elements of our employee experience. Our commitment to overall health and wellness is centered around having an integrated and equitable wellness program that supports body, mind and financial health.\n•\nHuman Capital Governance: \nWe partner closely with our Board of Directors and the Compensation and Leadership Development Committee on executive compensation, our broader reward strategies and objectives related to talent management, talent acquisition, leadership development, retention and succession, and employee engagement.\nIntellectual Property\nOur intellectual property (IP) is an important and vital asset that enables us to develop, market, and sell our software products and services and enhance our competitive position. We are a leader among consumer cyber safety solutions in pursuing patents and currently have a portfolio of over 1,000 U.S. and international patents issued with many additional patents pending. We protect our intellectual property rights and investments in a variety of ways to safeguard our technologies and our long-term success. Our IP portfolio is spread across different entities and in multiple countries. As we continue to expand our international operations, we have developed a strategy to ensure global distribution of our IP aligns with our long-term strategic objectives, business model, and goals. We work actively in the U.S. and internationally to ensure the enforcement of copyright, trademark, trade secret and other protections that apply to our software products and services. The term of the patents we hold is, on average, in excess of ten years.\nFrom time to time, we enter into cross-license agreements with other technology companies covering broad groups of patents; we have an additional portfolio of over 2,000 U.S. and international patents cross-licensed to us as part of our arrangement with Broadcom as a result of the asset sale of our former Enterprise Security business. We also use software from third parties in our business and generally must rely on those third parties to protect the licensed rights. This can include open source software, which is subject to limited proprietary rights. While it may be necessary in the future to seek or renew licenses relating to various aspects of our products, services, and business methods, we believe, based upon past experience and industry practice, such licenses generally can be obtained on commercially reasonable terms. The ability to maintain and protect our intellectual property rights is important to our success, but we believe our business is not materially dependent on any individual patent, copyright, trademark, trade secret, license, or other intellectual property right.\nHowever, circumstances outside our control could pose a threat to our intellectual property rights. Effective intellectual property protection may not be available, and the efforts we have taken to protect our proprietary rights may not be sufficient or effective. Any significant impairment of our intellectual property rights could harm our business or our ability to compete. In addition, protecting our intellectual property rights is costly and time consuming. Any unauthorized disclosure or use of our intellectual property could make it more expensive to do business and harm our operating results. \nIn addition, a large number of patents, copyrights and trademarks are owned by other companies in the technology industry. Those companies may request license agreements, threaten litigation, or file suit against us based on allegations of infringement or other violations of intellectual property rights. \nFor more information on the risks associated with our intellectual property, please see “Risk Factors” in Item 1A included in this Annual Report on Form 10-K.\nGovernmental Regulation\nWe collect, use, store or disclose an increasingly high volume, and variety of personal information, including from employees and customers, in connection with the operation of our business, particularly, in relation to our identity and information protection offerings, which rely on large data repositories of personal information and consumer transactions. The personal information we process is subject to an increasing number of federal, state, local and foreign laws regarding privacy and data security. \n10\nTable of Contents\nFor information on the risks associated with complying with privacy and data security laws, please see “Risk Factors” in Item 1A included in this Annual Report on Form 10-K.\nAvailable Information\nOur internet homepage is located at \nGenDigital.com\n. We make available our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports as soon as reasonably practicable after we electronically file such material with the SEC on our investor relations website located at \nInvestor.GenDigital.com\n. We also use our website as a tool to disclose important information about the company and comply with our disclosure obligations under Regulation Fair Disclosure. The information contained, or referred to, on our website, including in any reports that are posted on our website, is not part of this annual report unless expressly noted. The SEC maintains a website that contains reports, proxy and information statements, and other information regarding our filings at \nhttp://www.sec.gov\n.",
  "item7": "Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nPlease read the following discussion and analysis of our financial condition and results of operations together with our Consolidated Financial Statements and related Notes thereto included under Item 15 of this Annual Report on Form 10-K.\nOVERVIEW\nGen is a global company powering Digital Freedom with a family of trusted brands including Norton, Avast, LifeLock, MoneyLion and more. Our core cyber safety portfolio provides protection across three key categories in multiple channels and geographies, including security and performance management, identity protection, and online privacy. We have built a technology platform that brings together software and service capabilities within these three categories into a comprehensive and easy-to-use integrated platform across our brands. We bring award-winning products and services in cybersecurity, covering security, privacy and identity protection to approximately 500 million users in more than 150 countries so they can live their digital lives safely, privately, and confidently today and for generations to come.\nWe completed the acquisition of MoneyLion on April 17, 2025. MoneyLion extends our identity solutions into offering comprehensive financial wellness through MoneyLion’s full-featured personal finance platform that includes credit building and financial management services. For more information on the MoneyLion acquisition, please see Note 19 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K.\nFiscal calendar\nWe have a 52/53-week fiscal year ending on the Friday closest to March 31. Fiscal 2025, 2024 and 2023 in this report refers to fiscal years ended March 28, 2025, March 29, 2024 and March 31, 2023, respectively, each of which was a 52-week year. \nFinancial summary\nThe following table provides our key financial metrics for fiscal 2025 compared with fiscal 2024:\nFiscal Year\n(In millions, except for per share amounts)\n2025\n2024\nNet revenues\n$\n3,935 \n$\n3,800 \nOperating income (loss)\n$\n1,610 \n$\n1,110 \nNet income (loss)\n$\n643 \n$\n607 \nNet income (loss) per share - diluted\n$\n1.03 \n$\n0.95 \nNet cash provided by (used in) operating activities\n$\n1,221 \n$\n2,064 \nAs of\n(In millions)\nMarch 28, 2025\nMarch 29, 2024\nCash and cash equivalents\n$\n1,006 \n$\n846 \n•\nNet revenues increased $135 million, primarily due to higher sales in both our consumer security and identity and information protection products.\n•\nOperating income (loss) increased $500 million, primarily due to increased net revenues, decreased legal costs related to ongoing litigation, lower amortization of intangible assets and restructuring costs related to our acquisition of Avast.\n•\nNet income (loss) increased $36 million and net income per share increased $0.08, primarily due to increased operating income discussed above and decreased interest expense associated with our Term A and Term B facilities. This is offset by the absence of an income tax benefit in the second quarter of fiscal 2024.\n•\nCash and cash equivalents increased by $160 million compared to March 29, 2024, primarily due to cash generated from operating activities during fiscal 2025 and proceeds from the issuance of 6.25% Senior Notes. This is partially offset by repurchases of our common stock, cash interest paid, dividends paid to shareholders, repayment of 5.00% Senior Notes, voluntary prepayments of our Term B facility, and mandatory principal amortization payments of our Term A and B facility.\n•\nDuring fiscal 2025, we returned $955 million of capital back to shareholders and bondholders. This was achieved through the repurchase of 11 million shares of our common stock, totaling $272 million. Additionally, we paid out a total of $313 million in quarterly dividends and carried out $370 million in net debt pay downs, including $30 million in voluntary prepayments applied exclusively to the Term B facility. \n•\nDuring fiscal 2025, we increased net Direct customers by 1.3 million, increased monthly Direct ARPU by $0.04 and increased our Direct retention rate by 1%.\nGLOBAL MACROECONOMIC CONDITIONS\nAs a global company, our results of operations and cash flows may be influenced by global macroeconomic conditions, including, but not limited to, increased tariffs, foreign currency exchange rate fluctuations, the impact of interest rate fluctuations, elevated inflation, ongoing and new geopolitical conflicts, including the unknown impacts of current and future trade regulations, instability in the global banking sector, economic slowdown and recession risks, any of which may persist for an extended period.\n34\nTable of Contents\nDespite this, we are confident in the long-term overall health of our business, the strength of our product offerings and our ability to continue to execute on our strategy, including bringing award-winning products and services in cybersecurity and offering comprehensive financial wellness to our customers.\nWe continue to monitor the direct and indirect impacts of these global macroeconomic or other geopolitical factors. If the economic uncertainty continues, we may experience additional negative impacts on customer renewals, customer collections, sales and marketing efforts, customer deployments, product development, or other financial metrics. Additional broader implications of these events on our business, results of operations, and overall financial position still remain uncertain and could result in further adverse impacts to our reported results. For further discussion of the potential impacts of global macroeconomic conditions and geopolitical factors on our business, please see “Risk Factors” in Part I, Item 1A and Part II, Item 7A below.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of our Consolidated Financial Statements and related notes in accordance with generally accepted accounting principles in the U.S. (U.S. GAAP) requires us to make estimates, including judgments and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. We have based our estimates, judgements and assumptions on historical experience and on various other factors we believe to be reasonable under the circumstances. We evaluate our estimates, judgements and assumptions on a regular basis and make changes accordingly. Management believes that the accounting estimates employed and the resulting amounts are reasonable; however, actual results may differ from these estimates. Making estimates, judgments and assumptions about future events is inherently unpredictable and is subject to significant uncertainties, some of which are beyond our control. Should any of these estimates, judgements or assumptions change or prove to have been incorrect, it could have a material impact on our results of operations, financial position and cash flows.\nManagement believes the following significant accounting policies reflect the critical estimates used in the preparation of our Consolidated Financial Statements. A summary of our significant accounting policies is included in Note 1, and a description of recently adopted accounting pronouncements and our expectation of the impact on our Consolidated Financial Statements and disclosures are included in Note 2 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K.\nBusiness combinations\nWe allocate the purchase price of acquired businesses to the tangible and identifiable intangible assets acquired and liabilities assumed based on their estimated fair values on the acquisition date. Any residual purchase price is recorded as goodwill. The allocation of purchase price requires management to make significant estimates and assumptions in determining the fair values of the assets acquired and liabilities assumed especially with respect to intangible assets. \nCritical estimates in valuing intangible assets include, but are not limited to, future expected cash flows from customer relationships, developed technology, trade names and other intangibles, and discount rates. Management estimates of fair value are based upon assumptions believed to be reasonable but which are inherently uncertain and unpredictable. Third-party valuation specialists are utilized for certain estimates. Unanticipated events and circumstances may occur which may affect the accuracy or validity of such assumptions, estimates or actual results.\nIncome taxes\nWe are subject to tax in multiple U.S. and foreign tax jurisdictions. We are required to estimate the current tax exposure as well as assess the temporary differences between the accounting and tax treatment of assets and liabilities, including items such as accruals and allowances not currently deductible for tax purposes. We apply judgment in the recognition and measurement of current and deferred income taxes which includes the following critical accounting estimates. \nWe use a two-step process to recognize liabilities for unrecognized tax benefits. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. There is judgement and complexity involved in assessing if the tax position is more likely than not. If we determine that the tax position will more likely than not be sustained on audit, the second step requires us to estimate and measure the tax benefit as the largest amount that is more than 50% likely to be realized upon ultimate settlement. It is inherently difficult and subjective to estimate such amounts, as this requires us to determine the probability of various outcomes. We re-evaluate these unrecognized tax benefits on a quarterly basis. This evaluation is based on factors including, but not limited to, changes in facts or circumstances, changes in tax law, effectively settled issues under audit and new audit activity. Such a change in recognition or measurement would result in the recognition of a tax benefit or an additional charge to the tax provision in the period.\nLoss contingencies\nWe are subject to contingencies that expose us to losses, including, but not limited to, regulatory proceedings, claims, mediations, arbitration and litigation, arising out of the ordinary course of business. An estimated loss from such contingencies is recognized as a charge to income if it is probable that a liability has been incurred and the amount of the loss can be reasonably estimated. Judgment is required in both the determination of probability and the determination as to whether a loss is reasonably estimable. We review the status of each significant matter quarterly, and we may revise our estimates. Until the final resolution of such matters, there may be an exposure to loss in excess of the amount recorded, and such amounts could be material. Should any of our estimates and assumptions change or prove to have been incorrect, it could have a material impact on our Consolidated Financial Statements for that reporting period.\n35\nTable of Contents\nRecently adopted authoritative guidance\nFor a discussion of recently adopted authoritative guidance and their potential effects refer to Note 2 of our Notes to the Consolidated Financial Statements of this Annual Report on Form 10-K.\nRecently issued authoritative guidance not yet adopted\nASU 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures.\n In December 2023, the FASB issued new guidance to update income tax disclosure requirements, requiring disaggregated information about an entity’s effective tax rate reconciliation as well as income taxes paid. This is effective for fiscal years beginning after December 15, 2024. We are currently evaluating the impact of the adoption of this guidance on our Consolidated Financial Statements and disclosures.\nASU 2024-03 and ASU 2025-01, Income Statement - Reporting Comprehensive Income (Subtopic 220-40): Expense Disaggregation Disclosures. \nIn November 2024, the FASB issued new guidance requiring that public business entities disclose additional information about specific expense categories in the notes to financial statements at interim and annual reporting periods. This is effective for annual reporting periods beginning after December 15, 2026, and interim reporting periods beginning after December 15, 2027. We are currently evaluating the impact of the adoption of this guidance on our Condensed Consolidated Financial Statements and disclosures.\nRESULTS OF OPERATIONS\nWe have elected to omit discussion on the earliest of the three years presented in the Consolidated Financial Statements of this Annual Report on Form 10-K. Refer to \nPart II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n of our Annual Report on Form 10-K for the fiscal year ended March 29, 2024 for year-over-year comparisons of the results of operation between fiscal 2024 and fiscal 2023 as well as discussion of fiscal 2023 performance metrics and cash flow activity, all of which are incorporated herein by reference.\nThe following table sets forth our Consolidated Statements of Operations data as a percentage of net revenues for the periods indicated:\nFiscal Year\n2025\n2024\nNet revenues\n100 \n%\n100 \n%\nCost of revenues\n20 \n19 \nGross profit\n80 \n81 \nOperating expenses:\nSales and marketing\n19 \n19 \nResearch and development\n8 \n9 \nGeneral and administrative\n7 \n16 \nAmortization of intangible assets\n4 \n6 \nRestructuring and other costs\n0 \n2 \nImpairment of intangible assets\n0 \n— \nTotal operating expenses\n39 \n52 \nOperating income (loss)\n41 \n29 \nInterest expense\n(15)\n(18)\nOther income (expense), net\n0 \n— \nIncome (loss) before income taxes\n26 \n12 \nIncome tax expense (benefit)\n10 \n(4)\nNet income (loss)\n16 \n%\n16 \n%\nNote: The percentages may not add due to rounding.\nNet revenues\nFiscal Year\n% Change\n(In millions, except for percentages)\n2025\n2024\n2025 vs. 2024\nNet revenues\n$\n3,935 \n$\n3,800 \n4 \n%\nFiscal 2025 compared to fiscal 2024\nNet revenues increased $135 million, due to a $95 million increase in sales of our identity and information protection products and a $53 million increase in sales of our consumer security products. This was partially offset by a $13 million decrease in our legacy product offerings. This is inclusive of $11 million of foreign exchange headwinds, in our consumer security solutions. \nPerformance Metrics\nWe regularly monitor a number of metrics in order to measure our current performance and estimate our future performance. We believe these key operating metrics are useful to investors because management uses these metrics to assess the growth of \n36\nTable of Contents\nour business and the effectiveness of our marketing and operational strategies. Our metrics may be calculated in a manner different than similar metrics used by other companies.\nThe following table summarizes supplemental key performance metrics for our solutions:\nFiscal Year\n(In millions, except for per user amounts and percentages)\n2025\n2024\nDirect customer revenue\n$\n3,456 \n$\n3,341 \nPartner revenues\n$\n429 \n$\n396 \nTotal cyber safety revenues\n$\n3,885 \n$\n3,737 \nLegacy revenues \n(1)\n$\n50 \n$\n63 \nDirect customer count (at quarter-end)\n40.4 \n39.1 \nDirect average revenue per user (ARPU)\n$\n7.26 \n$\n7.22 \nRetention rate\n78 \n%\n77 \n%\n(1)    Legacy revenues includes revenues from products or solutions from markets that we have exited and in which we no longer operate, have been discontinued or identified to be discontinued, or remain in maintenance mode as a result of integration and product portfolio decisions.\nWe define direct customer count as active paid users of our products and solutions who have a direct billing and/or registration relationship with us at the end of the reported period. We exclude users on free trials from our direct customer count. Users who have indirectly purchased and/or registered for our products or solutions through partners are excluded unless such users convert or renew their subscription directly with us or sign up for a paid membership through our web stores or third-party app stores.\nARPU is calculated as estimated direct customer revenues for the period divided by the average direct customer count for the same period, expressed as a monthly figure. Non-GAAP estimated direct customer revenues and ARPU have limitations as analytical tools and should not be considered in isolation or as a substitute for U.S. GAAP estimated direct customer revenues or other U.S. GAAP measures. We monitor ARPU because it helps us understand the rate at which we are monetizing our consumer customer base.\nRetention rate is defined as the percentage of direct customers as of the end of the period from one year ago who are still active as of the most recently completed fiscal period. We monitor the retention rate to evaluate the effectiveness of our strategies to improve renewals of subscriptions.\nThe methodologies used to measure these metrics require judgment and are subject to change due to improvements or revisions to our methodology. From time to time, we review our metrics and may discover inaccuracies or make adjustments to improve their accuracy, which can result in adjustments to our historical metrics. Our ability to recalculate our historical metrics may be impacted by data limitations or other factors that require us to apply different methodologies for such adjustments. We generally do not intend to update previously disclosed metrics for any such inaccuracies or adjustments that are deemed not material.\nNet revenues by geographical region\nPercentage of revenue by geographical region as presented below is based on the billing location of the customers.\nFiscal Year \n(1)\n2025\n2024\nAmericas\n66 \n%\n65 \n%\nEMEA\n24 \n%\n24 \n%\nAPJ\n10 \n%\n11 \n%\n(1)    From time to time, changes in allocation methodologies cause changes to the revenue by geographic area above. When changes occur, we recast historical amounts to match the current methodology, such as for fiscal 2024 where we aligned allocation methodologies across similar product categories.\nThe Americas include U.S., Canada, and Latin America; EMEA includes Europe, Middle East, and Africa; APJ includes Asia Pacific and Japan. \nPercentage of revenue by geographic region remained consistent in fiscal 2025 and fiscal 2024.\nCost of revenues\nFiscal Year\n% Change\n(In millions, except for percentages)\n2025\n2024\n2025 vs. 2024\nCost of revenues\n$\n776 \n$\n731 \n6 \n%\n37\nTable of Contents\nFiscal 2025 compared to fiscal 2024\nOur cost of revenues increased $45 million, primarily due to a $42 million increase in marketing affiliate expenses. \nOperating expenses\nFiscal Year\n% Change\n(In millions, except for percentages)\n2025\n2024\n2025 vs. 2024\nSales and marketing\n$\n745 \n$\n733 \n2 \n%\nResearch and development\n329 \n332 \n(1)\n%\nGeneral and administrative\n291 \n604 \n(52)\n%\nAmortization of intangible assets\n174 \n233 \n(25)\n%\nRestructuring and other costs\n7 \n57 \n(88)\n%\nImpairment of intangible assets\n3 \n— \n— \n%\nTotal\n$\n1,549 \n$\n1,959 \n(21)\n%\nOur operating expenses decreased in fiscal 2025 compared to fiscal 2024 primarily due to a decrease in legal accruals, amortization of intangible assets and restructuring costs related to our acquisition of Avast.\nFiscal 2025 compared to fiscal 2024\nSales and marketing, research and development and impairment of intangible assets expenses remained relatively flat.\nGeneral and administrative expense decreased $313 million, primarily due to the absence of $369 million in legal costs related to our litigation with Columbia and GSA in fiscal 2024. This was partially offset by a $66 million legal contract dispute cost with E-commerce Partner B during fiscal 2025. Refer to Note 1 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for additional information on the legal contract dispute with E-commerce Partner B.\nAmortization of intangible assets decreased $59 million, primarily due to certain intangible assets being fully amortized during fiscal 2024.\nRestructuring and other costs decreased $50 million, primarily due a $48 million decrease in severance, termination benefits, contract cancellation costs and other exit and disposal costs in connection with the September 2022 Plan. See Note 12 of the Notes to the Consolidated Financial Statements for details of the fiscal 2025 restructuring activities.\nNon-operating income (expense), net\nFiscal Year\n $ Change\n(In millions)\n2025\n2024\n2025 vs. 2024\nInterest expense\n$\n(578)\n$\n(669)\n$\n91 \nInterest income\n28 \n25 \n3 \nForeign exchange gain (loss)\n2 \n3 \n(1)\nGain (loss) on equity investments\n(30)\n(40)\n10 \nGain (loss) on sale of properties\n— \n9 \n(9)\nOther\n(3)\n9 \n(12)\nNon-operating income (expense), net\n$\n(581)\n$\n(663)\n$\n82 \nFiscal 2025 compared to fiscal 2024\nNon-operating income (expense), net, decreased $82 million, primarily due to a $90 million decrease in interest expense resulting from the voluntary prepayments and repricing of our Term A and Term B facilities.\nProvision for income taxes\nFiscal Year\n(In millions, except for percentages)\n2025\n2024\nIncome (loss) before income taxes\n$\n1,029 \n$\n447 \nIncome tax expense (benefit)\n$\n386 \n$\n(160)\nEffective tax rate\n38 \n%\n(36)\n%\nFiscal 2025 compared to fiscal 2024\nOur effective tax rate increased primarily due to the absence of an income tax benefit in the second quarter of fiscal 2024, in addition to changes in unrecognized tax benefits and related interest and penalties, and the U.S. taxation on foreign earnings in fiscal 2025. See Note 13 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for information about our unrecognized tax benefits.\nThe Organization for Economic Cooperation and Development (OECD) and many countries have proposed to reallocate a portion of profits of large multinational enterprises (MNE) with an annual global turnover exceeding €20 billion to markets where \n38\nTable of Contents\nsales arise (Pillar One), as well as enact a global minimum tax rate of at least 15% for MNE with an annual global turnover exceeding €750 million (Pillar Two). On December 12, 2022, the European Union reached an agreement to implement the Pillar Two directive of the OECD’s reform of international taxation at the European Union level. The agreement affirms that all Member States must transpose the Pillar Two directive by December 31, 2023. The rules will therefore first be applicable for fiscal years starting on or after December 31, 2023. Ireland, Czech Republic, and certain jurisdictions in which we operate have enacted legislation to implement Pillar Two and other countries are actively considering changes to their tax laws to adopt certain parts of the OECD’s proposals. The enactment of Pillar Two legislation is not expected to have a material adverse effect on our effective tax rate and Consolidated Financial Statements in the near term. We will continue to monitor and reflect the impact of such legislative changes in future Consolidated Financial Statements as appropriate. \nLIQUIDITY, CAPITAL RESOURCES AND CASH REQUIREMENTS\nLiquidity and Capital Resources\nWe have historically relied on cash generated from operations, borrowings under credit facilities, issuances of debt and proceeds from divestitures for our liquidity needs. \nOur capital allocation strategy is to balance driving stockholder returns, managing financial risk and preserving our flexibility to pursue strategic options, including acquisitions and mergers. Historically, this has included a quarterly cash dividend, the repayment of debt and the repurchase of shares of our common stock. \nBased on past performance and current expectations, we believe that our existing cash and cash equivalents, together with cash generated from operations, amounts available under our Revolving Facility and our future refinancing plans related to our upcoming maturities, will be sufficient to meet our working capital needs, support on-going business activities and finance the expected synergy costs related to the acquisition of Avast and MoneyLion through at least the next 12 months and to meet our known long-term contractual obligations. We are currently not aware of any trends or demands, commitments, events or uncertainties that will result in or that are reasonably likely to result in our liquidity increasing or decreasing in any material way that will impact our capital needs during or beyond the next 12 months. However, our future liquidity and capital requirements may vary materially from those as of March 28, 2025 depending on several factors, including, but not limited to, economic conditions; political climate; the expansion of sales and marketing activities; the costs to acquire or invest in businesses; outcome of income tax audits with relevant tax authorities; resolution of legal proceedings, including, but not limited to, regulatory proceedings, claims, mediations, arbitrations and litigation; and the risks and uncertainties discussed in \n“Risk Factors” in Part I, Item 1A.\nCash flows\nThe following table summarizes our cash flow activities in fiscal 2025 and 2024:\nFiscal Year\n(In millions)\n2025\n2024\nNet cash provided by (used in):\nOperating activities\n$\n1,221 \n$\n2,064 \nInvesting activities\n$\n(100)\n$\n2 \nFinancing activities\n$\n(970)\n$\n(1,961)\nIncrease (decrease) in cash and cash equivalents\n$\n160 \n$\n96 \nSee Note 7 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for our supplemental cash flow information. \nCash from operating activities\nOur cash flows provided by and used in operating activities in fiscal 2025 decreased $843 million, primarily due to the absence of an income tax refund related to the filing of our fiscal 2023 tax return received during the fourth quarter of fiscal 2024.\nCash from investing activities\nOur cash flows provided by and used in investing activities in fiscal 2025 decreased $102 million, primarily related to the cash consideration paid for the acquisition of a technology-enabled personal finance education and recommendation platform during the fourth quarter of fiscal 2025.\nCash from financing activities\nOur cash flows used in financing activities in fiscal 2025 decreased $991 million, primarily due to the issuance of our 6.25% Senior Notes, lower voluntary prepayments of our Term B facility and repurchases of common stock under our repurchase program. This was offset by the repayment of our 5.0% Senior Notes, using the net proceeds from the 6.25% Senior Notes.\nCash and cash equivalents\nAs of March 28, 2025, we had cash and cash equivalents of approximately $1,006 million, of which $359 million was held by our foreign subsidiaries. Our cash and cash equivalents are managed with the objective to preserve principal, maintain liquidity and generate investment returns. The participation exemption system under current U.S. federal tax regulations generally allows us to make distributions of non-U.S. earnings to the U.S. without incurring additional U.S. federal tax; however, these distributions may be subject to applicable state or non-U.S. taxes.\n39\nTable of Contents\nDebt\nWe have an undrawn revolving credit facility of \n$1,494 million\n, \nnet of our letters of credit, \nwhich expires in September 2027.\nStock repurchases\nDuring the fiscal 2025 and 2024, we executed repurchases of 11 million and 21 million of our common stock under our existing stock repurchase program for an aggregate amount of $272 million and $441 million, respectively.\nMaterial Cash Requirements\nOur principal cash requirements are primarily to meet our working capital needs, support on-going business activities, including payment of taxes and cash dividends, payment of contractual obligations, funding capital expenditures, servicing existing debt, repurchasing shares of our common stock and investing in business acquisitions and mergers.\nDebt instruments\nAs of March 28, 2025, our total outstanding principal amount of indebtedness is summarized as follows. See Note 10 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information on our debt.\n(In millions)\nMarch 28, 2025\nTerm Loans\n$\n5,905 \nSenior Notes\n2,450 \nTotal debt\n$\n8,355 \nThe Amended Credit Agreement contains customary representations and warranties and affirmative and negative covenants, \nincluding compliance with specified financial ratios\n.\n \nAs of March 28, 2025, we were in compliance with all debt covenants. See \nNote 10\n \nof the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further\n information regarding financial ratios and debt covenant compliance.\nDividends\nOn May 6, 2025, we announced a cash dividend of $0.125 per share of common stock to be paid in June 2025. Any future dividends and dividend equivalents will be subject to the approval from our Board of Directors.\nStock repurchase program\nUnder our stock repurchase program, we may purchase shares of our outstanding common stock on the open market (including through trading plans intended to qualify under Rule 10b5-1 under the Exchange Act) and through accelerated stock repurchase transactions. In May 2024, our Board of Directors authorized a new stock repurchase program through which we may repurchase shares of our common stock in an aggregate amount of up to $3 billion with no fixed expiration. This new stock repurchase program will supersede any amounts under the prior stock repurchase programs. As of March 28, 2025, the remaining balance of our stock repurchase authorization is $2,728 million and does not have an expiration date. The timing and actual number of shares repurchased will depend on a variety of factors, including price, general business and market conditions and other investment opportunities.\nRestructuring\nIn connection with the acquisition of Avast, our Board of Directors approved a restructuring plan (the September 2022 Plan) to realize cost savings and operational synergies, which became effective upon the close of the acquisition on September 12, 2022. We have incurred and expect to incur cash expenditures for severance and termination benefits, contract terminations, facilities closures, and the sale of underutilized facilities as well as stock-based compensation charges for accelerated equity awards for certain terminated employees. We expect that we will incur total costs up to $150 million following the completion of the acquisition. These actions are expected to be completed by the end of calendar year 2025. During fiscal 2025, we made $25 million in cash payments related to the September 2022 Plan. \nSee \nNote 12\n \nof the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further\n cash flow information associated with our restructuring activities.\n40\nTable of Contents\nSignificant contractual obligations\nThe following is a schedule of our principal commitments as of March 28, 2025. The expected timing and amount of short-term and long-term payments of the obligations in the following table is estimated based on current information. Timing of payments and actual amounts paid may be different, depending on the time of receipt of goods or services, or changes to agreed-upon amounts for certain obligations.\n(In millions)\nShort-Term Payments\nLong-Term Payments\nTotal\nContractual obligations:\nDebt (principal payments) \n(1)\n$\n291 \n$\n8,064 \n$\n8,355 \nInterest payments on debt \n(2)\n605 \n1,465 \n2,070 \nPurchase obligations \n(3)\n316 \n118 \n434 \nDeemed repatriation taxes \n(4)\n139 \n— \n139 \nOperating leases \n(5)\n16 \n48 \n64 \nTotal \n$\n1,367 \n$\n9,695 \n$\n11,062 \n(1)\nAs of March 28, 2025, our total outstanding principal amount of indebtedness is comprised of $5,905 million in Term Loans and $2,450 million in Senior Notes. See Note 10 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information about our debt and debt covenants.\n(2)\nInterest payments calculated based on the contractual terms of the related debt instruments. Interest on variable rate debt was calculated using the interest rate in effect as of March 28, 2025. Interest on variable rate debt may vary based on the performance of our interest rate swaps. See Note 10 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information on the term loans and senior notes.\n(3)\nAgreements for purchases of goods or services, with terms that are enforceable and legally binding and specify all significant terms, including fixed or minimum quantities to be purchased; fixed, minimum, or variable price provisions; and the approximate timing of the transaction. These amounts include agreements to purchase goods or services that have cancellation provisions requiring little or no payment. The amounts under such contracts are included because management believes that cancellation of these contracts is unlikely, and we expect to make future cash payments according to the contract terms or in similar amounts for similar materials.\n(4)\nTransition tax payments on previously untaxed foreign earnings of foreign subsidiaries under the Tax Cuts and Jobs Act, which may be paid through July 2025.\n(5)\nPayments for various non-cancelable operating lease agreements that expire on various dates through fiscal 2033. The amounts in the table above exclude expected sublease income. See Note 9 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information on leases.\nDue to the uncertainty with respect to the timing of future cash flows associated with our unrecognized tax benefits and other long-term taxes as of March 28, 2025, we are unable to make reasonably reliable estimates of the period of cash settlement with the respective taxing authorities. Therefore, $1,419 million in long-term income taxes payable has been excluded from the contractual obligations table. See Note 13 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information.\nIndemnifications\nIn the ordinary course of business, we may provide indemnifications of varying scope and terms to customers, vendors, lessors, business partners, subsidiaries, and other parties with respect to certain matters, including, but not limited to, product warranties and losses arising out of our breach of agreements or representations and warranties made by us, including claims alleging that our software infringes on the intellectual property rights of a third party. In addition, our bylaws contain indemnification obligations to our directors, officers, employees and agents, and we have entered into indemnification agreements with our directors and certain of our officers to give such directors and officers additional contractual assurances regarding the scope of the indemnification set forth in our bylaws and to provide additional procedural protections. We maintain director and officer insurance, which may cover certain liabilities arising from our obligation to indemnify our directors and officers. Refer to Note 18 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information on our indemnifications.",
  "item2": null
}