{
  "source_file": "gen-20251003.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n Management’s Discussion and Analysis of Financial Condition and Results of Operations\nForward-looking statements and factors that may affect future results\nThe discussion below contains forward-looking statements, which are subject to safe harbors under the Securities Act of 1933, as amended (the Securities Act) and the Exchange Act of 1934, as amended (the Exchange Act). Forward-looking statements include statements that represent our expectations or beliefs concerning future events, including, without limitation, references to our ability to utilize our deferred tax assets, as well as statements including words such as “expects,” “plans,” “anticipates,” “believes,” “estimates,” “predicts,” “goal,” “intent,” “momentum,” “projects,” “forecast,” “outlook,” “strategy,” “future,” “opportunity,” “plan,” “may,” “should,” “will,” “would,” “will be,” and similar expressions. In addition, projections of our future financial performance; beliefs regarding our business and strategies; anticipated growth and trends in our businesses and in our industries; the consummation of or anticipated impacts of acquisitions (including our ability to achieve synergies from acquisitions, including, but not limited to, our acquisition of MoneyLion), expectations about certain markets, divestitures, restructurings, stock repurchases, financings, debt repayments, investment activities and our liquidity; the outcome or impact of pending litigation, claims or disputes; risks associated with third party providers; evolving regulations and increased scrutiny from regulators; our intent to pay quarterly cash dividends in the future; plans for and anticipated benefits of our products and solutions; anticipated tax rates, benefits and expenses; the global macroeconomic outlook, including but not limited to, the impact of inflation, fluctuations in foreign currency exchange rates, changes in interest rates, and the impact of new trade policy, including the implementation of global tariffs; retaliatory trade regulations and policies; economic disruptions caused by the potential impact of volatility and conflict in the geopolitical and economic environment; general uncertainty in the financial and capital markets; and other global macroeconomic factors on our operations and financial performance; and other characterizations of future events or circumstances are forward-looking statements. These statements are only predictions, based on our current expectations about future events and may not prove to be accurate. We do not undertake any obligation to update these forward-looking statements to reflect events occurring or circumstances arising after the date of this report. These forward-looking statements involve risks and uncertainties, and our actual results, performance, or achievements could differ materially from those expressed or implied by the forward-looking statements on the basis of several factors, including economic recessions, inflationary pressures and those other factors that we discuss in Part II Item 1A. Risk Factors, of this Quarterly Report on Form 10-Q and Item 1A. Risk Factors of our Annual Report on Form 10-K for the fiscal year ended March 28, 2025. We encourage you to read those sections carefully. There may also be other factors that have not been anticipated or that are not described in our periodic filings with the Securities and Exchange Commission (SEC), generally because we did not believe them to be significant at the time, which could cause actual results to differ materially from our projections and expectations. All forward-looking statements should be evaluated with the understanding of their inherent uncertainty.\nOVERVIEW\nGen Digital Inc. is a global company powering Digital Freedom through its family of trusted consumer brands including Norton, Avast, LifeLock, MoneyLion, and more. Our portfolio spans Cyber Safety Platform and Trust-Based Solutions, delivering intuitive, AI-powered services that enable people to confidently grow, manage, and protect their digital and financial lives. From cybersecurity and online privacy to identity protection and financial empowerment, our products and services are designed to meet the real-world needs of today’s digital generation. Through a foundation of trust and innovation, our brands deliver the protection and confidence people need to thrive in a digital-first world.\nOur Cyber Safety Platform delivers technology solutions and superior threat protection to help people navigate the digital world, securely, privately and with confidence. Our Trust-Based Solutions provide innovative solutions and insights that empower consumers to manage their identity, reputation and finances confidently to achieve freedom.\nFiscal calendar\nWe have a 52/53-week fiscal year ending on the Friday closest to March 31. The three months ended October 3, 2025 and September 27, 2024 each consisted of 13 weeks. The six months ended October 3, 2025 consisted of 27 weeks, whereas the six months ended September 27, 2024 consisted of 26 weeks. Our 2026 fiscal year consists of 53 weeks and ends on April 3, 2026.\nKey financial metrics\nThe following tables provide our key financial metrics for the periods presented:\nThree Months Ended\nSix Months Ended\n(In millions, except for per share amounts)\nOctober 3, 2025\nSeptember 27, 2024\nOctober 3, 2025\nSeptember 27, 2024\nNet revenues\n$\n1,220 \n$\n974 \n$\n2,477 \n$\n1,939 \nOperating income (loss)\n$\n438 \n$\n402 \n$\n884 \n$\n819 \nNet income (loss)\n$\n134 \n$\n161 \n$\n269 \n$\n342 \nNet income (loss) per share - diluted\n$\n0.21 \n$\n0.26 \n$\n0.43 \n$\n0.55 \n27\nTable of Contents\nAs Of\n(In millions)\nOctober 3, 2025\nMarch 28, 2025\nCash, cash equivalents and restricted cash\n$\n701 \n$\n1,006 \nContract liabilities\n$\n1,862 \n$\n1,923 \nBelow are our financial highlights for the second quarter of fiscal 2026, compared to the corresponding period in the prior year:\n•\nNet revenues increased $246 million, primarily due to higher sales in both our Cyber Safety Platform products and Trust-Based Solutions, including an increase of $202 million due to the acquisition of MoneyLion, reported in Trust-Based Solutions.\n•\nOperating income increased $36 million, primarily due to increased net revenues described above, offset by an increase in marketing costs, payment processing fees, amortization of intangible assets and compensation related expenses.\n•\nNet income decreased $27 million and net income per share decreased $0.05, primarily due to a decrease in other income (expense), net resulting from changes in fair value and impairment of our non-marketable equity investments partially offset by an increase in operating income as discussed above.\nBelow are our financial highlights for the first six months of fiscal 2026, compared to the corresponding period in the prior year:\n•\nNet revenues increased $538 million, primarily due to higher sales in both our Cyber Safety Platform products and Trust-Based Solutions, including an increase of $370 million due to the acquisition of MoneyLion, and an increase of $87 million due to the favorable impact from the additional week in the first quarter of fiscal 2026.\n•\nOperating income increased $65 million, primarily due to increased net revenues described above, offset by an increase in marketing costs, payment processing fees, amortization of intangible assets and compensation related expenses.\n•\nNet income decreased $73 million and net income per share decreased $0.12, primarily due to a decrease in other income (expense), net resulting from changes in fair value and impairment of our non-marketable equity investments and an increase in income tax expense partially offset by an increase in operating income as discussed above.\n•\nCash and cash equivalents decreased by $305 million compared to March 28, 2025, primarily due to the cash consideration paid for our acquisition of MoneyLion, timing of principal payments of our Term A and B facilities and cash interest paid. This is partially offset by proceeds from the issuance of our Incremental Term Loan B and cash generated from operating activities during the first six months of fiscal 2026.\n•\nContract liabilities decreased $61 million compared to March 28, 2025, primarily due to billing seasonality.\nAcquisition of MoneyLion\nOn April 17, 2025, we completed our acquisition of MoneyLion Inc. (MoneyLion). MoneyLion extends our identity solutions into offering comprehensive financial wellness through MoneyLion’s full-featured personal finance platform that includes credit building and financial management services. See Note 4 of the Notes to the Condensed Consolidated Financial Statements for further information about the acquisition.\nGLOBAL MACROECONOMIC CONDITIONS\nAs a global company, our results of operations and cash flows may be influenced by global macroeconomic conditions and their impact on customer behavior. Global macroeconomic conditions include, but are not limited to, increased tariffs and an uncertain global trade environment, foreign currency exchange rate fluctuations, the impact of interest rate fluctuations, elevated inflation, ongoing and new geopolitical conflicts, the impacts of current and future trade regulations, instability in the global banking sector, slow growth and recession risks, and changes in legislation or regulations and actions by regulators, including changes in enforcement and administrative policies, any of which may be difficult to predict and may persist for an extended period.\nDespite challenging global macroeconomic conditions and although we recognize that inflation and broader economic uncertainty can influence customer behavior, we are confident in the long-term overall health of our business, the strength of our product offerings and our ability to continue to execute on our strategy, including bringing award-winning products and services in cybersecurity and offering comprehensive financial wellness to our customers.\nWe continue to monitor the direct and indirect impacts of these global macroeconomic or other geopolitical factors. If the economic uncertainty continues, we may experience negative impacts on customer renewals, customer collections, sales and marketing efforts, customer deployments, product development, or other financial metrics. Additional broader implications of these events on our business, results of operations, and overall financial position still remain uncertain and could result in further adverse impacts to our reported results. For further discussion of the potential impacts of global macroeconomic conditions on our business, please see Part 1, Item III and “Risk Factors” in Part II, Item 1A below.\nCRITICAL ACCOUNTING ESTIMATES \nThe preparation of our Condensed Consolidated Financial Statements and related notes in accordance with generally accepted accounting principles in the U.S. requires us to make estimates, including judgments and assumptions that affect the \n28\nTable of Contents\nreported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. We have based our estimates, judgments and assumptions on historical experience and on various other factors we believe to be reasonable under the circumstances. We evaluate our estimates, judgments and assumptions on a regular basis and make changes accordingly. Management believes that the accounting estimates employed and the resulting amounts are reasonable; however, actual results may differ from these estimates. Making estimates, judgments and assumptions about future events is inherently unpredictable and is subject to significant uncertainties, some of which are beyond our control. Should any of these estimates, judgments or assumptions change or prove to have been incorrect, it could have a material impact on our results of operations, financial position and cash flows.\nOur critical accounting policies and estimates were disclosed in Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the fiscal year ended March 28, 2025 and significant policies adopted as a result of our acquisition of MoneyLion are included in Note 1 on this Form 10-Q. There have been no other material changes in the matters for which we make critical accounting estimates in the preparation of our Condensed Consolidated Financial Statements during the three and six months ended October 3, 2025. \nRESULTS OF OPERATIONS\nThe following table sets forth our Condensed Consolidated Statements of Operations data as a percentage of net revenues for the periods indicated:\nThree Months Ended\nSix Months Ended\nOctober 3, 2025\nSeptember 27, 2024\nOctober 3, 2025\nSeptember 27, 2024\nNet revenues\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nCost of revenues\n22 \n20 \n22 \n20 \nGross profit\n78 \n80 \n78 \n80 \nOperating expenses:\nSales and marketing\n24 \n19 \n24 \n19 \nResearch and development\n8 \n9 \n8 \n8 \nGeneral and administrative\n5 \n7 \n5 \n6 \nAmortization of intangible assets\n5 \n5 \n4 \n4 \nRestructuring and other costs\n0 \n0 \n1 \n0 \nTotal operating expenses\n42 \n39 \n43 \n38 \nOperating income (loss)\n36 \n41 \n36 \n42 \nInterest expense\n(12)\n(15)\n(12)\n(16)\nOther income (expense), net\n(5)\n1 \n(2)\n1 \nIncome (loss) before income taxes\n19 \n26 \n22 \n28 \nIncome tax expense (benefit)\n8 \n10 \n11 \n10 \nNet income (loss)\n11 \n%\n17 \n%\n11 \n%\n18 \n%\nNote: Percentages may not add due to rounding.\nNet revenues\nThree Months Ended\nSix Months Ended\n(In millions, except for percentages)\nOctober 3, 2025\nSeptember 27, 2024\nChange in %\nOctober 3, 2025\nSeptember 27, 2024\nChange in %\nNet revenues\n$\n1,220 \n$\n974 \n25 \n%\n$\n2,477 \n$\n1,939 \n28 \n%\nThree Months Ended October 3, 2025 Compared with Three Months Ended September 27, 2024\nNet revenues increased $246 million, due to a $25 million increase in sales of our Cyber Safety Platform products and a $221 million increase in sales of our Trust-Based Solutions, including a $202 million increase in Trust-Based Solutions due to the acquisition of MoneyLion.  \nSix Months Ended October 3, 2025 Compared with Six Months Ended September 27, 2024\nNet revenues increased $538 million, due to a $114 million increase in sales of our Cyber Safety Platform products and a $424 million increase in sales of our Trust-Based Solutions, including a $370 million increase in Trust-Based Solutions due to the acquisition of MoneyLion. Net revenues also increased $87 million due to the favorable impact from the additional week in the first quarter of fiscal 2026, impacting both segment financials. Specifically, the additional week contributed $56 million to our Cyber Safety Platform and $31 million to Trust-Based Solutions.\nPerformance Metrics\nWe regularly monitor a number of metrics in order to measure our current performance and estimate our future performance. We believe these key operating metrics are useful to investors because management uses these metrics to assess the growth of \n29\nTable of Contents\nour business and the effectiveness of our marketing and operational strategies. Our metrics may be calculated in a manner different than similar metrics used by other companies.\nThe following table summarizes supplemental key performance metrics:\nThree Months Ended\nSix Months Ended \n(1)\n(In millions)\nOctober 3, 2025\nSeptember 27, 2024\nOctober 3, 2025\nSeptember 27, 2024\nCyber Safety Platform\n$\n814 \n$\n789 \n$\n1,683 \n$\n1,569 \nTrust-Based Solutions\n406 \n185 \n794 \n370 \nTotal net revenues\n$\n1,220 \n$\n974 \n$\n2,477 \n$\n1,939 \nDirect revenues\n$\n1,010 \n$\n862 \n$\n2,064 \n$\n1,714 \nPartner revenues\n210 \n112 \n413 \n225 \nTotal net revenues\n$\n1,220 \n$\n974 \n$\n2,477 \n$\n1,939 \nTotal bookings\n$\n1,222 \n$\n964 \n$\n2,424 \n$\n1,877 \nAs of\n(In millions)\nOctober 3, 2025\nSeptember 27, 2024\nTotal paid customers\n77 \n67 \n(1)    From time to time, changes in allocation methodologies cause changes to the revenue categories above. When changes occur, we recast historical amounts to match the current methodology, such as for the six months ended October 3, 2025, where we aligned allocation methodologies across our channels.\nRevenue from Cyber Safety Platform increased $25 million and $114 million, respectively, during the three and six months ended October 3, 2025 due to growth across our cyber safety membership offerings and, for the six month period, the additional week in the first quarter of fiscal 2026. Revenue from Trust Based Solutions increased $221 million and $424 million, respectively, during the three and six months ended October 3, 2025 primarily due to the acquisition of MoneyLion, continued growth in our identity point solutions and, for the six month period, the additional week in the first quarter of fiscal 2026.\nDirect revenue reflects subscriptions sold directly through e-commerce or mobile channels, and revenue generated from financial transactions directly made through Gen properties or marketplaces.\nPartner revenue reflects partner-sourced and channel revenue via retailers, employee benefits, telcos, publishers, and strategic partnerships, including revenue generated from product usage or products sold through our financial marketplace.\nTotal bookings are defined as customer orders received that are expected to generate net revenues in the future. We present the operational metric of bookings because it reflects customers’ demand for our products and services and to assist readers in analyzing our performance in future periods. \nWe define paid customers as active users of our products and solutions, including subscribers with an active paid subscription to our products at the end of the reported period. Paid customers also includes product users with a unique account and at least one revenue-generating transaction in the relevant active period of each respective product category, whether through our first-party personal finance products, transacting through our financial marketplaces, or generating revenue through product usage. We exclude users on free trials and those who have not actively transacted in the relevant period of each respective product category. \nIn order to properly reflect \nour \ncustomer cohorts that contribute to revenue given the dynamic nature of consumers and our product portfolio, our methodology is subject to change from time to time. The methodologies used to measure these metrics require judgment and we regularly review our metrics to improve their accuracy. However, our ability to recalculate our historical metrics may be impacted by data limitations or other factors that require us to apply different methodologies for such adjustments. We generally do not intend to update previously disclosed metrics for any such inaccuracies or adjustments that are deemed not material.\n30\nTable of Contents\nNet revenues by geographical region\nThree Months Ended\nSix Months Ended\nOctober 3, 2025\nSeptember 27, 2024\nOctober 3, 2025\nSeptember 27, 2024\nAmericas\n71 \n%\n66 \n%\n71 \n%\n66 \n%\nEMEA\n21 \n%\n24 \n%\n21 \n%\n24 \n%\nAPJ\n8 \n%\n10 \n%\n8 \n%\n10 \n%\nThe Americas include the U.S., Canada and Latin America; EMEA includes Europe, the Middle East and Africa; APJ includes Asia Pacific and Japan.\nPercentage of revenue in Americas increased primarily due to our acquisition of MoneyLion during the three and six months ended October 3, 2025 as compared to the three and six months ended September 27, 2024.\nCost of revenues\nThree Months Ended\nSix Months Ended\n(In millions, except for percentages)\nOctober 3, 2025\nSeptember 27, 2024\nChange in %\nOctober 3, 2025\nSeptember 27, 2024\nChange in %\nCost of revenues\n$\n266 \n$\n194 \n37 \n%\n$\n533 \n$\n384 \n39 \n%\nThree Months Ended October 3, 2025 Compared with Three Months Ended September 27, 2024\nCost of revenues, increased $72 million, primarily due to a $46 million increase in partner revenue share in Trust-Based Solutions, a $12 million increase in payment processing fees and an $8 million increase in amortization of intangible assets.\nSix Months Ended October 3, 2025 Compared with Six Months Ended September 27, 2024\nCost of revenues, including the impact of one additional week, increased $149 million, primarily due to a $95 million increase in partner revenue share in Trust-Based Solutions, a $25 million increase in payment processing fees and a $16 million increase in amortization of intangible assets.\nOperating expenses\nThree Months Ended\nSix Months Ended\n(In millions, except for percentages)\nOctober 3, 2025\nSeptember 27, 2024\nChange in %\nOctober 3, 2025\nSeptember 27, 2024\nChange in %\nSales and marketing\n$\n297 \n$\n184 \n61 \n%\n$\n594 \n$\n367 \n62 \n%\nResearch and development\n100 \n83 \n20 \n%\n209 \n164 \n27 \n%\nGeneral and administrative\n60 \n64 \n(6)\n%\n134 \n116 \n16 \n%\nAmortization of intangible assets\n55 \n44 \n25 \n%\n109 \n87 \n25 \n%\nRestructuring and other costs\n4 \n3 \n33 \n%\n14 \n2 \n600 \n%\nTotal operating expenses\n$\n516 \n$\n378 \n37 \n%\n$\n1,060 \n$\n736 \n44 \n%\nThree Months Ended October 3, 2025 Compared with Three Months Ended September 27, 2024\nSales and marketing expense increased $113 million, primarily due to a $55 million increase in loss on sale of Instacash Advances, a $27 million increase in marketing expenses, a $19 million increase in headcount costs and a $10 million increase in stock-based compensation expense.\nResearch and development expense increased $17 million, primarily due to an $8 million increase in headcount costs, a $4 million increase in stock-based compensation expense and a $3 million increase in equipment expenses.\nGeneral and administrative expense remained relatively flat. \nAmortization of intangible assets increased $11 million, primarily due to our acquisition of MoneyLion.\nRestructuring and other costs remained relatively flat. See Note 12 of the Notes to the Condensed Consolidated Financial Statements for details of the fiscal 2026 restructuring activities.\nSix Months Ended October 3, 2025 Compared with Six Months Ended September 27, 2024\nSales and marketing expense, including the impact of one additional week, increased $227 million, primarily due to a $91 million increase in loss on sale of Instacash Advances, a $61 million increase in marketing expenses, a $40 million increase in headcount costs and a $25 million increase in stock-based compensation expense.\nResearch and development expense, including the impact of one additional week, increased $45 million, primarily due to a $24 million increase in headcount costs, a $9 million increase in stock-based compensation expense and $6 million increase in occupancy and IT costs.\nGeneral and administrative expense, including the impact of one additional week, increased $18 million, primarily due to a $22 million increase in stock-based compensation expense, a $16 million increase in headcount costs and an $8 million increase in provision for credit losses. This is partially offset by a $33 million decrease in litigation settlement expense.\n31\nTable of Contents\nAmortization of intangible assets increased $22 million, primarily due to our acquisition of MoneyLion.\nRestructuring and other costs increased $12 million, primarily due to an increase in severance and termination benefits in connection with the September 2022 and April 2025 Plans. See Note 12 of the Notes to the Condensed Consolidated Financial Statements for details of the fiscal 2026 restructuring activities.\nNon-operating income (expense), net\nThree Months Ended\nSix Months Ended\n(In millions)\nOctober 3, 2025\nSeptember 27, 2024\nOctober 3, 2025\nSeptember 27, 2024\nInterest expense\n$\n(146)\n$\n(149)\n$\n(302)\n$\n(302)\nInterest income\n6 \n6 \n15 \n14 \nForeign exchange gain (loss)\n2 \n(2)\n2 \n2 \nChange in fair value and impairment of non-marketable equity investments\n(69)\n— \n(69)\n— \nGain (loss) on sale of property\n— \n— \n(1)\n— \nOther\n2 \n1 \n4 \n1 \nTotal non-operating income (expense), net\n$\n(205)\n$\n(144)\n$\n(351)\n$\n(285)\nThree Months Ended October 3, 2025 Compared with Three Months Ended September 27, 2024\nNon-operating income (expense), net, increased by $61 million, primarily due to a $69 million change in fair value and impairment of our non-marketable equity investments.\nSix Months Ended October 3, 2025 Compared with Six Months Ended September 27, 2024\nNon-operating income (expense), net, increased by $66 million, primarily due to a $69 million change in fair value and impairment of our non-marketable equity investments.\nProvision for income taxes\nThree Months Ended\nSix Months Ended\n(In millions, except for percentages)\nOctober 3, 2025\nSeptember 27, 2024\nOctober 3, 2025\nSeptember 27, 2024\nIncome (loss) before income taxes\n$\n233 \n$\n258 \n$\n533 \n$\n534 \nIncome tax expense (benefit)\n$\n99 \n$\n97 \n$\n264 \n$\n192 \nEffective tax rate\n42 \n%\n38 \n%\n50 \n%\n36 \n%\nOur effective tax rate for the three and six months ended October 3, 2025 and three and six months ended September 27, 2024 differs from the federal statutory income tax rate primarily due to state taxes, changes in unrecognized tax benefits and related interest and penalties, foreign exchange impacts, increases in valuation allowances, and the U.S. taxation on foreign earnings.\nOn July 4, 2025, the One Big Beautiful Bill Act (the Act) was enacted into law in the United States. The Act includes various provisions that are applicable to us beginning in fiscal year 2026. These provisions include an allowance to accelerate tax deductions of certain capital expenditures, research & experimentation expenditures, and an increase to the annual limitation of tax-deductible interest expenses. The impacts of the Act are included in our operating results for the three and six months ended October 3, 2025. The Act is not expected to have a material impact on our effective tax rate.\nThe Organization for Economic Cooperation and Development (OECD) and many countries have proposed to reallocate a portion of profits of large multinational enterprises (MNE) with an annual global turnover exceeding €20 billion to markets where sales arise (Pillar One), as well as enact a global minimum tax rate of at least 15% for MNE with an annual global turnover exceeding €750 million (Pillar Two). On December 12, 2022, the European Union reached an agreement to implement the Pillar Two directive of the OECD’s reform of international taxation at the European Union level. The agreement affirms that all Member States must transpose the Pillar Two directive by December 31, 2023. The rules were therefore applicable for fiscal years starting on or after December 31, 2023. Ireland, Czech Republic, and certain jurisdictions in which we operate have enacted legislation to implement Pillar Two and other countries are actively considering changes to their tax laws to adopt certain parts of the OECD’s proposals. The enactment of Pillar Two legislation is not expected to have a material adverse effect on our effective tax rate and Condensed Consolidated Financial Statements in the near term. Moreover, in June 2025, the G7 agreed to exclude United States MNEs from certain aspects of the Pillar Two global minimum tax rules (the G7 Statement) in exchange for the United States not imposing retaliatory taxes in the Act. We will continue to monitor and reflect the impact of such legislative changes, including the G7 Statement, which has not yet been incorporated into the OECD framework, in future Condensed Consolidated Financial Statements as appropriate. \nLIQUIDITY, CAPITAL RESOURCES AND CASH REQUIREMENTS \nLiquidity and Capital Resources\nWe have historically relied on cash generated from operations, borrowings under credit facilities, issuances of debt and proceeds from divestitures for our liquidity needs.\n32\nTable of Contents\nOur capital allocation strategy is to balance driving stockholder returns, managing financial risk and preserving our flexibility to pursue strategic options, including acquisitions and mergers. Historically, this has included a quarterly cash dividend, the repayment of debt and the repurchase of shares of our common stock.\nBased on past performance and current expectations, we believe that our existing cash and cash equivalents, together with cash generated from operations, amounts available under our Revolving Facility and our future refinancing plans related to our upcoming maturities, will be sufficient to meet our working capital needs, support on-going business activities and finance the expected synergy costs related to the acquisition of MoneyLion through at least the next 12 months and to meet our known long-term contractual obligations. We are currently not aware of any trends or demands, commitments, events or uncertainties that will result in or that are reasonably likely to result in our liquidity increasing or decreasing in any material way that will impact our capital needs during or beyond the next 12 months. However, our future liquidity and capital requirements may vary materially from those as of October 3, 2025, depending on several factors, including, but not limited to, economic conditions; political climate; the expansion of sales and marketing activities; the costs to acquire or invest in businesses; outcome of income tax audits with relevant tax authorities; resolution of legal proceedings, including, but not limited to, regulatory proceedings, claims, mediations, arbitrations and litigation; and the risks and uncertainties discussed in “Risk Factors” in Part II, Item 1A below.\nCash flows\nThe following summarizes our cash flow activities:\nSix Months Ended\n(In millions)\nOctober 3, 2025\nSeptember 27, 2024\nNet cash provided by (used in):\nOperating activities\n$\n525 \n$\n422 \nInvesting activities\n$\n(880)\n$\n(10)\nFinancing activities\n$\n48 \n$\n(538)\nSee Note 7 of the Notes to the Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q for our supplemental cash flow information. \nCash from operating activities\nNet cash provided by operating activities of $525 million for the six months ended October 3, 2025 was primarily comprised of net income adjusted for the net effect of non-cash items. Changes in working capital sources and uses of cash include decreases in income taxes payable, Instacash Advances held for sale, contract liabilities, accounts payable and other liabilities. \nCash from investing activities\nNet cash used in investing activities of $880 million for the six months ended October 3, 2025 was primarily related to the cash consideration paid for our acquisition of MoneyLion. \nCash from financing activities\nNet cash provided by financing activities of \n$48 million for the six months ended October 3, 2025 was primarily due to proceeds from the issuance of our Incremental Term Loan B of $741 million, net of debt issuance cost. This was partially offset by mandatory and voluntary prepayments of our Term A and B Facilities, quarterly dividend payments, and repurchases of common stock under our repurchase program.\nCash and cash equivalents\nAs of October 3, 2025, we had cash and cash equivalents of $691 million, excluding restricted cash, of which $380 million was held by our foreign subsidiaries. Our cash, cash equivalents and short-term investments are managed with the objective to preserve principal, maintain liquidity and generate investment returns. The participation exemption system under current U.S. federal tax regulations generally allows us to make distributions of non-U.S. earnings to the U.S. without incurring additional U.S. federal tax, however, these distributions may be subject to applicable state or foreign taxes. \nDebt\nWe have an undrawn revolving credit facility of $1,494 million, net of our letters of credit, which expires in September 2027. \nStock repurchases\nDuring the six months ended October 3, 2025 and September 27, 2024, we executed repurchases of 5 million and 11 million of our common stock under our existing stock repurchase program for an aggregate amount of $134 million and $272 million, respectively. We did not have any stock repurchases during the three months ended October 3, 2025 and September 27, 2024.\nMaterial Cash Requirements\nOur principal cash requirements are primarily to meet our working capital needs, support on-going business activities, including payment of taxes and cash dividends, payment of contractual obligations, funding capital expenditures, servicing existing debt, repurchasing shares of our common stock and investing in business acquisitions and mergers.\n33\nTable of Contents\nDebt instruments\nAs of October 3, 2025, our total outstanding principal amount of indebtedness is summarized as follows. See Note 10 of the Notes to the Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q for further information on our debt. \n(In millions)\nOctober 3, 2025\nTerm Loans\n$\n6,304 \nSenior Notes\n2,450 \nOther Debt\n40 \nTotal debt\n$\n8,794 \nThe Amended Credit Agreement contains customary representations and warranties and affirmative and negative covenants, including compliance with specified financial ratios. As of October 3, 2025, we were in compliance with all debt covenants. See Note 10 of the Notes to the Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q for further information regarding financial ratios and debt covenant compliance.\nDividends\nOn November 6, 2025, we announced a cash dividend of $0.125 per share of common stock to be paid in December 2025. Any future dividends and dividend equivalents will be subject to the approval of our Board of Directors.\nStock repurchase program\nUnder our stock repurchase program, we may purchase shares of our outstanding common stock on the open market (including through trading plans intended to qualify under Rule 10b5-1 under the Exchange Act) and through accelerated stock repurchase transactions. As of October 3, 2025, the remaining balance of our stock repurchase authorization was $2,594 million and does not have an expiration date. The timing and actual number of shares repurchased will depend on a variety of factors, including price, general business and market conditions and other investment opportunities.\nRestructuring\nSee Note 12 of the Notes to the Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q for cash flow information associated with our restructuring activities.\nSignificant contractual obligations\nOur principal commitments consist of principal and interest payments related to our debt instruments, obligations under our purchase agreements, obligations under various non-cancellable leases and potential other legal contingencies. Due to the uncertainty with respect to the timing of future cash flows associated with our unrecognized tax benefits and other long-term taxes as of October 3, 2025, we are unable to make reasonably reliable estimates of the period of cash settlement with the respective taxing authorities. Therefore, $1,544 million in long-term income taxes payable has been excluded from our quarterly review of timing of contractual obligations.\nThere have been no material changes, outside the ordinary course of business, to the contractual obligations reported in our Annual Report. For additional information about our debt obligations and certain other contingencies, see Note 10 and Note 18, respectively, of the Notes to the Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q."
}