{
  "source_file": "gev-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF \nOPERATIONS\n. \nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction \nwith our consolidated and combined financial statements, which are prepared in conformity with U.S. generally accepted accounting \nprinciples (GAAP), and corresponding notes included elsewhere in this \nQuarterly\n Report on Form \n10-Q\n. The following discussion and \nanalysis provides information that management believes to be relevant to understanding the financial condition and results of operations of \nthe Company for the three and \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n. The below discussion should be read alongside Item 7. \n\"Management’s Discussion and Analysis of Financial Condition and Results of Operations\" and our audited consolidated and combined \nfinancial statements and corresponding notes in our Annual Report on Form 10-K for the fiscal year ended \nDecember 31, 2024\n. Unless \notherwise noted, tables are presented in U.S. dollars in millions, except for per-share amounts which are presented in U.S. dollars. Certain \ncolumns and rows within tables may not add due to the use of rounded numbers. Percentages presented in this report are calculated from \nthe underlying numbers in millions. Unless otherwise noted, statements related to changes in operating results relate to the corresponding \nperiod in the prior year.\nIn the accompanying analysis of financial information, we sometimes use information derived from consolidated and combined financial \ndata but not presented in our financial statements prepared in accordance with GAAP. Certain of these data are considered “non-GAAP \nfinancial measures” under SEC rules. For the reasons we use these non-GAAP financial measures and the reconciliations to their most \ndirectly comparable GAAP financial measures, see \"\n—\nNon-GAAP Financial Measures.\"\nFinancial Presentation Under GE Ownership.\n \nWe completed our separation from General Electric Company (GE), which now operates \nas GE Aerospace, on April 2, 2024 (the Spin-Off). For further information, see Note 1 in the Notes to our audited consolidated and \ncombined financial statements in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nProlec GE.\n \nOn October 21, 2025, we announced that GE Vernova will acquire the remaining fifty percent stake of Prolec GE, our \nunconsolidated joint venture with Xignux. Prolec GE is a leading grid equipment supplier, producing transformers across most ratings and \nvoltages with approximately 10,000 global employees across seven manufacturing sites globally, including five in the U.S. Under the \npurchase agreement, \nGE Vernova \nwill pay approximately $5\n.3\n billion at closing, expected to be funded equally between cash and debt. The \nacquisition is expected to close by mid-2026, subject to the completion of customary regulatory approvals.\nTariffs.\n Throughout 2025, the United States and other countries imposed global tariffs. These tariffs and any future tariffs will result in \nadditional costs to us. The current total estimated cost impact from the global tariffs as outlined is trending \ntowards the \nlower end of\n \napproximately\n $300 million to $400 million \nfor the full year 2025, after taking into consideration contractual protections and mitigating \nactions. The actual impact of the tariffs may be significantly different than our current estimate. Our estimate is subject to several factors \nincluding the amount, duration, scope and nature of the tariffs, countermeasures that countries take, mitigating or other actions we take, \nand contractual implications.\nPower Conversion & Storage.\n \nEffective January 1, 2025, our Power Conversion and Solar & Storage Solutions business units within our \nElectrification segment were combined to form a new business unit, Power Conversion & Storage. Historical financial information presented \nwithin this report conforms to the new business unit structure within the Electrification segment.\nTRENDS AND FACTORS IMPACTING OUR PERFORMANCE.\n \nWe believe our performance and future success depends on a number of \nfactors that present significant opportunities for us but also pose risks and challenges, including those discussed below.\nOur worldwide operations are affected by regional and global factors impacting energy demand, including industry trends like \ndecarbonization, an increasing demand for renewable energy alternatives, governmental regulations and policies, and changes in broader \neconomic and geopolitical conditions. These trends, along with the growing focus on the digitization and sustainability of the electricity \ninfrastructure, can impact performance across each of our business segments. We believe that our industry-defining technologies and \ncommitment to innovation position us well to capitalize on, as well as mitigate adverse impacts from, these long-term trends:\n•\nDemand growth for electricity generation\n – Significant investment, infrastructure, and supply diversity will be essential to help meet \nforecasted energy demand growth arising from population and global economic growth.\n•\nDecarbonization\n – The urgency to combat climate change is fueling technology advancements that improve the economic viability and \nefficiency of renewable energy alternatives and facilitate the transition to a more sustainable power sector. \n•\nEvolving generation mix\n – The power industry is shifting from coal generation to more electricity generated from zero- or low-carbon \nenergy sources, and an evolving balance of generation sources will be necessary to maintain a reliable, resilient, and affordable \nsystem.\n•\nEnergy resilience & security\n – Threats and challenges from extreme weather events, cyber-attacks, and geopolitical tensions have \nincreased focus on the strength and resilience of power generation and transmission and reinforced the need for a diversified mix of \nenergy sources.\n•\nGrid modernization and investment\n – Increased demand and the integration of advanced generation and storage solutions drive the \nneed to update aging infrastructure with new grid integration and automation solutions.\n•\nRegulatory and policy changes \n– Government policies and regulations, such as carbon pricing, renewable energy mandates, and \nsubsidies for renewable energy technologies, can significantly impact the power generation landscape. Staying ahead of regulatory \nchanges and adapting to new compliance requirements is crucial for maintaining a competitive advantage.\n•\nFinancial and investment dynamics\n – Access to capital and investment trends in the energy sector can influence the development and \ndeployment of new power generation projects. Understanding market dynamics and securing funding are key to progressing strategic \ninitiatives.\n2025 3Q FORM 10-Q \n26\nRESULTS OF OPERATIONS\n \nSummary of Results.\n \nRPO was \n$135.3 billion\n and \n$117.7 billion\n as of \nSeptember 30, 2025\n and \n2024\n, respectively. For the \nthree months \nended\n \nSeptember 30, 2025\n, total revenues were \n$10.0 billion\n, an \nincrease\n of \n$1.1 billion\n for the quarter. Net income (loss) was \n$0.5 billion\n, \nan \nincrease\n \nof \n$0.6 billion\n in net income for the quarter, and net income (loss) margin was \n4.5%\n. Diluted earnings (loss) per share was \n$1.64\n for the \nthree months ended\n \nSeptember 30, 2025\n, an \nincrease\n in diluted earnings per share of \n$1.99\n for the quarter. Cash flows from \n(used for) operating activities were \n$2.5 billion\n and \n$1.7 billion\n for the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively.\nFor the \nthree months ended\n \nSeptember 30, 2025\n, Adjusted EBITDA* was \n$0.8 billion\n, an \nincrease\n of \n$0.6 billion\n. Free cash flow* was \n$1.9 \nbillion\n and \n$1.1 billion\n for the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively.\nRPO, a measure of backlog, includes unfilled firm and unconditional customer orders for equipment and services, excluding any purchase \norder that provides the customer with the ability to cancel or terminate without incurring a substantive penalty. Services RPO includes the \nestimated life of contract sales related to long-term service agreements which remain unsatisfied at the end of the reporting period, \nexcluding contracts that are not yet active. Services RPO also includes the estimated amount of unsatisfied performance obligations for \ntime and material agreements, material services agreements, spare parts under purchase order, multi-year maintenance programs, and \nother services agreements, excluding any order that provides the customer with the ability to cancel or terminate without incurring a \nsubstantive penalty. See Note \n9\n in the Notes to the consolidated and combined financial statements for further information.\nRPO\nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\nEquipment\n$\n54,092\n$\n43,047\n$\n42,069\nServices\n81,177\n75,976\n75,678\nTotal RPO\n$\n135,269\n$\n119,023\n$\n117,746\nAs of \nSeptember 30, 2025\n, RPO \nincrease\nd \n$16.2 billion\n (\n14%\n)\n \nfrom \nDecember 31, 2024\n, primarily at Power, \ndue to increases at Gas \nPower due to Heavy-Duty Gas Turbine and Aeroderivative equipment and contractual services, and increases at Steam Power services \nand Hydro Power equipment, partially offset by a decrease at Steam Power equipment;\n at Electrification, primarily due to demand for \nswitchgear, alternating current substation solutions, and transformers at Grid Solutions and synchronous condensers at Power Conversion \n& Storage; partially offset at Wind, \ndue to decreases in orders at Onshore Wind as U.S. customers dealt with policy uncertainty and \ndecreases at Offshore Wind as we continue to execute on our contracts\n. \nRPO \nincrease\nd \n$17.5 billion\n (\n15%\n) from \nSeptember 30, 2024\n, \nprimarily at Power, due to increases at Gas Power equipment and services, and increases at Hydro Power equipment and Steam Power \nservices, partially offset by a decrease at Steam Power equipment; at Electrification, due to demand for switchgear, high-voltage direct \ncurrent solutions, alternating current substation solutions, \nand\n transformers at Grid Solutions\n and synchronous condensers at Power \nConversion & Storage\n; partially offset at Wind, due to\n \ndecreases in orders at Onshore Wind as U.S. customers dealt with policy uncertainty, \nas well as selectivity in the international market, and decreases at Offshore Wind as we continue to execute on our contracts.\nThree months ended September 30\nNine months ended September 30\nREVENUES\n2025\n2024\n2025\n2024\nEquipment revenues\n$\n5,880\n$\n5,290\n$\n14,971\n$\n13,101\nServices revenues\n4,089\n3,623\n12,141\n11,276\nTotal revenues\n$\n9,969\n$\n8,913\n$\n27,112\n$\n24,376\nFor the three months ended \nSeptember 30, 2025\n, total revenues \nincrease\nd \n$1.1 billion\n (\n12%\n). Equipment revenues increased at \nElectrification, \nprimarily at Grid Solutions due to growth in high-voltage direct current solutions and switchgear volume and at Power \nConversion & Storage \ndue to battery\n \nenergy storage solutions; at Power, due to \nincreases at Gas Power from\n Heavy-Duty Gas Turbine \ndeliveries, project commissioning, and favorable price; partially offset at Wind, \nprimarily at Offshore Wind due to the nonrecurrence of \nrevenues recorded on the settlement of a previously canceled project as well as charges for the impact of blade events, both in the third \nquarter of 2024, partially offset by higher deliveries. \nServices revenues increased at Power, driven by Gas Power higher parts volume and \nfavorable price; and at Electrification and Wind.\nOrganic revenues* exclude the effects of acquisitions, dispositions, and foreign currency. Excluding these effects, organic revenues* \nincrease\nd \n$0.9 billion\n (\n10%\n), organic equipment revenues* \nincreased\n \n$0.5 billion\n (\n10%\n) and\n organic services\n revenues* \nincreased\n \n$0.4 \nbillion\n (\n11%\n). Organic revenues\n*\n increased at Electrification and Power, partially offset at Wind.\nFor the nine months ended \nSeptember 30, 2025\n, total revenues \nincrease\nd \n$2.7 billion\n (\n11%\n). Equipment revenues increased \nat \nElectrification, \nprimarily at Grid Solutions due to growth in high-voltage direct current solutions, switchgear, and alternating current \nsubstation solutions volume and at Power Conversion & Storage; \na\nt Power, due to \nincreases in Gas Power from\n Heavy-Duty Gas Turbine \ndeliveries and favorable price, partially offset by lower Aeroderivative project commissioning. Wind equipment revenues were flat, \nprimarily \ndue to an increase at Onshore Win\nd due to delivery of more \nunits, offset \nat Offshore Wind due to the nonrecurrence of revenues recorded \non the settlement of a previously canceled project as well as charges for the impact of blade events, both in the third quarter of 2024. \nServices revenues increased at Power, driven by Gas Power higher volume and favorable price; at Electrification, primarily due to growth at \nGrid Solutions; and at\n Wind due to higher transactional services\n.\nOrganic revenues* exclude the effects of acquisitions, dispositions, and foreign currency. Excluding these effects, organic revenues* \nincrease\nd \n$3.0 billion\n (\n12%\n), organic equipment revenues* \nincreased\n \n$2.0 billion\n (\n16%\n) and organic services revenues* \nincreased\n \n$1.0 \nbillion\n (\n9%\n). Organic revenues\n*\n increased at Power, Electrification, and Wind.\n*Non-GAAP Financial Measure\n2025 3Q FORM 10-Q \n27\nThree months ended September 30\nNine months ended September 30\nEARNINGS (LOSS)\n2025\n2024\n2025\n2024\nOperating income (loss)\n$\n366\n$\n(359)\n$\n787\n$\n(122)\nNet income (loss)\n453\n(99)\n1,209\n1,075\nNet income (loss) attributable to GE Vernova\n452\n(96)\n1,220\n1,068\nAdjusted EBITDA*\n811\n243\n2,038\n957\nDiluted earnings (loss) per share(a)\n$\n1.64\n$\n(0.35)\n$\n4.41\n$\n3.85\n(a)\nThe computation of earnings (loss) per share for all periods through \nApril 1, 2024\n was calculated using \n274 million\n common shares that \nwere issued upon Spin-Off and excludes Net loss (income) attributable to noncontrolling interests. For periods prior to the Spin-Off, the \nCompany participated in various GE stock-based compensation plans, and there were no dilutive equity instruments as there were no \nequity awards of GE Vernova outstanding prior to Spin-Off. \nFor the three months ended \nSeptember 30, 2025\n,\n operating income (loss) was \n$0.4 billion\n, a \n$0.7 billion\n \nincrease\n, primarily due to: \nan \nincreas\ne in segment results at Wind of \n$0.3 billion\n, primarily at Onshore Wind due to more profitable equipment, price, and productivity, \npartially offset by the impact of tariffs, and increases at Offshore Wind due to lower contract losses, partially offset by the nonrecurrence of \na gain recorded on the settlement of a previously canceled project in the third quarter of 2024;\n \nat Electrification of \n$0.2 billion\n, primarily due \nto volume, productivity, and favorable price at Grid Solutions; and at Power of \n$0.1 billion\n, \nprimarily at Gas Power due to favorable price \nand increased productivity, partially offset by additional expenses to support investments at Gas Power and Nuclear Power and the impact \nof inflation\n.\nNet income (loss) and Net income (loss) margin were \n$0.5 billion\n and \n4.5%\n, respectively, for \nthe \nthree months ended\n \nSeptember 30, 2025\n, \nan \nincrease\n of \n$0.6 billion\n and \n5.7%\n, respectively,\n for the quarter, primarily due to an increase in operating income (loss) of \n$0.7 billion\n and \nan increase in other income (expense) - net of \n$0.1 billion\n, partially offset by an increase in provision for income taxes of \n$0.3 billion\n.\nAdjusted EBITDA* and Adjusted EBITDA margin* were \n$0.8 billion\n and \n8.1%\n, respectively, for the \nthree months ended\n \nSeptember 30, \n2025\n, an \nincrease\n of \n$0.6 billion\n and \n5.4%\n, respectively, primarily driven by increases in segment results at Wind, Electrification, and \nPower.\nFor the nine months ended \nSeptember 30, 2025\n,\n operating income (loss) was \n$0.8 billion\n, a \n$0.9 billion\n \nincrease\n, primarily due to: an \nincrease in segment results at Electrification of \n$0.5 billion\n, primarily due to volume, productivity, and favorable price at Grid Solutions; at \nPower of \n$0.5 billion\n, \nprimarily at Gas Power and Steam Power due to favorable price, increased productivity, and higher volume, partially \noffset by additional expenses to support investments at Nuclear Power and Gas Power and the impact of inflation\n; and at Wind of \n$0.2 \nbillion\n, primarily at Onshore Wind due to an increase in the units delivered, partially offset by the impact of tariffs, and increases at Offshore \nWind due to lower contract losses, partially offset by the nonrecurrence of a gain recorded on the settlement of a previously canceled \nproject in the third quarter of 2024 and a termination of a supply agreement in the first quarter of 2025\n; \npartially offset by\n the nonrecurrence \nof $0.3 billion received related to an arbitration refund in the second quarter of 2024; the nonrecurrence of a $0.1 billion benefit related to \ndeferred intercompany profit that was recognized upon GE retaining the renewable energy U.S. tax equity investments in connection with \nthe Spin-Off; and higher corporate costs required to operate as a stand-alone public company.\nNet income (loss) and Net income (loss) margin were \n$1.2 billion\n and \n4.5%\n, respectively, for \nthe \nnine months ended\n \nSeptember 30, 2025\n, \nan \nincrease\n of \n$0.1 billion\n and \n0.1%\n, respectively,\n primarily due to an \nincrease\n in operating income (loss) of \n$0.9 billion\n, partially offset by a \ndecrease in other income (expense) - net of \n$0.6 billion\n driven by the nonrecurrence of a \n$0.9 billion pre-tax gain\n from the sale of a portion \nof Steam Power nuclear activities to E\nlectricité de France S.A. (\nEDF) in the second quarter of 2024 and an increase in provision for income \ntaxes of \n$0.2 billion\n.\nAdjusted EBITDA* and Adjusted EBITDA margin* were \n$2.0 billion\n and \n7.5%\n, respectively, for the \nnine months ended\n \nSeptember 30, 2025\n, \nan \nincrease\n of \n$1.1 billion\n and \n3.6%\n, respectively, primarily driven by increases in segment results at Electrification, Power, and Wind.\n*Non-GAAP Financial Measure\n2025 3Q FORM 10-Q \n28\nSEGMENT OPERATIONS\n.\n \nSegment revenues include sales of equipment and services by our segments. Segment EBITDA is \ndetermined based on performance measures used by our Chief Operating Decision Maker, who is our Chief Executive Officer (CEO), to \nassess the performance of each business in a given period. In connection with that assessment, the CEO may exclude certain non-cash \ncharges, such as depreciation and amortization, impairments and other matters, major restructuring programs, and certain gains and \nlosses from purchases and sales of business interests. Certain corporate costs, including those related to shared services, employee \nbenefits and information technology (IT), are allocated to our segments based on usage or their relative net cost of operations.\nThree months ended September 30\nNine months ended September 30\nSUMMARY OF REPORTABLE SEGMENTS\n2025\n2024\n2025\n2024\nPower\n$\n4,838\n$\n4,206\n$\n14,019\n$\n12,696\nWind\n2,647\n2,891\n6,742\n6,592\nElectrification\n2,601\n1,928\n6,682\n5,369\nEliminations and other\n(119)\n(112)\n(330)\n(281)\nTotal revenues\n$\n9,969\n$\n8,913\n$\n27,112\n$\n24,376\nSegment EBITDA\n    Power\n$\n645\n$\n499\n$\n1,931\n$\n1,457\n    Wind\n(61)\n(317)\n(373)\n(607)\n    Electrification\n393\n201\n929\n396\nCorporate and other(a)\n(166)\n(140)\n(448)\n(290)\nAdjusted EBITDA*(b)\n$\n811\n$\n243\n$\n2,038\n$\n957\n(a) \nIncludes our Financial Services business and other general corporate expenses, including costs required to operate as a stand-alone \npublic company.\n(b) \nSee \"—Non-GAAP Financial Measures\" for additional information related to Adjusted EBITDA*. Adjusted EBITDA* includes interest and \nother financial income (charges) and the benefit for income taxes of Financial Services as this business is managed on an after-tax \nbasis due to the nature of its investments.\n*Non-GAAP Financial Measure\n2025 3Q FORM 10-Q \n29\nPOWER\n \nThree months ended September 30\nNine months ended September 30\nOrders in units\n2025\n2024\n2025\n2024\nGas Turbines\n29\n29\n114\n78\nHeavy-Duty Gas Turbines\n20\n14\n69\n44\nHA-Turbines\n13\n9\n28\n21\nAeroderivatives\n9\n15\n45\n34\nGas Turbine Gigawatts\n7.4\n5.1\n19.6\n14.1\nThree months ended September 30\nNine months ended September 30\nSales in units\n2025\n2024\n2025\n2024\nGas Turbines\n20\n18\n60\n50\nHeavy-Duty Gas Turbines\n14\n13\n44\n31\nHA-Turbines\n6\n5\n19\n7\nAeroderivatives\n6\n5\n16\n19\nGas Turbine Gigawatts\n4.0\n3.3\n12.2\n7.1\nRPO\nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\nEquipment\n$\n18,977\n$\n12,461\n$\n11,392\nServices\n65,083\n60,890\n59,911\nTotal RPO\n$\n84,060\n$\n73,351\n$\n71,303\nRPO as of \nSeptember 30, 2025\n \nincreased\n \n$10.7 billion\n (\n15%\n) from \nDecember 31, 2024\n, \nprimarily at Gas Power due to Heavy-Duty Gas \nTurbine and Aeroderivative equipment and contractual services, and increases at Steam Power services and Hydro Power equipment, \npartially offset by a decrease at Steam Power equipment. RPO \nincreased\n \n$12.8 billion\n (\n18%\n) from \nSeptember 30, 2024\n, primarily at Gas \nPower due to increases in \nequipment and services, and increases in Hydro Power equipment and Steam Power services, partially offset by \na decrease at Steam Power equipment.\nThree months ended September 30\nNine months ended September 30\nSEGMENT REVENUES AND EBITDA\n2025\n2024\n2025\n2024\nGas Power\n$\n3,923\n$\n3,466\n$\n11,386\n$\n9,966\nNuclear Power\n251\n167\n640\n618\nHydro Power\n223\n181\n581\n544\nSteam Power\n442\n393\n1,413\n1,569\nTotal segment revenues\n$\n4,838\n$\n4,206\n$\n14,019\n$\n12,696\nEquipment\n$\n1,744\n$\n1,426\n$\n4,740\n$\n3,912\nServices\n3,094\n2,781\n9,279\n8,784\nTotal segment revenues\n$\n4,838\n$\n4,206\n$\n14,019\n$\n12,696\nSegment EBITDA\n$\n645\n$\n499\n$\n1,931\n$\n1,457\nSegment EBITDA margin\n13.3\n%\n11.9\n%\n13.8\n%\n11.5\n%\nFor the three months ended \nSeptember 30, 2025\n, segment revenues were \nup\n \n$0.6 billion\n (\n15%\n) and segment EBITDA was \nup\n \n$0.1 \nbillion\n (\n29%\n).\nSegment revenues \nincreased\n \n$0.6 billion\n (\n14%\n) organically*, \nprimarily at Gas Power equipment due to increases in Heavy-Duty Gas \nTurbine equipment deliveries, project commissioning, and favorable price, and at Gas Power services due to higher parts volume and \nfavorable price.\nSegment \nEBITDA\n \nincreased\n \n$0.1 billion\n (\n27%\n) organically*, \nprimarily at Gas Power due to favorable price and increased productivity, \npartially offset by additional expenses to support investments at Gas Power and Nuclear Power and the impact of inflation.\nFor the nine months ended \nSeptember 30, 2025\n, segment revenues were \nup\n \n$1.3 billion\n (\n10%\n) and segment EBITDA was \nup\n \n$0.5 \nbillion\n (\n33%\n).\nSegment revenues \nincreased\n \n$1.6 billion\n (\n13%\n) organically*, \nprimarily at Gas Power equipment due to increases in Heavy-Duty Gas \nTurbine equipment deliveries and favorable price, partially offset by lower Aeroderivative project commissioning, and increases in Gas \nPower services due to higher volume and favorable price.\nSegment EBITDA \nincreased\n \n$0.3 billion\n (\n19%\n) organically*, \nprimarily at Gas Power and Steam Power due to favorable price, increased \nproductivity, and higher volume, partially offset by additional expenses to support investments at Nuclear Power and Gas Power and the \nimpact of inflation.\n*Non-GAAP Financial Measure\n2025 3Q FORM 10-Q \n30\nWIND\n \nThree months ended September 30\nNine months ended September 30\nOnshore and Offshore Wind orders in units\n2025\n2024\n2025\n2024\nWind Turbines\n156\n249\n560\n870\nRepower Units\n139\n132\n344\n378\nWind Turbine and Repower Units Gigawatts\n0.9\n1.2\n2.7\n3.8\nThree months ended September 30\nNine months ended September 30\nOnshore and Offshore Wind sales in units\n2025\n2024\n2025\n2024\nWind Turbines\n476\n515\n1,103\n1,108\nRepower Units\n158\n182\n444\n246\nWind Turbine and Repower Units Gigawatts\n2.1\n2.4\n5.1\n5.1\nRPO\nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\nEquipment\n$\n8,782\n$\n10,720\n$\n12,182\nServices\n12,726\n11,962\n12,788\nTotal RPO\n$\n21,508\n$\n22,682\n$\n24,969\nR\nPO as of \nSeptember 30, 2025\n \ndecreased\n \n$1.2 billion\n (\n5%\n) from \nDecember 31, 2024\n, \nprimarily due to a decrease in orders at Onshore \nWind as U.S. customers dealt with policy uncertainty and decreases at Offshore Wind as we continue to execute on our contracts. RPO \ndecreased\n \n$3.5 billion\n (\n14%\n) from \nSeptember 30, 2024\n, primarily due to decreases in orders at \nOnshore Wind as U.S. customers dealt with \npolicy uncertainty, as well as selectivity in the international market, and\n decreases at Offshore Wind as we continue to execute on our \ncontracts.\nThree months ended September 30\nNine months ended September 30\nSEGMENT REVENUES AND EBITDA\n2025\n2024\n2025\n2024\nOnshore Wind\n$\n2,402\n$\n2,355\n$\n5,947\n$\n4,974\nOffshore Wind\n195\n388\n624\n1,183\nLM Wind Power\n51\n148\n171\n436\nTotal segment revenues\n$\n2,647\n$\n2,891\n$\n6,742\n$\n6,592\nEquipment\n$\n2,203\n$\n2,494\n$\n5,412\n$\n5,394\nServices\n445\n397\n1,331\n1,198\nTotal segment revenues\n$\n2,647\n$\n2,891\n$\n6,742\n$\n6,592\nSegment EBITDA\n$\n(61)\n$\n(317)\n$\n(373)\n$\n(607)\nSegment EBITDA margin\n(2.3)\n%\n(11.0)\n%\n(5.5)\n%\n(9.2)\n%\nFor the three months ended \nSeptember 30, 2025\n, segment revenues were \ndown\n \n$0.2 billion\n (\n8%\n) and seg\nment\n EBITDA was \nup\n \n$0.3 billion\n (\n81%\n).\nSegment revenues \ndecreased\n \n$0.3 billion\n \n(\n9%\n) organically*, \nprimarily at Offshore Wind due to the nonrecurrence of revenues recorded on \nthe settlement of a previously canceled project of $0.5 billion as well as charges for the impact of blade events, both in the third quarter of \n2024, partially offset by \nhigher deliveries\n. This wa\ns\n partially offset by\n increases at Onshore Wind services.\nSegment EBITDA \nincreased\n \n$0.3 billion\n (\n99%\n) organically*, primarily at Onshore Wind due to more profitable equipment,\n price\n, and \nproductivity, partially offset by the impact of tariffs, and increases at Offshore Wind due to lower\n contract \nlosses of $0.5 b\nillion\n, partially \noffset by the nonrecurrence of a gain recorded on the settlement of a previously canceled project of $0.3 billion in the third quarter of 2024\n.\nFor the nine months ended \nSeptember 30, 2025\n, segment revenues were \nup\n \n$0.2 billion\n (\n2%\n) and segment EBITDA was \nup\n \n$0.2 \nbillion\n (\n39%\n).\nSegment revenues \nincreased\n \n$0.2 billion\n \n(\n2%\n) organically*, \nprimari\nly at Onshore Wind in the U.S. market due to delivery of more units and \nhigher transactional services, partially offset by delivery of fewer units as selectivity continues in the international market, and decreases at \nOffshore Wind due to the nonrecurrence of revenues recorded on the settlement of a previously canceled project of $0.5 billion as well as \ncharges for the impact of blade events, both in the third quarter of 2024.\nSegment EBITDA \nincreased\n \n$0.3 billion\n (\n47%\n) organically*, primarily at Onshore Wind due to an increase in the units delivered, partially \noffset by the impact of tariffs, \nand increases\n at Offshore Wind \ndue to \nlower contract \nlosses of $0.5 billion\n, partially offset by the \nnonrecurrence of a gain recorded on the settlement of a previously canceled project of $0.3 billion in the third quarter of 2024 and a \ntermination of a supply agreement in the first quarter of 2025.\n*Non-GAAP Financial Measure\n2025 3Q FORM 10-Q \n31\nELECTRIFICATION \nRPO\nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\nEquipment\n$\n26,455\n$\n20,005\n$\n18,624\nServices\n3,725\n3,448\n3,288\nTotal RPO\n$\n30,179\n$\n23,453\n$\n21,912\nRPO as of \nSeptember 30, 2025\n \nincreased\n \n$6.7 billion\n (\n29%\n) from \nDecember 31, 2024\n, primarily due to demand for switchgear, alternating \ncurrent substation solutions, \nand\n transformers at \nGrid Solutions and synchronous condensers at Power Conversion & Storage\n. RPO \nincreased\n \n$8.3 billion\n (\n38%\n) from \nSeptember 30, 2024\n,\n primarily due to demand for switchgear, \nhigh-voltage direct current solutions, \nalternating current substation solut\nions, and transformers at G\nrid Solutio\nns and synchronous condensers at Power Conversion & Storage\n.\nThree months ended September 30\nNine months ended September 30\nSEGMENT REVENUES AND EBITDA\n2025\n2024\n2025\n2024\nGrid Solutions\n$\n1,747\n$\n1,270\n$\n4,591\n$\n3,521\nPower Conversion & Storage\n621\n440\n1,413\n1,202\nElectrification Software \n234\n218\n678\n646\nTotal segment revenues\n$\n2,601\n$\n1,928\n$\n6,682\n$\n5,369\nEquipment\n$\n2,035\n$\n1,451\n$\n5,100\n$\n3,967\nServices\n566\n477\n1,582\n1,402\nTotal segment revenues\n$\n2,601\n$\n1,928\n$\n6,682\n$\n5,369\nSegment EBITDA\n$\n393\n$\n201\n$\n929\n$\n396\nSegment EBITDA margin\n15.1\n%\n10.4\n%\n13.9\n%\n7.4\n%\nFor the three months ended \nSeptember 30, 2025\n, segment revenues were \nup\n \n$0.7 billion\n (\n35%\n) and segment EBITDA was \nup\n \n$0.2 \nbillion\n (\n96%\n).\nSegment \nrevenues\n \nincreased\n \n$0.6 billion\n (\n32%\n) organically*, primarily at Grid Solutions due to growth in high-voltage direct current \nsolutions and switchgear, and at Power Conversion & Storage due to battery energy storage solutions.\nSegment EBITDA \nincreased\n \n$0.2 billion\n \norganically*, primarily due to volume, productivity, and favorable price at Grid Solutions.\nFor the nine months ended \nSeptember 30, 2025\n, segment revenues were \nup\n \n$1.3 billion\n (\n24%\n) and segment EBITDA was \nup\n \n$0.5 \nbillion\n.\nSegment revenues \nincreased\n \n$1.3 billion\n (\n24%\n) organically*, primarily at Grid Solutions due to growth in high-voltage direct current \nsolutions, switchgear, and alternating current substation solutions volume and at Power Conversion & Storage.\nSegment EBITDA \nincreased\n \n$0.5 billion\n \norganically*, primarily due to volume, productivity, and favorable price at Grid Solutions.\nOTHER \nINFORMATION\nGross Profit and Gr\no\nss Margin.\n \nGross profit was \n$1.9 billion\n \nand \n$1.1 billion\n for the \nthree months ended\n and \n$5.2 billion\n and \n$4.0 billion\n \nfor the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively. Gross margin was \n19.0%\n and \n12.4%\n for the\n \nthree months ended\n \nand\n \n19.2%\n and \n16.3%\n for the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively. The increase in gross profit for the quarter \nwas due to an increase at Wind primarily at Onshore Wind due to more profitable equipment, price, and productivity, partially offset by the \nimpact of tariffs, and increased at Offshore Wind due to lower incremental contract losses, partially offset by the nonrecurrence of a gain \nrecorded on the settlement of a previously canceled project in the third quarter of 2024; at Electrification due to higher volume, productivity, \nand favorable price primarily at Grid Solutions; and at Power primarily at Gas Power and Steam Power from favorable price and increased \nproductivit\ny,\n partially offset by the impact of inflation. \nThe increase in gross profit for the year was due to increases at Electrification, Power, \nand Wind due to the reasons described above, partially offset by a termination of a supply agreement in Offshore Wind in the first quarter of \n2025.\nSelling, General, and Administrative.\n \nSelling, general, and administrative costs were \n$1.2 billion\n for both the \nthree months ended\n and \n$3.6 billion\n and \n$3.4 billion\n for the \nnine months ended\n \nand comprised \n12.3%\n and \n13.8%\n of revenues for the \nthree months ended\n and \n13.3%\n \nand \n13.8%\n of revenues for the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively. \nSelling, general, and administrative\n costs\n \nwere flat for the quarter, primarily due to cost reduction activities \noffset by\n labor inflation. The decrease in costs for the year was attributable \nto cost reduction initiatives, and \nthe nonrecurrence of the\n sale of a portion of Steam Power nuclear activities to EDF, partially offset by the \nnonrecurrence of $0.3 billion received related to an arbitration refund in 2024, higher s\ntock-based\n compensation, labor inflation, and higher \ncorporate costs.\nRestructuring Charges and Separation Costs. \nWe continuously evaluate our cost structure and are implementing several restructuring \nand process transformation actions considered necessary to simplify our organizational structure. In connection with the Spin-Off, we \nincurred and will continue to incur certain one-time separation costs. In addition, in connection with the Spin-Off we recognized a benefit \nrelated to deferred intercompany profit upon GE retaining the renewable energy U.S. tax equity investments in the second quarter of 2024. \nSee Note \n22\n in the Notes to the consolidated and combined financial statements for further information.\n*Non-GAAP Financial Measure\n2025 3Q FORM 10-Q \n32\nInterest and Other Financial Income (Cha\nrges\n) – Net\n.\n Interest and other financial inco\nme (charges) – net was less than \n$0.1 billion\n \nin \nincome\n for both the three months ended and \n$0.1 billion\n in income for both the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, \nrespectively.\n The increase in income for the quarter was driven by higher average balance of invested funds. The increase in income for the \nyear is driven by the reason described above\n, partially offset by\n the nonrecurrence of interest income received from an arbitration refund in \n2024.\n The primary components of net interest and other financial income (charges) are fees on cash management activities, interest on \nborrowings, and interest earned on cash balances and short-term investments.\nIncome Taxes.\n \nOur effective tax rate was \n39.2%\n and \n29.8%\n for the three and \nnine months ended\n \nSeptember 30, 2025\n, respectively. The \neffective tax rate was higher than the U.S. statutory rate of \n21%\n in both periods\n primarily due to losses providing no tax benefit in certain \njurisdictions and the finalization of the Company's \npre-Spin-Off\n tax attributes that increased the Company's current provision for income \ntaxes, partially offset by an income tax benefit from stock-based compensation.\nWe recorded an income tax benefit on a pre-tax loss with an effective tax rate of \n18.9%\n for the three months ended \nSeptember 30, 2024\n. \nThe effective tax rate was lower than the U.S. statutory rate of \n21%\n \nprimarily due to a portion of the pre-tax loss providing no tax benefit in \ncertain jurisdictions.\nWe recorded an income tax expense on pre-tax income with an effective tax rate of \n22.4%\n for the nine months ended \nSeptember 30, 2024\n. \nThe effective tax rate was higher than the U.S. statutory rate of \n21%\n primarily due to losses providing no tax benefit in certain jurisdictions, \npartially offset by a lower effective tax rate on a foreign pre-tax gain from the sale of a portion of Steam Power nuclear activities to EDF \nwhich was completed\n in the second quarter of 2024.\nWe regularly assess the realizability of our deferred tax assets based on all available evidence both positive and negative. Based on our \nassessment of the realizability of our deferred tax assets as of \nSeptember 30, 2025\n, we continue to maintain valuation allowances against \nour deferred tax assets in the U.S. and certain foreign jurisdictions, primarily due to cumulative losses in those jurisdictions. Given the \ncurrent year profit and anticipated future profitability in the U.S., it is reasonably possible that the continued improvement in our U.S. \noperations could result in the positive evidence necessary to warrant the release of a significant portion of our U.S. valuation allowance in \nthe fourth quarter of 2025. A release of the valuation allowance would result in the recognition of certain U.S. deferred tax assets and \na corresponding benefit in our provision for income taxes in the period the release occurs. See Note \n15\n in the Notes to the consolidated \nand combined financial statements for further information.\nCAPITAL RESOURCES AND LIQUIDITY\n.\n Historically, we participated in cash pooling and other financing arrangements with GE to \nmanage liquidity and fund our operations. As a result of completing the Spin-Off, we no longer participate in these arrangements and our \nCash, cash equivalents, and restricted cash are held and used solely for our own operations. Our capital structure, long-term commitments, \nand sources of liquidity have changed significantly from our historical practices. As of \nSeptember 30, 2025\n, our Cash, cash equivalents, and \nrestricted cash was \n$7.9 billion\n, \n$0.4 billion\n of which was restricted use cash. \nIn addition, we have access to a \n$3.0 billion\n committed \nrevolving\n credit facility (Revolving Credit Facility). See “—Capital Resources and Liquidity—Debt” for further information. We believe our \nunrestricted c\nash, cash equivalents\n, future cash flows generated from operations, and committed credit facility will be responsive to the \nneeds of our current and planned operations for at least the next 12 months.\nOn September 25, 2025, the Board of Directors \ndeclared a $0.25\n per share quarterly dividend on our outstanding common stock, payable \non November 17, 2025, to stockholders of record as of October 20, 2025. On December 10, 2024, the Board of Directors authorized up to \n$6 billion of common stock repurchases. \nIn connection with this authorization, we repurchased \n1.1\n million shares and \n6.3\n million shares for \n$0.7\n billion and \n$2.2\n billion during the three and nine months ended \nSeptember 30, 2025\n, respectively. \nAlthough we intend to fund priorities \nthat profitably grow the company and return capital to stockholders through dividends and share repurchases as part of our capital \nallocation strategy, we are not obligated to pay cash dividends or to repurchase a specified or any number or dollar value of shares under \nour share repurchase program. The declaration of any future dividends is at the discretion of our Board of Directors and will be based on \nour earnings, financial condition, cash requirements, prospects, and other factors. The amount and timing of any future share repurchases \nunder our share repurchase program will be based on the trading price and volume of our shares of common stock and other market \nfactors as well as our earnings, financial condition, cash requirements, prospects, alternative uses for our cash, and other factors.\nConsolidated and Combined Statement of Cash Flows\n.\n \nThe most significant source of cash flows from operations is customer-related \nactivities, the largest of which is collecting cash resulting from equipment or services sales. The most significant operating uses of cash are \nto pay our suppliers, employees, tax authorities, and postretirement plans. We measure ourselves on a free cash flow* basis. We believe \nthat free cash flow* provides management and investors with an important measure of our ability to generate cash on a normalized basis. \nFree cash flow* also provides insight into our ability to produce cash subsequent to fulfilling our capital obligations; however, free cash flow* \ndoes not delineate funds available for discretionary uses as it does not deduct the payments required for certain investing and financing \nactivities.\nWe typically invest in property, plant, and equipment (PP&E) over multiple periods to support new product introductions and increases in \nmanufacturing capacity and to perform ongoing maintenance of our manufacturing operations. We believe that while PP&E expenditures \nwill fluctuate period to period, we will need to maintain a material level of net PP&E spend to maintain ongoing operations and growth of the \nbusiness. \nNine months ended September 30\nFREE CASH FLOW (NON-GAAP)\n2025\n2024\nCash from (used for) operating activities (GAAP)\n$\n2,508\n$\n1,662\nAdd: Gross additions to property, plant, and equipment and internal-use software\n(606)\n(533)\nFree cash flow (Non-GAAP)\n$\n1,902\n$\n1,129\n*Non-GAAP Financial Measure\n2025 3Q FORM 10-Q \n33\nCash from operating activities\n w\nas \n$2.5 billion\n and \n$1.7 billion\n \nfor the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively. \nCash from operating activities increased by \n$0.8 billion\n in \n2025\n compared to \n2024\n, primarily driven by: higher net income (after adjusting for \ndepreciation of PP&E, amortization of intangible assets, and (gains) losses on purchases and sales of business interests) of \n$0.6 billion\n, \nincluding the nonrecurrence of a $0.3 billion cash refund received in connection with an arbitration proceeding in the second quarter of \n2024; an increase from contract liabilities and current deferred income of \n$0.8 billion\n, primarily due to higher down payments on orders and \nslot reservation agreements at Power, \nand the nonrecurrence of the settlement of a previously canceled project at Offshore Wind in 2024, \npartially offset b\ny higher liquidations on projects at Onshore Wind; \nan increase from current receivables of \n$0.5 billion\n, primarily due to \nhigher\n collections, partially offset by higher billings;\n \npartially offset by a decrease from All other operating activities of \n$(0.8) billion\n, primarily \ndue to lower contract losses at Offshore Wind and\n \nan increase in long-term receivables related to advanced manufacturing credits; and a \ndecrease from current contract assets of \n$(0.4) billion\n, primarily due to revenue recognition exceeding billings.\nCash from operating activities of \n$2.5 billion\n for the \nnine months ended\n \nSeptember 30, 2025\n included a \n$1.8 billion\n inflow from changes in \nworking capital. The cash inflow from changes in working capital was primarily driven by: contract liabilities and current deferred income of \n$2.4 billion\n, driven by down payments on orders and slot reservation agreements at Power, and down payments and collections at \nElectrification, partially offset by higher net revenue recognition at Wind; accounts payable and equipment project payables of \n$0.6 billion\n, \ndriven by reductions in prepayments and purchases of materials outpacing disbursements primarily at Electrification; current receivables of \n$0.6 billion\n, driven by lower billings and higher utilization of supplier advances at Wind, and collections outpacing billings at Power, \nincluding a decrease in past dues; inventories of \n$(1.0) billion\n, primarily due to volume to support fulfillment and deliveries expected in the \nfourth quarter of 2025 and in 2026 primarily at Gas Power and Onshore Wind; and current contract assets of \n$(0.7) billion\n, driven by \nrevenue recognition exceeding billings on our equipment and other service agreements.\nCash from operating activities of \n$1.7 billion\n for the \nnine months ended\n \nSeptember 30, 2024\n included a \n$0.9 billion\n inflow from changes in \nworking capital. The cash inflow from changes in working capital was primarily driven by: contract liabilities and current deferred income of \n$1.7 billion\n, driven by down payments and collections on several large projects in Grid Solutions at Electrification, and net collections at \nPower, partially offset by liquidations and the settlement of a previously canceled project at Wind; accounts payable and equipment project \npayables of \n$0.6 billion\n due to purchases of materials outpacing disbursements and reductions in prepayments, partially offset by \nsettlements of payables with GE prior to the Spin-Off; inventories of \n$(1.2) billion\n, primarily in Gas Power, to support fulfillment and \ndeliveries expected in the fourth quarter of 2024 and in 2025; and current contract assets of \n$(0.2) billion\n, driven by revenue recognition \nexceeding billings on our equipment and other service agreements in Electrification and Power. \nCash from (used for) investing activities\n was \n$(0.4) billion\n and \n$0.1 billion\n for the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, \nrespectively. Cash used for investing activities increased by \n$0.5 billion\n in \n2025\n compared to \n2024\n primarily driven by: the nonrecurrence of \nthe Steam Power business sale of part of its nuclear activities to EDF in our Power segment of $0.6 billion; partially offset by higher sales of \nand distributions from equity method investments of \n$0.2 billion\n, driven by the sale of an approximately \n5%\n equity interest in China XD \nElectric Co., Ltd. during 2025. Cash used for additions to PP&E and internal-use software, which is a component of free cash flow*, was \n$0.6 billion\n and \n$0.5 billion\n for the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively.\nCash from (used for) financing activities\n was \n$(2.6) billion\n and \n$3.5 billion\n for the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, \nrespectively. Cash used for financing activities increased by \n$6.1 billion\n in 2025 compared to 2024 primarily driven by: \nthe nonrecurrence of \ntransfers \nfrom parent\n of \n$2.9 billion\n; cash settlements for share repurchases of \n$2.2 billion\n \nin 2025; the nonrecurrence of proceeds from the \nsale of an approximately 16% equity interest in GE Vernova T&D India Ltd. in the third quarter of 2024 of $0.7 billion; and dividends paid of \n$0.2 billion in 2025\n.\nMaterial Cash Requirements. \nIn the normal course of business, we enter into contracts and commitments that oblige us to make \npayments in the future. See Notes \n7\n and \n21\n in the Notes to the consolidated and combined financial statements for further information \nregarding our obligations under lease and guarantee arrangements as well as our investment commitments. See Note \n13\n in the Notes to \nthe consolidated and combined financial statements for further information regarding material cash requirements related to our pension \nobligations.\nDebt.\n Total debt, excluding finance leases, was less than \n$0.1 billion\n and \n$0.1 billion\n as of \nSeptember 30, 2025\n and \nDecember 31, 2024\n, \nrespectively\n. We have a \n$3.0 billion\n Revolving Credit Facility to fund near-term intra-quarter working capital needs as they arise. In addition, \nwe have a \n$3.0 billion\n committed trade finance facility (Trade Finance Facility, and together with the Revolving Credit Facility, the Credit \nFacilities). The Trade Finance Facility has not been and is not expected to be utilized, and does not contribute to direct liquidity. We believe \nthat our financing arrangements, future cash from operations, and access to capital markets will provide adequate resources to fund our \nfuture cash flow needs. For more information about the Credit Facilities, refer to our Current Report on Form 8-K, filed with the SEC on April \n2, 2024, and see Note \n21\n in the Notes to the consolidated and combined financial statements.\nCredit Ratings and Conditions.\n We have access to the Revolving Credit Facility to fund operations, and we may rely on debt capital \nmarkets in the future to further su\npport our liquidity needs. The cost and availability of any debt financing is influenced by our credit ratings \nand market conditions. Standard and Poor's Global Ratings (S&P) and Fitch Ratings (Fitch) have issued credit ratings for the Company. On \nMarch 12, 2025, Fitch affirmed GE Vernova Inc.'s long-term credit rating and revised its outlook to Positive from Stable. On May 23, 2025, \nS&P affirmed GE Vernova Inc.'s long-term credit rating and revised its outlook to Positive from Stable. Our credit ratings as of the date of \nthis filing are set forth in the following table. \nS&P\nFitch\nOutlook\nPositive\nPositive\nLong-term\nBBB-\nBBB\n*Non-GAAP Financial Measure\n2025 3Q FORM 10-Q \n34\nWe are disclosing our credit ratings to enhance understanding of our sources of liquidity and the effects of our ratings on our costs of funds \nand access to credit. Our ratings may be subject to a revision or withdrawal at any time by the assigning rating organization, and each \nrating should be evaluated independently of any other rating. See Item 1A. \"Risk Factors\n—\nRisks Relating to Our Business and Our Industry\n—\nRisks Relating to Operations and Supply Chain\" and Item 1A. \"Risk Factors\n—\nRisks Relating to Financial, Accounting, and Tax Matters\" in \nour Annual Report on Form 10-K for the fiscal year ended December 31, 2024, for a description of some of the potential consequences of a \nreduction in our credit ratings.\nIf we are unable to maintain investment grade ratings, we could face significant challenges in being awarded new contracts, substantially \nincreasing financing and hedging costs, and refinancing risks as well as substantially decreasing the availability of credit. As of \nSeptember \n30, 2025\n, we \nestimated an \ninsignificant\n \nliquidity impact of a ratings downgrade below investment grade.\nParent Company Credit Support. \nPrior t\no the Spin-Off, to support GE Vernova businesses in selling products and services globally, GE \noften entered into contracts on behalf of GE Vernova or issued parent company guarantees or trade finance instruments supporting the \nperformance of its subsidiary legal entities transacting directly with customers, in addition to providing similar credit support for non-\ncustomer related activities of GE Vernova (collectively, the GE credit support). In connection with the Spin-Off, we are working to seek \nnovation or assignment of GE credit support, the majority of which relates to parent company guarantees, associated with GE Vernova \nlegal entities from GE to GE Vernova. For GE credit support that remained outstanding at the Spin-Off, GE Vernova is obligated to use \nreasonable best efforts to terminate or replace, and obtain a full release of GE’s obligations and liabilities under, all such credit support. GE \nVernova pays quarterly fees to GE which are determined by amounts associated with GE credit support. GE Vernova is subject to other \ncontractual restrictions and requirements while GE continues to be obligated under such credit support on behalf of GE Vernova. In \naddition, while GE will remain obligated under the contract or instrument, GE Vernova will be obligated to indemnify GE for credit support \nrelated payments that GE is required to make and possible related costs.\nAs of \nSeptember 30, 2025\n, we estimated GE Vernova RPO and other obligations that relate to GE credit support to be approximately \n$10 \nbillion\n, an over \n71%\n reduction since the Spin-Off. We expect approximately \n$7 billion\n of the RPO related to GE credit support obligations to \ncontractually mature by December 31, 2029. The underlying obligations are predominantly customer contracts that GE Vernova performs in \nthe normal course of its business. We have no known instances historically where payments or performance from GE were required under \nparent company guarantees relating to GE Vernova customer contracts. \nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\n.\n \nIn November 2024, the Financial Accounting Standards Board (FASB) issued \nASU No. 2024-03, \nDisaggregation of Income Statement Expenses (DISE). \nThe new standard requires disclosure about specific types of \nexpenses included in the expense captions presented on the face of the income statement as well as disclosure about selling expenses. \nThe ASU is effective for fiscal years beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027, \nwith early adoption permitted. We are currently evaluating the impact that this guidance will have on the disclosures within our consolidated \nand combined financial statements.\nIn December 2023, the FASB issued ASU No. 2023-09,\n Income Taxes (Topic 740): Improvements to Income Tax Disclosures\n. The \namendments require disclosure of specific categories in the rate reconciliation and provide additional information for reconciling items that \nmeet a quantitative threshold and further disaggregation of income taxes paid for individually significant jurisdictions. The ASU is effective \nfor fiscal years beginning after December 15, 2024. \nWe are currently evaluating the impact that this guidance will have on the disclosures \nwithin our consolidated and combined financial statements. The Company will adopt the new annual disclosures as required for the fiscal \nyear ended December 31, 2025.\nCRITICAL ACCOUNTING ESTIMATES\n.\n To prepare our consolidated and combined financial statements in accordance with U.S. GAAP, \nmanagement makes estimates and assumptions that may affect the reported amounts of our assets and liabilities, including our contingent \nliabilities, as of the date of our financial statements and the reported amounts of our revenues and expenses during the reporting periods. \nOur actual results may differ from these estimates. We consider estimates to be critical (i) if we are required to make assumptions about \nmaterial matters that are uncertain at the time of estimation or (ii) if materially different estimates could have been made or it is reasonably \nlikely that the accounting estimate will change from period to period. See Item 7. \"Management’s Discussion and Analysis of Financial \nCondition and Results of Operations\n—\nCritical Accounting Estimates\" and Note 2 in the Notes to the audited consolidated and combined \nfinancial statements in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 for additional discussion of \naccounting policies and critical accounting estimates.\nNON-GAAP FINANCIAL MEASURES\n.\n \nThe non-GAAP financial measures presented in this \nQuarterly\n Report on Form \n10-Q\n \nare \nsupplemental measures of our performance and our liquidity that we believe help investors understand our financial condition and operating \nresults and assess our future prospects. We believe that presenting these non-GAAP financial measures, in addition to the corresponding \nU.S. GAAP financial measures, are important supplemental measures that exclude non-cash or other items that may not be indicative of or \nare unrelated to our core operating results and the overall health of our company. We believe that these non-GAAP financial measures \nprovide investors greater transparency to the information used by management for its operational decision-making and allow investors to \nsee our results “through the eyes of management.” We further believe that providing this information assists our investors in understanding \nour operating performance and the methodology used by management to evaluate and measure such performance. When read in \nconjunction with our U.S. GAAP results, these non-GAAP financial measures provide a baseline for analyzing trends in our underlying \nbusinesses and can be used by management as one basis for financial, operational, and planning decisions. Finally, these measures are \noften used by analysts and other interested parties to evaluate companies in our industry.\nManagement recognizes that these non-GAAP financial measures have limitations, including that they may be calculated differently by \nother companies or may be used under different circumstances or for different purposes, thereby affecting their comparability from \ncompany to company. In order to compensate for these and the other limitations discussed below, management does not consider these \nmeasures in isolation from or as alternatives to the comparable financial measures determined in accordance with U.S. GAAP. Readers \nshould review the reconciliations below\n, and above with respect to free cash flow, \nand should not rely on any single financial measure to \nevaluate our business. The reasons we use these non-GAAP financial measures and the reconciliations to their most directly comparable \nU.S. GAAP financial measures follow.\n \n2025 3Q FORM 10-Q \n35\nWe believe the organic measures presented below provide management and investors with a more complete understanding of underlying \noperating results and trends of established, ongoing operations by excluding the effect of acquisitions, dispositions, and foreign currency, \nwhich includes translational and transactional impacts, as these activities can obscure underlying trends.\nORGANIC REVENUES, EBITDA, AND EBITDA MARGIN BY SEGMENT (NON-GAAP)\nRevenue(a)\nSegment EBITDA\nSegment EBITDA margin\nFor the three months ended September 30\n2025\n2024\nV%\n2025\n2024\nV%\n2025\n2024\nV pts\nPower (GAAP)\n$\n4,838\n$\n4,206\n15\n%\n$\n645\n$\n499\n29\n%\n13.3\n%\n11.9\n%\n1.4pts\nLess: Acquisitions\n—\n—\n2\n—\nLess: Business dispositions\n—\n—\n—\n—\nLess: Foreign currency effect\n49\n3\n47\n29\nPower organic (Non-GAAP)\n$\n4,789\n$\n4,204\n14\n%\n$\n596\n$\n470\n27\n%\n12.4\n%\n11.2\n%\n1.2pts\nWind (GAAP)\n$\n2,647\n$\n2,891\n(8)\n%\n$\n(61)\n$\n(317)\n81\n%\n(2.3)\n%\n(11.0)\n%\n8.7pts\nLess: Acquisitions\n—\n—\n—\n—\nLess: Business dispositions\n—\n—\n—\n—\nLess: Foreign currency effect\n29\n2\n(59)\n(7)\nWind organic (Non-GAAP)\n$\n2,619\n$\n2,888\n(9)\n%\n$\n(2)\n$\n(311)\n99\n%\n(0.1)\n%\n(10.8)\n%\n10.7pts\nElectrification (GAAP)\n$\n2,601\n$\n1,928\n35\n%\n$\n393\n$\n201\n96\n%\n15.1\n%\n10.4\n%\n4.7pts\nLess: Acquisitions\n2\n—\n(3)\n—\nLess: Business dispositions\n—\n—\n—\n—\nLess: Foreign currency effect\n62\n6\n(3)\n4\nElectrification organic (Non-GAAP)\n$\n2,537\n$\n1,922\n32\n%\n$\n399\n$\n197\nF\n15.7\n%\n10.2\n%\n5.5pts\n(a) Includes intersegment sales of \n$130 million\n and \n$120 million\n for the \nthree months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively. \n     See Note \n23\n in the Notes to the consolidated and combined financial statements for further information.\nORGANIC REVENUES, EBITDA, AND EBITDA MARGIN BY SEGMENT (NON-GAAP)\nRevenue(a)\nSegment EBITDA\nSegment EBITDA margin\nFor the nine months ended September 30\n2025\n2024\nV%\n2025\n2024\nV%\n2025\n2024\nV pts\nPower (GAAP)\n$\n14,019\n$\n12,696\n10\n%\n$\n1,931\n$\n1,457\n33\n%\n13.8\n%\n11.5\n%\n2.3pts\nLess: Acquisitions\n—\n—\n4\n—\nLess: Business dispositions\n—\n308\n—\n(41)\nLess: Foreign currency effect\n49\n8\n100\n(31)\nPower organic (Non-GAAP)\n$\n13,969\n$\n12,380\n13\n%\n$\n1,827\n$\n1,529\n19\n%\n13.1\n%\n12.4\n%\n0.7pts\nWind (GAAP)\n$\n6,742\n$\n6,592\n2\n%\n$\n(373)\n$\n(607)\n39\n%\n(5.5)\n%\n(9.2)\n%\n3.7pts\nLess: Acquisitions\n—\n—\n—\n—\nLess: Business dispositions\n—\n—\n—\n—\nLess: Foreign currency effect\n(15)\n(7)\n(72)\n(41)\nWind organic (Non-GAAP)\n$\n6,757\n$\n6,599\n2\n%\n$\n(301)\n$\n(566)\n47\n%\n(4.5)\n%\n(8.6)\n%\n4.1pts\nElectrification (GAAP)\n$\n6,682\n$\n5,369\n24\n%\n$\n929\n$\n396\nF\n13.9\n%\n7.4\n%\n6.5pts\nLess: Acquisitions\n4\n—\n(4)\n—\nLess: Business dispositions\n—\n—\n—\n—\nLess: Foreign currency effect\n42\n14\n8\n—\nElectrification organic (Non-GAAP)\n$\n6,636\n$\n5,356\n24\n%\n$\n924\n$\n396\nF\n13.9\n%\n7.4\n%\n6.5pts\n(a) Includes intersegment sales of \n$361 million\n and \n$317 million\n for the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively. \nSee Note \n23\n in the Notes to the consolidated and combined financial statements for further information.\nThree months ended September 30\nNine months ended September 30\nORGANIC REVENUES (NON-GAAP)\n2025\n2024\nV%\n2025\n2024\nV%\nTotal revenues (GAAP)\n$\n9,969\n$\n8,913\n12\n%\n$\n27,112\n$\n24,376\n11\n%\nLess: Acquisitions\n2\n—\n4\n—\nLess: Business dispositions\n—\n—\n—\n308\nLess: Foreign currency effect\n140\n11\n77\n15\nOrganic revenues (Non-GAAP)\n$\n9,826\n$\n8,902\n10\n%\n$\n27,031\n$\n24,053\n12\n%\n2025 3Q FORM 10-Q \n36\nEQUIPMENT AND SERVICES ORGANIC \nREVENUES (NON-GAAP)\nThree months ended September 30\nNine months ended September 30\n2025\n2024\nV%\n2025\n2024\nV%\nTotal equipment revenues (GAAP)\n$\n5,880\n$\n5,290\n11\n%\n$\n14,971\n$\n13,101\n14\n%\nLess: Acquisitions\n—\n—\n—\n—\nLess: Business dispositions\n—\n—\n—\n171\nLess: Foreign currency effect\n88\n8\n25\n7\nEquipment organic revenues (Non-GAAP)\n$\n5,792\n$\n5,282\n10\n%\n$\n14,946\n$\n12,923\n16\n%\nTotal services revenues (GAAP)\n$\n4,089\n$\n3,623\n13\n%\n$\n12,141\n$\n11,276\n8\n%\nLess: Acquisitions\n2\n—\n4\n—\nLess: Business dispositions\n—\n—\n—\n138\nLess: Foreign currency effect\n52\n3\n52\n8\nServices organic revenues (Non-GAAP)\n$\n4,034\n$\n3,620\n11\n%\n$\n12,086\n$\n11,129\n9\n%\nWe believe that Adjusted EBITDA* and Adjusted EBITDA margin*, which are adjusted to exclude the effects of unique and/or non-cash \nitems that are not closely associated with ongoing operations, provide management and investors with meaningful measures of our \nperformance that increase the period-to-period comparability by highlighting the results from ongoing operations and the underlying \nprofitability factors. We believe Adjusted organic EBITDA* and Adjusted organic EBITDA margin* provide management and investors with, \nwhen considered with Adjusted EBITDA* and Adjusted EBITDA margin*, a more complete understanding of underlying operating results \nand trends of established, ongoing operations by further excluding the effect of acquisitions, dispositions, and foreign currency, which \nincludes translational and transactional impacts, as these activities can obscure underlying trends. We believe these measures provide \nadditional insight into how our businesses are performing on a normalized basis. However, Adjusted EBITDA*, Adjusted organic EBITDA*, \nAdjusted EBITDA margin* and Adjusted organic EBITDA margin* should not be construed as inferring that our future results will be \nunaffected by the items for which the measures adjust.\nADJUSTED EBITDA AND ADJUSTED EBITDA MARGIN (NON-GAAP)\nThree months ended September 30\nNine months ended September 30\n2025\n2024\nV%\n2025\n2024\nV%\nNet income (loss) (GAAP)\n$\n453\n$\n(99)\nF\n$\n1,209\n$\n1,075\n12\n%\nAdd: Restructuring and other charges\n83\n209\n192\n419\nAdd: (Gains) losses on purchases and sales of business interests(a)\n(113)\n—\n(131)\n(842)\nAdd: Separation costs (benefits)(b)\n43\n27\n122\n(64)\nAdd: Arbitration refund(c)\n—\n—\n—\n(254)\nAdd: Non-operating benefit income\n(115)\n(130)\n(340)\n(399)\nAdd: Depreciation and amortization(d)\n212\n289\n617\n734\nAdd: Interest and other financial (income) charges – net(e)(f)\n(44)\n(35)\n(141)\n(93)\nAdd: Provision (benefit) for income taxes(f)\n292\n(17)\n510\n380\nAdjusted EBITDA (Non-GAAP)\n$\n811\n$\n243\nF\n$\n2,038\n$\n957\nF\nNet income (loss) margin (GAAP)\n4.5\n%\n(1.1)\n%\n5.6 pts\n4.5\n%\n4.4\n%\n0.1 pts\nAdjusted EBITDA margin (Non-GAAP)\n8.1\n%\n2.7\n%\n5.4 pts\n7.5\n%\n3.9\n%\n3.6 pts\n(a) Includes unrealized (gains) losses related to our interest in China XD Electric Co., Ltd, recorded in Net interest and investment \nincome (loss) which is part of Other income (expense) - net. See Note \n18\n for further information.\n(b) Costs incurred in the Spin-Off and separation from GE, including system implementations, advisory fees, one-time stock option \ngrant, and other one-time costs. In addition, 2024 includes $136 million benefit related to deferred intercompany profit that was \nrecognized upon GE retaining the renewable energy U.S. tax equity investments. \n(c) Represents a cash refund received related to an arbitration proceeding with a multiemployer pension plan and excludes $52 million \nrelated to the interest on such amounts that was recorded in Interest and other financial charges – net.\n(d) Excludes depreciation and amortization expense related to Restructuring and other charges. Includes amortization of basis \ndifferences included in Equity method investment income (loss) which is part of Other income (expense) - net.\n(e) Consists of interest and other financial charges, net of interest income, other than financial interest related to our normal business \noperations primarily with customers.\n(f) Excludes interest expense (income) of zero and \n$(1) million\n and benefit (provision) for income taxes of zero and \n$6 million\n for the \nthree months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively, as well as excludes interest expense (income) of \n$(1) million\n and \n$11 million\n and benefit (provision) for income taxes of \n$(4) million\n and \n$70 million\n for the \nnine months ended\n \nSeptember 30, 2025\n \nand \n2024\n, respectively, related to our Financial Services business which, because of the nature of its investments, is measured on \nan after-tax basis.\n*Non-GAAP Financial Measure\n2025 3Q FORM 10-Q \n37\nADJUSTED ORGANIC EBITDA AND ADJUSTED \nORGANIC EBITDA MARGIN (NON-GAAP)\nThree months ended September 30\nNine months ended September 30\n2025\n2024\nV%\n2025\n2024\nV%\nAdjusted EBITDA (Non-GAAP)\n$\n811\n$\n243\nF\n$\n2,038\n$\n957\nF\nLess: Acquisitions\n(1)\n—\n1\n—\nLess: Business dispositions\n—\n—\n—\n(41)\nLess: Foreign currency effect\n(21)\n16\n28\n(77)\nAdjusted organic EBITDA (Non-GAAP)\n$\n833\n$\n227\nF\n$\n2,010\n$\n1,074\n87\n%\nAdjusted EBITDA margin (Non-GAAP)\n8.1\n%\n2.7\n%\n5.4 pts\n7.5\n%\n3.9\n%\n3.6 pts\nAdjusted organic EBITDA margin (Non-GAAP)\n8.5\n%\n2.5\n%\n6.0 pts\n7.4\n%\n4.5\n%\n2.9 pts\nSee “\n—\nCapital Resources and Liquidity” for discussion of free cash flow*."
}