{
  "source_file": "gild-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS\nGilead Sciences, Inc. (including its consolidated subsidiaries, referred to as “Gilead,” the “company,” “we,” “our” or “us”) is a biopharmaceutical company that has pursued and achieved breakthroughs in medicine for more than three decades, with the goal of creating a healthier world for all people. We are committed to advancing innovative medicines to prevent and treat life-threatening diseases, including HIV, viral hepatitis, coronavirus disease 2019 (“COVID-19”), cancer and inflammation. We operate in more than 35 countries worldwide, with headquarters in Foster City, California. \nOur Business\nProducts\nWe have transformed care for people around the world by discovering, developing and delivering innovative medicines to address unmet medical needs in virology, oncology and other therapeutic areas. Our innovative medicines represent advancements by offering first-in-class therapies, greater efficacy, enhanced modes of delivery, more convenient treatment and prevention regimens, improved resistance profiles and reduced side effects.\nIn 2024, our products and collaboration products, with approved indications in the U.S., included the following:\nVirology\nHIV\n•\nBiktarvy\n®\n is an oral formulation dosed once a day for the treatment of HIV-1 infection in certain patients. Biktarvy is a single-tablet regimen of a fixed-dose combination of our antiretroviral medications, bictegravir, emtricitabine (“FTC”) and tenofovir alafenamide (“TAF”).\n•\nGenvoya\n®\n \nis an oral formulation dosed once a day for the treatment of HIV-1 infection in certain patients. Genvoya is a single-tablet regimen of a fixed-dose combination of our antiretroviral medications, elvitegravir, cobicistat, FTC and TAF.\n•\nDescovy\n®\n is an oral formulation indicated in combination with other antiretroviral agents for the treatment of HIV-1 infection in certain patients. Descovy is a fixed-dose combination of our antiretroviral medications, FTC and TAF. Descovy is also approved by U.S. Food and Drug Administration (“FDA”) for a pre-exposure prophylaxis (“PrEP”) indication to reduce the risk of sexually acquired HIV-1 infection in certain at-risk patients.\n•\nOdefsey\n®\n is an oral formulation dosed once a day for the treatment of HIV-1 infection in certain patients. Odefsey is a single-tablet regimen of a fixed-dose combination of our antiretroviral medications, FTC and TAF, and rilpivirine marketed by Janssen Products, LP of Johnson & Johnson Innovative Medicine (“Janssen”).\n•\nComplera\n®\n/Eviplera\n®\n \nis an oral formulation dosed once a day for the treatment of HIV-1 infection in certain patients. The product, marketed in the U.S. as Complera and in Europe as Eviplera, is a single-tablet regimen of a fixed-dose combination of our antiretroviral medications, tenofovir disoproxil fumarate (“TDF”) and FTC, and Janssen’s rilpivirine hydrochloride.\n•\nSymtuza\n®\n \nis an oral formulation dosed once a day for the treatment of HIV-1 infection in certain patients. Symtuza is a single-tablet regimen of a fixed-dose combination of our antiretroviral medications, cobicistat, FTC and TAF, and Janssen’s darunavir. Symtuza is commercialized by Janssen, and we receive a share in revenue for the components that we contribute. See Note 7. Collaborations and Other Arrangements of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\n•\nTruvada\n®\n is an oral formulation indicated in combination with other antiretroviral agents for the treatment of HIV-1 infection in certain patients. Truvada is a fixed-dose combination of our antiretroviral medications, TDF and FTC. Truvada is also approved by FDA for a PrEP indication to reduce the risk of sexually acquired HIV-1 infection in certain at-risk patients.\n•\nStribild\n®\n is an oral formulation dosed once a day for the treatment of HIV-1 infection in certain patients. Stribild is a single-tablet regimen of a fixed-dose combination of our antiretroviral medications, elvitegravir, cobicistat, TDF and FTC.\n•\nSunlenca\n®\n is an HIV-1 capsid inhibitor in tablet form for oral use and as an injection for subcutaneous use. Sunlenca, in combination with other antiretroviral(s), is indicated as a twice-yearly treatment of HIV-1 infection in heavily treatment-experienced adults with multidrug resistant HIV-1 infection failing their current antiretroviral regimen due to resistance, intolerance or safety considerations.\n3\nLiver Disease\n•\nEpclusa\n®\n is an oral formulation of a once-daily single-tablet regimen of sofosbuvir and velpatasvir for the treatment of chronic hepatitis C virus (“HCV”) infection in adults and pediatric patients 3 years of age and older with genotype 1, 2, 3, 4, 5 or 6: (i) without cirrhosis or with compensated cirrhosis or (ii) with decompensated cirrhosis for use in combination with ribavirin. In addition, we have an authorized generic version of Epclusa distributed by our separate subsidiary, Asegua Therapeutics LLC.\n•\nVemlidy\n®\n is an oral formulation of TAF dosed once a day for the treatment of chronic hepatitis B virus (“HBV”) infection in adults and pediatric patients 12 years of age and older with compensated liver disease.\n•\nHarvoni\n®\n is an oral formulation of a once-daily, single-tablet regimen of ledipasvir and sofosbuvir for the treatment of chronic HCV infection in adults and pediatric patients 3 years of age and older with: (i) genotype 1, 4, 5 or 6 without cirrhosis or with compensated cirrhosis, (ii) genotype 1 with decompensated cirrhosis, in combination with ribavirin, (iii) genotype 1 or 4 who are liver transplant recipients without cirrhosis or with compensated cirrhosis, in combination with ribavirin. In addition, we have an authorized generic version of Harvoni distributed by our separate subsidiary, Asegua Therapeutics LLC.\n•\nViread\n®\n is an oral formulation of TDF dosed once a day for the treatment of chronic HBV infection in adults and pediatric patients 2 years of age and older and weighing at least 10 kg. \n•\nLivdelzi\n®\n \n(seladelpar) is an oral formulation of a peroxisome proliferator-activated receptor delta agonist indicated for the treatment of primary biliary cholangitis (“PBC”) in combination with ursodeoxycholic acid (“UDCA”) in adults who have an inadequate response to UDCA, or as monotherapy in patients unable to tolerate UDCA.\n(1)\nCOVID-19\n•\nVeklury\n®\n \n(remdesivir), an injection for intravenous use, is a nucleotide analog RNA polymerase inhibitor indicated for the treatment of COVID-19 in certain adults and pediatric patients (28 days of age and older and weighing at least 3 kg) who are (i) hospitalized or (ii) not hospitalized and have mild-to-moderate COVID-19, and are at high risk for progression to severe COVID-19, including hospitalization or death. \nOncology\nCell Therapy\n•\nYescarta\n®\n (axicabtagene ciloleucel), a suspension for intravenous infusion, is a chimeric antigen receptor (“CAR”) T-cell therapy for the treatment of adult patients with (i) large B-cell lymphoma (“LBCL”) that is refractory to first-line chemoimmunotherapy or that relapses within 12 months of first-line chemoimmunotherapy, (ii) relapsed or refractory LBCL after two or more lines of systemic therapy, including diffuse LBCL (“DLBCL”) not otherwise specified, primary mediastinal LBCL, high-grade B-cell lymphoma and DLBCL arising from follicular lymphoma (“FL”) and (iii) relapsed or refractory FL after two or more lines of systemic therapy.\n(1)\n•\nTecartus\n®\n (brexucabtagene autoleucel), a suspension for intravenous infusion, is a CAR T-cell therapy for the treatment of adult patients with (i) relapsed or refractory mantle cell lymphoma (“MCL”)\n(1)\n and (ii) relapsed or refractory B-cell precursor acute lymphoblastic leukemia (“ALL”). \nOther\n•\nTrodelvy\n®\n \n(sacituzumab govitecan-hziy), an injection for intravenous use, is a Trop-2 directed antibody and topoisomerase inhibitor conjugate indicated for the treatment of adult patients with (i) unresectable locally advanced or metastatic triple-negative breast cancer (“TNBC”) who have received two or more prior systemic therapies, at least one of them for metastatic disease, and (ii) unresectable locally advanced or metastatic hormone receptor-positive, human epidermal growth factor receptor 2-negative (“HR+/HER2-”) breast cancer who have received endocrine-based therapy and at least two additional systemic therapies in the metastatic setting.\nOther\n•\nAmBisome\n®\n \n(amphotericin B liposome for injection) is a proprietary liposomal formulation of amphotericin B, an antifungal agent, for the treatment of serious invasive fungal infections caused by various fungal species in adults.\n•\nLetairis\n®\n (ambrisentan) is an oral formulation of an endothelin receptor antagonist for the treatment of pulmonary arterial hypertension (“PAH”) (WHO Group I) (i) to improve exercise capacity and delay clinical worsening or (ii) in combination with tadalafil to reduce the risks of disease progression and hospitalization for worsening PAH, and to improve exercise ability. \n_______________________________\n(1)    \nThis indication is approved under accelerated approval by FDA, and continued approval for this indication may be contingent upon verification and description of clinical benefit in confirmatory trials.\n4\nFor the disaggregated revenue amounts contributed by the products listed above as well as the total product sales that include our other approved products, see Note 2. Revenues of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K. \nRoyalty, Contract and Other Revenues\nWe also generate revenues from other activities, including royalties for outbound licenses of our intellectual property and other payments received from our collaborations with third-party partners. \nCommercialization and Distribution\nWe have U.S. and international commercial sales operations, with marketing subsidiaries in more than 35 countries. Our products are marketed through our commercial teams and/or in conjunction with third-party wholesalers, distributors and corporate partners. Our commercial teams promote our products through direct field contact with physicians, hospitals, clinics and other healthcare providers. We generally grant our third-party distributors the exclusive right to promote our product in a territory for a specified period of time. Most of our agreements with these distributors provide for collaborative efforts between the distributor and Gilead in obtaining and maintaining regulatory approval for the product in the specified territory.\nWe sell and distribute most of our products in the U.S. exclusively through the wholesale channel. During the year ended December 31, 2024, approximately 91% of our product sales in the U.S. and approximately 65% of our total worldwide revenues were from three large wholesalers: Cardinal Health, Inc., Cencora, Inc. and McKesson Corporation, and their specialty distributor affiliates. We sell and distribute our products in Europe and countries outside the U.S. where the product is approved, either through our commercial teams, third-party distributors or corporate partners.\nCompetition\nWe operate in a highly competitive environment. Our products compete with other commercially available products based primarily on efficacy, safety, tolerability, acceptance by doctors, ease of patient compliance, ease of use, price, insurance and other reimbursement coverage, distribution and marketing. We also face significant competition from: (i) large pharmaceutical and biotechnology companies and specialized pharmaceutical firms acting either independently or together with other such companies to pursue the development of products and technologies that may be competitive with our existing products or research programs; (ii) academic institutions, government agencies and other public and private organizations conducting research who may seek patent protection or may establish collaborative arrangements for competitive products or programs; (iii) pricing pressures from private insurers and government payers as our products mature, which often result in a reduction of the net product prices; and (iv) new branded or generic products introduced into major markets, which may impact our ability to maintain pricing and market share.\nFor more information, see Item 1A. Risk Factors “We face significant competition from global pharmaceutical and biotechnology companies, specialized pharmaceutical firms and generic drug manufacturers.”\nResearch and Development\nOur research and development (“R&D”) mission is to discover and develop transformational therapies in areas of high unmet medical need. Our product development efforts are focused primarily on viral diseases, cancer and inflammatory diseases. Our team of research scientists is engaged in the discovery and development of new molecules and technologies that we hope will lead to the approval of innovative medicines and therapies that will transform care for people around the world. We have committed significant resources to internal R&D opportunities and external business development activity to drive innovation and growth of our business. We extensively outsource our clinical trial activities and usually perform only a small portion of start-up activities in-house. We rely on third-party contract research organizations to perform most of our clinical studies, including document preparation, site identification, screening and preparation, pre-study visits, training, program management, patient enrollment, ongoing monitoring, site management and bioanalysis. \nThe development of product candidates and investigational therapies in our pipeline is subject to various risks and uncertainties that could result in delays or prevent completion of the development and approval of our product candidates. For more information about these risks and uncertainties, see Item 1A. Risk Factors “We face risks in our clinical trials, including the potential for unfavorable results, delays in anticipated timelines and disruption.” Drug development is inherently risky, and many product candidates and investigational therapies fail during the development process.\nIn 2024, we continued to invest in and advance our R&D pipeline across our therapeutic areas. Below is a summary of our product candidates that are in Phase 3 clinical trials or pending marketing authorization review by FDA or European Medicines Agency (“EMA”).\n5\nProduct Candidates in Virology\nProduct Candidates\nDescription\nRegulatory Filings\nLenacapavir\nA New Drug Application has been filed with FDA for lenacapavir, a twice-yearly injectable HIV-1 capsid inhibitor, for the prevention of HIV as pre-exposure prophylaxis.\nBulevirtide\nA Biologics License Application has been filed with FDA for bulevirtide for the treatment of chronic hepatitis delta virus (“HDV”) infection. It has been granted both Orphan Drug and Breakthrough Therapy designations by FDA for this indication. Approval is pending resolution of certain manufacturing and delivery concerns cited in a complete response letter issued by FDA in October 2022.\nPhase 3\nLenacapavir combinations\nAn oral combination of lenacapavir and bictegravir is being evaluated as an HIV treatment for virologically suppressed treatment-experienced and virologically suppressed people living with HIV.\nIn combination with Merck & Co., Inc. (“Merck”)\n(1)\n, an oral combination of lenacapavir and Merck’s islatravir is being evaluated as a long-acting HIV treatment for virologically suppressed people living with HIV.\nProduct Candidates in Oncology\nProduct Candidates\nDescription\nPhase 3\nAxicabtagene ciloleucel\nAxicabtagene ciloleucel, a CAR T-cell therapy, is being evaluated as (i) a second-line and later treatment for high-risk FL and (ii) a first-line treatment for high-risk LBCL.\nAnitocabtagene autoleucel\nIn collaboration with Arcellx, Inc. (“Arcellx”)\n(1)\n,\n \nanitocabtagene autoleucel, a CAR T-cell therapy, is being evaluated in patients with relapsed and/or refractory multiple myeloma who have received one to three prior lines of therapy.\nSacituzumab govitecan-hziy\nIn breast cancer, sacituzumab govitecan-hziy is being evaluated as (i) a first-line treatment for PD-L1 negative metastatic TNBC and (ii) HR+/HER2- chemo-naive metastatic breast cancer. In collaboration with Merck, it is also being evaluated in combination with Merck’s pembrolizumab as (i) a first-line treatment for PD-L1 positive metastatic TNBC and (ii) an adjuvant treatment for early TNBC. \nIn lung and thoracic cancer, sacituzumab govitecan-hziy is being evaluated in combination with Merck’s pembrolizumab as a first-line treatment for PD-L1 positive non-small cell lung cancer (“NSCLC”).\nIn gynecology, sacituzumab govitecan-hziy is being evaluated as a second-line treatment for metastatic endometrial cancer.\nDomvanalimab and zimberelimab\nIn collaboration with Arcus Biosciences, Inc. (“Arcus”)\n(1)\n, the combination of zimberelimab, an anti-PD-1 monoclonal antibody, and domvanalimab, an Fc-silent anti-TIGIT antibody, with chemotherapy is being evaluated as (i) a first-line treatment for NSCLC and (ii) a first-line treatment for upper gastrointestinal tract cancer.\n_______________________________\n(1)\n    For additional information regarding our collaborations with Merck, Arcellx and Arcus, see Note 7. Collaborations and Other Arrangements of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\n6\nIn 2024, we also received regulatory approvals or authorizations from FDA for new products and expanded indications of our products, including:\nProduct\nRegulatory Approval or Authorization\nLivdelzi\nFDA granted accelerated approval of Livdelzi for the treatment of PBC in combination with UDCA in adults who have an inadequate response to UDCA, or as monotherapy in patients unable to tolerate UDCA. Accelerated approval was based primarily on data from the Phase 3 RESPONSE study, which achieved a reduction of alkaline phosphatase values, a cholestatic marker that is a predictor of risk for liver transplant and death.\nTrodelvy\nFDA granted Breakthrough Therapy designation to Trodelvy for the treatment of adult patients with extensive-stage small cell lung cancer whose disease has progressed on or after platinum-based chemotherapy. Breakthrough Therapy designation is designed to expedite the development and regulatory review of investigational treatments for serious or life-threatening conditions that, based on preliminary clinical evidence, have the potential to substantially improve clinical outcomes compared to available therapy. This is the second Breakthrough Therapy designation for Trodelvy.\nBiktarvy\nFDA approved an expanded indication for Biktarvy to treat people with HIV who have suppressed viral loads with known or suspected M184V/I resistance, a common form of treatment resistance. FDA also approved an updated label with additional data reinforcing the safety and efficacy profile of Biktarvy to treat pregnant people with HIV-1 with suppressed viral loads.\nVemlidy\nFDA approved an expanded indication for Vemlidy as a once-daily treatment for chronic HBV infection in pediatric patients six years of age and older and weighing at least 25 kg with compensated liver disease.\nIn addition, we seek to enhance our commercial portfolio and clinical pipeline across multiple therapeutic areas through strategic collaborations, in-licensing and acquisitions. For information on some of our notable recent transactions, see Notes 6. Acquisitions and 7. Collaborations and Other Arrangements of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nOur strategic business development activity reflects our commitment to focus on transformative science, build a sustainable and diverse portfolio and position ourselves for the near-, medium- and long-term growth of our business.\nPatents and Proprietary Rights\nU.S. and EU Patent Expiration\nWe have a number of U.S. and foreign patents, patent applications and rights to patents related to our compounds, products and technology. The following table shows the estimated expiration dates (including patent term extensions, supplementary protection certificates and/or pediatric exclusivity where granted) in the U.S. and the European Union (“EU”) for the primary (typically compound) patents for our key product candidates as described above. For our product candidates that are fixed-dose combinations of single-tablet regimens, the estimated patent expiration date provided corresponds to the latest expiring compound patent for one of the active ingredients in the single-tablet regimen.\nKey Product Candidates\nPatent Expiration\nU.S.\nEU\nViral Diseases:\nLenacapavir\n2037\n2037\nBulevirtide\n2030\n2029\nOncology:\nAxicabtagene ciloleucel\n2031\n—\n(1)\nAnitocabtagene autoleucel\n(2)\n2038\n(2038)\nSacituzumab govitecan-hziy\n2028\n(3)\n2029\nZimberelimab\n(4)\n2036\n2036\nDomvanalimab\n(4)\n2037\n(2037)\n(5)\n_______________________________\n(1)\n     The composition of matter patent has expired in the EU. In the EU and the U.S., patent applications are pending relating to our proprietary manufacturing processes.\n(2)\n     In collaboration with Arcellx.\n(3)\n     Regulatory exclusivity in the U.S. expires in 2032.\n(4)\n     In collaboration with Arcus.\n(5)\n     Dates in parentheses reflect the estimated expiration date of patents that may be issued from currently pending applications. \n7\nThe following table shows the actual or estimated expiration dates (including patent term extensions, supplementary protection certificates and/or pediatric exclusivity where granted) in the U.S. and the EU for the primary (typically compound) patents for our principal products. For our products that are fixed-dose combinations or single-tablet regimens, the estimated patent expiration dates provided correspond to the latest expiring compound patent for one of the active ingredients in the single-tablet regimen.\nProducts\nPatent Expiration\n(1)\nU.S.\nEU\nDescovy\n2031\n(2)\n2027\nVemlidy\n2031\n(2)\n2027\nComplera/Eviplera\n2025\n2026\nZydelig\n2025\n2029\nOdefsey\n2032\n(2)\n2027\nYescarta\n2031\n—\n(3)\nStribild\n2029\n(4)\n2028\nGenvoya\n2029\n(4), (5) \n2028\nHarvoni\n2030\n2030\nEpclusa\n2033\n2032\nBiktarvy\n2033\n2033\nVosevi\n2034\n2033\nVeklury\n2036\n(6)\n2035\nTecartus\n2027\n—\n(3)\nTrodelvy\n2028\n(7)\n2029\nHepcludex\n2030\n2029\nSunlenca\n2037\n2037\nLivdelzi\n2025\n(8)\n—\n(9)\n_______________________________\n(1)\n     Where applicable, settlement and license agreements with generic manufacturers relating to the patents that protect our principal products are noted. The nature and timing of loss of exclusivity for these products depends on a multitude of factors, and loss of exclusivity may be earlier under certain circumstances. For more information, see Item 1A. Risk Factors “Our success depends to a significant degree on our ability to obtain and defend our patents and other intellectual property rights both domestically and internationally, and to operate without infringing upon the patents or other proprietary rights of third parties.”\n(2)\n     In September 2022, Gilead and five generic manufacturers (Lupin Ltd., Apotex Inc., Macleods Pharma Ltd., Hetero Labs Ltd., and Cipla Ltd.) reached agreements to settle the U.S. patent litigation concerning patents that protect TAF in our Descovy, Vemlidy and Odefsey products.\n(3)\n     The composition of matter patent has expired in the EU. In the EU and the U.S., patent applications are pending relating to our proprietary manufacturing processes.\n(4)\n     In 2018, Gilead and Mylan Pharmaceuticals reached an agreement to settle the patent litigation concerning patents that protect cobicistat in our Stribild and Genvoya products.\n(5)\n     In February 2025, Gilead reached an agreement with one generic manufacturer (Apotex, Inc., together with Apotex Corp., and its manufacturer of cobicistat, MSN Laboratories Private Limited, MSN Life Sciences Private Ltd., and MSN Pharmaceuticals Inc.) to settle the patent litigation concerning certain patents that protect cobicistat on silicon dioxide and TAF in our Genvoya product. The Apotex/MSN agreement provides a non-exclusive license to those patents beginning on August 6, 2032, or earlier in certain circumstances.\n(6)\n     In January 2024, FDA granted pediatric exclusivity for Veklury, which extends all non-expired exclusivities by six months, and which is reflected in the presently reported date.\n(7)\n     Regulatory exclusivity in the U.S. expires in 2032.\n(8)\n     Orphan exclusivity expires in 2031.\n(9)\n     Ten years of regulatory/market exclusivity expected on approval.\nPatent and Trade Secret Strategy\nFor a discussion of risks and challenges associated with our patent and trade secret strategy described below, see Item 1A. Risk Factors “Our success depends to a significant degree on our ability to obtain and defend our patents and other intellectual property rights both domestically and internationally, and to operate without infringing upon the patents or other proprietary rights of third parties.”\nPatents\nPatents and other proprietary rights are very important to our business. If we have a properly drafted and enforceable patent, it can be more difficult for our competitors to use our technology to create competitive products and more difficult for our competitors to obtain a patent that prevents us from using technology we create. As part of our business strategy, we actively seek patent protection both in the U.S. and internationally and file additional patent applications, when appropriate, to cover improvements in our compounds, products and technology.\n8\nPatents covering certain of the active pharmaceutical ingredients (“API”) of some of our products are held by third parties. We acquired exclusive rights to these patents in the agreements we have with these parties. \nWe often obtain patents for certain products many years before marketing approval is obtained. As a result, the commercial value of the patent may be limited because the patent term is based on the date the patent application was filed, which may be prior to the regulatory approval and commercial sale of the related product. However, we also apply for patent term extensions or supplementary protection certificates in some countries. For example, extensions for the patents or supplementary protection certificates on many of our products have been granted in the U.S. and in a number of European countries, compensating in part for delays in obtaining marketing approval.\nFrom time to time, certain individuals or entities may challenge our patents. For a description of our significant pending legal proceedings, see Note 13. Commitments and Contingencies of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K. \nTrade Secrets\nWe also rely on unpatented trade secrets and improvements, unpatented internal know-how and technological innovation. For products manufactured by our third-party contract manufacturers, we have disclosed all necessary aspects of these technologies to enable them to manufacture the products for us. We protect these rights mainly through confidentiality agreements with third-party manufacturers, corporate partners, employees, consultants and vendors. These agreements provide that all confidential information developed or made known to an individual during the course of their relationship with us will be kept confidential and will not be used or disclosed to third parties except in specified circumstances. In the case of employees, the agreements provide that all inventions made by an individual while employed by us will be our exclusive property. \nRaw Materials and Manufacturing\nWe need access to certain raw materials to conduct our clinical trials and manufacture our products. These raw materials are generally available from multiple sources and normally available in quantities adequate to meet the needs of our business. We attempt to manage the risks associated with our supply chain through inventory management, relationship management and the evaluation of alternative sources when feasible. \nWe own or lease manufacturing facilities to manufacture and distribute certain products and API for clinical and/or commercial uses. As of the end of 2024, these facilities include:\n•\nFoster City, California: We conduct process chemistry research, analytical method development and formulation and device development activities, and manufacture API and drug product for our clinical trials.\n•\nLa Verne, California: We manufacture AmBisome and also package and label the majority of our commercial products for distribution to the Americas and the Pacific Rim. We also utilize the La Verne facility for clinical manufacturing of our sterile drug products.\n•\nOceanside, California: We utilize the facility for commercial retroviral vector manufacturing and clinical manufacturing and process development of our biologics candidates.\n•\nEl Segundo, California: We utilize the facility for clinical and commercial manufacturing and processing of our cell therapy products.\n•\nSanta Monica, California: We utilize the facility for clinical manufacturing and processing of our cell therapy products.\n•\nFrederick, Maryland: We utilize the facility for clinical and commercial manufacturing and processing of our cell therapy products.\n•\nCork and Dublin, Ireland: We utilize the Cork facility for commercial manufacturing, packaging and labeling of our products. We also perform quality control testing, labeling, packaging and final release of many of our products at the Cork facility, which are distributed to the EU and other international markets through our facility in Dublin. \n•\nEdmonton, Canada: We conduct process chemistry research and scale-up activities for our clinical development candidates, manufacture API for both investigational and commercial products and conduct chemical development activities to improve existing commercial manufacturing processes.\n•\nHoofddorp, Netherlands: We utilize the facility for commercial manufacturing and processing of our cell therapy products.\n9\nWe also depend on contract manufacturing organizations (“CMOs”), inside and outside of the U.S., to perform manufacturing activities for the majority of our API and drug products. For most of our products, including our HIV and HCV products, we use multiple CMOs so that we have both primary and back-up suppliers and manufacturing sites. For our future products, we continue to develop additional manufacturing capabilities and establish additional third-party suppliers to manufacture sufficient quantities of our product candidates to undertake clinical trials and to manufacture sufficient quantities of any product that is approved for commercial sale.\nFor more information, see “Government Regulation” section below and Item 1A. Risk Factors “We may not be able to obtain materials or supplies necessary to conduct clinical trials or to manufacture and sell our products, or we may face manufacturing difficulties, delays or interruptions, including at our third-party manufacturers and corporate partners, which could limit our ability to generate revenues.”\nHuman Capital\nGilead’s success depends on the work of its dedicated employees who embrace a shared sense of purpose and a culture of excellence. Our human capital objective is to make Gilead an employer of choice for the best talent in our industry. Gilead’s key priorities for human capital management include inclusion, total rewards, safety, and employee development and engagement initiatives and programs. The Compensation and Talent Committee of our Board of Directors oversees our overall human capital management. \nFor risks associated with our human capital, see Item 1A. Risk Factors “Due to the specialized and technical nature of our business, the failure to attract, develop and retain highly qualified personnel could adversely impact us.”\nInclusion\nGilead is an equal opportunity employer and is committed to inclusive practices, which are integral to Gilead’s culture and business. We approach inclusion from the standpoint of it being a business imperative that is critical to hiring the very best talent, understanding the patients and communities we serve, and conducting science-based clinical trials focused on patient populations that represent the diseases being studied. We have a long-standing commitment to creating a safe, respectful and welcoming environment for all employees, which aligns with our core values of integrity, inclusion, teamwork, accountability and excellence. Gilead serves a wide range of patients and communities around the world, and they are best supported by a workforce that can understand and innovate to meet their unique needs. Ultimately, a workforce with different lived experiences, perspectives and backgrounds is imperative to advancing health and delivering transformational medicines for patients worldwide.\nOur inclusion council (“Council”) is responsible for governance of our inclusion strategy and our efforts to promote a culture of inclusion and belonging in a sustainable and compliant way. The Council includes senior executives and leaders from our employee resource groups (“ERGs”). In addition, our ERGs, which are open to all, support employees and aim to raise awareness of different cultures within the workplace and cultivate the variety of lived experiences, perspectives and backgrounds as a business strength. Executive sponsors and leaders of our ERGs contribute to the advancement of our inclusion priorities through annual planning and collaborative efforts to support our communities inside and outside of Gilead. \nGilead’s commitment to equal employment opportunity furthers its efforts to cultivate and celebrate a culture of belonging. As of December 31, 2024, Gilead had approximately 17,600 employees.\n10\nTotal Rewards\nGilead’s Total Rewards portfolio is a competitive, robust benefits package that is designed to optimize our employees’ performance and support their wellbeing, allowing them to focus on mission-critical work. Each year, we reassess our Total Rewards package to confirm whether it offers benefits and incentives that align with our total rewards philosophy. Our portfolio (which varies by country and is subject to employee eligibility requirements and legal and regulatory requirements) includes but is not limited to: \n•\nCompetitive base salary \n•\nIncentive compensation\n•\nStock awards\n•\nEmployee stock purchase plan\n•\n401(k) savings plan with a company match that vests immediately\n•\nHealth and wellbeing benefits\n•\nFlexible work arrangements\n•\nFlexible spending accounts\n•\nPaid time off\n•\nPaid family leave\n•\nFamily support services, including family planning and reproductive health (e.g., fertility, adoption and surrogacy)\n•\nMental health support, including complex care management\n•\nHealth care navigation support \n•\nCancer support services\n•\nStudent loan repayment and tuition assistance\n•\nEmployee assistance programs\n•\nDigital wellbeing platform\n•\nGlobal wellbeing reimbursement\nWe are a pay-for-performance company and are committed to addressing pay equity. Our employee salaries are informed by market research, and market-based ranges and are assessed annually through performance reviews. Our policy is that compensation decisions are merit-based and made without regard to personal characteristics such as gender, race, color, national or ethnic origin, age, disability, sexual orientation, gender identity or expression, genetic information, religion or veteran status. We also conduct an annual pay equity review of employee compensation in an effort to strive to make our pay practices gender- and race-neutral.\nTo promote employee productivity, we continue to address our employees’ needs by providing meaningful benefits and a flexible approach to work arrangements. We believe our flexible work program positions us to be competitive for talent and support employee wellbeing while also creating the collaborative environment and connections that fuel innovation.\nSafety\nWe have a workplace safety, training and security program that focuses on preventing work-related injuries and illnesses and providing a safe and secure environment for our employees. To maintain high safety standards, we offer our employees annual refresher courses and specialized training tailored to specific needs. We also diligently record, analyze and report work-related injuries and illnesses and other health and safety data in compliance with applicable regulatory and legal requirements.\nEmployee Development and Engagement\nEmployee development maximizes the potential and performance of each member of our workforce and is critical to achieving our business goals. Gilead offers a number of internal and external professional, management and leadership development training programs to help our employees develop technical, cross-functional and leadership skills and tools to advance their careers. In 2023, we started a multi-year approach to support the development of all people leaders at Gilead, recognizing the complexity and challenges of their roles and supporting the impact they can have on the growth and development of all employees. Approximately 1,700 people leaders started their development journey in 2023, with an additional 3,500 in 2024. In addition to internal development, employees can receive reimbursement for tuition expenses incurred while pursuing undergraduate, graduate or certificate courses at an accredited college or university or enroll in our standard loan repayment program for education loan repayment assistance.\nAs we strive to be an employer of choice in our industry, our listening strategy gathers input from our internal and external talent to shape our engagement strategies and programs and measure our progress. In addition to ongoing monitoring of key metrics (e.g., voluntary turnover), we conducted comprehensive reviews of the employee experience in 2023 and again in 2024 via surveys, focus groups and benchmarks. The resulting insights play a key role in determining the direction of our culture as well as the company’s broader response to emerging developments. For example, in response to 2023 employee feedback, we implemented multiple enterprise initiatives to address areas of opportunity to improve efficiency and remove barriers to speed of execution.\n11\nCorporate Responsibility\nInvesting in corporate responsibility is core to our business strategy and reflects our values of accountability, inclusion, teamwork, excellence and integrity. This is in service to our mission to advance global health by providing innovative therapeutics in areas of unmet need in a way that is socially responsible and environmentally sustainable. Gilead’s corporate responsibility programs reflect this commitment to our stakeholders. Environmental, social and governance (“ESG”) strategy and performance are overseen by the Nominating and Corporate Governance Committee of our Board of Directors and managed by a Corporate Responsibility Committee, which is comprised of leaders from key departments across our company. The Corporate Responsibility Committee is responsible for reviewing ESG issues and, as appropriate, integrating them into our overall business strategy and operations. Additional information about this program and ESG highlights are available in Gilead’s 2023 ESG Impact Report on Gilead’s website at https://www.gilead.com/responsibility/esg.\nOur ESG goals are aspirational and may change. Statements regarding these goals and related initiatives are not guarantees or promises that they will be met. For further information, see Item 1A. Risk Factors “Our aspirations, goals and disclosures related to corporate responsibility matters expose us to numerous risks, including risks to our reputation and stock price.” \nSeasonality of Operations\nOur worldwide product sales do not reflect any significant degree of seasonality in end-user demand. However, in the U.S., fluctuations in wholesaler inventory levels impact our product sales. In recent years, we have observed strong wholesaler and sub-wholesaler purchases of our products in the second half of the year, resulting in inventory draw-down by wholesalers and sub-wholesalers in the subsequent first quarter. Several other factors, including government budgets, annual grant cycles for federal and state funds, adverse changes in economic conditions, increased competition and other buying patterns, also could impact the product sales recorded in a particular quarter. For more information, see Item 1A. Risk Factors “We face challenges in accurately forecasting sales because of the difficulties in predicting demand for our products and fluctuations in purchasing patterns or wholesaler inventories.”\nGovernment Regulation\nOur operations and activities are subject to extensive regulation by numerous government authorities in the U.S., the EU and other countries, including laws and regulations governing the testing, manufacture, safety, efficacy, labeling, storage, record keeping, approval, advertising and promotion of our products. As a result of these regulations, product development and product approval processes are very expensive and time consuming, which has a significant impact on our capital expenditures and results of operations. The regulatory requirements applicable to drug development and approval are subject to change. Any legal and regulatory changes may impact our operations in the future.\nIn addition, the current U.S. Presidential administration has indicated that it plans to pursue changes to various regulatory policies from prior administrations, some of which have already started to be implemented. As a result, there is uncertainty as to how these and other potential legal and regulatory changes may impact our business. For example, President Trump issued an executive order repealing President Biden’s executive order 14087, which directed the Center for Medicare and Medicaid Innovation within the Centers for Medicare and Medicaid Services to test new Medicare and Medicaid payment models. President Trump also issued an executive order aimed at diversity, equity and inclusion initiatives and has pledged to impose tariffs on pharmaceuticals and other products, some of which have already started to be implemented. These tariffs and retaliatory measures taken by other nations in response may increase our costs and adversely impact the competitiveness of our products outside the U.S. Some of these policy changes may be subject to litigation or other challenge, increasing the uncertainty of their effects on our business.\nDrug Development Regulation\nA country’s regulatory agency, such as FDA in the U.S. and EMA and EC in the EU, as well as the national authorities of the EU member states, must approve a drug before it can be sold in the respective country or countries. The general processes for drug development and approval in the U.S. and EU are summarized below. Many other countries, including individual countries within the EU, have similar regulatory structures.\nU.S. Drug Development\nPreclinical Testing\nBefore we can test a drug candidate in humans, we must study the drug in laboratory experiments and in animals to generate data to support the drug candidate’s potential benefits and safety. We submit this data to FDA in an Investigational New Drug (“IND”) application seeking its approval to test the compound in humans.\n12\nClinical Trials\nIf FDA accepts the IND, the drug candidate can then be studied in human clinical trials to determine if the drug candidate is safe and effective. These clinical trials involve three separate phases that often overlap, can take many years and are very expensive. These three phases, which are subject to considerable regulation, are as follows:\n•\nPhase 1. The drug candidate is given to a small number of healthy human control subjects or patients suffering or at risk from the indicated disease, to test for safety, dose tolerance, pharmacokinetics, metabolism, distribution and excretion.\n•\nPhase 2. The drug candidate is given to a limited patient population to determine the effect of the drug candidate in treating or preventing the disease, the best dose of the drug candidate, and the possible side effects and safety risks of the drug candidate. It is not uncommon for a drug candidate that appears promising in Phase 1 clinical trials to fail in the more rigorous and extensive Phase 2 clinical trials.\n•\nPhase 3. If a drug candidate appears to be effective and have an appropriate safety profile in Phase 2 clinical trials, Phase 3 clinical trials are commenced to confirm those results. Phase 3 clinical trials are conducted over a longer term, involve a significantly larger population, are conducted at numerous sites in different geographic regions and are carefully designed to provide reliable and conclusive data regarding the safety and benefits of a drug candidate. It is not uncommon for a drug candidate that appears promising in Phase 2 clinical trials to fail in the more rigorous and extensive Phase 3 clinical trials.\nFDA Approval Process\nWhen we believe that the data from our clinical trials show an acceptable benefit-risk profile, we submit the appropriate filing, usually in the form of a New Drug Application, Biologics License Application or supplemental application, with FDA, seeking approval to sell the drug candidate for a particular use. At FDA’s discretion, FDA may hold a public hearing where an independent advisory committee of expert advisors asks additional questions and makes recommendations regarding the drug candidate. This committee makes a recommendation to FDA that is not binding but is generally followed by FDA. If FDA agrees that the drug has met the required level of safety and efficacy for a particular use, it will approve the application and allow us to sell the drug in the U.S. for that use. It is not unusual, however, for FDA to decline to approve an application because it believes that the drug candidate is not safe enough or efficacious enough (i.e., does not have an appropriate benefit-risk profile) or because it does not believe that the data submitted is reliable or conclusive.\nAt any point in this process, the development of a drug candidate can be stopped for a number of reasons, including safety concerns, lack of treatment benefit or manufacturing issues. We cannot be certain that any clinical trials that we are currently conducting or any that we conduct in the future will be completed successfully or within any specified time period. We may choose, or FDA may require us, to delay or suspend our clinical trials at any time if it appears that patients are being exposed to an unacceptable health risk or if the drug candidate does not appear to have sufficient treatment benefit.\nEven after approving a drug, FDA may also require Phase 4 non-registrational studies to explore scientific questions to further characterize safety and efficacy during commercial use of our drug. FDA may also require us to provide additional data or information, improve our manufacturing processes, procedures or facilities or may require extensive surveillance to monitor the safety or benefits of our product candidates if it determines that our filing does not contain adequate evidence of the safety and benefits of the drug. In addition, even if FDA approves a drug, it could limit the uses of the drug. FDA can withdraw approvals if it does not believe that we are complying with regulatory standards or if concerns about the safety or efficacy are uncovered or occur after approval.\nIn addition to obtaining FDA approval for each drug, we obtain FDA approval of the manufacturing facilities for any drug we sell, including those of companies who manufacture our drugs for us. All of these facilities are subject to periodic inspections by FDA. FDA must also approve foreign establishments that manufacture products to be sold in the U.S. and these facilities are subject to periodic regulatory inspection. Our manufacturing facilities located in California also must be licensed by the State of California in compliance with local regulatory requirements. Our manufacturing facilities in Canada, Ireland and Netherlands also must obtain local licenses and permits in compliance with local regulatory requirements.\nFDA may employ one of several tools to facilitate and expedite the development and review of a drug, including Fast Track designation, Breakthrough Therapy designation, Accelerated Approval designation and Priority Review designation. Fast Track designation is designed to facilitate the development and review of a drug that treats a serious condition and fills an unmet medical need. Breakthrough Therapy designation is designed to expedite the development and review of a drug that treats a serious condition where preliminary clinical evidence demonstrates substantial improvement over available therapies. Accelerated Approval of a drug may be granted by FDA where the drug treats a serious condition, fills an unmet medical need and has been studied for safety and efficacy. Priority Review designation means FDA’s goal is to take action on an application within six months of filing. FDA may grant Priority Review designation to a drug that would provide significant improvement in the safety or effectiveness of a treatment, diagnosis or prevention of a serious condition. \n13\nEU Drug Development\nIn the EU, our products are subject to a variety of EU and EU member state regulations governing clinical trials, commercial sales and distribution. We are required to obtain a marketing authorization in the EU before we can market our medicinal products on the relevant market. The conduct of clinical trials in the EU is governed by, among others, Directive 2001/20/EC and Directive 2005/28/EC and the ICH Good Clinical Practice guidelines. These impose legal and regulatory obligations that are similar to those provided in applicable U.S. laws. The conduct of clinical trials in the EU must be approved by the competent authorities of each EU member states in which the clinical trials take place, and a positive opinion must be obtained from the relevant Ethics Committee in the relevant member state. In 2014, the EU legislator adopted Regulation (EU) No 536/2014 to replace Directive 2001/20/EC and to introduce a coordinated procedure for authorization of clinical trials. This Regulation entered into application in January 2022. \nMarketing authorization holders, manufacturers, importers, wholesalers and distributors of medicinal products placed on the market in the EU are required to comply with a number of regulatory requirements including pharmacovigilance, manufacturing compliance and the requirement to obtain manufacturing, import and/or distribution licenses issued by the competent authorities of the EU member states. Failure to comply with these requirements may lead to the imposition of civil, criminal or administrative sanctions, including suspension of marketing or manufacturing authorizations.\nManufacturing Regulation\nThe manufacturing process for pharmaceutical products is highly regulated and regulators may shut down manufacturing facilities that they observe are not complying with regulations. We, our CMOs and our corporate partners are subject to current Good Manufacturing Practices (“cGMP”), which are extensive regulations governing manufacturing processes, stability testing, record keeping and quality standards as defined by FDA and EMA. Similar regulations are in effect in other jurisdictions. Suppliers of key components and materials must be named in the new drug application or marketing authorization application filed with the regulatory authority for any product candidate for which we are seeking marketing approval, and significant delays can occur if the qualification of a new supplier is required. Even after our facilities or a third-party supplier is qualified by the regulatory authority, time, money and effort must continue to be expended in the area of production and quality control to maintain full compliance with cGMP. Our manufacturing operations and third-party suppliers are subject to regular periodic inspections by regulatory authorities following initial approval.\nFor our cell therapy products, we are required by FDA to comply with the Risk Evaluation and Mitigation Strategy program, which includes educating and certifying medical personnel regarding the therapy procedures and the potential side effect profile of our therapy, such as the potential adverse side effects related to cytokine release syndrome and neurologic toxicities. Additionally, we are required to maintain a complex chain of identity and custody with respect to patient material as such material moves to the manufacturing facilities, through the manufacturing process, and back to the patient.\nPricing and Reimbursement Regulation\nHealth insurers, including government health authorities, generally provide reimbursement for the cost of our products and related treatments and medical services in the markets where we sell. In the U.S., the EU and other significant or potentially significant markets for our products and product candidates, government authorities limit or regulate the price of medical products and services. A significant portion of our sales of the majority of our products are subject to substantial discounts from their list prices, including rebates to Medicaid agencies or discounts to covered entities under Section 340B of the Public Health Service Act (“340B”). As a result, the price increases we implement from time to time on certain products may have a limited effect on our net product sales in certain markets. In addition, standard reimbursement structures may not adequately reimburse for innovative therapies.\nFor more information, see Item 1A. Risk Factors “Our existing products are subject to reimbursement pressures from government agencies and other third parties, required rebates and discounts, and other pricing pressures” and “We face challenges in accurately forecasting sales because of the difficulties in predicting demand for our products and fluctuations in purchasing patterns or wholesaler inventories.”\n14\nHealth Care Fraud and Abuse / Anti-Bribery Regulation\nWe are subject to various U.S. federal and state laws pertaining to health care “fraud and abuse,” including anti-kickback laws and false claim laws. Anti-kickback laws make it illegal for a prescription drug manufacturer to knowingly and willingly solicit, offer, receive or pay any remuneration in exchange for, or to induce, the referral of business reimbursed by a federal healthcare program, including the purchase or prescription of a particular drug. False claims laws generally prohibit anyone from knowingly presenting, or causing to be presented, a false or fraudulent claim for payment by federal and certain state payers (including Medicare and Medicaid), or knowingly making, using or causing to be made or used, a false record or statement material to a false or fraudulent claim. In addition, FDA regulates written and verbal communications about our products. In addition to federal law, states also have consumer protection and false claims laws. Due to the breadth of the statutory provisions and the attention being given to them by law enforcement authorities, our sales, marketing, patient support, medical, clinical and public affairs activities may be subject to scrutiny under these laws. For example, recently there has been enhanced scrutiny by government enforcement authorities of company-sponsored patient assistance programs, including co-pay assistance programs and manufacturer donations to third-party charities that provide such assistance, reimbursement support offerings, clinical education programs and promotional speaker programs. Similarly, in Europe, interactions between pharmaceutical companies and physicians are subject to strict laws, regulations, industry self‑regulation codes of conduct and physicians’ codes of professional conduct, as applicable, including the EU member states anti-corruption laws and the UK Bribery Act 2010.\nIn addition, the U.S. Foreign Corrupt Practices Act and similar worldwide anti-bribery laws generally prohibit companies and their intermediaries from making improper payments for the purpose of obtaining or retaining business. Our policies mandate compliance with these anti-bribery laws. We operate in parts of the world that have experienced governmental corruption to some degree. In certain circumstances, strict compliance with anti-bribery laws may conflict with local customs and practices or may require us to interact with doctors and hospitals, some of which may be state controlled, in a manner that is different than local custom. \nWe have implemented trainings and programs geared toward compliance with these laws. Violations of fraud and abuse laws or anti-bribery laws may be punishable by criminal and/or civil sanctions, including fines and civil monetary penalties, as well as the possibility of exclusion from federal health care programs (including Medicare and Medicaid). Violations can also lead to the imposition of a Corporate Integrity Agreement or similar government oversight program, even if we disagree with the government’s perspective that we have violated any rules or guidance. \nFor more information, see Item 1A. Risk Factors “We are impacted by evolving laws, regulations and legislative or regulatory actions applicable to the healthcare industry.”\nEnvironmental Regulation\nWe are subject to a number of laws and regulations that require compliance with federal, state and local regulations for the protection of the environment. Growing concern regarding climate change has resulted in an evolving legal and regulatory landscape, with new requirements enacted to prevent, mitigate or adapt to the implications of climate change. These regulations, which can differ across jurisdictions, subject us to many transition risks, including, for example, new or expanded carbon pricing or taxes, increased compliance costs, restrictions on greenhouse gas emissions, investment in new technologies, increased carbon disclosure and transparency, investments in data gathering and reporting systems, upgrades of facilities to meet new building codes and the redesign of utility systems, which could increase the company’s operating costs, including the cost of electricity and energy. For example, over 80 countries committed to the United Nations COP26 Health Programme’s initiatives on climate resilient and low carbon sustainable health systems. As such, there is an increasing expectation for the health sector to implement commitments to decarbonize and achieve net zero emissions by 2050. Failure to sufficiently decarbonize or comply with climate-related requirements may threaten our ability to operate in certain geographies and negatively affect our business. Our suppliers and third-party manufacturers and corporate partners face similar transition risks that could have an adverse effect on our business.\nWhile costs related to compliance with environmental regulations cannot be predicted with certainty, we do not currently anticipate that these costs will have a material effect on our capital expenditures, earnings and competitive position.\nFor more information, see Item 1A. Risk Factors “Climate change and natural disasters, as well as legal, regulatory, or market measures to address climate change, can negatively affect our business and operations.”\nOther Information\nWe are subject to the information requirements of the Securities Exchange Act of 1934 (“Exchange Act”). Therefore, we file periodic reports, proxy and information statements and other information with U.S. Securities and Exchange Commission (“SEC”). SEC maintains a website (www.sec.gov) that contains reports, proxy and information statements and other information regarding issuers that file electronically with SEC.\n15\nOur website is www.gilead.com. Through a link on the “Investors” page of our website (under the “Financials - SEC Filings” section), we make available the following filings free of charge as soon as reasonably practicable after they are electronically filed with or furnished to SEC: our Annual Reports on Form 10-K; Quarterly Reports on Form 10-Q; Current Reports on Form 8-K; and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act. \nWebsite references are provided throughout this document for convenience. The content on the referenced websites does not constitute a part of and is not incorporated by reference into this Annual Report on Form 10-K.\nOur Executive Officers and Directors\nThe following tables list our executive officers and directors as of the filing date of this Annual Report on Form 10-K:\nExecutive Officers\nName\nAge\nPosition\nDaniel P. O’Day\n60\nChairman and Chief Executive Officer\nDietmar Berger\n62\nChief Medical Officer\nAndrew D. Dickinson\n55\nChief Financial Officer\nJohanna Mercier\n55\nChief Commercial Officer\nDeborah H. Telman\n60\nExecutive Vice President, Corporate Affairs and General Counsel\nDirectors\nName\nAge\nPrincipal Occupation or Employment\nDaniel P. O’Day, Chairman\n60\nChairman and Chief Executive Officer of Gilead Sciences, Inc.\nAnthony Welters, Lead Independent Director\n69\nChairman and Chief Executive Officer, CINQ Care Inc.\nJacqueline K. Barton, Ph.D.\n72\nProfessor Emerita, California Institute of Technology\nJeffrey A. Bluestone, Ph.D.\n71\nPresident and Chief Executive Officer, Sonoma Biotherapeutics, Inc.\nSandra J. Horning, M.D.\n76\nRetired Chief Medical Officer, Roche, Inc.\nKelly A. Kramer\n57\nRetired Chief Financial Officer, Cisco Systems, Inc.\nTed W. Love, M.D.\n65\nChair of Board of Directors, Biotechnology Innovation Organization\nHarish Manwani\n71\nSenior Operating Partner, Blackstone Inc.\nJavier J. Rodriguez\n54\nChief Executive Officer, DaVita Inc.\n16",
  "item7": "ITEM 7. \n    \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis is intended to provide material information around events and uncertainties known to management that are relevant to an assessment of the financial condition and results of operations of Gilead and should therefore be read in conjunction with our audited Consolidated Financial Statements and the related notes thereto and other disclosures included as part of this Annual Report on Form 10-K (including the disclosures under Part I, Item 1A. Risk Factors). Additional information related to the comparison of our results of operations and liquidity and capital resources between the years 2023 and 2022 is included in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of our 2023 Form 10-K filed with U.S. Securities and Exchange Commission\n. \nManagement Overview\nGilead Sciences, Inc. (including its consolidated subsidiaries, referred to as “Gilead,” the “company,” “we,” “our” or “us”) is a biopharmaceutical company that has pursued and achieved breakthroughs in medicine for more than three decades, with the goal of creating a healthier world for all people. We are committed to advancing innovative medicines to prevent and treat life-threatening diseases, including HIV, viral hepatitis, coronavirus disease 2019 (“COVID-19”), cancer and inflammation. We operate in more than 35 countries worldwide, with headquarters in Foster City, California.\nOur strategic ambitions are to (i) bring 10+ transformative therapies to patients by 2030 (tracking since 2020); (ii) be a biotech employer and partner of choice; and (iii) deliver shareholder value in a sustainable and responsible manner. Our strategic priorities to deliver on these ambitions include: (i) maximize near-term revenue growth; (ii) maximize impact of long-acting HIV therapies; and (iii) expand and deliver on oncology programs.\nYear in Review\nDuring 2024, we delivered growth in our HIV, Oncology and Liver Disease product sales and continued to invest in our business and research and development (“R&D”) pipeline through advancement of our portfolio and broadening of available therapies, including through acquisitions and collaborations. Meanwhile, we maintained our financial position through repayment of senior notes coming due and the issuance of new senior notes, and provided shareholder returns through dividends and share repurchases. The following represents a summary of notable business updates and events during 2024, including certain items from our press releases, which readers are encouraged to review in full as available on our website at www.gilead.com. The content on the referenced website does not constitute a part of and is not incorporated by reference into this Annual Report on Form 10-K.\nVirology\n•\nCompleted the New Drug Application submissions to U.S. Food and Drug Administration (“FDA”) for twice-yearly lenacapavir for HIV prevention. \n•\nAnnounced results of PURPOSE 2, the second Phase 3 study of twice-yearly lenacapavir for HIV prevention, with data presented at the HIV Research for Prevention Conference. In the lenacapavir group, 99.9% of participants did not acquire HIV infection, with two incident cases among 2,179 participants. Lenacapavir reduced HIV infections by 96% compared to background HIV incidence in cisgender men and gender-diverse people, and additionally demonstrated superiority to daily Truvada (89% relative risk reduction). Lenacapavir was generally well-tolerated and no significant or new safety concerns were identified. The use of lenacapavir for the prevention of HIV is investigational.\nOncology\n•\nReceived Breakthrough Therapy Designation from FDA to Trodelvy for the treatment of adult patients with extensive-stage small cell lung cancer (“ES-SCLC”) whose disease has progressed on or after platinum-based chemotherapy. The use of Trodelvy in ES-SCLC is investigational.\n•\nAnnounced plans to voluntarily withdraw the U.S. accelerated approval of Trodelvy for use in pre-treated adult patients with locally advanced or metastatic urothelial cancer, following the results of the Phase 3 TROPiCS-04 trial announced in May 2024.\n•\nIncurred partial impairment charges related to in-process research and development (“IPR&D”) assets acquired by Gilead from Immunomedics, Inc. in 2020 as a result of our evaluation of the Phase 3 EVOKE-01 study data and a strategic decision to discontinue our clinical development program in metastatic non-small cell lung cancer (“NSCLC”) for Trodelvy in the second-line indication (see further information in “Results of Operations; In-Process Research and Development Impairments” below).\n37\nInflammation\n•\nReceived a positive opinion from the European Medicines Agency’s (“EMA”) Committee for Medicinal Products for Human Use recommending seladelpar for the treatment of primary biliary cholangitis (“PBC”) in combination with ursodeoxycholic acid (“UDCA”) in adults who have an inadequate response to UDCA alone, or as monotherapy in those unable to tolerate UDCA.\n•\nReceived accelerated approval from FDA for Livdelzi for the treatment of primary biliary cholangitis in combination with UDCA in adults who have had an inadequate response to UDCA, or as monotherapy in patients unable to tolerate UDCA.\n•\nEntered into an amended license agreement featuring the buy-out of global seladelpar royalties from Janssen Pharmaceutica NV for $320 million.\n•\nCompleted the acquisition of CymaBay Therapeutics, Inc. (“CymaBay”) for $4.3 billion in total equity value, or $3.9 billion net cash paid, adding investigational candidate seladelpar for the treatment of primary biliary cholangitis to Gilead’s Liver Disease portfolio.\nOther\n•\nAnnounced the appointment of Dietmar Berger, MD, PhD, as Chief Medical Officer effective January 2025.\nThe following table summarizes our key financial results for the year and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages and per share amounts)\n2024\n2023\nChange\nTotal revenues\n$\n28,754 \n$\n27,116 \n6 \n%\nNet income attributable to Gilead\n$\n480 \n$\n5,665 \n(92)\n%\nDiluted earnings per share attributable to Gilead\n$\n0.38 \n$\n4.50 \n(92)\n%\nTotal revenues increased 6% to $28.8 billion in 2024, compared to 2023, primarily due to higher sales in HIV, Oncology and Liver Disease, partially offset by lower sales of Veklury.\nNet income attributable to Gilead was $480 million and diluted earnings per share attributable to Gilead was $0.38 in 2024, compared to net income attributable to Gilead of $5.7 billion and $4.50 diluted earnings per share attributable to Gilead in 2023. The decrease was primarily due to:\n•\nA pre-tax IPR&D partial impairment charge of $4.2 billion related to Trodelvy IPR&D assets; and\n•\nHigher acquired IPR&D expenses, primarily $3.8 billion related to the acquisition of CymaBay; partially offset by \n•\nHigher product sales; and\n•\nLower income tax expense.\nPlease refer to “Results of Operations” below for further information on 2024 results.\nOutlook\nAs we look to 2025, we expect to see continued increases in demand for our products overall, bolstered by the growth of our HIV business. We look forward to the regulatory decisions for twice-yearly lenacapavir for HIV prevention in the U.S. under priority review as well as in the EU where we submitted a marketing authorization application in early 2025. We anticipate that strong, demand-led volume growth in 2025 will be offset by: (i) the effects of the Inflation Reduction Act, which is expected to increase our payment obligations under the redesigned Medicare Part D discount program; (ii) an expected decrease in our Veklury product sales reflecting lower rates of COVID-19-related hospitalizations; and (iii) the impact of the U.S. dollar strengthening against major foreign currencies.\nOur R&D portfolio includes over 100 pre-clinical and clinical-stage programs across our core therapeutic areas. We plan to continue investing in our business and R&D pipeline both internally and externally through partnerships and select business development transactions. For example, we entered into an agreement with LEO Pharma A/S in early 2025 to develop and commercialize their pre-clinical oral signal transducer and activator of transcription 6 programs for the potential treatment of inflammatory diseases. In addition, as part of our overall investment approach to fund the advancement of our pipeline and commercialization of our products, we will continue to focus on disciplined operating expense management.\nOur ability to deliver on our strategy and 2025 objectives is subject to a number of uncertainties. Please refer to Part I, Item 1A. Risk Factors of this Annual Report on Form 10-K for a listing of risk factors that could materially and adversely affect our results of operations and financial condition.\n38\nResults of Operations\nRevenues\nThe following table summarizes our Total revenues and period-over-period changes:\nYear Ended December 31, 2024\nYear Ended December 31, 2023\n(in millions)\nU.S.\nEurope\nRest of World\nTotal\nU.S.\nEurope\nRest of World\nTotal\nChange\nProduct sales:\nHIV\nBiktarvy\n$\n10,855 \n$\n1,509 \n$\n1,060 \n$\n13,423 \n$\n9,692 \n$\n1,253 \n$\n905 \n$\n11,850 \n13 \n%\nDescovy\n1,902 \n100 \n110 \n2,113 \n1,771 \n100 \n114 \n1,985 \n6 \n%\nGenvoya\n1,498 \n180 \n84 \n1,762 \n1,752 \n205 \n103 \n2,060 \n(14)\n%\nOdefsey\n957 \n290 \n41 \n1,288 \n1,012 \n294 \n44 \n1,350 \n(5)\n%\nSymtuza - Revenue share\n(1)\n450 \n130 \n12 \n592 \n382 \n133 \n13 \n529 \n12 \n%\nOther HIV\n(2)\n257 \n129 \n48 \n434 \n238 \n116 \n47 \n401 \n8 \n%\nTotal HIV\n15,918 \n2,339 \n1,355 \n19,612 \n14,848 \n2,102 \n1,226 \n18,175 \n8 \n%\nLiver Disease\nSofosbuvir/Velpatasvir\n(3)\n922 \n299 \n374 \n1,596 \n859 \n323 \n355 \n1,537 \n4 \n%\nVemlidy\n486 \n44 \n428 \n959 \n410 \n38 \n414 \n862 \n11 \n%\nOther Liver Disease\n(4)\n192 \n202 \n73 \n467 \n152 \n150 \n83 \n385 \n21 \n%\nTotal Liver Disease\n1,601 \n545 \n876 \n3,021 \n1,421 \n511 \n852 \n2,784 \n9 \n%\nVeklury\n892 \n284 \n623 \n1,799 \n972 \n408 \n805 \n2,184 \n(18)\n%\nOncology\nCell Therapy\nTecartus\n234 \n138 \n31 \n403 \n245 \n110 \n15 \n370 \n9 \n%\nYescarta\n662 \n666 \n242 \n1,570 \n811 \n547 \n140 \n1,498 \n5 \n%\nTotal Cell Therapy\n896 \n804 \n274 \n1,973 \n1,055 \n658 \n156 \n1,869 \n6 \n%\nTrodelvy\n902 \n294 \n119 \n1,315 \n777 \n217 \n68 \n1,063 \n24 \n%\nTotal Oncology\n1,798 \n1,098 \n393 \n3,289 \n1,833 \n875 \n224 \n2,932 \n12 \n%\nOther\nAmBisome\n44 \n276 \n212 \n533 \n43 \n260 \n189 \n492 \n8 \n%\nOther\n(5)\n255 \n34 \n68 \n356 \n261 \n40 \n66 \n367 \n(3)\n%\nTotal Other\n299 \n310 \n280 \n889 \n304 \n301 \n255 \n859 \n3 \n%\nTotal product sales\n20,508 \n4,576 \n3,526 \n28,610 \n19,377 \n4,197 \n3,361 \n26,934 \n6 \n%\nRoyalty, contract and other revenues\n82 \n58 \n4 \n144 \n62 \n114 \n7 \n182 \n(21)\n%\nTotal revenues\n$\n20,591 \n$\n4,634 \n$\n3,529 \n$\n28,754 \n$\n19,438 \n$\n4,310 \n$\n3,368 \n$\n27,116 \n6 \n%\n_______________________________\n(1)\n    Represents our revenue from cobicistat (“C”), emtricitabine (“FTC”) and tenofovir alafenamide (“TAF”) in Symtuza (darunavir/C/FTC/TAF), a fixed dose combination product commercialized by Janssen Sciences Ireland Unlimited Company (“Janssen”). See Note 7. Collaborations and Other Arrangements of the Notes to Consolidated Financial Statements\n \nincluded\n \nin\n \nPart II, Item 8 of this Annual Report on Form 10-K.\n(2)\n    Includes Atripla, Complera/Eviplera, Emtriva, Stribild, Sunlenca, Truvada and Tybost.\n(3)\n    Includes Epclusa and the authorized generic version of Epclusa sold by Gilead’s separate subsidiary, Asegua Therapeutics LLC (“Asegua”).\n(4)\n    Includes ledipasvir/sofosbuvir (Harvoni and the authorized generic version of Harvoni sold by Asegua), Hepcludex, Hepsera, Livdelzi, Sovaldi, Viread and Vosevi.\n(5)\n    Includes Cayston, Jyseleca, Letairis, Ranexa and Zydelig.\nHIV\nHIV product sales increased 8% to $19.6 billion in 2024, compared to 2023, primarily due to higher demand and higher average realized price. In particular:\n•\nBiktarvy sales increased primarily due to higher demand, including patients switching from Genvoya and other Gilead HIV products. To a lesser extent, the increase was also due to higher average realized price.\n•\nDescovy sales increased primarily due to higher demand, partially offset by lower average realized price.\n39\nLiver Disease\nLiver Disease product sales increased 9% to $3.0 billion in 2024, compared to 2023, primarily due to higher demand in products for chronic hepatitis C virus, HBV and, in Europe, chronic hepatitis delta virus, as well as the launch of Livdelzi for treatment of PBC.\nVeklury\nVeklury product sales decreased 18% to $1.8 billion in 2024, compared to 2023, primarily due to decreased rates of COVID-19-related hospitalizations.\nOncology\nCell Therapy\nCell Therapy product sales increased 6% to $2.0 billion in 2024, compared to 2023, primarily due to increased demand outside the U.S. for Yescarta and Tecartus and higher average realized price, partially offset by lower demand in the U.S.\nTrodelvy\nTrodelvy product sales increased 24% to $1.3 billion in 2024, compared to 2023, primarily due to higher demand across all regions.\nGross-to-Net Deductions\nA substantial portion of our product sales is subject to significant discounts from list price, including government and commercial rebates and chargebacks, as well as other deductions, including patient co-pay assistance, cash discounts for prompt payment, distributor fees, and sales return provisions. These deductions to product sales are generally referred to as gross-to-net deductions and are primarily a function of product sales volume, product mix, contractual or statutory discounts and estimated payer mix. \nRebates and chargebacks are based on contractual arrangements or statutory requirements and include amounts due to payers and healthcare providers under various programs. These amounts may vary by product, payer and individual plans. Providers qualified under certain programs can purchase our products through wholesalers or other distributors at a discount. The wholesalers or distributors then charge the discount back to us.\nOther gross-to-net deductions include patient co-pay assistance, cash discounts for prompt payment, distributor fees that we pay under our inventory management agreements with our significant U.S. wholesalers and are based on contractually-determined fixed percentage of sales, and sales return provisions.\nOur gross-to-net deductions totaled $17.8 billion, or 38%, of gross product sales in 2024, compared to $16.4 billion, or 38%, of gross product sales in 2023. Of the $17.8 billion in 2024, $15.5 billion, or 33%, of gross product sales was related to rebates and chargebacks, and $2.3 billion, or 5%, was related to other gross-to-net deductions. Of the $16.4 billion in 2023, $14.3 billion, or 33%, of gross product sales was related to rebates and chargebacks, and $2.2 billion, or 5%, was related to other gross-to-net deductions. \nCurrent year gross-to-net deductions as a percent of gross product sales may not be indicative of future results.\nForeign Currency Exchange Impact\nWe generally face exposure to movements in foreign currency exchange rates, primarily in the Euro. We use foreign currency exchange contracts to hedge a portion of our foreign currency exposures.\nApproximately 27% and 26% of our product sales were denominated in foreign currencies during 2024 and 2023, respectively. Foreign currency exchange, net of hedges, had an unfavorable impact on our total product sales of $163 million in 2024, based on a comparison using foreign currency exchange rates from 2023.\n40\nCosts and Expenses\nThe following table summarizes our costs and expenses and period-over-period changes: \nYear Ended December 31,\n(in millions, except percentages)\n2024\n2023\nChange\nCost of goods sold\n$\n6,251 \n$\n6,498 \n(4)\n%\nProduct gross margin\n78.2 \n%\n75.9 \n%\n228 bps\nResearch and development expenses\n$\n5,907 \n$\n5,718 \n3 \n%\nAcquired in-process research and development expenses\n$\n4,663 \n$\n1,155 \nNM\nIn-process research and development impairments\n$\n4,180 \n$\n50 \nNM\nSelling, general and administrative expenses\n$\n6,091 \n$\n6,090 \n— \n%\n_______________________________\nNM - Not Meaningful\nProduct Gross Margin\nProduct gross margin increased to 78.2% in 2024, compared to 2023, primarily due to prior year restructuring expenses related to changes in our manufacturing strategy, which resulted in write-offs of certain manufacturing facilities, related inventories and other costs totaling $479 million.\nResearch and Development Expenses\nResearch and development expenses consist primarily of personnel costs including salaries, benefits and stock-based compensation expense, infrastructure, materials and supplies and other support costs, research and clinical studies performed by contract research organizations and our collaboration partners and other outside services.\nWe manage our R&D expenses by identifying the R&D activities we expect to be performed during a given period and then prioritizing efforts based on scientific data, probability of successful technical development and regulatory approval, market potential, available human and capital resources and other considerations. We regularly review our R&D activities based on unmet medical need and, as necessary, reallocate resources among our internal R&D portfolio and external opportunities that we believe will best support the long-term growth of our business. We do not track total R&D expenses by product candidate, therapeutic area or development phase.\nThe following table provides a breakout of expenses by major cost type:\nYear Ended December 31,\n(in millions)\n2024\n2023\nPersonnel, infrastructure and other support costs\n$\n3,555 \n$\n3,204 \nClinical studies and other costs\n2,352 \n2,514 \nTotal\n$\n5,907 \n$\n5,718 \nResearch and development expenses increased 3% to $5.9 billion in 2024, compared to 2023. \nPersonnel, infrastructure and other support costs increased mainly due to higher compensation expenses, increases in restructuring costs, and stock-based compensation expenses and other integration costs related to the acquisition of CymaBay. \nClinical studies and other costs decreased mainly due to timing of clinical activities, including the wind-down of studies for magrolimab and obeldesivir for treatment of COVID-19, and higher R&D reimbursements, partially offset by increases related to the progression of other studies.\nAcquired In-Process Research and Development Expenses\nAcquired in-process research and development expenses are recorded when incurred and reflect costs of externally-developed IPR&D projects, acquired directly in a transaction other than a business combination, that do not have an alternative future use, including upfront and pre-commercialization milestone payments related to various collaborations and the costs of rights to IPR&D projects.\n41\nAcquired in-process research and development expenses were $4.7 billion in 2024, primarily related to the following transactions: \n•\n$3.8 billion CymaBay acquisition;\n•\n$320 million Janssen Pharmaceutica NV future royalty obligation extinguishment related to seladelpar;\n•\n$100 million Arcus Biosciences, Inc. collaboration continuation fee;\n•\n$68 million Arcellx, Inc. (“Arcellx”) collaboration milestones met; and\n•\n$47 million Tmunity Therapeutics, Inc. (“Tmunity”) acquisition milestones met.\nAcquired in-process research and development expenses were $1.2 billion in 2023, primarily related to the following transactions:\n•\n$313 million Arcellx collaboration;\n•\n$269 million Tmunity acquisition; \n•\n$218 million XinThera, Inc. acquisition;\n•\n$97 million Assembly Biosciences, Inc. collaboration; and\n•\n$60 million Compugen Ltd. licensing agreement.\nSee Note 6. Acquisitions and Note 7. Collaborations and Other Arrangements of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K for additional information.\nIn-Process Research and Development Impairments\nAs of December 31, 2023, our indefinite-lived IPR&D intangible asset related to Trodelvy for metastatic NSCLC was approximately $5.9 billion. In addition to NSCLC, Trodelvy is being explored for potential investigational use in a range of tumor types where Trop-2 is highly expressed. Gilead’s clinical development program in metastatic NSCLC includes ongoing Phase 2 and registrational Phase 3 studies for Trodelvy as a first- or second-line indication.\nIn January 2024, we received data from our Phase 3 EVOKE-01 study of Trodelvy evaluating sacituzumab govitecan-hziy (“SG”) indicating that the study did not meet its primary endpoint of overall survival in previously treated metastatic NSCLC, thus triggering a review for potential impairment of the NSCLC IPR&D intangible asset. Based on our evaluation of the study results and all other data currently available, and in connection with the preparation of the financial statements for the first quarter, we performed an interim impairment test and determined that the revised estimated fair value of the NSCLC IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $2.4 billion in In-process research and development impairments on our Consolidated Statements of Operations during the first quarter of 2024.\nIn September 2024, based on discussions with regulators and external opinion leaders and the completed evaluation of the Phase 3 EVOKE-01 study data, we made a strategic decision to discontinue our clinical development program in metastatic NSCLC for Trodelvy in the second-line indication. This decision triggered a review for potential impairment of the NSCLC IPR&D intangible asset. Based on our evaluation, and in connection with the preparation of the financial statements for the third quarter, we performed an interim impairment test and determined that the revised estimated fair value of the NSCLC IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $1.8 billion in In-process research and development impairments on our Consolidated Statements of Operations during the third quarter of 2024.\nTo arrive at the revised estimated fair value, we used a probability-weighted income approach that discounts expected future cash flows to present value, which requires the use of Level 3 fair value measurements and inputs, including critical estimated inputs, such as: revenues and operating profits related to the planned utilization of SG in NSCLC, which, include inputs such as addressable patient population, projected market share, treatment duration, and the life of the potential commercialized product; the probability of technical and regulatory success; the time and resources needed to complete the development and approval of SG in NSCLC; an appropriate discount rate based on the estimated weighted-average cost of capital for companies with profiles similar to our profile; and risks related to the viability of and potential alternative treatments in any future target markets. Our revised discounted cash flows for the March 31, 2024 fair value estimation primarily reflected the smaller addressable market that Trodelvy could serve among metastatic NSCLC patients and a delay in expected launch timing for second-line plus patients. Our revised discounted cash flows for the September 30, 2024 fair value estimation primarily reflected the removal of cash flows associated with second-line plus patients.\nThere were no IPR&D impairment charges in the three months ended December 31, 2024. Therefore, total In-process research and development impairments on our Consolidated Statements of Operations were $4.2 billion in 2024, and the revised estimated fair value of the NSCLC IPR&D intangible asset was $1.8 billion as of December 31, 2024, which reflects Trodelvy’s opportunity as a combination therapy in first-line metastatic NSCLC patients supported by its ongoing Phase 3 clinical trial in this patient population.\n42\nIn 2023, In-process research and development impairments included $50 million related to a partial impairment charge on our bulevirtide IPR&D intangible asset due to a change in assumptions primarily around probability and timing of regulatory approval.\nIf future events result in adverse changes in the key assumptions used in determining fair value, including the timing of product launches, information on the competitive landscape of treatments in this indication, changes to the probability of technical or regulatory success, failure to obtain anticipated regulatory approval or discount rate, among others, additional impairments may be recorded and could be material to our financial statements.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses are recorded when incurred and consist primarily of personnel costs, facilities and overhead costs, and selling, marketing and advertising expenses, as well as other general and administrative costs related to finance, human resources, legal and other administrative activities.\nThe following table summarizes our Selling, general and administrative expenses and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages)\n2024\n2023\nChange\nSelling and marketing expenses\n$\n3,453 \n$\n3,272 \n6 \n%\nGeneral and administrative expenses\n2,638 \n2,818 \n(6)\n%\nSelling, general and administrative expenses\n$\n6,091 \n$\n6,090 \n— \n%\nSelling, general and administrative expenses were $6.1 billion and remained relatively flat in 2024, compared to 2023.\nSelling and marketing expenses increased mainly due to:\n•\nmedia spend across multiple therapeutic areas, including launch preparation activities for lenacapavir for the investigational use of HIV PrEP as well as for Livdelzi;\n•\nintegration costs related to the acquisition of CymaBay; and \n•\nhigher restructuring costs; partially offset by\n•\na decrease in our allocation of the branded prescription drug fee. \nGeneral and administrative expenses decreased mainly due to lower expenses related to legal matters, partially offset by stock-based compensation expenses and other integration costs related to the acquisition of CymaBay, and higher restructuring costs.\nInterest Expense and Other (Income) Expense, Net\nThe following table summarizes our Interest expense and Other (income) expense, net and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages)\n2024\n2023\nChange\nInterest expense\n$\n977 \n$\n944 \n3 \n%\nOther (income) expense, net\n$\n(6)\n$\n(198)\n(97)\n%\nLoss from equity securities, net\n$\n274 \n$\n167 \n64 \n%\nInterest income\n$\n(281)\n$\n(376)\n(25)\n%\nOther, net\n$\n2 \n$\n11 \n(84)\n%\nInterest expense increased 3% to $977 million in 2024, compared to 2023, primarily due to a higher average interest rate on long-term debt. See Note 11. Debt and Credit Facilities of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K for additional information on our long-term debt and related interest rates.\nUnfavorable movements in Other (income) expense, net in 2024, compared to 2023, primarily related to higher net losses from equity securities and lower interest income due to lower average cash balances.\n43\nIncome Taxes\nThe following table summarizes our Income tax expense and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages)\n2024\n2023\nChange\nIncome before income taxes\n$\n690 \n$\n6,859 \n$\n(6,169)\nIncome tax expense\n$\n211 \n$\n1,247 \n$\n(1,036)\nEffective tax rate\n30.5 \n%\n18.2 \n%\n12.4 \n%\nOur effective tax rate increased in 2024, compared to 2023, primarily due to:\n•\nThe non-deductible acquired IPR&D expense recorded in connection with our first quarter 2024 acquisition of CymaBay; \n•\nA decrease in unrecognized tax benefits as a result of reaching agreement with a tax authority on certain tax positions in 2023; partially offset by\n•\nA non-recurring tax benefit associated with a legal entity restructuring;\n•\nA decrease in state deferred tax liabilities associated with the $4.2 billion NSCLC IPR&D intangible asset impairment charge; \n•\nSettlements with tax authorities in 2024; and\n•\nRemeasurement of certain deferred tax liabilities related to acquired intangible assets.\nThe Organisation for Economic Co-operation and Development has a framework to implement a global minimum corporate tax of 15% for companies with global revenues and profits above certain thresholds (referred to as Pillar Two), with certain aspects effective January 1, 2024 and other aspects effective January 1, 2025. Certain countries in which we operate have adopted Pillar Two legislation and other countries are in the process of introducing legislation to implement Pillar Two. We do not expect Pillar Two to have a material impact on our results of operations, liquidity or capital resources.\nLiquidity and Capital Resources\nWe regularly analyze our ability to generate and obtain adequate amounts of cash to meet our short-term and long-term requirements and plans. Our capital priorities include: (i) investing in our business and R&D pipeline, (ii) continuing select partnerships and business development transactions, (iii) growing our dividend over time, and (iv) repurchasing shares to offset dilution and opportunistically reduce share count. Based on our evaluation of our current position of liquidity, available capital resources and our material cash requirements, we believe that we can satisfy our capital needs for the next 12 months and the foreseeable future.\nLiquidity\nCash and cash equivalents were $10.0 billion as of December 31, 2024. The table below summarizes our cash flow activities, followed by our analysis of changes and trends:\nYear Ended December 31,\n(in millions)\n2024\n2023\nNet cash provided by (used in):\n \n \nOperating activities\n$\n10,828 \n$\n8,006 \nInvesting activities\n(3,449)\n(2,265)\nFinancing activities\n(3,433)\n(5,125)\nEffect of exchange rate changes on cash and cash equivalents\n(40)\n57 \nNet change in cash and cash equivalents\n$\n3,906 \n$\n673 \nOperating Activities\nNet cash provided by operating activities is our primary source of funds, driven mainly by collections on product sales, partially offset by operating spend. Changes in working capital balances, generally associated with the timing of collections and payments, as well as unanticipated payments related to litigation, taxes or other matters, may create some variation in any given year. Net cash provided by operating activities increased in 2024 mainly due to higher collections on sales and lower income tax and operating payments. Net cash provided by operating activities included $0.5 billion in HIV antitrust litigation settlement payments in 2023, as well as transition tax payments associated with the 2017 Tax Cuts and Jobs Act of $1.2 billion and $0.9 billion in 2024 and 2023, respectively. \n44\nWe expect Net cash provided by operating activities in 2025 to include the effect of an approximately $1.3 billion transition tax payment.\nInvesting Activities\nNet cash used in investing activities was notably higher in 2024 primarily related to the $3.9 billion net cash payment for the CymaBay acquisition, partially offset by proceeds from the liquidation of marketable debt securities to fund that acquisition. Net cash used in investing activities may vary in any given year depending on the favorability of strategic opportunities for the business.\nFinancing Activities\nNet cash used in financing activities in 2024 was primarily the result of $2.0 billion for debt repayments, $3.9 billion for dividend payments and $1.2 billion for common stock repurchases, partially offset by $3.5 billion in net proceeds from the issuance of senior unsecured notes in November 2024. In 2023, we utilized cash of $2.3 billion for debt repayments, $3.8 billion for dividend payments and $1.0 billion for common stock repurchases, partially offset by $2.0 billion in net proceeds from the issuance of senior unsecured notes in September 2023. The year-over-year changes were due mostly to higher cash provided by new debt issuances. Net cash used in financing activities may vary in any given year depending primarily on the timing of debt repayments and proceeds from debt offerings and the amount of common stock repurchases. \nSubsequently, in February 2025, we repaid $1.75 billion of principal balance related to our senior unsecured notes due February 2025. Also, on February 11, 2025, we announced that our Board of Directors declared a quarterly dividend of $0.79 per share of our common stock, with a payment date of March 28, 2025 to all stockholders of record as of the close of business on March 14, 2025. Future dividends are subject to declaration by our Board of Directors.\nCapital Resources\nAs of December 31, 2024, our material cash requirements for the operations of our business consisted primarily of the current and long-term liabilities noted on our Consolidated Balance Sheets as well as other commitments, including the following notable items:\n•\npayments of outstanding borrowings, including interest on long-term debt (see Note 11. Debt and Credit Facilities);\n•\nincome tax payments, including the remaining obligations for the one-time repatriation transition tax from the Tax Cuts and Jobs Act, as well as potential payments related to uncertain tax positions (see Note 16. Income Taxes);\n•\npayments of operating lease obligations (see Note 12. Leases);\n•\npayments related to certain unconditional inventory purchase obligations and capital expenditures. There were no changes to such commitments in the current year that would have a material impact on our ability to meet short- or long-term cash requirements;\n•\npayments related to our acquisitions, including contingent consideration (see Notes 3. Fair Value Measurements and 6. Acquisitions); and\n•\nmilestone and other payments related to collaboration agreements (see Note 7. Collaborations and Other Arrangements). We are contractually obligated to make payments to our collaboration partners upon the achievement of various development, regulatory and commercial milestones as well as royalty payments. These payments are contingent upon the occurrence of various future events, substantially all of which have a high degree of uncertainty of occurring. If milestones for multiple products covered by these arrangements happen to be reached in the same reporting period, the aggregate cash requirement could be material. It is not possible to predict with reasonable certainty whether these milestones will be achieved or the timing for achievement. As such, these obligations are not recorded on our Consolidated Balance Sheets until the events triggering milestone payments occur.\nOur anticipated sources of funds to satisfy the above material cash requirements for the short- and long-term include our current balances of cash and cash equivalents as well as future cash flows from operations. If needed, we also have the ability to utilize our $2.5 billion revolving credit facility (see Note 11. Debt and Credit Facilities) and access other external capital through future debt or equity offerings.\nWhile we are not aware of any trends at this time that are reasonably likely to materially impact our future cash requirements and sources of funds, such requirements and funds will depend on many factors, including but not limited to the following:\n•\nthe commercial performance of our current and future products;\n•\nthe progress and scope of our R&D efforts and those of our collaboration partners, including preclinical studies and clinical trials;\n•\nthe cost, timing and outcome of regulatory reviews;\n•\nthe expansion of our sales and marketing capabilities;\n45\n•\nthe acquisition of additional manufacturing capabilities or office facilities on acceptable terms;\n•\nthe acquisition of other companies or new products on acceptable terms;\n•\nthe issuance of new debt or equity in the market on acceptable terms;\n•\nthe favorability of repaying certain long-term debt obligations prior to maturity dates;\n•\nfuture dividends subject to declaration by our Board of Directors (see “Dividends” in Part II, Item 5 of this 10-K);\n•\nthe favorability of repurchasing shares (see “Issuer Purchases of Equity Securities” in Part II, Item 5 of this 10-K);\n•\nthe establishment of additional collaborative relationships with other companies on acceptable terms; and\n•\ncosts associated with the defense, settlement and adverse results of government investigations and litigation (see Note 13. Commitments and Contingencies).\nCritical Accounting Estimates\nSee Note 1. Summary of Business and Significant Accounting Policies of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K for information about our significant accounting policies and how estimates are involved in the preparation of our financial statements. We believe the following reflect the critical accounting estimates used in the preparation of our Consolidated Financial Statements.\nRebates and Chargebacks \nRebates and chargebacks are determined using a complex estimation process which requires significant judgment by management in part due to the lag between the date of the product sales and the date the related rebates or chargeback claims are settled. Rebates and chargebacks are based on contractual arrangements or statutory requirements and include amounts due to payers and healthcare providers under various programs. These amounts may vary by product, payer and individual plans. Rebates and chargebacks are estimated primarily based on product sales, and expected payer mix and discount rates, which require significant estimates and judgment. In developing our estimates of rebates and chargebacks, we consider the following: \n•\nproduct sales, including product mix and pricing;\n•\nhistorical and estimated payer mix;\n•\nstatutory discount requirements and contractual terms;\n•\nhistorical claims experience and processing time lags;\n•\nestimated patient population;\n•\nknown market events or trends; \n•\nmarket research;\n•\nchannel inventory data obtained from our major U.S. wholesalers; and\n•\nother pertinent internal or external information.\nThe following table summarizes the consolidated activities and ending balances in our rebates and chargebacks accounts, including adjustments made relating to previous years’ sales as a result of changes in estimates:\n(in millions)\nBalance at Beginning of Year\nDecrease/(Increase) to Product Sales\nPayments\nBalance at End of Year\nYear ended December 31, 2024:\n \n \n \n \nActivity related to 2024 sales\n$\n— \n$\n15,808 \n$\n(11,508)\n$\n4,300 \nActivity related to sales prior to 2024\n4,493 \n(350)\n(3,797)\n345 \nTotal\n$\n4,493 \n$\n15,458 \n$\n(15,305)\n$\n4,646 \nYear ended December 31, 2023:\n \n \n \n \nActivity related to 2023 sales\n$\n— \n$\n14,577 \n$\n(10,389)\n$\n4,187 \nActivity related to sales prior to 2023\n4,028 \n(302)\n(3,421)\n306 \nTotal\n$\n4,028 \n$\n14,275 \n$\n(13,810)\n$\n4,493 \nWe assess and update our estimates each reporting period to reflect actual claims and other current information. Historically, our actual rebates and chargebacks claimed for prior years have varied by less than 5% from our estimates. However, historical results are not indicative of future results.\n46\nValuation of Intangible Assets\nDetermining the fair values of intangible assets, whether as part of a business combination or impairment assessment, involves the use of a probability-weighted income approach that discounts expected future cash flows to present value and requires the use of critical estimated inputs, including:\n•\nidentification of product candidates with sufficient substance requiring separate recognition;\n•\nestimates of projected future cash flows, including revenues and operating profits related to the products or product candidates, which, for example, include significant inputs such as addressable patient population, treatment duration and projected market share;\n•\nthe probability of technical and regulatory success for unapproved product candidates considering their stages of development;\n•\nthe time and resources needed to complete the development and approval of product candidates;\n•\nan appropriate discount rate based on the estimated weighted-average cost of capital for companies with profiles similar to our profile, representing the rate that market participants would use to value the intangible assets;\n•\nthe life of the potential commercialized products and associated risks, including the inherent difficulties and uncertainties in developing a product candidate such as obtaining FDA and other regulatory approvals; and\n•\nrisks related to the viability of and potential alternative treatments in any future target markets.\nThese estimates are subject to uncertainty due to the high rate of failure inherent in the discovery and development of new products; delays that can occur in development, approval and product launch processes; unanticipated decisions made by regulatory agencies; advent of competing products; unexpected changes in U.S. and global financial markets and other unanticipated events and circumstances. If future events result in adverse changes in the critical assumptions used in determining fair value, impairment charges on our intangible assets may be recorded and could be material to our financial statements. For example, in 2024, upon receiving data from our Phase 3 EVOKE-01 study of Trodelvy, which indicated the study did not meet its primary endpoint, and further discussions with regulators and external opinion leaders and completion of the evaluation of the trial data which led to the strategic decision to end the second-line indication program, we recognized in aggregate $4.2 billion in impairment charges related to our NSCLC IPR&D intangible asset, reflecting, amongst other changes, the removal of expected future cash flows associated with second-line plus patients from our valuation model.\nLegal Contingencies\nWe are a party to various legal actions. Certain significant matters are described in Note 13. Commitments and Contingencies of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. \nCritical inputs to the accruals recorded and disclosures provided in relation to these matters include the probability of a certain outcome of the case, the determination as to whether an exposure is reasonably estimable and the amount of potential exposure. These inputs are subject to uncertainty due to changes in the legal facts and circumstances of the case, status of the proceedings, applicable law, the views of legal counsel and the views of any judges or jury involved in the case. Upon the final resolution of such matters, it is possible that there may be a loss in excess of the amount recorded, and such amounts could have a material adverse effect on our results of operations, cash flows or financial position. We periodically reassess these matters when additional information becomes available and adjust our estimates and assumptions when facts and circumstances indicate the need for any changes. For example, in the second quarter of 2023, we recorded an accrual of $525 million in Other current liabilities on our Consolidated Balance Sheets for settlements with certain plaintiffs in the HIV antitrust litigation, which we paid in the second half of 2023. Also, we accrued approximately $200 million for a potential settlement with the U.S. Attorney’s Office for the Southern District of New York, on our Consolidated Balance Sheets as of December 31, 2024.\nIncome Taxes\nWe are subject to income taxes in the U.S. and various foreign jurisdictions, including Ireland. Critical inputs in determining our provision for income taxes and related tax balances include forecasts of our future income and expenses, potential tax planning strategies and determination of the probability of certain tax positions being sustained upon examination by tax authorities. These inputs are subject to uncertainty due to potential changes in facts and circumstances, economic and political conditions, changes to existing tax laws and new regulations or interpretations by tax authorities. Changes in these conditions could have a material adverse impact on our results of operations and financial position. See Note 16. Income Taxes of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K for additional information. \n47",
  "item2": null
}