{
  "source_file": "gild-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis is intended to provide material information around events and uncertainties known to management that are relevant to an assessment of the financial condition and results of operations of Gilead and should therefore be read in conjunction with our audited Consolidated Financial Statements and the related notes thereto and other disclosures included as part of our Annual Report on Form 10-K for the year ended December 31, 2024 and our unaudited Condensed Consolidated Financial Statements for the three and nine months ended September 30, 2025 and the related notes thereto and other disclosures (including the disclosures under Part II, Item 1A. Risk Factors) included in this Quarterly Report on Form 10-Q.\nManagement Overview\nGilead Sciences, Inc. (including its consolidated subsidiaries, referred to as “Gilead,” the “company,” “we,” “our” or “us”) is a biopharmaceutical company that has pursued and achieved breakthroughs in medicine for more than three decades, with the goal of creating a healthier world for all people. We are committed to advancing innovative medicines to prevent and treat life-threatening diseases, including HIV, viral hepatitis, coronavirus disease 2019 (“COVID-19”), cancer and inflammation. We operate in more than 35 countries worldwide, with headquarters in Foster City, California.\nKey Business Updates\nThe following represents a summary of notable business updates and events since the filing of our Annual Report on Form 10-K for the year ended December 31, 2024, including certain items from our press releases, which readers are encouraged to review in full as available on our website at www.gilead.com. The content on the referenced website does not constitute a part of and is not incorporated by reference into this Quarterly Report on Form 10-Q.\nVirology\n•\nAnnounced settlement agreements to resolve Biktarvy patent litigation with generic manufacturers Lupin Ltd., Cipla Ltd. and Laurus Labs Ltd. Under the agreements, the earliest date the three generic manufacturers can market a generic version of full dose Biktarvy in the U.S. is April 1, 2036, subject to standard acceleration provisions. This is more than two years later than our previous loss of exclusivity projection for Biktarvy (December 2033). \n•\nReceived a strong recommendation for the use of twice-yearly injectable Yeztugo (lenacapavir) for HIV pre-exposure prophylaxis (“PrEP”) in the new U.S. Centers for Disease Control and Prevention guidelines.\n•\nAnnounced a partnership with the U.S. State Department and the U.S. President’s Emergency Plan for AIDS Relief (“PEPFAR”) to deliver lenacapavir for HIV PrEP for up to two million people over three years in countries supported by both PEPFAR and the Global Fund.\n•\nReceived European Commission (“EC”) marketing authorization for Yeytuo (lenacapavir) for use as PrEP to reduce the risk of sexually acquired HIV-1 in adults and adolescents with increased HIV-1 acquisition risk. \n•\nReceived U.S. Food and Drug Administration (“FDA”) approval for Yeztugo (lenacapavir) for PrEP to reduce the risk of sexually acquired HIV in adults and adolescents weighing at least 35kg. Yeztugo is the first and only twice-yearly HIV PrEP option available in the U.S.\n•\nAnnounced that FDA had placed a clinical hold on the HIV treatment trials of GS-1720 and/or GS-4182, including the WONDERS-1 and WONDERS-2 trials. These drug candidates are investigational and not approved anywhere globally.\nOncology\n•\nAnnounced that our Phase 3 ASCENT-07 study of Trodelvy evaluating sacituzumab govitecan-hziy (“SG”) as a first-line treatment post-endocrine therapy in hormone receptor-positive, human epidermal growth factor receptor 2-negative (“HR+/HER2-”) metastatic breast cancer patients did not meet the primary endpoint of progression-free survival. Overall survival is a key secondary endpoint and was not mature at the time of the primary analysis; however, an early trend was observed favoring patients treated with Trodelvy compared to chemotherapy. \n•\nPresented Phase 3 ASCENT-03 data for Trodelvy in 1L metastatic triple-negative breast cancer (“mTNBC”) patients who are not candidates for PD-1/PD-L1 checkpoint inhibitors at the 2025 European Society for Medical Oncology Congress. Trodelvy is not approved in this setting. \n•\nEntered into a collaboration with Shenzhen Pregene Biopharma Co., Ltd. (“Pregene”) to develop next-generation in vivo therapies.\n•\nAnnounced the acquisition of Interius BioTherapeutics, Inc. (“Interius”), a privately held biotechnology company developing in vivo chimeric antigen receptor therapeutics, for approximately $350 million.\n29\n•\nPresented results from the Phase 3 ASCENT-04 trial evaluating Trodelvy plus Keytruda in 1L PD-L1+ mTNBC at the American Society of Clinical Oncology meeting. Trodelvy is not approved in this setting.\n•\nEntered into an exclusive option and license agreement with Kymera Therapeutics, Inc. to develop novel oral molecular glue CDK2 degraders with broad oncology treatment potential. \nInflammation\n•\nReceived conditional marketing authorization from the EC for seladelpar for the treatment of primary biliary cholangitis (“PBC”) in combination with ursodeoxycholic acid (“UDCA”) in adults who have an inadequate response to UDCA alone, or as monotherapy in those unable to tolerate UDCA.\nCorporate\n•\nAnnounced ground-breaking on a new Pharmaceutical Development and Manufacturing Technical Development Center in Foster City, California as part of a planned $32 billion investment in the U.S. through 2030. \nKey Financial Results\nThe following table summarizes our key financial results for the period and period-over-period changes:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n(in millions, except percentages and per share amounts)\n2025\n2024\nChange\n2025\n2024\nChange\nTotal revenues\n$\n7,769 \n$\n7,545 \n3 \n%\n$\n21,518 \n$\n21,185 \n2 \n%\nNet income (loss) attributable to Gilead\n$\n3,052 \n$\n1,253 \nNM\n$\n6,327 \n$\n(1,303)\nNM\nDiluted earnings (loss) per share attributable to Gilead\n$\n2.43 \n$\n1.00 \nNM\n$\n5.04 \n$\n(1.04)\nNM\n_______________________________\nNM - Not Meaningful\nTotal revenues increased 3% to $7.8 billion for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to higher royalty, contract and other revenues, as well as higher HIV and Liver Disease product sales, partially offset by lower Veklury and Cell Therapy product sales.\nTotal revenues increased 2% to $21.5 billion for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to higher HIV and Liver Disease product sales, as well as higher royalty, contract and other revenues. These increases were partially offset mainly by lower Veklury and Cell Therapy product sales.\nNet income attributable to Gilead was $3.1 billion and diluted earnings per share attributable to Gilead was $2.43 for the three months ended September 30, 2025, compared to net income attributable to Gilead of $1.3 billion and diluted earnings per share attributable to Gilead of $1.00 for the same period in 2024. The increase was primarily due to:\n•\nA pre-tax in-process research and development (“IPR&D”) partial impairment charge of $1.8 billion during the three months ended September 30, 2024 related to assets acquired by Gilead from Immunomedics, Inc. (“Immunomedics”), which did not repeat in the current period;\n•\nHigher royalty, contract and other revenues;\n•\nLower acquired IPR&D expenses; and\n•\nHigher net unrealized gains on equity securities; partially offset by\n•\nHigher income tax expense.\nNet income attributable to Gilead was $6.3 billion and diluted earnings per share attributable to Gilead was $5.04 for the nine months ended September 30, 2025, compared to net loss attributable to Gilead of $1.3 billion and diluted loss per share attributable to Gilead of $1.04 for the same period in 2024. The increase was primarily due to:\n•\nLower pre-tax IPR&D partial impairment charges, with $190 million during the nine months ended September 30, 2025 related to assets acquired from MYR GmbH (“MYR”) compared to $4.2 billion during the nine months ended September 30, 2024 related to assets acquired from Immunomedics;\n•\nA $3.9 billion acquired IPR&D expense related to the acquisition of CymaBay Therapeutics, Inc. (“CymaBay”) during the three months ended March 31, 2024, which did not repeat in the current period;\n•\nHigher royalty, contract and other revenues; and\n•\nHigher net unrealized gains on equity securities; partially offset by\n•\nHigher income tax expense.\n30\nPlease refer to “Results of Operations” below for further information on results for the three and nine months ended September 30, 2025.\nResults of Operations\nRevenues\nThe following table summarizes our Total revenues and period-over-period changes:\nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\n(in millions, except percentages)\nU.S.\nEurope\nRest of World\nTotal\nU.S.\nEurope\nRest of World\nTotal\nChange\nProduct sales:\nHIV\nBiktarvy\n$\n2,940 \n$\n427 \n$\n320 \n$\n3,686 \n$\n2,826 \n$\n375 \n$\n272 \n$\n3,472 \n6 \n%\nDescovy\n652 \n23 \n25 \n701 \n534 \n24 \n28 \n586 \n20 \n%\nGenvoya\n323 \n34 \n19 \n377 \n384 \n44 \n21 \n449 \n(16)\n%\nOdefsey\n206 \n61 \n10 \n277 \n248 \n69 \n9 \n326 \n(15)\n%\nSymtuza - Revenue share\n(1)\n95 \n26 \n3 \n124 \n103 \n33 \n3 \n139 \n(11)\n%\nOther HIV\n(2)\n82 \n22 \n9 \n112 \n65 \n26 \n9 \n100 \n12 \n%\nTotal HIV\n4,299 \n592 \n386 \n5,277 \n4,161 \n570 \n342 \n5,073 \n4 \n%\nLiver Disease\nSofosbuvir/Velpatasvir\n(3)\n146 \n65 \n97 \n309 \n222 \n67 \n96 \n385 \n(20)\n%\nVemlidy\n136 \n12 \n132 \n280 \n126 \n11 \n95 \n232 \n21 \n%\nOther Liver Disease\n(4)\n132 \n81 \n17 \n231 \n45 \n54 \n17 \n116 \n99 \n%\nTotal Liver Disease\n414 \n158 \n247 \n819 \n393 \n132 \n207 \n733 \n12 \n%\nVeklury\n140 \n43 \n93 \n277 \n393 \n81 \n219 \n692 \n(60)\n%\nOncology\nCell Therapy\nTecartus\n40 \n35 \n8 \n83 \n63 \n29 \n6 \n98 \n(15)\n%\nYescarta\n123 \n151 \n75 \n349 \n145 \n182 \n60 \n387 \n(10)\n%\nTotal Cell Therapy\n163 \n186 \n83 \n432 \n208 \n211 \n66 \n485 \n(11)\n%\nTrodelvy\n221 \n89 \n47 \n357 \n226 \n80 \n26 \n332 \n7 \n%\nTotal Oncology\n384 \n275 \n129 \n788 \n433 \n291 \n92 \n816 \n(3)\n%\nOther\nAmBisome\n2 \n69 \n52 \n123 \n6 \n71 \n52 \n130 \n(5)\n%\nOther\n(5)\n34 \n7 \n20 \n61 \n47 \n8 \n16 \n71 \n(14)\n%\nTotal Other\n36 \n76 \n72 \n184 \n53 \n80 \n68 \n201 \n(8)\n%\nTotal product sales\n5,274 \n1,144 \n928 \n7,345 \n5,433 \n1,154 \n928 \n7,515 \n(2)\n%\nRoyalty, contract and other revenues\n7 \n411 \n5 \n424 \n17 \n13 \n1 \n30 \nNM\nTotal revenues\n$\n5,281 \n$\n1,555 \n$\n933 \n$\n7,769 \n$\n5,450 \n$\n1,167 \n$\n929 \n$\n7,545 \n3 \n%\n31\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\n(in millions)\nU.S.\nEurope\nRest of World\nTotal\nU.S.\nEurope\nRest of World\nTotal\nChange\nProduct sales:\nHIV\nBiktarvy\n$\n8,212 \n$\n1,231 \n$\n922 \n$\n10,366 \n$\n7,726 \n$\n1,110 \n$\n814 \n$\n9,649 \n7 \n%\nDescovy\n1,791 \n67 \n81 \n1,939 \n1,339 \n75 \n82 \n1,496 \n30 \n%\nGenvoya\n950 \n114 \n54 \n1,118 \n1,088 \n138 \n66 \n1,292 \n(13)\n%\nOdefsey\n642 \n184 \n30 \n857 \n705 \n217 \n30 \n952 \n(10)\n%\nSymtuza - Revenue share\n(1)\n265 \n88 \n9 \n362 \n338 \n101 \n9 \n448 \n(19)\n%\nOther HIV\n(2)\n198 \n85 \n28 \n310 \n190 \n96 \n36 \n322 \n(4)\n%\nTotal HIV\n12,059 \n1,769 \n1,124 \n14,952 \n11,386 \n1,737 \n1,038 \n14,160 \n6 \n%\nLiver Disease\nSofosbuvir/Velpatasvir\n(3)\n497 \n227 \n273 \n996 \n737 \n230 \n299 \n1,266 \n(21)\n%\nVemlidy\n358 \n36 \n389 \n783 \n338 \n33 \n328 \n699 \n12 \n%\nOther Liver Disease\n(4)\n307 \n233 \n53 \n593 \n134 \n148 \n55 \n337 \n76 \n%\nTotal Liver Disease\n1,162 \n496 \n714 \n2,372 \n1,210 \n411 \n682 \n2,302 \n3 \n%\nVeklury\n390 \n84 \n225 \n700 \n784 \n204 \n473 \n1,461 \n(52)\n%\nOncology\nCell Therapy\nTecartus\n122 \n107 \n25 \n254 \n181 \n102 \n22 \n305 \n(17)\n%\nYescarta\n444 \n455 \n228 \n1,127 \n502 \n509 \n170 \n1,181 \n(5)\n%\nTotal Cell Therapy\n566 \n562 \n253 \n1,381 \n683 \n611 \n192 \n1,485 \n(7)\n%\nTrodelvy\n626 \n259 \n128 \n1,013 \n655 \n217 \n88 \n960 \n6 \n%\nTotal Oncology\n1,192 \n821 \n381 \n2,395 \n1,338 \n828 \n280 \n2,446 \n(2)\n%\nOther\nAmBisome\n15 \n201 \n175 \n391 \n37 \n210 \n176 \n424 \n(8)\n%\nOther\n(5)\n125 \n23 \n55 \n204 \n203 \n26 \n52 \n281 \n(27)\n%\nTotal Other\n140 \n225 \n230 \n594 \n241 \n236 \n228 \n705 \n(16)\n%\nTotal product sales\n14,943 \n3,395 \n2,674 \n21,013 \n14,958 \n3,416 \n2,700 \n21,074 \n— \n%\nRoyalty, contract and other revenues\n57 \n433 \n16 \n505 \n66 \n43 \n2 \n111 \nNM\nTotal revenues\n$\n15,000 \n$\n3,828 \n$\n2,690 \n$\n21,518 \n$\n15,024 \n$\n3,459 \n$\n2,703 \n$\n21,185 \n2 \n%\n_______________________________\nNM - Not Meaningful\n(1)\n    Represents our revenue from cobicistat (“C”), emtricitabine (“FTC”) and tenofovir alafenamide (“TAF”) in Symtuza (darunavir/C/FTC/TAF), a fixed dose combination product commercialized by Janssen Sciences Ireland Unlimited Company.\n(2)\n    Includes Atripla, Complera/Eviplera, Emtriva, Stribild, Sunlenca, Truvada, Tybost and Yeztugo/Yeytuo.\n(3)\n    Includes Epclusa and the authorized generic version of Epclusa sold by Gilead’s separate subsidiary, Asegua Therapeutics LLC (“Asegua”).\n(4)\n    Includes ledipasvir/sofosbuvir (Harvoni and the authorized generic version of Harvoni sold by Asegua), Hepcludex, Hepsera, Livdelzi/Lyvdelzi, Sovaldi, Viread and Vosevi.\n(5)\n    Includes Cayston, Jyseleca, Letairis and Zydelig.\nHIV\nHIV product sales increased 4% to $5.3 billion for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to higher demand and favorable inventory dynamics, partially offset by lower average realized price driven by the U.S. Medicare Part D program redesign impact. In particular:\n•\nBiktarvy sales increased 6% primarily due to higher demand, including patients switching from Genvoya and other Gilead HIV products, and favorable inventory dynamics, partially offset by lower average realized price; and\n•\nDescovy sales increased 20% primarily due to higher demand.\nHIV product sales increased 6% to $15.0 billion for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to higher demand, with average realized price being relatively flat despite the U.S. Medicare Part D program redesign impact. In particular:\n•\nBiktarvy sales increased 7% primarily due to higher demand, including patients switching from Genvoya and other Gilead HIV products, partially offset by lower average realized price; and\n•\nDescovy sales increased 30% primarily due to higher demand and higher average realized price.\n32\nLiver Disease\nLiver Disease product sales increased 12% to $819 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to higher demand for Livdelzi and chronic hepatitis B virus (“HBV”) products, partially offset by lower average realized price for chronic hepatitis C virus (“HCV”) products, inclusive of the U.S. Medicare Part D program redesign impact.\n \nLiver Disease product sales increased 3% to $2.4 billion for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to higher demand for Livdelzi, HBV products and, in Europe, chronic hepatitis D virus products. This was partially offset by lower HCV product sales, driven by lower average realized price, inclusive of the U.S. Medicare Part D program redesign impact, and lower demand.\nVeklury\nVeklury product sales decreased 60% to $277 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to lower rates of COVID-19-related hospitalizations.\nVeklury product sales decreased 52% to $700 million for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to lower rates of COVID-19-related hospitalizations.\nOncology\nCell Therapy\nCell Therapy product sales decreased 11% to $432 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to lower demand reflecting ongoing competitive headwinds.\nCell Therapy product sales decreased 7% to $1.4 billion for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to lower demand reflecting ongoing competitive headwinds, partially offset by higher average realized price.\nTrodelvy\nTrodelvy product sales increased 7% to $357 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to higher demand.\nTrodelvy product sales increased 6% to $1.0 billion for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to higher demand.\nForeign Currency Exchange Impact\nWe generally face exposure to movements in foreign currency exchange rates, primarily in the Euro. We use foreign currency exchange contracts to hedge a portion of our foreign currency exposures.\nApproximat\nely 27% and 26% of our product sales were denominated in foreign currencies during the three months ended September 30, 2025 and 2024, respectively. Foreign currency exchange, net of hedges, had a favorable impact on our total product sales of $54 million for the three months ended September 30, 2025, based on a comparison using foreign currency exchange rates from the three months ended September 30, 2024.\nApproximately 27% of our product sales were denominated in foreign currencies during the nine months ended September 30, 2025 and 2024. Foreign currency exchange, net of hedges, had a favorable impact on our total product sales of $14 million for the nine months ended September 30, 2025, based on a comparison using foreign currency exchange rates from the nine months ended September 30, 2024.\nRoyalty, Contract and Other Revenues\nRoyalty, contract and other revenues increased to $424 million for the three months ended September 30, 2025, compared to $30 million for the same period in 2024, primarily due to recognition of $400 million of previously constrained revenues from the sale of certain intellectual property.\nRoyalty, contract and other revenues increased to $505 million for the nine months ended September 30, 2025, compared to $111 million for the same period in 2024, primarily due to recognition of $400 million of previously constrained revenues from the sale of certain intellectual property.\n33\nCosts and Expenses\nThe following table summarizes our costs and expenses and period-over-period changes:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n(in millions, except percentages)\n2025\n2024\nChange\n2025\n2024\nChange\nCost of goods sold\n$\n1,569 \n$\n1,574 \n— \n%\n$\n4,610 \n$\n4,670 \n(1)\n%\nProduct gross margin\n78.6 \n%\n79.1 \n%\n-42 bps\n78.1 \n%\n77.8 \n%\n22 bps\nResearch and development expenses\n$\n1,346 \n$\n1,395 \n(4)\n%\n$\n4,215 \n$\n4,266 \n(1)\n%\nAcquired in-process research and development expenses\n$\n170 \n$\n505 \n(66)\n%\n$\n485 \n$\n4,674 \n(90)\n%\nIn-process research and development impairments\n$\n— \n$\n1,750 \n(100)\n%\n$\n190 \n$\n4,180 \n(95)\n%\nSelling, general and administrative expenses\n$\n1,357 \n$\n1,433 \n(5)\n%\n$\n3,980 \n$\n4,184 \n(5)\n%\nProduct Gross Margin\nProduct gross margin was 78.6% and 78.1% for the three and nine months ended September 30, 2025, respectively, and remained relatively flat compared to the same periods in 2024.\nResearch and Development Expenses\nResearch and development expenses consist primarily of personnel costs including salaries, benefits and stock-based compensation expense, infrastructure, materials and supplies and other support costs, research and clinical studies performed by contract research organizations and our collaboration partners and other outside services.\nWe manage these expenses by identifying the research and development (“R&D”) activities we expect to be performed during a given period and then prioritizing efforts based on scientific data, probability of successful technical development and regulatory approval, market potential, available human and capital resources and other considerations. We regularly review our R&D activities based on unmet medical need and, as necessary, reallocate resources among our internal R&D portfolio and external opportunities that we believe will best support the long-term growth of our business. We do not track total R&D expenses by product candidate, therapeutic area or development phase.\nThe following table provides a breakout of expenses by major cost type:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n(in millions, except percentages)\n2025\n2024\nChange\n2025\n2024\nChange\nPersonnel, infrastructure and other support costs\n$\n807 \n$\n808 \n— \n%\n$\n2,516 \n$\n2,601 \n(3)\n%\nClinical studies and other costs\n539 \n587 \n(8)\n%\n1,699 \n1,665 \n2 \n%\nResearch and development expenses\n$\n1,346 \n$\n1,395 \n(4)\n%\n$\n4,215 \n$\n4,266 \n(1)\n%\nResearch and development expenses decreased 4% to $1.3 billion for the three months ended September 30, 2025, compared to the same period in 2024. Personnel, infrastructure and other support costs remained relatively flat. Clinical studies and other costs decreased primarily due to lower spend on study-related and clinical manufacturing expenses.\nResearch and development expenses decreased 1% to $4.2 billion for the nine months ended September 30, 2025, compared to the same period in 2024. Personnel, infrastructure and other support costs decreased primarily due to the impact of stock-based compensation expenses and other integration costs related to the acquisition of CymaBay during the nine months ended September 30, 2024, which did not repeat, as well as lower restructuring costs. Clinical studies and other costs increased primarily due to fair value adjustments to the MYR-related contingent consideration.\nAcquired In-Process Research and Development Expenses\nAcquired in-process research and development expenses are recorded when incurred and reflect costs of externally-developed IPR&D projects, acquired directly in a transaction other than a business combination, that do not have an alternative future use, including upfront and pre-commercialization milestone payments related to various collaborations and the costs of rights to IPR&D projects.\nAcquired in-process research and development expenses were $170 million for the three months ended September 30, 2025, primarily related to $120 million associated with the Pregene collaboration upfront payment.\n34\nAcquired in-process research and development expenses were $485 million for the nine months ended September 30, 2025, primarily related to $250 million associated with the LEO Pharma A/S collaboration upfront payment and $120 million associated with the Pregene collaboration upfront payment.\nAcquired in-process research and development expenses were $505 million for the three months ended September 30, 2024, primarily related to:\n•\n$320 million associated with the Janssen Pharmaceutica NV (“Janssen”) future royalty obligation extinguishment related to seladelpar;\n•\n$68 million associated with the Arcellx, Inc. (“Arcellx”) collaboration for milestones met; and\n•\n$47 million associated with the Tmunity Therapeutics, Inc. (“Tmunity”) acquisition for milestones met. \nAcquired in-process research and development expenses were $4.7 billion for the nine months ended September 30, 2024, primarily related to:\n•\n$3.9 billion associated with the CymaBay acquisition;\n•\n$320 million associated with the Janssen future royalty obligation extinguishment related to seladelpar;\n•\n$100 million associated with the Arcus Biosciences, Inc. collaboration amendment;\n•\n$68 million associated with the Arcellx collaboration for milestones met; and\n•\n$47 million associated with the Tmunity acquisition for milestones met. \nSee Note 6. Acquisitions, Collaborations and Other Arrangements of the Notes to Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information.\nIn-Process Research and Development Impairment \n2025 Impairment\nDuring the three months ended June 30, 2025, additional competitive clinical data became available indicating a potentially more competitive market for bulevirtide where it is not yet approved. Based on our evaluation of the data, and in connection with the preparation of the financial statements for the second quarter of 2025, we performed an interim impairment test and determined that the revised estimated fair value of the bulevirtide IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $190 million in In-process research and development impairments on our Condensed Consolidated Statements of Operations for the three months ended June 30, 2025.\nTo arrive at the revised estimated fair value as of June 30, 2025, we used a probability-weighted income approach that discounts expected future cash flows to present value, which requires the use of Level 3 fair value measurements and inputs, including critical estimated inputs, such as: revenues and operating profits related to the planned utilization of bulevirtide outside of the European Union (“EU”), which includes inputs such as addressable patient population, projected market share, treatment duration, and the life of the potential commercialized product; the probability of technical and regulatory success; the time and resources needed to complete the development and approval of bulevirtide outside of the EU; an appropriate discount rate based on the estimated weighted-average cost of capital for companies with profiles similar to our profile; and risks related to the viability of and potential alternative treatments in any future target markets. Our revised discounted cash flows for the June 30, 2025 fair value estimation primarily reflected the updated expectations for bulevirtide’s potential market share outside of the EU.\n2024 Impairments\nIn January 2024, we received data from our Phase 3 EVOKE-01 study of Trodelvy evaluating SG indicating that the study did not meet its primary endpoint of overall survival in previously treated metastatic non-small cell lung cancer (“NSCLC”), thus triggering a review for potential impairment of the NSCLC IPR&D intangible asset. Based on our evaluation of the study results and all other data available at the time, and in connection with the preparation of the financial statements for the first quarter of 2024, we performed an interim impairment test and determined that the revised estimated fair value of the NSCLC IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $2.4 billion in In-process research and development impairments on our Condensed Consolidated Statements of Operations for the three months ended March 31, 2024.\n35\nIn September 2024, based on discussions with regulators and external opinion leaders and the completed evaluation of the Phase 3 EVOKE-01 study data, we made a strategic decision to discontinue our clinical development program in metastatic NSCLC for Trodelvy in the second-line indication. This decision triggered a review for potential impairment of the NSCLC IPR&D intangible asset. Based on our evaluation, and in connection with the preparation of the financial statements for the third quarter of 2024, we performed an interim impairment test and determined that the revised estimated fair value of the NSCLC IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $1.8 billion in In-process research and development impairments on our Condensed Consolidated Statements of Operations for the three months ended September 30, 2024, and including the first quarter impairment described above, the total In-process research and development impairments on our Condensed Consolidated Statements of Operations for the nine months ended September 30, 2024 totaled $4.2 billion.\nTo arrive at the revised estimated fair value, we used a probability-weighted income approach that discounts expected future cash flows to present value, which requires the use of Level 3 fair value measurements and inputs, including critical estimated inputs, such as: revenues and operating profits related to the planned utilization of SG in NSCLC, which includes inputs such as addressable patient population, projected market share, treatment duration, and the life of the potential commercialized product; the probability of technical and regulatory success; the time and resources needed to complete the development and approval of SG in NSCLC; an appropriate discount rate based on the estimated weighted-average cost of capital for companies with profiles similar to our profile; and risks related to the viability of and potential alternative treatments in any future target markets. Our revised discounted cash flows for the March 31, 2024 fair value estimation primarily reflected the smaller addressable market that Trodelvy could serve among metastatic NSCLC patients and a delay in expected launch timing for second-line plus patients. Our revised discounted cash flows for the September 30, 2024 fair value estimation primarily reflected the removal of cash flows associated with second-line plus patients, and the remaining carrying value as of that date reflects Trodelvy’s opportunity as a combination therapy in first-line metastatic NSCLC patients supported by its ongoing Phase 3 clinical trial in this patient population. \nIf future events result in adverse changes in the key assumptions used in determining fair value, including the timing of product launches, information on the competitive landscape of treatments in this indication, changes to the probability of technical or regulatory success, failure to obtain anticipated regulatory approval or discount rate, among others, additional impairments may be recorded and could be material to our financial statements.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses are recorded when incurred and consist primarily of personnel costs, facilities and overhead costs, and selling, marketing and advertising expenses, as well as other general and administrative costs related to finance, human resources, legal and other administrative activities.\nThe following table summarizes our Selling, general and administrative expenses and period-over-period changes:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n(in millions, except percentages)\n2025\n2024\nChange\n2025\n2024\nChange\nSelling and marketing expenses\n$\n829 \n$\n848 \n(2)\n%\n$\n2,446 \n$\n2,396 \n2 \n%\nGeneral and administrative expenses\n527 \n584 \n(10)\n%\n1,534 \n1,788 \n(14)\n%\nSelling, general and administrative expenses\n$\n1,357 \n$\n1,433 \n(5)\n%\n$\n3,980 \n$\n4,184 \n(5)\n%\nSelling, general and administrative expenses decreased\n \n5% to $1.4 billion for the three months ended September 30, 2025, compared to the same period in 2024. Selling and marketing expenses decreased mainly due to lower restructuring and other costs, partially offset by higher HIV promotional expenses.\n \nGeneral and administrative expenses\n \ndecreased\n \nmainly due to lower expenses related to corporate initiatives and legal matters.\nSelling, general and administrative expenses decreased 5% to $4.0 billion for the nine months ended September 30, 2025, compared to the same period in 2024. Selling and marketing expenses increased mainly due to higher promotional and outside service expenses. General and administrative expenses decreased mainly due to lower expenses related to corporate initiatives and legal matters, as well as the impact of stock-based compensation expenses related to the acquisition of CymaBay during the nine months ended September 30, 2024, which did not repeat.\n36\nInterest Expense and Other (Income) Expense, Net\nThe following table summarizes our Interest expense and Other (income) expense, net and period-over-period changes:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n(in millions, except percentages)\n2025\n2024\nChange\n2025\n2024\nChange\nInterest expense\n$\n256 \n$\n238 \n8 \n%\n$\n769 \n$\n728 \n6 \n%\nOther (income) expense, net\n$\n(569)\n$\n(306)\n86 \n%\n$\n(449)\n$\n(41)\nNM\n(Gain) loss from equity securities, net\n$\n(483)\n$\n(258)\n87 \n%\n$\n(198)\n$\n148 \nNM\nInterest income\n$\n(88)\n$\n(52)\n68 \n%\n$\n(254)\n$\n(196)\n30 \n%\nOther, net\n$\n1 \n$\n4 \n(70)\n%\n$\n3 \n$\n7 \n(60)\n%\n_______________________________\nNM - Not Meaningful\nInterest expense increased 8% to $256 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to higher debt balances and a higher weighted-average interest rate on the debt.\nInterest expense increased 6% to $769 million for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to higher debt balances and a higher weighted-average interest rate on the debt.\nFavorable movements in Other (income) expense, net for the three months ended September 30, 2025, compared to the same period in 2024, primarily related to higher net unrealized gains from equity securities and higher interest income.\nFavorable movements in Other (income) expense, net for the nine months ended September 30, 2025, compared to the same period in 2024, primarily related to net unrealized gains from equity securities compared to net unrealized losses in 2024, as well as higher interest income.\nIncome Taxes\nThe following table summarizes our Income tax expense (benefit) and period-over-period changes:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n(in millions, except percentages)\n2025\n2024\nChange\n2025\n2024\nChange\nIncome (loss) before income taxes\n$\n3,641 \n$\n956 \nNM\n$\n7,718 \n$\n(1,477)\nNM\nIncome tax expense (benefit)\n$\n589 \n$\n(297)\nNM\n$\n1,391 \n$\n(174)\nNM\nEffective tax rate\n16.2 \n%\n(31.1)\n%\nNM\n18.0 \n%\n11.8 \n%\n624 bps\n_______________________________\nNM - Not Meaningful\nOur effective tax rate increased for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to a tax benefit associated with a legal entity restructuring and a decrease in state deferred tax liabilities associated with the $1.8 billion NSCLC IPR&D intangible asset impairment charge, both of which occurred in the three months ended September 30, 2024. \nOur effective tax rate increased for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to:\n•\nThe non-deductible acquired IPR&D expense recorded in connection with our first quarter 2024 acquisition of CymaBay; partially offset by\n•\nA tax benefit associated with a legal entity restructuring and a decrease in state deferred tax liabilities associated with the $1.8 billion NSCLC IPR&D intangible asset impairment charge, both of which occurred in the nine months ended September 30, 2024; and\n•\nTax benefits from stock-based compensation.\nIn October 2025, we reached a settlement with a tax authority related to a prior year legal entity restructuring. As a result, we anticipate recognizing approximately $450 million of income tax benefit and a corresponding $530 million reduction in our unrecognized tax benefits in the quarter ending December 31, 2025.\n37\nRecent Developments\nIn November 2025, we announced that our Phase 3 ASCENT-07 study of Trodelvy evaluating SG as a first-line treatment post-endocrine therapy in HR+/HER2- metastatic breast cancer patients did not meet the primary endpoint of progression-free survival. Overall survival is a key secondary endpoint and was not mature at the time of the primary analysis; however, an early trend was observed favoring patients treated with Trodelvy compared to chemotherapy. The safety profile was consistent with prior Trodelvy breast cancer studies, and no new safety signals were identified in this patient population. While we currently do not anticipate this information will result in an impairment of the associated finite-lived intangible asset related to Trodelvy, potential future adverse changes in estimated Trodelvy revenues could negatively impact our results of operations and result in impairment charges in future periods.\nLiquidity and Capital Resources\nWe regularly analyze our ability to generate and obtain adequate amounts of cash to meet our short-term and long-term requirements and plans. Our capital priorities include: (i) investing in our business and R&D pipeline, (ii) continuing select partnerships and business development transactions, (iii) growing our dividend over time and (iv) repurchasing shares to offset dilution and opportunistically reduce share count. Based on our evaluation of our current position of liquidity, available capital resources and our material cash requirements, we believe that we can satisfy our capital needs for the next 12 months and the foreseeable future.\nLiquidity\nCash and cash equivalents were $7.3 billion and marketable debt securities were $2.0 billion as of September 30, 2025. The table below summarizes our cash flow activities, followed by our analysis of changes and trends: \nNine Months Ended\nSeptember 30,\n(in millions, except percentages)\n2025\n2024\nChange\nNet cash provided by (used in):\nOperating activities\n$\n6,692 \n$\n7,853 \n(15)\n%\nInvesting activities\n(2,958)\n(3,224)\n(8)\n%\nFinancing activities\n(6,482)\n(5,693)\n14 \n%\nEffect of exchange rate changes on cash and cash equivalents\n87 \n15 \nNM\nNet change in cash and cash equivalents\n$\n(2,661)\n$\n(1,049)\nNM\n_______________________________\nNM - Not Meaningful\nOperating Activities\nNet cash provided by operating activities is our primary source of funds, driven mainly by collections on product sales, partially offset by operating spend. Changes in working capital balances, generally associated with the timing of collections and payments, as well as unanticipated payments related to litigation, taxes or other matters, may create some variation in any given year. Net cash provided by operating activities decreased for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to higher inventory build-up and unfavorable timing of collections on increased sales, partially offset by net favorable timing of operating payments.\n \nDuring the nine months ended September 30, 2025, we paid the final $1.3 billion federal income tax payment for transition tax on the mandatory deemed repatriation of foreign earnings related to the Tax Cuts and Jobs Act, compared to $1.2 billion paid during the same period in 2024.\nAs a result of the One Big Beautiful Bill Act and an October 2025 settlement with a tax authority related to a prior year legal entity restructuring, we do not anticipate making material income tax payments for the remainder of the year ending December 31, 2025.\nInvesting Activities\nNet cash used in investing activities decreased for the nine months ended September 30, 2025, compared to the same period in 2024. During the nine months ended September 30, 2025, we utilized cash primarily for purchases of marketable debt securities and upfront payments related to collaborations. During the nine months ended September 30, 2024, we utilized cash primarily for the $3.9 billion CymaBay acquisition and purchases of equity securities, partially offset by cash received from the liquidation of marketable debt securities. Net cash used in investing activities may vary in any given year depending on the favorability of strategic opportunities for the business.\nIn October 2025, we closed an agreement to acquire all outstanding shares of Interius for approximately $350 million in cash consideration, which was paid in the fourth quarter 2025.\n38\nFinancing Activities\nThe change in Net cash used in financing activities for the nine months ended September 30, 2025, compared to the same period in 2024, was primarily due to higher common stock repurchases. During the nine months ended September 30, 2025, we utilized cash of $3.0 billion for dividend payments, $1.8 billion for repayment of debt and $1.7 billion for common stock repurchases. During the nine months ended September 30, 2024, we utilized cash of $2.9 billion for dividend payments, $2.0 billion for repayment of debt and other obligations, and $800 million for common stock repurchases. Net cash used in financing activities may vary in any given year depending primarily on the timing of debt repayments and proceeds from debt offerings and the amount of common stock repurchases.\nIn October 2025, we announced that our Board of Directors declared a quarterly dividend of $0.79 per share of our common stock, with a payment date of December 30, 2025 to all stockholders of record as of the close of business on December 15, 2025. Future dividends are subject to declaration by our Board of Directors.\nCapital Resources\nA summary of our capital resources and material cash requirements is presented in Part II, Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2024. Other than as disclosed in the Liquidity section above and in Notes 4. Available-for-Sale Debt Securities and Equity Securities, 6. Acquisitions, Collaborations and Other Arrangements, 9. Debt and Credit Facilities, 10. Commitments and Contingencies and 12. Income Taxes of the Notes to Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q, there were no material changes to our capital resources and material cash requirements during the nine months ended September 30, 2025.\nCritical Accounting Estimates\nA summary of our critical accounting estimates is presented in Part II, Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2024. Other than as disclosed in Notes 2. Revenues, 7. Intangible Assets, 10. Commitments and Contingencies and 12. Income Taxes of the Notes to Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q, there were no material changes to our critical accounting estimates during the nine months ended September 30, 2025.\nInformation Available on Our Website\nOur company website is www.gilead.com. We routinely post important information for investors in the “Investors” section of our website, https://investors.gilead.com. Among other things, an estimate of Acquired IPR&D expenses is expected to be made available on the Quarterly Results page within the first ten days after the end of each quarter. The content on the referenced websites does not constitute a part of and is not incorporated by reference into this Quarterly Report on Form 10-Q."
}