{
  "item1": "Operations (MD&A) Item 7 report description segments. offer variety human pet food human rights fundamental strategy commitment ethical business conduct. value consumers around world. business focused following large, global fresh dairy United States), shorter term promotional products (e.g., fruit information significant customers, please refer Note 8 Consolidated frozen breakfast, frozen entrees; wholesome natural pet food; refrigerated frozen dough; baking mixes ingredients; super-premium ice cream.",
  "item7": "Cash Flows Operations Net earnings, including earnings attributable noncontrolling interests Depreciation amortization After-tax earnings joint ventures Distributions earnings joint ventures Stock-based compensation Deferred income taxes Pension other postretirement benefit plan contributions Pension other postretirement benefit plan costs Divestitures gain, net Restructuring, transformation, impairment, other exit costs Changes current assets liabilities, excluding effects increase accounts payable. Cash Flows Investing Activities Purchases land, buildings, equipment Acquisitions, net cash acquired Investments affiliates, net Proceeds disposal land, buildings, equipment Proceeds divestitures, net cash divested Net cash used investing activities decreased fiscal 2025 compared fiscal 2024. IMPACT INFLATION experienced broad-based global input cost inflation decreased 22 million fiscal 2025 fiscal 2024 primarily due share repurchase fiscal 2025, compared $14 million transaction costs fiscal 2024, primarily management practices discussed Item 7A report. LIQUIDITY CAPITAL Cash Flows Financing Activities Change notes payable Issuance long-term debt Payment long-term debt Repurchase Class limited membership interests General Mills Cereals, LLC Proceeds common stock issued exercised options Purchases common stock treasury Distributions noncontrolling interest holders Net cash used financing activities Selected Cash Flows Joint Ventures Selected cash flows joint ventures set forth following table: Inflow (Outflow), Millions Investments affiliates, net following table details credit facilities lines credit available shelf-stable vegetables, meal kits, fruit snacks snack bars.",
  "item2": "Quarter Ended Aug. 24, 2025 vs. Quarter Ended Aug. 25, 2024 Contributions organic volume growth (a) Organic net price realization mix Organic net sales growth Foreign currency exchange Acquisition divestitures Percentage Change After-Tax Earnings Joint Ventures Constant-Currency Basis Quarter Ended Aug."
}