{
  "source_file": "glw-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nCorning Incorporated and its consolidated subsidiaries are hereinafter sometimes referred to as the “Company,” the “Registrant,” “Corning,” “we,” “our,” or “us.”\nThis report contains forward-looking statements that involve a number of risks and uncertainties. These statements relate to plans, objectives, expectations and estimates and may contain words such as “will,” “believe,” “anticipate,” “expect,” “intend,” “plan,” “seek,” “see,” “would,” “target,” “estimate,” “forecast,” or similar expressions. Actual results could differ materially from what is expressed or forecasted in forward-looking statements. Some of the factors that could contribute to these differences include those discussed under “Forward-Looking Statements,” “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and elsewhere in this report.\nORGANIZATION OF INFORMATION\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) was prepared to provide a historical and prospective narrative on our financial condition and results of operations through the eyes of management and should be read in conjunction with our consolidated financial statements and the accompanying notes to those financial statements and our MD&A of our Annual Report on Form 10-K for the year ended December 31, 2024 (“2024 Form 10-K”).\nOur MD&A is organized as follows:\n•\nOverview\n•\nResults of Operations\n•\nSegment Analysis\n•\nCore Performance Measures\n•\nLiquidity and Capital Resources\n•\nEnvironment\n•\nCritical Accounting Estimates\n•\nForward-Looking Statements\nOVERVIEW\nCorning is vital to progress – in the industries we help advance and in the world we share. For more than 170 years, Corning has combined its unparalleled expertise in glass science, ceramic science and optical physics with deep manufacturing and engineering capabilities to develop category-defining products that transform industries and enhance people’s lives. Our materials science and manufacturing expertise, boundless curiosity and commitment to purposeful invention place us at the center of the way the world works, learns and lives. In addition, our sustained investment in research, development and engineering capabilities means we are always ready to solve the toughest challenges – alongside our customers.\nOur capabilities are versatile and synergistic, allowing Corning to evolve to meet changing market needs, while also helping customers capture new opportunities in dynamic industries. Corning strives to be a catalyst for positive change and to help move the world forward. The Company drives profitable multiyear growth by inventing, making and selling life-changing products – all of which is based on a set of vital capabilities that are increasingly relevant to profound transformations that touch many facets of daily life. Today, Corning’s markets include optical communications, mobile consumer electronics, display, automotive, solar, semiconductor and life sciences.\n2025 Corporate Outlook\nWe expect core net sales of approximately $4.35 billion for the fourth quarter of 2025.\n25\nTable of Contents\n \nRESULTS OF OPERATIONS\nThe following table presents selected highlights from our operations (in millions):\nThree months ended\nSeptember 30,\n%\nchange\nNine months ended\nSeptember 30,\n%\nchange\n2025\n2024\n25 vs. 24\n2025\n2024\n25 vs. 24\nNet sales\n$\n4,100 \n$\n3,391 \n21\n%\n$\n11,414 \n$\n9,617 \n19\n%\nCost of sales\n$\n2,580 \n$\n2,254 \n14\n%\n$\n7,288 \n$\n6,538 \n11\n%\nGross margin\n$\n1,520 \n$\n1,137 \n34\n%\n$\n4,126 \n$\n3,079 \n34\n%\nGross margin %\n37\n%\n34\n%\n \n36\n%\n32\n%\n \nSelling, general and administrative expenses\n$\n624 \n$\n510 \n22\n%\n$\n1,610 \n$\n1,432 \n12\n%\nas a % of net sales\n15\n%\n15\n%\n \n14\n%\n15\n%\n \nResearch, development and engineering expenses\n$\n280 \n$\n294 \n(5\n%)\n$\n826 \n$\n814 \n1\n%\nas a % of net sales\n7\n%\n9\n%\n \n7\n%\n8\n%\n \nTranslated earnings contract gain (loss), net\n$\n33 \n$\n(157)\n*\n$\n63 \n$\n(91)\n*\nIncome (loss) before income taxes\n$\n550 \n$\n(92)\n*\n$\n1,374 \n$\n376 \n*\nProvision for income taxes\n$\n80 \n$\n3 \n*\n$\n219 \n$\n124 \n77\n%\nEffective tax rate\n14.5\n%\n(3.3\n%)\n \n15.9\n%\n33.0\n%\n \n*\nNot meaningful\nNet sales \nFor the three months ended September 30, 2025, net sales increased $709 million, or 21% when compared to the same period in 2024. This was primarily driven by an increase in sales for optical communication products of $406 million, polycrystalline silicon products of $91 million, specialty materials products of $74 million and display products of $66 million.\nFor the nine months ended September 30, 2025, net sales increased $1.8 billion, or 19% when compared to the same period in 2024. This was primarily driven by an increase in sales for optical communication products of $1.3 billion, specialty materials products of $164 million, display products of $159 million and polycrystalline silicon products of $105 million.\nCost of sales / Gross margin\nThe types of expenses included in cost of sales are: raw materials consumption, including direct and indirect materials; salaries, wages and benefits; depreciation and amortization; production utilities; production-related purchasing; warehousing (including receiving and inspection); repairs and maintenance; inter-location inventory transfer costs; production and warehousing facility property insurance; rent for production facilities; freight and logistics costs; and other production overhead.\nFor the three months ended September 30, 2025, cost of sales increased $326 million, or 14%, when compared to the same period in 2024, primarily driven by the increase in net sales as discussed above. Gross margin increased $383 million, or 34%, and increased as a percentage of sales by 3 percentage points when compared to the same period in 2024 driven by higher volume and the impact of actions taken by management to improve profitability, including raising prices, managing costs and restoring our productivity.\nFor the nine months ended September 30, 2025, cost of sales increased $750 million, or 11%, when compared to the same period in 2024, primarily driven by the increase in net sales as discussed above. Gross margin increased $1.0 billion, or 34%, and increased as a percentage of sales by 4 percentage points when compared to the same period in 2024 driven by the impact of actions taken by management to improve profitability, including raising prices, restoring our productivity levels and normalizing inventory levels.\n26\nTable of Contents\n \nSelling, general and administrative expenses\nThe types of expenses included in the selling, general and administrative expenses line item are salaries, wages and benefits, including variable compensation and share-based compensation expense; travel; sales commissions; professional fees; and depreciation and amortization, utilities and rent for administrative facilities.\nFor the three and nine months ended September 30, 2025, selling, general and administrative expenses increased $114 million and $178 million, respectively, when compared to the same periods in 2024, primarily due to the increase in net sales, as discussed above, and an increase in variable compensation and legal related expenses.\nResearch, development and engineering expenses \nFor the three and nine months ended September 30, 2025, research, development and engineering expenses decreased $14 million and increased $12 million, respectively and remained consistent as a percentage of sales when compared to the same periods in 2024.\nTranslated earnings contract gain (loss), net\nIncluded in translated earnings contract gain (loss), net, is the impact of foreign currency contracts which economically hedge the translation exposure arising from movements in the Japanese yen, South Korean won, Chinese yuan, New Taiwan dollar, Mexican peso and euro and its impact on net income (loss).\nThe following table provides detailed information on the impact of translated earnings contract gain (loss), net (in millions):\nThree months ended\nSeptember 30, 2025\nThree months ended\nSeptember 30, 2024\nChange\n2025 vs. 2024\nIncome\nbefore\ntax\nNet\nincome\n(Loss) income\nbefore\ntax\nNet \nloss\nIncome\nbefore\ntax\nNet\nincome\nHedges related to translated earnings:\nRealized (loss) gain, net \n(1) (2)\n$\n(5)\n$\n(4)\n$\n47 \n$\n36 \n$\n(52)\n$\n(40)\nUnrealized gain (loss), net \n38 \n29 \n(204)\n(157)\n242 \n186 \nTotal translated earnings contract gain (loss), net\n$\n33 \n$\n25 \n$\n(157)\n$\n(121)\n$\n190 \n$\n146 \nNine months ended\nSeptember 30, 2025\nNine months ended\nSeptember 30, 2024\nChange\n2025 vs. 2024\nIncome\nbefore\ntax\nNet\nincome\nIncome\nbefore\ntax\nNet\nincome\nIncome\nbefore\ntax\nNet\nincome\nHedges related to translated earnings:\nRealized gain, net \n(1) (2)\n$\n2 \n$\n1 \n$\n158 \n$\n121 \n$\n(156)\n$\n(120)\nUnrealized gain (loss), net \n61 \n47 \n(249)\n(191)\n310 \n238 \nTotal translated earnings contract gain (loss), net\n$\n63 \n$\n48 \n$\n(91)\n$\n(70)\n$\n154 \n$\n118 \n(1)\nFor the three and nine months ended September 30, 2025, amount includes non-cash pre-tax realized losses of $94 million and $202 million, respectively, and for the three and nine months ended September 30, 2024, amount includes non-cash pre-tax realized losses of $24 million and $81 million, respectively, related to the premiums of expired option contracts.\n(2)\nFor the three and nine months ended September 30, 2025, amount excludes losses of $4 million and $12 million, respectively, related to forward contracts designated as a net investment hedge, which was recorded in accumulated other comprehensive loss on the consolidated balance sheets and reflected within investing activities in the consolidated statements of cash flows.\n27\nTable of Contents\n \nThe impact to income from realized activity for the three months ended September 30, 2025 was primarily driven by realized losses from our South Korean won and Japanese yen-denominated hedges, partially offset by realized gains from our Mexican peso-denominated hedges. The impact to income from realized activity for the nine months ended September 30, 2025 was primarily driven by realized gains from our Mexican peso and Japanese yen-denominated hedges, partially offset by realized losses from our South Korean won and Chinese yuan-denominated hedges. \nThe impact to income from realized activity for the three and nine months ended September 30, 2024 was primarily driven by realized gains from our Japanese yen-denominated hedges, partially offset by realized losses from our South Korean won and Chinese yuan-denominated hedges.\nThe impact to income from unrealized activity for the three months ended September 30, 2025 was primarily driven by unrealized gains from our Japanese yen, Mexican peso and euro-denominated hedges, partially offset by unrealized losses from our new Taiwan dollar and South Korean won-denominated hedges. The impact to income from unrealized activity for the nine months ended September 30, 2025 was primarily driven by unrealized gains from our South Korean won, Mexican peso, new Taiwan dollar and Chinese yuan-denominated hedges, partially offset by unrealized losses from our euro and Japanese yen-denominated hedges. \nThe impact to income from unrealized activity for the three months ended September 30, 2024 was primarily driven by unrealized losses from our Japanese yen and euro-denominated hedges, partially offset by unrealized gains from our South Korean won, new Taiwan dollar and Chinese yuan-denominated hedges. The impact to income for the nine months ended September 30, 2024 was primarily driven by unrealized losses from our Japanese yen and euro-denominated hedges, partially offset by unrealized gains from our Chinese yuan-denominated hedges. \nIncome (loss) before income taxes\nFor the three and nine months ended September 30, 2025, income before income taxes increased $642 million and $998 million, respectively, when compared to the same periods in 2024, primarily driven by increases in gross margin, as discussed above, and gains on our translated earnings contracts, partially offset by increases in selling, general and administration expenses, as discussed above.\nProvision for Income Taxes\nFor the three and nine months ended September 30, 2025, the effective tax rate differed from the United States (“U.S.”) statutory rate of 21%, primarily due to foreign derived intangible income, adjustments to share-based compensation and non-taxable items, partially offset by certain pre-tax losses with no corresponding expected tax benefit.\nFor the three months ended September 30, 2024, the effective tax rate differed from the U.S. statutory rate of 21%, primarily due to certain pre-tax losses with no corresponding expected tax benefit, changes in estimates based on the final 2023 U.S. Federal Income Tax Return and the impact of foreign exchange losses. For the nine months ended September 30, 2024, the effective tax rate differed from the U.S. statutory rate of 21%, primarily due to certain pre-tax losses with no corresponding expected tax benefit.\nFor the three months ended September 30, 2025, the effective tax rate differed when compared to the same period in 2024 primarily due to changes in certain pre-tax losses with no corresponding expected tax benefit and foreign exchange gains and losses, partially offset by foreign derived intangible income, adjustments to share-based compensation and non-taxable items. For the nine months ended September 30, 2025, the effective tax rate differed when compared to the same period in 2024 primarily due to foreign derived intangible income, adjustments to share-based compensation, and non-taxable items, partially offset by certain pre-tax losses with no corresponding expected tax benefit. \nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the United States. The OBBBA includes various tax law changes, including the permanent extension of certain provisions originally enacted under the Tax Cuts and Jobs Act of 2017, modifications to the international tax framework and the reinstatement of favorable treatment for certain business tax provisions. These include\n 100%\n bonus depreciation, immediate expensing of domestic research and development costs and revised limitations on the deductibility of business interest expense. The provisions of the OBBBA are subject to multiple effective dates, with some effective beginning in 2025 and others phased in through 2027. The Company evaluated the provisions of the OBBBA and does not expect the impact to be material on our estimated annual effective tax rate in 2025.\nThe Internal Revenue Service (“IRS”) is currently conducting examinations of the Company’s U.S. federal income tax returns for the years 2015 through 2018 and 2019 through 2020, including the one-time transition tax enacted under the Tax Cuts and Jobs Act of 2017. If challenged, Corning believes that it is at least more likely than not to sustain its position relating to these matters. However, if the Company is ultimately unsuccessful in defending its position, the impact could be material to its consolidated financial statements.\n28\nTable of Contents\n \nSEGMENT ANALYSIS\nFinancial results for the reportable segments and Hemlock and Emerging Growth Businesses are prepared on a basis consistent with the internal disaggregation of financial information to assist the chief operating decision maker (“CODM”) in making internal operating decisions, which is more fully discussed within Note 16 (Reportable Segments) in the accompanying notes to the consolidated financial statements and includes a reconciliation of segment information to the corresponding amounts in the consolidated statements of income (loss).\nAs of January 1, 2025, the Company began managing its Automotive Glass Solutions business together with its Environmental Technologies business, forming the Automotive segment. In addition, the Display Technologies segment has been renamed to Display. The segment information presented below has been recast for the comparative period presented for the Automotive segment.\nSegment net income may not be consistent with measures used by other companies.\nThe following table presents segment net sales by reportable segment and Hemlock and Emerging Growth Businesses (in millions):\nThree months ended\nSeptember 30,\n$\nchange\n%\nchange\nNine months ended\nSeptember 30,\n$\nchange\n%\nchange\n2025\n2024\n25 vs. 24\n25 vs. 24\n2025\n2024\n25 vs. 24\n25 vs. 24\nOptical Communications\n$\n1,652 \n$\n1,246 \n$\n406 \n33\n%\n$\n4,573 \n$\n3,289 \n$\n1,284 \n39\n%\nDisplay\n939 \n1,015 \n(76)\n(7\n%)\n2,742 \n2,901 \n(159)\n(5\n%)\nSpecialty Materials\n621 \n548 \n73 \n13\n%\n1,667 \n1,503 \n164 \n11\n%\nAutomotive\n454 \n430 \n24 \n6\n%\n1,354 \n1,400 \n(46)\n(3\n%)\nLife Sciences\n242 \n244 \n(2)\n(1\n%)\n726 \n729 \n(3)\n0\n%\nNet sales of reportable segments\n3,908 \n3,483 \n425 \n12\n%\n11,062 \n9,822 \n1,240 \n13\n%\nHemlock and Emerging Growth\n   Businesses\n364 \n250 \n114 \n46\n%\n934 \n773 \n161 \n21\n%\nNet sales of reportable segments and\n   Hemlock and Emerging Growth\n   Businesses\n (1)\n$\n4,272 \n$\n3,733 \n$\n539 \n14\n%\n$\n11,996 \n$\n10,595 \n$\n1,401 \n13\n%\n(1)\nRefer to Note 16 (Reportable Segments) in the accompanying notes to the consolidated financial statements for the reconciliation to consolidated net sales.\nOptical Communications\nThe increase in segment net sales for both the three- and nine-month periods was primarily due to continued growth in our Enterprise business driven by strong demand for our Generative AI products, and in our Carrier business, driven by demand for datacenter interconnect products and fiber-to-the-home products. \nDisplay\nThe decrease in segment net sales for both the three- and nine-month periods was due to the impact from resetting our core rate from 107 to 120 Japanese yen to USD as the comparative period results were not recast and are presented at the 107 Japanese yen to USD core rate. The impact from resetting our core rate was partially offset by pricing actions taken in the second half of 2024.\nSpecialty Materials\nThe increase in segment net sales for both the three- and nine-month periods was due to continued strong demand for premium glass for mobile devices.\nAutomotive\nThe increase in segment net sales for the three-month period was primarily due to positive momentum in the global passenger vehicle market driven by China as well as growth in demand for premium content. The decrease in segment net sales for the nine-month period was primarily due to softness in light-duty and heavy-duty markets, particularly in Europe and North America.\nLife Sciences\nSegment net sales remained consistent with the comparative periods. \nHemlock and Emerging Growth Businesses\nThe increase in segment net sales for both the three- and nine-month periods was primarily due to higher sales in our solar businesses, including HSG.\n29\nTable of Contents\n \nThe following table presents segment net income by reportable segment and Hemlock and Emerging Growth Businesses (in millions):\nThree months ended\nSeptember 30,\n$\nchange\n%\nchange\nNine months ended\nSeptember 30,\n$\nchange\n%\nchange\n2025\n2024\n25 vs. 24\n25 vs. 24\n2025\n2024\n25 vs. 24\n25 vs. 24\nOptical Communications\n$\n295 \n$\n175 \n$\n120 \n69\n%\n$\n743 \n$\n418 \n$\n325 \n78\n%\nDisplay\n250 \n285 \n(35)\n(12\n%)\n736 \n744 \n(8)\n(1\n%)\nSpecialty Materials\n113 \n72 \n41 \n57\n%\n268 \n179 \n89 \n50\n%\nAutomotive\n68 \n51 \n17 \n33\n%\n215 \n200 \n15 \n8\n%\nLife Sciences\n16 \n15 \n1 \n7\n%\n47 \n45 \n2 \n4\n%\nNet income of reportable segments\n742 \n598 \n144 \n24\n%\n2,009 \n1,586 \n423 \n27\n%\nHemlock and Emerging Growth\n   Businesses\n(1)\n12 \n(13)\n*\n(27)\n32 \n(59)\n*\nNet income of reportable segments \n   and Hemlock and Emerging\n   Growth Businesses\n (1)\n$\n741 \n$\n610 \n$\n131 \n21\n%\n$\n1,982 \n$\n1,618 \n$\n364 \n22\n%\n*  Not meaningful\n(1)\nRefer to Note 16 (Reportable Segments) in the accompanying notes to the consolidated financial statements for the reconciliation to consolidated net income.\nOptical Communications\nThe increase in segment net income for both the three- and nine-month periods was primarily driven by strong incremental profit on higher sales volume, as outlined above. \nDisplay \nThe decrease in segment net income for the three-month period was primarily driven by the decrease in sales, as outlined above. Segment net income remained flat for the nine-month period when compared to the same period in 2024 with improved performance offsetting lower sales, as outlined above.\nSpecialty Materials\nThe increase in segment net income for both the three- and nine-month periods was primarily driven by increased sales, as outlined above, and strong incremental profit on higher volumes. \nAutomotive\nThe increase in segment net income for both the three- and nine-month periods was primarily driven by improved performance within our automotive glass business, partially offset by decreased sales of our environmental technologies business, as outlined above. \nLife Sciences\nSegment net income remained consistent with the comparative periods.\nHemlock and Emerging Growth Businesses\nThe decrease in segment net income for both the three- and nine-month periods was primarily driven by temporarily higher costs to ramp up for our new solar products.\n30\nTable of Contents\n \nCORE PERFORMANCE MEASURES\nIn managing the Company and assessing our financial performance, we adjust certain measures included in our consolidated financial statements to exclude specific items to arrive at measures that are not calculated in accordance with accounting principles generally accepted in the United States of America (“GAAP”) and exclude specific items that are non-recurring, related to foreign exchange volatility, or unrelated to continuing operations. These measures are our core performance measures. \nManagement uses core performance measures, along with GAAP financial measures, to make financial and operational decisions and certain of these measures also form the basis of our compensation program metrics. Management believes that our core performance measures are indicative of our core operating performance and provide investors with greater visibility into how management evaluates our results and trends and makes business decisions. These measures are not, and should not be viewed as a substitute for, GAAP reporting measures.\nItems that are excluded from certain core performance calculations include: the impact of translating the foreign denominated debt, the impact of the translated earnings contracts, acquisition-related costs, certain discrete tax items and other tax-related adjustments, restructuring, impairment and other charges and credits, certain litigation, regulatory and other legal matters, pension mark-to-market adjustments and other items which do not reflect the ongoing operating results of the Company.\nIn addition, because a significant portion of our revenues and expenses are denominated in currencies other than the U.S. dollar, management believes it is important to understand the impact on sales and net income of translating these currencies into U.S. dollars. Therefore, management utilizes constant-currency reporting for the Optical Communications, Display, Specialty Materials, Automotive and Life Sciences segments to exclude the impact from the Japanese yen, South Korean won, Chinese yuan, New Taiwan dollar, Mexican peso and euro, as applicable to the segment. The most significant constant-currency adjustment relates to the Japanese yen exposure within the Display segment. The constant-currency rates established for our core performance measures are long-term management-determined rates, which are closely aligned with our hedging instrument rates. These hedging instruments may include, but are not limited to, foreign exchange forward or option contracts and foreign-denominated debt. For details of the rates used, refer to the footnotes to the “Reconciliation of Non-GAAP Measures” section. We believe that the use of constant-currency reporting allows management to understand our results without the volatility of currency fluctuations, analyze underlying trends in the businesses and establish operational goals and forecasts. \nFor a reconciliation of non-GAAP performance measures to their most directly comparable GAAP financial measure, refer to “Reconciliation of Non-GAAP Measures.” With respect to the outlook for future periods, it is not possible to provide reconciliations for these non-GAAP measures because management does not forecast the movement of foreign currencies against the U.S. dollar, or other items that do not reflect ongoing operations, nor does it forecast items that have not yet occurred or are out of management’s control. As a result, management is unable to provide outlook information on a GAAP basis.\nResults of Operations – Core Performance Measures\nThe following table presents selected highlights from our operations, excluding certain items (in millions, except per share amounts):\nThree months ended\nSeptember 30,\n%\nchange\nNine months ended\nSeptember 30,\n%\nchange\n2025\n2024\n25 vs. 24\n2025\n2024\n25 vs. 24\nCore net sales\n$\n4,272 \n$\n3,733 \n14\n%\n$\n11,996 \n$\n10,595 \n13\n%\nCore net income\n$\n585 \n$\n465 \n26\n%\n$\n1,575 \n$\n1,202 \n31\n%\nCore earnings per share\n$\n0.67 \n$\n0.54 \n24\n%\n$\n1.81 \n$\n1.38 \n31\n%\nCore Net Sales\n \nFor the three months ended September 30, 2025, we generated core net sales of $4.3 billion compared to $3.7 billion for the same period in 2024. The increase in core net sales of $539 million was primarily driven by increased segment sales of $406 million in Optical Communications and $73 million in Specialty Materials, partially offset by decreased segment sales of $76 million in Display. Net sales by reportable segment is discussed in detail in the “Segment Analysis” section of our MD&A.\nFor the nine months ended September 30, 2025, we generated core net sales of $12.0 billion compared to $10.6 billion for the same period in 2024. The increase in core net sales of $1.4 billion was primarily driven by increased segment sales of $1.3 billion in Optical Communications and $164 million in Specialty Materials, partially offset by decreased segment sales of $159 million in Display and $46 million in Automotive. Net sales by reportable segment is discussed in detail in the “Segment Analysis” section of our MD&A.\n31\nTable of Contents\n \nCore Net Income\nFor the three months ended September 30, 2025, we generated core net income of $585 million compared to $465 million for the same period in 2024. The increase of $120 million was primarily due to higher segment net income of $120 million in Optical Communications and $41 million in Specialty Materials, partially offset by decreased segment net income of $35 million in Display. Net income by reportable segment is discussed in detail in the “Segment Analysis” section of our MD&A.\nFor the nine months ended September 30, 2025, we generated core net income of $1.6 billion compared to $1.2 billion for the same period in 2024. The increase of $373 million was primarily due to higher segment net income of $325 million in Optical Communications and $89 million in Specialty Materials. Net income by reportable segment is discussed in detail in the “Segment Analysis” section of our MD&A.\nCore Earnings per Share\nCore earnings per share increased for the three months ended September 30, 2025 to $0.67 per share, primarily as a result of the changes in core net income, outlined above.\nCore earnings per share increased for the nine months ended September 30, 2025 to $1.81 per share, primarily as a result of the changes in core net income, outlined above.\nThe following table sets forth the computation of core earnings per share (in millions, except per share amounts):\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n2025\n2024\n2025\n2024\nCore net income\n$\n585 \n$\n465 \n$\n1,575 \n$\n1,202 \n \nWeighted-average common shares outstanding - basic\n856\n854\n855\n853\nEffect of dilutive securities:\nStock options and other awards\n12\n11\n15\n15\nWeighted-average common shares outstanding - diluted\n868\n865\n870\n868\nCore earnings per share\n$\n0.67 \n$\n0.54 \n$\n1.81 \n$\n1.38 \n32\nTable of Contents\n \nReconciliation of Non-GAAP Measures\nWe utilize certain financial measures and key performance indicators that are not calculated in accordance with GAAP to assess our financial and operating performance. A non-GAAP financial measure is defined as a numerical measure of a company’s financial performance that (i) excludes amounts, or is subject to adjustments that have the effect of excluding amounts, that are included in the comparable measure calculated and presented in accordance with GAAP in the consolidated statements of income (loss) or statements of cash flows, or (ii) includes amounts, or is subject to adjustments that have the effect of including amounts, that are excluded from the comparable measure as calculated and presented in accordance with GAAP in the consolidated statements of income (loss) or statements of cash flows.\nCore net sales, core net income and core earnings per share are non-GAAP financial measures utilized by our management to analyze financial performance without the impact of items that are driven by general economic conditions and events that do not reflect the underlying fundamentals and trends in our operations.\nThe following tables reconcile our non-GAAP financial measures to their most directly comparable GAAP financial measure (amounts in millions, except percentages and per share amounts):\nThree months ended September 30, 2025\nNet sales\nIncome before income taxes\nNet income attributable to Corning Incorporated\nEffective tax rate (a)(b)\nPer Share\nAs reported – GAAP\n$\n4,100\n \n$\n550\n \n$\n430\n \n14.5\n%\n$\n0.50\n \nConstant-currency adjustment\n (1) \n172\n157\n111\n0.13 \nTranslation gain on foreign denominated debt, net \n(2)\n(4)\n(4)\n(0.00)\nTranslated earnings contract gain, net\n (3)\n(33)\n(25)\n(0.03)\nAcquisition-related costs \n(4)\n30\n22\n0.03 \nDiscrete tax items and other tax-related adjustments \n(5)\n(21)\n(0.02)\nRestructuring, impairment and other charges and credits \n(6)\n16\n12\n0.01 \nLitigation, regulatory and other legal matters \n(7)\n50\n50\n0.06 \nPension mark-to-market adjustment\n (8)\n12\n9\n0.01 \nLoss on investments \n(9)\n1\n1\n0.00 \nCore performance measures\n$\n4,272 \n$\n779 \n$\n585 \n19.5\n%\n$\n0.67 \n(a)\nBased upon statutory tax rates in the specific jurisdiction for each event.\n(b)\nThe calculation of the effective tax rate for GAAP and Core excludes net income attributable to non-controlling interest of approximately $40 million and $41 million, respectively.\nThree months ended September 30, 2024\nNet sales\n(Loss) income before income taxes\nNet (loss) income attributable to Corning Incorporated\nEffective tax rate (a)(b)\nPer Share\nAs reported - GAAP\n$\n3,391\n \n$\n(92)\n$\n(117)\n(3.3\n%)\n$\n(0.14)\nConstant-currency adjustment\n (1)\n342\n258\n239\n \n0.28 \nTranslation loss on foreign denominated debt, net\n (2)\n107\n82\n \n0.10 \nTranslated earnings contract loss, net \n(3)\n157\n121\n \n0.14 \nAcquisition-related costs \n(4)\n32\n23\n \n0.03 \nDiscrete tax items and other tax-related adjustments \n(5)\n(14)\n \n(0.02)\nRestructuring, impairment and other charges and credits \n(6)\n134\n125\n \n0.15 \nLitigation, regulatory and other legal matters \n(7)\n16\n12\n0.01 \nPension mark-to-market adjustment \n(8)\n(20)\n(15)\n \n(0.02)\nLoss on investments \n(9)\n7\n7\n \n0.01 \nLoss on sale of assets\n (10)\n3\n2\n0.00 \nCore performance measures\n$\n3,733 \n$\n602 \n$\n465 \n19.1\n%\n$\n0.54 \n(a)\nBased upon statutory tax rates in the specific jurisdiction for each event.\n(b)\nThe calculation of the effective tax rate for GAAP and Core excludes net income attributable to non-controlling interest of approximately $22 million\n \nand $23 million, respectively.\nRefer to “Items Adjusted from GAAP Measures” for the descriptions of the footnoted reconciling items.\n33\nTable of Contents\n \nNine months ended September 30, 2025\nNet sales\nIncome before income taxes\nNet income attributable to Corning Incorporated\nEffective tax rate (a)(b)\nPer Share\nAs reported - GAAP\n$\n11,414\n \n$\n1,374\n \n$\n1,056\n \n15.9\n%\n$\n1.21\n \nConstant-currency adjustment\n (1) \n582\n496\n404\n0.46 \nTranslation loss on foreign denominated debt, net \n(2)\n66\n50\n0.06 \nTranslated earnings contract gain, net\n (3)\n(63)\n(48)\n(0.06)\nAcquisition-related costs \n(4)\n89\n65\n0.07 \nDiscrete tax items and other tax-related adjustments \n(5)\n(56)\n(0.06)\nRestructuring, impairment and other charges and credits \n(6)\n10\n8\n0.01 \nLitigation, regulatory and other legal matters \n(7)\n57\n55\n0.06 \nPension mark-to-market adjustment\n (8)\n27\n21\n0.02 \nLoss on sale of assets \n(10)\n5\n4\n0.00 \nEquity in losses of affiliated companies \n(11)\n12\n9\n0.01\nLoss on sale of business \n(12)\n11\n7\n0.01\nCore performance measures\n$\n11,996 \n$\n2,084 \n$\n1,575 \n19.5\n%\n$\n1.81 \n(a)\nBased upon statutory tax rates in the specific jurisdiction for each event.\n(b)\nThe calculation of the effective tax rate for GAAP and Core excludes net income attributable to non-controlling interest of approximately $99 million\n \nand $102 million respectively.\nNine months ended September 30, 2024\nNet sales\nIncome before income taxes\nNet income attributable to Corning Incorporated\nEffective tax rate (a)(b)\nPer Share\nAs reported - GAAP\n$\n9,617\n \n$\n376\n \n$\n196\n \n33.0\n%\n$\n0.23\n \nConstant-currency adjustment\n (1)\n978\n751\n604\n0.70 \nTranslation gain on foreign denominated debt, net\n (2)\n(28)\n(21)\n(0.02)\nTranslated earnings contract loss, net \n(3)\n91\n70\n0.08 \nAcquisition-related costs \n(4)\n96\n69\n0.08 \nDiscrete tax items and other tax-related adjustments \n(5)\n5\n0.01 \nRestructuring, impairment and other charges and credits \n(6)\n263\n248\n0.29 \nLitigation, regulatory and other legal matters \n(7)\n11\n8\n0.01 \nPension mark-to-market adjustment \n(8)\n(6)\n(4)\n(0.00)\nLoss on investments \n(9)\n19\n18\n0.02 \nLoss on sale of assets\n (10)\n13\n9\n0.01 \nCore performance measures\n$\n10,595 \n$\n1,586 \n$\n1,202 \n20.4\n%\n$\n1.38 \n(a)\nBased upon statutory tax rates in the specific jurisdiction for each event.\n(b)\nThe calculation of the effective tax rate for GAAP and Core excludes net income attributable to non-controlling interest of approximately $56 million\n \nand $61 million, respectively.\nRefer to “Items Adjusted from GAAP Measures” for the descriptions of the footnoted reconciling items.\n34\nTable of Contents\n \nItems Adjusted from GAAP Measures\nItems adjusted from GAAP measures to arrive at core performance measures are as follows:\n(1)\nConstant-currency adjustment\n: As a significant portion of revenues and expenses are denominated in currencies other than the U.S. dollar, management believes it is important to understand the impact on sales and net income of translating these currencies into U.S. dollars. The Company utilizes constant-currency reporting for Optical Communications, Display, Specialty Materials, Automotive and Life Sciences segments for the Japanese yen, South Korean won, Chinese yuan, New Taiwan dollar, Mexican peso and euro, as applicable to the segment. We believe that the use of constant-currency reporting allows management to understand our results without the volatility of currency fluctuation, analyze underlying trends in the businesses and establish operational goals and forecasts. For the three and nine months ended September 30, 2025 and 2024, the constant-currency adjustment primarily relates to our Japanese yen exposure due to the difference in the average spot rate compared to our core rate. \nThe constant-currency rates established for our core performance measures are long-term management-determined rates, which are closely aligned with our hedging instrument rates. These hedging instruments may include, but are not limited to, foreign exchange forward or option contracts and foreign-denominated debt. Effective January 1, 2025, management updated the constant-currency rates and the updated rates were applied prospectively beginning with reporting periods in 2025. Comparative results were not recast and are reported based on the 2024 rates.\nConstant-currency rates used are as follows and are applied to the respective period presented and to all foreign exchange exposures during the period, even though we may be less than 100% hedged:\nCurrency\nJapanese yen\nSouth Korean won\nChinese yuan\nNew Taiwan dollar\nMexican peso\nEuro\n2024 Rate\n¥107\n₩1,175\n¥6.7\nNT$31\nMX$20\n€0.81\n2025 Rate\n¥120\n₩1,250\n¥6.9\nNT$31\nMX$21\n€0.88\n(2)\nTranslation of foreign denominated debt, net\n: Amount reflects the gain or loss on the translation of our yen-denominated and euro-denominated debt to U.S. dollars, net of gains or losses on related hedging instruments.\n(3)\nTranslated earnings contract, net\n: Amount reflects the impact of the realized and unrealized gains and losses from the Japanese yen, South Korean won, Chinese yuan, New Taiwan dollar, Mexican peso and euro-denominated foreign currency hedges related to translated earnings.\n(4)\nAcquisition-related costs\n: Amount reflects intangible amortization, inventory valuation adjustments and external acquisition-related deal costs, as well as other transaction related costs.\n(5)\nDiscrete tax items and other tax-related adjustments\n: Amount reflects certain discrete period tax items such as changes in tax law, the impact of tax audits, changes in tax reserves and changes in deferred tax asset valuation allowances, as well as other tax-related adjustments.\n(6)\nRestructuring, impairment and other charges and credits\n: Amount reflects certain restructuring, impairment losses and other charges and credits, as well as other expenses, including severance, accelerated depreciation, asset write-offs and facility repairs resulting from power outages, and the recognition of cumulative foreign currency translation adjustments upon the substantial liquidation of a foreign entity, which are not related to ongoing operations.\n(7)\nLitigation, regulatory and other legal matters\n: Amount reflects developments in commercial litigation, intellectual property disputes, adjustments to our estimated liability for environmental-related items and other legal matters.\n(8)\nPension mark-to-market adjustment\n: Amount primarily reflects defined benefit pension mark-to-market gains and losses, which arise from changes in actuarial assumptions and the difference between actual and expected returns on plan assets and discount rates.\n(9)\nGain or loss on investments\n: Amount reflects the gain or loss recognized on investments due to mark-to-market adjustments for the change in fair value or the disposition of an investment.\n(10)\nLoss on sale of assets\n: Amount represents the loss recognized for the sale of assets, recorded in cost of sales, in the consolidated statements of income (loss).\n(11)\nEquity in losses of affiliated companies\n: Amount reflects costs not related to continuing operations of affiliated companies, such as restructuring, impairment losses, inventory adjustments, other charges and credits.\n(12)\nLoss on sale of business\n: Amount reflects the loss recognized for the sale of a business, recorded in other expense, net in the consolidated statements of income (loss).\n35\nTable of Contents\n \nLIQUIDITY AND CAPITAL RESOURCES\nOur financial condition and liquidity are strong. We are not aware of any known trends, demands, commitments, events or uncertainties that will result in or that are reasonably likely to result in a material decrease in our liquidity. In addition, other than items discussed, there are no known material trends, favorable or unfavorable, in our capital resources and no expected material changes in the mix of such resources.\nOur major sources of funding for 2025 and beyond will be our operating cash flow, our existing balances of cash and cash equivalents and proceeds from any issuances of debt. We believe we have sufficient liquidity to fund operations and meet our obligations for the foreseeable future. Such obligations may include requirements for acquisitions, capital expenditures, debt repayments, dividend payments and share repurchases. We will continue to generate cash from operations and maintain access to our revolving credit facilities and commercial paper programs as discussed in more detail below.\nKey Balance Sheet Data\nWe fund our working capital with cash from operations and, periodically, short-term and long-term borrowings. In addition, from time to time, we receive upfront cash from customers relating to long-term supply agreements, as well as cash incentives from government entities generally for capital expansion and related expenses.\nThe following table presents balance sheet and working capital measures (in millions):\nSeptember 30,\n2025\nDecember 31,\n2024\nWorking capital\n$\n3,100 \n$\n3,073 \nCurrent ratio\n1.6:1\n1.6:1\nTrade accounts receivable, net of doubtful accounts\n$\n2,509 \n$\n2,053 \nDays sales outstanding\n55 \n53 \nInventories\n$\n3,104 \n$\n2,724 \nInventory turns\n3.2 \n3.2 \nDays payable outstanding \n(1)\n66 \n54 \nLong-term debt\n$\n7,407 \n$\n6,885 \nTotal debt\n$\n8,219 \n$\n7,211 \nTotal debt to total capital\n41\n%\n39\n%\n(1)\nIncludes trade payables only.\nWe perform comprehensive reviews of our significant customers and their creditworthiness by analyzing their financial strength at least annually or more frequently for customers where we have identified a measure of increased risk. We closely monitor payments and developments to identify potential customer credit issues. We are not aware of any customer credit issues that could have a material impact on our liquidity.\nWe participate in accounts receivable management programs, including factoring arrangements to sell certain accounts receivable to third-party financial institutions or accelerate collections through our customer’s supply chain financing arrangements. Sales of accounts receivable are reflected as a reduction of accounts receivable in the consolidated balance sheets and the proceeds are included in cash flows from operating activities in the consolidated statements of cash flows. By utilizing these types of programs, we accelerated the collection of $403 million, $399 million and $277 million in accounts receivable during the three months ended March 31, 2025, June 30, 2025 and September 30, 2025, respectively, which would have been collected during the normal course of business in the following quarter.\n36\nTable of Contents\n \nCash Flows\nThe following table presents a summary of cash flow data (in millions):\nNine months ended\nSeptember 30,\n2025\n2024\nNet cash provided by operating activities\n$\n1,643 \n$\n1,316 \nNet cash used in investing activities\n$\n(765)\n$\n(537)\nNet cash used in financing activities\n$\n(1,020)\n$\n(944)\nNet cash provided by operating activities for the nine months ended September 30, 2025 improved when compared to the same period in the prior year, primarily driven by higher net income.\nNet cash used in investing activities for the nine months ended September 30, 2025 increased by $228 million when compared to the same period last year, primarily driven by higher capital expenditures of $139 million and less realized gains on our translated earnings contracts of $47 million.\nNet cash used in financing activities for the nine months ended September 30, 2025 increased by $76 million when compared to the same period last year, primarily driven by the payment of acquisition related debt of $33 million, higher debt repayments of $28 million, higher repurchases of common stock of $23 million, lower proceeds from cross currency swaps of $44 million and lower proceeds from the exercise of stock options of $26 million, partially offset by higher proceeds from the issuance of debt of $132 million during 2025.\nSources of Liquidity\nAs of September 30, 2025, our cash and cash equivalents and available credit capacity included (in millions):\nSeptember 30,\n2025\nCash and cash equivalents\n$\n1,648 \nAvailable credit capacity:\nU.S. dollar revolving credit facility\n$\n1,500 \nCash and Cash Equivalents\nAs of September 30, 2025, we had $1.6 billion of cash and cash equivalents. Our cash and cash equivalents are held in various locations throughout the world and are generally unrestricted. We utilize a variety of strategies to ensure that our worldwide cash is available in the locations in which it is needed. As of September 30, 2025, approximately 45% of the consolidated cash and cash equivalents were held outside the U.S. \nAs of December 31, 2024, Corning had approximately $1.6 billion of indefinitely reinvested foreign earnings. If we distribute our foreign cash balances to the U.S. or to other foreign subsidiaries, we could be required to accrue and pay withholding taxes. We do not foresee a need to repatriate any earnings for which we asserted permanent reinvestment. However, to help fund cash needs of the U.S. or other international subsidiaries as they arise, we repatriate available cash from certain foreign subsidiaries whose earnings are not permanently reinvested.\n37\nTable of Contents\n \nDebt Facilities and Other Sources of Liquidity\nWe have a commercial paper program pursuant to which we may issue short-term, unsecured commercial paper notes up to a maximum aggregate principal amount outstanding at any one time of $1.5 billion. Under this program, we may issue commercial paper from time to time and will use the proceeds for general corporate purposes. As of September 30, 2025, we did not have outstanding commercial paper.\nWe have a line of credit facility available to support obligations under the commercial paper program and for general corporate purposes, if needed. On July 28, 2025, the Company entered into the New Credit Agreement, which replaces the Company’s $1.5 billion Existing Credit Agreement dated June 6, 2022. The New Credit Agreement provides a committed $1.5 billion in unsecured multi-currency line of credit and expires July 28, 2030. As of September 30, 2025, there were no outstanding amounts under the Existing Credit Agreement or the New Credit Agreement.\nThe New Credit Agreement includes affirmative and negative covenants with which we must comply, including a leverage (debt to capital ratio) financial covenant. The required leverage ratio is a maximum of 60%. As of September 30, 2025, our leverage using this measure was approximately 41%. As of September 30, 2025, we were in compliance with all such covenants.\nOur debt instruments contain customary event of default provisions, which allow the lenders the option of accelerating all obligations upon the occurrence of certain events. In addition, some of our debt instruments contain a cross default provision, whereby an uncured default exceeding a specified amount on one debt obligation, also would be considered a default under the terms of another debt instrument. As of September 30, 2025, we were in compliance with all such provisions.\nWe have access to certain Chinese yuan-denominated unsecured variable rate loan facilities, whose proceeds are used for capital investment and general corporate purposes. As of September 30, 2025, borrowings totaled $394 million and these facilities had variable interest rates ranging from 2.2% to 3.2% and maturities ranging from 2025 to 2032. As of September 30, 2025, the amount of unused capacity was not material.\nAs a well-known seasoned issuer, we filed an automatic shelf registration with the SEC on December 1, 2023. Under this shelf registration we may offer, from time to time, debt securities, common stock, preferred stock, depository shares and warrants.\nRefer to Note 10 (Debt) in the notes to the consolidated financial statements within the 2024 Form 10-K as well as Note 8 (Debt) in the accompanying notes to the consolidated financial statements for additional information.\nCustomer Deposits, Deferred Revenue and Government Incentives \nWe receive cash deposits or consideration, generally non-refundable, from customers under long-term supply agreements. In addition, we receive government assistance, typically in the form of cash incentives primarily for capital expansion projects and tax credits.\nRefer to Note 1 (Summary of Significant Accounting Policies) and Note 3 (Revenue) in the notes to the consolidated financial statements within the 2024 Form 10-K as well as Note 4 (Revenue) in the accompanying notes to the consolidated financial statements for additional information.\nUses of Cash\nShare Repurchase Agreement\nPursuant to the Share Repurchase Agreement (“SRA”) with Samsung Display Co., Ltd. (“SDC”), 22 million common shares held by SDC can be offered to be sold to Corning in specified tranches from time to time in calendar years 2024 through 2027. Corning may, at its sole discretion, elect to repurchase such common shares. If Corning elects not to repurchase the common shares and SDC sells the common shares on the open market, Corning is required to pay SDC a make-whole payment, subject to a 5% cap of the repurchase proceeds that otherwise would have been paid by Corning. As of September 30, 2025 and December 31, 2024, the fair value of the liability associated with this option, measured using Level 2 inputs, was not material. \nRefer to Note 14 (Shareholders’ Equity) in the notes to the consolidated financial statements within the 2024 Form 10-K for additional information.\n38\nTable of Contents\n \nShare Repurchases\nIn 2019, the Board authorized the repurchase of up to $5.0 billion of common stock (“2019 Authorization”). \nAs of September 30, 2025, approximately $3.0 billion remains available under our 2019 Authorization, which does not have an expiration date and may be amended or terminated by the Board of Directors at any time without prior notice.\nRefer to Note 14 (Shareholders’ Equity) in the accompanying notes to the consolidated financial statements for additional information. \nCommon Stock Dividends\nThe Board’s decision to declare and pay future dividends will depend on our income and liquidity position, among other factors. We expect to declare quarterly dividends and fund payments with cash from operations.\nRefer to Note 14 (Shareholders’ Equity) in the accompanying notes to the consolidated financial statements for additional information.\nCapital Expenditures\nCapital expenditures were $850 million for the nine months ended September 30, 2025. We expect our 2025 full year capital expenditures to be approximately $1.3 billion.\nCurrent Maturities of Short and Long-Term Debt\nAs of September 30, 2025, we had $812 million of long-term debt that is due in less than one year.\nRefer to Note 10 (Debt) in the notes to the consolidated financial statements within the 2024 Form 10-K for additional information, including a summary of our debt maturities by year, and Note 8 (Debt) in the accompanying notes to the consolidated financial statements.\nDefined Benefit Pension Plans\nOur global pension plans, including our unfunded and non-qualified plans, were 86% funded as of December 31, 2024. Our largest single pension plan is our U.S. qualified plan, which accounted for 78% of our consolidated defined benefit pension plans’ projected benefit obligation, was 98% funded as of December 31, 2024. The funded status of our pension plans is dependent upon multiple factors including actuarial assumptions, interest rates at year-end, prior investment returns and contributions made to the plans.\nRefer to Note 11 (Employee Retirement Plans) in the notes to the consolidated financial statements within the 2024 Form 10-K for additional information.\nCommitments, Contingencies and Guarantees\nThere were no material changes outside the ordinary course of business in the obligations disclosed in Note 12 (Commitments and Contingencies and Guarantees) in the notes to the consolidated financial statements within the 2024 Form 10-K. A summary of details of our commitments related to executed leases that have not yet commenced are included within Note 5 (Leases) in the notes to the consolidated financial statements within the 2024 Form 10-K and Note 6 (Leases) in the accompanying notes to the consolidated financial statements. \nOff Balance Sheet Arrangements\nThere were no material changes outside the ordinary course of business in off balance sheet arrangements as disclosed in the 2024 Form 10-K under the caption “Off Balance Sheet Arrangements.”\n39\nTable of Contents\n \nENVIRONMENT \nRefer to Item 1. Legal Proceedings or Note 10 (Commitments and Contingencies) in the accompanying notes to the consolidated financial statements for information.\nCRITICAL ACCOUNTING ESTIMATES\nOur consolidated financial statements are prepared in conformity with accounting principles generally accepted in the United States of America. This requires us to make estimates and assumptions that affect reported amounts and related disclosures. Actual results could differ from those estimates. The estimates that are considered by management to be the most critical to the understanding of the consolidated financial statements as they require significant judgments that could materially impact our results of operations, financial position and cash flows are described in Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the Company’s 2024 Form 10-K. Since the date of the Company’s most recent Annual Report, there were no material changes in the Company’s critical accounting estimates or assumptions.\n40\nTable of Contents\n \nFORWARD-LOOKING STATEMENTS \nThe statements in this Quarterly Report on Form 10-Q, in reports subsequently filed by Corning with the Securities and Exchange Commission (“SEC”) on Forms 10-Q and 8-K and related comments by management that are not historical facts or information and contain words such as “will,” “believe,” “anticipate,” “expect,” “intend,” “plan,” “seek,” “see,” “would,” “target,” “estimate,” “forecast” or similar expressions are forward-looking statements. Such statements relate to future events that by their nature address matters that are, to different degrees, uncertain. These forward-looking statements relate to, among other things, the Company’s Springboard plan, the Company’s future operating performance, the Company’s share of new and existing markets, the Company’s revenue and earnings growth rates, the Company’s ability to innovate and commercialize new products, the Company’s expected capital expenditure and the Company’s implementation of cost-reduction initiatives and measures to improve pricing, including the optimization of the Company’s manufacturing capacity.\nAlthough the Company believes that these forward-looking statements are based upon reasonable assumptions regarding, among other things, current estimates and forecasts, general economic conditions, its knowledge of its business and key performance indicators that impact the Company, there can be no assurance that these forward-looking statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. The Company undertakes no obligation to update forward-looking statements if circumstances or management’s estimates or opinions should change except as required by applicable securities laws.\nSome of the risks, uncertainties and other factors that could cause actual results to differ materially from those expressed in or implied by the forward-looking statements include, but are not limited to:\n-\nglobal economic trends, competition and geopolitical risks, or an escalation of sanctions, tariffs or other trade tensions between the U.S. and other countries, and related impacts on our businesses’ global supply chains and strategies;\n-\nchanges in macroeconomic and market conditions and market volatility, including developments and volatility arising from health crisis events, inflation, interest rates, the value of securities and other financial assets, precious metals, oil, natural gas, raw materials and other commodity prices and exchange rates (particularly between the U.S. dollar and the Japanese yen, South Korean won, Chinese yuan, New Taiwan dollar, Mexican peso and euro), decreases or sudden increases of consumer demand, and the impact of such changes and volatility on our financial position and businesses;\n-\nthe availability of or adverse changes relating to government grants, tax credits or other government incentives;\n-\nthe duration and severity of health crisis events, such as an epidemic or pandemic, and its impact across our businesses on demand, personnel, operations, our global supply chains and stock price;\n-\npossible disruption in commercial activities or our supply chain due to terrorist activity, cyber-attack, armed conflict, political or financial instability, natural disasters, international trade disputes or major health concerns;\n-\nloss of intellectual property due to theft, cyber-attack, or disruption to our information technology infrastructure;\n-\nability to enforce patents and protect intellectual property and trade secrets;\n-\ndisruption to Corning’s, our suppliers’ and manufacturers’ supply chain, equipment, facilities, IT systems or operations;\n-\nproduct demand and industry capacity;\n-\ncompetitive products and pricing;\n-\navailability and costs of critical components, materials, equipment, natural resources and utilities;\n-\nnew product development and commercialization;\n-\norder activity and demand from major customers;\n-\nthe amount and timing of our cash flows and earnings and other conditions, which may affect our ability to pay our quarterly dividend at the planned level or to repurchase shares at planned levels;\n-\nthe amount and timing of any future dividends;\n-\nthe effects of acquisitions, dispositions and other similar transactions;\n-\nthe effect of regulatory and legal developments;\n-\nability to pace capital spending to anticipated levels of customer demand;\n-\nour ability to increase margins through implementation of operational changes, pricing actions and cost reduction measures;\n-\nrate of technology change;\n-\nadverse litigation;\n-\nproduct and component performance issues;\n-\nretention of key personnel;\n-\ncustomer ability to maintain profitable operations and obtain financing to fund ongoing operations and manufacturing expansions and pay receivables when due;\n-\nloss of significant customers;\n-\nchanges in tax laws, regulations and international tax standards;\n-\nthe impacts of audits by taxing authorities; and\n-\nthe potential impact of legislation, government regulations, and other government action and investigations.\n41\nTable of Contents"
}