{
  "source_file": "gm-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nBasis of Presentation  \nThis Management's Discussion and Analysis of Financial Condition and Results of Operations (MD&A) should be read in conjunction with the accompanying condensed consolidated financial statements and the notes thereto, and the audited consolidated financial statements and notes thereto included in our 2024 Form 10-K.\nForward-looking statements in this MD&A are not guarantees of future performance and may involve risks and uncertainties that could cause actual results to differ materially from those projected. Refer to the \"Forward-Looking Statements\" section of this MD&A, Part I, Item 1A. Risk Factors of our 2024 Form 10-K and Part II, Item 1A. Risk Factors for a discussion of these risks and uncertainties. Except for per share amounts or as otherwise specified, dollar amounts presented within tables are stated in millions. Certain columns and rows may not add due to rounding.\nOverview  \nOur vision for the future is a world with zero crashes, zero emissions and zero congestion. We will adapt to customer preferences while executing our growth-focused strategy to invest in EVs, hybrids, personal AV technology, software-enabled services and other new business opportunities. To support strong margins and cash flow during this transition, we continue to strengthen our market position in profitable ICE vehicles, such as trucks and SUVs. We plan to execute our strategy with a steadfast commitment to good corporate citizenship through more sustainable operations and a leading health and safety culture.\nOur financial performance continues to be driven by the strength of our vehicle portfolio, including high margin full-size pickup trucks and SUVs, strong consumer demand for our products and the execution of our core business strategy. We remain focused on maintaining an efficient cost structure and pricing discipline. We continue to prioritize driving down costs to improve profitability and are aligning EV capacity to expected consumer demand. In February 2025, we completed the acquisition of the noncontrolling interests in Cruise and are prioritizing the development of ADAS on a path to fully autonomous personal vehicles. We are monitoring industry pricing pressures, changing interest rates, inflation, warranty claims, consumer demand trends, changes to the regulatory environment, including with respect to fuel economy standards, GHG emissions regulations, corporate taxes and EV incentives.\nIn the first quarter of 2025, the U.S. Government announced new tariffs, inclusive of vehicles and parts imported into the U.S. The tariff environment continues to remain highly dynamic and the specific tariffs applicable to goods imported by GM and its suppliers into the U.S., including under the U.S.-Mexico-Canada Agreement, continue to evolve, as do import tariffs charged by other countries. In October 2025, the U.S. Government announced certain modifications to tariffs relevant to the automotive industry, including tariffs related to imports of heavy-duty trucks and, separately, to parts for passenger vehicles and light-duty trucks. With respect to tariffs on imports of heavy-duty trucks, we do not anticipate that such tariffs will have a material impact on our business results. With respect to the expansion and extension of the import adjustment offset program established pursuant to Presidential Proclamation 10925, and due in part to increased competitiveness of our U.S. produced vehicles, GM anticipates that the recently announced changes will result in a material positive benefit to our fourth quarter 2025 business results, as well as in future quarters. Based on the current tariff environment, we estimate that impacts to EBIT-adjusted could range from $3.5 billion to $4.5 billion for the year ending December 31, 2025. Refer to Part II, Item 1A. Risk Factors for a full discussion of the risks associated with the U.S. tariff environment.\nOn July 4, 2025, the Act was signed into law that includes the extension and modification of certain key provisions of the U.S. Tax Cuts and Jobs Act of 2017, modification of certain Inflation Reduction Act incentives, acceleration of the phase-out of clean vehicle and other clean energy credits and sets the civil penalties to zero for noncompliance with CAFE standards. The Act also introduces a new auto loan interest deductibility provision that allows some individuals to deduct up to $10,000 per year in interest on new, U.S.-assembled personal vehicles purchased between 2025 and 2028. There are a variety of effective dates in the Act and only certain key provisions with financial reporting implications are expected to affect our financial statements for the year ending December 31, 2025. In July 2025, the EPA proposed to remove GHG regulations for light-, medium- and heavy-duty on-highway vehicles on a retrospective and prospective basis. Should the EPA remove GHG regulations, the majority of the carrying amount of our acquired credits of $1.2 billion may be subject to impairment in the near term and our ongoing cost of compliance to the GHG regulations would be favorably impacted.\nFollowing these recent U.S. Government policy changes, including the termination of consumer tax incentives for EV purchases and the reduction in stringency of emissions regulations, we expect the adoption rate of EVs to slow. These developments have caused us to reassess our EV capacity and manufacturing footprint to align with expected consumer demand. Based on a planned strategic realignment of our EV capacity and manufacturing footprint to expected consumer demand, we recorded charges of $1.6 billion in GMNA in the three months ended September 30, 2025. The reassessment of our EV capacity and manufacturing footprint, including our investments in our battery component manufacturing, is ongoing and it \n29\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nis reasonably possible that we will recognize additional future material cash and non-cash charges that may adversely affect our results of operations and cash flows in the period in which they are recognized. These amounts will be recognized in our results as decisions are made and will be reflected as adjustments in our non-GAAP financial measures. Refer to the \"Non-GAAP Measures\" section of this MD&A for additional information. Our strategic realignment of EV capacity does not impact today's retail portfolio of Chevrolet, GMC, and Cadillac EVs currently in production, and we expect these models to remain available to consumers.\nAs we continue to assess our performance and the needs of our evolving business, additional restructuring and rationalization actions could be required. These actions could give rise to future asset impairments or other charges, which may have a material impact on our operating results. Refer to the \"Consolidated Results\" and regional sections of this MD&A for additional information.\nWe face continuing market, operating and regulatory challenges in several countries across the globe due to, among other factors, competitive pressures, our product portfolio offerings, heightened emission standards, labor disruptions, foreign exchange volatility, evolving trade policy and political uncertainty. In addition, we are monitoring a potential disruption to automotive industry supply chains with respect to certain electrical subcomponents, including transistors, diodes and other semiconductors. While we are working with our supply chain partners to avoid impacts to GM, a disruption in the supply of such electrical subcomponents is possible, which could have an impact on our planned production schedules. Refer to Part I, Item 1A. Risk Factors in our 2024 Form 10-K and Part II, Item 1A. Risk Factors for a discussion of these challenges.\nFor the year ending December 31, 2025, we expect Net income attributable to stockholders of between $7.7 billion and $8.3 billion, EBIT-adjusted of between $12.0 billion and $13.0 billion, EPS-diluted of between $8.30 and $9.05 and EPS-diluted-adjusted of between $9.75 and $10.50. Refer to the \"Non-GAAP Measures\" section of this MD&A for additional information.\nThe following table reconciles expected Net income attributable to stockholders to expected EBIT-adjusted (dollars in billions):\nYear Ending December 31, 2025\nNet income attributable to stockholders\n$ 7.7-8.3\nIncome tax expense \n1.8-2.2\nAutomotive interest income, net\n(0.1)\nAdjustments(a)\n2.6\nEBIT-adjusted\n$ 12.0-13.0\n__________\n(a)\nRefer to the reconciliation of Net income (loss) attributable to stockholders to EBIT-adjusted within this MD&A for adjustment details. These expected financial results do not include the potential impact of future adjustments related to special items.\nThe following table reconciles expected EPS-diluted to expected EPS-diluted-adjusted\n:\nYear Ending December 31, 2025\nDiluted earnings per common share\n$ 8.30-9.05\nAdjustments(a)\n1.45\nEPS-diluted-adjusted\n$ 9.75-10.50\n__________\n(a)\nRefer to the reconciliation of diluted earnings per common share to EPS-diluted-adjusted within this MD&A for adjustment details. These expected financial results do not include the potential impact of future adjustments related to special items.\nGMNA  \nIndustry sales in North America were 15.5 million units in the nine months ended September 30, 2025, representing an increase of 4.1% compared to the corresponding period in 2024. U.S. industry sales were 12.5 million units in the nine months ended September 30, 2025, representing an increase of 4.1% compared to the corresponding period in 2024.\nOur total vehicle sales in the U.S., our largest market in North America, were 2.2 million units for market share of 17.2% in the nine months ended September 30, 2025, representing an increase of 1.0 percentage points compared to the corresponding period in 2024.\nWe achieved solid margins in the nine months ended September 30, 2025 driven by the strength of our product portfolio and ongoing cost discipline. However, the evolving tariff and policy landscape could have a material impact on our profitability \n30\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\ngoing forward. We remain focused on improving our EV profitability while maintaining our focus on cost. In addition, our outlook is dependent on continued supply chain availability, the resiliency of the U.S. economy and overall economic conditions, including the imposition of tariffs, less available offsets and deductions, or other trade restrictions by the U.S. or its trading partners. Looking ahead, our top priority is returning GMNA to its historical 8.0-10.0% EBIT-adjusted margins as quickly as possible.\nGMI  \nIndustry sales in China were 19.3 million units in the nine months ended September 30, 2025, representing an increase of 6.5% compared to the corresponding period in 2024. Our total vehicle sales in China were 1.4 million units for market share of 7.0% in the nine months ended September 30, 2025, representing an increase of 0.2 percentage points compared to the corresponding period in 2024. Our Automotive China JVs generated equity income of $0.2 billion in the nine months ended September 30, 2025. We continue to focus on enhancing the competitiveness of our products in the Chinese market and executing restructuring plans. Additional restructuring charges may be incurred going forward.\nOutside of China, industry sales were 19.8 million units in the nine months ended September 30, 2025, representing an increase of 3.2% compared to the corresponding period in 2024. Our total vehicle sales outside of China were 0.7 million units for market share of 3.3% in the nine months ended September 30, 2025, representing a decrease of 0.3 percentage points compared to the corresponding period in 2024.\nVehicle Sales  \nThe principal factors that determine consumer vehicle preferences in the markets in which we operate include overall vehicle design, price, quality, available options, safety, reliability, fuel economy or range and functionality. Market leadership in individual countries in which we compete varies widely.\nWe present both wholesale and total vehicle sales data to assist in the analysis of our revenue and market share. Wholesale vehicle sales data consists of sales to GM's dealers and distributors as well as sales to the U.S. government, and excludes vehicles sold by our joint ventures. Wholesale vehicle sales data correlates to our revenue recognized from the sale of vehicles, which is the largest component of Automotive net sales and revenue. In the nine months ended September 30, 2025, 26.4% of our wholesale vehicle sales volume was generated outside the U.S. The following table summarizes wholesale vehicle sales by our Automotive operations (vehicles in thousands): \nThree Months Ended\nNine Months Ended\nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\nGMNA\n840 \n86.0 \n%\n893 \n86.4 \n%\n2,516 \n87.9 \n%\n2,588 \n87.1 \n%\nGMI\n137 \n14.0 \n%\n140 \n13.6 \n%\n346 \n12.1 \n%\n383 \n12.9 \n%\nTotal\n977 \n100.0 \n%\n1,033 \n100.0 \n%\n2,862 \n100.0 \n%\n2,971 \n100.0 \n%\nTotal vehicle sales data represents: (1) retail sales (i.e., sales to consumers who purchase new vehicles from dealers or distributors); (2) fleet sales (i.e., sales to large and small businesses, governments and daily rental car companies); and (3) sales of courtesy transportation vehicles (i.e., vehicles previously used by dealers that were sold to the end consumer). Total vehicle sales data includes all sales by joint ventures on a total vehicle basis, not based on our percentage ownership interest in the joint venture. Certain joint venture agreements in China allow for the contractual right to report vehicle sales of non-GM trademarked vehicles by those joint ventures, which are included in the total vehicle sales we report for China. While total vehicle sales data does not correlate directly to the revenue we recognize during a particular period, we believe it is indicative of the underlying demand for our vehicles. Total vehicle sales data represents management's good faith estimate based on sales reported by our dealers, distributors and joint ventures; commercially available data sources such as registration and insurance data; and internal estimates and forecasts when other data is not available.\n31\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nThe following table summarizes industry and GM total vehicle sales and our related competitive position by geographic region (vehicles in thousands):\n \nThree Months Ended\nNine Months Ended\n \nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\n \nIndustry\nGM\nMarket Share\nIndustry\nGM\nMarket Share\nIndustry\nGM\nMarket Share\nIndustry\nGM\nMarket Share\nNorth America\nUnited States\n4,187 \n710 \n17.0 \n%\n4,000 \n660 \n16.5 \n%\n12,516 \n2,150 \n17.2 \n%\n12,026 \n1,950 \n16.2 \n%\nOther\n1,015 \n127 \n12.5 \n%\n985 \n130 \n13.2 \n%\n3,008 \n384 \n12.8 \n%\n2,884 \n376 \n13.0 \n%\nTotal North America\n5,202 \n837 \n16.1 \n%\n4,985 \n790 \n15.8 \n%\n15,523 \n2,534 \n16.3 \n%\n14,910 \n2,326 \n15.6 \n%\nAsia/Pacific, Middle East and Africa\nChina(a)\n6,901 \n469 \n6.8 \n%\n6,585 \n426 \n6.5 \n%\n19,299 \n1,359 \n7.0 \n%\n18,123 \n1,240 \n6.8 \n%\nOther\n5,598 \n150 \n2.7 \n%\n5,536 \n150 \n2.7 \n%\n16,603 \n369 \n2.2 \n%\n16,310 \n382 \n2.3 \n%\nTotal Asia/Pacific, Middle East and Africa\n12,499 \n619 \n5.0 \n%\n12,121 \n576 \n4.8 \n%\n35,903 \n1,729 \n4.8 \n%\n34,433 \n1,622 \n4.7 \n%\nSouth America\nBrazil\n711 \n72 \n10.1 \n%\n715 \n82 \n11.4 \n%\n1,910 \n192 \n10.0 \n%\n1,858 \n223 \n12.0 \n%\nOther\n455 \n35 \n7.7 \n%\n365 \n28 \n7.7 \n%\n1,266 \n95 \n7.5 \n%\n991 \n82 \n8.3 \n%\nTotal South America\n1,166 \n107 \n9.2 \n%\n1,079 \n110 \n10.3 \n%\n3,176 \n287 \n9.0 \n%\n2,849 \n305 \n10.7 \n%\nTotal in GM markets\n18,868 \n1,563 \n8.3 \n%\n18,185 \n1,476 \n8.1 \n%\n54,602 \n4,549 \n8.3 \n%\n52,193 \n4,253 \n8.1 \n%\nTotal Europe\n3,883 \n1 \n— \n%\n3,724 \n1 \n— \n%\n12,493 \n2 \n— \n%\n12,541 \n2 \n— \n%\nTotal Worldwide(b)\n22,751 \n1,564 \n6.9 \n%\n21,910 \n1,477 \n6.7 \n%\n67,095 \n4,552 \n6.8 \n%\n64,734 \n4,255 \n6.6 \n%\nUnited States\nCars\n658 \n12 \n1.8 \n%\n731 \n38 \n5.2 \n%\n2,080 \n44 \n2.1 \n%\n2,207 \n141 \n6.4 \n%\nTrucks\n1,143 \n369 \n32.3 \n%\n1,093 \n337 \n30.9 \n%\n3,417 \n1,115 \n32.6 \n%\n3,137 \n987 \n31.5 \n%\nCrossovers\n2,387 \n330 \n13.8 \n%\n2,176 \n284 \n13.1 \n%\n7,018 \n992 \n14.1 \n%\n6,683 \n822 \n12.3 \n%\nTotal United States\n4,187 \n710 \n17.0 \n%\n4,000 \n660 \n16.5 \n%\n12,516 \n2,150 \n17.2 \n%\n12,026 \n1,950 \n16.2 \n%\nChina(a)\nSGMS\n130 \n98 \n381 \n372 \nSGMW\n339 \n329 \n978 \n868 \nTotal\n6,901 \n469 \n6.8 \n%\n6,585 \n426 \n6.5 \n%\n19,299 \n1,359 \n7.0 \n%\n18,123 \n1,240 \n6.8 \n%\n__________\n(a)\nIncludes sales by the Automotive China JVs: SAIC General Motors Sales Co., Ltd. (SGMS) and SAIC GM Wuling Automobile Co., Ltd. (SGMW).\n(b)\nCuba, Iran, North Korea, Syria and certain regions of Ukraine are subject to broad economic sanctions. Accordingly, these countries are excluded from industry sales data and corresponding calculation of market share.\nAs discussed above, total vehicle sales and market share data provided in the table above includes fleet vehicles. Certain fleet transactions, particularly sales to daily rental car companies, are generally less profitable than retail sales to end customers. The following table summarizes estimated fleet sales and those sales as a percentage of total vehicle sales (vehicles in thousands):\nThree Months Ended\nNine Months Ended\nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\nGMNA\n148 \n127 \n498 \n447 \nGMI\n106 \n107 \n269 \n274 \nTotal fleet sales\n254 \n234 \n767 \n721 \nFleet sales as a percentage of total vehicle sales\n16.3 \n%\n15.9 \n%\n16.9 \n%\n17.0 \n%\n32\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nGM Financial  \nWe believe that offering a comprehensive suite of financing products will generate incremental sales of our vehicles, drive incremental GM Financial earnings and help support our sales throughout various economic cycles. GM Financial's penetration of our retail sales in the U.S. was 34% in the nine months ended September 30, 2025 and 39% in the corresponding period in 2024. Penetration levels vary depending on incentive financing programs available and competing third-party financing products in the market. GM Financial's prime loan originations as a percentage of total loan originations in North America were 80% in the nine months ended September 30, 2025 and 2024. In the nine months ended September 30, 2025, GM Financial's revenue consisted of leased vehicle income of 46%, retail finance charge income of 41% and commercial finance charge income of 7%.\nGM Financial's leasing program is exposed to residual values, which are heavily dependent on used vehicle prices. Gains on terminations of leased vehicles of $0.1 billion and $0.5 billion were included in GM Financial interest, operating and other expenses for the three and nine months ended September 30, 2025, compared to gains of $0.2 billion and $0.6 billion in the corresponding periods in \n2024\n. The decrease in gains is primarily due to fewer terminated leases in 2025. The following table summarizes the estimated residual value based on GM Financial's most recent estimates and the number of units included in GM Financial Equipment on operating leases, net by vehicle type (units in thousands):\nSeptember 30, 2025\nDecember 31, 2024\nResidual Value\nUnits\nPercentage\nResidual Value\nUnits\nPercentage\nCrossovers\n$\n13,399 \n629 \n65.7 \n%\n$\n13,184 \n635 \n67.3 \n%\nTrucks\n8,443 \n246 \n25.6 \n%\n7,458 \n224 \n23.7 \n%\nSUVs\n2,583 \n56 \n5.8 \n%\n2,260 \n53 \n5.6 \n%\nCars\n541 \n27 \n2.8 \n%\n590 \n31 \n3.3 \n%\nTotal\n$\n24,966 \n957 \n100.0 \n%\n$\n23,492 \n943 \n100.0 \n%\nConsolidated Results  \nWe review changes in our results of operations under five categories: Volume, Mix, Price, Cost and Other. Volume measures the impact of changes in wholesale vehicle volumes driven by industry volume, market share and changes in dealer stock levels. Mix measures the impact of changes to the regional portfolio due to product, model, trim, country and option penetration in current year wholesale vehicle volumes. Price measures the impact of changes related to Manufacturer’s Suggested Retail Price and various sales allowances. Cost primarily includes: (1) material and freight; (2) manufacturing, engineering, advertising, administrative and selling and warranty expenses; and (3) non-vehicle related activity. Other primarily includes foreign exchange and non-vehicle related automotive revenues as well as equity income or loss from our nonconsolidated affiliates. Refer to the regional sections of this MD&A for additional information.\nTotal Net Sales and Revenue\nThree Months Ended\nFavorable/ (Unfavorable)\n%\nVariance Due To\nSeptember 30, 2025\nSeptember 30, 2024\nVolume\nMix\nPrice\nOther\n(Dollars in billions)\nGMNA\n$\n40,551 \n$\n41,157 \n$\n(606)\n(1.5)\n%\n$\n(2.2)\n$\n1.0 \n$\n0.1 \n$\n0.5 \nGMI\n3,645 \n3,517 \n128 \n3.6 \n%\n$\n(0.1)\n$\n0.2 \n$\n0.1 \n$\n(0.1)\nCorporate\n60 \n62 \n(2)\n(2.9)\n%\n$\n— \n$\n— \nAutomotive\n44,256 \n44,735 \n(480)\n(1.1)\n%\n$\n(2.3)\n$\n1.1 \n$\n0.2 \n$\n0.4 \nCruise\n— \n26 \n(26)\nn.m.\n$\n— \nGM Financial\n4,337 \n4,031 \n305 \n7.6 \n%\n$\n0.3 \nEliminations/reclassifications\n(2)\n(36)\n34 \n94.8 \n%\n$\n— \n$\n— \nTotal net sales and revenue\n$\n48,591 \n$\n48,757 \n$\n(166)\n(0.3)\n%\n$\n(2.3)\n$\n1.1 \n$\n0.2 \n$\n0.7 \n__________\nn.m. = not meaningful\n33\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNine Months Ended\nFavorable/ (Unfavorable)\n%\nVariance Due To\nSeptember 30, 2025\nSeptember 30, 2024\nVolume\nMix\nPrice\nOther\n(Dollars in billions)\nGMNA\n$\n117,424 \n$\n117,981 \n$\n(556)\n(0.5)\n%\n$\n(3.0)\n$\n1.7 \n$\n0.8 \n$\n— \nGMI\n9,398 \n9,897 \n(499)\n(5.0)\n%\n$\n(0.8)\n$\n0.5 \n$\n0.3 \n$\n(0.5)\nCorporate \n163 \n130 \n33 \n25.0 \n%\n$\n— \n$\n— \nAutomotive\n126,985 \n128,007 \n(1,023)\n(0.8)\n%\n$\n(3.8)\n$\n2.1 \n$\n1.1 \n$\n(0.5)\nCruise\n1 \n76 \n(75)\n(98.8)\n%\n$\n(0.1)\nGM Financial\n12,756 \n11,761 \n995 \n8.5 \n%\n$\n1.0 \nEliminations/reclassifications\n(9)\n(105)\n96 \n91.1 \n%\n$\n— \n$\n0.1 \nTotal net sales and revenue\n$\n139,732 \n$\n139,740 \n$\n(8)\n— \n%\n$\n(3.8)\n$\n2.1 \n$\n1.1 \n$\n0.5 \nRefer to the regional sections of this MD&A for additional information on Volume, Mix, Price and Other.\nAutomotive and Other Cost of Sales\nThree Months Ended\nFavorable/ (Unfavorable)\n%\nVariance Due To\nSeptember 30, 2025\nSeptember 30, 2024\nVolume\nMix\nCost\nOther\n(Dollars in billions)\nGMNA\n$\n38,575 \n$\n35,541 \n$\n(3,034)\n(8.5)\n%\n$\n1.6 \n$\n(0.9)\n$\n(4.0)\n$\n0.2 \nGMI\n3,309 \n3,173 \n(137)\n(4.3)\n%\n$\n0.1 \n$\n(0.1)\n$\n— \n$\n— \nCorporate\n53 \n55 \n2 \n3.7 \n%\n$\n— \n$\n— \n$\n— \nCruise\n— \n240 \n240 \nn.m.\n$\n0.2 \nEliminations\n(1)\n(1)\n— \n18.1 \n%\n$\n— \n$\n— \nTotal automotive and other cost of sales\n$\n41,936 \n$\n39,007 \n$\n(2,929)\n(7.5)\n%\n$\n1.6 \n$\n(1.0)\n$\n(3.8)\n$\n0.2 \n__________\nn.m. = not meaningful\nNine Months Ended\nFavorable/ (Unfavorable)\n%\nVariance Due To\nSeptember 30, 2025\nSeptember 30, 2024\nVolume\nMix\nCost\nOther\n(Dollars in billions)\nGMNA\n$\n107,200 \n$\n100,858 \n$\n(6,342)\n(6.3)\n%\n$\n2.1 \n$\n(2.1)\n$\n(7.3)\n$\n1.0 \nGMI\n8,875 \n8,996 \n121 \n1.3 \n%\n$\n0.6 \n$\n(0.3)\n$\n(0.3)\n$\n0.1 \nCorporate\n181 \n103 \n(77)\n(75.1)\n%\n$\n— \n$\n(0.1)\n$\n— \nCruise\n163 \n1,662 \n1,499 \n90.2 \n%\n$\n1.5 \nEliminations\n(2)\n(2)\n1 \n39.9 \n%\n$\n— \n$\n— \nTotal automotive and other cost of sales\n$\n116,416 \n$\n111,618 \n$\n(4,799)\n(4.3)\n%\n$\n2.8 \n$\n(2.5)\n$\n(6.2)\n$\n1.1 \nIn the three months ended September 30, 2025, increased Cost was primarily due to: (1) charges of $1.6 billion due to the EV strategic realignment; (2) increased material and freight costs of $1.0 billion, including $1.1 billion due to tariffs; (3) increased warranty-related costs of $0.9 billion; and (4) charges of $0.3 billion due to our former OnStar Smart Driver program; partially offset by (5) decreased engineering costs of $0.2 billion, driven primarily by the wind down of Cruise robotaxi operations. In the three months ended September 30, 2025, favorable Other was primarily due to net foreign currency changes in the Mexican peso.\n34\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nIn the nine months ended September 30, 2025, increased Cost was primarily due to: (1) increased material and freight costs of $2.7 billion, including $2.4 billion due to tariffs; (2) charges of $1.6 billion due to the EV strategic realignment; (3) increased warranty-related costs of $1.3 billion; (4) unfavorable net realizable value inventory adjustments, primarily EV-related, of $0.5 billion in the nine months ended September 30, 2025 compared to similar favorable inventory adjustments of $0.4 billion in the nine months ended September 30, 2024; (5) charges of $0.3 billion due to the Ultium Cells Holdings LLC strategic realignment; (6) charges of $0.3 billion due to our former OnStar Smart Driver program; and (7) increased manufacturing costs of $0.2 billion; partially offset by (8) decreased engineering costs of $0.7 billion, driven primarily by the wind down of Cruise robotaxi operations; and (9) the reduction of charges related to Cruise restructuring of $0.6 billion. In the nine months ended September 30, 2025, favorable Other was primarily due to net foreign currency changes in the Mexican peso.\nRefer to the regional sections of this MD&A for additional information on Volume and Mix.\nAutomotive and Other Selling, General and Administrative Expense\nThree Months Ended\nFavorable/ (Unfavorable)\nNine Months Ended\nFavorable/ (Unfavorable)\nSeptember 30, 2025\nSeptember 30, 2024\n%\nSeptember 30, 2025\nSeptember 30, 2024\n%\nAutomotive and other selling, general and administrative expense\n$\n2,037 \n$\n2,745 \n$\n709 \n25.8 \n%\n$\n6,161 \n$\n7,292 \n$\n1,131 \n15.5 \n%\nIn the three months ended September 30, 2025, Automotive and other selling, general and administrative expense decreased primarily due to: (1) decreased advertising, selling and administrative costs of $0.4 billion; and (2) the absence of charges related to strategic activities to transition certain Buick dealerships of $0.2 billion.\nIn the nine months ended September 30, 2025, Automotive and other selling, general and administrative expense decreased primarily due to: (1) decreased advertising, selling and administrative costs of $0.7 billion; and (2) the absence of charges related to strategic activities to transition certain Buick dealerships of $0.3 billion.\nInterest Income and Other Non-operating Income, net\nThree Months Ended\nFavorable/ (Unfavorable)\nNine Months Ended\nFavorable/ (Unfavorable)\nSeptember 30, 2025\nSeptember 30, 2024\n%\nSeptember 30, 2025\nSeptember 30, 2024\n%\nInterest income and other non-operating income, net\n$\n475 \n$\n394 \n$\n81 \n20.6 \n%\n$\n1,151 \n$\n756 \n$\n395 \n52.3 \n%\nIn the three months ended September 30, 2025, Interest income and other non-operating income, net increased primarily due to individually insignificant items.\nIn the nine months ended September 30, 2025, Interest income and other non-operating income, net increased primarily due to $0.3 billion in gains related to revaluation of investments and other individually insignificant items.\nIncome Tax Expense\nThree Months Ended\nFavorable/ (Unfavorable)\nNine Months Ended\nFavorable/ (Unfavorable)\nSeptember 30, 2025\nSeptember 30, 2024\n%\nSeptember 30, 2025\nSeptember 30, 2024\n%\nIncome tax expense\n$\n127 \n$\n709 \n$\n583 \n82.1 \n%\n$\n1,326 \n$\n2,238 \n$\n912 \n40.8 \n%\nIn the three and nine months ended September 30, 2025, Income tax expense \ndecreased primarily due to lower pre-tax income.\nFor the three and nine months ended September 30, 2025, our effective tax rate was 8.9% and 18.0% and our effective tax rate-adjusted (ETR-adjusted) was \n19.8%\n and \n19.3%\n. We expect our ETR-adjusted to be between 20% and 21% for the year ending December 31, 2025. Refer to the \"Non-GAAP Measures\" section of this MD&A for additional information.\nRefer to Note 15\n \nto our condensed consolidated financial statements for additional information related to Income tax expense.\n35\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nGM North America \nThree Months Ended \nFavorable/ (Unfavorable)\n%\nVariance Due To\nSeptember 30, 2025\nSeptember 30, 2024\nVolume\nMix\nPrice\nCost\nOther\n(Dollars in billions)\nTotal net sales and revenue\n$\n40,551 \n$\n41,157 \n$\n(606)\n(1.5)\n%\n$\n(2.2)\n$\n1.0 \n$\n0.1 \n$\n0.5 \nEBIT-adjusted\n$\n2,506 \n$\n3,982 \n$\n(1,476)\n(37.1)\n%\n$\n(0.6)\n$\n0.1 \n$\n0.1 \n$\n(1.5)\n$\n0.4 \nEBIT-adjusted margin\n6.2 \n%\n9.7 \n%\n(3.5)\n%\n(Vehicles in thousands)\nWholesale vehicle sales\n840 \n893 \n(53)\n(5.9)\n%\nNine Months Ended\nFavorable/ (Unfavorable)\n%\nVariance Due To\nSeptember 30, 2025\nSeptember 30, 2024\nVolume\nMix\nPrice\nCost\nOther\n(Dollars in billions)\nTotal net sales and revenue\n$\n117,424 \n$\n117,981 \n$\n(556)\n(0.5)\n%\n$\n(3.0)\n$\n1.7 \n$\n0.8 \n$\n— \nEBIT-adjusted\n$\n8,207 \n$\n12,254 \n$\n(4,047)\n(33.0)\n%\n$\n(0.8)\n$\n(0.5)\n$\n0.8 \n$\n(4.2)\n$\n0.7 \nEBIT-adjusted margin\n7.0 \n%\n10.4 \n%\n(3.4)\n%\n(Vehicles in thousands)\nWholesale vehicle sales\n2,516 \n2,588 \n(71)\n(2.8)\n%\nGMNA Total Net Sales and Revenue  \nIn the three months ended September 30, 2025, Total net sales and revenue decreased primarily due to: (1) decreased net wholesale volumes due to decreased sales of cars and crossover vehicles, partially offset by increased sales of full-size pickup trucks; partially offset by (2) favorable Mix associated with decreased sales of cars, increased sales of full-size SUVs and decreased sales of crossover vehicles; (3) favorable Price as a result of lean dealer inventory levels due to strong demand for our products; and (4) favorable Other due to increased sales of parts and accessories.\nIn the nine months ended September 30, 2025, Total net sales and revenue decreased primarily due to: (1) decreased net wholesale volumes due to decreased sales of cars and full-size pickup trucks, due to portfolio actions and lower planned production for product upgrades, partially offset by increased sales of crossover vehicles, including EVs, and mid-size pickup trucks and vans; partially offset by (2) favorable Mix associated with decreased sales of cars and increased sales of full-size SUVs, partially offset by increased sales of crossover vehicles, including EVs; and (3) favorable Price as a result of lean dealer inventory levels due to strong demand for our products.\nGMNA EBIT-Adjusted\n  In the three months ended September 30, 2025, EBIT-adjusted decreased primarily due to: (1) unfavorable Cost primarily due to increased material and freight costs of $0.9 billion, including $1.1 billion due to tariffs, and increased warranty-related costs of $0.9 billion, partially offset by decreased advertising, selling and administrative costs of $0.2 billion; and (2) decreased net wholesale volumes; partially offset by (3) favorable Price; (4) favorable Mix associated with decreased sales of cars and increased sales of full-size pickup trucks, partially offset by decreased sales of crossover vehicles; and (5) favorable Other due to net foreign currency changes primarily in the Mexican peso.\nIn the nine months ended September 30, 2025, EBIT-adjusted decreased primarily due to: (1) unfavorable Cost primarily due to increased material and freight costs of $2.5 billion, including $2.4 billion due to tariffs, increased warranty-related costs of $1.4 billion, unfavorable net realizable value inventory adjustments, primarily EV-related, of $0.4 billion in the nine months ended September 30, 2025 compared to similar favorable inventory adjustments of $0.4 billion in the nine months ended September 30, 2024, and increased manufacturing costs of $0.2 billion, partially offset by decreased advertising, selling and administrative costs of $0.2 billion; (2) decreased net wholesale volumes; and (3) unfavorable Mix associated with increased sales of crossover vehicles, including EVs, partially offset by decreased sales of cars; partially offset by (4) favorable Price; and (5) favorable Other due to net foreign currency changes primarily in the Mexican peso and favorable revaluation of investments.\n36\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nGM International\nThree Months Ended \nFavorable/ (Unfavorable)\nVariance Due To\nSeptember 30, 2025\nSeptember 30, 2024\n%\nVolume\nMix\nPrice\nCost\nOther\n(Dollars in billions)\nTotal net sales and revenue\n$\n3,645 \n$\n3,517 \n$\n128 \n3.6 \n%\n$\n(0.1)\n$\n0.2 \n$\n0.1 \n$\n(0.1)\nEBIT-adjusted\n$\n226 \n$\n42 \n$\n184 \nn.m.\n$\n— \n$\n0.1 \n$\n0.1 \n$\n(0.1)\n$\n0.1 \nEBIT-adjusted margin\n6.2 \n%\n1.2 \n%\n5.0 \n%\nEquity income (loss) — Automotive China\n$\n80 \n$\n(137)\n$\n217 \nn.m.\nEBIT-adjusted — excluding Equity income (loss)\n$\n146 \n$\n179 \n$\n(33)\n(18.2)\n%\n(Vehicles in thousands)\nWholesale vehicle sales\n137 \n140 \n(3)\n(2.4)\n%\n__________\nn.m. = not meaningful\nNine Months Ended\nFavorable/ (Unfavorable)\nVariance Due To\nSeptember 30, 2025\nSeptember 30, 2024\n%\nVolume\nMix\nPrice\nCost\nOther\n(Dollars in billions)\nTotal net sales and revenue\n$\n9,398 \n$\n9,897 \n$\n(499)\n(5.0)\n%\n$\n(0.8)\n$\n0.5 \n$\n0.3 \n$\n(0.5)\nEBIT-adjusted\n$\n460 \n$\n82 \n$\n378 \nn.m.\n$\n(0.2)\n$\n0.2 \n$\n0.3 \n$\n(0.1)\n$\n0.2 \nEBIT-adjusted margin\n4.9 \n%\n0.8 \n%\n4.1 \n%\nEquity income (loss) — Automotive China\n$\n197 \n$\n(347)\n$\n544 \nn.m.\nEBIT-adjusted — excluding Equity income (loss)(a)\n$\n266 \n$\n429 \n$\n(163)\n(37.9)\n%\n(Vehicles in thousands)\nWholesale vehicle sales\n346 \n383 \n(38)\n(9.8)\n%\n__________\nn.m. = not meaningful\n(a)\nExcludes adjustments related to Automotive China JVs restructuring recorded in GMI.\nThe vehicle sales of our Automotive China JVs are not recorded in Total net sales and revenue. The results of our joint ventures are recorded in Equity income (loss), which is included in EBIT-adjusted above.\nGMI Total Net Sales and Revenue  \nIn the three months ended September 30, 2025, Total net sales a\nnd revenue increased primarily due to: (1) favorable Mix in Brazil and the Middle East; and (2) favorable Price across multiple vehicle lines in Argentina; partially offset by (3) decreased net wholesale volumes in Brazil and Korea, partially offset by increased wholesale volumes in Argentina and Egypt; and (4) unfavorable Other primarily due to net foreign currency changes in the Argentine peso, partially offset by the Brazilian real.\nIn the nine months ended September 30, 2025, Total net sales and revenue\n decreased primar\nily due t\no: (1) decreased net wholesale volumes in Brazil, partially offset by increased volumes in Argentina; and (2) unfavorable Other primarily due to net foreign currency changes in the Argentine peso, Brazilian real and Egyptian pou\nnd; \npartially offset by (3) favorable Mix in South America, partially offset by the Middle East; and (4) favorable Price in Argentina, the Middle East and Brazil.\nGMI EBIT-Adjusted  \nIn the three months ended September 30, 2025, EBIT-adjusted increased primarily due to: (1) favorable Price; (2) favorable Mix in Brazil and Argentina; and (3) favorable Other primarily due to increased Automotive China JVs equity income (loss), partially offset by net foreign currency changes in the Argentine peso; partially offset by (4) unfavorable Cost primarily due to increased material and logistics costs in Brazil and the Middle East.\nIn the nine months ended September 30, 2025, EBIT-adjusted increased primarily due to: (1) favorable Price; (2) favorable Mix in Brazil and Argentina, partially offset by the Middle East; and (3) favorable Other primarily due to increased Automotive China JVs equity income (loss), partially offset by net foreign currency changes in the Argentine peso and the Brazilian real; \n37\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\npartially offset by (4) decreased net wholesale volumes in Brazil and Korea, partially offset by increased volumes in Argentina and Egypt; and (5) unfavorable Cost primarily due to increased material and logistics costs in Brazil and the Middle East, partially offset by Korea.\nThe following table summarizes certain key operational and financial data for the Automotive China JVs (vehicles in thousands):\nThree Months Ended\nNine Months Ended\nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\nWholesale vehicle sales, including vehicles exported to markets outside of China\n519 \n372 \n1,494 \n1,117 \nTotal net sales and revenue\n$\n6,121 \n$\n4,480 \n$\n17,270 \n$\n13,268 \nNet income (loss)\n$\n144 \n$\n(282)\n$\n341 \n$\n(724)\nGM Financial\nThree Months Ended\nIncrease/ (Decrease)\n%\nNine Months Ended\nIncrease/ (Decrease)\n%\nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\nTotal revenue\n$\n4,337 \n$\n4,031 \n$\n305 \n7.6 \n%\n$\n12,756 \n$\n11,761 \n$\n995 \n8.5 \n%\nProvision for loan losses\n$\n244 \n$\n298 \n$\n(54)\n(18.0)\n%\n$\n926 \n$\n676 \n$\n250 \n37.0 \n%\nEBT-adjusted\n$\n804 \n$\n687 \n$\n117 \n17.0 \n%\n$\n2,193 \n$\n2,246 \n$\n(53)\n(2.4)\n%\nAverage debt outstanding (dollars in billions)\n$\n117.6 \n$\n110.4 \n$\n7.2 \n6.5 \n%\n$\n116.9 \n$\n107.8 \n$\n9.1 \n8.5 \n%\nEffective rate of interest paid\n5.6 \n%\n5.6 \n%\n— \n%\n5.6 \n%\n5.5 \n%\n0.1 \n%\nGM Financial Revenue  \nIn the three months ended September 30, 2025, total revenue increased primarily due to: (1) increased leased vehicle income of $0.1 billion primarily due to an increase in the average balance of the leased vehicles portfolio; (2) increased finance charge income of $0.1 billion primarily due to growth in the size of the portfolio and an increase in the retail effective yield resulting from higher average interest rates on new loan originations; and (3) increased other income of $0.1 billion primarily due to growth in vehicle protection contract sales, as well as a gain on sale of finance receivables.\nIn the nine months ended September 30, 2025, total revenue increased primarily due to: (1) increased finance charge income of $0.5 billion primarily due to growth in the size of the portfolio and an increase in the retail effective yield resulting from higher average interest rates on new loan originations; (2) increased leased vehicle income of $0.4 billion primarily due to an increase in the average balance of the leased vehicles portfolio; and (3) increased other income of $0.1 billion primarily due to growth in vehicle protection contract sales, as well as a gain on sale of finance receivables.\nGM Financial EBT-Adjusted  \nIn the three months ended September 30, 2025, EBT-adjusted increased primarily due to: (1) increased leased vehicle income of $0.1 billion primarily due to an increase in the average balance of the leased vehicles portfolio; and (2) increased finance charge income of $0.1 billion primarily due to growth in the size of the portfolio and an increase in the retail effective yield resulting from higher average interest rates on new loan originations; partially offset by (3) increased interest expense of $0.1 billion primarily due to an increase in average debt outstanding.\nIn the nine months ended September 30, 2025, EBT-adjusted decreased primarily due to: (1) increased interest expense of $0.5 billion primarily due to an increase in average debt outstanding, as well as a slight increase in the effective rate of interest on debt; (2) increased provision for loan losses of $0.3 billion primarily due to increased loan origination volume, partially offset by the reversal of the allowance for loan losses on finance receivables reclassified to held-for-sale; and (3) increased leased vehicle expenses of $0.2 billion primarily due to a decrease in lease termination gains resulting from fewer terminated leases in 2025 and increased depreciation resulting from an increase in the average balance of the leased vehicles portfolio; partially offset by (4) increased finance charge income of $0.5 billion primarily due to growth in the size of the portfolio and an increase in the retail effective yield resulting from higher average interest rates on new loan originations; and (5) increased leased vehicle income of $0.4 billion primarily due to an increase in the average balance of the leased vehicles portfolio.\n38\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nLiquidity and Capital Resources  \nWe believe our current levels of cash, cash equivalents, marketable debt securities, available borrowing capacity under our credit facilities and other available liquidity actions are sufficient to meet our liquidity requirements in the short- and long-term. We also maintain access to the capital markets and may issue debt or equity securities, which may provide an additional source of liquidity. We have substantial cash requirements going forward, which we plan to fund through our total available liquidity, cash flows from operating activities and additional liquidity measures, if determined to be necessary.\nOur known current material uses of cash include, among other possible demands: (1) capital spending and our investments in our battery cell manufacturing joint ventures of approximately $10.0 billion to $11.0 billion in 2025; (2) payments for engineering and product development activities, including the development of AV technology and software-enabled services; (3) payments associated with previously announced warranty claims, vehicle recalls and any other recall-related contingencies; (4) payments to service debt and other long-term obligations, including discretionary and mandatory contributions to our pension plans; (5) dividend payments on our common stock that are declared by our Board of Directors; (6) payments to purchase shares of our common stock authorized by our Board of Directors; and (7) if the current regulations in the U.S. are not amended, payments of emissions-related regulatory compliance costs. Our material future uses of cash, which may vary from time to time based on market conditions and other factors, are focused on the three objectives of our capital allocation program: (1) grow our business at an average target return on invested capital-adjusted (ROIC-adjusted) rate of 20% or greater; (2) maintain a strong investment-grade balance sheet, including a target average automotive cash balance of $18.0 billion; and (3) after the first two objectives are met, return available cash to stockholders. Our senior management evaluates our capital allocation program on an ongoing basis and recommends any modifications to the program to our Board of Directors not less than once annually.\nFollowing recent U.S. Government policy changes, including the termination of certain consumer tax incentives for EV purchases and the reduction in the stringency of emissions regulations, we expect the adoption rate of EVs to slow. It is reasonably possible that we will recognize additional future material contract cancellation fees and commercial settlements associated with EV-related investments that may adversely affect our cash flows in the period in which they are paid. Furthermore, to support our transition to EVs, we anticipate making investments in suppliers or providing funding towards the execution of strategic, multi-year supply agreements to secure critical materials. In addition, we have entered, and plan to continue to enter, into offtake agreements that generally obligate us to purchase defined quantities of output. These arrangements could have a short-term adverse impact on our cash and increase our inventory. We also continue to monitor and evaluate opportunities to strengthen our competitive position over the long term while maintaining a strong investment-grade balance sheet. These actions may include opportunistic payments to reduce our long-term obligations, and the possibility of acquisitions, dispositions and investments with joint venture partners, as well as strategic alliances that we believe would generate significant advantages and substantially strengthen our business.\nOur liquidity plans are subject to a number of risks and uncertainties, including those described in the \"Forward-Looking Statements\" section of this MD&A, Part I, Item 1A. Risk Factors of our 2024 Form 10-K and Part II, Item 1A. Risk Factors, some of which are outside of our control.\nIn February 2025, our Board of Directors increased the capacity under our existing share repurchase program by $6.0 billion to an aggregate of $6.3 billion and approved an ASR program to repurchase an aggregate amount of $2.0 billion of our common stock. In the nine months ended September 30, 2025, we received and retired 43 million shares upon settlement.  \nIn the nine months ended September 30, 2025, in addition to the shares repurchased under the ASR program, we repurchased approximately 27 million shares for $1.5 billion under our existing share repurchase program. We have $2.8 billion in capacity remaining under our share repurchase program as of September 30, 2025, with no expiration date.\nIn the nine months ended September 30, 2025, we paid dividends of $0.4 billion to holders of our common stock. In February 2025, our Board of Directors approved an increase in the quarterly common stock dividend of $0.03 to $0.15 per share beginning with the quarterly dividend declared in April 2025.\nIn May 2025, we loaned $1.8 billion to Ultium Cells LLC to facilitate full voluntary prepayment of loans Ultium Cells LLC received under the DOE's Advanced Technology Vehicles Manufacturing program. Our loan to Ultium Cells LLC accrues interest at a rate of 5.7% per year, matures in April 2030 and is prepayable without penalties.\nCash flows that occur amongst our Automotive, Cruise and GM Financial operations are eliminated when we consolidate our cash flows. Such eliminations include, among other things, collections by Automotive on wholesale accounts receivables financed by dealers through GM Financial, payments between Automotive and GM Financial for accounts receivables \n39\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\ntransferred by Automotive to GM Financial, loans to Automotive and Cruise from GM Financial, dividends issued by GM Financial to Automotive, tax payments by GM Financial to Automotive and Automotive Cruise related cash expenditures. The presentation of Automotive liquidity and GM Financial liquidity presented below includes the impact of cash transactions amongst the sectors that are ultimately eliminated in consolidation. Net cash used in operating activities by Cruise was $0.8 billion and $1.8 billion in the nine months ended September 30, 2025 and 2024.\nAutomotive Liquidity\n  Total available liquidity includes cash, cash equivalents, marketable debt securities and funds available under credit facilities. The amount of available liquidity is subject to seasonal fluctuations and includes balances held by various business units and subsidiaries worldwide that are needed to fund their operations. We have not significantly changed the management of our liquidity, including our allocation of available liquidity, our portfolio composition and our investment guidelines since December 31, 2024. Refer to Part II, Item 7. MD&A of our 2024 Form 10-K.\nIn March 2025, we renewed our five-year, $10.0 billion facility, which now matures March 25, 2030. We also renewed our three-year, $4.1 billion facility, which now matures March 25, 2028, and renewed our 364-day, $2.0 billion revolving credit facility allocated for the exclusive use of GM Financial, which now matures March 24, 2026.\nWe use credit facilities as a mechanism to provide additional flexibility in managing our global liquidity. Our Automotive borrowing capacity under credit facilities totaled $14.4 billion a\nnd $14.3 billion\n at September 30, 2025 and December 31, 2024, which consisted primarily of two credit facilities. Total Automotive borrowing capacity under our credit facilities does not include our 364-day, $2.0 billion\n \nfacility allocated for exclusive use of GM Financial. We did not have any borrowings against our primary facilities, but had letters of credit outstanding under our sub-facility of $0.5 billion at September 30, 2025 and December 31, 2024.\nIf available capacity permits, GM Financial continues to have access to our automotive credit facilities. GM Financial did not have borrowings outstanding against any of these facilities at September 30, 2025 and December 31, 2024. We had intercompany loans from GM Financial of $0.4 billion and $0.3 billion at September 30, 2025 and December 31, 2024, which primarily consisted of commercial loans to dealers we consolidate. We did not have intercompany loans to GM Financial at September 30, 2025 and December 31, 2024. Refer to Note 4 to our condensed consolidated financial statements for additional information.\nIn May 2025, we issued $2.0 billion in aggregate principal amount of senior unsecured notes with a weighted average interest rate of 5.7% and maturity dates ranging from 2028 to 2035. The net proceeds from this offering were used for general corporate purposes, including to fund a portion of the $1.8 billion five-year term loan to Ultium Cells LLC and to refinance a portion of our senior notes. In September 2025, we exercised our option to redeem at par value the remaining $1.25 billion in aggregate principal balance of our $2.0 billion senior unsecured notes with a maturity date of October 1, 2025.\nSeveral of our loan facilities, including our revolving credit facilities, require compliance with certain financial and operational covenants as well as regular reporting to lenders. We have reviewed our covenants in effect as of September 30, 2025 and determined we are in compliance and expect to remain in compliance in the future.\nGM Financial's Board of Directors declared and paid dividends of $1.1 billion on its common stock in the nine months ended September 30, 2025. Future dividends from GM Financial will depend on several factors including business and economic conditions, its financial condition, earnings, liquidity requirements and leverage ratio.\nThe following table summarizes our Automotive available liquidity (dollars in billions):\nSeptember 30, 2025\nDecember 31, 2024\nAutomotive cash and cash equivalents\n$\n15.0 \n$\n14.5 \nMarketable debt securities\n6.8 \n7.3 \nAutomotive cash, cash equivalents and marketable debt securities\n21.8 \n21.7 \nAvailable under credit facilities(a)\n13.9 \n13.8 \nTotal Automotive available liquidity\n$\n35.7 \n$\n35.5 \n__________\n(a)\nWe had letters of credit outstanding under our sub-facility of $0.5 billion at September 30, 2025 and December 31, 2024.\n40\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nThe following table summarizes the changes in our Automotive available liquidity (dollars in billions): \nNine Months Ended September 30, 2025\nOperating cash flow\n$\n13.1 \nCapital expenditures\n(6.1)\nASR program, shares repurchased and dividends paid\n(3.9)\nIssuance of senior unsecured notes\n2.0 \nPayment of senior unsecured notes\n(1.8)\nLoan to Ultium Cells LLC, net\n(1.7)\nCruise robotaxi operations wind down\n(1.0)\nInvestment in nonconsolidated affiliates\n(0.6)\nIncrease in available credit facilities\n0.1 \nTotal change in automotive available liquidity\n$\n0.2 \nAutomotive Cash Flow (dollars in billions)\nNine Months Ended\nChange\nSeptember 30, 2025\nSeptember 30, 2024\nOperating Activities\nNet income\n$\n4.7 \n$\n8.9 \n$\n(4.2)\nDepreciation, amortization and impairment charges\n6.4 \n4.9 \n1.5 \nPension and OPEB activities\n(0.4)\n(0.8)\n0.4 \nWorking capital\n(2.2)\n1.0 \n(3.3)\nAccrued and other liabilities and income taxes\n2.1 \n4.2 \n(2.1)\nOther(a)\n2.6 \n0.9 \n1.7 \nNet automotive cash provided by (used in) operating activities(b)\n$\n13.1 \n$\n19.2 \n$\n(6.0)\n__________\n(a)\nIncludes $1.1 billion in dividends received from our nonconsolidated affiliates in the nine months ended September 30, 2025; $1.1 billion and $1.4 billion in dividends received from GM Financial in the nine months ended September 30, 2025 and 2024\n; and\n changes in other assets and liabilities in the nine months ended September 30, 2025 and 2024.\n(b)\nIncludes $(1.7) billion and $6.7 billion in the nine months ended September 30, 2025 and 2024, which are eliminated within the condensed consolidated statements of cash flows. Amounts eliminated primarily relate to purchases of, and collections on, wholesale finance receivables provided by GM Financial to our dealers and dividends issued by GM Financial to us.\nNine Months Ended\nChange\nSeptember 30, 2025\nSeptember 30, 2024\nInvesting Activities\nCapital expenditures\n$\n(6.1)\n$\n(7.5)\n$\n1.4 \nAcquisitions and liquidations of marketable securities, net\n0.6 \n(0.7)\n1.3 \nOther(a)\n(3.4)\n(2.0)\n(1.4)\nNet automotive cash provided by (used in) investing activities(b)\n$\n(8.8)\n$\n(10.2)\n$\n1.4 \n__________\n(a)\nIncludes $(1.8) billion term loan to and $0.1 billion loan repayments from Ultium Cells LLC, $(1.0) billion funding to wind down Cruise robotaxi operations and $(0.6) billion of GM's investment in nonconsolidated affiliates in the \nnine months ended September 30, 2025; $(1.3) billion investment in Cruise which is inclusive of $(0.9) billion convertible note issued by Cruise to us and $(0.7) billion of GM's investment in Ultium Cells Holdings LLC in the \nnine months ended September 30, 2024.\n(b)\nIncludes $(1.0) billion funding to wind down Cruise robotaxi operations in the \nnine months ended September 30, 2025; and $(1.3) billion investment in Cruise which is inclusive of $(0.9) billion convertible note issued by Cruise to us in the \nnine months ended September 30, 2024, which are eliminated within the condensed consolidated statements of cash flows. \n41\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNine Months Ended\nChange\nSeptember 30, 2025\nSeptember 30, 2024\nFinancing Activities\nNet proceeds (payments) from short-term debt\n$\n(1.8)\n$\n— \n$\n(1.8)\nIssuance of senior unsecured notes\n2.0 \n— \n2.0 \nOther(a) \n(4.1)\n(3.0)\n(1.2)\nNet automotive cash provided by (used in) financing activities\n$\n(3.9)\n$\n(2.9)\n$\n(1.0)\n__________\n(a)\nIncludes $(2.0) billion in payments related to the ASR in the \nnine months ended September 30, 2025\n and $(1.5) billion and $(2.4) billion for payments to purchase common stock in the nine months ended September 30, 2025 and \n2024;\n and $(0.4) billion for dividends paid in the nine months ended September 30, 2025 and \n2024.\nAdjusted Automotive Free Cash Flow  \nWe measure adjusted automotive free cash flow as automotive operating cash flow from operations less capital expenditures adjusted for management actions. In the nine months ended September 30, 2025, net automotive cash provided by operating activities was $13.1 billion, capital expenditures were $6.1 billion and adjustments for management actions were $0.8 billion. In the nine months ended September 30, 2024, net automotive cash provided by operating activities was $19.2 billion, capital expenditures were $7.5 billion and adjustments for management actions were $0.5 billion.\nStatus of Credit Ratings  \nWe receive ratings from four independent credit rating agencies: DBRS Limited, Fitch Ratings, Moody's Investor Service and Standard & Poor's. All four credit rating agencies currently rate our corporate credit at investment grade. As of October 14, 2025, all credit ratings remained unchanged since December 31, 2024.\nAutomotive Financing – GM Financial Liquidity  \nGM Financial's primary sources of cash are finance charge income, leasing income and proceeds from the sale of terminated leased vehicles, net proceeds from credit facilities, securitizations, secured and unsecured borrowings and collections and recoveries on finance receivables. GM Financial's primary uses of cash are purchases and funding of finance receivables and leased vehicles, repayment or repurchases of secured and unsecured debt, funding credit enhancement requirements in connection with securitizations and secured credit facilities, interest costs, operating expenses, income taxes and dividend payments. GM Financial continues to monitor and evaluate opportunities to optimize its liquidity position and the mix of its debt between secured and unsecured debt.\nThe following table summarizes GM Financial's available liquidity (dollars in billions): \nSeptember 30, 2025\nDecember 31, 2024\nCash, cash equivalents and marketable debt securities\n$\n7.8 \n$\n5.1 \nBorrowing capacity on unpledged eligible assets\n25.4 \n21.5 \nBorrowing capacity on committed unsecured lines of credit\n0.9 \n0.7 \nBorrowing capacity on revolving credit facility, exclusive to GM Financial\n2.0 \n2.0 \nTotal GM Financial available liquidity\n$\n36.2 \n$\n29.3 \nGM Financial's available liquidity increased, primarily due to increased available borrowing capacity on unpledged eligible assets, resulting from the issuance of securitization transactions and unsecured debt, and an increase in cash and cash equivalents, resulting from $2.0 billion in proceeds from the sale of finance receivables. GM Financial generally targets liquidity levels to support at least six months of GM Financial's expected net cash outflows, including new originations, without access to new debt financing transactions or other capital markets activity. At September 30, 2025, available liquidity exceeded GM Financial's liquidity targets.\n42\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nGM Financial Cash Flow (dollars in billions)\nNine Months Ended\nChange\nSeptember 30, 2025\nSeptember 30, 2024\nNet cash provided by (used in) operating activities\n$\n6.1 \n$\n5.1 \n$\n1.0 \nNet cash provided by (used in) investing activities(a)\n$\n(1.6)\n$\n(10.3)\n$\n8.8 \nNet cash provided by (used in) financing activities(b)\n$\n(1.7)\n$\n4.7 \n$\n(6.4)\n__________\n(a)\nIncludes $3.1 billion in the nine months ended September 30, 2025 driven primarily by purchases of, and collections on, wholesale finance receivables and collection of intercompany loans to Cruise; and $(5.3) billion in the nine months ended September 30, 2024 driven primarily by purchases of, and collections on, wholesale finance receivables, which are eliminated within the condensed consolidated statements of cash flows.\n(b)\nIncludes $(1.1) billion and $(1.4) billion in the nine months ended September 30, 2025 and 2024 for dividends to GM, which are eliminated within the condensed consolidated statements of cash flows.  \nNine Months Ended\nChange\nSeptember 30, 2025\nSeptember 30, 2024\nOperating Activities\nNet income (loss)\n$\n1.6 \n$\n1.6 \n$\n— \nDepreciation and amortization\n4.0 \n3.9 \n— \nAccretion and amortization of loan and leasing fees\n(1.2)\n(1.1)\n(0.1)\nProvision for loan losses\n0.9 \n0.7 \n0.3 \nOther non-cash income\n(0.7)\n(0.7)\n— \nChanges in assets and liabilities\n1.3 \n(0.2)\n1.5 \nDeferred income taxes\n0.2 \n0.9 \n(0.7)\nNet cash provided by (used in) operating activities\n$\n6.1 \n$\n5.1 \n$\n1.0 \nCredit Facilities  \nIn the normal course of business, in addition to using its available cash, GM Financial utilizes borrowings under its credit facilities, which may be secured or unsecured, and GM Financial repays these borrowings as appropriate under its cash management strategy. At September 30, 2025, secured, committed unsecured and uncommitted unsecured credit facilities totaled $27.6 billion, $0.9 billion and $2.3 billion with advances outstanding of $2.1 billion, an insignificant amount and $2.3 billion.\nGM Financial did not have any borrowings outstanding against our credit facility designated for their exclusive use or the remainder of our revolving credit facilities at September 30, 2025 and December 31, 2024. Refer to the \"Automotive Liquidity\" section of this MD&A for additional details.\nCritical Accounting Estimates  \nThe condensed consolidated financial statements are prepared in conformity with U.S. GAAP, which requires the use of estimates, judgments and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses in the periods presented. We believe the accounting estimates employed are appropriate and the resulting balances are reasonable; however, due to the inherent uncertainties in developing estimates, actual results could differ from the original estimates, requiring adjustments to these balances in future periods. The critical accounting estimates that affect the condensed consolidated financial statements and the judgments and assumptions used are consistent with those described in the MD&A in our 2024 Form 10-K.\nNon-GAAP Measures  \nWe use both GAAP and non-GAAP financial measures for operational and financial decision making, and to assess Company and segment business performance. Our non-GAAP measures include: EBIT-adjusted, presented net of noncontrolling interests; EBT-adjusted for our GM Financial segment; EPS-diluted-adjusted; ETR-adjusted; ROIC-adjusted and adjusted automotive free cash flow. Our calculation of these non-GAAP measures may not be comparable to similarly titled measures of other companies due to potential differences between companies in the method of calculation. As a result, the use of these non-GAAP measures has limitations and should not be considered superior to, in isolation from, or as a substitute for, related U.S. GAAP measures. \nThese non-GAAP measures allow management and investors to view operating trends, perform analytical comparisons and benchmark performance between periods and among geographic regions to understand operating performance without regard to \n43\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nitems we do not consider a component of our core operating performance. Furthermore, these non-GAAP measures allow investors the opportunity to measure and monitor our performance against our externally communicated targets and evaluate the investment decisions being made by management to improve ROIC-adjusted. Management uses these measures in its financial, investment and operational decision-making processes, for internal reporting and as part of its forecasting and budgeting processes. Further, our Board of Directors uses certain of these and other measures as key metrics to determine management performance under our performance-based compensation plans. For these reasons, we believe these non-GAAP measures are useful for our investors. \nEBIT-adjusted \n(Most comparable GAAP measure: Net income attributable to stockholders) \n \nEBIT-adjusted is presented net of noncontrolling interests and is used by management and can be used by investors to review our consolidated operating results because it excludes automotive interest income, automotive interest expense and income taxes as well as certain additional adjustments that are not considered part of our core operations. Examples of adjustments to EBIT include, but are not limited to, impairment charges on long-lived assets and other exit costs resulting from strategic shifts in our operations or discrete market and business conditions, and certain costs arising from legal matters. For EBIT-adjusted and our other non-GAAP measures, once we have made an adjustment in the current period for an item, we will also adjust the related non-GAAP measure in any future periods in which there is an impact from the item. Our corresponding measure for our GM Financial segment is EBT-adjusted because interest income and interest expense are an integral part of its financial performance. \nEPS-diluted-adjusted\n \n(Most comparable GAAP measure: Diluted earnings per common share) \n EPS-diluted-adjusted is used by management and can be used by investors to review our consolidated diluted EPS results on a consistent basis. EPS-diluted-adjusted is calculated as net income attributable to common stockholders-diluted less adjustments noted above for EBIT-adjusted and certain income tax adjustments divided by weighted-average common shares outstanding-diluted. Examples of income tax adjustments include the establishment or release of significant deferred tax asset valuation allowances. \nETR-adjusted\n \n(Most comparable GAAP measure: Effective tax rate)\n  ETR-adjusted is used by management and can be used by investors to review the consolidated effective tax rate for our core operations on a consistent basis. ETR-adjusted is calculated as Income tax expense less the income tax related to the adjustments noted above for EBIT-adjusted and the income tax adjustments noted above for EPS-diluted-adjusted divided by Income before income taxes less adjustments. When we provide an expected adjusted effective tax rate, we cannot provide an expected effective tax rate without unreasonable efforts because the U.S. GAAP measure may include significant adjustments that are difficult to predict. \nROIC-adjusted\n \n(Most comparable GAAP measure: Return on equity)\n  ROIC-adjusted is used by management and can be used by investors to review our investment and capital allocation decisions. We define ROIC-adjusted as EBIT-adjusted for the trailing four quarters divided by ROIC-adjusted average net assets, which is the average equity balances adjusted for average automotive debt and interest liabilities, exclusive of finance leases; average automotive net pension and OPEB liabilities; and average automotive net income tax assets during the same period.\nAdjusted automotive free cash flow\n \n(Most comparable GAAP measure: Net automotive cash provided by operating activities)\n  Adjusted automotive free cash flow is used by management and can be used by investors to review the liquidity of our automotive operations and to measure and monitor our performance against our capital allocation program and evaluate our automotive liquidity against the substantial cash requirements of our automotive operations. We measure adjusted automotive free cash flow as automotive operating cash flow from operations less capital expenditures adjusted for management actions. Management actions can include voluntary events such as discretionary contributions to employee benefit plans or nonrecurring specific events such as a closure of a facility that are considered special for EBIT-adjusted purposes. Refer to the \"Liquidity and Capital Resources\" section of this MD&A for additional information.\n44\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nThe following table reconciles Net income (loss) attributable to stockholders to EBIT-adjusted:\nThree Months Ended\nSeptember 30,\nJune 30,\nMarch 31,\nDecember 31,\n2025\n2024\n2025\n2024\n2025\n2024\n2024\n2023\nNet income (loss) attributable to stockholders\n$\n1,327 \n$\n3,056 \n$\n1,895 \n$\n2,933 \n$\n2,784 \n$\n2,980 \n$\n(2,961)\n$\n2,102 \nIncome tax expense (benefit)\n127 \n709 \n481 \n767 \n719 \n762 \n318 \n(857)\nAutomotive interest expense\n209 \n206 \n198 \n206 \n152 \n219 \n215 \n222 \nAutomotive interest income\n(220)\n(274)\n(200)\n(229)\n(191)\n(186)\n(279)\n(308)\nAdjustments\n   EV strategic realignment(a)\n1,592 \n— \n— \n— \n— \n— \n— \n— \n   OnStar Smart Driver(b)\n300 \n— \n— \n— \n— \n— \n— \n— \n   Cruise restructuring(c)\n25 \n— \n65 \n583 \n— \n— \n520 \n478 \n   Headquarters relocation(d)\n16 \n34 \n8 \n— \n26 \n— \n30 \n— \n   Ultium strategic realignment(e)\n— \n— \n330 \n— \n— \n— \n— \n— \n   China restructuring actions(f)\n— \n— \n140 \n— \n— \n— \n4,010 \n— \n   Restructuring actions(g)\n— \n190 \n87 \n— \n— \n— \n10 \n— \n   GMI plant wind down(h)\n— \n43 \n33 \n103 \n— \n— \n4 \n— \n   Buick dealer strategy(i)\n— \n150 \n— \n75 \n— \n96 \n643 \n131 \n   Voluntary separation program(j)\n— \n— \n— \n— \n— \n— \n— \n130 \n   GM Korea wage litigation(k)\n— \n— \n— \n— \n— \n— \n— \n(30)\n   India asset sales(l)\n— \n— \n— \n— \n— \n— \n— \n(111)\nTotal adjustments\n1,933 \n417 \n663 \n761 \n26 \n96 \n5,217 \n598 \nEBIT-adjusted\n$\n3,376 \n$\n4,115 \n$\n3,037 \n$\n4,438 \n$\n3,490 \n$\n3,871 \n$\n2,509 \n$\n1,757 \n__________\n(a)\nThese adjustments were excluded because they relate to our planned strategic realignment of our EV capacity and manufacturing footprint to expected consumer demand.\n(b)\nThese adjustments were excluded because they relate to investigations and litigation associated with our former OnStar Smart Driver product.\n(c)\nThese adjustments were excluded because they relate to restructuring charges resulting from the plan to combine the Cruise and GM technical efforts to advance autonomous and assisted driving, the indefinite delay of the Cruise Origin and the voluntary pausing in 2023 of Cruise's driverless, supervised and manual AV operations in the U.S. The adjustments primarily consist of non-cash restructuring charges, supplier-related charges and employee separation costs. \n(d)\nThese adjustments were excluded because they relate to the GM headquarters relocation, primarily consisting of accelerated depreciation and other relocation expenditures.\n(e)\nThese adjustments were excluded because they relate to Ultium Cells Holdings LLC charges from a strategic realignment to have the right manufacturing and cell capabilities in place to meet EV demand and expected growth.\n(f)\nThese adjustments were excluded because they relate to restructuring activities associated with our operations in China, including an other-than-temporary impairment and restructuring charges recorded in equity earnings associated with our Automotive China JVs.\n(g)\nThese adjustments were excluded because they relate to employee separation charges.\n(h)\nThese adjustments were excluded because they relate to the wind down of our manufacturing operations in Colombia and Ecuador.\n(i)\nThese adjustments were excluded because they relate to strategic activities to transition certain Buick dealers out of our dealer network as part of Buick’s EV strategy.\n(j)\nThese adjustments were excluded because they relate to the acceleration of attrition as part of the cost reduction program announced in January 2023, primarily in the U.S.\n(k)\nThese adjustments were excluded because they relate to the partial resolution of subcontractor matters in Korea.\n(l)\nThese adjustments were excluded because they relate to an asset sale resulting from our strategic decision in 2020 to exit India.\n45\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nThe following table reconciles diluted earnin\ngs pe\nr common share to EPS-diluted-adjusted: \nThree Months Ended\nNine Months Ended\nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\nAmount\nPer Share\nAmount\nPer Share\nAmount\nPer Share\nAmount\nPer Share\nDiluted earnings per common share\n$\n1,297 \n$\n1.35 \n$\n3,029 \n$\n2.68 \n$\n6,510 \n$\n6.64 \n$\n8,914 \n$\n7.77 \nAdjustments(a)\n1,933 \n2.01 \n417 \n0.37 \n2,622 \n2.67 \n1,274 \n1.11 \nTax effect on adjustments(b)\n(536)\n(0.56)\n(96)\n(0.08)\n(606)\n(0.62)\n(290)\n(0.25)\nReturn from preferred shareholders(c)\n— \n— \n— \n— \n(593)\n(0.60)\n— \n— \nEPS-diluted-adjusted\n$\n2,694 \n$\n2.80 \n$\n3,350 \n$\n2.96 \n$\n7,933 \n$\n8.09 \n$\n9,898 \n$\n8.63 \n__________\n(a)\nRefer to the reconciliation of Net income (loss) attributable to stockholders to EBIT-adjusted within this section of MD&A for the details of each individual adjustment.\n(b)\nThe tax effect of each adjustment is determined based on the tax laws and valuation allowance status of the jurisdiction to which the adjustment relates.\n(c)\nThis adjustment consists of a return from the preferred shareholders related to the redemption of Cruise preferred shares from noncontrolling interest holders in the nine months ended September 30, 2025.\nThe following table reconciles our effective tax rate to ETR-adjusted: \nThree Months Ended\nNine Months Ended\nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\nIncome before income taxes\nIncome tax expense (benefit)\nEffective tax rate\nIncome before income taxes\nIncome tax expense (benefit)\nEffective tax rate\nIncome before income taxes\nIncome tax expense (benefit)\nEffective tax rate\nIncome before income taxes\nIncome tax expense (benefit)\nEffective tax rate\nEffective tax rate\n$\n1,419 \n$\n127 \n8.9 \n%\n$\n3,717 \n$\n709 \n19.1 \n%\n$\n7,366 \n$\n1,326 \n18.0 \n%\n$\n11,076 \n$\n2,238 \n20.2 \n%\nAdjustments(a)\n1,933 \n536 \n418 \n96 \n2,622 \n606 \n1,342 \n290 \nETR-adjusted\n$\n3,352 \n$\n663 \n19.8 \n%\n$\n4,135 \n$\n805 \n19.5 \n%\n$\n9,988 \n$\n1,932 \n19.3 \n%\n$\n12,418 \n$\n2,528 \n20.4 \n%\n__________\n(a)\nRefer to the reconciliation of Net income (loss) attributable to stockholders to EBIT-adjusted within this section of MD&A for adjustment details. These adjustments include Net income attributable to noncontrolling interests where applicable. The tax effect of each adjustment is determined based on the tax laws and valuation allowance status of the jurisdiction to which the adjustment relates.\nWe define return on equity (ROE) as Net income (loss) attributable to stockholders for the trailing four quarters divided by average equity for the same period. Management uses average equity to provide comparable amounts in the calculation of ROE. The following table summarizes the calculation of ROE (dollars in billions):\nFour Quarters Ended\nSeptember 30, 2025\nSeptember 30, 2024\nNet income attributable to stockholders\n$\n3.0 \n$\n11.1 \nAverage equity(a)\n$\n65.2 \n$\n69.5 \nROE\n4.7 \n%\n15.9 \n%\n__________\n(a)\nIncludes equity of noncontrolling interests where the corresponding earnings (loss) are included in Net income attributable to stockholders.\n46\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nThe following table summarizes the calculation of ROIC-adjusted (dollars in billions):\nFour Quarters Ended\nSeptember 30, 2025\nSeptember 30, 2024\nEBIT-adjusted(a)\n$\n12.4 \n$\n14.2 \nAverage equity(b)\n$\n65.2 \n$\n69.5 \nAdd: Average automotive debt and interest liabilities (excluding finance leases)\n16.1 \n16.3 \nAdd: Average automotive net pension & OPEB liability\n8.7 \n9.8 \nLess: Average automotive and other net income tax asset\n(22.9)\n(22.7)\nROIC-adjusted average net assets\n$\n67.1 \n$\n73.0 \nROIC-adjusted\n18.5 \n%\n19.4 \n%\n__________\n(a)\nRefer to the reconciliation of Net income (loss) attributable to stockholders to EBIT-adjusted within this section of MD&A. \n(b)\nIncludes equity of noncontrolling interests where the corresponding earnings (loss) are included in EBIT-adjusted.\nForward-Looking Statements  \nThis report and the other reports filed by us with the SEC from time to time, as well as statements incorporated by reference herein and related comments by our management, may include \"forward-looking statements\" within the meaning of the U.S. federal securities laws. Forward-looking statements are any statements other than statements of historical fact. Forward-looking statements represent our current judgment about possible future events and are often identified by words like “aim,” “anticipate,” “appears,” “approximately,” “believe,” “continue,” “could,” “designed,” “effect,” “estimate,” “evaluate,” “expect,” “forecast,” “goal,” “initiative,” “intend,” “may,” “objective,” “outlook,” “plan,” “potential,” “priorities,” “project,” “pursue,” “seek,” “should,” “target,” “when,” “will,” “would,” or the negative of any of those words or similar expressions. In making these statements, we rely on assumptions and analysis based on our experience and perception of historical trends, current conditions and expected future developments as well as other factors we consider appropriate under the circumstances. We believe these judgments are reasonable, but these statements are not guarantees of any future events or financial results, and our actual results may differ materially due to a variety of important factors, many of which are beyond our control. These factors, which may be revised or supplemented in subsequent reports we file with the SEC, include, among others, the following: (1) our ability to deliver new products, services, technologies and customer experiences in response to increased competition and changing consumer needs and preferences; (2) our ability to attract and retain talented and highly skilled employees; (3) our ability to timely fund and introduce new and improved vehicle models, including EVs, that are able to attract a sufficient number of consumers; (4) our ability to profitably deliver a strategic portfolio of EVs; (5) adoptions of EVs by consumers; (6) the success of our current line of ICE vehicles, particularly our full-size SUVs and full-size pickup trucks; (7) our highly competitive industry, which has been historically characterized by excess manufacturing capacity and the use of incentives, and the introduction of new and improved vehicle models by our competitors; (8) the unique technological, operational, regulatory and competitive risks related to our refocused AV strategy on personal vehicles; (9) risks associated with climate change, including increased regulation of GHG emissions, our transition to EVs and the potential increased impacts of severe weather events; (10) global automobile market sales volume, which can be volatile; (11) inflationary pressures and persistently high prices and uncertain availability of raw materials and commodities used by us and our suppliers, and instability in logistics and related costs; (12) our business in China, which is subject to unique operational, competitive, regulatory and economic risks; (13) the success of our ongoing strategic business relationships, particularly with respect to facilitating access to raw materials necessary for the production of EVs, and of our joint ventures, which we cannot operate solely for our benefit and over which we may have limited control; (14) the international scale and footprint of our operations, which expose us to a variety of unique political, economic, competitive and regulatory risks, including the risk of changes in government leadership and laws (including labor, trade, tax and other laws), political uncertainty or instability and economic tensions between governments and changes in international trade policies, new barriers to entry and changes to or withdrawals from free trade agreements, introduction of new tariffs or changes to announced tariffs directly and indirectly applicable to our industry, changes in foreign exchange rates and interest rates, economic downturns in the countries in which we operate, differing local product preferences and product requirements, changes to and compliance with U.S. and foreign countries' export controls and economic sanctions, differing labor regulations, requirements and union relationships, differing dealer and franchise regulations and relationships, difficulties in obtaining financing in foreign countries, and public health crises, including the occurrence of a contagious disease or illness; (15) any significant disruption, including any work stoppages, at any of our manufacturing facilities; (16) the ability of our suppliers to deliver parts, systems and components without disruption and at such times to allow us to meet production schedules; (17) pandemics, epidemics, disease outbreaks and other public health crises; (18) the possibility that competitors may independently develop products and services similar to ours, or that our intellectual property rights are not sufficient to prevent competitors from developing or selling those products or services; (19) our ability to manage risks related to security breaches, cyberattacks and other disruptions to our information technology systems and networked products, including connected vehicles; (20) our ability to \n47\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nmanage security breaches and other disruptions to our in-vehicle systems; (21) our ability to comply with increasingly complex, restrictive and punitive regulations relating to our enterprise data practices, including the collection, use, sharing and security of the personal information of our customers, employees or suppliers; (22) our ability to comply with extensive laws, regulations and policies applicable to our industry, operations and products, including those in the Act and/or relating to fuel economy, emissions and AVs; (23) costs and risks associated with litigation and government investigations; (24) the costs and effect on our reputation of product safety recalls and alleged defects in products and services; (25) any additional tax expense or exposure or failure to fully realize available tax incentives; (26) our continued ability to develop captive financing capability through GM Financial; and (27) any significant increase in our pension funding requirements. A further discussion of these risks, uncertainties and other factors can be found in Part I, Item 1A. Risk Factors of our 2024 Form 10-K, Part II, Item 1A. Risk Factors and our subsequent filings with the SEC.\nWe caution readers not to place undue reliance on forward-looking statements. Forward-looking statements speak only as of the date they are made, and we undertake no obligation to update publicly or otherwise revise any forward-looking statements, whether as a result of new information, future events or other factors, except where we are expressly required to do so by law.\n*  *  *  *  *  *  *"
}