{
  "source_file": "gnrc20250930_10q.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n          Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\n \n\n\nThis quarterly report contains forward-looking statements that are subject to risks and uncertainties. Forward-looking statements give our current expectations and projections relating to our financial condition, results of operations, plans, objectives, future performance and business. You can identify forward-looking statements by the fact that they do not relate strictly to historical or current facts. These statements may include words such as “anticipate,” “estimate,” “expect,” “forecast,” “project,” “plan,” “intend,” “believe,” “confident,” “may,” “should,” “can have,” “likely,” “future,” “optimistic” and other words and terms of similar meaning in connection with any discussion of the timing or nature of future operating or financial performance or other events.\n\n\n \n\n\nThe forward-looking statements contained in this quarterly report are based on assumptions that we have made in light of our industry experience and on our perceptions of historical trends, current conditions, expected future developments and other factors we believe are appropriate under the circumstances. As you read and consider this report, you should understand that these statements are not guarantees of performance or results. They involve risks, uncertainties (some of which are beyond our control) and assumptions. Although we believe that these forward-looking statements are based on reasonable assumptions, you should be aware that many factors could affect our actual financial results and cause them to differ materially from those anticipated in the forward-looking statements. The forward-looking statements contained in this quarterly report include estimates and comments regarding:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nour business and markets that we serve, financial and operating results, and future economic performance; \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nproposed new product and service offerings; and \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nmanagement's goals, expectations, and objectives, and other similar expressions concerning matters that are not historical facts.\n \n\n\n\n\n\n\n\n\n \n\n\nFactors that could affect our actual financial results and cause them to differ materially from those anticipated in the forward-looking statements include:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\nfluctuations in cost, availability, and quality of raw materials, key components and labor required to manufacture our products;\n\n\n\n\n\n\n \n\n\n●\n\n\nour dependence on a small number of contract manufacturers and component suppliers, including single-source suppliers;\n\n\n\n\n\n\n \n\n\n●\n\n\nchanges and volatility with respect to the trade policies of various countries, which may result in new or increased tariffs, trade restrictions, or other unfavorable trade actions;\n\n\n\n\n\n\n \n\n\n●\n\n\nour ability to protect our intellectual property rights or successfully defend against third party infringement claims;\n\n\n\n\n\n\n \n\n\n●\n\n\nchanges in durable goods spending by consumers and businesses or other global macroeconomic conditions, impacting demand for our products;\n\n\n\n\n\n\n \n\n\n●\n\n\nchanges in governmental policies, particularly with respect to tax incentives, tax credits, or grant programs, which could: (i) affect the demand for certain of our products; or (ii) result in a withdrawal or reduction of grants previously awarded to the Company;\n\n\n\n\n\n\n \n\n\n●\n\n\nincrease in product and other liability claims, warranty costs, recalls, or other claims;\n\n\n\n\n\n\n \n\n\n●\n\n\nsignificant legal proceedings, claims, fines, penalties, tax assessments, lawsuits or government investigations;\n\n\n\n\n\n\n \n\n\n●\n\n\nour ability to consummate our share repurchase programs;\n\n\n\n\n\n\n \n\n\n●\n\n\nour failure or inability to adapt to, or comply with, current or future changes in applicable laws, regulations, and product standards;\n\n\n\n\n\n\n \n\n\n●\n\n\nour ability to develop and enhance products and gain customer acceptance, including our offerings that serve the data center and energy technology markets;\n\n\n\n\n\n\n \n\n\n●\n\n\nfrequency and duration of power outages impacting demand for our products;\n\n\n\n\n\n\n \n\n\n●\n\n\nour ability to accurately forecast demand for our products and effectively manage inventory levels relative to such forecast;\n\n\n\n\n\n\n \n\n\n●\n\n\nour ability to remain competitive;\n\n\n\n\n\n\n \n\n\n●\n\n\nour dependence on our dealer and distribution network;\n\n\n\n\n\n\n \n\n\n●\n\n\nmarket reaction to changes in selling prices or mix of products;\n\n\n\n\n\n\n \n\n\n●\n\n\nloss of our key management and employees;\n\n\n\n\n\n\n \n\n\n●\n\n\ndisruptions from labor disputes or organized labor activities;\n\n\n\n\n\n\n \n\n\n●\n\n\nour ability to attract and retain employees;\n\n\n\n\n\n\n \n\n\n●\n\n\ndisruptions in our manufacturing operations;\n\n\n\n\n\n\n \n\n\n●\n\n\nthe possibility that the expected synergies, efficiencies and cost savings of our acquisitions, divestitures, restructurings, or realignments will not be realized, or will not be realized within the expected time period;\n\n\n\n\n\n\n \n\n\n●\n\n\nrisks related to sourcing components in foreign countries;\n\n\n\n\n\n\n \n\n\n●\n\n\ncompliance with environmental, health and safety laws and regulations;\n\n\n\n\n\n\n \n\n\n●\n\n\nscrutiny regarding our sustainability practices \n\n\n\n\n\n\n \n\n\n●\n\n\n\n\n\n\n\n\n\n\n\n           government regulation of our products;\n         \n\n\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n●\n\n\nfailures or security breaches of our networks, information technology systems, or connected products;\n\n\n\n\n\n\n \n\n\n●\n\n\nour ability to make payments on our indebtedness;\n\n\n\n\n\n\n \n\n\n●\n\n\nterms of our credit facilities that may restrict our operations;\n\n\n\n\n\n\n \n\n\n●\n\n\nour potential need for additional capital to finance our growth or refinance our existing credit facilities; \n\n\n\n\n\n\n \n\n\n●\n\n\nrisks of impairment of the value of our goodwill and other indefinite-lived assets;\n\n\n\n\n\n\n \n\n\n●\n\n\nvolatility of our stock price; and\n\n\n\n\n\n\n \n\n\n●\n\n\npotential tax liabilities.\n\n\n\n\n\n\n\n\n \n\n\nShould one or more of these risks or uncertainties materialize, or should any of these assumptions prove incorrect, our actual results may vary in material respects from those projected in any forward-looking statements. A detailed discussion of these and other factors that may affect future results is contained in our filings with the Securities and Exchange Commission, including in Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2024 and in Part II, Item 1A of this Quarterly Report on Form 10-Q. Stockholders, potential investors and other readers should consider these factors carefully in evaluating the forward-looking statements.\n\n\n \n\n\nAny forward-looking statement made by us in this report speaks only as of the date on which it is made. Factors or events that could cause our actual results to differ may emerge from time to time, and it is not possible for us to predict all of them. We undertake no obligation to update any forward-looking statement, whether as a result of new information, future developments or otherwise, except as may be required by law.\n\n\n \n\n\n\n\n\n\n\n\n\n       19\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nRecent Developments\n\n\n \n\n\nAs disclosed in Part I, Item 1A: Risk Factors, of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, our business is subject to risks related to, among other factors, tariffs and other changes in U.S. trade policy and international trade relations. Starting in the first quarter of 2025, the United States government enacted additional tariffs on goods imported into the U.S. from numerous countries (such as China, Vietnam, and India) and certain countries announced tariffs on U.S. goods. Some of these tariffs have been subsequently modified or delayed, and the U.S. government has also stated it is willing to negotiate with respect to the tariffs it has enacted.\n\n\n \n\n\nWe have implemented price increases across many of our product offerings and are currently executing a number of supply chain initiatives to attempt to mitigate the impact of these tariffs on our profitability. Despite our efforts, these tariff actions may negatively impact demand due to higher prices and also result in lower margins for some of our products. As U.S. trade policy continues to evolve, Generac will continue to analyze the impact of future tariffs and actions that can be taken to mitigate and/or minimize their effects.\n\n\n \n\n\nOverview\n\n\n \n\n\nFounded in 1959, Generac is a leading global designer, manufacturer, and provider of a wide range of energy technology solutions. Generac provides power generation equipment, energy storage systems, energy management devices & solutions, and other power products and services serving the residential, light commercial, data & telecom, and industrial markets. The Company continues to expand its energy technology offerings for homes and businesses in its mission to Power a Smarter World and lead the evolution to more resilient, efficient, and sustainable energy solutions.\n\n\n \n\n\nWe have a long history of providing power generation products across a variety of applications, and we maintain one of the leading positions in the North American market for power equipment with an expanding presence internationally. We believe we have one of the widest ranges of products in the power generation marketplace, including residential, commercial, and industrial standby generators, as well as portable and mobile generators used in a variety of applications. The Company is evolving its product portfolio by building out ecosystems of energy technology products, solutions, and services for homes and businesses, enabling end users to better manage their energy costs and needs. As part of this evolution, we have made significant investments into developing markets such as residential and commercial & industrial (C&I) energy storage, solar power inverters, energy monitoring & management devices, and electric vehicle (EV) charging. Central to these ecosystems are the Company’s advanced connectivity devices, controls capabilities, and software platforms that facilitate the integration of our products into grid services programs. In addition, we have been leveraging our leading position in the growing market for natural gas fueled generators, which we believe represents a cleaner fuel compared to diesel, to expand into applications beyond standby power, allowing us to participate in multi-purpose microgrid projects for C&I customers. As the traditional centralized utility model evolves over time, we believe that a more decarbonized, digitized, and decentralized grid infrastructure will develop, and our energy technology solutions are uniquely and strategically positioned to participate in this next-generation grid.\n\n\n \n\n\nGiven our competitive strengths in our traditional power generation markets, we believe we are well-positioned to execute on the growing opportunity for backup power for homes and businesses, where increased penetration is being driven by multiple mega-trends that are resulting in poorer power quality for end users. In addition, our focus on more resilient, efficient and sustainable energy solutions has increased our served addressable market, and as a result, we believe we can continue to be a leader as energy costs rise and end markets evolve over time.\n\n\n \n\n\nMega-Trends, Strategic Growth Themes, and Additional Business Drivers\n\n\n \n\n\nIn 2021, we unveiled our “Powering A Smarter World” strategic plan, which serves as the framework for the significant investments we have made and will continue to make to capitalize on the long-term growth prospects of Generac. Our enterprise strategy is based on the combination of several key mega-trends that we believe will drive a number of significant strategic growth themes for our business.\n\n\n \n\n\nKey Mega-Trends:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nLower power quality continuing to drive demand for backup power solutions:\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n  o\n \n\n\n \nMore frequent severe and volatile weather impacting an aging grid, causing increased power outage activity.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n  o\n \n\n\n \nIncreasing deployment of intermittent generation sources coupled with accelerating electricity demand trends driving supply/demand imbalances for utilities and grid operators.\n \n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nHigher power prices driving the need for energy management solutions:\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n o\n \n\n\n \nElectrification trends causing power demand to exceed supply, driving up power prices. \n \n\n\n\n\n\n\n \n\n\n \n\n\n \n o \n \n\n\n \nInvestment required to upgrade grid infrastructure and transition to renewable power sources, pushing prices higher.\n \n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nArtificial intelligence adoption accelerating, creating a large market opportunity for backup power:\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n o\n \n\n\n \nSignificant power requirements for the buildout of data centers to enable AI adoption could drive further grid instability and higher power prices.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n o\n \n\n\n \nAcceleration in the number of hyperscale and edge data centers that require significant backup power, creates a significant growth opportunity for our C&I products.\n \n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nGrowing demand for cleaner burning fuels: \n \n\n\n\n\n\n\n \n\n\n \n\n\n \n o\n \n\n\n \nNatural gas and other alternative fuels are vital to the energy transition.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n o\n \n\n\n \nDemand for natural gas-fueled backup generators growing as homes and businesses desire cleaner-burning fuel sources of generation. \n \n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nRequired investment in global infrastructure, driving demand for our products: \n \n\n\n\n\n\n\n \n\n\n \n\n\n \n o\n \n\n\n \nUpgrading of aging and underinvested legacy infrastructure systems, such as power, telecommunications, transportation, and water. \n \n\n\n\n\n\n\n \n\n\n \n\n\n \n o\n \n\n\n \nExpanding investment for increasingly critical technology infrastructure as we transition to a more \"connected\" society. \n \n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nHome as a Sanctuary, driving increased demand for resiliency solutions that provide peace of mind:\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n o\n \n\n\n \nIncreasing importance of the home with more people working from home and aging in place.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n o\n \n\n\n \nGrowing market for intelligent and connected homes that can provide improved energy efficiency. \n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n       20\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nStrategic Growth Themes:\n\n\n\n\n\n\n\n\n \n\n\nPower quality issues continue to increase\n. Power disruptions are an important driver of consumer awareness for backup power and have historically influenced demand for generators both in the United States and internationally. Increased frequency and duration of major power outage events, that have a broader impact beyond a localized level, increases product awareness and may drive consumers to accelerate their purchase of a standby or portable generator during the immediate and subsequent period, which we believe may last for six to twelve months following a major outage event. Energy storage systems offer similar resiliency advantages to consumers and can benefit from these same awareness drivers, at least for short duration power outages. The optional standby market for C&I power generation is also driven by power quality issues and the related need for backup power. The impact of climate change has received increased global focus in recent years, and an aging and underinvested electrical grid infrastructure remains highly vulnerable to the expectation of more severe and volatile weather. Additionally, rapid growth in renewable power sources such as solar and wind is resulting in increased intermittency of supply as more traditional thermal generation assets are retired, further impairing the reliable supply of electricity. At the same time, power demand is expected to meaningfully accelerate as a result of the rapid adoption of artificial intelligence and related data center energy requirements, the re-industrialization of North America, and the electrification of a wide range of consumer and commercial products, including transportation, HVAC systems, and other major appliances. These developments are causing growing supply/demand imbalances for grid operators across North America, which has led to high-profile examples of rolling blackouts and calls for utility customers to reduce consumption to maintain grid integrity. In fact, the North American Electric Reliability Corporation has labeled significant portions of the United States and Canada as being at high or elevated risk of resource adequacy shortfalls in the 2025-2029 period due in part to these supply/demand dynamics. We believe utility supply shortfalls and related warnings may continue in the future, resulting in continued deterioration of power quality in North America. Finally, certain utilities are adopting preventative power shutoff policies to reduce the risk of wildfires caused by their electrical distribution equipment, predominately in the western half of the country. Taken together, we expect these factors to continue driving increased awareness of the need for backup power and demand for Generac’s products within multiple categories.\n\n\n \n\n\nHome standby penetration opportunity is significant\n. Many potential customers are still not aware of the costs and benefits of automatic backup power solutions. With only approximately 6.5% penetration of the addressable market of homes in the United States (which we define as single-family detached, owner-occupied households with a home value of over $175,000, as defined by the U.S. Census Bureau's 2023 American Housing Survey for the United States), we believe there are significant opportunities to further penetrate the residential standby generator market both domestically and internationally. In addition to the mega-trends supporting growth of the category, we believe by expanding and developing our distribution network, continuing to invest in our product lines and technologies, and targeting our marketing efforts, we can continue to build awareness and increase penetration for our home standby generators.\n\n\n \n\n\nSolar, storage, and energy management marke\nt \nopportunities\n. We believe the electric utility landscape will undergo significant changes in the decade ahead due to accelerating demand growth, grid instability and power quality issues, environmental concerns, and the continuing performance and cost improvements in renewable energy and energy storage technologies. Importantly, we expect that a confluence of factors will continue to drive meaningful increases in power prices for end users in the future. As a result, on-site power generation from renewable sources and cleaner-burning natural gas generators are projected to become more prevalent as will the need to monitor, manage, and store this power – potentially developing into a significant market opportunity as utility customers seek alternative solutions to combat rising power prices. In addition, battery storage provides customers another source of power resiliency for shorter duration outages. These markets have historically been supported by subsidies and investment tax credits for consumers and businesses to help advance the adoption of clean energy technologies. Further, production tax credits are being offered to businesses that meet certain domestic manufacturing requirements in the production of renewable energy products. \nOn July 4, 2025, the United States signed into law the OBBBA.  The OBBBA accelerates the phase-out of tax incentives for the solar market and includes certain supply chain requirements to qualify for these incentives. While the change in the availability and duration of tax incentives will negatively impact the solar and storage markets in the near term, \nwe believe the overall mega-trends that are driving the solar, storage, and energy management markets currently provide sufficient incentive for long-term, value-creating investments for market participants in this space. Given the significant long-term market opportunity, we expect to further improve our capabilities in energy technology product development, sourcing, distribution, and marketing. In addition, we plan to leverage our significant competencies in the residential standby generator market to increase our market position in the residential solar, storage, and energy management markets as we continue to build out our residential ecosystem of products and solutions. \n\n\n \n\n\nNatural gas generators, a continuing growth opportunity\n. We believe natural gas will continue to be an important and cleaner transition fuel of the future, compared to diesel, as the world continues to shift towards lower emission power generation sources. Demand for natural gas generators continues to represent an increasing portion of the overall C&I market, as the benefits of natural gas power generation are very compelling relative to traditional diesel fueled generators. We also continue to explore and expand our capabilities within new gaseous generator market opportunities, including continuous-duty, prime rated, distributed generation, demand response, microgrids, and overall use as DERs in areas where grid stability is needed. Many of these applications are made possible by our natural gas generators having the capability to participate in available grid services programs, helping to offset the purchase price of the equipment over the product’s lifespan. Expanding our natural gas product offering into larger power nodes is also a part of this growth theme in taking advantage of the continuing shift from diesel to natural gas generators. As a leader in natural gas power generation, we believe we are well positioned to capitalize on this strategic growth theme.\n\n\n \n\n\nIncreasingly critical nature and growing power consumption of digital infrastructure\n. As the number of “connected” devices continues to rapidly increase and wireless networks are considered critical infrastructure in the United States, network reliability and up-time are necessary for our increasingly connected society. This will require highly resilient cell tower sites across the network, and therefore necessitates the need for backup power sources on site at these cell towers. Generac is the leading supplier of backup power to the telecommunications market in the United States. As more mission-critical data is transmitted over wireless networks, we believe the penetration rate of backup generators on cell towers must increase considerably to maintain a higher level of reliability across the network. We have relationships with key Tier 1 carriers and tower companies globally, in addition to having the distribution partners to provide local service support to the global market. We believe these factors coupled with Generac’s ability to customize solutions to each customer’s needs help us to maintain our strength within the global telecommunications market.\n\n\n \n\n\nSubstantial investment in new data centers and accelerating adoption of artificial intelligence.\n As a result of the development of artificial intelligence and the expected benefits of this technology, there is significant capital expenditure investment going into the build out of data center infrastructure, which should enable the accelerated adoption of artificial intelligence capabilities. Backup power solutions are a necessary part of the substantial investment in data centers. Given the significant power requirements of increasingly large data center campuses, and the mission critical nature of these applications that require complete resiliency coverage, demand for large backup power generators is expected to continue to grow at a dramatic rate for the foreseeable future. This ongoing rapid demand growth for large generators has resulted in market supply constraints. As a result of our recently introduced high output diesel generator offering, this large and growing data centers market represents a significant incremental opportunity for our global C&I product category. As we continue to ramp our capabilities for large megawatt generators, we believe that we are well positioned to take share in this market over time given our historical focus on backup power generation which allows us to provide customized sales, engineering, and aftermarket support while also providing data center customers with a robust service network to ensure uptime for these critical applications. Additionally, we believe this significant growth in data center power consumption will drive demand for backup power and intelligent energy management solutions for the broader electrical grid and other grid participants as these large power loads contribute to the growing power supply/demand imbalance.\n\n\n \n\n\n\n\n\n\n\n\n\n       21\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nOther Business Drivers\n\n\n \n\n\nImpact of residential investment cycle.\n The market for a number of our residential products is affected by the residential investment cycle and overall consumer confidence and sentiment. When homeowners are confident of their household income, the value of their home and overall net worth, they are more likely to invest in their home. These trends can have an impact on demand for residential generators, energy storage systems, and energy management devices. Trends in interest rates and the new housing market, highlighted by residential housing starts, can also impact demand for these products. Demand for outdoor power equipment is also impacted by several of these factors, as well as weather patterns. The existence, or lack thereof, of renewable energy mandates, investment tax credits, and other subsidies can also have an impact on the demand for solar and energy storage systems. \n\n\n \n\n\nImpact of business capital investment and other economic cycles.\n The global market for our C&I products is affected by different capital investment cycles, which can vary widely across the different regions and markets that we serve. These cycles include non-residential building construction, durable goods and infrastructure spending, as well as investments in the build out of data centers, as businesses or organizations either add new locations or make investments to upgrade existing locations or equipment. These trends and market conditions can have a material impact on demand for our C&I products. The capital investment cycle may differ for the various C&I end markets that we serve, including light commercial, retail, office, telecommunications, rental, industrial, data centers, healthcare, construction, oil & gas, and municipal infrastructure, among others. The market for these products is also affected by general economic conditions, fluctuations in interest rates, and geopolitical matters in the various countries where we serve, as well as credit availability in those regions.\n\n\n \n\n\nFactors \nA\nffecting\n R\nesults of \nO\nperations\n\n\n \n\n\nWe are subject to various factors that can affect our results of operations, which we attempt to mitigate through factors we can control, including continued product development, expanded distribution, pricing, cost control, and hedging. Certain operational and other factors that affect our business include the following:\n\n\n \n\n\nEffect of commodity, currency, component price fluctuations, and resource availability.\n    Industry-wide price fluctuations of key commodities, such as steel, copper and aluminum, along with other components we use in our products, as well as changes in labor costs required to produce our products, can have a material impact on our results of operations. Acquisitions over the years have increased our use of advanced electronic components and battery cells, as well as further expanded our commercial and operational presence outside of the United States. Our international acquisitions, along with our existing global supply chain, expose us to fluctuations in foreign currency exchange rates and regulatory tariffs that can also have a material impact on our results of operations. \n\n\n \n\n\nWe have historically attempted to mitigate the impact of any inflationary pressures through improved product design and sourcing, manufacturing efficiencies, price increases, and select hedging transactions. Our results are also influenced by changes in fuel prices in the form of freight rates, which in some cases are accepted by our customers and in other cases are paid by us.\n\n\n \n\n\nSeasonality.\n    Although there is demand for our products throughout the year, in each of the past five years, approximately 19% to 25% of our net sales occurred in the first quarter, 22% to 28% in the second quarter, 24% to 28% in the third quarter, and 23% to 31% in the fourth quarter, with different seasonality depending primarily on the occurrence, timing and severity of major power outage activity in each year. Major outage activity is unpredictable by nature and, as a result, our sales levels and profitability may fluctuate from period to period. The seasonality experienced during a major power outage, and for the subsequent quarters following the event, will vary relative to other periods where no major outage events occurred. \n\n\n \n\n\nAcquisitions.\n   Over the years, we have executed a number of acquisitions that support our strategic plan. A summary of the recent acquisitions can be found in Note 1, “Description of Business and Basis of Presentation,” to the condensed consolidated financial statements in Item 1 of this Quarterly Report on Form 10-Q and in Item 8 (Note 1, “Description of Business”) of the Annual Report on Form 10-K for the year ended December 31, 2024. \n\n\n \n\n\nFactors Influencing Interest Expense\n\n\n \n\n\nInterest expense can be impacted by a variety of factors, including market fluctuations in SOFR, interest rate election periods, interest rate swap agreements, repayments or borrowings of indebtedness, and amendments to our credit agreements. Refer to Note 11, “Credit Agreements,” to the condensed consolidated financial statements included in Item 1 of this Quarterly Report on Form 10-Q for further information. The year-over-year decrease in interest expense in the current period was primarily driven by lower borrowings and lower interest rates compared to the prior year period. \n\n\n \n\n\nFactors Influencing Provision for Income Taxes and Cash Income Taxes Paid\n\n\n \n\n\nThe effective income tax rates for the nine months ended September 30, 2025 and 2024 were 18.3% and 24.6%, respectively. The decrease in the effective tax rate for the current period was primarily attributable to discrete tax benefits, including those related to a business disposition, as well as certain return-to-provision adjustments in the current year.\n\n\n \n\n\nIn 2021, the Organization for Economic Cooperation and Development (OECD) released Pillar Two Global Anti-Base Erosion model rules, designed to ensure large corporations are taxed at a minimum rate of 15% in all countries of operation. The OECD continues to release guidance and countries are implementing legislation to adopt the rules, some of which became effective on January 1, 2024. The United States has not yet enacted legislation implementing Pillar Two. We are continuing to implement the Pillar Two rules and evaluate their potential impact on future periods. There was no impact to our financial results for the three or nine months ended September 30, 2025, and we do not expect the rules to have a material impact on our effective tax rate for the remainder of the year. We will update our future tax provisions based on new regulations or guidance accordingly. \n\n\n \n\n\nOn July 4, 2025, the United States signed the “One Big Beautiful Bill Act” (OBBBA) into law. This legislation makes permanent several key provisions of the Tax Cuts and Jobs Act, including 100% bonus depreciation and the immediate expensing of domestic research and development costs. Under ASC 740, “Income Taxes,” the effects of changes in tax laws are reflected in the Company’s financial statements in the quarter in which the legislation was passed.  We expect to realize cash tax savings during 2025 as a result of provisions related to bonus depreciation and domestic research and development expensing. These changes did not have a material impact on our effective income tax rate for the third quarter or the estimated annual effective tax rate for 2025 as the changes relate to temporary differences in basis. \n\n\n \n\n\n\n\n\n\n\n\n\n       22\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\nResults of \nO\nperations\n\n\n \n\n\nThree\n \nmonths ended \nSeptember 30, 2025\n,\n compared \nto the\n \nthree months ended\n \nSeptember 30, 2024\n\n\n \n\n\nThe following table sets forth our consolidated statements of operations information for the periods indicated:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nThree Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nNet sales\n \n\n\n \n\n\n$\n\n\n1,114,353\n\n\n \n\n\n \n\n\n$\n\n\n1,173,563\n\n\n \n\n\n \n\n\n$\n\n\n(59,210\n\n\n)\n\n\n \n\n\n \n\n\n-5.0\n\n\n%\n\n\n\n\n\n\n \nCosts of goods sold\n \n\n\n \n\n\n \n\n\n687,431\n\n\n \n\n\n \n\n\n \n\n\n701,294\n\n\n \n\n\n \n\n\n \n\n\n(13,863\n\n\n)\n\n\n \n\n\n \n\n\n-2.0\n\n\n%\n\n\n\n\n\n\n \nGross profit\n \n\n\n \n\n\n \n\n\n426,922\n\n\n \n\n\n \n\n\n \n\n\n472,269\n\n\n \n\n\n \n\n\n \n\n\n(45,347\n\n\n)\n\n\n \n\n\n \n\n\n-9.6\n\n\n%\n\n\n\n\n\n\n \nOperating expenses:\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nSelling and service\n \n\n\n \n\n\n \n\n\n145,104\n\n\n \n\n\n \n\n\n \n\n\n145,310\n\n\n \n\n\n \n\n\n \n\n\n(206\n\n\n)\n\n\n \n\n\n \n\n\n-0.1\n\n\n%\n\n\n\n\n\n\n \nResearch and development\n \n\n\n \n\n\n \n\n\n60,059\n\n\n \n\n\n \n\n\n \n\n\n56,936\n\n\n \n\n\n \n\n\n \n\n\n3,123\n\n\n \n\n\n \n\n\n \n\n\n5.5\n\n\n%\n\n\n\n\n\n\n \nGeneral and administrative\n \n\n\n \n\n\n \n\n\n93,748\n\n\n \n\n\n \n\n\n \n\n\n77,242\n\n\n \n\n\n \n\n\n \n\n\n16,506\n\n\n \n\n\n \n\n\n \n\n\n21.4\n\n\n%\n\n\n\n\n\n\n \nAmortization of intangible assets\n \n\n\n \n\n\n \n\n\n24,932\n\n\n \n\n\n \n\n\n \n\n\n24,157\n\n\n \n\n\n \n\n\n \n\n\n775\n\n\n \n\n\n \n\n\n \n\n\n3.2\n\n\n%\n\n\n\n\n\n\n \nTotal operating expenses\n \n\n\n \n\n\n \n\n\n323,843\n\n\n \n\n\n \n\n\n \n\n\n303,645\n\n\n \n\n\n \n\n\n \n\n\n20,198\n\n\n \n\n\n \n\n\n \n\n\n6.7\n\n\n%\n\n\n\n\n\n\n \nIncome from operations\n \n\n\n \n\n\n \n\n\n103,079\n\n\n \n\n\n \n\n\n \n\n\n168,624\n\n\n \n\n\n \n\n\n \n\n\n(65,545\n\n\n)\n\n\n \n\n\n \n\n\n-38.9\n\n\n%\n\n\n\n\n\n\n \nTotal other expense, net\n \n\n\n \n\n\n \n\n\n(24,741\n\n\n)\n\n\n \n\n\n \n\n\n(21,393\n\n\n)\n\n\n \n\n\n \n\n\n(3,348\n\n\n)\n\n\n \n\n\n \n\n\n-15.6\n\n\n%\n\n\n\n\n\n\n \nIncome before provision for income taxes\n \n\n\n \n\n\n \n\n\n78,338\n\n\n \n\n\n \n\n\n \n\n\n147,231\n\n\n \n\n\n \n\n\n \n\n\n(68,893\n\n\n)\n\n\n \n\n\n \n\n\n-46.8\n\n\n%\n\n\n\n\n\n\n \nProvision for income taxes\n \n\n\n \n\n\n \n\n\n11,758\n\n\n \n\n\n \n\n\n \n\n\n33,453\n\n\n \n\n\n \n\n\n \n\n\n(21,695\n\n\n)\n\n\n \n\n\n \n\n\n-64.9\n\n\n%\n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n66,580\n\n\n \n\n\n \n\n\n \n\n\n113,778\n\n\n \n\n\n \n\n\n \n\n\n(47,198\n\n\n)\n\n\n \n\n\n \n\n\n-41.5\n\n\n%\n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n419\n\n\n \n\n\n \n\n\n \n\n\n36\n\n\n \n\n\n \n\n\n \n\n\n383\n\n\n \n\n\n \n\n\n \n\n\n1063.9\n\n\n%\n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n66,161\n\n\n \n\n\n \n\n\n$\n\n\n113,742\n\n\n \n\n\n \n\n\n$\n\n\n(47,581\n\n\n)\n\n\n \n\n\n \n\n\n-41.8\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\nThe following tables set forth our reportable segment information for the periods indicated:\n   \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nNet Sales\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nThree Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n933,646\n\n\n \n\n\n \n\n\n$\n\n\n1,011,347\n\n\n \n\n\n \n\n\n$\n\n\n(77,701\n\n\n)\n\n\n \n\n\n \n\n\n-7.7\n\n\n%\n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n180,707\n\n\n \n\n\n \n\n\n \n\n\n162,216\n\n\n \n\n\n \n\n\n \n\n\n18,491\n\n\n \n\n\n \n\n\n \n\n\n11.4\n\n\n%\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n1,114,353\n\n\n \n\n\n \n\n\n$\n\n\n1,173,563\n\n\n \n\n\n \n\n\n$\n\n\n(59,210\n\n\n)\n\n\n \n\n\n \n\n\n-5.0\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nTotal Sales by Reportable Segment\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nThree Months Ended September 30, 2025\n \n\n\n \n\n\n \n\n\n \nThree Months Ended September 30, 2024\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nExternal Net Sales\n \n\n\n \n\n\n \n\n\n \nIntersegment Sales\n \n\n\n \n\n\n \n\n\n \nTotal Sales\n \n\n\n \n\n\n \n\n\n \nExternal Net Sales\n \n\n\n \n\n\n \n\n\n \nIntersegment Sales\n \n\n\n \n\n\n \n\n\n \nTotal Sales\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n933,646\n\n\n \n\n\n \n\n\n$\n\n\n4,494\n\n\n \n\n\n \n\n\n$\n\n\n938,140\n\n\n \n\n\n \n\n\n$\n\n\n1,011,347\n\n\n \n\n\n \n\n\n$\n\n\n8,853\n\n\n \n\n\n \n\n\n$\n\n\n1,020,200\n\n\n \n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n180,707\n\n\n \n\n\n \n\n\n \n\n\n4,784\n\n\n \n\n\n \n\n\n \n\n\n185,491\n\n\n \n\n\n \n\n\n \n\n\n162,216\n\n\n \n\n\n \n\n\n \n\n\n4,485\n\n\n \n\n\n \n\n\n \n\n\n166,701\n\n\n \n\n\n\n\n\n\n \nIntercompany elimination\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(9,278\n\n\n)\n\n\n \n\n\n \n\n\n(9,278\n\n\n)\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(13,338\n\n\n)\n\n\n \n\n\n \n\n\n(13,338\n\n\n)\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n1,114,353\n\n\n \n\n\n \n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n1,114,353\n\n\n \n\n\n \n\n\n$\n\n\n1,173,563\n\n\n \n\n\n \n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n1,173,563\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nAdjusted EBITDA\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nThree Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n165,827\n\n\n \n\n\n \n\n\n$\n\n\n211,567\n\n\n \n\n\n \n\n\n$\n\n\n(45,740\n\n\n)\n\n\n \n\n\n \n\n\n-21.6\n\n\n%\n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n27,388\n\n\n \n\n\n \n\n\n \n\n\n20,298\n\n\n \n\n\n \n\n\n \n\n\n7,090\n\n\n \n\n\n \n\n\n \n\n\n34.9\n\n\n%\n\n\n\n\n\n\n \nTotal Adjusted EBITDA\n \n\n\n \n\n\n$\n\n\n193,215\n\n\n \n\n\n \n\n\n$\n\n\n231,865\n\n\n \n\n\n \n\n\n$\n\n\n(38,650\n\n\n)\n\n\n \n\n\n \n\n\n-16.7\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\nThe following table sets forth our product class information for the periods indicated:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNet Sales by Product Class\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nThree Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nResidential products\n \n\n\n \n\n\n$\n\n\n626,706\n\n\n \n\n\n \n\n\n$\n\n\n722,787\n\n\n \n\n\n \n\n\n$\n\n\n(96,081\n\n\n)\n\n\n \n\n\n \n\n\n-13.3\n\n\n%\n\n\n\n\n\n\n \nCommercial & industrial products\n \n\n\n \n\n\n \n\n\n358,273\n\n\n \n\n\n \n\n\n \n\n\n327,956\n\n\n \n\n\n \n\n\n \n\n\n30,317\n\n\n \n\n\n \n\n\n \n\n\n9.2\n\n\n%\n\n\n\n\n\n\n \nOther\n \n\n\n \n\n\n \n\n\n129,374\n\n\n \n\n\n \n\n\n \n\n\n122,820\n\n\n \n\n\n \n\n\n \n\n\n6,554\n\n\n \n\n\n \n\n\n \n\n\n5.3\n\n\n%\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n1,114,353\n\n\n \n\n\n \n\n\n$\n\n\n1,173,563\n\n\n \n\n\n \n\n\n$\n\n\n(59,210\n\n\n)\n\n\n \n\n\n \n\n\n-5.0\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\nNet sales.\n   Domestic segment total sales (including inter-segment sales) decreased approximately 8% to $938.1 million as compared to $1.02 billion in the prior year, including an approximate 1% benefit from acquisitions. The total sales decrease was primarily driven by weaker home standby and portable generator sales as a result of the significantly lower power outage environment in the current year quarter together with a strong prior year comparison which included multiple major landed hurricanes. This was partially offset by robust growth in residential energy technology shipments and an increase in C&I product sales to the telecom and industrial distributor channels.\n\n\n \n\n\nIn addition, total contribution from non-annualized acquisitions for the third quarter of 202\n5 was $10.7 million fo\nr the domestic segment. \n\n\n \n\n\n\n\n\n\n\n\n\n       23\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nInternational segment total sales (including inter-segment sales) increased approximately 11% to $185.5 million from $166.7 million in the prior year quarter, including an approximate 3% favorable impact from foreign currency. Sales growth for the segment was primarily driven by strength in C&I product shipments to European markets as well as initial shipments of large-megawatt generators to data center customers.\n\n\n \n\n\nGross profit.\n \n \n Gross profit margin was 38.3% as compared to 40.2% in the prior-year third quarter. The decrease in gross margin was primarily due to unfavorable sales mix together with the impact of higher tariffs and lower manufacturing absorption, partially offset by increased price realization. \n\n\n \n\n\nOperating Expenses.\n   Operating expenses increased $20.2 million, or 6.7%, as compared to the third quarter of 2024 primarily due to a $20.8 million increase in legal and regulatory charges and settlements, as disclosed in the accompanying non-GAAP measures reconciliation schedules. \n\n\n \n\n\nOther Expense.\n   The increase in other expense, net was driven primarily by a $5.7 million loss on the change in fair value of our investment in warrants and equity securities of Wallbox N.V. and a $1.2 million loss on the modification of our Original Tranche A Term Loan Facility and Original Revolving Facility.  This was partially offset by a decrease in interest expense compared to the prior year.\n\n\n \n\n\nProvision for income taxes.\n   Provision for income taxes for the current year quarter was $11.8 million, or an effective tax rate of 15.0%, as compared to $33.5 million, or a 22.7% effective tax rate, for the prior year. The decrease in effective tax rate was primarily driven by favorable discrete tax items in the current-year quarter related to certain return-to-provision adjustments that did not occur in the prior year.\n\n\n \n\n\nNet income attributable to Generac Holdings Inc.\n \n \n Net income attributable to the Company during the third quarter was $66 million, as compared to $114 million for the same period of 2024.  This decrease was primarily driven by the factors outlined above. \n\n\n \n\n\nAdjusted EBITDA.\n   Adjusted EBITDA for the domestic segment was $165.8 million, or 17.7% of domestic segment total sales, as compared to $211.6 million, or 20.7% of total sales, in the prior year. This decline was primarily driven by unfavorable sales mix together with the impact of incremental tariffs and operating deleverage on lower sales volumes, partially offset by increased price realization.\n\n\n \n\n\nAdjusted EBITDA for the international segment, before deducting for noncontrolling interests, was $27.4 million, or 14.8% of international segment total sales, as compared to $20.3 million, or 12.2% of total sales, in the prior year. This margin increase was primarily driven by favorable sales mix.\n\n\n \n\n\nAdjusted Net Income.\n   Adjusted net income attributable to the Company, as defined in the accompanying non-GAAP measures reconciliation schedules, was $108 million in the current year third quarter as compared to $136 million in the prior-year. This decrease was primarily driven by lower net income in the current period as outlined above together with changes in certain add-back items.\n\n\n \n\n\nSee “Non-GAAP Measures” for a discussion of how we calculate Adjusted EBITDA and Adjusted Net Income and the limitations on their usefulness. \n\n\n \n\n\nResults of \nO\nperations\n\n\n \n\n\nNine\n \nmonths ended \nSeptember 30, 2025\n,\n compared \nto the\n \nnine months ended\n \nSeptember 30, 2024\n\n\n \n\n\nThe following table sets forth our consolidated statements of operations information for the periods indicated:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nNine Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nNet sales\n \n\n\n \n\n\n$\n\n\n3,117,643\n\n\n \n\n\n \n\n\n$\n\n\n3,061,033\n\n\n \n\n\n \n\n\n$\n\n\n56,610\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n%\n\n\n\n\n\n\n \nCosts of goods sold\n \n\n\n \n\n\n \n\n\n1,901,986\n\n\n \n\n\n \n\n\n \n\n\n1,896,824\n\n\n \n\n\n \n\n\n \n\n\n5,162\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n%\n\n\n\n\n\n\n \nGross profit\n \n\n\n \n\n\n \n\n\n1,215,657\n\n\n \n\n\n \n\n\n \n\n\n1,164,209\n\n\n \n\n\n \n\n\n \n\n\n51,448\n\n\n \n\n\n \n\n\n \n\n\n4.4\n\n\n%\n\n\n\n\n\n\n \nOperating expenses:\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nSelling and service\n \n\n\n \n\n\n \n\n\n410,664\n\n\n \n\n\n \n\n\n \n\n\n382,049\n\n\n \n\n\n \n\n\n \n\n\n28,615\n\n\n \n\n\n \n\n\n \n\n\n7.5\n\n\n%\n\n\n\n\n\n\n \nResearch and development\n \n\n\n \n\n\n \n\n\n182,461\n\n\n \n\n\n \n\n\n \n\n\n160,342\n\n\n \n\n\n \n\n\n \n\n\n22,119\n\n\n \n\n\n \n\n\n \n\n\n13.8\n\n\n%\n\n\n\n\n\n\n \nGeneral and administrative\n \n\n\n \n\n\n \n\n\n247,924\n\n\n \n\n\n \n\n\n \n\n\n209,392\n\n\n \n\n\n \n\n\n \n\n\n38,532\n\n\n \n\n\n \n\n\n \n\n\n18.4\n\n\n%\n\n\n\n\n\n\n \nAmortization of intangible assets\n \n\n\n \n\n\n \n\n\n76,102\n\n\n \n\n\n \n\n\n \n\n\n73,698\n\n\n \n\n\n \n\n\n \n\n\n2,404\n\n\n \n\n\n \n\n\n \n\n\n3.3\n\n\n%\n\n\n\n\n\n\n \nTotal operating expenses\n \n\n\n \n\n\n \n\n\n917,151\n\n\n \n\n\n \n\n\n \n\n\n825,481\n\n\n \n\n\n \n\n\n \n\n\n91,670\n\n\n \n\n\n \n\n\n \n\n\n11.1\n\n\n%\n\n\n\n\n\n\n \nIncome from operations\n \n\n\n \n\n\n \n\n\n298,506\n\n\n \n\n\n \n\n\n \n\n\n338,728\n\n\n \n\n\n \n\n\n \n\n\n(40,222\n\n\n)\n\n\n \n\n\n \n\n\n-11.9\n\n\n%\n\n\n\n\n\n\n \nTotal other expense, net\n \n\n\n \n\n\n \n\n\n(71,802\n\n\n)\n\n\n \n\n\n \n\n\n(74,295\n\n\n)\n\n\n \n\n\n \n\n\n2,493\n\n\n \n\n\n \n\n\n \n\n\n3.4\n\n\n%\n\n\n\n\n\n\n \nIncome before provision for income taxes\n \n\n\n \n\n\n \n\n\n226,704\n\n\n \n\n\n \n\n\n \n\n\n264,433\n\n\n \n\n\n \n\n\n \n\n\n(37,729\n\n\n)\n\n\n \n\n\n \n\n\n-14.3\n\n\n%\n\n\n\n\n\n\n \nProvision for income taxes\n \n\n\n \n\n\n \n\n\n41,416\n\n\n \n\n\n \n\n\n \n\n\n65,124\n\n\n \n\n\n \n\n\n \n\n\n(23,708\n\n\n)\n\n\n \n\n\n \n\n\n-36.4\n\n\n%\n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n185,288\n\n\n \n\n\n \n\n\n \n\n\n199,309\n\n\n \n\n\n \n\n\n \n\n\n(14,021\n\n\n)\n\n\n \n\n\n \n\n\n-7.0\n\n\n%\n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n1,271\n\n\n \n\n\n \n\n\n \n\n\n220\n\n\n \n\n\n \n\n\n \n\n\n1,051\n\n\n \n\n\n \n\n\n \n\n\n477.7\n\n\n%\n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n184,017\n\n\n \n\n\n \n\n\n$\n\n\n199,089\n\n\n \n\n\n \n\n\n$\n\n\n(15,072\n\n\n)\n\n\n \n\n\n \n\n\n-7.6\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n       24\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nThe following tables set forth our reportable segment information for the periods indicated:\n   \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nNet Sales\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nNine Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n2,586,519\n\n\n \n\n\n \n\n\n$\n\n\n2,541,242\n\n\n \n\n\n \n\n\n$\n\n\n45,277\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n%\n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n531,124\n\n\n \n\n\n \n\n\n \n\n\n519,791\n\n\n \n\n\n \n\n\n \n\n\n11,333\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n%\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n3,117,643\n\n\n \n\n\n \n\n\n$\n\n\n3,061,033\n\n\n \n\n\n \n\n\n$\n\n\n56,610\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nTotal Sales by Reportable Segment\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nNine Months Ended September 30, 2025\n \n\n\n \n\n\n \n\n\n \nNine Months Ended September 30, 2024\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nExternal Net Sales\n \n\n\n \n\n\n \n\n\n \nIntersegment Sales\n \n\n\n \n\n\n \n\n\n \nTotal Sales\n \n\n\n \n\n\n \n\n\n \nExternal Net Sales\n \n\n\n \n\n\n \n\n\n \nIntersegment Sales\n \n\n\n \n\n\n \n\n\n \nTotal Sales\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n2,586,519\n\n\n \n\n\n \n\n\n$\n\n\n18,418\n\n\n \n\n\n \n\n\n$\n\n\n2,604,937\n\n\n \n\n\n \n\n\n$\n\n\n2,541,242\n\n\n \n\n\n \n\n\n$\n\n\n26,571\n\n\n \n\n\n \n\n\n$\n\n\n2,567,813\n\n\n \n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n531,124\n\n\n \n\n\n \n\n\n \n\n\n37,113\n\n\n \n\n\n \n\n\n \n\n\n568,237\n\n\n \n\n\n \n\n\n \n\n\n519,791\n\n\n \n\n\n \n\n\n \n\n\n18,127\n\n\n \n\n\n \n\n\n \n\n\n537,918\n\n\n \n\n\n\n\n\n\n \nIntercompany elimination\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(55,531\n\n\n)\n\n\n \n\n\n \n\n\n(55,531\n\n\n)\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(44,698\n\n\n)\n\n\n \n\n\n \n\n\n(44,698\n\n\n)\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n3,117,643\n\n\n \n\n\n \n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n3,117,643\n\n\n \n\n\n \n\n\n$\n\n\n3,061,033\n\n\n \n\n\n \n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n3,061,033\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nAdjusted EBITDA\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nNine Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n446,456\n\n\n \n\n\n \n\n\n$\n\n\n450,416\n\n\n \n\n\n \n\n\n$\n\n\n(3,960\n\n\n)\n\n\n \n\n\n \n\n\n-0.9\n\n\n%\n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n83,934\n\n\n \n\n\n \n\n\n \n\n\n73,371\n\n\n \n\n\n \n\n\n \n\n\n10,563\n\n\n \n\n\n \n\n\n \n\n\n14.4\n\n\n%\n\n\n\n\n\n\n \nTotal Adjusted EBITDA\n \n\n\n \n\n\n$\n\n\n530,390\n\n\n \n\n\n \n\n\n$\n\n\n523,787\n\n\n \n\n\n \n\n\n$\n\n\n6,603\n\n\n \n\n\n \n\n\n \n\n\n1.3\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\nThe following table sets forth our product class information for the periods indicated:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nNet Sales by Product Class\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nNine Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nResidential products\n \n\n\n \n\n\n$\n\n\n1,695,046\n\n\n \n\n\n \n\n\n$\n\n\n1,690,136\n\n\n \n\n\n \n\n\n$\n\n\n4,910\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n%\n\n\n\n\n\n\n \nCommercial & industrial products\n \n\n\n \n\n\n \n\n\n1,057,849\n\n\n \n\n\n \n\n\n \n\n\n1,026,095\n\n\n \n\n\n \n\n\n \n\n\n31,754\n\n\n \n\n\n \n\n\n \n\n\n3.1\n\n\n%\n\n\n\n\n\n\n \nOther\n \n\n\n \n\n\n \n\n\n364,748\n\n\n \n\n\n \n\n\n \n\n\n344,802\n\n\n \n\n\n \n\n\n \n\n\n19,946\n\n\n \n\n\n \n\n\n \n\n\n5.8\n\n\n%\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n3,117,643\n\n\n \n\n\n \n\n\n$\n\n\n3,061,033\n\n\n \n\n\n \n\n\n$\n\n\n56,610\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\nNet sales.\n   Domestic segment total sales (including inter-segment sales) increased 1.4% to $2,604.9 million in the nine months ended September 30, 2025, as compared to $2,567.8 million in the prior-year comparable period, including an approximately 1% benefit from acquisitions. This slight increase was primarily driven by higher sales of energy technology solutions, as well as growth in C&I product shipments to national telecom customers and industrial distributors. This growth was partially offset by lower home standby and portable generator sales as a result of a significantly lower power outage environment as well as lower C&I product sales to national rental accounts.\n\n\n \n\n\nIn addition, total contribution from non-annualized acquisitions for the nine months ended September 30, 2025 was $28.1 million for the domestic segment. \n\n\n \n\n\nInternational segment total sales (including inter-segment sales) increased to $568.2 million in the nine months ended September 30, 2025, as compared to $537.9 million in the prior-year comparable period, including an approximate 1% unfavorable impact from foreign currency. Excluding the impact of foreign currency, the total sales growth for the segment was primarily driven by higher inter-segment sales to the U.S. market, stronger product sales in Europe, and initial shipments of large-megawatt generators to data center customers, partially offset by softer C&I shipments in other regions.\n\n\n \nGross profit.\n \n \n Gross profit margin for the nine months ended September 30, 2025 was 39.0%, as compared to 38.0% in the prior-year comparable period. The increase in gross margin was primarily driven by favorable price realization partially offset by unfavorable sales mix and the impact of higher tariffs.\n\n\n \n\n\nOperating Expenses.\n   Operating expenses for the nine months ended September 30, 2025 increased $91.7 million, or 11.1%, as compared to the prior-year comparable period. The growth in operating expenses was primarily driven by increased employee costs to support future growth across the business, higher variable costs, increased marketing spend, and certain legal and regulatory charges and settlements in the current year, as disclosed in the accompanying non-GAAP measures reconciliation schedules.\n\n\n \n\n\nOther Expense.\n   The decrease in other expense, net was driven primarily by a decrease in interest expense due to lower borrowings and lower interest rates compared to the prior-year comparable period. This was partially offset by a larger loss on the change in the fair value of the Company's investment in Wallbox N.V. shares and warrants, along with a pre-tax loss attributable to the sale of our immaterial Tank Utility fleet business during the second quarter of 2025.\n\n\n \n\n\nProvision for income taxes.\n   Provision for income taxes for the nine months ended September 30, 2025 was $41.4 million, or an effective tax rate of 18.3%, as compared to $65.1 million, or a 24.6% effective tax rate, for the prior-year comparable period.  The decrease in effective tax rate was primarily due to favorable discrete tax benefits related to the sale of our immaterial Tank Utility fleet business and certain favorable return-to-provision adjustments in the current year period that did not occur in the previous year.\n\n\n \n\n\nNet income attributable to Generac Holdings Inc.\n \n \n Net income attributable to Generac Holdings Inc. in the nine months ended September 30, 2025 was $184.0 million compared to $199.1 million in the prior-year comparable period. This decrease was primarily driven by the factors outlined above. \n\n\n \n\n\n\n\n\n\n\n\n\n       25\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nAdjusted EBITDA.\n   Adjusted EBITDA for the domestic segment in the nine months ended September 30, 2025 was $446.5 million, or 17.1% of domestic segment total sales, as compared to $450.4 million, or 17.5% of total sales, in the prior-year comparable period. This decline was primarily driven by unfavorable sales mix together with the impact of incremental tariffs and higher operating expenses, partially offset by increased price realization.\n\n\n \n\n\nAdjusted EBITDA for the international segment in the nine months ended September 30, 2025, before deducting for non-controlling interests, was $83.9 million, or 14.8% of international segment total sales, as compared to $73.4 million, or 13.6% of total sales, in the prior-year comparable period. This margin increase was primarily driven by favorable price and cost impacts during the current year period.\n\n\n \n\n\nAdjusted Net Income.\n   Adjusted Net Income in the nine months ended September 30, 2025 was $281.1 million compared to $270.2 million in the prior-year comparable period. This increase was primarily driven by changes in certain add-back items, including certain items for legal, regulatory, and other charges, and changes in fair value of investments, partially offset by lower net income in the current period as outlined above.\n\n\n \n\n\nSee “Non-GAAP Measures” for a discussion of how we calculate Adjusted EBITDA and Adjusted Net Income and the limitations on their usefulness. \n\n\n \n\n\n\n     \n  \n\n\nLiquidity and F\ninancial \nCondition\n\n\n \n\n\nOur primary cash requirements include payment for raw materials and components, salaries and benefits, facility and lease costs, operating expenses, interest and principal payments on debt, and capital expenditures. We finance our operations primarily from cash flow generated from operations and, if necessary, borrowings under our revolving credit facility.\n\n\n \n\n\nOn July 1, 2025, we amended our Original Tranche A Term Loan Facility a\nnd Original Revolving Facility, extending the maturity of both to July 1, 2030, revising the Original Tranche A Term Loan Facility outstanding principal balance to $700 million, reducing the Original Revolving Facility borrowing capacity to $1 billion and redefining the Term Benchmark (as defined in the Prior Amended Credit Agreement) to replace the Adjusted Term SOFR Rate (as defined in the Prior Amended Credit Agreement) with the Term SOFR Rate (as defined in the New Credit agreement), resulting in an interest rate reduction of 0.10%.  The New Tranche A Term Loan Facility is repayable in increasing quarterly installments over time, equal to 0.625% to 2.50% of the original principal amount, beginning on October 1, 2026.   The New Tranche A Term Loan Facility and the New Revolving Facility bear interest at a rate based on SOFR plus an applicable margin between 1.25% and 1.75%, both based on our total leverage ratio and subject to a SOFR floor of 0.0%.  \nAs of September 30, 2025, the interest rate for the New Tranche A Term Loan Facility and the New Revolving Faci\nlity is 5.78%.\n \n\n\n \n\n\n\n\n\n\n\n\nIn accordance with ASC 470-50, we capitalized $5.3 million of debt issuance costs related to this refinancing transaction. Additionally, we wrote-off certain unamortized deferred financing costs related to the Original Revolving Facility of $0.4 million and expensed $0.8 million of third-party fees as a loss on refinancing of debt.\n\n\n\n\n\n\n\n\n \n\n\nAs of September 30, 2025, there w\nas $495 million outstanding under the Term Loan B Facility, $700 million outstanding under the New Tranche A Term Loan Facility, and $90.0 million of borrowings on the New Revolving Facility, leaving $909.3 million of unused capacity, net of outstanding letters of credit. \n\n\n \n\n\nThe Term Loan B Facility bears interest at the adjusted SOFR rate plus an applicable margin of 1.75%, subject to a SOFR floor of 0.0%. As of September 30, 2025, the interest rate for the Term Loan B Facility is 6.03%. \nThe Term Loan B Facility does not require an Excess Cash Flow payment (\nas defined in the Term Loan B Facility credit agreement\n) i\nf our net secured leverage ratio is maintained below 3.75 to 1.00. As of September 30, 2025, our net secured leverage ratio was 1.35 to 1.00, and we were in compliance with all covenants of the Facility. There are no financial maintenance covenants on the Term Loan B Facility. The New Tranche A Term Loan Facility and the New Revolving Facility contain certain financial covenants that require us to maintain a total leverage ratio below 3.75 to 1.00, as well as an interest coverage ratio above 3.00 to 1.00. As of September 30, 2025, our total leverage ratio was 1.41 to 1.00, and our interest coverage ratio was\n \n12.54 to 1.00. We were also in compliance with all other covenants of the New Credit Agreements a\ns of September 30, 2025. \n\n\n \n\n\n\n\nIn July 2022, our Board of Directors approved a stock repurchase program, which commenced on August 5, 2022, and allowed for the repurchase of up to $500.0 million of our common stock over a 24-month period. Additionally, on February 12, 2024, our Board of Directors approved a new stock repurchase program that allows for the repurchase of up to $500.0 million of our common stock over the next twenty-four months. The new program replaced the prior share repurchase program, which had approximately $26.3 million remaining available for repurchase when the new program was approved. Pursuant to the approved program, we may repurchase our common stock from time to time, in amounts and at prices we deem appropriate, subject to market conditions and other considerations. The repurchases may be executed using a combination of Rule 10b5-1 trading plans, open market purchases, privately negotiated agreements, or other transactions. The actual timing, number and value of shares repurchased under the program will be determined by management at its discretion and in compliance with the terms of our credit agreements. The repurchases may be funded with cash on hand, available borrowings, or proceeds from potential debt or other capital markets sources. The stock repurchase program may be suspended or discontinued at any time without prior notice. As of September\n 30, 2025, the remaining unused buyback authorization under the current program was $199.3 million. \n\n\n\n\n\n     \n  \n\n\n\n\nDuring the three and nine months ended September 30, 2025, we repur\nchased 0 and 1,109,206 shares of common stock for $0 and $147.9 million, res\npectively. During the three and nine months ended September 30, 2024, we repurchased 690,711 and 1,046,351 shares of common stock for $102.1 million and $152.7 million, respectively. We have periodically reissued shares out of Treasury stock, including for acquisition contingent consideration payments.\n\n\n\n\n \n\n\nSee Note 11, “Credit Agreements,” and Note 12, \"Stock Repurchase Program,\" to the condensed consolidated financial statements included in Item 1 of this Quarterly Report on Form 10-Q for more information on our credit agreements and stock repurchase programs.\n\n\n \n\n\nWe have an arrangement with a finance company to provide floor plan financing for qualifying dealers. This arrangement provides liquidity for our dealers by financing dealer purchases of Generac products with credit availability from the finance company. We receive payment from the finance company after shipment of product to the dealer, and our dealers are given a longer period of time to pay the finance company. If our dealers do not pay the finance company, we may be required to repurchase the applicable inventory held by the dealer. We do not indemnify the finance company for any credit losses they may incur. Total dealer purchases financed under this arrangement accounted for appro\nximately 13% and \n12% of net sales for the nine months ended September 30, 2025, and 2024, respectively. The amount financed by dealers which remained outstanding under this arrang\nement was $165.2 million an\nd $165.4 million as of September 30, 2025, and December 31, 2024, respectively.\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n       26\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nLong-term \nL\niquidity\n\n\n \n\n\nAs of Septem\nber 30, 2025, we had total liquidity of $1,209.3 million which consists of $300.0 million of cash and cash equivalents and $909.3 million of availability under our New Revolving Facility. \n\n\n \n\n\nWe believe our cash and cash equivalents, cash flow from operations, and availability under our New Revolving Facility and other short-term lines of credit will provide us with sufficient capital to continue to run our operations. We may use a portion of our cash flow for debt repayments and common stock buybacks, impacting the amount available for working capital, capital expenditures, acquisitions, and other general corporate purposes. As we continue to expand our business, we may require additional capital to fund other activities that could potentially drive incremental shareholder value. \n \n\n\n \n\n\nCash \nF\nlow\n\n\n \n\n\nNine \nmonths ended \nSeptember 30, 2025\n,\n compared to the \nnine\n \nmonths ended \nSeptember 30, 2024\n\n\n \n\n\nThe following table summarizes our cash flows by category for the periods presented:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nNine Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nNet cash provided by operating activities\n \n\n\n \n\n\n$\n\n\n248,719\n\n\n \n\n\n \n\n\n$\n\n\n401,847\n\n\n \n\n\n \n\n\n$\n\n\n(153,128\n\n\n)\n\n\n \n\n\n \n\n\n-38.1\n\n\n%\n\n\n\n\n\n\n \nNet cash used in investing activities\n \n\n\n \n\n\n \n\n\n(115,533\n\n\n)\n\n\n \n\n\n \n\n\n(141,786\n\n\n)\n\n\n \n\n\n \n\n\n26,253\n\n\n \n\n\n \n\n\n \n\n\n18.5\n\n\n%\n\n\n\n\n\n\n \nNet cash used in financing activities\n \n\n\n \n\n\n \n\n\n(121,294\n\n\n)\n\n\n \n\n\n \n\n\n(246,567\n\n\n)\n\n\n \n\n\n \n\n\n125,273\n\n\n \n\n\n \n\n\n \n\n\n50.8\n\n\n%\n\n\n\n\n\n\n \nEffect of foreign exchange rate changes on cash and cash equivalents\n \n\n\n \n\n\n \n\n\n6,840\n\n\n \n\n\n \n\n\n \n\n\n(311\n\n\n)\n\n\n \n\n\n \n\n\n7,151\n\n\n \n\n\n \n\n\n \n\n\n2299.4\n\n\n%\n\n\n\n\n\n\n \nNet increase in cash and cash equivalents\n \n\n\n \n\n\n$\n\n\n18,732\n\n\n \n\n\n \n\n\n$\n\n\n13,183\n\n\n \n\n\n \n\n\n$\n\n\n5,549\n\n\n \n\n\n \n\n\n \n\n\n42.1\n\n\n%\n\n\n\n\n\n\n\n\n \nThe \ndecrease in operating cash flows for the nine months ended September 30, 2025 was primarily driven by an increase in inventory levels during the current year and lower operating income, which was compounded by a decline in inventory levels during the prior year period. \n\n\n \n\n\nThe $115.5 million net cash used in investing activities for the nine months ended September 30, 2025 primarily represents cash payments of $110.5 million related to the purchase of property and equipment, $3.0 million for the purchase of long-term investments, and $2.0 million related to other investing activities.\n\n\n \n\n\nThe $141.8 million net cash used in investing activities for the nine months ended September 30, 2024 primarily represents cash payments of $83.4 million related to the purchase of property and equipment, $21.8 million for the acquisitions of Huntington, C&I BESS, and Ageto, $1.6 million for a tax equity investment, and $35 million for an incremental minority investment in Wallbox.\n\n\n \n\n\nT\nhe $121.3 million net cash used in financing activities for the nine months ended September 30, 2025 primarily represents proceeds of $30.9 million from short-term borrowings, $134.7 million from long-term borrowings, $1.0 million of contributions received from the noncontrolling interest holder of a subsidiary, and $4.2 million from the exercise of stock options. These cash proceeds were more than offset by $123.0 million of debt repayments ($47.3 million of short-term borrowings and $75.7 million of long-term borrowings and finance lease obligations), $147.9 million of share repurchases, $5.3 million of debt issuance costs, $2.7 million payment of contingent acquisition consideration, and $12.9 million for taxes paid related to equity awards.\n\n\n \n\n\nThe $246.6 million net cash used in financing activities for the nine months ended September 30, 2024 primarily represents proceeds of $29.2 million from short-term borrowings, $506.5 million from long-term borrowings, and $12.3 million from the exercise of stock options. These cash proceeds were more than offset by $609.5 million of debt repayments ($48.9 million of short-term borrowings and $560.6 million of long-term borrowings and finance lease obligations), $152.7 million of share repurchases, a $9.1 million payment for the remaining ownership interest in Captiva, a $6.0 million payment and $1.4 million payment of deferred acquisition consideration related to our Chilicon and Blue Pillar acquisitions, respectively, $12.3 million for taxes paid related to equity awards, and $3.6 million of payments for debt issuance costs related to our Tranche B Term Loan Facility refinancing. \n\n\n \n\n\nContractual Obligations\n\n\n \n\n\nThere have been no material changes to our contractual obligations be\ntween the February 19, 2025, filing of our Annual Report on Form 10-K for the year ended December 31, 2024, and September 30, 2025, except for the changes in outstanding borrowings and interest rates as discussed in Note 11, “Credit Agreements,” to the condensed consolidated financial statements included in Item 1 of this Quarterly Report on Form 10-Q.\n\n\n \n\n\nCritical \nA\nccounting \nP\nolicies and Estimates\n\n\n \n\n\nAs discussed in our Annual Report on Form 10-K for the year ended December 31, 2024, in preparing the financial statements in accordance with GAAP, management is required to make estimates and assumptions that have an impact on the asset, liability, revenue and expense amounts reported. These estimates can also affect supplemental information disclosures of the Company, including information about contingencies, risk and financial condition. The Company believes, given current facts and circumstances, its estimates and assumptions are reasonable, adhere to U.S. GAAP, and are consistently applied. Inherent in the nature of an estimate or assumption is the fact that actual results may differ from estimates, and estimates may vary as new facts and circumstances arise. The Company makes routine estimates and judgments in determining net realizable value of accounts receivable, inventories, property and equipment, prepaid expenses, product warranties and other reserves. Management believes our most critical accounting estimates and assumptions are in the following areas: goodwill and other indefinite-lived intangible asset impairment assessment; and income taxes.\n\n\n \n\n\nThere have been no material changes in our critical accounting policies since the \nFebruary 19, 2025, filing of our Annual Report on Form 10-K for the year ended December 31, 2024.\n\n\n \n\n\n\n\n\n\n\n\n\n       27\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nNon-GAAP \nM\neasures\n\n\n \n\n\nAdjusted EBITDA\n\n\n \n\n\nTo supplement our condensed consolidated financial statements presented in accordance with U.S. GAAP, the Company provides the computation of Adjusted EBITDA attributable to the Company, which is defined as net income before noncontrolling interests adjusted for the following items: interest expense, depreciation expense, amortization of intangible assets, income tax expense, certain non-cash gains and losses including certain purchase accounting adjustments and contingent consideration adjustments, share-based compensation expense, certain transaction costs and credit facility fees, business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, mark-to-market gains and losses on a minority investment, and Adjusted EBITDA attributable to noncontrolling interests. The provision for legal and regulatory charges adjusts for matters that are not part of the ordinary routine litigation or regulatory matters incidental to the Company's business, including but not limited to class action lawsuits, government inquiries, and certain intellectual property litigation. The adjustments to net income in computing Adjusted EBITDA are set forth in the reconciliation table below. The computation of Adjusted EBITDA is based primarily on the definition included in our New and Prior Credit Agreements.\n\n\n \n\n\nWe view Adjusted EBITDA as a key measure of our performance. We present Adjusted EBITDA not only due to its importance for purposes of our credit agreements, but also because it assists us in comparing our performance across reporting periods on a consistent basis as it excludes certain items that we do not believe are indicative of our core operating performance. Our management uses Adjusted EBITDA:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nfor planning purposes, including the preparation of our annual operating budget and developing and refining our internal projections for future periods;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nto allocate resources to enhance the financial performance of our business;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nas a target for the determination of the bonus component of compensation for our senior executives under our management incentive plan, as described further in our Proxy Statement;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nto evaluate the effectiveness of our business strategies and as a tool in evaluating our performance against our budget for each period; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nin communications with our Board of Directors and investors concerning our financial performance.\n \n\n\n\n\n\n\n\n\n \n\n\nWe believe Adjusted EBITDA is used by securities analysts, investors and other interested parties in the evaluation of the Company. Management believes the disclosure of Adjusted EBITDA offers an additional financial metric that, when coupled with results prepared in accordance with U.S. generally accepted accounting principles (U.S. GAAP) and the reconciliation to U.S. GAAP results, provides a more complete understanding of our results of operations and the factors and trends affecting our business. We believe Adjusted EBITDA is useful to investors for the following reasons:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nAdjusted EBITDA and similar non-GAAP measures are widely used by investors to measure a company's operating performance without regard to items that can vary substantially from company to company depending upon financing and accounting methods, book values of assets, tax jurisdictions, capital structures and the methods by which assets were acquired;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \ninvestors can use Adjusted EBITDA as a supplemental measure to evaluate the overall operating performance of our Company, including our ability to service our debt and other cash needs; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nby comparing our Adjusted EBITDA in different historical periods, our investors can evaluate our operating performance excluding the impact of items described below.\n \n\n\n\n\n\n\n\n\n \n\n\nThe adjustments included in the reconciliation table listed below are presented to illustrate the operating performance of our business in a manner consistent with the presentation used by our management and Board of Directors. These adjustments eliminate the impact of a number of items that:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nwe do not consider indicative of our ongoing operating performance, such as non-cash write-downs and other charges, non-cash gains, write-offs relating to the retirement of debt, severance costs and other restructuring-related business optimization expenses, certain other specific provisions, and mark-to-market gains and losses on a minority investment;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nwe believe to be akin to, or associated with, interest expense, such as administrative agent fees, revolving credit facility commitment fees and letter of credit fees; \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nare non-cash in nature, such as share-based compensation; or\n \n\n\n\n\n\n\n \n\n\n•\n\n\nthe provision for legal and regulatory charges adjusts for matters that are significant and not part of the ordinary routine litigation or regulatory matters incidental to the Company’s business, including but not limited to large suits and settlements, class action lawsuits, government inquiries, and certain intellectual property litigation.\n\n\n\n\n\n\n\n\n \n\n\nWe explain in more detail in the footnotes to the table below, why we believe these adjustments are useful in calculating Adjusted EBITDA as a measure of our operating performance.\n\n\n \n\n\nAdjusted EBITDA does not represent, and should not be a substitute for, net income or cash flows from operations as determined in accordance with U.S. GAAP. Adjusted EBITDA has limitations as an analytical tool, and you should not consider it in isolation, or as a substitute for analysis of our results as reported under U.S. GAAP. Some of the limitations are:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nAdjusted EBITDA does not reflect our capital expenditures, or future requirements for capital expenditures or contractual commitments;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nAdjusted EBITDA does not reflect changes in, or cash requirements for, our working capital needs;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nAdjusted EBITDA does not reflect interest expense, or the cash requirements necessary to service interest or principal payments on our debt;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nalthough depreciation and amortization are non-cash charges, the assets being depreciated and amortized will often have to be replaced in the future, and Adjusted EBITDA does not reflect any cash requirements for such replacements;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nseveral of the adjustments that we use in calculating Adjusted EBITDA, such as non-cash write-downs and other charges, while not involving cash expense, do have a negative impact on the value of our assets as reflected in our consolidated balance sheet prepared in accordance with U.S. GAAP; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nother companies may calculate Adjusted EBITDA differently than we do, limiting its usefulness as a comparative measure.\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n       28\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nFurthermore, as noted above, one of our uses of Adjusted EBITDA is as a target for determining elements of compensation for our senior executives. At the same time, some or all of these senior executives have responsibility for monitoring our financial results, generally including the adjustments in calculating Adjusted EBITDA (subject ultimately to review by our Board in the context of the Board's review of our financial statements). While many of the adjustments (for example, transaction costs and credit facility fees), involve mathematical application of items reflected in our financial statements, others involve a degree of judgment and discretion. While we believe all of these adjustments are appropriate, and while the calculations are subject to review by our Board in the context of the Board's review of our financial statements, and certification by our Chief Financial Officer in a compliance certificate provided to the lenders under our New and Prior Credit Agreements, this discretion may be viewed as an additional limitation on the use of Adjusted EBITDA as an analytical tool.\n\n\n \n\n\nBecause of these limitations, Adjusted EBITDA should not be considered as a measure of discretionary cash available to us to invest in the growth of our business. We compensate for these limitations by relying primarily on our U.S. GAAP results and using Adjusted EBITDA only supplementally.\n\n\n \n\n\nThe following table presents a reconciliation of net income to Adjusted EBITDA attributable to Generac Holdings Inc.:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nThree Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \nNine Months Ended September 30,\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n66,161\n\n\n \n\n\n \n\n\n$\n\n\n113,742\n\n\n \n\n\n \n\n\n$\n\n\n184,017\n\n\n \n\n\n \n\n\n$\n\n\n199,089\n\n\n \n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n419\n\n\n \n\n\n \n\n\n \n\n\n36\n\n\n \n\n\n \n\n\n \n\n\n1,271\n\n\n \n\n\n \n\n\n \n\n\n220\n\n\n \n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n66,580\n\n\n \n\n\n \n\n\n \n\n\n113,778\n\n\n \n\n\n \n\n\n \n\n\n185,288\n\n\n \n\n\n \n\n\n \n\n\n199,309\n\n\n \n\n\n\n\n\n\n \nInterest expense\n \n\n\n \n\n\n \n\n\n18,461\n\n\n \n\n\n \n\n\n \n\n\n22,910\n\n\n \n\n\n \n\n\n \n\n\n53,813\n\n\n \n\n\n \n\n\n \n\n\n69,833\n\n\n \n\n\n\n\n\n\n \nDepreciation and amortization\n \n\n\n \n\n\n \n\n\n49,211\n\n\n \n\n\n \n\n\n \n\n\n43,152\n\n\n \n\n\n \n\n\n \n\n\n143,673\n\n\n \n\n\n \n\n\n \n\n\n127,934\n\n\n \n\n\n\n\n\n\n \nProvision for income taxes\n \n\n\n \n\n\n \n\n\n11,758\n\n\n \n\n\n \n\n\n \n\n\n33,453\n\n\n \n\n\n \n\n\n \n\n\n41,416\n\n\n \n\n\n \n\n\n \n\n\n65,124\n\n\n \n\n\n\n\n\n\n \nNon-cash write-down and other adjustments (a)\n \n\n\n \n\n\n \n\n\n2,831\n\n\n \n\n\n \n\n\n \n\n\n468\n\n\n \n\n\n \n\n\n \n\n\n4,973\n\n\n \n\n\n \n\n\n \n\n\n2,863\n\n\n \n\n\n\n\n\n\n \nNon-cash share-based compensation expense (b)\n \n\n\n \n\n\n \n\n\n12,751\n\n\n \n\n\n \n\n\n \n\n\n13,115\n\n\n \n\n\n \n\n\n \n\n\n39,111\n\n\n \n\n\n \n\n\n \n\n\n38,270\n\n\n \n\n\n\n\n\n\n \nTransaction costs and credit facility fees (c)\n \n\n\n \n\n\n \n\n\n827\n\n\n \n\n\n \n\n\n \n\n\n1,337\n\n\n \n\n\n \n\n\n \n\n\n2,591\n\n\n \n\n\n \n\n\n \n\n\n4,029\n\n\n \n\n\n\n\n\n\n \nBusiness optimization and other charges (d)\n \n\n\n \n\n\n \n\n\n368\n\n\n \n\n\n \n\n\n \n\n\n1,564\n\n\n \n\n\n \n\n\n \n\n\n5,385\n\n\n \n\n\n \n\n\n \n\n\n3,190\n\n\n \n\n\n\n\n\n\n \nProvision for legal, regulatory, and other costs (e)\n \n\n\n \n\n\n \n\n\n23,208\n\n\n \n\n\n \n\n\n \n\n\n2,382\n\n\n \n\n\n \n\n\n \n\n\n31,870\n\n\n \n\n\n \n\n\n \n\n\n5,280\n\n\n \n\n\n\n\n\n\n \nChange in fair value of investments (f)\n \n\n\n \n\n\n \n\n\n5,667\n\n\n \n\n\n \n\n\n \n\n\n(5,198\n\n\n)\n\n\n \n\n\n \n\n\n17,138\n\n\n \n\n\n \n\n\n \n\n\n2,938\n\n\n \n\n\n\n\n\n\n \nLoss on refinancing of debt (g)\n \n\n\n \n\n\n \n\n\n1,225\n\n\n \n\n\n \n\n\n \n\n\n4,861\n\n\n \n\n\n \n\n\n \n\n\n1,225\n\n\n \n\n\n \n\n\n \n\n\n4,861\n\n\n \n\n\n\n\n\n\n \nOther (h)\n \n\n\n \n\n\n \n\n\n328\n\n\n \n\n\n \n\n\n \n\n\n43\n\n\n \n\n\n \n\n\n \n\n\n3,907\n\n\n \n\n\n \n\n\n \n\n\n156\n\n\n \n\n\n\n\n\n\n \nAdjusted EBITDA\n \n\n\n \n\n\n \n\n\n193,215\n\n\n \n\n\n \n\n\n \n\n\n231,865\n\n\n \n\n\n \n\n\n \n\n\n530,390\n\n\n \n\n\n \n\n\n \n\n\n523,787\n\n\n \n\n\n\n\n\n\n \nAdjusted EBITDA attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n655\n\n\n \n\n\n \n\n\n \n\n\n81\n\n\n \n\n\n \n\n\n \n\n\n1,899\n\n\n \n\n\n \n\n\n \n\n\n521\n\n\n \n\n\n\n\n\n\n \nAdjusted EBITDA attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n192,560\n\n\n \n\n\n \n\n\n$\n\n\n231,784\n\n\n \n\n\n \n\n\n$\n\n\n528,491\n\n\n \n\n\n \n\n\n$\n\n\n523,266\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n(a)  Represents the following non-cash charges, gains, and other adjustments: gains/losses on the disposition of assets other than in the ordinary course of business, gains/losses on sales of certain investments, unrealized mark-to-market adjustments on commodity contracts, certain foreign currency related adjustments, and certain purchase accounting and contingent consideration adjustments. We believe that adjusting net income for these items is useful for the following reasons:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n•\n\n\n \nThe gains/losses on disposals of assets and sales of certain investments result from the sale of assets that are no longer useful in our business and therefore represent gains/losses that are not from our core operations;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n•\n\n\n \nThe adjustments for unrealized mark-to-market gains and losses on commodity contracts represent non-cash items to reflect changes in the fair value of forward contracts that have not been settled or terminated. We believe it is useful to adjust net income for these items because the charges do not represent a cash outlay in the period in which the charge is incurred, although Adjusted EBITDA must always be used together with our U.S. GAAP statements of comprehensive income and cash flows to capture the full effect of these contracts on our operating performance; and\n \n\n\n\n\n\n\n \n\n\n•\n\n\nThe purchase accounting adjustments represent non-cash items to reflect fair value of certain assets at the date of acquisition, and therefore do not reflect our ongoing operations. Fair value adjustments to contingent consideration obligations related to business acquisitions are added back as they are akin to purchase price. \n\n\n\n\n\n\n\n\n \n\n\n(b)  Represents share-based compensation expense to account for stock options, restricted stock, and other stock awards over their respective vesting periods.\n\n\n \n\n\n(c)  Represents transaction costs incurred directly in connection with any investment, as defined in our credit agreement, equity issuance or debt issuance or refinancing, together with certain fees relating to our senior secured credit facilities, such as administrative agent fees and credit facility commitment fees under our Prior and New Credit Agreement.\n\n\n \n\n\n(d)  Represents severance and other restructuring charges related to the consolidation of certain operating facilities and organizational functions.\n\n\n \n\n\n(e)  Represents the following significant litigation, regulatory, and other matters that are not indicative of our ongoing operations:\n\n\n \n\n\n•  A provision for judgments, settlements, and legal expenses related to certain patent lawsuits - $2.7 million and $5.9 million for the three and nine months ended September 30, 2025, respectively, and $2.4 million and $4.9 million for the three and nine months ended September 30, 2024, respectively.\n \n•  A provision for a $15.0 million multi-district class action settlement related to clean energy products and legal expenses related to certain class action lawsuits - $17.8 million and $21.6 million for the three and nine months ended September 30, 2025, respectively.\n \n•  Legal expenses related to certain government inquiries and other significant matters - $2.7 million and $4.3 million for the three and nine months ended September 30, 2025, respectively.\n \n•  Additional customer support costs related to a clean energy product customer that filed for bankruptcy in 2022 –$0 and $0.4 million for the three and nine months ended September 30, 2024, respectively. \n\n\n \n\n\n (f)  Represents non-cash gains and losses primarily from changes in the fair value of the Company's investment in Wallbox N.V. warrants and equity securities.\n\n\n \n\n\n(g)  For the three and nine months ended September 20, 2025, the loss represents third-party costs and the write-off of certain deferred financing costs in connection with the refinancing of the Original Tranche A Term Loan Facility and Original Revolving Facility. For the three and nine months ended September 30, 2024, the loss represents fees paid to creditors and the write-off of the original issue discount and deferred financing costs in connection with the refinancing of the Tranche B Term Loan Facility.\n\n\n \n\n\n(h)  The pre-tax loss in the nine months ended September 30, 2025, relates primarily to the sale of our immaterial Tank Utility fleet business during the second quarter of 2025.\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n       29\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nAdjusted Net Income\n\n\n \n\n\nTo further supplement our condensed consolidated financial statements in accordance with U.S. GAAP, we provide the computation of Adjusted Net Income attributable to the Company, which is defined as net income before noncontrolling interests adjusted for the following items: amortization of intangible assets, amortization of deferred financing costs and original issue discount related to the Company's debt, intangible impairment charges, certain transaction costs and other purchase accounting adjustments, business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, mark-to-market gains and losses on a minority investment, other non-cash gains and losses, and adjusted net income attributable to non-controlling interests, as set forth in the reconciliation table below.\n\n\n \n\n\nWe believe Adjusted Net Income is used by securities analysts, investors and other interested parties in the evaluation of our company’s operations. Management believes the disclosure of Adjusted Net Income offers an additional financial metric that, when used in conjunction with U.S. GAAP results and the reconciliation to U.S. GAAP results, provides a more complete understanding of our ongoing results of operations, and the factors and trends affecting our business.\n\n\n \n\n\nThe adjustments included in the reconciliation table listed below are presented to illustrate the operating performance of our business in a manner consistent with the presentation used by investors and securities analysts. Similar to the Adjusted EBITDA reconciliation, these adjustments eliminate the impact of a number of items we do not consider indicative of our ongoing operating performance or cash flows, such as amortization costs, transaction costs and write-offs relating to the retirement of debt. \n\n\n \n\n\nSimilar to Adjusted EBITDA, Adjusted Net Income does not represent, and should not be a substitute for, net income or cash flows from operations as determined in accordance with U.S. GAAP. Adjusted Net Income has limitations as an analytical tool, and you should not consider it in isolation, or as a substitute for analysis of our results as reported under U.S. GAAP. Some of the limitations are:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nAdjusted Net Income does not reflect changes in, or cash requirements for, our working capital needs;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nalthough amortization is a non-cash charge, the assets being amortized may have to be replaced in the future, and Adjusted Net Income does not reflect any cash requirements for such replacements; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n•\n \n\n\n \nother companies may calculate Adjusted Net Income differently than we do, limiting its usefulness as a comparative measure.\n \n\n\n\n\n\n\n\n\n \n\n\nThe following table presents a reconciliation of net income to Adjusted Net Income attributable to Generac Holdings Inc.: \n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nThree Months Ended September 30,\n \n\n\n \n\n\n \n\n\n \nNine Months Ended September 30,\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands, except share and per share data)\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2025\n \n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n66,161\n\n\n \n\n\n \n\n\n$\n\n\n113,742\n\n\n \n\n\n \n\n\n$\n\n\n184,017\n\n\n \n\n\n \n\n\n$\n\n\n199,089\n\n\n \n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n419\n\n\n \n\n\n \n\n\n \n\n\n36\n\n\n \n\n\n \n\n\n \n\n\n1,271\n\n\n \n\n\n \n\n\n \n\n\n220\n\n\n \n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n66,580\n\n\n \n\n\n \n\n\n \n\n\n113,778\n\n\n \n\n\n \n\n\n \n\n\n185,288\n\n\n \n\n\n \n\n\n \n\n\n199,309\n\n\n \n\n\n\n\n\n\n \nAmortization of intangible assets\n \n\n\n \n\n\n \n\n\n24,932\n\n\n \n\n\n \n\n\n \n\n\n24,157\n\n\n \n\n\n \n\n\n \n\n\n76,102\n\n\n \n\n\n \n\n\n \n\n\n73,698\n\n\n \n\n\n\n\n\n\n \nAmortization of deferred financing costs and original issue discount\n \n\n\n \n\n\n \n\n\n557\n\n\n \n\n\n \n\n\n \n\n\n644\n\n\n \n\n\n \n\n\n \n\n\n1,835\n\n\n \n\n\n \n\n\n \n\n\n2,592\n\n\n \n\n\n\n\n\n\n \nTransaction costs and other purchase accounting adjustments (a)\n \n\n\n \n\n\n \n\n\n204\n\n\n \n\n\n \n\n\n \n\n\n747\n\n\n \n\n\n \n\n\n \n\n\n656\n\n\n \n\n\n \n\n\n \n\n\n2,272\n\n\n \n\n\n\n\n\n\n \nLoss (gain) attributable to business or asset dispositions (c)\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n4,295\n\n\n \n\n\n \n\n\n \n\n\n65\n\n\n \n\n\n\n\n\n\n \nBusiness optimization and other charges (b)\n \n\n\n \n\n\n \n\n\n368\n\n\n \n\n\n \n\n\n \n\n\n1,564\n\n\n \n\n\n \n\n\n \n\n\n5,385\n\n\n \n\n\n \n\n\n \n\n\n3,190\n\n\n \n\n\n\n\n\n\n \nProvision for legal, regulatory, and other costs (b)\n \n\n\n \n\n\n \n\n\n23,208\n\n\n \n\n\n \n\n\n \n\n\n2,382\n\n\n \n\n\n \n\n\n \n\n\n31,870\n\n\n \n\n\n \n\n\n \n\n\n5,280\n\n\n \n\n\n\n\n\n\n \nChange in fair value of investments (b)\n \n\n\n \n\n\n \n\n\n5,667\n\n\n \n\n\n \n\n\n \n\n\n(5,198\n\n\n)\n\n\n \n\n\n \n\n\n17,138\n\n\n \n\n\n \n\n\n \n\n\n2,938\n\n\n \n\n\n\n\n\n\n \nLoss on refinancing of debt (b)\n \n\n\n \n\n\n \n\n\n1,225\n\n\n \n\n\n \n\n\n \n\n\n4,861\n\n\n \n\n\n \n\n\n \n\n\n1,225\n\n\n \n\n\n \n\n\n \n\n\n4,861\n\n\n \n\n\n\n\n\n\n \nTax effect of add backs\n \n\n\n \n\n\n \n\n\n(13,900\n\n\n)\n\n\n \n\n\n \n\n\n(7,317\n\n\n)\n\n\n \n\n\n \n\n\n(41,407\n\n\n)\n\n\n \n\n\n \n\n\n(23,762\n\n\n)\n\n\n\n\n\n\n \nAdjusted net income\n \n\n\n \n\n\n \n\n\n108,841\n\n\n \n\n\n \n\n\n \n\n\n135,618\n\n\n \n\n\n \n\n\n \n\n\n282,387\n\n\n \n\n\n \n\n\n \n\n\n270,443\n\n\n \n\n\n\n\n\n\n \nAdjusted net income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n419\n\n\n \n\n\n \n\n\n \n\n\n36\n\n\n \n\n\n \n\n\n \n\n\n1,271\n\n\n \n\n\n \n\n\n \n\n\n220\n\n\n \n\n\n\n\n\n\n \nAdjusted net income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n108,422\n\n\n \n\n\n \n\n\n$\n\n\n135,582\n\n\n \n\n\n \n\n\n$\n\n\n281,116\n\n\n \n\n\n \n\n\n$\n\n\n270,223\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nAdjusted net income per common share attributable to Generac Holdings Inc. - diluted:\n \n\n\n \n\n\n$\n\n\n1.83\n\n\n \n\n\n \n\n\n$\n\n\n2.25\n\n\n \n\n\n \n\n\n$\n\n\n4.74\n\n\n \n\n\n \n\n\n$\n\n\n4.47\n\n\n \n\n\n\n\n\n\n \nWeighted average common shares outstanding - diluted:\n \n\n\n \n\n\n \n\n\n59,122,849\n\n\n \n\n\n \n\n\n \n\n\n60,312,393\n\n\n \n\n\n \n\n\n \n\n\n59,314,618\n\n\n \n\n\n \n\n\n \n\n\n60,475,478\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n(a)  Represents transaction costs incurred directly in connection with any investment, as defined in our credit agreement, equity issuance or debt issuance or refinancing, and certain purchase accounting and contingent consideration adjustments.\n\n\n \n\n\n(b)  See reconciliation of net income to Adjusted EBITDA attributable to Generac Holdings Inc. above. \n\n\n \n\n\n(c) \nThe pre-tax loss in the nine months ended September 30, 2025, relates primarily to the sale of our immaterial Tank Utility fleet business during the second quarter of 2025.\n\n\n \n\n\n\n\n\n\n\n\n\n       30\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nNew Accounting Standards\n\n\n \n\n\nRefer to Note 1, “Description of Business and Basis of Presentation,” to the condensed consolidated financial statements for further information on the new accounting standards applicable to the Company."
}