{
  "source_file": "gnrc20241231_10k.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business \n\n\n \n\n\nOverview\n\n\n \n\n\nFounded in 1959, Generac is a leading global designer, manufacturer, and provider of a wide range of energy technology solutions. Generac provides power generation equipment, energy storage systems, energy management devices & solutions, and other power products serving the residential, light commercial, and industrial markets. The Company continues to expand its energy technology offerings for homes and businesses in its mission to Power a Smarter World and lead the evolution to more resilient, efficient, and sustainable energy solutions.\n\n\n \n\n\nWe have a long history of providing power generation products across a variety of applications, and we maintain one of the leading positions in the North American market for power equipment with an expanding presence internationally. We believe we have one of the widest ranges of products in the power generation marketplace, including residential, commercial, and industrial standby generators, as well as portable and mobile generators used in a variety of applications. The Company is evolving its product portfolio by building out ecosystems of energy technology products, solutions, and services for homes and businesses, enabling end users to better manage their energy costs and needs. As part of this evolution, we have made significant investments into developing markets such as residential and commercial & industrial (C&I) energy storage, solar power inverters, energy monitoring & management devices, and electric vehicle (EV) charging. Central to these ecosystems are the Company’s advanced connectivity devices, controls capabilities, and software platforms that facilitate the integration of our products into grid services programs. In addition, we have been leveraging our leading position in the growing market for natural gas fueled generators, which we believe represents a cleaner fuel compared to diesel, to expand into applications beyond standby power, allowing us to participate in multi-purpose microgrid projects for C&I customers. As the traditional centralized utility model evolves over time, we believe that a more decarbonized, digitized, and decentralized grid infrastructure will develop, and our energy technology solutions are uniquely and strategically positioned to participate in this next-generation grid.\n\n\n \n\n\nGiven our competitive strengths in our traditional power generation markets, we believe we are well-positioned to execute on the growing opportunity for backup power for homes and businesses, where increased penetration is being driven by multiple mega-trends that are resulting in poorer power quality for end users. In addition, our focus on more resilient, efficient and sustainable energy solutions has dramatically increased our served addressable market, and as a result, we believe we can continue to be a leader as energy costs rise and end markets evolve over time.\n\n\n \n\n\nCompany History\n\n\n \n\n\nGenerac Power Systems, Inc. was founded in 1959 to commercialize a line of affordable portable generators that offered superior performance and features. Its success through the years has been built upon engineering expertise, manufacturing excellence and innovative approaches to the market. This has driven our growth into becoming a leading provider of power equipment for a variety of applications within residential, commercial, and industrial markets.\n\n\n \n\n\nIn the 1980’s, we expanded beyond portable generators into the industrial power generation market with the introduction of our first stationary generators that provided up to 200kW of power output. We introduced our first residential standby generator in 1989 and expanded our industrial product offering and global distribution system in the 1990’s, forming a series of alliances that rapidly increased our sales. Our growth accelerated in the 2000’s as we expanded our purpose-built line of residential and commercial automatic standby generators and implemented our multi-layered, omni-channel distribution philosophy. Throughout the 2000’s, a number of high-profile power outage events also helped to increase the awareness and need for backup power and home standby generators. In 2006, our founder sold the company to affiliates of CCMP Capital Advisors, LLC, together with certain other investors and members of our management. In connection with that transaction, Generac Holdings Inc. was formed as a Delaware holding company. Generac Power Systems, Inc. is a wholly owned subsidiary of Generac Holdings Inc. For ease of reference in explaining the general activities of its related entities in this report, Generac Holdings Inc. includes here the operating activities of its wholly owned subsidiaries. In February 2010, we completed our initial public offering (IPO) of the Company’s common stock. Since then, we have scaled our sales & marketing capabilities and systems, while also building the Generac brand into one of the leading names in backup power around the nation.\n\n\n \n\n\nSoon after going public, we implemented our “Powering Ahead” enterprise strategy. This strategic plan accelerated the Company’s transition from primarily a North America focused, emergency backup generator company into a more diversified industrial technology company with the addition of new and adjacent product categories and an expanded global presence, primarily through a series of acquisitions. It is during this time in the 2010’s that we formed and built out our International segment, which provided additional capability to expand and increase market share by introducing our broad product offering into local markets around the world.\n\n\n \n\n\nIn 2018, we transitioned to a new enterprise strategy called “Powering Our Future”, which drove further share gains in new and existing markets, capitalized on our leadership in natural gas gensets, established our connectivity strategy, and provided the foundation for the Company’s evolution into an energy technology solutions company, including our initial acquisitions within the residential clean energy space. This ultimately led to the introduction of our “Powering A Smarter World” enterprise strategy in 2021. Our current strategic plan continues the evolution of Generac’s business model that pairs traditional and renewable power generation, conversion, and storage technologies with new monitoring, management and grid services capabilities to provide solutions for the dynamic challenges presented by today’s energy landscape.\n\n\n\n     \n  \n\n\n \n\n\n\n\n\n\n\n\n\n       2\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\nSignificant Investments in Energy Technology Solutions\n\n\n \n\n\nWe have been providing power generation and resiliency solutions for homes and businesses for decades. Leveraging that expertise in power generation, Generac has made significant investments in recent years to expand its capabilities into energy technology solutions, beginning with the March 2019 acquisition of Neurio Technology Inc., a leading energy data company focused on monitoring technology and sophisticated analytics to optimize energy use within a home or business. This was followed by the April 2019 acquisition of Pika Energy Inc. (Pika Energy), a designer and manufacturer of battery storage technologies that capture and store solar or other power sources for homeowners and businesses. In October 2020, the Company acquired Enbala Power Networks Inc., one of the leading providers of distributed energy optimization and control software that helps support the operational stability of the world’s power grids. In July 2021, Generac added to its residential clean energy portfolio with the acquisition of Chilicon Power LLC (Chilicon), a designer and provider of grid-interactive rooftop power inversion devices and monitoring solutions for the solar market. Although we do not believe battery storage applications will displace traditional engine driven backup generators used for power resiliency in the short or medium term, our strategy and continued investment in such energy technology solutions will help ensure Generac maintains its leadership as an energy solutions provider as battery technology evolves over time. With these acquisitions, Generac has established a presence in the rapidly developing residential clean energy market, focused on solar and battery storage solutions, as well as grid services platforms and grid-connected solutions. With these investments, we are able to provide another source of power resiliency that complements our traditional backup power business. \n\n\n \n\n\nIn December 2021, Generac acquired ecobee Inc. (ecobee), a leader in sustainable home technology solutions. In addition to smart home thermostatic controls and other smart home devices, ecobee offers its customers the ability to participate in energy services programs, which allow homeowners to reduce energy consumption and utility bills via intelligent HVAC controls. The acquisition represents a major step forward in the Company’s efforts to provide an integrated residential energy ecosystem that includes a sophisticated user interface platform to allow homeowners to take charge of their energy generation, storage, consumption, and management. By leveraging ecobee’s product and software development expertise to create the central hub of our residential energy ecosystem, we believe ecobee’s solutions will prove to be a differentiator for Generac when combined with our growing suite of energy technology solutions.\n\n\n \n\n\nIn December 2023, Generac made a minority investment in Wallbox N.V. (Wallbox) (NYSE: WBX), a global leader in smart EV charging and energy management solutions. Along with the investment, Generac and Wallbox are working together on commercial arrangements to provide Wallbox’s full suite of EV charging solutions to Generac’s customers and distribution partners. To further strengthen this relationship, we made an additional minority investment in Wallbox in August 2024.\n\n\n \n\n\nFollowing these acquisitions and investments, we have made considerable organic investments in improving the quality, reliability, and manufacturability of the solutions provided. For example, in 2023, we opened a dedicated engineering center of excellence in Reno, Nevada that currently houses the development and testing of batteries, switches, power electronics, and other clean energy solutions. We have also made considerable progress in building out leadership teams and integrating the technical capabilities from our recent acquisitions, which will help drive our energy technology strategic initiatives forward. The integration of these technologies expands upon our well-established value proposition of providing homeowners with resiliency by also optimizing for cost, convenience, and comfort.\n\n\n \n\n\nAs we look to the future, we expect to make continued investment in the development of these residential energy technologies, as we work to further broaden our product offering and distribution network. While the policy back drop for the clean energy market may evolve over time, we believe customer interest and demand, as well as government programs and support for such energy technology products, will continue as grid capacity is strained and energy costs rise. With this opportunity in front of us, we plan to build out our residential energy technology capabilities and our suite of products and solutions as we expect to play an important role in the transition to a more sustainable and reliable electric grid.\n\n\n \n\n\nGenerac’s efforts in expanding its energy technology solutions extend to C&I and international markets as well. In June 2021, the Company acquired Deep Sea Electronics Limited (Deep Sea), a UK-based designer and manufacturer of advanced controls for a range of power generation and other applications used around the world. In September 2021, Generac acquired Off Grid Energy Ltd., a designer and manufacturer of industrial-grade mobile energy storage systems serving predominantly rental markets. The Company advanced its C&I connectivity strategy with the October 2022 acquisition of Blue Pillar, an industrial internet of things (IoT) platform developer that designs, deploys, and manages industrial IoT solutions. Blue Pillar provides a foundation to connect, monitor, and manage our C&I products to further enable their use in grid services programs. In February 2023, Generac acquired REFU Storage Systems GmbH (REFU), a German-based developer and supplier of battery storage and inverter hardware products, advanced software, and platform services for the commercial and industrial markets. REFU’s energy storage systems will complement and enhance our current global product offerings and are expected to further accelerate our development of new technologies in the energy technology space. Additionally, in 2024, we strengthened our presence in the emerging North American markets for C&I behind-the-meter energy storage and multi-asset microgrids with the acquisitions of SunGrid’s C&I battery energy storage system (BESS) product offering and Ageto, a leading provider of microgrid controllers that seamlessly integrate, optimize and manage distributed energy resources (DERs). These acquisitions and related organic initiatives collectively help lay the groundwork to further advance our energy technology strategies across C&I markets around the world.\n\n\n \n\n\nFor a complete summary of recent acquisitions, please see Note 1, “Description of Business,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K.\n\n\n \n\n\nProducts and Solutions\n\n\n \n\n\nWe design, manufacture, and distribute a broad range of energy technology products and solutions. We design and manufacture stationary, portable, and mobile power generators with single-engine outputs ranging between 800W and 3,250kW. We have developed a line of energy storage systems for use in residential solar-plus-storage applications. We also have a line of stationary and mobile energy storage systems that serve global C&I markets. We have a selection of energy monitoring and management devices that we expect to serve as the central hub or controls platform for our residential and C&I energy ecosystems. We participate in the market for grid services by providing DERs and the software to optimize and control those assets to support the grid. We design and manufacture other power products including light towers and a broad line of outdoor power equipment that we refer to as “chore products”, which includes a variety of property maintenance equipment powered by both engines and batteries. We classify our products and services into three categories based on similar ranges of power output geared for varying end customer uses: Residential products, C&I products, and Other products and services. The following summary outlines these categories, including their key attributes and customer applications.\n\n\n\n     \n  \n\n\n \n\n\n\n\n\n\n\n\n\n       3\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nResidential Products\n\n\n \n\n\nOur residential automatic standby generators range in output from 7.5kW to 150kW, which predominantly operate on natural gas and liquid propane, and are permanently installed with an automatic transfer switch, which we also manufacture. Air-cooled engine residential standby generators range in outputs from 7.5kW to 26kW and serve as an emergency backup for small to medium-sized homes. Liquid-cooled engine generators serve as emergency backup for larger homes and small businesses and range in output from 22kW to 150kW.\n\n\n \n\n\nAs the product category leader, we believe we have the broadest line of home standby generators in the marketplace. Every home standby generator that we offer is equipped with Mobile Link™. This remote monitoring capability is a standard feature that allows our customers to check the status of their generator remotely from their smart phone or tablet and also provides the capability to similarly receive maintenance and service alerts. This remote monitoring information can also be accessed by our dealers to help them monitor their installed base of products and proactively support their customers. The data that is provided by this remote monitoring functionality also allows us to better understand our products in the field, while optimizing both product quality and customer satisfaction. We also offer propane tank monitoring solutions, a technology that we acquired in 2021 via Tank Utility Inc. (Tank Utility), an IoT propane tank monitoring solutions company. This additional monitoring capability drives further incremental value to our dealers and peace of mind to owners of our home standby generators that use propane as a fuel source.\n\n\n \n\n\nLeveraging the technologies acquired in the 2019 acquisition of Pika Energy and the subsequent organic investments we have made in clean energy, we have developed a line of residential battery storage systems marketed under the Generac brand and using the PWRcell™ brand name. This system captures and stores electricity from solar panels or other power sources and helps reduce home energy costs while also protecting homes from shorter duration power outages. PWRcell systems can range in size from 9kWh up to 36kWh of storage capacity. In 2025, we expect to launch the PWRcell 2 Series, the next generation of our PWRcell energy storage system, which includes significant improvements in performance and compatibility as compared to the first generation.\n\n\n \n\n\nIn 2021, we acquired ecobee, a leader in sustainable smart home solutions such as smart thermostats and a suite of home monitoring products, all designed with a focus on energy conservation, convenience, peace of mind and comfort. ecobee’s smart home energy management devices and complementary sensors intelligently optimize heating and cooling systems, often the largest energy consuming system within a home, to deliver significant energy savings for homeowners. In 2023, ecobee launched a line of smart doorbell cameras, which integrates with ecobee’s products and helps to drive increased consumer engagement with their platform. The capabilities acquired via ecobee, paired with our existing Mobile Link remote monitoring system, provide the foundation for Generac’s residential connectivity infrastructure, which will be integral in the continued development of our smart home energy ecosystem.\n\n\n \n\n\nImportantly, we are leveraging ecobee’s technologies and software development expertise to develop a user interface at the center of our home energy ecosystem that will allow homeowners to monitor and control Generac’s entire suite of products using a “single pane of glass”. In 2023, we took our first steps towards this goal by successfully integrating our home standby generators and propane tank monitors with the ecobee platform. Our next-generation clean energy products and solutions, including PWRcell 2 and Wallbox’s EV charging solutions, will be fully integrated with the ecobee platform. We believe the integration of our products and solutions in a single cohesive ecosystem will drive additional peace of mind, energy efficiency, and ultimately lower utility bills for homeowners.\n\n\n \n\n\nThis functionality will also help enable connection to grid services distributed energy resource management software (DERMS), including our in-house solution called Concerto. All of our residential energy technology products and home standby generators come with grid-connection capabilities, enabling consumers to connect and enroll their DERs in available grid services programs. These utility-sponsored programs, when and where offered, can provide value to homeowners in the form of lower utility costs, while also helping provide grid operators incremental capacity to address supply/demand imbalances on the grid.\n\n\n \n\n\nWe continue to develop new Generac-branded energy technology products that we expect to bring to market as we build out a broader energy management ecosystem, giving our distributors access to a more diverse line-up of products that can serve a variety of applications. For example, our investment in Wallbox has allowed us to participate in the rapidly developing home EV charging market by offering co-branded EV charging technologies through our expansive distribution network.\n\n\n \n\n\nWe also provide a broad product line of portable and inverter generators that range in size from 800W to 18kW, as well as multiple portable battery solutions that provide clean, emission-free power at the push of a button. These products can help serve as an emergency home backup source of electricity on a limited basis, and they can also be used for construction and recreational purposes. Our portable generators are targeted at homeowners, with price points ranging between the consumer value end of the market through the premium homeowner market; at professional contractors, starting at the value end through the premium contractor segment; and at the recreational market with our inverter generator products, which are quieter than traditional portable generators. In addition, we offer manual transfer switches to supplement our portable generator product offering.\n\n\n \n\n\nWe provide a broad product line of outdoor power equipment referred to as “chore products”, which are used in property maintenance applications for larger-acreage residences, commercial properties, municipalities, and farms. These products include trimmers, field and brush mowers, log splitters, stump grinders, chipper shredders, lawn and leaf vacuums, pressure washers and water pumps. We also offer commercial-grade, battery-powered turf care products through our “Mean Green” brand name, which was acquired in 2020. Chore products are largely sold in North America through direct-to-consumer online catalogs, retail hardware stores, and outdoor power equipment dealers, primarily under the DR® brand name.\n\n\n \n\n\nResidential products comprised\n 56.6%, 5\n1.3% and 63.8%, respectively, of total net sales in 2024, 2023 and 2022.\n \n\n\n \n\n\n\n\n\n\n\n\n\n       4\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nCommercial & Industrial\n P\nroducts\n\n\n \n\n\nWe offer a full line of C&I generators that are sold around the world. We are a leader in cleaner-burning natural gas fueled generators and also have a full offering of C&I generators that are fueled by diesel and Bi-Fuel\nTM\n. We believe we have one of the broadest product offerings in the industry with power outputs ranging from 10kW up to 3,250kW. Through our Deep Sea subsidiary, we have expanded our capabilities in the design and manufacture of advanced controls for a range of C&I power generation applications. Our natural gas C&I stationary generators have grid-connection capabilities, enabling our customers to generate an incremental return on investment by connecting and enrolling their generator as a DERs in grid services applications where available.\n\n\n \n\n\nOur light-commercial standby generators and related transfer switches include a full range of affordable systems from 22kW to 150kW, providing three-phase power sufficient for most small and mid-sized businesses such as grocery stores, convenience stores, restaurants, gas stations, pharmacies, retail banks, small health care facilities and other small-footprint retail applications. Our light-commercial generators predominantly run on natural gas and liquid propane.\n\n\n \n\n\nWe design and manufacture a broad product line of modularized and configured stationary generators and related transfer switches for various industrial standby, continuous-duty, and prime rated applications. Our single-engine industrial generators range in output from 10kW up to 3,250kW, include stationary and containerized packages, and can include our Modular Power Systems (MPS) technology that extends our product range up to much larger multi-megawatt systems through an integrated paralleling configuration. Over the past several years, we have introduced larger and higher-powered gaseous-fueled generators, with the highest output of 1,000kW for a single-engine set. Our industrial standby generators are primarily used as emergency backup for larger applications (such as healthcare, telecom, datacom, commercial office, retail, municipal and manufacturing, to name a few). In recent years, we have seen interest in utilizing our gaseous-fueled generators in \"beyond standby\" applications including distributed generation and microgrid projects and have developed purpose-built products for these applications that have grid-connected capability. This grid-connected functionality and the significant expansion of our in-house advanced controls capabilities further enhances the opportunity for our generators to be used in these applications.\n\n\n \n\n\nOur MPS technology combines the power of several smaller generators to produce the output of a larger generator, providing our customers with redundancy and scalability in a cost-effective manner. For larger industrial applications, our MPS products offer customers an efficient, affordable way to scale their standby power needs, while offering superior reliability given their built-in redundancy which allows individual units to be taken off-line for routine maintenance while retaining coverage for critical circuits.\n\n\n \n\n\nWe also offer a full line of industrial transfer switches to meet varying needs from light commercial applications all the way up to the most demanding mission-critical installations. In recent years, we have significantly increased and upgraded our industrial transfer switch product offering, which we believe will help to enhance our attachment rate and related market share for these products. Generac’s innovative feature set and flexible platforms offer a variety of switching configurations to meet almost any project needs.\n\n\n \n\n\nWe design and manufacture a broad product line of C&I mobile products such as light towers and mobile generators, which provide temporary lighting and power for various end markets around the world (such as road and commercial construction, energy, mining, military, and special events). We also offer commercial mobile pumps, heaters, and dust-suppression equipment for a wide variety of applications. Our mobile products are typically sold globally to national and regional rental companies who then rent the equipment to the end user.\n\n\n \n\n\nWe have continued to expand our portfolio of energy technology solutions for C&I applications as well. In 2021, we acquired Off Grid Energy, a European based manufacturer of mobile energy storage systems predominantly used in the rental markets. In 2023, we acquired REFU, a European based provider of stationary C&I BESS solutions and related inverter products, which expanded our product offering to enter certain C&I BESS markets around the world. In 2024, we strengthened our position in the North American C&I BESS market with the acquisitions of SunGrid’s C&I BESS product offering and Ageto, a leading provider of microgrid controllers that seamlessly integrate, optimize and manage DERs. We believe these collective product offerings will enable us to capture market share in the rapidly developing markets for C&I BESS and multi-asset microgrids in North America.\n\n\n \n\n\nOur C&I BESS solutions are primarily targeted at “behind-the-meter” applications for on-site energy storage. We expect to leverage our leading position as a provider of traditional stationary generators to gain share in the global C&I BESS market. This expertise is particularly beneficial for multi-asset microgrid solutions that combine generators with energy storage assets, providing the many benefits of behind-the-meter storage with longer duration outage protection. These microgrids can include other energy assets such as commercial EV charging capabilities, which we are now able to offer via our partnership with Wallbox.\n\n\n \n\n\nWe also continue to develop other energy technology products, including mobile battery-powered light towers and hybrid mobile solutions that pair a battery with a diesel engine to reduce emissions and noise pollution. In addition, we continue to provide various gaseous-engine control systems and accessories, which are used in our natural gas generators, as well as sold to other gas-engine manufacturers and aftermarket customers.\n\n\n \n\n\nC&I products comprise\nd 32.3%, 3\n7.2% and 27.6%, respectively, of total net sales in 2024, 2023 and 2022.\n \n\n\n \n\n\n\n\n\n\n\n\n\n       5\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nOther \nP\nroducts\n and Services\n\n\n \n\n\nOur “Other products and services” category primarily consists of aftermarket service parts and product accessories sold to our customers, installation and maintenance services, extended warranty revenue, grid services and other software-related subscription revenue, remote monitoring subscription revenue, and other project management service offerings provided by our owned industrial distributors.\n\n\n \n\n\nIncluded in this “Other products and services” category are certain revenues that are generated by ecobee, Blue Pillar, Ageto, and our Concerto and Mobile Link software platforms, as follows:\n\n\n \n\n\necobee recognizes service revenue in certain circumstances when a homeowner enrolls their smart thermostat in a grid services program offered by their utility. ecobee can provide utilities direct connection to a homeowner’s smart thermostat, thereby allowing control of a significant portion of the home’s electrical load. In exchange for this capability, utilities pay ecobee for that connection.\n\n\n \n\n\nThe 2022 acquisition of Blue Pillar expanded our C&I connectivity capabilities and provided a standard protocol for all of our C&I products to be connected. In addition to connectivity device sales, Blue Pillar recognizes software subscription and support revenue resulting from the monitoring and management capabilities its platform provides to customers. \n\n\n \n\n\nThe 2024 acquisition of Ageto further enhanced our advanced control capabilities, particularly in the C&I BESS and multi-asset microgrid markets. In addition to its controls hardware, Ageto’s solutions include software-as-a-service contracts for site level system integration and control of end customer energy assets that make up a microgrid.\n\n\n \n\n\nOur Concerto energy-balancing software platform provides a highly flexible approach for controlling and dispatching DERs from flexible loads, backup generators, energy storage systems, and other renewable energy sources. Concerto gives utilities and grid operators the flexibility to operate virtual power plants in real-time to better manage the escalating complexities of the future electrical grid.\n\n\n \n\n\nFinally, our Mobile Link platform provides remote monitoring services for our residential home standby customers and “Fleet” services for our residential home standby dealers, whereby we collect subscription revenue for these services on a recurring basis.\n\n\n \n\n\n\"Other products and services\" compr\nised 11.1%, 11.5%\n and 8.6%, respectively, of total net sales in 2024, 2023 and 2022.\n \n\n\n \n\n\nMega-Trends, Strategic Growth Themes, and Additional Business Drivers\n\n\n \n\n\nIn 2021, we unveiled our “Powering A Smarter World” strategic plan, which serves as the framework for the significant investments we have made and will continue to make to capitalize on the long-term growth prospects of Generac. Our enterprise strategy is based on the combination of several key mega-trends that we believe will drive a number of significant strategic growth themes for our business.\n\n\n \n\n\nKey Mega-Trends: \n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\nLower power quality continuing to drive demand for backup power solutions:\n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nMore frequent severe and volatile weather impacting an aging grid, causing increased power outage activity.\n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nIncreasing deployment of intermittent generation sources coupled with accelerating electricity demand trends driving supply/demand imbalances for utilities and grid operators.\n\n\n\n\n\n\n \n\n\n●\n\n\nHigher power prices driving the need for energy management solutions:\n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nElectrification trends causing power demand to exceed supply, driving up power prices. \n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nInvestment required to upgrade grid infrastructure and transition to renewable power sources, pushing prices higher.\n\n\n\n\n\n\n \n\n\n●\n\n\nArtificial intelligence adoption accelerating, creating a large market opportunity for backup power:\n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nSignificant power requirements for the buildout of data centers to enable AI adoption could drive further grid instability.\n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nAcceleration in the number of hyperscale and edge data centers that require significant backup power.\n\n\n\n\n\n\n \n\n\n●\n\n\nGrowing demand for cleaner burning fuels: \n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nNatural gas and other alternative fuels are vital to the energy transition.\n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nDemand for natural gas-fueled backup generators growing as homes and businesses desire cleaner-burning fuel sources of generation. \n\n\n\n\n\n\n \n\n\n●\n\n\nRequired investment in global infrastructure, driving demand for our products: \n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nUpgrading of aging and underinvested legacy infrastructure systems, such as power, telecommunications, transportation, and water. \n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nExpanding investment for increasingly critical technology infrastructure as we transition to a more \"connected\" society. \n\n\n\n\n\n\n \n\n\n●\n\n\nHome as a Sanctuary, driving increased demand for resiliency solutions that provide peace of mind:\n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nIncreasing importance of the home with more people working from home and aging in place.\n\n\n\n\n\n\n \n\n\n \n\n\no\n\n\nGrowing market for intelligent and connected homes that can provide improved energy efficiency. \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n       6\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nStrategic Growth Themes:\n\n\n \n\n\nPower quality issues continue to increase\n. Power disruptions are an important driver of consumer awareness for backup power and have historically influenced demand for generators both in the United States and internationally. Increased frequency and duration of major power outage events, that have a broader impact beyond a localized level, increases product awareness and may drive consumers to accelerate their purchase of a standby or portable generator during the immediate and subsequent period, which we believe may last for six to twelve months following a major outage event. Energy storage systems offer similar resiliency advantages to consumers and can benefit from these same awareness drivers, at least for short duration power outages. The optional standby market for C&I power generation is also driven by power quality issues and the related need for backup power. The impact of climate change has received increased global focus in recent years, and an aging and underinvested electrical grid infrastructure remains highly vulnerable to the expectation of more severe and volatile weather. Additionally, rapid growth in renewable power sources such as solar and wind is resulting in increased intermittency of supply as more traditional thermal generation assets are retired, further impairing the reliable supply of electricity. At the same time, power demand is expected to meaningfully accelerate as a result of the rapid adoption of artificial intelligence and related data center energy requirements, the re-industrialization of North America, and the electrification of a wide range of consumer and commercial products, including transportation, HVAC systems, and other major appliances. These developments are causing growing supply/demand imbalances for grid operators across North America, which has led to high-profile examples of rolling blackouts and calls for utility customers to reduce consumption to maintain grid integrity. In fact, the North American Electric Reliability Corporation has labeled significant portions of the United States and Canada as being at high or elevated risk of resource adequacy shortfalls in the 2025-2029 period due in part to these supply/demand dynamics. We believe utility supply shortfalls and related warnings may continue in the future, resulting in continued deterioration of power quality in North America. Finally, certain utilities are adopting preventative power shutoff policies to reduce the risk of wildfires caused by their electrical distribution equipment, predominately in the western half of the country. Taken together, we expect these factors to continue driving increased awareness of the need for backup power and demand for Generac’s products within multiple categories.\n\n\n \n\n\nHome standby penetration opportunity is significant\n. Many potential customers are still not aware of the costs and benefits of automatic backup power solutions. With only approximately 6.5% penetration of the addressable market of homes in the United States (which we define as single-family detached, owner-occupied households with a home value of over $175,000, as defined by the U.S. Census Bureau's 2023 American Housing Survey for the United States), we believe there are significant opportunities to further penetrate the residential standby generator market both domestically and internationally. In addition to the mega-trends supporting growth of the category, we believe by expanding and developing our distribution network, continuing to invest in our product lines and technologies, and targeting our marketing efforts, we can continue to build awareness and increase penetration for our home standby generators.\n\n\n \n\n\nSolar, storage, and energy management markets continue to develop\n. We believe the electric utility landscape will undergo significant changes in the decade ahead due to accelerating demand growth, grid instability and power quality issues, environmental concerns, and the continuing performance and cost improvements in renewable energy and energy storage technologies. Importantly, we expect that a confluence of factors will continue to drive meaningful increases in power prices for end users in the future. As a result, on-site power generation from renewable sources and cleaner-burning natural gas generators are projected to become more prevalent as will the need to monitor, manage, and store this power – potentially developing into a significant market opportunity as utility customers seek alternative solutions to combat rising power prices. In addition, battery storage provides customers another source of power resiliency for shorter duration outages. Additionally, these markets are currently being supported by significant subsidies and investment tax credits for consumers and businesses to help advance the adoption of clean energy technologies. Further, production tax credits are being offered to businesses that meet certain domestic manufacturing requirements in the production of renewable energy products. While the expected duration of these subsidies and tax credits may change, we believe the overall mega-trends that are driving the solar, storage, and energy management markets currently provide sufficient incentive for long-term, value-creating investments for market participants in this space. Given the significant market opportunity ahead of us, we expect to further advance our capabilities in energy technology by increasing our product development, sourcing, distribution, and marketing efforts. In addition, we plan to leverage our significant competencies in the residential standby generator market to build our market position in the emerging residential solar, storage, and energy management markets. \n\n\n \n\n\nEmerging applications and business models utilizing our solutions open new market opportunities\n. We expect the evolution of the traditional electrical utility model toward decarbonized, digitized, and decentralized solutions will create new market opportunities for our products. We believe that we can participate in this future electrical grid in a bigger way by utilizing our products and solutions as DERs by grid operators. This will require intelligent software platforms that are able to optimize an increasingly complex supply and demand equation at both the individual site and grid level, such as our Concerto DERMS software. Our residential and C&I connectivity, controls, and energy management capabilities will also enable new recurring revenue opportunities as grid services programs continue to build out over time. Additionally, we believe that growing interest in our C&I generator and BESS solutions that can be deployed in multi-asset microgrid and “beyond standby” applications will continue to emerge and create incremental market opportunities in the future. The significant advancements made in recent years in the connectivity of our products are core to these newer capabilities, which have played a key role in the evolution of Generac into an energy technology solutions company.\n\n\n \n\n\nNatural gas generators, a continuing growth opportunity\n. We believe natural gas will continue to be an important and cleaner transition fuel of the future, compared to diesel, as the world continues to shift towards lower emission power generation sources. Demand for natural gas generators continues to represent an increasing portion of the overall C&I market, as the benefits of natural gas power generation are very compelling relative to traditional diesel fueled generators. We also continue to explore and expand our capabilities within new gaseous generator market opportunities, including continuous-duty, prime rated, distributed generation, demand response, microgrids, and overall use as a DERs in areas where grid stability is needed. Many of these applications are made possible by our natural gas generators having the capability to participate in available grid services programs, helping to offset the purchase price of the equipment over the product’s lifespan. Expanding our natural gas product offering into larger power nodes is also a part of this growth theme in taking advantage of the continuing shift from diesel to natural gas generators. As a leader in natural gas power generation, we believe we are well positioned to capitalize on this strategic growth theme.\n\n\n \n\n\nIncreasingly critical nature and growing power consumption of digital infrastructure\n. As the number of “connected” devices continues to rapidly increase and wireless networks are considered critical infrastructure in the United States, network reliability and up-time are necessary for our increasingly connected society. This will require highly resilient cell tower sites across the network, and therefore necessitates the need for backup power sources on site at these cell towers. Generac is the leading supplier of backup power to the telecommunications market in the United States. As more mission-critical data is transmitted over wireless networks, we believe the penetration rate of backup generators on cell towers must increase considerably to maintain a higher level of reliability across the network. We have relationships with key Tier 1 carriers and tower companies globally, in addition to having the distribution partners to provide local service support to the global market. We believe these factors coupled with Generac’s ability to customize solutions to each customer’s needs help us to maintain our strength within the global telecommunications market.\n\n\n \n\n\nAdditionally, the rapid increase in data centers is driving increased demand for backup power solutions, given the critical nature of this infrastructure. AI requirements, hyperscalers, and the expansion of edge computing and “connected devices” are expected to quadruple US data center energy consumption from 2023 to 2030, according to certain market forecasts. We believe this significant growth in power consumption will drive demand for backup power and intelligent energy management solutions for individual data center locations, the broader electrical grid, and other grid participants.\n\n\n \n\n\n\n\n\n\n\n\n\n       7\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nOther Business Drivers\n\n\n \n\n\nImpact of residential investment cycle.\n The market for a number of our residential products is affected by the residential investment cycle and overall consumer confidence and sentiment. When homeowners are confident of their household income, the value of their home and overall net worth, they are more likely to invest in their home. These trends can have an impact on demand for residential generators, energy storage systems, and energy management devices. Trends in interest rates and the new housing market, highlighted by residential housing starts, can also impact demand for these products. Demand for outdoor power equipment is also impacted by several of these factors, as well as weather patterns. The existence of renewable energy mandates, investment tax credits, and other subsidies can also have an impact on the demand for solar and energy storage systems. \n\n\n \n\n\nImpact of business capital investment and other economic cycles.\n The global market for our C&I products is affected by different capital investment cycles, which can vary widely across the different regions and markets that we serve. These cycles include non-residential building construction, durable goods and infrastructure spending, as well as investments in the exploration and production of oil & gas, as businesses or organizations either add new locations or make investments to upgrade existing locations or equipment. These trends and market conditions can have a material impact on demand for our products. The capital investment cycle may differ for the various C&I end markets that we serve, including light commercial, retail, office, telecommunications, rental, industrial, data centers, healthcare, construction, oil & gas and municipal infrastructure, among others. The market for these products is also affected by general economic conditions, fluctuations in interest rates, and geopolitical matters in the various countries where we serve, as well as credit availability in those regions.\n\n\n \n\n\nEnterprise Strategy\n\n\n \n\n\nThe mega-trends and strategic growth themes that we have identified support our enterprise strategy, “Powering A Smarter World,” and our purpose statement, “To lead the evolution to more resilient, efficient, and sustainable energy solutions.” As we continue to execute our strategic plan into the future, we are focused on three key objectives: (i) improve energy resilience and independence, (ii) optimize energy efficiency and consumption, and (iii) protect and build critical infrastructure. These objectives are further explained as follows:\n\n\n \n\n\nImprove energy resilience and independence.\n Increase power reliability through onsite generation and storage solutions that provide resiliency for homes, businesses and communities.\n\n\n \n\n\nHomes, businesses, and communities are experiencing a deterioration in the reliable supply of electricity due to a number of factors including: climate change impacts driving more severe and volatile weather leading to increased power outages; a capacity constrained legacy power infrastructure that’s still predominantly a one-way system; power infrastructure being impaired by underinvestment making it more susceptible to power outages; regulatory and legislative actions focused on carbon intensity, coupled with incentives for adoption of more intermittent renewable power sources; and a dramatic increase in power demand that could outpace supply growth due to electrification trends, accelerating power demands of data centers and artificial intelligence, and the re-industrialization of North America. We have one of the broadest product offerings that we believe can directly address these challenges for homes and businesses. Our residential and C&I product offering begins with emergency standby generators that can be supplemented with portable and mobile power generators. We have also built out an offering of battery energy storage systems for behind-the-meter residential and C&I applications. These onsite generation and storage solutions provide peace of mind and protection against rising power quality issues by delivering energy resilience and independence for end users and their communities. Many of these onsite solutions are capable of being connected to the grid and can help support overall grid reliability, resiliency and sustainability when enrolled in utility grid services programs. \n\n\n \n\n\nOptimize energy efficiency and consumption.\n Enable sustainable and more efficient power generation and consumption through monitoring, management and lower-carbon solutions.\n\n\n \n\n\nMultiple entrenched trends are expected to drive accelerated demand growth for electricity in the coming years. These power demand trends will require utilities and energy retailers to meaningfully increase the supply and reliability of electricity, while at the same time working to achieve carbon-reduction goals, which is expected to further contribute to supply/demand imbalances for power. Additionally, the combination of accelerating demand growth with significant investments in maintaining, upgrading, and decarbonizing the power grid is likely to cause meaningful increases in the price of electricity, ultimately driving home and business owners to adopt solutions to offset the impact of rising costs. As part of our expanding ecosystems of energy technology solutions, we continue to build out our residential energy management capabilities, which improve energy efficiency and optimize consumption for end users. This includes ecobee smart home energy management devices, propane tank monitoring solutions, Wallbox EV charging equipment, and other load management devices. Our battery storage solutions for both residential and C&I applications allow end users to store power that is often generated on-site to optimize the timing of consumption. With this capability, home and business owners can discharge power from their battery at times when utility rates are at their highest, thereby saving money on their utility bills. Battery storage systems, along with smart thermostats and other DERs, can also participate in grid services programs, helping to enhance the efficiency of the broader electrical grid.\n\n\n \n\n\nWe continue to build out our system level controls by leveraging our deep software development capabilities brought on by various acquisitions. These controls enable the monitoring and management that is necessary to optimize energy efficiency and consumption. For our residential products, we are developing a common platform and user interface to bring all of our residential products into a single ecosystem. Using ecobee as the central hub and MobileLink as our connectivity platform, we are able to link all of our installed residential products together for a seamless consumer experience to monitor, manage, and control their energy generation, storage, and consumption. For our C&I products, we are developing a similar ecosystem of controls that are building off Deep Sea’s industrial controls, Blue Pillar’s IoT network solutions, and Ageto’s multi-asset microgrid control technology, helping businesses to better optimize their energy efficiency and consumption. These enhanced control capabilities provide the foundation for the continued build out of a common system-level platform for our C&I customers to monitor, manage, and control all of their DERs, including non-Generac assets as well.\n\n\n \n\n\nProtect and build critical infrastructure.\n Offering innovative solutions that enable and protect next-generation power, telecommunications, transportation, water, and other critical infrastructure.\n\n\n \n\n\nThe critical power infrastructure around the world is becoming more sensitive to growing electricity supply/demand imbalances. Generac’s suite of products can be connected and synchronized within DERMS platforms, such as our Concerto offering, providing utilities and grid operators the flexibility to access and control these DERs in real-time to better manage the escalating complexities of their electrical grids. When utilized in these applications, our residential and C&I products essentially provide power capacity to utilities and grid operators in the form of a virtual power plant. We believe the next generation of critical power infrastructure will be more decarbonized, digitized and decentralized, and we view the aggregation and management of DERs as an important aspect in supplementing the next generation grid.\n\n\n \n\n\nAs society becomes more “connected” and more mission-critical data travels over wireless networks, reliability and uptime of this telecommunications equipment will be essential to maintain our way of life. As a leader in providing backup power generators for wireless cell towers around the world, we believe we can play an important role in helping to protect and build this critical infrastructure. In addition, we believe that data centers will be considered critical infrastructure as more data will be accessed from the “cloud” and artificial intelligence becomes more ubiquitous in our everyday lives. As a result, backup power solutions will be important elements of this next-generation infrastructure in order to make them more resilient.\n\n\n \n\n\nOur broad offering of C&I mobile products (including mobile light towers, mobile power generators, mobile energy storage systems and hybrid generators) play a key role in the completion of infrastructure construction projects, such as roads, highways, bridges, and airports. Finally, our products are also commonly used to provide standby power to other critical infrastructure such as water and wastewater systems and other municipal infrastructure, as well as healthcare facilities that are vital for a safe and healthy society.\n\n\n \n\n\nSee “Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations – Business Drivers and Operational Factors” of this Annual Report on Form 10-K for additional drivers that influence demand for our products and other factors affecting the markets that we serve.\n\n\n \n\n\n\n\n\n\n\n\n\n       8\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nDistribution Channels and Customers\n\n\n \n\n\nWe distribute our products through a variety of distribution channels to increase awareness of our product categories and brands, and to ensure our products reach a broad, global customer base. This omni-channel distribution network includes independent residential dealers and contractors, industrial distributors and dealers, national and regional retailers, e-commerce partners, electrical/HVAC/solar wholesalers, solar installers, catalogs, equipment rental companies, and other equipment distributors. We also sell direct to certain national and regional account customers, as well as to individual consumers or businesses who are the end users of our products.\n\n\n \n\n\nWe believe our global distribution network is a competitive advantage that has strengthened over the years as we continue to add, expand and develop the various distribution channels through which we sell our products. We offer a broad set of tools, programs, factory support, and sales leads to help our distribution partners be successful. Our network is well balanced with no single customer providing more than 5% of our net sales in 2024.\n\n\n \n\n\nWe have the industry's largest network of factory direct independent generator dealers in North America. Our residential dealer network is made up of electrical and HVAC contractors across the US and Canada. These dealers sell, install and service our residential and light commercial generators to end users. Over the years, we have made significant investments to grow this dealer network, and we will continue to make those investments in the future given the importance of this channel. We continue to focus on a variety of initiatives to more effectively market and sell our home standby products and better align our dealer network with Generac. We will continue our efforts to improve customer lead quality, nurture those leads, and develop our dealers, all with a goal of increasing close rates and lowering our cost per lead over time. Over the years, we have made significant investments in our proprietary in-home selling system for residential dealers that we call “Power Play”. We are continuously making enhancements to this platform, again with the objective of improving the customer experience and overall close rates. Additionally, our remote monitoring platform allows our residential generator dealers to monitor their installed base of customers through a feature that we call “Fleet”, enabling them to offer a more proactive experience to service a customer’s generator. By offering the best product line, pricing, marketing, tools, programs, and customer support, we believe we have built the strongest dealer network in the home standby generator industry.\n\n\n \n\n\nIn recent years, we have been establishing a base of solar contractors that sell, install and service our PWRcell energy storage systems. Leveraging our decades of expertise in partnering with our residential generator dealers, we believe we can expand our solar installer network and increase mindshare for Generac’s products, helping us to win in the clean energy market in the future. In addition, we have been developing distribution relationships with national solar providers to offer our equipment in their portfolio of products and services. As we continue to launch new clean energy products in the future, we expect to accelerate our efforts to expand distribution in this market.\n\n\n \n\n\nOur industrial products distribution network consists of industrial power generation distributors that cover particular regions around the world. Over the past several years, we have been strengthening our industrial dealer network globally through acquisitions and organic means, to increase our C&I product sales and related market share. Since 2020, we have acquired a number of our industrial distributors to give us direct coverage of those regions in the United States and accelerate our efforts in those markets. Industrial distributors and dealers provide C&I end users with ongoing sales, installation, service and product support. Our industrial distributors and dealers help maintain the local relationships with commercial electrical contractors, specifying engineers, and national account regional buying offices. We also sell to certain EPC companies and other companies that specialize in managing more complex power generation projects, including microgrids and “beyond standby” applications.\n\n\n \n\n\nOur retail distribution channel includes thousands of locations across the globe and includes a variety of national and regional home improvement chains, electronics retailers, clubs, buying groups, hardware & farm supply stores, and outdoor power equipment dealers. These physical retail locations are supplemented by a large presence of e-commerce retailers, along with a number of catalog retailers. The retail channel primarily sells our residential standby, portable and light-commercial generators, as well as our outdoor power equipment and ecobee smart home energy management devices. The placement of our products at retail locations drives significant awareness for our brands and the home standby generator product category.\n\n\n \n\n\nOur wholesale network distributes our residential and light-commercial generators, residential energy storage systems, and smart home energy management devices on a two-step basis. The channel consists of selling branches of both national and local distribution houses for electrical, HVAC and solar equipment on a wholesale basis, which in turn typically sell to electricians and HVAC/solar installers who are not in our dealer network. As part of our efforts to increase sales & installation bandwidth for home standby generators, we have established an Aligned Contractor Program that provides certain benefits to contractors that purchase our products through the wholesale network and agree to participate in enhanced training sessions. We believe that this program will further align Generac with these independent contractors which is important during surge periods of demand in local markets.\n\n\n \n\n\nOn a selective basis, we have established private label and licensing arrangements with third party partners to provide residential, light-commercial and industrial generators under different brand names. These partners include leading home equipment, electrical equipment and construction machinery companies, each of which provides access to incremental channels of distribution for our products. Additionally, our ecobee products are also sold through HVAC OEMs on a co-branded basis.\n\n\n \n\n\nThe distribution for our C&I mobile products includes global, national, regional, and specialty equipment rental companies, equipment distributors, and construction companies which primarily serve non-residential building construction, road construction, energy markets and special events.\n\n\n \n\n\nWe also sell direct to certain customers that are the end users of our products covering a variety of end market verticals both domestically and around the world. This includes telecommunication, retail, data centers, banking, energy, healthcare, convenience stores, grocery stores, restaurants, governments, and other commercial applications. We have developed a diverse, global sales force that calls on these opportunities directly and helps customize solutions to each customer’s needs in their local markets. Additionally, certain of our residential products are sold direct to individual consumers, who are the end users of the product. In the grid services space, we sell software and equipment direct to utilities and grid operators.\n\n\n \n\n\n\n\n\n\n\n\n\n       9\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nResearch and Development \n\n\n \n\n\nOur focus on a broad range of energy technology products and solutions drives technological innovation, advanced engineering & software development capabilities, and specialized manufacturing competencies. Research and development (R&D) has been a core competency for Generac since our inception, and today includes a staff of approximately 1,250 engineers working on numerous projects at various facilities around the world. These activities are focused on new product introductions, developing new technologies and product enhancements, as well as maintaining product competitiveness by reducing manufacturing costs, improving safety characteristics, and increasing reliability & performance, while ensuring compliance with regulatory standards. We have significant experience using natural gas engines and have developed specific expertise with fuel systems and emissions technology. In the residential and light commercial markets, we have developed proprietary engines, cooling packages, controls, fuel systems, and emissions systems which help drive innovation while also enhancing the margin profile of those products.\n\n\n \n\n\nMore recently, we have also built out specific expertise around battery storage systems and power conversion that we plan to leverage as we expand into clean energy markets. In addition, we have significantly increased our software development capabilities across a variety of applications, including energy management, system-level microgrid controls, remote monitoring, and distributed energy resource management systems. Combining advanced software development with our broad engineering capabilities will enable us to create common ecosystems for our residential and C&I products, helping us to accelerate our energy technology efforts.\n\n\n \n\n\nWe also have engineering and product management resources focused on evaluating and developing alternative technologies that are emerging and could become commercially viable over the long-term, such as fuel cells and hydrogen. We have a long history of driving product innovation into the markets that we serve. As we continue to develop new products and technologies that are more decarbonized, digitized, and decentralized, we believe we can maintain our leadership position as an energy technology solutions provider.\n\n\n \n\n\nIntellectual Property\n\n\n \n\n\nWe are committed to research, development, and product innovation, and we rely on a combination of patents and trademarks to help establish and protect our proprietary rights. Our patents protect certain features and technologies we have developed for use in our products including fuel systems, air flow, electronics and controls, noise reduction, engines, energy management, energy monitoring, energy storage, and load management. We believe the existence of these patents and trademarks, along with our ongoing processes to register additional patents and trademarks, help protect our intellectual property rights and enhance our brands and competitive position. We also use proprietary manufacturing processes that require customized equipment. With our continuous focus on research and development, we expect to develop new intellectual property on an ongoing basis.\n\n\n \n\n\nSee “Item 1A. Risk Factors” of this Annual Report on Form 10-K for additional factors related to intellectual property rights that can affect our business.\n\n\n \n\n\nManufacturing\n\n\n \n\n\nWe operate numerous manufacturing plants, distribution facilities and inventory warehouses located throughout the world. We also store finished goods at third-party logistics providers in the United States that accommodate material storage and rapid response requirements of our customers. See “Item 2 – Properties” of this Annual Report on Form 10-K for additional details regarding the locations and activities of our principal operations.\n\n\n \n\n\nOver the last few decades, we have developed significant manufacturing capability in the power generation industry, including engines, alternators, sheet metal fabrication, and controls. We have a heavy focus on vertical integration for certain proprietary manufacturing processes, and outsource certain components and complete products where we can leverage scale to optimize cost and quality. In recent years, we have added manufacturing capacity through investments in automation, while also expanding our manufacturing footprint through organic means as well as through acquisitions. Our ability to rapidly increase capacity has been critical to executing our growth.\n\n\n \n\n\nFor our energy technology products, our engineering and technical teams are closely aligned with our contract manufacturing partners in order to leverage their expertise and capital investments involving electrical component manufacturing.\n\n\n \n\n\nSuppliers of Raw Materials, Components and Equipment\n\n\n \n\n\nOur primary raw material inputs are steel, copper and aluminum, all of which are purchased from third parties and, in many cases, as part of machined or manufactured components. In certain instances, we purchase complete equipment or systems from third-party suppliers, including from contract manufacturers. Given our increasing focus on energy technology solutions, advanced electronic components and micro-processors have become a larger consideration within our supply chain. Within the clean energy market, batteries are a significant supply chain input for our energy storage systems. Over multiple decades, we have developed an extensive network of reliable suppliers in the United States and around the world. We continuously evaluate the quality and cost structure of our purchased components & equipment and assess the capabilities and capacity of our supply chain. We select our sourcing partners based on this evaluation. For certain products, we do not have internal manufacturing capabilities and rely upon a small number of contract manufacturers to build these products or supply these components, including but not limited to certain energy technology products and components.\n\n\n \n\n\nOver time, we have diversified the geographic reach of our global supply chain partners to partially mitigate the impact of certain trade tariffs that have been assessed on imports coming into the United States. We will continue to monitor ongoing developments with new trade tariffs that may be implemented in the future, and take action to offset the impact of those tariffs.\n\n\n \n\n\nSee “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of this Annual Report on Form 10-K for additional information regarding the impact of other macroeconomic factors.\n\n\n \n\n\nSee “Item 1A. Risk Factors” of this Annual Report on Form 10-K for additional factors that can influence our supply of raw materials, components and equipment.\n\n\n \n\n\n\n\n\n\n\n\n\n       10\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nCompetition\n\n\n \n\n\nIn our traditional power generation markets, we face competition from a variety of large diversified industrial companies, as well as smaller generator manufacturers or packagers around the world. The competitive landscape varies between our Residential and C&I power generation products. We face a different set of competitors for our mobile equipment and engine powered tools as well. In recent years, we have expanded who we compete against as we enter certain energy technology markets, such as solar inverters, battery storage systems, smart thermostats, and grid services.\n\n\n \n\n\nIn the generator market, many of the traditional participants compete in only certain portions of the market, targeting specific applications within their larger diversified product mix. In addition, for certain competitors, power generation is typically a smaller piece of their business, and therefore, is less prioritized from a strategic standpoint. Generac’s primary focus is on power generation and storage equipment with a key emphasis on standby, portable and mobile generators with broad capabilities across the residential, light-commercial and industrial markets. We believe that our core focus on power generation and storage drives product innovation and provides us with competitive advantages to win in the marketplace. We also believe our broad product offering, diverse omni-channel distribution model, and strong factory support provide additional advantages as well.\n\n\n \n\n\nResidential products\n – Competitors include Rehlko (formerly known as Kohler Power), Briggs & Stratton, Honda, Champion, Techtronics International, Harbor Freight, Husqvarna, Ariens, Tesla, Enphase, Solar Edge, Google, Resideo, The Toro Company, Goal Zero, and Emerson along with a number of other domestic and foreign competitors; certain of which also have broad operations in other manufacturing businesses.\n\n\n \n\n\nC&I products \n– Competitors include Caterpillar, Cummins, Rehlko (formerly known as Kohler Power), IGSA, AKSA, MultiQuip, Wacker, Doosan, Atlas Copco, Himoinsa, FG Wilson, Woodward, Planelec, and Co-map, as well as other domestic and foreign competitors that package engines and alternators into power generation equipment in local markets around the world; certain of which focus on the market for diesel generators as they are also diesel engine manufacturers. \n\n\n \n\n\nOther products \n– Relative to service parts and extended warranty revenue, all of the above-named companies are primary competitors. Relative to grid services optimization software, Autogrid/Schneider and Energy Hub, along with other grid service solution providers, are primary competitors. \n\n\n \n\n\nIn a continuously evolving market, we believe our scale and broad capabilities position us well to remain competitive. Overall, we compete primarily based on brand reputation, quality, reliability, pricing, innovative features, breadth of product & solution offering, product availability and factory support.\n\n\n \n\n\nGovernment Incentives and Regulation, including Environmental Matters\n\n\n \n\n\nGenerac’s growing presence in energy technology solutions has increased our exposure to renewable energy mandates, investment tax credits, and other demand-creation subsidies from certain existing and potential government incentives, such as incentives included in the U.S. Inflation Reduction Act that was passed in 2022. These incentives cover a wide range of clean energy products and solutions, including solar inverters, battery storage systems, grid services, and grid-edge devices. The availability, size, and outlook for such incentives can impact the markets for these products and solutions. These legislative and regulatory actions and other methods of government funding can be subject to changes in the political environment at a given point in time. While the policy back drop for the clean energy market may evolve over time, we believe customer interest and demand, as well as government programs and support for such energy technology products, will continue as grid capacity is strained and energy costs rise.\n\n\n \n\n\nAs a manufacturing company, our operations are subject to a variety of federal, state, local and foreign laws & regulations covering environmental, health and safety matters. Applicable laws & regulations include those governing, among other things, emissions to air, discharges to water, noise, and employee & consumer safety, as well as the generation, handling, storage, transportation, treatment, and disposal of hazardous waste and other materials. In addition, our products are subject to various laws & regulations relating to fuel requirements, labeling, and marketing. \n\n\n \n\n\nOur products sold in the United States are regulated by the U.S. Environmental Protection Agency (EPA), California Air Resources Board (CARB) and various other state and local air quality management districts. All of our engines and engine-driven products sold in the U.S. are regulated, and these governing bodies continue to pass regulations that require us to meet more stringent emission standards. In addition, certain of our products are subject to safety standards as established by various other standards and rulemaking bodies, including the U.S. Consumer Product Safety Commission (CPSC), among others. Similarly, other countries have varying degrees of regulation for our products, depending upon product application and fuel types.\n\n\n \n\n\nSee “Item 1A. Risk Factors” to this Annual Report on Form 10-K for additional legal and regulatory factors that can affect the products we sell and the results of our operations.\n\n\n \n\n\n\n\n\n\n\n\n\n       11\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nSustainability Practices\n\n\n \n\n\nWe published a report on our sustainability practices in April 2024. This report details certain measures that align with our “Powering a Smarter World” enterprise strategy and our purpose statement: 'To lead the evolution to more resilient, efficient, and sustainable energy solutions.' The information provided within the sustainability report is not part of this report and is therefore not incorporated herein by reference. A copy of the sustainability report is available on our Investor Relations webpage at Generac.com. We plan to publish an updated report on our sustainability practices in April 2025 that coincides with the filing of our annual Proxy Statement.\n\n\n \n\n\nHuman Capital\n\n\n \n\n\n\"Our People\" is one of the foundational elements to our “Powering a Smarter World” enterprise strategy and is a corporate value as well. We foster a culture of engagement to strengthen our company while supporting individual achievement, inclusivity, and good corporate citizenship globally. We believe our success is directly linked to our employees’ professional growth and personal well-being, combined with strong families and communities. \n\n\n \n\n\nSome examples of key human capital programs and initiatives that we are focused on include:\n\n\n \n\n\nHealth, wellness and safety\n – Employee health and safety is the Company’s top priority. Generac’s total rewards program is based on the four pillars of balance, security, well-being and community. These programs are designed to meet the varied and evolving needs of our diverse workforce. We maintain an employee wellness program, incentivize healthy-living activities, and develop and administer company-wide policies to help ensure the safety of each employee and compliance with government agency and other standards. \n\n\n \n\n\nTalent development & employee engagement\n – Our success is directly tied to our employees and what we can accomplish together. We prioritize creating opportunities to help employees build careers and support their growth as part of a meaningful and valuable employee experience. We hold internal career development events as well as partner with third party educational resources to offer on the job learning, collaborative work experiences and formal learning programs to support the progression and advancement of our workforce. Further, we maintain an ongoing global employee engagement initiative with targeted action plans by region, function, and business group. Action plans and their progress are measured by global employee engagement surveys. A global human capital management system was implemented enabling Generac management to make better talent decisions, proactively manage careers, scale globally and maintain compliance. We are an equal opportunity employer whose hiring and promotion practices comply with all the applicable laws and we do not condone employment discrimination in any form. \n\n\n \n\n\nAs of December 31, 2024, we had 9,239 employees, including part-time and temporary employees working in our operations, manufacturing and supply chain functions. Of those, approximately 3,850 employees, including temporary workers, were directly or indirectly involved in manufacturing.\n\n\n \n\n\nDomestically, we have had an “open shop” bargaining agreement for the past 50 years that covers our Eagle, Wisconsin facility. That facility is subject to a collective bargaining agreement that expires October 17, 2026, and is subject to Wisconsin’s Right to Work law. Through an acquisition in April 2024, three additional smaller facilities, which are located in Bloomfield and Shelton, Connecticut and Bohemia, New York, are subject to a collective bargaining agreement for its technicians. That collective bargaining agreement expires October 31, 2027, and is subject to a Union Security provision. Additionally, our plants in Mexico, Italy, Germany, and Spain are operated under various local or national union groups or works councils. Our other facilities are not unionized.\n\n\n \n\n\nAvailable Information\n\n\n \n\n\nOur principal executive offices are located at S45 W29290 Highway 59, Waukesha, Wisconsin, 53189 and its telephone number is (262) 544-4811. The Company’s website is www.generac.com. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports (if applicable) are available free of charge through the “Investor Relations” portion of our web site, as soon as reasonably practicable after they are filed with the Securities and Exchange Commission (SEC). The information provided on these websites is not part of this report and is therefore not incorporated herein by reference.\n\n\n \n\n\n\n\n\n\n\n\n\n       12\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nInformation About Our \nExecutive O\nfficers\n\n\n \n\n\nThe following table sets forth information regarding our executive officers:\n\n\n \n\n\n\n\n\n\n\n\nName\n\n\n \n\n\nAge\n\n\n \n\n\nPosition\n\n\n\n\n\n\n \nAaron P. Jagdfeld\n \n\n\n \n \n \n\n\n \n53\n \n\n\n \n \n \n\n\n \nPresident, Chief Executive Officer and Chairman\n \n\n\n\n\n\n\n \nYork A. Ragen\n \n\n\n \n \n \n\n\n \n53\n \n\n\n \n \n \n\n\n \nChief Financial Officer\n \n\n\n\n\n\n\n \nErik Wilde\n \n\n\n \n\n\n \n50\n \n\n\n \n\n\n \nPresident, Domestic C&I\n \n\n\n\n\n\n\nRaj Kanuru\n\n\n \n\n\n54\n\n\n \n\n\nExecutive Vice President, General Counsel and Secretary\n\n\n\n\n\n\nNorman Taffe\n\n\n \n\n\n58\n\n\n \n\n\nPresident, Energy Technology\n\n\n\n\n\n\nKyle Raabe\n\n\n \n\n\n50\n\n\n \n\n\nPresident, Consumer Power\n\n\n\n\n\n\n\n\n \n\n\nAaron P. Jagdfeld\n has served as our Chief Executive Officer since September 2008, as a director since November 2006 and was named Chairman in February 2016. Prior to becoming Chief Executive Officer, Mr. Jagdfeld worked for Generac for 15 years. He began his career in the finance department in 1994 and became our Chief Financial Officer in 2002. In 2007, he was appointed President and was responsible for sales, marketing, engineering and product development. Prior to joining Generac, Mr. Jagdfeld worked in the audit practice of the Milwaukee, Wisconsin office of Deloitte and Touche. Mr. Jagdfeld holds a Bachelor of Business Administration in Accounting from the University of Wisconsin-Whitewater.\n\n\n \n\n\nYork A. Ragen\n has served as our Chief Financial Officer since September 2008. Prior to becoming Chief Financial Officer, Mr. Ragen held Director of Finance and Vice President of Finance positions at Generac. Prior to joining Generac in 2005, Mr. Ragen was Vice President, Corporate Controller at APW Ltd., a spin-off from Applied Power Inc., now known as Enerpac Tool Group. Mr. Ragen began his career at Arthur Andersen in the Milwaukee, Wisconsin office audit practice. Mr. Ragen holds a Bachelor of Business Administration in Accounting from the University of Wisconsin-Whitewater.\n\n\n \n\n\nErik Wilde\n began serving as our President, Domestic C&I in July 2016. Mr. Wilde was Vice President and General Manager of the Mining Division for Komatsu America Corp., a manufacturer of construction, mining, and compact construction equipment, from 2013 until he joined Generac. Prior to that role, he held leadership positions as Vice President of the ICT Business Division and Product Marketing at Komatsu America Corp. beginning in 2005. Mr. Wilde holds a Bachelor of Business Administration in Management from Boise State University and an M.B.A. from the Keller Graduate School of Management.\n\n\n \n\n\nRaj Kanuru\n is our Executive Vice President, General Counsel & Secretary and is the Company’s principal legal and compliance officer, roles that he has held since joining Generac in 2013. Prior to joining Generac, Mr. Kanuru served as in-house counsel at Caterpillar Inc. for almost 14 years within various leadership roles, including in Caterpillar’s Securities, Regulatory and Tax group, in Caterpillar Financial, and in Caterpillar’s Energy & Transportation group. From 2009 to 2013, Mr. Kanuru served as Vice President, General Counsel and Secretary of Progress Rail Services Inc., and its subsidiaries (a Caterpillar company). He began his legal career as a senior associate in the tax consulting practice of Arthur Andersen LLP. Mr. Kanuru holds a Bachelor of Science in Finance degree from Birmingham-Southern College and received his Juris Doctor degree from the University of Alabama.\n\n\n \n\n\nNorman Taffe\n began serving as President, Energy Technology in August 2022. Prior to joining Generac, Mr. Taffe was Executive Vice President North America Residential of SunPower Corporation from 2018 to 2021. Prior to this, Mr. Taffe was Executive Vice President - Products and Vice President of Power Plant Products and Solutions from 2013 to 2018. Mr. Taffe also worked in various engineering and marketing management capacities at Cypress Semiconductor from 1989 to 2012, including Executive Vice President – Consumer & Computation Devices from 2005 to 2012. Mr. Taffe holds a Bachelor of Science in Electrical Engineering from the University of Michigan and an Executive MBA from Harvard Business School.\n\n\n \n\n\nKyle Raabe\n has served as our President, Consumer Power since November 2019. Prior to rejoining Generac, Mr. Raabe was Senior Vice President of North American Sales, Demand Planning and Sales Operations from 2018 through 2019 and Vice President of Sales for the Commercial Security and Safety groups from 2015 through 2018 at The Master Lock Corporation, a manufacturer of locks, combination padlocks and other security products. Prior to working at The Master Lock Corporation, Mr. Raabe led multiple groups at Generac Power Systems from 2007 through 2015 as Director of Wholesale and Dealer Distribution, Vice President Wholesale Distribution Sales and Vice President, Industrial Distribution Sales. Before joining Generac, Mr. Raabe served at Veolia North America, Environmental Services leading Midwest Regional Service Operations. Mr. Raabe holds a BA, Biological Science from Lawrence University. \n\n\n \n\n\n\n\n\n\n\n\n\n       13\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\n \n\n\nThe following discussion and analysis of our financial condition and results of operations should be read together with “Item 1 – Business,” the consolidated financial statements, and the related notes thereto in Item 8 of this Annual Report on Form 10-K. This discussion contains forward-looking statements, based on our expectations at the time of filing this Annual Report on Form 10-K and related to future events and our future financial performance, that involve risks and uncertainties. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of many factors, including those set forth under “Item 1A. - Risk Factors.” of this Annual Report on Form 10-K. \n\n\n \n\n\nOverview \n\n\n \n\n\nGenerac is a total energy solutions company that empowers people to use energy on their own terms. Founded in 1959, Generac is a leading global designer, manufacturer, and provider of a wide range of energy technology solutions. The Company provides power generation equipment, energy storage systems, energy management devices & solutions, and other power products serving the residential, light commercial, and industrial markets. The Company continues to expand its energy technology offerings for homes and businesses in its mission to Power a Smarter World and lead the evolution to more resilient, efficient, and sustainable energy solutions.\n\n\n \n\n\nFurther information regarding our business is provided in “Part I, Item 1. Business” of this Annual Report on Form 10-K.\n\n\n \n\n\nBusiness D\nrivers\n and Operational Factors\n\n\n \n\n\n“Part I, Item 1. Business” of this Annual Report on Form 10-K contains information regarding business drivers, including key mega-trends and strategic growth themes under the subheading “Mega-Trends, Strategic Growth Themes, and Additional Business Drivers.”\n\n\n \n\n\n \nF\nactors\n Affecting Results of O\nperations\n\n\n \n\n\nWe are subject to various factors that can affect our results of operations, which we attempt to mitigate through factors we can control, including continued product development, expanded distribution, pricing, cost control, and hedging. Certain operational and other factors that affect our business include the following:\n\n\n \n\n\nEffect of commodity, currency, component price fluctuations, and resource availability.\n    Industry-wide price fluctuations of key commodities, such as steel, copper and aluminum, along with other components we use in our products, as well as changes in labor costs required to produce our products, can have a material impact on our results of operations. Acquisitions in recent years have increased our use of advanced electronic components and battery cells, as well as further expanded our commercial and operational presence outside of the United States. Our international acquisitions, along with our existing global supply chain, expose us to fluctuations in foreign currency exchange rates and regulatory tariffs that can also have a material impact on our results of operations. \n\n\n \n\n\nWe have historically attempted to mitigate the impact of any inflationary pressures through improved product design and sourcing, manufacturing efficiencies, price increases, and select hedging transactions. Our results are also influenced by changes in fuel prices in the form of freight rates, which in some cases are accepted by our customers and in other cases are paid by us.\n\n\n \n\n\nSeasonality.\n    Although there is demand for our products throughout the year, in each of the past five years, approximately 19% to 25% of our net sales occurred in the first quarter, 22% to 28% in the second quarter, 24% to 28% in the third quarter and 23% to 31% in the fourth quarter, with different seasonality depending primarily on the occurrence, timing and severity of major power outage activity in each year. Major outage activity is unpredictable by nature and, as a result, our sales levels and profitability may fluctuate from period to period. The seasonality experienced during a major power outage, and for the subsequent quarters following the event, will vary relative to other periods where no major outage events occurred. \n\n\n \n\n\nAcquisitions.\n   Over the years, we have executed a number of acquisitions that support our strategic plan. A summary of the recent acquisitions can be found in Note 1, “Description of Business\" to the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K. \n\n\n \n\n\n\n\n\n\n\n\n\n       23\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\nFactors Influencing Interest Expense\n\n\n \n\n\nInterest expense can be impacted by a variety of factors, including market fluctuations in SOFR, interest rate election periods, interest rate swap agreements, repayments or borrowings of indebtedness, and amendments to our credit agreements. In connection with our credit agreement amendment in June 2022, SOFR became the new benchmark interest rate for the new Tranche A Term Loan Facility and the Revolving Facility, and all LIBOR provisions in the existing Tranche B Term Loan Facility were replaced with SOFR provisions. Refer to Note 12, “Credit Agreements,” to the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K for further information. The decrease in interest expense in the current year was primarily driven by lower borrowings and lower SOFR interest rates during the year. \n\n\n \n\n\nFactors Influencing Provision for Income Taxes and Cash Income Taxes Paid \n\n\n \n\n\nThe effective income tax rates for the years ended December 31, 2024 and 2023 were 22.6% and 25.2%, respectively. The decrease in our 2024 effective tax rate was primarily due to unfavorable discrete tax items in the prior year that did not repeat in the current year, as well as favorable earnings mix with higher earnings in lower tax jurisdictions in the current year. \n\n\n \n\n\nOn August 16, 2022, the U.S. government enacted the Inflation Reduction Act (the Act). The Act in part provides funding and tax incentives for certain clean energy products and projects. While the Act did not have a material impact on the financial results of the current period, we will continue to review the Act and any regulations or guidance issued by the U.S. Treasury Department or by a state which may provide a tax benefit or expense. We will also monitor any changes to the Act under the new policy environment.\n\n\n \n\n\nIn 2021, the Organization for Economic Cooperation and Development (OECD) released Pillar Two Global Anti-Base Erosion model rules, designed to ensure large corporations are taxed at a minimum rate of 15% in all countries of operation. The OECD continues to release guidance and countries are implementing legislation to adopt the rules, some of which became effective on January 1, 2024. The United States has not yet enacted legislation implementing Pillar Two. We are continuing to evaluate the Pillar Two rules and their potential impact on future periods. There was no impact to the financial results of the year ended December 31, 2024, and we do not expect the rules to have a material impact on our effective tax rate for the following year. We will update our future tax provisions based on new regulations or guidance accordingly. \n\n\n \n\n\nComponents of Net Sales and Expenses\n\n\n \n\n\nNet Sales\n\n\n \n\n\nOur net sales primarily consist of the sale of products to our customers. This includes sales of our power generation equipment, energy storage systems, and other power products to the residential, commercial and industrial markets, as well as service parts to our dealer network. Net sales also include shipping and handling charges billed to customers, with the related freight costs included in cost of goods sold. Additionally, we offer other services, including extended warranties, installation, maintenance, data center and telecom facility design and build, remote monitoring, and grid services to utilities in certain circumstances. These services accounted for less than 4% of our net sales for the year ended December 31, 2024. Refer to Note 2, “Summary of Accounting Policies - Revenue Recognition,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for further information on our revenue streams and related revenue recognition accounting policies.\n\n\n \n\n\nWe are not dependent on any one channel or customer for our net sales, with no single customer representing more than 5% of our net sales, and our top ten customers representing less than 16% of our net sales in aggregate for the year ended December 31, 2024.\n\n\n \n\n\nCosts of Goods Sold\n\n\n \n\n\nThe principal elements of costs of goods sold are component parts, raw materials, inbound and outbound freight, factory overhead and labor. The principal component parts are engines, alternators, batteries, electronic controls, and steel enclosures. We design and manufacture air-cooled engines for certain of our generators up to 26kW, along with certain liquid-cooled, natural gas engines. We source engines for certain of our smaller products and all of our diesel products. For certain natural gas engines, we source the base engine block, and then add a significant amount of value engineering, sub-systems and other content to the point that we are recognized as the original equipment manufacturer (OEM) of those engines. We design and manufacture many of the alternators for our generators. We also manufacture other generator components where we believe we have a design and cost advantage. We source component parts from an extensive global network of reliable, high-quality suppliers. In some cases, these relationships are proprietary. For certain energy technology products, we source these products complete from certain contract manufacturers using our designs.\n\n\n \n\n\nThe principal sourced raw materials used in the manufacturing process are steel, copper and aluminum. We are susceptible to fluctuations in the cost of these commodities, impacting our costs of goods sold. We seek to mitigate the impact of commodity price changes on our business through a continued focus on global sourcing, product design improvements, manufacturing efficiencies, price increases and select hedging transactions. We are also impacted by foreign currency fluctuations given our global supply chain. There is typically a lag between raw material price fluctuations and their effect on our costs of goods sold.\n\n\n \n\n\nOur results are also influenced by changes in fuel prices in the form of freight rates, which in some cases are accepted by our customers and in other cases are paid by us.\n\n\n \n\n\nThe balance of cost of goods sold include our manufacturing and warehousing facilities, factory overhead, labor and shipping costs. Factory overhead includes utilities, insurance, support personnel, depreciation, general supplies, and maintenance. Although we attempt to maintain a flexible manufacturing cost structure, our margins can be impacted if we cannot timely adjust labor and manufacturing costs to match fluctuations in net sales.\n\n\n\n     \n  \n\n\n \n\n\n\n\n\n\n\n\n\n       24\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nOperating E\nxpenses\n\n\n \n\n\nOur operating expenses consist of costs incurred to support our sales, marketing, distribution, service parts, warranty, engineering, information systems, human resources, accounting, finance, risk management, legal and tax functions, among others. These expenses include, among others, personnel costs such as salaries, bonuses, employee benefit costs, payroll taxes, and share-based compensation cost, and are classified into three categories: selling and service, research and development, and general and administrative. Additionally, the amortization expense related to our finite-lived intangible assets is included within operating expenses.\n\n\n \n\n\nSelling and service.\n    Our selling and service expenses consist primarily of personnel costs, marketing expense, standard assurance warranty expense, bad debt provisions, and other sales expenses. Our personnel costs recorded in selling and services expenses include the expense of our sales force, customer support teams, outbound shipping and distribution functions, and other personnel involved in the marketing, sales and service of our products. Standard warranty expense is estimated based on historical trends or based on specific warranty matters as they become known and reasonably estimable. Our marketing expenses include media advertising, promotional expenses, co-op advertising costs, direct mail costs, printed material costs, product display costs, market research expenses, and trade show expenses. Marketing expenses are generally related to the launch of new product offerings, opportunities to create market awareness for our products, and general brand awareness marketing efforts. Our marketing campaigns are an important source for lead generation.\n\n\n \n\n\nResearch and \ndevelopment.\n    Our research and development expenses include mechanical engineering, electronics engineering, and software development costs and support numerous projects covering all of our product lines. They also support our connectivity, grid services, remote monitoring, and energy management initiatives. We operate engineering facilities with extensive capabilities at many locations around the world with a focus on new product development, existing product improvement and cost containment. We are committed to innovation, research and development and rely on a combination of patents and trademarks to establish and protect our proprietary rights. Our research and development costs are expensed as incurred.\n\n\n \n\n\nGeneral and administrative.\n    Our general and administrative expenses include personnel costs for accounting, information technology, human resources, legal, general and administrative employees; legal and professional services fees; information technology costs; insurance; travel and entertainment expense; adjustments to contingent acquisition consideration; share-based compensation costs; and other corporate expenses.\n\n\n \n\n\nAmortization of intangibles.\n    Our amortization of intangibles expense includes the straight-line amortization of finite-lived tradenames, customer lists, patents and technology, and other intangibles assets.\n\n\n \n\n\nOther \n(Expense) Income\n\n\n \n\n\nOther (expense) income includes the interest expense on our outstanding borrowings, amortization of deferred financing costs and original issue discount, credit facility commitment fees, and interest accretion on contingent acquisition consideration. Other (expense) income also includes other financial items such as losses on extinguishment of debt, investment income earned on our cash and cash equivalents, gains/losses on the sale of certain investments, and changes in the fair value of our investment in Wallbox N.V. warrants and equity securities. \n\n\n \n\n\nResults of O\nperations\n\n\n \n\n\nA detailed discussion of the year-over-year changes from the Company's fiscal 2022 results of operations to fiscal 2023 results of operations can be found in the Management's Discussion and Analysis section of the Company's fiscal 2023 Annual Report on Form 10-K filed February 21, 2024. \n\n\n \n\n\nYear ended December 31, 2024 compared to year ended December 31, 2023\n\n\n \n\n\nThe following table sets forth our consolidated statement of operations data for the periods indicated:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nNet sales\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n \n\n\n$\n\n\n273,167\n\n\n \n\n\n \n\n\n \n\n\n6.8\n\n\n%\n\n\n\n\n\n\n \nCost of goods sold\n \n\n\n \n\n\n \n\n\n2,630,208\n\n\n \n\n\n \n\n\n \n\n\n2,657,236\n\n\n \n\n\n \n\n\n \n\n\n(27,028\n\n\n)\n\n\n \n\n\n \n\n\n-1.0\n\n\n%\n\n\n\n\n\n\n \nGross profit\n \n\n\n \n\n\n \n\n\n1,665,626\n\n\n \n\n\n \n\n\n \n\n\n1,365,431\n\n\n \n\n\n \n\n\n \n\n\n300,195\n\n\n \n\n\n \n\n\n \n\n\n22.0\n\n\n%\n\n\n\n\n\n\n \nOperating expenses:\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nSelling and service\n \n\n\n \n\n\n \n\n\n526,446\n\n\n \n\n\n \n\n\n \n\n\n448,199\n\n\n \n\n\n \n\n\n \n\n\n78,247\n\n\n \n\n\n \n\n\n \n\n\n17.5\n\n\n%\n\n\n\n\n\n\n \nResearch and development\n \n\n\n \n\n\n \n\n\n219,600\n\n\n \n\n\n \n\n\n \n\n\n173,443\n\n\n \n\n\n \n\n\n \n\n\n46,157\n\n\n \n\n\n \n\n\n \n\n\n26.6\n\n\n%\n\n\n\n\n\n\n \nGeneral and administrative\n \n\n\n \n\n\n \n\n\n285,095\n\n\n \n\n\n \n\n\n \n\n\n253,396\n\n\n \n\n\n \n\n\n \n\n\n31,699\n\n\n \n\n\n \n\n\n \n\n\n12.5\n\n\n%\n\n\n\n\n\n\n \nAmortization of intangible assets\n \n\n\n \n\n\n \n\n\n97,743\n\n\n \n\n\n \n\n\n \n\n\n104,194\n\n\n \n\n\n \n\n\n \n\n\n(6,451\n\n\n)\n\n\n \n\n\n \n\n\n-6.2\n\n\n%\n\n\n\n\n\n\n \nTotal operating expenses\n \n\n\n \n\n\n \n\n\n1,128,884\n\n\n \n\n\n \n\n\n \n\n\n979,232\n\n\n \n\n\n \n\n\n \n\n\n149,652\n\n\n \n\n\n \n\n\n \n\n\n15.3\n\n\n%\n\n\n\n\n\n\n \nIncome from operations\n \n\n\n \n\n\n \n\n\n536,742\n\n\n \n\n\n \n\n\n \n\n\n386,199\n\n\n \n\n\n \n\n\n \n\n\n150,543\n\n\n \n\n\n \n\n\n \n\n\n39.0\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nTotal other expense, net\n \n\n\n \n\n\n \n\n\n(127,304\n\n\n)\n\n\n \n\n\n \n\n\n(95,899\n\n\n)\n\n\n \n\n\n \n\n\n(31,405\n\n\n)\n\n\n \n\n\n \n\n\n-32.7\n\n\n%\n\n\n\n\n\n\n \nIncome before provision for income taxes\n \n\n\n \n\n\n \n\n\n409,438\n\n\n \n\n\n \n\n\n \n\n\n290,300\n\n\n \n\n\n \n\n\n \n\n\n119,138\n\n\n \n\n\n \n\n\n \n\n\n41.0\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nProvision for income taxes\n \n\n\n \n\n\n \n\n\n92,460\n\n\n \n\n\n \n\n\n \n\n\n73,180\n\n\n \n\n\n \n\n\n \n\n\n19,280\n\n\n \n\n\n \n\n\n \n\n\n26.3\n\n\n%\n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n316,978\n\n\n \n\n\n \n\n\n \n\n\n217,120\n\n\n \n\n\n \n\n\n \n\n\n99,858\n\n\n \n\n\n \n\n\n \n\n\n46.0\n\n\n%\n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n663\n\n\n \n\n\n \n\n\n \n\n\n2,514\n\n\n \n\n\n \n\n\n \n\n\n(1,851\n\n\n)\n\n\n \n\n\n \n\n\n-73.6\n\n\n%\n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n316,315\n\n\n \n\n\n \n\n\n$\n\n\n214,606\n\n\n \n\n\n \n\n\n$\n\n\n101,709\n\n\n \n\n\n \n\n\n \n\n\n47.4\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n       25\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nThe following sets forth our reportable segment information for the periods indicated:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nNet Sales by Reportable Segment\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n3,599,149\n\n\n \n\n\n \n\n\n$\n\n\n3,276,324\n\n\n \n\n\n \n\n\n$\n\n\n322,825\n\n\n \n\n\n \n\n\n \n\n\n9.9\n\n\n%\n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n696,685\n\n\n \n\n\n \n\n\n \n\n\n746,343\n\n\n \n\n\n \n\n\n \n\n\n(49,658\n\n\n)\n\n\n \n\n\n \n\n\n-6.7\n\n\n%\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n \n\n\n$\n\n\n273,167\n\n\n \n\n\n \n\n\n \n\n\n6.8\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nTotal Sales by Reportable Segment\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31, 2024\n \n\n\n \n\n\n \n\n\n \nYear Ended December 31, 2023\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nExternal Net Sales\n \n\n\n \n\n\n \n\n\n \nIntersegment Sales\n \n\n\n \n\n\n \n\n\n \nTotal Sales\n \n\n\n \n\n\n \n\n\n \nExternal Net Sales\n \n\n\n \n\n\n \n\n\n \nIntersegment Sales\n \n\n\n \n\n\n \n\n\n \nTotal Sales\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n3,599,149\n\n\n \n\n\n \n\n\n$\n\n\n35,932\n\n\n \n\n\n \n\n\n$\n\n\n3,635,081\n\n\n \n\n\n \n\n\n$\n\n\n3,276,324\n\n\n \n\n\n \n\n\n$\n\n\n43,937\n\n\n \n\n\n \n\n\n$\n\n\n3,320,261\n\n\n \n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n696,685\n\n\n \n\n\n \n\n\n \n\n\n28,700\n\n\n \n\n\n \n\n\n \n\n\n725,385\n\n\n \n\n\n \n\n\n \n\n\n746,343\n\n\n \n\n\n \n\n\n \n\n\n91,552\n\n\n \n\n\n \n\n\n \n\n\n837,895\n\n\n \n\n\n\n\n\n\n \nIntercompany elimination\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(64,632\n\n\n)\n\n\n \n\n\n \n\n\n(64,632\n\n\n)\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(135,489\n\n\n)\n\n\n \n\n\n \n\n\n(135,489\n\n\n)\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n \n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nAdjusted EBITDA by Reportable Segment\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n693,203\n\n\n \n\n\n \n\n\n$\n\n\n523,337\n\n\n \n\n\n \n\n\n$\n\n\n169,866\n\n\n \n\n\n \n\n\n \n\n\n32.5\n\n\n%\n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n95,898\n\n\n \n\n\n \n\n\n \n\n\n114,522\n\n\n \n\n\n \n\n\n \n\n\n(18,624\n\n\n)\n\n\n \n\n\n \n\n\n-16.3\n\n\n%\n\n\n\n\n\n\n \nTotal Adjusted EBITDA\n \n\n\n \n\n\n$\n\n\n789,101\n\n\n \n\n\n \n\n\n$\n\n\n637,859\n\n\n \n\n\n \n\n\n$\n\n\n151,242\n\n\n \n\n\n \n\n\n \n\n\n23.7\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\nThe following table sets forth our net sales by product class for the periods indicated:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNet Sales by Product Class\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nResidential products\n \n\n\n \n\n\n$\n\n\n2,433,474\n\n\n \n\n\n \n\n\n$\n\n\n2,062,929\n\n\n \n\n\n \n\n\n$\n\n\n370,545\n\n\n \n\n\n \n\n\n \n\n\n18.0\n\n\n%\n\n\n\n\n\n\n \nCommercial & Industrial products\n \n\n\n \n\n\n \n\n\n1,389,469\n\n\n \n\n\n \n\n\n \n\n\n1,494,799\n\n\n \n\n\n \n\n\n \n\n\n(105,330\n\n\n)\n\n\n \n\n\n \n\n\n-7.0\n\n\n%\n\n\n\n\n\n\n \nOther\n \n\n\n \n\n\n \n\n\n472,891\n\n\n \n\n\n \n\n\n \n\n\n464,939\n\n\n \n\n\n \n\n\n \n\n\n7,952\n\n\n \n\n\n \n\n\n \n\n\n1.7\n\n\n%\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n \n\n\n$\n\n\n273,167\n\n\n \n\n\n \n\n\n \n\n\n6.8\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\nNet sales.    \nThe increase in domestic segment sales for the year ended December 31, 2024, was primarily driven by an increase in residential product sales, most notably in home standby and portable generators following the elevated power outage activity in the second half of the year. This was partially offset by a decline in C&I product sales for telecom, rental, and \"beyond standby\" applications. \n\n\n  \n\n\nThe decrease in international segment sales for the year ended December 31, 2024, was primarily driven by lower intersegment sales related to softness in the telecom market and a decline in portable generator and C&I product sales in Europe, partially offset by growth in Latin America. \n\n\n \n\n\n\n    In addition, total net sales from non-annualized acquisitions for the year ended December 31, 2024, were $16.5 million, mostly in the domestic segment. \n  \n\n\n\n     \n  \n\n\nGross profit.    \nGross profit margin for the year ended December 31, 2024, was 38.8% compared to 33.9% for the year ended December 31, 2023. The increase in gross profit margin was primarily driven by favorable sales mix, including higher home standby generator sales, the realization of lower input costs, and plant efficiencies.\n\n\n \n\n\nOperating expenses.    \nOperating expenses increased $149.7 million, or 15.3%, as compared to the prior year. The increase in operating expenses was primarily driven by higher employee and marketing costs, and increased incentive compensation and variable expenses related to higher shipment volumes and profitability. 2024 operating expenses also include $10.5 million of legal provisions and other costs related to patent and other litigation (see Note 18, “Commitments and Contingencies” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for additional information). 2023 operating expenses included a $5.8 million provision for a regulatory matter with the CPSC, $28.3 million of legal charges related to patent and other litigation (see Note 18, “Commitments and Contingencies” for additional information), $4.4 million of additional customer support costs related to a clean energy product customer that filed for bankruptcy.\n\n\n \n\n\nOther expense.    \nThe increase in other expense, net in 2024 was driven primarily by a $38.0 million expense for the change in fair value of our investment in warrants and equity securities of Wallbox N.V., and a $4.9 million loss on extinguishment of debt. This was partially offset by a $3.3 million increase in investment income driven by higher cash on hand and a $7.9 million decrease in interest expense driven by decreased borrowings and interest rates compared to the prior year comparable period.\n\n\n \n\n\nProvision for income taxes.\n    The effective income tax rates for the years ended December 31, 2024 and 2023 were 22.6% and 25.2%, respectively. The decrease in the effective tax rate was primarily due to unfavorable discrete tax items in 2023 that did not repeat in the current year, as well as favorable 2024 earnings mix with higher earnings in lower tax jurisdictions.\n\n\n \n\n\nNet income attributable to Generac Holdings Inc.\n    Net income attributable to Generac Holdings Inc. was $316.3 million as compared to $214.6 million in the prior year period. The increase was primarily driven by higher sales and gross margin, as noted above. \n\n\n \n\n\nAdjusted EBITDA.    \nAdjusted EBITDA is defined and reconciled to net income in, “Non-GAAP Measures – Adjusted EBITDA” included below in Item 7 of this Annual Report on Form 10-K. Adjusted EBITDA margins for the domestic segment for the year ended December 31, 2024, were 19.1% of domestic segment total sales compared to 15.8% for the year ended December 31, 2023. This margin improvement was primarily driven by favorable sales mix and lower input costs, partially offset by higher operating expense investments to support future growth initiatives. \n\n\n \n\n\nAdjusted EBITDA margins for the international segment, before deducting for non-controlling interests, for the year ended December 31, 2024, were 13.2% of international segment total sales compared to 13.7% in the prior year. This margin decrease was primarily due to reduced operating leverage on lower shipments during the year. \n\n\n \n\n\nAdjusted net income.    \nAdjusted Net Income is defined and reconciled to net income in, “Non-GAAP Measures – Adjusted Net Income” included below in Item 7 of this Annual Report on Form 10-K. Adjusted Net Income was $438.5 million for the year ended December 31, 2024, compared to $335.3 million for the year ended December 31, 2023, with the increase primarily due to higher net income in the current year as outlined above, together with the impact of various add-backs in the current and prior years.\n\n\n \n\n\n\n\n\n\n\n\n\n       26\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nLiquidity and Financial Position\n\n\n \n\n\nOur primary cash requirements include payment for raw materials and components, salaries and benefits, facility and lease costs, operating expenses, interest and principal payments on debt, and capital expenditures. We finance our operations primarily from cash flow generated from operations and, if necessary, borrowings under our revolving credit facility.\n\n\n \n\n\nAs of December 31, 2024, there was $498.8 million outstanding under the Tranche B Term Loan Facility, $712.5 million outstanding under the Tranche A Term Loan Facility, and no borrowings on the Revolving Facility, leaving $1,249.2 million of unused capacity, net of outstanding letters of credit. The Tranche B Term Loan Facility bears interest at the adjusted SOFR rate plus an applicable margin of 1.75%, subject to a SOFR floor of 0.0%. As of December 31, 2024, the interest rate for the Tranche B Term Loan Facility is 6.34%. The Tranche A Term Loan Facility and the Revolving Facility bear interest at a rate based on adjusted SOFR plus an applicable margin between 1.25% and 1.75%, based on the Company's total leverage ratio and subject to a SOFR floor of 0.0%. As of December 31, 2024, the interest rates for the Tranche A Term Loan Facility and Revolving Facility are 6.15% and 6.19%, respectively. See Note 5, \"Derivative Instruments and Hedging Activities\" to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K and Item 7A \"Quantitative and Qualitative Disclosures About Market Risk\" for further information on interest rate swaps, which help to reduce our borrowing costs.\n\n\n \n\n\nThe Tranche A Term Loan Facility and Revolving Facility mature on June 29, 2027. The Tranche A Term Loan Facility is repayable in installments maturing at the end of each quarter commencing September 2023, with a balloon payment due June 2027. The Tranche B Term Loan Facility matures on July 3, 2031, and is repayable in installments maturing at the end of each quarter commencing September 2024, with a balloon payment due July 2031.\n\n\n \n\n\nAs of December 31, 2024, we had total liquidity of $1,530.5 million, which consists of $281.3 million of cash and cash equivalents and $1,249.2 million available under our Revolving Facility. We believe we have a strong liquidity position that allows us to execute our strategic plan and provides flexibility to continue to invest in future growth opportunities.\n\n\n \n\n\nIn July 2022, our Board approved a stock repurchase program, which commenced on August 5, 2022, and allowed for the repurchase of up to $500.0 million of our common stock over a 24-month period. Additionally, on February 12, 2024, our Board approved a new stock repurchase program that allows for the repurchase of up to $500.0 million of our common stock over the next twenty-four months. The new program replaced the prior share repurchase program, which had approximately $26.3 million remaining available for repurchase when the new program was approved. Pursuant to the approved program, we may repurchase our common stock from time to time, in amounts and at prices we deem appropriate, subject to market conditions and other considerations. The repurchases may be executed using a combination of Rule 10b5-1 trading plans, open market purchases, privately negotiated agreements, or other transactions. The actual timing, number and value of shares repurchased under the program will be determined by management at its discretion and in compliance with the terms of our credit agreements. The repurchases may be funded with cash on hand, available borrowings, or proceeds from potential debt or other capital markets sources. The stock repurchase program may be suspended or discontinued at any time without prior notice. As of December 31, 2024, the remaining unused buyback authorization was $347,257. \n\n\n \n\n\nDuring the years ended December 31, 2024 and 2023, we repurchased 1,046,351 shares of our common stock for $152.7 million, and 2,188,475 shares for $251.5 million, respectively. We have periodically reissued shares out of Treasury stock, including for acquisition contingent consideration payments and some equity grants. \n\n\n \n\n\nWe have an arrangement with a finance company to provide floor plan financing for selected dealers. This arrangement provides liquidity for our dealers by financing dealer purchases of Generac products with credit availability from the finance company. We receive payment from the finance company after shipment of product to the dealer, and our dealers are given a longer period of time to pay the finance company. If our dealers do not pay the finance company, we may be required to repurchase the applicable inventory held by the dealer. We do not indemnify the finance company for any credit losses they may incur. Total dealer purchases financed under this arrangement accounted for approximately 13% and 12% of net sales for the years ended December 31, 2024 and 2023, respectively. The amount financed by dealers which remained outstanding was $165.4 million and $158.0 million as of December 31, 2024 and 2023, respectively.\n\n\n \n\n\nSee Note 12, “Credit Agreements,” and Note 13, “Stock Repurchase Program,” to the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K for more information on our credit agreements and stock repurchase programs. See Note 10, “Leases,” to the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K for the maturity schedule of our lease liabilities. \n\n\n \n\n\nLong-term Liquidity\n\n\n \n\n\nWe believe our cash and cash equivalents, cash flow from operations, and availability under our Revolving Facility and other short-term lines of credit will provide us with sufficient capital to continue to run our operations. We may use a portion of our cash flow for debt repayments and common stock buybacks, impacting the amount available for working capital, capital expenditures, acquisitions, and other general corporate purposes. As we continue to expand our business, we may require additional capital to fund other shareholder value enhancing activities.\n\n\n \n\n\n\n\n\n\n\n\n\n       27\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nCash F\nlow\n\n\n \n\n\nYear ended December 31, 2024 compared to year ended December 31, 2023\n\n\n \n\n\nThe following table summarizes our cash flows by source (use) for the periods presented:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nNet cash provided by operating activities\n \n\n\n \n\n\n$\n\n\n741,301\n\n\n \n\n\n \n\n\n$\n\n\n521,670\n\n\n \n\n\n \n\n\n$\n\n\n219,631\n\n\n \n\n\n \n\n\n \n\n\n42.1\n\n\n%\n\n\n\n\n\n\n \nNet cash used in investing activities\n \n\n\n \n\n\n \n\n\n(208,712\n\n\n)\n\n\n \n\n\n \n\n\n(178,063\n\n\n)\n\n\n \n\n\n \n\n\n(30,649\n\n\n)\n\n\n \n\n\n \n\n\n-17.2\n\n\n%\n\n\n\n\n\n\n \nNet cash used in financing activities\n \n\n\n \n\n\n \n\n\n(448,835\n\n\n)\n\n\n \n\n\n \n\n\n(277,137\n\n\n)\n\n\n \n\n\n \n\n\n(171,698\n\n\n)\n\n\n \n\n\n \n\n\n-62.0\n\n\n%\n\n\n\n\n\n\n \nEffect of foreign exchange rate changes on cash and cash equivalents\n \n\n\n \n\n\n \n\n\n(3,471\n\n\n)\n\n\n \n\n\n \n\n\n1,801\n\n\n \n\n\n \n\n\n \n\n\n(5,272\n\n\n)\n\n\n \n\n\n \n\n\n-292.7\n\n\n%\n\n\n\n\n\n\n \nNet increase in cash and cash equivalents\n \n\n\n \n\n\n$\n\n\n80,283\n\n\n \n\n\n \n\n\n$\n\n\n68,271\n\n\n \n\n\n \n\n\n$\n\n\n12,012\n\n\n \n\n\n \n\n\n \n\n\n17.6\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     The increase in net cash provided by operating activities was primarily driven by higher operating earnings coupled with a larger decrease in working capital in the current year period, as compared to the prior year. \n   \n\n\n\n\n \n\n\n\n\n\n     The $208.7 million net cash used in investing activities for the year ended\n    December 31, 2024 primarily represents cash payments of $136.7 million for the purchase of property and equipment (net of $11.1 million of capital expenditures in accounts payable as of December 31, 2024), $35.0 million for an incremental minority investment in Wallbox N.V., $2.8 million for a minority investment in Earth Foundry Fund, $1.6 million for a tax equity investment, and $34.7 million collectively for the acquisitions of Huntington, C&I BESS, Ageto, and Wolverine. These were partially offset by $2.0 million of cash proceeds from the sale of our minority interest in Rolling Energy Resources. \n   \n\n\n\n      \n   \n\n\n\n\n\n\n\n     The $178.1 million net cash used in investing activities for the year ended\n    December 31, 2023 primarily represents cash payments of $129.1 million for the purchase of property and equipment (net of $10.9 million of capital expenditures in accounts payable as of December 31, 2023), $30.0 million for a minority investment in Wallbox, $16.0 million for the acquisition of REFU, $6.6 million for a tax equity investment, and a $2.6 million minority investment in Rolling Energy Resources and Earth Foundry Fund. \n   \n\n\n\n      \n   \n\n\n\n     The $448.8 million net cash used in financing activities for the year ended \n    December 31, 2024 primarily represents $849.1 million of debt repayments ($54.5 million of short-term borrowings and $794.6 million of long-term borrowings and finance lease obligations), $152.7 million of stock repurchases, a $9.1 million payment for the remaining ownership interest in Captiva, $7.4 million of payments for deferred acquisition consideration, $24.8 million for taxes paid related to equity awards, and $3.6 million of payments for debt issuance costs related to our amended Tranche B Term Loan credit agreement refinancing. These uses of cash were partially offset by proceeds of $29.2 million from short-term borrowings, $541.5 million from long-term borrowings, and $27.6 million from the exercise of stock options. \n   \n\n\n\n      \n   \n\n\n\n\n\n\n\n     The $277.1 million net cash used in financing activities for the year ended\n    December 31, 2023 primarily consisted of $104.8 million in cash payments used to purchase the remaining ownership interest in Pramac, $251.5 million used for stock repurchases, $325.8 million of debt repayments ($37.1 million of short-term borrowings and $288.7 million of long-term borrowings and finance lease obligations), $10.9 million of taxes paid related to equity awards, and $5.0 million for payment of contingent acquisition consideration. These uses of cash were partially offset by proceeds of $348.8 million from long-term borrowings, $64.3 million from short-term borrowings, and $7.8 million proceeds from the exercise of employee stock options. \n   \n\n\n\n\n \n\n\nSenior Secured Credit Facilities\n\n\n \n\n\nRefer to Note 12, “Credit Agreements,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for information on our senior secured credit facilities.\n\n\n \n\n\nCovenant Compliance\n\n\n \n\n\nOur Term Loans restrict the aggregate amount of dividends and distributions that can be paid and, in certain circumstances, requires pro forma compliance with certain fixed charge coverage ratios or gross leverage ratios, as applicable, in order to pay certain dividends and distributions. Our Term Loans also contain other affirmative and negative covenants that, among other things, limit the incurrence of additional indebtedness, liens on property, sale and leaseback transactions, investments, loans and advances, mergers or consolidations, asset sales, acquisitions, transactions with affiliates, prepayments of certain other indebtedness, and modifications of our organizational documents. The Tranche A Term Loan Facility and the Revolving Facility contain certain financial covenants that require the Company to maintain a total leverage ratio below 3.75 to 1.00, an interest coverage ratio above 3.00 to 1.00, and may require an excess cash flow payment. As of December 31, 2024, the Company’s total leverage ratio was 1.33 to 1.00, and the Company's interest coverage ratio was 10.03 to 1.00. The Company was not required to make an excess cash flow payment as of December 31, 2024. The Company was also in compliance with all other covenants of the Amended Credit Agreement as of December 31, 2024.\n\n\n \n\n\nOur Term Loans contain customary events of default, including, among others, nonpayment of principal, interest or other amounts, failure to perform covenants, inaccuracy of representations or warranties in any material respect, cross-defaults with other material indebtedness, certain undischarged judgments, the occurrence of certain ERISA, bankruptcy or insolvency events, or the occurrence of a change in control (as defined in the Amended Credit Agreement). A bankruptcy or insolvency event of default will cause the obligations under the Term Loans to automatically become immediately due and payable.\n\n\n \n\n\nThe Revolving Facility also contains covenants and events of default substantially similar to those in the Term Loans, as described above. \n\n\n\n\n\n\n \n\n\nCapital Expenditures\n\n\n \n\n\nOur operations require capital expenditures for facilities and related improvements, technology, research & development, tooling, equipment, capacity expansion, internal use software, IT systems & infrastructure, and upgrades. Capital expenditures were $136.7 million, $129.1 million, and $86.2 million in the years ended December 31, 2024, 2023 and 2022, respectively, and were funded primarily through cash from operations. \n\n\n \n\n\n\n\n\n\n\n\n\n       28\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nCritical Accounting P\nolicies and Estimates\n\n\n \n\n\nIn preparing the financial statements, management is required to make estimates and assumptions that have an impact on the asset, liability, revenue and expense amounts reported. These estimates can also affect our supplemental information disclosures, including information about contingencies, risk and financial condition. We believe, given current facts and circumstances, that our estimates and assumptions are reasonable, adhere to U.S. GAAP, and are consistently applied. Inherent in the nature of an estimate or assumption is the fact that actual results may differ from estimates and estimates may vary as new facts and circumstances arise. We make routine estimates and judgments in determining net realizable value of accounts receivable, inventories, property and equipment, prepaid expenses, product warranties and other reserves. Management believes our most critical accounting estimates and assumptions are in the following areas: goodwill and other indefinite-lived intangible asset impairment assessment; and income taxes. The following is a discussion of critical accounting estimates in each of these areas. \n\n\n \n\n\nGoodwill and Other \nIndefinite-Lived \nI\nntangible\n A\nssets\n\n\n \n\n\nWhen preparing a discounted cash flow analysis for purposes of our annual impairment test, we make a number of key estimates and assumptions. We estimate the future cash flows of the business based on historical and forecasted revenues and operating costs. In addition, we apply a discount rate to the estimated future cash flows for the purpose of the valuation. This discount rate is based on the estimated weighted average cost of capital for the business and may change from year to year. Weighted average cost of capital includes certain assumptions such as market capital structures, market betas, risk-free rate of return and estimated costs of borrowing.\n\n\n \n\n\nFor all reporting units, a considerable amount of management judgment and assumptions are required in performing the goodwill and indefinite-lived intangible asset impairment tests. While we believe our judgments and assumptions are reasonable, different assumptions could change the estimated fair values. A number of factors, many of which we have no ability to control, could cause actual results to differ from the estimates and assumptions we employed. These factors include:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n●\n\n\na rising interest rate environment;\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \na prolonged global or regional economic downturn;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \na significant decrease in the demand for our products;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nthe inability to develop new and enhanced products and services in a timely manner;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \na significant adverse change in legal factors, the business climate, or regulatory environment;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nan adverse action or assessment by a regulator;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nsuccessful efforts by our competitors to gain market share in our markets;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \ndisruptions to the Company’s business;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \ninability to effectively integrate acquired businesses;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n●\n\n\nloss of key management and employees\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nunexpected or unplanned changes in the use of assets or entity structure; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nbusiness divestitures.\n \n\n\n\n\n\n\n\n\n \n\n\nIf management's estimates of future operating results change or if there are changes to other assumptions due to these factors, the estimate of the fair values may change significantly. Such change could result in impairment charges in future periods, which could have a significant impact on our operating results and financial condition. We performed the required annual impairment tests for goodwill and other indefinite-lived intangible assets for the fiscal years 2024, 2023 and 2022, and found no impairment.\n\n\n \n\n\nRefer to Note 2, “Summary of Accounting Policies – Goodwill and Other Indefinite-Lived Intangible Assets,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for further information on the Company’s policy regarding the accounting for goodwill and other indefinite-lived intangible assets.\n\n\n \n\n\nIncome T\naxes\n\n\n \n\n\nWe account for income taxes in accordance with Accounting Standards Codification (ASC) 740, \nIncome Taxes\n. Our estimates of income taxes payable, deferred income taxes and the effective tax rate are based on an analysis of many factors including interpretations of federal, state and international income tax laws; the difference between tax and financial reporting bases of assets and liabilities; estimates of amounts currently due or owed in various jurisdictions; and current accounting standards. We review and update our estimates on a quarterly basis as facts and circumstances change and actual results are known. In assessing the net realizable value of the deferred tax assets on our balance sheet, we consider whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent on the generation of future taxable income during the years in which those temporary differences become deductible. We consider the taxable income in prior carryback years, scheduled reversal of deferred tax liabilities, projected future taxable income and tax planning strategies in making this assessment.\n\n\n \n\n\nRefer to Note 15, “Income Taxes,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for further information on the Company’s income taxes and income tax positions.\n\n\n \n\n\nNew Accounting Standards\n\n\n \n\n\nFor information on new accounting pronouncements and the impact of these pronouncements on our consolidated financial statements, refer to Note 2, “Summary of Accounting Policies - New Accounting Pronouncements,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K.\n\n\n \n\n\n\n\n\n\n\n\n\n       29\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nNon-GAAP Measures\n\n\n \n\n\nAdjusted EBITDA\n\n\n \n\n\nTo supplement our consolidated financial statements presented in accordance with U.S. GAAP, the Company provides the computation of Adjusted EBITDA attributable to the Company, which is defined as net income before noncontrolling interests adjusted for the following items: interest expense, depreciation expense, amortization of intangible assets, income tax expense, certain non-cash gains and losses including certain purchase accounting adjustments and contingent consideration adjustments, share-based compensation expense, certain transaction costs and credit facility fees, business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, mark-to-market gains and losses on a minority investment, and Adjusted EBITDA attributable to noncontrolling interests. The provision for legal and regulatory charges adjusts for matters that are significant and not part of the ordinary routine litigation or regulatory matters incidental to the Company’s business, such as large suits and settlements, class action lawsuits, government inquiries, and certain intellectual property litigation. The adjustments to net income in computing Adjusted EBITDA are set forth in the reconciliation table below. The computation of Adjusted EBITDA is based primarily on the definition included in our Amended Credit Agreement.\n\n\n\n     \n  \n\n\nWe view Adjusted EBITDA as a key measure of our performance. We present Adjusted EBITDA not only due to its importance for purposes of our credit agreements, but also because it assists us in comparing our performance across reporting periods on a consistent basis as it excludes certain items that we do not believe are indicative of our core operating performance. Our management uses Adjusted EBITDA:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nfor planning purposes, including the preparation of our annual operating budget and developing and refining our internal projections for future periods;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nto allocate resources to enhance the financial performance of our business;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nas a target for the determination of the bonus component of compensation for our senior executives under our management incentive plan, as described further in our Proxy Statement;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nto evaluate the effectiveness of our business strategies and as a supplemental tool in evaluating our performance against our budget for each period; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nin communications with our Board and investors concerning our financial performance.\n \n\n\n\n\n\n\n\n\n \n\n\nWe believe Adjusted EBITDA is used by securities analysts, investors and other interested parties in the evaluation of the Company. Management believes the disclosure of Adjusted EBITDA offers an additional financial metric that, when coupled with results prepared in accordance with U.S. generally accepted accounting principles (U.S. GAAP) and the reconciliation to U.S. GAAP results, provides a more complete understanding of our results of operations and the factors and trends affecting our business. We believe Adjusted EBITDA is useful to investors for the following reasons:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nAdjusted EBITDA and similar non-GAAP measures are widely used by investors to measure a company's operating performance without regard to items that can vary substantially from company to company depending upon financing and accounting methods, book values of assets, tax jurisdictions, capital structures and the methods by which assets were acquired;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \ninvestors can use Adjusted EBITDA as a supplemental measure to evaluate the overall operating performance of our Company, including our ability to service our debt and other cash needs; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nby comparing our Adjusted EBITDA in different historical periods, our investors can evaluate our operating performance excluding the impact of items described below.\n \n\n\n\n\n\n\n\n\n \n\n\nThe adjustments included in the reconciliation table listed below are presented to illustrate the operating performance of our business in a manner consistent with the presentation used by our management and Board. These adjustments eliminate the impact of a number of items that:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nwe do not consider indicative of our ongoing operating performance, such as non-cash write-downs and other charges, non-cash gains, write-offs relating to the retirement of debt, severance costs and other restructuring-related business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, and mark-to-market gains and losses on a minority investment;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nwe believe to be akin to, or associated with, interest expense, such as administrative agent fees, revolving credit facility commitment fees and letter of credit fees; or\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nare non-cash in nature, such as share-based compensation expense.\n \n\n\n\n\n\n\n\n\n \n\n\nWe explain in more detail in footnotes (a) through (g) below why we believe these adjustments are useful in calculating Adjusted EBITDA as a measure of our operating performance.\n\n\n \n\n\nAdjusted EBITDA does not represent, and should not be a substitute for, net income or cash flows from operations as determined in accordance with U.S. GAAP. Adjusted EBITDA has limitations as an analytical tool, and you should not consider it in isolation, or as a substitute for analysis of our results as reported under U.S. GAAP. Some of the limitations are:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nAdjusted EBITDA does not reflect our cash expenditures, or future requirements for capital expenditures or contractual commitments;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nAdjusted EBITDA does not reflect changes in, or cash requirements for, our working capital needs;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nAdjusted EBITDA does not reflect the significant interest expense, or the cash requirements necessary to service interest or principal payments on our debt;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nalthough depreciation and amortization are non-cash charges, the assets being depreciated and amortized will often have to be replaced in the future, and Adjusted EBITDA does not reflect any cash requirements for such replacements;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nseveral of the adjustments that we use in calculating Adjusted EBITDA, such as non-cash write-downs and other charges, while not involving cash expense, do have a negative impact on the value of our assets as reflected in our consolidated balance sheet prepared in accordance with U.S. GAAP; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nother companies may calculate Adjusted EBITDA differently than we do, limiting its usefulness as a comparative measure.\n \n\n\n\n\n\n\n\n\n \n\n\nFurthermore, as noted above, one of our uses of Adjusted EBITDA is as a target for determining elements of compensation for our senior executives. At the same time, some or all of these senior executives have responsibility for monitoring our financial results, generally including the adjustments in calculating Adjusted EBITDA (subject ultimately to review by our Board in the context of the Board's review of our financial statements). While many of the adjustments (for example, transaction costs and credit facility fees), involve mathematical application of items reflected in our financial statements, others involve a degree of judgment and discretion. While we believe all of these adjustments are appropriate, and while the calculations are subject to review by our Board in the context of the Board's review of our financial statements, and certification by our Chief Financial Officer in a compliance certificate provided to the lenders under our Amended Credit Agreement, this discretion may be viewed as an additional limitation on the use of Adjusted EBITDA as an analytical tool.\n\n\n \n\n\nBecause of these limitations, Adjusted EBITDA should not be considered as a measure of discretionary cash available to us to invest in the growth of our business. We compensate for these limitations by relying primarily on our U.S. GAAP results and using Adjusted EBITDA only supplementally.\n\n\n \n\n\n\n\n\n\n\n\n\n       30\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nThe following table presents a reconciliation of net income to Adjusted EBITDA attributable to Generac Holdings Inc.:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n2022\n \n\n\n \n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n316,315\n\n\n \n\n\n \n\n\n$\n\n\n214,606\n\n\n \n\n\n \n\n\n$\n\n\n399,502\n\n\n \n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n663\n\n\n \n\n\n \n\n\n \n\n\n2,514\n\n\n \n\n\n \n\n\n \n\n\n9,368\n\n\n \n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n316,978\n\n\n \n\n\n \n\n\n \n\n\n217,120\n\n\n \n\n\n \n\n\n \n\n\n408,870\n\n\n \n\n\n\n\n\n\n \nInterest expense\n \n\n\n \n\n\n \n\n\n89,713\n\n\n \n\n\n \n\n\n \n\n\n97,627\n\n\n \n\n\n \n\n\n \n\n\n54,826\n\n\n \n\n\n\n\n\n\n \nDepreciation and amortization\n \n\n\n \n\n\n \n\n\n171,768\n\n\n \n\n\n \n\n\n \n\n\n166,602\n\n\n \n\n\n \n\n\n \n\n\n156,141\n\n\n \n\n\n\n\n\n\n \nProvision for income taxes\n \n\n\n \n\n\n \n\n\n92,460\n\n\n \n\n\n \n\n\n \n\n\n73,180\n\n\n \n\n\n \n\n\n \n\n\n99,596\n\n\n \n\n\n\n\n\n\n \nNon-cash write-down and other adjustments (a)\n \n\n\n \n\n\n \n\n\n4,757\n\n\n \n\n\n \n\n\n \n\n\n(5,953\n\n\n)\n\n\n \n\n\n \n\n\n(2,091\n\n\n)\n\n\n\n\n\n\n \nNon-cash share-based compensation expense (b)\n \n\n\n \n\n\n \n\n\n49,248\n\n\n \n\n\n \n\n\n \n\n\n35,492\n\n\n \n\n\n \n\n\n \n\n\n29,481\n\n\n \n\n\n\n\n\n\n \nTransaction costs and credit facility fees (c)\n \n\n\n \n\n\n \n\n\n5,097\n\n\n \n\n\n \n\n\n \n\n\n4,054\n\n\n \n\n\n \n\n\n \n\n\n5,026\n\n\n \n\n\n\n\n\n\n \nBusiness optimization and other charges (d)\n \n\n\n \n\n\n \n\n\n4,752\n\n\n \n\n\n \n\n\n \n\n\n10,551\n\n\n \n\n\n \n\n\n \n\n\n4,371\n\n\n \n\n\n\n\n\n\n \nProvision for legal, regulatory, and clean energy product charges (e)\n \n\n\n \n\n\n \n\n\n10,931\n\n\n \n\n\n \n\n\n \n\n\n38,490\n\n\n \n\n\n \n\n\n \n\n\n65,265\n\n\n \n\n\n\n\n\n\n \nChange in fair value of investment (f)\n \n\n\n \n\n\n \n\n\n38,006\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n\n\n\n\n \nLoss on extinguishment of debt (g)\n \n\n\n \n\n\n \n\n\n4,861\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n3,743\n\n\n \n\n\n\n\n\n\n \nOther\n \n\n\n \n\n\n \n\n\n530\n\n\n \n\n\n \n\n\n \n\n\n696\n\n\n \n\n\n \n\n\n \n\n\n139\n\n\n \n\n\n\n\n\n\n \nAdjusted EBITDA\n \n\n\n \n\n\n \n\n\n789,101\n\n\n \n\n\n \n\n\n \n\n\n637,859\n\n\n \n\n\n \n\n\n \n\n\n825,367\n\n\n \n\n\n\n\n\n\n \nAdjusted EBITDA attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n1,175\n\n\n \n\n\n \n\n\n \n\n\n4,687\n\n\n \n\n\n \n\n\n \n\n\n15,087\n\n\n \n\n\n\n\n\n\n \nAdjusted EBITDA attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n787,926\n\n\n \n\n\n \n\n\n$\n\n\n633,172\n\n\n \n\n\n \n\n\n$\n\n\n810,280\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n(a) Represents the following non-cash charges, gains, and other adjustments: (gains)/losses on the disposition of assets other than in the ordinary course of business, (gains)/losses on sales of certain investments, unrealized mark-to-market adjustments on commodity contracts, certain foreign currency related adjustments, and certain purchase accounting and contingent consideration adjustments. We believe that adjusting net income for these items is useful for the following reasons:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nThe gains/losses on disposition of assets other than in the ordinary course of business and sales of certain investments result from the sale of assets that are no longer useful in our business and therefore represent gains or losses that are not from our core operations;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nThe adjustments for unrealized mark-to-market gains and losses on commodity contracts represent non-cash items to reflect changes in the fair value of forward contracts that have not been settled or terminated. We believe it is useful to adjust net income for these items because the charges do not represent a cash outlay in the period in which the charge is incurred, although Adjusted EBITDA must always be used together with our U.S. GAAP statements of comprehensive income and cash flows to capture the full effect of these contracts on our operating performance;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nThe purchase accounting adjustments represent non-cash items to reflect fair value of certain assets at the date of acquisition, and therefore do not reflect our ongoing operations. Fair value adjustments to contingent consideration obligations related to business acquisitions are added back as they are akin to purchase price. \n \n\n\n\n\n\n\n\n\n \n\n\n(b) Represents share-based compensation expense to account for stock options, restricted stock, and other stock awards over their respective vesting period.\n\n\n \n\n\n(c) Represents transaction costs incurred directly in connection with any investment, as defined in our credit agreement, equity issuance or debt issuance or refinancing, together with certain fees relating to our senior secured credit facilities, such as administrative agent fees and credit facility commitment fees under our Amended Credit Agreement.\n\n\n \n\n\n(d) Represents severance and other restructuring charges related to the consolidation of certain operating facilities and organizational functions.\n\n\n \n\n\n(e) Represents the following litigation, regulatory, and other matters that are not indicative of our ongoing operations:\n\n\n   •  A provision for judgments, settlements, and legal expenses related to certain patent lawsuits - $9.2 million in 2024; $27.3 million in 2023. \n    •  Legal expenses related to certain class action lawsuits - $1.3 million in 2024; $1.0 million in 2023. \n    •  A bad debt provision and additional customer support costs related to a clean energy product customer that filed for bankruptcy in 2022 – $0.4 million additional customer support costs in 2024; $4.4 million additional customer support costs in 2023; $17.9 million bad debt provision in 2022. \n    •  A provision for a matter with the CPSC concerning the imposition of civil fines for allegedly failing to timely submit a report under the Consumer Product Safety Act (CPSA) in relation to certain portable generators that were subject to a voluntary recall previously announced on July 29, 2021 - $5.8 million in 2023; $10.0 million in 2022. \n\n\n   •  A warranty provision to address certain clean energy product warranty-related matters - $37.3 million in 2022.\n\n\n \n\n\n(f) Represents non-cash losses from changes in the fair value of the Company's investment in Wallbox N.V. warrants and equity securities.\n\n\n \n\n\n(g) Represents fees paid to creditors and the write-off of the unamortized original issue discount and deferred financing costs in connection with the 2024 and 2022 credit agreement refinancings. Refer to Note 12, “Credit Agreements,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for further information on the losses on extinguishment of debt.\n\n\n \n\n\n\n\n\n\n\n\n\n       31\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nAdjusted Net Income\n\n\n \n\n\nTo further supplement our consolidated financial statements in accordance with U.S. GAAP, we provide the computation of Adjusted Net Income attributable to the Company, which is defined as net income before noncontrolling interests adjusted for the following items: amortization of intangible assets, amortization of deferred financing costs and original issue discount related to the Company's debt, intangible impairment charges, certain transaction costs and other purchase accounting adjustments, business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, mark-to-market gains and losses on a minority investment, other non-cash gains and losses, and adjusted net income attributable to non-controlling interests, as set forth in the reconciliation table below.\n\n\n \n\n\nWe believe Adjusted Net Income is used by securities analysts, investors and other interested parties in the evaluation of our company’s operations. Management believes the disclosure of Adjusted Net Income offers an additional financial metric that, when used in conjunction with U.S. GAAP results and the reconciliation to U.S. GAAP results, provides a more complete understanding of our ongoing results of operations, and the factors and trends affecting our business.\n\n\n \n\n\nThe adjustments included in the reconciliation table listed below are presented to illustrate the operating performance of our business in a manner consistent with the presentation used by investors and securities analysts. Similar to the Adjusted EBITDA reconciliation, these adjustments eliminate the impact of a number of items we do not consider indicative of our ongoing operating performance or cash flows, such as amortization costs, transaction costs and write-offs relating to the retirement of debt. \n\n\n \n\n\nSimilar to Adjusted EBITDA, Adjusted Net Income does not represent, and should not be a substitute for, net income or cash flows from operations as determined in accordance with U.S. GAAP. Adjusted Net Income has limitations as an analytical tool, and you should not consider it in isolation, or as a substitute for analysis of our results as reported under U.S. GAAP. Some of the limitations are:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nAdjusted Net Income does not reflect changes in, or cash requirements for, our working capital needs;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nalthough amortization is a non-cash charge, the assets being amortized may have to be replaced in the future, and Adjusted Net Income does not reflect any cash requirements for such replacements; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nother companies may calculate Adjusted Net Income differently than we do, limiting its usefulness as a comparative measure.\n \n\n\n\n\n\n\n\n\n \n\n\nThe following table presents a reconciliation of net income to Adjusted Net Income attributable to Generac Holdings Inc.:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n2022\n \n\n\n \n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n316,315\n\n\n \n\n\n \n\n\n$\n\n\n214,606\n\n\n \n\n\n \n\n\n$\n\n\n399,502\n\n\n \n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n663\n\n\n \n\n\n \n\n\n \n\n\n2,514\n\n\n \n\n\n \n\n\n \n\n\n9,368\n\n\n \n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n316,978\n\n\n \n\n\n \n\n\n \n\n\n217,120\n\n\n \n\n\n \n\n\n \n\n\n408,870\n\n\n \n\n\n\n\n\n\n \nAmortization of intangible assets\n \n\n\n \n\n\n \n\n\n97,743\n\n\n \n\n\n \n\n\n \n\n\n104,194\n\n\n \n\n\n \n\n\n \n\n\n103,320\n\n\n \n\n\n\n\n\n\n \nAmortization of deferred financing costs and original issue discount\n \n\n\n \n\n\n \n\n\n3,242\n\n\n \n\n\n \n\n\n \n\n\n3,885\n\n\n \n\n\n \n\n\n \n\n\n3,234\n\n\n \n\n\n\n\n\n\n \nTransaction costs and other purchase accounting adjustments (a)\n \n\n\n \n\n\n \n\n\n2,717\n\n\n \n\n\n \n\n\n \n\n\n2,089\n\n\n \n\n\n \n\n\n \n\n\n3,588\n\n\n \n\n\n\n\n\n\n \nLoss/(gain) attributable to business or asset dispositions (b)\n \n\n\n \n\n\n \n\n\n65\n\n\n \n\n\n \n\n\n \n\n\n(119\n\n\n)\n\n\n \n\n\n \n\n\n(229\n\n\n)\n\n\n\n\n\n\n \nBusiness optimization and other charges (c)\n \n\n\n \n\n\n \n\n\n4,752\n\n\n \n\n\n \n\n\n \n\n\n10,551\n\n\n \n\n\n \n\n\n \n\n\n4,371\n\n\n \n\n\n\n\n\n\n \nProvision for legal, regulatory, and clean energy product charges (c)\n \n\n\n \n\n\n \n\n\n10,931\n\n\n \n\n\n \n\n\n \n\n\n38,490\n\n\n \n\n\n \n\n\n \n\n\n65,265\n\n\n \n\n\n\n\n\n\n \nChange in fair value of investment (c)\n \n\n\n \n\n\n \n\n\n38,006\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n\n\n\n\n \nLoss on extinguishment of debt (c)\n \n\n\n \n\n\n \n\n\n4,861\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n3,743\n\n\n \n\n\n\n\n\n\n \nTax effect of add backs\n \n\n\n \n\n\n \n\n\n(40,173\n\n\n)\n\n\n \n\n\n \n\n\n(38,384\n\n\n)\n\n\n \n\n\n \n\n\n(43,638\n\n\n)\n\n\n\n\n\n\n \nAdjusted net income\n \n\n\n \n\n\n \n\n\n439,122\n\n\n \n\n\n \n\n\n \n\n\n337,826\n\n\n \n\n\n \n\n\n \n\n\n548,524\n\n\n \n\n\n\n\n\n\n \nAdjusted net income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n663\n\n\n \n\n\n \n\n\n \n\n\n2,514\n\n\n \n\n\n \n\n\n \n\n\n9,675\n\n\n \n\n\n\n\n\n\n \nAdjusted net income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n438,459\n\n\n \n\n\n \n\n\n$\n\n\n335,312\n\n\n \n\n\n \n\n\n$\n\n\n538,849\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n(a) Represents transaction costs incurred directly in connection with any investment, as defined in our credit agreement, equity issuance or debt issuance or refinancing, and certain purchase accounting and contingent consideration adjustments.\n\n\n \n\n\n(b) Represents losses/(gains) attributable to the disposition of a business or assets occurring in other than ordinary course, as defined in our credit agreement.\n\n\n \n\n\n(c) See reconciliation of net income to Adjusted EBITDA attributable to Generac Holdings Inc. above. \n\n\n \n\n\n\n\n\n\n\n\n\n       32\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents",
  "item2": null
}