{
  "source_file": "goog-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together with \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes included under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments, Google Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further details on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\n \nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. For additional information on how we recognize revenue, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our Business and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, fluctuations in our revenues have been and may continue to be affected by a combination of factors, including:\n•\nchanges in foreign currency exchange rates;\n•\nchanges in pricing, such as those resulting from changes in fee structures, discounts, and customer incentives;\n•\ngeneral economic conditions and various external dynamics, including geopolitical events, regulations, and other measures and their effect on advertiser, consumer, and enterprise spending; \n•\nnew product, service, and market launches; and\n•\nseasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources (\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to be, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and devices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following: \n•\nGoogle Search & other, which includes revenues generated on Google search properties (including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and Google Play;\n•\nYouTube ads, which includes revenues generated on YouTube properties; and\n•\nGoogle Network, which includes revenues generated on Google Network properties participating in AdMob, AdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our advertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while impressions and cost-per-impression pertain to traffic on our Google Network properties.\n36\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google search properties and other Google owned and operated properties including Gmail, Google Maps, and Google Play. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users.\nImpressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users.\nAs our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity.\nFluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been, and may continue to be, affected by factors in addition to the general factors described above, such as:\n•\nadvertiser competition for keywords;\n•\nchanges in advertising quality, formats, delivery, or policy;\n•\nchanges in device mix;\n•\nseasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and\n•\ntraffic growth in emerging markets compared to more mature markets and across various verticals and channels.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues are comprised of the following:\n•\nconsumer subscriptions, which primarily include revenues from YouTube services, such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\n•\nplatforms, which primarily include revenues from Google Play sales of apps and in-app purchases;\n•\ndevices, which primarily include sales of the Pixel family of devices; and\n•\nother products and services.\nFluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand, number of subscribers, and the timing of product launches.\nGoogle Cloud\nGoogle Cloud revenues are comprised of the following:\n•\nGoogle Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure, platform, and other services. These services provide access to solutions such as AI offerings including our AI infrastructure, Vertex AI platform, and Gemini Enterprise: cybersecurity; and data and analytics;\n•\nGoogle Workspace, which includes subscriptions for cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Gemini for Google Workspace; and \n•\nother enterprise services.\nFluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand.\nOther Bets\nRevenues from Other Bets are generated primarily from the sale of autonomous transportation services, healthcare-related services, and internet services.\n37\nCosts and Expenses\nOur cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount due to factors such as annual SBC awards that generally vest over four years.\nCost of Revenues\nCost of revenues is comprised of TAC and other costs of revenues.\n•\nTAC includes: \n◦\namounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and\n◦\namounts paid to Google Network partners primarily for ads displayed on their properties.\n•\nOther cost of revenues primarily includes:\n◦\ncontent acquisition costs, which are payments to content providers from whom we license video and other content for distribution, primarily related to YouTube (we pay fees to these content providers based on revenues generated, subscriber counts, or a flat fee);\n◦\ndepreciation expense related to our technical infrastructure;\n◦\nemployee compensation expenses related to our technical infrastructure and other operations such as content review and customer and product support;\n◦\ninventory and other costs related to the devices we sell; and\n◦\nother technical infrastructure operations costs, including network capacity, energy, and equipment costs.\nTAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners.\nOperating Expenses\nOperating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative.\nThe main components of our R&D expenses are:\n•\ndepreciation;\n•\nemployee compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; and\n•\nthird-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts.\nThe main components of our sales and marketing expenses are:\n•\nemployee compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and\n•\nspend relating to our advertising and promotional activities in support of our products and services.\nThe main components of our general and administrative expenses are:\n•\nemployee compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; \n•\nexpenses relating to legal and other matters, including certain fines and settlements; and \n38\n•\nthird-party services fees, including audit, consulting, outside legal, and other outsourced administrative services.\nOther Income (Expense), Net \nOI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments.\nFor additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosur\nes About Market Risk” in our An\nnual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nProvision for Income Taxes\n \nProvision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties.\nFor additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 \nin our An\nnual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nExecutive Overview\nThe following table summarizes consolidated financial results (in millions, except per share information and percentages):\nThree Months Ended\nSeptember 30,\n2024\n2025\n$ Change\n% Change\nConsolidated revenues\n$\n88,268 \n$\n102,346 \n$\n14,078 \n16 \n%\nChange in consolidated constant currency revenues\n(1)\n15 \n%\nCost of revenues\n$\n36,474 \n$\n41,369 \n$\n4,895 \n13 \n%\nOperating expenses\n$\n23,273 \n$\n29,749 \n$\n6,476 \n28 \n%\nOperating income\n$\n28,521 \n$\n31,228 \n$\n2,707 \n9 \n%\nOperating margin\n32 \n%\n31 \n%\n(1)\n%\nOther income (expense), net\n$\n3,185 \n$\n12,759 \n$\n9,574 \n301 \n%\nNet income\n$\n26,301 \n$\n34,979 \n$\n8,678 \n33 \n%\nDiluted EPS\n \n(2)\n$\n2.12 \n$\n2.87 \n$\n0.75 \n35 \n%\n(1)\n    See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency information. \n(2)    \nFor additional information on the calculation of diluted EPS, see Note 12 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\n•\nRevenues were $102.3 billion, an increase of 16% year over year, primarily driven by an increase in Google Services revenues of $10.5 billion, or 14%, and an increase in Google Cloud revenues of $3.8 billion, or 34%.\n•\nTotal constant currency revenues, which exclude the effect of hedging,\n increased 15% y\near over year.\n•\nCost of revenues was $41.4 billion, an increase of 13% year over year, primarily driven by increases in content acquisition costs, TAC, depreciation expense, and other technical infrastructure operations costs. \n39\n•\nOperating expenses were $29.7 billion, an increase of 28% year over year, primarily driven by increases in expenses related to legal and other matters, employee compensation expenses, and depreciation expense.\nOther Information:\n•\nOn September 5, 2025, the EC announced its decision that Google had infringed European competition laws. The EC decision imposed a $3.5 billion fine which we accrued in general and administrative expenses in our Google Services segment for the three months ended September 30, 2025.\n•\nOI&E of $12.8 billion for the three months ended September 30, 2025 included net gains on equity securities of $10.7 billion, primarily related to unrealized gains on our non-marketable equity securities.\n•\nChanges to U.S. tax law enacted on July 4, 2025, allow, among other things, for immediate expensing of domestic research and experimentation costs and accelerated depreciation on eligible capital expenditures, the effects of which are included in operating cash flows for the three months ended September 30, 2025.\n•\nRepurchases of Class A and Class C shares were $926 million and $10.6 billion, respectively, totaling $11.6 billion for the three months ended September 30, 2025.\n•\nOperating cash flow was $48.4 billion for the three months ended September 30, 2025.\n•\nCapital expenditures, which primarily reflected investments in technical infrastructure, were $24.0 billion for the three months ended September 30, 2025.\n•\nAs of September 30, 2025, we had 190,167 employees.\nWe are monitoring ongoing developments surrounding international trade and the macroeconomic environment. As a result of volatility in international trade and financial markets, we may experience direct and indirect effects on our business, operations, and financial results. Our past results may not be indicative of our future performance, and our financial results may differ materially from historical trends.\nFinancial Results\nRevenues\nThe following table presents revenues by type (in millions): \n \nThree Months Ended\nNine Months Ended \nSeptember 30,\nSeptember 30,\n \n2024\n2025\n2024\n2025\nGoogle Search & other\n$\n49,385 \n$\n56,567 \n$\n144,050 \n$\n161,459 \nYouTube ads\n8,921 \n10,261 \n25,674 \n28,984 \nGoogle Network\n7,548 \n7,354 \n22,405 \n21,964 \nGoogle advertising\n65,854 \n74,182 \n192,129 \n212,407 \nGoogle subscriptions, platforms, and devices\n10,656 \n12,870 \n28,707 \n34,452 \nGoogle Services total\n76,510 \n87,052 \n220,836 \n246,859 \nGoogle Cloud\n11,353 \n15,157 \n31,274 \n41,041 \nOther Bets\n388 \n344 \n1,248 \n1,167 \nHedging gains (losses)\n17 \n(207)\n191 \n(60)\nTotal revenues\n$\n88,268 \n$\n102,346 \n$\n253,549 \n$\n289,007 \nGoogle Services\nGoogle advertising revenues\nGoogle Search & other\nGoogle Search & other revenues increased $7.2 billion and $17.4 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery.\n40\nYouTube ads\nYouTube ads revenues increased $1.3 billion and $3.3 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025. The growth was driven by our direct response advertising products followed by our brand advertising products, both of which benefited from increased spending by our advertisers.\nGoogle Network\nGoogle Network revenues decreased $194 million from the three months ended September 30, 2024 to the three months ended September 30, 2025, primarily due to a decrease in AdSense, partially offset by an increase in AdMob revenues.\nGoogle Network revenues decreased $441 million from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily due to a decrease in AdSense and Google Ad Manager revenues. \nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks and cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a percentage, from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025:\nThree Months Ended\nNine Months Ended\nSeptember 30, 2025\nSeptember 30, 2025\nGoogle Search & other\nPaid clicks change\n7 \n%\n4 \n%\nCost-per-click change\n7 \n%\n7 \n%\nGoogle Network\nImpressions change\n(5)\n%\n(5)\n%\nCost-per-impression change\n6 \n%\n6 \n%\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in advertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search queries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix, property mix, and changes in foreign currency exchange rates.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenu\nes\n increased $2.2 billion and $5.7 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025. The growth was primarily driven by an increase in subscriptions revenues. This increase was primarily due to the contribution from growth in paid subscriptions across both YouTube services and Google One.\nGoogle Cloud\nGoogle Cloud revenues increased $3.8 billion and $9.8 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025 primarily driven by growth in Google Cloud Platform largely from infrastructure services.\n41\nRevenues by Geography\nThe following table presents revenues by geography as a percentage of revenues, determined based on the addresses of our customers:\nThree Months Ended\nNine Months Ended \n \nSeptember 30,\nSeptember 30,\n \n2024\n2025\n2024\n2025\nUnited States\n49 \n%\n48 \n%\n49 \n%\n48 \n%\nEMEA\n29 \n%\n29 \n%\n29 \n%\n29 \n%\nAPAC\n16 \n%\n17 \n%\n16 \n%\n17 \n%\nOther Americas\n6 \n%\n6 \n%\n6 \n%\n6 \n%\nHedging gains (losses)\n0 \n%\n0 \n%\n0 \n%\n0 \n%\nFor additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nUse of Non-GAAP Constant Currency Information\nInternational revenues, which represent a significant portion of our revenues, are generally transacted in multiple currencies and therefore are affected by fluctuations in foreign currency exchange rates.\nThe effect of currency exchange rates on our business is an important factor in understanding period-to-period comparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP percentage change in constant currency revenues (\"percentage change in constant currency revenues\") for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results.\nConstant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period.\nConstant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods.\nThese results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP.\n42\nTh\ne following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages):\nThree Months Ended September 30, 2025\n% Change from Prior Period\nThree Months Ended September 30,\nLess FX Effect\nConstant Currency Revenues\nAs Reported\nLess Hedging Effect\nLess FX Effect\nConstant Currency Revenues\n2024\n2025\nUnited States\n$\n43,139 \n$\n48,758 \n$\n0 \n$\n48,758 \n13 \n%\n0 \n%\n13 \n%\nEMEA\n25,472 \n29,911 \n1,261 \n28,650 \n17 \n%\n5 \n%\n12 \n%\nAPAC\n14,547 \n17,819 \n128 \n17,691 \n22 \n%\n0 \n%\n22 \n%\nOther Americas\n5,093 \n6,065 \n(50)\n6,115 \n19 \n%\n(1)\n%\n20 \n%\nRevenues, excluding hedging effect\n88,251 \n102,553 \n1,339 \n101,214 \n16 \n%\n1 \n%\n15 \n%\nHedging gains (losses)\n17 \n(207)\nTotal revenues\n(1)\n$\n88,268 \n$\n102,346 \n$\n101,214 \n16 \n%\n0 \n%\n1 \n%\n15 \n%\n(1)\nTotal constant currency revenues of $101.2 billion for the three months ended September 30, 2025 increased $13.0 billion compared to $88.3 billion in revenues, excluding hedging effect, for the three months ended September 30, 2024.\nEMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the euro and British pound.\nAPAC revenue growth was not materially affected by changes in foreign currency exchange rates.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso.\nNine Months Ended September 30, 2025\n% Change from Prior Period\nNine months ended\n September 30,\nLess FX Effect\nConstant Currency Revenues\nAs Reported\nLess Hedging Effect\nLess FX Effect\nConstant Currency Revenues\n2024\n2025\nUnited States\n$\n123,072 \n$\n138,785 \n$\n0 \n$\n138,785 \n13 \n%\n0 \n%\n13 \n%\nEMEA\n73,943 \n84,096 \n1,317 \n82,779 \n14 \n%\n2 \n%\n12 \n%\nAPAC\n41,659 \n49,153 \n(138)\n49,291 \n18 \n%\n0 \n%\n18 \n%\nOther Americas\n14,684 \n17,033 \n(902)\n17,935 \n16 \n%\n(6)\n%\n22 \n%\nRevenues, excluding hedging effect\n253,358 \n289,067 \n277 \n288,790 \n14 \n%\n0 \n%\n14 \n%\nHedging gains (losses)\n191 \n(60)\nTotal revenues\n(1)\n$\n253,549 \n$\n289,007 \n$\n288,790 \n14 \n%\n0 \n%\n— \n%\n14 \n%\n(1)\nTotal constant currency revenues of $288.8 billion for the nine months ended September 30, 2025 increased $35.4 billion compared to $253.4 billion in revenues, excluding hedging effect, for the nine months ended September 30, 2024.\nEMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the euro and British pound, partially offset by the U.S. dollar strengthening relative to the Turkish lira.\nAPAC revenue growth was not materially affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Australian dollar and Indian rupee, partially offset by the U.S dollar weakening relative to the Japanese yen.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Brazilian real and Mexican peso.\nCosts and Expenses\n43\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nSeptember 30,\n \n2024\n2025\n2024\n2025\nTAC\n$\n13,719 \n$\n14,876 \n$\n40,052 \n$\n43,329 \nOther cost of revenues\n22,755 \n26,493 \n65,641 \n73,439 \nTotal cost of revenues\n$\n36,474 \n$\n41,369 \n$\n105,693 \n$\n116,768 \nTotal cost of revenues as a percentage of revenues\n41 \n%\n40 \n%\n42 \n%\n40 \n%\nCost of revenues increased $4.9 billion from the three months ended September 30, 2024 to the three months ended September 30, 2025 due to an increase in other cost of revenues and TAC of $3.7 billion and $1.2 billion, respectively. Cost of revenues increased $11.1 billion from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 due to an increase in other cost of revenues and TAC of $7.8 billion and $3.3 billion, respectively.\nThe increase in TAC from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 20.8% to 20.1% from the three months ended September 30, 2024 to the three months ended September 30, 2025 and decreased from 20.8% to 20.4% from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rates on Google Search & other and Google Network revenues were substantially consistent from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025.\nThe increase in other cost of revenues from the three months ended September 30, 2024 to the three months ended September 30, 2025 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, other technical infrastructure operations costs, and devices costs. \nThe increase in other cost of revenues from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, and other technical infrastructure operations costs.\nResearch and Development\nThe following table presents R&D expenses (in millions, except percentages):\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nSeptember 30,\n \n2024\n2025\n2024\n2025\nResearch and development expenses\n$\n12,447 \n$\n15,151 \n$\n36,210 \n$\n42,515 \nResearch and development expenses as a percentage of revenues\n14 \n%\n15 \n%\n14 \n%\n15 \n%\nR&D expenses increased $2.7 billion from the three months ended September 30, 2024 to the three months ended September 30, 2025, primarily driven by increases in employee compensation expenses of $1.5 billion, depreciation expense of $659 million, and other technical infrastructure operations costs of $407 million.\nR&D expenses increased $6.3 billion from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily driven by increases in employee compensation expenses of $3.0 billion and depreciation expense of $1.7 billion.\n44\nSales and Marketing\nThe following table presents sales and marketing expenses (in millions, except percentages):\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nSeptember 30,\n \n2024\n2025\n2024\n2025\nSales and marketing expenses\n$\n7,227 \n$\n7,205 \n$\n20,445 \n$\n20,478 \nSales and marketing expenses as a percentage of revenues\n8 \n%\n7 \n%\n8 \n%\n7 \n%\nSales and marketing expenses decreased $22 million from the three months ended September 30, 2024 to the three months ended September 30, 2025, due to a combination of factors, none of which were individually significant.\nSales and marketing expenses increased $33 million from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily driven by an increase in advertising and promotional activities of $550 million, partially offset by a decrease in employee compensation expenses of $369 million.\nGeneral and Administrative\nThe following table presents general and administrative expenses (in millions, except percentages):\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nSeptember 30,\n \n2024\n2025\n2024\n2025\nGeneral and administrative expenses\n$\n3,599 \n$\n7,393 \n$\n9,783 \n$\n16,141 \nGeneral and administrative expenses as a percentage of revenues\n4 \n%\n7 \n%\n4 \n%\n6 \n%\nGeneral and administrative expenses increased $3.8 billion from the three months ended September 30, 2024 to the three months ended September 30, 2025, primarily driven by an increase in expenses related to legal and other matters of $3.8 billion, largely the result of the $3.5 billion EC fine.\nGeneral and administrative expenses increased $6.4 billion from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily driven by an increase in expenses related to legal and other matters of $6.3 billion, largely the result of the $3.5 billion EC fine accrued in the third quarter of 2025 and a $1.4 billion legal accrual made in the second quarter of 2025.\nSegment Profitability\nWe report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs are not allocated to our segments because they represent Alphabet-level activities. For further details on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nThe following table presents segment operating income (loss) (in millions):\nThree Months Ended\nNine Months Ended \nSeptember 30,\nSeptember 30,\n2024\n2025\n2024\n2025\nOperating income (loss):\nGoogle Services\n$\n30,856 \n$\n33,527 \n$\n88,427 \n$\n99,272 \nGoogle Cloud\n1,947 \n3,594 \n4,019 \n8,597 \nOther Bets\n(1,116)\n(1,426)\n(3,270)\n(3,898)\nAlphabet-level activities\n(1)\n(3,166)\n(4,467)\n(7,758)\n(10,866)\nTotal income from operations\n$\n28,521 \n$\n31,228 \n$\n81,418 \n$\n93,105 \n(1)\nIn addition to\n the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $17 million \nand $(207) million for the three months ended September 30, 2024 and 2025, respectively, and $191 million and $(60) million for the nine months ended September 30, 2024 and 2025, respectively. Alphabet-level activities include charges related to employee severance and office space charges.\n45\nGoogle Services\nGoogle Services operating income increased $2.7 billion and $10.8 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset by an increase in expenses related to legal and other matters, content acquisition costs, and TAC. \nGoogle Cloud\nGoogle Cloud operating income increased $1.6 billion and $4.6 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in usage costs for technical infrastructure and employee compensation expenses.\nOther Bets\nOther Bets operating loss increased $310 million and $628 million from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase in operating loss was due to a combination of factors, none of which were individually significant.\nOther Income (Expense), Net\nThe following table presents OI&E (in millions):\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nSeptember 30,\n \n2024\n2025\n2024\n2025\nInterest income\n$\n1,243 \n$\n1,076 \n$\n3,394 \n$\n3,128 \nInterest expense\n(54)\n(143)\n(215)\n(438)\nForeign currency exchange gain (loss), net\n23 \n(143)\n(388)\n(318)\nGain (loss) on debt securities, net\n160 \n122 \n(612)\n489 \nGain (loss) on equity securities, net\n1,821 \n10,734 \n3,350 \n21,778 \nPerformance fees\n29 \n(174)\n261 \n(297)\nIncome (loss) and impairment from equity method investments, net\n(107)\n(30)\n(101)\n367 \nOther\n70 \n1,317 \n465 \n1,895 \nOther income (expense), net\n$\n3,185 \n$\n12,759 \n$\n6,154 \n$\n26,604 \nOI&E, net increased $9.6 billion and $20.5 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase was primarily due to increases in net unrealized gains on equity securities resulting from fair value adjustments on non-marketable equity securities.\nFor additional information, see Note 3 and Note 7 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nProvision for Income Taxes\nThe following table presents provision for income taxes (in millions, except effective tax rate):\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2024\n2025\n2024\n2025\nIncome before provision for income taxes\n$\n31,706 \n$\n43,987 \n$\n87,572 \n$\n119,709 \nProvision for income taxes\n$\n5,405 \n$\n9,008 \n$\n13,990 \n$\n21,994 \nEffective tax rate\n17.0 \n%\n20.5 \n%\n16.0 \n%\n18.4 \n%\nThe effective ta\nx rate increased from the three months ended September 30, 2024 to the three months ended September 30, 2025. This increase was primarily due to a decrease in the U.S. Federal Foreign Derived Intangible Income tax deduction, and a non-deductible EC fine, partially offset by changes in prior period tax positions.\nThe effective tax rate increased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025. This increase was primarily due to a decrease in the U.S. Federal Foreign Derived Intangible \n46\nIncome tax deduction, a non-deductible EC fine and legal settlement in the U.S., a decrease in SBC-related tax benefits, partially offset by changes in prior period tax positions.\nChanges to U.S. tax law enacted on July 4, 2025, allow for immediate expensing of domestic research and experimentation costs, accelerated depreciation on eligible capital expenditures, and other tax law changes impacting 2025 with certain changes effective in 2026. These changes are reflected in our results for the three and nine months ended September 30, 2025.\nThe Organization for Economic Cooperation and Development (OECD) is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others to follow, however this did not have a material effect on our income tax provision for the period ending September 30, 2025.\nFinancial Condition\nCash, Cash Equivalents, and Marketable Securities\nAs of September 30, 2025, we had $98.5 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities.\nSources, Uses of Cash and Related Trends\nOur principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders.\nThe following table presents cash flows (in millions):\n \nNine Months Ended\nSeptember 30,\n \n2024\n2025\nNet cash provided by operating activities\n$\n86,186 \n$\n112,311 \nNet cash used in investing activities\n$\n(29,356)\n$\n(68,515)\nNet cash used in financing activities\n$\n(60,697)\n$\n(44,416)\nCash Provided by Operating Activities\nOur largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we generate cash through consumption-based fees and subscriptions for infrastructure, platform, applications, and other cloud services.\nOur primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures.\nNet cash provided by operating activities increased\n from the nine months ended September 30, 2024\n to the nine months ended September 30, 2025 due to an increase in cash received from customers, partially offset by an increase in cash payments for cost of revenues and operating expenses. \nCash Used in Investing Activities\nCash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions.\nNet cash used in investing activities increased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 primarily due to an increase in purchases of property and equipment, driven by investments in technical infrastructure, and a decrease in maturities and sales of marketable securities.\n47\nCash Used in Financing Activities\nCash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, payment of dividends, and repayments of debt.\nNet cash used in financing activities decreased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 due to an increase in proceeds from issuance of debt, net of repayments.\nLiquidity and Material Cash Requirements\nWe expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months, and thereafter for the foreseeable future.\nCapital Expenditures and Leases\nWe make investments in land, buildings, and servers and network equipment through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. \nCapital Expenditures\nOur capital investments in property and equipment consist primarily of the following major categories:\n•\ntechnical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, and data center land and building construction; and\n•\noffice facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\").\nAssets not yet in service are those that are not ready for our intended use, including assets in the process of construction or assembly, and consists primarily of technical infrastructure. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install servers and network equipment. \nDuring the nine months ended September 30, 2024 and 2025, we spent $38.3 billion and $63.6 billion on capital expenditures, respectively. We expect full year 2025 capital expenditures to exceed full year 2024. In 2026, we expect to significantly increase, relative to 2025, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. Depreciation of our property and equipment commences when such assets are ready for our intended use. For the nine months ended September 30, 2024 and 2025, depreciation on property and equipment was $11.1 billion and $15.1 billion, respectively. \nLeases\nAs of September 30, 2025, the amount of total future lease payments under operating and finance leases was $17.5 billion and $2.9 billion, respectively. \nAs of September 30, 2025, we have entered into leases primarily related to data centers that have not yet commenced with future lease payments of $42.6 billion, including a purchase option considered reasonably certain to be exercised. These leases will commence between 2025 and 2031 with non-cancelable lease terms between one and 25 years. \nFor additional information on leases, see Note 4 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nFinancing\nWe have a short-term debt financing program of up to $25.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of September 30, 2025, we had $3.0 billion of short-term commercial paper outstanding.\nIn May 2025, we issued $5.0 billion of U.S. dollar-denominated fixed-rate senior unsecured notes in four tranches: $750 million of 4.00% notes due 2030, $1.25 billion of 4.50% notes due 2035, $1.5 billion of 5.25% notes due 2055, and $1.5 billion of 5.30% notes due 2065. Additionally in May 2025, we issued €6.75 billion of euro-denominated fixed-rate senior unsecured notes in five tranches: €1.5 billion of 2.50% notes due 2029, €1.5 billion of 3.00% notes due 2033, €1.25 billion of 3.38% notes due 2037, €1.25 billion of 3.88% notes due 2045, and \n48\n€1.25 billion of 4.00% notes due 2054. The net proceeds from all notes issued in May 2025 are used for general corporate purposes.\nAs of September 30, 2025, we had senior unsecured notes outstanding with a total carrying value of $23.6 billion.\nAs of September 30, 2025, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2026 and $6.0 billion expiring in April 2030. The interest rates for all credit facilities are determined based on a formula using certain market rates. No amounts have been borrowed under the credit facilities.\nFor additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nWe primarily utilize contract manufacturers for the assembly of our servers used in our technical infrastructure and devices we sell. We have agreements where we may purchase components directly from suppliers and then supply these components to contract manufacturers for use in the assembly of the servers and devices. Certain of these arrangements result in a portion of the cash received from and paid to the contract manufacturers to be presented as financing activities in the Consolidated Statements of Cash Flows included in Item 1 of this Quarterly Report on Form 10-Q.\nShare Repurchase Program\nIn the three and nine months ended September 30, 2025, we repurchased and subsequently retired 56 million and 220 million shares for $11.6 billion and $40.1 billion, respectively.\nIn April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. \nIn April 2025, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of Class A and Class C shares. \nAs of September 30, 2025\n, \n$74.8 billion remained available for Class A and Class C share repurchases.\nThe following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\nThree Months Ended\nNine Months Ended\nSeptember 30, 2025\nSeptember 30, 2025\nShares\nAmount\nShares\nAmount\nClass A share repurchases\n5\n$\n926 \n36\n$\n6,229 \nClass C share repurchases\n51\n10,627 \n184\n33,888 \nTotal share repurchases\n(1)\n56\n$\n11,553 \n220\n$\n40,117 \n(1)\nShares repurchased include unsettled repurchases.\nFor additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nDividend Program\nIn the three and nine months ended September 30, 2025, total cash dividends were $1.2 billion and $3.6 billion for Class A, $177 million and $527 million for Class B, and $1.1 billion and $3.4 billion for Class C shares, respectively.\nIn April 2025, the Board of Directors of Alphabet increased the quarterly cash dividend by 5% to $0.21 per share of outstanding Class A, Class B, and Class C shares.\nThe company has declared a quarterly cash dividend in the current quarter, and intends to pay quarterly cash dividends in the future, subject to review and approval by the company’s Board of Directors in its sole discretion.\nEuropean Commission Fines\nIn 2018 and 2019, the EC announced decisions that certain actions taken by Google infringed European competition law and imposed fines of €4.3 billion ($5.1 billion as of June 30, 2018) and €1.5 billion ($1.7 billion as of March 20, 2019), respectively. \nIn September 2022, the General Court affirmed the EC decision but reduced the 2018 fine from \n€4.3 billion\n to \n€4.1 billion\n. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending.\n49\nIn September 2024, the EU's General Court overturned the 2019 decision and annulled the \n€1.5 billion\n fine. The EC has appealed the General Court's decision to the European Court of Justice. \nIn September 2025, the EC announced its decision that Google had infringed European competition laws through “self-preferencing” practices on the buy-side and the sell-side relating to its advertising technology. The EC imposed a €3.0 billion fine ($3.5 billion as of September 5, 2025), which was accrued in the third quarter of 2025.\nWe included the outstanding EC fines, including any under appeal, in accrued expenses and other current liabilities on our Consolidated Balance Sheets. For additional information, see Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nTaxes\nAs of September 30, 2025, we had long-term income taxes payable of $10.1 billion primarily related to uncertain tax positions. \nPurchase Commitments and Other Contractual Obligations\nWe have material purchase commitments and other contractual obligations primarily related to energy contracts, licenses (including content licenses), and technical infrastructure and inventory orders. As of September 30, 2025, the total for these commitments was\n \n$93.7 billion, \nof which \n$72.5 billion\n was short-term, mostly related to technical infrastructure and inventory orders. These amounts\n reflect commitments and obligations through open purchase orders as well as the non-cancelable portion or the minimum cancellation fee in certain agreements. For those agreements with variable term\ns, we do not estimate the non-cancelable obligation beyond any minimum quantities and/or pricing as of September 30, 2025. In certain instances, the amount of our contractual obligations may change based on the expected t\niming of order fulfillment from our suppliers. For more information related to our content licenses, see Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. \nIn addition, we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and energy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar commitment. The amounts to be paid under these agreements are based on the actual volumes to be generated and are not readily determinable.\nWe may experience increases in the costs associated with our purchase commitments and other contractual obligations as a result of ongoing developments surrounding international trade. For details on risks related to our manufacturing and supply chain and other risks, refer to Part I, Item 1A, \"Risk Factors\" in our Annual Report on Form 10-K for the fiscal year ending December 31, 2024.\nPending Acquisition\nIn March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for $32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to close in 2026, subject to customary closing conditions, including the receipt of regulatory approvals. For additional information, see Note 8 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nCritical Accounting Estimates\nSee Part II, Item 7, \"Critical Accounting Estimates\" in our Annual Report on Form 10-K for the year ended December 31, 2024. \nAvailable Information\nOur website is located at www.abc.xyz, and our investor relations website is located at www.abc.xyz/investor. Access to our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and our Proxy Statements,\n \nand any amendments to these reports, is available on our investor relations website, free of charge, after we file or furnish them with the SEC and they are available on the SEC's website at www.sec.gov.\nWe webcast via our investor relations YouTube channel and website our earnings calls and certain events we participate in or host with members of the investment community. Our investor relations website also provides notifications of news or announcements regarding our financial performance and other items that may be material or of interest to our investors, including SEC filings, investor events, press and earnings releases, and blogs. We also share Google news and product updates on Google’s Keyword blog at https://www.blog.google/ and News From Google page on X at x.com/NewsFromGoogle, and our executive officers may also use certain social media channels, such as X and LinkedIn, to communicate information about earnings results and company updates, which \n50\nmay be of interest or material to our investors. Further, corporate governance information, including our certificate of incorporation, bylaws, governance guidelines, board committee charters, and code of conduct, is also available on our investor relations website under the heading \"Governance.\" The information contained on, or that may be accessed through our websites or our executive officers' social media channels, is not incorporated by reference into this Quarterly Report on Form 10-Q or in any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only."
}