{
  "source_file": "gpc-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the unaudited Condensed Consolidated Financial Statements and accompanying notes contained herein and with the audited Consolidated Financial Statements, accompanying notes, related information and Management’s Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the year ended December 31, 2024. The results of operations for the three and nine months ended September 30, 2025 are not necessarily indicative of results for the year ended December 31, 2025.\nForward-Looking Statements\nSome statements in this report, as well as in other materials we file with the Securities and Exchange Commission (“SEC”), release to the public, or make available on our website, constitute forward-looking statements that are subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. All statements in the future tense and all statements accompanied by words such as “expect,” “likely,” “outlook,” “forecast,” “preliminary,” “would,” “could,” “should,” “position,” “will,” “project,” “intend,” “plan,” “on track,” “anticipate,” “to come,” “may,” “possible,” “assume,” or similar expressions are intended to identify such forward-looking statements. These forward-looking statements include our view of business and economic trends for the remainder of the year and our expectations regarding our ability to capitalize on these business and economic trends and to execute our strategic priorities. Senior officers may also make verbal statements to analysts, investors, the media and others that are forward-looking.\nWe caution you that all forward-looking statements involve risks and uncertainties, and while we believe that our expectations for the future are reasonable in view of currently available information, you are cautioned not to place undue reliance on our forward-looking statements. Actual results or events may differ materially from those indicated as a result of various important factors. Such factors may include, among other things, changes in general economic conditions, including unemployment, inflation (including the direct and indirect impact of tariffs and other similar measures, as well as the impact of retaliatory tariffs and other actions) or deflation, financial institution disruptions and geopolitical conflicts such as the conflict between Russia and Ukraine, the conflict in the Gaza strip and other continuing unrest in the Middle East; volatility in oil prices; significant cost increases, such as rising fuel and freight expenses; public health emergencies, including the effects on the financial health of our business partners and customers, on supply chains and our suppliers, on vehicle miles driven as well as other metrics that affect our business, and on access to capital and liquidity provided by the financial and capital markets; our ability to maintain compliance with our debt covenants; our ability to successfully integrate acquired businesses into our operations and to realize the anticipated synergies and benefits; our ability to successfully implement our business initiatives in our two business segments; slowing demand for our products; the ability to maintain favorable supplier arrangements and relationships; possible changes in collections of outstanding receivables due to the bankruptcy or financial difficulties of our customers or vendors; changes in national and international legislation or government regulations, policies, or actions, including changes to import tariffs, environmental and social policy, infrastructure programs and privacy legislation, the U.S. federal government shutdown, and their direct and indirect impact to us, our suppliers and customers; changes in tax policies, including those included in the One Big Beautiful Bill Act; volatile exchange rates; our ability to successfully attract and retain employees in the current labor market; uncertain credit markets and other macroeconomic conditions; competitive product, service and pricing pressures; failure or weakness in our disclosure controls and procedures and internal controls over financial reporting; the uncertainties and costs of litigation; disruptions caused by a failure or breach of our information systems, as well as other risks and uncertainties discussed in our 2024 Annual Report on Form 10-K, our Quarterly Report on Form 10-Q for the quarter ended March 31, 2025 and from time to time in our subsequent filings with the SEC.\nForward-looking statements speak only as of the date they are made, and we undertake no duty to update any forward-looking statements except as required by law. You are advised, however, to review any further disclosures we make on related subjects in our subsequent Forms 10-K, 10-Q, 8-K and other reports filed with the SEC.\n20\nTable of Contents\nOverview\nGenuine Parts Company (\"GPC\") is a global service organization with a long history of growth and innovation dating back to our founding in Atlanta, Georgia, in 1928. Over nearly a century, we’ve built a reputation for delivering excellent customer service, profitable growth, leading distribution capabilities and strong cash flow.\nAs of September 30, 2025, we conducted business in North America, Europe and Australasia from more than 10,700 locations. Our Automotive business operated in the U.S., Canada, Mexico, France, the U.K., Ireland, Germany, Poland, the Netherlands, Belgium, Spain, Portugal, Australia and New Zealand and accounted for 64% of total revenues for the nine months ended September 30, 2025. Our Industrial business operated in the U.S., Canada, Mexico, Australia, New Zealand, Indonesia and Singapore and accounted for 36% of total revenues during this period.\nKey Performance Indicators\nWe consider a variety of performance and financial measures in assessing our business, and the key performance indicators used to measure our results are Comparable Sales, Gross Profit and Gross Margin, Selling, Administrative and Other Expenses (\"SG&A\"), Segment EBITDA and Segment EBITDA Margin, and Net Income and EBITDA along with their adjusted measures. For more information regarding our key performance indicators please reference the Management’s Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the year ended December 31, 2024. \nResults of Operations\nOur third quarter results reflect solid sales growth against a backdrop of weak market conditions, persistent cost inflation and elevated interest rates contributing to cautious customer activity. Third quarter net sales increased 4.9% to $6.3 billion compared to the same prior year period. Automotive sales growth was driven by increases in core sales, contributions from acquisitions, and a benefit from foreign currency. Industrial sales growth was driven by increases in comparable sales and a modest contribution from acquisitions. We achieved this Industrial sales growth despite the Purchasing Managers’ Index (\"PMI\"), a measure of U.S. manufacturing trends, continuing to signal contraction during the quarter and an overall weak industrial backdrop. \nIn addition to this sales growth, gross profit margin expanded approximately 60 basis points when compared to the prior year period, reflecting the ongoing benefits from our strategic pricing, sourcing initiatives and acquisitions.\nDespite sales growth and gross margin expansion, net income remained flat with the prior year period. This was primarily due to higher depreciation and interest expense from planned investments and lower pension income due to a change in our investing strategy related to our planned U.S. pension plan termination. We also experienced higher SG&A expenses resulting from higher salary and healthcare costs and increased rent from lease renewals in a higher interest rate environment. Lastly, restructuring and other costs totaled $67 million in the third quarter, up from $41 million in the prior year period, primarily driven by costs associated with facility closures and additional severance costs. Our global restructuring program yielded $36 million in benefits in the third quarter, underscoring our commitment to enhancing business efficiency and adaptability amid a challenging economic environment.\nImpact of Tariffs on Our Business\nWe continue to monitor the global trade environment, including the tariffs on merchandise inventories sourced directly or indirectly from several countries, such as China, Canada, and Mexico and their impact on our operations. While the ongoing economic volatility continues to add uncertainty to our operating environment, we expect our balanced portfolio and global diversification will help mitigate potential disruptions. Although the long-term effects remain uncertain, for the three or nine months ended September 30, 2025, tariffs did not have a material impact on our financial results. See Part II, Item 1A. Risk Factors in the Company's Quarterly Report on Form 10-Q for the quarter ended March 31, 2025 for further discussion regarding tariff-related risks.\n21\nTable of Contents\nOur third quarter results of operations are summarized below for the three and nine months ended September 30, 2025 and 2024.\n \nThree Months Ended September 30,\n2025\n2024\n(in thousands)\n$\n% of Sales\n$\n% of Sales\n$ Change\n% Change\nNet sales\n$\n6,260,232 \n100.0 \n%\n$\n5,970,198 \n100.0 \n%\n$\n290,034 \n4.9 \n%\nCost of goods sold\n3,918,830 \n62.6 \n%\n3,771,757 \n63.2 \n%\n147,073 \n3.9 \n%\nGross profit\n2,341,402 \n37.4 \n%\n2,198,441 \n36.8 \n%\n142,961 \n6.5 \n%\nOperating expense:\nSelling, administrative and other expenses\n1,805,928 \n28.8 \n%\n1,722,400 \n28.8 \n%\n83,528 \n4.8 \n%\nDepreciation and amortization\n127,475 \n2.0 \n%\n106,036 \n1.8 \n%\n21,439 \n20.2 \n%\nProvision for doubtful accounts\n6,871 \n0.1 \n%\n7,119 \n0.1 \n%\n(248)\n(3.5)\n%\nRestructuring and other costs \n66,835 \n1.1 \n%\n41,023 \n0.7 \n%\n25,812 \n62.9 \n%\nTotal operating expense\n2,007,109 \n32.1 \n%\n1,876,578 \n31.4 \n%\n130,531 \n7.0 \n%\nNon-operating (income) expense:\nInterest expense, net\n40,342 \n0.6 \n%\n27,818 \n0.5 \n%\n12,524 \n45.0 \n%\nOther\n2,258 \n— \n%\n(3,548)\n(0.1)\n%\n5,806 \n(163.6)\n%\nTotal non-operating (income) expense\n42,600 \n0.7 \n%\n24,270 \n0.4 \n%\n18,330 \n75.5 \n%\nIncome before income taxes\n291,693 \n4.7 \n%\n297,593 \n5.0 \n%\n(5,900)\n(2.0)\n%\nIncome taxes\n65,522 \n1.0 \n%\n71,011 \n1.2 \n%\n(5,489)\n(7.7)\n%\nNet income\n$\n226,171 \n3.6 \n%\n$\n226,582 \n3.8 \n%\n$\n(411)\n(0.2)\n%\nThree Months Ended September 30,\n(in thousands, except per share data)\n2025\n2024\n$ Change\n% Change\nDiluted EPS\n$\n1.62\n$\n1.62\n$\n— \n— \n%\nAdjusted diluted EPS\n$\n1.98\n$\n1.88\n$\n0.10 \n5.3 \n%\nAutomotive segment EBITDA\n$\n334,704\n$\n316,142\n$\n18,562 \n5.9 \n%\nIndustrial segment EBITDA\n$\n285,015\n$\n267,287\n$\n17,728 \n6.6 \n%\nCorporate EBITDA\n$\n(93,374)\n$\n(106,686)\n$\n13,312 \n(12.5)\n%\nTotal adjusted EBITDA\n$\n526,345\n$\n476,743\n$\n49,602 \n10.4 \n%\nAutomotive segment EBITDA margin\n8.4 \n%\n8.3 \n%\nIndustrial segment EBITDA margin\n12.6 \n%\n12.3 \n%\nCorporate EBITDA margin\n(1.5)\n%\n(1.8)\n%\nTotal adjusted EBITDA margin\n8.4 \n%\n8.0 \n%\n22\nTable of Contents\n \nNine Months Ended September 30,\n2025\n2024\n(in thousands)\n$\n% of Sales\n$\n% of Sales\n$ Change\n% Change\nNet sales\n$\n18,290,726 \n100.0 \n%\n$\n17,716,396 \n100.0 \n%\n$\n574,330 \n3.2 \n%\nCost of goods sold\n11,451,252 \n62.6 \n%\n11,262,997 \n63.6 \n%\n188,255 \n1.7 \n%\nGross profit\n6,839,474 \n37.4 \n%\n6,453,399 \n36.4 \n%\n386,075 \n6.0 \n%\nOperating expense:\nSelling, administrative and other expenses\n5,286,802 \n28.9 \n%\n4,944,783 \n27.9 \n%\n342,019 \n6.9 \n%\nDepreciation and amortization\n365,928 \n2.0 \n%\n295,848 \n1.7 \n%\n70,080 \n23.7 \n%\nProvision for doubtful accounts\n20,351 \n0.1 \n%\n19,008 \n0.1 \n%\n1,343 \n7.1 \n%\nRestructuring and other costs \n167,317 \n0.9 \n%\n153,825 \n0.9 \n%\n13,492 \n8.8 \n%\nTotal operating expense\n5,840,398 \n31.9 \n%\n5,413,464 \n30.6 \n%\n426,934 \n7.9 \n%\nNon-operating (income) expense:\nInterest expense, net\n117,769 \n0.6 \n%\n67,429 \n0.4 \n%\n50,340 \n74.7 \n%\nOther\n(580)\n— \n%\n(36,469)\n(0.2)\n%\n35,889 \n(98.4)\n%\nTotal non-operating (income) expense\n117,189 \n0.6 \n%\n30,960 \n0.2 \n%\n86,229 \n278.5 \n%\nIncome before income taxes\n881,887 \n4.8 \n%\n1,008,975 \n5.7 \n%\n(127,088)\n(12.6)\n%\nIncome taxes\n206,444 \n1.1 \n%\n237,955 \n1.3 \n%\n(31,511)\n(13.2)\n%\nNet income\n$\n675,443 \n3.7 \n%\n$\n771,020 \n4.4 \n%\n$\n(95,577)\n(12.4)\n%\nNine Months Ended September 30,\n(in thousands, except per share data)\n2025\n2024\n$ Change\n% Change\nDiluted EPS\n$\n4.85\n$\n5.51\n$\n(0.66)\n(12.0)\n%\nAdjusted diluted EPS\n$\n5.82\n$\n6.55\n$\n(0.73)\n(11.1)\n%\nAutomotive segment EBITDA\n$\n958,203\n$\n998,687\n$\n(40,484)\n(4.1)\n%\nIndustrial segment EBITDA\n$\n851,864\n$\n831,234\n$\n20,630 \n2.5 \n%\nCorporate EBITDA\n$\n(263,131)\n$\n(267,306)\n$\n4,175 \n(1.6)\n%\nTotal adjusted EBITDA\n$\n1,546,936\n$\n1,562,615\n$\n(15,679)\n(1.0)\n%\nAutomotive segment EBITDA margin\n8.3 \n%\n9.0 \n%\nIndustrial segment EBITDA margin\n12.7 \n%\n12.6 \n%\nCorporate EBITDA margin\n(1.4)\n%\n(1.5)\n%\nTotal adjusted EBITDA margin\n8.5 \n%\n8.8 \n%\nNet Sales\nFor the three months ended September 30, 2025, net sales increased 4.9% compared to 2024. The increase was driven by a 2.3% increase in comparable sales, a 1.8% benefit from acquisitions and a favorable impact of foreign currency and other of 0.8%.\nFor the nine months ended September 30, 2025, net sales increased 3.2% compared to 2024. The increase was driven by a 2.5% benefit from acquisitions, a 0.6% increase in comparable sales and a favorable impact of foreign currency and other of 0.1%.\nDespite the challenging macroeconomic environment, our net sales for the three and nine months ended September 30, 2025, increased primarily due to growth in comparable sales and contributions from acquisitions. Additionally, net sales for the nine month period were affected by one fewer selling day in the U.S. compared to the prior year period.\n23\nTable of Contents\nAutomotive \nNet sales for the three months ended September 30, 2025 for Automotive were $4.0 billion, an increase of 5.0% from 2024. The increase is attributable to a 2.3% benefit from acquisitions, a 1.6% increase in comparable sales and a 1.1% favorable impact of foreign currency and other. \nNet sales for the nine months ended September 30, 2025 for Automotive were $11.6 billion, an increase of 4.2% from 2024. The increase is attributable to a 3.2% benefit from acquisitions and a 0.6% favorable impact of foreign currency and other. Comparable sales were essentially flat when compared to 2024.\nOur sales growth was driven by the contribution from our stores that were acquired over the last twelve months, which enhanced our ability to reach and serve our customers, and the favorable impact resulting from the strength of the Euro relative to the U.S. Dollar. \nIndustrial \nNet sales for the three months ended September 30, 2025 for Industrial were $2.3 billion, an increase of 4.6% compared to 2024. The increase in sales reflects a 3.7% increase in comparable sales and 1.1% benefit from acquisitions, partially offset by a 0.2% unfavorable impact of foreign currency. \nNet sales for the nine months ended September 30, 2025 for Industrial were $6.7 billion, an increase of 1.6% compared to 2024. The increase in sales reflects a 1.2% benefit from acquisitions and a 0.9% increase in comparable sales, partially offset by a 0.5% unfavorable impact of foreign currency.\nThis sales growth was achieved despite the Purchasing Managers’ Index (\"PMI\") continuing to signal contraction and an overall soft industrial backdrop throughout the quarter.\nGross Profit and Gross Margin\nGross profit increased $143 million, or 6.5%, during the three months ended September 30, 2025 and gross margin increased 60 basis points to 37.4% compared to the prior year period. Gross profit increased $386 million, or 6.0%, during the nine months ended September 30, 2025 and gross margin increased 100 basis points to 37.4% compared to the prior year period. These increases primarily reflect the benefit of successful execution of our ongoing strategic pricing and sourcing initiatives and acquisitions completed in the prior year.\nSelling, Administrative and Other (\"SG&A\") Expenses\nSG&A expenses increased $84 million, or 4.8%, during the three months ended September 30, 2025 compared to the prior year period. The 4.8% increase comprised 2.4% from acquisitions and 2.4% from other cost increases.\nSG&A expenses increased $342 million, or 6.9%, during the nine months ended September 30, 2025 compared to the prior year period. The 6.9% increase comprised 4.0% from acquisitions and 2.9% from other cost increases. \nWe continued to experience higher SG&A expenses primarily due to higher salaries and wages, rising healthcare costs, and increased rent from lease renewals in a higher interest rate environment. We are managing the impact of the inflationary environment through our global restructuring initiatives, which we estimate had a $96 million benefit to SG&A for the nine months ended September 30, 2025.\nSG&A expenses as a percentage of sales remained flat at 28.8% compared to the prior year period. SG&A expenses as a percentage of sales increased 100 basis points to 28.9% of sales in the nine months ended September 30, 2025 compared to 27.9% last year. The increase for the nine months ended September 30, 2025 was primarily driven by the items discussed above. \nRestructuring and Other Costs\nWe incurred $67 million and $167 million of restructuring and other costs during the three months and nine months ended September 30, 2025, respectively, as part of our global restructuring plan which was approved and initiated in February 2024 and remains on track to better align our assets and further improve the efficiency of the business. Restructuring and other costs increased by $26 million compared to the prior period, reflecting costs associated with facility closures and additional severance costs. For additional details, refer to the Restructuring Footnote in the Notes to Condensed Consolidated Financial Statements.\n24\nTable of Contents\nDepreciation and Amortization\nDepreciation and amortization expenses increased $21 million and $70 million for the three and nine months ended September 30, 2025, respectively, related to planned investments in technology and supply chain initiatives.\nNon-Operating Expenses and Income\nThis category primarily includes net interest expense, pension and investment income, foreign currency gains and losses, and fees associated with our Accounts Receivable Sales Agreement (\"A/R Sales Agreement\"). \nWe incurred $43 million in net non-operating expenses for the three months ended September 30, 2025, a $18 million change from $24 million in net non-operating expense in the prior year period. The $18 million expense increase primarily includes the effects of a $13 million increase in net interest expense in 2025, due to increased borrowings, as well as a $13 million decrease in pension income as a result of changes in expected returns due to the planned termination of our U.S. pension plan.\nFor the nine months ended September 30, 2025, we incurred $117 million in net non-operating expenses, a $86 million change from the prior year period. The $86 million expense increase primarily includes the effects of a $50 million increase in net interest expense in 2025, due to increased borrowings, and a $40 million decrease in pension income as a result of changes in expected returns due to the planned termination of our U.S. pension plan.\nIncome Taxes\nOur effective income tax rates decreased to 22.5% for the three months ended September 30, 2025 compared to 23.9% for the three months ended September 30, 2024. Our effective income tax rates were 23.4% and 23.6% for nine months ended September 30, 2025 and 2024, respectively.  The rate decrease for the three and nine month period is primarily due to comparative restructuring costs and expanded investments, which was partially offset by routine tax position adjustments.\nThe effective tax rates for the three and nine months ended September 30, 2025 consider the enactment of One Big Beautiful Bill Act (\"OBBBA\") on July 4, 2025, which did not have a material impact to income tax expense. OBBBA is not expected to materially impact our 2025 annual effective tax rate. \nNet Income and Adjusted Net Income\nNet income was $226 million for the three months ended September 30, 2025, a decrease of 0.2% compared to net income of $227 million for the prior year period. On a per share diluted basis, net income was $1.62 for both periods. For the nine months ended September 30, 2025 net income was $675 million, a decrease of 12.4% compared to net income of $771 million for the prior year period. On a per share diluted basis, net income was $4.85, a decrease of 12.0% compared to $5.51 in the prior year period. \nAdjusted net income was $276 million for the three months ended September 30, 2025, an increase of 4.8% compared to the prior year period. On a per share basis, the three months ended September 30, 2025 adjusted net income was $1.98, an increase of 5.3% compared to $1.88 in the prior year period. Adjusted net income was $810 million for the nine months ended September 30, 2025, a decrease of 11.5% compared to the prior year period. On a per share basis, the nine months ended September 30, 2025 adjusted net income was $5.82, a decrease of 11.1% compared to $6.55 in the prior year period. \nFor the three months ended September 30, 2025, net income remained flat with the prior year period despite a 4.9% increase in net sales compared to 2024. This increase in net sales was largely offset by planned investments in the business generating higher depreciation and interest costs, lower pension income due to a change in our investing strategy related to our planned U.S. pension plan termination, increased personnel and healthcare costs, and increased rent expenses. \nFor the nine months ended September 30, 2025, net income declined due to these same factors described above.\n The period was further impacted by lost profit from one less selling day in the U.S. compared to the prior year period.\n These factors were partially mitigated by a 60 basis point gross margin improvement driven by the continued execution of ongoing strategic pricing and sourcing initiatives and acquisitions completed in the prior year.\nSegment EBITDA\nAutomotive\nAutomotive net sales increased 5.0% in the three months ended September 30, 2025, driven by both acquisitions and comparable sales growth in our North America, Australasia and Canadian businesses. Net sales also benefited from favorable foreign currency effects within our European operations. Additionally, gross margin \n25\nTable of Contents\nimproved due to ongoing strategic pricing and sourcing initiatives and acquisitions completed in the prior year. Our gross profit improvement was partially offset by continued inflationary pressures that resulted in operating expenses increasing 8.1%. As a result, Automotive EBITDA increased 5.9%, and EBITDA margin was 8.4%, an increase of 10 basis points compared to the prior year period. \nAutomotive EBITDA decreased $40 million, or 4.1%, in the nine months ended September 30, 2025 compared to the prior year period, and Automotive EBITDA margin decreased to 8.3% compared to 9.0% in the prior year period.  The decrease in Automotive EBITDA and EBITDA margin were driven by persistent inflationary cost pressures from salaries and wages, healthcare expenses, rent, and freight.\nIndustrial \nIndustrial net sales increased 4.6% in the three months ended September 30, 2025, primarily driven by a 3.7% increase in comparable sales and 1.1% benefit from acquisitions, partially offset by an unfavorable 0.2% impact of foreign currency translation. Industrial EBITDA increased 6.6%, with EBITDA margin improving to 12.6% compared to 12.3% in the prior year period. Our Industrial results reflect solid sales growth and operating discipline despite a challenging macroeconomic environment to offset inflation in costs. \nFor the nine months ended September 30, 2025, Industrial sales grew 1.6%, driven by a 1.2% benefit from acquisitions and 0.9% increase in comparable sales, partially offset by an unfavorable 0.5% impact of foreign currency translation. EBITDA increased $21 million, or 2.5%, with EBITDA margin improving to 12.7% compared to 12.6% in the prior year period. \nCorporate EBITDA and Other Segment Reconciling items\nCorporate EBITDA amounted to a loss of $93 million, or 1.5% of net sales, for the three months ended September 30, 2025, compared to a loss of $107 million, or 1.8% of net sales, for the three months ended September 30, 2024. \nCorporate EBITDA amounted to a loss of $263 million, or 1.4% of net sales, for the nine months ended September 30, 2025, compared to a loss of $267 million, or 1.5% of net sales, in the prior year period. Corporate EBITDA loss increased primarily due to increased personnel costs and ongoing investments in technology.\nWe continue to consolidate certain back-office functions at Corporate to streamline operations and drive improvements. Our operational objective is to maintain Corporate EBITDA within a range of 1.5% to 2.0% of net sales. Other unallocated costs represent restructuring and other costs and acquisition and integration related costs and other.\nEBITDA and Adjusted EBITDA\nEBITDA was $460 million for the three months ended September 30, 2025, an increase of 6.5% from $431 million during the prior year period. Adjusted EBITDA was $526 million for the three months ended September 30, 2025, an increase of 10.4% from $477 million during the prior year period.\nEBITDA was $1.4 billion for the nine months ended September 30, 2025, a decrease of 0.5% from $1.4 billion during the prior year period. Adjusted EBITDA was $1.5 billion for the nine months ended September 30, 2025, a decrease of 1.0% from $1.6 billion during the prior year period.\nThe increases in EBITDA and adjusted EBITDA for the three months ended September 30, 2025 are driven by core sales growth, despite continued soft market conditions and gross margin improvement driven by the continued execution of our strategic pricing and sourcing initiatives as well as contributions from prior-year acquisitions. These factors were partially offset by lower pension income due to a change in our investing strategy related to our planned U.S. pension plan termination, increased personnel and healthcare expenses and increased rent expenses.\nThe decreases in EBITDA and adjusted EBITDA for the  nine months ended September 30, 2025 were primarily driven by lower pension income and the effects of rising costs, as previously described, as well as one less sales day in the current period when compared to the prior year period.\nAdjusted net income, adjusted diluted EPS, EBITDA and adjusted EBITDA are non-GAAP measures (see table below for reconciliations to the most directly comparable GAAP measures).\nNon-GAAP Financial Measures\nThe following tables set forth reconciliations of net income and diluted EPS to adjusted net income and adjusted diluted EPS, respectively, to account for the impact of adjustments. We also include a reconciliation from net income to adjusted EBITDA. We believe that the presentation of adjusted net income, adjusted diluted EPS, and \n26\nTable of Contents\nadjusted EBITDA, which are not calculated in accordance with GAAP, when considered together with the corresponding GAAP financial measures and the reconciliations to those measures, provide meaningful supplemental information to both management and investors that is indicative of our core operations. We consider these metrics useful to investors because they provide greater transparency into management’s view and assessment of our ongoing operating performance by removing items management believes are not representative of our operations and may distort our longer-term operating trends. For example, certain of the non-GAAP metrics contained herein exclude costs relating to our global restructuring initiative and acquisition of acquired independent automotive stores, which are one-time events that do not recur in the ordinary course of business. We believe the non-GAAP metrics included herein also enhance the comparability of our results from period to period and with our competitors, as well as to show ongoing results from operations distinct from items that are infrequent or not associated with our core operations. We do not, nor do we suggest investors should, consider such non-GAAP financial measures in isolation from, or as a substitute for, GAAP financial information.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in thousands)\n2025\n2024\n2025\n2024\nGAAP net income\n$\n226,171 \n$\n226,582 \n$\n675,443 \n$\n771,020 \nAdjustments:\nRestructuring and other costs (1)\n66,835 \n41,023 \n167,317 \n161,312 \nAcquisition and integration related costs and other (2)\n— \n4,273 \n14,035 \n29,051 \nTotal adjustments\n66,835 \n45,296 \n181,352 \n190,363 \nTax impact of adjustments (3)\n(17,411)\n(8,865)\n(46,340)\n(45,911)\nAdjusted net income\n$\n275,595 \n$\n263,013 \n$\n810,455 \n$\n915,472 \nThe table below represents amounts per common share assuming dilution: \nThree Months Ended September 30,\nNine Months Ended September 30,\n(in thousands, except per share data)\n2025\n2024\n2025\n2024\nGAAP diluted earnings per share\n$\n1.62 \n$\n1.62 \n$\n4.85 \n$\n5.51 \nAdjustments:\nRestructuring and other costs (1)\n0.48 \n0.29 \n1.20 \n1.15 \nAcquisition and integration related costs and other (2)\n— \n0.03 \n0.10 \n0.22 \nTotal adjustments\n0.48 \n0.32 \n1.30 \n1.37 \nTax impact of adjustments (3)\n(0.12)\n(0.06)\n(0.33)\n(0.33)\nAdjusted diluted earnings per share\n$\n1.98 \n$\n1.88 \n$\n5.82 \n$\n6.55 \nWeighted average common shares outstanding – assuming dilution\n139,406 \n139,599 \n139,257 \n139,826 \n(1)\nAmount reflects costs related to the global restructuring initiative which includes severance, and rationalization and optimization of certain distribution centers, stores and other facilities.\n(2)\nAmount primarily reflects lease and other exit costs related to the ongoing integration of acquired independent automotive stores.\n(3)\nWe determine the tax effect of non-GAAP adjustments by considering the tax laws and statutory income tax rates applicable in the tax jurisdictions of the underlying non-GAAP adjustments, including any related valuation allowances. For the three and nine months ended September 30, 2025, we applied the statutory income tax rates to the taxable portion of all of our adjustments, which resulted in an unfavorable tax impact of $17 million and $46 million, respectively.\n27\nTable of Contents\nThe table below represents a reconciliation from GAAP net income to adjusted EBITDA: \nThree Months Ended September 30,\nNine Months Ended September 30,\n(in thousands)\n2025\n2024\n2025\n2024\nGAAP net income\n$\n226,171 \n$\n226,582 \n$\n675,443 \n$\n771,020 \nDepreciation and amortization\n127,475 \n106,036 \n365,928 \n295,848 \nInterest expense, net\n40,342 \n27,818 \n117,769 \n67,429 \nIncome taxes\n65,522 \n71,011 \n206,444 \n237,955 \nEBITDA\n459,510 \n431,447 \n1,365,584 \n1,372,252 \nTotal adjustments (1)\n66,835 \n45,296 \n181,352 \n190,363 \nAdjusted EBITDA\n$\n526,345 \n$\n476,743 \n$\n1,546,936 \n$\n1,562,615 \n(1)\nAmounts are the same as adjustments included within the adjusted net income table above.\nThe table below clarifies where the adjusted items are presented in the Condensed Consolidated Statements of Income:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in thousands)\n2025\n2024\n2025\n2024\nLine item:\nCost of goods sold\n$\n— \n$\n— \n$\n— \n$\n7,487 \nSelling, administrative and other expenses\n— \n4,273 \n14,035 \n29,051 \nRestructuring and other costs \n66,835 \n41,023 \n167,317 \n153,825 \nTotal adjustments\n$\n66,835 \n$\n45,296 \n$\n181,352 \n$\n190,363 \nFinancial Condition\nOur cash and cash equivalents balance was $431 million as of September 30, 2025, a decrease of $49 million from December 31, 2024. For the nine months ended September 30, 2025, we had net cash provided by operating activities of $511 million, net cash used in investing activities of $488 million and net cash used in financing activities of $94 million. \nCash from operations decreased mainly due to lower net income, accelerated tax payments, higher interest payments and working capital changes compared to prior year. Working capital was primarily impacted by payments for strategic inventory investments we made in 2024 with deferred payment terms that did not repeat in 2025. We had $488 million in net cash used for investing activities primarily consisting of capital expenditures and acquisitions of $532 million. We had $94 million in net cash used in financing activities which comprised primarily of $543 million used to repay the principal amount of our 1.75% Unsecured Senior Notes and $421 million for dividends paid to shareholders, partially offset by $886 million in net proceeds from our commercial paper program.\nAccounts receivable increased $457 million, or 20.9%, from December 31, 2024. Inventory increased $359 million, or 6.5%. Accounts receivable and inventory were both impacted by an increase in revenues and related product demand in the nine months ended September 30, 2025. Accounts payable increased $177 million, or 3.0%, from December 31, 2024, in line with the increase in inventory. W\norking capital at any point in time is subject to many variables, including seasonality, inventory management and category expansion, the timing of cash receipts and payments, vendor payment terms, and fluctuations in foreign exchange rates. Total debt of $4.8 billion at September 30, 2025 increased $474 million, or 11.1%, from December 31, 2024.\nLiquidity and Capital Resources\nAs of September 30, 2025, we had \n$431 million\n of cash and cash equivalents, as well as $2 billion in undrawn capacity on our Revolving Credit Agreement, before giving effect to commercial paper borrowings. From time to time, we may enter into other credit facilities or financing arrangements to provide additional liquidity and to manage against foreign currency risk. We currently believe that the existing lines of credit, commercial paper program, and cash generated from operations will be sufficient to fund anticipated operations for the foreseeable future.\n28\nTable of Contents\nOn September 29, 2025, a supplier to our global automotive segment filed a voluntary petition for relief under Chapter 11 of the U.S. Bankruptcy Code. Purchases from this supplier represent approximately 3% of our global automotive segment SKUs and approximately 3% of our global automotive segment sales on an annualized basis. As of the date of this report, the supplier is operating and has continued to supply us with products and our focus remains on ensuring our supply chain continuity, and inventory availability for our customers. In addition, we are assessing our financial exposure related to this supplier, including amounts owed to us for vendor incentive compensation and other receivables outstanding as of the petition date.\nDepending on the course of the bankruptcy proceedings, or the changes in operational capabilities of this supplier,  we may need to seek alternative partners for inventory, which could result in higher costs, changes in product availability, extended lead times, and potential write‑downs or losses related to prepetition receivables. While we currently expect to meet customer demand in the near term based on existing inventories and confirmed purchase orders, the bankruptcy proceedings present uncertainties that could adversely affect our operations, financial condition, and results of operations.\nAs announced in 2024, our Board of Directors approved the termination of the frozen U.S. qualified defined benefit pension plan, effective September 30, 2024. Plan settlement will occur in the fourth quarter of 2025.  In connection with the anticipated settlement, we adjusted our investment strategy for our pension assets which resulted in lower pension income. As a result of this transaction, we expect to recognize a one-time pre-tax pension settlement charge in the range of $650 million to $750 million in the fourth quarter of 2025.\nOn February 18, 2025, we announced a 3% increase in the regular quarterly cash dividend for 2025. Our Board of Directors increased the cash dividend payable to an annual rate of $4.12 per share compared with the prior year dividend of $4.00 per share. We have paid a cash dividend every year since going public in 1948, and 2025 will mark the 69th consecutive year of increased dividends paid to shareholders.\nIn March 2025, we amended our Unsecured Revolving Credit Facility to expand the borrowing capacity from $1.5 billion to $2.0 billion and extend the maturity date to March 20, 2030. We also amended our commercial paper program to expand the borrowing capacity from $1.5 billion to $2.0 billion.\nAs of September 30, 2025, we had no outstanding borrowings under the Unsecured Revolving Credit Facility. Outstanding borrowings under our commercial paper program totaled $892 million, of which $500 million was used to repay the principal amount of our 1.75% Unsecured Senior Notes that matured on February 1, 2025. The net proceeds of the remaining borrowings are expected to be used for general corporate purposes.\nWe have a strong cash position and solid financial strength to pursue strategic growth opportunities through disciplined, strategic capital deployment. Our key priorities include the reinvestment in our businesses through capital expenditures, mergers and acquisitions, the dividend and share repurchases. We have plans for additional investments in our businesses to drive growth, improve efficiencies and productivity, and drive shareholder value. \nWe expect to be able to continue to borrow funds at reasonable rates over the long term. At September 30, 2025, our total average cost of debt was 3.93%, and we remain in compliance with all covenants connected with our borrowings.\nAny failure to comply with our debt covenants or restrictions could result in a default under our financing arrangements or could require us to obtain waivers from our lenders for failure to comply with these restrictions. The occurrence of a default that remains uncured or the inability to secure a necessary consent or waiver could create cross defaults under other debt arrangements and have a material adverse effect on our business, financial condition, results of operations and cash flows."
}