{
  "source_file": "gpn-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1 - BUSINESS\nGlobal Payments Inc. and its consolidated subsidiaries are referred to collectively as \"Global Payments,\" the \"Company,\" \"we,\" \"our\" or \"us,\" unless the context requires otherwise.  \nIntroduction\nWe are a leading payments technology company delivering innovative software and services to our customers globally, with worldwide reach spanning North America, Europe, Asia-Pacific and Latin America. The payments technology industry provides financial institutions, businesses and consumers with payment processing services, merchant acceptance solutions and related information and other value-added services. Our technologies, services and team member expertise allow us to provide a broad range of solutions that enable our customers to operate their businesses more efficiently across a variety of channels around the world. Headquartered in Georgia with approximately 27,000 team members worldwide, Global Payments is a Fortune 500 company and is a member of the S&P 500. Our common stock is traded on the New York Stock Exchange under the symbol \"GPN.\"\nBusiness Segments\nWe operate in two reportable segments: Merchant Solutions and Issuer Solutions. During the second quarter of 2023, we completed the sale of the consumer portion of our Netspend business, which comprised our former Consumer Solutions segment. See \"Note 18—Segment Information\" in the notes to the accompanying consolidated financial statements for additional information about our segments, including revenues, operating expenses, operating income and depreciation and amortization by segment, as well as financial information about geographic areas in which we operate.\nBusiness Transformation\nEarly in 2024, we launched a holistic review of our business to examine our strategy, operations and ability to deliver sustainable performance. We have refreshed our strategy and are focusing our resources, efforts and investments on the areas of the business that will drive the best opportunities for growth. \nWe are in the process of streamlining and simplifying our organization and operating environments through our transformation program to deliver a global, unified operating company. We are aligning the Global Payments brand identity across our assets and solidifying go-to-market activities under a common platform. In our Merchant Solutions segment, we are harmonizing capabilities and prioritizing small-and-medium sized businesses to deliver our full suite of differentiated software and commerce enablement solutions. In our Issuer Solutions segment, we are capitalizing on growth opportunities through our cloud modernization and cross-selling initiatives, while also leveraging the strategic value of this business to extend our capabilities across the payments value chain.\nWe have consolidated our technology organizations and teams under common leadership to enhance speed and quality of product development with a customer-centric, solutions-led mindset. We have also centralized our operations functions to enhance our servicing model and focus on improving the customer journey, leveraging best-in-class technology and providing differentiated service experiences for our clients. \nThese strategic, organizational and operational transformation activities are expected to be largely completed by the first half of 2027. We are also undertaking a strategic review of our business portfolio to evaluate potential assets for disposition to further streamline our business and create value for shareholders.\nRecent Business Acquisitions and Dispositions\nAcquisition of EVO Payments, Inc.\nIn March 2023, we completed the acquisition of EVO Payments, Inc. (“EVO”) for approximately $4 billion. EVO is a payment technology and services provider, offering payment solutions to merchants ranging from small and middle market enterprises to multinational companies and organizations across the Americas and Europe. The acquisition expands our geographic presence in attractive markets and augments our business-to-business (\"B2B\") software and payment solutions business and is included in our Merchant Solutions segment.\n5\nTable of Contents\nDisposition of AdvancedMD, Inc.\nIn December 2024, we completed the sale of AdvancedMD, Inc. (\"AdvancedMD\") for approximately $1 billion, subject to certain closing adjustments, and up to $125 million contingent upon the purchaser achieving certain specified returns. Prior to disposition, AdvancedMD provided software-as-a-service solutions to small-to-medium sized ambulatory physician practices in the United States and was included in our Merchant Solutions segment. \nDisposition of Consumer Business\nIn April 2023, we completed the sale of the consumer portion of our Netspend business for approximately $1 billion. Prior to disposition, the consumer business comprised our former Consumer Solutions segment and provided general purpose reloadable (\"GPR\") prepaid debit and payroll cards, demand deposit accounts and other financial service solutions to the underbanked and other consumers and businesses in the United States.\nDisposition of Gaming Business\nIn April 2023, we completed the sale of our gaming business for approximately $400 million. Prior to disposition, the gaming business offered a comprehensive suite of solutions, including credit and debit card cash advance, cashless advance, iGaming solutions, traditional and digital check processing and other services specific to the gaming market in North America and was included in our Merchant Solutions segment.\nSee \"Note 2—Acquisitions\" and “Note 3—Business Dispositions” in the notes to the accompanying consolidated financial statements for further discussion of these and other recent transactions.\nMerchant Solutions Segment\nThrough our Merchant Solutions segment, we provide payments technology and software solutions globally to primarily small- and-medium sized businesses and select mid-market and enterprise customers. Our payment technology solutions are similar around the world in that we enable our customers to accept card, check and digital-based payments. Our comprehensive offerings include, but are not limited to, authorization, settlement and funding services, customer support, chargeback resolution, reconciliation and dispute management services, terminal rental, sales and deployment, payment security services, consolidated billing and reporting.\nIn addition, we offer a wide array of business management software solutions that streamline business operations to customers in numerous vertical markets. We also provide a variety of commerce enablement solutions and services, including specialty point-of-sale (\"POS\") software, data analytics and customer engagement, human capital management and payroll, accounts receivable automation, inventory management and reporting that assist our customers with driving demand and operating their businesses more efficiently.\nOur value proposition is to provide distinctive high-quality, responsive and secure services to all of our customers. We go to market in Merchant Solutions globally across three lines of business, including Point-of-Sale and Software Solutions, Integrated and Embedded Solutions and Core Payments Solutions. This allows us to fully leverage our capabilities across vertical markets and geographies. We focus on providing differentiated customer service from the sales process, to onboarding, to ongoing support across our business. The majority of our revenue is generated by services priced as a percentage of transaction value or a specified fee per transaction, depending on the payment type or the market. We also earn software subscription and licensing fees, as well as other fees for specific value-added services, which may be unrelated to the number or value of transactions. \nDistribution Channels\nIn the Merchant Solutions segment, we actively market and provide our payment services, enterprise software solutions and other value-added services directly to our customers and through a variety of partner distribution channels across three business pillars: Point-of-Sale and Software Solutions, Integrated and Embedded Solutions and Core Payments Solutions. We have a wide array of distribution channels led by one of the premiere direct sales teams in the industry. Additionally, we go to market through our broad-based financial institution partnerships, joint ventures and wholesale and indirect relationships.\n6\nTable of Contents\nMany of our payment solutions are technology-enabled in that they incorporate or are incorporated into innovative, technology-driven solutions, including software solutions, designed to enable merchants to better manage their businesses. Our technology-enabled solutions represent a substantial component of our revenues.  \nPoint-of-Sale and Software Solutions\n. Our Point-of-Sale and Software Solutions business provide advanced payments technology that is integrated into point-of-sale systems and business management software solutions that we own. We have capabilities in cloud-based point-of-sale for restaurant and retail and leading software in other verticals including education (serving colleges, universities, and kindergarten through 12th grade level institutions), real estate (primarily property management), and communities (serving event organizers largely in the health and fitness market). Our Point-of-Sale and Software Solutions business offers a range of features which are being combined under our Global Payments brand identity across all of our assets. This includes unifying our POS businesses under a common brand, Genius, and leveraging our vast distribution channels to extend it globally. We expect to complete the rollout of our Genius POS solutions by the end of 2025.\nIntegrated and Embedded Solutions.\n Our Integrated and Embedded Solutions business provides advanced payments technology that is embedded into business management software solutions owned by our technology partners who operate in numerous vertical markets and countries. Further, we also integrate our capabilities with shopping carts, ordering platforms, marketplaces and other digitally-oriented businesses through the same embedded payment stack we leverage with more traditional, vertically-specific independent software vendors. We deliver these capabilities in physical and digital environments seamlessly. \nCore Payments Solutions. \nWe offer our core payments solutions through our direct sales forces worldwide, as well as referral partnerships. We offer our payments technology services, software and other commerce enablement solutions directly to customers across numerous verticals in the markets we serve. Although our primary focus is on building durable, direct relationships with merchants, we also provide our services to merchants referred by independent sales organizations (\"ISOs\") and financial institutions.\nCredit and Debit Card Transaction Processing\nCredit and debit card transaction processing includes processing the world's major international card brands, including, among others, American Express, Discover Card (\"Discover\"), JCB, Mastercard, UnionPay International and Visa, as well as certain domestic debit networks, such as Interac in Canada. Credit and debit networks establish uniform regulations that govern much of the payment card industry. During a typical payment transaction, the merchant and the card issuer do not interface directly with each other, but instead rely on payments technology companies, such as Global Payments, to facilitate transaction processing services, including authorization, electronic draft capture, file transfers to facilitate funds settlement and certain exception-based, back-office support services such as chargeback resolution.\nWe process funds settlement under two models: a sponsorship model and a direct membership model. Under the sponsorship model, member clearing financial institutions (\"Members\") sponsor us and require our adherence to the standards of the networks. In these markets, we have sponsorship or depository and clearing agreements with financial institution sponsors. These agreements allow us to route transactions under the Members' control and identification numbers to clear card transactions through Mastercard and Visa. In this model, the standards of the card networks restrict us from performing funds settlement or accessing merchant settlement funds and instead, require that these funds be in the possession of the Member until the merchant has been funded.\nUnder the direct membership model, we are direct members in various payment networks, allowing us to process and fund transactions without third-party sponsorship. Under this model, we route and clear transactions directly through the card brand’s network and are not restricted from performing funds settlement. Otherwise, we process these transactions similarly to how we process transactions in the sponsorship model. We are required to adhere to the standards of the various networks in which we are direct members. We maintain relationships with financial institutions, which may also serve as our Member sponsors for other card brands or in other markets, to assist with funds settlement.\nHow a Card Transaction Works\nA typical payment transaction begins when a cardholder presents a card for payment to a merchant, at which time card and transaction information, such as the card identification number, transaction date and transaction amount, is captured and transmitted to our network. The information is captured by a POS terminal card reader or mobile device card reader, which may be sold or leased to the merchant and serviced by us, through a POS device or ecommerce portal by one of a number of services that we offer directly, or through a value-added reseller. \n7\nTable of Contents\nAfter the card and transaction information is captured, the POS device or ecommerce portal automatically connects to our network through the internet or other communication channel in order to receive authorization of the transaction. For a credit card transaction, authorization services generally refer to the process in which the card issuer indicates whether a particular credit card is authentic and whether the impending transaction amount will cause the cardholder to exceed defined credit limits. In a debit card transaction, we obtain authorization for the transaction from the card issuer through the payment network verifying that the cardholder has access to sufficient funds for the transaction amount.\nAs an illustration, shown below in the sponsorship model, on a $100.00 card transaction the card issuer may fund the Member, our sponsor, (indirectly through the card network) $98.50 after retaining $1.50 referred to as an interchange fee. The card issuer would seek reimbursement of $100.00 from the cardholder in the cardholder's monthly credit card statement. The Member would, in turn, pay the merchant $100.00. The net settlement after this transaction would require us to advance the $1.50 interchange fee to the Member. After the end of the month, we would bill the merchant a percentage, also known as the merchant discount, of the transaction amount to cover the full amount of the interchange fee and our fee from the transaction. Assuming the merchant discount in the above example is 2%, we bill the merchant $2.00 after the end of the month for the transaction, reimburse ourselves for $1.50 in interchange fees that we have previously funded to the Member and retain $0.50 as our fee for the transaction. Under some arrangements, we remit the net amount of $98.00 to the merchant, rather than funding the full $100.00 and subsequently billing the merchant at the end of the month. \nDiscount rates vary based on negotiations with merchants and the economic characteristics of transactions and take many forms, such as interchange plus our fee or a bundled rate that includes all fees. Interchange rates also vary based on the economic characteristics of individual transactions. Accordingly, our fee per transaction varies across our merchant base and is subject to change based on changes in discount rates and interchange rates. Our revenues on a transaction generally reflects the merchant discount less interchange fees and payment network fees. Our profit is revenues less operating expenses, including systems costs to process the transaction and commissions paid to our sales force or external partner. Payment network fees are charged by the card brands, in part, based on the value of transactions processed through their networks.\n8\nTable of Contents\nIssuer Solutions Segment\nOur Issuer Solutions segment is a leading provider of comprehensive commerce solutions supporting the payment ecosystem for issuers. Our offerings include core processing, enterprise tokenization, cardholder payments, authorizations, card production, document production and archival, contact center services, managed services, fraud strategy, implementation services, consulting solutions and professional services. We also provide specialized solutions such as virtual cards, accounts payable and expense management, commercial processing and real-time alerts. \nWith the majority of revenues generated from software solutions, our operations serve diverse customer segments, including global, regional, community banks, credit unions, retailers, financial technology companies and neobanks. Our go-to-market approach leverages direct engagement and partnerships with aggregators to deliver innovative service offerings across core processing, commerce enablement, managed services and professional services. Our strategic focus on fraud detection, rewards management and commerce enablement positions us to expand opportunities across these key client segments and drive continued growth.\nWe are undertaking a comprehensive modernization of our Issuer Solutions segment, encompassing both technology and operations. These efforts enable us to deploy our cloud-native products and services across diverse market segments, use cases and geographic regions with increased agility and speed to market, all within a secure and compliant framework. The modernization of our core processing platform allows us to deliver enhanced, unified capabilities, greater operational efficiencies and innovative features for our clients, while also offering our full suite of capabilities in a modular format or as a comprehensive, integrated solution. We have completed the development of our client-facing applications in the cloud and remain on track for commercial launches throughout 2025. \nIssuer Solutions segment revenues are primarily derived from long-term processing contracts with financial institutions and other financial services providers. Payment processing services revenues are generated primarily from charges based on the number of accounts on file, transactions and authorizations processed, statements generated and/or mailed, managed services, cards embossed and mailed, and other processing services for cardholder accounts on file. Most of these customer contracts have prescribed annual minimums, penalties for early termination, and service level agreements that may affect contractual fees if specified service levels are not achieved. Issuer Solutions segment revenues also include software subscription, licensing fees, loyalty redemption services and professional services.\nIndustry Overview\nThe payments technology industry provides financial institutions, businesses and consumers with payment processing services, merchant acceptance solutions and related information and other value-added services. The industry continues to grow as a result of wider merchant acceptance and increased use of credit and debit cards, advances in payment solutions and processing technology and migration to ecommerce, omnichannel and contactless payment solutions. The proliferation of credit and debit cards, as well as other digital payment solutions, has made the acceptance of digital payments a necessity for many businesses, regardless of size, in order to remain competitive. Certain macroeconomic drivers have further accelerated the use of digital payments, the need for development of technologies and digital-based solutions and the expansion of ecommerce, omnichannel and contactless payment solutions. The increased use of cards and the availability of more sophisticated technology services to all market segments have resulted in an increasingly competitive and specialized industry. \nStrategy\nWe seek to become the worldwide partner of choice for commerce solutions by providing our clients with a broad suite of world-class, differentiated products and services that make everyday commerce better. We are also committed to excellence in execution, and delivering flawlessly at scale globally. \nWe benefit from the adoption of, and transition to, card and digital-based payments and are focused on expanding our share in our existing markets through software and service innovation leveraging our industry-leading direct and partner distribution channels, as well as through targeted bolt-on acquisitions to improve our offerings and scale. We also seek to enter and expand in markets through acquisitions, alliances and joint ventures around the world where we are best positioned for differentiation and scale. \nConsistent with this focus, we are pursuing the following strategic priorities:\n•\nEnhancing our capabilities in cloud-based POS and software with a focus on key vertical markets including restaurant, retail, education, real estate and communities;\n9\nTable of Contents\n•\nFurther investing in our leadership position in integrated payments and embedded solutions where we offer tailored operating models and commercial structures for partners and customers;\n•\nLeveraging our core payments channels globally to build on our broad capabilities, providing further growth opportunities; \n•\nProvide financial institutions, retailers and financial technology companies with leading end-to-end issuer processing services to launch, manage and deliver card programs for consumers, small and medium sized businesses and larger enterprises;\n•\nDeliver commerce enablement solutions globally to expand our leading position as a client-centric, product-led company; and\n•\nEnable frictionless, best-in-class customer experiences, creating longer-term relationships.\nCompetitive Strengths\nWe believe that our competitive strengths include the following:\n•\nTechnology Solutions - \nWe provide innovative technology-based solutions, including enterprise software and other ecommerce enablement solutions, that enable our customers to operate their businesses more efficiently, increase sales and simplify the payments process, regardless of the channel through which the transaction occurs. We believe our robust technology solutions will continue to differentiate us in the marketplace and position us for continued growth.\n•\nGlobal Footprint and Distribution\n - Our worldwide presence allows us to focus our investments on markets with promising gross domestic product fundamentals and favorable secular trends, makes us more attractive to certain customers with international operations and exposes us to emerging innovations that we can adopt globally, while diversifying our economic risk.\n \n•\nScalable Operating Environment and Technology Infrastructure\n - We operate with a multi-channel, global technology infrastructure that provides scalable and innovative service offerings and a consistent service experience to our merchants, customers, financial institutions and other partners worldwide, while also driving sustainable operating efficiencies.\n•\nStrong, Long-lasting Partner Relationships\n - We have established strong, long-lasting relationships with many financial institutions, enterprise software providers, value-added resellers and other technology-based payment service providers, which enable us to deliver a set of diverse solutions to our customers.\n•\nDisciplined Acquisition Approach\n - Our proven track record for selectively and successfully sourcing and closing acquisitions and joint ventures and integrating acquired businesses in existing and new markets positions us well for future growth and as an attractive partner for potential acquisition targets.\n10\nTable of Contents\nCompetition\nIn each of our business segments, we compete with a large variety of companies - financial institutions, financial technology companies, traditional payment providers, new market entrants, and others, both large and small. The markets for the services we provide are highly fragmented and competitive. Many of these providers compete with us across our segments, markets and geographies. Some of these competitors possess greater financial, sales and marketing resources than we do. We expect each of our segments to become more competitive over time, as advances in technology enable new entrants, barriers to entry fall and existing providers expand their services, both operationally and geographically.\nOur Merchant Solutions segment competes with financial institutions, merchant acquirers and other financial technology companies who provide businesses with merchant acquiring and related services. In the United States, we compete with a large number of providers, including but not limited to Fiserv, Inc. (\"Fiserv\"), Worldpay, LLC (\"Worldpay\"), Chase Paymentech Solutions, LLC, Elavon, Inc., a subsidiary of U.S. Bancorp, Bank of America Merchant Services, Wells Fargo Merchant Services, Toast, Inc., Stripe, Inc. (\"Stripe\"), Shopify Inc. and Block Inc. (\"Block\"). While these are our primary competitors in the merchant acquiring space, our vertically focused businesses in the United States compete with numerous other providers in their respective verticals.\nInternationally, financial institutions remain the primary providers of payment technology services to merchants, although the outsourcing of these services to third-party service providers is becoming more prevalent.  We compete outside the U.S. with financial institutions in the markets in which we operate, as well as both large providers (such as Worldpay, Worldline and Nexi) and new entrants (such as Adyen, Block and Stripe). We have seen competition internationally increase and expect that trend to continue as new companies enter our markets and existing competitors expand or consolidate their product lines and services. \nOur Issuer Solutions segment encounters competition from other third-party payment card processors, the card brands, core banking platform providers, independent software vendors, B2B providers, and various other firms that deliver services to payment card issuers in the markets we serve, as well as financial institutions who provide such services in-house. Our competitors in this segment include, but are not limited to, Fiserv, FIS, Marqeta, Nexi, Worldline, i2c, Bill.com, AvidExchange, Billtrust, Adyen, Stripe and Zeta. We expect the number of competitors in this segment to continue to expand.\nSee the section titled “Risk Factors - Risks Related to Our Business Model and Operations” for further information on the competitive and continuously evolving markets we serve.\nSafeguarding Our Business\nIn order to provide our services, we process and store sensitive business information and personal information, which may include credit and debit card numbers, bank account numbers, social security numbers, driver’s license numbers, names and addresses, and other types of personal information or sensitive business information. Some of this information is also processed and stored by financial institutions, merchants and other entities, as well as third-party service providers to whom we outsource certain functions and other agents, which we refer to collectively as our associated third parties. We may have responsibility to the card networks, financial institutions, and in some instances, our merchants, ISOs and/or individuals, for our failure or the failure of our associated third-party service providers (as applicable) to protect this information.\nFor a further discussion of our approach to cybersecurity, see \"Item 1C - Cybersecurity\" of this Annual Report on Form 10-K.\nIntellectual Property\nOur intellectual property is an important part of our strategy to be a leading provider of payment technology and software solutions. We use a combination of internal policies, intellectual property laws and contractual provisions to protect our proprietary technologies and brands. In addition, to protect our various brands, we seek and maintain registration of U.S. and international patents, copyrights, trade secrets, trademarks, service marks and domain names that align with our brand strategy. We also enforce our trademarks against potential sources of misunderstanding that could harm our brand and ability to compete. In addition to using our intellectual property in our own operations, we grant licenses to certain of our customers to use our intellectual property.\n11\nTable of Contents\nHuman Capital Management\nOur overall workforce strategies are developed and managed by our Chief Human Resources Officer, who reports to our CEO. More broadly, the board of directors and the Compensation Committee provide oversight on certain culture and human management topics, and succession plans for critical talent. We regularly engage with our team members through a variety of forums, including periodic surveys, to help us understand their perspectives related to workplace culture, engagement, talent management and well-being and to inform our human capital strategies and initiatives. The results of these interactions are also leveraged to further develop our talent management initiatives. Moreover, the board of directors also reviews critical feedback and receives updates on management’s plans in response thereto.\nTeam Member Population\nWe currently do business around the world, with approximately 27,000 team members living and working in 37 countries. As of December 31, 2024, approximately 56% of our workforce resided in the Americas, 21% in Europe and 23% in Asia Pacific. Many of our team members are highly skilled in technical areas specific to payment technology and software solutions.\nTalent Management and Retention\nWe place an emphasis on attracting and retaining highly skilled team members and having a workforce that is connected to the communities in which we work and live around the world. To that end, we have implemented programs and initiatives focused on enriching new hire experiences, developing team members through extensive training and professional development opportunities, including mentorship and leadership programs, promoting team members’ wellness and safety, and providing flexible work arrangements. Furthermore, we offer comprehensive and competitive pay and benefits packages, including paid parental leave, team member assistance, savings and retirement programs and equity-based awards that vest over a period of time to support retention of key contributors. We also strive to celebrate and recognize the efforts of our team members through a combination of programs, including team appreciation activities and awards programs to honor top performers and notable contributors.   \n \nHealth and Well-being\nThe success of our business is connected to the well-being of our team members. Accordingly, we are committed to the health, safety and wellness of our team members worldwide, and we provide team members with various health and wellness programs and benefits, including employee education and assistance programs that focus on physical, financial, family, social and emotional resources.\nPeople, Access and Belonging\nWe are committed to addressing the ever-changing needs of our team members and finding new ways to continuously enhance our culture. Our human capital strategy is centered around a focus on People, Access and Belonging (\"PAB\"), which reflects our holistic approach to fostering an inclusive and empowering workplace across our global organization.\nThese pillars guide our policies, practices and initiatives as we continue shaping a workplace culture that prioritizes engagement, equity and collaboration, empowering individuals across our global footprint. Our Compensation Committee assists the board of directors in overseeing the Company’s initiatives embodied in the PAB strategy.\nEmployee Growth and Development\nOur strategy to develop and retain the best talent includes an emphasis on team member development and training. We provide a variety of training and development opportunities to team members globally, including our online training platform that contains a vast array of tools and application resources for all team members to build learning experiences and skills. In order to help our team members strengthen the skills and behaviors needed for career advancement, our performance management program enables team members to drive their development with a focus on growth, performance, and well-being through regular meetings with their leaders. \n12\nTable of Contents\nGovernment Regulation\nVarious aspects of our business are subject to regulation and supervision under federal, state and local laws in the United States and foreign laws, regulations and rules. Many of these regulations and laws are evolving and their applicability and scope, as interpreted by courts and regulators, remain uncertain. These regulations and laws involve a variety of matters, including privacy and information security, data and personal information processing, money-transmission and payment instruments, consumer protection, anti-money laundering and anti-corruption, tax, environmental sustainability (including climate change) and human rights. In addition, we are subject to rules promulgated by the various payment networks, including Nacha, American Express, Discover, Interac, Mastercard and Visa. \nSet forth below is a brief summary of some of the significant laws and regulations that apply to us. These descriptions are not exhaustive, and these laws, regulations and rules frequently change and are increasing in number. We are currently in compliance in all material respects with applicable existing legal and regulatory requirements and do not expect that maintaining compliance with these regulations will have a material effect on our capital expenditures, earnings or competitive and financial positions. For additional information about government regulation and laws applicable to our business and the potential risks associated with future changes in laws or regulations, see \"Item 1A - Risk Factors\" of this Annual Report on Form 10-K.\nDodd-Frank Act\nThe Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (the \"Dodd-Frank Act\") restricts the amounts of debit card fees that certain institutions can charge merchants. Pursuant to regulations promulgated by the Federal Reserve Board, debit interchange rates for card issuers with assets of $10 billion or more are capped at $0.21 per transaction and an ad valorem component of 5 basis points to reflect a portion of the issuer's fraud losses plus, for qualifying issuers, an additional $0.01 per transaction in debit interchange for fraud prevention costs. \nIn addition, the Dodd-Frank Act limits the ability of payment card networks to impose certain restrictions because it allows merchants to: (i) set minimum dollar amounts (not to exceed $10) for the acceptance of a credit card (and allows federal governmental entities and institutions of higher education to set maximum amounts for the acceptance of credit cards) and (ii) provide discounts or incentives to encourage consumers to pay with cash, checks, debit cards or credit cards.\nThe rules also contain prohibitions on network exclusivity and merchant routing restrictions that require a card issuer to enable at least two unaffiliated networks on each debit card, prohibit card networks from entering into exclusivity arrangements and restrict the ability of issuers or networks to mandate transaction routing requirements. The prohibition on network exclusivity has not significantly affected the Company's ability to pass on network fees and other costs to our customers, nor do we expect it to in the future.\nConsumer Protection\nThe Dodd-Frank Act also created the Consumer Financial Protection Bureau (\"CFPB\"), which has responsibility for enforcing federal consumer protection laws, and the Financial Stability Oversight Council, which has the authority to determine whether any nonbank financial company, such as us, should be supervised by the Board of Governors of the Federal Reserve System (the \"Federal Reserve\") on the ground that it is \"systemically important\" to the U.S. financial system. Accordingly, we may be subject to additional systemic risk-related oversight in the future.\nThe CFPB has significant authority to regulate consumer financial products or services in the U.S., including consumer payments, and similar products or services. The FTC, state attorneys general and similar regulatory agencies in other jurisdictions may have broad consumer protection mandates that could result in the promulgation and interpretation of rules and regulations that may affect our business.\nFurthermore, certain of our businesses are regulated as money transmitters or otherwise require licensing in one or more states or jurisdictions, subjecting us to various licensing, supervisory and other requirements.\n13\nTable of Contents\nFinancial Institution Regulations\nBecause we provide digital payment processing services to banks and other financial institutions, we are subject to examination by the Federal Financial Institutions Examination Council (the \"FFIEC\"), an interagency body comprised primarily of federal banking regulators, and we are also subject to supervision or examination, as may be applicable, by various state and international financial regulatory agencies that supervise and regulate the financial institutions for which we provide digital payment processing and other payment related services. The FFIEC examines large data processors in order to identify and mitigate risks associated with systemically significant service providers, including specifically the risks they may pose to the banking industry.\nCertain of our subsidiaries hold payment institution (\"PI\") licenses. These subsidiaries are subject to regulation and oversight in the jurisdictions in which they operate. We hold PI licenses in Poland, Greece, Germany, Spain, Malta and the Czech Republic, as well as similar licenses in the United Kingdom. As a PI, each subsidiary is subject to regulation and oversight in the applicable jurisdiction, which includes, among other obligations, a requirement to maintain specific regulatory capital and adhere to certain rules regarding the conduct and operation of its business, including the revised Payment Services Directive and the requirements under the Digital Operational Resilience Act (\"DORA\") and reporting obligations in respect of the Central Electronic System of Payment Information. DORA came into effect in January 2025 and introduces a broad set of requirements applicable to financial institutions, including our European PIs, concerning the security of network and information systems supporting their business processes, in particular in relation to the management of information communication and technology (\"ICT\") risks. There will also be regulatory supervision of ICT service providers designated as “critical” by the European Supervisory Authorities, which may affect our Issuer Solutions segment; however, the decision relating to such designation has not yet been issued.\nPrivacy, Information Security and Other Business Practices Regulation\nAspects of our business are subject, directly or indirectly, to privacy and data protection regulations in the United States, the United Kingdom, the European Union (\"EU\") and elsewhere. In most of the countries in which we operate, these laws impose requirements on the manner in which personal information can be collected, processed, stored and shared. They also impose requirements, which vary materially by jurisdiction, in the event of a personal data breach.\nCompliance with the data protection regulations applicable to us or our customers requires increasing resources devoted to monitoring changes and developing solutions for our affected businesses. Maintaining compliance over time could require substantive technology infrastructure and process changes across many of the Company’s businesses. Noncompliance with the EU General Data Protection Regulation (“GDPR”), the Gramm-Leach-Bliley Act (\"GLBA\"), the California Privacy Rights Act and other state privacy laws or similar regulations could lead to substantial regulatory fines and penalties, or in some cases, damages resulting from private causes of action. Evolving data localization requirements or preferences may affect how we provide services to customers in regions like the EU and Asia-Pacific. Additionally, evolving sector-specific regulations that affect the payments industry may introduce overlap or conflict with data privacy regulations, and these conflicts in regulatory requirements may affect our operations. \nWe also rely upon third parties (such as suppliers and other partners) to facilitate or enable our business activities, and we require that they are similarly in compliance with applicable regulations. \nNew regulations (including the EU Artificial Intelligence Regulation, new state laws in the United States or a possible federal privacy law) and new interpretations of existing regulations, such as the Federal Trade Commission (\"FTC\") Act, GLBA, and the GDPR, could create new privacy rights for individuals and new obligations for companies handling personal information. These regulations could limit our ability to use and share personal or other data and increase costs related to compliance. In addition, emerging technologies including innovations in machine learning and artificial intelligence (\"AI\") are expected to continue to drive regulation targeted to the specific risks anticipated from these technologies.\nAs our portfolio of services evolves, we may offer more services outside of our traditional business-to-business interaction context. As we interact directly with consumers, in conjunction with our customers and partners or directly on our own behalf, our compliance obligations under privacy regulations may expand.\n14\nTable of Contents\nAnti-Money Laundering, Anti-Corruption and Sanctions Regulations\nIn many countries, we are legally or contractually required to comply with anti-money laundering laws and regulations, such as, in the United States, the Bank Secrecy Act, as amended by the USA PATRIOT Act, and similar laws of other countries, which require that customer identifying information be obtained and verified. In some countries, we are directly subject to these requirements; in other countries, we have contractually agreed to assist our sponsor financial institutions with their obligation to comply with anti-money laundering requirements that apply to them. In addition, we and our sponsor financial institutions are subject to the laws and regulations, enforced by the Office of Foreign Assets Control, that prohibit U.S. persons from engaging in transactions with certain prohibited persons or entities. Similar requirements apply in other countries. We have developed procedures and controls that are designed to monitor and address legal and regulatory requirements and developments and that allow our customers to protect against having direct business dealings with such prohibited countries, individuals or entities.\nWe are subject to anti-corruption laws and regulations, including the U.S. Foreign Corrupt Practices Act (“FCPA”), the U.K. Bribery Act of 2010 and other laws that generally prohibit the making or offering of improper payments to foreign government officials and political figures for the purpose of obtaining or retaining business or to gain an unfair business advantage. The FCPA has a broad reach and requires maintenance of appropriate records and adequate internal controls to prevent and detect possible FCPA violations.\nState Wage Payment Laws and Regulations\nThe use of payroll card programs in the United States as a means for an employer to remit wages or other compensation to its employees or independent contractors is governed by state labor laws related to wage payments, which laws are subject to change. The paycard portion of our business includes payroll cards and convenience checks and is designed to allow employers to comply with applicable state wage and hour laws. Most states permit the use of payroll cards as a method of paying wages to employees, either through statutory provisions allowing such use or, in the absence of specific statutory guidance, the adoption by state labor departments of formal or informal policies allowing for their use. Nearly every state allowing payroll cards places certain requirements and/or restrictions on their use as a wage payment method, the most common of which involve obtaining the prior written consent of the employee or independent contractors, limitations on fees and disclosure requirements.\nRecently, some states have begun to regulate earned wage access solutions, including, for example by enacting new laws requiring licensure of earned wage access providers and/or requiring fee restrictions on the solutions, or by including earned wage access services in existing lending laws, which could also result in licensure requirements and/or fee limitations. Also, states potentially could regulate these services under existing wage and hour laws related to the assignment of wages. We may be subject to additional requirements and limitations under federal or state lending laws as a result of new interpretations, formal guidance or additional regulations relating to earned wage access solutions.\nEscheat Laws\nWe are subject to unclaimed or abandoned property state laws in the United States and in certain foreign countries that require us to transfer to certain government authorities the unclaimed property of others that we hold when that property has been unclaimed for a certain period of time. Moreover, we are subject to audit by state and foreign regulatory authorities with regard to our escheatment practices.\nDebt Collection and Credit Reporting Laws\nPortions of our business may be subject to the Fair Debt Collection Practices Act (\"FDCPA\"), the Fair Credit Reporting Act (\"FCRA\") and similar state laws. The FDCPA is designed to eliminate abusive, deceptive and unfair debt collection practices and may require licensing at the state level. The FCRA regulates the use and reporting of consumer credit information and also imposes disclosure requirements on entities that take adverse action based on information obtained from credit reporting agencies.\nTelephone Consumer Protection Act\nWe are subject to the Telephone Consumer Protection Act (\"TCPA\") and various state laws to the extent we place telephone calls and short message service (\"SMS\") messages to customers and consumers. The TCPA regulates certain telephone calls and SMS messages placed using automatic telephone dialing systems or artificial or prerecorded voices.\n15\nTable of Contents\nOther\nIn addition, there are other laws, rules or regulations that may directly affect us or the activities of our merchant customers and in some cases may subject us to investigations, fees, fines and disgorgement of funds in the event we are deemed to have aided and abetted or otherwise provided the means and instrumentalities to facilitate the illegal activities of a merchant through our payment processing services.\nSustainability\nCertain governments around the world are adopting laws and regulations pertaining to sustainability performance, transparency and reporting. Regulators in Europe and the U.S. have also focused efforts on increased disclosure related to climate change and mitigation efforts. The EU recently adopted the European Sustainability Reporting Standards and the Corporate Sustainability Reporting Directive that impose disclosure of the risks and opportunities arising from social and environmental issues and on the effect of companies’ activities on people and the environment. In March 2024, the SEC adopted final rules that require disclosure of certain climate-related information; however, in April 2024, the SEC stayed the rules pending judicial review. In October 2023, California enacted three climate-related disclosure bills. International sustainability disclosure standards have also been produced (and further standards will be produced) under the auspices of the International Sustainability Standards Board, which some countries (such as the United Kingdom) have indicated they may incorporate into sustainability disclosure standards required of certain companies.\nWe continue to monitor these legislative and regulatory developments and are working continually to ensure that our sustainability agenda is integrated into our overall business strategy. As part of our annual sustainability reporting, we provide additional information about our approach to sustainability matters in our Global Responsibility Report (not incorporated herein), which is available in the investor relations section of our website at \nwww.globalpayments.com\n.\nWhere to Find More Information\nWe file annual and quarterly reports, proxy statements and other information with the SEC. You may read and print materials that we have filed with the SEC from its website at\n www.sec.gov\n. In addition, certain of our SEC filings, including our annual reports on Form 10-K, our quarterly reports on Form 10-Q, our current reports on Form 8-K and amendments to them can be viewed and printed, free of charge, from the investor relations section of our website at \nwww.globalpayments.com \nas soon as reasonably practicable after such material is electronically filed with or furnished to the SEC. \nCertain materials relating to our corporate governance, including our codes of ethics applicable to our directors, senior financial officers and other employees, also are available in the investor relations section of our website. Copies of our filings, specified exhibits and corporate governance materials are available, free of charge, by writing us using the address on the cover of this Annual Report on Form 10-K. You may also telephone our investor relations office directly at (770) 829-8478. We are not including the information on our website as a part of, or incorporating it by reference into, this Annual Report on Form 10-K.\n16\nTable of Contents",
  "item7": "ITEM 7 - MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \n \nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with \"Item 8 - Financial Statements and Supplementary Data\" of this Annual Report on Form 10-K. This discussion and analysis contains forward-looking statements about our plans and expectations of what may happen in the future. Forward-looking statements are based on a number of assumptions and estimates that are inherently subject to significant risks and uncertainties, and our actual results could differ materially from the results anticipated by our forward-looking statements as a result of many known and unknown factors, including, but not limited to, those discussed in \"Item 1A - Risk Factors\" of this Annual Report on Form 10-K. See \"Cautionary Notice Regarding Forward-Looking Statements\" located above in \"Item 1 - Business\" of this Annual Report on Form 10-K. \nWe operate in two reportable segments: Merchant Solutions and Issuer Solutions. During the second quarter of 2023, we completed the sale of the consumer portion of our Netspend business, which comprised our former Consumer Solutions segment. Our consolidated financial statements include the results of our former Consumer Solutions segment for periods prior to disposition. See \"Note 18—Segment Information\" in the notes to the accompanying consolidated financial statements for additional information about our segments.\nDiscussion of our results of operations for the year ended December 31, 2023 compared to the year ended December 31, 2022 that have been omitted under this item can be found in \"Part II, Item 7 - Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report on Form 10-K for the year ended December 31, 2023, which was filed with the United States Securities and Exchange Commission on February 14, 2024. \n \n38\nTable of Contents\nExecutive Overview\n \nWe are a leading payments technology company delivering innovative software and services to our customers globally. Our technologies, services and team member expertise allow us to provide a broad range of solutions that enable our customers to operate their businesses more efficiently across a variety of channels around the world. \nWe have grown organically, as well as through acquisitions, and continue to invest in new technology solutions, infrastructure to support our growing business and the ongoing consolidation and enhancement of our operating platforms. These investments include new product development and innovation to further enhance and differentiate our suite of technology and solutions available to customers, along with migration of certain underlying technology platforms to cloud environments to enhance performance, improve speed to market and drive cost efficiencies. We also continue to execute on integration and business transformation activities, such as combining business operations, streamlining technology infrastructure, eliminating duplicative corporate and operational support structures and realizing scale efficiencies. \nWe have furthered our business strategy through the following key transactions during 2024: \n•\nWe completed the sale of AdvancedMD, Inc. (\"AdvancedMD\") in December 2024 for approximately $1 billion, subject to certain closing adjustments, and up to $125 million contingent upon the purchaser achieving certain specified returns. AdvancedMD is a provider of software-as-a-service solutions to small-to-medium sized ambulatory physician practices in the United States and was included in our Merchant Solutions segment prior to disposition. We recognized a gain on the sale of $273.1 million during the year ended December 31, 2024.\n•\nOur capital structure initiatives during 2024 included the issuance of $2.0 billion in aggregate principal amount of 1.500% convertible senior notes due March 2031 through a private placement. In connection with the issuance of the notes, we entered into privately negotiated capped call transactions to hedge the potential dilutive effect upon conversion of the notes, or offset our cash obligation if the cash settlement option were to be elected, for amounts in excess of the principal amount of converted notes up to a cap price.\nHighlights related to our results of operations for the year ended December 31, 2024 include the following: \n•\nConsolidated revenues for the year ended December 31, 2024 increased to $10,105.9 million, compared to $9,654.4 million for the prior year. The increase in consolidated revenues was primarily due to growth in transaction volume. The year-over-year favorable effect on revenues from the EVO business acquired in March 2023 was offset by the unfavorable effect on revenues from the dispositions of our gaming and consumer businesses in April 2023.\n•\nMerchant Solutions and Issuer Solutions segment operating income and operating margin for the year ended December 31, 2024 increased compared to the prior year primarily due to the favorable effect of increases in revenues, as certain fixed costs do not vary with revenues. Merchant Solutions operating income for the year ended December 31, 2024 also reflected an increase related to the acquired EVO business, as the year ended December 31, 2023 only included the acquisition for a portion of the period. \n•\nConsolidated operating income for the year ended December 31, 2024 included the favorable effects of the increase in revenues as compared to the prior year, as well as lower acquisition and integration expenses and share-based compensation expense. These favorable effects were offset by expenses related to business transformation activities, a technology asset charge and an increase in amortization of acquired intangibles, primarily related to the acquisition of EVO as discussed in further detail below. Consolidated operating income for the year ended December 31, 2024 included the gain on the sale of AdvancedMD described above. Consolidated operating income for the year ended December 31, 2023 included the effects of the gain on the sale of our gaming business and the loss on the sale of our consumer business.\n39\nTable of Contents\nStrategy and Business Transformation\nEarly in 2024, we launched a holistic review of our business to examine our strategy, operations and ability to deliver sustainable performance. We have refreshed our strategy and are focusing our resources, efforts and investments on the areas of the business that will drive the best opportunities for growth. \nThese strategic, organizational and operational transformation activities are expected to continue over the next few years. As we focus on executing and delivering transformation initiatives, we have incurred and anticipate incurring incremental expenses related to the transformation and potential additional asset impairment charges through early 2027. We are also undertaking a strategic review of our business portfolio to evaluate potential assets for disposition to further streamline our business and create value for shareholders.\nWe currently expect our transformation initiatives to generate more than $600 million of annual run-rate operating income benefit by the first half of 2027. Refer to \"Item 1 - Business\" of this Annual Report on Form 10-K for further details regarding this business transformation initiative.\nContinuing and Emerging Trends\nThe payments technology industry continues to evolve and grow worldwide and as a result, certain large payment technology companies, including us, have expanded operations globally by pursuing acquisitions and creating alliances and joint ventures. We expect to continue to expand into new markets and pursue additional acquisitions and joint ventures in existing markets to increase our scale and improve our competitiveness.\nThe industry continues to grow globally as a result of wider merchant acceptance and increased use of credit and debit cards, advances in payment processing technology and migration to ecommerce, omnichannel and contactless payment solutions. The proliferation of credit and debit cards, as well as other digital payment solutions, has made the acceptance of digital payments a virtual necessity for many businesses, regardless of size, in order to remain competitive. Furthermore, the expanding digitization of the economy and availability and access to financial services increases the demand for cards and digital payment solutions, which in turn drives growth in acceptance and transaction volumes. We believe the increased use of cards and the availability of more sophisticated technology services to all market segments will continue to result in an increasingly competitive and specialized industry.\nThe use of digital payment solutions, the need for development of technologies and digital-based solutions and\n \nexpansion of ecommerce, omnichannel and contactless payment solutions has accelerated. We believe that the number of digital payment transactions will continue to grow and that an increasing percentage of these will be facilitated through emerging technologies. As a result, we expect an increasing portion of our future capital investment will be allocated to support the development of new and emerging technologies, including technology modernization, innovation and integration through strategic partnerships.\nWe also believe new markets will continue to develop and expand in areas that have been previously dominated by paper-based transactions. We expect industries such as education, government and healthcare, as well as recurring payments and business-to-business (\"B2B\") payments, to continue to see transactions migrate to digital-based solutions. We anticipate that the continued development of new services and technologies, the emergence of new vertical markets and continued expansion of technology-enabled ecommerce and omnichannel solutions, including expanded scale and market reach through new innovative cloud-based capabilities and strategic partnerships, will be a factor in the growth of our business and our revenues in the future. Furthermore, due to its benefits and growth potential, we anticipate the increased exploration of use of AI in the payments industry. \nFor a further discussion of trends, uncertainties and other factors that could affect our continuing operating results, see the section entitled \"Risk Factors\" in Item 1A of this Annual Report on Form 10-K.\nMacroeconomic Effects and Other Global Conditions\nWe are exposed to general economic conditions, including currency fluctuations, inflation, rising interest rates and other conditions that affect the overall level of consumer, business and government spending, which could negatively affect our financial performance. When adverse macroeconomic conditions arise, we evaluate where we may be able to implement cost-saving measures, including those related to headcount and discretionary expenses. We may also experience the effects of heightened geopolitical and economic instability or increased difficulty of conducting business in a country or region due to actual or potential political or military conflict or action. \n40\nTable of Contents\nCertain of our operations are conducted in foreign currencies. Consequently, a portion of our revenues and expenses has been and may continue to be affected by fluctuations in foreign currency exchange rates. A strengthening of the U.S. dollar or other significant fluctuations in foreign currency exchange rates could result in an adverse effect on our future financial results; however, we are unable to predict the extent of the potential effect on our financial results.\nWe have sought to reduce our interest rate risk through the issuance of fixed rate debt in place of variable rate debt and through interest rate swap hedging arrangements that convert a significant portion of the eligible variable rate borrowings under our revolving credit facility to a fixed rate. However, inflationary pressure or interest rate fluctuations could adversely affect our business and financial performance as a result of higher costs and/or lower consumer spending. In addition, continued inflation or a rise in interest rates could have an adverse effect on our future financial results and the recoverability of assets. However, as the future magnitude, duration and effects of these conditions are difficult to predict, we are unable to project the extent of the potential effect on our financial results.\nWe regularly maintain cash balances with financial institutions in excess of the Federal Deposit Insurance Corporation insurance limit or the equivalent outside the U.S. A disruption in financial markets could harm our banking partners, which could affect our ability to access our cash or cash equivalents, our ability to provide settlement services or our customers' ability to access their existing cash to fulfill their payment obligations to us. The occurrence of these events could negatively affect our business, financial condition and results of operations. \nFor a further discussion of trends, uncertainties and other factors that could affect our future operating results, see the section entitled \"Risk Factors\" in Item 1A of this Annual Report on Form 10-K.\nResults of Operations\nKey Drivers of our Results of Operations\nOur revenues for both of our segments are dependent upon the volume of payment transactions we process, cardholder accounts on file and other factors (referred to herein as \"transaction volume\"). As the majority of our services are priced as a percentage of transaction value or specified fee per unit or transaction, many under multi-year customer arrangements, our revenues generally grow period-over-period in line with the rate of increase in transaction volume. \nOur operating expenses consist primarily of amortization of intangible assets, the cost of the technology to provide services to our customers and our people costs to support the operations. Many of those costs do not vary directly with the level of payment transactions we process for our customers, generating operating leverage. As revenues increase, operating income and operating margin (operating income as a percentage of revenues) generally increase. \nWe also grow our business through strategic acquisitions of similar businesses. Our revenues increase from the transaction volume from the customers of the acquired businesses. As we integrate the businesses, we also are able to improve operating income and operating margin by generating synergies to lower the cost base of those businesses.\nRevenues\nMerchant Solutions. \nThe majority of our Merchant Solutions segment revenues is generated by services priced as a percentage of transaction value or a specified fee per transaction, depending on card type or industry vertical. We also earn software subscription and licensing fees, as well as other fees for specific value-added services that may be unrelated to the number or value of transactions. Merchant Solutions segment revenues depend upon a number of factors, such as demand for and price of our services, the technological competitiveness of our offerings, our reputation for providing timely and reliable service, competition within our industry and general economic conditions.\nWe provide payment technology and software solutions to customers and fund settlement either directly, in markets where we have direct membership with the payment networks, or through our relationship with a member financial institution in markets where we are sponsored. Revenues are generally recognized as billed to the customer, net of interchange fees and payment network fees. We market our services through a variety of distribution channels, including a direct sales force, trade associations, agent and enterprise software providers and referral arrangements with value-added resellers (\"VARs\"). We also provide services to merchants referred by ISOs, payment facilitators and financial institutions. In certain of these arrangements, the external partner receives a share of the customer profitability in the form of a monthly residual payment, which is reflected as a component of selling, general and administrative expenses in the accompanying consolidated statements of income. \n41\nTable of Contents\nIssuer Solutions. \nIssuer Solutions segment revenues are primarily derived from long-term processing contracts with financial institutions and other financial services providers. Payment processing services revenues are generated primarily from charges based on the number of accounts on file, transactions and authorizations processed, statements generated and/or mailed, managed services, cards embossed and mailed and other processing services for cardholder accounts on file. Most of these customer contracts have prescribed annual minimums, penalties for early termination and service level agreements that may affect contractual fees if specific service levels are not achieved. Issuer Solutions revenues also include loyalty redemption services, professional services, and fees from B2B payments services and other financial service solutions marketed to businesses, including software-as-a-service (“SaaS”) offerings that automate key procurement processes, provide invoice capture, coding and approval, and enable virtual cards and integrated payments options across a variety of key vertical markets.\nConsumer Solutions. \nDuring the second quarter of 2023, we completed the sale of the consumer portion of our Netspend business, which comprised our former Consumer Solutions segment. For the periods prior to disposition, our Consumer Solutions arrangements included a stand-ready performance obligation to provide account access and facilitate purchase transactions. Revenues principally consisted of fees collected from cardholders and fees generated by cardholder activity in connection with the programs that we managed. Customers were typically charged a fee for each purchase transaction made using their cards, unless the customer was on a monthly or annual service plan, in which case the customer was instead charged a monthly or annual subscription fee, as applicable. Customers were also charged a monthly maintenance fee after a specified period of inactivity. We also charged fees associated with additional services offered in connection with our accounts, including the use of overdraft features, a variety of bill payment options, card replacement, foreign exchange and card-to-card transfers of funds initiated through our call centers.\n \nRevenues were recognized net of fees charged by the payment networks for services they provided in processing transactions routed through them.\nOperating Expenses\nCost of Service. \nCost of service consists primarily of salaries, wages and related expenses paid to operations and technology-related personnel, including those who monitor our transaction processing systems and settlement functions; the cost of transaction processing systems, including third-party services; the cost of network telecommunications capability; depreciation and occupancy costs associated with the facilities supporting these functions; amortization of intangible assets; costs to fulfill customer contracts; provisions for operating losses; and, when applicable, integration costs. In our Issuer Solutions segment, cost of service also includes out-of-pocket reimbursable costs, such as postage and other production items.\nSelling, General and Administrative Expenses. \nSelling, general and administrative expenses consist primarily of salaries, wages, commissions and related expenses paid to sales personnel, customer support functions other than those supporting revenues, administrative employees and management; share-based compensation; costs to obtain customer contracts; residuals paid to ISOs; fees paid to VARs, independent contractors and other third parties; other selling expenses; depreciation and occupancy costs of leased space directly related to these functions; advertising costs; and, when applicable, acquisition and integration costs and business transformation costs. \nOperating Income and Operating Margin\nFor the purpose of discussing segment operations, we refer to \"operating income,\" which is calculated by subtracting segment direct expenses, including both cost of service and selling, general and administrative expenses, from segment revenues. Overhead and shared expenses, including share-based compensation, are not allocated to segment operations; they are reported in the caption \"Corporate.\" Impairment of goodwill and gains or losses on business dispositions are also not included in determining segment operating income. In addition, in discussing segment operations we refer to \"operating margin,\" which is calculated by dividing segment operating income by segment revenues.\nEquity in Income of Equity Method Investments\nWe have equity method investments, including a 45% interest in China UnionPay Data Co., Ltd., which we account for using the equity method of accounting. Equity in income of equity method investments reflects our proportional share of earnings from these investments.\n42\nTable of Contents\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023 \nThe following table sets forth key selected financial data for the years ended December 31, 2024 and 2023, this data as a percentage of total revenues, and the changes between periods in dollars and as a percentage of the prior-period amount. The income statement data for the years ended December 31, 2024 and 2023 is derived from the accompanying consolidated financial statements included in \"Item 8 - Financial Statements and Supplementary Data\" of this Annual Report on Form 10-K.\nYear Ended December 31,\nYear Ended December 31,\n(dollar amounts in thousands)\n2024\n% of Revenue\n(1)\n2023\n% of Revenue\n(1)\nChange\n% Change\nRevenues\n(2)\n:\nMerchant Solutions\n$\n7,688,703\n76.1 \n%\n$\n7,151,793\n74.1 \n%\n$\n536,910\n7.5 \n%\nIssuer Solutions\n2,483,657\n24.6 \n%\n2,398,870\n24.8 \n%\n84,787\n3.5 \n%\nConsumer Solutions\n—\n— \n%\n182,740\n1.9 \n%\n(182,740)\n(100.0)\n%\nIntersegment eliminations\n(66,466)\n(0.7)\n%\n(78,984)\n(0.8)\n%\n12,518\n(15.8)\n%\n          Consolidated revenues\n$\n10,105,894\n100.0 \n%\n$\n9,654,419\n100.0 \n%\n$\n451,475\n4.7 \n%\nOperating expenses\n(2)\n:\nCost of service:\nMerchant Solutions\n$\n2,008,126\n$\n1,925,880\n$\n82,246\n4.3 \n%\nIssuer Solutions\n1,795,001\n1,738,047\n56,954\n3.3 \n%\nConsumer Solutions\n—\n120,436\n(120,436)\n(100.0)\n%\nIntersegment eliminations\n(43,011)\n(56,842)\n13,831\n(24.3)\n%\nConsolidated cost of service\n$\n3,760,116\n37.2 \n%\n$\n3,727,521\n38.6 \n%\n$\n32,595\n0.9 \n%\nSelling, general and administrative:\nMerchant Solutions\n$\n3,067,662\n$\n2,880,658\n$\n187,004\n6.5 \n%\nIssuer Solutions\n246,214\n251,016\n(4,802)\n(1.9)\n%\nConsumer Solutions\n—\n66,212\n(66,212)\n(100.0)\n%\nCorporate\n994,886\n898,024\n96,862\n10.8 \n%\nIntersegment eliminations\n(23,455)\n(22,142)\n(1,313)\n5.9 \n%\nConsolidated selling, general and administrative\n$\n4,285,307\n42.4 \n%\n$\n4,073,768\n42.2 \n%\n$\n211,539\n5.2 \n%\nNet (gain) loss on business dispositions\n(273,134)\n136,744\n(409,878)\nNM\n          Consolidated operating expenses\n$\n7,772,289\n76.9 \n%\n$\n7,938,033\n82.2 \n%\n$\n(165,744)\n(2.1)\n%\nOperating income (loss)\n(2)\n:\nMerchant Solutions\n$\n2,612,915\n$\n2,345,255\n$\n267,660\n11.4 \n%\nIssuer Solutions\n442,442\n409,807\n32,635\n8.0 \n%\nConsumer Solutions\n—\n(3,908)\n3,908\n(100.0)\n%\nCorporate\n(994,886)\n(898,024)\n(96,862)\n10.8 \n%\nNet gain (loss) on business dispositions\n273,134\n(136,744)\n409,878\nNM\n          Consolidated operating income\n$\n2,333,605\n23.1 \n%\n$\n1,716,386\n17.8 \n%\n$\n617,219\n36.0 \n%\nOperating margin\n(2)\n:\nMerchant Solutions\n34.0 \n%\n32.8 \n%\n1.2 \n%\nIssuer Solutions\n17.8 \n%\n17.1 \n%\n0.7 \n%\nConsumer Solutions\n— \n%\n(2.1)\n%\nNM\nNM = Not meaningful\n43\nTable of Contents\n(1)\n Percentage amounts may not sum to the total due to rounding. \n(2) \nRevenues, operating expenses, operating income and operating margin reflect the effects of acquired businesses from the respective acquisition dates and the effects of disposed businesses through the respective disposal dates. See “Note 2—Acquisitions” and “Note 3—Business Dispositions” for further discussion.\nOperating income included acquisition and integration expenses of $211.6 million and $341.9 million for the years ended December 31, 2024 and 2023, respectively, which were primarily included within Corporate selling, general and administrative expenses. For the years ended December 31, 2024 and 2023, operating loss for Corporate also included $13.4 million and $18.5 million, respectively, of other charges related to facilities exit activities.\nDuring the year ended December 31, 2024, Corporate expenses also reflected costs of $99.1 million associated with our business transformation initiative, employee termination benefits of $99.6 million, which included $19.4 million of share-based compensation expense, and charges of $55.8 million for technology assets that will no longer be utilized under a revised technology architecture development strategy. \nRevenues\nConsolidated revenues for the year ended December 31, 2024 increased by $451.5 million, or 4.7%, to $10,105.9 million from $9,654.4 million in the prior year. \nMerchant Solutions Segment. \nRevenues from our Merchant Solutions segment for the year ended December 31, 2024 increased by $536.9 million, or 7.5%, to $7,688.7 million from $7,151.8 million in the prior year.\nThe increase in segment revenues was primarily due to the $479.5 million effect of higher transaction volume. In addition, our acquisition of EVO in March 2023 contributed $189.3 million to segment revenue growth during the year ended December 31, 2024, as the year ended December 31, 2023 only included the acquisition for a portion of the period. The revenues of the EVO business include the cross-selling of our service offerings into the acquired EVO customer base and other benefits to revenues from initiatives of the combined organization. There were no other material factors contributing to the change in segment revenues.\nIssuer Solutions Segment. \nRevenues from our Issuer Solutions segment for the year ended December 31, 2024 increased by $84.8 million, or 3.5%, to $2,483.7 million from $2,398.9 million in the prior year. The increase in revenues was primarily due to an increase in transaction volume of $74.3 million driven by cardholder activity.\nConsumer Solutions Segment. \nThe year ended December 31, 2023 included revenues of $182.7 million related to the consumer business disposed of in April 2023.\nOperating Expenses\nCost of Service. \nCost of service for the year ended December 31, 2024 increased by $32.6 million, or 0.9%, to $3,760.1 million from $3,727.5 million in the prior year. Cost of service as a percentage of revenues decreased to 37.2% for the year ended December 31, 2024 from 38.6% in the prior year. \nMerchant Solutions Segment.\n Cost of service from our Merchant Solutions segment for the year ended December 31, 2024 increased by $82.2 million, or 4.3%, to $2,008.1 million from $1,925.9 million in the prior year. Cost of service as a percentage of segment revenues decreased to 26.1% for the year ended December 31, 2024 from 26.9% in the prior year. The effects of the acquired EVO business on cost of service was an increase of $73.0 million in the year ended December 31, 2024 compared to the prior year, and an unfavorable impact on cost of service as a percentage of segment revenues of 0.3%. Cost of service as a percentage of revenue was lower due to improved operating leverage and synergies related to the EVO acquisition.\nIssuer Solutions Segment. \nCost of service from our Issuer Solutions segment for the year ended December 31, 2024 increased by $57.0 million, or 3.3%, to $1,795.0 million from $1,738.0 million in the prior year due to costs that vary with revenues. Cost of service as a percentage of segment revenues decreased to 72.3% for the year ended December 31, 2024 from 72.5% in the prior year primarily as a result of costs that do not vary with revenues, including the effects of amortization and depreciation as discussed below, generating operating leverage.\n44\nTable of Contents\nConsumer Solutions Segment. \nThe year ended December 31, 2023 included cost of service of $120.4 million related to the consumer business disposed of in April 2023. Our consumer business had a higher cost of service as a percentage of segment revenues relative to our Merchant Solutions and Issuer Solutions segments and the disposition had the effect of reducing consolidated cost of service as a percentage of revenues by 0.5% for the year ended December 31, 2023.\nAmortization of Acquired Intangible Assets.\n The most significant component of our cost of service is amortization of acquired intangibles, which was $1,369.3 million and $1,318.5 million, or approximately 36% and 35% of cost of service for the years ended December 31, 2024 and 2023, respectively. These costs generally do not vary in proportion to changes in revenues, but rather are most significantly affected by acquisition activities. The effects of the acquired EVO business on amortization expense was an increase of $67.6 million for the year ended December 31, 2024.\nSelling, General and Administrative Expenses. \nSelling, general and administrative expenses for the year ended December 31, 2024 increased by $211.5 million, or 5.2%, to $4,285.3 million from $4,073.8 million in the prior year. Selling, general and administrative expenses as a percentage of revenues was 42.4% for the year ended December 31, 2024, compared to 42.2% in the prior year. \nMerchant Solutions Segment. \nSelling, general and administrative expenses from our Merchant Solutions segment for the year ended December 31, 2024 increased by $187.0 million, or 6.5%, to $3,067.7 million from $2,880.7 million in the prior year. Selling, general and administrative expenses as a percentage of segment revenues was 39.9% for the year ended December 31, 2024, compared to 40.3% in the prior year. The effects of the acquired EVO business on selling, general and administrative expenses was an increase of $72.0 million for the year ended December 31, 2024 compared to the prior year, and a favorable impact on selling, general and administrative expenses as a percentage of segment revenues of 0.1%. The remainder of the increase in selling, general and administrative expenses for the year ended December 31, 2024 was due to costs that vary with revenues of $32.0 million, depreciation expense of $32.4 million and software license related expenses of $23.1 million. \nIssuer Solutions Segment. \nSelling, general and administrative expenses from our Issuer Solutions segment for the year ended December 31, 2024 decreased by $4.8 million, or 1.9%, to $246.2 million from $251.0 million in the prior year. Selling, general and administrative expenses as a percentage of segment revenues was 9.9% for the year ended December 31, 2024, compared to 10.5% in the prior year, primarily due to fixed costs that do not vary with revenues.\nConsumer Solutions Segment. \nThe year ended December 31, 2023 included selling, general and administrative expenses of $66.2 million related to the consumer business disposed of in April 2023. The disposition had the effect of increasing consolidated selling, general and administrative expenses as a percentage of revenues by 0.1% for the year ended December 31, 2023.\nCorporate. \nCorporate expenses for the year ended December 31, 2024 increased by $96.9 million, or 10.8%, to $994.9 million from $898.0 million in the prior year. The higher amount of corporate expenses was primarily driven by charges incurred in the year ended December 31, 2024, including $99.1 million associated with our business transformation initiative, $80.1 million related to employee termination benefits, which excludes share-based compensation expense, and $55.8 million for technology assets that will no longer be utilized under a revised technology architecture development strategy. These increases were partially offset by lower acquisition and integration expenses of $130.3 million, as we completed the acquisition of EVO in March 2023, and lower share-based compensation expense of $44.8 million. The lower share-based compensation expense is primarily due to higher expense in the year ended December 31, 2023 related to the retirement of eligible executives and departure of our previous CEO.     \nOperating Income and Operating Margin\nConsolidated operating income for the year ended December 31, 2024 was $2,333.6 million, compared to $1,716.4 million for the prior year. Consolidated operating margin for the year ended December 31, 2024 was 23.1% compared to 17.8% for the prior year.\n•\nConsolidated operating income and operating margin for the year ended December 31, 2024 included the effects of a $273.1 million gain on the sale of AdvancedMD, compared to a $243.6 million net loss on the sale of our consumer business and a $106.9 million gain on the sale of our gaming business in the prior year. The combination of these items increased operating income by $409.9 million and had a favorable effect on operating margin of approximately 4.1% for the year ended December 31, 2024;\n•\nConsolidated operating income reflected higher corporate costs, as described above, which had an unfavorable effect on operating margin of approximately 2.5% for the year ended December 31, 2024;\n45\nTable of Contents\n•\nMerchant Solutions segment operating income increased $267.7 million and operating margin increased 1.2% primarily due to the favorable effect of the increase in revenues, since certain fixed costs do not vary with revenues. In addition, the inclusion of EVO had an unfavorable effect on the Merchant Solutions operating margin of 0.3% for the year ended December 31, 2024 as compared to the prior year; and\n•\nIssuer Solutions segment operating income increased $32.6 million and operating margin increased 0.7% primarily due to the favorable effect of the increase in revenues, since certain fixed costs do not vary with revenues.\nOther Income and Expense, Net\nInterest and other income for the year ended December 31, 2024 increased $55.5 million to $169.2 million, compared to $113.7 million for the prior year primarily due to an increase of $31.6 million in interest income on the seller financing notes that were issued in connection with the sales of our consumer and gaming businesses in April 2023 and a gain of $18.8 million recognized during the year ended December 31, 2024 in connection with the release and conversion of a portion of our Visa convertible preferred shares. See \"Note 8—Other Assets\" in the notes to the accompanying consolidated financial statements for a further discussion of our Visa preferred shares. \nInterest and other expense for the year ended December 31, 2024 decreased $26.2 million to $634.0 million, compared to $660.2 million for the prior year primarily due to lower average interest rates on outstanding borrowings. Interest and other expense for the year ended December 31, 2023 also included a noncash charge of $15.2 million for the estimated future credit losses on the new seller financing notes receivable.\nIncome Tax Expense\nOur effective income tax rates for the years ended December 31, 2024 and 2023 were 15.8% and 17.9%, respectively. The effective tax rate for the year ended December 31, 2024 was lower because the effective tax rate for the year ended December 31, 2023 reflects recognition of a gain on the dispositions of our consumer and gaming businesses for income tax reporting purposes, while an aggregate net loss on the dispositions was recognized for financial reporting purposes. \nOn August 16, 2022, the U.S. government enacted the Inflation Reduction Act into law, which, among other things, implemented a 15% corporate alternative minimum tax based on global adjusted financial statement income and a 1% excise tax on share repurchases effective beginning January 1, 2023. The corporate alternative minimum tax did not have a material effect on our reported results, cash flows or financial position. During the year ended December 31, 2024 and 2023, we reflected excise taxes of $15.6 million and $3.9 million, respectively, within equity as part of the cost of common stock repurchased, net of share issuances, during the period.\nDuring the year ended December 31, 2024, additional jurisdictions globally enacted local legislation formally adopting the Global Anti-Base Erosion Model Rules (\"Pillar Two\"), which generally provides for a minimum effective tax rate of 15%, as established by the Organization for Economic Co-operation and Development (\"OECD\") Pillar Two Framework. The effective dates are generally January 1, 2024, and January 1, 2025, for different aspects of the rules and vary by jurisdiction. Additional jurisdictions are expected to implement the model rules under local law in the future, with varying effective dates. The Pillar Two directive did not have a material effect on our financial statements for the year ended December 31, 2024, and we are continuing to evaluate the potential effect on future periods of the Pillar Two implementation, pending legislative adoption by additional individual countries and the ongoing issuance of additional administrative guidance by the OECD.\nNet Income Attributable to Noncontrolling Interests\nNet income attributable to noncontrolling interests increased $31.2 million to $73.8 million, compared to $42.6 million for the prior year primarily due to redemption price adjustments related to our subsidiary in Greece, which is discussed in further detail in \"Note 16—Noncontrolling Interests\" in the notes to the accompanying consolidated financial statements. \nNet Income Attributable to Global Payments\nNet income attributable to Global Payments was $1,570.4 million compared to $986.2 million for the prior year, reflecting the changes noted above.\n46\nTable of Contents\nDiluted Earnings per Share\nDiluted earnings per share was $6.16 compared to $3.77 for the prior year. Diluted earnings per share for the year ended December 31, 2024 reflects the changes in net income noted above and a decrease in diluted weighted-average number of shares outstanding for the year ended December 31, 2024 compared to the prior year primarily due to the cumulative effect of share repurchases.\nLiquidity and Capital Resources \nWe have numerous sources of capital, including cash on hand and cash flows generated from operations as well as various sources of financing. \nIn the ordinary course of our business, a significant portion of our liquidity comes from operating cash flows and borrowings, including the capacity under our revolving credit facility. \nOur capital allocation priorities are to pay dividends, to repurchase shares of our common stock, to pursue acquisitions that meet our corporate objectives, to make planned capital investments in our business and to pay principal and interest on our outstanding debt. \nOur significant contractual cash requirements also include ongoing payments for lease liabilities and \ncontractual obligations related to service arrangements with suppliers for fixed or minimum amounts, which primarily relate to software, technology infrastructure and related services. Commitments under our borrowing arrangements are further described in \"Note 9—Long-Term Debt and Lines of Credit\"\n in the notes to the accompanying consolidated financial statements and below under \"Long-Term Debt and Lines of Credit.\" For additional information regarding our other cash commitments and contractual obligations, \nsee \"Note 7—Leases\" and “Note 19—Commitments and Contingencies” in the notes to the accompanying consolidated financial statements.\nOur capital plan objectives are to support our operational needs and strategic plan for long-term growth while optimizing our cost of capital and financial position. To supplement cash from operating activities, we use a combination of bank financing, such as borrowings under our credit facilities, commercial paper program and senior note issuances for general corporate purposes and to fund acquisitions. Our commercial paper program provides a cost effective means of addressing our short-term liquidity needs and is backstopped by our revolving credit agreement, in that the amount of commercial paper notes outstanding cannot exceed the undrawn portion of our revolving credit facility. Finally, specialized lines of credit are also used in certain of our markets to fund merchant settlement prior to receipt of funds from the card networks. \nWe regularly evaluate our liquidity and capital position relative to cash requirements, and we may elect to raise additional funds in the future through the issuance of debt or equity or by other means. Accumulated cash balances are invested in high-quality, marketable short-term instruments. We believe that our current and projected sources of liquidity will be sufficient to meet our projected liquidity requirements associated with our operations for the near and long term.\nAt December 31, 2024, we had cash and cash equivalents totaling $2,538.4 million. Of this amount, we considered $1,067.5 million to be available for general purposes, of which $60.5 million is undistributed foreign earnings considered to be indefinitely reinvested outside the United States. The available cash of $1,067.5 million does not include the following: (i) settlement-related cash balances, (ii) funds held as collateral for merchant losses (\"Merchant Reserves\") and (iii) certain funds held for customers. Settlement-related cash balances represent funds that we hold when the incoming amount from the card networks precedes the funding obligation to the merchant. Settlement-related cash balances are not restricted in their use; however, these funds are generally paid out in satisfaction of settlement processing obligations the following day. Merchant Reserves serve as collateral to minimize contingent liabilities associated with any losses that may occur under the merchant's agreement. While this cash is not restricted in its use, we believe that designating this cash as a Merchant Reserve strengthens our fiduciary standing with our member sponsors. Funds held for customers, which are not restricted in their use, include amounts collected before the corresponding obligation is due to be settled to or at the direction of our customers.\nWe also had restricted cash of $197.6 million as of December 31, 2024, \nrepresenting amounts under legal restriction, amounts deposited by customers for prepaid card transactions and funds held as a liquidity reserve. These balances are subject to local regulatory restrictions requiring appropriate segregation and restriction in their use.\nOperating activities provided net cash of $3,532.7 million and $2,248.7 million for the years ended December 31, 2024 and 2023, respectively, which reflect net income adjusted for noncash items, including depreciation, amortization, the provision for credit losses and the net gain or loss on business dispositions, and changes in operating assets and liabilities. The increase in cash flows from operating activities from the prior year was due to general improvement in the results of the business and assets and liabilities that are affected primarily by timing of month-end and transaction volume, including changes in settlement processing assets and obligations. \n47\nTable of Contents\nWe used net cash in investing activities of $173.9 million and $4,361.1 million during the years ended December 31, 2024 and 2023, respectively. Cash used for investing activities primarily represents cash used to fund acquisitions and capital expenditures. During the years ended December 31, 2024 and 2023, we used cash of $487.1 million and $4,225.6 million, respectively, for acquisitions. We made capital expenditures of $674.9 million and $658.1 million during the years ended December 31, 2024 and 2023, respectively. These investments include software and hardware to support the development of new technologies, infrastructure to support our growing business and the consolidation and enhancement of our operating platforms. These investments also include new product development and innovation to further enhance and differentiate our suite of technology and cloud-based solutions available to customers. We expect to continue to make capital investments in the business, and we anticipate capital expenditures to be approximately $800 million during the year ending December 31, 2025. Additionally, investing cash flows for the year ended December 31, 2024 includes net cash received of $981.4 million from the sale of AdvancedMD and our investments in Visa common shares. Investing cash flows for the year ended December 31, 2023 includes the net effect on cash from the sale of our consumer and gaming businesses, and cash received from the sale of our investments in Visa common shares of $42.1 million. \nFinancing activities include borrowings and repayments made under our various debt arrangements, as well as borrowings and repayments made under specialized lines of credit to fund daily settlement activities. Our borrowing arrangements are further described in \"Note 9—Long-Term Debt and Lines of Credit\" in the notes to the accompanying consolidated financial statements and below under \"Long-Term Debt and Lines of Credit.\" Financing activities also include cash flows associated with common stock repurchase programs and share-based compensation programs, cash distributions made to our shareholders and cash contributions from and distributions to noncontrolling interests. We used net cash in financing activities of $2,766.9 million during the year ended December 31, 2024, and financing activities provided net cash of $2,141.1 million during the year ended December 31, 2023.\nProceeds from long-term debt were $9,635.0 million and $10,336.9 million for the years ended December 31, 2024 and 2023, respectively. Repayments of long-term debt were $8,334.8 million and $9,099.9 million for the years ended December 31, 2024 and 2023, respectively. Proceeds from and repayments of long-term debt consist of borrowings and repayments that we make with available cash, from time to time, under our revolving credit facility, as well as scheduled principal repayments we make on our senior notes, finance leases and other vendor financing arrangements. During the year ended December 31, 2024 and 2023, we had net repayments of $1,371.6 million and net borrowings of $1,371.6 million, respectively, under our commercial paper program. Furthermore, in connection with the issuance of convertible notes in February 2024, we paid $256.3 million to purchase privately negotiated capped call transactions to hedge the potential dilutive effect upon conversion of the notes, or offset our cash obligation if the cash settlement option were to be elected. See section \"Long-Term Debt and Lines of Credit\" below for further discussion of our recent debt transactions. \nActivity under our settlement lines of credit is affected primarily by timing of month-end and transaction volume. During the years ended December 31, 2024 and 2023, we had net repayments of $442.7 million and net borrowings of $220.7 million, respectively, under our settlement lines of credit.\nWe repurchase our common stock mainly through open market repurchase plans and, at times, through accelerated share repurchase (\"ASR\") programs. During the years ended December 31, 2024 and 2023, we used $1,552.0 million and $418.3 million, respectively, to repurchase and retire 12.7 million and 4.1 million shares of our common stock, respectively. The share repurchase activity for the year ended December 31, 2024 included the repurchase of 1,414,759 shares using a portion of the net proceeds from our offering of 1.500% convertible senior notes due March 2031 through privately negotiated transactions with purchasers of notes in the offering, or one of their respective affiliates. The purchase price per share of the common stock repurchased in such transactions equaled the closing price of the common stock on February 20, 2024, which was $130.80 per share. The share repurchase activity for the year ended December 31, 2024 also included the repurchase of 5,320,781 shares at an average price of $112.77 per share under an ASR agreement we entered into on October 30, 2024 with a financial institution to repurchase an aggregate of $600.0 million of our common stock during the ASR program purchase period. This ASR program was completed on December 20, 2024. \nOn October 24, 2024, our board of directors approved an increase to our existing share repurchase program authorization, which raised the total available authorization to $2.5 billion. As of December 31, 2024, the remaining amount available under our share repurchase program was $1,850.0 million.\nWe paid dividends to our common shareholders in the amounts of $252.8 million and $260.4 million during the years ended December 31, 2024 and 2023, respectively. We made distributions to noncontrolling interests in the amount of $38.1 million and $33.0 million during the years ended December 31, 2024 and 2023, respectively.\n48\nTable of Contents\nOn January 30, 2025, our board of directors declared a cash dividend of $0.25 per share payable on March 28, 2025 to common shareholders of record as of March 14, 2025.\nLong-Term Debt and Lines of Credit \nSenior Notes\nWe have $11.1 billion in aggregate principal amount of senior unsecured notes outstanding as of December 31, 2024, which mature at various dates ranging from February 2025 to August 2052. Interest on the senior notes is payable annually or semi-annually at various dates. Each series of the senior notes is redeemable, at our option, in whole or in part, at any time and from time to time at the redemption prices set forth in the related indenture.\nOn March 17, 2023, we issued €800 million aggregate principal amount of 4.875% senior unsecured notes due March 2031 and received net proceeds of €790.6 million, or $843.6 million based on the exchange rate on the issuance date. We issued the senior notes at a discount of $2.8 million, and we incurred debt issuance costs of $7.2 million, including underwriting fees, fees for professional services and registration fees, which were capitalized and reflected as a reduction of the related carrying amount of the notes in our consolidated balance sheet. Interest on the senior unsecured notes is payable annually in arrears on March 17 of each year, commencing March 17, 2024. The notes are unsecured and unsubordinated indebtedness and rank equally in right of payment with all of our other outstanding unsecured and unsubordinated indebtedness. The net proceeds from the offering were used for general corporate purposes.\nOn August 22, 2022, we issued $2.5 billion aggregate principal amount of senior unsecured notes consisting of the following: (i) $500.0 million aggregate principal amount of 4.950% senior notes due August 2027; (ii) $500.0 million aggregate principal amount of 5.300% senior notes due August 2029; (iii) $750.0 million aggregate principal amount of 5.400% senior notes due August 2032; and (iv) $750.0 million aggregate principal amount of 5.950% senior notes due August 2052. We issued the senior notes at a total discount of $5.2 million, and we incurred debt issuance costs of $24.8 million, including underwriting fees, fees for professional services and registration fees, which were capitalized and reflected as a reduction of the related carrying amount of the notes in our consolidated balance sheet. Interest on the senior unsecured notes is payable semi-annually in arrears on February 15 and August 15 of each year, commencing February 15, 2023. The notes are unsecured and unsubordinated indebtedness and rank equally in right of payment with all of our other outstanding unsecured and unsubordinated indebtedness. The net proceeds from the offering were used to refinance the outstanding indebtedness under our credit facility, to make cash payments and pay transaction fees and expenses in connection with the acquisition of EVO and for general corporate purposes.\nOn November 22, 2021, we issued $2.0 billion aggregate principal amount of senior unsecured notes consisting of the following: (i) $500.0 million aggregate principal amount of 1.500% senior notes due November 2024; (ii) $750.0 million aggregate principal amount of 2.150% senior notes due January 2027; and (iii) $750.0 million aggregate principal amount of 2.900% senior notes due November 2031. We incurred debt issuance costs of approximately $14.4 million, including underwriting fees, fees for professional services and registration fees, which were capitalized and reflected as a reduction of the related carrying amount of the notes in our consolidated balance sheet. Interest on the senior unsecured notes is payable semi-annually in arrears on May 15 and November 15 for the 2024 and 2031 notes and January 15 and July 15 on the 2027 note, commencing May 15, 2022 for the 2024 note and the 2031 note and July 15, 2022 for the 2027 note. The notes are unsecured and unsubordinated indebtedness and rank equally in right of payment with all of our other outstanding unsecured and unsubordinated indebtedness. We used the net proceeds from the offering to repay the outstanding indebtedness under our prior credit facility and for general corporate purposes. In November 2024, we repaid our $500.0 million aggregate principal amount of 1.500% senior notes upon maturity.\nWe have $1.1 billion in aggregate principal amount of 1.200% senior unsecured notes due March 2026. We incurred debt issuance costs of approximately $8.6 million, including underwriting fees, fees for professional services and registration fees, which were capitalized and reflected as a reduction of the related carrying amount of the notes in our consolidated balance sheet. Interest on the notes is payable semi-annually in arrears on March 1 and September 1 of each year, commencing September 1, 2021. The notes are unsecured and unsubordinated indebtedness and rank equally in right of payment with all of our other outstanding unsecured and unsubordinated indebtedness. We used the net proceeds from this offering to fund the redemption in full of the 3.800% senior unsecured notes due April 2021, to repay a portion of the outstanding indebtedness under our prior credit facility and for general corporate purposes.\n49\nTable of Contents\nWe have $1.0 billion in aggregate principal amount of 2.900% senior unsecured notes due May 2030. Interest on the notes is payable semi-annually in arrears on May 15 and November 15 of each year, commencing November 15, 2020. The notes are unsecured and unsubordinated indebtedness and rank equally in right of payment with all of our other outstanding unsecured and unsubordinated indebtedness. We issued the senior notes at a total discount of $3.3 million and capitalized related debt issuance costs of $8.4 million.\nWe have $3.0 billion in aggregate principal amount of senior unsecured notes consisting of the following: (i) $1.0 billion aggregate principal amount of 2.650% senior notes due 2025; (ii) $1.25 billion aggregate principal amount of 3.200% senior notes due 2029; and (iii) $750.0 million aggregate principal amount of 4.150% senior notes due 2049. Interest on the senior notes is payable semi-annually in arrears on each February 15 and August 15, beginning on February 15, 2020. Each series of the senior notes is redeemable, at our option, in whole or in part, at any time and from time to time at the redemption prices set forth in the related indenture. We issued the senior notes at a total discount of $6.1 million and capitalized related debt issuance costs of $29.6 million.  \nIn addition, in connection with our merger with Total System Services, Inc. (\"TSYS\") in September 2019 (the \"TSYS Merger\"), we assumed $3.0 billion aggregate principal amount of senior unsecured notes of TSYS, consisting of the following: (i) $750.0 million aggregate principal amount of 3.800% senior notes due 2021, which were redeemed in February 2021; (ii) $550.0 million aggregate principal amount of 3.750% senior notes due 2023, which were redeemed in June 2023; (iii) $550.0 million aggregate principal amount of 4.000% senior notes due 2023, which were redeemed in June 2023; (iv) $750 million aggregate principal amount of 4.800% senior notes due 2026; and (v) $450 million aggregate principal amount of 4.450% senior notes due 2028. For the 4.800% senior notes due 2026, interest is payable semi-annually each April 1 and October 1. For the 4.450% senior notes due 2028, interest is payable semi-annually each June 1 and December 1. The difference between the acquisition-date fair value and face value of senior notes assumed in the TSYS Merger is recognized over the terms of the respective notes as a reduction of interest expense. The amortization of this fair value adjustment was $15.7 million for each of the years ended December 31, 2024 and 2023.\nConvertible Notes\n1.500% Convertible Notes due March 1, 2031\nOn February 23, 2024, we issued $2.0 billion in aggregate principal amount of 1.500% convertible senior notes due March 2031 through a private placement. The net proceeds from this offering were approximately $1.97 billion reflecting debt issuance costs of $33.5 million, which were capitalized and reflected as a reduction of the related carrying amount of the convertible notes in our consolidated balance sheet as of December 31, 2024. Interest on the convertible notes is payable semi-annually in arrears on March 1 and September 1 of each year, beginning on September 1, 2024, to the holders of record on the preceding February 15 and August 15, respectively. \nPrior to December 1, 2030, the notes are convertible at the option of the holders only under certain conditions, including: (i) if the last reported sale price of our common stock has been at least 130% of the conversion price for at least 20 trading days within the last 30 consecutive trading days of the immediately preceding calendar quarter; (ii) for a five business day period following a ten-day consecutive trading period where the trading price of the notes is less than 98% of the product of the last reported sale price of our common stock and the conversion rate; (iii) if we call any or all of the notes for redemption; or (iv) upon the occurrence of certain corporate events. On or after December 1, 2030, the notes are convertible at the option of the holders at any time until the second scheduled trading day prior to the maturity date. The notes are convertible into cash and shares of our common stock based on a conversion rate of 6.371 shares of common stock per $1,000 principal amount of the convertible notes (which is equal to a conversion price of approximately $156.96 per share), subject to customary adjustments upon the occurrence of certain events. Upon conversion, the principal amount of, and interest due on, the convertible notes are required to be settled in cash and any other amounts may be settled in shares, cash or a combination of shares and cash at our election.\nWe may not redeem the notes prior to March 6, 2028. On or after March 6, 2028, we have the option to redeem all or any portion of the notes for cash if the last reported sale price of our common stock has been at least 130% of the conversion price for at least 20 trading days within the last 30 consecutive trading day period at a redemption price equal to 100% of the principal amount of the notes to be redeemed, plus accrued and unpaid interest. If certain corporate events that constitute a fundamental change (as defined in the indenture governing the notes) occur, any holder of the notes may require that we repurchase all or a portion of their notes for cash at a purchase price equal to 100% of the principal amount of the notes to be repurchased plus accrued and unpaid interest. In addition, if certain corporate events that constitute a make-whole fundamental change (as defined in the indenture governing the notes) occur, then the conversion rate will in certain circumstances be increased. The notes include customary covenants for notes of this type, as well as customary events of default, which may result in the acceleration of the maturity of the convertible notes.\n50\nTable of Contents\nIn connection with the issuance of the notes, we entered into privately negotiated capped call transactions with certain of the initial purchasers of the notes and other financial institutions to cover, subject to customary adjustments, the number of shares of common stock initially underlying the notes. The economic effect of the capped call transactions is to hedge the potential dilutive effect upon the conversion of the notes, or offset our cash obligation if the cash settlement option is elected, for amounts in excess of the principal amount of converted notes subject to a cap. The initial cap price of the capped call transactions is $228.90 per share. The capped call transactions meet the accounting criteria to be reflected in stockholders’ equity and not accounted for as derivatives. The cost of $256.3 million incurred in connection with the capped call transactions was reflected as a reduction to paid-in-capital in our consolidated balance sheet as of December 31, 2024, net of applicable income taxes.\n1.000% Convertible Notes due August 15, 2029\nWe also have $1.5 billion in aggregate principal amount of 1.000% convertible notes due August 2029, which were issued during 2022 in a private placement pursuant to an investment agreement with Silver Lake Partners. The net proceeds from this offering were approximately $1.44 billion, reflecting an issuance discount of $37.5 million and $20.4 million of debt issuance costs, which were capitalized and reflected as a reduction of the related carrying amount of the convertible notes in our consolidated balance sheet. \nInterest on the notes is payable semi-annually in arrears on February 15 and August 15 of each year, beginning on February 15, 2023, to the holders of record on the preceding February 1 and August 1, respectively.\nThe notes are convertible at the option of the holder at any time after the date that is 18 months after issuance (or earlier, upon the occurrence of certain corporate events) until the scheduled trading day prior to the maturity date and are presented within long-term debt in our consolidated balance sheet based on our intent and ability to refinance on a long-term basis should\na conversion event occur. The notes are convertible into cash and shares of our common stock based on a conversion rate of 7.1727 shares of common stock per $1,000 principal amount of the convertible notes (which is equal to a conversion price of approximately $139.42 per share), subject to customary anti-dilution and other adjustments upon the occurrence of certain events. Upon conversion, the principal amount of, and interest due on, the convertible notes are required to be settled in cash and any other amounts may be settled in shares, cash or a combination of shares and cash at our election. \nThe notes are not redeemable by us. If certain corporate events that constitute a fundamental change (as defined in the indenture governing the notes) occur, any holder of the notes may require that we repurchase all or any portion of their notes for cash at a purchase price of par plus accrued and unpaid interest to, but excluding, the repurchase date. In addition, if certain corporate events that constitute a make-whole fundamental change (as defined in the indenture governing the notes) occur, then the conversion rate will in certain circumstances be increased for a specified period of time. The notes include customary covenants for notes of this type, as well as customary events of default, which may result in the acceleration of the maturity of the convertible notes.\nIn connection with the issuance of the notes, we entered into privately negotiated capped call transactions with certain financial institutions to cover, subject to customary adjustments, the number of shares of common stock initially underlying the notes. The economic effect of the capped call transactions is to hedge the potential dilutive effect upon conversion of the notes, or offset our cash obligation if the cash settlement option is elected, up to a cap price determined based on a hedging period that commenced on August 9, 2022 and concluded on August 25, 2022. The capped call had an initial strike price of $140.67 per share and a cap price of $229.26 per share. The capped call transactions meet the accounting criteria to be reflected in stockholders’ equity and not accounted for as derivatives. The cost of $302.4 million incurred in connection with the capped call transactions was reflected as a reduction to paid-in-capital in our consolidated statement of changes in equity during the year ended December 31, 2022, net of applicable income taxes.\nRevolving Credit Facility\nOn August 19, 2022, we entered into a credit agreement with Bank of America, N.A., as administrative agent, and a syndicate of financial institutions, as lenders and other agents. The credit agreement provides for an unsubordinated unsecured $5.75 billion revolving credit facility. We capitalized debt issuance costs of $12.3 million in connection with the issuances under the revolving credit facility. The revolving credit facility matures in August 2027. Borrowings under the revolving credit facility may be repaid prior to maturity without premium or penalty, subject to payment of certain customary expenses of lenders and customary notice provisions.\n51\nTable of Contents\nBorrowings under the revolving credit facility are available to be made in US dollars, euros, sterling, Canadian dollars and, subject to certain conditions, certain other currencies at our option. Borrowings under the revolving credit facility will bear interest, at our option, at a rate equal to (i) for Secured Overnight Financing Rate (\"SOFR\") based currencies or certain alternative currencies, a secured overnight financing rate (subject to a 0.00% floor) plus a 0.10% credit spread adjustment or an alternative currency term rate (subject to a 0.00% floor), as applicable, (ii) for US dollar borrowings, a base rate, (iii) for US dollar borrowings, a daily floating secured overnight financing rate (subject to a 0.00% floor on or after January 1, 2023) plus a 0.10% credit spread adjustment or (iv) for certain alternative currencies, a daily alternative currency rate (subject to a 0.00% floor), in each case, plus an applicable margin. The applicable margin for borrowings under the revolving credit facility will range from 1.125% to 1.875% depending on our credit rating. In addition, we are required to pay a quarterly commitment fee with respect to the unused portion of the revolving credit facility at an applicable rate per annum ranging from 0.125% to 0.300% depending on our credit rating.\nWe may issue standby letters of credit of up to $250.0 million in the aggregate under the revolving credit facility. Outstanding letters of credit under the revolving credit facility reduce the amount of borrowings available to us. The amounts available to borrow under the revolving credit facility are also determined by a financial leverage covenant. As of December 31, 2024, there were borrowings of $1,500.0 million outstanding under the revolving credit facility with an interest rate of 5.86%, and the total available commitments under the revolving credit facility were $3.7 billion.\nCommercial Paper\nWe have a $2.0 billion commercial paper program under which we may issue senior unsecured commercial paper notes with maturities of up to 397 days from the date of issue. The program is backstopped by our revolving credit agreement, in that the amount of commercial paper notes outstanding cannot exceed the undrawn portion of our revolving credit facility. As such, we could draw on the revolving credit facility to repay commercial paper notes that cannot be rolled over or refinanced with similar debt.\nCommercial paper notes are expected to be issued at a discount from par, or they may bear interest, each at commercial paper market rates dictated by market conditions at the time of their issuance. The proceeds from issuances of commercial paper notes will be used primarily for general corporate purposes but may also be used for acquisitions, to pay dividends, for debt refinancing or for other purposes. \nAs of \nDecember 31, 2024\n, we ha\nd no borrowings outstanding under our commercial paper program.\nCompliance with Covenants\nThe convertible notes include customary covenants and events of default for convertible notes of this type. The revolving credit agreement contains customary affirmative covenants and restrictive covenants, including, among others, financial covenants based on net leverage and interest coverage ratios, and customary events of default. The required leverage ratio was increased as a result of the acquisition of EVO, and will gradually step-down over eight quarters to the original required ratio of 3.75 to 1.00. As of December 31, 2024, the required leverage ratio was 4.00 to 1.00, and the required interest coverage ratio was 3.00 to 1.00. We were in compliance with all applicable covenants as of December 31, 2024.\nSettlement Lines of Credit\nIn various markets where we do business, we have specialized lines of credit that are restricted for use in funding settlement. The settlement lines of credit generally have variable interest rates, are subject to annual review and are denominated in local currency but may, in some cases, facilitate borrowings in multiple currencies. For certain of our lines of credit, the available credit is increased by the amount of cash we have on deposit in specific accounts with the lender. Accordingly, the amount of the outstanding lines of credit may exceed the stated credit limit. As of December 31, 2024, a total of $71.2 million of cash on deposit was used to determine the available credit.\nAs of December 31, 2024, we had $503.4 million outstanding under these lines of credit with additional capacity to fund settlement of $2,280.3 million. During the year ended December 31, 2024, the maximum and average outstanding balances under these lines of credit were $1,283.4 million and $502.7 million, respectively. The weighted-average interest rate on these borrowings was 5.24% at December 31, 2024.\n52\nTable of Contents\nSee \"Note 9—Long-Term Debt and Lines of Credit\" in the notes to the accompanying consolidated financial statements for further information about our borrowing agreements.\nBIN/ICA Agreements\n \nIn certain markets, we enter into sponsorship or depository and processing agreements with banks. These agreements allow us to use the banks' identification numbers, referred to as Bank Identification Number (\"BIN\") for Visa transactions and Interbank Card Association (\"ICA\") number for Mastercard transactions, to clear credit card transactions through Visa and Mastercard. Certain of such agreements contain financial covenants, and we were in compliance with all such covenants as of December 31, 2024.\nFuture Obligations\nWe have contractual obligations related to service arrangements with suppliers for fixed or minimum amounts. Future minimum payments for purchase obligations at December 31, 2024 are disclosed in “Note 19—Commitments and Contingencies” in the notes to the accompanying consolidated financial statements. \nCritical Accounting Estimates\n \nOur consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States, which often require the judgment of management in the selection and application of certain accounting principles and methods. We consider the following accounting policies and estimates to be critical to understanding our consolidated financial statements because the application of these policies requires significant judgment on the part of management, and as a result, actual future developments may be different from those expected at the time that we make these important judgments. We have discussed these critical accounting policies and estimates with the audit committee of the board of directors. \nAccounting estimates necessarily require subjective determinations about future events and conditions. Therefore, the following descriptions of our critical accounting estimates are forward-looking statements, and actual results could differ materially from the results anticipated by these forward-looking statements. You should read the following in conjunction with \"Note 1—Basis of Presentation and Summary of Significant Accounting Policies\" to the accompanying consolidated financial statements and the risk factors contained in \"Item 1A - Risk Factors\" of this Annual Report on Form 10-K.\nBusiness Combinations\nFrom time to time, we make strategic acquisitions that may have a material effect on our consolidated results of operations and financial position. The measurement principle for the assets acquired and the liabilities assumed in a business combination is at estimated fair value as of the acquisition date, with certain exceptions. The excess of the total consideration transferred over the amount of the net identifiable assets acquired determined in accordance with the measurement guidance for such items is recognized as goodwill. \nThe estimates we use to determine the fair value of long-lived assets, such as intangible assets, can be complex and require significant judgments. We use information available to us to make fair value determinations, and we engage independent valuation specialists, when necessary, to assist in the fair value determination of significant acquired long-lived assets. The estimated fair values of customer-related and contract-based intangible assets are generally determined using the income approach, which is based on projected cash flows discounted to their present value using discount rates that consider the timing and risk of the forecasted cash flows. The discount rates used represent a risk adjusted market participant weighted-average cost of capital, derived using customary market metrics. These measures of fair value also require considerable judgments about future events, including forecasted revenue growth rates, forecasted customer attrition rates, contract renewal estimates and technology changes. Acquired technologies are generally valued using the replacement cost method, which requires us to estimate the costs to construct an asset of equivalent utility at prices available at the time of the valuation analysis, with adjustments in value for physical deterioration and functional and economic obsolescence. Trademarks and trade names are generally valued using the \"relief-from-royalty\" approach. This method assumes that trademarks and trade names have value to the extent that their owner is relieved of the obligation to pay royalties for the benefits received from them. This method requires us to estimate the future revenues for the related asset, the appropriate royalty rate and the weighted-average cost of capital. This measure of fair value requires considerable judgment about the value a market participant would be willing to pay in order to achieve the benefits associated with the trademark or trade name.\n53\nTable of Contents\nWhile we use our best estimates and assumptions to determine the fair values of the assets acquired and the liabilities assumed, our estimates are inherently uncertain and subject to refinement. As a result, during the measurement period, which may be up to one year from the acquisition date, we make adjustments to the assets acquired and liabilities assumed. Upon the conclusion of the measurement period, any subsequent adjustments are recognized in our consolidated statements of income. We are also required to estimate the useful lives of intangible assets to determine the period over which to recognize the amount of acquisition-related intangible assets as an expense. We periodically review the estimated useful lives assigned to our intangible assets to determine whether such estimated useful lives continue to be appropriate.\nGoodwill, intangibles and other long-lived assets are also regularly evaluated for impairment, which requires the use of significant estimates and assumptions as further described below. A\n change in estimated fair value could result in an impairment charge, which could be material to our consolidated financial statements.\nGoodwill\nWe test goodwill for impairment at the reporting unit level annually (in the fourth quarter) and more often if an event occurs or circumstances change that indicate the fair value of a reporting unit is below its carrying amount. We have the option of performing a qualitative assessment of impairment to determine whether any further quantitative assessment for impairment is necessary. The election of whether or not to perform a qualitative assessment is made annually and may vary by reporting unit. Factors we consider in the qualitative assessment include general macroeconomic conditions, industry and market conditions, cost factors, overall financial performance of our reporting units, events or changes affecting the composition or carrying amount of the net assets of our reporting units, our share price, and other relevant entity-specific events. If we elect to bypass the qualitative assessment or if we determine, on the basis of qualitative factors, that the fair value of the reporting unit is more likely than not less than the carrying amount, a quantitative test would be required. \n When applying the quantitative assessment, we determine the fair value of our reporting units based on a weighted average of multiple valuation techniques, principally a combination of an income approach and a market approach. The income approach calculates a value based upon the present value of estimated future cash flows, while the market approach uses earnings multiples of similarly situated guideline public companies. Determining the fair value of a reporting unit involves judgment and the use of significant estimates and assumptions, which include assumptions regarding the revenue growth rates and operating margins used to calculate estimated future cash flows, risk-adjusted discount rates and future economic and market conditions\n.\nAs of October 1, 2024, our reporting units consisted of the following: North America Payments Solutions, Vertical Market Software Solutions, Europe Merchant Solutions, Spain Merchant Solutions, Asia-Pacific Merchant Solutions, Latin America Merchant Solutions and Issuer Solutions. As of October 1, 2024, we performed a quantitative assessment of impairment for our Issuer Solutions, Europe Merchant Solutions, Spain Merchant Solutions and Latin America Merchant Solutions reporting units and a qualitative assessment for all other reporting units. We determined on the basis of the quantitative assessments of our Issuer Solutions, Europe Merchant Solutions, Spain Merchant Solutions and Latin America Merchant Solutions reporting units that the fair value of each reporting unit was greater than its respective carrying amount, indicating no impairment. Additionally, we determined on the basis of the qualitative factors that the fair value of other reporting units was not more likely than not less than the respective carrying amounts. We believe that the fair value of each of our reporting units is substantially in excess of its carrying amount, except for our Issuer Solutions reporting unit, whose fair value exceeded its carrying amount by approximately 7% as of October 1, 2024.\nDuring the quarter ended December 31, 2024, we realigned our reporting units based on strategic and organizational changes. The new reporting units are Core Payments Solutions, Integrated and Embedded Solutions, Point-of-Sale and Software Solutions, International Merchant Solutions and Issuer Solutions. Upon realignment of our reporting units, we performed a quantitative assessment of impairment for our Core Payments Solutions, Integrated and Embedded Solutions and Point-of-Sale and Software Solutions reporting units, and determined on the basis of those assessments that the fair value of each reporting unit was substantially in excess of its respective carrying amount, indicating no impairment. Additionally, our International Merchant Solutions reporting unit was an aggregation of existing reporting units, and we concluded that the fair value was substantially in excess of the carrying amount. The realignment did not affect our Issuer Solutions reporting unit. \nWe continue to closely monitor developments related to global events and macroeconomic conditions. The future magnitude, duration and effects of these events and conditions are difficult to predict at this time, and it is reasonably possible that future developments could have a negative effect on the estimates and assumptions utilized in our goodwill impairment assessments and could result in material impairment charges in future periods.\n54\nTable of Contents\nIntangible and Long-lived Assets\nWe regularly evaluate whether events and circumstances have occurred that indicate the carrying amount of property and equipment, lease right-of-use assets and finite-life intangible assets may not be recoverable. When factors indicate that these long-lived assets should be evaluated for possible impairment, we assess the potential impairment by determining whether the carrying amount of such long-lived assets will be recovered through the future undiscounted cash flows expected from use of the asset and its eventual disposition. The evaluation is performed at the asset group level, which is the lowest level of identifiable cash flows. If the carrying amount of the asset group is determined to be not recoverable and exceeds its fair value, an impairment loss is recognized, measured as the difference between the fair value and the carrying amount. Fair values are determined based on quoted market prices or discounted cash flow analysis as applicable. \nWe classify an asset or business as a held for sale disposal group if we have committed to a plan to sell the asset or business within one year and are actively marketing the asset or business in its current condition for a price that is reasonable in comparison to its estimated fair value. Disposal groups held for sale are reported at the lower of carrying amount or fair value less costs to sell. Subsequent changes to the estimated selling price of an asset or disposal group held for sale are recognized as gains or losses in our consolidated statement of income and any subsequent gains are limited to the cumulative losses previously recognized. During the years ended December 31, 2023 and 2022, we recognized net losses of $243.6 million and $71.9 million, respectively, on the consumer business disposition to reduce the carrying amount of the consumer disposal group to estimated fair value less costs to sell, including the effects of incremental negotiated closing adjustments, changes in the estimated fair value of the seller financing and the effects of the final tax structure of the transaction.\nCapitalization of Internal-Use Software Costs \nWe develop software that is used in providing services to customers. Capitalization of internal-use software costs, primarily associated with operating platforms, occurs when we have completed the preliminary project stage, management authorizes the project, management commits to funding the project, it is probable the project will be completed and the project will be used to perform the function intended. The preliminary project stage consists of the conceptual formulation of alternatives, the evaluation of alternatives, the determination of existence of needed technology and the final selection of alternatives. Costs incurred during the preliminary project stage are recognized as expense as incurred. Currently unforeseen circumstances in software development, such as a significant change in the manner in which the software is intended to be used, obsolescence or a significant reduction in revenues due to customer attrition, could require us to implement alternative plans with respect to a particular effort, which could result, and from time to time has resulted, in an impairment charge related to previously capitalized software development costs. The carrying amount of internal-use software, including work-in-progress, at December 31, 2024 was $1,202.1 million. Costs capitalized during the year ended December 31, 2024 totaled $339.3 million.\nIn addition, we capitalize implementation costs associated with cloud computing arrangements that are service contracts following the same internal-use software capitalization criteria. Our cloud computing arrangements involve services we use to support certain internal corporate functions as well as technology associated with revenue-generating activities. We regularly evaluate whether events or circumstances have occurred that indicate the carrying amount of the capitalized implementation costs may not be recoverable. As of December 31, 2024, capitalized implementation costs, net of accumulated amortization, were $215.4 million and are presented within other noncurrent assets in the consolidated balance sheets. Costs capitalized during the year ended December 31, 2024 totaled $45.1 million.\nDuring the year ended December 31, 2024, we recognized a charge of $55.8 million for technology assets that will no longer be utilized under a revised technology architecture development strategy. \nRevenue Recognition\nIn accordance with Accounting Standards Codification Topic 606, \nRevenue from Contracts with Customers\n (\"ASC 606\"), we apply judgment in the determination of performance obligations, in particular related to large customer contracts within the Issuer Solutions segment. Performance obligations in a contract are identified based on the goods or services that will be transferred to the customer that are both capable of being distinct, whereby the customer can benefit from the service either on its own or together with other resources that are readily available from third parties or from us, and are distinct in the context of the contract, whereby the transfer of the services is separately identifiable from other promises in the contract. To the extent a contract includes multiple promised services, we must apply judgment to determine whether promised services are capable of being distinct and are distinct in the context of the contract. If these criteria are not met, the promised services are combined and accounted for as a single performance obligation. In addition, a single performance obligation may comprise a series of distinct goods or services that are substantially the same and that have the same pattern of transfer to the customer.\n55\nTable of Contents\nIncome Taxes\nWe determine our provision for income taxes using management's judgments, estimates and interpretation and application of complex tax laws in each of the jurisdictions in which we operate. Judgment is also required in assessing the timing and amounts of deductible and taxable items. Such differences in timing result in deferred tax assets and liabilities in our consolidated balance sheet. \nWe believe our tax return positions are fully supportable; however, we recognize the benefit for tax positions only when it is more likely than not that the position will be sustained based on its technical merits. Issues raised by a tax authority may be resolved at an amount different than the related benefit recognized. When facts and circumstances change (including an effective settlement of an issue or statute of limitations expiration), the effect is recognized in the period of change. The unrecognized tax benefits that exist at December 31, 2024 would affect our provision for income taxes in the future, if recognized. \nJudgment is required to determine whether or not some portion or all of our deferred tax assets will not be realized. To the extent that we determine that we will not realize the benefit of some or all of our deferred tax assets, these deferred tax assets are adjusted via a valuation allowance through our provision for income taxes in the period in which this determination is made.\nSee \"Note 12\n—\nIncome Tax\" in the notes to the accompanying consolidated financial statements for further information regarding the changes in the amount of unrecognized tax benefits and deferred tax valuation allowances during the year ended December 31, 2024.\nRedeemable noncontrolling interests\nRedeemable noncontrolling interests in our subsidiaries in Greece, Chile, and Germany relate to the portion of equity in each of those subsidiaries not attributable, directly or indirectly, to us, which is redeemable upon the occurrence of an event that is not solely within our control. The redeemable noncontrolling interest for each subsidiary is reflected at the higher of: (i) the initial carrying amount, increased or decreased for the noncontrolling interest's share of comprehensive income (loss), c\napital contributions and distributions or (ii) the redemption price\n. Estimates of redemption price are based on projected operating performance of each subsidiary, including key assumptions - revenue growth rates, current and expected market conditions and weighted-average cost of capital. Refer to “Note 16—Noncontrolling Interests” in the notes to the accompanying consolidated financial statements for further information.\nEffect of New Accounting Pronouncements and Recently Issued Accounting Pronouncements Not Yet Adopted\n \nFrom time to time, new accounting pronouncements are issued by the Financial Accounting Standards Board or other standards setting bodies that may affect our current and/or future financial statements. See \"Note 1—Basis of Presentation and Summary of Significant Accounting Policies\" in the notes to the accompanying consolidated financial statements for a discussion of recently adopted accounting pronouncements and recently issued accounting pronouncements not yet adopted.",
  "item2": null
}