{
  "source_file": "gpn-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2—MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our unaudited consolidated financial statements and related notes included in Item 1 of Part I of this Quarterly Report and the Management’s Discussion and Analysis of Financial Condition and Results of Operations and consolidated financial statements contained in our Annual Report on Form 10-K for the year ended December 31, 2024. This discussion and analysis contains forward-looking statements about our plans and expectations of what may happen in the future. Forward-looking statements are based on a number of assumptions and estimates that are inherently subject to significant risks and uncertainties, and our actual results could differ materially from the results anticipated by our forward-looking statements. \nExecutive Overview\nWe are a leading payments technology company delivering innovative software and services to our customers globally. Our technologies, services and team member expertise allow us to provide a broad range of solutions that enable our customers to operate their businesses more efficiently across a variety of channels around the world.\nWe have grown organically, as well as through acquisitions, and continue to invest in new technology solutions, infrastructure to support our growing business and the ongoing consolidation and enhancement of our operating platforms. These investments include new product development and innovation to further enhance and differentiate our suite of technology and solutions available to customers, along with migration of certain underlying technology platforms to cloud environments to enhance performance, improve speed to market and drive cost efficiencies. We also continue to execute on integration and business transformation activities, such as combining business operations, streamlining technology infrastructure, eliminating duplicative corporate and operational support structures and realizing scale efficiencies. \nWe also furthered our business strategy through the following key transactions:\n•\nOn April 17, 2025, we entered into definitive agreements to acquire 100% of Worldpay Holdco, LLC (“Worldpay”) from \nFidelity National Information Services, Inc. (“FIS”)\n and affiliates of GTCR LLC (“GTCR”) and divest our Issuer Solutions business to FIS. Worldpay is an industry leading payments technology and solutions company. Consideration expected to be paid to GTCR for an ownership interest in Worldpay consists of (1) approximately $6.1 billion in cash and (2) 43.3 million shares of Global Payments common stock. Consideration expected to be received for the divestiture of our Issuer Solutions business consists of (1) approximately \n$7.5 billion\n in cash and (2) FIS’ ownership interest in Worldpay as described above. Our Issuer Solutions business met the criteria to be classified as a discontinued operation in the second quarter of 2025. Accordingly, the operating results of the Issuer Solutions business have been presented as discontinued operations in our consolidated statements of income for the three and nine months ended September 30, 2025 and 2024.\n•\nThe proposed acquisition of Worldpay and divestiture of our Issuer Solutions business will occur simultaneously. In connection with the agreements, we initially obtained $7.7 billion in committed bridge financing. Upon the effectiveness of the revolving credit agreement entered into on May 15, 2025 as described in \"Note 5—Long-Term Debt and Lines of Credit,\" we reduced the commitments related to the bridge financing to $6.2 billion. Both transactions are expected to close in the\n first quarter of 2026.\n•\nOn September 30, 2025, we completed the sale of Heartland Payroll Solutions, Inc. (\"Payroll Solutions\"), our payroll business included in our Merchant Solutions segment, to Acrisure, LLC for approximately $1.1 billion, subject to certain closing adjustments, including up to \n$75 million\n of contingent consideration. We recognized a gain on the sale of $343.9 million during the three and nine months ended September 30, 2025 in connection with the sale.\n31\nTable of Contents\nHighlights related to our results of continuing operations for the three and nine months ended September 30, 2025 include the following:\n•\nConsolidated revenues were essentially flat at $2,007.6 million and $5,773.1 million for the three and nine months ended September 30, 2025, respectively, compared to $1,997.7 million and $5,802.8 million for the three and nine months ended September 30, 2024, respectively.\n•\nMerchant Solutions segment operating income and operating margin for the three and nine months ended September 30, 2025 increased compared to the prior year primarily due to the favorable effect of cost reduction activities. \n•\nConsolidated operating income for the three and nine months ended September 30, 2025 includes the gain recognized on the sale of the Payroll Sol\nutions business. \nStrategy and Business Transformation\nIn 2024, we launched a holistic review of our business to examine our strategy, operations and ability to deliver sustainable performance. We have refreshed our strategy and are focusing our resources, efforts and investments on the areas of the business that will drive the best opportunities for growth. \nThese strategic, organizational and operational transformation activities are expected to continue over the next few years. As we focus on executing and delivering transformation initiatives, we have incurred and anticipate incurring incremental expenses related to the transformation through early 2027, including but not limited to changes to the recoverability of assets and our estimates of remaining useful lives. We continue to assess our business portfolio to evaluate potential assets for disposition to further streamline our business and create value for shareholders.\nWe currently expect our transformation initiatives to generate more than $650 million of annual run-rate operating income benefit by the first half of 2027.\nMacroeconomic Effects and Other Global Conditions\nWe are exposed to general economic conditions, including the effects of currency fluctuations, inflation, rising interest rates, tariff increases, global trade relations, international tensions, higher rates of unemployment, and other conditions that affect the overall level of consumer, business and government spending, which could negatively affect our financial performance. When adverse macroeconomic conditions arise, we evaluate where we may be able to implement cost-saving measures, including those related to headcount and discretionary expenses. We may also experience the effects of heightened geopolitical and economic instability or increased difficulty of conducting business in a country or region due to actual or potential political or military conflict or action. We recognize the uncertainty of the macroeconomic environment and cannot predict what impacts the current uncertainty or any developments will have on the economy and our customers.\nCertain of our operations are conducted in foreign currencies. Consequently, a portion of our revenues and expenses has been and may continue to be affected by fluctuations in foreign currency exchange rates. A strengthening of the U.S. dollar or other significant fluctuations in foreign currency exchange rates could result in an adverse effect on our future financial results; however, we are unable to predict the extent of the potential effect on our financial results.\nWe have sought to reduce our interest rate risk through the issuance of fixed rate debt in place of variable rate debt and through interest rate swap hedging arrangements that convert a significant portion of the eligible variable rate borrowings under our revolving credit facility to a fixed rate. However, inflationary pressure or interest rate fluctuations could adversely affect our business and financial performance as a result of higher costs and/or lower consumer spending. In addition, continued inflation or a rise in interest rates could have an adverse effect on our future financial results and the recoverability of assets. However, as the future magnitude, duration and effects of these conditions are difficult to predict, we are unable to project the extent of the potential effect on our financial results. \n32\nTable of Contents\nWe regularly maintain cash balances with financial institutions in excess of the Federal Deposit Insurance Corporation insurance limit or the equivalent outside the U.S. A disruption in financial markets could impair our banking partners, which could affect our ability to access our cash or cash equivalents, our ability to provide settlement services or our customers' ability to access their existing cash to fulfill their payment obligations to us. The occurrence of these events could negatively affect our business, financial condition and results of operations. \nFor a further discussion of trends, uncertainties and other factors that could affect our future operating results, see the section entitled “Risk Factors” in Item 1A in our Annual Report on Form 10-K for the year ended December 31, 2024 and subsequent filings we make with the SEC, including this Quarterly Report on Form 10-Q, and the section entitled \"Forward-Looking Statements\" in this Quarterly Report on Form 10-Q.\nResults of Operations\nBeginning in the second quarter of 2025, we present the historical operations of our Issuer Solutions reportable segment as a discontinued operation. Accordingly, our continuing operations consists of our Merchant Solutions business and corporate functions.\nSee “Note 2—Business Dispositions and Discontinued Operations” in the notes to the accompanying unaudited consolidated financial statements for further information.\n33\nTable of Contents\nContinuing Operations\nThe following table sets forth key selected financial data for the three months ended September 30, 2025 and 2024, certain data as a percentage of total revenues and the changes between periods in dollars and as a percentage of the prior period amount. The income statement data for the three months ended September 30, 2025 and 2024 is derived from the accompanying unaudited consolidated financial statements.\nThree Months Ended \nSeptember 30, 2025\n% of Revenue\n(1)\nThree Months Ended \nSeptember 30, 2024\n% of Revenue\n(1)\nChange\n% Change\n(dollar amounts in thousands)\nRevenues\n(2)\n$\n2,007,637 \n100.0 \n%\n$\n1,997,660\n100.0 \n%\n$\n9,977 \n0.5 \n%\nOperating expenses\n(2)\n:\nCost of service\n$\n556,682 \n27.7 \n%\n$\n504,563\n25.3 \n%\n$\n52,119 \n10.3 \n%\nSelling, general and administrative:\nMerchant Solutions\n$\n700,968 \n$\n785,550\n$\n(84,582)\n(10.8)\n%\nCorporate\n315,864 \n264,801\n51,063 \n19.3 \n%\nConsolidated selling, general and administrative\n$\n1,016,832 \n50.6 \n%\n$\n1,050,351\n52.6 \n%\n$\n(33,519)\n(3.2)\n%\nGain on business disposition\n(343,891)\n—\n(343,891)\nNM\nConsolidated operating expenses\n$\n1,229,623 \n61.2 \n%\n$\n1,554,914\n77.8 \n%\n$\n(325,291)\n(20.9)\n%\nOperating income (loss)\n(2)\n:\nMerchant Solutions\n$\n749,987 \n$\n707,547\n$\n42,440 \n6.0 \n%\nCorporate\n(315,864)\n(264,801)\n(51,063)\n19.3 \n%\nGain on business disposition\n343,891 \n—\n343,891 \nNM\nConsolidated operating income\n$\n778,014 \n38.8 \n%\n$\n442,746\n22.2 \n%\n$\n335,268 \n75.7 \n%\nOperating margin\n(2)\n:\nMerchant Solutions\n37.4 \n%\n35.4 \n%\n2.0 \n%\nNM = Not meaningful\n(1)\n Percentage amounts may not sum to the total due to rounding.\n(2)\n Revenues, operating expenses, operating income and operating margin reflect the effects of our disposed businesses through the respective disposal dates. See “Note 2—Business Dispositions and Discontinued Operations” for further discussion.\nOperating income included acquisition and transformation expens\nes of \n$205.1 million\n and \n$104.9 million\n for \nthe three months ended September 30, 2025 and 2024, respectively, which were primarily included within Corporate selling, general and administrative expenses. \nDuring the three months ended September 30, 2024, Corporate expenses also included charges for employee termination benefits of $56.4 million. \n34\nTable of Contents\nThe following table sets forth key selected financial data for the nine months ended September 30, 2025 and 2024, certain data as a percentage of total revenues and the changes between periods in dollars and as a percentage of the prior period amount. The income statement data for the nine months ended September 30, 2025 and 2024 is derived from the accompanying unaudited consolidated financial statements.\nNine Months Ended \nSeptember 30, 2025\n% of Revenue\n(1)\nNine Months Ended \nSeptember 30, 2024\n% of Revenue\n(1)\nChange\n% Change\n(dollar amounts in thousands)\nRevenues\n(2)\n$\n5,773,071\n100.0 \n%\n$\n5,802,780\n100.0 \n%\n$\n(29,709)\n(0.5)\n%\nOperating expenses\n(2)\n:\n  Cost of service\n$\n1,544,335\n26.8 \n%\n$\n1,508,079\n26.0 \n%\n$\n36,256\n2.4 \n%\nSelling, general and administrative:\nMerchant Solutions\n$\n2,147,716\n$\n2,334,192\n$\n(186,476)\n(8.0)\n%\nCorporate\n843,855\n682,783\n161,072\n23.6 \n%\nConsolidated selling, general and administrative\n$\n2,991,571\n51.8 \n%\n$\n3,016,975\n52.0 \n%\n$\n(25,404)\n(0.8)\n%\nGain on business disposition\n(348,151)\n—\n(348,151)\nNM\nConsolidated operating expenses\n$\n4,187,755\n72.5 \n%\n$\n4,525,054\n78.0 \n%\n$\n(337,299)\n(7.5)\n%\nOperating income (loss)\n(2)\n:\nMerchant Solutions\n$\n2,081,020\n$\n1,960,509\n$\n120,511\n6.1 \n%\nCorporate\n(843,855)\n(682,783)\n(161,072)\n23.6 \n%\nGain on business disposition\n348,151\n—\n348,151\nNM\nConsolidated operating income\n$\n1,585,316\n27.5 \n%\n$\n1,277,726\n22.0 \n%\n$\n307,590\n24.1 \n%\nOperating margin\n(2)\n:\nMerchant Solutions\n36.0 \n%\n33.8 \n%\n2.2 \n%\nNM = Not meaningful\n(1)\n Percentage amounts may not sum to the total due to rounding.\n(2)\n Revenues, operating expenses, operating income and operating margin reflect the effects of our disposed businesses through the respective disposal dates. See “Note 2—Business Dispositions and Discontinued Operations” for further discussion.\nOperating income included acquisition and transformation\n expenses of \n$433.4 million\n and \n$236.3 million\n for \nthe nine months ended September 30, 2025 and 2024, respectively, which were primarily included within Corporate expenses. \nDuring the nine months ended September 30, 2024, Corporate expenses also included charges for employee termination benefits of $94.1 million.\n35\nTable of Contents\nRevenues\nRevenues from our Merchant Solutions segment increased by $10.0 million, or 0.5%, for the three months ended September 30, 2025 and decreased by $29.7 million, or 0.5%, for the nine months ended September 30, 2025.\n For the three and nine months ended September 30, 2025, revenues in our integrated and embedded solutions service line increased $56.3 million and $158.6 million, respectively, or 6.8% and 6.7%, respectively, as payments continue to transition to more embedded and digital native environments. Revenues in our point of sale and software solutions service line decreased $37.2 million and $110.5 million for the three and nine months ended September 30, 2025, respectively, or 9.8% and 9.6%, respectively. Excluding the effect of the AdvancedMD business disposed of in December 2024, revenues increased approximately 6% for both the three and nine months ended September 30, 2025 driven by growth in software subscription fees. Revenues in our core payments solutions service line declined $9.1 million and $77.8 million for the three and nine months ended September 30, 2025, respectively, or 1.1% and 3.4%, respectively, as a result of reduced emphasis on our wholesale business and our exit of certain markets in our Asia Pacific business. \nOperating Expenses\nCost of Service. \nCost of service for our Merchant Solutions segment for the three and nine months ended September 30, 2025 increased by $52.1 million and $36.3 million, respectively. Cost of service as a percentage of revenues was 27.7% and 26.8% for the three and nine months ended September 30, 2025, respectively, compared to 25.3% and 26.0% in the prior year, respectively. The increase in cost of service was primarily driven by depreciation of capital investments as part of our transformation initiatives.\n The disposition of AdvancedMD had the effect of reducing cost of service as a percentage of revenues by\n 0.4% and 0.3% f\nor the \nthree and nine\n months ended \nSeptember 30, 2025\n compared to the \nthree and nine\n months ended \nSeptember 30, 2024, respectively\n.  \nAmortization of Acquired Intangible Assets.\n The most significant component of our cost of service is amortization of acquired intangibles, which was $207.6 million and $601.8 million \nfor the \nthree and nine\n months ended \nSeptember 30, 2025\n, respectively, and \n$213.8 million\n and \n$635.5 million for t\nhe \nthree and nine\n months ended \nSeptember 30, 2024, respectively\n. As a percentage of cost of service, amortization of acquired intangibles w\nas 37% and 39% for\n the \nthree and nine\n months ended \nSeptember 30, 2025, respectively,\n a\nnd 42% \nfor both the \nthree and nine\n months ended \nSeptember 30, 2024\n. These costs generally do not vary in proportion \nto changes in revenues, but rather are most significantly affected by acquisition activities. The decrease in amortization of acquired intangibles in the three and nine months ended September 30, 2025 primarily reflects the effect of the disposition of the AdvancedMD business in December 2024.\nSelling, General and Administrative Expenses. \nSelling, general and administrative expenses from our Merchant Solutions segment for the three and nine months ended September 30, 2025 decreased by $84.6 million and $186.5 million, respectively, or 10.8% and 8.0%, respectively.\n \nSelling, general and administrative expenses as a percentage of segment revenues was \n34.9%\n and \n37.2%\n for the three and nine months ended September 30, 2025, respectively, compared to \n39.3%\n and \n40.2%\n in the prior yea\nr, respectively. The primary driver of the reduction in selling, general and administrative expenses for the three and nine months ended September 30, 2025 was lower compensation and benefits expenses as a result of certain actions taken in 2024 to align our workforce to our new operating model.\nCorporate expenses for the three and nine months ended September 30, 2025 increased by $51.1 million and $161.1 million, respectively, or 19.3% and 23.6%, respectively. The higher amount of corporate expenses was primarily driven by an increase in acquisition and transformation costs of $100.2 million and $197.1 million for the three and nine months ended September 30, 2025, respectively. This was partially offset by employee termination benefits expense recognized of $56.4 million and $94.1 million for the three and nine months ended September 30, 2024, respectively.\n36\nTable of Contents\nOperating Income and Operating Margin\nConsolidated operating income for the three and nine months ended September 30, 2025 was $778.0 million and $1,585.3 million, respectively, compared to $442.7 million and $1,277.7 million in the prior year, respectively. Consolidated operating margin for the three and nine months ended September 30, 2025 was 38.8% and 27.5%, respectively, compared to 22.2% and 22.0% in the prior year, respectively. \n•\nConsolidated operating income and operating margin for the three and nine months ended September 30, 2025 included the effects of a \n$343.9 million\n gain on the sale of Payroll Solutions, which had a favorable effect on operating margin of approximately 17.1% and 6.0% for the three and nine months ended September 30, 2025, respectively; \n•\nConsolidated operating income also reflecte\nd higher co\nrporate costs, as described above, which had an \nunfavorable \neffect on operating margin of approximat\nely 2.5% and 2.8% fo\nr the three and nine months ended September 30, 2025, respectively; and\n•\nMerchant Solutions segment operating income increased $42.4 million and $120.5 million for the three and nine months ended September 30, 2025, respectively, and operating margin increased 2.0% and 2.2%, respectively, primarily due to the favorable effect of cost reduction initiatives as a result of certain actions taken in 2024 to align our workforce to our new operating model. In\n addition, the \nthree and nine\n months ended \nSeptember 30, 2024\n included operating income o\nf $11.1 million and $34.0 million, respectively, related to the disposed AdvancedMD business. \nThe disposition had the effect \nof increasing operat\ning margin by\n 0.5% and 0.4% for t\nhe \nthree and nine\n months ended \nSeptember 30, 2025\n compared to the \nthree and nine\n months ended \nSeptember 30, 2024, respectively\n.  \nIncome Tax Expense \nOur effective income tax rates for the three months ended September 30, 2025 and 2024 were 30.4% and 17.2%, respectively. The changes in our effective tax rates for the three months ended September 30, 2025 from the prior year reflects the tax effect of the gain on disposition of our Payroll Solutions business. The gain on the disposition of our Payroll Solutions business for tax reporting purposes will be higher than the gain for financial reporting purposes due to the derecognition of goodwill that is not deductible for tax reporting purposes.\nOur effective income tax rates for the nine months ended September 30, 2025 and 2024 were 29.3% and 13.8%, respectively. The changes in our effective tax rates for the nine months ended September 30, 2025 from the prior year reflects the effect of deferred tax expense recognized associated with legal entity restructuring in connection with the sale of our Issuer Solutions business and the tax effect of the gain on disposition of our Payroll Solutions business. In addition, the effective income tax rate for the nine months ended September 30, 2024 included the favorable effect of a change in the assessment of the need for a valuation allowance related to certain foreign tax credit carryforwards.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the U.S. The OBBBA includes provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework, and the restoration of favorable tax treatment for certain business provisions. The legislation has multiple effective dates beginning in 2025.\nVarious foreign taxing jurisdictions enacted local legislation formally adopting the Global Anti-Base Erosion Model Rules (\"Pillar Two\"), which generally provides for a minimum effective tax rate of 15%, as established by the Organization for Economic Co-operation and Development (\"OECD\") Pillar Two Framework. The effective dates were generally January 1, 2024, and January 1, 2025, for different aspects of the rules and vary by jurisdiction. More jurisdictions are expected to implement the model rules under local law in the future, with varying effective dates. While we continue to evaluate the effect of these legislative changes as additional guidance becomes available, uncertainty remains regarding the timing and interpretation by tax authorities in affected jurisdictions.\nThe OBBBA and Pillar Two directive did not have a material effect on our financial statements for the three and nine months ended September 30, 2025, and we are continuing to evaluate the potential effect on future periods.\n37\nTable of Contents\nIncome from Continuing Operations\nIncome from continuing operations was $473.3 million and $928.7 million for the three and nine months ended September 30, 2025, respectively, compared to $303.9 million and $868.8 million for the prior year, respectively, reflecting the changes noted above.\nDiluted Earnings per Share - Continuing Operations\nDiluted earnings per share was $1.86 and $3.67 for the three and nine months ended September 30, 2025, respectively, compared to $1.13 and $3.24 for the prior year, respectively. Diluted earnings per share for the three and nine months ended September 30, 2025 reflects the changes in net income noted above as well as a decrease of 14.7 million and 12.3 million, respectively, in diluted weighted-average number of shares outstanding to 240.2 million and 243.6 million shares, respectively, for the three and nine months ended September 30, 2025, compared to 254.9 million and 255.9 million shares for the prior year, respectively.\nDiscontinued Operations\nThe following tables set forth key selected financial data for discontinued operations for the three and nine months ended September 30, 2025 and 2024, certain data as a percentage of total revenues and the changes between periods in dollars and as a percentage of the prior-period amount. The data for the three and nine months ended September 30, 2025 and 2024 is derived from the accompanying unaudited consolidated financial statements.\nThree Months Ended \nSeptember 30, 2025\n% of Revenue\n(1)\nThree Months Ended \nSeptember 30, 2024\n% of Revenue\n(1)\nChange\n% Change\n(dollar amounts in thousands)\nRevenues\n$\n659,828\n$\n621,130\n$\n38,698\n6.2 \n%\nOperating income\n$\n250,992\n38.0 \n%\n$\n32,835\n5.3 \n%\n$\n218,157\n664.4 \n%\nOperating margin\n38.0 \n%\n5.3 \n%\n32.7 \n%\n(1)\n Percentage amounts may not sum to the total due to rounding.\nNine Months Ended \nSeptember 30, 2025\n% of Revenue\n(1)\nNine Months Ended \nSeptember 30, 2024\n% of Revenue\n(1)\nChange\n% Change\n(dollar amounts in thousands)\nRevenues\n$\n1,920,442\n$\n1,837,373\n$\n83,069\n4.5 \n%\nOperating income\n$\n561,692\n29.2 \n%\n$\n222,731\n12.1 \n%\n$\n338,961\n152.2 \n%\nOperating margin\n29.2 \n%\n12.1 \n%\n17.1 \n%\n(1)\n Percentage amounts may not sum to the total due to rounding.\n38\nTable of Contents\nRevenues\nRevenues for the three and nine months ended September 30, 2025 increased pri\nmarily due to\n a $25.4 million and $71.6 million effect of higher transaction volume driven by cardholder activity for the three and nine months ended September 30, 2025, respectively. \nOperating Income and Operating Margin \nOperating income and operating margin increased for the three and nine months ended September 30, 2025\n primarily due to the cessation of depreciation and amortization associated with classification of the assets as held for sale and higher revenues. \nLiquidity and Capital Resources\nWe have numerous sources of capital, including cash on hand and cash flows generated from operations as well as various sources of financing. In the ordinary course of our business, a significant portion of our liquidity comes from operating cash flows and borrowings, including the capacity under our revolving credit facility.\n Our capital allocation priorities are to pay dividends, to repurchase shares of our common stock, to pursue acquisitions that meet our corporate objectives, to make planned capital investments in our business and to pay principal and interest on our outstanding debt. Our significant contractual cash requirements also include ongoing payments for lease liabilities and contractual obligations related to service arrangements with suppliers for fixed or minimum amounts, which primarily relate to software, technology infrastructure and related services. Commitments under our borrowing arrangements are further described in \"Note 5—Long-Term Debt and Lines of Credit\" in the notes to the accompanying unaudited consolidated financial statements and below under \"Long-Term Debt and Lines of Credit.\" For additional information regarding our other cash commitments and contractual obligations, see \"Note 7—Leases\" and “Note 19—Commitments and Contingencies” in our Annual Report on Form 10-K for the year ended December 31, 2024. \nOur capital plan objectives are to support our operational needs and strategic plan for long-term growth while optimizing our cost of capital and financial position. To supplement cash from operating activities, we use a combination of bank financing, such as borrowings under our credit facilities, commercial paper program and senior note issuances, for general corporate purposes and to fund acquisitions. Our commercial paper program provides a cost effective means of addressing our short-term liquidity needs and is backstopped by our revolving credit facility, in that the amount of commercial paper notes outstanding cannot exceed the undrawn portion of our revolving credit facility. Finally, specialized lines of credit are also used in certain of our markets to fund merchant settlement prior to receipt of funds from the card networks. \nWe regularly evaluate our liquidity and capital position relative to cash requirements, and we may elect to raise additional funds in the future through the issuance of debt or equity or by other means. Accumulated cash balances are invested in high-quality, marketable short-term instruments. We believe that our current and projected sources of liquidity will be sufficient to meet our projected liquidity requirements associated with our operations for the near and long term.\n39\nTable of Contents\nOur consolidated statements of cash flows includes cash flows from discontinued operations for all periods presented, and therefore the following liquidity discussion includes both continuing and discontinued operations.\nAt September 30, 2025, we had cash and cash equivalents totalin\ng \n$2,785.3 million. Of this amount, we considered $1,304.1 million to be available for general purposes, of which $65.8 million is undistributed foreign earnings considered to be indefinitely reinvested outside the U.S. The available cash of $1,304.1 million does not include the following: (i) settlement-related cash balances, (ii) funds held as collateral for merchant losses (\"Merchant Reserves\") and (iii) certain funds held for customers. Settlement-related cash balances represent funds that we hold when the incoming amount from the card networks precedes the funding obligation to the merchant. Settlement-related cash balances are not restricted in their use; however, these funds are generally paid out in satisfaction of settlement processing obligations the following day. Merchant Reserves serve as collateral to minimize contingent liabilities associated with any losses that may occur under the merchant's agreement. While this cash is not restricted in its use, we believe that designating this cash as a Merchant Reserve strengthens our fiduciary standing with our member sponsors. Funds held for customers, which are not restricted in their use, include amounts collected before the corresponding obligation is due to be settled to or at the direction of our customers.\nWe also had restricted cash of\n \n$251.4 million\n as\n of September 30, 2025, representing amounts under legal restriction, amounts deposited by customers for prepaid card transactions and funds held as a liquidity reserve. These balances are subject to local regulatory restrictions requiring appropriate segregation and restriction in their use.\nOperating activities provided net cash of $2,141.4 million\n a\nnd $2,174.1 million for the nine months ended September 30, 2025 and 2024, respectively, which reflect net income adjusted for noncash items, including depreciation, amortization and the provision for credit losses, and changes in operating assets and liabilities. \nInvesting activities provided net cash of $79.6 million\n \nfor the nine months ended September 30, 2025 and we used net cash in investing activities of $846.6 million during the nine months ended September 30, 2024. \nCash used for investing activities primarily represents cash used to fund acquisitions and capital expenditures. During the nine\n months ended September 30, 2025 and 2024, we used cash\n of \n$201.9 million\n \nand $373.8 million, respectively, for acquisitions. We made capital expenditures \nof \n$449.6 million and $490.9 million during the nine months ended September 30, 2025 and 2024, respectively. These investments include software and hardware to support the development of new technologies, infrastructure to support our growing business and the consolidation and enhancement of our operating platforms. These investments also include new product development and innovation to further enhance and differentiate our suite of technology and cloud-based solutions available to customers. We expect to cont\ninue to make capital investments in the business, and we anticipate capital expenditures to be approximately \n$700 million\n during the year ending December 31, 2025. \nAdditionally, investing cash flows for the nine months ended September 30, 2025 includes the proceeds from the sale of Payroll Solutions. The net proceeds from business dispositions of $709.7 million during the period is presented net of $269.6 million of customer funds that were transferred to the buyer in the transaction, along with the associated customer liability. \nFinancing activities include borrowings and repayments made under our various debt arrangements, as well as borrowings and repayments made under specialized lines of credit to fund daily settlement activities. Our borrowing arrangements are further described in \"Note 5—Long-Term Debt and Lines of Credit\" in the notes to the accompanying unaudited consolidated financial statements and below under \"Long-Term Debt and Lines of Credit.\" Financing activities also include cash flows associated with changes in funds held from customers, changes in settlement processing assets and liabilities, common stock repurchase programs and share-based compensation programs, cash distributions made to our shareholders and cash contributions from and distributions to noncontrolling interests. Net cash used in financing activities was $2,126.0 million\n and \n$446.0 million for the nine months ended September 30, 2025 and 2024, respectively.\nProceeds from long-term debt we\nre \n$4,899.1 million\n an\nd $7,637.9 million for the nine months ended September 30, 2025 and 2024, respectively. Repayments of long-term debt we\nre \n$5,972.8 million and $5,803.0 million for the nine months ended September 30, 2025 and 2024, respectively. Proceeds from and repayments of long-term debt consist of borrowings and repayments that we make with available cash, from time to time, under our revolving credit facility, as well as scheduled principal repayments we make on our senior notes, finance leases and other vendor financing arrangements. Changes in settlement processing assets and obligations, net were a source of cash of $139.8 million and $789.7 million for the nine months ended September 30, 2025 and 2024, respectively. The change in cash from settlement processing assets and liabilities was due primarily to transaction volume and the timing of month-end. During the nine months ended September 30, 2024, we had net \n40\nTable of Contents\nrepayments of $1,367.9 million under our commercial paper program. Furthermore, in connection with the issuance of convertible notes in February 2024, we paid $256.3 million to purchase privately negotiated capped call transactions to hedge the potential dilutive effect upon conversion of the notes, or offset our cash obligation if the cash settlement option were to be elected. See section \"Long-Term Debt and Lines of Credit\" below for further discussion of our recent debt transactions. \nActivity under our settlement lines of credit is affected primarily by timing of month-end and transaction volume. During the nine months ended September 30, 2025 and 2024, we had net borrowings of $439.4 million\n and net repayments of\n $184.5 million, respectively, under our settlement lines of credit.\nWe repurchase our common stock mainly through open market repurchase plans and, at times, through accelerated share repurchase (\"ASR\") programs. During the nine months ended September 30, 2025 and 2024, we us\ned \n$1,191.1 million and $900.0 million, respectively, to repurchase and retire 13,171,490 and 6,972,979 shares of our common stock, respectively. The share repurchase activity for the nine months ended September 30, 2025 included the repurchase of 5,909,656 shares at an average price of $84.61 per share under an ASR agreement we entered into on August 6, 2025 with a financial institution to repurchase an aggregate of $500.0 million of our common stock during the ASR program purchase period. This ASR program was completed on September 26, 2025. The share repurchase activity for the nine months ended September 30, 2025 also included the repurchase of 2,449,366 shares at an average price of $102.07 per share under an ASR agreement we entered into on February 13, 2025 with a financial institution to repurchase an aggregate of $250.0 million of our common stock during the ASR program purchase period. This ASR program was completed on March 11, 2025. The share repurchase activity for the nine months ended September 30, 2024 included the repurchase of 1,414,759 shares using a portion of the net proceeds from our offering of 1.500% convertible unsecured senior notes due March 2031 through privately negotiated transactions with purchasers of notes in the offering, or one of their respective affiliates. The purchase price per share of the common stock repurchased in such transactions equaled the closing price of the common stock on February 20, 2024, which was $130.80 per share. As of September 30, 2025, the remaining amount available under our share repurchase program was $676.5 million.\nWe paid dividends to our common shareholders of $179.5 million and $190.5 million during the nine months ended September 30, 2025 and 2024, respectively. We also made distributions to noncontrolling interests of $49.2 million and $29.4 million during the nine months ended September 30, 2025 and 2024, respectively. On October 29, 2025, our board of directors declared a dividend of $0.25 per share payable on December 26, 2025 to common shareholders of record as of December 12, 2025. \nLong-Term Debt and Lines of Credit \nSenior Notes\nWe have $10.2 billion in aggregate principal amount of senior unsecured notes outstanding as of September 30, 2025, which mature at various dates ranging from March 2026 to August 2052. Interest on the senior notes is payable annually or semi-annually at various dates. Each series of the senior notes is redeemable, at our option, in whole or in part, at any time and from time to time at the redemption prices set forth in the related indenture. \nConvertible Notes\n1.500% Convertible Notes due March 1, 2031\nWe have $2.0 billion in aggregate principal amount of 1.500% convertible unsecured senior notes due March 2031 that were issued in 2024 through a private placement. The net proceeds from this offering were approximately $1.97 billion reflecting debt issuance costs of $33.5 million, which were capitalized and reflected as a reduction of the related carrying amount of the convertible notes in our consolidated balance sheets. Interest on the convertible notes is payable semi-annually in arrears on March 1 and September 1 of each year, beginning on September 1, 2024, to the holders of record on the preceding February 15 and August 15, respectively. \nIn connection with the issuance of the notes, we entered into privately negotiated capped call transactions with certain of the initial purchasers of the notes and other financial institutions to cover, subject to customary adjustments, the number of \n41\nTable of Contents\nshares of common stock initially underlying the notes. The economic effect of the capped call transactions is to hedge the potential dilutive effect upon the conversion of the notes, or offset our cash obligation if the cash settlement option is elected, for amounts in excess of the principal amount of converted notes subject to a cap. The price of the capped call transactions was $228.90 per share. The capped call transactions met the accounting criteria to be reflected in stockholders’ equity and not accounted for as derivatives. The cost of $256.3 million incurred in connection with the capped call transactions was reflected as a reduction to paid-in-capital in our consolidated statement of changes in equity for the nine months ended September 30, 2024, net of applicable income taxes.\n1.000% Convertible Notes due August 15, 2029\nWe also have $1.5 billion in aggregate principal amount of 1.000% convertible notes due August 2029 that were issued during 2022 in a private placement pursuant to an investment agreement with Silver Lake Partners. Interest on the convertible notes is payable semi-annually in arrears on February 15 and August 15 of each year, beginning on February 15, 2023, to the holders of record on the preceding February 1 and August 1, respectively. The convertible notes mature on August 15, 2029, subject to earlier conversion or repurchase. The notes, which are currently convertible, are presented within long-term debt in our consolidated balance sheets based on our intent and ability to refinance on a long-term basis should a conversion event occur.\nRevolving Credit Facility\nOn May 15, 2025, we entered into a credit agreement with Bank of America, N.A., as administrative agent, and a syndicate of financial institutions, as lenders and other agents. The credit agreement provides for an unsubordinated unsecured $7.25 billion revolving credit facility (the \"Revolving Credit Facility\"), of which (a) $5.75 billion of commitments have been made available on May 15, 2025 and (b) an additional $1.5 billion of commitments will be made available upon the closing of the proposed acquisition of Worldpay described in \"Note 1—Basis of Presentation and Summary of Significant Accounting Policies.\" Commitments under the Revolving Credit Facility may be increased to an aggregate amount not to exceed $7.5 billion. The Revolving Credit Facility matures in May 2030 and provides for up to two one-year maturity extensions. Borrowings under the Revolving Credit Facility may be repaid prior to maturity without premium or penalty, subject to payment of certain customary expenses of lenders and customary notice provisions. \nThe Revolving Credit Facility replaced our previous unsubordinated unsecured $5.75 billion revolving credit facility (the \"Prior Credit Facility\"), dated as of August 19, 2022, as amended, which was scheduled to mature in August 2027. In May 2025, all borrowings outstanding under the Prior Credit Facility were either repaid or continued under the Revolving Credit Facility pursuant to the terms of the new credit agreement. The Prior Credit Facility was terminated in connection with the execution of the Revolving Credit Facility.  \nBorrowings under the Revolving Credit Facility will be available to be made in US dollars, euros, sterling, Canadian dollars and, subject to certain conditions, certain other currencies at our option. Borrowings under the Revolving Credit Facility will bear interest, at our option, at a rate equal to (i) for secured overnight financing rate based currencies or certain alternative currencies, a secured overnight financing rate (subject to a 0.00% floor) or an alternative currency term rate (subject to a 0.00% floor), as applicable, (ii) for US dollar borrowings, a base rate, (iii) for US dollar borrowings, a daily floating secured overnight financing rate (subject to a 0.00% floor) or (iv) for certain alternative currencies, a daily alternative currency rate (subject to a 0.00% floor), in each case, plus an applicable margin. The applicable margin for borrowings other than base rate borrowings will range from 1.000% to 1.750% depending on our credit rating and is initially 1.375%.\nWe may issue standby letters of credit of up to $500 million in the aggregate under the Revolving Credit Facility. Outstanding letters of credit under the Revolving Credit Facility reduce the amount of borrowings available to us. The amounts available to borrow under the Revolving Credit Facility are also determined by a financial leverage covenant. As of September 30, 2025, there were borrowings of $1.5 billion outstanding under the Revolving Credit Facility with an interest rate of 5.5%, and the total available commitments under the Revolving Credit Facility were $4.1 billion. \n42\nTable of Contents\nCommercial Paper\nWe have a $2.0 billion commercial paper program under which we may issue senior unsecured commercial paper notes with maturities of up to 397 days from the date of issue. The commercial paper program is backstopped by our Revolving Credit Facility, in that the amount of commercial paper notes outstanding cannot exceed the undrawn portion of the Revolving Credit Facility. As such, we could draw on the Revolving Credit Facility to repay commercial paper notes that cannot be rolled over or refinanced with similar debt.\nCommercial paper notes are expected to be issued at a discount from par, or they may bear interest, each at commercial paper market rates dictated by market conditions at the time of their issuance. The proceeds from issuances of commercial paper notes will be used primarily for general corporate purposes but may also be used for acquisitions, to pay dividends, for debt refinancing or for other purposes. \nAs of September 30, 2025, \nwe ha\nd no borrowings outstanding under our commercial paper program.\nCompliance with Covenants\nThe convertible notes include customary covenants and events of default for convertible notes of this type. The revolving credit agreement contains customary affirmative covenants and restrictive covenants, including, among others, financial covenants based on net leverage and interest coverage ratios, and customary events of default. As of September 30, 2025, the required leverage ratio was 3.75 to 1.00. We were in compliance with all applicable covenants as of September 30, 2025.\nSettlement Lines of Credit\nIn various markets where we do business, we have specialized lines of credit that are restricted for use in funding settlement. The settlement lines of credit generally have variable interest rates, are subject to annual review and are denominated in local currency but may, in some cases, facilitate borrowings in multiple currencies. For certain of our lines of credit, the available credit is increased by the amount of cash we have on deposit in specific accounts with the lender. Accordingly, the amount of the outstanding lines of credit may exceed the stated credit limit. As of September 30, 2025, a total of $44.3 million of cash on deposit was used to determine the available credit. \nAs of September 30, 2025, we had an amount of $977.8 million outstanding under these lines of credit with additional capacity to fund settlement of $1,810.0 million. During the three months ended September 30, 2025, the maximum and average outstanding balances under these lines of credit were $977.8 million and $415.4 million, respectively. The weighted-average interest rate on these borrowings was 4.72% at September 30, 2025. \nCommitted Bridge Financing\n \nOn April 17, 2025, in connection with our entry into the definitive agreement to acquire Worldpay, we obtained $7.7 billion in committed bridge financing, which was subsequently reduced to $6.2 billion on May 15, 2025 in connection with the entry into the Revolving Credit Facility on May 15, 2025. \nEffect of New Accounting Pronouncements and Recently Issued Accounting Pronouncements Not Yet Adopted\n \nFrom time to time, new accounting pronouncements are issued by the Financial Accounting Standards Board or other standards setting bodies that may affect our current and/or future financial statements. See \"Note 1—Basis of Presentation and Summary of Significant Accounting Policies\" in the notes to the accompanying unaudited consolidated financial statements for a discussion of recently adopted accounting pronouncements and recently issued accounting pronouncements not yet adopted.\n43\nTable of Contents\nForward-Looking Statements\nSome of the statements we use in this report, and in some of the documents we incorporate by reference in this report, contain forward-looking statements concerning our business operations, economic performance and financial condition, including, but not limited to, statements we make regarding our business strategy and means to implement the strategy; measures of future results of operations, such as revenues, expenses, operating margins, income tax rates and earnings per share; other operating metrics such as shares outstanding and capital expenditures, liquidity, deleveraging plans and capital available for allocation; statements we make regarding guidance and projected financial results for the year 2025; the effects of general economic conditions on our business; statements about the benefits of our acquisitions or dispositions such as our proposed acquisition of Worldpay and divestiture of our Issuer Solutions business, including future financial and operating results and the successful integration of acquisitions; our ability to timely complete the acquisition of Worldpay and divestiture of our Issuer Solutions business, including receiving all required regulatory approvals in connection with the transactions; statements about the completion of anticipated benefits or strategic or operational initiatives; statements regarding our success and timing in developing and introducing new services and expanding our business; and other statements regarding our future financial performance and our plans, objectives, expectations and intentions. You can sometimes identify forward-looking statements by our use of the words \"believes,\" \"anticipates,\" \"expects,\" \"intends,\" \"plan,\" \"forecast,\" \"guidance\" and similar expressions. For these statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995.\nAlthough we believe that the plans and expectations reflected in or suggested by our forward-looking statements are reasonable, those statements are based on a number of assumptions, estimates, projections or plans that are inherently subject to significant risks, uncertainties and contingencies, many of which are beyond our control, cannot be foreseen and reflect future business decisions. Accordingly, we cannot guarantee that our plans and expectations will be achieved. Our actual revenues, revenue growth rates and margins, and other results of operations could differ materially from those anticipated in our forward-looking statements as a result of many known and unknown factors, many of which are beyond our ability to predict or control. Important factors that may otherwise cause actual events or results to differ materially from those anticipated by such forward-looking statements or historical performance include, among others, those discussed in \"Item 1A - Risk Factors\" of our Annual Report on Form 10-K for the year ended December 31, 2024, as well as in the other information appearing in this report and other filings we make with the SEC, including this Quarterly Report on Form 10-Q, which we advise you to review. \nThese cautionary statements qualify all of our forward-looking statements, and you are cautioned not to place undue reliance on these forward-looking statements. Our forward-looking statements speak only as of the date they are made and should not be relied upon as representing our plans and expectations as of any subsequent date. While we may elect to update or revise forward-looking statements at some time in the future, we specifically disclaim any obligation to publicly release the results of any revisions to our forward-looking statements, except as required by law."
}