{
  "source_file": "gww-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2: Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following Management’s Discussion and Analysis (MD&A) of Financial Condition and Results of Operations is intended to help the reader understand the results of operations and financial condition of W.W. Grainger, Inc. (Grainger or Company) as it is viewed by management of the Company. The following discussion should be read in conjunction \nwith the Consolidated Financial Statements and accompanying notes for the year ended December 31, 2024 included in the Company's 2024 Form 10-K \nand the Condensed Consolidated Financial Statements and accompanying notes included in Part I, Item 1: Financial Statements of this Form 10-Q.\nPercentage figures included in this section have not been calculated on the basis of such rounded figures but on the basis of such amounts prior to rounding. For this reason, percentage amounts in this section may vary slightly from those obtained by performing the same calculations using the figures in the Company's Condensed Consolidated Financial Statements or in the associated text.\nOverview\nGrainger is a broad line, business-to-business distributor of maintenance, repair and operating (MRO) products and services with operations primarily in North America, Japan and the U.K. Grainger uses a combination of its high-touch solutions and endless assortment businesses to serve its customers worldwide, which rely on Grainger for products and services that enable them to run safe, sustainable and productive operations.\nStrategic Priorities\nFor a discussion of the Company’s strategic priorities for 2025, see Part 1, Item 1: Business and Part II, Item 7: Management’s Discussion and Analysis of Financial Condition and Results of Operations in the Company’s 2024 Form 10-K.\nRecent Events\nMacroeconomic Conditions\nThe global economy continues to experience elevated levels of volatility and uncertainty, including within the commodity, labor, and transportation markets, driven by a combination of geopolitical developments and macroeconomic factors. Recent imposition of new and fluctuating tariffs have further contributed to disruptions in global capital markets and global supply chains. These developments may impact the Company’s operations, financial condition, and results of operations.\nThe Company is actively monitoring economic conditions in the U.S. and internationally, including the potential ramifications of evolving trade policies, changes in interest rates, foreign currency exchange rate fluctuations, inflationary pressures, and the risk of a global or regional economic recession. In response to these factors, the Company has implemented various strategies designed to mitigate certain adverse effects of changing inflationary conditions and supply chain challenges, while continuing to maintain market price competitiveness to the extent possible.\nHistorically, the Company's broad and diverse customer base and the generally nondiscretionary nature of its products have provided a degree of resilience during periods of economic contraction in the industrial MRO market. However, the ultimate impact of ongoing macroeconomic conditions, including recent, unprecedented tariff-related developments and shifting government budget policies and priorities at the municipal, state, and national levels, remains uncertain and cannot be predicted at this time, but may impact the Company’s operations, financial condition, and results of operations.\nFor further discussion of the Company's risks and uncertainties, see Part I, Item 1A: Risk Factors in the Company’s 2024 Form 10-K.\n18\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nResults of Operations –Three Months Ended September 30, 2025 \nIn this section, Grainger utilizes non-GAAP measures where it believes it will assist users of its financial statements in understanding its business. As discussed in the \"Non-GAAP Measures\" section, we have adjusted the current year results to exclude one-time losses recorded in SG&A expenses of \n$186 million\n within Other and \n$10 million\n within Endless Assortment, related to the intention to exit the U.K. market. For further information regarding the Company's non-GAAP measures, including reconciliations to the most directly comparable GAAP measures, see below \"Non-GAAP Measures.\"\nThe following table is included as an aid to understanding the changes in Grainger’s Condensed Consolidated Statements of Earnings for the three months ended September 30, 2025 and 2024 (in millions of dollars except per share amounts):\nThree Months Ended September 30,\n% Change\n% of Net Sales\n2025\n2024\n2025\n2024\nNet sales\n(1)\n$\n4,657 \n$\n4,388 \n6.1 \n%\n100.0 \n%\n100.0 \n%\nCost of goods sold\n2,859 \n2,668 \n7.2 \n61.4 \n60.8 \nGross profit\n1,798 \n1,720 \n4.5 \n38.6 \n39.2 \nSelling, general and administrative expenses\n1,287 \n1,034 \n24.5 \n27.6 \n23.6 \nOperating earnings\n511 \n686 \n(25.5)\n11.0 \n15.6 \nOther expense – net\n19 \n15 \n26.7 \n0.4 \n0.3 \nIncome tax provision\n171 \n166 \n3.0 \n3.7 \n3.8 \nNet earnings\n321 \n505 \n(36.4)\n6.9 \n11.5 \nNoncontrolling interest\n27 \n19 \n42.1 \n0.6 \n0.4 \nNet earnings attributable to W.W. Grainger, Inc.\n$\n294 \n$\n486 \n(39.5)\n6.3 \n%\n11.1 \n%\nDiluted earnings per share\n$\n6.12 \n$\n9.87 \n(38.0)\n%\n(1)\nFor further information regarding the Company's disaggregated revenue, see Note 3 of the Notes to Condensed Consolidated Financial Statements in Part 1, Item 1: Financial Statements of this Form 10-Q.\nThe following table is included as an aid to understanding the changes of Grainger's total net sales, daily net sales and daily, constant currency net sales from the prior period for the three months ended September 30, 2025 and 2024 (in millions of dollars):\nThree Months Ended September 30,\n2025\n% Change\n(1)\n2024\n% Change\n(1)\nNet sales \n$\n4,657 \n6.1 \n%\n$\n4,388 \n4.3 \n%\nDaily net sales\n(2)\n$\n72.8 \n6.1 \n%\n$\n67.5 \n2.6 \n%\nDaily, constant currency net sales\n(2)\n$\n72.3 \n5.4 \n%\n$\n68.2 \n3.6 \n%\n(1)\nCalculated on the basis of prior year net sales for the three months ended September 30, 2025 and 2024.\n(2)\nDaily net sales are adjusted for the difference in U.S. selling days relative to the prior year period. Daily, constant currency net sales are also adjusted to exclude the impact on net sales due to year-over-year foreign currency exchange rate fluctuations. There were 64 sales days in the three months ended September 30, 2025 and 2024. \nFor further information regarding the Company's non-GAAP measures, including reconciliations to the most directly comparable GAAP measures, see below \"Non-GAAP Measures.\"\n19\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nNet sales of $4,657 million for the three months ended September 30, 2025 increased $269 million, or 6%, and on a daily, constant currency basis, net sales increased 5% compared to the same period in 2024. Both High-Touch Solutions N.A. and the Endless Assortment segment contributed to sales growth in the third quarter of 2025\n. \nFor further discussion on the Company's net sales, see the Segment Analysis section below. \nGross profit of $1,798 million for the three months ended September 30, 2025 increased $78 million, or 5%, and gross profit margin of 38.6% decreased 60 basis points compared to the same period in 2024. For further discussion on the Company's gross profit, see the Segment Analysis section below.\nSelling, general and administrative (SG&A) expenses of $1,287 million for the three months ended September 30, 2025 increased $253 million, or 25%, compared to the same period in 2024. Adjusted SG&A expenses of $1,091 million increased $57 million, or 6%, compared to the same period in 2024. The increase was primarily due to higher marketing expenses in the third quarter of 2025.\nOperating earnings of $511 million for the three months ended September 30, 2025 decreased $175 million, or 26%, compared to the same period in 2024. Adjusted operating earnings of $707 million\n \nincreased $21 million, or 3%, compared to the same period in 2024. The increase was due to higher gross profit dollars, partially offset by increased SG&A expenses in the third quarter of 2025.\nIncome tax expense of $171 million for the three months ended September 30, 2025 increased $5 million compared to the same period in 2024 on a reported and adjusted basis. Grainger's effective tax rates were 34.7% and 24.8% for the three months ended September 30, 2025 and 2024, respectively. The adjusted effective tax rate was 24.8%\n \nfor the three months ended September 30, 2025. \nDiluted earnings per share was $6.12 for the three months ended September 30, 2025, a decrease of 38% compared to $9.87 for the same period in 2024. Adjusted diluted earnings per share increased 3% for the same period in 2024.\nSegment Analysis\nIn this section, Grainger utilizes non-GAAP measures where it believes it will assist users of its financial statements in understanding its business. For further information regarding the Company's non-GAAP measures, including reconciliations to the most directly comparable GAAP measure, see below \"Non-GAAP Measures.\" For further segment information, see Note 7 of the Notes to Condensed Consolidated Financial Statements in Part I, Item 1: Financial Statements of this Form 10-Q.\nHigh-Touch Solutions N.A.\nThe following table shows reported segment results (in millions of dollars):\nThree Months Ended September 30,\n2025\n2024\n% Change \nNet sales\n$\n3,635 \n$\n3,515 \n3.4 \n%\nGross profit\n$\n1,495 \n$\n1,462 \n2.3 \n%\nSelling, general and administrative expenses\n871 \n845 \n3.1 \n%\nOperating earnings\n$\n624 \n$\n617 \n1.1 \n%\nNet sales of $3,635 million for the three months ended September 30, 2025 increased $120 million, which represents a 3% increase on a reported and daily, constant currency basis, compared to the same period in 2024. The increase was primarily due to volume.\nGross profit of $1,495 million for the three months ended September 30, 2025 increased $33 million, or 2%, and gross profit margin of 41.1% decreased\n \n50 basis points compared to the same period in 2024. The decrease was primarily driven by negative price cost spread due to timing and last-in, first-out (LIFO) inventory valuation impacts.\n20\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nSG&A expenses of $871 million for the three months ended September 30, 2025 increased $26 million, or 3%, compared to the same period in 2024. The increase was primarily due to higher marketing expenses. \nOperating earnings of $624 million for the three months ended September 30, 2025 increased $7 million, or 1%\n,\n compared to the same period in 2024.\nEndless Assortment\nThe following table sho\nws reported segment results (in millions of dollars):\nThree Months Ended September 30,\n2025\n2024\n% Change\nNet sales\n$\n935 \n$\n791 \n18.2 \n%\nGross profit\n$\n281 \n$\n233 \n20.6 \n%\nSelling, general and administrative expenses\n199 \n163 \n22.1 \n%\nOperating earnings\n$\n82 \n$\n70 \n17.1 \n%\nNet sales of $935 million for the three months ended September 30, 2025 increased $144 million, or 18%, and on a daily, constant currency basis increased 15% compared to the same period in 2024. The increase was due to repeat business for the segment and enterprise customer growth at MonotaRO. \nGross profit of $281 million for the three months ended September 30, 2025 increased $48 million, or 21%, and gross profit margin of 30.1% increased 60 basis points compared to the same period in 2024. The increase was primarily driven by pricing updates at Zoro and favorable product mix at MonotaRO.\nSG&A expenses of $199 million for the three months ended September 30, 2025 increased $36 million, or 22%, compared to the same period in 2024. Adjusted SG&A expenses increased $26 million, or 16%, compared to the same period in 2024. The increase was primarily due to higher marketing expenses.\nOperating earnings of $82 million for the three months ended September 30, 2025 increased $12 million, or 17%, compared to the same period in 2024. Adjusted operating earnings of $92 million\n \nincreased $22 million, or 31%, compared to the same period in 2024.\n21\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nResults of Operations – Nine Months Ended September 30, 2025\nIn this section, Grainger utilizes non-GAAP measures where it believes it will assist users of its financial statements in understanding its business. As discussed in the \"Non-GAAP Measures\" section, we have adjusted the current year results to exclude one-time losses recorded in SG&A expenses of \n$186 million\n within Other and \n$10 million\n within Endless Assortment, related to the intention to exit the U.K. market. For further information regarding the Company's non-GAAP measures, including reconciliations to the most directly comparable GAAP measure, see below \"Non-GAAP Measures.\"\nThe following table is included as an aid to understanding the changes in Grainger's Condensed Consolidated Statements of Earnings (in millions of dollars except per share amounts):\nNine Months Ended September 30,\n% Change\n% of Net Sales \n2025\n2024\n2025\n2024\nNet sales\n(1)\n$\n13,517 \n$\n12,935 \n4.5 \n%\n100.0 \n%\n100.0 \n%\nCost of goods sold\n8,254 \n7,853 \n5.1 \n61.1 \n60.7 \nGross profit\n5,263 \n5,082 \n3.6 \n38.9 \n39.3 \nSelling, general and administrative expenses\n3,402 \n3,078 \n10.5 \n25.1 \n23.8 \nOperating earnings\n1,861 \n2,004 \n(7.1)\n13.8 \n15.5 \nOther expense – net\n51 \n42 \n21.4 \n0.4 \n0.4 \nIncome tax provision\n481 \n470 \n2.3 \n3.6 \n3.6 \nNet earnings\n1,329 \n1,492 \n(10.9)\n9.8 \n11.5 \nNoncontrolling interest\n74 \n58 \n27.6 \n0.5 \n0.4 \nNet earnings attributable to W.W. Grainger, Inc.\n$\n1,255 \n$\n1,434 \n(12.5)\n9.3 \n%\n11.1 \n%\nDiluted earnings per share\n$\n25.97 \n$\n29.00 \n(10.4)\n%\n(1)\nFor further information regarding the Company's disaggregated revenue, see Note 3 of the Notes to Condensed Consolidated Financial Statements in Part 1, Item 1: Financial Statements of this Form 10-Q.\nThe following table is included as an aid to understanding the changes of Grainger's total net sales, daily net sales and daily, constant currency net sales compared from the prior period for the nine months ended September 30, 2025 and 2024 (in millions of dollars):\nNine Months Ended September 30,\n2025\n% Change\n(1)\n2024\n% Change\n(1)\nNet sales \n$\n13,517 \n4.5 \n%\n$\n12,935 \n3.6 \n%\nDaily net sales\n(2)\n$\n71.2 \n5.0 \n%\n$\n67.0 \n3.1 \n%\nDaily, constant currency net sales\n(2)\n$\n71.2 \n4.9 \n%\n$\n67.8 \n4.3 \n%\n(1)\nCalculated on the basis of prior year net sales for the nine months ended September 30, 2025 and 2024.\n(2)\nDaily net sales are adjusted for the difference in U.S. selling days relative to the prior year period. Daily, constant currency net sales are also adjusted to exclude the impact on net sales due to year-over-year foreign currency exchange rate fluctuations. There were 191 and 192 sales days in the nine months ended September 30, 2025 and 2024, respectively. \nFor further information regarding the Company's non-GAAP measures, including reconciliations to the most directly comparable GAAP measure, see below \"Non-GAAP Measures.\"\n22\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nNet sales of $13,517 million for the nine months ended September 30, 2025 increased $582 million, or 5%, and on a daily, constant currency basis increased 5% compared to the same period in 2024. Both High-Touch Solutions N.A. and the Endless Assortment segments contributed to sales growth in the nine months ended September 30, 2025. For further discussion on the Company's net sales, see the Segment Analysis section below. \nGross profit of $5,263 million for the nine months ended September 30, 2025 increased $181 million, or 4%, and gross profit margin of 38.9% decreased 40 basis points compared to the same period in 2024. For further discussion on the Company's gross profit, see the Segment Analysis section below.\nSG&A expenses of $3,402 million for the nine months ended September 30, 2025 increased $324 million, or 11%, compared to the same period in 2024. Adjusted SG&A expenses of $3,206 million increased $144 million, or 5%, due to higher marketing expenses in 2025. \nOperating earnings of $1,861 million for the nine months ended September 30, 2025 decreased $143 million, or 7%, compared to the same period in 2024. Adjusted operating earnings of $2,057 million\n \nincreased $37 million, or 2% compared to the same period in 2024. \nIncome taxes of $481 million for the nine months ended September 30, 2025 increased $11 million, compared to the same period in 2024. Adjusted income taxes increased $7 million, compared to the same period in 2024. Grainger's effective tax rates were 26.6% and 24.0% for the nine months ended September 30, 2025 and 2024, respectively. The adjusted effective tax rate was 24.0% for the nine months ended September 30, 2025 and 2024.\nDiluted earnings per share was $25.97 for the nine months ended September 30, 2025, a decrease of 10% compared to $29.00 for the same period in 2024. Adjusted diluted earnings per share increased 3% compared to $29.25 for the same period in 2024.\nSegment Analysis\nIn this section, Grainger utilizes non-GAAP measures where it believes it will assist users of its financial statements in understanding its business. For further information regarding the Company's non-GAAP measures, including reconciliations to the most directly comparable GAAP measure, see \"Non-GAAP Measures.\" For further segment information, see Note 7 of the Notes to Condensed Consolidated Financial Statements in Part I, Item 1: Financial Statements of this Form 10-Q.\nHigh-Touch Solutions N.A.\nThe following table shows reported segment results (in millions of dollars):\nNine Months Ended September 30,\n2025\n2024\n% Change\nNet sales\n$\n10,576 \n$\n10,378 \n1.9 \n%\nGross profit\n$\n4,388 \n$\n4,328 \n1.4 \n%\nSelling, general and administrative expenses\n2,575 \n2,510 \n2.6 \n%\nOperating earnings\n$\n1,813 \n$\n1,818 \n(0.3)\n%\nNet sales of $10,576 million for the nine months ended September 30, 2025 increased $198 million, or 2%, and on a daily, constant currency basis increased 3% compared to the same period in 2024. The increase was primarily due to volume.\nGross profit of $4,388 million for the nine months ended September 30, 2025 increased $60 million, or 1%, and gross profit margin of 41.5% decreased 20 basis points compared to the same period in 2024. \nSG&A expenses of $2,575 million for the nine months ended September 30, 2025 increased $65 million, or 3%, compared to the same period in 2024. Adjusted SG&A expenses increased $80 million, or 3%. The increase was primarily due to higher marketing and payroll and benefit expenses in 2025. \n23\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nOperating earnings of $1,813 million for the nine months ended September 30, 2025 were flat compared to the same period in 2024. Adjusted operating earnings deceased $20 million, or 1%, compared to the same period in 2024.\nEndless Assortment\nThe following table sho\nws reported segment results (in millions of dollars):\nNine Months Ended September 30,\n2025\n2024\n% Change\nNet sales\n$\n2,692 \n$\n2,318 \n16.1 \n%\nGross profit\n$\n803 \n$\n682 \n17.7 \n%\nSelling, general and administrative expenses\n557 \n492 \n13.2 \n%\nOperating earnings\n$\n246 \n$\n190 \n29.5 \n%\nNet sales of $2,692 million for the nine months ended September 30, 2025 increased $374 million, or 16%, and on a daily, constant currency basis increased 15% compared to the same period in 2024. The increase was due to repeat business for the segment and enterprise customer growth at MonotaRO.\nGross profit of $803 million for the nine months ended September 30, 2025 increased $121 million, or 18%, and gross profit margin of 29.8% increased 40 basis points compared to the same period in 2024. \nSG&A expenses of $557 million for the nine months ended September 30, 2025 increased $65 million, or 13%, compared to the same period in 2024. Adjusted SG&A expenses of $547 million\n \nincreased $55 million, or 11%, compared to the same period in 2024. The increase was primarily due to higher marketing expenses in 2025.\nOperating earnings of $246 million for the nine months ended September 30, 2025 increased $56 million, or 30% compared to the same period in 2024. Adjusted operating earnings of $256 million increased $66 million, or 35%, compared to the same period in 2024.\n24\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nNon-GAAP Measures \nGrainger utilizes non-GAAP measures where it believes it will assist users of its financial statements in understanding its business. Non-GAAP measures exclude certain items affecting comparability that can affect the year-over-year assessment of operating results and other one-time items that do not directly reflect ongoing operating resul\nts. The Company adjusts its reported net sales when there are differences in the number of U.S. selling days relative to the prior year period and also excludes the impact on reported net sales due to changes in foreign currency exchange rate fluctuations and results of certain divested businesses. Adjusted results including adjusted SG&A, adjusted operating earnings, adjusted net earnings and adjusted diluted EPS exclude certain non-recurring items, including restructuring charges, asset impairments, gains and losses associated with business divestitures and other non-recurring, infrequent or unusual gains and losses from the Company’s most directly comparable reported U.S. generally accepted accounting principles (GAAP) results. The Company believes its non-GAAP measures provide meaningful information to assist investors in understanding financial results and assessing prospects for future performance as they provide a better baseline for analyzing the ongoing performance of its businesses by excluding items that may not be indicative of \ncore operating results and comparability. \nGrainger’s non-GAAP finan\ncial measures should be considered in addition to, and not as a replacement for or as a superior measure to, its most directly comparable GAAP measures and may not be comparable to similarly titled measures reported by other companies. \nExiting Market in the United Kingdom\nIn 2025, Grainger performed an assessment of its businesses in the United Kingdom (U.K.) and made the decision to exit the U.K. market in order to concentrate efforts where it can deliver the greatest long-term impact. In September 2025, the Company committed to a plan to sell its Cromwell business in the U.K. and entered into a definitive agreement on October 6, 2025. The Company concluded that the business met the criteria as held for sale as of September 30, 2025 and recorded a pre-tax asset impairment loss of $186 million in SG&A expenses. There was no tax benefit as a result of this impairment loss. Additionally, the Company made the decision to propose the closure of Zoro U.K. in its Endless Assortment segment, subject to the outcome of the required legal, regulatory and employment consultation processes in the U.K. Expenses related to the proposed closure of $10 million were also recorded in SG&A expenses. There was no tax benefit as a result of the recognition of these expenses. The Company does not expect the exit from the U.K. market to have a material effect on its future results of operations. See Note 2, \"Assets and Liabilities Held for Sale,\" to the Condensed Consolidated Financial Statements in Item 1 for more information on the planned sale of the Cromwell business.\n25\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nThe following tables provide reconciliations of reported net sales growth from the prior year period in accordance with GAAP to the Company's non-GAAP measures daily net sales and daily, constant currency net sales \nfor t\nhe three months ended September 30, 2025 and 2024 (in millions of dollars):\nThree Months Ended September 30,\nHigh-Touch Solutions N.A.\nEndless Assortment\nTotal Company\n(1)\n2025\n% Change\n(2)\n2025\n% Change\n(2)\n2025\n% Change\n(2)\nReported net sales\n$\n3,635 \n3.4 \n%\n$\n935 \n18.2 \n%\n$\n4,657\n \n6.1 \n%\n   Daily impact\n(3)\n— \n— \n— \n— \n— \n— \nDaily net sales\n56.8 \n3.4 \n14.6 \n18.2 \n72.8 \n6.1 \n   Foreign currency exchange\n(4)\n— \n— \n(0.4)\n(3.6)\n(0.5)\n(0.7)\nDaily, constant currency net sales\n$\n56.8 \n3.4 \n%\n$\n14.2 \n14.6 \n%\n$\n72.3 \n5.4 \n%\n2024\n% Change\n(2)\n2024\n% Change\n(2)\n2024\n% Change\n(2)\nReported net sales\n$\n3,515 \n3.3 \n%\n$\n791 \n8.1 \n%\n$\n4,388\n \n4.3 \n%\n   Daily impact\n(3)\n(0.9)\n(1.6)\n(0.2)\n(1.7)\n(1.1)\n(1.7)\nDaily net sales\n54.1 \n1.7 \n12.2 \n6.4 \n67.5 \n2.6 \n   Foreign currency exchange\n(4)\n0.1 \n0.3 \n0.6 \n5.1 \n0.7 \n1.0 \nDaily, constant currency net sales\n$\n54.2 \n2.0 \n%\n$\n12.8 \n11.5 \n%\n$\n68.2 \n3.6 \n%\n(1)\nTotal Company includes Other. Grainger's businesses reported in Other do not meet the criteria of a reportable segment.\n(2)\nCompared to net sales in the prior year period.\n(3)\nExcludes the impact on net sales due to the difference in U.S. selling days relative to the prior year period on a daily basis. There were 64 sales days in the three months ended September 30, 2025 and 2024.\n(4)\nExcludes the impact on net sales due to year-over-year foreign currency exchange rate fluctuations on a daily basis.\n26\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nThe following tables provide reconciliations of reported net sales growth from the prior year period in accordance with GAAP to the Company's non-GAAP measures daily net sales and daily, constant currency net sales \nfor t\nhe nine months ended September 30, 2025 and 2024 (in millions of dollars):\nNine Months Ended September 30,\nHigh-Touch Solutions N.A.\nEndless Assortment\nTotal Company\n(1)\n2025\n% Change\n(2)\n2025\n% Change\n(2)\n2025\n% Change\n(2)\nReported net sales\n$\n10,576 \n1.9 \n%\n$\n2,692 \n16.1 \n%\n$\n13,517\n \n4.5 \n%\n   Daily impact\n(3)\n0.3 \n0.5 \n0.1 \n0.6 \n0.4 \n0.5 \nDaily net sales\n55.7 \n2.4 \n14.2 \n16.7 \n71.2 \n5.0 \n   Foreign currency exchange\n(4)\n0.2 \n0.3 \n(0.2)\n(1.3)\n— \n(0.1)\nDaily, constant currency net sales\n$\n55.9 \n2.7 \n%\n$\n14.0 \n15.4 \n%\n$\n71.2 \n4.9 \n%\n2024\n% Change\n(2)\n2024\n% Change\n(2)\n2024\n% Change\n(2)\nReported net sales\n$\n10,378 \n3.2 \n%\n$\n2,318 \n5.0 \n%\n$\n12,935\n \n3.6 \n%\n   Daily impact\n(3)\n(0.3)\n(0.5)\n(0.1)\n(0.5)\n(0.4)\n(0.5)\nDaily net sales\n53.8 \n2.7 \n12.0 \n4.5 \n67.0 \n3.1 \n   Foreign currency exchange\n(4)\n— \n— \n0.8 \n6.6 \n0.8 \n1.2 \nDaily, constant currency net sales\n$\n53.8 \n2.7 \n%\n$\n12.8 \n11.1 \n%\n$\n67.8 \n4.3 \n%\n(1)\nTotal Company includes Other. Grainger's businesses reported in Other do not meet the criteria of a reportable segment.\n(2)\nCompared to net sales in the prior year period.\n(3)\nExcludes the impact on net sales due to the difference in U.S. selling days relative to the prior year period on a daily basis. There were 191 and 192 sales days in the nine months ended September 30, 2025 and 2024, respectively.\n(4)\nExcludes the impact on net sales due to year-over-year foreign currency exchange rate fluctuations on a daily basis.\nThe following tables provide reconciliations of reported SG&A expenses, operating earnings, net earnings attributable to W.W. Grainger, Inc. and diluted earnings per share determined in accordance with GAAP to the Company's non-GAAP measures adjusted SG&A expenses, adjusted operating earnings, adjusted net earnings attributable to W.W. Grainger, Inc. and adjusted diluted earnings per share for the three and nine months ended September 30, 2025 and 2024 (in millions of dollars):\n27\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nThree months ended September 30, 2025\nReported\nAdjustment\n(1)\nAdjusted\n% Change Reported\n(2)\n% Change Adjusted\n(2)\nSelling, general and administrative expenses\nHigh-Touch Solutions N.A.\n$\n871 \n$\n— \n$\n871 \nEndless Assortment\n199 \n(10)\n189 \nOther\n(3)\n217 \n(\n186\n)\n31 \nSelling, general and administrative expenses\n$\n1,287\n \n$\n(196)\n$\n1,091 \n24.5%\n5.5%\nEarnings\nHigh-Touch Solutions N.A.\n$\n624 \n$\n— \n$\n624 \nEndless Assortment\n82 \n10 \n92 \nOther\n(3)\n(195)\n186 \n(9)\nOperating earnings\n$\n511\n \n$\n196 \n$\n707 \n(25.5)%\n3.1%\nTotal other expense – net\n(19)\n— \n(19)\nIncome tax provision\n(4)\n(171)\n— \n(171)\nNet earnings\n$\n321 \n$\n196 \n$\n517 \nNoncontrolling interest\n(27)\n— \n(27)\nNet earnings attributable to W.W. Grainger, Inc.                                                                                                                                                                                                                                                                                                                                                           \n$\n294 \n$\n196 \n$\n490 \n(39.5)%\n0.8%\nDiluted earnings per share\n$\n6.12\n \n$\n4.09 \n$\n10.21 \n(38.0)%\n3.4%\nThree months ended September 30, 2024\nReported\nAdjustment\n(1)\nAdjusted\n% Change Reported\n(2)\n% Change Adjusted\n(2)\nSelling, general and administrative expenses\nHigh-Touch Solutions N.A.\n$\n845 \n$\n— \n$\n845 \nEndless Assortment\n163 \n— \n163 \nOther\n(3)\n26 \n— \n26 \nSelling, general and administrative expenses\n$\n1,034\n \n$\n— \n$\n1,034 \n4.7%\n4.7%\nEarnings\nHigh-Touch Solutions N.A.\n$\n617 \n$\n— \n$\n617 \nEndless Assortment\n70 \n— \n70 \nOther\n(3)\n(1)\n— \n(1)\nOperating earnings\n$\n686\n \n$\n— \n$\n686 \n2.8%\n2.8%\nTotal other expense – net\n(15)\n— \n(15)\nIncome tax provision\n(166)\n— \n(166)\nNet earnings\n$\n505 \n$\n— \n$\n505 \nNoncontrolling interest\n(19)\n— \n(19)\nNet earnings attributable to W.W. Grainger, Inc.\n$\n486 \n$\n— \n$\n486 \n2.1%\n2.1%\nDiluted earnings per share\n$\n9.87\n \n$\n— \n$\n9.87 \n4.7%\n4.7%\n(1)\nReflects the asset impairment loss and other expenses recorded in the third quarter of 2025 related to the Company's intention to exit the U.K. market, including the planned divestiture of the Cromwell business, which was held for sale as of September 30, 2025. There were no non-GAAP adjustments for the three months ended September 30, 2024.\n(2)\nCompared to the reported and adjusted results of the prior year period.\n(3)\nGrainger's businesses reported in Other do not meet the criteria of a reportable segment.\n(4)\nGrainger's reported and adjusted effective tax rates were 34.7% and 24.8% for the three months ended September 30, 2025, respectively.\n28\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nNine Months Ended September 30, 2025\nReported\nAdjustment\n(1)\nAdjusted\n% Change Reported\n(2)\n% Change Adjusted\n(2)\nSelling, general and administrative expenses\nHigh-Touch Solutions N.A.\n$\n2,575 \n$\n— \n$\n2,575 \nEndless Assortment\n557 \n(10)\n547 \nOther\n(3)\n270 \n(186)\n84 \nSelling, general and administrative expenses\n$\n3,402\n \n$\n(196)\n$\n3,206 \n10.5%\n4.7%\nEarnings\nHigh-Touch Solutions N.A.\n$\n1,813 \n$\n— \n$\n1,813 \nEndless Assortment\n246 \n10 \n256 \nOther\n(3)\n(198)\n186 \n(12)\nOperating earnings\n$\n1,861\n \n$\n196 \n$\n2,057 \n(7.1)%\n1.8%\nTotal other expense – net\n(51)\n— \n(51)\nIncome tax provision\n(4)\n(481)\n— \n(481)\nNet earnings\n$\n1,329 \n$\n196 \n$\n1,525 \nNoncontrolling interest\n(74)\n— \n(74)\nNet earnings attributable to W.W. Grainger, Inc.                                                                                                                                                                                                                                                                                                                                                           \n$\n1,255 \n$\n196 \n$\n1,451 \n(12.5)%\n0.3%\nDiluted earnings per share\n$\n25.97\n \n$\n4.06 \n$\n30.03 \n(10.4)%\n2.7%\nNine Months Ended September 30, 2024\nReported\nAdjustment\n(1)\nAdjusted\n% Change Reported\n(2)\n% Change Adjusted\n(2)\nSelling, general and administrative expenses\nHigh-Touch Solutions N.A.\n$\n2,510 \n$\n(15)\n$\n2,495 \nEndless Assortment\n492 \n— \n492 \nOther\n(3)\n76 \n(1)\n75 \nSelling, general and administrative expenses\n$\n3,078\n \n$\n(16)\n$\n3,062 \n5.2%\n4.7%\nEarnings\nHigh-Touch Solutions N.A.\n$\n1,818 \n$\n15 \n$\n1,833 \nEndless Assortment\n190 \n— \n190 \nOther\n(3)\n(4)\n1 \n(3)\nOperating earnings\n$\n2,004\n \n$\n16 \n$\n2,020 \n(0.2)%\n0.6%\nTotal other expense – net\n(42)\n— \n(42)\nIncome tax provision\n(4)\n(470)\n(4)\n(474)\nNet earnings\n$\n1,492 \n$\n12 \n$\n1,504 \nNoncontrolling interest\n(58)\n— \n(58)\nNet earnings attributable to W.W. Grainger, Inc.\n$\n1,434 \n$\n12 \n$\n1,446 \n—%\n0.8%\nDiluted earnings per share\n$\n29.00\n \n$\n0.25 \n$\n29.25 \n2.4%\n3.3%\n(1)\nReflects the asset impairment loss and other expenses recorded in the third quarter of 2025 related to the Company's intention to exit the U.K. market, including the planned divestiture of the Cromwell business, which was held for sale as of September 30, 2025, and restructuring costs incurred in the second quarter of 2024.\n(2)\nCompared to the reported and adjusted results of the prior year period.\n(3)\nGrainger's businesses reported in Other do not meet the criteria of a reportable segment.\n(4)\nGrainger's reported and adjusted effective tax rates were 26.6% and 24.0% for the nine months ended September 30, 2025, respectively. The nine months ended September 30, 2024 reflect a tax benefit related to the restructuring costs incurred in the second quarter. \n29\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nLiquidity and Capital Resources\nGrainger believes its current balances of cash and cash equivalents, marketable securities, and availability under its revolving credit facility will be sufficient to meet its liquidity needs for the next twelve months. The Company expects to continue to invest in its business and return excess cash to shareholders through cash dividends and share repurchases, which it plans to fund through cash flows generated from operations. Grainger also maintains access to capital markets and may issue debt or equity securities from time to time, which may provide an additional source of liquidity.\nCash and Cash Equivalents\nAs of September 30, 2025 and December 31, 2024, Grainger had cash and cash equivalents of $535 million and $1,036 million, respectively. The Company had approximately $1.8 billion in available liquidity as of September 30, 2025.\nCash Flows\nThe following table shows the Company's cash flow activity for the periods presented (in millions of dollars):\nNine Months Ended September 30,\n2025\n2024\nTotal cash provided by (used in):\nOperating activities\n$\n1,620 \n$\n1,683 \nInvesting activities\n(543)\n(262)\nFinancing activities\n(1,599)\n(615)\nEffect of exchange rate changes on cash and cash equivalents\n21\n(18)\nIncrease (decrease) in cash and cash equivalents\n$\n(501)\n$\n788 \nNet cash provided by operating activities was $1,620 million and $1,683 million for the nine months ended September 30, 2025 and 2024, respectively. The decrease was driven by unfavorable changes in working capital primarily due to inventory inflation partially offset by timing of cash payments compared to the prior year period.\nNet cash used in investing activities was $543 million and $262 million for the nine months ended September 30, 2025 and 2024, respectively. The increase was due to capital expenditures driven by continued U.S. and MonotaRO supply chain investments in the first nine months of 2025. \nNet cash used in financing activities was $1,599 million and $615 million for the nine months ended September 30, 2025 and 2024, respectively. The increase in cash used in financing activities was primarily due to the repayment of the 1.85% Senior Notes in the amount of $500 million.\nWorking Capital\nWorking capital as of September 30, 2025 was $3,347 million, an increase of $65 million compared to $3,282 million as of December 31, 2024. As of September 30, 2025 and December 31, 2024, the ratio of current assets to current liabilities was 2.8 and 2.9, respectively.\nDebt\nGrainger maintains a debt ratio and liquidity position that provides flexibility in funding working capital needs and long-term cash requirements. Grainger has various sources of financing available.\nTotal debt as a percent of total capitalization was 37.4% and 42.9% as of September 30, 2025 and December 31, 2024, respectively.\nGrainger receives ratings from two independent credit rating agencies: Moody's Investor Service (Moody's) and Standard & Poor's (S&P). Both credit rating agencies currently rate the Company's corporate credit at investment grade. \n30\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nThe following table summarizes the Company's credit ratings as of September 30, 2025:\nCorporate\nSenior Unsecured\nShort-term\nMoody's\nA2\nA2\nP1\nS&P\nA+\nA+\nA1\nCommitments and Other Contractual Obligations\nTh\nere were no material\n changes to the Company’s commitments and other contractual obligations from those disclosed in Part II, Item 7: Management’s Discussion and Analysis of Financial Condition and Results of Operations in the Company’s 2024 Form 10-K.\nCritical Accounting Estimates \nThe preparation of Grainger’s Condensed Consolidated Financial Statements and accompanying notes are in conformity with GAAP and the Company’s discussion and analysis of its financial condition and operating results require the Company’s management to make assumptions and estimates that affect the reported amounts. The Company considers an accounting policy to be a critical estimate if: (1) it involves assumptions that are uncertain when judgment was applied, and (2) changes in the estimate assumptions, or selection of a different estimate methodology, could have a significant impact on Grainger’s consolidated financial position and results. While the Company believes the assumptions and estimates used are reasonable, the Company’s \nmanagement bases its estimates on historical experience and on various other assumptions it believes to be reasonable under the circumstances.\nNote 1 of the Notes to Consolidated Financial Statements in Part II, Item 8: Financial Statements of the Company's 2024 Form 10-K describe the significant accounting policies and methods used in the preparation of the Company’s Condensed Consolidated Financial Statements. \nT\nhere were no material changes to the Company's critical accounting estimates from those disclosed in Part II, Item 7: Management's Disc\nussion and Analysis of Financial Condition and Results of Operations in the Company's 2024 Form 10-K.\n31\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nForward-Looking Statements\nFrom time to time in this Quarterly Report on Form 10-Q as well as in other written reports, communications and verbal statements, Grainger makes forward-looking statements that are not historical in nature but concern forecasts of future results, business plans, analyses, prospects, strategies, objectives and other matters that may be deemed to be “forward-looking statements” under the federal securities laws. Forward-looking statements can generally be identified by their use of terms such as “anticipate,” “estimate,” “believe,” “expect,” “could,” “forecast,” “may,” “intend,” “plan,” “predict,” “project,” “will,” or “would,” and similar terms and phrases, including references to assumptions.\nGrainger cannot guarantee that any forward-looking statement will be realized and achievement of future results is subject to risks and uncertainties, many of which are beyond Grainger's control, which could cause Grainger's results to differ materially from those that are presented. Important factors that could cause actual results to differ materially from those presented or implied in the forward-looking statements include, without limitation: inflation, higher product costs or other expenses, including operational and administrative expenses; a major loss of customers; loss or disruption of sources of supply; changes in customer or product mix; increased competitive pricing pressures; changes in third-party practices regarding digital advertising; failure to enter into or sustain contractual arrangements on a satisfactory basis with group purchasing organizations; failure to develop, manage or implement new technology initiatives or business strategies, including with respect to Grainger's eCommerce platforms and artificial intelligence; failure to adequately protect intellectual property or successfully defend against infringement claims; fluctuations or declines in Grainger's gross profit margin; Grainger's responses to market pressures; the outcome of pending and future litigation or governmental or regulatory proceedings, including with respect to wage and hour, anti-bribery and corruption, environmental, regulations related to advertising, marketing and the internet, consumer protection, pricing (including disaster or emergency declaration pricing statutes), product liability, compliance or safety, trade and export compliance, general commercial disputes, or privacy and cybersecurity matters; investigations, inquiries, audits and changes in laws and regulations; failure to comply with laws, regulations and standards, including new or stricter environmental laws or regulations; government contract matters; the impact of any government shutdown; disruption or breaches of information technology or data security systems involving Grainger or third parties on which Grainger depends; general industry, economic, market or political conditions; general global economic conditions including existing, new, or increased tariffs, trade issues and changes in trade policies, inflation, and interest rates; currency exchange rate fluctuations; market volatility, including price and trading volume volatility or price declines of Grainger's common stock; commodity price volatility; facilities disruptions or shutdowns; higher fuel costs or disruptions in transportation services; effects of outbreaks of pandemic disease or viral contagions, global conflicts, natural or human induced disasters, extreme weather, and other catastrophes or conditions; effects of climate change; failure to execute on our efforts and programs related to environmental, social and governance matters; competition for, or failure to attract, retain, train, motivate and develop executives and key team members; loss of key members of management or key team members; loss of operational flexibility and potential for work stoppages or slowdowns if team members unionize or join a collective bargaining arrangement; changes in effective tax rates; changes in credit ratings or outlook; Grainger's incurrence of indebtedness or failure to comply with restrictions and obligations under its debt agreements and instruments and other factors identified under Part I, Item 1A: Risk Factors and elsewhere in Grainger's latest Form 10-K, as updated from time to time in Grainger's Quarterly Form 10-Q.\nThe preceding list is not intended to be an exhaustive list of all of the factors that could impact Grainger's forward-looking statements. Given these risks and uncertainties, you are cautioned not to place undue reliance on Grainger's forward looking-statements and Grainger undertakes no obligation to update or revise any of its forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n32\nW.W. Grainger, Inc. and Subsidiaries"
}