{
  "source_file": "hal-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n Management's Discussion and Analysis of Financial Condition and Results of Operations\nManagement's Discussion and Analysis of Financial Condition and Results of Operations should be read in\n \nconjunction with the \ncondensed consolidated\n financial statements included in “Item 1. Financial Statements” contained herein.\nEXECUTIVE OVERVIEW\nOrganization\nWe are one of the world’s largest providers of products and services to the energy industry. We help our customers\n \nmaximize asset value throughout the lifecycle of the reservoir from locating hydrocarbons and managing geological data, to\n \ndrilling and formation evaluation, well construction and completion, and optimizing production throughout the life of the asset.\n \nActivity levels within our operations are significantly impacted by spending on upstream exploration, development, and\n \nproduction programs by major, national, and independent oil and natural gas companies. We report our results under two\n \nsegments, the Completion and Production segment and the Drilling and Evaluation segment.\n•\nCompletion and Production delivers cementing, stimulation, \nspecialty chemicals\n, intervention, pressure control,\n \nartificial lift, and completion products and services. The segment consists of Artificial Lift, Cementing, Completion\n \nTools, Multi-Chem, Pipeline and Process Services, Production Enhancement, and Production Solutions. During the\n \nthird quarter of 2024, we made a strategic decision to market for sale a portion of our chemical business.\n•\nDrilling and Evaluation provides field and reservoir modeling, drilling, fluids, evaluation, and precise wellbore\n \nplacement solutions that enable customers to model, measure, drill, and optimize their well construction activities.\n \nThe segment consists of Baroid, Drill Bits and Services, Halliburton Project Management, Landmark Software and\n \nServices, Sperry Drilling, Testing and Subsea, and Wireline and Perforating.\nThe business operations of our segments are organized around four primary geographic regions: North America, Latin\n \nAmerica, Europe/Africa/CIS, and Middle East/Asia. We have manufacturing operations in various locations, the most\n \nsignificant of which are in the United States, Malaysia, Singapore, and the United Kingdom. With \napproximately 47,000\n \nemployees\n,\n we operate in \nmore than 70\n countries around the world, and our corporate headquarters is in Houston, Texas.\nOur value proposition is to collaborate and engineer solutions to maximize asset value for our customers. We work to\n \nachieve strong cash flows and returns for our shareholders by delivering technology and services that improve efficiency,\n \nincrease recovery, and maximize production for our customers. Our strategic priorities are to:\n-\n \nInternational\n: Increase international growth in our directional drilling, unconventionals, well intervention, and\n \nartificial lift businesses.\n- \nNorth America\n: Maximize value by, among other things, increasing the utilization by our customers of our Zeus\n \nelectric fracturing platform and our iCruise rotary steerable systems, and incorporating automation technologies in\n \ncertain of our processes.\n- \nDigital\n: Continue to drive differentiation and efficiencies through the deployment of digital and automation\n \ntechnologies, both internally and for our customers.\n- \nCapital efficiency\n: Maintain our capital expenditures at approximately 6% of revenue while utilizing technology and\n \ntargeted process improvements to enhance the effectiveness and efficiency of our utilization of capital.\n- \nShareholder returns\n: Return over 50% of annual free cash flow to shareholders through dividends and share\n \nrepurchases.\n-\n Advance a Sustainable Energy Future\n: Continue to develop technologies and solutions to help lower our customers’\n \nand our emissions intensity, participate in carbon capture, utilization, and storage, and geothermal projects globally,\n \nand support Halliburton Labs early-stage company participants.\nHAL \nQ3 2025\n FORM \n10-Q\n | 17\nTable of Contents\nPart I. Item 2\n | Executive Overview\nThe following \ncharts\n depict the revenue split between our two operating segments and our four primary geographic\n \nregions for the \nthree months ended\n \nSeptember 30, 2025\n.\nMarket conditions\nOil prices declined further in the third quarter of 2025 compared to the second quarter of 2025, as ongoing supply\n \nadditions from OPEC+ and non-OPEC producers weighed on the markets. While geopolitical unrest in the Middle East and the\n \nRussia-Ukraine conflict remain persistent sources of volatility, the more pronounced influence this quarter came from weaker\n \nglobal economic activity and cautious consumer spending, which tempered expectation for near-term demand.\n In the United States, the active rig count declined modestly in the third quarter of 2025 compared to the second\n \nquarter of 2025, with activity in oil basins continuing to soften while gas basins remained relatively stable. However, despite\n \nthe rig count decline, United States total \nliquids\n production, as reported by the Energy Information Administration\n,\n reached an\n \nall-time high in the third quarter of 2025. Internationally, rig count increased modestly in the third quarter of 2025, as declines\n \nin Saudi Arabia were offset by rig additions elsewhere in the Middle East.\nSince the end of the third quarter of 2025, the macro environment for oil and natural gas has remained volatile. Trade\n \ntensions and tariffs continue to negatively impact the demand outlook, while the pace of supply growth has outstripped\n \nexpectations.\nWe continue to monitor and assess the impact of tariffs on goods being imported into the United States. Our global\n \nsupply chain organization continuously monitors market trends and works to mitigate those and other cost increases through\n \neconomies of scale in global procurement, technology modifications, and efficient sourcing practices. Globally, we continue to\n \nbe impacted by extended supply chain lead times for the supply of select raw materials. \nAlso, while we have been impacted by\n \ninflationary cost increases, we generally try to pass much of those increases on to our customers and we believe we have\n \neffective solutions to minimize their operational impact.\nHAL \nQ3 2025\n FORM \n10-Q\n | 18\nTable of Contents\nPart I. Item 2\n | Executive Overview\nFinancial \nresults\nThe following graph illustrates our revenue and operating margins for each operating segment for the \nthird\n quarter of\n \n2024\n and \n2025\n.\nDuring the \nthird\n quarter of \n2025\n, we generated total company revenue of \n$5.6 billion\n, a \n2%\n \ndecrease\n as compared to\n \nthe \nthird\n quarter of \n2024\n. \nWe reported operating income of\n \n$356 million\n, including impairments and other charges of \n$392\n \nmillion\n,\n \nin the \nthird\n quarter of \n2025\n, as\n compared\n to operating income of \n$871 million\n in the \nthird\n quarter of \n2024\n, including\n \nimpairments and other charges of \n$116 million\n. \nThe tariff impact on operating income for the \nthird\n quarter of 2025 was\n \napproximately $31 milli\non and resulted primarily from tariffs imposed by the United States.\nOur Completion and Production segment revenue \ndecreased\n \n2%\n in the \nthird\n quarter of \n2025\n as compared to the \nthird\n \nquarter of \n2024\n.\n \nThese results were largely \ndriven by lower pressure pumping services in North America and reduced\n \ncompletion tool sales in Latin America and the Middle East. Partially offsetting these decreases were increased stimulation\n \nactivity in Latin America and higher completion tool sales in Norway. Operating income was further adversely impacted by\n \nlower activity and reduced pricing for stimulation activity in US Land.\nOur Drilling and Evaluation segment revenue\n \nwas relatively flat\n in the \nthird\n quarter of \n2025\n as compared to the \nthird\n \nquarter of \n2024\n.\n D\necreased drilling-related services in Latin America and lower activity across multiple product service lines in\n \nSaudi Arabia were offset by increased drilling-related services in Europe. Operating income was further adversely impacted by\n \nactivity mix and mobilization costs in drilling-related services.\n \nOur North America revenue \nwas relatively flat\n in the \nthird\n quarter of \n2025\n as compared to the \nthird\n quarter of \n2024\n.\n \nLower pressure pumping services, decreased fluid services, and reduced artificial lift activity in US Land were offset by higher\n \ncompletion tool sales and increased fluid services in the Gulf of America and higher drilling activity in US Land.\nInternationally, revenue \ndecreased\n \n2%\n in the \nthird\n quarter of \n2025\n as compared to the \nthird\n quarter of \n2024\n,\n \nlargely\n \ndriven by \nlower activity across multiple product service lines in Mexico and Saudi Arabia. Partially offsetting these decreases\n \nwere higher activity across multiple product service lines in Norway, improved fluid services in the Middle East and Argentina,\n \nand higher pipeline services in \nMiddle East/Asia.\nOur operating performance and liquidity are described in more detail in “Liquidity and Capital Resources” and\n \n“Business Environment and Results of Operations.”\nSustainability and \nEnergy \nMix\n Transition\nIn 2021, we announced our target to achieve a 40% reduction in our Scope 1 and 2 emissions by 2035 from the 2018\n \nbaseline. \nWe\n continue\n to execute our priorities to drive down our emissions intensity.\n At the same time, we support our\n \ncustomers in their emissions reduction efforts by continuously developing and deploying goods and services that are accretive\n \nto their goals as well as ours. As the energy mix transition unfolds, we seek to apply our expertise and resources in growth\n \nsectors adjacent to our traditional oilfield services space, including carbon capture, utilization, and storage\n, \nand geothermal.\n \nFinally, we will continue to focus on accelerating the success of clean tech start-ups via Halliburton Labs, which also allows us\n \nto participate in the energy mix transition at relatively low risk by investing our expertise, resources, and team without a\n \nsignificant outlay of capital while we learn where we can strategically engage in new markets.\n As of \nSeptember 30, 2025\n,\n \nHalliburton Labs had 40\n \nparticipating companies and alumni.\nHAL \nQ3 2025\n FORM \n10-Q\n | 19\nTable of Contents\nPart I. Item 2\n | Liquidity and Capital Resources\nL\nIQUIDITY AND CAPITAL RESOURCES\nAs of \nSeptember 30, 2025\n, we had \n$2.0 billion\n of cash and equivalents, compared to \n$2.6 billion\n of cash and\n \nequivalents at \nDecember 31, 2024\n.\nSignificant sources and uses of cash \nduring the first nine months of \n2025\n \nSources of cash:\n•\nCash flows from operating activities were \n$1.8 billion\n. Working capital, which consists of receivables, inventories,\n \nand accounts payable, had \na negative\n impact of \n$111 million\n.\n•\nWe received \n$120 million\n on the sale of an equity investment.\n•\nWe received \n$228 million\n on the sale of investment securities.\nUses of cash:\n•\nCapital \nexpenditures\n were \n$917 million\n.\n•\nWe repurchased \n32.9 million\n shares of our common stock for \n$757 million\n, which includes excise tax payment due\n \non 2024 share repurchases\n.\n•\nWe paid \n$436 million\n of dividends to our shareholders.\n•\nWe paid \n$343 million\n related to a purchase of an equity investment.\n•\nWe paid \n$175 million\n to acquire businesses.\n•\nWe paid \n$128 million\n on the purchase of investment securities.\nFuture sources and uses of cash\nWe manufacture most of our own equipment, which provides us with some flexibility to increase or decrease our \ncapital expenditures based on market conditions. We currently expect capital spending for \n2025\n to \nbe approximately\n 6%\n of \nrevenue. \nHowever, we intend to reduce our capital expenditures in 2026 by 30%, to approximately $1.0 billion, in response to \nthe market conditions we expect to encounter. Despite this reduction, we believe this level of spending will enable continued \ninvestment in our core strategic technologies and businesses, including the international expansion of \nour artificial lif\nt, well \nintervention, unconventionals, and drilling technologies.\nWhile we maintain focus on liquidity and debt reduction, we are also focused on providing cash returns to our\n \nshareholders. Our quarterly dividend rate is \n$0.17\n per common share\n, or approximately \n$144 million\n. In 2023, our Board\n \napproved a capital return framework with a goal of \nreturning at least 50% of our annual free cash flow to shareholders through\n \ndividends and share repurchases and we expect our returns to shareholders will be in line with our capital return framework for\n \n2025\n.\nWe\n may utilize share repurchases as part of our capital return framework. Our Board of Directors has authorized a\n \nprogram to repurchase our common stock from time to time. \nWe repurchased \n11.3 million\n shares of common stock during the\n \nthird quarter of\n \n2025\n under this program. Approximately \n$2.3 billion\n remained authorized for repurchases as of \nSeptember 30,\n \n2025\n and may be used for open market and other share purchases.\nDuring 2023, we began our migration to SAP S4 which we expect to complete in the\n fourth quarter of \n2026\n. \nDuring\n \nthe \nnine months ended\n \nSeptember 30, 2025\n, w\ne incurred \n$112 million\n in expense on our SAP S4 migration\n. \nDue to the\n \nextension of the project, we currently expect the estimated total cost will be approximately $40 million per quarter going\n \nforward. We believe the new system will provide important efficiency benefits, cost savings, enhanced visibility to our\n \noperations, and advanced analytics that will benefit us and our customers.\nOther factors affecting \nliquidity\nFinancial\n condition in current market.\n As of \nSeptember 30, 2025\n, we had \n$2.0 billion\n of cash and equivalents and \n$3.5\n \nbillion\n of available committed bank \ncredit under a new revolving credit facility\n executed on August 18, 2025, with an\n \nexpiration date of August 16, 2030. \nWe believe we have a manageable debt maturity profile, with approximately \n$472 million\n \nc\noming due beginning in 2025\n through 2027, \nwith the majority due in 2025\n.\n \nFurthermore, \nwe have no financial covenants or\n \nmaterial adverse change \nprovisions\n in our bank agreements\n, \nand our debt maturities extend over a long period of time. We\n \nbelieve our cash on hand, cash flows generated from operations, and our available credit facility will provide sufficient liquidity\n \nto address the challenges and opportunities of the current market and our expected global cash needs, including capital\n \nexpenditures, working capital investments, shareholder returns, if any, debt repurchases, if any, and scheduled interest and\n \nprincipal payments.\nHAL \nQ3 2025\n FORM \n10-Q\n | 20\nTable of Contents\nPart I. Item 2\n | Liquidity and Capital Resources\nGuarantee agreements\n.\n In the normal course of business, we have agreements with financial institutions under which\n \napproximately\n \n$2.9 billion\n \nof letters of credit, bank guarantees, or surety bonds were outstanding as of \nSeptember 30, 2025\n.\n \nSome of the outstanding letters of credit have triggering events that would entitle a bank to require cash collateralization;\n \nhowever, none of these triggering events have occurred. As of \nSeptember 30, 2025\n, we had no material off-balance sheet\n \nliabilities and were not required to make any material cash distributions to our unconsolidated subsidiaries.\nWe have entered into CDSs with third-party financial institutions that have an aggregate notional amount \noutstanding\n \nas of \nSeptember 30, 2025\n of \n$750 million\n, compared to an aggregate notional amount outstanding as of \nDecember 31, 2024\n of\n \n$739 million\n,\n \nrelated to borrowings provided by the financial institutions to one of our primary customers in Mexico, of which,\n \nportions of the proceeds were utilized by this customer to pay certain of our outstanding receivables. \nApproximately\n \n$550\n \nmillion\n of the outstanding amount of the CDSs reduces monthly over its remaining \n12\n-\nmonth term and \n$107 million\n reduces\n \nmonthly over its remaining \n9\n-month term\n. \nThe remaining \n$93 million\n \noutstanding amount reduces monthly over its remaining\n \n5\n-\nmonth term\n.\nCredit ratings\n.\n Our credit ratings with Standard & Poor’s \nremain BBB+ for our long-term debt and A-2 f\nor our short-\nterm debt, with a stable outlook. Our credit ratings with Moody's Investors Service remain A3 for our long\n-term debt and P-2\n \nfor our short-term debt, with a stable outlook.\nCustomer receivables\n.\n In line with industry practice, we bill our customers for our services in arrears and are,\n \ntherefore, subject to our customers delaying or failing to pay our invoices. In weak economic environments, we may experience\n \nincreased delays and failures to pay our invoices due to, among other reasons, a reduction in our customers’ cash flow from\n \noperations and their access to the credit markets, as well as unsettled political conditions.\nReceivables from our primary customer in Mexico accounted for approximately\n \n11%\n \nof our total receivables as of\n \nSeptember 30, 2025\n. \nWhile we have experienced payment delays from our primary customer in Mexico, the amounts are not in\n \ndispute and we have not historically had, and we do not expect any material write-offs due to collectability of receivables from\n \nthis customer.\nHAL \nQ3 2025\n FORM \n10-Q\n | 21\nTable of Contents\nPart I. Item 2\n | Business Environment and Results of Operations\nBUSINESS ENVIRONMENT AND RESULTS OF OPERATIONS\nWe operate in \nmore than 70\n countries\n throughout the world to provide a comprehensive range of services and products\n \nto the energy industry. Our revenue is generated from the sale of services and products to major, national, and independent oil\n \nand natural gas companies worldwide. The industry we serve is highly competitive with many substantial competitors in each\n \nsegment of our business. During the first \nnine\n months of \n2025\n, based on the location of the services provided and products sold,\n \n39%\n of our consolidated revenue was from the United States, compared to \n41%\n of our consolidated revenue from the United\n \nStates in the first \nnine\n months of \n2024\n. \nNo other country accounted for more than 10% of our revenue\n for those periods.\nActivity within our business segments is significantly impacted by spending on upstream exploration, development, and\n \nproduction programs by our customers. Also impacting our activity is the status of the global economy, which impacts oil and\n \nnatural gas consumption.\nSome of the more significant determinants of current and future spending levels of our customers are oil and natural\n \ngas prices, our customers’ expectations about future prices, global oil supply and demand, the impact on natural gas supply and\n \ndemand in North America of electrification and data centers power requirements, completions intensity, the world economy, the\n \navailability of capital, government regulation, and global stability, which together drive worldwide drilling and completions\n \nactivity. We expect that many of our customers in North America will continue their strategy of operating within their cash\n \nflows and generating returns rather than prioritizing production growth. Lower oil and natural gas prices usually translate into\n \nlower exploration and production budgets and lower rig count, while the opposite is usually true for higher oil and natural gas\n \nprices. Our financial performance is therefore significantly affected by oil and natural gas prices and worldwide rig activity,\n \nwhich are summarized in the tables below.\nThe table below shows the average prices for West Texas Intermediate (\nW\nTI) crude oi\nl, United K\ningdom Brent crude\n \noil, and Henry Hub natural gas.\nThree Months Ended\nYear Ended\nSeptember 30,\nDecember 31,\n2025\n2024\n2024\nOil Price - WTI \n(1)\n$\n65.74\n$\n76.24\n$\n76.55\nOil Price - Brent \n(1)\n68.97\n79.84\n80.53\nNatural Gas Price - Henry Hub \n(2)\n3.03\n2.11\n2.19\n(1)\nOil prices measured in dollars per barrel.\n(2)\nNatural gas price measured in dollars per million British thermal units (Btu), or MMBtu.\nThe historical average rig counts based on the weekly Baker Hughes rig count data w\nere as follows:\n  \nThree Months Ended\nNine Months Ended\nYear Ended\nSeptember 30,\nSeptember 30,\nDecember 31,\n2025\n2024\n2025\n2024\n2024\nUS Land\n526\n566\n552\n584\n580\nUS Offshore\n14\n20\n14\n20\n19\nCanada\n178\n210\n174\n184\n187\nNorth America\n718\n796\n740\n788\n786\nInternational \n(1)\n1,080\n1,150\n1,086\n1,171\n1,162\nWorldwide Total\n1,798\n1,946\n1,826\n1,959\n1,948\n(1)\nHistorical average rig counts shown are based on data provided by Baker Hughes, which included retroactive \nchanges to international rig counts previously reported.\nHAL \nQ3 2025\n FORM \n10-Q\n | 22\nTable of Contents\nPart I. Item 2\n | Business Environment and Results of Operations\nBusiness \noutlook \nGeopolitical tensions in the Middle East and the Russia-Ukraine conflict continue to cause high volatility in oil\n \nmarkets. Additionally, the unwinding of OPEC+ supply cuts and tempered demand growth expectations due to trade tensions\n \ncontributed to decreases in the average WTI and United Kingdom Brent crude oil prices.\n \nAs of October 21, 2025, WTI crude oil\n \nprices had decreased by approximately 12% since the end of the second quarter of 2025. \nIn response to these factors, we have\n \nseen customers reduce their expected spend on oil and gas exploration and production activities and engage in other cost-cutting\n \nactivities, which has caused us to lower our expectations of activity over the short to medium term.\nWe expect our full year 2025 international revenue to decrease year over year primarily driven by further activity\n \nreductions in Saudi Arabia and Mexico. We continue to expect revenue growth in Brazil and Norway, as well as offshore\n \nfrontier basins, to partially offset these reductions. We also expect North America full year 2025 revenue to decline year over\n \nyear driven by lower drilling and completion activity and pricing pressure. While increases in gas activity are likely to absorb\n \nsome service capacity in North America this year, it is unlikely to offset the decreases in oil-directed activity. To address the\n \nsoftness in the market, in the third quarter of 2025, we reduced our variable and fixed cash costs to size our business\n \naccordingly, which we expect will save us approximately $100 million per quarter going forward. Furthermore, we will\n \ncontinue to idle, relocate, or retire equipment that does not meet our return thresholds and will remain focused on generating\n \nfree cash flow and returns, and capital discipline.\nDespite the softening market described above, we believe the combination of long-cycle international investment and\n \nemerging structural demand for natural gas driven by data centers, electrification, and power reliability, positions our business\n \nfor durable growth over the medium and long term. Additionally, we believe increased investment in existing and new sources\n \nof oil and natural gas production is needed to address future demand. This will necessitate production from conventional and\n \nunconventional, deep-water and shallow-water, and short and long-cycle projects. We expect that increased oil and natural gas\n \nproduction requirements will in turn create demand for our products and services.\nHAL \nQ3 2025\n FORM \n10-Q\n | 23\nTable of Contents\nPart I. Item 2\n | Results of Operations in \n2025\n compared to \n2024\n (QTD)\nRESULTS OF OPERATIONS IN \n2025\n COMPARED TO \n2024\nThree Months Ended\n \nSeptember 30, 2025\n Compared with \nThree Months Ended\n \nSeptember 30, 2024\nThree Months Ended\nSeptember 30,\nFavorable\nPercentage\nMillions of dollars\n2025\n2024\n(Unfavorable)\nChange\nRevenue:\nBy operating segment:\nCompletion and Production\n$\n3,223\n$\n3,299\n$\n(76)\n(2)\n%\nDrilling and Evaluation\n2,377\n2,398\n(21)\n(1)\nTotal revenue\n$\n5,600\n$\n5,697\n$\n(97)\n(2)\n%\nBy geographic region:\nNorth America\n$\n2,364\n$\n2,386\n$\n(22)\n(1)\n%\nLatin America\n996\n1,053\n(57)\n(5)\nEurope/Africa/CIS\n828\n722\n106\n15\nMiddle East/Asia\n1,412\n1,536\n(124)\n(8)\nTotal revenue\n$\n5,600\n$\n5,697\n$\n(97)\n(2)\n%\nOperating income:\nBy operating segment:\nCompletion and Production\n$\n514\n$\n669\n$\n(155)\n(23)\n%\nDrilling and Evaluation\n348\n406\n(58)\n(14)\nTotal operations\n862\n1,075\n(213)\n(20)\nCorporate and other\n(64)\n(60)\n(4)\n(7)\nSAP S4 upgrade expense\n(50)\n(28)\n(22)\n(79)\nImpairments and other charges\n(392)\n(116)\n(276)\nn/m\nTotal operating income\n$\n356\n$\n871\n$\n(515)\n(59)\n%\nn/m = not meaningful\nOperating Segments\nCompletion and Production\nCompletion and Production revenue in the \nthird\n quarter of \n2025\n was \n$3.2 billion\n, \na decrease\n of \n$76 million\n, or \n2%\n,\n \nwhen compared to the \nthird\n quarter of \n2024\n. Operating income in the \nthird\n quarter of \n2025\n was \n$514 million\n, \na decrease\n of \n$155\n \nmillion\n, or \n23%\n, when compared to the \nthird\n quarter of \n2024\n. \nThese results were largely \ndriven by lower pressure pumping\n \nservices in North America and reduced completion tool sales in Latin America and the Middle East. Partially offsetting these\n \ndecreases were\n increased stimulation activity in Latin America and higher completion tool sales\n in Norway. Operating income\n \nwas further adversely\n \nimpacted by lower activity and \nreduced\n \npricing \nfor stimulation activity in US Land.\nDrilling and Evaluation\nDrilling and Evaluation revenue in the \nthird\n quarter of \n2025\n was \n$2.4 billion\n, \na decrease\n of \n$21 million\n, or \nrelatively\n \nflat\n, when compared to the \nthird\n quarter of \n2024\n. Operating income in the \nthird\n quarter of \n2025\n was \n$348 million\n, \na decrease\n of\n \n$58 million\n, or \n14%\n, when compared to the \nthird\n quarter of \n2024\n. D\necreased\n drilling-related\n services in Latin America and\n \nlower activity across multiple product service lines in Saudi Arabia were offset by increased drilling-related services in Europe.\n \nOperating income was further\n adversely \nimpacted\n by activity mix and mobilization costs in drilling-related services.\n \nGeographic Regions\nNorth America\nNorth America revenue in the \nthird\n quarter of \n2025\n was \n$2.4 billion\n, \nrelatively flat\n,\n as \ncompared to the \nthird\n quarter of\n \n2024\n. \nLower pressure pumping services, decreased fluid services, and reduced artificial lift activity in US Land were offset by\n \nhigher completion tool sales and increased fluid services in the Gulf of America and higher drilling activity in US Land.\nHAL \nQ3 2025\n FORM \n10-Q\n | 24\nTable of Contents\nPart I. Item 2\n | Results of Operations in \n2025\n Compared to \n2024\n \n(QTD)\nLatin America\nLatin America revenue in the \nthird\n quarter of \n2025\n was \n$996 million\n,\n a \n5%\n \ndecrease\n compared to the \nthird\n quarter of\n \n2024\n. This decrease was largely due to decreased activity across multiple product service lines in Mexico and lower completion\n \ntool sales in Brazil. Partially offsetting these decreases \nwere\n higher stimulation\n and improved drilling-related services in\n \nArgentina and \nincreased activity across multiple \nproduct service lines in Brazil.\nEurope/Africa/CIS\nEurope/Africa/CIS revenue in the \nthird\n quarter of \n2025\n was \n$828 million\n, a \n15%\n \nincrease\n compared to the \nthird\n quarter\n \nof \n2024\n. \nThis increase was primarily driven by higher completion tool sales and improved \ndrilling-related services\n in the North\n \nSea along with increased well construction activity in Namibia. Partially offsetting these increases \nwas lower activity across\n \nmultiple product service lines in Senegal and Italy.\nMiddle East/Asia\nMiddle East/Asia revenue in the \nthird\n quarter of \n2025\n was \n$1.4 billion\n, an \n8%\n \ndecrease\n compared to the \nthird\n quarter\n \nof \n2024\n. This decrease was largely due to decreased activity across multiple product service lines in Saudi Arabia and Malaysia.\n \nPartially offsetting these decreases were increased stimulation activity \nin Asia, improved fluid services in Saudi Arabia\n and\n \nhigher a\nrtificial lift activity in Kuwait.\nOther Operating Items\nSAP S4 Upgrade Expense. \nAs previously mentioned, during 2023, we began our migration to SAP S4, which we\n \nexpect to complete in \nthe fourth quarter\n of 2026\n. During the \nthird\n quarter of \n2025\n, we recognized\n \n$50 million\n of expense on our\n \nSAP S4 migration. During the \nthird\n quarter of \n2024\n, we recognized \n$28 million\n of expense on our SAP S4 migration.\nImpairments\n and Other Charges\n.\n \nDuring the \nthree months ended\n \nSeptember 30, 2025\n, there were pre-tax charges of\n \n$392 million\n recorded in impairments and other charges due to severance costs, fixed and other assets write-offs, an impairment\n \nof assets held for sale, a reserve release related to a cybersecurity incident, a gain on an equity investment and other items.\n \nDuring the \nthree months ended\n \nSeptember 30,\n \n2024\n,\n we took a pre-tax charge of \n$116 million\n primarily related to severance\n \ncosts, an impairment of assets held for sale, expenses related to a cybersecurity incident, a gain on a fair value adjustment of an\n \nequity investment, and other items. See Notes to \nCondensed Consolidated\n Financial Statements, Note \n2\n. Impairments and Other\n \nCharges \nfor further discussion of these charges.\nNonoperating Items\nArgentina Impairment on Investment. \nIn years 2022, 2023 and 2024\n, w\ne executed a series of loans to a third party and\n \nreceived notes that are to be repaid in U.S. dollars upon maturity or earlier if certain conditions are met. During the \nthree\n \nmonths ended\n \nSeptember 30, 2025\n, we recorded a loss of $23 million resulting from the deterioration in the outlook of the\n \ndebtor’s liquidity and financial projections. This is included in “Other, net” on the consolidated statements of operations.\nIncome Tax Provision\n.\n \nDuring the \nthree months ended\n \nSeptember 30, 2025\n, we recorded a total income tax provision\n \nof \n$199 million\n on a pre-tax income of \n$219 million\n, resulting in an effective tax rate of \n90.9%\n \nfo\nr t\nhe quarte\nr. The effective tax\n \nrate for the quarter was primarily impacted by the additional $125 million valuation allowance recorded against our deferred tax\n \nassets, which resulted from the impact on the realizability of our FTC carryforward due to the “One Big Beautiful Bill Act”,\n the\n \npre-tax \n$392 million\n of impairments and other charges, and the $23 million impairment of an investment in Argentina.\n During\n \nthe \nthree months ended\n \nSeptember 30, 2024\n, we recorded a total income tax provision of \n$154 million\n on a pre-tax income of\n \n$734 million\n, resulting in an effective tax rate of \n21.0%\n for the quarter. We recorded a tax benefit of $41 million during the\n \nthree months ended \nSeptember 30, 2024\n, due to a partial release of a valuation allowance on our deferred tax assets based on\n \nmarket conditions.\nPillar \nTwo\n.\n \nThe Organization for Economic Co-operation and Development enacted model rules for a new global\n \nminimum tax framework, also known as Pillar Two, and certain governments globally have enacted, or are in the process of\n \nenacting, legislation considering these model rules. These rules did not have a material impact on our taxes for the \nthree months\n \nended\n \nSeptember 30, 2025\n and \n2024\n.\nHAL \nQ3 2025\n FORM \n10-Q\n | 25\nTable of Contents\nPart I. Item 2\n | Results of Operations in \n2025\n Compared to \n2024\n \n(QTD)\nInternal Revenue Service Notice of Proposed \nAdjustment\n.\n \nWe are subject to taxes in the United States and in numerous\n \njurisdictions where we operate or where our subsidiaries are organized. Our tax returns are routinely subject to examination by\n \nthe taxing authorities in the jurisdictions where we file tax returns. In most cases we are no longer subject to examination by tax\n \nauthorities for years \nbefore 2013\n. The only significant operating jurisdiction that has tax filings under review or subject to\n \nexamination by the tax authorities is the United States. Our United States federal income tax filings for tax years 2016 through\n \n2023, \nincluding carry back of 2016 net operating losses to 2014\n, are currently under review or remain open for review by the\n \nIRS.\nOn September 28, 2023, we received a NOPA from the IRS covering our 2016 U.S. tax return. The NOPA proposed\n \nan adjustment to reclassify approximately 95% of the $3.5 billion termination fee paid to Baker Hughes in 2016 from an\n \nordinary expense deduction to a capital loss. The termination fee was paid to Baker Hughes under the merger agreement after\n \nantitrust regulators in multiple jurisdictions failed to approve our proposed merger. It is common commercial practice to include\n \na termination fee in a merger agreement to compensate the target for damages incurred when the acquisition does not go\n \nforward. The IRS’s long-understood position at the time of the payment had been to treat such payments as an ordinary and\n \nnecessary business expense. We strongly disagree with the proposed adjustment on both a factual and legal basis, and we plan\n \nto vigorously contest it.\n \nWe expect that resolving this dispute will take substantial time. In 2023, we initiated the IRS administrative appeals\n \nprocess, which is ongoing. Failing a resolution through that process, the matter would ultimately be resolved by the United\n \nStates federal courts.\nWe regularly assess the likelihood of adverse outcomes resulting from tax examinations to determine the adequacy of\n \nour tax reserves, and we believe our income tax reserves are appropriately provided for all open tax years. We cannot assure\n \nyou that the matter will be determined in our favor or against us, and if the matter is ultimately determined unfavorably to us, it\n \ncould have a material adverse impact on our results of operations and cash flows. Based on tax attributes currently available, we\n \nestimate that, should the IRS's position prevail through its appellate process and subsequent litigation, the proposed adjustment\n \ncould result in cash taxes due of approximately\n \n$640 m\nillion\n \n(plus interest thereon in the case of amounts due for previous tax\n \nyears). Our estimates are calculated under current tax law and on the bases of our assumptions regarding taxable income and\n \nloss and other tax attributes over the relevant period, which law could change and which assumptions could and likely will\n \ndiffer materially from actual results. In any event, no payment of any additional tax is currently required, nor do we anticipate\n \nthat the proposed adjustment would materially and adversely impact our ability to meet our expected uses of cash, including\n \nfuture capital expenditures, working capital investments, and scheduled debt repayments, or our ability to return cash to\n \nshareholders, even if a final determination of the matter is reached that is adverse to us.\nHAL \nQ3 2025\n FORM \n10-Q\n | 26\nTable of Contents\nPart I. Item 2\n | Results of Operations in \n2025\n Compared to \n2024\n \n(YTD)\nNine Months Ended\n \nSeptember 30, 2025\n Compared with \nNine Months Ended\n \nSeptember 30, 2024\nNine Months Ended\nSeptember 30,\nFavorable\nPercentage\nMillions of dollars\n2025\n2024\n(Unfavorable)\nChange\nRevenue:\nBy operating segment:\nCompletion and Production\n$\n9,514\n$\n10,073\n$\n(559)\n(6)\n%\nDrilling and Evaluation\n7,013\n7,261\n(248)\n(3)\nTotal revenue\n$\n16,527\n$\n17,334\n$\n(807)\n(5)\n%\nBy geographic region:\nNorth America\n$\n6,859\n$\n7,413\n$\n(554)\n(7)\n%\nLatin America\n2,869\n3,258\n(389)\n(12)\nEurope/Africa/CIS\n2,423\n2,208\n215\n10\nMiddle East/Asia\n4,376\n4,455\n(79)\n(2)\nTotal revenue\n$\n16,527\n$\n17,334\n$\n(807)\n(5)\n%\nOperating income:\nBy operating segment:\nCompletion and Production\n$\n1,558\n$\n2,080\n$\n(522)\n(25)\n%\nDrilling and Evaluation\n1,012\n1,207\n(195)\n(16)\nTotal operations\n2,570\n3,287\n(717)\n(22)\nCorporate and other\n(196)\n(190)\n(6)\n(3)\nSAP S4 upgrade expense\n(112)\n(91)\n(21)\n(23)\nImpairments and other charges\n(748)\n(116)\n(632)\nn/m\nTotal operating income\n$\n1,514\n$\n2,890\n$\n(1,376)\n(48)\n%\nn/m = not meaningful\nOperating Segments\nCompletion and Production \nCompletion and Production revenue in \nthe first nine months of 2025\n was \n$9.5 billion\n, \na decrease\n of \n$559 million\n, or\n \n6%\n, compared to \nthe first nine months of 2024\n. Operating income for the segment in \nthe first nine months of 2025\n was \n$1.6\n \nbillion\n, \na decrease\n of \n$522 million\n, or \n25%\n, compared to \nthe first nine months of 2024\n. These results were largely driven by\n \nd\necreased pressure pumping services in the Western Hemisphere and lower completion tool sales in the Western Hemisphere\n \nand Africa. Partially offsetting these declines were increased completion tool sales in Europe and Canada.\nDrilling and Evaluation\nDrilling and Evaluation revenue in \nthe first nine months of 2025\n was \n$7.0 billion\n, \na decrease\n of \n$248 million\n, or \n3%\n,\n \ncompared to \nthe first nine months of 2024\n. Operating income for the segment in \nthe first nine months of 2025\n was \n$1.0 billion\n,\n \na decrease\n of \n$195 million\n, or \n16%\n, compared to \nthe first nine months of 2024\n. These results were primarily driven by\n \ndecreased activity across multiple product service lines in Mexico and \nSaudi Arabia, as well as\n decreased testing services and\n \nlower wireline activity internationally. Partially offsetting these decreases were improved drilling services in Europe, and higher\n \nfluid services in Latin America and the Middle East.\nGeographic Regions\nNorth America\nNorth America revenue in \nthe first nine months of 2025\n was \n$6.9 billion\n, a \n7%\n \ndecrease\n compared to \nthe first nine\n \nmonths of 2024\n, largely driven by decreased pressure pumping services in US Land and lower completion tool sales in the Gulf\n \nof America and US Land. Partially offsetting these decreases were improved stimulation activity in the Gulf of America and\n \nhigher completion tool sales in Canada.\nHAL \nQ3 2025\n FORM \n10-Q\n | 27\nTable of Contents\nPart I. Item 2\n | Results of Operations in \n2025\n Compared to \n2024\n \n(YTD)\nLatin America\nLatin America revenue in \nthe first nine months of 2025\n was \n$2.9 billion\n, a \n12%\n \ndecrease\n compared to \nthe first nine\n \nmonths of 2024\n, \nresulting from lower activity across multiple product service lines in Mexico and decreased completion tool\n \nsales across the region. Partially offsetting these decreases were higher drilling-related services in Argentina, Brazil and\n \nCaribbean.\nEurope/Af\nrica/CIS\nEurope/Africa/CIS revenue in \nthe first nine months of 2025\n was \n$2.4 billion\n, a \n10%\n \nincrease\n compared to \nthe first nine\n \nmonths of 2024\n, resulting from improved activity across multiple product service lines in Norway and Romania, higher well\n \nconstruction activity in Namibia and improved completion tool sales in the Caspian Area. Partially offsetting these increases\n \nwere decreased activity across multiple product service lines in Senegal and Italy, and lower completion tool sales and\n \ndecreased pressure pumping services in Angola.\nMiddle East/Asia\nMiddle East/Asia revenue in \nthe first nine months of 2025\n was \n$4.4 billion\n, a \n2%\n \ndecrease\n compared to \nthe first nine\n \nmonths of 2024\n, resulting primarily from decreased activities across multiple product service lines in Saudi Arabia and\n \nMalaysia and lower project management activity and decreased testing services in the region. Partially offsetting these\n \ndecreases were increased activity across multiple product service lines in Kuwait, improved fluid services in the United Arab\n \nEmirates and higher pressure pumping services in India.\nOther Operating Items\nSAP S4 Upgrade Expense.\n As previously mentioned, during 2023 we began our migration to SAP S4, which we expect\n \nto complete in the fourth quarter\n of 2026\n. During the \nnine months ended\n \nSeptember 30, 2025\n, we recognized \n$112 million\n of\n \nexpense on our SAP S4 migration. During the \nnine months ended\n \nSeptember 30, 2024\n, we recognized \n$91 million\n of expense\n \non our SAP S4 migration.\nImpairments\n and Other Charges\n. \nDuring the \nnine months ended\n \nSeptember 30, 2025\n, we recognized a pre-tax charge\n \nof \n$748 million\n \nprimarily related to severance costs, fixed and other assets write-offs, an impairment of assets held for sale, an\n \nimpairment of facility closures and lease terminations, a reserve release related to a cybersecurity incident, a gain on an equity\n \ninvestment and \nother items, primarily related to legacy environmental remediation cost estimate increases\n. During the \nnine\n \nmonths ended\n \nSeptember 30, 2024\n, we recognized a pre-tax charge of \n$116 million\n, primarily related to severance costs, an\n \nimpairment of assets held for sale, expenses related to a cybersecurity incident, a gain on a fair value adjustment of an equity\n \ninvestment, and other items. See Notes to \nCondensed Consolidated\n Financial Statements, Note \n2\n. Impairments and Other\n \nCharges\n for further discussion of these charges.\nNonoperating Items\nArgentina Impairment on Investment. \nIn years 2022, 2023 and 2024\n, we executed a series of loans to a third party and\n \nreceived notes that are to be repaid in U.S. dollars upon maturity or earlier if certain conditions are met. \nDuring the \nnine months\n \nended\n \nSeptember 30, 2025\n and \n2024\n, we recorded a loss of $23 million and $38 million, respectively,\n resulting from the\n \ndeterioration in the outlook of the debtor’s liquidity and financial projections.\n This is included in “Other, net” on the\n \nconsolidated statements of operations.\nEgypt Currency Impact. \nIn the first quarter of \n2024\n, the Egyptian pound devalued by approximately 35% relative to\n \nthe U.S. dollar. Consequently, we incurred a l\noss of \n$38 million\n during\n the \nnine months ended\n \nSeptember 30, 2024\n, due to the\n \ndevaluation of the currency in Egypt. This is included in “Other, net” on the consolidated statements of operations.\nIncome Tax Provision\n. During the \nnine months ended\n \nSeptember 30, 2025\n, we recorded a total income tax provision of\n \n$433 million\n on a pre-tax income of \n$1.1 billion\n, resulting in an effective tax rate of \n38.1%\n. \nThe effective tax rate for this\n \nperiod was primarily impacted by the additional valuation allowance recognized in the amount of $125 million on our deferred\n \ntax assets, which resulted from the impact on the realizability of our FTC carryforward due to the \n“One Big Beautiful Bill Act”\n,\n \nthe pre-tax \n$748 million\n of impairments and other charges, and the \n$23\n million impairment of an investment in Argentina.\n \nDuring the \nnine months ended\n \nSeptember 30, 2024\n, we recorded a total income tax provision of \n$539 million\n on pre-tax income\n \nof \n$2.4 billion\n, resulting in an effective tax rate of \n22.1%\n. We recorded a tax benefit of $41 million during the \nnine months\n \nended\n \nSeptember 30, 2024\n, due to a partial release of a valuation allowance on our deferred tax assets based on market\n \nconditions.\nPillar Two\n.\n \nAs previously mentioned, The Organization for Economic Co-operation and Development enacted model\n \nrules for a new global minimum tax framework, also known as Pillar Two, and certain governments globally have enacted, or\n \nare in the process of enacting, legislation considering these model rules. These rules did not have a material impact on our taxes\n \nfor the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n.\nHAL \nQ3 2025\n FORM \n10-Q\n | 28\nTable of Contents\nPart I. Item 2\n | Forward-Looking Information\nFORWARD-LOOKING INFORMATION\nThe Private Securities Litigation Reform Act of 1995 provides safe harbor provisions for forward-looking information.\n \nForward-looking information is based on projections and estimates, not historical information. Some statements in this Form\n \n10-Q\n are forward-looking and use words like “may,” “may not,” “believe,” “do not believe,” “plan,” “estimate,” “intend,”\n \n“expect,” “do not expect,” “anticipate,” “do not anticipate,” “should,” “likely,” and other expressions. We may also provide oral\n \nor written forward-looking information in our statements and other materials we release to the public. Forward-looking\n \ninformation involves risks and uncertainties and reflects our best judgment based on current information. Our results of\n \noperations can be affected by inaccurate assumptions we make or by known or unknown risks and uncertainties. In addition,\n \nother factors may affect the accuracy of our forward-looking information. As a result, no forward-looking information can be\n \nguaranteed. Actual events and the results of our operations may vary materially.\nWe do not assume any responsibility to publicly update any of our forward-looking statements regardless of whether\n \nfactors change as a result of new information, future events, or for any other reason. You should review any additional\n \ndisclosures we make in our press releases and Forms 10-K, 10-Q, and 8-K filed with or furnished to the Securities and\n \nExchange Commission. We also suggest that you listen to our quarterly earnings release conference calls with financial\n \nanalysts."
}