{
  "item1": "global marketing function establishes brand direction messaging assists selling entities establishing local marketing programs. global marketing group works global development function deliver unified, brand-specific consumer experiences. addition global marketing function, local selling entities employ sales marketing functions responsible local market activities execution. products sold globally broad spectrum customers, including mass-market retailers, distributors, wholesalers, discount stores, specialty hobby stores, drug stores, mail order houses, catalog stores, department stores other traditional retailers, large small, well ecommerce retailers direct-to-customer through fan-focused Hasbro Direct business.",
  "item7": "Income tax expense totaled $102.6 million pre-tax income $497.0 million during 2024 compared income tax benefit $221.3 million pre-tax loss $1,709.1 million during 2023. During 2024, Company incurred $37.4 million unfavorable adjustment 2023 Loss sale Film & TV reporting unit no corresponding tax benefit. Absent unfavorable adjustment loss sale no corresponding tax benefit, Company recorded net discrete tax benefit $13.1 million, primarily associated benefit release uncertain tax positions certain statute limitation expirations, favorable return provision adjustments. Fiscal year 2023 includes discrete items related impairment goodwill Family Brands reporting unit $960.0 million no tax benefit impairment goodwill Film TV reporting unit $231.2 million no tax benefit.",
  "item2": "46.5% segment net revenues first nine months 2025, compared operating profit $551.1 million, 47.0% segment net revenues, first nine months 2024. operating profit increase during first nine months 2025 primarily driven increased net revenues, discussed above, while operating margin percentage segment net revenue decreased slightly result increased royalty expense, driven success MAGIC: GATHERING Universes Beyond sets such , which Company obligated pay royalty. Consumer Products Segment following table presents Consumer Products segment net revenues major geographic region nine months ended September 28, 2025 September 29, 2024: Consumer Products segment net revenues decreased 9% $1,637.6 million first nine months 2025 compared $1,797.6 million first nine months 2024 primarily driven broader industry trends timing retail orders. net revenue decrease primarily reflects lower net revenues driven declining sales volumes brands such NERF, PLAY-DOH, Hasbro Gaming, offset growth BEYBLADE, MONOPOLY, TRANSFORMERS products."
}