{
  "source_file": "hd-20251102.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion provides an analysis of the Company’s financial condition and results of operations from management’s perspective and should be read in conjunction with the consolidated financial statements and related notes included in this report and in the 2024 Form 10-K and with our MD&A included in the 2024 Form 10-K.\nTABLE OF CONTENTS\nExecutive Summary\n18\nResults of Operations\n19\nLiquidity and Capital Resources\n23\nCritical Accounting Estimates\n25\nFiscal Q3 2025 Form 10-Q\n17\n \nTable of \nContents\nEXECUTIVE SUMMARY\nWe reported net sales of $41.4 billion in the third quarter of fiscal 2025. Net earnings were $3.6 billion, or $3.62 per diluted share. For the first nine months of fiscal 2025, net sales were $126.5 billion and net earnings were $11.6 billion, or $11.65 per diluted share.\nDuring the third quarter of fiscal 2025, we opened three new stores in the U.S., resulting in a total store count of 2,356 at November 2, 2025. A total of 322 stores, or 13.7%, were located in Canada and Mexico. Our inventory turnover ratio was 4.5 times at the end of the third quarter of fiscal 2025, compared to 4.8 times at the end of the third quarter of fiscal 2024. The decrease in our inventory turnover ratio was primarily driven by higher average inventory levels during the first nine months of fiscal 2025.\nDuring the first nine months of fiscal 2025, we generated $13.0 billion of cash flow from operations, received $2.9 billion of proceeds from commercial paper borrowings, net of repayments, and received $2.1 billion of proceeds from the issuance of long-term debt, net of discounts. This cash flow, together with cash on hand, was used to fund $6.9 billion in cash dividends, repay $3.4 billion of long-term debt, and fund $2.6 billion in capital expenditures. We also completed the GMS acquisition, including the repayment of certain of its outstanding debt, for aggregate cash consideration totaling approximately $5.5 billion. In February 2025, we announced a 2.2% increase in our quarterly cash dividend to $2.30 per share.\nOur ROIC for the trailing twelve-month period was 26.3% at the end of the third quarter of fiscal 2025 and 31.5% at the end of the third quarter of fiscal 2024. The decrease in ROIC was primarily driven by higher average long-term debt and higher average equity largely due to the financing of the SRS acquisition. See the \nNon-GAAP Financial Measures\n section below for our definition and calculation of ROIC.\nGMS Acquisition\nOn June 29, 2025, we entered into a definitive agreement to acquire GMS, a leading distributor of specialty building products, including drywall, ceilings, steel framing and other complementary construction products, through branches located across the U.S. and Canada. Under the terms of the merger agreement, we, through a wholly owned subsidiary, made a cash tender offer to purchase all outstanding shares of GMS common stock for $110 per share. All conditions of the offer were satisfied, including receipt of the requisite regulatory approvals, and the merger was completed on September 4, 2025. As a result of the merger, GMS became a direct subsidiary of SRS and an indirect, wholly owned subsidiary of the Company. We believe the GMS acquisition will enhance SRS's position as a leading multi-category building materials distributor, bringing differentiated capabilities, product categories and customer relationships that are highly complementary to SRS's existing business. Refer to \nNote 10\n to our consolidated financial statements for further discussion on the merger.\nTariffs and Other Trade Policy Matters \nWe continue to monitor developments with respect to tariffs and other trade policy matters closely. We have worked, and continue to work, diligently to diversify our global supply chain and to implement other cost mitigation initiatives. While we have experienced increased costs as a result of tariffs, our actions, including diversification efforts and modest price increases, along with our scale, vendor relationships, experienced internal teams, and other initiatives have allowed us to effectively mitigate the impact on our results of operations. We plan to continue to assess our sourcing and other mitigation strategies to maintain a strong value proposition for our customers and believe we remain well positioned to manage the impact that tariffs in effect as of the date of this filing are expected to have on our business. \nAs trade policy discussions and developments are ongoing, we cannot predict with certainty their ultimate impact on our business in future periods, including our results of operations and cash flows. For more information on these risks and uncertainties see Part I, Item 1A. “Risk Factors” of our 2024 Form 10-K.  \nFiscal Q3 2025 Form 10-Q\n18\n \nTable of \nContents\nRESULTS OF OPERATIONS\nThe following table presents the percentage relationship between net sales and major categories in our consolidated statements of earnings.\nFISCAL 2025 AND FISCAL 2024 THREE MONTH COMPARISONS\nThree Months Ended\nNovember 2, 2025\nOctober 27, 2024\ndollars in millions\n$\n% of \nNet Sales\n$\n% of \nNet Sales\nNet sales\n$\n41,352 \n$\n40,217 \nGross profit\n13,815 \n33.4 \n%\n13,425 \n33.4 \n%\nOperating expenses:\nSelling, general and administrative\n7,636 \n18.5 \n7,212 \n17.9 \nDepreciation and amortization\n826 \n2.0 \n795 \n2.0 \nTotal operating expenses\n8,462 \n20.5 \n8,007 \n19.9 \nOperating income\n5,353 \n12.9 \n5,418 \n13.5 \nInterest and other (income) expense:\nInterest income and other, net\n(32)\n(0.1)\n(30)\n(0.1)\nInterest expense\n628 \n1.5 \n625 \n1.6 \nInterest and other, net\n596 \n1.4 \n595 \n1.5 \nEarnings before provision for income taxes\n4,757 \n11.5 \n4,823 \n12.0 \nProvision for income taxes\n1,156 \n2.8 \n1,175 \n2.9 \nNet earnings\n$\n3,601 \n8.7 \n%\n$\n3,648 \n9.1 \n%\n—————\nNote: Certain percentages may not sum to totals due to rounding.\nThree Months Ended\nSelected financial and sales data:\nNovember 2,\n2025\nOctober 27,\n2024\n% Change\nComparable sales (% change)\n0.2 \n%\n(1.3)\n%\nN/A\nComparable customer transactions (% change) \n(1)\n(1.6)\n%\n(0.6)\n%\nN/A\nComparable average ticket (% change) \n(1) (2)\n1.8 \n%\n(0.8)\n%\nN/A\nCustomer transactions (in millions) \n(1)\n393.5 \n399.0 \n(1.4)\n%\nAverage ticket \n(1) (2)\n$\n90.39 \n$\n88.65 \n2.0 \n%\nDiluted earnings per share\n$\n3.62 \n$\n3.67 \n(1.4)\n%\n—————\n(1)\nCustomer transactions and average ticket measures do not include results from HD Supply or SRS (including GMS).\n(2)\nAverage ticket represents the average price paid per transaction and is used by management to monitor the performance of the Company, as it represents a primary driver in measuring sales performance.\nSales\nWe assess our sales performance by evaluating both net sales and comparable sales. In fiscal 2025, there is a one-week calendar shift as a result of the 53rd week in fiscal 2024. For purposes of the following discussion, comparable sales, comparable customer transactions, and comparable average ticket are based upon the comparable 13-week period from fiscal 2024.\nNet Sales.\n Net sales for the third quarter of fiscal 2025 were $41.4 billion, an increase of 2.8% from $40.2 billion for the third quarter of fiscal 2024. The increase in net sales for the third quarter of fiscal 2025 was primarily driven by sales from GMS, which was acquired on September 4, 2025 and contributed $892 million of net sales during the third quarter of fiscal 2025. Net sales also increased due to the impact of a positive comparable sales environment and sales from new stores and branches, partially offset by the calendar shift which resulted in the third quarter of fiscal 2025 including one less week of summer and one additional week of fall.\nFiscal Q3 2025 Form 10-Q\n19\n \nTable of \nContents\nOnline sales, which consist of sales of products generated through websites and mobile applications, represented 15.2% of net sales during the third quarter of fiscal 2025 and increased by 11.4% compared to the third quarter of fiscal 2024. Calculated on a comparable week basis relative to fiscal 2024, online sales increased by 11.0%.\nA stronger U.S. dollar compared to the third quarter of fiscal 2024 negatively impacted net sales by $18 million during the third quarter of fiscal 2025.\nComparable Sales.\n Comparable sales is a measure that highlights the performance of our existing locations and websites by measuring the change in net sales for a period over the comparable prior period of equivalent length. Comparable sales includes sales at locations, physical and online, open greater than 52 weeks (including remodels and relocations) and excludes closed stores. Acquisitions are typically included in comparable sales after they have been owned for more than 52 weeks. Fiscal 2025 includes 52 weeks and fiscal 2024 included 53 weeks. For our calculation of comparable sales in fiscal 2025, we will compare weeks 1 through 52 in fiscal 2025 against weeks 2 through 53 in fiscal 2024. Comparable sales is intended only as supplemental information and is not a substitute for net sales presented in accordance with GAAP. The method of calculating comparable sales varies across the retail industry. As a result, our method of calculating comparable sales may not be the same as similarly titled measures reported by other companies.\nTotal comparable sales for the third quarter of fiscal 2025 increased 0.2%, primarily reflecting a 1.8% increase in comparable average ticket, partially offset by a 1.6% decrease in comparable customer transactions compared to the third quarter of fiscal 2024. Our comparable sales results reflect customer engagement with smaller home improvement projects, which was offset by the lack of severe weather events occurring during the third quarter of fiscal 2025, while lapping hurricane-related demand in the third quarter of fiscal 2024. Our comparable sales performance for the third quarter of fiscal 2025 also reflects the impact of continued macroeconomic uncertainties and other macroeconomic factors, including a persisting high interest rate environment pressuring large home improvement project demand.\nDuring the third quarter of fiscal 2025, our Kitchen & Blinds, Bath, Outdoor Garden, Storage & Organization, Electrical, Plumbing, Millwork, Hardware, and Appliances merchandising departments within our Primary segment posted positive comparable sales compared to the third quarter of fiscal 2024.\nGross Profit\nGross profit for the third quarter of fiscal 2025 increased 2.9% to $13.8 billion from $13.4 billion for the third quarter of fiscal 2024. Gross profit as a percentage of net sales, or gross profit margin, was 33.4% for both the third quarters of fiscal 2025 and fiscal 2024, and reflects lower shrink and certain supply chain benefits within our Primary segment, offset by the inclusion of GMS in our consolidated results.\nOperating Expenses\nOur operating expenses are composed of SG&A and depreciation and amortization.\nSelling, General & Administrative.\n SG&A for the third quarter of fiscal 2025 increased $424 million, or 5.9%, to $7.6 billion from $7.2 billion for the third quarter of fiscal 2024. As a percentage of net sales, SG&A was 18.5% for the third quarter of fiscal 2025 compared to 17.9% for the third quarter of fiscal 2024, primarily reflecting the impact of higher payroll and related costs in the third quarter of fiscal 2025 within our Primary segment, along with transaction costs related to the GMS acquisition.\nDepreciation and Amortization. \nDepreciation and amortization for the third quarter of fiscal 2025 increased $31 million, or 3.9%, to $826 million from $795 million for the third quarter of fiscal 2024. As a percentage of net sales, depreciation and amortization was 2.0% for both the third quarter of fiscal 2025 and fiscal 2024.\nInterest and Other, net\nInterest and other, net was $596 million for the third quarter of fiscal 2025 compared to $595 million for the third quarter of fiscal 2024. As a percentage of net sales, interest and other, net was 1.4% for the third quarter of fiscal 2025 compared to 1.5% for the third quarter of fiscal 2024.\nProvision for Income Taxes\nOur combined effective income tax rate was 24.3% for the third quarter of fiscal 2025 compared to 24.4% for the third quarter of fiscal 2024. \nFiscal Q3 2025 Form 10-Q\n20\n \nTable of \nContents\nDiluted Earnings per Share\nDiluted earnings per share were $3.62 for the third quarter of fiscal 2025 compared to $3.67 for the third quarter of fiscal 2024. The decrease in diluted earnings per share was primarily driven by lower net earnings during the third quarter of fiscal 2025.\nFISCAL 2025 AND FISCAL 2024 NINE MONTH COMPARISONS\nNine Months Ended\nNovember 2, 2025\nOctober 27, 2024\ndollars in millions\n$\n% of \nNet Sales\n$\n% of\nNet Sales\nNet sales\n$\n126,485 \n$\n119,810 \nGross profit\n42,399 \n33.5 \n%\n40,274 \n33.6 \n%\nOperating expenses:\nSelling, general and administrative\n22,930 \n18.1 \n21,023 \n17.5 \nDepreciation and amortization\n2,428 \n1.9 \n2,220 \n1.9 \nTotal operating expenses\n25,358 \n20.0 \n23,243 \n19.4 \nOperating income\n17,041 \n13.5 \n17,031 \n14.2 \nInterest and other (income) expense:\nInterest income and other, net\n(81)\n(0.1)\n(171)\n(0.1)\nInterest expense\n1,818 \n1.4 \n1,683 \n1.4 \nInterest and other, net\n1,737 \n1.4 \n1,512 \n1.3 \nEarnings before provision for income taxes\n15,304 \n12.1 \n15,519 \n13.0 \nProvision for income taxes\n3,719 \n2.9 \n3,710 \n3.1 \nNet earnings\n$\n11,585 \n9.2 \n%\n$\n11,809 \n9.9 \n%\n—————\nNote: Certain percentages may not sum to totals due to rounding.\nNine Months Ended\nSelected financial and sales data:\nNovember 2,\n2025\nOctober 27,\n2024\n% Change\nComparable sales (% change) \n0.3 \n%\n(2.5)\n%\nN/A\nComparable customer transactions (% change) \n(1)\n(0.8)\n%\n(1.5)\n%\nN/A\nComparable average ticket (% change) \n(1) (2)\n1.1 \n%\n(1.2)\n%\nN/A\nCustomer transactions (in millions) \n(1)\n1,235.0 \n1,236.8 \n(0.1)\n%\nAverage ticket \n(1) (2) \n$\n90.35 \n$\n89.38 \n1.1 \nDiluted earnings per share\n$\n11.65 \n$\n11.90 \n(2.1)\n%\n—————\n(1)\nCustomer transactions and average ticket measures do not include results from HD Supply or SRS (including GMS).\n(2)\nAverage ticket represents the average price paid per transaction and is used by management to monitor the performance of the Company, as it represents a primary driver in measuring sales performance.\nSales\nWe assess our sales performance by evaluating both net sales and comparable sales. In fiscal 2025, there is a one-week calendar shift as a result of the 53rd week in fiscal 2024. For purposes of the following discussion, comparable sales, comparable customer transactions, and comparable average ticket are based upon the comparable 39-week period from fiscal 2024.\nFiscal Q3 2025 Form 10-Q\n21\n \nTable of \nContents\nNet Sales.\n Net sales for the first nine months of fiscal 2025 were $126.5 billion, an increase of 5.6% from $119.8 billion for the first nine months of fiscal 2024. The increase in net sales for the first nine months of fiscal 2025 was primarily driven by sales resulting from our acquisitions of SRS, which was acquired on June 18, 2024, and GMS, which was acquired on September 4, 2025. In aggregate, these acquisitions contributed approximately $5.4 billion of incremental net sales during the first nine months of fiscal 2025. Net sales also increased due to the impact of a positive comparable sales environment and sales from new stores. Additionally, due to the 53rd week in fiscal 2024, the first nine months of fiscal 2025 included one less week of winter and one additional week of fall, which further contributed to the increase in net sales in the first nine months of fiscal 2025. \nOnline sales represented 15.4% of net sales during the first nine months of fiscal 2025 and increased by 10.8% compared to the first nine months of fiscal 2024. Calculated on a comparable week basis relative to fiscal 2024, online sales increased by 10.3%.\nA stronger U.S. dollar compared to the first nine months of fiscal 2024 negatively impacted net sales by $455 million during the first nine months of fiscal 2025.\nComparable Sales.\n Total comparable sales for the first nine months of fiscal 2025 increased 0.3%, primarily reflecting a 1.1% increase in comparable average ticket, partially offset by a 0.8% decrease in comparable customer transactions compared to the first nine months of fiscal 2024. Foreign exchange rates negatively impacted comparable sales by approximately 40 basis points for the first nine months of fiscal 2025. Our comparable sales results reflect customer engagement with smaller home improvement projects, which was offset by the impact of continued macroeconomic uncertainties and other macroeconomic factors, including a persisting high interest rate environment pressuring large home improvement project demand.\nDuring the first nine months of fiscal 2025, our Storage & Organization, Bath, Outdoor Garden, Electrical, Kitchen & Blinds, Plumbing, Appliances, Indoor Garden, Building Materials, Hardware and Millwork merchandising departments within our Primary segment posted positive comparable sales compared to the first nine months of fiscal 2024. \nGross Profit\nGross profit for the first nine months of fiscal 2025 increased 5.3% to $42.4 billion from $40.3 billion for the first nine months of fiscal 2024. Gross profit as a percentage of net sales, or gross profit margin, was 33.5% for the first nine months of fiscal 2025 compared to 33.6% for the first nine months of fiscal 2024. The decrease in gross profit margin during the first nine months of fiscal 2025 primarily reflects the inclusion of SRS and GMS in our consolidated results, partially offset by lower shrink and certain supply chain benefits within our Primary segment. \nOperating Expenses\nOur operating expenses are composed of SG&A and depreciation and amortization. \nSelling, General & Administrative.\n SG&A for the first nine months of fiscal 2025 increased $1.9 billion, or 9.1%, to $22.9 billion from $21.0 billion for the first nine months of fiscal 2024. As a percentage of net sales, SG&A was 18.1% for the first nine months of fiscal 2025 compared to 17.5% for the first nine months of fiscal 2024, which primarily reflects higher payroll and related costs during the first nine months of fiscal 2025 along with the impact of a non-recurring legal-related benefit recognized during the first nine months of fiscal 2024 within our Primary segment.\nDepreciation and Amortization. \nDepreciation and amortization for the first nine months of fiscal 2025 increased $208 million, or 9.4%, to $2.4 billion from $2.2 billion for the first nine months of fiscal 2024. As a percentage of net sales, depreciation and amortization was 1.9% for the first nine months of both fiscal 2025 and fiscal 2024, which reflects increased intangible asset amortization expense related to SRS.\nInterest and Other, net\nInterest and other, net for the first nine months of fiscal 2025 increased $225 million, or 14.9%, to $1.7 billion from $1.5 billion for the first nine months of fiscal 2024. As a percentage of net sales, interest and other, net was 1.4% for the first nine months of fiscal 2025 compared to 1.3% for the first nine months of fiscal 2024, primarily due to higher long-term debt balances and lower interest income in fiscal 2025, partially offset by lower average commercial paper borrowings during fiscal 2025.\nFiscal Q3 2025 Form 10-Q\n22\n \nTable of \nContents\nProvision for Income Taxes\nOur combined effective income tax rate was 24.3% for the first nine months of fiscal 2025 compared to 23.9% for the first nine months of fiscal 2024. The increase in our effective tax rate was driven by certain discrete tax benefits recognized during the first nine months of fiscal 2024.\nDiluted Earnings per Share\nDiluted earnings per share were $11.65 for the first nine months of fiscal 2025, compared to $11.90 for the first nine months of fiscal 2024. The decrease in diluted earnings per share was primarily driven by lower net earnings during the first nine months of fiscal 2025.\nNON-GAAP FINANCIAL MEASURES\nTo provide clarity on our operating performance, we supplement our reporting with certain non-GAAP financial measures. However, this supplemental information should not be considered in isolation or as a substitute for the related GAAP measures. Non-GAAP financial measures presented herein may differ from similar measures used by other companies.\nReturn on Invested Capital\nWe believe ROIC is meaningful for management, investors and ratings agencies because it measures how effectively we deploy our capital base. ROIC is a non-GAAP profitability measure, not a measure of financial performance under GAAP. We define ROIC as NOPAT, a non-GAAP financial measure, for the most recent twelve-month period, divided by average debt and equity. We define average debt and equity as the average of beginning and ending long-term debt (including current installments) and equity for the most recent twelve-month period.\nThe following table presents the calculation of ROIC, together with a reconciliation of NOPAT to net earnings (the most comparable GAAP financial measure):\n \nTwelve Months Ended \n(2)\ndollars in millions\nNovember 2,\n2025\nOctober 27,\n2024\nNet earnings\n$\n14,582 \n$\n14,610 \nInterest and other, net\n2,345 \n1,970 \nProvision for income taxes\n4,609 \n4,594 \nOperating income\n21,536 \n21,174 \nIncome tax adjustment \n(1)\n(5,206)\n(5,064)\nNOPAT\n$\n16,330 \n$\n16,110 \nAverage debt and equity\n$\n61,975 \n$\n51,190 \nROIC\n26.3 \n%\n31.5 \n%\n—————\n(1)\nIncome tax adjustment is defined as operating income multiplied by our effective tax rate for the trailing twelve months.\n(2)\nThe fourth quarter of fiscal 2024 includes 14 weeks. All other quarters include 13 weeks. Consistent with our consolidated financial statements, periods presented only include operating results for acquisitions since their respective acquisition dates.\nLIQUIDITY AND CAPITAL RESOURCES\nAt November 2, 2025, we had $1.7 billion in cash and cash equivalents, of which $1.1 billion was held by our foreign subsidiaries. We believe that our current cash position, cash flow generated from operations, funds available from our commercial paper program, and access to the long-term debt capital markets should be sufficient not only for our operating requirements, any required debt payments, and satisfaction of other contractual obligations, but also to enable us to invest in the business, fund dividend payments, and fund any share repurchases through the next several fiscal years. In addition, we believe that we have the ability to obtain alternative sources of financing, if necessary.\nFiscal Q3 2025 Form 10-Q\n23\n \nTable of \nContents\nOur material cash requirements include contractual and other obligations arising in the normal course of business. These obligations primarily include long-term debt and related interest payments, operating and finance lease obligations, and purchase obligations. In addition to our cash requirements, we follow a disciplined approach to capital allocation. This approach first prioritizes investing in the business, followed by paying dividends, with the intent of then returning excess cash to shareholders in the form of share repurchases. In March 2024, we paused share repurchases in connection with the SRS acquisition and do not have plans to resume share repurchases in fiscal 2025. \nOn July 4, 2025, the OBBBA was signed into law in the U.S., which contains a broad range of tax provisions, including the allowance to expense 100% of the cost of qualified property and immediate expensing of domestic research and experimental expenditures. While we continue to assess its implications, we have realized, and expect to continue to realize, a reduction in our fiscal 2025 cash tax payments due to the above mentioned provisions.\nDuring the first nine months of fiscal 2025, we invested approximately $2.6 billion back into our business in the form of capital expenditures. In line with our expectation of approximately 2.5% of fiscal 2025 net sales, we plan to invest approximately $4 billion back into our business in the form of capital expenditures in fiscal 2025 across initiatives to improve the customer experience, including through technology and development of other differentiated capabilities, to continue to mature and build out Pro capabilities, as well as to build new stores. However, we may adjust our capital expenditures to support the operations of the business, to enhance long-term strategic positioning, or in response to the economic environment, as necessary or appropriate. We may also utilize strategic acquisitions, such as the GMS acquisition, to help accelerate our strategic initiatives. \nIn February 2025, we announced a 2.2% increase in our quarterly cash dividend from $2.25 to $2.30 per share. During the first nine months of fiscal 2025, we paid cash dividends of $6.9 billion to shareholders. We intend to pay a dividend in the future; however, any future dividend is subject to declaration by our Board of Directors based on our earnings, capital requirements, financial condition, and other factors considered relevant by our Board of Directors.\nIn August 2023, our Board of Directors approved a $15.0 billion share repurchase authorization that replaced the previous authorization of $15.0 billion, which was approved in August 2022. The August 2023 authorization does not have a prescribed expiration date. As of November 2, 2025, approximately $11.7 billion of the $15.0 billion share repurchase authorization remained available. \nDEBT\nAt the beginning of fiscal 2025, we had a commercial paper program that allowed for an aggregate of $7.0 billion in borrowings, and was supported by $7.0 billion of back-up credit facilities. These back-up credit facilities consisted of a five-year $3.5 billion credit facility scheduled to expire in July 2027, a 364-day $2.0 billion credit facility scheduled to expire in May 2025, and a 364-day $1.5 billion credit facility scheduled to expire in July 2025. \nIn May 2025, we terminated all three back-up credit facility agreements and simultaneously entered into a new five-year $3.5 billion credit facility scheduled to expire in May 2030 and a new 364-day $3.5 billion credit facility scheduled to expire in May 2026.\nIn July 2025, we increased our commercial paper program by $4.0 billion in connection with the \nanticipated \nfinancing of the GMS acquisition (see \nNote 10\n to our consolidated financial statements). In July 2025, in connection with the increase in the commercial paper program, we also entered into a new three-year $3.0 billion back-up credit facility scheduled to expire in July 2028, and a new 364-day $1.0 billion back-up credit facility scheduled to expire in July 2026, as well as amended and restated our existing 364-day $3.5 billion credit facility to extend the maturity from May 2026 to July 2026. In the aggregate, as of November 2, 2025, our commercial paper program allows for borrowings up to $11.0 billion and is supported by $11.0 billion of back-up credit facilities.\nOn September 4, 2025, we utilized approximately $2.0 billion of commercial paper borrowings, together with cash on hand, to fund the GMS acquisition. These borrowings were subsequently repaid with the $2.0 billion of proceeds from our September 2025 senior notes issuance.\nDuring the first nine months of fiscal 2025, all of our short term borrowings were under our commercial paper program, and the maximum amount outstanding during that period was $4.3 billion. At November 2, 2025, we had outstanding borrowings under our commercial paper program of $3.2 billion with a weighted average interest rate of 4.2%, we had no outstanding borrowings under our back-up credit facilities, and we were in compliance with all of the covenants contained in our back-up credit facilities, none of which are expected to impact our liquidity or capital resources.\nFiscal Q3 2025 Form 10-Q\n24\n \nTable of \nContents\nWe also issue senior notes from time to time as part of our capital management strategy. As discussed above, in September 2025, we issued $2.0 billion of senior notes, which were used to repay commercial paper borrowings used to fund the GMS acquisition. Separately, during the first nine months of fiscal 2025, we repaid an aggregate of $2.75 billion of senior notes at maturity. \nThe indentures governing our senior notes do not generally limit our ability to incur additional indebtedness or require us to maintain financial ratios or specified levels of net worth or liquidity. The indentures governing our notes contain various covenants, none of which are expected to impact our liquidity or capital resources. We were in compliance with all such covenants at November 2, 2025. See \nNote 5\n to our consolidated financial statements for further discussion of our debt arrangements.\nCASH FLOWS SUMMARY\nOperating Activities\n \nCash flow generated from operations provides us with a significant source of liquidity. Our operating cash flows result primarily from cash received from our customers, offset by cash payments we make for products and services, associate compensation, operations, occupancy costs, and income taxes. Cash provided by or used in operating activities is also subject to changes in working capital. Working capital at any point in time is subject to many variables, including seasonality, inventory management and category expansion, the timing of cash receipts and payments, vendor payment terms, and fluctuations in foreign exchange rates.\nNet cash provided by operating activities decreased by $2.2 billion in the first nine months of fiscal 2025 compared to the first nine months of fiscal 2024, primarily due to changes in working capital. Changes in working capital were primarily driven by the timing of vendor payments, increased inventory levels during the first nine months of fiscal 2025, and the deferral of our fourth quarter fiscal 2024 estimated federal tax payment to the first quarter of fiscal 2025. This was partially offset by a reduction to our fiscal 2025 cash tax payments resulting from the OBBBA.\nInvesting Activities\n \nNet cash used in investing activities decreased by $12.1 billion in the first nine months of fiscal 2025 compared to the first nine months of fiscal 2024, primarily resulting from higher cash paid for acquisitions during fiscal 2024 compared to fiscal 2025.\nFinancing Activities\n \nNet cash used in financing activities in the first nine months of fiscal 2025 primarily reflected $6.9 billion of cash dividends paid and $3.4 billion of repayments of long-term debt, partially offset by $2.9 billion of proceeds from commercial paper borrowings, net of repayments, and $2.1 billion of net proceeds from long-term debt. Net cash provided by financing activities in the first nine months of fiscal 2024 primarily reflected $10.0 billion of net proceeds from the issuance of long-term debt and $1.3 billion of proceeds from commercial paper borrowings, net of repayments, which were used to finance the SRS acquisition. This was partially offset by $6.7 billion of cash dividends paid, $1.4 billion of repayments of long-term debt, and $649 million of share repurchases prior to pausing share repurchases in March 2024.\nCRITICAL ACCOUNTING ESTIMATES\nDuring the first nine months of fiscal 2025, there were no changes to our critical accounting estimates or our significant accounting policies as disclosed in the 2024 Form 10-K. Our significant accounting policies are disclosed in \nNote 1\n to our consolidated financial statements.\nADDITIONAL INFORMATION\nFor information on accounting pronouncements that have impacted or may materially impact our consolidated financial condition, results of operations, or cash flows, see \nNote 1\n to our consolidated financial statements."
}