{
  "source_file": "hig-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n(Dollar amounts in millions except for per share data, unless otherwise stated)\nThe Hartford provides projections and other forward-looking information in the following discussions, which contain many forward-looking statements, particularly relating to the Company’s future financial performance. These forward-looking statements are estimates based on information currently available to the Company, are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and are subject to the cautionary statements set forth on pages 4 and 5 of this Form 10-Q. Actual results are likely to differ, and in the past have differed, materially from those forecast by the Company, depending on the outcome of various factors, including, but not limited to, those set forth in the following discussion; Part I, Item 1A, Risk Factors in The Hartford’s 2024 Form 10-K Annual Report; and our other filings with the Securities and Exchange Commission (\"SEC\"). The Hartford undertakes no obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise.\nThe Hartford defines increases or decreases greater than or equal to 200%, or changes from a net gain to a net loss position, or vice versa, as “NM” or not meaningful.\nIndex\n \nDescription\nPage\nKey Performance Measures and Ratios\n53\nThe Hartford's Operations\n59\nFinancial Highlights\n60\nConsolidated Results of Operations\n61\nInvestment Results\n66\nCritical Accounting Estimates\n69\nBusiness Insurance\n75\nPersonal Insurance\n80\nProperty & Casualty Other Operations\n85\nEmployee Benefits\n86\nHartford Funds\n89\nCorporate\n90\nEnterprise Risk Management\n92\nCapital Resources and Liquidity\n103\nImpact of New Accounting Standards\n109\nThroughout this Management's Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\"), we use certain terms and abbreviations, the more commonly used are summarized in the \nAcronyms\n \nsection.\nKey Performance Measures and Ratios\nThe Company considers the measures and ratios in the following discussion to be key performance indicators for its businesses. Management believes that these ratios and measures are useful in understanding the underlying trends in The Hartford’s businesses. However, these key performance indicators should only be used in conjunction with, and not in lieu of, the results presented in the reportable segment and corporate operating summaries that follow in this MD&A. These ratios and measures may not be comparable to other performance measures used by the Company’s competitors.\nDefinitions of Non-GAAP and Other Measures and Ratios\nAssets Under Management (\"AUM\")-\n Include mutual fund and exchange-traded fund (\"ETF\") assets. AUM is a measure used by the Company's Hartford Funds segment because a significant portion of the segment’s revenues and expenses are based upon asset values. These revenues and expenses increase or decrease with a rise or fall in AUM whether caused by changes in the market or through net flows.\n53\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nBook Value per Diluted Share excluding accumulated other comprehensive income (\"AOCI\")- \nThis is a non-GAAP per share measure that i\ns calculated by dividing (a) common stockholders' equity, excluding AOCI, after tax, by (b) common shares outstanding and dilutive potential common shares. The Company provides this measure to enable investors to analyze the amount of the Company's net worth that is primarily attributable to the Company's business operations. The Company believes that excluding AOCI from the numerator is useful to investors because it eliminates the effect of items that can fluctuate significantly from period to period, primarily based on changes in interest rates. Book value per diluted share is the most directly comparable U.S. GAAP measure.\n \nCombined Ratio- \nThe sum of the loss and loss adjustment expense (\"LAE\") ratio, the expense ratio and the policyholder dividend ratio. This ratio is a relative measurement that describes the related cost of losses and expenses for every $100 of earned premiums. A combined ratio below 100 demonstrates underwriting profit; a combined ratio above 100 demonstrates underwriting losses.\nCore Earnings-\n The Hartford uses the non-GAAP measure core earnings as an important measure of the Company’s operating performance. The Hartford believes that core earnings provides investors with a valuable measure of the performance of the Company’s ongoing businesses because it reveals trends in our insurance and financial services businesses that may be obscured by including the net effect of certain items. Therefore, the following items are excluded from core earnings: \n•\nCertain realized gains and losses - Generally realized gains and losses are primarily driven by investment decisions and external economic developments, the nature and timing of which are unrelated to the insurance and underwriting aspects of our business. Accordingly, core earnings excludes the effect of all realized gains and losses that tend to be highly variable from period to period based on capital market conditions. The Hartford believes, however, that some realized gains and losses are integrally related to our insurance operations, so core earnings includes net realized gains and losses such as net periodic settlements on credit derivatives. These net realized gains and losses are directly related to an offsetting item included in the income statement such as net investment income.\n•\nRestructuring and other costs - Costs incurred as part of a restructuring plan are not a recurring operating expense of the business.\n•\nLoss on extinguishment of debt - Largely consisting of make-whole payments or tender premiums upon paying debt off before maturity, these losses are not a recurring operating expense of the business. \n•\nGains and losses on reinsurance transactions - Gains or losses on reinsurance, such as those entered into upon sale of a business or to reinsure loss reserves, are not a recurring operating expense of the business.\n•\nIntegration and other non-recurring M&A costs - These costs, including transaction costs incurred in connection with an acquired business, are incurred over a short period of time and do not represent an ongoing operating expense of the business. \n•\nChange in loss reserves upon acquisition of a business - These changes in loss reserves are excluded from core earnings because such changes could obscure the ability to compare results in periods after the acquisition to results of periods prior to the acquisition. \n•\nDeferred gain resulting from retroactive reinsurance and subsequent changes in the deferred gain - Retroactive reinsurance agreements economically transfer risk to the reinsurers and excluding the deferred gain on retroactive reinsurance and related amortization of the deferred gain from core earnings provides greater insight into the economics of the business.\n•\nChange in valuation allowance on deferred taxes related to non-core components of before tax income - These changes in valuation allowances are excluded from core earnings because they relate to non-core components of before tax income, such as tax attributes like capital loss carryforwards. \n•\nResults of discontinued operations - These results are excluded from core earnings for businesses sold or held for sale because such results could obscure the ability to compare period over period results for our ongoing businesses. \nIn addition to the above components of net income available to common stockholders that are excluded from core earnings, preferred stock dividends declared, which are excluded from net income, are included in the determination of core earnings. Preferred stock dividends are a cost of financing more akin to interest expense on debt and are expected to be a recurring expense as long as the preferred stock is outstanding. \nNet income (loss) and net income (loss) available to common stockholders are the most directly comparable U.S. GAAP measures to core earnings. Core earnings should not be considered as a substitute for net income (loss) or net income (loss) available to common stockholders and does not reflect the overall profitability of the Company’s business. Therefore, The Hartford believes that it is useful for investors to evaluate net income (loss), net income (loss) available to common stockholders, and core earnings when reviewing the Company’s performance. \n54\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nReconciliation of Net Income to Core Earnings\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nNet income\n$\n1,080\n \n$\n767\n \n$\n2,705\n \n$\n2,258\n \nPreferred stock dividends\n6 \n6 \n16 \n16 \nNet income available to common stockholders\n1,074\n \n761\n \n2,689\n \n2,242\n \nAdjustments to reconcile net income available to common stockholders to core earnings:\nNet realized losses excluded from core earnings, before tax\n10 \n12 \n67 \n40 \nRestructuring and other costs, before tax\n— \n1 \n— \n2 \nIntegration and other non-recurring M&A costs, before tax\n2 \n2 \n6 \n6 \nChange in deferred gain on retroactive reinsurance, before tax [1]\n(8)\n(26)\n(64)\n(87)\nIncome tax expense (benefit) [2]\n(1)\n2 \n(1)\n8 \nCore earnings\n$\n1,077\n \n$\n752\n \n$\n2,697\n \n$\n2,211\n \n[1]\nThe Company recorded amortization of the deferred gain related to the Navigators adverse development cover (\"Navigators ADC\") of $8 and $64 for the three and nine months ended September 30, 2025 and $26 and $87 for the three and nine months ended September 30, 2024, respectively. The deferred gain has been fully amortized as of September 30, 2025. For additional information regarding the ADC reinsurance agreement, refer to Note 9 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Condensed Consolidated Financial Statements.\n[2]\nPrimarily represents the federal income tax expense (benefit) related to before tax items not included in core earnings.\nCore Earnings Margin-\n The Hartford uses the non-GAAP measure core earnings margin to evaluate, and believes it is an important measure of, the Employee Benefits segment's operating performance. Core earnings margin is calculated by dividing core earnings by revenues, excluding buyouts and realized gains (losses). Net income margin, calculated by dividing net income by revenues, is the most directly comparable U.S. GAAP measure. The Company believes that core earnings margin provides investors with a valuable measure of the performance of Employee Benefits because it reveals trends in the business that may be obscured by the effect of buyouts and realized gains (losses) as well as other items excluded in the calculation of core earnings. Core earnings margin should not be considered as a substitute for net income margin and does not reflect the overall profitability of Employee Benefits. Therefore, the Company believes it is important for investors to evaluate both core earnings margin and net income margin when reviewing performance. A reconciliation of net income margin to core earnings margin is set forth in the Results of Operations section within MD&A - Employee Benefits.\nCurrent Accident Year Catastrophe Ratio- \nA component of the loss and loss adjustment expense ratio, represents the ratio of catastrophe losses incurred in the current accident year (\"CAY\") (net of reinsurance) to earned premiums. For U.S. events, a catastrophe is an event that causes $25 or more in industry insured property losses and affects a significant number of property and casualty policyholders and insurers, as defined by the Property Claim Services office of Verisk. For international events, the Company's approach is similar, informed, in part, by how Lloyd's of London defines major losses. Lloyd's of London is an insurance market-place operating worldwide (\"Lloyd's\"). Lloyd's does not underwrite risks. The Company accepts risks as the sole member of Lloyd's Syndicate 1221 (\"Lloyd's Syndicate\"). The current accident year catastrophe ratio includes the effect of catastrophe losses, but does not include the effect of reinstatement premiums.\nExpense Ratio- \nFor Business Insurance and Personal Insurance is the ratio of underwriting expenses less fee income, to earned premiums. Underwriting expenses include the amortization of deferred policy acquisition costs (\"DAC\"), amortization of other intangible assets and insurance operating costs and other expenses, including certain centralized services costs and bad debt expense. DAC includes commissions, taxes, licenses and fees and other incremental direct underwriting expenses and are amortized over the policy term. \nThe expense ratio for Employee Benefits is expressed as the ratio of insurance operating costs and other expenses including amortization of intangibles and amortization of DAC, to premiums and other considerations, excluding buyout premiums.\nThe expense ratio for Business Insurance, Personal Insurance and Employee Benefits does not include integration and other transaction costs associated with an acquired business.\nFee Income- \nIs largely driven from amounts earned as a result of contractually defined percentages of AUM in our Hartford Funds business. These fees are generally earned on a daily basis. Therefore, this fee income increases or decreases with the rise or fall in AUM whether caused by changes in the market or through net flows.\nGross New Business Premium- \nRepresents the amount of premiums charged, before ceded reinsurance, for policies issued to customers who were not insured with the Company in the previous policy term. Gross new business premium plus gross renewal written premium less ceded reinsurance equals total written premium.\n55\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nLoss and Loss Adjustment Expense Ratio- \nA measure of the cost of claims incurred in the calendar year divided by earned premium and includes losses and loss adjustment expenses incurred for both the current and prior accident years. Among other factors, the loss and loss adjustment expense ratio needed for the Company to achieve its targeted return on equity (\"\nROE\n\") fluctuates from year to year based on changes in the expected investment yield over the claim settlement period, the timing of expected claim settlements and the targeted returns set by management based on the competitive environment.\nThe loss and loss adjustment expense ratio is affected by claim frequency and claim severity, particularly for shorter-tail property lines of business, where the emergence of claim frequency and severity is credible and likely indicative of ultimate losses. Claim frequency represents the percentage change in the average number of reported claims per unit of exposure in the current accident year compared to that of the previous accident year. Claim severity represents the percentage change in the estimated average cost per claim in the current accident year compared to that of the previous accident year. As one of the factors used to determine pricing, the Company’s practice is to first make an overall assumption about claim frequency and severity for a given line of business and then, as part of the rate-making process, adjust the assumption as appropriate for the particular state, product or coverage.\nUnderlying Loss and Loss Adjustment Expense Ratio- \nThis non-GAAP financial measure is the cost of non-catastrophe loss and loss adjustment expenses incurred in the current accident year divided by earned premiums. The loss and loss adjustment expense ratio is the most directly comparable U.S GAAP measure. Management believes that the underlying loss and loss adjustment expense ratio is a performance measure that is useful to investors as it removes the impact of volatile and unpredictable catastrophe losses and prior accident year development (\"PYD\"). A reconciliation of the loss and loss adjustment expense ratio to the underlying loss and loss adjustment expense ratio is set forth in the Reportable Segment and Corporate Operating Summaries section within MD&A.\nLoss Ratio, excluding Buyouts- \nUtilized for the Employee Benefits segment and is expressed as a ratio of benefits, losses and loss adjustment expenses, excluding those related to buyout premiums, to premiums and other considerations, excluding buyout premiums. Since Employee Benefits occasionally buys a block of claims for a stated premium amount, the Company excludes this buyout from the loss ratio used for evaluating the profitability of the business as buyouts may distort the loss ratio. Buyout premiums represent takeover of open claim liabilities and other non-recurring premium amounts.\nNet investment income excluding limited partnerships and other alternative investments-\n This non-GAAP measure is the amount of net investment income on a consolidated level earned from invested assets, excluding the net investment income related to limited partnerships and other alternative investments. The Company believes that net investment income excluding limited partnerships and other alternative investments, provides investors with an important measure of the trend in investment \nearnings because it excludes the impact of the volatility in returns related to limited partnerships and other alternative investments. Net investment income is the most directly comparable U.S. GAAP measure. A reconciliation of net investment income to net investment income excluding limited partnerships and other alternative investments - is set forth in the Investment Results section within MD&A.\nMutual Fund and Exchange-Traded Fund Assets- \nAre owned by the shareowners of those products and not by the Company and, therefore, are not reflected in the Company’s Condensed Consolidated Financial Statements, except in instances where the Company seeds new investment products. \nMutual fund and ETF assets are a measure used by the Company primarily because a significant portion of the Company’s Hartford Funds segment revenues and expenses are based upon asset values. These revenues and expenses increase or decrease with a rise or fall in AUM whether caused by changes in the market or through net flows.\nNet New Business Premium- \nRepresents the amount of premiums charged, after ceded reinsurance, for policies issued to customers who were not insured with the Company in the previous policy term. Net new business premium plus renewal written premium equals total written premium.\nPolicy Count Retention- \nFor small business, represents the number of renewal policies issued during the current year period divided by the new and renewal policies issued in the prior period. Policy count retention is affected by a number of factors, including the percentage of renewal policy quotes accepted and decisions by the Company to non-renew policies because of specific policy underwriting concerns or because of a decision to reduce premium writings in certain classes of business or states. Policy count retention is also affected by advertising and rate actions taken by us and competitors.\nEffective Policy Count Retention- \nFor Personal Insurance, represents the number of policies expected to renew in the current year period, based on contract effective dates, divided by the new and renewal policies effective in the prior period. Effective policy count retention is affected by a number of factors, including the percentage of renewal policy quotes accepted and decisions by the Company to non-renew policies because of specific policy underwriting concerns or because of a decision to reduce premium writings in certain classes of business or states. Effective policy count retention is also affected by advertising and rate actions taken by us and competitors, as well as the effect of subsequent cancellations and non-renewals by customers. Effective policy count retention statistics are subject to change from period to period based on the effect of differences between actual and expected policy cancellations throughout the policy period.\nPolicies in-force-\n Represents the number of policies with coverage in effect as of the end of the period. The number of policies in-force is a growth measure used for Personal Insurance, small business, and middle market lines within middle & large business and is affected by both new business growth and retention.\nPolicyholder Dividend Ratio-\n The ratio of policyholder dividends to earned premium.\n56\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nPremium Retention-\n For middle & large business, represents the ratio of prior period premiums that were successfully renewed divided by premiums associated with policies available for renewal in the current period. Premium retention excludes premium amounts from annual audits, renewal written price increases and changes in exposure, including amount of insurance. Premium retention statistics are subject to change from period to period based on a number of factors, including the effect of subsequent cancellations and non-renewals\n.\nPrior Accident Year Loss and Loss Adjustment Expense Ratio-\n Represents the increase (decrease) in the estimated cost of settling catastrophe and non-catastrophe claims incurred in prior accident years as recorded in the current calendar year divided by earned premiums.\nReinstatement Premiums-\n Represents additional ceded premium paid for the reinstatement of the amount of reinsurance coverage that was reduced as a result of the Company ceding losses to reinsurers.\nRenewal Earned Price Increase (Decrease)- \nWritten premiums are earned over the policy term, which is six months for certain personal automobile business and twelve months for substantially all of the remainder of the Company’s Property and Casualty (\"P&C\") business. Since the Company earns premiums over the six to twelve month term of the policies, renewal earned price increases (decreases) lag renewal written price increases (decreases) by six to twelve months.\nRenewal Written Price Increase (Decrease)- \nFor Business Insurance, represents the combined effect of rate changes, and individual risk pricing decisions per unit of exposure on policies that renewed and includes amount of insurance. For Personal Insurance, renewal written price increases represent the total change in premium per policy since the prior year on those policies that renewed and includes the combined effect of rate changes, amount of insurance and other changes in exposure. For Personal Insurance, other changes in exposure include, but are not limited to, the effect of changes in number of drivers, vehicles and incidents, as well as changes in customer policy elections, such as deductibles and limits. The rate component represents the change in rate impacting renewal policies as previously filed with and approved by state regulators during the period. Amount of insurance represents the change in the value of the rating base, such as model year/vehicle symbol for automobiles, building replacement costs for property and wage inflation for workers’ compensation. A number of factors affect renewal written price increases (decreases) including expected loss costs as projected by the Company’s pricing actuaries, rate filings approved by state regulators, risk selection decisions made by the Company’s underwriters and marketplace competition. Renewal written price changes reflect the property and casualty insurance market cycle. Prices tend to increase for a particular line of business when insurance carriers have incurred significant losses in that line of business in the recent past or the industry as a whole commits less of its capital to writing exposures in that line of business. Prices tend to decrease when recent loss experience has been favorable or when competition among insurance carriers increases. Renewal written price \nstatistics are subject to change from period to period, based on a number of factors, including changes in actuarial estimates and the effect of subsequent cancellations and non-renewals, and modifications made to better reflect ultimate pricing achieved.\nReturn on Assets (“ROA”), Core Earnings- \nThe Company uses this non-GAAP financial measure to evaluate, and believes is an important measure of, the Hartford Funds segment’s operating performance. ROA, core earnings is calculated by dividing annualized core earnings by a daily average AUM. ROA is the most directly comparable U.S. GAAP measure. The Company believes that ROA, core earnings, provides investors with a valuable measure of the performance of the Hartford Funds segment because it reveals trends in our business that may be obscured by the effect of items excluded in the calculation of core earnings. ROA, core earnings, should not be considered as a substitute for ROA and does not reflect the overall profitability of our Hartford Funds business. Therefore, the Company believes it is important for investors to evaluate both ROA, and ROA, core earnings when reviewing the Hartford Funds segment performance. A reconciliation of ROA to ROA, core earnings is set forth in the Results of Operations section within MD&A - Hartford Funds.\nUnderlying Combined Ratio- \nThis non-GAAP financial measure of underwriting results represents the combined ratio before catastrophes, prior accident year development and current accident year change in loss reserves upon acquisition of a business. Combined ratio is the most directly comparable U.S. GAAP measure. The Company believes this ratio is an important measure of the trend in profitability since it removes the impact of volatile and unpredictable catastrophe losses and prior accident year loss and loss adjustment expense reserve development. The changes to loss reserves upon acquisition of a business are excluded from underlying combined ratio because such changes could obscure the ability to compare results in periods after the acquisition to results of periods prior to the acquisition as such trends are valuable to our investors' ability to assess the Company's financial performance. \nA reconciliation of combined ratio to underlying combined ratio is set forth in the Results of Operations section within MD&A - Business Insurance and Personal Insurance.\nUnderwriting Gain (Loss)- \nThis non-GAAP financial measure is a before tax measure that represents earned premiums less incurred losses, loss adjustment expenses and underwriting expenses. Net income (loss) is the most directly comparable U.S. GAAP measure. The Hartford's management evaluates profitability of the Business and Personal Insurance segments primarily on the basis of underwriting gain or loss. Underwriting gain (loss) is influenced significantly by earned premium growth and the adequacy of The Hartford's pricing. Underwriting profitability over time is also greatly influenced by The Hartford's underwriting discipline, as management strives to manage exposure to loss through favorable risk selection and diversification, effective management of claims, use of reinsurance and its ability to manage its expenses. The Hartford believes that underwriting gain (loss) provides investors with a valuable measure of profitability, before tax, derived from underwriting activities, which are managed separately from the Company's investing activities.\n57\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nReconciliation of Net Income to Underwriting Gain (Loss)\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nBusiness Insurance\nNet income\n$\n710\n \n$\n528\n \n$\n1,883\n \n$\n1,641\n \nAdjustments to reconcile net income to underwriting gain:\nNet investment income\n(519)\n(442)\n(1,405)\n(1,235)\nNet realized losses\n26 \n32 \n70 \n70 \nOther (income) expense\n— \n1 \n2 \n4 \nIncome tax expense\n180 \n134 \n478 \n393 \nUnderwriting gain\n$\n397\n \n$\n253\n \n$\n1,028\n \n$\n873\n \nPersonal Insurance\nNet income\n$\n139\n \n$\n31\n \n$\n235\n \n$\n54\n \nAdjustments to reconcile net income to underwriting gain (loss):\nNet investment income\n(67)\n(58)\n(182)\n(158)\nNet realized losses\n4 \n2 \n10 \n9 \nNet servicing and other (income) expense\n(4)\n(5)\n(14)\n(15)\nIncome tax expense\n35 \n8 \n58 \n12 \nUnderwriting gain (loss) \n$\n107\n \n$\n(22)\n$\n107\n \n$\n(98)\nP&C Other Operations\nNet income\n$\n12\n \n$\n10\n \n$\n38\n \n$\n29\n \nAdjustments to reconcile net income to underwriting loss:\nNet investment income\n(19)\n(18)\n(56)\n(55)\nNet realized losses\n— \n— \n2 \n3 \nOther expense\n1 \n4 \n1 \n4 \nIncome tax expense\n4 \n1 \n9 \n5 \nUnderwriting loss\n$\n(2)\n$\n(3)\n$\n(6)\n$\n(14)\nWritten and Earned Premiums- \nWritten premium represents the amount of premiums charged for policies issued, net of reinsurance, during a fiscal period. Premiums are considered earned and are included in the financial results on a pro rata basis over the policy period. Management believes that written premium is a performance measure that is useful to investors as it reflects current trends in the Company’s sale of property and casualty insurance products. Written and earned premium are recorded net of ceded reinsurance premium.\nTraditional life and disability insurance type products, such as those sold by Employee Benefits, collect premiums from policyholders in exchange for financial protection for the policyholder from a specified insurable loss, such as death or disability. These premiums together with net investment income earned are used to pay the contractual obligations under these insurance contracts. Two major factors, sales and persistency, impact premium growth. Sales can increase or decrease in a given year based on a number of factors, including but not limited to, customer demand for the Company’s product offerings, pricing competition, distribution channels and the Company’s reputation and ratings. Persistency refers to the percentage of premium remaining in-force from year-to-year.\n58\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe Hartford's Operations \nThe Hartford conducts business principally in five reportable segments including Business Insurance, Personal Insurance, Property & Casualty Other Operations, Employee Benefits and Hartford Funds, as well as a Corporate category. The Company includes in the Corporate category capital raising activities (including equity financing, debt financing and related interest expense), purchase accounting adjustments related to goodwill, reserves for run-off structured settlement and terminal funding agreement liabilities, restructuring costs, transaction expenses incurred in connection with an acquisition, certain M&A costs, and other expenses not allocated to the reportable segments. Corporate also includes investment management fees and expenses related to managing third-party assets.\nThe Company derives its revenues principally from: (a) premiums earned for insurance coverage provided to insureds; (b) management fees on mutual fund and ETF assets; (c) net investment income; (d) fees earned for services provided to third parties; and (e) net realized gains and losses. Premiums charged for insurance coverage are earned principally on a pro rata basis over the terms of the related policies in-force.\nThe profitability of the Company's property and casualty insurance businesses over time is greatly influenced by the Company’s underwriting discipline, which seeks to manage exposure to loss through favorable risk selection and diversification, its management of claims, its use of reinsurance, the size of its in force block, making reliable estimates of actual mortality and morbidity, and its ability to manage its expense ratio which it accomplishes through economies of scale and its management of acquisition costs and other insurance operating costs. Pricing adequacy depends on a number of factors, including the ability to obtain regulatory approval for rate changes, proper evaluation of underwriting risks, the ability to project future loss cost frequency and severity based on historical loss experience adjusted for known trends, the Company’s response to rate actions taken by competitors, its expense levels and expectations about regulatory and legal developments. The Company seeks to price its insurance policies such that insurance premiums and future net investment income earned on premiums received will cover insurance operating costs and the ultimate cost of paying claims reported on the policies and provide for a profit margin. For many of its insurance products, the Company is required to obtain approval for its premium rates from state insurance departments and the Lloyd's Syndicate's ability to write business is subject to Lloyd's approval for its premium capacity each year. Most of Personal Insurance written premium is associated with our exclusive licensing agreement with AARP, which is effective through December 31, 2032. This agreement provides an important competitive advantage given the size of the 50 plus population and the strength of the AARP brand. \nSimilar to property and casualty, profitability of the Employee Benefits business depends, in large part, on the ability to evaluate and price risks appropriately and make reliable estimates of mortality, morbidity, disability and longevity. To manage the pricing risk, Employee Benefits generally offers term insurance policies, allowing for the adjustment of rates or policy terms in order to minimize the adverse effect of market trends, loss costs, declining interest rates and other factors. However, as policies are typically sold with rate guarantees an \naverage of three years, pricing for the Company’s products could prove to be inadequate if loss and expense trends emerge adversely during the rate guarantee period or if investment returns are lower than expected at the time the products were sold. For some of its products, the Company is required to obtain approval for its premium rates from state insurance departments. New and renewal business for employee benefits business, particularly for long-term disability (\"\nLTD\")\n, are priced using an assumption about expected investment yields over time. While the Company employs asset-liability duration matching strategies to mitigate risk and may use interest-rate sensitive derivatives to hedge its exposure in the Employee Benefits investment portfolio, cash flow patterns related to the payment of benefits and claims are uncertain and actual investment yields could differ significantly from expected investment yields, affecting profitability of the business. In addition to appropriately evaluating and pricing risks, the profitability of the Employee Benefits business depends on other factors, including the Company’s response to pricing decisions and other actions taken by competitors, its ability to offer voluntary products and self-service capabilities, the persistency of its sold business and its ability to manage its expenses which it seeks to achieve through economies of scale and operating efficiencies.\nThe financial results of the Company’s mutual fund and ETF businesses depend largely on the amount of AUM and the level of fees charged based, in part, on asset share class and fund type. Changes in AUM are driven by the two main factors of net flows and the market return of the funds, which are heavily influenced by the return realized in the equity and bond markets. Net flows are comprised of new sales less redemptions by mutual fund and ETF shareowners. Financial results are highly correlated to the growth in AUM since these funds generally earn fee income on a daily basis.\nThe investment return, or yield, on invested assets is an important element of the Company’s earnings since insurance products are priced with the assumption that premiums received can be invested for a period of time before benefits, losses and loss adjustment expenses are paid. Due to the need to maintain sufficient liquidity to satisfy claim obligations, the majority of the Company’s invested assets have been held in available-for-sale (\"AFS\") securities, including, among other asset classes, corporate bonds, municipal bonds, government debt, short-term debt, mortgage-backed securities, asset-backed securities (\"ABS\") and collateralized loan obligations (\"CLOs\"). The Company also invests in commercial mortgage loans as well as limited partnerships and other alternative investments, which are private investments that are less liquid, but have the potential to generate higher returns. The primary investment objective for the Company is to maximize economic value, consistent with acceptable risk parameters, including the management of credit risk and interest rate sensitivity of invested assets, while generating sufficient net of tax income to meet policyholder and corporate obligations. Investment strategies are developed based on a variety of factors including business needs, regulatory requirements and tax considerations.\n59\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThird Quarter Financial Highlights \nNet Income Available to Common Stockholders \nNet Income Available to Common Stockholders per Diluted Share\nBook Value per Diluted Share\n \n \n \nÝ\nIncreased $313 or 41%\nÝ\nIncreased $1.21 or 47%\nÝ\nIncreased $8.77 or 16%\n+\nLower CAY catastrophe losses\n+\nIncrease in net income available to common stockholders\n+\nNet income in excess of common stockholder dividends\n+\nHigher net investment income\n+\nReduction in outstanding shares due to share repurchases\n-\nDilutive effect of share repurchases\n+\nThe effect of higher earned premiums in P&C\n+\nMore favorable P&C prior accident year reserve development\n+\nLower underlying loss and LAE ratio in Personal Insurance\n-\nHigher expense ratio in P&C and Employee Benefits\n-\nHigher underlying loss and LAE ratio in Business Insurance\nInvestment Yield, After Tax\nProperty & Casualty Combined Ratio\nEmployee Benefits Net Income Margin\n \n \n \nÝ\nIncreased 40 bps\nÞ\nImproved 5.7 points\nÞ\nDecreased 0.7 points\n+\nHigher yield on limited partnerships and other alternative investments\n+\nLower CAY catastrophe losses\n-\nHigher expense ratio, including higher staffing and technology costs\n+\nReinvesting at higher interest rates\n+\nMore favorable prior accident year reserve development\n-\nHigher group disability loss ratio\n-\nLower yield on variable-rate securities\n+\nLower underlying loss and LAE ratio in Personal Insurance\n+\nLower group life loss ratio\n-\nHigher underlying loss and LAE ratio in Business Insurance\n+\nHigher net investment income\n60\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nConsolidated Results of Operations\nThe Consolidated Results of Operations should be read in conjunction with \nthe Company's Condensed Consolidated Financial Statements\n and the related \nNotes\n as well as with the \nReportable Segment and Corporate Operating Summaries \nwithin the MD&A.\nConsolidated Results of Operations\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nEarned premiums\n$\n6,093 \n$\n5,734 \n6\n%\n$\n17,889 \n$\n16,758 \n7\n%\nFee income\n361 \n347 \n4\n%\n1,049 \n1,019 \n3\n%\nNet investment income\n759 \n659 \n15\n%\n2,079 \n1,854 \n12\n%\nNet realized losses\n(12)\n(13)\n8\n%\n(71)\n(44)\n(61\n%)\nOther revenues\n31 \n24 \n29\n%\n83 \n69 \n20 \n%\nTotal revenues\n7,232\n \n6,751\n \n7\n%\n21,029\n \n19,656\n \n7\n%\nBenefits, losses and loss adjustment expenses\n3,793 \n3,823 \n(1\n%)\n11,505 \n11,095 \n4\n%\nAmortization of deferred policy acquisition costs\n639 \n585 \n9\n%\n1,871 \n1,691 \n11\n%\nInsurance operating costs and other expenses\n1,414 \n1,323 \n7\n%\n4,103 \n3,891 \n5\n%\nInterest expense\n50 \n49 \n2\n%\n150 \n149 \n1\n%\nAmortization of other intangible assets\n18 \n18 \n—\n%\n53 \n53 \n—\n%\nRestructuring and other costs\n— \n1 \n(100\n%)\n— \n2 \n(100)\n%\nTotal benefits, losses and expenses\n5,914\n \n5,799\n \n2\n%\n17,682\n \n16,881\n \n5\n%\nIncome before income taxes\n1,318\n \n952\n \n38\n%\n3,347\n \n2,775\n \n21\n%\nIncome tax expense\n238 \n185 \n29\n%\n642 \n517 \n24 \n%\nNet income\n1,080\n \n767\n \n41\n%\n2,705\n \n2,258\n \n20\n%\nPreferred stock dividends\n6 \n6 \n—\n%\n16 \n16 \n— \n%\nNet income available to common stockholders\n$\n1,074\n \n$\n761\n \n41\n%\n$\n2,689\n \n$\n2,242\n \n20\n \n%\nThree months ended September 30, 2025 compared to 2024 \nNet income available to common stockholders\n increased by $313, primarily driven by:\n•\nAn increase in P&C underwriting gain of $274, before tax, driven by lower CAY catastrophe losses, the effect of earned premium growth, a higher level of net favorable prior accident year reserve development, and a lower underlying loss and LAE ratio in Personal Insurance, partially offset by a higher underlying loss and LAE ratio in Business Insurance; and\n•\nHigher net investment income of $100, before tax, driven by higher income from limited partnerships and other alternative investments, the impact of higher invested assets, and reinvesting at higher interest rates, slightly offset by a lower yield on variable-rate securities.\nThese increases were partially offset by:\n•\nIn Employee Benefits, the impact of a higher expense ratio, including higher staffing and technology costs, and a higher long-term disability loss ratio, partially offset by a lower group life loss ratio and a lower loss ratio on the paid family and medical leave product.\nFor a discussion of the Company's operating results by segment, see MD&A - Reportable Segment And Corporate Operating Summaries.\n61\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nRevenue\nEarned Premiums\nEarned premiums\n increased by $359 or 6%, primarily due to:\n•\nAn increase in P&C reflecting a 9% increase in Business Insurance and a 7% increase in Personal Insurance.\n–\nContributing to the increase in Business Insurance was the effect of an increase in new business across most lines of business and earned pricing increases. \n–\nFor Personal Insurance, earned premium increased primarily due to the effect of earned pricing increases, partially offset by a decline in policies in-force.\n•\nEmployee Benefits earned premium was essentially flat, as an increase in exposure on existing accounts was offset by lower fully insured ongoing sales during the past year.\nFee income\n increased primarily due to a $14 increase in Hartford Funds driven by higher daily average assets resulting from an increase in equity market levels, partially offset by net outflows over the preceding twelve-month period.\nNet Investment Income\n[1]\nLimited partnerships and other alternative investments of $37 and $91 for the three months ended September 30, 2024 and 2025 respectively.\nNet investment income \nincreased due to higher income from limited partnerships and other alternative investments, the impact of higher invested assets, and reinvesting at higher interest rates, slightly offset by a lower yield on variable-rate securities.\nNet realized losses\n improved slightly, primarily due to:\n•\nFewer net losses on sales of fixed maturities in the 2025 period compared to the 2024 period; and\n•\nGains on transactional foreign currency revaluation in the 2025 period compared to losses in the 2024 period.\nThese increases were largely offset by:\n•\nImpairment of a real estate joint venture in the 2025 period;\n•\nLosses on equity derivatives in the 2025 period compared to gains in the 2024 period due to changes in equity market levels; and\n•\nGains on interest rate derivatives in the 2024 period.\nFor further discussion of investment results, see MD&A - Investment Results, Net Realized Gains and MD&A - Investment Results, Net Investment Income.\n62\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nBenefits, Losses and Expenses\nLosses and LAE Incurred for P&C\nBenefits, losses and loss adjustment expenses\n decreased $30 due to:\n•\nA decrease in Property & Casualty of $33, which was attributable to: \n–\nA decrease in CAY catastrophe losses of $177, before tax. Catastrophe losses in the 2025 period included losses from tornado, wind and hail events across several regions, but concentrated in the Mountain West and South regions. Catastrophe losses in the 2024 period included losses from hurricanes, including a loss of $104 from Hurricane Helene, and tropical storms primarily in the Southeast and South regions, and to a lesser extent, tornado, wind and hail events primarily in the Midwest, Northeast and Mountain West regions; and\n–\nA favorable change of $53, before tax, in P&C net prior accident year reserve development, with development in the 2025 period of $103, compared to $50 in the prior year period. Favorable prior year reserve development in the 2025 period was primarily driven by decreases in reserves related to workers' compensation and Personal Insurance automobile liability and physical damage. Favorable prior year reserve development in the 2024 period was primarily driven by decreases in reserves related to workers' compensation and Personal Insurance automobile physical damage, partially offset by increases in reserves for general liability and Business Insurance automobile liability. Also included within net prior accident year reserve development for the three months ended September 30, 2025 and 2024 was a benefit of $8 and $26, respectively, related to amortization of the Navigators ADC deferred gain, which has been fully amortized as of September 30, 2025. For further discussion, see Note 9 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Condensed Consolidated Financial Statements.\nPartially offset by:\n–\nAn increase in P&C CAY loss and LAE before catastrophes of $197, before tax, primarily due to the effect of higher earned premiums and a higher underlying loss and LAE ratio in Business Insurance, partially offset by a lower underlying loss and LAE ratio in Personal Insurance.\n \nLosses and LAE Incurred for Employee Benefits\n•\nA slight increase in Employee Benefits of $2, before tax, primarily driven by a higher long-term disability loss ratio \ndue to a benefit in the prior year related to an update to the long-term disability claim recovery rate assumptions\n, largely offset by a lower group life loss ratio driven by lower mortality and a lower loss ratio on the paid family and medical leave product.\nAmortization of deferred policy acquisition costs \nincreased from the prior year period primarily driven by Business Insurance, reflecting an increase in earned premiums across all lines of business.\nInsurance operating costs and other expenses\n increased due to:\n•\nHigher staffing costs, including higher incentive compensation and benefits costs;\n•\nHigher technology costs, including increased investment; and\n•\nAn increase in doubtful accounts expense partly due to higher business volume.\nIncome tax expense\n increased primarily due to an increase in income before tax, partially offset by a higher net tax benefit in the Corporate category. For further discussion of income taxes, see Note 12 - Income Taxes of Notes to Condensed Consolidated Financial Statements.\n63\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNine months ended September 30, 2025 compared to 2024 \nNet income available to common stockholders \nincreased by $447 primarily driven by:\n•\nA higher P&C underwriting gain of $368, before tax, driven by the effect of earned premium growth, a higher level of favorable prior accident year reserve development, and a lower underlying loss and LAE ratio in Personal Insurance, partially offset by a higher underlying loss and LAE ratio in Business Insurance and higher CAY catastrophe losses; and\n•\nHigher net investment income of $225, before tax, driven by a higher level of invested assets, reinvesting at higher interest rates, and higher income from limited partnerships and other alternative investments, partially offset by a lower yield on variable-rate securities;\nThese increases were partially offset by:\n•\nHigher net realized losses of $27, before tax; and\n•\nIn Employee Benefits, the impact of a higher expense ratio, including higher staffing costs and technology costs, and a higher long-term disability loss ratio, partially offset by a lower group life loss ratio, a lower loss ratio on the paid family and medical leave product, and the impact of slightly higher fully insured ongoing premiums.\nFor a discussion of the Company's operating results by segment, see MD&A - Reportable Segment And Corporate Operating Summaries.\nRevenue\nEarned Premiums\nEarned premiums\n increased by $1,131, or 7%, primarily due to:\n•\nAn increase in P&C reflecting a 9% increase in both Business Insurance and Personal Insurance.\n–\nContributing to the increase in Business Insurance was the effect of an increase in new business across most lines of business and earned pricing increases.\n–\nFor Personal Insurance, earned premium increased primarily due to the effect of earned pricing increases, partially offset by a decline in policies in-force.\n•\nA slight increase in Employee Benefits earned premium of 1%, including an increase in exposure on existing accounts and persistency in excess of 90%.\nFee income \nincreased, primarily due to a $27 increase in Hartford Funds driven by higher daily average assets resulting from an increase in equity market levels, partially offset by net outflows over the preceding twelve-month period.\nNet Investment Income\n[1]\nLimited partnerships and other alternative investments of $69 and $143 for the nine months ended September 30, 2024 and 2025, respectively.\nNet investment income\n increased due to the impact of a higher level of invested assets, reinvesting at higher interest rates, and higher income from limited partnerships and other alternative investments, partially offset by a lower yield on variable-rate securities.\n64\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNet realized losses \nincreased primarily due to:\n•\nLower appreciation in value of equity securities in the 2025 period compared to the 2024 period;\n•\nImpairment of a real estate joint venture in the 2025 period;\n•\nGains on interest rate derivatives in the 2024 period; and\n•\nGreater depreciation in value of fixed maturities, at fair value using the fair value option (“FVO securities”) in the 2025 period due to changes in credit spreads.\nThese increases were partially offset by fewer net losses on sales of fixed maturities.\nFor further discussion of investment results, see MD&A - Investment Results, Net Realized Gains and MD&A - Investment Results, Net Investment Income.\nBenefits, Losses and Expenses\nLosses and LAE Incurred for P&C\nBenefits, losses and loss adjustment expenses\n increased $410, due to:\n•\nAn increase in Property & Casualty of $411, which was attributable to:\n–\nAn increase in P&C CAY loss and LAE before catastrophes of $541, before tax, primarily due to the effect of higher earned premiums and a higher underlying loss and LAE ratio in Business Insurance, partially offset by a lower underlying loss and LAE ratio in Personal Insurance; and\n–\nAn increase in CAY catastrophe losses of $61, before tax. Catastrophe losses in the 2025 period included losses from tornado, wind and hail events across several regions, but concentrated in the South and Midwest regions as well as a loss of $305, net of reinsurance, from the January 2025 California Wildfire Event. Catastrophe losses in the 2024 period included losses from tornado, wind and hail events across several regions of the United States, as well as losses from hurricanes and tropical storms mainly in the Southeast and South regions, and, to a lesser extent, from winter storms, mainly in the Pacific, Northeast and South regions.\nLosses and LAE Incurred for Employee Benefits\nPartially offset by:\n–\nA favorable change of $191, before tax, in P&C net prior accident year reserve development, with favorable development in the 2025 period of $412, compared to $221 in the prior year period. Favorable prior year reserve development in the 2025 period was primarily driven by decreases in reserves related to workers' compensation, Personal Insurance automobile liability and physical damage, catastrophes, homeowners, commercial property, and bond. Favorable prior year reserve development in the 2024 period was primarily driven by decreases in reserves related to workers' compensation, catastrophes, bond, Personal Insurance automobile physical damage, homeowners, and Personal Insurance automobile liability, partially offset by increases in reserves for general liability, Business Insurance automobile liability, and assumed reinsurance. Also included within net prior accident year reserve development for the nine months ended September 30, 2025 and 2024 was a benefit of $64 and $87, respectively, related to amortization of the Navigators ADC deferred gain, which has been fully amortized as of September 30, 2025. For further discussion, see Note 9 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Condensed Consolidated Financial Statements.\n65\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\n•\nEmployee Benefits losses and LAE were flat as a lower group life loss ratio, reflecting reduced mortality, and improved results on the paid family and medical leave product due to pricing actions were offset by a higher long-term disability loss ratio. The increase in long-term disability was driven by a benefit in the prior year related to an update to the long-term disability claim recovery rate assumptions and slightly higher current-year loss trends.\nAmortization of deferred policy acquisition costs \nincreased from the prior year period primarily driven by Business Insurance, reflecting an increase in earned premiums across all lines of business.\nInsurance operating costs and other expenses\n increased due to:\n•\nHigher staffing costs, including higher incentive compensation and benefits costs, partly in response to increased business volume;\n•\nHigher technology costs, including increased investment;\n•\nAn increase in doubtful accounts expense partly due to higher business volume;\n•\nHigher direct marketing costs in Personal Insurance; and\n•\nHigher commissions and taxes, licenses and fees due to increased business volume in P&C and a slightly higher commission ratio in Employee Benefits due to mix of business.\nIncome tax expense\n increased primarily due to an increase in income before tax. For further discussion of income taxes, see Note 12 - Income Taxes of Notes to Condensed Consolidated Financial Statements.\nInvestment Results\nComposition of Invested Assets\nSeptember 30, 2025\nDecember 31, 2024\nAmount\nPercent\nAmount\nPercent\nFixed maturities, AFS, at fair value\n$\n45,203 \n72.2 \n%\n$\n42,567 \n71.9 \n%\nFVO securities\n191 \n0.3 \n%\n308 \n0.5 \n%\nEquity securities, at fair value\n570 \n0.9 \n%\n603 \n1.0 \n%\nMortgage loans (net of allowance for credit losses (\"ACL\") of $49 and $44)\n6,619 \n10.6 \n%\n6,396 \n10.8 \n%\nLimited partnerships and other alternative investments\n5,560 \n8.9 \n%\n5,042 \n8.5 \n%\nOther investments [1]\n206 \n0.3 \n%\n226 \n0.4 \n%\nShort-term investments\n4,219 \n6.8 \n%\n4,068 \n6.9 \n%\nTotal investments\n$\n62,568\n \n100.0\n \n%\n$\n59,210\n \n100.0\n \n%\n[1]\nPrimarily consists of equity fund investments, overseas deposits, consolidated investment funds, and derivative instruments which are carried at fair value.\nSeptember 30, 2025 compared to December 31, 2024\nTotal investments \nincreased primarily due to an increase in fixed maturities, AFS, at fair value and limited partnerships and other alternative investments.\nFixed maturities, AFS, at fair value \nincreased primarily due to net additions of corporate bonds and high-quality ABS, partially offset by net reductions to tax-exempt municipal bonds. The increase was also due to higher valuations as a result of lower interest rates and tighter credit spreads.\nLimited partnerships and other alternative investments \nincreased primarily driven by additional investments and higher valuations.\n66\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNet Investment Income\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\n(Before tax)\nAmount\nYield [1]\nAmount\nYield [1]\nAmount\nYield [1]\nAmount\nYield [1]\nFixed maturities [2]\n$\n603 \n4.8 \n%\n$\n570 \n4.7 \n%\n$\n1,761 \n4.7 \n%\n$\n1,633 \n4.6 \n%\nEquity securities\n4 \n3.8 \n%\n5 \n3.4 \n%\n13 \n3.7 \n%\n20 \n3.9 \n%\nMortgage loans\n76 \n4.6 \n%\n68 \n4.2 \n%\n218 \n4.5 \n%\n196 \n4.1 \n%\nLimited partnerships and other alternative investments\n91 \n6.7 \n%\n37 \n3.0 \n%\n143 \n3.7 \n%\n69 \n1.9 \n%\nOther [3]\n8 \n1 \n18 \n8 \nInvestment expense\n(23)\n(22)\n(74)\n(72)\nTotal net investment income\n759\n \n4.8\n \n%\n659\n \n4.4\n \n%\n2,079\n \n4.5\n \n%\n1,854\n \n4.2\n \n%\nAdjustment for net investment income from limited partnerships and other alternative investments\n(91)\n(0.2)\n%\n(37)\n0.1 \n%\n(143)\n— \n%\n(69)\n0.2 \n%\nTotal net investment income excluding limited partnerships and other alternative investments\n$\n668\n \n4.6\n \n%\n$\n622\n \n4.5\n \n%\n$\n1,936\n \n4.5\n \n%\n$\n1,785\n \n4.4\n \n%\n[1]\nYields calculated using annualized net investment income divided by the monthly average invested assets at amortized cost, as applicable, excluding derivatives book value.\n[2]\nIncludes net investment income on short-term investments.\n[3]\nPrimarily includes changes in fair value of certain equity fund investments and income from derivatives that qualify for hedge accounting and are used to hedge fixed maturities.\nThree and nine months ended September 30, 2025 compared to 2024\nTotal net investment income\n increased for the three month period primarily due to higher income from limited partnerships and other alternative investments, the impact of higher invested assets, and reinvesting at higher rates, partially offset by a lower yield on variable-rate securities. \nTotal net investment income for the nine month period increased primarily due to the impact of higher invested assets, reinvesting at higher interest rates, and higher income from limited partnerships and other alternative investments, partially offset by a lower yield on variable-rate securities.\nAnnualized net investment income yield, \nexcluding limited partnerships and other alternative investments, increased for both the three and nine month periods primarily due to the impact of reinvesting at higher rates, partially offset by a lower yield on variable-rate securities.\nAverage reinvestment rates,\n of fixed maturities and mortgage loans, excluding U.S. Treasury securities, for the three and nine months ended September 30, 2025, were 5.7% for both periods, which were above the average yield of sales and maturities of 5.2% and 4.9%, respectively. Average reinvestment rates, of fixed maturities and mortgage loans, excluding U.S. Treasury securities, for the three and nine months ended September 30, 2024, were 5.5% and 6.0%, respectively, which were above the average yield of sales and maturities of 4.4% and 4.7%, respectively.\nFor the 2025 calendar year, we expect the annualized net investment income yield, excluding limited partnerships and other alternative investments, to be slightly higher than the portfolio yield earned in 2024. The estimated impact on annualized net investment income yield is subject to variability including the impact of evolving market conditions.\n67\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNet Realized Gains (Losses)\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Before tax)\n2025\n2024\n2025\n2024\nGross gains on sales of fixed maturities\n$\n17 \n$\n12 \n$\n49 \n$\n23 \nGross losses on sales of fixed maturities\n(38)\n(62)\n(108)\n(148)\nEquity securities [1]\n27 \n27 \n52 \n76 \nNet credit losses on fixed maturities, AFS [2]\n— \n— \n2 \n(2)\nChange in ACL on mortgage loans [3]\n(6)\n— \n(6)\n3 \nOther, net [4]\n(12)\n10 \n(60)\n4 \nNet realized losses\n$\n(12)\n$\n(13)\n$\n(71)\n$\n(44)\n[1]\nThe change in net unrealized gains on equity securities still held as of September 30, 2025, and included in net realized gains were $28 and $45 for the three and nine months ended September 30, 2025, respectively. The change in net unrealized gains on equity securities still held as of September 30, 2024, and included in net realized gains were $27 and $71 for the three and nine months ended September 30, 2024, respectively.\n[2]\nSee Credit Losses on Fixed Maturities, AFS and Intent-to-Sell Impairments within the Enterprise Risk Management — Investment Portfolio Risk section of this MD&A.\n[3]\nSee ACL on Mortgage Loans within the Enterprise Risk Management — Investment Portfolio Risk section of this MD&A.\n[4]\nFor the three and nine months ended September 30, 2025, includes gains (losses) from transactional foreign currency revaluation of $7 and $(11), respectively, and losses on non-qualifying derivatives of $(5) and $(16), respectively. For the three and nine months ended September 30, 2024, includes losses from transactional foreign currency revaluation of $(11) and $(5), respectively, and gains on non-qualifying derivatives of $23 and $15, respectively.\nThree and nine months ended September 30, 2025\nGross gains and losses on sales \nwere primarily due to sales of corporate securities and tax-exempt municipals.\nEquity securities\n net gains were primarily driven by an increase in value due to higher equity market levels.\nOther, net\n losses for the three and nine month periods ended September 30, 2025, primarily included losses of $20 for both periods on a real estate joint venture impairment, and losses of $5 and $14, respectively, on equity derivatives driven by changes in equity market levels. Also included were gains of $7 and losses of $11, respectively, on transactional foreign currency revaluation, and gains of $7 and losses of $10, respectively, on FVO securities due to a decrease in value.\nThree and nine months ended September 30, 2024\nGross gains and losses on sales \nwere primarily due to sales of U.S. Treasuries, corporate securities, and tax-exempt municipals to fund purchases of higher-yielding investments.\nEquity securities \nnet gains were primarily driven by an increase in value due to higher equity market levels.\nOther, net \ngains for the three and nine month periods ended September 30, 2024, primarily included gains of $12 and $9, respectively, on interest rate derivatives driven by changes in interest rates, gains of $11 and $6 on equity derivatives driven by changes in equity market levels, and losses of $11 and $5, respectively, on transactional foreign currency revaluation.\n68\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nCritical Accounting Estimates \nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ, and in the past have differed, from those estimates.\nThe Company has identified the following estimates as critical in that they involve a higher degree of judgment and are subject to a significant degree of variability:\n•\nproperty and casualty insurance product reserves, net of reinsurance;\n•\ngroup LTD reserves, net of reinsurance;\n•\nevaluation of goodwill for impairment;\n•\nvaluation of investments and derivative instruments including evaluation of credit losses on fixed maturities, AFS and ACL on mortgage loans; and\n•\ncontingencies relating to corporate litigation and regulatory matters.\nIn developing these estimates, management makes subjective and complex judgments that are inherently uncertain and subject to material change as facts and circumstances develop. Although variability is inherent in these estimates, management believes the amounts provided are appropriate based upon the facts available upon compilation of the financial statements. Certain of these estimates are particularly sensitive to market conditions, and deterioration and/or volatility in the worldwide debt or equity markets could have a material impact on the Condensed Consolidated Financial Statements.\nThe Company’s critical accounting estimates are discussed in Part II, Item 7 MD&A in the Company’s 2024 Form 10-K Annual Report. In addition, - Note 1 - Basis of Presentation and Significant Accounting Policies of Notes to Consolidated Financial Statements included in the Company's 2024 Form 10-K Annual Report should be read in conjunction with this section to assist with obtaining an understanding of the underlying accounting policies related to these estimates. The following discussion updates certain of the Company’s critical accounting estimates as of September 30, 2025.\nProperty & Casualty Insurance Product Reserves, Net of Reinsurance\nP&C Loss and Loss Adjustment Expense Reserves, Net of Reinsurance, by Segment as of \nSeptember 30, 2025\nBased on the results of the quarterly reserve review process, the Company determines the appropriate reserve adjustments, if any, to record. Recorded reserve estimates represent the Company's best estimate of the ultimate settlement amount of unpaid losses and loss adjustment expenses. The Company does not use statistical loss distributions or confidence levels in the process of determining its reserve estimate and, as a result, does not disclose reserve ranges. Assumptions used in arriving at the selected actuarial indications consider a number of factors, including the immaturity of emerged claims in recent accident years, emerging trends in the recent past, and the level of volatility within each line of business. In general, adjustments are made more quickly to more mature accident years and less volatile lines of business. Such adjustments of reserves are referred to as “prior accident year development”. Increases in previous estimates of ultimate loss costs are referred to as either an increase in prior accident year reserves or as unfavorable reserve development. Decreases in previous estimates of ultimate loss costs are referred to as either a decrease in prior accident year reserves or as favorable reserve development. Reserve development can influence the comparability of year over year underwriting results and is set forth in the paragraphs and tables that follow.\n69\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nRollforward of Property and Casualty Insurance Product Liabilities for Unpaid Losses and LAE for the Nine Months Ended September 30, 2025\nBusiness Insurance\nPersonal \nInsurance\nProperty & Casualty Other Operations\nTotal Property & Casualty\nBeginning liabilities for unpaid losses and loss adjustment expenses, gross\n$\n31,380\n \n$\n2,240\n \n$\n2,784\n \n$\n36,404\n \nReinsurance and other recoverables\n4,637 \n20 \n2,096 \n6,753 \nBeginning liabilities for unpaid losses and loss adjustment expenses, net\n26,743\n \n2,220\n \n688\n \n29,651\n \nProvision for unpaid losses and loss adjustment expenses\nCurrent accident year before catastrophes\n5,894 \n1,758 \n— \n7,652 \nCurrent accident year catastrophes\n433 \n316 \n— \n749 \nPrior accident year development \n(289)\n(123)\n— \n(412)\nTotal provision for unpaid losses and loss adjustment expenses\n6,038\n \n1,951\n \n—\n \n7,989\n \nChange in deferred gain on retroactive reinsurance included in other liabilities \n64 \n— \n— \n64 \nPayments\n(4,588)\n(1,859)\n(177)\n(6,624)\nForeign currency adjustment\n32 \n— \n— \n32 \nEnding liabilities for unpaid losses and loss adjustment expenses, net\n28,289\n \n2,312\n \n511\n \n31,112\n \nReinsurance and other recoverables\n4,526 \n44 \n2,057 \n6,627 \nEnding liabilities for unpaid losses and loss adjustment expenses, gross\n$\n32,815\n \n$\n2,356\n \n$\n2,568\n \n$\n37,739\n \nEarned premiums and fee income\n$\n10,321 \n$\n2,804 \nLoss and loss adjustment expense paid ratio [1]\n44.5 \n66.3 \nLoss and loss adjustment expense ratio\n58.7 \n70.2 \nPrior accident year development (pts) [2]\n(2.8)\n(4.4)\n[1]\nThe “loss and loss adjustment expense paid ratio” represents the ratio of paid losses and loss adjustment expenses to earned premiums and fee income.\n[2]\n“Prior accident year development (pts)” represents the ratio of prior accident year development to earned premiums.\nCurrent Accident Year Catastrophe Losses, Net of Reinsurance\nThree Months Ended September 30, 2025\nNine Months Ended September 30, 2025\nBusiness Insurance\nPersonal \nInsurance\nTotal\nBusiness Insurance\nPersonal \nInsurance\nTotal [1]\nWind and hail\n$\n32 \n$\n36 \n$\n68 \n$\n177 \n$\n198 \n$\n375 \nWildfires [1]\n(3)\n(5)\n(8)\n142 \n109 \n251 \nWinter storms\n(2)\n— \n(2)\n13 \n9 \n22 \nCatastrophes before assumed reinsurance\n27\n \n31\n \n58\n \n332\n \n316\n \n648\n \nGlobal assumed reinsurance business [1] [2]\n12 \n— \n12 \n101 \n— \n101 \nTotal catastrophe losses\n$\n39\n \n$\n31\n \n$\n70\n \n$\n433\n \n$\n316\n \n$\n749\n \n[1]\nThe three months ended September 30, 2025, included a favorable change in losses of $(8), net of reinsurance, from the January 2025 California Wildfire Event. For the nine months ended September 30, 2025, catastrophe losses from the \nJanuary 2025 California Wildfire Event were $305, net of reinsurance, and included losses of $54 in the global assumed reinsurance business.\n[2]\nCatastrophe losses incurred on global assumed reinsurance business are not covered under the Company's per occurrence and aggregate property catastrophe treaties. For further information on the treaty, refer to Enterprise Risk Management — Insurance Risk section of this MD&A.\n70\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nUnfavorable (Favorable) Prior Accident Year Development for the\nThree Months Ended September 30, 2025\n \nBusiness Insurance\nPersonal \nInsurance\nProperty & Casualty Other Operations\nTotal Property & Casualty Insurance\nWorkers’ compensation\n$\n(62)\n$\n— \n$\n— \n$\n(62)\nWorkers’ compensation discount accretion\n11 \n— \n— \n11 \nGeneral liability\n— \n— \n— \n— \nMarine\n— \n— \n— \n— \nPackage business\n— \n— \n— \n— \nCommercial property\n(5)\n— \n— \n(5)\nProfessional liability\n— \n— \n— \n— \nBond\n— \n— \n— \n— \nAssumed reinsurance\n— \n— \n— \n— \nAutomobile liability\n— \n(33)\n— \n(33)\nHomeowners\n— \n(5)\n— \n(5)\nNet asbestos and environmental (\"A&E\") reserves\n— \n— \n— \n— \nCatastrophes\n— \n— \n— \n— \nUncollectible reinsurance\n— \n— \n6 \n6 \nOther reserve re-estimates, net [1]\n4 \n(5)\n(6)\n(7)\nPrior accident year development before change in deferred gain\n(52)\n(43)\n—\n \n(95)\nChange in deferred gain on retroactive reinsurance included in other liabilities [2]\n(8)\n— \n— \n(8)\nTotal prior accident year development\n$\n(60)\n$\n(43)\n$\n—\n \n$\n(103)\n[1]\nOther reserve re-estimates, net for the three months ended September 30, 2025 includes a favorable change of $(6) in personal automobile physical damage reserves. \n[2]\nThe $8 change in deferred gain on retroactive reinsurance for the three months ended September 30, 2025 is related to amortization of the Navigators ADC deferred gain under retroactive reinsurance accounting.\nUnfavorable (Favorable) Prior Accident Year Development for the\nNine Months Ended September 30, 2025\nBusiness Insurance\nPersonal \nInsurance\nProperty & Casualty Other Operations\nTotal Property & Casualty Insurance\nWorkers’ compensation\n$\n(188)\n$\n— \n$\n— \n$\n(188)\nWorkers’ compensation discount accretion\n34 \n— \n— \n34 \nGeneral liability\n— \n— \n— \n— \nMarine\n— \n— \n— \n— \nPackage business\n— \n— \n— \n— \nCommercial property\n(28)\n— \n— \n(28)\nProfessional liability\n(11)\n— \n— \n(11)\nBond\n(22)\n— \n— \n(22)\nAssumed reinsurance\n— \n— \n— \n— \nAutomobile liability\n— \n(55)\n— \n(55)\nHomeowners\n— \n(36)\n— \n(36)\nNet A&E reserves\n— \n— \n— \n— \nCatastrophes\n(28)\n(11)\n— \n(39)\nUncollectible reinsurance\n— \n— \n6 \n6 \nOther reserve re-estimates, net [1]\n18 \n(21)\n(6)\n(9)\nPrior accident year development before change in deferred gain\n(225)\n(123)\n—\n \n(348)\nChange in deferred gain on retroactive reinsurance included in other liabilities [2]\n(64)\n— \n— \n(64)\nTotal prior accident year development\n$\n(289)\n$\n(123)\n$\n—\n \n$\n(412)\n[1]\nOther reserve re-estimates, net for the nine months ended September 30, 2025 includes a favorable change of $(26) in personal automobile physical damage reserves. \n[2]\nThe $64 change in deferred gain on retroactive reinsurance for the nine months ended September 30, 2025 is related to amortization of the Navigators ADC deferred gain under retroactive reinsurance accounting.\n71\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nFor discussion of the factors contributing to unfavorable (favorable) prior accident year reserve development for 2025, please refer to Note 9 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Condensed Consolidated Financial Statements. \nRollforward of Property and Casualty Insurance Product Liabilities for Unpaid Losses and LAE for the Nine Months Ended September 30, 2024\n \nBusiness Insurance\nPersonal \nInsurance\nProperty & Casualty Other Operations\nTotal Property & Casualty Insurance\nBeginning liabilities for unpaid losses and loss adjustment expenses, gross\n$\n29,181\n \n$\n2,068\n \n$\n2,795\n \n$\n34,044\n \nReinsurance and other recoverables\n4,599 \n28 \n2,069 \n6,696 \nBeginning liabilities for unpaid losses and loss adjustment expenses, net\n24,582\n \n2,040\n \n726\n \n27,348\n \nProvision for unpaid losses and loss adjustment expenses\nCurrent accident year before catastrophes\n5,337 \n1,774 \n— \n7,111 \nCurrent accident year catastrophes \n419 \n269 \n— \n688 \nPrior accident year development\n(173)\n(55)\n7 \n(221)\nTotal provision for unpaid losses and loss adjustment expenses\n5,583\n \n1,988\n \n7\n \n7,578\n \nChange in deferred gain on retroactive reinsurance included in other liabilities\n87 \n— \n— \n87 \nPayments\n(4,038)\n(1,760)\n(132)\n(5,930)\nForeign currency adjustment\n(9)\n— \n— \n(9)\nEnding liabilities for unpaid losses and loss adjustment expenses, net\n26,223\n \n2,268\n \n601\n \n29,092\n \nReinsurance and other recoverables\n4,562 \n27 \n2,014 \n6,603 \nEnding liabilities for unpaid losses and loss adjustment expenses, gross\n$\n30,785\n \n$\n2,295\n \n$\n2,615\n \n$\n35,695\n \nEarned premiums and fee income\n$\n9,451 \n$\n2,571 \nLoss and loss adjustment expense paid ratio [1]\n42.7 \n68.5 \nLoss and loss adjustment expense ratio\n59.3 \n78.1 \nPrior accident year development (pts) [2]\n(1.8)\n(2.2)\n[1]\nThe “loss and loss adjustment expense paid ratio” represents the ratio of paid losses and loss adjustment expenses to earned premiums and fee income.\n[2]\n“Prior accident year development (pts)” represents the ratio of prior accident year development to earned premiums.\nCurrent Accident Year Catastrophe Losses, Net of Reinsurance\nThree Months Ended September 30, 2024\nNine Months Ended September 30, 2024\nBusiness Insurance\nPersonal \nInsurance\nTotal\nBusiness Insurance\nPersonal \nInsurance\nTotal\nWind and hail \n$\n40 \n$\n32 \n$\n72 \n$\n212 \n$\n185 \n$\n397 \nWinter storms\n(3)\n(1)\n(4)\n52 \n13 \n65 \nHurricanes and tropical storms [1]\n100 \n61 \n161 \n100 \n61 \n161 \nWildfires\n— \n— \n— \n1 \n10 \n11 \nOther international\n(3)\n— \n(3)\n1 \n— \n1 \nCatastrophes before assumed reinsurance\n134\n \n92\n \n226\n \n366\n \n269\n \n635\n \nGlobal assumed reinsurance business [1] [2]\n21 \n— \n21 \n53 \n— \n53 \nTotal catastrophe losses\n$\n155\n \n$\n92\n \n$\n247\n \n$\n419\n \n$\n269\n \n$\n688\n \n[1]\nFor the three and nine months ended September 30, 2024, included losses from Hurricane Helene of $104, net of reinsurance, with $8 of the losses in the global assumed reinsurance business.\n[2]\nCatastrophe losses incurred on global assumed reinsurance business are not covered under the Company's aggregate property catastrophe treaty. For further information on the treaty, refer to Enterprise Risk Management — Insurance Risk section of this MD&A.\n72\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nUnfavorable (Favorable) Prior Accident Year Development for the\nThree Months Ended September 30, 2024\n \nBusiness Insurance\nPersonal \nInsurance\nProperty & Casualty Other Operations\nTotal Property & Casualty Insurance\nWorkers’ compensation\n$\n(69)\n$\n— \n$\n— \n$\n(69)\nWorkers’ compensation discount accretion\n11 \n— \n— \n11 \nGeneral liability\n32 \n— \n— \n32 \nMarine\n— \n— \n— \n— \nPackage business\n(5)\n— \n— \n(5)\nCommercial property\n(2)\n— \n— \n(2)\nProfessional liability\n— \n— \n— \n— \nBond\n— \n— \n— \n— \nAssumed reinsurance\n— \n— \n— \n— \nAutomobile liability\n16 \n— \n— \n16 \nHomeowners\n— \n(5)\n— \n(5)\nNet A&E reserves\n— \n— \n— \n— \nCatastrophes\n— \n— \n— \n— \nUncollectible reinsurance\n— \n— \n— \n— \nOther reserve re-estimates, net [1]\n7 \n(9)\n— \n(2)\nPrior accident year development before change in deferred gain\n(10)\n(14)\n—\n \n(24)\nChange in deferred gain on retroactive reinsurance included in other liabilities [2]\n(26)\n— \n— \n(26)\nTotal prior accident year development\n$\n(36)\n$\n(14)\n$\n—\n \n$\n(50)\n[1]\nOther reserve re-estimates, net for the three months ended September 30, 2024 includes a favorable change of $(10) in personal automobile physical damage reserves. \n[2]\nThe $26 change in deferred gain on retroactive reinsurance for the three months ended September 30, 2024, is related to amortization of the Navigators ADC deferred gain under retroactive reinsurance accounting.\n73\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nUnfavorable (Favorable) Prior Accident Year Development for the\nNine Months Ended September 30, 2024\n \nBusiness Insurance\nPersonal \nInsurance\nProperty & Casualty Other Operations\nTotal Property & Casualty Insurance\nWorkers’ compensation\n$\n(188)\n$\n— \n$\n— \n$\n(188)\nWorkers’ compensation discount accretion\n34 \n— \n— \n34 \nGeneral liability\n81 \n— \n— \n81 \nMarine\n(1)\n— \n— \n(1)\nPackage business\n(6)\n— \n— \n(6)\nCommercial property\n(7)\n— \n— \n(7)\nProfessional liability\n(7)\n— \n— \n(7)\nBond\n(22)\n— \n— \n(22)\nAssumed reinsurance\n24 \n— \n— \n24 \nAutomobile liability\n26 \n(13)\n— \n13 \nHomeowners\n— \n(15)\n— \n(15)\nNet A&E reserves\n— \n— \n— \n— \nCatastrophes\n(33)\n(5)\n— \n(38)\nUncollectible reinsurance\n(7)\n— \n7 \n— \nOther reserve re-estimates, net [1]\n20 \n(22)\n— \n(2)\nPrior accident year development before change in deferred gain\n(86)\n(55)\n7\n \n(134)\nChange in deferred gain on retroactive reinsurance included in other liabilities [1]\n(87)\n— \n— \n(87)\nTotal prior accident year development\n$\n(173)\n$\n(55)\n$\n7\n \n$\n(221)\n[1]\nOther reserve re-estimates, net for the nine months ended September 30, 2024 includes a favorable change of $(24) in personal automobile physical damage reserves. \n[2]\nThe $87 change in deferred gain on retroactive reinsurance for the nine months ended September 30, 2024 is related to amortization of the Navigators ADC deferred gain under retroactive reinsurance accounting. \nFor discussion of the factors contributing to unfavorable (favorable) prior accident year reserve development for 2024, please refer to Note 9 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Condensed Consolidated Financial Statements. \n74\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nReportable Segment And Corporate Operating Summaries\nBusiness Insurance - Results of Operations\nUnderwriting Summary\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nWritten premiums\n$\n3,573 \n$\n3,275 \n9\n%\n$\n11,075 \n$\n10,177 \n9 \n%\nChange in unearned premium reserve\n33 \n26 \n27\n%\n787 \n759 \n4 \n%\nEarned premiums\n3,540 \n3,249 \n9\n%\n10,288 \n9,418 \n9 \n%\nFee income\n11 \n11 \n—\n%\n33 \n33 \n— \n%\nLosses and loss adjustment expenses\nCurrent accident year before catastrophes\n2,051 \n1,862 \n10\n%\n5,894 \n5,337 \n10 \n%\nCurrent accident year catastrophes [1]\n39 \n155 \n(75\n%)\n433 \n419 \n3 \n%\nPrior accident year development [1]\n(60)\n(36)\n(67\n%)\n(289)\n(173)\n(67)\n%\nTotal losses and loss adjustment expenses\n2,030 \n1,981 \n2\n%\n6,038 \n5,583 \n8 \n%\nAmortization of DAC\n559 \n512 \n9\n%\n1,636 \n1,477 \n11 \n%\nInsurance operating costs\n546 \n497 \n10\n%\n1,565 \n1,468 \n7 \n%\nAmortization of other intangible assets\n7 \n7 \n—\n%\n21 \n21 \n— \n%\nDividends to policyholders\n12 \n10 \n20\n%\n33 \n29 \n14 \n%\nUnderwriting gain\n397\n \n253\n \n57\n%\n1,028\n \n873\n \n18\n \n%\nNet investment income [2]\n519 \n442 \n17\n%\n1,405 \n1,235 \n14 \n%\nNet realized losses [2]\n(26)\n(32)\n19\n%\n(70)\n(70)\n— \n%\nOther income (expense) [3]\n— \n(1)\n100\n%\n(2)\n(4)\n50 \n%\n Income before income taxes\n890\n \n662\n \n34\n%\n2,361\n \n2,034\n \n16\n \n%\n Income tax expense [4]\n180 \n134 \n34\n%\n478 \n393 \n22 \n%\nNet income\n$\n710\n \n$\n528\n \n34\n%\n$\n1,883\n \n$\n1,641\n \n15\n \n%\n[1]\nFor additional information on current accident year catastrophes and prior accident year development, see MD&A - Critical Accounting Estimates, Property and Casualty Insurance Product Reserves Development, Net of Reinsurance and Note 9 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Condensed Consolidated Financial Statements. \n[2]\nFor discussion of consolidated investment results, see MD&A - Investment Results.\n[3]\nIncludes integration costs in connection with the 2019 acquisition of Navigators Group.\n[4]\nFor discussion of income taxes, see Note 12 - Income Taxes of Notes to Condensed Consolidated Financial Statements.\n75\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nPremium Measures\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nSmall Business:\nNet new business premium\n$\n308 \n$\n278 \n$\n911 \n$\n837 \nPolicy count retention\n84 \n%\n84 \n%\n84 \n%\n84 \n%\nRenewal written price increases\n5.2 \n%\n6.5 \n%\n5.9 \n%\n6.2 \n%\nRenewal earned price increases\n7.4 \n%\n6.5 \n%\n7.4 \n%\n5.9 \n%\nPolicies in-force as of end of period (in thousands)\n1,640 \n1,558 \nMiddle Market [1]:\nNet new business premium\n$\n211 \n$\n176 \n$\n589 \n$\n537 \nPremium retention\n84 \n%\n85 \n%\n82 \n%\n84 \n%\nRenewal written price increases \n5.6 \n%\n6.7 \n%\n6.4 \n%\n6.8 \n%\nRenewal earned price increases\n6.9 \n%\n7.4 \n%\n7.1 \n%\n7.5 \n%\nGlobal Specialty:\nGlobal specialty gross new business premium [2]\n$\n238 \n$\n233 \n$\n741 \n$\n720 \nRenewal written price increases [3]\n4.3 \n%\n5.5 \n%\n5.1 \n%\n6.0 \n%\nRenewal earned price increases [3]\n6.0 \n%\n6.3 \n%\n6.3 \n%\n5.9 \n%\n[1]\nExcept for net new business premium, metrics for middle market exclude loss sensitive and programs businesses.\n[2]\nExcludes Global Re and is before ceded reinsurance. \n[3]\nExcludes Global Re, offshore energy policies, credit and political risk insurance (\"CPRI\") policies\n, \npolitical violence and terrorism (\"PV&T\") policies, and any business under which the managing agent of our Lloyd's Syndicate delegates underwriting authority to coverholders and other third parties.\nUnderwriting Ratios\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nLoss and loss adjustment expense ratio\n57.3 \n61.0 \n(3.7)\n58.7 \n59.3 \n(0.6)\nExpense ratio\n31.1 \n30.9 \n0.2 \n31.0 \n31.2 \n(0.2)\nPolicyholder dividend ratio\n0.3 \n0.3 \n— \n0.3 \n0.3 \n— \nCombined ratio\n88.8\n \n92.2\n \n(3.4)\n90.0\n \n90.7\n \n(0.7)\nAdjustments to reconcile combined ratio to underlying combined ratio:\nCurrent accident year catastrophes and prior accident year development\n0.6 \n(3.7)\n4.3 \n(1.4)\n(2.6)\n1.2 \nUnderlying combined ratio\n89.4\n \n88.6\n \n0.8\n \n88.6\n \n88.1\n \n0.5\n \nUnderlying loss and loss adjustment expense ratio\n57.9 \n57.3 \n0.6 \n57.3 \n56.7 \n0.6 \nCurrent accident year catastrophes\n1.1 \n4.8 \n(3.7)\n4.2 \n4.4 \n(0.2)\nPrior accident year development\n(1.7)\n(1.1)\n(0.6)\n(2.8)\n(1.8)\n(1.0)\nTotal loss and loss adjustment expense ratio\n57.3\n \n61.0\n \n(3.7)\n58.7\n \n59.3\n \n(0.6)\nLoss and loss adjustment expense ratio\n57.3\n \n61.0\n \n(3.7)\n58.7\n \n59.3\n \n(0.6)\nAdjustments to reconcile loss and loss adjustment expense ratio to underlying loss and loss adjustment expense ratio:\nCurrent accident year catastrophes and prior accident year development\n0.6 \n(3.7)\n4.3 \n(1.4)\n(2.6)\n1.2 \nUnderlying loss and loss adjustment expense ratio\n57.9\n \n57.3\n \n0.6\n \n57.3\n \n56.7\n \n0.6\n \n76\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNet Income \nThree and nine months ended September 30, 2025 compared to 2024 \nNet income\n for the three and nine month periods increased primarily due to a higher underwriting gain and higher net investment income. For further discussion of investment results, see MD&A - Investment Results.\nUnderwriting Gain\nThree and nine months ended September 30, 2025 compared to 2024 \nUnderwriting gain\n for the three and nine month periods  increased due to the effect of earned premium growth, higher favorable prior accident year development, and for the three month period, lower CAY catastrophe losses. These favorable impacts were partially offset by a higher underlying loss and LAE ratio, and for the nine month period, higher CAY catastrophe losses.\nExpense ratio\n for the three months ended September 30, 2025 increased primarily due to higher staffing costs, including higher incentive compensation and benefits costs, and technology spend, partially offset by the impact of higher earned premium. The expense ratio for the nine months ended September 30, 2025 decreased primarily due to the impact of higher earned premium, partially offset by higher staffing costs, including higher incentive compensation and benefits costs, and technology spend\n.\n77\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\n Earned Premiums\n[1]\nOther earned premiums of $14 and $16 for the three months ended September 30, 2024, and 2025, respectively and $43 and $48, for the nine months ended September 30, 2024 and 2025, respectively.\n Written Premiums\n[1]\nOther written premiums of $14 and $16 for the three months ended September 30, 2024, and 2025, respectively and $42 and $48, for the nine months ended September 30, 2024 and 2025, respectively.\nThree and nine months ended September 30, 2025 compared to 2024 \nEarned premiums\n for the three and nine months ended September 30, 2025 increased due to written premium increases over the prior twelve months.\nWritten premiums \nfor the three and nine months ended September 30, 2025 increased driven by growth across small business, middle & large business and global specialty.\n•\nSmall business written premium increased driven by strong new business as well as renewal written price increases in almost all lines. Written premium grew across all lines of business.\n•\nMiddle & large business written premium increased driven by strong new business as well as renewal written price increases in all lines. Written premium rose across general industries, industry verticals and the large and complex lines.\n•\nGlobal specialty written premium, excluding global reinsurance, increased driven by written price increases across most lines as well as an increase in gross new business. Written premiums grew in global reinsurance, primarily in credit risk and casualty lines.\nRenewal written price\n increases were recognized in most lines for both the three and nine months ended September 30, 2025.\n•\nIn small business, renewal written price increases were lower than prior year levels overall, with mid single-digit to low double-digit price increases across most lines. Workers' compensation pricing was flat.\n•\nIn middle market, renewal written price increases were lower than prior year levels overall, with mid single-digit to low double-digit price increases in most lines. Workers' compensation pricing was slightly positive.\n•\nIn global specialty, renewal written price increases were lower than prior year levels with mid single-digit price increases overall. \n78\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nUnderlying Loss and Loss Adjustment Expense Ratio \nThree and nine months ended September 30, 2025 compared to 2024\nUnderlying Loss and Loss Adjustment Expense Ratio\n for the three and nine months ended September 30, 2025 increased primarily due to workers' compensation margin compression.\nCatastrophes and Unfavorable (Favorable) Prior Accident Year Development\nThree and nine months ended September 30, 2025 compared to 2024\nCurrent accident year catastrophe losses\n decreased for the three month period and increased for the nine month period. CAY catastrophe losses for the three months ended September 30, 2025 included losses from tornado, wind and hail events across several regions, but concentrated in the Mountain West and South regions. CAY catastrophe losses for the nine months ended September 30, 2025 included losses from tornado, wind and hail events across several regions, but concentrated in the South and Midwest regions, as well as a loss of $196 from the January 2025 California Wildfire Event.\nCurrent accident year catastrophe losses for the three months ended September 30, 2024 included losses from hurricanes, including a loss of $55 from Hurricane Helene, and tropical storms primarily in the Southeast and South regions and, to a lesser extent, tornado, wind and hail events primarily in the Midwest and Northeast regions. Current accident year catastrophe losses for the nine months ended September 30, 2024 included losses from tornado, wind and hail events across several regions of the United States, hurricanes and tropical storms primarily in the Southeast and South regions and, to a lesser extent, winter storms mainly in the Pacific, Northeast and South regions.\nPrior accident year development\n was net favorable for the three and nine months ended September 30, 2025, and primarily included reserve decreases for workers' compensation, commercial property and, for the nine month period, catastrophes and bond. Also included are benefits of $8 and $64 related to amortization of the Navigators ADC deferred gain for the three and nine month periods, respectively. As of September 30, 2025, the deferred gain on the Navigators ADC has been fully amortized. For additional information regarding the ADC reinsurance agreement, refer to Note 9 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Condensed Consolidated Financial Statements.\n79\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nPrior accident year development was net favorable for the three and nine months ended September 30, 2024 and included reserve decreases for workers' compensation and, for the nine month period, catastrophes and bond, partially offset by reserve increases for general liability, automobile liability and, for the \nnine month period, assumed reinsurance. Also included are benefits of $26 and $87 related to amortization of the Navigators ADC deferred gain for the three and nine month periods, respectively. \nPersonal Insurance - Results of Operations\nUnderwriting Summary\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nWritten premiums\n$\n987 \n$\n970 \n2\n%\n$\n2,880 \n$\n2,727 \n6 \n%\nChange in unearned premium reserve\n37 \n85 \n(56\n%)\n100 \n180 \n(44)\n%\nEarned premiums\n950 \n885 \n7\n%\n2,780 \n2,547 \n9 \n%\nFee income\n8 \n8 \n—\n%\n24 \n24 \n— \n%\nLosses and loss adjustment expenses\nCurrent accident year before catastrophes\n610 \n602 \n1\n%\n1,758 \n1,774 \n(1)\n%\nCurrent accident year catastrophes [1]\n31 \n92 \n(66\n%)\n316 \n269 \n17 \n%\nPrior accident year development [1]\n(43)\n(14)\nNM\n(123)\n(55)\n(124)\n%\nTotal losses and loss adjustment expenses\n598 \n680 \n(12\n%)\n1,951 \n1,988 \n(2)\n%\nAmortization of DAC\n72 \n65 \n11\n%\n210 \n188 \n12 \n%\nInsurance operating costs\n180 \n169 \n7\n%\n534 \n491 \n9 \n%\nAmortization of other intangible assets\n1 \n1 \n—\n%\n2 \n2 \n— \n%\nUnderwriting gain (loss)\n107\n \n(22)\nNM\n107\n \n(98)\nNM\nNet investment income [2]\n67 \n58 \n16\n%\n182 \n158 \n15 \n%\nNet realized losses [2]\n(4)\n(2)\n(100\n%)\n(10)\n(9)\n(11)\n%\nNet servicing and other income (expense) [3]\n4 \n5 \n(20\n%)\n14 \n15 \n(7)\n%\nIncome before income taxes\n174\n \n39\n \nNM\n293\n \n66\n \nNM\n Income tax expense [4]\n35 \n8 \nNM\n58 \n12 \nNM\nNet income\n$\n139\n \n$\n31\n \nNM\n$\n235\n \n$\n54\n \nNM\n[1]\nFor additional information on current accident year catastrophes and prior accident year development, see MD&A - Critical Accounting Estimates, Property & Casualty Insurance Product Reserves, Net of Reinsurance and Note 9 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Condensed Consolidated Financial Statements.\n[2]\nFor discussion of consolidated investment results, see MD&A - Investment Results.\n[3]\nIncludes servicing revenues of $25 and $22 for the three months ended September 30, 2025 and 2024, respectively, and $69 and $66 for the nine months ended September 30, 2025 and 2024, respectively. Includes servicing expenses of $20 and $18 for the three months ended September 30, 2025 and 2024, respectively, and $55 and $51 for the nine months ended September 30, 2025 and 2024, respectively.\n[4]For discussion of income taxes, see Note 12 - Income Taxes of Notes to Condensed Consolidated Financial Statements.\nWritten and Earned Premiums\nThree Months Ended September 30,\nNine Months Ended September 30,\nWritten Premiums\n2025\n2024\nChange\n2025\n2024\nChange\nProduct Line\nAutomobile\n$\n633 \n$\n649 \n(2\n%)\n$\n1,893 \n$\n1,866 \n1\n%\nHomeowners\n354 \n321 \n10\n%\n987 \n861 \n15\n%\nTotal\n$\n987\n \n$\n970\n \n2\n%\n$\n2,880\n \n$\n2,727\n \n6\n%\nEarned Premiums\nProduct Line\nAutomobile\n$\n634 \n$\n616 \n3\n%\n$\n1,880 \n$\n1,774 \n6\n%\nHomeowners\n316 \n269 \n17\n%\n900 \n773 \n16\n%\nTotal\n$\n950\n \n$\n885\n \n7\n%\n$\n2,780\n \n$\n2,547\n \n9\n%\n80\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nPremium Measures\nThree Months Ended September 30,\nNine Months Ended September 30,\nPremium Measures\n2025\n2024\n2025\n2024\nPolicies in-force end of period (in thousands)\nAutomobile\n1,091 \n1,193 \nHomeowners\n723 \n707 \nNet new business premium\nAutomobile\n$\n71 \n$\n83 \n$\n233 \n$\n237 \nHomeowners\n$\n59 \n$\n60 \n$\n190 \n$\n141 \nEffective Policy Count Retention\nAutomobile \n80 \n%\n79 \n%\n79 \n%\n79 \n%\nHomeowners\n82 \n%\n83 \n%\n82 \n%\n83 \n%\nRenewal written price increase\nAutomobile\n11.3 \n%\n20.7 \n%\n13.6 \n%\n23.1 \n%\nHomeowners\n12.6 \n%\n15.1 \n%\n12.5 \n%\n15.0 \n%\nRenewal earned price increase\nAutomobile \n15.4 \n%\n22.7 \n%\n17.6 \n%\n21.3 \n%\nHomeowners\n13.1 \n%\n14.8 \n%\n13.7 \n%\n14.6 \n%\nUnderwriting Ratios\nThree Months Ended September 30,\nNine Months Ended September 30,\nUnderwriting Ratios\n2025\n2024\nChange\n2025\n2024\nChange\nLoss and loss adjustment expense ratio\n62.9 \n76.8\n(13.9)\n70.2 \n78.1 \n(7.9)\nExpense Ratio\n25.8 \n25.6 \n0.2 \n26.0 \n25.8 \n0.2 \nCombined Ratio\n88.7\n \n102.5\n \n(13.8)\n96.2\n \n103.8\n \n(7.6)\nAdjustment to reconcile combined ratio to underlying combined ratio:\nCurrent accident year catastrophes and prior year development\n1.2 \n(8.8)\n10.0 \n(7.0)\n(8.4)\n1.4 \nUnderlying combined ratio\n90.0\n \n93.7\n \n(3.7)\n89.2\n \n95.4\n \n(6.2)\nUnderlying loss and loss adjustment expense ratio\n64.2 \n68.0 \n(3.8)\n63.2 \n69.7 \n(6.5)\nCurrent accident year catastrophes\n3.3 \n10.4 \n(7.1)\n11.4 \n10.6 \n0.8 \nPrior accident year development\n(4.5)\n(1.6)\n(2.9)\n(4.4)\n(2.2)\n(2.2)\nTotal loss and loss adjustment expense ratio\n62.9\n \n76.8\n \n(13.9)\n70.2\n \n78.1\n \n(7.9)\nLoss and loss adjustment expense ratio\n62.9 \n76.8 \n(13.9)\n70.2 \n78.1 \n(7.9)\nAdjustment to reconcile loss and loss adjustment expense ratio to underlying loss and loss adjustment expense ratio:\nCurrent accident year catastrophes and prior year development\n1.2 \n(8.8)\n10.0 \n(7.0)\n(8.4)\n1.4 \nUnderlying loss and loss adjustment expense ratio\n64.2\n \n68.0\n \n(3.8)\n63.2\n \n69.7\n \n(6.5)\n81\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nProduct Combined Ratios\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nAutomobile\nCombined ratio\n92.5\n \n105.7\n \n(13.2)\n93.3\n \n105.0\n \n(11.7)\nAdjustment to reconcile combined ratio to underlying combined ratio:\nCurrent accident year catastrophes\n(0.6)\n(5.8)\n5.2 \n(1.2)\n(3.5)\n2.3 \nPrior accident year development\n6.0 \n1.6 \n4.4 \n4.3 \n2.1 \n2.2 \nUnderlying combined ratio\n97.9\n \n101.5\n \n(3.6)\n96.4\n \n103.6\n \n(7.2)\nHomeowners\nCombined ratio\n81.2\n \n94.7\n \n(13.5)\n101.9\n \n101.8\n \n0.1\n \nAdjustment to reconcile combined ratio to underlying combined ratio:\nCurrent accident year catastrophes\n(8.3)\n(21.0)\n12.7 \n(32.5)\n(26.7)\n(5.8)\nPrior accident year development\n1.6 \n1.7 \n(0.1)\n4.7 \n1.7 \n3.0 \nUnderlying combined ratio\n74.4\n \n75.4\n \n(1.0)\n74.1\n \n76.7\n \n(2.6)\nNet income \nThree and nine months ended September 30, 2025 compared to 2024\nNet income \nincreased for both the three and nine month periods, largely driven by improved underwriting results.\nUnderwriting gain (loss) \nThree and nine months ended September 30, 2025 compared to 2024\nUnderwriting gain \nfor both the three and nine month periods changed from an underwriting loss primarily due to the effect of an increase in earned premium due to renewal price increases and more favorable prior accident year development. Current accident year catastrophe losses were lower for the three month period and higher for the nine month period.\nExpense ratio\n for both the three and nine months ended September 30, 2025 increased primarily due a higher commission ratio due to business mix. An increase in technology costs, higher staffing costs including incentive compensation, and marketing expenses, was offset by the effect of an increase in earned premium due to renewal written price increases.\n82\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nEarned Premiums \nWritten Premiums\nThree and nine months ended September 30, 2025 compared to 2024\nEarned premiums\n increased in both the three and nine month periods due to higher written premium over the prior twelve months in both automobile and homeowners.\nWritten premiums\n increased in both the three and nine month periods driven by the effect of written pricing increases and by an increase in new business premium in homeowners in the nine month period. \nRenewal written pricing\n moderated for both automobile and homeowners in both the three and nine months ended September 30, 2025, primarily in response to moderating loss cost trends.\nEffective Policy count retention\n was relatively stable both for automobile and homeowners in both the three and nine months ended September 30, 2025, in response to moderating renewal written pricing increases.\nPolicies in-force\n as of September 30, 2025 compared to September 30, 2024 declined for automobile and increased for homeowners, reflecting the level of new business in relation to non-renewed policies.\n83\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nUnderlying Loss and Loss Adjustment Expense Ratio\nThree and nine months ended September 30, 2025 compared to 2024\nUnderlying loss and LAE ratio\n decreased in both automobile and homeowners in both the three and nine month periods. The decrease in automobile was primarily due to the impact of earned pricing increases, partially offset by higher loss costs. The higher loss costs in automobile were driven by higher physical damage and liability claim severities, partially offset by lower physical damage claim frequency. The automobile claim severity trend has moderated from the prior year. The automobile liability severity trend continues to recognize the inflationary effects and higher attorney representation rates on bodily injury claims. For homeowners, the decrease in the underlying loss and LAE ratio was primarily due to the impact of earned pricing increases, partially offset by higher claim severities. Contributing to the higher homeowners severity was the effect of higher rebuilding costs.\nCurrent Accident Year Catastrophes and Unfavorable (Favorable) Prior Accident Year Development\nThree and nine months ended September 30, 2025 compared to 2024\nCurrent accident year catastrophe losses \ndecreased in the three month period and increased in the nine month period. CAY catastrophe losses for the three months ended September 30, 2025 included losses from tornado, wind and hail events across several regions, but concentrated in the Mountain West, Midwest and South regions. CAY catastrophe losses for the nine months ended September 30, 2025 included losses from tornado, wind and hail events across several regions, but concentrated in the South and Midwest regions, as well as a loss of $109 from the January 2025 California Wildfire Event.\nCAY catastrophe losses for the three months ended September 30, 2024 included losses from hurricanes and tropical storms, primarily in the Southeast region, including a loss of $49 for Hurricane Helene, and to a lesser extent, tornado, wind and hail events, mainly in the Midwest, Mountain West, and Northeast regions. CAY catastrophe losses for the nine months ended September 30, 2024 included losses from tornado, wind and hail events in several regions of the United States, and to a lesser extent, from hurricanes and tropical storms primarily in the Southeast region.\nPrior accident year development\n was favorable for both the three and nine month periods, primarily driven by lower estimated severity on automobile liability, homeowners, automobile physical damage, and, for the nine month period, catastrophes. Prior accident year development was favorable for the three and nine months ended September 30, 2024, primarily driven by lower estimated severity on automobile physical damage and homeowners, and for the nine month period, automobile liability and catastrophes. \n84\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nProperty & Casualty Other Operations - Results of Operations\nUnderwriting Summary\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nLosses and loss adjustment expenses\nPrior accident year development [1]\n$\n— \n$\n— \n—\n%\n$\n— \n$\n7 \n(100\n%)\nTotal losses and loss adjustment expenses\n— \n— \n—\n%\n— \n7 \n(100\n%)\nInsurance operating costs\n2 \n3 \n(33\n%)\n6 \n7 \n(14\n%)\nUnderwriting loss\n(2)\n(3)\n33\n%\n(6)\n(14)\n57\n%\nNet investment income [2]\n19 \n18 \n6\n%\n56 \n55 \n2\n%\nNet realized losses [2]\n— \n— \n—\n%\n(2)\n(3)\n33\n%\nOther income (expenses)\n(1)\n(4)\n75\n%\n(1)\n(4)\n75\n%\n Income before income taxes\n16\n \n11\n \n45\n%\n47\n \n34\n \n38\n%\nIncome tax expense [3]\n4 \n1 \nNM\n9 \n5 \n80\n%\nNet income\n$\n12\n \n$\n10\n \n20\n%\n$\n38\n \n$\n29\n \n31\n%\n[1]\nFor additional information on prior accident year development, see\n \nNote 9 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Condensed Consolidated Financial Statements.\n[2]\nFor discussion of consolidated investment results, see MD&A - Investment Results.\n[3]\nFor discussion of income taxes, see Note 12 - Income Taxes of Notes to Condensed Consolidated Financial Statements.\nNet income \n \nThree and nine months ended September 30, 2025 compared to 2024 \nNet income\n increased\n in both the three and nine month periods, due to lower underwriting losses as well as lower other expenses resulting from a one-time contract settlement charge on a claims servicing agreement recorded in the 2024 periods.\nUnderwriting loss\n decreased slightly for the three month period due to a decrease in underwriting expenses. Underwriting loss decreased for the nine month period due to unfavorable prior accident year reserve development in the 2024 period.\n85\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nEmployee Benefits - Results of Operations\nOperating Summary\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nPremiums and other considerations\n$\n1,658 \n$\n1,655 \n—\n%\n$\n4,989 \n$\n4,959 \n1 \n%\nNet investment income [1]\n136 \n119 \n14\n%\n380 \n345 \n10 \n%\nNet realized losses [1]\n(8)\n— \nNM\n(28)\n(8)\nNM\nTotal revenues\n1,786\n \n1,774\n \n1\n%\n5,341\n \n5,296\n \n1\n \n%\nBenefits, losses and loss adjustment expenses\n1,163 \n1,161 \n—\n%\n3,512 \n3,512 \n— \n%\nAmortization of DAC\n8 \n8 \n—\n%\n25 \n26 \n(4)\n%\nInsurance operating costs and other expenses\n425 \n401 \n6\n%\n1,238 \n1,185 \n4 \n%\nAmortization of other intangible assets\n10 \n10 \n—\n%\n30 \n30 \n— \n%\nTotal benefits, losses and expenses\n1,606\n \n1,580\n \n2\n%\n4,805\n \n4,753\n \n1\n \n%\n Income before income taxes\n180\n \n194\n \n(7\n%)\n536\n \n543\n \n(1)\n%\n Income tax expense [2]\n36 \n38 \n(5\n%)\n109 \n108 \n1 \n%\nNet income\n$\n144\n \n$\n156\n \n(8\n%)\n$\n427\n \n$\n435\n \n(2)\n%\n[1]\nFor discussion of consolidated investment results, see MD&A - Investment Results.\n[2]\nFor discussion of income taxes, see Note 12 - Income Taxes of Notes to Condensed Consolidated Financial Statements.\nPremiums and Other Considerations\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nFully insured – ongoing premiums\n$\n1,603 \n$\n1,600 \n—\n%\n$\n4,817 \n$\n4,792 \n1 \n%\nBuyout premiums\n— \n— \n—\n%\n4 \n1 \nNM\nFee income\n55 \n55 \n—\n%\n168 \n166 \n1 \n%\nTotal premiums and other considerations\n$\n1,658\n \n$\n1,655\n \n—\n%\n$\n4,989\n \n$\n4,959\n \n1\n \n%\nFully insured ongoing sales\n$\n105\n \n$\n105\n \n—\n%\n$\n593\n \n$\n650\n \n(9)\n%\nRatios, Excluding Buyouts\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nGroup disability loss ratio\n70.6\n%\n67.9\n%\n2.7\n69.3\n%\n68.4\n%\n0.9\nGroup life loss ratio\n74.2\n%\n77.5\n%\n(3.3)\n76.1\n%\n78.3\n%\n(2.2)\nTotal loss ratio\n70.1\n%\n70.2\n%\n(0.1)\n70.4\n%\n70.8\n%\n(0.4)\nExpense ratio\n26.7\n%\n25.3\n%\n1.4\n25.9\n%\n25.0\n%\n0.9\nMargin\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nNet income margin\n8.1\n%\n8.8\n%\n(0.7)\n8.0\n%\n8.2\n%\n(0.2)\nAdjustments to reconcile net income margin to core earnings margin:\nNet realized losses (gains), before tax\n0.4\n%\n(0.1\n%)\n0.5 \n0.5\n%\n0.2\n%\n0.3 \nIncome tax benefit\n(0.2\n%)\n—\n%\n(0.2)\n(0.1\n%)\n(0.1\n%)\n— \nCore earnings margin\n8.3\n%\n8.7\n%\n(0.4)\n8.4\n%\n8.3\n%\n0.1\n \n86\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNet Income \n \nThree and nine months ended September 30, 2025 compared to 2024\nNet income\n decreased for the three month period,\n \nprimarily due to an increase in the expense ratio as well as a higher group disability loss ratio, partially offset by a lower group life loss ratio. For the nine month period, net income decreased primarily due to an increase in the expense ratio as well as higher net realized losses, partially offset by a lower group life loss ratio, higher fully insured ongoing premiums, and higher net investment income.\nInsurance operating costs and other expenses \nwere higher for both the three and nine month periods \ndue to higher staffing costs, including increased incentive compensation and benefits, higher technology costs, including increased investment, and higher commission costs.\nFully Insured Ongoing Premiums\n[1]\nOther of $107 and $120 for the three months ended September 30, 2024 and 2025 respectively, and $318 and $358 for the nine months ended September 30, 2024 and 2025, respectively which includes other group coverages such as retiree health insurance, critical illness, accident and hospital indemnity coverages.\nThree and nine months ended September 30, 2025 compared to 2024\nFully insured ongoing premiums\n remained flat for the three month period, as an increase in exposure on existing accounts was offset by lower sales during the past year. For the nine month period, premiums increased slightly over prior year and included an increase in exposure on existing accounts and persistency in excess of 90%.\nFully insured ongoing sales\n were flat for the three month period. For the nine month period, sales decreased compared to prior year driven by lower sales of the paid family and medical leave product and fewer large case sales.\n87\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nRatios\n \nThree and nine months ended September 30, 2025 compared to 2024\nLoss\n \nratio\n remained relatively flat for the three months ended September 30, 2025, and improved 0.4 points for the nine months ended September 30, 2025. The group life loss ratio decreased 3.3 points for the quarter and 2.2 points year-to-date driven by lower mortality across both term and accidental life products. \nThe group disability loss ratio increased 2.7 points for the quarter and 0.9 points year-to-date largely due to a benefit in the prior year related to an update to the long-term disability claim recovery rate reserve assumptions, which reduced the prior year loss ratios by 2.2 and 0.7 points, respectively, as well as slightly higher long-term disability loss trends, partially offset by paid family and medical leave product pricing actions.\nExpense ratio\n increased for the three and nine months ended September 30, 2025 primarily due to \nhigher staffing costs, including increased incentive compensation and benefits, higher technology costs, including increased investment\n, and a higher commission ratio.\n88\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nHartford Funds - Results of Operations\nOperating Summary\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nFee income and other revenue\n$\n277 \n$\n263 \n5\n%\n$\n793 \n$\n766 \n4 \n%\nNet investment income\n4 \n5 \n(20\n%)\n14 \n14 \n— \n%\nNet realized gains\n5 \n7 \n(29\n%)\n14 \n15 \n(7)\n%\nTotal revenues\n286\n \n275\n \n4\n%\n821\n \n795\n \n3\n \n%\nOperating costs and other expenses\n214 \n208 \n3\n%\n626 \n614 \n2 \n%\n Income before income taxes\n72\n \n67\n \n7\n%\n195\n \n181\n \n8\n \n%\nIncome tax expense [1]\n15 \n13 \n15\n%\n41 \n38 \n8 \n%\nNet income\n$\n57\n \n$\n54\n \n6\n%\n$\n154\n \n$\n143\n \n8\n \n%\nDaily average Hartford Funds AUM\n$\n148,269\n \n$\n137,888\n \n8\n%\n$\n142,789\n \n$\n134,546\n \n6\n \n%\nROA [2]\n15.4\n \n15.7\n \n(2\n%)\n14.4\n \n14.2\n \n1\n \n%\nAdjustment to reconcile ROA to ROA, core earnings:\nEffect of net realized gains excluded from core earnings, before tax\n(1.3)\n(2.1)\n38\n%\n(1.3)\n(1.5)\n13 \n%\nEffect of income tax expense\n0.2 \n— \nNM\n0.3 \n0.3 \n— \n%\nROA, core earnings [2]\n14.3\n \n13.6\n \n5\n%\n13.4\n \n13.0\n \n3\n \n%\n[1]For discussion of income taxes, see Note 12 - Income Taxes of Notes to Condensed Consolidated Financial Statements. \n[2]Represents annualized earnings divided by a daily average of AUM, as measured in basis points.\nHartford Funds Segment AUM\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nMutual Fund and ETF AUM - beginning of period\n$\n134,290\n \n$\n123,686\n \n9\n%\n$\n128,054\n \n$\n119,316\n \n7\n \n%\nSales - Mutual Fund\n7,098 \n5,669 \n25\n%\n21,249 \n16,959 \n25 \n%\nRedemptions - Mutual Fund\n(7,222)\n(6,350)\n(14\n%)\n(24,495)\n(21,130)\n(16)\n%\nNet flows - ETF\n99 \n256 \n(61\n%)\n274 \n150 \n83 \n%\nNet flows - Mutual Fund and ETF\n(25)\n(425)\n94\n%\n(2,972)\n(4,021)\n26 \n%\nChange in market value and other\n6,732 \n7,105 \n(5\n%)\n15,915 \n15,071 \n6 \n%\nMutual Fund and ETF AUM - end of period\n140,997\n \n130,366\n \n8\n%\n140,997\n \n130,366\n \n8\n \n%\nThird-party life and annuity separate account AUM\n11,341\n \n12,073\n \n(6\n%)\n11,341\n \n12,073\n \n(6)\n%\nHartford Funds AUM - end of period\n$\n152,338\n \n$\n142,439\n \n7\n%\n$\n152,338\n \n$\n142,439\n \n7\n \n%\nMutual Fund and ETF AUM by Asset Class\nAs of September 30,\n2025\n2024\nChange\nEquity - Mutual Funds\n$\n94,454 \n$\n87,271 \n8 \n%\nFixed Income - Mutual Funds\n22,843 \n19,347 \n18 \n%\nMulti-Strategy Investments - Mutual Funds [1]\n18,632 \n19,425 \n(4)\n%\nEquity - ETF\n2,094 \n1,847 \n13 \n%\nFixed Income - ETF\n2,974 \n2,476 \n20 \n%\nMutual Fund and ETF AUM\n$\n140,997\n \n$\n130,366\n \n8\n \n%\n[1]Includes balanced, allocation and alternative investment products.\n89\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNet Income\n \nThree and nine months ended September 30, 2025 compared to 2024\nNet income \nincreased for the three and nine months ended September 30, 2025, primarily due to an increase in fee income net of operating costs and other expenses driven by higher daily average AUM, partially offset by a decrease in net realized gains.\nHartford Funds AUM\nSeptember 30, 2025 compared to 2024\nHartford Funds AUM\n increased primarily due to an increase in equity market levels, partially offset by net outflows over the preceding twelve month period. Net outflows were $25 and $3.0 billion, respectively, for the three and nine months ended September 30, 2025 compared to net outflows of $425 and $4.0 billion, respectively, for the three and nine months ended September 30, 2024.\nCorporate - Results of Operations\nOperating Summary\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nFee income [1]\n$\n10 \n$\n10 \n—\n%\n$\n31 \n$\n30 \n3\n%\nOther revenue\n6 \n1 \nNM\n12 \n2 \nNM\nNet investment income [2]\n14 \n17 \n(18\n%)\n42 \n47 \n(11\n%)\nNet realized gains [2]\n21 \n14 \n50\n%\n25 \n31 \n(19\n%)\nTotal revenues\n51\n \n42\n \n21\n%\n110\n \n110\n \n—\n%\nBenefits, losses and loss adjustment expenses [3]\n2 \n1 \n100\n%\n4 \n5 \n(20\n%)\nInsurance operating costs and other expenses [1]\n13 \n12 \n8\n%\n41 \n37 \n11\n%\nInterest expense [4]\n50 \n49 \n2\n%\n150 \n149 \n1\n%\nRestructuring and other costs\n— \n1 \n(100\n%)\n— \n2 \n(100\n%)\nTotal benefits, losses and expenses\n65\n \n63\n \n3\n%\n195\n \n193\n \n1\n%\nLoss before income taxes\n(14)\n(21)\n33\n%\n(85)\n(83)\n(2\n%)\nIncome tax benefit [5]\n(32)\n(9)\nNM\n(53)\n(39)\n(36\n%)\nNet income (loss)\n18\n \n(12)\nNM\n(32)\n(44)\n27\n%\nPreferred stock dividends\n6 \n6 \n—\n%\n16 \n16 \n—\n%\nNet income (loss) available to common stockholders \n$\n12\n \n$\n(18)\n167\n \n%\n$\n(48)\n$\n(60)\n20\n%\n[1]Includes investment management fees and expenses related to managing third-party assets.\n[2]\nFor discussion of consolidated investment results, see MD&A - Investment Results.\n[3]Includes benefits expense on life and annuity business previously underwritten by the Company.\n[4]For discussion of debt, see Note 13 - Debt of Notes to Consolidated Financial Statements in The Hartford's 2024 Form 10-K Annual Report.\n[5]For discussion of income taxes, see Note 12 - Income Taxes of Notes to Condensed Consolidated Financial Statements.\n90\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNet income (loss) available to common stockholders \n \nThree and nine months ended September 30, 2025 compared to 2024\nNet income available to common stockholders \nchanged from a net loss available to common stockholders \nfor the three months ended September 30, 2025, primarily driven by a higher net tax benefit, which includes a release of a provision for an uncertain tax position and tax related interest accruals, as well as higher net realized gains.\nNet loss available to common stockholders decreased for the nine months ended September 30, 2025, primarily driven by a higher net tax benefit, which includes a release of a provision for an uncertain tax position and tax related interest accruals, partially offset by lower net realized gains and lower net investment income. For further discussion of income taxes, see Note 12 - Income Taxes of Notes to Condensed Consolidated Financial Statements.\n91\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nEnterprise Risk Management\nThe Company’s Board of Directors has ultimate responsibility for risk oversight, as described more fully in our Proxy Statement, while management is tasked with the day-to-day management of the Company’s risks.\nThe Company manages and monitors risk through risk policies, controls and limits. At the senior management level, an Enterprise Risk and Capital Committee (“ERCC”) oversees the risk profile and risk management practices of the Company.\nThe Company's enterprise risk management (\"ERM\") function supports the ERCC and functional committees, and is tasked with, among other things:\n•\nrisk identification and assessment;\n•\nthe development of risk appetites, tolerances, and limits;\n•\nrisk monitoring; and\n•\ninternal and external risk reporting.\nThe Company categorizes its main risks as insurance risk, operational risk and financial risk. Insurance risk and financial risk are described in more detail below. Operational risk, including cybersecurity, and specific risk tolerances for natural catastrophes, terrorism and pandemic risk are described in the ERM section of the MD&A in The Hartford’s 2024 Form 10-K Annual Report.\nInsurance Risk\nInsurance risk is the risk of losses of both a catastrophic and non-catastrophic nature on the P&C and Employee Benefits products the Company has sold. Catastrophe insurance risk is the exposure arising from both natural catastrophes (e.g., weather, earthquakes, wildfires, pandemics) and man-made catastrophes (e.g., terrorism, cyber-attacks) that create a concentration or aggregation of loss across the Company's insurance or asset portfolios.\nSources of Insurance Risk \nNon-catastrophe insurance risks exist within each of the Company's segments except Hartford Funds and include:\n•\nProperty-\n Risk of loss to personal or commercial property from automobile related accidents, weather, explosions, smoke, shaking, fire, theft, vandalism, inadequate installation, faulty equipment, collisions and falling objects, and/or machinery mechanical breakdown resulting in physical damage, losses from PV&T and other covered perils.\n•\nLiability-\n Risk of loss from automobile related accidents, uninsured and under-insured drivers, lawsuits from accidents, defective products, breach of warranty, negligent acts by professional practitioners, environmental claims, latent exposures, fraud, coercion, forgery, failure to fulfill obligations per contract surety, liability from errors and omissions, losses from CPRI coverages, losses from derivative lawsuits, and other securities actions and covered perils.\n•\nMortality-\n Risk of loss from unexpected trends in insured deaths impacting timing of payouts from group life insurance, personal or commercial automobile related accidents, and death of employees or executives during the course of employment, while on disability, or while collecting workers compensation benefits.\n•\nMorbidity-\n Risk of loss to an insured from illness incurred during the course of employment or illness from other covered perils.\n•\nDisability-\n Risk of loss incurred from personal or commercial automobile related losses, accidents arising outside of the workplace, injuries or accidents incurred during the course of employment, or from equipment, with each loss resulting in short-term or long-term disability payments.\n•\nLongevity-\n Risk of loss from increased life expectancy trends among policyholders receiving long-term benefit payments.\n•\nCyber Insurance\n- Risk of loss to property, breach of data and business interruption from various types of cyber-attacks. \nCatastrophe risk primarily arises in the property, automobile, workers' compensation, casualty, group life, and group disability lines of business but could also arise from other coverages such as losses under PV&T and CPRI policies. See the term Current Accident Year Catastrophe Ratio within the Key Performance Measures and Ratios section of MD&A for an explanation of how the Company defines catastrophe losses in its financial reporting.\nImpact \nNon-catastrophe insurance risk can arise from unexpected loss experience, underpriced business and/or underestimation of loss reserves and can have significant effects on the Company’s earnings. Catastrophe insurance risk can arise from various unpredictable events and can have significant effects on the Company's earnings and may result in losses that could constrain its liquidity.\nManagement\n The Company's policies and procedures for managing these risks include disciplined underwriting protocols, exposure controls, sophisticated risk-based pricing, risk modeling, risk transfer, and capital management strategies. The Company has established underwriting guidelines for both individual risks, including individual policy limits, and risks in the aggregate, including aggregate exposure limits by geographic zone and peril. The Company uses both internal and third-party models to estimate the potential loss resulting from various catastrophe events and the potential financial impact those events would have on the Company's financial position and results of operations across its businesses. \nThe Hartford closely monitors scientific literature on climate change to help identify climate change risks impacting our business. We use data from the scientific community and other outside experts including partnerships with third-party catastrophe modeling firms to inform our risk management activities and stay abreast of potential implications of climate-related impacts that we incorporate into our risk assessment. We regularly study these climate change implications and incorporate these risks into our catastrophe risk assessment \n92\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nand management strategy through product pricing, underwriting and management of aggregate risk to manage implications of severe weather and climate change in our insurance portfolio. \nIn addition, certain insurance products offered by The Hartford provide coverage for losses incurred due to cyber events and the Company has assessed and modeled how those products would respond to different events in order to manage its aggregate exposure to losses incurred under the insurance policies we sell. The Company models numerous deterministic scenarios including losses caused by malware, data breach, distributed denial of service attacks, intrusions of cloud environments and attacks of power grids. \nAmong specific risk tolerances set by the Company, risk limits are set for natural catastrophes, terrorism risk and pandemic risk.\nReinsurance as a Risk Management Strategy \nThe Company uses reinsurance to transfer certain risks to reinsurance companies based on specific geographic or risk concentrations. A variety of traditional reinsurance products are used as part of the Company's risk management strategy, including excess of loss occurrence-based products that reinsure property and workers' compensation exposures, and individual risk (including facultative reinsurance) or quota share arrangements that reinsure losses from specific classes or lines of business. The Company has no significant finite risk contracts in place and the statutory surplus benefit from all such prior year contracts is immaterial. The Hartford also participates in governmentally administered reinsurance facilities such as the Florida Hurricane Catastrophe Fund (“FHCF”), the Terrorism Risk Insurance Program Reauthorization Act (“TRIPRA\") and other reinsurance programs relating to particular risks or specific lines of business.\nReinsurance for Catastrophes\n-\n \nThe Company utilizes various reinsurance programs to mitigate catastrophe losses including excess of loss occurrence-based treaties covering property and workers’ compensation, a catastrophe bond, an aggregate property catastrophe treaty, and individual risk agreements (including facultative reinsurance) that reinsure losses from specific classes or lines of business. The occurrence property catastrophe treaty and workers’ compensation catastrophe treaties beginning with the January 1, 2021 renewal do not cover pandemic losses, as most industry reinsurance programs exclude communicable disease. The Company has reinsurance in place to cover individual group life losses in excess of $1 per person.\n93\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nPrimary Catastrophe Treaty Reinsurance Coverages as of September 30, 2025 [1]\nPortion of losses reinsured\nPortion of losses retained by The Hartford\nPer Occurrence Property Catastrophe Treaty from 1/1/2025 to 12/31/2025 [1] [2]\nLosses of $0 to $200\nNone\n100% retained\nLosses of $200 to $350 for earthquakes and named hurricanes and tropical storms [3]\nNone\n100% retained\nLosses of $200 to $350 from one event other than earthquakes and named hurricanes and tropical storms [3]\n40% of $150 in excess of $200\n60% co-participation\nLosses of $350 to $500 from one event (all perils)\n75% of $150 in excess of $350\n25% co-participation\nLosses of $500 to $1.20 billion from one event [4] (all perils)\n90% of $700 in excess of $500\n10% co-participation\nPer Occurrence Property Catastrophe Bond from 1/1/2025 to 12/31/2026 [5]\nLosses of $1.19 billion to $1.49 billion for tropical cyclone and earthquake events [6]\n66.67% of $300 in excess of $1.19 billion\n33.33% of $300 in excess of $1.19 billion\nAggregate Property Catastrophe Treaty for 1/1/2025 to 12/31/2025 [7]\n$0 to $750 of aggregate losses\nNone\n100% Retained\n$750 to $950 of aggregate losses\n100%\nNone\nWorkers' Compensation Catastrophe Treaty for 1/1/2025 to 12/31/2025\nLosses of $0 to $100 from one event\nNone\n100% Retained\nLosses of $100 to $450 from one event [8]\n80% of $350 in excess of $100\n20% co-participation\n[1]\nThese agreements do not cover the assumed reinsurance business which purchases its own retrocessional coverage.\n[2]\nIn addition to the Per Occurrence Property Catastrophe Treaty, for Florida homeowners wind events, The Hartford has purchased the mandatory FHCF reinsurance for the annual period starting June 1, 2025. Retention and coverage varies by writing company. For the 2025 - 2026 period, the writing company with the largest coverage under FHCF is Hartford Insurance Company of the Midwest, with coverage of $37 in per event losses in excess of a $23 retention (estimates are based on best available information at this time and are periodically updated as information is made available by Florida).\n[3]\nNamed hurricanes and tropical storms are defined as any storm or storm system declared to be a hurricane or tropical storm by the US National Hurricane Center, US Weather Prediction Center, or their successor organizations (being divisions of the US National Weather Service).\n[4] Portions of this layer of coverage extend beyond a traditional one year term.\n[5] For further information on the Company's catastrophe bond, see MD&A - Enterprise Risk Management, Insurance Risk included in the Company's 2024 Form 10-K Annual report. \n[6] Tropical cyclones are defined as a storm or storm system that has been declared by National Weather Service or any division or agency thereof (including the National Hurricane Center or the Weather Prediction Center) or any of their successors to be a hurricane, tropical storm, or tropical depression.\n[7] The aggregate treaty is not limited to a single event; rather, it is designed to provide reinsurance protection for the aggregate of all catastrophe events (up to $350 per event), either designated by the Property Claim Services office of Verisk or, for international business, net losses arising from two or more risks involved in the same loss occurrence totaling at least $500 thousand. All catastrophe losses, except assumed reinsurance business losses, apply toward satisfying the $750 attachment point under the aggregate treaty.\n[8] In addition to the limits shown, the workers' compensation reinsurance includes a non-catastrophe, industrial accident layer, providing coverage for 80% of $25 in per event losses in excess of a $25 retention.\nIn addition to the property catastrophe reinsurance coverage described in the above table, the Company has other reinsurance agreements that cover property catastrophe losses, some of which provide for reinstatement of limits in the event of a loss with reinstatement provisions varying depending on the layer of coverage. The Per Occurrence Property Catastrophe Treaty, and Workers' Compensation Catastrophe Treaty include a provision to reinstate one limit in the event that a catastrophe loss exhausts limits on one or more layers under the treaties.\nReinsurance for Terrorism-\n For the risk of terrorism, private sector catastrophe reinsurance capacity is generally limited and largely unavailable for terrorism losses caused by nuclear, biological, chemical or radiological attacks. As such, the Company's principal reinsurance protection against large-scale terrorist attacks is the coverage currently provided through TRIPRA to the end of 2027.\nTRIPRA provides a backstop for insurance-related losses resulting from any “act of terrorism”, which is certified by the Secretary of the Treasury, in consultation with the Secretary of Homeland Security and the Attorney General, for losses that exceed a threshold of industry losses of $200. Under the \nprogram, in any one calendar year, the federal government will pay a percentage of losses incurred from a certified act of terrorism after an insurer's losses exceed 20% of the Company's eligible direct commercial earned premiums of the prior calendar year up to a combined annual aggregate limit for the federal government and all insurers of $100 billion. The percentage of losses paid by the federal government is 80%. The Company's estimated deductible under the program is $2.2 billion for 2025. If an act of terrorism or acts of terrorism result in covered losses exceeding the $100 billion annual industry aggregate limit, Congress would be responsible for determining how additional losses in excess of $100 billion will be paid. \nReinsurance for A&E and Navigators Group Reserve Development\n -\n The Company has two adverse development covers (\"ADC\") reinsurance agreements in place, both of which are accounted for as retroactive reinsurance. One agreement covered substantially all A&E reserve development for 2016 and prior accident years (the “A&E ADC”) up to an aggregate limit of $1.5 billion and the other covered substantially all reserve development of Navigators Insurance Company and certain of its affiliates for 2018 and prior accident years (the “Navigators ADC”) up to an aggregate limit of $300. As the Company has \n94\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nceded all of the $300 and $1.5 billion available limits under the Navigators ADC and the A&E ADC; respectively, there is no remaining limit available under either agreement as of December 31, 2024. During the nine months ended September 30, 2025 and 2024, the Company collected recoveries from National Indemnity Company (\"NICO\"), a subsidiary of Berkshire Hathaway Inc., under the Navigators ADC and as a result amortized $64 and $87 of the deferred gain within benefits, losses and loss adjustment expenses in the Condensed Consolidated Statements of Operations. As of September 30, 2025, the deferred gain on the Navigators ADC has been fully amortized. As of December 31, 2024, the deferred gain on the Navigators ADC was $64, and is included in other liabilities on the Condensed Consolidated Balance Sheets. \nFor more information on the A&E ADC and the Navigators ADC, see Note 1 - Basis of Presentation and Significant Accounting Policies and Note 10 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Consolidated Financial Statements, included in The Hartford's 2024 Form 10-K Annual Report.\nFinancial Risk\nFinancial risks include direct and indirect risks to the Company's financial objectives from events that impact financial market conditions and the value of financial assets. Some events may cause correlated movement in multiple risk factors. The primary sources of financial risks are the Company's invested assets. \nConsistent with its risk appetite, the Company establishes financial risk limits to control potential loss on a U.S. GAAP, statutory, and economic basis. Exposures are actively monitored and managed, with risks mitigated where appropriate. The Company uses various risk management strategies, including limiting aggregation of risk, portfolio re-balancing and hedging with over-the-counter (\"OTC\") and exchange-traded derivatives with counterparties meeting the appropriate regulatory and due diligence requirements. Derivatives may be used to achieve the following Company-approved objectives: (1) hedging risk arising from interest rate, equity market, credit spread and issuer default, price or currency exchange rate risk or volatility; (2) managing liquidity; (3) controlling transaction costs; and (4) engaging in income generation covered call transactions and synthetic replication transactions. Derivative activities are monitored and evaluated by the Company’s compliance and risk management teams and reviewed by senior management. The Company identifies different categories of financial risk, including liquidity, credit, interest rate, equity, and foreign currency exchange.\nLiquidity Risk\nLiquidity risk is the risk to current or prospective earnings or capital arising from the Company's inability or perceived inability to meet its contractual funding obligations as they come due.\nSources of Liquidity Risk\n \nSources of liquidity risk include funding risk, company-specific liquidity risk and market liquidity risk resulting from differences in the amount and timing of sources and uses of cash as well as company-specific and general market conditions. Stressed market conditions may impact the ability to sell assets or otherwise transact business and may result in a significant loss in value of the investment portfolio.\nImpact\n \nInadequate capital resources and liquidity could negatively affect the Company’s overall financial strength and its ability to generate cash flows from its businesses, borrow funds at competitive rates, and raise new capital to meet operating and growth needs.\nManagement\n The Company has defined ongoing monitoring and reporting requirements to assess liquidity across the enterprise under both current and stressed market conditions. The Company measures and manages liquidity risk exposures and funding needs within prescribed limits across legal entities, taking into account legal, regulatory and operational limitations to the transferability of liquid assets among legal entities. The Company also monitors internal and external conditions, and identifies material risk changes and emerging risks that may impact operating cash flows or liquid assets. The liquidity requirements of The Hartford Insurance Group, Inc. (\"HIG Holding Company\") have been and will continue to be met by the HIG Holding Company's fixed maturities, short-term investments and cash, and dividends from its subsidiaries, principally from its insurance operations, as well as the issuance of common stock, debt or other capital securities and borrowings from its credit facilities, as needed. The Company maintains multiple sources of contingent liquidity including a revolving credit facility, an intercompany liquidity agreement that allows for short-term advances of funds among the HIG Holding Company and certain affiliates, and access to collateralized advances from the Federal Home Loan Bank of Boston (\"FHLBB\") for certain affiliates. The Company's CFO has primary responsibility for liquidity risk.\nCredit Risk and Counterparty Risk\nCredit risk is the risk to earnings or capital due to uncertainty of an obligor’s or counterparty’s ability or willingness to meet its obligations in accordance with contractually agreed upon terms. Credit risk is comprised of three major factors: the risk of change in credit quality, or credit migration risk; the risk of default; and the risk of a change in value due to changes in credit spreads.\nSources of Credit Risk \nThe majority of the Company’s credit risk is concentrated in its investment holdings and use of derivatives, but it is also present in the Company’s ceded reinsurance activities, bond insurance, and certain aspects of Business Insurance products.\nImpact\n A decline in creditworthiness is typically reflected as an increase in an investment’s credit spread and an associated decline in the investment's fair value, potentially resulting in recording an ACL and an increased probability of a realized loss upon sale. In certain instances, counterparties may default on their obligations and the Company may realize a loss on default. Premiums receivable, including premiums for retrospectively rated plans, reinsurance recoverable and deductible losses recoverable are also subject to credit risk based on the counterparty’s inability to pay.\nManagement \nThe objective of the Company’s enterprise credit risk management strategy is to identify, quantify and manage credit risk in aggregate and to limit potential losses in accordance with the Company's credit risk management policy. The Company manages its credit risk by managing aggregations of risk, holding a diversified mix of issuers and \n95\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\ncounterparties across its investment, reinsurance and insurance portfolios and limiting exposure to any specific reinsurer or counterparty. Potential credit losses can be mitigated through diversification (e.g., geographic regions, asset types, industry sectors), hedging and the use of collateral to reduce net credit exposure.\nThe Company manages credit risk through the use of various surveillance, analyses and governance processes. The investment and reinsurance areas have formal policies and procedures for counterparty approvals and authorizations, which establish criteria defining minimum levels of creditworthiness and financial stability for eligible counterparties. Potential investments are subject to underwriting reviews and management approval. Mitigation strategies vary across the three sources of credit risk, but may include:\n•\nInvesting in a portfolio of high-quality and diverse securities;\n•\nSelling investments subject to heightened credit risk;\n•\nHedging through use of credit default swaps;\n•\nClearing derivative transactions through central clearing houses that require daily variation margin;\n•\nEntering into derivative and reinsurance contracts only with strong creditworthy institutions;\n•\nRequiring collateral; and\n•\nNon-renewing policies/contracts or reinsurance treaties.\nThe Company has developed credit exposure thresholds which are based upon counterparty ratings. Aggregate counterparty credit quality and exposure are monitored on a daily basis utilizing an enterprise-wide credit exposure information system that contains data on issuers, ratings, exposures, and credit limits. Exposures are tracked on a current and potential basis and aggregated by ultimate parent of the counterparty across investments, reinsurance receivables, insurance products with credit risk, and derivatives.\nAs of September 30, 2025, the Company had no investment exposure to any credit concentration risk of a single issuer or counterparty greater than 10% of the Company’s stockholders' equity, other than the U.S. government and certain U.S. government agencies. For further discussion of concentration of credit risk in the investment portfolio, see the Concentration of Credit Risk section in Note 5 - Investments of Notes to Condensed Consolidated Financial Statements.\nCredit Risk of Derivatives\nThe Company uses various derivative counterparties in executing its derivative transactions. The use of counterparties creates credit risk that the counterparty may not perform in accordance with the terms of the derivative transaction.\nDowngrades to the credit ratings of the Company’s insurance operating companies may have adverse implications for its use of derivatives. In some cases, downgrades may give derivative counterparties for OTC derivatives and clearing brokers for OTC-cleared derivatives the right to cancel and settle outstanding derivative trades or require additional collateral to be posted. In addition, downgrades may result in counterparties and clearing brokers becoming unwilling to engage in or clear additional derivatives or may require additional collateralization before entering into any new trades. \nThe Company also has derivative counterparty exposure policies which limit the Company’s exposure to credit risk. Credit exposures are generally quantified based on the prior business day’s net fair value, including income accruals, of all derivative positions transacted with a single counterparty for each separate legal entity. The notional amount of derivative contracts represents the basis upon which pay or receive amounts are calculated and are not necessarily reflective of credit risk. The Company enters into collateral arrangements in connection with its derivatives positions and collateral is pledged to or held by, or on behalf of, the Company to the extent the exposure is greater than zero, subject to minimum transfer thresholds, if applicable. In accordance with industry standards and the contractual requirements, collateral is typically settled on the same business day. For further discussion, see the Derivative Commitments section of Note 14 - Commitments and Contingencies of Notes to Condensed Consolidated Financial Statements.\nUse of Credit Derivatives\nThe Company may also use credit default swaps to manage credit exposure or to assume credit risk to enhance yield.\nCredit Risk Reduced Through Credit Derivatives\nThe Company may enter into credit derivatives to purchase credit protection with respect to a single entity or referenced index. The Company purchases credit protection through credit default swaps to economically hedge and manage credit risk of certain fixed maturity investments across multiple sectors of the investment portfolio.\nCredit Risk Assumed Through Credit Derivatives\nThe Company may also enter into credit default swaps that assume credit risk as part of replication transactions. Replication transactions are used as an economical means to synthetically replicate the characteristics and performance of assets that are permissible investments under the Company’s investment policies. These swaps primarily reference investment grade single corporate issuers and indexes.\nFor further information on credit derivatives, see Note 6 - Derivatives of Notes to Condensed Consolidated Financial Statements.\nCredit Risk of Business Operations\nA portion of the Company's Business Insurance business is written with large deductibles or under retrospectively-rated plans. Under some commercial insurance contracts with a large deductible, the Company is obligated to pay the claimant the full amount of the claim and the Company is subsequently reimbursed by the policyholder for the deductible amount. As such, the Company is subject to credit risk until reimbursement is made. Retrospectively-rated policies are utilized primarily for workers' compensation coverage, whereby the ultimate premium is adjusted based on actual losses incurred. Although the premium adjustment feature of a retrospectively-rated policy substantially reduces insurance risk for the Company, it presents credit risk to the Company. The Company’s results of operations could be adversely affected if a significant portion of such policyholders failed to reimburse the Company for the deductible amount or the amount of additional premium owed under retrospectively-rated policies. The Company manages these credit risks through credit analysis, collateral requirements, and oversight.\n96\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nInterest Rate Risk\nInterest rate risk is the risk of financial loss due to adverse changes in the value of assets and liabilities arising from movements in interest rates. Interest rate risk encompasses exposures with respect to changes in the level of interest rates, the shape of the term structure of rates and the volatility of interest rates. Interest rate risk does not include exposure to changes in credit spreads.\nSources of Interest Rate Risk \nThe Company has exposure to interest rate risk arising from investments in fixed maturities and commercial mortgage loans, issuances by the Company of debt securities, preferred stock and similar securities, discount rate assumptions associated with the Company’s claim reserves and pension and other postretirement benefit obligations, and assets that support the Company's pension and other postretirement benefit plans.\nImpact \nChanges in interest rates from current levels can have both favorable and unfavorable effects for the Company.\nManagement \nThe Company primarily manages its exposure to interest rate risk by constructing investment portfolios that seek to protect the Company from the economic impact associated with changes in interest rates by setting portfolio duration targets that are aligned with the duration of the liabilities that they support. The Company analyzes interest rate risk using various models including parametric models and cash flow simulation under various market scenarios of the liabilities and their supporting investment portfolios. Key metrics that the Company uses to quantify its exposure to interest rate risk inherent in its invested assets and the associated liabilities include duration, convexity and key rate duration.\nThe Company may also use interest rate swaps and, to a lesser extent, futures to mitigate interest rate risk associated with its investment portfolio or liabilities and to manage portfolio duration.\nEquity Risk\nEquity risk is the risk of financial loss due to changes in the value of global equities or equity indices. \nSources of Equity Risk\n \nThe Company has exposure to equity risk from invested assets, assets that support the Company’s pension and other postretirement benefit plans, and fee income derived from Hartford Funds AUM.\nImpact \nThe investment portfolio is exposed to losses from market declines affecting equity securities and derivatives, which could negatively impact the Company's reported earnings. In addition, investments in limited partnerships and other alternative investments generally have a level of correlation to domestic equity market levels and can expose the Company to losses in earnings if valuations decline; however, earnings impacts are recognized on a lag as results from private equity investments and other funds are generally reported on a \nthree-month delay. For assets supporting pension and other postretirement benefit plans, the Company may be required to make additional plan contributions if equity investments in the plan portfolios decline in value. Hartford Funds earnings are also significantly influenced by the U.S. and other equity markets. Generally, declines in equity markets will reduce the value of average daily AUM and the amount of fee income generated from those assets. Increases in equity markets will generally have the inverse impact. \nManagement\n The Company uses various approaches in managing its equity exposure, including limits on the proportion of assets invested in equities, diversification of the equity portfolio, and, at times, hedging of changes in equity indices. For assets supporting pension and other postretirement benefit plans, the asset allocation mix is reviewed on a periodic basis. In order to minimize risk, the pension plans maintain a listing of permissible and prohibited investments and impose concentration limits and investment quality requirements on permissible investment options.\nForeign Currency Exchange Risk\n \nForeign currency exchange risk is the risk of financial loss due to changes in the relative value between currencies.\nSources of Currency Risk \nThe Company has foreign currency exchange risk in non-U.S. dollar denominated cash, fixed maturities, equities, and derivative instruments. In addition, the Company has non-U.S. subsidiaries, some with functional currencies other than U.S. dollar, and which transact business in multiple currencies resulting in assets and liabilities denominated in foreign currencies.\nImpact\n \nChanges in relative values between currencies can create variability in cash flows and realized or unrealized gains and losses on changes in the fair value of assets and liabilities.\nManagement\n \nThe Company manages its foreign currency exchange risk primarily through asset-liability matching and through the use of derivative instruments. However, legal entity capital is invested in local currencies in order to satisfy regulatory requirements and to support local insurance operations. The foreign currency exposure of non-U.S. dollar denominated investments will most commonly be reduced through the sale of the assets or through hedges using foreign currency swaps and forwards.\nInvestment Portfolio Risk\nThe credit ratings referenced throughout this section are based on availability and are generally the midpoint of the available ratings among Moody’s, S&P, and Fitch. If no rating is available from a rating agency, then an internally developed rating is used. Accrued investment income related to fixed maturities is not included in the amortized cost or fair value of the fixed maturities. For further information refer to Note 5 - Investments of Notes to Condensed Consolidated Financial Statements.\n97\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nFixed Maturities, AFS by Type\n \nSeptember 30, 2025\nDecember 31, 2024\n \nAmortized Cost\nACL\nGross Unrealized Gains\nGross Unrealized Losses\nFair Value\nPercent of Total Fair Value\nAmortized Cost\nACL\nGross Unrealized Gains\nGross Unrealized Losses\nFair Value\nPercent of Total Fair Value\nABS\nConsumer loans\n$\n2,752 \n$\n— \n$\n34 \n$\n(3)\n$\n2,783 \n6.2 \n%\n$\n2,554 \n$\n— \n$\n19 \n$\n(11)\n$\n2,562 \n6.0 \n%\nOther\n1,718 \n— \n19 \n(14)\n1,723 \n3.8 \n%\n1,394 \n— \n9 \n(28)\n1,375 \n3.3 \n%\nCLOs\n3,368 \n— \n11 \n— \n3,379 \n7.5 \n%\n3,237 \n— \n13 \n— \n3,250 \n7.6 \n%\nCommercial Mortgage-Backed Securities (\"CMBS\")\nAgency [1]\n1,221 \n(14)\n20 \n(93)\n1,134 \n2.5 \n%\n1,284 \n(13)\n16 \n(128)\n1,159 \n2.7 \n%\nBonds\n1,357 \n— \n2 \n(69)\n1,290 \n2.8 \n%\n1,597 \n— \n1 \n(114)\n1,484 \n3.5 \n%\nInterest only\n74 \n— \n3 \n(3)\n74 \n0.2 \n%\n95 \n— \n4 \n(6)\n93 \n0.2 \n%\nCorporate\nBasic industry\n1,140 \n— \n17 \n(18)\n1,139 \n2.5 \n%\n1,100 \n— \n5 \n(43)\n1,062 \n2.5 \n%\nCapital goods\n1,757 \n— \n45 \n(32)\n1,770 \n3.9 \n%\n1,769 \n— \n14 \n(69)\n1,714 \n4.0 \n%\nConsumer cyclical\n1,687 \n— \n35 \n(37)\n1,685 \n3.7 \n%\n1,599 \n— \n9 \n(63)\n1,545 \n3.6 \n%\nConsumer non-cyclical\n2,826 \n— \n55 \n(80)\n2,801 \n6.2 \n%\n2,641 \n— \n16 \n(139)\n2,518 \n5.9 \n%\nEnergy\n1,518 \n— \n29 \n(36)\n1,511 \n3.3 \n%\n1,395 \n— \n10 \n(59)\n1,346 \n3.2 \n%\nFinancial services\n7,162 \n— \n82 \n(130)\n7,114 \n15.7 \n%\n6,455 \n— \n28 \n(245)\n6,238 \n14.7 \n%\nTech./comm.\n3,222 \n— \n66 \n(93)\n3,195 \n7.1 \n%\n2,848 \n— \n19 \n(169)\n2,698 \n6.3 \n%\nTransportation\n871 \n— \n13 \n(36)\n848 \n1.9 \n%\n930 \n— \n5 \n(58)\n877 \n2.1 \n%\nUtilities\n2,768 \n— \n43 \n(116)\n2,695 \n6.0 \n%\n2,464 \n(3)\n11 \n(167)\n2,305 \n5.4 \n%\nReal estate investment trusts (\"REITs\")\n325 \n— \n4 \n(8)\n321 \n0.7 \n%\n354 \n— \n— \n(21)\n333 \n0.8 \n%\nForeign govt./govt. agencies\n403 \n— \n9 \n(3)\n409 \n0.9 \n%\n500 \n— \n3 \n(23)\n480 \n1.1 \n%\nMunicipal bonds\nTaxable\n1,571 \n— \n21 \n(94)\n1,498 \n3.3 \n%\n1,384 \n— \n6 \n(126)\n1,264 \n3.0 \n%\nTax-exempt\n3,119 \n— \n61 \n(197)\n2,983 \n6.6 \n%\n4,190 \n— \n71 \n(221)\n4,040 \n9.5 \n%\nResidential Mortgage-Backed Securities (\"RMBS\")\nAgency\n3,193 \n— \n27 \n(150)\n3,070 \n6.8 \n%\n3,002 \n— \n7 \n(225)\n2,784 \n6.5 \n%\nNon-agency\n2,794 \n— \n16 \n(115)\n2,695 \n6.0 \n%\n2,586 \n— \n6 \n(168)\n2,424 \n5.7 \n%\nSub-prime\n13 \n— \n— \n— \n13 \n— \n%\n22 \n— \n— \n— \n22 \n0.1 \n%\nU.S. Treasuries\n1,192 \n— \n6 \n(125)\n1,073 \n2.4 \n%\n1,138 \n— \n— \n(144)\n994 \n2.3 \n%\nTotal fixed maturities, AFS\n$\n46,051\n \n$\n(14)\n$\n618\n \n$\n(1,452)\n$\n45,203\n \n100.0\n \n%\n$\n44,538\n \n$\n(16)\n$\n272\n \n$\n(2,227)\n$\n42,567\n \n100.0\n \n%\nFVO securities\n$\n191\n \n$\n308\n \n[1]\nIncludes securities with pools of loans issued by the Small Business Administration which are backed by the full faith and credit of the U.S. government.\nThe fair value of fixed maturities, AFS increased as compared to December 31, 2024, primarily due to net additions of corporate bonds and high-quality ABS, partially offset by net reductions to \ntax-exempt municipal bonds. The increase was also due to higher valuations as a result of lower interest rates and tighter credit spreads.\n98\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nFixed Maturities, AFS by Credit Quality\n \nSeptember 30, 2025\nDecember 31, 2024\n \nAmortized Cost\nFair Value\nPercent of Total Fair Value\nAmortized Cost\nFair Value\nPercent of Total Fair Value\nUnited States Government/Government agencies\n$\n5,606 \n$\n5,277 \n11.7 \n%\n$\n5,424 \n$\n4,937 \n11.6 \n%\nAAA\n7,563 \n7,482 \n16.6 \n%\n7,340 \n7,166 \n16.8 \n%\nAA\n7,463 \n7,313 \n16.2 \n%\n7,762 \n7,484 \n17.6 \n%\nA\n12,810 \n12,628 \n27.9 \n%\n11,422 \n10,933 \n25.7 \n%\nBBB\n10,293 \n10,179 \n22.5 \n%\n10,227 \n9,722 \n22.8 \n%\nBB & below\n2,316 \n2,324 \n5.1 \n%\n2,363 \n2,325 \n5.5 \n%\nTotal fixed maturities, AFS [1]\n$\n46,051\n \n$\n45,203\n \n100.0\n \n%\n$\n44,538\n \n$\n42,567\n \n100.0\n \n%\n[1]\nExcludes FVO securities. For further discussion on FVO securities, see Note 4 - Fair Value Measurements\n \nof Notes to Condensed Consolidated Financial Statements.\nCommercial & Residential Real Estate\nExposure to CMBS & RMBS Bonds by Credit Quality as of September 30, 2025\n \nAAA\nAA\nA\nBBB\nBB and Below\nTotal\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nCMBS\n   Agency [1]\n$\n12 \n$\n11 \n$\n1,209 \n$\n1,123 \n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \n$\n1,221 \n$\n1,134 \n   Bonds\n460 \n448 \n401 \n380 \n199 \n186 \n162 \n157 \n135 \n119 \n1,357 \n1,290 \n   Interest Only\n41 \n41 \n24 \n24 \n4 \n5 \n5 \n4 \n— \n— \n74 \n74 \nTotal CMBS\n513\n \n500\n \n1,634\n \n1,527\n \n203\n \n191\n \n167\n \n161\n \n135\n \n119\n \n2,652\n \n2,498\n \nRMBS\n   Agency\n— \n— \n3,193 \n3,070 \n— \n— \n— \n— \n— \n— \n3,193 \n3,070 \n   Non-Agency\n1,714 \n1,648 \n778 \n752 \n243 \n238 \n55 \n53 \n4 \n4 \n2,794 \n2,695 \n   Sub-Prime\n1 \n1 \n3 \n3 \n1 \n1 \n5 \n5 \n3 \n3 \n13 \n13 \nTotal RMBS\n1,715\n \n1,649\n \n3,974\n \n3,825\n \n244\n \n239\n \n60\n \n58\n \n7\n \n7\n \n6,000\n \n5,778\n \nTotal CMBS & RMBS\n$\n2,228\n \n$\n2,149\n \n$\n5,608\n \n$\n5,352\n \n$\n447\n \n$\n430\n \n$\n227\n \n$\n219\n \n$\n142\n \n$\n126\n \n$\n8,652\n \n$\n8,276\n \nExposure to CMBS & RMBS Bonds by Credit Quality as of December 31, 2024\n \nAAA\nAA\nA\nBBB\nBB and Below\nTotal\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nCMBS\n   Agency [1]\n$\n14 \n$\n14 \n$\n1,270 \n$\n1,145 \n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \n$\n1,284 \n$\n1,159 \n   Bonds\n609 \n578 \n407 \n376 \n267 \n240 \n147 \n137 \n167 \n153 \n1,597 \n1,484 \n   Interest Only\n53 \n51 \n31 \n31 \n6 \n6 \n5 \n5 \n— \n— \n95 \n93 \nTotal CMBS\n676\n \n643\n \n1,708\n \n1,552\n \n273\n \n246\n \n152\n \n142\n \n167\n \n153\n \n2,976\n \n2,736\n \nRMBS\n   Agency\n— \n— \n3,002 \n2,784 \n— \n— \n— \n— \n— \n— \n3,002 \n2,784 \n   Non-Agency\n1,564 \n1,467 \n746 \n697 \n203 \n193 \n65 \n61 \n8 \n6 \n2,586 \n2,424 \n   Sub-Prime\n1 \n1 \n5 \n5 \n2 \n2 \n7 \n7 \n7 \n7 \n22 \n22 \nTotal RMBS\n1,565\n \n1,468\n \n3,753\n \n3,486\n \n205\n \n195\n \n72\n \n68\n \n15\n \n13\n \n5,610\n \n5,230\n \nTotal CMBS & RMBS\n$\n2,241\n \n$\n2,111\n \n$\n5,461\n \n$\n5,038\n \n$\n478\n \n$\n441\n \n$\n224\n \n$\n210\n \n$\n182\n \n$\n166\n \n$\n8,586\n \n$\n7,966\n \n[1]\nIncludes securities with pools of loans issued by the Small Business Administration which are backed by the full faith and credit of the U.S. government.\n99\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe Company also has exposure to commercial mortgage loans. These loans are collateralized by real estate properties that are diversified both geographically throughout the United States and by property type. These commercial loans are originated by the Company as high quality whole loans, and the Company may sell participation interests in one or more loans to third parties. A loan participation interest represents a pro-rata share in interest and principal payments generated by the participated loan, and the relationship between the Company as loan originator, lead participant and servicer and the third party as a participant are governed by a participation agreement.\nAs of September 30, 2025, mortgage loans had an amortized cost of $6.7 billion and carrying value of $6.6 billion, with an ACL of $49. As of December 31, 2024, mortgage loans had an amortized cost of $6.4 billion and carrying value of $6.4 billion, with an ACL of $44.\nThe Company funded $786 of commercial mortgage loans, primarily industrial and multifamily properties, with a weighted average loan-to-value (“\nLTV\n”) ratio of 57% and a weighted average yield of 6.5% during the nine months ended September 30, 2025. The Company continues to originate commercial mortgage loans on institutional-quality properties with strong LTV ratios. There were no mortgage loans held for sale as of September 30, 2025, or December 31, 2024.\nMunicipal Bonds\nAvailable-For-Sale Investments in Municipal Bonds\n \nSeptember 30, 2025\nDecember 31, 2024\n \nAmortized Cost\nFair Value\nWeighted Average Credit Quality\nAmortized Cost\nFair Value\nWeighted Average Credit Quality\nGeneral Obligation\n$\n839 \n$\n834 \nAA\n$\n1,033 \n$\n1,008 \nAA\nPre-Refunded [1]\n45 \n45 \nAA+\n86 \n87 \nAA+\nRevenue\nTransportation\n934 \n892 \n A+ \n1,134 \n1,084 \nA+\nHealth Care\n878 \n815 \n A+ \n864 \n789 \nA+\nLeasing [2]\n528 \n501 \n AA \n627 \n588 \nAA\nEducation\n358 \n344 \n AA \n402 \n385 \nAA\nWater & Sewer\n250 \n230 \n AA \n308 \n289 \nAA\nSales Tax\n165 \n163 \n AA \n183 \n183 \nAA\nPower\n152 \n144 \n A+ \n281 \n272 \nA\nHousing\n145 \n140 \n AA \n195 \n185 \nAA\nOther\n396 \n373 \n AA- \n461 \n434 \nAA-\nTotal Revenue\n3,806 \n3,602 \nAA-\n4,455 \n4,209 \nAA-\nTotal Municipal\n$\n4,690\n \n$\n4,481\n \nAA-\n$\n5,574\n \n$\n5,304\n \nAA-\n[1]\nPre-refunded bonds are bonds for which an irrevocable trust containing sufficient U.S. treasury, agency, or other securities has been established to fund the remaining payments of principal and interest.\n[2]\nLeasing revenue bonds are generally the obligations of a financing authority established by the municipality that leases facilities back to a municipality. The notes are typically secured by lease payments made by the municipality that is leasing the facilities financed by the issue. Lease payments may be subject to annual appropriation by the municipality, or the municipality may be obligated to appropriate general tax revenues to make lease payments.\nAs of September 30, 2025, the largest issuer concentrations were CommonSpirit Health, the State of California, and the Metropolitan Transportation Authority, which each comprised less than 3% of the municipal bond portfolio and were primarily comprised of general obligation and revenue bonds. As of December 31, 2024, the largest issuer concentrations were the State of Illinois, the State of California, and the Metropolitan Transportation Authority, which each comprised less than 3% of the municipal bond portfolio and were primarily comprised of general obligation and revenue bonds. In total, municipal bonds make up 7% of the fair value of the Company's investment portfolio.\nLimited Partnerships and Other Alternative Investments\nThe following table presents the Company’s investments in limited partnerships and other alternative investments which include real estate joint ventures, real estate funds, private equity funds, other funds, and other alternative investments. Private equity funds primarily consist of investments in funds whose assets typically consist of a diversified pool of investments in small to mid-sized non-public businesses with high growth potential and strong owner sponsorship, as well as limited exposure to public markets.\nIncome or losses on investments in limited partnerships and other alternative investments are recognized on a lag as results from private equity investments and other funds are generally reported on a three-month delay.\n100\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nLimited Partnerships and Other Alternative Investments - Net Investment Income\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\n \nAmount\nYield [1]\nAmount\nYield [1]\nAmount\nYield [1]\nAmount\nYield [1]\nReal estate joint ventures and funds\n$\n(11)\n(2.2\n%)\n$\n(13)\n(2.5\n%)\n$\n(33)\n(2.3\n%)\n$\n(79)\n(5.3\n%)\nPrivate equity funds\n56 \n10.2\n%\n29 \n6.1\n%\n95 \n6.2\n%\n71 \n5.1\n%\nOther funds\n33 \n18.3\n%\n12 \n8.6\n%\n59 \n11.8\n%\n40 \n10.5\n%\nOther alternative investments [2]\n13 \n8.8\n%\n9 \n6.6\n%\n22 \n5.2\n%\n37 \n9.7\n%\nTotal\n$\n91\n \n6.7\n \n%\n$\n37\n \n3.0\n \n%\n$\n143\n \n3.7\n \n%\n$\n69\n \n1.9\n \n%\n [1]Yields calculated using annualized net investment income divided by the monthly average invested assets.\n[2]Consists of an insurer-owned life insurance policy, which is primarily invested in private equity funds and fixed income.\nInvestments in Limited Partnerships and Other Alternative Investments\n \nSeptember 30, 2025\nDecember 31, 2024\n \nAmount\nPercent\nAmount\nPercent\nReal estate joint ventures and funds\n$\n1,915 \n34.4\n%\n$\n1,907 \n37.8\n%\nPrivate equity funds\n2,302 \n41.4\n%\n1,956 \n38.8\n%\nOther funds\n770 \n13.9\n%\n623 \n12.4\n%\nOther alternative investments [1]\n573 \n10.3\n%\n556 \n11.0\n%\nTotal\n$\n5,560\n \n100.0\n%\n$\n5,042\n \n100.0\n%\n [1]Consists of an insurer-owned life insurance policy which is primarily invested in private equity funds and fixed income.\nFixed Maturities, AFS — Unrealized Loss Aging\nThe total gross unrealized losses were $1.5 billion as of September 30, 2025, and have decreased $775 since December 31, 2024, primarily due to lower interest rates and tighter credit spreads. As of September 30, 2025, $1.1 billion of the gross unrealized losses were associated with fixed maturities, AFS depressed less than 20% of amortized cost. The remaining $0.3 billion of gross unrealized losses were associated with fixed maturities, AFS depressed greater than 20%. The fixed maturities, AFS depressed more than 20% primarily related to corporate fixed maturities, municipal bonds, and U.S. Treasuries, that are mainly depressed because current interest rates are higher than at the respective purchase dates.\nAs part of the Company’s ongoing investment monitoring process, the Company has reviewed its fixed maturities, AFS in an unrealized loss position and concluded that these fixed maturities are temporarily depressed and are expected to recover in value as the investments approach maturity or as market spreads tighten. For these fixed maturities in an unrealized loss position where an ACL has not been recorded, the Company’s best estimate of expected future cash flows are sufficient to recover the amortized cost basis of the investment. Furthermore, the Company neither has an intention to sell nor does it expect to be required to sell these investments. For further information regarding the Company’s ACL analysis, see the Credit Losses on Fixed Maturities, AFS and Intent-to-Sell Impairments section below.\nUnrealized Loss Aging for Fixed Maturities, AFS Securities\n \nSeptember 30, 2025\nDecember 31, 2024\nConsecutive Months\nItems\nAmortized Cost\nACL\nUnrealized Loss\nFair Value\nItems\nAmortized Cost\nACL\nUnrealized Loss\nFair Value\nThree months or less\n154 \n$\n961 \n$\n— \n$\n(5)\n$\n956 \n1,044 \n$\n9,577 \n$\n— \n$\n(186)\n$\n9,391 \nGreater than three to six months\n25 \n369 \n— \n(5)\n364 \n71 \n678 \n— \n(24)\n654 \nGreater than six to nine months\n87 \n689 \n— \n(12)\n677 \n13 \n33 \n— \n(1)\n32 \nGreater than nine to eleven months\n173 \n1,692 \n— \n(30)\n1,662 \n44 \n363 \n— \n(32)\n331 \nTwelve months or more\n2,341 \n16,136 \n(14)\n(1,400)\n14,722 \n2,761 \n18,938 \n(13)\n(1,984)\n16,941 \nTotal\n2,780\n \n$\n19,847\n \n$\n(14)\n$\n(1,452)\n$\n18,381\n \n3,933\n \n$\n29,589\n \n$\n(13)\n$\n(2,227)\n$\n27,349\n \n101\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nUnrealized Loss Aging for Fixed Maturities, AFS Continuously Depressed Over 20%\n \nSeptember 30, 2025\nDecember 31, 2024\nConsecutive Months\nItems\nAmortized Cost\nACL\nUnrealized Loss\nFair Value\nItems\nAmortized Cost\nACL\n Unrealized Loss\nFair Value\nThree months or less\n— \n$\n— \n$\n— \n$\n— \n$\n— \n132 \n$\n1,003 \n$\n(3)\n$\n(224)\n$\n776 \nGreater than three to six months\n8 \n74 \n— \n(15)\n59 \n3 \n3 \n— \n(1)\n2 \nGreater than six to nine months\n16 \n102 \n— \n(22)\n80 \n4 \n24 \n(1)\n(6)\n17 \nGreater than nine to eleven months\n41 \n269 \n— \n(62)\n207 \n4 \n44 \n— \n(12)\n32 \nTwelve months or more\n86 \n771 \n(1)\n(231)\n539 \n93 \n811 \n(1)\n(259)\n551 \nTotal\n151\n \n$\n1,216\n \n$\n(1)\n$\n(330)\n$\n885\n \n236\n \n$\n1,885\n \n$\n(5)\n$\n(502)\n$\n1,378\n \nCredit Losses on Fixed Maturities, AFS and Intent-to-Sell Impairments\nThree and nine months ended September 30, 2025\nFor the three months ended September 30, 2025, the Company recorded no credit losses. For the nine months ended September 30, 2025, the Company recorded a net credit loss reversal of $2, primarily attributable to a decrease in the ACL of $3 on one below investment grade corporate issuer, partially offset by a credit loss of $1 related to a CMBS. For the three and nine months ended September 30, 2025, there were no unrealized losses on securities with an ACL recognized in other comprehensive income (\"OCI\"). For further information, refer to Note 5 - Investments of Notes to Condensed Consolidated Financial Statements.\nThere were no intent-to-sell impairments.\nThe Company incorporates its best estimate of future performance using internal assumptions and judgments that are informed by economic and industry specific trends, as well as our expectations with respect to security specific developments.\nFuture intent-to-sell impairments or credit losses may develop as the result of changes in our intent to sell specific securities that are in an unrealized loss position or if modeling assumptions, such as macroeconomic factors or security specific developments, change unfavorably from our current modeling assumptions, resulting in lower cash flow expectations.\nThree and nine months ended September 30, 2024\nFor the three and nine months ended September 30, 2024, the Company recorded net credit losses of $0 and $2, respectively. Net credit losses were primarily attributable to increases in the ACL of $1 on CMBS and $1 on a below investment grade corporate issuer. For the three and nine months ended September 30, 2024 unrealized losses on securities with an ACL recognized in OCI were $0 and less than $1, respectively.\nThere were no intent-to-sell impairments.\nACL on Mortgage Loans\nThree and nine months ended September 30, 2025\nThe Company reviews mortgage loans on a quarterly basis to estimate the ACL with changes in the ACL recorded in net realized gains and losses. Apart from an ACL recorded on individual mortgage loans where the borrower is experiencing financial difficulties, the Company records an ACL on the pool of mortgage loans based on lifetime expected credit losses. For further information, refer to Note 5 - Investments of Notes to Condensed Consolidated Financial Statements.\nFor both the three and nine months ended September 30, 2025, the Company recorded an increase in the ACL on mortgage loans of $6. The increase in the allowance is primarily attributable to weaker real estate fundamentals, property specific declines, and net additions of new loans.\nThree and nine months ended September 30, 2024\nFor the three months ended September 30, 2024, there were no credit loss adjustments on mortgage loans. For the nine months ended September 30, 2024, the Company recorded a credit loss reversal of $3 primarily attributable to improved economic scenario forecasts and property specific improvements, partially offset by net additions of new loans.\n102\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nCapital Resources and Liquidity\nThe following section discusses the overall financial strength of The Hartford and its insurance operations including their ability to generate cash flows from each of their business segments, borrow funds at competitive rates and raise new capital to meet operating and growth needs.\nSummary of Capital Resources and Liquidity\nCapital available to the HIG Holding Company as of September 30, 2025:\n•\nApproximately $1.3 billion in fixed maturities, short-term investments, investment sales receivable and cash at the HIG Holding Company;\n•\nA senior unsecured revolving credit facility that provides for borrowing capacity up to $750 of unsecured credit through September 24, 2030. As of September 30, 2025, there were no borrowings outstanding; and\n•\nAn intercompany liquidity agreement that allows for short-term advances of funds among the HIG Holding Company and certain affiliates of up to $2.0 billion for liquidity and other general corporate purposes. As of September 30, 2025, $1.85 billion was available, $150 was outstanding between certain affiliates and there were no amounts outstanding at the HIG Holding company.\nDividends and other sources of capital for the nine months ended September 30, 2025:\nThe future payment of dividends from our subsidiaries is dependent on several factors including the business results, capital position and liquidity of our subsidiaries.\n•\nP&C - \nHIG Holding Company received $1.1 billion of net dividends from the Company's property and casualty insurance subsidiaries through September 30, 2025;\n•\nEmployee Benefits -\n HIG Holding Company received $517 in dividends from Hartford Life and Accident Insurance Company (\"\nHLA\n\") through September 30, 2025;\n•\nHartford Funds\n - HIG Holding Company received $115 in dividends from Hartford Funds through September 30, 2025; and\n•\nOther\n - HIG Holding Company received $30 in dividends from other subsidiaries through September 30, 2025. \nExpected liquidity requirements for the next twelve months as of September 30, 2025:\n•\n$194 of interest on debt. See Note 13 - Debt of Notes to Consolidated Financial Statements in The Hartford's 2024 Form 10-K Annual Report.\n•\n$21 dividends on preferred stock, subject to the discretion of the Board of Directors; and\n•\n$655 of common stockholders' dividends, subject to the discretion of the Board of Directors and before share repurchases.\nExpected liquidity requirements for beyond the next twelve months as of September 30, 2025:\n•\nInterest on and repayments of debt. See Note 13 - Debt of Notes to Consolidated Financial Statements in The Hartford's 2024 Form 10-K Annual Report; and\n•\nPreferred stock and common stock dividends, subject to the discretion of the Board of Directors.\n \nEquity repurchase program:\nDuring the nine months ended September 30, 2025, the Company repurchased 9.9 million common shares for $1.2 billion under the $3.3 billion share repurchase program authorized by the Board of Directors, effective through December 31, 2026. As of September 30, 2025, the Company has $1.95 billion remaining for equity repurchases under the current share repurchase program. During the period October 1, 2025 through October 24, 2025, the Company repurchased 1.0 million common shares for $131.\nThe timing of any repurchases of shares is dependent on several factors, including the market price of the Company's securities, the Company's capital position, consideration of the effect of any repurchases on the Company's financial strength or credit ratings, the Company's blackout periods, and other considerations.\nLiquidity Requirements and Sources of Capital\nThe HIG Holding Company\nThe liquidity requirements of the HIG Holding Company will primarily be met by HIG Holding Company's fixed maturities; short-term investments and cash; and dividends from its subsidiaries, principally its insurance operations\n. \nThe Company maintains sufficient liquidity and has a variety of contingent liquidity resources to manage liquidity across a range of economic scenarios. \nThe HIG Holding Company expects to continue to receive dividends from its operating subsidiaries in the future and manages capital in its operating subsidiaries to be sufficient under significant economic stress scenarios. Dividends from subsidiaries and other sources of funds at the holding company may be used to repurchase shares under the authorized share repurchase program at the discretion of management.\nUnder significant economic stress scenarios, the Company has the ability to meet short-term cash requirements, if needed, by \n103\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nborrowing under its revolving credit facility or by having its insurance subsidiaries take collateralized advances under a facility with the FHLBB. The Company could also choose to have its insurance subsidiaries sell certain highly liquid, high quality fixed maturities or the Company could issue debt in the public markets under its shelf registration. \nDividends\nThe Hartford's Board of Directors declared the following quarterly dividends since July 1, 2025:\nCommon Stock Dividends\nDeclared\nRecord\nPayable\nAmount per share\nJuly 23, 2025\nSeptember 2, 2025\nOctober 2, 2025\n$\n0.520 \nOctober 27, 2025\nDecember 1, 2025\nJanuary 5, 2026\n$\n0.600 \nPreferred Stock Dividends\nDeclared\nRecord\nPayable\nAmount per share\nJuly 23, 2025\nNovember 3, 2025\nNovember 17, 2025\n$\n375.00 \nThere are no current restrictions on the HIG Holding Company's ability to pay dividends to its stockholders.\nFor a discussion of restrictions on dividends to the HIG Holding Company from its insurance subsidiaries, see the following \"Dividends from Subsidiaries\" discussion. For a discussion of potential restrictions on the HIG Holding Company's ability to pay dividends, see the risk factor \"Our ability to declare and pay dividends is subject to limitations\" in Item 1A of Part I of the Company’s Annual Report on Form 10-K for the year ended December 31, 2024.\nDividends From Subsidiaries\nDividends to HIG Holding Company from its insurance subsidiaries are restricted by insurance regulation. For a discussion of restrictions on dividends to HIG Holding Company from its insurance subsidiaries see Part II, Item 7, MD&A – Capital Resources and Liquidity - Dividends from Subsidiaries in The Hartford’s 2024 Form 10-K Annual Report.\nThrough the first nine months of 2025, HIG Holding Company received $1.8 billion of net dividends from its subsidiaries, including $517 from HLA, $115 from Hartford Funds, $30 from other subsidiaries and $1.1 billion from its P&C subsidiaries, excluding $50 of P&C dividends that were subsequently contributed to P&C subsidiaries and $66 of P&C dividends related to interest payments on an intercompany note owed by Hartford Holdings, Inc. (\"HHI\") to Hartford Fire Insurance Company.\nOther Sources of Capital for the HIG Holding Company\nThe Hartford endeavors to maintain a capital structure that provides financial and operational flexibility to its insurance subsidiaries, ratings that support its competitive position in the financial services marketplace (see the \"Ratings\" section below for further discussion), and stockholder returns. As a result, the Company may from time to time raise capital from the issuance of debt, common equity, preferred stock, equity-related debt or other capital securities and is continuously evaluating strategic opportunities. The issuance of debt, common equity, equity-related debt or other capital securities could result in the dilution of stockholder interests or reduced net income to common stockholders due to additional interest expense or preferred stock dividends.\nShelf Registrations \nThe Hartford filed an automatic shelf registration statement with the Securities and Exchange Commission on September 23, 2024 that permits it to offer and sell debt and equity securities during the three-year life of the registration statement.\nFor further information regarding shelf registrations, see Note 13 - Debt of Notes to Consolidated Financial Statements included in the Company's 2024 Form 10-K Annual Report.\nRevolving Credit Facility\nThe Hartford has a $750 senior unsecured revolving credit facility, including $100 available to support letters of credit (the \"Credit Facility\"). On September 24, 2025, The Hartford amended and restated the Credit Facility, which, among other changes, extends the term of the facility through September 24, 2030. As of September 30, 2025, no borrowings were outstanding and no letters of credit were issued under the Credit Facility and The Hartford was in compliance with all financial covenants. For further information regarding the Credit Facility, see Note 13 - Debt of Notes to Condensed Consolidated Financial Statements and Note 13 - Debt of Notes to Consolidated Financial Statements included in the Company’s 2024 Form 10-K Annual Report.\nIntercompany Liquidity Agreements\nThe Company has $2.0 billion available under an intercompany liquidity agreement that allows for short-term advances of funds among the HIG Holding Company and certain affiliates of up to $2.0 billion for liquidity and other general corporate purposes. The Connecticut Department of Insurance (\"CTDOI\") granted approval for certain affiliated insurance companies that are parties to the agreement to treat receivables from a parent, including the HIG Holding Company, as admitted assets for statutory accounting purposes.\nAs of September 30, 2025, $1.85 billion was available, $150 was outstanding between certain affiliates, and there were no amounts outstanding at the HIG Holding Company.\n104\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nCollateralized Advances with Federal Home Loan Bank of Boston\nThe Company’s subsidiaries, Hartford Fire Insurance Company (“Hartford Fire”) and HLA, are members of the FHLBB. Membership allows these subsidiaries access to collateralized advances, which may be short- or long-term with fixed or variable rates. Advances may be used to support general corporate purposes, which would be presented as short- or long-term debt, or to earn incremental investment income, which would be presented in other liabilities consistent with other collateralized financing transactions. As of September 30, 2025, there were no advances outstanding. \nPrior to October 1, 2025, the CTDOI permitted Hartford Fire and HLA to pledge up to $1.4 billion and $0.6 billion in qualifying assets, respectively without prior approval to secure FHLBB advances. Effective October 1, 2025, the Company is no longer subject to the CTDOI hypothecation limit or approval related to FHLBB advances. The Company’s pledge capacity is now subject to FHLBB’s collateral eligibility requirements, which may be amended at their discretion. Based on these requirements, the Company estimates that Hartford Fire and HLA can each pledge up to $2 billion to secure FHLBB advances.\nFor further information regarding collateralized advances with FHLBB, see Note 13 - Debt of Notes to Condensed Consolidated Financial Statements.\nLloyd's Letter of Credit Facility\nThe Hartford has a committed credit facility agreement with a syndicate of lenders (the \"Lloyd's Facility\"). On October 21, 2024, The Hartford amended and restated its Lloyd’s Facility agreement. The amended and restated Lloyd's Facility has two tranches with one tranche extending a $74 commitment and the other tranche extending a £74 million ($100 as of September 30, 2025) commitment. As of September 30, 2025, letters of credit with an aggregate face amount of $74 and £74 million, or $100, were outstanding under the Lloyd's Facility.\nAmong other covenants, the Lloyd's Facility contains financial covenants regarding The Hartford's consolidated net worth and financial leverage. As of September 30, 2025, The Hartford was in compliance with all financial covenants of the facility.\nFor further information regarding the Lloyd's Facility, see Note 13 - Debt of Notes to Consolidated Financial Statements included in the Company’s 2024 Form 10-K Annual Report.\nPension Plans and Other Postretirement Benefits\nThe Company does not have a 2025 required minimum funding contribution for the U.S. qualified defined benefit pension plan and the funding requirements for all pension plans are expected to be immaterial. Based on the funded status of the U.S. qualified defined benefit pension plan, the Company does not anticipate contributing to the plan in 2025.\n \nFor further discussion of pension and other postretirement benefit obligations, see Note 17 - Employee Benefit Plans of Notes to Condensed Consolidated Financial Statements.\nDerivative Commitments\nCertain of the Company’s derivative agreements contain provisions that are tied to the financial strength ratings, as set by nationally recognized statistical rating agencies, of the individual legal entity that entered into the derivative agreement. If the legal entity’s financial strength were to fall below certain ratings, the counterparties to the derivative agreements could terminate agreements and demand immediate settlement of the outstanding net derivative positions transacted under each agreement. For further information, refer to Note 14 - Commitments and Contingencies of Notes to Condensed Consolidated Financial Statements.\nAs of September 30, 2025, no derivative positions would be subject to immediate termination in the event of a downgrade of one level below the current financial strength ratings. This could change as a result of changes in our hedging activities or to the extent changes in contractual terms are negotiated.\nInsurance Operations\nWhile subject to variability period to period, underwriting and investment cash flows continue to provide sufficient liquidity to meet anticipated demands. \nThe principal sources of operating funds are premiums, fees earned from insurance and administrative service agreements and investment income, while investing cash flows primarily originate from maturities and sales of invested assets. \nThe Company’s insurance operations consist of property and casualty insurance products (collectively referred to as “Property & Casualty Operations”) and Employee Benefits products.\nThe Company's insurance operations hold fixed maturity securities, including a significant short-term investment position (securities with maturities of one year or less at the time of purchase), to meet liquidity needs. Liquidity requirements that are unable to be funded by the Company's insurance operations' short-term investments would be satisfied with current operating funds, including premiums or investing cash flows, which includes proceeds received through the sale of invested assets. A sale of invested assets could result in significant realized losses.\nThe following tables represent the fixed maturity holdings, including the aforementioned cash and short-term investments available to meet liquidity needs, for each of the Company’s insurance operations.\nProperty & Casualty Operations\nAs of September 30, 2025\nFixed maturities\n$\n37,096 \nShort-term investments\n2,295 \nCash\n115 \nLess: Derivative collateral\n62 \nTotal\n$\n39,444\n \nProperty & Casualty operations invested assets also include $149 in equity securities, $5.0 billion in mortgage loans and $4.3 billion in limited partnerships and other alternative investments.\n105\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nEmployee Benefits Operations\nAs of September 30, 2025\nFixed maturities\n$\n8,106 \nShort-term investments\n297 \nCash\n11 \nLess: Derivative collateral\n17 \nTotal\n$\n8,397\n \nEmployee Benefits operations invested assets also include $34 in equity securities, $1.6 billion in mortgage loans and $1.1 billion in limited partnerships and other alternative investments.\nThe primary uses of funds are to pay claims, claim adjustment expenses, commissions and other underwriting and insurance operating costs, to pay taxes, to purchase new investments and to make dividend payments to the HIG Holding Company.\nProperty & Casualty reserves for unpaid losses and loss adjustment expenses as of September 30, 2025 were $37.7 billion and net of reinsurance and other recoverables were $31.1 billion. Reserves for Property & Casualty unpaid losses and loss adjustment expenses include case reserves and incurred but not reported (\"\nIBNR\"\n) reserves. The ultimate amount to be paid to settle both case and IBNR reserves is an estimate, subject to significant uncertainty. The actual amount to be paid is not finally determined until the Company reaches a settlement with the claimant. Final claim settlements may vary significantly from the present estimates, particularly since many claims will not be settled until well into the future. For a discussion of The Hartford’s judgment in estimating reserves for Property & Casualty see Part II, Item 7, MD&A - Critical Accounting Estimates, Property & Casualty Insurance Product Reserves, Net of Reinsurance, in the Company's 2024 Form 10-K Annual Report, and for historical payments by reserve line net of reinsurance, see Note 10 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Consolidated Financial Statements included in the Company's 2024 Form 10-K Annual Report. The timing of future payments for the next twelve months and for beyond twelve months could vary materially from historical payment patterns due to, among other things, changes in claim reporting and payment patterns and large unanticipated settlements. In particular, there is significant uncertainty over the claim payment patterns of asbestos and environmental claims.\nEmployee Benefits reserves as of September 30, 2025 were $8.8 billion and net of reinsurance were $8.5 billion. Group life and disability obligations are estimated using assumptions based on the Company’s historical experience, modified for recent observed trends. For a discussion of The Hartford’s judgment in estimating LTD reserves for Employee Benefits see Part II, Item 7, MD&A - Critical Accounting Estimates, Employee Benefit LTD Reserves, Net of Reinsurance, in the Company’s 2024 Form 10-K Annual Report. For additional information about future policy benefits and other policyholder funds and benefits payable, see Note 10 - Reserve for Future Policy Benefits and Note 11 - Other Policyholder Funds and Benefits Payable of Notes to Condensed Consolidated Financial Statements. For historical payments by reserve line, net of reinsurance, see Note 10 - Reserve for Unpaid Losses and Loss Adjustment Expenses of Notes to Consolidated Financial Statements included in the Company's 2024 Form 10-K Annual Report. Due to the significance of the assumptions used, payments for the next \ntwelve months and beyond twelve months could materially differ from historical patterns.\nCorporate reserves as of September 30, 2025 were $367 and net of reinsurance were $146. These reserves related to retained run-off liabilities of its former life and annuity business. For additional information about future policy benefits and other policyholder funds and benefits payable, see Note 10 - Reserve for Future Policy Benefits and Note 11 - Other Policyholder Funds and Benefits Payable of Notes to Condensed Consolidated Financial Statements.\nHartford Funds\nHartford Funds' principal sources of operating funds are fees earned from basis points on AUM with uses primarily for payments to subadvisors and other general operating expenses. As of September 30, 2025, Hartford Funds cash and short-term investments were $372.\nPurchase and Other Obligations\nThe Hartford’s unfunded commitments to purchase investments in limited partnerships and other alternative investments, mortgage loans, private debt and equity securities, as well as tax credits are disclosed in Note 14 - Commitments and Contingencies of Notes to Consolidated Financial Statements in The Hartford's 2024 Form 10-K Annual Report. It is anticipated that these unfunded commitments will be funded through the Company’s normal operating and investing activities.\nIn the normal course of business, the Company enters into contractual commitments to purchase various goods and services such as maintenance, human resources, and information technology. The Company’s operating lease commitments are disclosed in Note 20 - Leases of Notes to Consolidated Financial Statements in The Hartford's 2024 Form 10-K Annual Report. It is anticipated that these purchase commitments and operating lease obligations will be funded through the Company’s normal operating and investing activities.\n106\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nCapitalization\nCapital Structure\nSeptember 30, 2025\nDecember 31, 2024\nChange\nLong-term debt\n$\n4,370 \n$\n4,366 \n— \n%\nTotal debt\n4,370\n \n4,366\n \n—\n \n%\nCommon stockholders' equity excluding AOCI, net of tax\n20,119 \n18,999 \n6 \n%\nPreferred stock\n334 \n334 \n— \n%\nAOCI, net of tax\n(2,003)\n(2,886)\n31 \n%\nTotal stockholders’ equity\n$\n18,450\n \n$\n16,447\n \n12\n \n%\nTotal capitalization\n$\n22,820\n \n$\n20,813\n \n10\n \n%\nDebt to stockholders’ equity\n24\n%\n27\n%\nDebt to capitalization\n19\n%\n21\n%\nTotal capitalization increased $2,007 as of September 30, 2025 compared to December 31, 2024 primarily due to net income in excess of common stockholder dividends in the period, and a decrease in net unrealized losses on fixed maturities, AFS partially offset by share repurchases.\nFor additional information on AOCI, net of tax, including net unrealized gain (losses) from securities, see Note 16 - Changes \nIn and Reclassifications From Accumulated Other Comprehensive Income (Loss) and Note 5 - Investments of Notes to Condensed Consolidated Financial Statements. For additional information on debt, see Note 13 - Debt of Notes to Consolidated Financial Statement in The Hartford's 2024 Form 10-K Annual Report.\nCash Flow\nNine Months Ended September 30,\n2025\n2024\nNet cash provided by operating activities\n$\n4,114 \n$\n4,035 \nNet cash used for investing activities\n$\n(2,459)\n$\n(2,412)\nNet cash used for financing activities\n$\n(1,695)\n$\n(1,529)\nCash and restricted cash– end of period\n$\n206 \n$\n281 \nCash provided by operating activities\n increased in 2025 as compared to the prior year period primarily driven by an increase in P&C and Employee Benefits premiums received partially offset by an increase in loss and loss adjustment expenses paid and higher operating expenses, including increased commissions and staffing costs.\nCash used for investing activities\n increased in 2025 due to more cash generated from operating activities partially offset by more cash used in financing activities. \nCash used for financing activities\n increased in 2025 as compared to the prior year period primarily driven by an increase in treasury stock acquired, a change from net issuance to net return of shares under incentive and stock compensation plans, and an increase in dividends paid on common stock.\nOperating cash flows\n for the nine months ended September 30, 2025 has been adequate to meet liquidity requirements.\nEquity Markets\nFor a discussion of the potential impact of the equity markets on capital and liquidity, see the Financial Risk section in this MD&A and the Financial Risk on Statutory Capital section of the MD&A in the Company's 2024 Form 10-K Annual Report. \n107\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nRatings\nRatings are an important factor in establishing a competitive position in the insurance marketplace and impact the Company's ability to access financing and its cost of borrowing. There can be no assurance that the Company’s ratings will continue for any given period of time, or that they will not be changed. In the event the Company’s ratings are downgraded, the Company’s competitive position, ability to access financing, and its cost of borrowing, may be adversely impacted. \nThese ratings are not a recommendation to buy, sell or hold any of The Hartford's securities and they may be revised or withdrawn at any time at the discretion of the rating organization. Each agency's rating should be evaluated independently of any other agency's rating. The system and the number of rating categories can vary across rating agencies. \nAmong other factors, rating agencies consider the level of statutory capital and surplus of our U.S. insurance subsidiaries as well as the level of GAAP capital held by the Company in determining the Company's financial strength and credit ratings. Rating agencies may implement changes to their capital formulas that have the effect of increasing the amount of capital we must hold in order to maintain our current ratings. See Risk Factors disclosed in Item 1A of Part I of the Company's 2024 Form 10-K Annual Report.\nOn August 19, 2025, Standard & Poor's (\"S&P\") raised the long-term issuer credit and financial strength ratings on The Hartford's core subsidiaries to \"AA-\" from \"A+\" and the issuer credit rating on the Company to \"A-\" from \"BBB+\". At the same time, S&P upgraded all debt ratings of the Company, including raising the senior debt rating to \"A-\" from \"BBB+\". These upgrades reflect improved underwriting performance, strong \nprofitability, and risk management that have increased the Company's capital resiliency. S&P's outlook for all ratings in this rating action are \"stable\". \nOn October 10, 2025, Moody's upgraded the senior unsecured debt rating of the Company to \"A3\" from \"Baa1\", upgraded the insurance financial strength ratings (IFS) of The Hartford's primary P&C insurance subsidiaries to \"Aa3\" from \"A1\", and affirmed the IFS rating of HLA at \"A1\". The ratings upgrade reflects the Company's track record of strong, stable profitability and strong risk adjusted capitalization supported by well diversified revenues and earnings from its P&C insurance, Employee Benefits and Hartford Funds businesses. Moody's outlook for all ratings in this rating action are \"stable\".\nInsurance Financial Strength Ratings as of\nOctober 24, 2025\nA.M. Best\nStandard & Poor’s\nMoody’s\nHartford Fire Insurance Company\nA+\nAA-\nAa3\nHartford Life and Accident Insurance Company\nA+\nAA-\nA1\nNavigators Insurance Company\nA+\nAA-\nNot Rated\nOther Ratings:\nThe Hartford Insurance Group, Inc.:\nSenior debt\na\nA-\nA3\nStatutory Capital\nU.S. Statutory Capital Rollforward for the Company's Insurance Subsidiaries\nProperty and Casualty Insurance Subsidiaries [1] [2]\nEmployee Benefits Insurance Subsidiary\nTotal\nU.S statutory capital at January 1, 2025 \n$\n13,294\n \n$\n2,708\n \n$\n16,002\n \nStatutory income\n1,943 \n450 \n2,393 \nDividends to parent\n(1,100)\n(517)\n(1,617)\nOther items\n(12)\n(2)\n(14)\nNet change to U.S. statutory capital\n831 \n(69)\n762 \nU.S statutory capital at September 30, 2025\n$\n14,125\n \n$\n2,639\n \n$\n16,764\n \n[1]\nThe statutory capital for property and casualty insurance subsidiaries in this table does not include the value of an intercompany note owed by HHI to Hartford Fire Insurance Company. \n[2]\nExcludes insurance operations in the U.K. \n108\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nContingencies\nLegal Proceedings\nFor a discussion regarding The Hartford’s legal proceedings, see the information contained in Note 14 - Commitments and Contingencies of the Notes to Condensed Consolidated Financial Statements.\nLegislative and Regulatory Developments\nFor a discussion regarding legislative and regulatory developments, see Part II, Item 7, MD&A - Capital Resources and Liquidity, Contingencies in the Company’s 2024 Form 10-K Annual Report.\nOn March 27, 2025, the Securities and Exchange Commission voted to end its defense of its climate disclosure rules, originally finalized in March of 2024, which would have required companies to report on their climate-related risks and greenhouse gas emissions in much greater detail than previously required. This development relieves companies of certain additional climate-related disclosure obligations which would have come into effect under the new rules. Additional future impacts could include shifts in regulatory approaches and increased uncertainty for businesses regarding climate-related disclosures. State-level efforts to require additional climate-related disclosure, notably in California, remain ongoing but face legal challenges similar to those faced by the SEC climate rules. \nH.R.1, known as the “One Big Beautiful Bill Act” was signed into law on July 4, 2025. This comprehensive budget reconciliation package consolidates a wide array of public policy priorities, reshaping federal policy across numerous sectors of the American economy, including taxation, healthcare, social safety nets, immigration and education. The changes in H.R.1 do not currently have a material impact on the Company's results of operations nor are they expected to in future periods.\nImpact of New Accounting Standards \nFor a discussion of accounting standards, see Note 1 - Basis of Presentation and Significant Accounting Policies of Notes to Consolidated Financial Statements included in The Hartford’s 2024 Form 10-K Annual Report. \n109\nTable of Contents\nIndex to MD&A\n \nPart I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nAcronyms\n \nA&E\nAsbestos and Environmental\nHIG\nThe Hartford Insurance Group, Inc.\nABS\nAsset-Backed Securities\nHIMCO\nHartford Investment Management Company\nACL\nAllowance for Credit Losses\nHLA\nHartford Life and Accident Insurance Company\nADC\nAdverse Development Cover\nIBNR\nIncurred But Not Reported\nAFS\nAvailable-For-Sale\nIT\nInformation Technology\nALAE\nAllocated Loss Adjustment Expenses\nLAE\nLoss Adjustment Expense\nAOCI\nAccumulated Other Comprehensive Income\nLCL\nLiability for Credit Losses\nAUM\nAssets Under Management\nLTD\nLong-Term Disability\nCAY\nCurrent Accident Year\nLTV\nLoan-to-Value\nCLOs\nCollateralized Loan Obligations\nMD&A\nManagement's Discussion and Analysis of Financial Conditions and Results of Operations\nCMBS\nCommercial Mortgage-Backed Securities\nNAIC\nNational Association of Insurance Commissioners\nCODM\nChief Operating Decision Maker\nNICO\nNational Indemnity Company, a subsidiary of Berkshire Hathaway Inc. (“Berkshire”)\nCPRI\nCredit and Political Risk Insurance\nNM\nNot Meaningful\nDAC\nDeferred Policy Acquisition Costs\nOCI\nOther Comprehensive Income\nDLR\nDisabled Life Reserve\nOTC\nOver-the-Counter\nD&O\nDirectors and Officers\nP&C\nProperty and Casualty\nDSCR\nDebt Service Coverage Ratio\nPV&T\nPolitical Violence and Terrorism\nERCC\nEnterprise Risk and Capital Committee\nPYD\nPrior Accident Year Development\nESPP\nThe Hartford Employee Stock Purchase Plan\nRBC\nRisk-Based Capital\nETF\nExchange-Traded Funds\nRMBS\nResidential Mortgage-Backed Securities\nFASB\nFinancial Accounting Standards Board\nROA\nReturn on Assets\nFHCF\nFlorida Hurricane Catastrophe Fund\nROE\nReturn on Equity\nFHLBB\nFederal Home Loan Bank of Boston\nSEC\nSecurities and Exchange Commission\nFVO\nFair Value Option\nSOFR\nSecured Overnight Financing Rate\nGAAP\nGenerally Accepted Accounting Principles\nTRIPRA\nTerrorism Risk Insurance Program Reauthorization Act\nHHI\nHartford Holdings, Inc.\nULAE\nUnallocated Loss Adjustment Expenses\n110\nTable of Contents\nPart I - Item 4. Controls and Procedures"
}