{
  "item1": "BUSINESS (Dollar amounts millions, except per share data, unless otherwise stated) Purpose Strategic Priorities Reportable Segments Corporate Underwriting P&C Employee Benefits Claims Administration P&C Employee Benefits Investment Operations Enterprise Risk Management Intellectual Property Human Capital Resources Available Information GENERAL Hartford Insurance Group, Inc. (\"HIG\") (together its subsidiaries, “The Hartford”, “Company”, “we”, “our”) holding company group subsidiaries provide property casualty (\"P&C\") insurance, employee group benefits insurance services, mutual funds exchange-traded funds (\"ETF\") individual business customers United States, well United Kingdom other international locations. Previously known Hartford Financial Services Group, Inc., Company changed its name Hartford Insurance Group, Inc. February 6, 2025.",
  "item7": "[1] Primarily represents federal income tax expense (benefit) related before tax items not included core earnings. Core Earnings Margin- Hartford uses non-GAAP measure core earnings margin evaluate, believes important measure of, Employee Benefits segment's operating performance. Core earnings margin calculated dividing core earnings revenues, excluding buyouts realized gains (losses). Net income margin, calculated dividing net income revenues, most directly comparable U.S.",
  "item2": "Part I - Item 2. Management's Discussion Analysis Financial Condition Results Operations middle & large business, represents ratio prior period premiums successfully renewed divided premiums associated policies available renewal current period. Premium retention excludes premium amounts annual audits, renewal written price increases changes exposure, including amount insurance. Premium retention statistics subject change period period based number factors, including effect subsequent cancellations non-renewals Prior Accident Year Loss Loss Adjustment Expense Ratio- Represents increase (decrease) estimated cost settling catastrophe non-catastrophe claims incurred prior accident years recorded current calendar year divided earned premiums."
}