{
  "source_file": "hii-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n    \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nOVERVIEW\nOur Business\nHuntington Ingalls Industries, Inc. (\"HII\", \"we\", \"us\", or \"our\") is a global, all-domain defense partner, building and delivering the world’s most powerful, survivable naval ships and technologies that safeguard America’s seas, sky, land, space, and cyber. For more than a century, our Ingalls Shipbuilding segment (\"Ingalls\") in Mississippi and Newport News Shipbuilding segment (\"Newport News\") in Virginia have built more ships in more ship classes than any other U.S. naval shipbuilder, making us America's largest shipbuilder. Our Mission Technologies segment develops integrated technology solutions and products that enable today's connected, all-domain force. Headquartered in Newport News, Virginia, we employ approximately 44,000 people domestically and internationally.\nWe conduct most of our business with the U.S. Government, primarily the Department of War (the \"Department\"). As prime contractor, principal subcontractor, team member, or partner, we participate in many high-priority U.S. defense programs. Ingalls includes our non-nuclear ship design, construction, repair, and maintenance businesses. Newport News includes all of our nuclear ship design, construction, overhaul, refueling, and repair and maintenance businesses. Our Mission Technologies segment is organized into four groups, All-Domain Operations, Warfare Systems, Global Security, and Uncrewed Systems, and specializes in a wide range of services and products across our capabilities, which include command, control, computers, communications, cyber, intelligence, surveillance, and reconnaissance (\"C5ISR\") systems and operations; the application of artificial intelligence and machine learning to battlefield decisions; defensive and offensive cyber, electronic warfare & space; unmanned systems; live, virtual, and constructive training solutions; fleet sustainment; and critical nuclear operations.\nThe following discussion should be read along with the unaudited condensed consolidated financial statements included in this Quarterly Report on Form 10-Q, as well as our Annual Report on Form 10-K for the year ended December 31, 2024 (our \"2024 Annual Report on Form 10-K\").\nBusiness Environment\nThe federal budget environment remains a significant long-term risk, and we continue to see uncertainty in the economy, our industry, and our company. Our customers and suppliers continue to face challenges, and we believe continued budget pressures could have serious implications for defense discretionary spending, the defense industrial base, including HII, and the customers, employees, suppliers, subcontractors, investors, and communities that rely on companies in the defense industrial base. We cannot clearly predict how long these challenges will \n19\nTable of Contents\n                                                            \ncontinue, whether these challenges will change over time, or whether our actions to address these challenges will be successful.\nDefense Spending Environment – \nOn May 2, 2025, the Trump Administration released the President's topline recommendations on discretionary funding levels for fiscal year 2026, followed by detailed budget justification documents in June. Additionally, under the Public Law 119-21\n \n(the \"Act\"), Congress provided mandatory funding for more than $29 billion for Shipbuilding and the Maritime Industrial Base. This funding included one \nVirginia\n class (SSN 774) fast attack submarine and two \nArleigh-Burke\n class (DDG 51) guided-missile destroyers, and provided additional funding for amphibious warfare ships and unmanned surface vessels.\nLawmakers continue to consider the annual budget request for the federal government. The U.S. House of Representatives approved a fiscal year 2026 defense appropriations measure in July, and the U.S. Senate Committee on Appropriations advanced its defense appropriations measure out of committee in July. The House and Senate Committees on Armed Services acted on their respective National Defense Authorization bills for fiscal year 2026, with the House approving the authorization bill in September and the Senate approving the authorization bill in October.\nFiscal year 2026 began on October 1, 2025 without annual appropriations legislation or a continuing resolution. As a result, many parts of the U.S. Government temporarily shut down. This lapse in federal funding leaves the federal government sustaining only those activities that are determined to be excepted or funded through means other than fiscal year 2026 annual appropriations.\nPrior to the lapse in appropriations, the Department identified those missions and functions of the Department deemed high priority, including shipbuilding, that may continue through the use of available funds in the absence of new annual appropriations. Funds that remain available include those provided for certain shipbuilding programs under the Act. \nAccording to Department guidance, “The expiration of an appropriation does not require the termination of contracts (or issuance of stop work orders) funded by that appropriation unless a new obligation of funds is required under the contract and the contract is not required to support an excepted activity.\" \"The Department may continue to enter into new contracts, or place task orders under existing contracts, to obtain supplies and services necessary to carry out or support excepted activities even though there are no available appropriations.”\nIt remains uncertain at this point when funding will be enacted for fiscal year 2026 and whether it will be in the form of a continuing resolution or finalization of annual appropriations measures. We cannot predict the outcome of the fiscal year 2026 budget process, including any impact on the Company's programs.\nGlobal Geopolitical and Economic Environment \n–\n \nThe global geopolitical and economic environment continues to be impacted by uncertainty, heightened geopolitical tensions, and instability. Geopolitical relationships continue to change, and the U.S. and its allies face a global security environment that includes threats from state and non-state actors, including major global powers, as well as terrorist organizations, emerging nuclear tensions, diverse regional security concerns, and political instability. These global threats persist across all domains, from undersea to space to cyber, and the global market for defense products, services, and solutions is driven by these complex and evolving security challenges. In addition, changes in the global economic environment, including changes in international trade policies, including those imposing tariffs, could further impact the global market for defense products. Our current operating environment exists in the broader context of political and socioeconomic priorities and reflects, among other things, the continued impact of and uncertainty surrounding geopolitical tensions, financial market volatility, inflation, trade policy, and a challenging labor market. \nFor further information on our business environment, see the discussion under Business Environment under “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our 2024 Annual Report on Form 10-K.\n20\nTable of Contents\n                                                            \nCritical Accounting Policies, Estimates, and Judgments\nAs discussed in our 2024 Annual Report on Form 10-K, we consider our policies relating to the following matters to be critical accounting policies and estimates:\n•\nRevenue recognition;\n•\nRetirement related benefit plans; and\n•\nWorkers' compensation.\nAs of September 30, 2025, there had been no material changes to the foregoing critical accounting policies, estimates, and judgments since December 31, 2024.\nProgram Descriptions\nFor convenience, a brief description of certain programs discussed in this Quarterly Report on Form 10-Q is included in the \"Glossary of Programs\" in this section.\nCONSOLIDATED OPERATING RESULTS\nThe following table presents selected financial highlights:\nThree Months Ended September 30\nNine Months Ended September 30\n \n2025 vs. 2024\n2025 vs. 2024\n($ in millions)\n2025\n2024\nDollars\nPercent\n2025\n2024\nDollars\nPercent\nSales and service revenues\n$\n3,192\n \n$\n2,749 \n$\n443 \n16 \n%\n$\n9,008\n \n$\n8,531 \n$\n477 \n6 \n%\nCost of product sales and service revenues\n2,798\n \n2,427 \n371 \n15 \n%\n7,825\n \n7,402 \n423 \n6 \n%\nIncome from operating investments, net\n12\n \n12 \n— \n— \n%\n33\n \n35 \n(2)\n(6)\n%\nOther income and gains, net\n—\n \n— \n— \n— \n%\n1\n \n— \n1 \n— \n%\nGeneral and administrative expenses\n245\n \n252 \n(7)\n(3)\n%\n732\n \n739 \n(7)\n(1)\n%\nOperating income\n161\n \n82 \n79 \n96 \n%\n485\n \n425 \n60 \n14 \n%\nOther income (expense)\nInterest expense\n(23)\n(23)\n— \n— \n%\n(79)\n(68)\n(11)\n(16)\n%\nNon-operating retirement benefit\n48\n \n44 \n4 \n9 \n%\n143\n \n134 \n9 \n7 \n%\nOther, net\n18\n \n9 \n9 \n100 \n%\n30\n \n21 \n9 \n43 \n%\nFederal and foreign income taxes\n59\n \n11 \n48 \n436 \n%\n133\n \n85 \n48 \n56 \n%\nNet earnings\n$\n145\n \n$\n101 \n$\n44 \n44 \n%\n$\n446\n \n$\n427 \n$\n19 \n4 \n%\nOperating Performance Assessment and Reporting\nWe manage and assess the performance of our business based on our performance on individual contracts and programs using the financial measures referred to below, with consideration given to the Critical Accounting Policies, Estimates, and Judgments referred to in this section. Our portfolio of long-term contracts is largely flexibly-priced. Therefore, sales tend to fluctuate in concert with costs across our large portfolio of active contracts, with operating income being a critical measure of operating performance. Under the Federal Acquisition Regulation rules that govern our business with the U.S. Government, most types of costs are allowable, and we do not focus on individual cost groupings, such as cost of sales or general and administrative expenses, as much as we do on total contract costs, which are a key factor in determining contract operating income. As a result, in evaluating our operating performance, we look primarily at changes in sales and service revenues, as well as operating income, including the effects of significant changes in operating income as a result of changes in contract financial estimates and the use of the cumulative catch-up method of accounting in accordance with GAAP. This approach is consistent with the long-term life cycle of our contracts, as management assesses the bidding of each contract by focusing on net sales and operating profit and monitors performance in a similar manner through contract completion. Consequently, our discussion of business segment performance focuses on net sales and operating profit, consistent with our approach for managing our business.\n21\nTable of Contents\n                                                            \nSales and Service Revenues\nPeriod-to-period revenues reflect performance under new and ongoing contracts. Changes in sales and service revenues are typically expressed in terms of volume. Unless otherwise described, volume generally refers to increases (or decreases) in reported revenues due to varying production activity levels, delivery rates, or service levels on individual contracts. Volume changes will typically carry a corresponding income change based on the profit margin rate for a particular contract.\nSales and service revenues for the \nthree and nine months ended\n September 30, 2025, increased $443 million, or 16%, and $477 million, or 6%, respectively compared to the same periods in 2024, primarily due to higher volumes at Newport News, Ingalls, and Mission Technologies.\nNet Cumulative Catch-up Revenue Adjustments \nFor the \nthree and nine months ended \nSeptember 30, 2025 and 2024, favorable and unfavorable cumulative catch-up revenue adjustments were as follows:\nThree Months Ended September 30\nNine Months Ended September 30\n \n($ in millions)\n2025\n2024\n2025\n2024\nGross favorable adjustments\n$\n37\n \n$\n36 \n$\n255\n \n$\n174 \nGross unfavorable adjustments\n(40)\n(108)\n(268)\n(220)\nNet adjustments\n$\n(3)\n$\n(72)\n$\n(13)\n$\n(46)\nSee Note 7: Revenue and \"Segment Operating Results\" in this section for additional information on our net cumulative catch-up revenue adjustments.\nCost of Product Sales and Service Revenues\nCost of sales for both product sales and service revenues consists of materials, labor, and subcontracting costs, as well as an allocation of indirect costs for overhead. We manage the type and amount of costs at the contract level, which is the basis for estimating our total costs at completion of our contracts. Unusual fluctuations in operating performance driven by changes in a specific cost element across multiple contracts are described in our analysis.\nRefer to \"Segment Operating Results\" and \"Product and Service Revenues and Cost Analysis\" in this section for details related to cost of sales for both product sales and service revenues.\n \nIncome from Operating Investments, Net\nThe activities of our operating investments are closely aligned with the operations of the segments holding the investments. We therefore record income related to earnings from equity method investments in our operating income.\nRefer to \"Segment Operating Results\" in this section for details related to income from operating investments.\nGeneral and Administrative Expenses\nIn accordance with industry practice and the regulations that govern the cost accounting requirements for government contracts, most general and administrative expenses are considered allowable and allocable costs on government contracts. These costs are allocated to contracts in progress on a systematic basis, and contract performance factors include this cost component as an element of cost.\nGeneral and administrative expenses for each of the \nthree and nine months ended\n September 30, 2025, decreased $7 million from the same periods in 2024, primarily due to lower overhead costs. \n22\nTable of Contents\n                                                            \nOperating Income \nWe consider operating income an important measure for evaluating our operating performance, and, consistent with industry practice, we define operating income as revenues less the related costs of producing the revenues and general and administrative expenses.\nSegment Operating Income\nWe internally manage our operations by reference to \"segment operating income,\" which is a non-GAAP measure and is defined as operating income before the Operating FAS/CAS Adjustment and non-current state income taxes, neither of which affects contract performance. Segment operating income is a measure we use to evaluate our core operating performance as it reflects the aggregate performance results of contracts within a segment. When analyzing our operating performance, investors should use segment operating income in addition to, and not as an alternative for, operating income or any other performance measure presented in accordance with GAAP. We believe segment operating income reflects an additional way of viewing aspects of our operations that, when viewed with our GAAP results, provides a more complete understanding of factors and trends affecting our business. We believe the measure is used by investors and is a useful indicator to measure our performance. Because not all companies use identical calculations, our presentation of segment operating income may not be comparable to similarly titled measures of other companies.\nChanges in segment operating income are typically expressed in terms of volume, as discussed in “Sales and Service Revenues” above, or performance. Performance refers to changes in contract profit margin rates. These changes typically relate to profit recognition associated with revisions to estimated costs at completion (\"EAC\"), which reflect improved or deteriorated operating performance on that contract. Operating income changes are accounted for on a cumulative to date basis at the time an EAC change is recorded. Segment operating income may also be affected by, among other things, contract performance, inflationary pressures on our supply chain, the effects of workforce stoppages and other labor-related shortfalls, the availability of raw materials, the effects of natural disasters such as hurricanes, resolution of disputed items with the customer, recovery of insurance proceeds, and other discrete events. At the completion of a long-term contract, any originally estimated costs not incurred or reserves not fully utilized, such as warranty reserves, could also impact contract earnings. Where such items have occurred and the effects are material, a separate description is provided. Refer to \"Segment Operating Results\" in this section for activity within each segment.\nThe following table reconciles operating income to segment operating income:\nThree Months Ended September 30\nNine Months Ended September 30\n \n2025 vs. 2024\n2025 vs. 2024\n($ in millions)\n2025\n2024\nDollars\nPercent\n2025\n2024\nDollars\nPercent\nOperating income\n$\n161\n \n$\n82 \n$\n79 \n96 \n%\n$\n485\n \n$\n425 \n$\n60 \n14 \n%\nOperating FAS/CAS Adjustment\n9\n \n16 \n(7)\n(44)\n%\n25\n \n48 \n(23)\n(48)\n%\nNon-current state income taxes\n9\n \n(1)\n10 \n1,000 \n%\n12\n \n(3)\n15 \n500 \n%\nSegment operating income\n$\n179\n \n$\n97 \n$\n82 \n85 \n%\n$\n522\n \n$\n470 \n$\n52 \n11 \n%\nFAS/CAS Adjustment and Operating FAS/CAS Adjustment\nThe FAS/CAS Adjustment reflects the difference between expenses for pension and other postretirement benefits determined in accordance with GAAP (\"FAS\") and the expenses for these items included in segment operating income in accordance with U.S. Cost Accounting Standards (\"CAS\"). The Operating FAS/CAS Adjustment excludes the following components of net periodic benefit costs: interest cost, expected return on plan assets, amortization of prior service cost (credit) and actuarial loss (gain), and settlement and curtailment effects.\n23\nTable of Contents\n                                                            \nThe components of the Operating FAS/CAS Adjustment were as follows:\nThree Months Ended September 30\nNine Months Ended September 30\n \n2025 vs. 2024\n2025 vs. 2024\n($ in millions)\n2025\n2024\nDollars\nPercent\n2025\n2024\nDollars\nPercent\nFAS benefit\n$\n25\n \n$\n15 \n$\n10 \n67 \n%\n$\n75\n \n$\n48 \n$\n27 \n56 \n%\nCAS cost\n14\n \n13 \n1 \n8 \n%\n43\n \n38 \n5 \n13 \n%\nFAS/CAS Adjustment\n39\n \n28 \n11 \n39 \n%\n118\n \n86 \n32 \n37 \n%\nNon-operating retirement benefit\n(48)\n(44)\n(4)\n(9)\n%\n(143)\n(134)\n(9)\n(7)\n%\nOperating FAS/CAS Adjustment expense\n$\n(9)\n$\n(16)\n$\n7 \n44 \n%\n$\n(25)\n$\n(48)\n$\n23 \n48 \n%\nThe Operating FAS/CAS Adjustment was a net expense of $9 million and $16 million for the three months ended September 30, 2025 and 2024, respectively. The Operating FAS/CAS Adjustment was a net expense of $25 million and $48 million for the nine months ended September 30, 2025 and 2024, respectively. The favorable change in the Operating FAS/CAS Adjustment for each period was primarily driven by higher interest rates under FAS.\nNon-current State Income Taxes\nNon-current state income taxes include deferred state income taxes, which reflect the change in deferred state tax assets and liabilities, and the tax expense or benefit associated with changes in state unrecognized tax benefits in the relevant period. These amounts are recorded within operating income. Current period state income taxes are charged to contract costs and included in cost of sales and service revenues in segment operating income.\nNon-current state income tax expense was $9 million for the three months ended September 30, 2025, compared to a non-current state income tax benefit of $1 million for the three months ended September 30, 2024. Non-current state income tax expense was $12 million for the nine months ended September 30, 2025, compared to a non-current state income tax benefit of $3 million for the nine months ended September 30, 2024. The unfavorable changes in non-current state income taxes for the three and nine months ended September 30, 2025 were driven by an increase in deferred state income tax expense, primarily attributable to a change in net capitalized research and development expenditures.\nSEGMENT OPERATING RESULTS\nOur discussion of business segment performance focuses on sales and service revenues and operating income, consistent with our approach for managing our business. We are aligned into three reportable segments: Ingalls, Newport News, and Mission Technologies. \n24\nTable of Contents\n                                                            \nThe following table presents segment operating results:\nThree Months Ended September 30\nNine Months Ended September 30\n \n2025 vs. 2024\n2025 vs. 2024\n($ in millions)\n2025\n2024\nDollars\nPercent\n2025\n2024\nDollars\nPercent\nSales and Service Revenues\nIngalls\n$\n828\n \n$\n664 \n$\n164 \n25 \n%\n$\n2,189\n \n$\n2,031 \n$\n158 \n8 \n%\nNewport News\n1,617\n \n1,412 \n205 \n15 \n%\n4,616\n \n4,381 \n235 \n5 \n%\nMission Technologies\n787\n \n709 \n78 \n11 \n%\n2,313\n \n2,224 \n89 \n4 \n%\nIntersegment eliminations\n(40)\n(36)\n(4)\n(11)\n%\n(110)\n(105)\n(5)\n(5)\n%\nSales and service revenues\n$\n3,192\n \n$\n2,749 \n$\n443 \n16 \n%\n$\n9,008\n \n$\n8,531 \n$\n477 \n6 \n%\nOperating Income\nIngalls\n$\n65\n \n$\n49 \n$\n16 \n33 \n%\n$\n165\n \n$\n165 \n$\n— \n— \n%\nNewport News\n80\n \n15 \n65 \n433 \n%\n247\n \n208 \n39 \n19 \n%\nMission Technologies\n34\n \n33 \n1 \n3 \n%\n110\n \n97 \n13 \n13 \n%\nSegment operating income\n179\n \n97 \n82 \n85 \n%\n522\n \n470 \n52 \n11 \n%\nNon-segment factors affecting operating income\nOperating FAS/CAS Adjustment\n(9)\n(16)\n7 \n44 \n%\n(25)\n(48)\n23 \n48 \n%\nNon-current state income taxes\n(9)\n1 \n(10)\n(1,000)\n%\n(12)\n3 \n(15)\n(500)\n%\nOperating income\n$\n161\n \n$\n82 \n$\n79 \n96 \n%\n$\n485\n \n$\n425 \n$\n60 \n14 \n%\nKey Segment Financial Measures\nRefer to \"Consolidated Operating Results\" in this section for details related to sales and service revenues and segment operating income.\nNet Cumulative Catch-up Revenue Adjustments by Segment\nFor the \nthree and nine months ended \nSeptember 30, 2025 and 2024, net cumulative catch-up revenue adjustments by segment were as follows:\nThree Months Ended September 30\nNine Months Ended September 30\n \n($ in millions)\n2025\n2024\n2025\n2024\nIngalls\n$\n6\n \n$\n1 \n$\n10\n \n$\n20 \nNewport News\n(13)\n(78)\n(36)\n(80)\nMission Technologies\n4\n \n5 \n13\n \n14 \nNet adjustments\n$\n(3)\n$\n(72)\n$\n(13)\n$\n(46)\nSee Note 7: Revenue and \"Consolidated Operating Results\" in this section for additional information on our net cumulative catch-up revenue adjustments.\nIngalls\nThree Months Ended September 30\nNine Months Ended September 30\n \n2025 vs. 2024\n2025 vs. 2024\n($ in millions)\n2025\n2024\nDollars\nPercent\n2025\n2024\nDollars\nPercent\nSales and service revenues\n$\n828\n \n$\n664 \n$\n164 \n25 \n%\n$\n2,189\n \n$\n2,031 \n$\n158 \n8 \n%\nSegment operating income\n65\n \n49 \n16 \n33 \n%\n165\n \n165 \n— \n— \n%\nAs a percentage of segment sales\n7.9\n \n%\n7.4 \n%\n7.5\n \n%\n8.1 \n%\n25\nTable of Contents\n                                                            \nSales and Service Revenues \nIngalls revenues, including intersegment sales, for the three months ended September 30, 2025, increased $164 million, or 25%, from the same period in 2024, primarily driven by higher volumes in surface combatants.\nIngalls revenues, including intersegment sales, for the nine months ended September 30, 2025, increased $158 million, or 8%, from the same period in 2024, primarily driven by higher volumes in surface combatants, partially offset by lower volumes in amphibious assault ships.\nSegment Operating Income\nIngalls segment operating income for the three months ended September 30, 2025, was $65 million, compared to segment operating income of $49 million for the same period in 2024. The increase was primarily driven by the higher volumes described above.\nIngalls segment operating income for each of the nine months ended September 30, 2025 and 2024, was consistent at $165 million. Higher volumes and contract adjustments in surface combatants were offset by lower volumes and lower performance in amphibious assault ships. \nNewport News\nThree Months Ended September 30\nNine Months Ended September 30\n \n2025 vs. 2024\n2025 vs. 2024\n($ in millions)\n2025\n2024\nDollars\nPercent\n2025\n2024\nDollars\nPercent\nSales and service revenues\n$\n1,617\n \n$\n1,412 \n$\n205 \n15 \n%\n$\n4,616\n \n$\n4,381 \n$\n235 \n5 \n%\nSegment operating income\n80\n \n15 \n65 \n433 \n%\n247\n \n208 \n39 \n19 \n%\nAs a percentage of segment sales\n4.9\n \n%\n1.1 \n%\n5.4\n \n%\n4.7 \n%\nThe Company’s Newport News segment continues to experience performance challenges in the construction of aircraft carriers and the \nVirginia\n class (SSN 774) submarine program. \nSales and Service Revenues\nNewport News revenues, including intersegment sales, for the three months ended September 30, 2025, increased $205 million, or 15%, from the same period in 2024, primarily driven by higher volumes in submarines and aircraft carriers.\nNewport News revenues, including intersegment sales, for the nine months ended September 30, 2025, increased $235 million, or 5%, from the same period in 2024, primarily driven by higher volumes in submarines.\nSegment Operating Income\nNewport News segment operating income for the three months ended September 30, 2025, was $80 million, compared to segment operating income of $15 million for the same period in 2024. The increase was primarily driven by unfavorable cumulative catch-up adjustments in the \nVirginia\n class (SSN 774) submarine program and aircraft carriers in 2024.\nNewport News segment operating income for the nine months ended September 30, 2025, was $247 million, compared to segment operating income of $208 million for the same period in 2024. The increase was primarily driven by risk retirement in the \nColumbia\n class (SSBN 826) submarine program and contract adjustments in the \nVirginia\n class (SSN 774) submarine program, partially offset by contract adjustments and incentives in 2024 in the RCOH program.\n26\nTable of Contents\n                                                            \nMission Technologies\nThree Months Ended September 30\nNine Months Ended September 30\n \n2025 vs. 2024\n2025 vs. 2024\n($ in millions)\n2025\n2024\nDollars\nPercent\n2025\n2024\nDollars\nPercent\nSales and service revenues\n$\n787\n \n$\n709 \n$\n78 \n11 \n%\n$\n2,313\n \n$\n2,224 \n$\n89 \n4 \n%\nSegment operating income\n34\n \n33 \n1 \n3 \n%\n110\n \n97 \n13 \n13 \n%\nAs a percentage of segment sales\n4.3\n \n%\n4.7 \n%\n4.8\n \n%\n4.4 \n%\nSales and Service Revenues\nMission Technologies revenues, including intersegment sales, for the three months ended September 30, 2025, increased $78 million, or 11%, from the same period in 2024, primarily due to higher volumes in C5ISR; cyber, electronic warfare & space; and live, virtual, and constructive training solutions.\nMission Technologies revenues, including intersegment sales, for the nine months ended September 30, 2025, increased $89 million, or 4%, from the same period in 2024, primarily due to higher volumes in cyber, electronic warfare & space and live, virtual, and constructive training solutions, partially offset by lower volumes in fleet sustainment.\nSegment Operating Income \nMission Technologies segment operating income for the three months ended September 30, 2025, was consistent with the same period in 2024, as changes in contract mix offset the higher volumes described above.\nMission Technologies segment operating income for the nine months ended September 30, 2025, was $110 million, compared to segment operating income of $97 million for the same period in 2024. The increase was primarily due to the higher volumes described above. \n27\nTable of Contents\n                                                            \nPRODUCT AND SERVICE REVENUES AND COST ANALYSIS\nThe following tables present segment sales and service revenues and segment cost of sales and service revenues by both product and service: \nSales and Service Revenues\nSegment Cost of Product Sales and Service Revenues\n($ in millions)\nThree Months Ended September 30\n2025 vs. 2024\nThree Months Ended September 30\n2025 vs. 2024\nSegment Information\n2025\n2024\nDollars\nPercent\n2025\n2024\nDollars\nPercent\nIngalls\nProduct\n$\n697\n \n$\n569 \n$\n128 \n22 \n%\n$\n603\n \n$\n485 \n$\n118 \n24 \n%\nService\n128\n \n93 \n35 \n38 \n%\n112\n \n83 \n29 \n35 \n%\nIntersegment\n3\n \n2 \n1 \n50 \n%\n3\n \n2 \n1 \n50 \n%\nTotal Ingalls\n828\n \n664 \n164 \n25 \n%\n718\n \n570 \n148 \n26 \n%\nNewport News\nProduct\n1,330\n \n1,163 \n167 \n14 \n%\n1,163\n \n1,036 \n127 \n12 \n%\nService\n287\n \n249 \n38 \n15 \n%\n244\n \n208 \n36 \n17 \n%\nTotal Newport News\n1,617\n \n1,412 \n205 \n15 \n%\n1,407\n \n1,244 \n163 \n13 \n%\nMission Technologies\nProduct\n45\n \n29 \n16 \n55 \n%\n41\n \n22 \n19 \n86 \n%\nService\n705\n \n646 \n59 \n9 \n%\n626\n \n577 \n49 \n8 \n%\nIntersegment\n37\n \n34 \n3 \n9 \n%\n37\n \n34 \n3 \n9 \n%\nTotal Mission Technologies\n787\n \n709 \n78 \n11 \n%\n704\n \n633 \n71 \n11 \n%\nSegment Totals\nProduct\n$\n2,072\n \n$\n1,761 \n$\n311 \n18 \n%\n$\n1,807\n \n$\n1,543 \n$\n264 \n17 \n%\nService\n1,120\n \n988 \n132 \n13 \n%\n982\n \n868 \n114 \n13 \n%\nTotal Segment\n1\n$\n3,192\n \n$\n2,749 \n$\n443 \n16 \n%\n$\n2,789\n \n$\n2,411 \n$\n378 \n16 \n%\n1\n Operating FAS/CAS Adjustment is excluded from segment cost of product sales and service revenues.\n28\nTable of Contents\n                                                            \nSales and Service Revenues\nSegment Cost of Product Sales and Service Revenues\n($ in millions)\nNine Months Ended September 30\n2025 vs. 2024\nNine Months Ended September 30\n2025 vs. 2024\nSegment Information\n2025\n2024\nDollars\nPercent\n2025\n2024\nDollars\nPercent\nIngalls\nProduct\n$\n1,833\n \n$\n1,786 \n$\n47 \n3 \n%\n$\n1,581\n \n$\n1,509 \n$\n72 \n5 \n%\nService\n346\n \n240 \n106 \n44 \n%\n302\n \n208 \n94 \n45 \n%\nIntersegment\n10\n \n5 \n5 \n100 \n%\n10\n \n5 \n5 \n100 \n%\nTotal Ingalls\n2,189\n \n2,031 \n158 \n8 \n%\n1,893\n \n1,722 \n171 \n10 \n%\nNewport News\nProduct\n3,809\n \n3,602 \n207 \n6 \n%\n3,279\n \n3,091 \n188 \n6 \n%\nService\n806\n \n777 \n29 \n4 \n%\n671\n \n645 \n26 \n4 \n%\nIntersegment\n1\n \n2 \n(1)\n(50)\n%\n1\n \n2 \n(1)\n(50)\n%\nTotal Newport News\n4,616\n \n4,381 \n235 \n5 \n%\n3,951\n \n3,738 \n213 \n6 \n%\nMission Technologies\nProduct\n100\n \n86 \n14 \n16 \n%\n81\n \n80 \n1 \n1 \n%\nService\n2,114\n \n2,040 \n74 \n4 \n%\n1,886\n \n1,821 \n65 \n4 \n%\nIntersegment\n99\n \n98 \n1 \n1 \n%\n99\n \n98 \n1 \n1 \n%\nTotal Mission Technologies\n2,313\n \n2,224 \n89 \n4 \n%\n2,066\n \n1,999 \n67 \n3 \n%\nSegment Totals\nProduct\n$\n5,742\n \n$\n5,474 \n$\n268 \n5 \n%\n$\n4,941\n \n$\n4,680 \n$\n261 \n6 \n%\nService\n3,266\n \n3,057 \n209 \n7 \n%\n2,859\n \n2,674 \n185 \n7 \n%\nTotal Segment\n1\n$\n9,008\n \n$\n8,531 \n$\n477 \n6 \n%\n$\n7,800\n \n$\n7,354 \n$\n446 \n6 \n%\n1\n Operating FAS/CAS Adjustment is excluded from segment cost of product sales and service revenues.\nProduct Sales and Segment Cost of Product Sales \nProduct sales for the three months ended September 30, 2025, increased $311 million, or 18%, from the same period in 2024, primarily due to higher volumes in submarines and aircraft carriers at Newport News, and surface combatants at Ingalls.\nSegment cost of product sales for the three months ended September 30, 2025, increased $264 million, or 17%, compared with the same period in 2024, primarily due to the higher volumes described above. \nProduct sales for the nine months ended September 30, 2025, increased $268 million, or 5%, from the same period in 2024, primarily due to higher volumes in submarines at Newport News and surface combatants at Ingalls, partially offset by lower volumes in amphibious assault ships at Ingalls.\nSegment cost of product sales for the nine months ended September 30, 2025, increased $261 million, or 6%, compared with the same period in 2024, primarily due to the changes in volume described above. \nService Revenues and Segment Cost of Service Revenues \nService revenues for the three months ended September 30, 2025, increased $132 million, or 13%, from the same period in 2024, primarily due to higher volumes in C5ISR and live, virtual, and constructive training solutions at Mission Technologies, higher volumes in naval nuclear support services and aircraft carriers at Newport News, and higher volumes in surface combatants at Ingalls.\nSegment cost of service revenues for the three months ended September 30, 2025, increased $114 million, or 13%, compared with the same period in 2024, primarily due to the higher volumes described above.\nService revenues for the nine months ended September 30, 2025, increased $209 million, or 7%, from the same period in 2024, primarily due to higher volumes in surface combatants at Ingalls, live, virtual, and constructive \n29\nTable of Contents\n                                                            \ntraining solutions and cyber, electronic warfare & space at Mission Technologies, and naval nuclear support services at Newport News.\nSegment cost of service revenues for the nine months ended September 30, 2025, increased $185 million, or 7%, compared with the same period in 2024, primarily due to the higher volumes described above. \nOTHER FINANCIAL INFORMATION\nInterest Expense\nInterest expense for the three months ended September 30, 2025, was $23 million, which was consistent with the same period in 2024. There were no individually significant drivers for interest expense during the period.\nInterest expense for the nine months ended September 30, 2025, was $79 million, compared to $68 million for the same period in 2024. The increase in interest expense for the nine months ended September 30, 2025 was driven by an increase in outstanding long-term debt compared to the prior year period.\nNon-Operating Retirement Benefit\nThe non-operating retirement benefit includes the following components of net periodic benefit costs: interest cost, expected return on plan assets, amortization of prior service cost (credit) and actuarial loss (gain), and settlement and curtailment effects. \nFor the \nthree and nine months ended\n September 30, 2025, the non-operating retirement benefit was $48 million and $143 million, respectively, compared with $44 million and $134 million, respectively, for the same periods in 2024. The favorable change in the non-operating retirement benefit for both periods was primarily driven by the amortization of net actuarial costs.\nOther, Net\nOther, net income for the \nthree and nine months ended\n September 30, 2025, was $18 million and $30 million, respectively, compared with other, net income of $9 million and $21 million, respectively, for the same periods in 2024. The increase in other, net income for both periods was primarily driven by an increase in unrealized gains on investments.\nFederal and Foreign Income Taxes\n \nOur effective income tax rates on earnings from operations for the three months ended September 30, 2025 and 2024, were \n28.9\n% and \n9.8\n%, respectively. Our effective income tax rates on earnings from operations for the nine months ended September 30, 2025 and 2024, were \n23.0\n% and \n16.6\n%, respectively. The higher effective tax rates for the \nthree and nine months ended\n September 30, 2025, were primarily attributable to a reduction in the estimated research and development tax credits for the prior period recorded in the current period.\nFor each of the \nthree and nine months ended\n September 30, 2025, our effective tax rate differed from the federal statutory corporate income tax rate of \n21\n% primarily due to a reduction in the estimated research and development tax credits for the prior period recorded in the current period.\nBACKLOG\nTotal backlog as of September 30, 2025, and December 31, 2024, was $55.7 billion and $48.7 billion, respectively. Total backlog includes both funded backlog (firm orders for which funding is contractually obligated by the customer) and unfunded backlog (firm orders for which funding is not currently contractually obligated by the customer). Backlog excludes unexercised contract options and unfunded indefinite delivery/indefinite quantity orders. For contracts having no stated contract values, backlog includes only the amounts committed by the customer as of September 30, 2025 and December 31, 2024, respectively. \n30\nTable of Contents\n                                                            \nThe following table presents funded and unfunded backlog by segment as of September 30, 2025, and December 31, 2024: \n \nSeptember 30, 2025\nDecember 31, 2024\n($ in millions)\nFunded\nUnfunded\nTotal Backlog\nFunded\nUnfunded\nTotal Backlog\nIngalls\n$\n15,640\n \n$\n2,906\n \n$\n18,546\n \n$\n13,519 \n$\n2,333 \n$\n15,852 \nNewport News\n15,586\n \n15,420\n \n31,006\n \n12,079 \n14,666 \n26,745 \nMission Technologies\n1,970\n \n4,157\n \n6,127\n \n1,824 \n4,292 \n6,116 \nTotal backlog\n$\n33,196\n \n$\n22,483\n \n$\n55,679\n \n$\n27,422 \n$\n21,291 \n$\n48,713 \nWe expect approximately 21% of the $48.7 billion total backlog as of December 31, 2024, to be converted into sales in 2025. U.S. Government orders comprised substantially all of the backlog as of September 30, 2025 and December 31, 2024.\nContract Awards\nThe value of new contract awards during the nine months ended September 30, 2025, was approximately $16.0 billion, primarily driven by awards at Newport News and Ingalls, inclusive of a contract modification for construction of two additional Block V \nVirginia\n-class submarines.\nLIQUIDITY AND CAPITAL RESOURCES\nWe seek to efficiently convert operating results into cash for deployment in operating our businesses, implementing our business strategy, and maximizing stockholder value. We use various financial measures to inform our capital deployment strategy, including net cash provided by operating activities and free cash flow. We believe these measures are useful to investors in assessing our financial performance. \nThe following table summarizes key components of cash flow provided by operating activities:\nNine Months Ended September 30\n2025 vs. 2024\n($ in millions)\n2025\n2024\nDollars\nNet earnings\n$\n446\n \n$\n427 \n$\n19 \nDepreciation and amortization of purchased intangibles\n242\n \n242 \n— \nStock-based compensation\n43\n \n15 \n28 \nDeferred income taxes\n121\n \n(55)\n176 \nGain on investments in marketable securities\n(28)\n(22)\n(6)\nOther non-cash transactions, net\n15\n \n7 \n8 \nRetiree benefits\n(116)\n(84)\n(32)\nTrade working capital increase\n(177)\n(528)\n351 \nNet cash provided by operating activities\n$\n546\n \n$\n2 \n$\n544 \nWe have historically maintained a capital structure comprised of a mix of equity and debt financing. We vary our leverage both to optimize our equity return and to pursue acquisitions. We expect to meet our current debt obligations as they come due through internally generated funds from current levels of operations, existing borrowing facilities, and/or through refinancing in the debt markets prior to the maturity dates of our debt.\nCash Flows\nWe discuss below our significant operating, investing, and financing activities affecting cash flows for the nine months ended September 30, 2025 and 2024, as classified in our unaudited condensed consolidated statements of cash flows.\n31\nTable of Contents\n                                                            \nOperating Activities \nCash provided by operating activities for the nine months ended September 30, 2025, was $546 million, compared with cash provided by operating activities of $2 million for the same period in 2024. The change in operating cash flow was primarily due to a favorable change in trade working capital driven by the timing of billings across programs and lower payments for income taxes.\nWe expect cash generated from operations in combination with our current cash and cash equivalents, as well as existing borrowing facilities, to be sufficient to service debt and retiree benefit plans, meet contractual obligations, and fund capital expenditures for at least the next twelve calendar months beginning October 1, 2025, and beyond such twelve-month period based on our current business plans.\nInvesting Activities\nCash used in investing activities for the nine months ended September 30, 2025, was $387 million, compared to $238 million used in investing activities for the same period in 2024. The change in investing cash was primarily driven by the acquisition of W International.\nFor 2025, we expect our capital expenditures for maintenance and sustainment to be approximately 1.0% to 1.5% of annual revenues and our discretionary capital expenditures to be approximately 2.0% to 2.5% of annual revenues. Our capital expenditures are expected to increase due to investments to expand our shipbuilding capacity.\n \nFinancing Activities\nCash used in financing activities for the nine months ended September 30, 2025, was $678 million, compared with $184 million used in financing activities for the same period in 2024. The change in cash used in financing activities was primarily due to a $396 million decrease in proceeds from our commercial paper program and a $271 million increase in repayments of long term debt, partially offset by a decrease of $162 million in common stock repurchases. \nFree Cash Flow\nFree cash flow represents cash provided by operating activities less capital expenditures net of related grant proceeds. Free cash flow is not a measure recognized under GAAP. Free cash flow has limitations as an analytical tool and should not be considered in isolation from, or as a substitute for, net earnings as a measure of our performance or net cash provided by operating activities as a measure of our liquidity. We believe free cash flow is an important liquidity measure for our investors because it provides them insight into our current and period-to-period performance and our ability to generate cash from continuing operations. We also use free cash flow as a key operating metric in assessing the performance of our business and as a key performance measure in evaluating management performance and determining incentive compensation. Free cash flow may not be comparable to similarly titled measures of other companies.\nThe following table reconciles net cash provided by operating activities to free cash flow:\nNine Months Ended September 30\n2025 vs. 2024\n($ in millions)\n2025\n2024\nDollars\nNet cash provided by operating activities\n$\n546\n \n$\n2 \n$\n544 \nLess capital expenditures:\nCapital expenditure additions\n(268)\n(253)\n(15)\nGrant proceeds for capital expenditures\n6\n \n14 \n(8)\nFree cash flow\n$\n284\n \n$\n(237)\n$\n521 \nFree cash flow for the nine months ended September 30, 2025, increased $521 million from the same period in 2024, primarily due to a favorable change in trade working capital driven by the timing of billings across programs and lower payments for income taxes.\n32\nTable of Contents\n                                                            \nGovernmental Regulation and Supervision\nThe U.S. Government has the ability, pursuant to regulations relating to contractor business systems, to decrease or withhold contract payments if it determines material weaknesses exist in one or more such systems. As of September 30, 2025 and 2024, the cumulative amounts of payments withheld by the U.S. Government under our contracts subject to these regulations were not material to our liquidity or cash flows.\nOff-Balance Sheet Arrangements\nIn the ordinary course of business, we use letters of credit issued by commercial banks to support certain leases, insurance policies, and contractual performance obligations, as well as surety bonds issued by insurance companies principally to support our self-insured workers' compensation plans. As of September 30, 2025, $11 million in letters of credit were issued but undrawn and $368 million of surety bonds were outstanding. As of September 30, 2025, we had no other significant off-balance sheet arrangements.\nACCOUNTING STANDARDS UPDATES\nSee Note 3: Accounting Standards Updates in Part I, Item 1 for further information.\nFORWARD-LOOKING STATEMENTS AND PROJECTIONS\nStatements in this Quarterly Report on Form 10-Q and in our other filings with the SEC, as well as other statements we may make from time to time, other than statements of historical fact, constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. In some cases, you can identify forward-looking statements by words such as \"may,\" \"will,\" \"should,\" \"expects,\" \"intends,\" \"plans,\" \"anticipates,\" \"believes,\" \"estimates,\" \"guidance,\" \"outlook,\" \"predicts,\" \"potential,\" \"continue,\" and similar words or phrases or the negative of these words or phrases. These statements relate to future events or our future financial performance and involve known and unknown risks, uncertainties, and other factors that may cause our actual results, levels of activity, performance, or achievements to be materially different from any future results, levels of activity, performance, or achievements expressed or implied by these forward-looking statements. Although we believe the expectations reflected in the forward-looking statements are reasonable when made, we cannot guarantee future results, levels of activity, performance, or achievements. There are a number of important factors that could cause our actual results to differ materially from the results anticipated by our forward-looking statements, which include, but are not limited to:\n•\nour dependence on the U.S. Government for substantially all of our business;\n•\nsignificant delays or reductions in appropriations for our programs and/or changes in customer priorities and requirements (including government budgetary constraints, government shutdowns, shifts in defense spending, and changes in customer short-range and long-range plans);\n•\nour ability to estimate our future contract costs, including cost increases due to inflation, labor challenges, changes in trade policy, or other factors and our efforts to recover or offset such costs and/or changes in estimated contract costs, and perform our contracts effectively;\n•\nchanges in business practices, procurement processes and government regulations and our ability to comply with such requirements;\n•\nadverse economic conditions in the United States and globally;\n•\nour level of indebtedness and ability to service our indebtedness;\n•\nour ability to deliver our products and services at an affordable life cycle cost and compete within our markets;\n•\nour ability to attract, retain, and train a qualified workforce;\n•\nsubcontractor and supplier performance and the availability and pricing of raw materials and components;\n•\nour ability to execute our strategic plan, including with respect to share repurchases, dividends, capital expenditures, and strategic acquisitions;\n•\ninvestigations, claims, disputes, enforcement actions, litigation (including criminal, civil, and administrative), and/or other legal proceedings, and improper conduct of employees, agents, subcontractors, suppliers, business partners, or joint ventures in which we participate, including the impact on our reputation or ability to do business; \n•\nchanges in key estimates and assumptions regarding our pension and retiree health care costs;\n•\nsecurity threats, including cyber security threats, and related disruptions;\n•\nnatural and environmental disasters and political instability;\n33\nTable of Contents\n                                                            \n•\nhealth epidemics, pandemics and similar outbreaks; and\n•\nother risk factors discussed herein and in our other filings with the SEC.\nAdditional factors include those described in our 2024 Annual Report on Form 10-K, including under the captions “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and “Business,” in our subsequent quarterly reports on Form 10-Q, including under the captions “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and in our subsequent filings with the SEC.\nThere may be other risks and uncertainties that we are unable to predict at this time or that we currently do not expect to have a material adverse effect on our business, and we undertake no obligation to update or revise any forward-looking statements. You should not place undue reliance on any forward-looking statements that we may make.\n34\nTable of Contents\n                                                            \nGLOSSARY OF PROGRAMS\n \nIncluded below are brief descriptions of some of the programs discussed in this Quarterly Report on Form 10-Q.\nProgram Name\n  \nProgram Description\nAircraft carrier RCOH\n  \nPerform refueling and complex overhaul (\"RCOH\") of nuclear-powered aircraft carriers, which is required at the mid-point of their 50-year life cycle. USS \nJohn C. Stennis\n (CVN 74) arrived at Newport News for the start of its RCOH in May 2021, and USS \nGeorge Washington\n (CVN 73) was redelivered to the U.S. Navy in May 2023. \nAmerica\n class (LHA 6) amphibious assault ships\n  \nDesign and build large deck amphibious assault ships that provide forward presence and power projection as an integral part of joint, interagency and multinational maritime expeditionary forces. The \nAmerica\n class (LHA 6) ships, together with the \nWasp\n class (LHD 1) ships, are the successors to the decommissioned \nTarawa\n class (LHA 1) ships. The \nAmerica\n class (LHA 6) ships optimize aviation operations and support capabilities. In 2023, we were awarded a long-lead-time material contract for \nHelmand Province\n (LHA 10), and in 2024, we were awarded a contract modification for the detail design and construction of \nHelmand Province\n (LHA 10). We are currently constructing \nBougainville\n (LHA 8) and \nFallujah\n (LHA 9). \nArleigh Burke\n class (DDG 51) destroyers\n  \nBuild guided missile destroyers designed for conducting anti-air, anti-submarine, anti-surface, and strike operations. The Aegis-equipped \nArleigh Burke\n class (DDG 51) destroyers are the U.S. Navy's primary surface combatant, and have been constructed in variants, allowing technological advances during construction. We delivered USS \nFrank E. Petersen Jr.\n (DDG 121), USS \nLenah H. Sutcliffe Higbee \n(DDG 123), and USS \nJack H. Lucas\n (DDG 125) in 2021, 2022, and 2023, respectively. We have contracts to construct the following \nArleigh Burke\n class (DDG 51) destroyers: \nTed Stevens\n (DDG 128), \nJeremiah Denton\n (DDG 129), \nGeorge M. Neal\n (DDG 131),\n Sam Nunn\n (DDG 133), \nThad Cochran\n (DDG 135),\n John F. Lehman \n(DDG 137), \nTelesforo Trinidad\n (DDG 139), \nErnest E. Evans\n (DDG 141), \nCharles J. French\n (DDG 142), and \nRichard J. Danzig\n (DDG 143).\nColumbia \nclass (SSBN 826) submarines\nDesign and construct modules for \nColumbia\n class (SSBN 826) nuclear ballistic missile submarines (\"SSBNs\") as a subcontractor to Electric Boat. SSBNs are the most secure and survivable of our nation’s nuclear deterrent triad. \nColumbia\n class SSBNs will carry approximately 70 percent of the nation’s nuclear arsenal. The \nColumbia\n class (SSBN 826) program plan of record is to construct 12 new SSBNs to replace the current aging \nOhio\n class. We have a teaming agreement with Electric Boat to build modules for the entire \nColumbia \nclass (SSBN 826) submarine program that leverages our \nVirginia \nclass (SSN 774) experience. We have been awarded contracts from Electric Boat for integrated product and process development, providing long–lead–time material and advance construction, and construction of the first two boats of the \nColumbia\n class (SSBN 826) submarine program. Construction of the first \nColumbia\n class (SSBN 826) submarine began in 2020. In 2023, we received an award modification for long-lead-time material and advance construction for the next five boats.\nGerald R. Ford\n class (CVN 78) aircraft carriers\n  \nDesign and construction for the \nFord\n class program, which is the aircraft carrier replacement program for the decommissioned \nEnterprise\n (CVN 65) and \nNimitz\n class (CVN 68) aircraft carriers. USS \nGerald R. Ford\n (CVN 78), the first ship of the \nFord \nclass, was delivered to the U.S. Navy in the second quarter of 2017. In June 2015, we were awarded a contract for the detail design and construction of \nJohn F. Kennedy\n (CVN 79), following several years of engineering, advance construction, and purchase of long-lead-time components and material. In addition, we have received awards for detail design and construction of \nEnterprise \n(CVN 80) and \nDoris Miller \n(CVN 81). This category also includes the class' non-recurring engineering. The class is expected to bring improved warfighting capability, quality of life improvements for sailors, and reduced life cycle costs.\n35\nTable of Contents\n                                                            \nLegend\n class National Security Cutter\n  \nDesign and build the U.S. Coast Guard's National Security Cutters (\"NSCs\"), the largest and most technically advanced class of cutter in the U.S. Coast Guard. The NSC is equipped to carry out maritime homeland security, maritime safety, protection of natural resources, maritime mobility, and national defense missions. There were initially 11 ships planned for this program, of which the first ten ships have been delivered. In Q2 2025, we reached agreement with the U.S. Coast Guard to terminate production and delivery of the 11th ship.\nNaval nuclear support services\nProvide services to and in support of the U.S. Navy, ranging from services supporting the Navy's carrier and submarine fleets to maintenance services at U.S. Navy training facilities. Naval nuclear support services include design, construction, maintenance, and disposal activities for in-service U.S. Navy nuclear ships worldwide through mobile and in-house capabilities. Services include maintenance services on nuclear reactor prototypes.\nSan Antoni\no class (LPD 17) amphibious transport dock ships\n  \nDesign and build amphibious transport dock ships, which are warships that embark, transport, and land elements of a landing force for a variety of expeditionary warfare missions, and also serve as the secondary aviation platform for Amphibious Readiness Groups. The\n San Antonio\n class (LPD 17) is the newest addition to the U.S. Navy's 21st century amphibious assault force, and these ships are a key element of the U.S. Navy's seabase transformation. In 2022, we delivered USS \nFort Lauderdale\n (LPD 28), and we were awarded a long-lead-time material contract for \nPhiladelphia\n (LPD 32). In 2023, we received an award modification for the detail design and construction of \nPhiladelphia \n(LPD 32). In 2024, we delivered USS \nRichard M. McCool Jr.\n (LPD 29), and we were awarded a multi-ship procurement contract for the construction of \nTravis Manion\n (LPD 33), LPD 34 (unnamed), and LPD 35 (unnamed). We are currently constructing \nHarrisburg\n (LPD 30), \nPittsburgh\n (LPD 31), and \nPhiladelphia\n (LPD 32).\nVirginia \nclass (SSN 774) fast attack submarines\n  \nConstruct attack submarines as the principal subcontractor to Electric Boat. The \nVirginia\n class (SSN 774) is a post-Cold War design tailored to excel in a wide range of warfighting missions, including anti-submarine and surface ship warfare; special operation forces; strike; intelligence, surveillance, and reconnaissance; carrier and expeditionary strike group support; and mine warfare."
}