{
  "item1": "accrue estimated costs perform environmental remediation when determine probable will incur expenses future, amounts can reasonably estimate, address environmental conditions currently formerly owned leased operating facilities, sites where named Potentially Responsible Party (\"PRP\") U.S. Environmental Protection Agency (\"EPA\") similarly designated another environmental agency. Uncertainties regarding extent required remediation, determination legally responsible parties, status laws regulations interpretations make future environmental remediation costs difficult estimate can cause estimated remediation costs change. believe material compliance environmental laws regulations, historical environmental compliance costs not been material business.",
  "item7": "- Time materials contracts specify fixed hourly billing rate each direct labor hour expended reimbursement allowable material costs expenses. - Negotiated contract fee structures include: fixed fee amounts, cost sharing arrangements reward penalize contractors under- over-cost target performance, respectively, positive award fees, negative penalty arrangements. Profit margins may vary materially depending negotiated contract fee arrangements, percentage-of-completion contract, achievement performance objectives, stage performance which right receive fees, particularly under incentive award fee contracts, finally determined. - Certain contracts contain award fees based performance criteria such cost, schedule, quality, technical performance.",
  "item2": "Management's Discussion Analysis Financial Condition Results Operations OVERVIEW Huntington Ingalls Industries, Inc. (\"HII\", \"we\", \"us\", \"our\") global, all-domain defense partner, building delivering world’s most powerful, survivable naval ships technologies safeguard America’s seas, sky, land, space, cyber. more than century, Ingalls Shipbuilding segment (\"Ingalls\") Mississippi Newport News Shipbuilding segment (\"Newport News\") Virginia built more ships more ship classes than any other U.S. naval shipbuilder, making us America's largest shipbuilder."
}