{
  "source_file": "hlt-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our unaudited condensed consolidated financial statements and related notes included elsewhere in this Quarterly Report on Form 10-Q and with our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. \nForward-Looking Statements\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"). These statements include, but are not limited to, statements related to our expectations regarding the performance of our business, future financial results, liquidity and capital resources and other non-historical statements. In some cases, you can identify these forward-looking statements by the use of words such as \"outlook,\" \"believes,\" \"expects,\" \"forecasts,\" \"potential,\" \"continues,\" \"may,\" \"will,\" \"should,\" \"could,\" \"seeks,\" \"projects,\" \"predicts,\" \"intends,\" \"plans,\" \"estimates,\" \"anticipates\" or the negative version of these words or other comparable words. Such forward-looking statements are subject to various risks and uncertainties including, among others, risks inherent to the hospitality industry; macroeconomic factors beyond our control, such as inflation, changes in interest rates, challenges due to labor shortages or disputes and supply chain disruptions; the loss of key senior management personnel; competition for hotel guests and management and franchise contracts; risks related to doing business with third-party hotel owners; performance of our information technology systems; growth of reservation channels outside of our system; risks of doing business outside of the U.S.; risks associated with conflicts in Eastern Europe and the Middle East; uncertainty resulting from U.S. and global political trends, tariffs and other policies, including potential barriers to travel, trade and immigration and other geopolitical events; and our indebtedness. Accordingly, there are or will be important factors that could cause actual outcomes or results to differ materially from those indicated in these statements. We believe these factors include, but are not limited to, those described under \"Part I—Item 1A. Risk Factors\" of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. These factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements that are included in this Quarterly Report on Form 10-Q. We undertake no obligation to publicly update or review any forward-looking statement, whether as a result of new information, future developments or otherwise, except as required by law.\nOverview\nOur Business\nHilton is\n \none of the largest global hospitality companies, with 8,995 properties comprising 1,328,821 rooms in 141 countries and territories as of September 30, 2025. Our premier brand portfolio includes luxury, lifestyle, full service, focused service and all-suites hotel brands, as well as timeshare brands. As of September 30, 2025, we had 235 million members in our award-winning guest loyalty program, Hilton Honors, an increase of 16 percent from September 30, 2024.\nSegments and Regions\nWe analyze our operations and business by both operating segments and geographic regions. Our operations consist of two reportable segments that are based on similar products and services: (i) management and franchise and (ii) ownership. The management and franchise segment provides services, including hotel management and licensing of our IP and/or the use of our booking channels and related programs. Revenues from this segment include: (i) management and franchise fees charged to third-party hotel owners; (ii) licensing fees from our strategic partners, including co-branded credit card providers and strategic partner hotels, and HGV; and (iii) fees for managing the hotels in our ownership segment. As a manager of hotels, we typically are responsible for supervising or operating the hotel in exchange for management fees. As a franchisor of hotels, we charge franchise fees in exchange for the use of one of our brand names and/or related commercial services, such as our reservations system, marketing and information technology services, while a third party manages or operates such franchised hotels. The ownership segment primarily derives revenues from nightly hotel room sales, food and beverage sales and other services at our consolidated hotels. \nWe conduct business in three distinct geographic regions: (i) the Americas; (ii) Europe, Middle East and Africa (\"EMEA\"); and (iii) Asia Pacific. The Americas region includes North America, South America and Central America, including all Caribbean nations. Although the U.S., which represented 64 percent of our system-wide hotel rooms as of September 30, 2025, is included in the Americas region, it is often analyzed separately and apart from the Americas region and, as such, it is presented separately within our hotel operating statistics in \"—Results of Operations.\" The EMEA region includes Europe, which represents the western-most peninsula of Eurasia stretching from Iceland in the west to Russia in the east, and the Middle \n16\nEast and Africa (\"MEA\"), which represents the Middle East region and all African nations, including the Indian Ocean island nations. Europe and MEA are often analyzed separately and, as such, are presented separately within our hotel operating statistics in \"—Results of Operations.\" The Asia Pacific region includes the eastern and southeastern nations of Asia, as well as India, Australia, New Zealand and the Pacific Island nations.\nSystem Growth and Development Pipeline\nOur strategic objectives include the continued expansion of our global hotel network, in particular our fee-based business. As we enter into new management and franchise contracts and enter into strategic agreements to complement our hotel portfolio, we expand our business with limited or no capital investment by us as the manager, franchisor or licensor, since the capital required to build, renovate and maintain hotels is typically provided by the third-party owners with whom we contract to provide management services, license our IP or provide access to our booking channels and related programs. Prior to approving the addition of new hotels to our management and franchise development pipeline, we evaluate the economic viability of the hotel based on its geographic location, the credit quality of the third-party owner and other factors. By increasing the number of management and franchise contracts with third-party owners, over time we expect to increase revenues, overall return on invested capital and free cash flow. See further discussion on our cash management policy in \"—Liquidity and Capital Resources.\" The current economic environment, including elevated levels of inflation and interest rates, has posed certain challenges to the execution of our growth strategy, which in some cases have included and may continue to include delays in openings and new development. \nIn addition to our current hotel portfolio, we are focused on the growth of our business by expanding our global hotel network through our development pipeline, which represents hotels that we expect to add to our system in the future. The following table summarizes our development activity:\nAs of or for the\nNine Months Ended\nSeptember 30, 2025\nHotels\nRooms\n(1)\nHotel system\nOpenings\n606 \n71,000 \nNet additions\n(2)\n545 \n59,800 \nDevelopment pipeline\nAdditions\n790 \n101,800 \nCount as of period end\n(3)\n3,648 \n515,400 \n____________\n(1)\nRounded to the nearest hundred.\n(2)\nRepresents room additions, net of rooms removed from our system. Net unit growth from September 30, 2024 to September 30, 2025 was 6.5 percent.\n(3)\nThe hotels in our development pipeline were under development throughout 128 countries and territories, including 26 countries and territories where we had no existing hotels, with nearly half of the rooms under construction and more than half of the rooms located outside of the U.S. Rooms under construction include rooms for hotels under construction or operating hotels that are in the process of conversion to our system. Nearly all of the rooms in our development pipeline will be in our management and franchise segment upon opening. We do not consider any individual development project to be material to us.\n17\nKey Business and Financial Metrics Used by Management\nComparable Hotels\nWe define our comparable hotels as those that were active and operating in our system for at least one full calendar year and were open January 1st of the previous year. We exclude hotels that have undergone a change in brand or ownership type or a large-scale capital project during the current or comparable periods or otherwise do not have available comparable results, such as those that have sustained substantial property damage or encountered business interruption. We exclude strategic partner hotels from our comparable hotels. Of the 8,887 hotels in our system as of September 30, 2025, 489 hotels were strategic partner hotels and 6,339 hotels were classified as comparable hotels. Our 2,059 non-comparable hotels as of September 30, 2025 included (i) 1,124 hotels that were added to our system after January 1, 2024 or that have undergone a change in brand or ownership type during the current or comparable periods reported and (ii) 935 hotels that were removed from the comparable group for the current or comparable periods reported because they underwent or are undergoing large-scale capital projects, sustained substantial property damage, encountered business interruption or comparable results were otherwise not available for them.\nOccupancy\nOccupancy represents the total number of room nights sold divided by the total number of room nights available at a hotel or group of hotels for a given period. Occupancy measures the utilization of available capacity at a hotel or group of hotels. Management uses occupancy to gauge demand at a specific hotel or group of hotels in a given period. Occupancy levels also help management determine achievable Average Daily Rate (\"ADR\") pricing levels as demand for hotel rooms increases or decreases.\nADR\nADR represents hotel room revenue divided by the total number of room nights sold for a given period. ADR measures the average room price attained by a hotel, and ADR trends provide useful information concerning the pricing environment and the nature of the customer base of a hotel or group of hotels. ADR is a commonly used performance measure in the industry, and we use ADR to assess pricing levels that we are able to generate by type of customer, as changes in rates charged to customers have different effects on overall revenues and incremental profitability than changes in occupancy, as described above.\nRevenue per Available Room (\"RevPAR\")\nRevPAR is calculated by dividing hotel room revenue by the total number of room nights available to guests for a given period. We consider RevPAR to be a meaningful indicator of our performance as it provides a metric correlated to two primary and key drivers of operations at a hotel or group of hotels, as previously described: occupancy and ADR. RevPAR is also a useful indicator in measuring performance over comparable periods for comparable hotels.\nReferences to occupancy, ADR and RevPAR are presented on a comparable basis, based on the comparable hotels as of September 30, 2025, and references to ADR and RevPAR are presented on a currency neutral basis, unless otherwise noted. As such, comparisons of these hotel operating statistics for the three and nine months ended September 30, 2025 and 2024 use foreign currency exchange rates for the three and nine months ended September 30, 2025, respectively.\nAdjusted EBITDA\nAdjusted EBITDA is calculated as net income (loss), excluding interest expense, a provision for income tax benefit (expense) and depreciation and amortization expenses, as well as gains, losses, revenues and expenses earned or incurred in connection with: (i) asset dispositions for both consolidated and unconsolidated investments; (ii) foreign currency transactions; (iii) debt restructurings and retirements; (iv) FF&E replacement reserves required under certain lease agreements; (v) share-based compensation; (vi) reorganization, severance, relocation and other expenses; (vii) non-cash impairment; (viii) amortization of contract acquisition costs; (ix) cost reimbursement revenues and reimbursed expenses; and (x) other items.\nWe believe that Adjusted EBITDA provides useful information to investors about us and our financial condition and results of operations for the following reasons: (i) it is used by our management team to evaluate our operating performance and make day-to-day operating decisions and (ii) it is frequently used by securities analysts, investors and other interested parties as a common performance measure to compare results or estimate valuations across companies in our industry. Additionally, this measure excludes certain items that can vary widely across different industries and among competitors within our industry. For \n18\ninstance, interest expense and income taxes are dependent on company specifics, including, among other things, capital structure and operating jurisdictions, respectively, and, therefore, could vary significantly across companies. Depreciation and amortization expenses, as well as amortization of contract acquisition costs, are dependent upon company policies, including the method of acquiring and depreciating assets and the useful lives that are assigned to those depreciating or amortizing assets for accounting purposes. We also exclude items such as: (i) FF&E replacement reserves for leased hotels to be consistent with the treatment of capital expenditures for property and equipment, where depreciation of such capitalized assets is reported within depreciation and amortization expenses; (ii) share-based compensation, as this could vary widely among companies due to the different plans in place and the usage of them; and (iii) other items that are not reflective of our operating performance, such as amounts related to debt restructurings and debt retirements and reorganization and related severance costs, to enhance period-over-period comparisons of our ongoing operations. Further, Adjusted EBITDA excludes both cost reimbursement revenues and reimbursed expenses as we contractually do not operate the related programs to generate a profit and have contractual rights to adjust future collections to recover prior period expenditures. The direct reimbursements from property owners are billable and reimbursable as the costs are incurred and have no net effect on net income (loss) in the reporting period. The indirect reimbursements from property owners are typically billed and collected monthly, based on the underlying hotel's sales or usage (e.g., gross room revenue or number of reservations processed), while the associated costs are recognized as incurred by Hilton, creating timing differences, with the net effect impacting net income (loss) in the reporting period. These timing differences are due to our discretion to spend in excess of revenues earned or less than revenues earned in a single period to ensure that the programs are operated in the best long-term interests of our property owners. However, over the life of the operation of these programs, the expenses incurred related to the indirect reimbursements are designed to equal the revenues earned from the indirect reimbursements over time such that, in the long term, the programs will not earn a profit or generate a loss and do not impact our economics, either positively or negatively. Therefore, the net effect of our reimbursed revenues and expenses is not used by management to evaluate our operating performance, determine executive compensation or make other operating decisions, and we exclude their impact when evaluating period over period performance results.\nAdjusted EBITDA is not a recognized term under GAAP and should not be considered as an alternative, either in isolation or as a substitute, for net income (loss) or other measures of financial performance or liquidity, including cash flows, derived in accordance with GAAP. Further, Adjusted EBITDA has limitations as an analytical tool, including:\n•\nAdjusted EBITDA does not reflect changes in, or cash requirements for, our working capital needs;\n•\nAdjusted EBITDA does not reflect our interest expense, or the cash requirements necessary to service interest or principal payments, on our indebtedness;\n•\nAdjusted EBITDA does not reflect income tax expenses or the cash requirements to pay our taxes;\n•\nAdjusted EBITDA does not reflect historical cash expenditures or future requirements for capital expenditures or contractual commitments;\n•\nAdjusted EBITDA does not reflect the effect on earnings or changes resulting from matters that we consider not to be indicative of our future operations;\n•\nalthough depreciation and amortization are non-cash charges, the assets being depreciated and amortized will often have to be replaced in the future, and Adjusted EBITDA does not reflect any cash requirements for such replacements; and\n•\nother companies in our industry may calculate Adjusted EBITDA differently, limiting its usefulness as a comparative measure.\nBecause of these limitations, Adjusted EBITDA should not be considered as discretionary cash available to us to reinvest in the growth of our business, return to our stockholders through share repurchases and dividends or as measures of cash that will be available to us to meet our obligations.\n19\nResults of Operations\nThe hotel operating statistics by region for our system-wide comparable hotels were as follows:\nThree Months Ended\nChange\nNine Months Ended\nChange\nSeptember 30, 2025\n2025 vs. 2024\nSeptember 30, 2025\n2025 vs. 2024\nSystem-wide\nOccupancy\n74.5 \n%\n(0.5)\n%\npts.\n72.0 \n%\n(0.1)\n%\npts.\nADR\n$\n160.25 \n(0.5)\n%\n$\n159.90 \n0.4 \n%\nRevPAR\n$\n119.33 \n(1.1)\n%\n$\n115.16 \n0.3 \n%\nU.S.\nOccupancy\n74.5 \n%\n(1.0)\n%\npts.\n72.8 \n%\n(0.5)\n%\npts.\nADR\n$\n169.51 \n(0.9)\n%\n$\n169.76 \n0.1 \n%\nRevPAR\n$\n126.23 \n(2.3)\n%\n$\n123.65 \n(0.6)\n%\nAmericas (excluding U.S.)\nOccupancy\n71.9 \n%\n0.5 \n%\npts.\n68.7 \n%\n0.2 \n%\npts.\nADR\n$\n155.87 \n3.6 \n%\n$\n153.30 \n5.1 \n%\nRevPAR\n$\n112.03 \n4.3 \n%\n$\n105.33 \n5.4 \n%\nEurope\nOccupancy\n79.8 \n%\n(0.1)\n%\npts.\n73.9 \n%\n0.6 \n%\npts.\nADR\n$\n182.67 \n1.2 \n%\n$\n167.69 \n1.3 \n%\nRevPAR\n$\n145.86 \n1.0 \n%\n$\n123.97 \n2.1 \n%\nMEA\nOccupancy\n71.4 \n%\n4.5 \n%\npts.\n70.8 \n%\n4.7 \n%\npts.\nADR\n$\n153.65 \n3.0 \n%\n$\n182.98 \n2.3 \n%\nRevPAR\n$\n109.77 \n9.9 \n%\n$\n129.61 \n9.6 \n%\nAsia Pacific\nOccupancy\n72.8 \n%\n0.5 \n%\npts.\n68.5 \n%\n0.4 \n%\npts.\nADR\n$\n103.44 \n(0.9)\n%\n$\n103.02 \n(0.3)\n%\nRevPAR\n$\n75.32 \n(0.1)\n%\n$\n70.56 \n0.3 \n%\nSystem-wide RevPAR decreased during the three months ended September 30, 2025, primarily due to declines in the U.S., and increased marginally during the nine months ended September 30, 2025, supported by an improvement in system-wide ADR, which included the impact of inflation. In the U.S., for both the three and nine months ended September 30, 2025, RevPAR continued to be impacted by macroeconomic uncertainty, which, combined with unfavorable holiday shifts and prior year special events that did not repeat, led to a decline in leisure, group and business travel. The increases in RevPAR in the Americas region, excluding the U.S., were attributable to increases in inbound leisure and group travel. Europe and MEA were positively impacted by increases in both leisure and business travel. The decrease in Asia Pacific during the three months ended September 30, 2025 was primarily driven by declines in group and business travel in China, partially offset by countries and territories outside of China. RevPAR in Asia Pacific increased during the nine months ended September 30, 2025 due to moderate growth in countries and territories outside of China, offset by a decrease in RevPAR in China, due to a decline in group and business travel.\n20\nThe table below provides a reconciliation of net income to Adjusted EBITDA:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\n(in millions)\nNet income\n$\n421 \n$\n344 \n$\n1,163 \n$\n1,034 \nInterest expense\n159 \n140 \n455 \n412 \nIncome tax expense\n183 \n147 \n480 \n413 \nDepreciation and amortization expenses\n46 \n37 \n130 \n107 \nLoss (gain) on sales of assets, net\n— \n2 \n— \n(5)\nLoss on foreign currency transactions\n9 \n3 \n8 \n5 \nLoss on debt guarantees\n(1)\n— \n— \n— \n50 \nFF&E replacement reserves\n18 \n14 \n50 \n38 \nShare-based compensation expense\n44 \n44 \n135 \n140 \nAmortization of contract acquisition costs\n15 \n12 \n42 \n37 \nCost reimbursement revenues\n(2)\n(1,837)\n(1,627)\n(5,278)\n(4,841)\nReimbursed expenses\n(2)\n1,902 \n1,790 \n5,556 \n5,164 \nOther adjustments\n(3)\n16 \n(2)\n38 \n17 \nAdjusted EBITDA\n$\n976 \n$\n904 \n$\n2,779 \n$\n2,571 \n____________\n(1)\nAmount includes losses on debt guarantees for certain hotels that we manage; refer to Note 12: \"Commitments and Contingencies\" in our unaudited condensed consolidated financial statements for additional information.\n(2)\nAmounts include results from the operation of programs conducted for the benefit of property owners and exclude cash receipts recorded as deferred revenues on our condensed consolidated balance sheets related to these programs. Under the terms of the related contracts, we do not operate these programs to generate a profit and have contractual rights to adjust future collections to recover prior period expenditures.\n(3)\nAmount for the nine months ended September 30, 2025 includes expected future credit losses on financing receivables. Amounts for the nine months ended September 30, 2025 and 2024 include restructuring costs related to certain leased hotels. Amount for the nine months ended September 30, 2024 also includes transaction costs resulting from the amendment of our Term Loans and transaction costs incurred for acquisitions. Amounts for all periods include net losses (gains) related to certain of our investments in unconsolidated affiliates, severance and other items.\nRevenues\nThree Months Ended\nPercent\nNine Months Ended\nPercent\nSeptember 30,\nChange\nSeptember 30,\nChange\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\n(in millions)\n(in millions)\nFranchise and licensing fees\n$\n739 \n$\n698 \n5.9\n$\n2,109 \n$\n1,958 \n7.7\nBase and other management fees\n$\n93 \n$\n88 \n5.7\n$\n278 \n$\n287 \n(3.1)\nIncentive management fees\n65 \n66 \n(1.5)\n212 \n204 \n3.9\nTotal management fees\n$\n158 \n$\n154 \n2.6\n$\n490 \n$\n491 \n(0.2)\nThe increases in franchise fees included net increases of $15 million and $47 million during the three and nine months ended September 30, 2025, respectively, as a result of net hotel additions between the periods. The increase in franchise fees for the nine months ended September 30, 2025 also included an increase of $7 million in termination fees.\nThe currency neutral increase in franchise fees at our comparable franchised hotels of $10 million for the nine months ended September 30, 2025 was largely attributable to increases of in-place rates charged to hotels, partially offset by a decrease in fees due to a decrease in RevPAR. During the nine months ended September 30, 2025, RevPAR at our comparable franchised hotels decreased 0.6 percent, due to decreases in occupancy of 0.4 percentage points and ADR of 0.1 percent. \nLicensing fees increased $25 million and $83 million during the three and nine months ended September 30, 2025, respectively, as a result of increases in fees from our strategic partnerships, primarily resulting from activity under our co-branded credit card arrangements and HGV. Increased fees from HGV were the result of increased timeshare revenues earned by HGV, inclusive of the impact of adding new timeshare properties to our system between the periods. The nine months ended September 30, 2025 also included an increase in branded residential fees. \n21\nThe increase in management fees for the three months ended September 30, 2025 was primarily attributable to an increase in termination fees. For the nine months ended September 30, 2025, management fees from comparable properties increased $14 million, on a currency neutral basis, as a result of an increase in RevPAR at our comparable managed hotels of 3.1 percent due to increases in occupancy of 0.8 percentage points and ADR of 1.8 percent. The increase in management fees from comparable properties for the nine months ended September 30, 2025 was partially offset by a decrease of $12 million in termination fees received from hotels that exited our system.\nThree Months Ended\nPercent\nNine Months Ended\nPercent\nSeptember 30,\nChange\nSeptember 30,\nChange\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\n(in millions)\n(in millions)\nOwnership revenues\n$\n322 \n$\n330 \n(2.4)\n$\n888 \n$\n922 \n(3.7)\nThe $8 million decrease in ownership revenues for the three months ended September 30, 2025 included a currency neutral decrease of $22 million, partially offset by a $14 million increase resulting from favorable fluctuations in foreign currency exchange rates. The $34 million decrease in ownership revenues for the nine months ended September 30, 2025 included a currency neutral decrease of $61 million, partially offset by a $27 million increase resulting from favorable fluctuations in foreign currency exchange rates.\nRevenues from our comparable hotels in our ownership segment increased $6 million, on a currency neutral basis, during the nine months ended September 30, 2025 as a result of an increase in RevPAR of 3.1 percent due to increases in occupancy of 1.0 percentage points and ADR of 1.7 percent. Revenues from our non-comparable hotels within our ownership segment decreased $23 million and $67 million for the three and nine months ended September 30, 2025, respectively, on a currency neutral basis, primarily due to hotels that exited our system or changed ownership types between the periods.\nThree Months Ended\nPercent\nNine Months Ended\nPercent\nSeptember 30,\nChange\nSeptember 30,\nChange\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\n(in millions)\n(in millions)\nOther revenues\n$\n64 \n$\n58 \n10.3\n$\n187 \n$\n179 \n4.5\nThe increases in other revenues were related to increases in vendor rebates for activity related to our purchasing operations.\nOperating Expenses\nThree Months Ended\nPercent\nNine Months Ended\nPercent\nSeptember 30,\nChange\nSeptember 30,\nChange\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\n(in millions)\n(in millions)\nOwnership expenses\n$\n277 \n$\n288 \n(3.8)\n$\n802 \n$\n833 \n(3.7)\nDuring the three and nine months ended September 30, 2025, ownership expenses included currency neutral decreases of $23 million and $53 million, respectively, which were partially offset by increases of $12 million and $22 million, respectively, resulting from unfavorable fluctuations in foreign currency exchange rates.\nThe $19 million and $54 million decreases in ownership expenses, on a currency neutral basis, from our non-comparable hotels within our ownership segment during the three and nine months ended September 30, 2025, respectively, were primarily due to hotels that exited our system or changed ownership types between the periods.\n22\nThree Months Ended\nPercent\nNine Months Ended\nPercent\nSeptember 30,\nChange\nSeptember 30,\nChange\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\n(in millions)\n(in millions)\nDepreciation and amortization expenses\n$\n46 \n$\n37 \n24.3\n$\n130 \n$\n107 \n21.5\nGeneral and administrative expenses\n95 \n101 \n(5.9)\n298 \n318 \n(6.3)\nOther expenses\n23 \n26 \n(11.5)\n75 \n93 \n(19.4)\nThe increases in depreciation and amortization expenses were primarily related to software placed in service between the periods.\nThe decreases in general and administrative expenses for the three and nine months ended September 30, 2025 were due to lower general corporate costs. The decrease for the nine months ended September 30, 2025 was also due to a decrease in costs related to payroll and other compensation costs.\nThe decrease in other expenses for the nine months ended September 30, 2025 was primarily due to decreased procurement volume from our purchasing operations with properties outside of our system.\nNon-operating Income and Expenses\nThree Months Ended\nPercent\nNine Months Ended\nPercent\nSeptember 30,\nChange\nSeptember 30,\nChange\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\n(in millions)\n(in millions)\nInterest expense\n$\n(159)\n$\n(140)\n13.6\n$\n(455)\n$\n(412)\n10.4\nLoss on foreign currency transactions\n(9)\n(3)\nNM\n(1)\n(8)\n(5)\n60.0\nOther non-operating income (loss), net\n(5)\n11 \nNM\n(1)\n15 \n(17)\nNM\n(1)\nIncome tax expense\n(183)\n(147)\n24.5\n(480)\n(413)\n16.2\n____________\n(1)\nFluctuation in terms of percentage change is not meaningful.\nIn both March 2024 and September 2024, we issued $1.0 billion Senior Notes (the \"March 2024 Senior Notes issuance\" and the \"September 2024 Senior Notes issuance,\" respectively) for a total aggregate principal amount of $2.0 billion for the year.\nDuring the three months ended September 30, 2025, the\n increase i\nn interest expense was primarily attributable to an \nincrease\n of \n$25 million\n due to the September 2024 Senior Notes issuance and the July 2025 Senior Notes issuance. Th\ne increase \nduring the nine months ended September 30, 2025 was primarily attributable to an\n increase \nof \n$70 million \ndue to the March 2024 Senior Notes issuance, the September 2024 Senior Not\nes issuance and the July 2025 Senior Notes issuance. The increases were partially offset by decreases in interest expense of $7 million and $12 million during the three and nine months ended September 30, 2025, respectively, due to the repayment of the May 2025 Senior Notes and decreases of $4 million and $16 million on the unhedged portion of our Term Loan\ns during the three and nine months ended September 30, 2025, respectively, primarily as a result o\nf decreases in\n one-month SOFR for the comparable periods.\nThe net losses on foreign currency transactions are the result of changes in foreign currency exchange rates, including on certain intercompany financing arrangements, such as short-term cross-currency intercompany loans, as well as transactions denominated in foreign currencies.\n \nTh\ne net change \nin other non-operating income (loss), net for the three months ended September 30, 2025 was primarily driven by a loss on an investment in an unconsolidated affiliate, which was recognized during the three months ended September 30, 2025. The net change in other non-operating income (loss), net during the nine months ended September 30, 2025 was primarily driven by a decrease in losses on debt guarantees for certain hotels that Hilton manages, which were recognized during the nine months ended September 30, 2024, partially offset by a loss on an investment in an unconsolidated affiliate. See Note 12: \"Commitments and Contingencies\" in our unaudited condensed consolidated financial statements for additional information on the losses on debt guarantees.\nThe increases in income tax expense during the three and nine months ended September 30, 2025 were primarily attributable to the increase in income before income taxes.\n23\nSegment Results\nAs of September 30, 2025, our management and franchise segment included 858 managed and 8,091 franchised and licensed properties, which included 108 timeshare and 489 strategic partner hotels, consisting of 1,313,534 total rooms, and our ownership segment included 46 hotels consisting of 15,287 total rooms. Refer to Note 11: \"Business Segments\" in our unaudited condensed consolidated financial statements for reconciliations of revenues for our reportable segments to consolidated total revenues and of segment Adjusted EBITDA to consolidated income before income taxes. \nFranchise and licensing fees and total management fees, including fees charged to our ownership segment and excluding amortization of contract acquisition costs, reflects our management and franchise segment revenues and segment Adjusted EBITDA. Our ownership segment Adjusted EBITDA reflects revenues from consolidated hotels within our ownership segment, less (i) ownership expenses, excluding FF&E replacement reserves expenses, share-based compensation expenses and certain other items, less (ii) fees charged by our management and franchise segment to our ownership segment, plus (iii) income (loss) from hotels owned or leased by entities in which we own a noncontrolling financial interest. For the three and nine months ended September 30, 2025, refer to \"—Revenues\" for further discussion of the changes in our franchise and licensing fees and total management fees as well as for further discussion of the changes in revenues from our ownership segment. Refer to \"—Operating Expenses\" for further discussion of the changes in our ownership segment expenses.\nLiquidity and Capital Resources\nOverview\nAs of September 30, 2025, we had total cash and cash equivalents of $1,126 million, including $69 million of restricted cash and cash equivalents. The majority of our restricted cash and cash equivalents is related to cash collateral and cash held for FF&E reserves.\nOur known short-term liquidity requirements primarily consist of funds necessary to pay for operating and other expenditures, including: (i) costs associated with the management and franchising of hotels; (ii) corporate expenses; (iii) payroll and compensation costs; (iv) taxes and compliance costs; (v) scheduled debt maturities and interest payments on our outstanding indebtedness; (vi) lease payments under our finance and operating leases; (vii) costs, other than compensation and lease payments that are noted separately, associated with the operations of consolidated hotels within our ownership segment, including, but not limited to, utilities and operating supplies; (viii) committed contract acquisition costs; (ix) capital and maintenance expenditures for required renovations and maintenance at the consolidated hotels within our ownership segment; (x) corporate capital and information technology expenditures; (xi) dividends as declared; and (xii) share repurchases. \nOur known long-term liquidity requirements primarily consist of funds necessary to pay for: (i) scheduled debt maturities and interest payments on our outstanding indebtedness; (ii) lease payments under our finance and operating leases; (iii) committed contract acquisition costs; (iv) capital improvements to the consolidated hotels within our ownership segment; (v) corporate capital and information technology expenditures; (vi) dividends as declared; (vii) share repurchases; and (viii) commitments to owners in our management and franchise segment made in the normal course of business for which we are reimbursed by these owners through Hilton Honors and program fees to operate our Hilton Honors program, marketing, sales and brands programs and shared services.\nIn May 2025, we repaid the May 2025 Senior Notes at maturity. During the nine months ended September 30, 2025, we borrowed and subsequently repaid an aggregate $875 million under the Revolving Credit Facility. In July 2025 we issued $1.0 billion of 5.750% 2033 Senior Notes and used a portion of the net proceeds to fully repay the net borrowings under the Revolving Credit Facility from earlier during the period. Refer to Note 5: \"Debt\" in our unaudited condensed consolidated financial statements for additional information. Except for the repayment of the May 2025 Senior Notes and the July 2025 Senior Notes issuance, there were no material changes to our contractual obligations from what we previously disclosed in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nDuring the nine months ended September 30, 2025, we repurchased approximately 9.7 million shares of our common stock for $2.4 billion, excluding the excise tax on share repurchases. As of September 30, 2025, approximately $2.0 billion remained available for share repurchases under our stock repurchase program.\nIn circumstances where we have the opportunity to support our strategic objectives, we may provide guarantees or other commitments, as necessary, to owners of hotels that we currently or in the future will manage or franchise or other third parties. \n24\nSee Note 12: \"Commitments and Contingencies\" in our unaudited condensed consolidated financial statements for additional information on our commitments that were outstanding as of September 30, 2025.\nWe have a long-term investment policy that is focused on the preservation of capital and maximizing the return on new and existing investments and returning available capital to stockholders through dividends and share repurchases. Within the framework of our investment policy, we intend to finance our business activities primarily with cash on our balance sheet as of September 30, 2025, cash generated from our operations and, as needed, the use of the available capacity of our Revolving Credit Facility. We have continued access to debt markets and have obtained, and expect to continue to be able to obtain, financing as a source of liquidity as required and to extend maturities of existing borrowings, if necessary. Additionally, we may from time to time pre-sell Hilton Honors points through strategic partnership arrangements as a source of liquidity.\nAfter considering our approach to liquidity and our available sources of cash, we believe that our cash position and sources of liquidity will meet anticipated requirements for operating and other expenditures, including corporate expenses, payroll and other compensation costs, taxes and compliance costs, debt obligations and other commitments for the foreseeable future based on current conditions. The objectives of our cash management policy are maintaining the availability of liquidity and minimizing operational costs. \nWe may from time to time issue or incur or increase our capacity to incur new debt and/or purchase our outstanding debt through underwritten offerings, open market transactions, privately negotiated transactions or otherwise. Issuances or incurrence of new debt (or an increase in our capacity to incur new debt) and/or purchases or retirements of outstanding debt, if any, will depend on prevailing market conditions, liquidity requirements, contractual restrictions and other factors. The amounts involved may be material.\nSources and Uses of Our Cash and Cash Equivalents\nThe following table summarizes our net cash flows:\n \nNine Months Ended\nPercent\nSeptember 30,\nChange\n2025\n2024\n2025 vs. 2024\n(in millions)\nNet cash provided by operating activities\n$\n1,926 \n$\n1,431 \n34.6\nNet cash used in investing activities\n(130)\n(367)\n(64.6)\nNet cash used in financing activities\n(2,052)\n(274)\nNM\n(1)\n____________\n(1)\nFluctuation in terms of percentage change is not meaningful.\nOperating Activities\nCash flows from operating activities were primarily generated from management, franchise and licensing fee revenue. The increase in net cash inflows during the period included an increase in cash inflows generated from franchise and licensing fees, discussed in \"—Revenues.\" Additionally, there was a $234 million decrease in income tax payments due to timing as well as a decrease in cash outflows of $77 million for debt guarantee payments that were made during the nine months ended September 30, 2024.\nInvesting Activities\nNet cash used in investing activities for the nine months ended September 30, 2024 primarily included cash flows related to the acquisitions of (i) the Graduate brand and the associated franchise contracts and (ii) a controlling financial interest in the Sydell Group, both completed during the nine months ended September 30, 2024. Net cash used in investing activities for both periods included: (i) capital expenditures for property and equipment related to corporate property and the renovation of certain hotels in our ownership segment, and (ii) capitalized software costs that were related to various systems initiatives for the benefit of both our hotel owners and our overall corporate operations.\nFinancing Activities\nThe increase in net cash used in financing activities included (i) $500 million of cash outflows for the repayment of the May 2025 Senior Notes during the nine months ended September 30, 2025, (ii) a cash inflow of $2.0 billion from the March \n25\n2024 Senior Notes issuance and the September 2024 Senior Notes issuance during the nine months ended September 30, 2024, and (iii) a $276 million increase in cash outflows for share repurchases. The increase in net cash used was partially offset by a cash inflow of $1.0 billion from the July 2025 Senior Notes issuance.\nDebt and Borrowing Capacity\nAs of September 30, 2025, our total indebtedness, excluding the deduction for unamortized deferred financing costs and discount, was approximately $11.7 billion. No debt amounts were outstanding under the Revolving Credit Facility as of  September 30, 2025, which had an available borrowing capacity of $1,898 million after considering $102 million of letters of credit outstanding. For additional information on our total indebtedness and guarantees on our debt, refer to Note 5: \"Debt\" in our unaudited condensed consolidated financial statements. \nIf we are unable to generate sufficient cash flow from operations in the future to service our debt, we may be required to reduce capital expenditures or issue additional equity securities. However, we do not have any material indebtedness outstanding that matures prior to April 2027, and we believe that we have sufficient sources of liquidity and access to debt markets to address all indebtedness at or prior to the respective maturity dates. Our ability to make scheduled principal payments and to pay interest on our debt depends on our future operating performance, which is subject to general conditions in or affecting the hospitality industry that may be beyond our control.\nCritical Accounting Estimates\nThe preparation of our unaudited condensed consolidated financial statements in accordance with GAAP requires us to make estimates and assumptions that affect reported amounts and related disclosures. We have discussed the estimates and assumptions that we believe are critical because they involve a higher degree of judgment in their application and are based on information that is inherently uncertain in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, and, during the nine months ended September 30, 2025, there were no material changes to those critical accounting estimates that were previously disclosed."
}