{
  "source_file": "hlt-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.        Business\nOverview\nHilton is one of the largest global hospitality companies, with 8,447\n properties comprising \n1,268,206 \nrooms in \n140 countries and territories as of December 31, 2024. Founded in 1919, Hilton has been an innovator in the industry for over 105 years, driven by the vision of founder Conrad Hilton \"to fill the earth with the light and warmth of hospitality.\" Our premier brand portfolio includes luxury, lifestyle, full service, focused service and all-suites hotel brands, as well as timeshare brands. As of December 31, 2024, we had 211 million members in our award-winning guest loyalty program, Hilton Honors, an increase of 17 percent from December 31, 2023; refer to \"—Our Brand Portfolio\" and \"—Our Guest Loyalty Program\" below for additional information on our brands, including Hilton Honors.\nWe operate our business through: (i) a management and franchise segment and (ii) an ownership segment, each of which is reported as a segment based on (a) delivering a similar set of products and services and (b) being managed separately given its distinct economic characteristics. The management and franchise segment includes all of the hotels we manage for third-party owners, as well as all properties that license our intellectual property (\"IP\") and/or use our booking channels and related programs, and where we provide other contracted services, but the day-to-day services of the hotels are operated or managed by someone other than us. Revenues from this segment include: (i) management and franchise fees charged to third-party hotel owners; (ii) licensing fees from our strategic partners, including co-branded credit card providers, strategic partner hotels and Hilton Grand Vacations Inc. (\"HGV\"); and (iii) fees for managing hotels in our ownership segment. The ownership segment primarily derives revenues from nightly hotel room sales, food and beverage sales and other services at our consolidated owned and leased hotels. For more information regarding our segments, refer to \"—Our Business—Management and Franchise\" and \"—Our Business—Ownership\" below.\n3\nIn addition to our current hotel portfolio, we are focused on the growth of our business by expanding our global hotel network through our development pipeline, which represents hotels that we expect to add to our system in the future. The following table summarizes our development activity: \nAs of or for the Year Ended December 31, 2024\nHotels\nRooms\n(1)\nHotel system\nOpenings\n(2)\n973 \n98,400 \nNet additions\n(3)\n904 \n83,000 \nDevelopment pipeline\nAdditions\n(4)\n1,432 \n154,200 \nCount as of period end\n(5)\n3,578 \n498,600 \n____________\n(1)\nRounded to the nearest hundred.\n(2)\nOpenings include 411 hotels and approximately 19,500 rooms from strategic partner hotels.\n(3)\nRepresents room additions, net of rooms removed from our system. During 2024, 409 hotels and approximately 19,400 rooms added were from strategic partner hotels. Net unit growth for the year ended December 31, 2024 was 7.3 percent.\n(4)\nAdditions include 423 hotels and approximately 20,100 rooms from strategic partner hotels.\n(5)\nThe hotels in our development pipeline were under development throughout 118 countries and territories, including 25 countries and territories where we had no existing hotels, with nearly half of the rooms under construction and more than half of the rooms located outside of the U.S. Rooms under construction include rooms for hotels under construction or operating hotels that are in the process of conversion to our system. Nearly all of the rooms in our development pipeline will be in our management and franchise segment upon opening. We do not consider any individual development project to be material to us.\nWe continue to drive customer loyalty, including participation in our Hilton Honors guest loyalty program, through: (i) our experience in the hospitality industry, which spans more than a century of customer service and entrepreneurship, and continues to evolve to meet the tastes, preferences and demands of our guests; (ii) our strong, well-defined brands that operate throughout the hospitality industry chain scales; (iii) our dedicated and collaborative workforce, built to focus on providing exceptional customer experiences; and (iv) our commercial service offerings. We believe that satisfied customers will generate additional business at our properties, yielding strong overall hotel performance for us and our hotel owners. Strong results at our existing properties will encourage further development of additional hotels under our brands and conversions of existing hotels to our brands with both (i) owners who currently have properties in our system and (ii) new owners who sign management or franchise contracts with us in the future, which further supports our growth and future financial performance. We believe that our existing hotel system and development pipeline, which will require minimal capital investment from us, positions us to further improve and grow our business, allocate capital effectively and meet our customers' demands and preferences in the future.\n4\nOur Brand Portfolio\nThe goal of each of our brands is to deliver exceptional customer experiences and superior operating performance. \nDecember 31, 2024\n(1)\nBrand\n(1)\nCountries/ Territories\nProperties\nRooms\nPercentage of Total Rooms\nSelected Competitors\n(2)\n17\n34\n8,796\n0.7%\nFour Seasons, Mandarin Oriental, Peninsula, Ritz-Carlton, \nRosewood Hotels & Resorts, St. Regis\n24\n49\n17,195\n1.4%\nJW Marriott, Intercontinental, Sofitel, Grand Hyatt, Shangri-La, Fairmont\n7\n15\n2,619\n0.2%\nLeading Hotels of the World, Legend Preferred Hotels & Resorts, Belmond, The Luxury Collection\n1\n1\n91\n—%\nFirmdale Hotels, EDITION Hotels, Rosewood Hotels, One Aldwych\n2\n4\n2,797\n0.2%\nJW Marriott, Grand Hyatt, Fairmont, Intercontinental, Omni\n13\n43\n7,581\n0.6%\nKimpton, Thompson Hotels, W Hotels, Virgin Hotels, \nThe Hoxton, SO/\n98\n617\n227,467\n17.9%\nHyatt Regency, Marriott,\n Omni, Sheraton, Westin\n44\n180\n33,734\n2.7%\nAutograph Collection, The Unbound Collection, Independent Hotels, MGallery, Kimpton\n2\n34\n5,788\n0.5%\nLe Meridien, Hyatt Centric, 25h, Hotel Indigo\n59\n695\n156,943\n12.4%\nMarriott, Crowne Plaza, Delta, Holiday Inn, Radisson, Sheraton, Wyndham\n21\n151\n17,768\n1.4%\nJoie de Vivre, Tribute Portfolio, Kimpton, Hotel Indigo, Ascend, Trademark\n8\n269\n61,974\n4.9%\nHyatt Regency, Marriott, Sheraton, Westin\n1\n4\n1,224\n0.1%\nAC Hotels, Aloft Hotels, Cambria, Hotel Indigo, Hyatt Centric\n4\n8\n1,727\n0.1%\nMAMA Shelter, CitizenM, Ace Hotels, Yotel, Freehand\n64\n1,060\n156,471\n12.3%\nAloft, Courtyard by Marriott, Four Points, Holiday Inn, Hyatt Place\n43\n3,072\n342,737\n27.0%\nComfort Suites, Courtyard by Marriott, \nFairfield Inn, Holiday Inn Express, Springhill Suites\n5\n283\n27,605\n2.2%\nBest Western, Comfort Inn, La Quinta, Sleep Inn, Wingate, Avid\n4\n96\n8,710\n0.7%\nQuality Inn, Baymont, Travelodge, Howard Johnson, Super 8, Days Inn\n4\n544\n62,319\n4.9%\nElement, Hyatt House, Residence Inn, Staybridge Suites\n3\n757\n82,515\n6.5%\nTownePlace Suites, Staybridge Suites, Hyatt Studios\n—\n—\n—\n—%\nStudioRes, Candlewood Suites, Stay Apt Suites, ECHO Suites, Extended Stay America Premiere Suites\n8\n105\n18,392\n1.5%\nDisney Vacation Club, Holiday Inn Club Vacations, \nMarriott Vacations Worldwide, \nTravel & Leisure Co.\n____________\n(1)\nExcludes 17 unbranded properties with 4,392 rooms, representing approximately 0.3% of total rooms and 409 strategic partner hotels with 19,361 rooms, representing approximately 1.5% of total rooms. Hilton Grand Vacations is inclusive of Hilton Club, Hilton Grand Vacations Club and Hilton Vacation Club.\n(2)\nThese selected competitors exclude lesser-known regional competitors. \n5\nWaldorf Astoria Hotels & Resorts\n: Waldorf Astoria Hotels & Resorts is a luxury brand with an award-winning portfolio of iconic properties with a relentless commitment to elegant service, one-of-a-kind experiences and culinary expertise in landmark destinations around the world. Waldorf Astoria hotels deliver an effortless experience seamlessly, creating a true sense of place for guests through stunning architecture and design, the signature Peacock Alley restaurant, refined art collections, Michelin-starred dining restaurants and chef partnerships and elevated in-room amenities.\nConrad Hotels & Resorts\n: Conrad Hotels & Resorts is a luxury brand that connects bold design, impactful experiences and curated contemporary art to inspire the conscientious traveler. Found in major urban centers and resort destinations, Conrad is a place where guests are empowered to explore through intuitive service and experiences that authentically connect them with local culture.\nLXR Hotels & Resorts: \nLXR Hotels & Resorts is a hand-picked collection of independent and spirited luxury properties celebrating the timeless pursuit of personal adventure. Found in alluring destinations, LXR connects legendary properties into an exclusive network of hotels that are set apart by individual design, an unrivaled commitment to personalized service and elegant, yet locally immersive, experiences for guests.\nNoMad Hotels\n: NoMad Hotels is a luxury brand that brings guests sophisticated offerings in some of the world's most sought-after locations. NoMad Hotels are both grand and intimate, creating a unique blend of luxury and lifestyle experiences throughout the stay with special touches like unique local art collections featured in each property. \nSignia by Hilton: \nSignia by Hilton is a luxury brand with a portfolio of exceptional hotels in gateway cities and resort destinations around the world. Each Signia by Hilton property infuses sophistication into every stay, offering top-tier meetings and event spaces, a vibrant atmosphere, exceptional amenities and personalized service catered to the needs of today's global traveler.\nCanopy by Hilton: \nCanopy by Hilton is an upper upscale brand that delivers elevated, boutique hotel experiences that celebrate the best of the locale. Inviting, sophisticated design, bespoke food and beverage and crafted touchpoints deliver a locally inspired, high-end and welcoming stay.\nHilton Hotels & Resorts\n: As Hilton’s flagship brand, Hilton Hotels & Resorts is the trusted global leader in hospitality. An upper upscale brand with more than 600 hotels and resorts in nearly 100 countries and territories, Hilton Hotels & Resorts continues to set the standard for the industry and upholds Conrad Hilton’s vision to fill the earth with the light and warmth of hospitality by elevating every celebration and event, creating real human connections, and immersing guests in the best of global and local cultures in the world’s most desired destinations. \nCurio Collection by Hilton\n: Curio Collection by Hilton is an upper upscale brand with a global portfolio of individually remarkable hotels hand-picked to immerse guests in one-of-a-kind moments in sought-after destinations. Each hotel in the Curio Collection evokes a bespoke story through distinctive architecture and design, world-class food and beverage and curated experiences. \nGraduate by Hilton\n: Graduate by Hilton is an upper upscale lifestyle brand of handcrafted hotels in dynamic, university-anchored towns. Each Graduate hotel brings stories and traditions to life and offers the perfect setting for game days, reunions, graduations, campus visits and more.\nDoubleTree by Hilton\n: DoubleTree by Hilton is a fast-growing global upscale brand that continues to be a symbol of comfort for business and leisure travelers around the world, offering contemporary accommodations and amenities. DoubleTree by Hilton is renowned for its warm, caring service, beginning with its signature welcome that includes the hotel’s famous original chocolate chip cookie, now available in an allergy-friendly option. The inclusive service experience offers upscale food and beverage experiences and features a variety of flexible meeting spaces for events of all sizes.\nTapestry Collection by Hilton\n: Tapestry Collection by Hilton is an upper upscale brand with a portfolio of original hotels that offer guests unique style and vibrant personality, encouraging travelers to connect to their destination and enjoy authentic off-the-beaten-path experiences. While each property is unique, every Tapestry Collection by Hilton property is united by the reliability that comes with the Hilton name.\nEmbassy Suites by Hilton\n: Embassy Suites by Hilton offers both leisure and business travelers an approachable, upper upscale experience. As a full-service hotel, every Embassy Suites provides spacious two-room suites with separate bedroom \n6\nand living room spaces, free made-to-order breakfast each morning, complimentary drinks and snacks during evening reception every night, flexible meetings and events spaces and 24-hour fitness centers.\nTempo by Hilton:\n Tempo by Hilton is an upscale, stylish and contemporary lifestyle hotel brand designed for the ambitious traveler looking to maintain a sense of balance and momentum. Tempo by Hilton offers re-imagined guest rooms designed with well-being in mind, dynamic communal spaces for collaboration or focused work, healthy cafe-style dining, a leading-edge beverage program and next-level fitness facilities.\nMotto by Hilton\n: Motto by Hilton is an upper midscale brand with an urban, lifestyle feel designed to connect guests to the center of it all – buzz-worthy spaces and the pulse of the community. Through its efficient guest rooms, lively common spaces and locally inspired food and beverage options catering to guests and locals alike, Motto is a launchpad to destinations around the globe and delivers a flexible and innovative hospitality experience through elements like first-of-its-kind connecting rooms for up to nine rooms.\nHilton Garden Inn\n: Hilton Garden Inn is an award-winning, upscale brand where guests find an open, inviting atmosphere with warm, glowing service and simple, thoughtful touches that allow them to socialize and unwind. As a recognized leader in food and beverage offerings, Hilton Garden Inn caters to guests' dining needs by serving cooked-to-order breakfast and offering handcrafted cocktails, shareable small plates and full meals at its on-site restaurants and bars. Flexible meeting space, free Wi-Fi, wireless printing and fitness centers are offered to help guests stay productive. \nHampton by Hilton\n: Hampton by Hilton is our largest brand and includes both Hampton Inn and Hampton Inn & Suites hotels, with properties located on five continents. Recognized as a leading upper midscale brand in the lodging industry, Hampton has been ranked the #1 lodging brand to franchise by Entrepreneur for 16 consecutive years. Hampton by Hilton hotels around the world provide guests high-quality and thoughtfully designed accommodations, friendly and authentic service and value-added amenities, like complimentary hot breakfast and free Wi-Fi, all backed by the 100% Hampton Guarantee.\nTru by Hilton:\n Tru by Hilton is a game-changing, midscale hotel brand where guests don't have to compromise between a consistent, fun and affordable hotel stay. Spirited, simplified and grounded in value, Tru by Hilton is designed for cross-generational appeal, with a large, reimagined public space where guests can work, play, lounge and eat. Intuitively designed modern guest rooms feature a rolling desk, oversized windows for natural light and bright, spacious bathrooms. Guests can enjoy complimentary amenities, including the build-your-own \"Top It\" breakfast bar featuring our tasty pancakes, a multifunctional fitness center and fast Wi-Fi. Premium snacks, light meal options and single-serve wine and beer are available for purchase at the 24/7 Eat. & Sip. market. \nSpark by Hilton: \nSpark by Hilton is a premium economy hotel brand at the intersection of value and consistency. Spark by Hilton provides a reliable and comfortable stay at a hotel with friendly service for every guest, all at an accessible price. Offering simple design with splashes of color and cheer, Spark by Hilton hotels provide a welcoming sense of arrival with colorful exterior statement walls and inspiring artwork. The public spaces provide multi-functional seating, from communal tables to rocking chairs, and guest rooms are comfortable and relaxing with simple, streamlined furniture. Travelers can enjoy complimentary breakfast with premium coffee and a signature bagel bar.\nHomewood Suites by Hilton\n: Homewood Suites by Hilton is an upscale, award-winning, all-suites, extended-stay hotel brand that delivers the comforts of home. This brand offers home-like accommodations for guests and their pets traveling for an extended stay or quick overnight trip. Guests enjoy inviting, generous-sized suites featuring separate living and sleeping areas and fully equipped kitchens with full-size refrigerators as well as value-driven amenities including free breakfast and complimentary evening receptions every week.\nHome2 Suites by Hilton\n: Home2 Suites by Hilton is an upper midscale, all-suites, award-winning extended-stay hotel brand offering stylish accommodations with flexible guest room configurations and home-like amenities. With a focus on environmentally friendly products and hotel operations, Home2 Suites by Hilton offers laundry and fitness areas, outdoor spaces, pet-friendly environments and complimentary breakfast.\nLivSmart Studios by Hilton: \nLivSmart Studios by Hilton is a midscale, long-stay hotel brand for guests looking for comfortable apartment-style accommodations for 10 nights or more. Offering simplicity, consistency and convenience, LivSmart Studios by Hilton will create a space where guests can seamlessly maintain their daily routines while also immersing themselves in the local community. In addition to studio suites with ample storage space and fully equipped kitchens, the hotel will feature a streamlined public area filled with natural light that includes a retail market, a large guest laundry room and a state-of-the-art fitness center. There will also be a spacious outdoor gathering area and comfortable seating for guests looking to \n7\nconnect. LivSmart Studios' pioneering vision for transforming the extended-stay segment is credited with Hilton’s recognition as one of Fast Company’s 2024 Most Innovative Companies. We expect to open our first LivSmart hotel in 2025 and as of December 31, 2024 had over 75 hotels in our development pipeline.\nHilton Grand Vacations\n: Our timeshare brands, including Hilton Club, Hilton Grand Vacations Club and Hilton Vacation Club, are premier vacation ownership brands known for delivering a consistently exceptional standard of service, maximum flexibility for members and guests and elegant, family-friendly resorts in desirable locations around the world. Signature elements include spacious, well-appointed accommodations and resorts with extensive on-site amenities. A special points-based reservation system gives owners the flexibility to vacation when, where and how they prefer. HGV has the exclusive right to use our timeshare brands, subject to the terms of a long-term license agreement with us.\nOur Guest Loyalty Program\nHilton Honors\n \nis our award-winning guest loyalty program that supports our portfolio of brands. The program generates significant repeat business by rewarding guests with points for each stay at our owned, leased, managed, franchised and timeshare properties, as well as each stay at strategic partner hotels when the stay is reserved through our booking channels, which are then redeemable for free or discounted room nights at our properties and other goods and services. Hilton Honors members can also use points earned to transact with strategic partner hotels as well as many strategic partners, including credit card providers, such as American Express, airlines, rail and car rental companies, Amazon, Lyft and others. Hilton Honors members who book through preferred Hilton channels also have access to instant benefits, including a flexible payment slider that allows members to choose nearly any combination of points and money to book a stay, an exclusive member discount and free standard Wi-Fi. Members also have access to contactless technology exclusively through the Hilton Honors app, where members can check in, choose their room and access their room using Digital Key. The program provides targeted marketing, promotions and customized guest experiences to 211 million members. Affiliation with our loyalty program encourages members to allocate more of their travel spend to our hotels. The percentage of travel spend we capture from loyalty members increases as they move up the tiers of our program. The program is funded by contributions from eligible revenues generated by Hilton Honors members and collected from properties in our system, as well as our strategic partnerships. The funds collected by the Hilton Honors program are subsequently applied to reimburse properties and strategic partners for Hilton Honors points redemptions by loyalty members and to pay for administrative expenses and marketing initiatives that support the program. \n8\nOur Business\nAs of December 31, 2024, our existing system included the following properties and rooms, by type, brand and region:\nOwned / Leased\n(1)\nManaged\nFranchised / Licensed\nTotal\nProperties\nRooms\nProperties\nRooms\nProperties\nRooms\nProperties\nRooms\nWaldorf Astoria Hotels & Resorts\n2 \n463 \n32 \n8,333 \n— \n— \n34 \n8,796 \nConrad Hotels & Resorts\n2 \n779 \n43 \n13,920 \n4 \n2,496 \n49 \n17,195 \nLXR Hotels & Resorts\n— \n— \n7 \n1,155 \n8 \n1,464 \n15 \n2,619 \nNoMad\n— \n— \n1 \n91 \n— \n— \n1 \n91 \nSignia by Hilton\n— \n— \n4 \n2,797 \n— \n— \n4 \n2,797 \nCanopy by Hilton\n— \n— \n11 \n1,850 \n32 \n5,731 \n43 \n7,581 \nHilton Hotels & Resorts\n46 \n15,896 \n298 \n127,317 \n273 \n84,254 \n617 \n227,467 \nCurio Collection by Hilton\n— \n— \n27 \n6,055 \n153 \n27,679 \n180 \n33,734 \nGraduate by Hilton\n— \n— \n— \n— \n34 \n5,788 \n34 \n5,788 \nDoubleTree by Hilton\n— \n— \n170 \n46,265 \n525 \n110,678 \n695 \n156,943 \nTapestry Collection by Hilton\n— \n— \n5 \n694 \n146 \n17,074 \n151 \n17,768 \nEmbassy Suites by Hilton\n— \n— \n40 \n10,551 \n229 \n51,423 \n269 \n61,974 \nTempo by Hilton\n— \n— \n1 \n661 \n3 \n563 \n4 \n1,224 \nMotto by Hilton\n— \n— \n— \n— \n8 \n1,727 \n8 \n1,727 \nHilton Garden Inn\n— \n— \n126 \n24,736 \n934 \n131,735 \n1,060 \n156,471 \nHampton by Hilton\n— \n— \n53 \n8,549 \n3,019 \n334,188 \n3,072 \n342,737 \nTru by Hilton\n— \n— \n— \n— \n283 \n27,605 \n283 \n27,605 \nSpark by Hilton\n— \n— \n— \n— \n96 \n8,710 \n96 \n8,710 \nHomewood Suites by Hilton\n— \n— \n8 \n1,020 \n536 \n61,299 \n544 \n62,319 \nHome2 Suites by Hilton\n— \n— \n2 \n210 \n755 \n82,305 \n757 \n82,515 \nStrategic partner hotels\n(2)\n— \n— \n— \n— \n409 \n19,361 \n409 \n19,361 \nOther\n(3)\n— \n— \n3 \n1,087 \n14 \n3,305 \n17 \n4,392 \nTotal hotels\n50\n \n17,138\n \n831\n \n255,291\n \n7,461\n \n977,385\n \n8,342\n \n1,249,814\n \nHilton Grand Vacations\n(4)\n— \n— \n— \n— \n105 \n18,392 \n105 \n18,392 \nTotal system\n50\n \n17,138\n \n831\n \n255,291\n \n7,566\n \n995,777\n \n8,447\n \n1,268,206\n \nOwned / Leased\n(1)\nManaged\nFranchised / Licensed\nTotal\nProperties\nRooms\nProperties\nRooms\nProperties\nRooms\nProperties\nRooms\nU.S.\n— \n— \n187 \n81,173 \n5,700 \n735,705 \n5,887 \n816,878 \nAmericas (excluding U.S.)\n1 \n405 \n70 \n17,819 \n393 \n54,446 \n464 \n72,670 \nEurope\n39 \n11,579 \n111 \n27,920 \n665 \n83,727 \n815 \n123,226 \nMiddle East & Africa\n4 \n1,991 \n112 \n31,153 \n36 \n5,796 \n152 \n38,940 \nAsia Pacific\n6 \n3,163 \n351 \n97,226 \n667 \n97,711 \n1,024 \n198,100 \nTotal hotels\n50\n \n17,138\n \n831\n \n255,291\n \n7,461\n \n977,385\n \n8,342\n \n1,249,814\n \nHilton Grand Vacations\n(4)\n— \n— \n— \n— \n105 \n18,392 \n105 \n18,392 \nTotal system\n50\n \n17,138\n \n831\n \n255,291\n \n7,566\n \n995,777\n \n8,447\n \n1,268,206\n \n____________\n(1)\nIncludes hotels owned or leased by entities in which we own a noncontrolling financial interest.\n(2)\nIncludes hotels that are included in our booking channels and participate in the Hilton Honors guest loyalty program through strategic partnership arrangements.\n(3)\nIncludes other hotels in our system that are not distinguished by a specific Hilton brand. \n(4)\nIncludes properties under timeshare brands including Hilton Club, Hilton Grand Vacations Club and Hilton Vacation Club.\n9\nManagement and Franchise\nWe manage hotels and license our brands through our management and franchise segment. This segment generates its revenue primarily from fees charged to hotel owners under management and franchise contracts, as well as from fees associated with license agreements, which include arrangements with strategic partner hotels. We grow our management and franchise business by attracting owners to become a part of our system and participate in our commercial services to support their properties. Our management and franchise contracts provide significant return on investment for us as we earn and collect fees.\nHotel Management\nOur core management services consist of operating hotels under management contracts for the benefit of third parties who either own or lease the hotels and the associated personal property. Often, particularly in the U.S., we employ the individuals working at these locations. Terms of our management contracts vary, but our fees generally consist of a base management fee, which is generally based on a percentage of the hotel’s monthly gross operating revenue, and, when applicable, an incentive management fee, which is generally based on a percentage of the hotel's operating profits, normally over a one calendar year period, and, in some cases, may be subject to a stated return threshold to the hotel owner. In general, the owner pays all operating and other expenses and reimburses any of our out-of-pocket expenses. In turn, our managerial discretion is subject to approval by the owner in certain major areas, including the approval of annual operating and capital expenditure budgets and, in most instances, the appointment of certain key personnel. Additionally, the owners generally pay monthly program fees based on the underlying hotel's sales or usage, as reimbursement for the costs related to our: (i) advertising and marketing programs; (ii) internet, technology and reservation systems; and (iii) quality assurance programs. Owners are also responsible for various other fees and charges, including payments for participation in our Hilton Honors guest loyalty program, training, consultation and procurement of certain goods and services. As of December 31, 2024, we m\nanaged\n 831 hotels with 255,291 \nr\nooms, which does not include hotels in our ownership segment. \nThe initial terms of our management contracts are typically 20 to 30 years. In certain cases, we are both the franchisor and manager of the hotel, when we enter into a franchise contract in addition to the management contract, and, in these cases, we classify the hotel as managed in our system. Extension options for our management contracts are negotiated and vary, but typically are more prevalent in full service hotels. Generally, these contracts contain one or two extension options that are for either five or 10 years and can be exercised at our or the hotel owner's option or by mutual agreement, as specified by the contract.\nSome of our management contracts provide early termination rights to hotel owners upon certain events, including the failure to meet certain financial or performance criteria. Performance test measures typically are based upon the hotel’s performance individually and/or in comparison to specified competitive hotels. We often have an optional cure right to pay an amount equal to the performance shortfall over a specified period, although in some cases our cure rights are limited. \nFranchising\nWe license our IP, including our brand names, trademarks and service marks, and our operating systems to hotel owners under franchise contracts. We do not own, manage or operate franchised properties, do not employ the individuals working at these properties and do not have any legal responsibility for the employees or the liabilities associated with operating these properties. We conduct periodic inspections of our franchised hotels to ensure that brand standards that we establish are maintained. For newly franchised hotels, including both new construction and conversions of existing hotels outside of our system, we approve the location, as well as the plans for the facilities, to ensure the hotels meet our brand standards. For existing franchised hotels, we provide franchisees with property improvement plans that must be completed to keep the hotels in compliance with our brand standards, so that they can remain in our hotel system.\nEach franchisee pays us an application, initiation or other fee in conjunction with the inception of a franchise contract. Franchisees also pay a royalty fee, generally based on a percentage of the hotel’s monthly gross room revenue and, in some cases, may also include a percentage of gross food and beverage revenues and other revenues, as applicable. Additionally, franchised properties generally pay monthly program fees based on the underlying property's sales or usage, as reimbursement for the costs related to our: (i) advertising and marketing programs; (ii) internet, technology and reservation systems; and (iii) quality assurance programs. They are also responsible for various other fees and charges, including payments for participation in our Hilton Honors guest loyalty program, training, consultation and procurement of certain goods and services. We also earn license fees from license agreements with strategic partners, including co-branded credit card providers and strategic partner hotels, and HGV. As of December 31, 2024, including timeshare properties and strategic partner hotels, we franchised or licensed 7,566 hotels and resorts with 995,777 rooms.\n10\nOur franchise contracts typically have initial terms of approximately 20 years for new hotels and approximately 10 to 20 years for hotels converting from hotels outside of our system. At the expiration of the initial term, we may relicense the hotel to the franchisee, at our or the hotel owner's option or by mutual agreement, for an additional term generally ranging from 10 to 15 years. We have the right to terminate a franchise contract upon specified events of default, including nonpayment of fees or noncompliance with brand standards. If a franchise contract is terminated by us because of a franchisee’s default, the franchisee is contractually required to pay us liquidated damages.\nOwnership\nAs a hotel owner and lessee, we focus on maximizing cost efficiency and profitability of the portfolio by, among other things, maximizing hotel revenues, implementing cost-effective labor management practices and systems and reducing fixed costs. Through our disciplined approach to hotel and asset management, we develop and execute on strategic plans for each of our hotels to enhance their competitive position and we invest in renovating guest rooms and public spaces and adding or enhancing meeting and retail space for properties where we believe such investments will improve profitability. As of December 31, 2024, the ownership segment included 50 hotels totaling 17,138 rooms, comprising 43 hotels that we leased, two hotels that were each leased by a consolidated variable interest entity (\"VIE\") and five hotels owned or leased by unconsolidated affiliates. \nCorporate Responsibility\nHilton strives to create long-term value for all our stakeholders and strengthen the resilience of our business while also advancing responsible travel and tourism globally through our Travel with Purpose strategy. As one of the world’s largest hospitality companies, Hilton recognizes its responsibility to create positive environmental and social impacts across our operations, supply chain and communities to ensure our properties and surrounding communities remain vibrant and resilient for generations of travelers to come. We have established and maintain a governance structure that supports our strategy by overseeing the management of the business in a manner consistent with the best interests of Hilton and our stakeholders. \nWe continue to make progress towards our Travel with Purpose goals, including: (i) building a more sustainable future through destination stewardship and well-defined targets for emissions, water and waste; (ii) supporting positive social impact by advancing careers, communities and responsible conduct; and (iii) advancing and measuring our goals with integrity and transparency through our company policies and reporting mechanisms. \nOur efforts are supported by a governance structure that is designed to ensure the objectives are an important part of our business and strategic priorities. Our executive committee receives at least quarterly updates on our Travel with Purpose programs and progress, and one of the three standing committees of Hilton's board of directors also receives quarterly reports on this progress, reviews and assesses our related strategy and makes recommendations to the board and management as appropriate. The board of directors also receives annual updates on our Travel with Purpose strategy and impact.\nLightStay is our proprietary system for measuring and reporting our progress toward our Travel with Purpose goals. Our properties track energy, water, waste and associated utility cost reduction projects under way, as well as community volunteerism and charitable donations. Robust reports inform our properties of their progress on a regular basis.\nThe Hilton Global Foundation supports nonprofits and local community organizations that serve as partners to amplify our positive environmental and social impact around the world. The Hilton Global Foundation, created in 2019, is our primary international philanthropic arm and is registered as a U.S.-based 501(c)(3) charitable organization. In 2024, the Hilton Global Foundation announced $5.3 million in grants to support environmental sustainability, hospitality career development, and community resilience. \nMore details about our Travel with Purpose goals and our progress toward them are reported annually in our Travel with Purpose Report, available at cr.hilton.com.\n11\nEnvironmental Impact\nWe remain focused on our goal of reducing emissions, water and waste intensity at the hotels we operate. These efforts are supported by utility cost savings measures including HVAC controls, building automation system technologies and turnkey LED lighting, fueled by utility incentives wherever possible, to strengthen the return on investment and deliver cost savings to owners and enhance the guest experience. We also continued to create resources that will help facilitate the efficient operation of our hotels and take steps to increase our sourcing of renewable electricity at our hotels around the world. Additionally, through our Meet with Purpose offering, we partner with our corporate customers to quantify and plan sustainable meetings by providing them, upon request, with reporting that estimates emissions for their event, as well as options to reduce those estimated emissions.\nSocial Impact\nWith a presence in 140 countries and territories, we use our global scale to be an engine of opportunity by positively impacting our communities through local support and volunteering, creating learning and career growth opportunities, disaster relief and other economic support initiatives.\nDuring 2024, Hilton and the Hilton Global Foundation supported our hotel teams and surrounding communities through disasters and crises, including the floods in Brazil and Hurricanes Helene and Milton that devastated parts of the southeastern U.S. This included making a series of contributions to World Central Kitchen, supporting the delivery of meals to those in need. \nHilton also remains committed to combating human trafficking, and we require all hotel-based employees to complete an annual training on identifying signs of trafficking. We partner with PACT, an organization dedicated to reducing trafficking and exploitation, to help prevent trafficking, and similarly collaborate on human rights initiatives through the World Sustainable Hospitality Alliance, World Travel and Tourism Council, American Hotel & Lodging Association (\"AHLA\") and United Kingdom (\"U.K.\") Stop Slavery Hotel Industry Network. The Hilton Global Foundation continues to support the AHLA Foundation's No Room for Trafficking Survivor Fund, which aims to equip community-based organizations to engage and support trafficking survivors. \nAt Hilton, we prioritize responsible sourcing by requiring suppliers to comply with the standards in our Hilton Responsible Sourcing Policy, which include integrity and fair dealing, human rights, protecting personal and business information, commitment to the environment and providing a safe and healthy work environment.\nSee \"—Human Capital Management—Career Opportunities, Development and Training\" below for information on learning and career growth opportunities.\nHuman Capital Management\nAs of December 31, 2024, we employed or managed approximately 181,000 individuals at our owned, leased and managed hotels and corporate offices. There were approximately 311,000 additional individuals employed by third-party owners working at our franchised properties.\nOur human capital management strategy focuses on attracting, developing and retaining the best talent in the industry, and our executive committee reviews talent strategy and succession plans on a quarterly basis to assess current and future talent needs. We want to build a strong employee-centered culture that creates connectivity, camaraderie and trust among all employees, which then supports our employees to deliver positive experiences to guests at our hotels. Hilton's commitment to building strong culture focuses on creating a workplace that offers strong growth opportunities and is driven by purpose and earned Hilton recognition by Fortune magazine and Great Place to Work as the 2024 #2 World's Best Workplace and top hospitality company in the world for the eighth consecutive year.\nDuring the year ended December 31, 2024 we saw improvements in workforce stability, with both hiring and retention volumes normalizing in comparison to pre-pandemic levels. We continue to review our benefits and programmatic offerings to ensure we remain competitive, are investing in our employees' development and well-being and are enhancing our recruiting strategies to tap into new pools of talent.\n12\nCompensation and Benefits\nHilton offers competitive pay and benefits to its employees, including a variety of compensation programs and comprehensive benefit programs. We regularly review pay parity across various workforce segments as part of our ongoing talent processes. Through our employee stock purchase plan, eligible employees can purchase Hilton stock through after-tax payroll deductions at a 15 percent discount from the market stock price. \nAs of December 31, 2024, approximately 25 percent of people employed or managed by us globally and approximately 40 percent of people working in the U.S. were covered by various collective bargaining agreements that generally address pay rates, working hours, other terms and conditions of employment, certain employee benefits and orderly settlement of labor disputes.\nOur benefits and programs include paid time off, parental leave, adoption assistance, subsidized health insurance, education assistance, flexible work arrangements and Go Hilton travel programs, which make discounted rooms available to hotel and corporate employees, as well as their families and friends.\nOur medical and mental health care programs include a global platform focused on caregiving that provides resources for employee self-care, as well as enabling employees to care for others, including sick, disabled or elderly family members, children and pets; a concierge service supporting eligible employees with logistical and administrative tasks related to caregiving; education, training and resources on substance use disorders to eligible employees; an Employee Assistance Program; and parental and bereavement leave and education resources for expecting and new parents.\nWe regularly survey our employees to monitor levels of engagement, trust, and management effectiveness, among other targeted topics, and use their feedback to inspire program enhancements and new offerings. We strive to maximize employee retention and minimize attrition with these and other measures. Approximately 32 percent of our U.S. employees have been with Hilton for at least 10 years. \nCareer Opportunities, Development and Training\nWe take a broad, long-term and business-aligned approach to develop a dedicated and collaborative workforce to better serve our guests. Our Pathway Programs help foster economic mobility in the communities in which we operate and create a more robust talent pipeline for our business drawing from underrepresented groups including veterans, which consists of individuals who have served in the military and the caregivers and spouses of those who have served in the military, as well as people with disabilities and displaced persons.\nThe advancement of our employees is important to us and we provide them with robust learning and development opportunities, as well as mentorship opportunities to corporate employees at all levels. We are focused on providing opportunities for the internal movement of our employees and the promotion from entry level positions into management positions at our hotels or corporate offices across the organization. Our career development approach emphasizes customized experiences so that employees can follow a training and career path best suited to their goals including a wide array of general business, industry or function-specific technical skills and leadership development courses and programs.\nOur leadership development programs aim to build leadership skills through structured levels of self-paced learning and live facilitated sessions with focus areas of leading self, leading individuals and leading teams. Additionally, our People Leader Essential training offers a self-paced curriculum to employees, with content on key leadership topics, including effective communication, delegation, prioritization, coaching and talent development to support current, new and future people leaders at Hilton. One of our targeted programs for developing General Managers (“GMs”), GM Academy, is centered on nine core GM business capabilities, some of which include leadership and people management, asset management, customer engagement and commercial performance. Additionally, Hilton's global Signature Leadership Development programs and mentorship programs focus on building effective leaders across the enterprise to grow our leadership bench strength. These programs provide opportunities for participants to develop key competencies, network with and learn from senior leaders and enhance business acumen.\nGovernance, Ethics and Regulatory Compliance\nAs a core underpinning of our entire organization, our board of directors oversees our ethics and compliance program, which requires all Hilton employees to conduct themselves at the highest standards with respect to all ethics and compliance matters. Our Code of Conduct establishes a set of global business principles, with our compliance organization, training, risk \n13\nmanagement and monitoring activities tailored to address unique risks by geography, business line, function and level. Our Code of Conduct is supported by robust compliance policies addressing risk areas such as corruption, trade sanctions, insider trading, privacy, confidential information, antitrust and escalation of concerns. Our legal and compliance training program, which is an annual requirement for all of our employees, conveys consistent compliance standards across the organization in formats designed to target different knowledge levels, learning styles and functional needs. Our annual training calendar includes mandatory training and supplemental training that is supported by periodic company-wide awareness campaigns highlighting Hilton-specific risks and scenarios.\nIn governing the physical safety of our properties and teams, to help ensure the safety and security of our employees and guests, we constantly monitor threats and incidents around the world through online tools and external networks and partnerships; support our properties globally with crisis alert communications, crisis plans and area crisis teams; provide employees with safety and security training resources; and conduct safety and security audits annually using a risk-based approach.\nOur legal compliance team administers a third-party risk management program so that we understand the qualifications, reputation and associations of third parties with whom we transact, particularly third parties who interface with government officials and third parties who act in Hilton’s name, such as owners of our hotels. The third-party risk management program includes due diligence, education materials for third parties, ongoing monitoring of relationships and appropriate contract audit and termination rights. Our legal compliance team also monitors a comprehensive and confidential reporting tool to assist management and employees in addressing fraud, abuse and other misconduct in the workplace. The Audit Committee of our board of directors receives regular updates from our legal compliance team on third-party risk and information from our confidential reporting tool.\nCompetition\nWe encounter active and robust competition as a hotel and resort manager, franchisor, owner and lessee. Competition in the hospitality industry is based on several criteria, generally including: the attractiveness of the facility; location; level of service; quality of accommodations; amenities; food and beverage options and outlets; public and meeting spaces and other guest services; consistency of service; room rate; brand reputation; and the ability to earn and redeem loyalty program points through a global system. Our properties and brands compete with other hotels, resorts, motels, inns and other accommodation rental services in their respective geographic markets or customer segments, including facilities owned by local interests, individuals, national and international chains, institutions, investment and pension funds and real estate investment trusts (\"REITs\"). We believe that our capabilities as a multi-branded manager, franchisor, owner and lessee of hotels with an associated global, system-wide guest loyalty program and commercial platform help us continue to maintain our position as one of the largest and most geographically diverse hospitality companies in the world. \nOur principal competitors include other branded and independent hotel operating companies, national and international hotel brands and ownership companies. While local and independent brand competitors vary, on a global scale, our primary competitors are Accor S.A., Choice Hotels International, Hongkong and Shanghai Hotels, Hyatt Hotels Corporation, Intercontinental Hotel Group, Marriott International, Radisson Hotel Group and Wyndham Hotels & Resorts.\nSeasonality\nThe hospitality industry is seasonal in nature. The periods during which our properties experience higher or lower levels of demand vary from property to property, depending principally upon their location, type of property and competitive mix within the specific location. Based on historical results, we generally expect our revenues to be lower in the first quarter of each year than in each of the three subsequent quarters.\nCyclicality\nThe hospitality industry is cyclical, and demand generally follows, on a lagged basis, key macroeconomic indicators. There is a history of increases and decreases in the development and supply of and demand for hotel rooms, occupancy levels and room rates realized by hotel owners through economic cycles. The combination of changes in economic conditions and in the supply of hotel rooms can result in significant volatility in results for owners and managers of hotel properties. The costs of running a hotel, including personnel costs, rent, property taxes, insurance and utilities, tend to be more fixed than variable. As a result of such fixed costs, in a negative economic environment, the rate of decline in earnings can be higher than the rate of decline in revenues.\n14\nIntellectual Property\nIn the highly competitive hospitality industry in which we operate, trademarks, service marks, trade names, logos and patents are very important to the success of our business. We have a significant number of trademarks, service marks, trade names, logos, patents and pending registrations and expend significant resources each year on surveillance, registration and protection of our IP, which we believe has become synonymous in the hospitality industry with a reputation for excellence in service and authentic hospitality.\nGovernment Regulation\nOur business is subject to various foreign and U.S. federal and state laws and regulations, including laws and regulations that govern the offer and sale of franchises, many of which impose substantive requirements on franchise contracts and require that certain materials be registered before franchises can be offered or sold in a particular jurisdiction.\nIn addition, a number of states regulate the activities of hospitality properties and restaurants, including safety and health standards, as well as the sale of liquor at such properties, by requiring licensing, registration, disclosure statements and compliance with specific standards of conduct. Operators of hospitality properties also are subject to laws governing their relationship with employees, including minimum wage requirements, overtime, working conditions and work permit requirements. Our franchisees are responsible for their own compliance with laws, including with respect to their employees, minimum wage requirements, overtime, working conditions and work permit requirements. Compliance with, or changes in, these laws could reduce the revenue and profitability of our properties and could otherwise adversely affect our operations.\nWe also manage hotels with casino gaming operations as part of or adjacent to the hotels, which are typically managed and operated by third parties. If we manage and operate the casinos, we employ third-party compliance consultants and service providers and hold and maintain the casino gaming license. As a result, our business operations at such facilities are subject to the licensing and regulatory control of the local regulatory agency responsible for gaming licenses and operations in those jurisdictions.\nFor additional information on government regulation, including environmental regulations and requirements, refer to \"Part I—Item 1A. Risk Factors.\" \nInsurance\nU.S. managed hotels and foreign managed and franchised hotels are permitted to participate in certain of our insurance programs by mutual agreement with the hotel owners; however, if they do not participate in our insurance programs, the hotel owners must purchase insurance programs consistent with our requirements. Generally, U.S. franchised hotels are not permitted to participate in our insurance programs, but rather the hotel owners must purchase insurance programs consistent with our requirements. In addition, our management and franchise contracts typically include provisions requiring the hotel owner to indemnify us against losses arising from the design, development and operation of such hotel.\nMost of our insurance policies are written with self-insured retentions or deductibles that are common in the insurance market for similar risks, and we believe such risks are prudent for us to assume. Our third-party insurance policies provide coverage for claim amounts that exceed our self-insurance retentions or deductible obligations. We maintain insurance coverage for general liability, property, business interruption, terrorism and other risks with respect to our business for all of our owned and leased hotels, and we maintain workers' compensation or equivalent coverage for all of our employees. We also are self-insured for health coverages for some of our U.S. and Puerto Rico employees, which include those working at our corporate operations and managed hotels, with third-party insurance protection for costs over specified thresholds. \nWhere You Can Find More Information\nWe file annual, quarterly and current reports, proxy statements and other information with the SEC. Our SEC filings are available to the public over the internet at the SEC's website at www.sec.gov. Our SEC filings are also available free of charge on our website at ir.hilton.com as soon as reasonably practicable after they are filed with or furnished to the SEC. Our website and the information contained on or connected to that site are not incorporated into this Annual Report on Form 10-K.\n15",
  "item7": "Item 7.        Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and related notes included elsewhere in this Annual Report on Form 10-K. \nFor the discussion of the financial condition and results of operations for the year ended December 31, 2023 compared to the year ended December 31, 2022, refer to \"Part II—Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our \nAnnual Report on Form 10-K for the fiscal year ended December 31, 2023\n filed with the SEC on February 7, 2024, which is incorporated herein by reference.\nOverview\nOur Business\nHilton is\n \none of the largest global hospitality companies, with 8,447 properties comprising 1,268,206 rooms in 140 countries and territories as of December 31, 2024. Our premier brand portfolio includes luxury, lifestyle, full service, focused service and all-suites hotel brands, as well as timeshare brands. As of December 31, 2024, we had 211 million members in our award-winning guest loyalty program, Hilton Honors, an increase of 17 percent from December 31, 2023. \nSegments and Regions\nWe analyze our operations and business by both operating segments and geographic regions. Our operations consist of two reportable segments that are based on similar products and services: (i) management and franchise and (ii) ownership. The management and franchise segment provides services, including hotel management and licensing of our IP and/or the use of our booking channels and related programs. Revenues from this segment include: (i) management and franchise fees charged to third-party hotel owners; (ii) licensing fees from our strategic partners, including co-branded credit card providers and strategic partner hotels, and HGV; and (iii) fees for managing the hotels in our ownership segment. As a manager of hotels, we typically are responsible for supervising or operating the hotel in exchange for management fees. As a franchisor of hotels, we charge franchise fees in exchange for the use of one of our brand names and/or related commercial services, such as our reservations system, marketing and information technology services, while a third party manages or operates such franchised hotels. The ownership segment primarily derives revenues from nightly hotel room sales, food and beverage sales and other services at our consolidated owned and leased hotels. \nWe conduct business in three distinct geographic regions: (i) the Americas; (ii) EMEA; and (iii) Asia Pacific. The Americas region includes North America, South America and Central America, including all Caribbean nations. Although the U.S., which represented 65 percent of our system-wide hotel rooms as of December 31, 2024, is included in the Americas region, it is often analyzed separately and apart from the Americas region and, as such, it is presented separately within our hotel operating statistics in \"—Results of Operations.\" The EMEA region includes Europe, which represents the western-most peninsula of Eurasia stretching from Iceland in the west to Russia in the east, and the Middle East and Africa (\"MEA\"), which represents the Middle East region and all African nations, including the Indian Ocean island nations. Europe and MEA are often analyzed separately and, as such, are presented separately within our hotel operating statistics in \"—Results of Operations.\" The Asia Pacific region includes the eastern and southeastern nations of Asia, as well as India, Australia, New Zealand and the Pacific Island nations.\nSystem Growth and Development Pipeline\nOur strategic objectives include the continued expansion of our global hotel network, in particular our fee-based business. As we enter into new management and franchise contracts and enter into strategic agreements to complement our hotel portfolio, we expand our business with limited or no capital investment by us as the manager, franchisor or licensor, since the capital required to build, renovate and maintain hotels is typically provided by the third-party owners with whom we contract to provide management services, license our IP or provide access to our booking channels and related programs. Prior to approving the addition of new hotels to our management and franchise development pipeline, we evaluate the economic viability of the hotel based on its geographic location, the credit quality of the third-party owner and other factors. By increasing the number of management and franchise contracts with third-party owners, over time we expect to increase revenues, overall return on invested capital and free cash flow. See further discussion on our cash management policy in \"—Liquidity and Capital Resources.\" The current economic environment, including elevated levels of inflation and interest rates, has posed certain challenges to the execution of our growth strategy, which in some cases have included and may continue to include delays in openings and new development.\n39\nIn addition to our current hotel portfolio, we are focused on the growth of our business by expanding our global hotel network through our development pipeline, which represents hotels that we expect to add to our system in the future. The following table summarizes our development activity:\nAs of or for the Year Ended December 31, 2024\nHotels\nRooms\n(1)\nHotel system\nOpenings\n(2)\n973 \n98,400 \nNet additions\n(3)\n904 \n83,000 \nDevelopment pipeline\nAdditions\n(4)\n1,432 \n154,200 \nCount as of period end\n(5)\n3,578 \n498,600 \n____________\n(1)\nRounded to the nearest hundred.\n(2)\nOpenings include 411 hotels and approximately 19,500 rooms from strategic partner hotels.\n(3)\nRepresents room additions, net of rooms removed from our system. During 2024, 409 hotels and approximately 19,400 rooms added were from strategic partner hotels. Net unit growth for the year ended December 31, 2024 was 7.3 percent.\n(4)\nAdditions include 423 hotels and approximately 20,100 rooms from strategic partner hotels.\n(5)\nThe hotels in our development pipeline were under development throughout 118 countries and territories, including 25 countries and territories where we had no existing hotels, with nearly half of the rooms under construction and more than half of the rooms located outside of the U.S. Rooms under construction include rooms for hotels under construction or operating hotels that are in the process of conversion to our system. Nearly all of the rooms in our development pipeline will be in our management and franchise segment upon opening. We do not consider any individual development project to be material to us.\nPrincipal Components and Factors Affecting our Results of Operations\nRevenues\nPrincipal Components\nWe primarily derive our revenues from the following sources:\n•\nFranchise and licensing fees\n. Represents fees earned in connection with licensing our IP, including our brands and/or the use of our booking channels and related programs. Under our long-term franchise contracts with hotel owners, franchisees typically pay us franchise fees that include: (i) monthly royalty fees, generally based on a percentage of the hotel's monthly gross room revenue, and, in some cases, may also include a percentage of gross food and beverage revenues and other revenues, as applicable; and (ii) application, initiation and other fees for when new hotels enter the system, when there is a change of ownership of a hotel or when contracts with hotels already in our system are extended. Consideration provided to incentivize hotel owners to enter into franchise contracts with us is amortized over the life of the applicable contract as a reduction to franchise and licensing fees. Our license agreements, for which we receive licensing fees for the use of our IP and/or the use of our booking channels and related programs, are predominantly with strategic partners, including co-branded credit card providers, strategic partner hotels and HGV.\n•\nBase and incentive management fees. \nRepresents fees earned in connection with the management of hotels. Terms of our management contracts vary, but our fees typically consist of a base management fee, which is generally based on a percentage of the hotel's monthly gross operating revenue and, when applicable, an incentive management fee, which is generally based on a percentage of the hotel's operating profits, normally over a one calendar year period, and, in some cases, may be subject to a stated return threshold to the hotel owner. Outside of the U.S., our fees are often more dependent on hotel profitability measures, either because of a single management fee structure where the entire fee is an incentive management fee, or because our two-tier fee structure is more heavily weighted toward the incentive management fee than the base management fee. Consideration provided to incentivize hotel owners to enter into management contracts with us is amortized over the life of the applicable contract as a reduction to base and other management fees.\n•\nOwned and leased hotels. \nRepresents revenues derived from the operations of our consolidated owned and leased hotels, including hotel room sales, accommodations sold in conjunction with other services, food and beverage sales and other ancillary goods and services. These revenues are primarily derived from two categories of customers: \n40\ntransient and group. Transient guests are individual travelers who are traveling for business or leisure. Group guests are travelers who are traveling for group events that reserve rooms for meetings, conferences or social functions, and may be sponsored by corporate, social, military, educational, religious or other organizations or associations. Group business usually includes a block of room accommodations, as well as other ancillary services, such as meeting facilities and catering and banquet services. A majority of our food and beverage sales and other ancillary goods and services are provided to customers who are also occupying rooms at our hotels. As a result, occupancy affects all components of our owned and leased hotels revenues.\n•\nOther revenues. \nRepresents revenues primarily generated by our purchasing operations.\n•\nOther revenues from managed and franchised properties.\n Represents amounts that are contractually reimbursed to us by property owners, either directly as costs are incurred or indirectly through monthly program fees related to certain costs and expenses supporting the operations of the related properties. The direct reimbursements by property owners are primarily for payroll and related costs if the managed hotel employees are legally employed by us. We have no legal responsibility for the employee liabilities related to certain of our managed properties, predominately those located outside of the U.S., where we are not the legal employer, as well as the employees or the liabilities associated with operating franchised properties or strategic partner hotels. Revenues and expenses for these direct reimbursements have no net effect on operating income (loss) or net income (loss). For the indirect reimbursements, Hilton collects monthly program fees from our managed and franchised properties, which are based on the underlying hotel's sales or usage. The program fees serve as reimbursement for the costs related to the operation of our marketing, sales and brand programs and shared services. Hilton collects program fees from strategic partner hotels when a stay that was reserved using our booking channels is completed. Indirect reimbursements also include revenues related to our Hilton Honors guest loyalty program, which are primarily derived from payments from hotel franchisees and third-party owners of hotels we manage that participate in the program, as well as strategic partners, including strategic partner hotels. We are contractually required to use these fees that we collect solely for these programs. \nFactors Affecting our Revenues\nThe following factors affect the revenues we derive from our operations:\n•\nConsumer demand and global economic conditions\n. Consumer demand for our products and services, as well as the products and services of the third parties from which we earn licensing fees, is closely linked to the performance of the general economy and is sensitive to business and personal discretionary spending levels. Among other factors, declines in consumer demand due to adverse general economic conditions, risks reducing or otherwise negatively affecting travel patterns, lower consumer confidence and adverse geopolitical conditions can reduce the amount of management and franchise fees we are able to generate and/or reduce the revenues and profitability of the operations of our owned and leased hotels. Further, competition for hotel guests and the supply of hotel services affect our ability to sustain or increase rates charged to customers of our hotels. Also, declines in hotel profitability during an economic downturn directly affect the incentive portion of our management fees, which is based on hotel profitability measures. As a result, changes in consumer demand and general business cycles have historically subjected and could in the future subject our revenues to significant volatility.\n•\nContracts with third-party hotel owners and franchisees and relationships with developers\n. We depend on our long-term management and franchise contracts with third-party hotel owners and hotel franchisees for our management and franchise fee revenues. The success and sustainability of our management and franchise business depends on our ability to perform under our management and franchise contracts and maintain good relationships with third-party hotel owners and franchisees. Our relationships with these third parties allow us to maintain our current presence as contracts mature and also generate new incremental opportunities for property development that can support our growth. Growth and maintenance of our hotel system and earning fees related to hotels in development are dependent on the ability of developers and owners to access capital for the development, maintenance and renovation of properties. We believe that we generally have good relationships with our third-party hotel owners, franchisees and developers and are committed to the continued growth and development of these relationships. These relationships exist with a diverse group of owners, franchisees and developers and are not significantly concentrated with any one particular third party. \n41\nExpenses\nPrincipal Components\nWe primarily incur the following expenses:\n•\nOwned and leased hotels. \nReflects the operating expenses of our consolidated owned and leased hotels, including room expenses, food and beverage costs, other support costs and property expenses. Room expenses include compensation costs for housekeeping, laundry and front desk staff, as well as supply costs for guest room amenities and laundry. Food and beverage costs include costs for wait and kitchen staff and food and beverage inventory. Other support expenses include costs associated with property-level management, utilities, sales and marketing, operating hotel spas, operating telephones, parking and other guest recreation, entertainment and other services. Property expenses include property taxes, repairs and maintenance, rent and insurance.\n•\nDepreciation and amortization. \nThese are non-cash expenses that primarily consist of: (i) amortization of capitalized software costs; (ii) depreciation and amortization of property and equipment, including our finance lease right-of-use (\"ROU\") assets, such as buildings and furniture and equipment that are used in corporate operations or at our consolidated owned and leased hotels; (iii) amortization of management and franchise contracts acquired from third parties and (iv) amortization of intangible assets that were recorded at their fair value at the time of the 2007 transaction whereby we became a wholly owned subsidiary of affiliates of Blackstone Inc. (the \"Merger\"). As of January 1, 2022, the only remaining finite-lived intangible assets resulting from the Merger related to leases, international management contracts and our Hilton Honors guest loyalty program. The assets related to the international management contracts and Hilton Honors, which both had useful lives of 16 years, were fully amortized during the year ended December 31, 2023.\n•\nGeneral and administrative. \nConsists primarily of compensation costs for our corporate employees, including share-based compensation; professional fees, including consulting, audit and legal fees; travel and entertainment expenses; credit losses for estimated uncollectible management, franchise and other fees; and administrative and related expenses. \n•\nOther expenses\n. Primarily consists of expenses incurred by our purchasing operations.\n•\nOther expenses from managed and franchised properties. \nRepresents certain costs and expenses that are contractually reimbursed to us by property owners, primarily for (i) payroll and related costs for hotels that we manage where the employees are legally employed by us and (ii) expenses related to our marketing, sales, brands and shared services programs. We are contractually required to use these fees solely for these programs. We have no legal responsibility for the employees or the liabilities associated with operating franchised properties, strategic partner hotels or certain of our managed hotels, predominately those located outside of the U.S. Other expenses from managed and franchised properties also includes expenses for the operation of our Hilton Honors guest loyalty program as well as credit losses for estimated uncollectible Hilton Honors and program fees. \nFactors Affecting our Costs and Expenses\nThe following are principal factors that affect the costs and expenses we incur in the course of our operations: \n•\nFixed expenses. \nMany of the expenses associated with owning and leasing hotels are relatively fixed. These expenses include personnel costs, rent, property taxes, insurance and utilities. If we are unable to decrease these costs significantly or rapidly when demand for our hotels decreases, the resulting decline in our revenues can have an adverse effect on our net cash flows and profits. This effect can be especially pronounced during periods of economic contraction or slow economic growth. Economic downturns generally affect the results of our ownership segment more significantly than the results of our management and franchise segment due to the high fixed costs associated with operating an owned or leased hotel. Employees at some of our owned and leased hotels are parties to collective bargaining agreements that may also limit our ability to make timely staffing or labor changes in response to declining revenues. In addition, any efforts to reduce costs, including the deferral or cancellation of capital improvements, could adversely affect the economic value of our hotels and brands. Additionally, the general and administrative expenses of operating a global business also include fixed personnel costs, rent, property taxes, insurance and utilities. The effectiveness of any cost-cutting efforts related to owning and leasing hotels or corporate operations is limited by the amount of inherent fixed costs. However, we have taken steps to manage our fixed costs to levels we believe are \n42\nappropriate to maximize profitability and respond to market conditions, while continuing to optimize value for the experiences of our customers, owners and Hilton employees, which supports the long-term sustainability of our brands and business. \n•\nChanges in depreciation and amortization expenses. \nWe capitalize costs associated with certain software development projects and, as those projects are completed and placed into service, amortization expense will increase. As the finite-lived intangible assets that were recorded at the Merger become fully amortized, amortization expense will decrease. As of December 31, 2024, the only remaining finite-lived intangible assets that resulted from the Merger were those related to leases, as included in other intangible assets. We capitalize management and franchise contract intangibles acquired from third parties and amortize the amounts over their useful lives. Additionally, changes in depreciation expense may be driven by renovations of existing hotels, acquisition or development of new hotels, the disposition of existing hotels or corporate facilities through sale, closure or lease termination, lease renewals, expenditures related to our corporate facilities or changes in estimates of the useful lives of our assets. As we place new assets into service, we will be required to recognize additional depreciation expense on those assets. If we are required to recognize impairment losses related to our depreciable assets or finite-lived intangible assets, the related depreciation or amortization expense, respectively, will decrease. \nOther Items\nEffect of foreign currency exchange rate fluctuations\nSignificant portions of our operations are conducted in functional currencies other than our reporting currency, which is USD, and we have assets and liabilities, including those that are payable or receivable by consolidated subsidiaries, denominated in a variety of foreign currencies. As a result, we are required to translate the results of those operations, assets and liabilities from their functional currency into USD at market-based foreign currency exchange rates for each reporting period. When comparing our results of operations between reporting periods, there may be material portions of the changes in our revenues or expenses that are derived from fluctuations in foreign currency exchange rates experienced between those periods. We hedge foreign currency exchange-based cash flow variability of certain of our fees using foreign currency forward contracts designated as hedging instruments. We also hold short-term foreign currency forward contracts to offset exposure to fluctuations in certain of our foreign currency denominated cash balances and intercompany financing arrangements, and we have not currently elected to designate these forward contracts as hedging instruments.\nSeasonality\nThe hospitality industry is seasonal in nature. The periods during which our properties experience higher or lower levels of demand vary from property to property, depending principally upon their location, type of property and competitive mix within the specific location. Based on historical results, we generally expect our revenues to be lower in the first quarter of each year than in each of the three subsequent quarters.\nKey Business and Financial Metrics Used by Management\nComparable Hotels\nWe define our comparable hotels as those that: (i) were active and operating in our system for at least one full calendar year, have not undergone a change in brand or ownership type during the current or comparable periods and were open January 1st of the previous year; and (ii) have not undergone large-scale capital projects, sustained substantial property damage, encountered business interruption or for which comparable results were not available. We exclude strategic partner hotels from our comparable hotels. Of the 8,342 hotels in our system as of December 31, 2024, 409 hotels were strategic partner hotels and 6,050 hotels were classified as comparable hotels. Our 1,883 non-comparable hotels as of December 31, 2024 included (i) 1,005 hotels that were added to our system after January 1, 2023 or that have undergone a change in brand or ownership type during the current or comparable periods reported and (ii) 878 hotels that were removed from the comparable group for the current or comparable periods reported because they underwent or are undergoing large-scale capital projects, sustained substantial property damage, encountered business interruption or comparable results were otherwise not available.\nOccupancy\nOccupancy represents the total number of room nights sold divided by the total number of room nights available at a hotel or group of hotels for a given period. Occupancy measures the utilization of available capacity at a hotel or group of hotels. \n43\nManagement uses occupancy to gauge demand at a specific hotel or group of hotels in a given period. Occupancy levels also help management determine achievable Average Daily Rate (\"ADR\") pricing levels as demand for hotel rooms increases or decreases.\nADR\nADR represents hotel room revenue divided by the total number of room nights sold for a given period. ADR measures the average room price attained by a hotel, and ADR trends provide useful information concerning the pricing environment and the nature of the customer base of a hotel or group of hotels. ADR is a commonly used performance measure in the industry, and we use ADR to assess pricing levels that we are able to generate by type of customer, as changes in rates charged to customers have different effects on overall revenues and incremental profitability than changes in occupancy, as described above.\nRevenue per Available Room (\"RevPAR\")\nRevPAR is calculated by dividing hotel room revenue by the total number of room nights available to guests for a given period. We consider RevPAR to be a meaningful indicator of our performance as it provides a metric correlated to two primary and key drivers of operations at a hotel or group of hotels, as previously described: occupancy and ADR. RevPAR is also a useful indicator in measuring performance over comparable periods for comparable hotels.\nReferences to occupancy, ADR and RevPAR are presented on a comparable basis, based on the comparable hotels as of December 31, 2024, and references to ADR and RevPAR are presented on a currency neutral basis, unless otherwise noted. As such, comparisons of these hotel operating statistics for the years ended December 31, 2024 and 2023 use the foreign currency exchange rates used to translate the results of the Company's foreign operations within its consolidated financial statements for the year ended December 31, 2024.\nEBITDA and Adjusted EBITDA\nEBITDA reflects net income (loss), excluding interest expense, a provision for income tax benefit (expense) and depreciation and amortization expenses. Adjusted EBITDA is calculated as EBITDA, as previously defined, further adjusted to exclude certain items, including gains, losses, revenues and expenses in connection with: (i) asset dispositions for both consolidated and unconsolidated investments; (ii) foreign currency transactions; (iii) debt restructurings and retirements; (iv) furniture, fixtures and equipment (\"FF&E\") replacement reserves required under certain lease agreements; (v) share-based compensation; (vi) reorganization, severance, relocation and other expenses; (vii) non-cash impairment; (viii) amortization of contract acquisition costs; (ix) other revenues from managed and franchised properties and other expenses from managed and franchised properties; and (x) other items.\nWe believe that EBITDA and Adjusted EBITDA provide useful information to investors about us and our financial condition and results of operations for the following reasons: (i) these measures are among the measures used by our management team to evaluate our operating performance and make day-to-day operating decisions and (ii) these measures are frequently used by securities analysts, investors and other interested parties as a common performance measure to compare results or estimate valuations across companies in our industry. Additionally, these measures exclude certain items that can vary widely across different industries and among competitors within our industry. For instance, interest expense and income taxes are dependent on company specifics, including, among other things, capital structure and operating jurisdictions, respectively, and, therefore, could vary significantly across companies. Depreciation and amortization expenses, as well as amortization of contract acquisition costs, are dependent upon company policies, including the method of acquiring and depreciating assets and the useful lives that are assigned to those depreciating or amortizing assets for accounting purposes. For Adjusted EBITDA, we also exclude items such as: (i) FF&E replacement reserves for leased hotels to be consistent with the treatment of capital expenditures for property and equipment, where depreciation of such capitalized assets is reported within depreciation and amortization expenses; (ii) share-based compensation, as this could vary widely among companies due to the different plans in place and the usage of them; and (iii) other items that are not reflective of our operating performance, such as amounts related to debt restructurings and debt retirements and reorganization and related severance costs, to enhance period-over-period comparisons of our ongoing operations. Further, Adjusted EBITDA excludes both other revenues from managed and franchised properties and other expenses from managed and franchised properties as we contractually do not operate the related programs to generate a profit and have the contractual rights to adjust future collections to recover prior period expenditures. The direct reimbursements from property owners are billable and reimbursable as the costs are incurred and have no net effect on net income (loss) in the reporting period. The indirect reimbursements from property owners are typically billed and collected monthly, based on the underlying hotel's sales or usage (e.g., gross room revenue or number of reservations processed), while the associated costs are recognized as incurred by Hilton, creating timing differences, with the net effect impacting net income \n44\n(loss) in the reporting period. These timing differences are due to our discretion to spend in excess of revenues earned or less than revenues earned in a single period to ensure that the programs are operated in the best long-term interests of our property owners. However, over the life of the operation of these programs, the expenses incurred related to the indirect reimbursements are designed to equal the revenues earned from the indirect reimbursements over time such that, in the long term, the programs will not earn a profit or generate a loss and do not impact our economics, either positively or negatively. Therefore, the net effect of our cost reimbursement revenues and expenses is not used by management to evaluate our operating performance, determine executive compensation or make other operating decisions, and we exclude their impact when evaluating period over period performance results. \nEBITDA and Adjusted EBITDA are not recognized terms under U.S. generally accepted accounting principles (\"GAAP\") and should not be considered as alternatives, either in isolation or as a substitute, for net income (loss) or other measures of financial performance or liquidity, including cash flows, derived in accordance with GAAP. Further, EBITDA and Adjusted EBITDA have limitations as analytical tools, including:\n•\nEBITDA and Adjusted EBITDA do not reflect changes in, or cash requirements for, our working capital needs;\n•\nEBITDA and Adjusted EBITDA do not reflect our interest expense, or the cash requirements necessary to service interest or principal payments, on our indebtedness;\n•\nEBITDA and Adjusted EBITDA do not reflect income tax expenses or the cash requirements to pay our taxes;\n•\nEBITDA and Adjusted EBITDA do not reflect historical cash expenditures or future requirements for capital expenditures or contractual commitments;\n•\nEBITDA and Adjusted EBITDA do not reflect the effect on earnings or changes resulting from matters that we consider not to be indicative of our future operations;\n•\nalthough depreciation and amortization are non-cash charges, the assets being depreciated and amortized will often have to be replaced in the future, and EBITDA and Adjusted EBITDA do not reflect any cash requirements for such replacements; and\n•\nother companies in our industry may calculate EBITDA and Adjusted EBITDA differently, limiting their usefulness as comparative measures.\nBecause of these limitations, EBITDA and Adjusted EBITDA should not be considered as discretionary cash available to us to reinvest in the growth of our business, return to our stockholders through share repurchases and dividends or as measures of cash that will be available to us to meet our obligations.\n \n45\nResults of Operations\nThe hotel operating statistics by region for our system-wide comparable hotels were as follows:\nYear Ended\nChange\nDecember 31, 2024\n2024 vs. 2023\nSystem-wide\nOccupancy\n72.1 \n%\n0.8 \n%\npts.\nADR\n$\n159.55\n1.6 \n%\nRevPAR\n$\n115.09\n2.7 \n%\nU.S.\nOccupancy\n72.5 \n%\n0.5 \n%\npts.\nADR\n$\n167.27\n1.0 \n%\nRevPAR\n$\n121.34\n1.8 \n%\nAmericas (excluding U.S.)\nOccupancy\n69.0 \n%\n0.8 \n%\npts.\nADR\n$\n155.88\n5.2 \n%\nRevPAR\n$\n107.50\n6.5 \n%\nEurope\nOccupancy\n74.6 \n%\n2.5 \n%\npts.\nADR\n$\n165.69\n3.8 \n%\nRevPAR\n$\n123.62\n7.4 \n%\nMEA\nOccupancy\n73.0 \n%\n2.9 \n%\npts.\nADR\n$\n180.77\n5.3 \n%\nRevPAR\n$\n131.88\n9.6 \n%\nAsia Pacific\nOccupancy\n69.5 \n%\n0.5 \n%\npts.\nADR\n$\n110.03\n0.8 \n%\nRevPAR\n$\n76.49\n1.6 \n%\nSystem-wide RevPAR increased during the year ended December 31, 2024 supported by improvements in system-wide ADR, which included the impact of inflation, and an increase in occupancy in all regions, which was driven by an increase in group demand, with leisure and business demand also improving modestly. The increase in RevPAR in the U.S. was driven by an increase in bookings due to an increase in weekday travel, primarily for groups, with consistent growth in business demand. The Americas region, excluding the U.S., continued to see improvement resulting from an increase in inbound leisure travel to Mexico and the Caribbean and Latin America. The RevPAR increase in Europe was driven by continued growth in inbound international leisure travel, which increased in several major cities that held large popular sporting events, as well as steady business demand. The RevPAR improvement in MEA was driven by increased demand from special regional events as well as more relaxed travel policies. The increase in Asia Pacific was due to growth in countries and territories outside of China across the region, driven by increased holiday travel, less restrictive tourism policies and special events in the region, partially offset by tougher year-over-year comparisons in China, after the reacceleration in the prior year as a result of the removal of cross-border travel restrictions.\n46\nThe table below provides a reconciliation of net income to EBITDA and Adjusted EBITDA:\nYear Ended December 31,\n2024\n2023\n(in millions)\nNet income\n$\n1,539 \n$\n1,151 \nInterest expense\n569 \n464 \nIncome tax expense\n244 \n541 \nDepreciation and amortization expenses\n146 \n147 \nEBITDA\n2,498 \n2,303 \nGain on sales of assets, net\n(5)\n— \nLoss on foreign currency transactions\n12 \n16 \nLoss on investments in unconsolidated affiliate\n(1)\n— \n92 \nLoss on debt guarantees\n(2)\n50 \n— \nFF&E replacement reserves\n57 \n63 \nShare-based compensation expense\n176 \n169 \nImpairment losses\n— \n38 \nAmortization of contract acquisition costs\n50 \n43 \nOther revenues from managed and franchised properties\n(3)\n(6,428)\n(5,827)\nOther expenses from managed and franchised properties\n(3)\n6,985 \n6,164 \nOther adjustments\n(4)\n34 \n28 \nAdjusted EBITDA\n$\n3,429 \n$\n3,089 \n____________\n(1)\nAmount includes losses recognized related to equity and debt financing that we had previously provided to an unconsolidated affiliate with underlying investments in certain hotels that we manage or franchise; refer to Note 6: \"Loss on Investments in Unconsolidated Affiliate\" in our consolidated financial statements for additional information.\n(2)\nAmount includes losses on debt guarantees for certain hotels that we manage; refer to Note 20: \"Commitments and Contingencies\" in our consolidated financial statements for additional information.\n(3)\nAmounts include results from the operation of programs conducted for the benefit of property owners and exclude cash receipts recorded as deferred revenues on our consolidated balance sheets related to these programs. Under the terms of the related contracts, we do not operate these programs to generate a profit and have the contractual rights to adjust future collections to recover prior period expenditures.\n(4)\nAmount for the year ended December 31, 2024 includes losses for the full or partial settlement of certain pension plans and restructuring costs related to one of our leased properties as well as transaction costs incurred for acquisitions. Amounts for the years ended December 31, 2024 and 2023 include transaction costs resulting from the amendments of our credit agreement governing the senior secured term loan facilities (\"Term Loans\") in June 2024 and November 2023, respectively. Amounts for both periods also include net losses (gains) related to certain of our investments in unconsolidated affiliates, other than the loss included separately in \"loss on investments in unconsolidated affiliate,\" severance and other items.\nRevenues\nYear Ended December 31,\nPercent Change\n2024\n2023\n2024 vs. 2023\n(in millions)\nFranchise and licensing fees\n$\n2,600 \n$\n2,370 \n9.7\nBase and other management fees\n$\n369 \n$\n342 \n7.9\nIncentive management fees\n290 \n274 \n5.8\nTotal management fees\n$\n659 \n$\n616 \n7.0\nThe increase in both franchise fees and management fees were largely attributable to increases in RevPAR at our comparable franchised and managed hotels. During the year ended December 31, 2024, RevPAR at our comparable franchised and managed hotels increased 1.8 percent and 5.2 percent, respectively, contributing to currency neutral increases in franchise and management fees of $61 million and $37 million, respectively, as a result of increased occupancy of 0.4 percentage points and 2.1 percentage points, respectively, and increased ADR of 1.3 percent and 2.1 percent, respectively.\nFurther, franchise and management fees included net increases of $57 million and $10 million, respectively, during the year ended December 31, 2024 as a result of net hotel additions and increases of $9 million and $12 million, respectively, in termination fees.\n47\nLicensing fees increased $98 million as a result of an increase in fees from our strategic partnerships, primarily resulting from activity under our co-branded credit card arrangements, HGV and branded residential fees. Increased fees from HGV resulted from increased timeshare revenues earned by HGV, inclusive of the impact of adding new timeshare properties to our system during the period, including those acquired by HGV from third parties.\nYear Ended December 31,\nPercent Change\n2024\n2023\n2024 vs. 2023\n(in millions)\nOwned and leased hotels revenues\n$\n1,255 \n$\n1,244 \n0.9\nThe $11 million increase in owned and leased hotel revenues included a currency neutral increase of $23 million, partially offset by a $12 million decrease resulting from unfavorable fluctuations in foreign currency exchange rates. \nRevenues from our comparable owned and leased hotels increased $59 million, on a currency neutral basis, due to the increase in RevPAR at our comparable owned and leased hotels of 8.1 percent. The increase in RevPAR was due to increases in occupancy of 2.5 percentage points and ADR of 4.7 percent. Revenues from our non-comparable owned and leased hotels decreased $36 million, on a currency neutral basis, primarily due to hotels undergoing renovations, offset by hotels that underwent renovations in the prior year, hotels that exited our system between the periods and the business disruption, caused by military conflict, that occurred at our leased hotel in Israel.\nYear Ended December 31,\nPercent Change\n2024\n2023\n2024 vs. 2023\n(in millions)\nOther revenues\n$\n232 \n$\n178 \n30.3\nThe increase in other revenues was primarily due to increased procurement volume and associated vendor rebates for purchases made by properties, including properties outside of our system, that participate in our purchasing programs.\nOperating Expenses\nYear Ended December 31,\nPercent Change\n2024\n2023\n2024 vs. 2023\n(in millions)\nOwned and leased hotels expenses\n$\n1,126 \n$\n1,141 \n(1.3)\nThe $15 million decrease in owned and leased hotels expenses included a decrease of $10 million on a currency neutral basis and a $5 million decrease resulting from favorable fluctuations in foreign currency exchange rates.\nExpenses from our comparable owned and leased hotels increased $37 million, on a currency neutral basis, as a result of increased occupancy and cost inflation, primarily due to increases in payroll and other compensation costs, as well as rent expense and expenses related to FF&E replacement reserves. Operating expenses from our non-comparable owned and leased hotels decreased $47 million, on a currency neutral basis, primarily due to hotels undergoing renovations, hotels that exited our system and the business disruption, caused by military conflict, that occurred at our leased hotel in Israel.\n48\nYear Ended December 31,\nPercent Change\n2024\n2023\n2024 vs. 2023\n(in millions)\nDepreciation and amortization expenses\n$\n146 \n$\n147 \n(0.7)\nGeneral and administrative expenses\n415 \n408 \n1.7\nImpairment losses\n— \n38 \nNM\n(1)\nOther expenses\n137 \n112 \n22.3\n____________\n(1)\nFluctuation in terms of percentage change is not meaningful.\nThe decrease in depreciation and amortization expenses was primarily driven by a decrease of $32 million for certain intangible assets that became fully amortized during the year ended December 31, 2023. The decrease was mostly offset by an increase related to software and corporate and leased hotel assets placed in service between the periods.\nThe increase in general and administrative expenses was primarily due to an increase in costs related to payroll and other compensation costs.\nWe recognized $38 million of impairment losses during the year ended December 31, 2023 on assets associated with certain leased hotels; see Note 12: \"Fair Value Measurements\" in our consolidated financial statements for additional information.\nThe increase in other expenses was primarily due to costs associated with higher procurement volume from our purchasing operations.\nNon-operating Income and Expenses\nYear Ended December 31,\nPercent Change\n2024\n2023\n2024 vs. 2023\n(in millions)\nInterest expense\n$\n(569)\n$\n(464)\n22.6\nLoss on foreign currency transactions\n(12)\n(16)\n(25.0)\nLoss on investments in unconsolidated affiliate\n— \n(92)\nNM\n(1)\nOther non-operating income (loss), net\n(6)\n39 \nNM\n(1)\nIncome tax expense\n(244)\n(541)\n(54.9)\n____________\n(1)\nFluctuation in terms of percentage change is not meaningful.\nIn November 2023, we amended the credit agreement governing the Term Loans and increased borrowings by $500 million (the \"November 2023 Amendment\"). In addition, in both March 2024 and in September 2024 we issued $1.0 billion Senior Notes (collectively, the \"March and September Senior Notes issuances\") for a total aggregate principal amount of $2.0 billion for the year. See Note 10: \"Debt\" in our consolidated financial statements for additional information.\nThe increase in interest expense was primarily attributable to (i) an increase related to the Term Loans of $31 million as a result of the increase in the outstanding borrowings resulting from the November 2023 Amendment and (ii) an increase of $66 million due to the March and September Senior Notes issuances.\nThe net gains and losses on foreign currency transactions are a result of changes in foreign currency exchange rates, including on certain intercompany financing arrangements, such as short-term cross-currency intercompany loans, as well as transactions denominated in foreign currencies.\nThe loss on investments in unconsolidated affiliate included: (i) a $44 million other-than-temporary impairment loss on our investment in one of our third-party unconsolidated affiliates (the \"Fund\"), which has underlying investments in certain hotels that we manage or franchise, and (ii) $48 million of credit losses on financing receivables provided to the Fund. See Note 6: \"Loss on Investments in Unconsolidated Affiliate\" and Note 12: \"Fair Value Measurements\" in our consolidated financial statements for additional information.\n49\nThe net change in other non-operating income (loss), net during the year ended December 31, 2024 was primarily driven by an increase in losses on debt guarantees for certain hotels that Hilton manages. See Note 20: \"Commitments and Contingencies\" in our consolidated financial statements for additional information.\nThe decrease in income tax expense was primarily attributable to the $270 million benefit for the tax claim for increased foreign tax basis for certain brand assets, as well as an increase of $64 million in uncertain tax position reserves related to our guest loyalty program in 2023 that did not recur in 2024, partially offset by a $23 million increase to income tax expense attributable to the increase in income before income taxes. For additional information, see Note 14: “Income Taxes” in our consolidated financial statements. \nSegment Results\nAs of December 31, 2024, our management and franchise segment included 831 managed and 7,566 franchised and licensed properties, which included 105 timeshare and 409 strategic partner hotels, consisting of 1,251,068 total rooms, and our ownership segment included 50 hotels consisting of 17,138 total rooms. Refer to Note 19: \"Business Segments\" in our consolidated financial statements for reconciliations of revenues for our reportable segments to consolidated total revenues and of segment Adjusted EBITDA to consolidated income before income taxes.\nFranchise and licensing fees and total management fees including fees charged to our ownership segment and excluding amortization of contract acquisition costs reflects our management and franchise segment revenues and segment Adjusted EBITDA. For the year ended December 31, 2024, refer to \"—Revenues\" for further discussion of the increase in our franchise and licensing fees and total management fees. For the year ended December 31, 2024, refer to \"—Revenues\" for further discussion of the primary changes in revenues from our owned and leased hotels, which reflect our ownership segment revenues. Our ownership segment Adjusted EBITDA reflects owned and leased hotels revenues, less (i) owned and leased hotels expenses, excluding FF&E replacement reserves expenses, share-based compensation expenses and certain other items, less (ii) fees charged by our management and franchise segment to our ownership segment, plus (iii) income (losses) from hotels owned or leased by entities in which we own a noncontrolling financial interest. Refer to \"—Operating Expenses\" for further discussion of the changes in owned and leased hotels expenses.\nLiquidity and Capital Resources\nOverview\nAs of December 31, 2024, we had total cash and cash equivalents of $1,376 million, including $75 million of restricted cash and cash equivalents. The majority of our restricted cash and cash equivalents is related to cash collateral and cash held for FF&E reserves.\nOur known short-term liquidity requirements primarily consist of funds necessary to pay for operating and other expenditures, including: \n•\ncosts associated with the management and franchising of hotels;\n•\ncorporate expenses;\n•\npayroll and compensation costs;\n•\ntaxes and compliance costs;\n•\nscheduled debt maturities and interest payments on our outstanding indebtedness, which, excluding finance lease liabilities, are estimated to be approximately $1.1 billion in 2025;\n•\nlease payments under our finance and operating leases, which include minimum lease payments that are estimated to be approximately $42 million and $152 million, respectively, in 2025;\n•\ncosts, other than compensation and lease payments that are noted separately, associated with the operations of owned and leased hotels, including, but not limited to, utilities and operating supplies;\n•\ncommitted contract acquisition costs;\n50\n•\ncapital and maintenance expenditures for required renovations and maintenance at the hotels within our ownership segment;\n•\ncorporate capital and information technology expenditures;\n•\ndividends as declared; and\n•\nshare repurchases.\nOur known long-term liquidity requirements primarily consist of funds necessary to pay for: \n•\nscheduled debt maturities and interest payments on our outstanding indebtedness, which, excluding finance lease liabilities, are estimated to total an aggregate of $13.3 billion after December 31, 2025;\n•\nlease payments under our finance and operating leases, which include minimum lease payments that are estimated to total an aggregate of $92 million and $924 million, respectively, after December 31, 2025;\n•\ncommitted contract acquisition costs;\n•\ncapital improvements to the hotels within our ownership segment;\n•\ncorporate capital and information technology expenditures;\n•\ndividends as declared;\n•\nshare repurchases; and\n•\ncommitments to owners in our management and franchise segment made in the normal course of business for which we are reimbursed by these owners through Hilton Honors and program fees to operate our Hilton Honors program, marketing, sales and brand programs and shared services.\nDuring the year ended December 31, 2024, we repurchased approximately 13.3 million shares of our common stock for $2.9 billion. As of December 31, 2024, approximately $4.4 billion remained available for share repurchases under our stock repurchase program.\nIn circumstances where we have the opportunity to support our strategic objectives, we may provide guarantees or other commitments, as necessary, to owners of hotels that we currently or in the future will manage or franchise or other third parties. See Note 20: \"Commitments and Contingencies\" in our consolidated financial statements for additional information on our commitments that were outstanding as of December 31, 2024.\nWe have a long-term investment policy that is focused on the preservation of capital and maximizing the return on new and existing investments and returning available capital to stockholders through dividends and share repurchases. Within the framework of our investment policy, we intend to finance our business activities primarily with cash on our balance sheet as of December 31, 2024, cash generated from our operations and, as needed, the use of the available capacity of our senior secured revolving credit facility (the \"Revolving Credit Facility\"). Additionally, we have continued access to debt markets and expect to be able to obtain financing as a source of liquidity as required and to extend maturities of existing borrowings, if necessary.\nAfter considering our approach to liquidity and our available sources of cash, we believe that our cash position and sources of liquidity will meet anticipated requirements for operating and other expenditures, including corporate expenses, payroll and other compensation costs, taxes and compliance costs, current maturities of long-term debt and other commitments for the foreseeable future based on current conditions. The objectives of our cash management policy are maintaining the availability of liquidity and minimizing operational costs. \nWe may from time to time issue or incur or increase our capacity to incur new debt and/or purchase our outstanding debt through underwritten offerings, open market transactions, privately negotiated transactions or otherwise. Issuances or incurrence of new debt (or an increase in our capacity to incur new debt) and/or purchases or retirements of outstanding debt, if \n51\nany, will depend on prevailing market conditions, liquidity requirements, contractual restrictions and other factors. The amounts involved may be material.\nSources and Uses of Our Cash and Cash Equivalents\nThe following table summarizes our net cash flows:\nYear Ended December 31,\nPercent Change\n2024\n2023\n2024 vs. 2023\n(in millions)\nNet cash provided by operating activities\n$\n2,013 \n$\n1,946 \n3.4\nNet cash used in investing activities\n(446)\n(305)\n46.2\nNet cash used in financing activities\n(1,045)\n(2,040)\n(48.8)\nOperating Activities \nCash flows from operating activities were primarily generated from management, franchise and licensing fee revenue and operating income from our owned and leased hotels. The increase in net cash inflows during the period was primarily due to the increase in cash inflows generated from our management and franchise segment, discussed in \"—Revenues,\" largely as a result of an increase in RevPAR at our comparable managed and franchised hotels as well as revenues from net hotel additions and a $128 million decrease in payments of contract acquisition costs due to the timing of certain strategic hotel developments supporting our growth during the year ended December 31, 2023. The increase in cash provided by operating activities was partially offset by an outflow of $77 million for debt guarantee payments and an increase in cash paid for interest of $70 million.\nInvesting Activities\nNet cash used in investing activities primarily included cash flows related to: (i) the acquisitions of (a) the Graduate brand and the associated franchise contracts and (b) a controlling financial interest in Sydell Hotels & Resorts, LLC and Sydell Holding Company UK Ltd, both completed during the year ended December 31, 2024, (ii) capitalized software costs that were related to various systems initiatives for the benefit of both our property owners and our overall corporate operations, and (iii) capital expenditures for property and equipment related to corporate property and the renovation of certain hotels in our ownership segment, which decreased between the periods due to the timing of certain corporate and hotel capital expenditure projects. Additionally, our investing activities include the net cash inflows and outflows related to our undesignated derivative financial instruments that we have in place to hedge against the impact of fluctuations in foreign currency exchange rates on certain of our intercompany loan and cash balances, which were primarily the result of changes in the exchange rates for the Euro for the year ended December 31, 2024 and the Pound Sterling to the U.S. dollar for the years ended December 31, 2024 and 2023.\nFinancing Activities\nThe decrease in net cash used in financing activities during the year ended December 31, 2024 was primarily attributable to a $2.0 billion increase in cash inflows from the March and September Senior Notes issuances. This increase in cash inflows was partially offset by a $555 million increase in cash outflows for share repurchases and payment of the related excise taxes and additional borrowings on the Term Loans of $500 million during the year ended December 31, 2023 as part of the November 2023 Amendment.\nDebt and Borrowing Capacity\nAs of December 31, 2024, our total indebtedness, excluding the deduction for unamortized deferred financing costs and discounts, was approximately $11.2 billion. No debt amounts were outstanding under our Revolving Credit Facility as of December 31, 2024, which had an available borrowing capacity of $1,910 million after considering $90 million of outstanding letters of credit.\n \nFor additional information on our total indebtedness and guarantees on our debt, refer to Note 10: \"Debt\" in our consolidated financial statements.\nIf we are unable to generate sufficient cash flow from operations in the future to service our debt, we may be required to reduce capital expenditures or issue additional equity securities. We have $500 million of 5.375% Senior Notes due in May \n52\n2025 (\"May 2025 Senior Notes\") and have no other material indebtedness that matures prior to April 2027. We believe that we have sufficient sources of liquidity and access to debt financing to address the repayment of the May 2025 Senior Notes at or prior to their maturity date as well as all indebtedness that becomes due thereafter. Our ability to make scheduled principal payments and to pay interest on our debt depends on our future operating performance, which is subject to general conditions in or affecting the hospitality industry that may be beyond our control.\nCritical Accounting Estimates\nThe preparation of our consolidated financial statements in accordance with GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities as of the date of the consolidated financial statements, the reported amounts of revenues and expenses during the reporting periods and the related disclosures in the consolidated financial statements and accompanying footnotes. On an ongoing basis, we evaluate these estimates and judgments based on historical experiences and various other factors that we believe reflect the current circumstances. While we believe our estimates, assumptions and judgments are reasonable, they are based on information available when they are made. Actual results may differ significantly from these estimates due to changes in judgments, assumptions and conditions as a result of unforeseen events or otherwise, which could have a material effect on our financial position or results of operations.\nWe believe that the following estimates, which are used in conjunction with our significant accounting policies, are critical because they involve a higher degree of judgment and are based on information that is inherently uncertain; refer to Note 2: \"Basis of Presentation and Summary of Significant Accounting Policies\" in our consolidated financial statements for information on our significant accounting policies. Management has discussed the development and selection of the following critical accounting estimates with the Audit Committee of the board of directors:\nImpairment of Goodwill and Brands Intangible Assets\nWe evaluate goodwill and brands intangible assets for potential impairment on an annual basis or at other times during the year if indicators of impairment exist. Our reporting units are the same as our operating segments as described in Note 19: \"Business Segments\" in our consolidated financial statements.\nAs part of the evaluation of goodwill and brands intangible assets for potential impairment, we exercise judgment to:\n•\nperform a qualitative assessment to determine whether it is more likely than not that the fair value of a reporting unit or brand intangible asset is less than its carrying value. Factors we consider when making this determination include assessing historical trends and the overall effect of current trends in and future expectations of the hospitality industry and the general economy and regional performance;\n•\ndecide whether to bypass the qualitative assessment and perform a quantitative assessment. Factors we consider when making this determination include negative changes in the Company or general economic conditions since the previous quantitative assessment was performed, the amount by which the fair value exceeded the carrying value at the time of the previous assessment and the period of time that has passed since such quantitative assessment; and\n•\nperform a quantitative analysis to identify both the existence and the amount of an impairment loss. The estimated fair value is based on internal projections of expected future cash flows and operating plans, discount rates and market conditions relative to the operations of the reporting unit or brand, as applicable.\nChanges in the estimates and assumptions used in our impairment analysis, or changes in the factors that we consider that would affect these estimates and assumptions, such as those described above, could result in impairment losses, which could be material.\nImpairment of Certain Finite-Lived Assets\nWe evaluate the carrying value of our specifically identifiable lease intangible assets, operating and finance lease ROU assets and property and equipment for indicators of impairment. As part of the process, we exercise judgment to:\n•\ndetermine if there are indicators of impairment present. Factors we consider when making this determination include assessing historical trends and the overall effect of current trends in and future expectations of the hospitality industry and the general economy and regional performance, capital costs and other asset-specific information;\n53\n•\ndetermine the projected undiscounted future cash flows when indicators of impairment are present to determine whether an asset group is recoverable by comparing the expected undiscounted future cash flows to the net carrying value of that asset group. Judgment is required when developing projections of future revenues and expenses to determine the undiscounted cash flows, which are based on estimated performance over the expected useful life of the asset group. Forward-looking estimates of performance are based on historical operating results, adjusted for current and expected future market conditions, as well as various internal projections and external sources; and\n•\ndetermine the asset group fair value when an asset group is determined not to be recoverable. In determining the fair value, we often use internally-developed discounted cash flow models, appraisals, recent similar transactions in the market and, if appropriate and available for a specific asset group, current estimated net sales proceeds from pending offers. The discounted cash flow models include the undiscounted cash flows, as discussed above, which may require us to adjust for specific market conditions, and a discount rate to determine the present value of those cash flows. The discount rate applied to forward-looking projections takes into account market-specific considerations.\nChanges in the estimates and assumptions used in our impairment analysis, or changes in the factors that we consider that would affect these estimates and assumptions, such as those described above, could result in impairment losses, which could be material.\nHilton Honors\nWe record a point redemption liability for amounts received from properties participating in our Hilton Honors guest loyalty program and from strategic partners affiliated with the loyalty program, in an amount equal to the estimated cost per point of the future redemption obligation. We engage third-party actuaries annually to assist in determining the fair value of the future reward redemption obligation using a discount rate and statistical formulas that project future point redemptions based on factors that require judgment, including: (i) an estimate of the number of points that will eventually be redeemed, which includes an estimate of breakage (i.e., points that will never be redeemed); (ii) an estimate of when such points will be redeemed; and (iii) an estimate of the cost of reimbursing managed and franchised properties and other third parties for redemptions. The cost of the points expected to be redeemed includes further estimates of available room nights, occupancy rates, room rates and any changes to the Hilton Honors program, including devaluation or appreciation of points based on changes in the number of points required to redeem a reward. Any amounts received related to the issuance of points that are in excess of the cost per point, as determined with assistance from an actuary, are recorded as deferred revenue in our consolidated balance sheet and recognized as revenue upon point redemption. We recognize revenue for point redemptions in the amount we expect to retain in excess of the cost per point, inclusive of estimated breakage, and limit the revenue recognized to an amount that is probable to not result in a significant reversal in the cumulative revenue recognized when breakage occurs.\nIn addition to the Hilton Honors fees we receive from property owners to operate the program, we earn fees from strategic partnerships, including co-branded credit card arrangements, for a license to use our IP and the issuance of points. The allocation of the overall fees from the strategic partnerships between the IP license and the points is based on their estimated standalone selling prices. The estimated standalone selling price of the IP license is determined using a relief-from-royalty valuation method incorporating statistical formulas based on factors that require significant judgment, including estimates of the usage of the strategic partner's goods or services, an appropriate royalty rate and a discount rate applied to the projected cash flows. The estimated standalone selling price of the future reward redemptions of points under the strategic partnerships is calculated using a discounted cash flow analysis with the same assumptions as the point redemption liability discussed above, adjusted for an appropriate margin.\nChanges in our estimates and assumptions that are used to determine our estimated cost per point and the allocation of fees from strategic partnerships between the IP license fee and the points could result in material changes in the balances of our liability for guest loyalty program and deferred revenues in our consolidated balance sheet. Further, the estimates and assumptions used for the allocation of fees could result in material changes to our licensing fees and other revenues from managed and franchised properties recognized in our consolidated statement of operations.\nIncome Taxes\nWe regularly review our deferred tax assets to assess their potential realization and establish valuation allowances for portions of such assets that we believe will not be ultimately realized. In performing this review, we consider all positive and negative evidence available, including, but not limited to, estimates and assumptions regarding projected future taxable income, the expected timing of reversals of existing temporary differences and the implementation of tax planning strategies, all of which require significant use of judgment. A change in these assumptions may increase or decrease our valuation allowances \n54\nresulting in an increase or decrease in our effective tax rate, respectively, which could materially affect our consolidated financial statements. Refer to Note 14: \"Income Taxes\" for information on the balances of our deferred tax assets and respective valuation allowances as of December 31, 2024.\n \nWe record the benefits of income tax positions by recognizing the largest amount of income tax benefit more-likely-than-not to be realized upon resolution. Estimating this benefit involves, but is not limited to, interpreting complex tax laws in the multiple jurisdictions where we operate, evaluating the technical merits of each tax position and assessing amounts we would ultimately accept in a negotiated settlement with the tax authorities, if applicable. The complexities and judgment involved in estimating the Company's income tax positions could result in payments materially different than the liabilities previously recognized for such expected payments. Additionally, as new information becomes available (e.g., legislative changes or administrative rulings) changes in the Company's judgment and assumptions could result in adjustments to our existing income tax position recognition. Changes to these assumptions and estimates may increase or decrease our existing liabilities, resulting in additional income tax expense or benefit, respectively, which could materially affect our consolidated financial statements.\nLegal Contingencies\nWe are subject to various legal proceedings and claims, the outcomes of which are subject to significant uncertainty. An estimated loss from a loss contingency will be accrued as a charge to income if it is probable and the amount of the loss can be reasonably estimated. Significant judgment is required when we evaluate, among other factors, the degree of probability of an unfavorable outcome and the ability to make a reasonable estimate of the amount of loss in determining whether an accrual of an estimated loss is appropriate. Changes in these factors could materially affect our consolidated financial statements.\n55",
  "item2": null
}