{
  "source_file": "holx-20250927.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOverview\nWe are a developer, manufacturer and supplier of premium diagnostics products, medical imaging systems, and surgical products focused on women’s health and well-being through early detection and treatment. We sell and service our products through a combination of direct sales and service personnel and a network of independent distributors and sales representatives. We operate in four segments: Diagnostics, Breast Health, GYN Surgical and Skeletal Health. \nThrough our Diagnostics segment, we offer a wide range of diagnostic products, which are used primarily to aid in the screening and diagnosis of human diseases. Our primary Diagnostics products include our molecular diagnostic assays, which run on our advanced instrumentation systems (Panther and Panther Fusion), our cytology systems, including the ThinPrep System, and the Genius Digital Diagnostics System, and the Rapid fFN Test. Our Aptima family of molecular diagnostic assays is used to detect, among other things, the infectious microorganisms that cause common sexually transmitted diseases, or STDs, such as chlamydia and gonorrhea, or CT/NG; certain high-risk strains of human papillomavirus, or HPV;\n Trichomonas vaginalis\n, the parasite that causes trichomoniasis; Mycoplasma genitalium; and Herpes Simplex viruses 1 and 2. We also offer viral load tests for the quantitation of Hepatitis B virus, Hepatitis C virus, human immunodeficiency virus, or HIV-1, and human cytomegalo virus, or CMV, for use on our Panther instrument system. In addition, we offer bacterial vaginosis and candida vaginitis assays, or BV/CV, for the diagnosis of vaginitis, a common and complex ailment affecting millions of women a year. Our assay portfolio also includes diagnostic tests for a range of acute respiratory infections, including SARS-CoV-2, various strains of influenza and parainfluenza, and respiratory syncytial virus, as well as a test for the detection of Group B Streptococcus, or GBS, as well as two assays that detect several bacterial gastrointestinal (GI) pathogens that commonly cause acute gastroenteritis; all of which are run on the Panther Fusion system, a field upgradeable instrument addition to the base Panther system. We also offer two CE-marked molecular assays, the Panther Fusion EBV Quant assay for quantitation of Epstein-Barr virus, and the Panther Fusion BKV Quant assay for quantitation of the BK virus. These two assays are the first quantitative real-time PCR assays on the Panther Fusion system, and, together with the Aptima CMV Quant assay, comprise our menu of transplant monitoring assays. The ThinPrep System and the Genius Digital Diagnostics System are primarily used in cytology applications, such as cervical cancer screening, and the Rapid fFN Test assists physicians in assessing the risk of pre-term birth. We also generate service revenues from our CLIA-certified laboratory for testing related to breast cancer using our Breast Cancer Index or BCI test. The open access functionality on the Panther Fusion system allows customers to consolidate lab developed tests (LDTs) and in vitro diagnostic (IVD) assays on the same fully-automated, sample-to-result system.\nOur Breast Health segment offers a broad portfolio of solutions for breast imaging, biopsy, breast surgery and pathology. These solutions include 3D digital mammography systems, image analysis software utilizing artificial intelligence, reading workstations, minimally invasive breast biopsy guidance systems, breast biopsy site markers, localization, and specimen radiology systems. Our most advanced breast imaging platforms, Selenia Dimensions and 3Dimensions systems, utilize tomosynthesis to produce 3D images that show multiple contiguous slice images of the breast. \nOur GYN Surgical products include our MyoSure hysteroscopic tissue removal system, our NovaSure endometrial ablation system, our Fluent fluid management system, our Sonata transcervical radiofrequency ablation system, our Acessa ProVu laparoscopic radiofrequency ablation system, and our CoolSeal vessel sealing portfolio and our JustRight surgical stapler. The MyoSure suite of devices offers four options to provide incision-less removal of fibroids, polyps, and other pathology within the uterus. The NovaSure portfolio is comprised of the NovaSure ADVANCED device and the NovaSure V5 device for the treatment of abnormal uterine bleeding. The Fluent and Fluent Pro fluid management systems provide liquid distention during diagnostic and operative hysteroscopic procedures. The Sonata system uses transcervical, intrauterine ultrasound guidance to treat a wide range of fibroid types without the need for incisions. The Acessa ProVu system is a fully integrated system that uses laparoscopic ultrasound, guidance mapping and radiofrequency ablation to treat nearly all types of fibroids. The CoolSeal portfolio includes the CoolSeal Trinity, CoolSeal Reveal, and CoolSeal Mini advanced bipolar vessel sealing devices. The JustRight 5 mm stapler features a smaller instrument profile and is used for laparoscopic general and pediatric surgery.\nOur Skeletal Health segment’s products include the Horizon DXA, a dual energy x-ray system, which evaluates bone density and performs body composition assessments, and the Fluoroscan Insight FD mini C-arm, which assists in performing minimally invasive orthopedic surgical procedures on a patient’s extremities, such as the hand, wrist, knee, foot, and ankle. Effective in fiscal 2026, we are discontinuing the sale of our Fluoroscan Insight FD systems.\nUnless the context otherwise requires, references to “we”, “us”, “Hologic” or “the Company” refer to Hologic, Inc. and its consolidated subsidiaries. \n5\nTable of Contents\nAvailable Information\nOur internet website address is \nwww.hologic.com\n. Through our website, we make available, free of charge, our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to those reports, as well as proxy statements, and, from time to time, other documents as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission (SEC). These SEC reports can be accessed through the investor relations section of our website. The information found on our website is not part of this or any other report we file with or furnish to the SEC. \nInvestors and others should note that we announce material financial information to our investors using our investor relations website (\ninvestors.hologic.com\n), SEC filings, press releases, public conference calls and webcasts. We use these channels as well as social media to communicate with the public about our Company, our services and other issues. It is possible that the information we post on social media could be deemed to be material information. Therefore, we encourage investors, the media, and others interested in our Company to review the information we post on the social media channels listed on our investor relations website. We have used, and intend to continue to use, our investor relations website, as well as our X (formerly Twitter) account (@Hologic), as means of disclosing material non-public information and for complying with our disclosure obligations under Regulation FD. Additional corporate governance information, including our certificate of incorporation, bylaws, governance guidelines, board committee charters, and code of business conduct and ethics, is also available on our investor relations website under the heading “Governance.” The contents of our websites are not intended to be incorporated by reference into this Annual Report or in any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only. Although we reference the availability of our U.S. Federal Employment Information Report (EEO-1) on our website, our EEO-1 and any other materials on our website are not incorporated by reference into this Annual Report or any of our other filings under the Securities Act of 1933, as amended, or the Exchange Act. While matters discussed in such EEO-1, other website materials and our X and other social media accounts may be significant, any significance should not be read as necessarily rising to the level of materiality used for the purposes of our compliance with the U.S. federal securities law, even if we use the word “material” or “materiality” in such materials.\nThe SEC maintains an internet website that contains reports, proxy and information statements, and other information regarding Hologic and other issuers that file electronically with the SEC. The SEC’s internet website address is \nwww.sec.gov\n.\nProposed Merger\nOn October 21, 2025, the Company entered into a definitive agreement to be acquired by funds managed by Blackstone Inc. (“Blackstone”) and TPG Capital (“TPG”). Under the terms of the agreement, Blackstone and TPG will acquire all outstanding Hologic shares for $76.00 per share in cash, without interest, plus a non-tradable contingent value right (“CVR”) to receive up to $3.00 per share in cash, for total potential consideration of $79.00 per share in cash. The non-tradable CVR will be issued to Hologic stockholders at closing and paid, in whole or in part, following achievement of certain global revenue metrics for our Breast Health business in fiscal years 2026 and 2027. The transaction is expected to close in the first half of calendar year 2026, subject to the approval of Hologic’s stockholders, the receipt of required regulatory approvals and the satisfaction of certain other customary closing conditions. Please see Note 2 to our consolidated financial statements for additional information related to the acquisition. For additional information on risks relating to the transaction, please refer to the “Risk Factors” in Part I, Item 1A, of this Form 10-K.\nProducts\nWe view our operations and manage our current business in four principal reporting segments: Diagnostics, Breast Health, GYN Surgical and Skeletal Health. Financial information concerning these segments is provided in Note 16 to our audited consolidated financial statements contained in Item 15 of this Annual Report. The following describes our principal products in each of our segments.\nDiagnostics Product Offerings\nMolecular Diagnostic Instrumentation\nWe have developed and continue to develop instrumentation and software designed specifically for use with certain of our molecular diagnostic assays. We also provide technical support and service to maintain these instrument systems in the field. By placing our proprietary instrumentation in laboratories and hospitals, we can establish a platform for future sales of our assays.\nOur instrumentation includes the Panther instrument system, an integrated, fully automated testing instrument capable of serving high-, medium- and low-volume laboratories. Our Panther Fusion system, including the related Fusion assays for respiratory infections, Group B Strep (GBS), and transplant testing, extends the capabilities of our Panther system by adding the flexibility of polymerase chain reaction, or PCR, functionality to our existing Transcription-Mediated Amplification, or TMA, \n6\nTable of Contents\nbased technology. The Panther Fusion system is available as a modular in-lab upgrade to our base Panther system. In addition, our instrumentation also includes the Tomcat instrument, a fully automated general-purpose instrument designed to improve pre-analytical sample processing by eliminating the inefficient and error-prone activities associated with manually transferring samples from one tube to another.\nMolecular Diagnostic Assay Portfolio\nWe have a broad menu of assays available for sale in our primary markets that can be performed on the base Panther system or on the combined Panther Fusion system as indicated in the table below. Our Aptima family of molecular diagnostic assays integrates a number of proprietary core technologies, including our target capture technology, our TMA technology, and our hybridization protection assay, or HPA, and dual kinetic assay, or DKA, technologies, to produce highly sensitive amplification assays. Each of these technologies is described in greater detail below under the heading “\nProprietary Core Technologies\n”. Our Panther Fusion family of molecular diagnostic assays are performed on the Panther Fusion system and utilize PCR technology to amplify target nucleic acid sequences for easier detection.\nUnless otherwise noted, the assays shown in the table below have been approved or cleared for sale in the U.S. and are available for sale in countries recognizing the CE-mark. Certain of the assays shown below are also available in certain other markets such as Australia, Canada, China, Japan, New Zealand, South Korea and the United Kingdom.\nAptima-branded assays that are performed on the base Panther system\nPanther Fusion-branded assays that are performed on the Panther Fusion system\nAptima HPV assay\nPanther Fusion Flu A/B/RSV assay\nAptima HPV 16 18/45 Genotype assay\nPanther Fusion Paraflu assay\nAptima HBV Quant assay\nPanther Fusion AdV/hMPV/RV assay\nAptima CMV Quant assay\nPanther Fusion SARS-CoV-2/Flu A/B/RSV assay\nAptima HIV-1 Quant Dx assay\nPanther Fusion GBS assay\nAptima HCV Quant Dx assay\nPanther Fusion MRSA assay\n2\nAptima Mycoplasma genitalium assay\nPanther Fusion Bordetella assay\n2\nAptima Combo 2 assay (CT/NG)\nPanther Fusion EBV Quant assay\n2\nAptima Chlamydia trachomatis assay (CT)\nPanther Fusion BKV Quant assay\n2\nAptima Neisseria gonorrhoeae (NG)\nPanther Fusion SARS-CoV-2 assay\n1,3\nAptima Trichomonas vaginalis assay\nPanther Fusion GI Bacterial assay\nAptima HSV 1 and 2 assay\nPanther Fusion GI Extended Bacterial assay\nAptima CV/TV assay\nAptima BV assay\nAptima Zika assay\n1\nAptima SARS-CoV-2 assay\nAptima SARS-CoV-2/Flu assay\n1\n1\n This assay is subject to an Emergency Use Authorization (EUA) in the U.S. that may be revoked upon notice by the Food and Drug Administration (FDA).\n2\n This assay is available for sale in countries recognizing the CE-mark, and is not currently available for sale in the U.S.\n3\n This assay is not currently available for sale in countries recognizing the CE-mark.\nProprietary Core Technologies\nTarget Capture/Nucleic Acid Extraction Technology\n. The detection of target organisms that are present in small numbers in a large-volume clinical sample requires that target organisms be concentrated to a detectable level. One way to accomplish this is to isolate the particular nucleic acid of interest by binding it to a solid support. This support, with the target bound to it, can then be separated from the original sample. We refer to such techniques as “target capture.” We have developed target capture techniques to immobilize nucleic acids on magnetic beads by using a “capture probe” that binds to the bead and to the target nucleic acid. We use magnetic separation to concentrate the target by drawing the magnetic beads to the sides of a sample tube, while the remainder of the sample is removed from the tube. When used in conjunction with our amplification procedures, target capture techniques concentrate the nucleic acid target(s) and also remove materials in the sample that might otherwise interfere with amplification.\n7\nTable of Contents\nTranscription-Mediated Amplification (TMA) Technology\n. The goal of amplification technologies is to increase the copy number of a target nucleic acid sequence that may be present in samples in small numbers. These copies can then be detected using nucleic acid probes. Amplification technologies can yield results in only a few hours versus the several days or weeks required for traditional culture methods. TMA is a transcription-based amplification system that uses two different enzymes to drive the process. The first enzyme is a reverse transcriptase that creates a double-stranded DNA copy from an RNA or DNA template. The second enzyme, an RNA polymerase, makes thousands of copies of the complementary RNA sequence, known as the “RNA amplicon,” from the double-stranded DNA template. Each RNA amplicon serves as a new target for the reverse transcriptase, and the process repeats automatically, resulting in an exponential amplification of the original target that can produce over a billion copies of the RNA amplicon in less than thirty minutes.\nHybridization Protection Assay (HPA) and Dual Kinetic Assay (DKA) Technologies. \nWith our HPA technology, we have simplified testing, further increased test sensitivity and specificity, and increased convenience. In the HPA process, the acridinium ester, or AE, molecule is protected within the double-stranded helix that is formed when the probe binds to its specific target. Prior to activating the AE molecule, known as “lighting off,” a chemical is added that destroys the AE molecule on any unhybridized probes, leaving the label on the hybridized probes largely unaffected. When the “lighting off” or detection reagent is added to the specimen, only the label attached to the hybridized probe is left to produce a signal indicating that the target organism’s DNA or RNA is present. All of these steps occur in a single tube and without any wash steps, which were required as part of conventional probe tests. Our DKA technology uses two types of AE molecules that can be differentiated from each other — one that “flashes” and another one that “glows.” By using DKA technology, we have created nucleic acid test, or NAT, assays that can detect two separate targets simultaneously.\nThinPrep System\nThe ThinPrep System is the most widely used system for cervical cancer screening in the U.S. The ThinPrep System has multiple configurations, including one or more of the following: the ThinPrep 2000 Processor, ThinPrep 5000 Processor, ThinPrep 5000 Processor with Autoloader, ThinPrep Genesis Processor, ThinPrep Imaging System, ThinPrep Integrated Imager, and related reagents, filters and other supplies, such as the ThinPrep Pap Test and our ThinPrep PreservCyt Solution.\nThe ThinPrep Process. \nThe ThinPrep process begins with the patient’s cervical sample being obtained by the physician using a cervical sampling device that, rather than being smeared on a microscope slide as in a conventional Pap smear, is inserted into a vial filled with our proprietary ThinPrep PreservCyt Solution. This enables most of the patient’s cell samples to be preserved before the cells can be damaged by air drying. The ThinPrep specimen vial is then labeled and sent to a laboratory equipped with a ThinPrep Processor for slide preparation. At the laboratory, the ThinPrep specimen vial is inserted into a ThinPrep Processor, a proprietary sample preparation device, which automates the process of preparing cervical slides for staining and microscopic examination. Additionally, an aliquot used for subsequent molecular testing can be produced using the ThinPrep Genesis Processor.\nIn the case of manual screening, the cytotechnologist screens each Pap test slide with a microscope to first determine the adequacy of the slide and then to examine the entire slide to differentiate diseased or abnormal cells from normal cells. With the ThinPrep Imaging Systems, the screening process has been automated to combine the power of computer imaging technology with human interpretive skills. Prior to human review, the ThinPrep Imaging Systems rapidly scan, locate and highlight areas of interest for review. By directing the cytotechnologist to areas of interest on a slide, these systems may increase a cytology laboratory’s screening productivity and diagnostic accuracy. \nAdditional Applications.\n In addition to serving as a replacement for the conventional Pap smear, the ThinPrep System can also be used for non-gynecological cytology screening applications including fine-needle aspiration specimens (e.g., breast, thyroid, lung or liver), body fluids (e.g., urine, pleural fluid, ascitic fluid or pericardial fluid), respiratory specimens (e.g., sputum or brushing of respiratory tracts) and ancillary testing (e.g., cell blocks, immunocytochemistry or special stains).\nGenius Digital Diagnostics System\nThe Genius Digital Diagnostics System with the Genius Cervical AI Algorithm is the first CE-marked and FDA-cleared digital cytology platform to combine a new artificial intelligence, or AI, algorithm with advanced volumetric imaging technology to help cytotechnologists and pathologists identify pre-cancerous lesions and cervical cancer cells in women. The Genius Digital Diagnostics System consists of an advanced digital imager featuring volumetric imaging technology, a secure image management server to store images, a deep learning-based AI algorithm that is designed to assist healthcare providers in detecting pre-cancerous lesions and cervical cancer cells, and a high-resolution review station for local or remote case review. The Genius Digital Diagnostics System can rapidly analyze all cells on a ThinPrep Pap test digital image, narrowing tens of thousands of cells down to an AI-generated gallery of images that have been selected as the most diagnostically relevant images, which gives healthcare providers additional critical information to help guide earlier detection and make better treatment decisions for patients. The Genius Digital Diagnostics System was CE-marked for diagnostic use in the EU in \n8\nTable of Contents\nNovember 2020 and received marketing clearance from the FDA for diagnostic use in the U.S. in January 2024.\nRapid Fetal Fibronectin Test\nThe Rapid Fetal Fibronectin Test, or Rapid fFN Test, is a single-use disposable test used to determine a woman’s risk of pre-term birth by detecting the presence of a specific protein, fetal fibronectin, in vaginal secretions during pregnancy. The test utilizes a single-use, disposable cassette and is analyzed on our instrument, the TLi IQ system.\nOncology Product Offerings\n Our Biotheranostics business offers two proprietary laboratory developed tests, or LDTs, that support physicians in the treatment of cancer: the Breast Cancer Index test and the CancerTYPE ID test. The Breast Cancer Index, or BCI, test is a PCR-based gene expression test used for determining which patients with early-stage, hormone-receptor positive, or HR+, breast cancer are likely to benefit from extended endocrine therapy. In January 2021, the National Comprehensive Cancer Network revised its clinical practice guidelines to include the BCI test as the only gene expression assay to predict benefit from extended endocrine therapy for patients with early-stage HR+ breast cancer. In addition, in April 2022 the American Society of Clinical Oncology updated its clinical practice guidelines, which now include the BCI test as the only genomic test to help guide extended endocrine therapy decisions in early-stage, HR+ breast cancer patients. The CancerTYPE ID test is a PCR-based gene expression test that is designed to identify the source of metastatic cancer in order to improve diagnostic accuracy and inform treatment decisions. Both of these LDTs are offered as a service solely out of Biotheranostics’ licensed, CLIA-certified, CAP-accredited laboratory in San Diego, California. \nBreast Health Products\nMammography Solutions\nOur Dimensions platform includes the Selenia Dimensions and 3Dimensions systems capable of performing full field digital mammography (2D) and digital breast tomosynthesis (3D) exams. When performing a 3D exam, each system acquires a series of low dose x-ray images taken in a scanning motion at various angles. The images are mathematically reconstructed into a series of small contiguous slices, allowing for visualization of the breast tissue through multiple layers. Our clinical results for FDA approval demonstrated that full field digital mammography (2D) with the addition of our 3D Mammography is superior to 2D digital mammography alone for both screening and diagnostics. Hologic Clarity HD technology provides our highest resolution imaging at 70 micron pixel size compared to the standard resolution technology of 100 micron pixel size. Our C-View and Intelligent 2D software products generate 2D images that are mathematically synthesized from the tomosynthesis data. These software products are FDA approved to replace full field digital mammography (2D) images within a 3D exam. Synthesized 2D images eliminate the need for additional 2D exposure, reducing breast compression time and radiation exposure compared to a “combo” exam, which includes a tomosynthesis (3D) exam and a full field digital mammography (2D) exam. \nOur 3DQuorum technology is an artificial intelligence, or AI, powered algorithm that expedites mammography exam reading time without compromising image quality, sensitivity or accuracy. The 3DQuorum technology uniquely reconstructs Hologic Clarity HD 3D data to produce 6 mm “SmartSlices.” By utilizing 3DQuorum technology the number of 3D images to review is reduced by two-thirds, saving an estimated average of one hour per eight hours of daily image interpretation time. The 3DQuorum technology also reduces the typical Hologic Clarity HD and Intelligent 2D study size by approximately 50%, bringing the storage space and network impact back down to that of standard resolution 3D imaging. \nThe images captured by digital mammography systems are typically transmitted electronically for review by a radiologist at a reading workstation. To address this process, we offer the SecurView DX workstation approved for interpretation of mammograms as well as images from other diagnostic breast modalities including breast ultrasound and breast MRI. We also offer image analytic products such as the Genius AI Detection solution, including PRO, (Hologic’s artificial intelligence cancer detection algorithm utilizing deep-learning technology for tomosynthesis), ImageChecker CAD-solution (provides markings of suspicious areas of the breast that may be cancerous in 2D exams), and Quantra software (automates breast density measurement for our mammography systems). These technologies provide reviewers with the potential to focus on key patients that might otherwise be overlooked during the review process for additional diagnostic workups, thus potentially increasing cancer detection.\nStereotactic Breast Biopsy Systems\nWe provide clinicians flexibility by offering two minimally invasive stereotactic breast biopsy guidance systems: the Affirm prone and the Affirm upright breast biopsy guidance systems. The Affirm upright biopsy system is an attachment designed to integrate with our Dimensions systems, transforming it into a versatile tool for both screening and tomosynthesis biopsy. The Affirm prone biopsy system is a dedicated prone stereotactic biopsy system capable of both 2D and tomosynthesis-guided procedures. These systems provide an alternative to open surgical biopsy and can be performed as an outpatient procedure under local anesthesia, allowing shorter recovery times. The Affirm tomosynthesis option provides faster lesion \n9\nTable of Contents\ntargeting and reduced patient procedure time compared to traditional stereotactic biopsy procedures. The Affirm system is pre-programmed for use with our Brevera, Eviva and ATEC vacuum-assisted breast biopsy devices.\nBreast Biopsy and Surgery Products\nWe offer a wide range of minimally invasive products for breast biopsy and breast surgery. Our breast biopsy portfolio includes three types of tethered vacuum-assisted breast biopsy products: Brevera, ATEC, and Eviva devices. Each tethered device is powered by a console and utilizes our fluid management system. The ATEC device can be used under all standard imaging guidance modalities (stereotactic x-ray, ultrasound, MRI and molecular breast imaging) whereas our Brevera and Eviva devices are used exclusively under stereotactic x-ray guidance. We also offer non-tethered, spring-loaded, and vacuum-assisted core biopsy devices, such as the Celero and Sertera devices, which are exclusively used under ultrasound guidance. We also have products for surgical site marking, tissue localization, and sentinel lymph node biopsies, as well as specimen imaging products for radiology, surgery and pathology. The addition of products from the Endomagnetics Ltd (Endomag) acquisition in fiscal 2024 complements and diversifies our expanding interventional breast health portfolio by adding wire-free breast surgery localization and lymphatic tracing solutions, including Magseed marker, Magtrace lymphatic tracer and the Sentimag platform, to Hologic’s breast surgery portfolio, providing breast surgeons and radiologists with an expanded range of options and enhanced user experience.\nGYN Surgical Products\nMyoSure\nThe MyoSure system is designed to provide efficient and effective hysteroscopic removal of tissue within the uterus, including fibroids and polyps. Removal of fibroids can provide effective relief from heavy menstrual bleeding commonly attributed to such pathology. Unlike other methods of tissue removal, the excavated tissue samples remain intact, which allows them to be tested for abnormalities. The MyoSure system consists of a tissue removal device, control unit, and hysteroscope. The MyoSure tissue removal device is single-use and features simultaneous tissue cutting and removal. The device incorporates a rapidly rotating and reciprocating cutting blade. During the procedure, the tissue removal device is inserted through the Omni hysteroscope. This tissue removal device is powered by a control unit, which features a simple user interface and is foot pedal activated. We offer multiple handpiece devices that differ in size and are focused on addressing visualized tissue sampling and different pathology types.\nNovaSure\nThe NovaSure endometrial ablation system allows physicians to treat women suffering from abnormal uterine bleeding. The system features Smart-Depth technology that continuously monitors and measures tissue impedance to provide a more customized, reliable and reproducible depth of ablation for every patient. The NovaSure system consists of a disposable device and a controller that delivers radiofrequency energy (heat) to ablate the endometrial lining of the uterus in order to eliminate or reduce the patient’s abnormal bleeding. The NovaSure disposable device is a hand-held, single-use device that incorporates a flexible gold-plated mesh electrode used to deliver the radiofrequency energy to the endometrial tissue. The NovaSure ADVANCED and NovaSure V5 devices have a slim diameter designed to improve patient comfort and physician ease-of-use while maintaining the clinical efficacy of the NovaSure system.\nFluent Fluid Management System\nOur Fluent fluid management portfolio can be utilized for diagnostic and operative hysteroscopic procedures, including MyoSure tissue removal. Both the Fluent and Fluent Pro systems feature an intuitive touch screen design, innovative FloPak cartridge design, and a single waste bag design that eliminates the need for multiple canisters. Therefore, the Fluent and Fluent Pro systems are designed for simplified setup and operation and streamlined workflow for the operating room team.\nSonata System\nThe Sonata system, which was acquired in the Gynesonics, Inc. acquisition in fiscal 2025, is used by a gynecologic surgeon to treat symptomatic uterine fibroids, including those that cause heavy menstrual bleeding. It employs intrauterine ultrasound imaging to locate the fibroids and transcervical radiofrequency ablation to cause coagulative necrosis of the fibroid tissue. Over time, the treated tissue softens and shrinks resolving symptoms without more invasive treatment. The Sonata system combines an intrauterine ultrasound probe with a radiofrequency ablation (RFA) handpiece to locate and treat the fibroids without the need for incisions.\nAcessa ProVu System\n10\nTable of Contents\nThe Acessa ProVu system is used by laparoscopic surgeons to treat fibroids using controlled radiofrequency energy to cause coagulative necrosis. The treated tissue softens and shrinks over time, allowing fibroid symptoms to resolve without more invasive treatment. The Acessa system includes an ultrasound probe to locate the fibroids, guidance mapping that provides visual cues, and a percutaneous handpiece that deploys radiofrequency energy.\nAdvanced Energy and Surgical Stapling\nThe CoolSeal vessel sealing suite and JustRight surgical stapler bolster our laparoscopic surgical offerings with advanced vessel sealing, dividing, dissection, and stapling tools. The CoolSeal Trinity and CoolSeal Reveal devices allow for dissection, vessel sealing and dividing all in one tool. The ability to use a combination device improves surgical efficiency by reducing the need for instrument exchanges. In addition, the CoolSeal Mini 3 mm sealer and the JustRight 5 mm stapler are designed for small surgical spaces such as in pediatric cases, which can help reduce the need for larger, overpowered instruments. \nSkeletal Health Products\nHorizon DXA Systems\nBone densitometry is the measurement of bone density to assist in the diagnosis and monitoring of osteoporosis and other metabolic bone diseases that can lead to frailty and debilitating bone fractures. Osteoporosis is a disease that is most prevalent in post-menopausal women. Our Horizon line of x-ray bone densitometers incorporates advanced features designed for bone health screening and body composition assessment. Body composition assessment is the precise measurement of bone, lean mass, and fat mass within the body. These measurements provide value in diverse settings, from clinical cancer care, obesity and diabetes medicine, and preventative healthcare, to athletic performance. \nFluoroscan Insight FD\nOur Fluoroscan Insight FD is a mini C-arm imaging system that provides low intensity, real-time x-ray imaging, with high-resolution images at radiation levels and at a cost below those of conventional x-ray and standard sized fluoroscopic equipment. Mini C-arm systems are used primarily by orthopedic surgeons to assist in performing minimally invasive surgical procedures on a patient’s extremities, such as the hand, wrist, knee, foot and ankle. Effective in fiscal 2026, we are discontinuing the sale of this system.\nMarketing, Sales and Service\nWe sell and service our products through a combination of direct sales and service forces and a network of independent distributors and sales representatives. In fiscal 2025, 2024, and 2023, no customer accounted for more than 10% of our consolidated revenues.\nOur U.S. sales force is structured to specifically target the customers in each of our business segments. We maintain distinct teams focused on the Diagnostics, Breast Health, GYN Surgical, and Skeletal Health markets. Our end customers include clinical laboratories, hospitals, healthcare providers and surgeons in both hospital and office settings, and we target various specialists at healthcare entities who use our products, such as ob-gyns, radiologists and breast surgeons. \nA critical element of our strategy in the U.S. for our Diagnostics, Breast Health, GYN Surgical, and Skeletal Health divisions has been to utilize the results of our clinical trials and expanded FDA labeling to demonstrate safety, efficacy and productivity improvements to our target customers. Our U.S. sales efforts also include the use of national account managers focused on executing purchasing contracts with large purchasing entities, such as managed care organizations, integrated delivery networks and government healthcare facilities. In addition, in certain regions of the U.S., we use a limited number of independent dealers or distributors to sell and service certain of our products. Internationally, our products in all divisions are marketed and sold through a combination of our direct sales force (primarily Western Europe, China, Japan, Australia, South Korea and Canada) and a network of distributors.\nOur service organization is responsible for installing our products and providing warranty and repair services, applications training and biomedical training. Products sold by our direct sales force typically carry limited warranties covering parts and labor for twelve months. Products sold through dealers also carry limited warranties that are typically for one year and cover only parts and components. We also offer service contracts that generally cover equipment and maintenance after the original warranty period from one to three years. We provide both repair services and routine maintenance services under these arrangements and also offer repair and maintenance services on a time and materials basis to customers that do not have service contracts. Our Breast Health business generates a majority of our service revenue from service contracts for our digital mammography portfolio. Internationally, generally in locations where we sell directly, we also perform maintenance services for our products, and in other geographies we primarily use distributors, sales representatives and third parties to provide maintenance services for our products.\n11\nTable of Contents\nCompetition\nThe healthcare industry is highly competitive and characterized by continual change and improvements in technology. This is particularly the case in the market segments in which we operate. A number of companies have developed or are expected to develop products that compete or will compete with our products. Many of these competitors offer a broader product portfolio and have greater brand recognition than we do, which may make these competitors more attractive to hospitals, radiology clients, group purchasing organizations, laboratories, physicians and other potential customers. Competitors may develop superior products or products of similar quality for sale at the same or lower prices. Moreover, our products could be rendered obsolete by changes to industry standards or guidelines or advances in technology. We can give no assurance that we will be able to compete successfully with existing or new competitors. \nIn the current environment of managed care, economically motivated buyers, consolidation among healthcare providers, increased competition and declining reimbursement rates, we have been increasingly required to compete on the basis of price, value, reliability and efficiency. We believe the current global economic conditions and healthcare reform measures are putting additional competitive pressure on us, including on our average selling prices, overall procedure rates and market sizes.\nAs a provider of women’s health products and solutions designed to detect, diagnose and treat diseases across the care continuum, we encounter significant competition across our product lines in each of the market segments in which we operate. Most competition comes from larger companies that have greater financial, sales and marketing resources than we do in large markets like diagnostics, imaging and surgery.\nIn our Diagnostics business, our primary competitors include Roche Diagnostics, Abbott Laboratories and Cepheid in the molecular diagnostics field, and Becton Dickinson in the cytology field, as well as a wide range of diagnostics companies that sell a single or limited number of assays or products in only a specific market segment (i.e., Cytology, Acute Care, or Oncology Services).\nIn our Breast & Skeletal Health business, our primary competitors are large imaging companies such as Siemens Healthineers and GE Healthcare, as well as a wide range of medical technology companies that sell a subset of technology solutions into a specific market segment (i.e., Breast Biopsy, Breast Surgery). \nIn our GYN Surgical business, our primary competitors are large, full suite surgical solutions companies such as Johnson & Johnson and Medtronic, as well as a wide range of single technology or solutions companies that sell into a specific market segment or procedure. In addition, we also compete with alternative treatments to our GYN Surgical products, such as drug therapy, intrauterine devices, hysterectomy, dilation and curettage and rollerball ablation. Because drug therapy is an alternative to certain of our procedures, competitors also include many major pharmaceutical companies that manufacture hormonal drugs for women.\nIn addition, our International team faces significant global and regional competition across our entire portfolio, with local competition also playing a role in countries where local suppliers may be advantaged. We also face competition from non-medical technology or diagnostics companies, which may offer alternative tests or therapies for illnesses and other health conditions that could also be detected, diagnosed or treated by our products and solutions, or from companies offering technologies that could augment, precede or replace procedures using our products.\nWe believe that the success of our products depends on our ability to differentiate ourselves and to demonstrate that our products deliver the clinical and operational attributes that are most important and cost-effective to customers. These attributes include, but are not limited to, superiority in efficacy, ease of use, reliability, accuracy, quality and cost. We believe our continued success depends in large part upon our ability to invest in product enhancements and technologies that will help us distinguish ourselves from our competitors.\nManufacturing\nWe purchase many of the components, subassemblies, and raw materials used in our products from numerous suppliers worldwide. For reasons of quality assurance, scarcity and/or cost effectiveness, certain components, subassemblies, and raw materials used in our products are available only from one or a limited number of suppliers. We work closely with our suppliers to develop contingency plans to ensure continuity of quality and reliable supply. We have established long-term supply contracts with many of our suppliers, and in other instances, we developed an in-house capability to offset potential shortages caused by sole source suppliers. Due to the high standards and FDA requirements applicable to manufacturing our products, such as the FDA’s Quality System Regulation and Good Manufacturing Practices, we may not be able to quickly establish additional or replacement sources for certain components or materials. In the event we are unable to obtain sufficient quantities of raw materials or components or subassemblies on commercially reasonable terms or in a timely manner, our ability to manufacture our products on a timely and cost-competitive basis may be compromised, which may have a material adverse effect on our business, financial condition and results of operations. \n12\nTable of Contents\nOur current supplier of certain key raw materials for certain of our amplified NAT diagnostic assays is Roche, a direct competitor of our Diagnostics business.\nWe have sole source third-party contract manufacturers for each of our molecular diagnostics instrument product lines and for our Skeletal Health products. Stratec SE, or Stratec, is the only manufacturer of the Panther and Panther Fusion instruments; and Flextronics Medical Sales and Marketing, LTD, or Flextronics, is the only manufacturer of our Skeletal Health finished goods products. We are dependent on these sole source third-party manufacturers, and this dependence exposes us to increased risks associated with production delays, delivery schedules, manufacturing capability, quality control, quality assurance and costs. We have no firm long-term volume commitments with either Stratec or Flextronics. If Stratec, Flextronics or any of our other third-party manufacturers experiences delays, disruptions, capacity constraints or quality control problems in its development or manufacturing operations, curtails operations or otherwise fails to supply us with products in sufficient quantities, instrument and equipment shipments to our customers could be delayed or cancelled, which would decrease our revenues and may harm our competitive position and reputation. Further, because we place orders with our manufacturers based on forecasts of expected demand for our molecular diagnostics instruments and Skeletal Health products, if we inaccurately forecast demand, we may be unable to obtain adequate manufacturing capacity or adequate quantities of components to meet our customers’ delivery requirements.\nWe, and our contract manufacturers, manufacture our products at a limited number of different facilities located in the U.S. and throughout the world. In most cases, the manufacturing of each of our products is concentrated in one or a few locations. An interruption in manufacturing capabilities at any of these facilities, as a result of equipment failure or other reasons, could reduce, delay or prevent the production of our products. Some of our manufacturing operations are located outside of the U.S., primarily Costa Rica and England. We announced in the fourth quarter of fiscal 2025 that we will be shutting down our Manchester, England facility, which manufactures certain Molecular Diagnostic assays, and transferring production to our San Diego, California facility. The shut-down is expected to be completed in the first half of calendar 2026. Those manufacturing operations are also subject to additional challenges and risks associated with international operations described under the caption “Risk Factors” set forth in Part I, Item 1A of this Annual Report.\nFrom time to time new regulations are enacted that can affect the content and manufacturing of our products. We evaluate the steps for compliance with regulations as they are enacted. For example, as a U.S. public company, we are subject to rules requiring disclosures of the source of specified minerals, known as conflict minerals, which are necessary to the functionality or production of products manufactured or contracted to be manufactured by us. Since our supply chain is complex, we may not be able to sufficiently verify the origins of the relevant minerals used in our products through the due diligence procedures that we implement, which may harm our reputation. In addition, we may encounter challenges to satisfy those customers who require that all of the components of our products be certified as conflict-free, which could place us at a competitive disadvantage if we are unable to do so.\nOur operations are subject to numerous environmental laws regulating hazardous materials in products and chemical usage. We maintain a chemical compliance program that includes policies, standards, systems and staff dedicated to overseeing and maintaining compliance with these requirements. We also have processes and systems to support compliance with the European Union (“EU”) Restriction of Hazardous Substances (“RoHS”) and Waste Electrical and Electronic Equipment (“WEEE”) Directives; the China Administrative, the China Administrative Measures for the Restriction of Hazardous Substances in Electrical and Electronic Products (“China RoHS”) regulation; the EU Registration, Evaluation, Authorization and Restriction of Chemicals (“REACH”) regulation; EU Medical Device Regulation (“MDR”); EU In Vitro Diagnostic Medical Devices Regulation (“IVDR”), and similar global and state laws that restrict chemical substances.\n \nAny failure to comply with applicable environmental laws, regulations, and contractual obligations could increase product production lead times, increase costs due to fines and could negatively affect our competitive position and brand.\nResearch and Development\nThe markets in which we participate are characterized by rapid technological change, frequent product introductions and evolving customer requirements. Investment in research and development is critical to driving our future growth. Our research and development efforts are focused on the further development and improvement of our existing products, the design and development of new innovative medical technologies and regulatory compliance across all our business segments.\nIn addition to product development, our research and development personnel play an active role in the review of product specifications, clinical protocols and FDA submissions, as well as ensuring that certain of our products conform to European health, safety and environmental requirements, or CE-marking. \nPatents and Proprietary Rights\n13\nTable of Contents\nWe rely primarily on a combination of trade secrets, patents, copyrights, trademarks and confidentiality procedures to protect our products and technology. Due to the rapid technological changes that characterize the markets we operate in, we believe that trade secrets and other unpatented know-how relied upon in connection with the development of new products and the enhancement of existing products are generally as important as patent protection in establishing and maintaining a competitive advantage. Nevertheless, we have obtained patents and will continue to make efforts to obtain patents, when available, in connection with our product development programs. We do not consider our business to be materially dependent upon any individual patent.\nWe own numerous U.S. patents and have applied for numerous additional U.S. patents relating to our technologies. We also own or have applied for corresponding patents in selected foreign countries. These patents relate to various aspects of most of our products. We do not know if current or future patent applications will be issued with the full scope of the claims sought, if at all, or whether any patents issued will be challenged or invalidated. There is a risk that our patent applications will not result in granted patents or that granted patents will not provide significant protection for our products and technology. Third parties may infringe, misappropriate or otherwise violate our intellectual property rights, or copy or reverse engineer portions of our technology. Our competitors may independently develop similar or superior technology that our patents do not cover. In addition, because patent applications in the U.S. are not generally publicly disclosed until eighteen months after the application is filed, unpublished applications may have been filed by third parties that relate to our technology. Moreover, there is a risk that foreign intellectual property laws will not protect our intellectual property rights to the same extent as intellectual property laws in the U.S. The rights provided by a patent are finite in time. Over the coming years, certain patents relating to current products will expire in the U.S. and abroad which may allow third parties to exploit those technologies. In the absence of significant patent protection, we may be vulnerable to competitors who attempt to copy our products, processes or technology.\nIn addition to the patents we have been issued or we have acquired, we license patents from others on a variety of terms and conditions.\nWe are engaged in intellectual property litigation, and we may be notified in the future of claims that we may be infringing, misappropriating or otherwise violating the intellectual property rights of third parties. In connection with any such claims, we may seek to enter into settlement and/or licensing arrangements. There is a risk in these situations that no license will be available or that a license will not be available on reasonable terms. Alternatively, we may decide or be required to litigate such claims. A successful claim against us may require us to remove the alleged infringing product from the market or to design around the third party’s patent, potentially resulting in less market demand for the product. Additionally, we may initiate litigation against third parties who are infringing our intellectual property. There is a risk in these situations that we will not obtain injunctive relief or receive damages sufficient to compensate for lost sales and the costs of the litigation.\nRegulatory\nThe manufacture, sale, lease and service of medical devices and in vitro diagnostics (IVDs) intended for commercial use are subject to extensive governmental regulation by the FDA in the U.S. and by a variety of regulatory agencies globally. Under the Federal Food, Drug and Cosmetic Act, known as the FD&C Act, manufacturers of medical devices must comply with certain regulations governing the design, testing, manufacturing, packaging, distribution, servicing and marketing. Some of our products are also subject to the Radiation Control for Health and Safety Act, administered by the FDA, which imposes performance standards and record keeping, reporting, product testing and product labeling requirements for devices that emit radiation, such as x-rays. FDA product approvals may be withdrawn or suspended if compliance with regulatory standards is not maintained or if problems occur following initial marketing. \nThe FDA classifies medical devices into three classes based on risk. Regulatory control increases from Class I (lowest risk) to Class III (highest risk). The FDA generally must clear or approve new medical devices in Classes II and III prior to commercial sales. Our Class I and Class II exempt medical devices must follow Hologic’s internal Quality System processes prior to commercialization and throughout their product lifecycle. We must meet requirements under FDA’s quality system regulation (QSR), establishment registration, medical device listing, labeling and medical device reporting (MDR) regulations.\nA 510(k) pre-market notification must contain information establishing that the device to be sold is substantially equivalent (SE) to a predicate device. A predicate is a device that was legally marketed prior to May 28, 1976 (preamendments device), or a device which has been found SE through the 510(k) process, or a device that was granted marketing authorization via the De Novo classification process under section 513(f)(2) of the FD&C Act that is not exempt from premarket notification requirements. Class III or high-risk device development requiring a premarket approval (“PMA”) involves a complex and lengthy testing process that is subject to review by the FDA and may require several years to complete and gain approval. In addition to bench and non-clinical testing, an investigational device exemption (for significant risk devices), known as an IDE, must be obtained in order to conduct clinical testing of the device to obtain the necessary clinical data for inclusion in the PMA. The FDA will approve a PMA if the data provided is sufficient and contains valid scientific evidence to assure that the device is \n14\nTable of Contents\nsafe and effective for its intended use(s). This approval may be granted with post-approval requirements including inspection of manufacturing facilities, additional clinical studies and/or additional patient follow-up for an indefinite period of time.\nOur Biotheranostics laboratory in San Diego, California is subject to regulation under the Clinical Laboratory Improvement Amendments of 1988, or CLIA, which is administered primarily by the Centers for Medicare and Medicaid (CMS). CLIA requires laboratories to meet specified standards in the areas of personnel qualifications, administration, participation in proficiency testing, patient test management, quality control, quality assurance and inspections. Adverse interpretations of current CLIA regulations or future changes in CLIA regulations could have an adverse effect on sales of services. The laboratory also holds a license from the state of California and licenses or permits as required from other state agencies where out-of-state clinical laboratories must be licensed to run samples obtained from their state. If a laboratory is non-compliant with CLIA requirements or with state laws or regulations governing licensed laboratories, penalties may include suspension, limitation or revocation of the license or CLIA certificate, assessment of financial penalties or fines, or imprisonment. Loss of a laboratory’s CLIA certificate or state license may also result in the inability to receive payments from state and federal health care programs as well as private third-party payors. \nWe are also subject to a variety of federal, state and foreign laws which broadly relate to our interactions with healthcare practitioners and other participants in the healthcare system, including, among others, the following:\n•\nanti-kickback and anti-bribery laws, such as the Foreign Corrupt Practices Act, or the FCPA, the U.K.’s Bribery Act 2010, or the U.K. Anti-Bribery Act;\n•\nlaws regulating the confidentiality of sensitive personal information and the circumstances under which such information may be released and/or collected, such as the Health Insurance Portability and Accountability Act of 1996, or HIPAA, the Health Information Technology for Economic and Clinical Health Act, or HITECH Act, and the European Union General Data Protection Regulation, or GDPR; and\n•\nhealthcare reform laws, such as the Patient Protection and Affordable Care Act and the Health Care and Education Affordability Reconciliation Act of 2010, which we refer to together as PPACA, which include new regulatory mandates and other measures designed to constrain medical costs, as well as stringent new reporting requirements of financial relationships between device manufacturers and physicians and teaching hospitals.\nIn addition, we are subject to numerous federal, state, foreign and local laws relating to safe working conditions, manufacturing practices, environmental protection, fire hazard control and disposal of hazardous or potentially hazardous substances, data privacy and protection among others. We may be required to incur significant costs to comply with these laws and regulations in the future and complying with these laws may result in a material adverse effect upon our business, financial condition and results of operations.\nOur medical devices and IVDs are subject to extensive regulation outside of the U.S. and approval or registration requirements vary significantly by country and region. To market and sell our products internationally, we must obtain and maintain regulatory authorizations, certifications, or registrations such as CE Marking in the European Union under the Medical Device or In Vitro Diagnostic Regulations, as well as country-specific approvals in markets such as Canada, Japan, China, and Latin America. These processes generally require the submission of technical documentation, clinical or performance data, evidence of compliance with quality management standards (i.e., ISO 13485), and periodic inspections or audits by regulatory authorities or notified bodies.\nThe time required to obtain approval to market and sell our products varies by country and region and may be longer or shorter than that required for FDA clearance or approval and the requirements may differ. In addition, we are required to meet the FDA’s export requirements or receive FDA export approval for the export of our products to foreign countries.\nMaintaining international market access requires ongoing compliance with evolving regulatory requirements, post market-surveillance, reporting obligations, and product life cycle management. Complying with global regulations has required us to, and may continue to require us to, incur significant expenditures. Failure to obtain or maintain necessary approvals or to comply with these obligations could restrict our ability to market products, delay commercialization of new technologies, or result in enforcement actions, penalties, or loss of market access.\nThe global regulatory environment continues to evolve, especially in the areas of cyber security and AI. We anticipate that regulators will continue to scrutinize the healthcare industry closely and that changes in laws, regulations or policies may cause increased uncertainty, compliance costs, exposure to litigation and other adverse effects to our business and operations. Delays in receipt of, or failure to obtain, clearances or approvals for future products could delay or preclude realization of product revenues from new products or result in substantial additional costs which could decrease our profitability.\n15\nTable of Contents\nFor additional information about the regulations to which our business is subject and the impact such regulations may have on our business, see the disclosures under the captions “Manufacturing” and “Reimbursement” in this Item 1, and “Risk Factors” in Item 1A below.\nReimbursement\nMarket acceptance of our medical products in the U.S. and other countries is dependent upon the purchasing and procurement practices of our customers and patient need for our products and procedures and, the coverage and reimbursement of patients’ medical expenses by government healthcare programs, private insurers or other healthcare payors. In the U.S., the Centers for Medicare & Medicaid Services, known as CMS, establishes coverage policies and payment rates for Medicare beneficiaries. CMS publishes payment rates for physician, hospital, laboratory and ambulatory surgical center services on an annual basis. Under current CMS policies and regulations, varying payment levels have been established for tests and procedures performed using our products. Coverage policies for Medicare patients may vary by regional Medicare contractor in the absence of a national coverage determination and payment rates for procedures may vary based on the geographic price index. Coverage policies and reimbursement rates for Medicaid patients are dependent on each state Medicaid plan and will vary. Coverage policies and reimbursement rates for patients with private insurance are dependent on state and federal requirements as well as individual private payor’s decisions. Moreover, private insurance carriers may choose not to follow the CMS coverage policies or payment rates. The use of our products outside of the U.S. is similarly affected by reimbursement policies adopted by foreign regulatory authorities and insurance carriers.\nHealthcare policy and payment reform proposals and medical cost containment measures are being adopted in the U.S. and in many foreign countries. The ability of our customers to obtain adequate reimbursement for our products and services from private and governmental third-party payors is critical to the success of medical technology companies because it may affect which products customers purchase and the prices they are willing to pay. Reimbursement and coverage vary by country and can significantly impact acceptance of new products and technologies. Even if we develop a promising new product, we may find limited demand for the product unless reimbursement approval and coverage is obtained from private and governmental third-party payors. Further, ongoing legislative or administrative reform to the reimbursement system in the U.S. and other countries may impact reimbursement for procedures using our medical products and/or limit coverage for those procedures facilitated by our products. This includes price regulation, competitive bidding and tendering, coverage and payment policies, comparative effectiveness of therapies, technology assessments and managed-care arrangements. These trends could have a material adverse effect on our business, financial condition or results of operations.\nHuman Capital\nWe view human capital management and the strength of our employees as integral to the long-term success of our business and the strengthening of our communities. We understand that we rely on our employees worldwide to propel our organization forward with great ideas, innovations and leadership. \nAs of September 27, 2025, we had 7,070 full-time employees, including 2,270 in manufacturing operations, 1,731 in sales and marketing, 1,472 in support services, 775 in research and development, and 822 in general administration. Approximately 4,055 of these employees are in the U.S. and approximately 3,015 were outside the U.S. In various countries outside the U.S., certain of our employees are unionized and, where local law requires, participate in works councils. \nEmployee Engagement and Development\nOur goal is to develop and maintain a talented and engaged workforce that has a positive impact on our performance, and on our customers and their patients. We have been conducting an annual engagement survey since 2015 in which most of our employees regularly participate, as well as two other annual workplace surveys since 2021 that engage our U.S. employees. We believe our foundation of employee engagement, our commitment to our employees, and their commitment to each other fortifies our leaders and teams and improves their business performance. We also offer a range of programs to develop our managers and enhance our leadership across the Company. Our professional development efforts are aimed at increasing organizational talent and capabilities and identifying and developing potential successors for key leadership positions. \nCompensation and Benefits\nOur compensation philosophy aims to attract and retain top talent for today and the future. To this end, we invest in the physical, emotional and financial well-being of our employees through our robust compensation and benefit programs. These programs (which vary by country/region) include a variety of health plan options, annual performance incentive opportunities, employee stock purchase plan, and retirement savings programs, paid time off (including for charitable actions), leave programs, employee assistance programs and other wellness offerings. \n16\nTable of Contents\nEqual pay for equal work is rooted in our values and foundational to fostering an inclusive environment. As such, we regularly review pay for internal equity, considering factors such as an employee’s role, experience, skills and performance, and aim to provide that our compensation structure is appropriate. We also engage outside counsel to evaluate compliance with pay equity laws. When we identify any potential differences in pay for whatever reason, we research those differences and act if appropriate. Employees are encouraged to share any pay equity concerns with management, Human Resources, or confidentially through our reporting hotline, including anonymously. Hologic has a non-retaliation policy for raising any workplace concerns, including around pay.\nHealth, Safety and Wellness\nWe seek to comply in letter and in spirit with applicable health and safety laws and regulations and implement programs, policies and procedures to achieve compliance throughout the Company. We also establish our own environmental health and safety standards in addition to those that are legally required. We employ management systems and procedures designed to protect human safety, health, and the environment. We seek to reduce risk and protect our employees and communities by employing safe technologies and operating procedures, and by maintaining a business continuity program to stay prepared for emergencies. We have also developed safety rules and procedures to address behaviors and work practices that can lead to accidents and injuries. Safety performance is assessed throughout the year by management and during annual performance reviews. \nIn addition, we have developed several employee-focused initiatives to support the physical, mental, and financial well-being of our employees. These initiatives include providing enhanced accident and critical illness insurance, access to telehealth services, developing an employee assistance program that provides mental health therapy, wellness coaching, and medication management, and offering subscriptions to self-care mobile apps.\nCommunity Engagement and Volunteerism\nWe take the role we play as leaders in the communities where we live and work seriously. Our philanthropic and charitable efforts are an important part of our culture and linked to our efforts to work to improve the health of our communities, customers, patients and employees, and seek to ensure that the decisions we make today have a positive effect on future generations. We center our giving efforts in three specific areas to maximize our impact in ways that align with the values of our employees and customers: (i) women’s health, and other healthcare fields in which Hologic operates; (ii) science, technology, engineering, and math education (STEM), especially for students from underserved communities; and (iii) promoting equity, especially in education and healthcare.\nWe also support employees in giving back to community organizations through volunteering and matching donations. To that end, we further expanded our support for local non-profit groups, by providing our U.S. colleagues an additional paid day off to engage in community service. We also have continued to strengthen our scholarship funds. The Hologic Scholarship Fund awards scholarships for employees’ children and grandchildren. We also support students near our largest U.S. facilities by providing scholarship funding to non-profit organizations that help students from underserved communities become the first in their family to attend college.\nSeasonality\nWorldwide sales, including U.S. sales, do not reflect any significant degree of seasonality; however, customer purchases of our GYN Surgical products have been historically lower in our second fiscal quarter compared to our other fiscal quarters. Our respiratory infectious disease product line (including our assays for the detection of SARS-CoV-2) within our Diagnostics segment is also subject to significant seasonal and year-over-year fluctuations. In addition, the summer months, which occur during our fourth fiscal quarter, typically have had lower order rates internationally for most of our products.\n17\nTable of Contents",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis should be read in conjunction with the Consolidated Financial Statements, the information described under the caption “Risk Factors” in Part I, Item 1A of this Annual Report and our Special Note Regarding Forward-Looking Statements at the outset of this Annual Report.\nOVERVIEW\nWe are a developer, manufacturer and supplier of premium diagnostics products, medical imaging systems, and surgical products focused on women’s health and well-being through early detection and treatment. We sell and service our products through a combination of direct sales and service personnel and a network of independent distributors and sales representatives. We operate in four segments: Diagnostics, Breast Health, GYN Surgical and Skeletal Health. \nThrough our Diagnostics segment, we offer a wide range of diagnostic products, which are used primarily to aid in the screening and diagnosis of human diseases. Our primary Diagnostics products include our molecular diagnostic assays, which run on our advanced instrumentation systems (Panther and Panther Fusion), our cytology systems, including the ThinPrep System and the Genius Digital Diagnostics System, and the Rapid fFN Test. Our Aptima family of molecular diagnostic assays is used to detect, among other things, the infectious microorganisms that cause common sexually transmitted diseases, or STDs, such as chlamydia and gonorrhea, or CT/NG; certain high-risk strains of human papillomavirus, or HPV;\n Trichomonas vaginalis\n, the parasite that causes trichomoniasis; Mycoplasma genitalium; and Herpes Simplex viruses 1 and 2. We also offer viral load tests for the quantitation of Hepatitis B virus, Hepatitis C virus, human immunodeficiency virus, or HIV-1, and human cytomegalo virus, or CMV, for use on our Panther instrument system. In addition, we offer bacterial vaginosis and candida vaginitis assays, or BV/CV, for the diagnosis of vaginitis, a common and complex ailment affecting millions of women a year. Our assay portfolio also includes diagnostic tests for a range of acute respiratory infections, including SARS-CoV-2, various strains of influenza and parainfluenza, and respiratory syncytial virus, as well as a test for the detection of Group B Streptococcus, or GBS, as well as two assays that detect several bacterial gastrointestinal (GI) pathogens that commonly cause acute gastroenteritis; all of which are run on the Panther Fusion system, a field upgradeable instrument addition to the base Panther system. We also offer two CE-marked molecular assays, the Panther Fusion EBV Quant assay for quantitation of Epstein-Barr virus, and the Panther Fusion BKV Quant assay for quantitation of the BK virus. These two assays are the first quantitative real-time PCR assays on the Panther Fusion system, and, together with the Aptima CMV Quant assay, comprise our menu of transplant monitoring assays. The ThinPrep System and the Genius Digital Diagnostics System are primarily used in cytology applications, such as cervical cancer screening, and the Rapid fFN Test assists physicians in assessing the risk of pre-term birth. We also generate service revenues from our CLIA-certified laboratory for testing related to breast cancer using our Breast Cancer Index, or BCI test. The open access functionality on the Panther Fusion system allows customers to consolidate lab developed tests (LDTs) and in vitro diagnostic (IVD) assays on the same fully-automated, sample-to-result system.\nOur Breast Health segment offers a broad portfolio of solutions for breast imaging, biopsy, breast surgery and pathology. These solutions include 3D digital mammography systems, image analysis software utilizing artificial intelligence, reading workstations, minimally invasive breast biopsy guidance systems, breast biopsy site markers, localization, and specimen radiology systems. Our most advanced breast imaging platforms, Selenia Dimensions and 3Dimensions systems, utilize tomosynthesis to produce 3D images that show multiple contiguous slice images of the breast. \nOur GYN Surgical products include our MyoSure hysteroscopic tissue removal system, our NovaSure endometrial ablation system, our Fluent fluid management system, our Sonata transcervical radiofrequency ablation system, our Acessa ProVu laparoscopic radiofrequency ablation system, and our CoolSeal vessel sealing portfolio and our JustRight surgical stapler. The MyoSure suite of devices offers four options to provide incision-less removal of fibroids, polyps, and other pathology within the uterus. The NovaSure portfolio is comprised of the NovaSure ADVANCED device and the NovaSure V5 device for the treatment of abnormal uterine bleeding. The Fluent and Fluent Pro fluid management systems provide liquid distention during diagnostic and operative hysteroscopic procedures. The Sonata system uses transcervical, intrauterine ultrasound guidance to treat a wide range of fibroid types without the need for incisions. The Acessa ProVu system is a fully integrated system that uses laparoscopic ultrasound, guidance mapping and radiofrequency ablation to treat nearly all types of fibroids. The CoolSeal portfolio includes the CoolSeal Trinity, CoolSeal Reveal, and CoolSeal Mini advanced bipolar vessel sealing devices. The JustRight 5 mm stapler features a smaller instrument profile and is used for laparoscopic general and pediatric surgery.\nOur Skeletal Health segment’s products include the Horizon DXA, a dual energy x-ray system, which evaluates bone density and performs body composition assessments, and the Fluoroscan Insight FD mini C-arm, which assists in performing minimally invasive orthopedic surgical procedures on a patient’s extremities, such as the hand, wrist, knee, foot, and ankle. Effective in fiscal 2026, we are discontinuing the sale of our Fluoroscan Insight FD systems.\n37\nTable of Contents\nUnless the context otherwise requires, references to we, us, Hologic or our company refer to Hologic, Inc. and its consolidated subsidiaries.\nProposed Merger\nOn October 21, 2025, we entered into a definitive agreement to be acquired by funds managed by Blackstone Inc. (“Blackstone”) and TPG Capital (“TPG”). Under the terms of the agreement, Blackstone and TPG will acquire all outstanding Hologic shares for $76.00 per share in cash, without interest, plus a non-tradable contingent value right (“CVR”) to receive up to $3.00 per share in cash, for total potential consideration of $79.00 per share in cash. The non-tradable CVR will be issued to Hologic stockholders at closing and paid, in whole or in part, following achievement of certain global revenue metrics for our Breast Health business in fiscal years 2026 and 2027. The transaction is expected to close in the first half of calendar year 2026, subject to the approval of Hologic’s stockholders, the receipt of required regulatory approvals and the satisfaction of certain other customary closing conditions. Please see Note 2 to our consolidated financial statements for additional information related to the acquisition. For additional information on risks relating to the transaction, please refer to the “Risk Factors” in Part I, Item 1A, of this Form 10-K.\nAcquisitions and Dispositions\nThe following sets forth a description of certain of our acquisitions and dispositions we have completed in our last two fiscal years:\nGynesonics\nOn January 2, 2025, we completed the acquisition of Gynesonics, Inc. (“Gynesonics”) for a purchase price of $340.7 million. Gynesonics, located in Redwood City, California, develops and sells a technology intended for diagnostic intrauterine imaging and transcervical treatment of certain symptomatic uterine fibroids, including those associated with heavy menstrual bleeding. Based on our valuation, we allocated $146.1 million of the purchase price to the value of intangible assets and $191.0 million to goodwill. Gynesonics’ results of operations are reported within our GYN Surgical segment from the date of acquisition. In connection with the transaction, we recorded a charge of $22.4 million, of which $1.6 million was included in costs of product revenues and $20.8 million was included in operating expenses, in the second quarter of fiscal 2025 for the acceleration of Gynesonics unvested stock options for which the original terms of such awards did not provide for acceleration upon a change-in-control.\nEndomag\nOn July 25, 2024, we completed the acquisition of Endomagnetics Ltd (“Endomag”) for a purchase price of $313.9 million. Endomag, located in the U.K., develops and sells breast surgery localization and lymphatic tracing technologies. Based on our valuation, we allocated $197.8 million of the purchase price to the value of intangible assets and $140.1 million to goodwill. Endomag’s results of operations are reported within our Breast Health segment.\nSuperSonic Imagine Ultrasound Imaging \nOn September 28, 2023, we entered into a definitive agreement to sell our SSI ultrasound imaging business to SSH Holdings Limited for a sales price of $1.9 million in cash. Under the terms of the contract, we agreed to fund the SSI business with $33.2 million of cash. The sale was completed on October 3, 2023 (the beginning of the first quarter of fiscal 2024). The SSI ultrasound imaging asset group met the criteria to be classified as assets held-for-sale in the fourth quarter of fiscal 2023. As a result, we recorded a charge of $51.7 million in the fourth quarter of fiscal 2023 to record the asset group at its fair value less costs to sell pursuant to ASC 360, \nProperty, Plant and Equipment—Impairment or Disposal of Long-Lived Assets\n. \n38\nTable of Contents\nRESULTS OF OPERATIONS\nFiscal Year Ended September 27, 2025 Compared to Fiscal Year Ended September 28, 2024 \nProduct Revenues\n \nFiscal Years Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\n% of Total\nRevenue\nAmount\n% of Total\nRevenue\nAmount\n%\nProduct Revenues\nDiagnostics\n$\n1,693.3 \n41.2 \n%\n$\n1,658.3 \n41.1 \n%\n$\n35.0 \n2.1 \n%\nBreast Health\n829.5 \n20.2 \n%\n912.9 \n22.7 \n%\n(83.4)\n(9.1)\n%\nGYN Surgical\n668.8 \n16.3 \n%\n635.0 \n15.8 \n%\n33.8 \n5.3 \n%\nSkeletal Health\n64.5 \n1.6 \n%\n48.9 \n1.2 \n%\n15.6 \n31.9 \n%\n$\n3,256.1 \n79.4 \n%\n$\n3,255.1 \n80.8 \n%\n$\n1.0 \n— \n%\nProduct revenues remained relatively flat in fiscal 2025 compared to fiscal 2024 due to an increase in Diagnostics, GYN Surgical, and Skeletal revenues offset by a decrease in Breast Health revenues.\nDiagnostics product revenues increased 2.1% in fiscal 2025 compared to fiscal 2024 primarily due to an increase in our Molecular Diagnostics business and to a lesser extent an increase in our Cytology business. The increase in Molecular Diagnostics was primarily driven by an increase in sales volumes of our BV/CV assays, which we primarily attribute to increased adoption by our laboratory customers, and an increase in sales volumes of our Fusion respiratory assays due to a more severe flu season and new customer adoption this year compared to the prior year. These increases were partially offset by a decrease in sales of our two SARS-CoV-2 assays, which we primarily attribute to a normalized level of COVID-19 cases and greater use of rapid tests compared to the prior year, and to a lesser extent a reduction in Aptima CT/GC and HPV revenues from slightly lower average selling prices as volumes increased with larger laboratory customers. The increase in Cytology was primarily driven by an increase in Genius imager usage fees, partially offset by a reduction in sales volume in China.\nBreast Health product revenues decreased 9.1% in fiscal 2025 compared to fiscal 2024 primarily due to a decrease in sales of our digital mammography systems, primarily 3D Dimensions systems and related workstation and workflow products, including software, which we primarily attribute to the prior year period having strong demand fulfillment built up from chip shortages, and in the current year period we experienced longer sales cycles and insufficient sales force execution in the first half of the year. In addition, we had a decrease in sales volume of our Trident HD systems and Affirm Prone biopsy systems. These decreases were partially offset by an increase in sales of our interventional breast solutions products of $57.7 million, primarily due to the Endomag acquisition, which contributed an incremental $54.9 million of product revenue and to a lesser extent an increase in sales of our Brevera needles in the current fiscal year.\nGYN Surgical product revenues increased 5.3% in fiscal 2025 compared to fiscal 2024, primarily due to the Gynesonics acquisition, which contributed $22.4 million in the current fiscal year, an increase in the sales volume of our Fluent fluid management system and MyoSure devices and an increase in our NovaSure devices in international markets, primarily Europe, which we primarily attribute to our go-direct strategy and improved reimbursement in certain European countries. These increases were partially offset by a decrease in domestic revenues from lower sales volumes of our NovaSure devices, which we primarily attribute to a shrinking ablation market due to the increased use of alternative therapies and a decrease in sales volumes of our Acessa ProVu systems and related disposables.\nSkeletal Health product revenues increased 31.9% in fiscal 2025 compared to fiscal 2024 primarily due to an increase in sales volume of our Horizon DXA systems from pent up demand as the temporary stop-ship implemented during the third quarter of fiscal 2024 due to a non-conformance matter pertaining to electromagnetic compatibility requirements was fully resolved for all Horizon DXA models in the third quarter of the current fiscal year. This increase was partially offset by lower sales volumes of our Insight FD systems which we primarily attribute to our announcement that we would cease selling these systems in fiscal 2026.\nAt the end of any of our fiscal quarters and years, there remain open orders, primarily related to consumable products, that are not fulfilled until the beginning of the subsequent quarter or year, depending on a number of factors, including but not limited to customer ordering patterns, various operational and logistical issues, and in periods prior to fiscal 2025 management discretion to defer shipping orders based on achieving certain financial targets. Consolidated revenues in fiscal 2025 and 2024 benefited by less than 0.5% from the timing of such open orders that were not fulfilled at the end of the prior year. \n39\nTable of Contents\nProduct revenues by geography as a percentage of total revenues were as follows:\n \nYears Ended\n \nSeptember 27,\n2025\nSeptember 28,\n2024\nUnited States\n72.0 \n%\n73.0 \n%\nEurope\n15.8 \n%\n14.2 \n%\nAsia-Pacific\n6.1 \n%\n6.8 \n%\nRest of World\n6.1 \n%\n6.0 \n%\n100.0 \n%\n100.0 \n%\nThe percentage of product revenue derived from Europe increased, while the percentage of product revenue derived from the United States and Asia-Pacific decreased. The increase in Europe was primarily due to an increase in sales of our GYN Surgical products, primarily Sonata disposables from the Gynesonics acquisition, as well as our MyoSure and NovaSure devices, an increase in sales of our capital and disposable products from the Endomag acquisition, and to a lesser extent a minimum commitment penalty payment received from the German government for SARS-CoV-2 assays. This increase was partially offset by a decrease in sales of our 2D and 3D Dimensions systems. The decrease in the United States was primarily due to a decrease in sales of our Breast Health products, specifically our 3D Dimensions systems and related workflow and workstation products and to a lesser extent Trident HD systems, and a decrease in our GYN Surgical NovaSure devices. Partially offsetting this decrease was an increase in sales of our Diagnostics products, primarily our BV/CV and Fusion respiratory assays, and an increase in sales of our capital and disposable products from the Endomag acquisition as well as an increase in our GYN Surgical Fluent fluid management systems and the inclusion of Gynesonics. The decrease in Asia-Pacific was primarily due to a decrease in sales volumes of our ThinPrep Pap Tests, HPV assays and 3D Dimensions systems in China, which we primarily attribute to the trade war between China and the United States and other Chinese policies that impact sales volumes, partially offset by an increase in Horizon DXA systems, primarily in Japan as the stop ship was fully lifted.\nService and Other Revenues\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\n% of Total\nRevenue\nAmount\n% of Total\nRevenue\nAmount\n%\nService and Other Revenues\n$\n844.4 \n20.6 \n%\n$\n775.2 \n19.2 \n%\n$\n69.2 \n8.9 \n%\nService and other revenues are primarily comprised of revenue generated from our field service organization to provide ongoing support and maintenance services, installation and repair of our products. Service and other revenues increased 8.9% in fiscal 2025 compared to fiscal 2024 primarily due to an increase in Breast Health service contract revenue from our expanded installed base. In addition, to a lesser extent, we had higher lab testing volumes from our Biotheranostics business, which we primarily attribute to greater adoption of our Breast Cancer Index test. \nCost of Product Revenues\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\n% of Product\nSales\nAmount\n% of Product\nSales\nAmount\n%\nCost of Product Revenues\n$\n1,246.4 \n38.3 \n%\n$\n1,206.2 \n37.1 \n%\n$\n40.2 \n3.3 \n%\nAmortization of Acquired Intangible Assets\n176.5 \n5.4 \n%\n180.5 \n5.5 \n%\n(4.0)\n(2.2)\n%\nImpairment of Acquired Intangible Assets and Equipment\n183.4 \n5.6 \n%\n39.2 \n1.2 \n%\n144.2 \n**\n$\n1,606.3 \n49.3 \n%\n$\n1,425.9 \n43.8 \n%\n$\n180.4 \n12.7 \n%\n** Percentage not meaningful\nProduct gross margin was 50.7% in fiscal 2025 compared to 56.2% in fiscal 2024. \nCost of Product Revenues.\n The cost of product revenues as a percentage of product revenues increased to 38.3% in the current year compared to 37.1% in the prior year. \n40\nTable of Contents\nDiagnostics’ product costs as a percentage of revenue decreased in fiscal 2025 compared to fiscal 2024 primarily due to an increase in sales volume of our Women’s Health assays, primarily BV/CV and Fusion respiratory assays, an increase in Genius imager usage fees, favorable manufacturing variances from higher production volumes and lower scrap. Partially offsetting this increase in gross margin was a decrease in Covid assay volumes, an increase in sustaining on-market support, accelerated depreciation and excess inventory charges aggregating $14.4 million related to the shutdown of the Manchester, England manufacturing facility and higher amortization and service costs from a larger installed base. In the current fiscal year, costs were lower as there were no period charges from the Mobidiag business as a result of the facility closure during the second half of fiscal 2024.\nBreast Health’s product costs as a percentage of revenue increased in fiscal 2025 compared to fiscal 2024 primarily due to lower sales volumes of our higher margin products, primarily 3D Dimensions and related workstation and workflow products (including software) and to a lesser extent unfavorable manufacturing variances from lower production volumes, an increase in quality remediation costs and higher excess and obsolescence charges, partially offset by the inclusion of Endomag, which has higher margins than the legacy business.\nGYN Surgical’s product costs as a percentage of revenue increased in fiscal 2025 compared to fiscal 2024 primarily due to a decrease in domestic sales volume of our NovaSure devices, an increase in sales of our Fluent fluid management system and the inclusion of Gynesonics products, which have lower margins, a decrease in domestic average selling prices of our MyoSure devices, an increase in costs from the step-up to fair value for the acquired Gynesonics inventory sold during the second quarter of $4.0 million and an increase in tariff costs. The increase in costs as a percentage of revenue was partially offset by an increase in sales volume of our MyoSure in the U.S. and NovaSure devices in international markets.\nSkeletal Health’s product costs as a percentage of revenue increased in fiscal 2025 compared to fiscal 2024 primarily due to a charge for non-cancelable purchase commitments and excess and obsolescence charges related to the Insight FD system that we will stop selling in fiscal 2026, and a decrease in the average selling prices of our Horizon DXA systems and Insight FD systems, partially offset by an increase in sales volume of our Horizon DXA systems.\nThe U.S. government implemented reciprocal tariffs beginning in April 2025 to accomplish certain policy goals and is currently negotiating trade agreements with many countries. Currently, the government has implemented a baseline 10% tariff on imports into the U.S., with certain exceptions. U.S. tariffs are paid by the entity that is the importer of record, and as such, we are liable for those products and materials imported into the U.S. We manufacture the majority of our GYN Surgical and Breast Health interventional breast solutions disposable products at our Costa Rica facility, which is subject to the 10% tariff. We also utilize a third-party manufacturer based in Mexico to produce our Skeletal Health products. Goods from Mexico are subject to a 25% tariff, however, the finished goods we import from Mexico are predominantly exempt from tariffs under the United States-Mexico-Canada Agreement (“USMCA”). For fiscal 2025, primarily in the fourth quarter, we recorded tariff expense of $9.5 million. Based on the mitigation efforts we have taken and expect to take, we estimate that, if maintained at current levels, the impact of direct tariff costs to us on a quarterly basis will be approximately $10 million to $14 million. This estimate does not consider potential cost increases from our vendors and suppliers. We continue to evaluate the status of the evolving tariffs as well as various measures to mitigate the impact of tariffs, however we can give no assurances on the success of these efforts. Additional tariffs or other trade restrictions by the U.S. or other countries where we do significant business or applicable to specific industries relevant to our business, could further materially impact our results in the future.\nAmortization of Acquired Intangible Assets.\n Amortization of intangible assets included in cost of product revenues relates to acquired developed technology, which is generally amortized over its estimated useful life of between 10 and 15 years. Amortization expense decreased in fiscal 2025 compared to fiscal 2024 primarily due to lower amortization from the Acessa, Bolder, Diagenode and Mobidiag developed technology assets as a result of the impairment charges recorded in the second quarter of fiscal 2025, and the BioZorb developed technology asset as a result of the impairment charges recorded in the second and third quarters of fiscal 2024, partially offset by an increase in amortization expense from the Endomag and Gynesonics acquisitions.\n41\nTable of Contents\nImpairment of Intangible Assets and Equipment.\n During the second quarter of fiscal 2025, in connection with commencing our company-wide strategic planning process, we identified indicators of impairment in our Acessa, Bolder, Diagenode and Mobidiag businesses. As a result, we performed undiscounted cash flow analyses pursuant to ASC 360, \nProperty, Plant and Equipment - Overall\n, to determine if the cash flows expected to be generated by these product lines over the remaining estimated useful lives of their primary assets were sufficient to recover the carrying value of the asset groups. Based on these analyses, the undiscounted cash flows were not sufficient to recover the carrying value of the long-lived assets. Therefore, we were required to perform Step 3 of the impairment test and determine the fair value of the asset groups. To estimate the fair value of the asset groups, we utilized the income approach, which is based on a discounted cash flow (DCF) analysis, and calculated the fair value by estimating the after-tax cash flows attributable to the asset groups and then discounting the after-tax cash flows to present value using a risk-adjusted discount rate. Based on these analyses, the fair value of the Acessa, Bolder, Diagenode and Mobidiag asset groups were below their carrying values, and we recorded impairment charges aggregating $204.0 million of which $183.4 million of the charge was allocated to developed technology.\nDuring the second quarter of fiscal 2024, in connection with commencing our company-wide annual strategic planning process, we identified indicators of impairment in our BioZorb product line, which was part of the Focal acquisition. As a result, we performed an undiscounted cash flow analysis. Based on this analysis the undiscounted cash flows were not sufficient to recover the carrying value of the long-lived assets. Therefore, we were required to perform Step 3 of the impairment test and determine the fair value of the asset group. To estimate the fair value of the asset group, we utilized a DCF analysis. Based on this analysis, the fair value of the BioZorb asset group was below its carrying value, and we recorded an impairment charge of $26.8 million of which $25.9 million of the charge was allocated to developed technology. During the third quarter of fiscal 2024, the Federal Drug Administration classified a prior safety notice for the BioZorb Marker as a Class I recall. This was a technical classification of a prior safety notice only, not a product removal. Following this, we lowered our forecast for this product line, which was an indicator of impairment. Accordingly, we performed an undiscounted cash flow analysis and determined the cash flows were not sufficient to recover the carrying value of the asset group. We performed a fair value analysis and determined that the fair value of the asset group was immaterial. As a result, we recorded an impairment charge of $13.3 million to developed technology, fully writing-off the asset.\nCost of Service and Other Revenues\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\n% of Service\nand Other\nRevenues\nAmount\n% of Service\nand Other\nRevenues\nAmount\n%\nCost of Service and Other Revenues\n$\n376.3 \n44.6 \n%\n$\n376.6 \n48.6 \n%\n$\n(0.3)\n(0.1)\n%\nService and other revenues gross margin was 55.4% in fiscal 2025 compared to 51.4% in fiscal 2024. The increase in gross margin was primarily due to an increase in service contract and preventative maintenance revenue from our expanded installed base of digital mammography systems coupled with lower field service expense. In addition, gross margin improved from an increase in lab testing revenue from Biotheranostics, which has higher margins than our legacy service business.\n42\nTable of Contents\nOperating Expenses\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\n% of Total\nRevenue\nAmount\n% of Total\nRevenue\nAmount\n%\nOperating Expenses\nResearch and development\n$\n248.2 \n6.1 \n%\n$\n272.8 \n6.8 \n%\n$\n(24.6)\n(9.0)\n%\nSelling and marketing\n620.6 \n15.1 \n%\n585.4 \n14.5 \n%\n35.2 \n6.0 \n%\nGeneral and administrative\n449.3 \n11.0 \n%\n409.4 \n10.2 \n%\n39.9 \n9.7 \n%\nAmortization of acquired intangible assets\n14.4 \n0.4 \n%\n29.2 \n0.7 \n%\n(14.8)\n(50.7)\n%\nImpairment of intangible assets and equipment\n42.5 \n1.0 \n%\n5.6 \n0.1 \n%\n36.9 \n**\nContingent consideration fair value adjustment\n— \n— \n%\n1.7 \n— \n%\n(1.7)\n(100.0)\n%\nRestructuring charges\n28.6 \n0.7 \n%\n41.1 \n1.0 \n%\n(12.5)\n(30.4)\n%\n$\n1,403.6 \n34.3 \n%\n$\n1,345.2 \n33.3 \n%\n$\n58.4 \n4.3 \n%\n** Percentage not meaningful\nResearch and Development Expenses.\n Research and development expenses decreased 9.0% in fiscal 2025 compared to fiscal 2024 primarily due to a decrease in compensation and benefits from lower headcount, primarily within Diagnostics and Breast Health (excluding Endomag), lower bonus expense and a decrease in project spend partially offset by the inclusion of expenses of $6.8 million and $7.2 million related to the Endomag and Gynesonics acquisitions, respectively, a decrease in credits recorded for funds received from the Biomedical Advanced Research and Development Authority (BARDA) grant to obtain FDA approval of our SARS-CoV-2 assays, and an increase in consulting spend related to the quality organization and addressing matters raised by the FDA. The decrease is also due to the prior year period included a $10.0 million charge related to the purchase of intellectual property to be used in a Diagnostics development project that had no future alternative use. At any point in time, we have a number of different research projects and clinical trials being conducted and the timing of these projects and related costs can vary from period to period.\nSelling and Marketing Expenses.\n Selling and marketing expenses increased 6.0% in fiscal 2025 compared to fiscal 2024 primarily due to the inclusion of expenses of $27.7 million from the Endomag acquisition which included a one-time contract termination fee, the inclusion of expenses of $23.7 million from the Gynesonics acquisition, which included $6.8 million of expense for the acceleration and cash out of unvested stock options in connection with the acquisition, partially offset by a decrease in marketing initiatives.\nGeneral and Administrative Expenses.\n General and administrative expenses increased 9.7% in fiscal 2025 compared to fiscal 2024 primarily due to the inclusion of expenses of $17.2 million from the Gynesonics acquisition, which included $12.2 million for the acceleration and cash out of unvested stock options, the inclusion of expenses of $7.7 million from the Endomag acquisition, an increase in acquisition transaction expenses including transaction bonuses, an increase in legal fees, a one-time charge of $5.0 million related to a divested subsidiary, and higher IT infrastructure project spend. These increases were partially offset by lower bonus expense, deferred compensation plan expense and bad debt.\nAmortization of Acquired Intangible Assets.\n Amortization of acquired intangible assets primarily results from customer relationships and trade names related to our acquisitions. These intangible assets are generally amortized over their estimated useful lives of between 3 and 30 years. Amortization expense decreased in fiscal 2025 compared to fiscal 2024 primarily due to lower amortization of the Bolder and Diagenode customer relationship and trade name intangible assets as a result of impairment charges recorded in the second quarter of fiscal 2025 and accelerated amortization in the prior year period of customer relationship and trade name intangible assets acquired in the Mobidiag acquisition, partially offset by amortization expense from the Gynesonics and Endomag acquisitions.\nImpairment of Intangible Assets and Equipment. \nDuring the second quarter of fiscal 2025, as discussed above, we recorded aggregate impairment charges of $204.0 million related to our Acessa, Bolder, Diagenode and Mobidiag businesses of which $20.5 million was allocated to customer lists and trade names and written off to operating expenses. We also recorded an impairment charge of $16.9 million to record our IPR&D asset from the Mobidiag acquisition to fair value. The reduction in fair value was primarily due to a reduction in forecasted revenues and timing of completing the project. During the fourth \n43\nTable of Contents\nquarter of fiscal 2025, we recorded an additional impairment charge of $5.0 million to reduce this IPR&D asset to zero. During the second and third quarters of fiscal 2024, we recorded total impairment charges of $1.3 million for trade names related to our BioZorb product line. During the first quarter of fiscal 2024 we recorded an impairment charge of $4.3 million to record our IPR&D asset from the Mobidiag acquisition to fair value. The reduction in fair value was primarily due to a reduction in forecasted revenues and timing of completing the project. \nRestructuring Charges.\n We have implemented various cost reduction initiatives to align our cost structure with our operations and related integration activities. These actions have primarily resulted in the termination of employees and the shutdown of certain facilities. During fiscal 2025, we made the decision to shut down manufacturing operations at our Manchester, England location, which manufactures molecular diagnostics products that are also manufactured at our San Diego, California facility. As a result, we recorded severance benefits of $3.2 million in the quarter. This action is expected to be completed by the second quarter of fiscal 2026. During the third quarter of fiscal 2025, we made the decision to reorganize and reduce costs in China resulting in the termination of certain employees, primarily in sales, and recorded severance benefits of $4.3 million. Additionally, during fiscal 2025, we decided to reorganize certain departments and reduce costs resulting in the termination of certain employees in the Diagnostics, Breast Health and Surgical divisions and Corporate functions in the U.S. across multiple departments. As a result, the Company recorded aggregate severance benefit charges of $13.8 million. During the first quarter of fiscal 2024, we further refined our strategy for the Mobidiag business and decided to discontinue the manufacture and sale of certain products. This decision resulted in the closure of facilities in Finland and France as we moved the development activities and operations to our San Diego, California location. As a result, we recorded impairment charges, accelerated depreciation and severance benefits totaling $31.6 million in fiscal 2024 and $3.4 million in fiscal 2025. For additional information, please refer to Note 8 to our consolidated financial statements.\nInterest Income\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\nAmount\nAmount\n%\nInterest Income\n$\n74.4 \n$\n108.7 \n$\n(34.3)\n(31.6)\n%\nInterest income in fiscal 2025 decreased compared to fiscal 2024 due to lower average cash and investment balances and lower interest rates as the U.S. Federal Reserve reduced the Federal Funds Rate over the last twelve months.\nInterest Expense\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\nAmount\nAmount\n%\nInterest Expense\n$\n(117.1)\n$\n(122.1)\n$\n5.0 \n(4.1)\n%\nInterest expense decreased in fiscal 2025 compared to fiscal 2024 primarily due to a lower principal balance outstanding under our current 2025 Credit Agreement and previous 2021 Credit Agreement and a reduction in interest rates as the U.S. Federal Reserve reduced the Federal Funds Rate over the last twelve months. This decrease was partially offset by a reduction of $10.1 million received under interest rate swap agreements primarily due to a decrease in our overall hedged principal amount from $1.0 billion to $500 million and an increase in the fixed SOFR component under those agreements.\nOther Income (Expense), net\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\nAmount\nAmount\n%\nOther Income (Expense), net\n$\n9.6 \n$\n(4.1)\n$\n13.7 \n(334.1)\n%\nIn fiscal 2025, this account primarily consisted of net foreign currency exchange gains of $11.6 million, primarily from the mark-to-market of foreign currency contracts used to hedge operating results and a gain of $7.5 million from the change in cash surrender value of life insurance contracts related to our deferred compensation plan driven by stock market gains, partially offset by losses of $9.0 million from our Maverix strategic investment that is accounted for under the equity method.\n44\nTable of Contents\nIn fiscal 2024, this account primarily consisted of net foreign currency exchange losses of $21.0 million, primarily from the mark-to-market of foreign currency contracts used to hedge operating results and to a lesser extent losses of $3.6 million from our Maverix strategic investment that is accounted for under the equity method, partially offset by a gain of $14.9 million from the change in cash surrender value of life insurance contracts related to our deferred compensation plan driven by stock market gains and a gain of $6.3 million from a change in control provision related to a license agreement.\nProvision for Income Taxes\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\nAmount\nAmount\n%\nProvision for Income Taxes\n$\n115.5 \n$\n75.6 \n$\n39.9 \n52.8 \n%\nOur effective tax rate for fiscal 2025 was a provision of 17.0%. The effective tax rate for fiscal 2025 differed from the U.S. statutory tax rate primarily due to the geographic mix of income, which was impacted by impairment charges in high-tax jurisdictions recognized in the second quarter of fiscal 2025, and income earned by our international subsidiaries, which are generally taxed at rates lower than the U.S. statutory tax rate, the U.S. deduction for foreign derived intangible income, federal and state tax credits, and U.S. tax on foreign earnings.\nOur effective tax rate for fiscal 2024 was a provision of 8.7%. The effective tax rate for fiscal 2024 was lower than the U.S. statutory tax rate primarily due to a one-time tax benefit of $107.2 million related to a worthless stock deduction on an investment in one of our international subsidiaries recorded in the first quarter of fiscal 2024, the U.S. deduction for foreign derived intangible income, the geographic mix of income earned by the Company’s international subsidiaries, and federal and state tax credits.\nSegment Results of Operations\nWe operate in four segments: Diagnostics, Breast Health, GYN Surgical, and Skeletal Health. We measure segment performance based on total revenues and operating income (loss), excluding amortization of intangible assets, goodwill and intangible asset charges, restructuring, consolidation and integration costs, transaction and acquisition-related charges and other one-time unusual items. Revenues from product sales of each of these segments are described in further detail above. The discussion that follows is a summary analysis of total revenues and the primary changes in operating income or loss by segment. \nDiagnostics\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\nAmount\nAmount\n%\nTotal Revenues\n$\n1,827.2 \n$\n1,782.0 \n$\n45.2 \n2.5 \n%\nSegment Operating Income\n$\n599.9 \n$\n509.5 \n$\n90.4 \n17.7 \n%\nOperating Income as a % of Segment Revenue\n32.8 \n%\n28.6 \n%\nDiagnostics revenues increased in fiscal 2025 compared to fiscal 2024 primarily due to the increase in product revenues discussed above and higher lab testing revenue from our Biotheranostics business.\nOperating income for this business segment increased in fiscal 2025 compared to fiscal 2024 primarily due to an increase in gross profit driven by higher revenues as discussed above and improvements in gross margin discussed above under costs of product revenues. Segment operating expenses decreased in the current fiscal year as we had lower research and development headcount from prior year restructuring actions, less project spend, lower bonus expense, and a decrease in marketing initiatives.\n45\nTable of Contents\nBreast Health\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\nAmount\nAmount\n%\nTotal Revenues\n$\n1,484.1 \n$\n1,522.9 \n$\n(38.8)\n(2.5)\n%\nSegment Operating Income\n$\n436.8 \n$\n476.7 \n$\n(39.9)\n(8.4)\n%\nOperating Income as a % of Segment Revenue\n29.4 \n%\n31.3 \n%\nBreast Health revenues \ndecreased\n in fiscal 2025 compared to fiscal 2024 primari\nly due to a decrease in product revenue discussed above partially offset by an increase in service revenue.\nOperating income for this business segment \ndecreased\n in fiscal 2025 compared to fiscal 2024 primarily due \nto an increase in operating expenses and a decrease in gross profit. The decrease in gross profit was primarily driven by lower revenues as discussed above and a decrease in gross margin discussed above under costs of product revenues. \nSegment opera\nting expenses increased in fiscal 2025 compared to fiscal 2024 primarily due to incremental expenses from the Endomag acquisition of $31.6 million and an increase in legal fees. These increases were partially offset by a decrease in marketing initiatives.\nGYN Surgical\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\nAmount\nAmount\n%\nTotal Revenues\n$\n679.8 \n$\n641.3 \n$\n38.5 \n6.0 \n%\nSegment Operating Income\n$\n204.6 \n$\n224.5 \n$\n(19.9)\n(8.9)\n%\nOperating Income as a % of Segment Revenue\n30.1 \n%\n35.0 \n%\nGYN Surgical revenues increased in fiscal 2025 compared to fiscal 2024 due to the increase in product revenues discussed above. \nOperating income for this business se\ngment decreased in \nfiscal 2025 compared to fiscal 2024\n primarily due to an increase in operating expenses partially offset by an increase in gross profit. The increase in segment operating expenses was primarily due to the inclusion of expenses from the Gynesonics acquisition of $26.6 million and an increase in commission expense from higher revenues, partially offset by a decrease in research and development project spend and bad debt expense. The increase in gross profit was primarily driven by higher revenues as discussed above partially offset by a decrease in gross margin discussed above under costs of product revenues.  \nSkeletal Health\n \nYears Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nChange\n \nAmount\nAmount\nAmount\n%\nTotal Revenues\n$\n109.4 \n$\n84.1 \n$\n25.3 \n30.1 \n%\nSegment Operating Loss\n$\n(3.7)\n$\n(0.5)\n$\n(3.2)\n(640.0)\n%\nOperating Loss as a % of Segment Revenue\n(3.4)\n%\n(0.6)\n%\nSkeletal Health revenues increased in fiscal 2025 compared to fiscal 2024 primarily due to an increase in product revenues discussed above.\nOperating loss increased in fiscal 2025 compared to fiscal 2024 primarily due to a decrease in gross profit as discussed above under cost of product revenues, partially offset by a decrease in operating expenses. Operating expenses decreased in fiscal 2025 compared to fiscal 2024 primarily due to a decrease in marketing and research and development expenses.\nFiscal Year Ended September 28, 2024 Compared to Fiscal Year Ended September 30, 2023\nDiscussions of year-to-year comparisons between fiscal 2024 and 2023 that are not included in this Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form 10-K for the fiscal year ended September 28, 2024.\n46\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nAt September 27, 2025, we had working capital of $2,690.9 million, and our cash and cash equivalents totaled $1,959.5 million. Our cash and cash equivalents balance decreased by $200.7 million during fiscal 2025 principally due to cash used in investing and financing activities primarily related to repurchases of our common stock, cash paid to acquire Gynesonics, capital expenditures and strategic investments, partially offset by cash generated from operating activities and net maturities of available-for-sale securities. \nIn fiscal 2025, our operating activities provided cash of $1,057.1 million, primarily due to net income of $565.7 million, non-cash charges for depreciation and amortization aggregating $299.8 million, intangible asset impairments of $225.9 million and stock-based compensation expense of $84.3 million. These adjustments to net income were partially offset by a decrease in net deferred taxes of $141.6 million primarily due to the amortization of intangible assets and impairments of acquired intangible assets recorded in the second quarter in fiscal 2025. Cash provided by operations included a net cash outflow of $20.4 million from changes in our operating assets and liabilities. This cash outflow was primarily driven by a decrease of $32.3 in accrued expenses and other liabilities primarily due to the payment of fiscal 2024 bonuses, which were higher than fiscal 2025 bonuses accrued, and normal operating lease payments, a decrease in accounts payable of $11.3 million primarily due to the timing of payments, and a decrease in deferred revenue of $15.3 million primarily due to a reduction of capital equipment sales deferred for acceptance in fiscal 2025 compared to fiscal 2024. These cash outflows were partially offset by a decrease in prepaid income taxes of $20.1 million primarily due to the timing of tax payments relative to the provision for income taxes and a decrease in prepaid expenses and other assets of $11.9 million primarily due to normal amortization and a decrease in service and software subscriptions.  \nIn fiscal 2025, our investing activities used cash of $482.7 million primarily due to a $321.5 million net payment for the Gynesonics acquisition, capital expenditures of $137.0 million, which primarily consisted of the placement of equipment under customer usage agreements and purchase of manufacturing equipment, $35.0 million for strategic investments and $15.4 million for the purchases of an intellectual property license. These cash outflows were partially offset by $29.1 million of net maturities of available-for-sale securities.\nIn fiscal 2025, our financing activities used cash of $777.2 million, primarily due to $752.9 million for repurchases of our common stock, including a $250 million accelerated share repurchase program completed in the first quarter of fiscal 2025, $28.5 million for debt principal payments under our 2021 Credit Agreements, and $22.2 million for the payment of employee taxes withheld for the net share settlement of vested restricted stock units. Partially offsetting these uses of cash were proceeds of $38.8 million from our equity plans from the exercise of stock options and issuance of shares under our employee stock purchase plan.\nDebt\nWe had total recorded debt outstanding of $2.51 billion at September 27, 2025, which was comprised of amounts outstanding under our 2025 Credit Agreement of $1.167 billion (principal of $1.169 billion), 2029 Senior Notes of $942.9 million (principal of $950.0 million), and 2028 Senior Notes of $398.3 million (principal of $400.0 million). \n2025 Credit Agreement \nOn July 15, 2025, we refinanced our existing 2021 Term Loan and 2021 Revolver with Bank of America, N.A. in its capacity as Administrative Agent, Swing Line Lender and L/C Issuer, and certain other lenders from time to time party thereto (the “2021 Credit Agreement”) by entering into Refinancing Amendment (the “2025 Credit Agreement”). Borrowings under the 2025 Credit Agreement are secured by first-priority liens on, and a first priority security interest in, substantially all of our and our Subsidiary Guarantors’ U.S. assets. The credit facilities (the “2025 Credit Facilities”) under the 2025 Credit Agreement consist of:\n•\nA $1.169 billion secured term loan (“2025 Term Loan”) with a stated maturity date of July 15, 2030; and\n•\nA secured revolving credit facility (the “2025 Revolver”) under which the Borrowers may borrow up to $1.25 billion, subject to certain sublimits, with a stated maturity date of July 15, 2030.\nAs of September 27, 2025, there were no borrowings under the 2025 Revolver. \n47\nTable of Contents\nBorrowings under the 2025 Credit Agreement, other than Swing Line Loans, bear interest, at the Company’s option, at the Base Rate, the Daily SOFR Rate, the Term SOFR Rate, the Alternative Currency Daily Rate, and the Alternative Currency Term Rate, in each case plus the Applicable Rate. The Applicable Rate with respect to the Base Rate, Daily SOFR Rate, Term SOFR Rate, the Alternative Currency Daily Rate and the Alternative Currency Term Rate is subject to specified changes depending on the Total Net Leverage Ratio (as defined in Refinancing Amendment No.4). The Term Loan borrowings initially bear interest at an annual rate equal to Term SOFR Rate plus 1.10%. As of September 27, 2025, the interest rate under the 2025 Term Loan was 5.26% per annum.\nWe are required to make scheduled principal payments under the 2025 Term Loan in increasing amounts, which currently range from $2.92 million per three-month period to $14.61 million per three-month period commencing with the three-month period ending on September 25, 2026. The remaining scheduled balance of $1.04 billion (or such lesser aggregate principal amount of the Term Loans then outstanding) on the 2025 Term Loan and any amounts outstanding under the 2025 Revolver are due at their respective maturities. In addition, subject to the terms and conditions set forth in the 2025 Credit Agreement, we may be required to make certain mandatory prepayments from the net proceeds of specified types of asset sales (subject to certain reinvestment rights), debt issuances (excluding permitted debt) and insurance recoveries (subject to certain reinvestment rights). Certain mandatory prepayments are subject to reduction or elimination if certain financial covenants are met. Subject to certain limitations, we may voluntarily prepay any of the 2025 Credit Facilities without premium or penalty.\nThe 2025 Credit Agreement contains affirmative and negative covenants customarily applicable to senior secured credit facilities including the requirement we maintain two financial covenants (a total net leverage ratio and an interest coverage ratio) measured as of the last day of each quarter for the previous twelve-month period. These covenants are consistent with those under the 2021 Credit Agreement, and we were in compliance with these covenants as of September 27, 2025.\n2028 Senior Notes\nThe total aggregate principal balance of the 2028 Senior Notes is $400.0 million. The 2028 Senior Notes are general senior unsecured obligations and are guaranteed on a senior unsecured basis by certain of our domestic subsidiaries. The 2028 Senior Notes mature on February 1, 2028 and bear interest at the rate of 4.625% per year, payable semi-annually on February 1 and August 1 of each year. We have the option to redeem the 2028 Senior Notes on or after: February 1, 2025 through February 1, 2026 at 100.770% of par; and February 1, 2026 and thereafter at 100% of par. In addition, if there is a change of control coupled with a decline in ratings, as provided in the indenture, we will be required to make an offer to purchase each holder’s 2028 Senior Notes at a price equal to 101% of their principal amount, plus accrued and unpaid interest, if any, to the repurchase date.\n2029 Senior Notes\n The total aggregate principal balance of the 2029 Senior Notes is $950.0 million. The 2029 Senior Notes are general senior unsecured obligations and are guaranteed on a senior unsecured basis by certain domestic subsidiaries. The 2029 Senior Notes mature on February 15, 2029 and bear interest at the rate of 3.250% per year, payable semi-annually on February 15 and August 15 of each year. We have the option to redeem the 2029 Senior Notes on or after: September 28, 2025 and thereafter at 100% of par. In addition, if there is a change of control coupled with a decline in ratings, as provided in the indenture, we will be required to make an offer to purchase each holder’s 2029 Senior Notes at a price equal to 101% of their principal amount, plus accrued and unpaid interest, if any, to the repurchase date.\nStock Repurchase Program\nOn September 12, 2024, our Board of Directors authorized a new stock repurchase program, with a five-year term, to repurchase up to $1.5 billion of our outstanding stock. As of September 27, 2025, $937.5 million remained unused under this authorization. \nThe timing of any future share repurchases will be based upon our continuing analysis of market, financial, and other factors. Repurchases under the authorized share repurchase program may be made using a variety of methods, which may include, but are not limited to, open market purchases, privately negotiated transactions, accelerated share repurchase agreements, or purchases pursuant to a Rule 10b5-1 plan under the Exchange Act. The authorized share repurchase program may be suspended, delayed or discontinued at any time. Pursuant to the Merger Agreement, we are restricted from initiating share repurchases without the prior written consent of Blackstone and TPG.\nFuture Liquidity Considerations\nWe expect to continue to review and evaluate potential strategic transactions that we believe will complement our current or future business. Subject to the “Risk Factors” set forth in Part I, Item 1A of this Annual Report and the general disclaimers \n48\nTable of Contents\nset forth in our Special Note Regarding Forward-Looking Statements at the outset of this Annual Report, we believe that our cash and cash equivalents, short-term investments, cash flows from operations, and the cash available under our 2025 Revolver will provide us with sufficient funds in order to fund our existing commitments and our expected normal operations and debt payments over the next twelve months. Our longer-term liquidity is contingent upon future operating performance. We may also require additional capital in the future to fund capital expenditures, repayment of debt, acquisitions, strategic transactions or other investments. As described above, we have significant indebtedness outstanding under our 2025 Credit Agreement, 2028 Senior Notes, and 2029 Senior Notes. These capital requirements could be substantial. Our operating performance may also be affected by matters discussed under the above-referenced Risk Factors set forth elsewhere in this report. These risks, trends and uncertainties may also adversely affect our long-term liquidity.\nLegal Contingencies\nWe are currently involved in certain legal proceedings, claims, governmental and/or regulatory inspections, inquiries and investigations arising out of the ordinary course of business. In connection with these legal proceedings, claims, inspections, inquiries or investigations, management periodically reviews estimates of potential costs to be incurred by us in connection with the adjudication or settlement, if any, of these proceedings. These estimates are developed, as applicable in consultation with outside counsel, and are based on an analysis of potential litigation outcomes and settlement strategies. In accordance with ASC 450, \nContingencies\n, loss contingencies are accrued if, in the opinion of management, an adverse outcome is probable and such financial outcome can be reasonably estimated. It is possible that future results for any particular quarter or annual period may be materially affected by changes in our assumptions or the effectiveness of our strategies relating to these proceedings.\nGuarantees and Other Off-Balance Sheet Arrangements\nWe do not have guarantees or other off-balance sheet financing arrangements, including variable interest entities, of a magnitude that we believe could have a material impact on our financial condition or liquidity.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these consolidated financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. On an on-going basis, we evaluate our estimates, including those related to revenue recognition for multiple element arrangements, allowance for doubtful accounts, reserves for excess and obsolete inventories, valuations, purchase price allocations and contingent consideration related to business combinations, expected future cash flows including growth rates, discount rates, terminal values and other assumptions used to evaluate the recoverability of long-lived assets and goodwill, estimated fair values of intangible assets and goodwill, amortization methods and periods, warranty reserves, certain accrued expenses, restructuring and other related charges, stock-based compensation, contingent liabilities, tax reserves and the recoverability of our net deferred tax assets and related valuation allowances. We base our estimates on historical experience and various other assumptions that are believed to be reasonable under the circumstances. Actual results could differ from these estimates if past experience or other assumptions do not turn out to be substantially accurate. Any differences may have a material impact on our financial condition and results of operations.\nThe following is a discussion of what we believe to be the more significant critical accounting policies and estimates used in the preparation of our consolidated financial statements.\nInventory\nThe valuation of inventory includes material, labor and overhead, and is stated at the lower of cost (first-in, first-out) or net realizable value. As a developer and manufacturer of high technology medical equipment, diagnostic test kits, and disposable surgical devices, we may be exposed to a number of economic and industry factors that could result in portions of our inventory becoming either obsolete or in excess of anticipated usage. Our policy is to establish inventory reserves when conditions exist that suggest that our inventory may be in excess of anticipated demand or is obsolete based upon our assumptions about future demand for our products and market conditions. Although considerable effort is made to ensure the accuracy of our forecasts of future product demand, any significant unanticipated changes in demand or expected usage could have a significant negative impact on the value of our inventory and our operating results.\nBusiness Combinations\n49\nTable of Contents\nWe record tangible and intangible assets acquired and liabilities assumed in business combinations under the purchase method of accounting. Amounts paid for each acquisition are allocated to the assets acquired and liabilities assumed based on their fair values at the dates of acquisition.\nThe fair value of identifiable intangible assets is based on detailed valuations that use information and assumptions provided by management, which consider management’s best estimate of inputs and assumptions that a market participant would use. We allocate any excess purchase price over the fair value of the net tangible and intangible assets acquired and liabilities assumed to goodwill. \nWe generally use the income approach in which cash flow projections on an after-tax basis are discounted using a risk adjusted rate to determine the estimated fair value of certain identifiable intangible assets including developed technology, in-process research and development projects, customer relationships, and trade names. The significant assumptions used to estimate the fair value of intangible assets include discount rates and certain assumptions that form the basis of the forecasted results, specifically revenue growth rates. These significant assumptions are forward looking and could be affected by future economic and market conditions.\nGoodwill\nWe test goodwill at the reporting unit level for impairment on an annual basis and between annual tests if events and circumstances indicate it is more likely than not that the fair value of a reporting unit is less than its carrying value. Events that could indicate impairment and trigger an interim impairment assessment include, but are not limited to, current economic and market conditions, including a decline in market capitalization, a significant adverse change in legal factors, business climate, operational performance of the business or key personnel, and an adverse action or assessment by a regulator. Our annual impairment test date is the first day of our fiscal fourth quarter.\nIn performing the test, we use the single step quantitative approach prescribed under ASC 350, \nIntangibles\n—\nGoodwill and Other,\n and related amendments under ASU 2017-04. Under the quantitative impairment test, we perform a comparison of the reporting unit’s carrying value to its fair value. We consider a number of factors to determine the fair value of a reporting unit, including an independent valuation to conduct this test. The valuation is based upon expected future discounted operating cash flows of the reporting unit\n. We base the discount rate on the weighted average cost of capital, or WACC, of market participants. If the carrying value of a reporting unit exceeds its estimated fair value, we apply the single step approach under ASU 2017-04. As a result of this simplified approach the goodwill impairment is calculated as the amount by which the carrying value of the reporting unit exceeds its fair value to the extent of the goodwill balance.\nWe conducted our fiscal 2025 annual impairment test on the first day of the fourth quarter and utilized the quantitative approach. We used discounted cash flow analyses, or DCF, to estimate the fair value of our reporting units as of June 29, 2025 and make our impairment test conclusions. We believe we used reasonable estimates and assumptions about future revenue, cost projections, cash flows, and discount rates as of the measurement date. As a result of completing this analysis, all of our reporting units had fair values exceeding their carrying values.\nAt September 27, 2025, we believe that our reporting units, with goodwill aggregating $3.6 billion, were not at risk of failing the goodwill impairment test based on our current forecasts and quantitative assessment.\nSince the fair value of our reporting units was determined by use of the DCF, and the key assumptions that drive the fair value in this model are the WACC, terminal values, growth rates, and the amount and timing of expected future cash flows, significant judgment is applied in determining fair value. If the current economic environment were to deteriorate, this would likely result in a higher WACC because market participants would require a higher rate of return. In the DCF as the WACC increases, the fair value decreases. The other significant factor in the DCF is our projected financial information (i.e., amount and timing of expected future cash flows and growth rates) and if these assumptions were to be adversely impacted, this could result in a reduction of the fair value of a reporting unit.\n50\nTable of Contents\nIntangible Assets\nIntangible assets are initially recorded at fair value and stated net of accumulated amortization and impairments. We amortize intangible assets that have finite lives using either the straight-line method, or if reliably determinable, based on the pattern in which the economic benefit of the asset is expected to be utilized. We evaluate the recoverability of our definite lived intangible assets whenever events or changes in circumstances or business conditions indicate that the carrying value of these assets may not be recoverable based on expectations of future undiscounted cash flows for each asset group. If the carrying value of an asset or asset group exceeds its undiscounted cash flows, we estimate the fair value of the assets, generally utilizing a discounted cash flow analysis based on the present value of estimated future cash flows to be generated by the assets using a risk-adjusted discount rate. To estimate the fair value of the assets, the Company uses market participant assumptions pursuant to ASC 820, \nFair Value Measurements\n.\nRevenue Recognition\nWe generate revenue from the sale of our products, primarily medical imaging systems and diagnostic and surgical disposable products, and related services, which are primarily support and maintenance services on our medical imaging systems. See Note 3 for further discussion of revenue recognition.\nWe consider revenue to be earned when all of the following criteria are met: we have a contract with a customer that creates enforceable rights and obligations; promised products or services are identified; the transaction price, or the amount that we expect to receive, including an estimate of uncertain amounts subject to a constraint to ensure revenue is not recognized in an amount that would result in a significant reversal upon resolution of the uncertainty, is determinable; and we have transferred control of the promised items to the customer. A performance obligation is a promise in a contract to transfer a distinct good or service to the customer and is the unit of account in the contract. The transaction price for the contract is measured as the amount of consideration we expect to receive in exchange for the goods and services expected to be transferred. A contract’s transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, control of the distinct good or service is transferred. Transfer of control for our products is generally at shipment or delivery, depending on contractual terms, but occurs when title and risk of loss transfers to the customer which represents the point in time when the customer obtains the use of and substantially all of the remaining benefit of the product. As such, the performance obligation related to product sales is satisfied at a point in time. Revenue from support and maintenance contracts and extended warranties are recognized over time based on the contract term, which represents a faithful depiction of the transfer of goods and services given the stand-ready nature of the performance obligations. Service revenue related to professional services for installation, training and repairs is recognized as the services are performed based on the specific nature of the service.\nWe recognize receivables when we have an unconditional right to payment, which represents the amount we expect to collect in a transaction and is most often equal to the transaction price in the contract. Payment terms are typically 30 days in the U.S. but may be longer in international markets. We treat shipping and handling costs performed after a customer obtains control of the good as a fulfillment cost and record these costs within costs of product revenue when the corresponding revenue is recognized.\nGenerally the contracts for capital equipment include multiple performance obligations. For contracts with multiple performance obligations, we are required to allocate the transaction price to each performance obligation using our best estimate of the standalone selling price of each distinct good or service in the contract. We determine the best estimate of standalone selling price using average selling prices over 3- to 12-month periods of data depending on the products or nature of the services coupled with current market considerations. If the product or service does not have a history of sales or if sales volume is not sufficient, we rely on prices set by our pricing committees or applicable marketing department adjusted for expected discounts. \nWe exercise judgment in estimating variable consideration, which includes volume discounts, sales rebates, product returns and other adjustments. These amounts are recorded as a reduction to revenue and classified as a current liability. We base our estimates for volume discounts and sales rebates on historical information to the extent it is reasonable to be used as a predictive tool of expected future rebates. To the extent the transaction price includes variable consideration, we apply judgment in constraining the estimated variable consideration due to factors that may cause reversal of revenue recognized. We evaluate constraints based on our historical and projected experience with similar customer contracts. Our contracts for the sale of capital equipment and related components, and assays and tests typically do not provide the right to return product, however, our contracts for the sale of our interventional breast and surgical handpieces provide for a right of return for a limited period of time. In general, estimates of variable consideration and constraints are not material to our financial statements. \nWe also place instruments (or equipment) at customer sites but retain title to the instrument (for example, the ThinPrep Processor, ThinPrep Imaging System, Genius Digital Diagnostics System and the Panther and Panther Fusion systems). The customer has the right to use the instrument for a period of time, and then we recover the cost of providing the instrument \n51\nTable of Contents\nthrough the sales of disposables, namely tests and assays in Diagnostics and handpieces in GYN Surgical. These types of agreements include an embedded operating lease for the right to use an instrument and no instrument revenue is recognized at the time of instrument delivery. We recognize a portion of the revenue allocated to the embedded lease concurrent with the sale of disposables over the term of the agreement.\nIncome Taxes\nWe use the asset and liability method for accounting for income taxes in accordance with ASC 740, \nIncome Taxes\n. Under this method, we recognize deferred income tax assets and liabilities for the future tax consequences of differences between the financial statement carrying amount of existing assets and liabilities and their respective tax bases, and also for operating loss and tax credit carryforwards at each reporting period. We measure deferred tax assets and liabilities using enacted tax rates and laws applicable to the period and jurisdiction in which we expect the differences to affect taxable income. We evaluate both the positive and negative evidence that affects the realizability of net deferred tax assets and assess the need for a valuation allowance. The future benefit to be derived from our deferred tax assets is dependent upon our ability to generate sufficient future taxable income in each jurisdiction of the right type to realize the assets. We establish a valuation allowance when necessary to reduce deferred tax assets to the amounts expected to be realized. To the extent we establish or release a valuation allowance, a tax charge or benefit will be recorded as a component of the income tax provision on the statement of operations in the reporting period that such determination is made.\nAccounting for income taxes requires a two-step approach to recognize and measure uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if, based on the technical merits, it is more likely than not that the position will be sustained upon audit, including resolutions of related appeals or litigation processes, if any. The second step is to measure the tax benefit as the largest amount that is more than 50% likely of being realized upon ultimate settlement. We evaluate these uncertain tax positions on a quarterly basis. This evaluation is based on factors including, but not limited to, changes in facts or circumstances, changes in tax law, effectively settled issues under audit and new audit activity. Any change in these factors could result in the recognition of a tax benefit or an additional charge to the tax provision.\nIn the ordinary course of business, there are many transactions and calculations where the ultimate tax outcome is uncertain. Judgment is required in determining our worldwide income tax provision. In our opinion, we have made adequate provisions for income taxes for all years subject to audit. While we consider our estimates reasonable, no assurance can be given that the final tax outcome will not be different than amounts reflected in our historical income tax provisions and accruals. If our assumptions are incorrect, the differences could have a material impact on our income tax provision and operating results in the period in which such determination is made.",
  "item2": null
}