{
  "item1": "developer, manufacturer supplier premium diagnostics products, medical imaging systems, surgical products focused women’s health well-being through early detection treatment. sell service products through combination direct sales service personnel network independent distributors sales representatives. operate four segments: Diagnostics, Breast Health, GYN Surgical Skeletal Health. Through Diagnostics segment, offer wide range diagnostic products, which used primarily aid screening diagnosis human diseases.",
  "item7": "Segment Operating Loss Operating Loss % Segment Revenue Skeletal Health revenues increased fiscal 2025 compared fiscal 2024 primarily due increase product revenues discussed above. Operating loss increased fiscal 2025 compared fiscal 2024 primarily due decrease gross profit discussed above under cost product revenues, partially offset decrease operating expenses. Operating expenses decreased fiscal 2025 compared fiscal 2024 primarily due decrease marketing research development expenses. Fiscal Year Ended September 28, 2024 Compared Fiscal Year Ended September 30, 2023 LIQUIDITY CAPITAL RESOURCES September 27, 2025, working capital $2,690.9 million, cash cash equivalents totaled $1,959.5 million.",
  "item2": "Management’s Discussion Analysis Financial Condition Results Operations CAUTIONARY STATEMENT Some statements contained report documents incorporated reference herein forward-looking statements within meaning Section 27A Securities Act 1933, amended (the “Securities Act”), Section 21E Securities Exchange Act 1934, amended (the “Exchange Act”). These statements involve known unknown risks, uncertainties other factors which may cause industry’s actual results, performance achievements materially different any future results, performance achievements expressed implied forward-looking statements. Forward-looking statements may include, but not limited to, statements regarding: development new improved competitive technologies products; anticipated development markets sell products into success products these markets; ability predict accurately demand products, products under development develop strategies address markets successfully; anticipated performance benefits products; business strategies; effect consolidation healthcare industry; ability execute acquisitions impact anticipated benefits completed acquisitions acquisitions may complete future; coverage reimbursement decisions third-party payors; uncertainty impact cost containment efforts federal healthcare reform legislation business results operations; guidelines, recommendations, studies published various organizations relating use products; ability obtain maintain regulatory approvals clearances products, including implementation European Union Medical Device Vitro Diagnostic Regulation requirements, maintain compliance complex evolving regulations quality standards, well uncertainty costs required obtain maintain compliance such regulatory quality matters; possibility interruptions delays manufacturing facilities, failure secure alternative suppliers if any sole source third-party manufacturers fail supply us; possibility products may contain undetected errors defects otherwise not perform anticipated; ability successfully manage ongoing organizational strategic changes, including ability attract, motivate retain key employees maintain engagement efficiency remote work environments; impact costs expenses investigative legal proceedings compliance risks may subject now future; impact future tax legislation; ongoing possible future effects global challenges, including macroeconomic uncertainties, such inflation, bank failures, rising interest rates availability capital markets, wars, conflicts, other economic disruptions U.S. global recession concerns, customers suppliers business, financial condition, results operations cash flows ability draw down revolver; effect worldwide political social uncertainty divisions, including impact trade regulations tariffs, may adversely impact cost sale products certain countries, increase costs may incur purchase materials, parts equipment suppliers; conducting business internationally; potential cybersecurity threats targeted computer crime; ongoing possible future effects supply chain constraints, including availability critical raw materials components, well cost inflation materials, packaging transportation; ability consolidate certain manufacturing other operations timely basis within budget, without disrupting business achieve anticipated cost synergies related such actions; potential negative impacts resulting climate change other environmental, social, governance sustainability related matters; ability meet production delivery schedules products; effect any future public health pandemic other crises, including timing, scope effect U.S."
}