{
  "source_file": "hon-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n(Dollars in tables and graphs in millions, except per share amounts)\nThe following Management's Discussion and Analysis of Financial Condition and Results of Operations is intended to help the reader understand the results of operations and financial condition of Honeywell International Inc. and its consolidated subsidiaries (Honeywell, we, us, our, or the Company) for the three and nine months ended September 30, 2025. The financial information as of September 30, 2025, should be read in conjunction with the Consolidated Financial Statements for the year ended December 31, 2024, contained in our 2024 Annual Report on Form 10-K.\nBUSINESS UPDATE\nMACROECONOMIC CONDITIONS\nWe continue to monitor macroeconomic and geopolitical developments amid heightened trade tensions, economic and trade policy uncertainty, and inflationary risks. Trade policy volatility during 2025, including new tariffs and, in some cases, subsequent rollbacks or suspensions, could impact global growth and contribute to inflationary pressures. Global conflicts, tariffs, labor disruptions, and regulations continue to generate volatility in global markets and contribute to supply chain vulnerabilities and pricing fluctuations. We remain proactive in our collaboration with suppliers to minimize shortages and mitigate supply chain and pricing volatility.\nMitigation strategies remain crucial to meet customer demand in this evolving environment. Our mitigation strategies include supply chain simplification, continued alignment to local supply sources, pricing actions and dual source strategies, long-term strategies for constrained materials, direct engagement with key suppliers, and new supplier development. Strong relationships with strategic primary and secondary suppliers allow us to collaborate to reliably source key components and raw materials, develop new products, commit our resources to assist certain suppliers, and at times, alter designs of existing products. We believe these mitigation strategies enable us to reduce supply risk, foster new product innovation, and expand our market presence. Additionally, due to the stringent quality controls and product qualification we perform on any new or altered product, these mitigation strategies have not impacted, and we do not expect them to impact, product quality or reliability. \nTo date, our strategies helped minimize our exposure to these conditions. However, if we are not successful in sustaining or executing these strategies, these macroeconomic conditions could have a material adverse effect on our consolidated results of operations, cash flows, or financial condition.\nPORTFOLIO TRANSFORMATION\nWe continually assess the relative strength of each business in our portfolio as to strategic fit, market position, profit, and cash flow contribution in order to identify target investment and acquisition opportunities in order to upgrade our combined portfolio. We also identify businesses that do not fit into our long-term strategic plan based on their market position, relative profitability, or growth potential. During the second quarter of 2025, we completed the divestiture of our PPE business, as well as closed on the acquisition of Sundyne. We also announced our agreement to acquire Johnson Matthey's Catalyst Technologies business segment.\nOn October 8, 2024, we announced our intention to spin off our Advanced Materials business into Solstice Advanced Materials, Inc. (Solstice), an independent, U.S. publicly traded company. The spin-off will be a tax-free spin to Honeywell shareowners for U.S. federal income tax purposes. On October 1, 2025, we announced that our Board approved a record date of October 17, 2025 (Record Date) for the pro rata distribution of all of the issued and outstanding shares of Solstice to the holders of our common stock as of the close of business on the Record Date (Eligible Holders). On October 16, 2025, we announced that the Board approved the spin-off, which will be effective as of 12:01 a.m. (New York City time) on October 30, 2025 (Distribution Date). On the Distribution Date, the Eligible Holders will receive one share of Solstice common stock for every four shares of our common stock they hold as of the close of business on the Record Date. Completion of the Distribution is conditioned upon the satisfaction or waiver of certain conditions, as set forth in the form of Separation and Distribution Agreement filed with the SEC as part of the registration statement on Form 10 filed by Solstice, which was declared effective by the SEC on September 30, 2025.\n35    \nHoneywell International Inc.\nTABLE OF CONTENTS\nOn February 6, 2025, we announced our intention to pursue a separation of our Automation and Aerospace Technologies businesses into independent, U.S. publicly traded companies, which is expected to be completed in the second half of 2026. The planned separation is intended to be a tax-free separation to Honeywell shareowners for U.S. federal income tax purposes. The separation will be subject to the satisfaction of a number of customary conditions, including, among others, the filing and effectiveness of applicable filings (including a Form 10 registration statement that includes required financial statements) with the SEC, assurance that the separation of the businesses will be tax-free to Honeywell’s shareowners, receipt of applicable regulatory approvals, and final approval by our Board. The proposed separation is complex in nature, and may be affected by unanticipated developments, credit and equity markets, or changes in market conditions.\nOn July 8, 2025, we announced we are evaluating strategic alternatives for our Productivity Solutions and Services and Warehouse and Workflow Solutions businesses within the Industrial Automation reportable segment to further simplify Honeywell's portfolio and accelerate shareowner value creation ahead of our planned separation into three independent, U.S. publicly traded companies.\nLIABILITY MANAGEMENT REORGANIZATION\nOn June 23, 2025, we completed our previously announced reorganization (the “Liability Management Reorganization”) in connection with which: (i) certain of our asbestos-related assets and liabilities were allocated to a separate, wholly owned entity, (ii) certain assets and liabilities associated with certain sites for which we had or may have had environmental liabilities were allocated to a separate, wholly owned entity, (iii) certain assets and liabilities associated with certain other sites (not included in clause (ii) above) for which we had or may have had environmental liabilities were allocated to a separate, wholly owned entity, and (iv) all of our remaining assets and liabilities (i.e., all assets and liabilities not included in clauses (i)-(iii) above) were allocated to the Company. The reorganization is intended to provide us flexibility with respect to managing certain asbestos, environmental, and other liabilities, including any future strategic transactions involving such liabilities, and enable us to focus on our operating business, while efficiently managing potential asbestos liabilities, existing or future environmental liabilities and remediation obligations, and certain other liabilities. \nOn September 29, 2025, we permanently divested all of our legacy Bendix asbestos liabilities and certain non-Bendix asbestos liabilities (referenced in clause (i) above). We recorded a pre-tax loss of $148 million in the third quarter of 2025 related to the divested asbestos liabilities. Under the terms of the divestiture agreement, we contributed $1.4 billion in cash and derecognized $1.5 billion in asbestos liabilities and $0.1 billion of related insurance assets on September 29, 2025, which is after our quarter-end close date of September 27, 2025.\nSEGMENT REALIGNMENT\nIn October 2025, we announced a planned realignment, expected to be effective in the first quarter of 2026, of our business units comprising our Industrial Automation and Energy and Sustainability Solutions reportable business segments. This realignment will form a new reportable business segment, Process Automation and Technology, and result in a new composition of our Industrial Automation reportable business segment. Process Automation and Technology will be comprised of UOP, which is currently in Energy and Sustainability Solutions, and the core portion of the Process Solutions business, which is currently in Industrial Automation. The new composition of Industrial Automation will continue to include the smart energy, thermal solutions, and process measurement and control businesses, currently included in the Process Solutions business, as well as the Sensing and Safety Technologies, Warehouse and Workflow Solutions, and Productivity Solutions and Services businesses. Following the realignment, our reportable business segments will be Aerospace Technologies, Building Automation, Process Automation and Technology, and Industrial Automation. The realignment will not impact our historical consolidated financial position, results of operations, or cash flows. We expects to report our financial performance based on this realignment effective with the first quarter of 2026.\n36    \nHoneywell International Inc.\nTABLE OF CONTENTS\nRESULTS OF OPERATIONS\nConsolidated Financial Results\n37    \nHoneywell International Inc.\nTABLE OF CONTENTS\nNet Sales by Segment\n \n38    \nHoneywell International Inc.\nTABLE OF CONTENTS\nSegment Profit by Segment\n39    \nHoneywell International Inc.\nTABLE OF CONTENTS\nCONSOLIDATED OPERATING RESULTS\nNet Sales\nThe change in Net sales was attributable to the following:\nQ3 2025 vs. Q3 2024\nYear to Date 2025 vs. 2024\nVolume\n3%\n2%\nPrice\n3%\n3%\nForeign currency translation\n1%\n—%\nAcquisitions, divestitures, and other, net\n—%\n3%\n Total % change in Net sales\n7%\n8%\nA discussion of Net sales by reportable business segment can be found in the \nReview of Business Segments\n section of this Management's Discussion and Analysis.\nQ3 2025 compared with Q3 2024\nNet sales increased due to the following:\n•\nIncreased pricing and price adjustments to offset inflation, \n•\nHigher sales volumes, and\n•\nFavorable impact of foreign currency translation, driven by the weakening of the U.S. dollar against the euro. \nYTD 2025 compared with YTD 2024\nNet sales increased due to the following:\n•\nIncremental sales from recent acquisitions, \n•\nIncreased pricing and price adjustments to offset inflation, and\n•\nHigher sales volumes.\n40    \nHoneywell International Inc.\nTABLE OF CONTENTS\nCost of Products and Services Sold\nQ3 2025 compared with Q3 2024\nCost of products and services sold increased due to the following:\n•\nIncremental costs from recent acquisitions of approximately $0.2 billion or 3%,\n•\nAdjustment to estimated future environmental liabilities of approximately $0.2 billion or 3%,\n•\nHigher direct and indirect material costs and higher labor costs of approximately $0.2 billion or 3%, and\n•\nHigher sales volumes of approximately $0.2 billion or 3%.\nYTD 2025 compared with YTD 2024\nCost of products and services sold increased due to the following:\n•\nIncremental costs from recent acquisitions of approximately $0.8 billion or 5%,\n•\nHigher direct and indirect material costs and higher labor costs of approximately $0.5 billion or 3%, and\n•\nHigher sales volumes of approximately $0.4 billion or 2%.\nGross Margin\nQ3 2025 compared with Q3 2024\nGross margin decreased by approximately $0.2 billion and gross margin percentage decreased 440 basis points to 34.1% compared to 38.5% for the same period of 2024.\n41    \nHoneywell International Inc.\nTABLE OF CONTENTS\nYTD 2025 compared with YTD 2024\nGross margin increased by approximately $0.4 billion and gross margin percentage decreased 160 basis points to 37.1% compared to 38.7% for the same period of 2024.\nResearch and Development Expenses\nQ3 2025 compared with Q3 2024\nResearch and development expenses increased as a percentage of net sales due to increased investment in new product development in our Aerospace Technologies business.\nYTD 2025 compared with YTD 2024\nResearch and development expenses increased as a percentage of net sales due to increased investment in new product development in our Aerospace Technologies business.\nA summary of our research and development costs is as follows:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nCompany funded research and development expenses\n$\n497 \n$\n368 \n$\n1,417 \n$\n1,110 \nCustomer-sponsored research and development\n1\n270 \n267 \n797 \n817 \nTotal research and development costs\n$\n767\n \n$\n635\n \n$\n2,214\n \n$\n1,927\n \n1\nIncludes deferred customer funded nonrecurring engineering and development activities and expenditures on customer programs with a significant engineering performance obligation, included in Cost of products and services sold in the Consolidated Statement of Operations. \n42    \nHoneywell International Inc.\nTABLE OF CONTENTS\nSelling, General and Administrative Expenses\nQ3 2025 compared with Q3 2024\nSelling, general and administrative expenses decreased due to higher productivity.\nYTD 2025 compared to YTD 2024\nSelling, general and administrative expenses were flat compared to the same period in 2024.\nImpairment of Assets Held for Sale\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nImpairment of assets held for sale\n$\n— \n$\n125 \n$\n15 \n$\n125 \nQ3 2025 compared with Q3 2024\nAn impairment charge was recorded on assets held for sale related to the PPE business during the three months ended September 30, 2024.\nYTD 2025 compared to YTD 2024\nAn impairment charge was recorded on assets held for sale related to the PPE business during the nine months ended September 30, 2025 and 2024. \nOther (Income) Expense\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nOther (income) expense\n$\n(822)\n$\n(263)\n$\n(1,109)\n$\n(740)\nQ3 2025 compared with Q3 2024\nOther income increased due to the following: \n•\nGain recognized on Resideo termination agreement of approximately $0.8 billion,\n•\nPartially offset by higher divestiture-related costs of approximately $0.2 billion.\nYTD 2025 compared to YTD 2024\nOther income increased due to the following: \n•\nGain recognized on Resideo termination agreement of approximately $0.8 billion,\n•\nPartially offset by higher divestiture-related costs of approximately $0.4 billion.\n43    \nHoneywell International Inc.\nTABLE OF CONTENTS\nInterest and Other Financial Charges\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nInterest and other financial charges\n$\n354 \n$\n297 \n$\n970 \n$\n767 \nQ3 2025 compared with Q3 2024\nInterest and other financial charges increased due to increased debt funding to support acquisitions and higher interest rates on long-term debt issuances in August 2024.\nYTD 2025 compared to YTD 2024\nInterest and other financial charges increased due to increased debt funding to support acquisitions and higher interest rates on long-term debt issuances in August 2024.\nTax Expense\nQ3 2025 compared with Q3 2024\nThe effective tax rate decreased 610 basis-points due to the following:\n•\nNontaxable return of basis on the Resideo termination agreement of 860 basis-points and\n•\nChanges in estimate on prior tax positions of 760 basis-points,\n•\nPartially offset by frictional tax costs on separations of 640 basis-points and \n•\nIncremental tax expense for tax reserve activities of 410 basis-points. \nYTD 2025 compared with YTD 2024\nThe effective tax rate decreased 340 basis-points due to the following:\n•\nNontaxable return of basis on the Resideo termination agreement of 320 basis-points and \n•\nChanges in estimate on prior tax positions of 280 basis-points,\n•\nPartially offset by frictional tax costs on separations of 270 basis-points. \n44    \nHoneywell International Inc.\nTABLE OF CONTENTS\nNet Income Attributable to Honeywell\nQ3 2025 compared to Q3 2024\nEarnings per share of common stock–assuming dilution increased due to the following:\n•\nGain recognized on Resideo termination agreement ($1.23 after tax) and\n•\nLower impairment charges on assets held for sale ($0.19 after tax), \n•\nPartially offset by higher divestiture-related costs ($0.53 after tax) and \n•\nAdjustment to estimated future environmental liabilities ($0.25 after tax).\nYTD 2025 compared with YTD 2024\nEarnings per share of common stock–assuming dilution increased due to the following:\n•\nGain recognized on Resideo termination agreement ($1.22 after tax) and\n•\nHigher segment profit ($0.53 after tax), \n•\nPartially offset by higher divestiture-related costs ($0.70 after tax) and\n•\nAdjustment to estimated future environmental liabilities ($0.25 after tax). \nBACKLOG\nOur backlog of orders increased 14% to $39.1 billion, as of September 30, 2025, compared to September 30, 2024. Backlog represents the estimated remaining value of work to be performed or products to be shipped under firm contracts. Backlog is equal to our remaining performance obligations under the contracts that meet the guidance on revenue from contracts with customers as discussed in Note 4 \nRevenue Recognition and Contracts with Customers\n of Notes to Consolidated Financial Statements. Our backlog by reportable business segment is as follows:\n \nSeptember 30, 2025\nAerospace Technologies\n$\n17,503 \nIndustrial Automation\n5,435 \nBuilding Automation\n9,050 \nEnergy and Sustainability Solutions\n7,078 \nCorporate and All Other\n1\n21 \nTotal backlog\n$\n39,087\n \n1\nThe backlog within Corporate and All Other relates to the Quantinuum business.\n45    \nHoneywell International Inc.\nTABLE OF CONTENTS\nREVIEW OF BUSINESS SEGMENTS\nWe globally manage our business operations through four reportable business segments: Aerospace Technologies, Industrial Automation, Building Automation, and Energy and Sustainability Solutions.\nAEROSPACE TECHNOLOGIES\nNet Sales\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nNet sales\n$\n4,511 \n$\n3,912 \n15 \n%\n$\n12,990 \n$\n11,472 \n13 \n%\nCost of products and services sold\n2,844 \n2,446 \n8,154 \n7,081 \nSelling, general and administrative and other expenses\n489 \n384 \n1,461 \n1,214 \nSegment profit\n$\n1,178\n \n$\n1,082\n \n9\n \n%\n$\n3,375\n \n$\n3,177\n \n6\n \n%\n2025 vs. 2024\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\nFactors Contributing to Year-Over-Year Change\nNet\nSales\nSegment\nProfit\nNet\nSales\nSegment\nProfit\nOrganic\n1\n12 \n%\n9 \n%\n9 \n%\n5 \n%\nForeign currency translation\n— \n%\n— \n%\n— \n%\n— \n%\nAcquisitions, divestitures, and other, net\n3 \n%\n— \n%\n4 \n%\n1 \n%\nTotal % change\n15\n \n%\n9\n \n%\n13\n \n%\n6\n \n%\n1\nOrganic sales % change, presented for all of our reportable business segments, is defined as the change in Net sales, excluding the impact on sales from foreign currency translation and acquisitions, net of divestitures, for the first 12 months following the transaction date. We believe this non-GAAP measure is useful to investors and management in understanding the ongoing operations and analysis of ongoing operating trends.\nQ3 2025 compared to Q3 2024\nSales increased $599 million due to higher organic sales of $327 million in Commercial Aviation Aftermarket and higher organic sales of $147 million in Defense and Space, both driven by higher sales volumes due to increased demand and shipments. Additionally, the acquisitions of CAES and Civitanavi Systems contributed $108 million of inorganic sales in the three months ended September 30, 2025. Beginning September 2025, the results of CAES and Civitanavi Systems are considered organic following the first 12 months after the transaction date.\n46    \nHoneywell International Inc.\nTABLE OF CONTENTS\nSegment profit increased $96 million and segment margin percentage decreased 160 basis points to 26.1% compared to 27.7% for the same period of 2024.\nYTD 2025 compared to YTD 2024\nSales increased $1,518 million due to higher organic sales of $688 million in Commercial Aviation Aftermarket and higher organic sales of $462 million in Defense and Space, both driven by higher sales volumes due to increased demand and shipments. Additionally, the acquisitions of CAES and Civitanavi Systems contributed $485 million of inorganic sales in the nine months ended September 30, 2025.\nSegment profit increased $198 million and segment margin percentage decreased 170 basis points to 26.0% compared to 27.7% for the same period of 2024.\nOn February 6, 2025, the Company announced its intention to separate its Automation and Aerospace Technologies businesses into independent, U.S. publicly traded companies, which is expected to be completed in the second half of 2026.\nINDUSTRIAL AUTOMATION\nNet Sales\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nNet sales\n$\n2,274 \n$\n2,501 \n(9)\n%\n$\n7,032 \n$\n7,485 \n(6)\n%\nCost of products and services sold\n1,345 \n1,461 \n \n4,105 \n4,358 \nSelling, general and administrative and other expenses\n501 \n532 \n \n1,619 \n1,668 \nSegment profit\n$\n428\n \n$\n508\n \n(16)\n%\n$\n1,308\n \n$\n1,459\n \n(10)\n%\n2025 vs. 2024\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\nFactors Contributing to Year-Over-Year Change\nNet\nSales\nSegment\nProfit\nNet\nSales\nSegment\nProfit\nOrganic\n1 \n%\n(10)\n%\n(1)\n%\n(6)\n%\nForeign currency translation\n1 \n%\n1 \n%\n— \n%\n— \n%\nAcquisitions, divestitures, and other, net\n(11)\n%\n(7)\n%\n(5)\n%\n(4)\n%\nTotal % change\n(9)\n%\n(16)\n%\n(6)\n%\n(10)\n%\n47    \nHoneywell International Inc.\nTABLE OF CONTENTS\nQ3 2025 compared to Q3 2024\nSales decreased $227 million due to a decline of $264 million resulting from the sale of our PPE business on May 21, 2025.\nSegment profit decreased $80 million and segment margin percentage decreased 150 basis points to 18.8% compared to 20.3% for the same period in 2024.\nYTD 2025 compared to YTD 2024\nSales decreased $453 million due to a decline of $405 million resulting from the sale of our PPE business on May 21, 2025 and lower organic sales of $78 million in Productivity Solutions and Services driven by a decrease in license and settlement payments.\nDuring the second quarter of 2022, our Productivity Solutions and Services business entered into a license and settlement agreement (the Agreement). Under the Agreement, we received $360 million, paid in equal quarterly installments over eight quarters, beginning with the second quarter of 2022 and ending with the first quarter of 2024. The Agreement provides each party a license to its existing patent portfolio for use by the other party's existing products and resolved the patent-related litigation between the parties.\nSegment profit decreased $151 million and segment margin percentage decreased 90 basis points to 18.6% compared to 19.5% for the same period in 2024.\nOn July 8, 2025, the Company announced it is evaluating strategic alternatives for its Productivity Solutions and Services and Warehouse and Workflow Solutions businesses.\nBUILDING AUTOMATION\nNet Sales\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nNet sales\n$\n1,878 \n$\n1,745 \n8 \n%\n$\n5,396 \n$\n4,742 \n14 \n%\nCost of products and services sold\n990 \n926 \n2,802 \n2,534 \nSelling, general and administrative and other expenses\n386 \n367 \n1,173 \n1,009 \nSegment profit\n$\n502\n \n$\n452\n \n11\n \n%\n$\n1,421\n \n$\n1,199\n \n19\n \n%\n48    \nHoneywell International Inc.\nTABLE OF CONTENTS\n \n2025 vs. 2024\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\nFactors Contributing to Year-Over-Year Change\nNet\nSales\nSegment\nProfit\nNet\nSales\nSegment\nProfit\nOrganic\n7 \n%\n10 \n%\n8 \n%\n11 \n%\nForeign currency translation\n1 \n%\n1 \n%\n— \n%\n— \n%\nAcquisitions, divestitures, and other, net\n— \n%\n— \n%\n6 \n%\n8 \n%\nTotal % change\n8\n \n%\n11\n \n%\n14\n \n%\n19\n \n%\nQ3 2025 compared to Q3 2024\nSales increased $133 million due to higher organic sales of $68 million in Products and higher organic sales of $49 million in Building Solutions, both driven by higher demand.\nSegment profit increased $50 million and segment margin percentage increased 80 basis points to 26.7% compared to 25.9% for the same period of 2024.\nYTD 2025 compared to YTD 2024\nSales increased $654 million due to higher organic sales of $203 million in Products and higher organic sales of $153 million in Building Solutions, both driven by higher demand. Additionally, the acquisition of Access Solutions contributed $302 million of inorganic sales in the nine months ended September 30, 2025. Beginning June 2025, the results of Access Solutions are considered organic following the first 12 months after the transaction date.\nSegment profit increased $222 million and segment margin percentage increased 100 basis points to 26.3% compared to 25.3% for the same period of 2024.\nENERGY AND SUSTAINABILITY SOLUTIONS\nNet Sales\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n%\nChange\n2025\n2024\n%\nChange\nNet sales\n$\n1,742 \n$\n1,563 \n11 \n%\n$\n5,140 \n$\n4,692 \n10 \n%\nCost of products and services sold\n1,118 \n957 \n3,248 \n2,952 \n \nSelling, general and administrative and other expenses\n197 \n223 \n676 \n649 \n \nSegment profit\n$\n427\n \n$\n383\n \n11\n \n%\n$\n1,216\n \n$\n1,091\n \n11\n \n%\n49    \nHoneywell International Inc.\nTABLE OF CONTENTS\n2025 vs. 2024\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\nFactors Contributing to Year-Over-Year Change\nNet\nSales\nSegment\nProfit\nNet\nSales\nSegment\nProfit\nOrganic\n(2)\n%\n(8)\n%\n1 \n%\n(3)\n%\nForeign currency translation\n1 \n%\n— \n%\n1 \n%\n— \n%\nAcquisitions, divestitures, and other, net\n12 \n%\n19 \n%\n8 \n%\n14 \n%\nTotal % change\n11\n \n%\n11\n \n%\n10\n \n%\n11\n \n%\nQ3 2025 compared to Q3 2024\nSales increased $179 million due to higher organic sales of $47 million in Advanced Materials driven by increased pricing in fluorine products, offset by lower organic sales of $85 million in UOP driven by lower sales volumes in refining catalyst shipments. Additionally, the acquisitions of Sundyne and LNG contributed $202 million of inorganic sales in the three months ended September 30, 2025.\nSegment profit increased $44 million and segment margin percentage was flat at 24.5% compared to the same period of 2024.\nYTD 2025 compared to YTD 2024\nSales increased $448 million driven by the acquisitions of LNG and Sundyne.\nSegment profit increased $125 million and segment margin percentage increased 40 basis points to 23.7% compared to 23.3% for the same period of 2024.\nOn October 1, 2025, the Company announced the anticipated spin-off its Advanced Materials business into Solstice Advanced Materials, an independent, U.S. publicly traded company, is expected to be completed on October 30, 2025.\nCORPORATE AND ALL OTHER\nCorporate and All Other primarily includes unallocated corporate costs, interest expense on holding-company debt, and the controlling majority-owned interest in Quantinuum. Corporate and All Other is not a separate reportable business segment as segment reporting criteria is not met. The Company continues to monitor the activities in Corporate and All Other to determine the need for further reportable business segment disaggregation.\nREPOSITIONING CHARGES\nSee Note 5 \nRepositioning and Other \n(Gains) \nCharges\n of Notes to Consolidated Financial Statements for a discussion of our repositioning actions and related charges incurred in the nine months ended September 30, 2025, and 2024. Cash spending related to our repositioning actions was $117 million in the nine months ended September 30, 2025, and was funded through operating cash flows.\n50    \nHoneywell International Inc.\nTABLE OF CONTENTS\nLIQUIDITY AND CAPITAL RESOURCES\n(Dollars in tables in millions)\nWe leverage operating cash flows as the primary source of liquidity. Each of our businesses focuses on increasing operating cash flows through revenue growth, margin expansion, and improved working capital turnover. We also maintain other key sources of liquidity, including U.S. cash balances, and the ability to access non-U.S. cash balances, short-term debt from the commercial paper market, long-term borrowings, committed credit lines, and access to the public debt and equity markets.\nCASH\nAs of September 30, 2025, and December 31, 2024, we held $13.4 billion and $11.0 billion, respectively, of cash and cash equivalents, including our short-term investments. We monitor third-party depository institutions that hold our cash and cash equivalents on a daily basis. Our emphasis is primarily safety of principal and secondarily maximizing yield of those funds. We diversify our cash and cash equivalents among counterparties to minimize exposure to any one counterparty.\nAs of September 30, 2025, we held $9.9 billion of the Company’s cash, cash equivalents, and short-term investments in non-U.S. subsidiaries. We do not have material amounts related to any jurisdiction subject to currency control restrictions that impact our ability to access and repatriate such amounts. Under current laws, we do not expect taxes on repatriation or restrictions on amounts held outside of the U.S. to have a material effect on our overall liquidity.\nCASH FLOW SUMMARY\nOur cash flows from operating, investing, and financing activities, as reflected in the Consolidated Statement of Cash Flows, are summarized as follows:\nNine Months Ended September 30,\n2025\n2024\nVariance\nCash and cash equivalents at beginning of period\n$\n10,567\n \n$\n7,925\n \n$\n2,642\n \nOperating activities\nNet income attributable to Honeywell\n4,844 \n4,420 \n424 \nNoncash adjustments\n742 \n935 \n(193)\nChanges in working capital\n(1,229)\n(593)\n(636)\nResideo indemnification and reimbursement agreement termination payment\n1,590 \n— \n1,590 \nOther operating activities\n(743)\n(946)\n203 \nNet cash provided by operating activities\n5,204\n \n3,816\n \n1,388\n \nNet cash used for investing activities\n(2,368)\n(8,202)\n5,834 \nNet cash (used for) provided by financing activities\n(640)\n7,058 \n(7,698)\nEffect of foreign exchange rate changes on cash and cash equivalents\n167 \n47 \n120 \nNet increase in cash and cash equivalents\n2,363\n \n2,719\n \n(356)\nCash and cash equivalents at end of period\n$\n12,930\n \n$\n10,644\n \n$\n2,286\n \nNine months ended September 30, 2025\nNet cash provided by operating activities was driven by the receipt of the Resideo indemnification and reimbursement agreement termination payment of $1,590 million, partially offset by changes in working capital driven by an increase in accounts receivable of $1,035 million due to timing of customer cash collections. \nNet cash used for investing activities was driven by $2,200 million of cash paid for acquisitions, $928 million of capital expenditures, and $403 million of net payments from settlements of derivative contracts, partially offset by $1,157 million of proceeds from the sale of the PPE business. \nNet cash used for financing activities was driven by $3,704 million of repurchases of common stock, $2,214 million of cash dividends paid, and $1,555 million of payments of long-term debt, partially offset by $4,035 million of long-term debt proceeds and $2,460 million of net proceeds from commercial paper. \n51    \nHoneywell International Inc.\nTABLE OF CONTENTS\nNine months ended September 30, 2025 compared with nine months ended September 30, 2024\nNet cash provided by operating activities increased by $1,388 million, driven by the receipt of the Resideo indemnification and reimbursement agreement termination payment of $1,590 million and increase in Net income of $424 million, partially offset by an unfavorable impact of working capital driven by an increase in accounts receivable of $817 million due to timing of customer cash collections.\nNet cash used for investing activities decreased by $5,834 million, driven by a $4,847 million decrease in cash paid for acquisitions and $1,157 million of proceeds from the sale of the PPE business.\nNet cash used for financing activities increased by $7,698 million, driven by a $6,372 million decrease in long-term debt proceeds and $2,504 million increase in repurchases common stock, partially offset by a $1,421 million increase in net proceeds from commercial paper.\nSee Note 15 \nCommitments and Contingencies\n for further discussion of the Resideo indemnification and reimbursement agreement termination.\nASSESSMENT OF CURRENT LIQUIDITY AND CASH REQUIREMENTS\nBased on past performance and current expectations, we believe our operating cash flows will be sufficient to meet our future operating cash needs for at least the next twelve months. If necessary, our available cash, committed credit lines, and access to the public debt and equity markets provide additional sources of short-term and long-term liquidity to fund current operations, debt maturities, and future investment opportunities.\nSee Note 9 \nDebt and Credit Agreements\n of Notes to Consolidated Financial Statements for additional discussion of items impacting our liquidity.\nIn addition to normal operating cash requirements, our principal future cash requirements include funding capital expenditures, share repurchases, dividends, strategic acquisitions, and debt repayments. During the nine months ended September 30, 2025, we repurchased common stock of $3.7 billion. Refer to the section titled Liquidity and Capital Resources of our 2024 Form 10-K for a discussion of our expected capital expenditures, share repurchases, mergers and acquisitions activity, and dividends for 2025.\nWe continually assess the relative strength of each business in our portfolio as to strategic fit, market position, profit, and cash flow contribution in order to identify target investment and acquisition opportunities in order to upgrade our combined portfolio. We seek to identify acquisition candidates that will further our strategic plan and strengthen our existing core businesses. In the second quarter of 2025, we acquired Sundyne for total consideration of $2.2 billion, net of cash acquired, as well as announced our agreement to acquire Johnson Matthey's Catalyst Technologies business segment for £1.8 billion. We also identify businesses that do not fit into our long-term strategic plan based on their market position, relative profitability, or growth potential. These businesses are considered for potential divestiture, restructuring, or other repositioning actions, subject to regulatory constraints. On February 6, 2025, we announced our intention to separate the Automation and Aerospace Technologies businesses into independent, U.S. publicly traded companies, which is expected to be completed in the second half of 2026. On May 21, 2025, we completed the sale of our PPE business for $1.2 billion, net of cash transferred. On July 8, 2025, we announced we are evaluating strategic alternatives for our Productivity Solutions and Services and Warehouse and Workflow Solutions businesses within the Industrial Automation reportable business segment. On October 16, 2025, we announced the Board approved the spin-off of the Advanced Materials business into Solstice Advanced Materials, an independent, U.S. publicly traded company, which will be effective on October 30, 2025. See Note 3 \nAcquisitions and Divestitures\n, Note 15 \nCommitments and Contingencies\n, and Note 19 \nSubsequent Events\n of Notes to Consolidated Financial Statements for additional discussion.\nWe continually seek opportunities to improve our liquidity and working capital efficiency, which includes the extension of payment terms with our suppliers and transfer of our trade receivables to unaffiliated financial institutions on a true sale basis. The impact of these programs is not material to our overall liquidity.\n52    \nHoneywell International Inc.\nTABLE OF CONTENTS\nBORROWINGS\nWe leverage a variety of debt instruments to manage our overall borrowing costs. As of September 30, 2025, and December 31, 2024, our total borrowings were $37.0 billion and $31.1 billion, respectively.\nSeptember 30, 2025\nDecember 31, 2024\nFixed rate notes\n$\n25,270 \n$\n25,853 \nCommercial paper\n6,873 \n4,271 \nTerm loans\n5,000 \n1,000 \nVariable rate notes\n22 \n22 \nOther\n247 \n392 \nFair value of hedging instruments\n(83)\n(136)\nDebt issuance costs\n(292)\n(303)\nTotal borrowings\n$\n37,037\n \n$\n31,099\n \nA key source of liquidity is our ability to access the corporate bond markets. Through these markets, we issue a variety of long-term fixed rate notes to manage our overall funding costs.\nAnother key source of liquidity is our ability to access the commercial paper market. Commercial paper notes are sold at a discount or premium and have a maturity of not more than 365 days from date of issuance. Borrowings under the commercial paper program are available for general corporate purposes as well as for financing acquisitions.\nIn addition, we have the following loan and revolving credit agreements:\n•\nA $6.0 billion Delayed Draw Term Loan Agreement (the Term Loan Agreement), dated as of May 7, 2025. The Term Loan Agreement is comprised of two tranches: (i) commitments to provide loans in an aggregate principal amount of up to $4.0 billion, which was fully drawn effective May 30, 2025, and (ii) commitments to provide loans in an aggregate amount of up to $2.0 billion, expiring on December 19, 2025. Amounts borrowed under the Term Loan Agreement are required to be paid no later than May 7, 2027, unless the Term Loan Agreement is terminated earlier pursuant to its terms. As of September 30, 2025, there were $4.0 billion of borrowings outstanding on the Term Loan Agreement. \n•\nA $3.0 billion 364-day credit agreement (the 364-Day Credit Agreement) with a syndicate of banks, dated as of March 17, 2025. Amounts borrowed under the 364-Day Credit Agreement are required to be repaid no later than March 16, 2026, unless (i) we elect to convert all then outstanding amounts into a term loan, upon which such amounts shall be repaid in full on March 16, 2027, or (ii) the 364-Day Credit Agreement is terminated earlier pursuant to its terms. The 364-Day Credit Agreement replaced the previously reported $1.5 billion 364-day credit agreement dated as of March 18, 2024, which was terminated in accordance with its terms effective March 17, 2025. As of September 30, 2025, there were no outstanding borrowings under our 364-Day Credit Agreement.\n•\nA $1.0 billion Fixed Rate Term Loan Credit Agreement (the Fixed Rate Term Loan Credit Agreement), dated as of August 12, 2024. Amounts borrowed under the Fixed Rate Term Loan Credit Agreement are required to be repaid no later than August 12, 2027, unless the Fixed Rate Term Loan Credit Agreement is terminated earlier pursuant to its terms. As of September 30, 2025, there were $1.0 billion of borrowings outstanding under the Fixed Rate Term Loan Credit Agreement.\n•\nA $4.0 billion five-year credit agreement (the Five-Year Credit Agreement) with a syndicate of banks, dated as of March 18, 2024. Commitments under the Five-Year Credit Agreement can be increased pursuant to the terms of the Five-Year Credit Agreement to an aggregate amount not to exceed $4.5 billion. As of September 30, 2025, there were no outstanding borrowings under our Five-Year Credit Agreement.\nSee Note 9 \nDebt and Credit Agreements\n of Notes to Consolidated Financial Statements for additional information regarding our debt instruments.\nWe also maintain a current shelf registration statement filed with the SEC under which we may issue additional debt securities, common stock, and preferred stock that may be offered in one or more offerings on terms to be determined at the time of the offering. We anticipate that net proceeds of any offering would be used for general corporate purposes, including repayment of existing indebtedness, share repurchases, capital expenditures, and acquisitions.\n53    \nHoneywell International Inc.\nTABLE OF CONTENTS\nCREDIT RATINGS\nOur ability to access the global debt capital markets and the related cost of these borrowings is affected by the strength of our credit rating and market conditions. Our credit ratings are periodically reviewed by the major independent debt-rating agencies. As of September 30, 2025, S&P Global Inc. (S&P), Fitch Ratings Inc. (Fitch), and Moody’s Investor Service (Moody's) have ratings on our debt set forth in the table below:\nS&P\nFitch\nMoody's\nOutlook\nWatch Negative\nWatch Negative\nStable\nShort-term\nA-1\nF1\nP1\nLong-term\nA\nA\nA2\nOTHER MATTERS\nLITIGATION\nSee Note 15 \nCommitments and Contingencies\n of Notes to Consolidated Financial Statements for further discussion of environmental, asbestos, and other litigation matters.\nCRITICAL ACCOUNTING ESTIMATES\nThere have been no material changes to our Critical Accounting Estimates presented in our 2024 Annual Report on Form 10-K. For a discussion of the Company’s Critical Accounting Estimates, see the section titled Critical Accounting Estimates in our 2024 Annual Report on Form 10-K.\nRECENT ACCOUNTING PRONOUNCEMENTS\nSee Note 2 \nSummary of Significant Accounting Policies\n of Notes to Consolidated Financial Statements for a discussion of recent accounting pronouncements."
}