{
  "source_file": "hood-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis section presents management’s perspective on our financial condition and results of operations, including performance metrics that management uses to assess company performance. The following discussion and analysis is intended to highlight and supplement data and information presented elsewhere in this Quarterly Report, and should be read in conjunction with our interim unaudited condensed consolidated financial statements and notes elsewhere in this Quarterly Report and our audited consolidated financial statements and the related notes and the discussion under the heading “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in our 2024 Form 10-K. It is also intended to provide you with information that will assist you in understanding our consolidated financial statements, the changes in key items in those consolidated financial statements from year to year, and the primary factors that accounted for those changes. To the extent that this discussion describes prior performance, the descriptions relate only to the periods listed, which might not be indicative of our future financial outcomes. In addition to historical information, this discussion contains forward-looking statements that involve risks, uncertainties and assumptions that could cause results to differ materially from management’s expectations. Factors that could cause such differences are discussed in the sections titled “Cautionary Note Regarding Forward-Looking Statements” and “Risk Factors.”\nData as of and for the three and nine months ended September 30, 2024 and 2025 has been derived from our unaudited condensed consolidated financial statements appearing at the beginning of this Quarterly Report. Results for any interim period should not be construed as an inference of what our results would be for any full fiscal year or future period.\nWe refer to our “users” and our “customers” interchangeably throughout this Quarterly Report to refer to individuals who hold accounts on our platforms. \nKey Performance Metrics\nIn addition to the measures presented in our unaudited condensed consolidated financial statements, we use the following key performance metrics to help us evaluate our business, identify trends affecting our business, formulate business plans, and make strategic decisions. \n•\nFunded Customers: \nWe define a Funded Customer as a unique person who has at least one account with a Robinhood entity and, within the past 45 calendar days (a) had an account balance that was greater than zero (excluding amounts that are deposited into a Funded Customer account by the Company with no action taken by the unique person) or (b) completed a transaction using any such account. \nIndividuals who share a funded joint investing account (which launched in July 2024) are each considered to be a Funded Customer. Starting in Q1 2025, individuals who are customers of RIAs that use the TradePMR platform, and, starting in June 2025, customers of Bitstamp, are also considered Funded Customers. \n•\nTotal Platform Assets\n: \nWe define Total Platform Assets as the sum of the fair value of all equities, options, cryptocurrency, futures (including options on futures, swaps, and event contracts), cash held by users in their accounts, net of receivables from users (previously reported as Assets Under Custody), and any such assets managed by RIAs using TradePMR’s platform that are not custodied by Robinhood, as of a stated date or period end on a trade date basis. Net Deposits and net market gains (losses) drive the change in Total Platform Assets in \n40\nTable of Contents\nany given period. Starting in June 2025, the fair value of all cryptocurrency includes cryptocurrency on Bitstamp.\n•\nNet Deposits:\n We define Net Deposits as all cash deposits and asset transfers from customers, as well as dividends, interest, and cash or assets earned in connection with Company promotions (such as account transfer and retirement match incentives, free stock bonuses, and lending and staking rewards by Bitstamp) received by customers, net of reversals, customer cash withdrawals, margin interest, Robinhood Gold subscription fees, and assets transferred off of our platforms for a stated period. \nStarting in June 2025, Net Deposits include results from Bitstamp. Due to data limitations, we have not included TradePMR client figures in our Net Deposits \nkey performance metric\n.\n•\nAverage Revenue Per User (“ARPU”)\n: We define ARPU as total revenue for a given period divided by the average number of Funded Customers on the last day of that period and the last day of the immediately preceding period. Figures in this Quarterly Report represent ARPU annualized for each three-month period presented.\n•\nRobinhood Gold Subscribers: \nWe define a Robinhood Gold Subscriber as a unique person who has at least one account with a Robinhood entity and who, as of the end of the relevant period (a) is subscribed to Robinhood Gold and (b) has made at least one Robinhood Gold subscription fee payment.\nGlossary Terms\n•\nAutomated Customer Account Transfer Service (“ACATS”)\n: A system that automates and standardizes procedures for the transfer of assets in a customer account from one brokerage firm and/or bank to another.\n•\nCash Sweep\n: We define Cash Sweep as the period-end total amount of participating users’ uninvested brokerage cash that has been automatically “swept” or moved from their brokerage accounts into deposits for their benefit at a network of program banks. This is an off-balance-sheet amount. Robinhood earns a net interest spread on Cash Sweep balances based on the interest rate offered by the banks less the interest rate given to users as stated in our program terms. \nThis includes balances from customers of RIAs using TradePMR\n’\ns platform. \n•\nChurned Customers:\n A Funded Customer is considered “Churned” if it was ever a New Funded Customer whose account balance (measured as the fair value of assets in the account less any amount due from the user and excluding amounts that are deposited into a Funded Customer account by the Company with no action taken by the unique person) drops to or below zero and has not completed a transaction using any account with a Robinhood entity for at least 45 consecutive calendar days. Negative balances typically result from Fraudulent Deposit Transactions (which occur when users initiate deposits into their accounts, make trades on our platforms using a short-term extension of credit from us, and then repatriate or reverse the deposits, resulting in a loss to us of the credited amount) and unauthorized debit card use, and less often, from margin loans. \n•\nGrowth Rate and Annualized Growth Rate with respect to Net Deposits: \nGrowth rate is calculated as aggregate Net Deposits over a specified 12-month period, divided by Total Platform Assets for the fiscal quarter that immediately precedes such 12-month period. Annualized growth rate is calculated as Net Deposits for a specified quarter multiplied by 4 and divided by Total Platform Assets for the immediately preceding quarter.\n•\nInvestment Accounts:\n We define an Investment Account as a funded individual brokerage account, a funded joint investing account, a funded individual retirement account (“IRA”), or an account with an RIA using TradePMR’s platform. As of September 30, 2025, a Funded Customer \n41\nTable of Contents\ncan have multiple Investment Accounts - one or more individual brokerage accounts, a joint investing account, a traditional IRA, a Roth IRA, and/or an RIA custody account using TradePMR’s platform. Investment Accounts do not include Bitstamp as such accounts are not brokerage or other Investment Accounts.\n•\nMargin Book:\n We define Margin Book as our period-end aggregate outstanding margin loan balances receivable (i.e., the period-end total amount we are owed by customers on loans made for the purchase of securities, supported by a pledge of assets in their margin-enabled brokerage accounts). \nThis includes margin loan balances from customers of RIAs using TradePMR\n’\ns platform.\n•\nNew Funded Customers:\n We define a New Funded Customer as a unique person who became a Funded Customer for the first time during the relevant period. \n•\nNotional Trading Volume: \nWe define Notional Trading Volume, or Notional Volume, for any specified asset class as the aggregate dollar value (purchase price or sale price as applicable) of trades executed in that asset class on our platforms over a specified period of time. Crypto Notional Volume includes both Robinhood App Notional Volume and, starting in June 2025, Bitstamp Notional Volume. Robinhood App Notional Volume represents the dollar value of executed crypto trades on the Robinhood platform over a specified period of time. Bitstamp Notional Volume represents the dollar value of executed crypto trades on the Bitstamp platform over a specified period of time. For example, each $1 of transaction value executed between a buyer and seller is counted as $1 of transaction value in the relevant period, rather than $2 if counted for each of the buyer and seller.\n•\nOptions Contracts Traded:\n We define Options Contracts Traded as the total number of options contracts bought or sold over a specified period of time. Each contract generally entitles the holder to trade 100 shares of the underlying stock.\n•\nResurrected Customers:\n A Funded Customer is considered “Resurrected” in a stated period if it was a Churned Customer as of the end of the immediately preceding period and its balance (excluding amounts that are deposited into a Funded Customer account by the Company with no action taken by the unique person) rises above zero or it completes a transaction using its account.\nOverview\nRobinhood was founded on the belief that everyone should be welcome to participate in our financial system. We are creating modern financial services platforms for everyone, regardless of their wealth, income, or background. \nOur mission is to democratize finance for all. We use technology to provide access to the financial system in a way that is simple and convenient for our customers. We believe investing should be familiar and welcoming, with a simple design and an intuitive interface, so that customers are empowered to achieve their goals. We started with a revolutionary, bold brand and design in the Robinhood app which makes investing approachable for millions. Over the last decade, we have disrupted and changed the industry, becoming the first U.S. retail broker to offer commission-free stock trading with no account minimums, which was subsequently adopted by the rest of the industry. In recent years, we have continued to build relationships with our customers by introducing new products and diversifying our services that further expand access to the financial system, including focusing on products and tools for more seasoned investors. Through these efforts, we believe we have made investing culturally relevant and understandable, and that our platforms are enabling our customers to become long-term investors and take greater control of their finances. \n42\nTable of Contents\nFinancial Results and Performance \nWith respect to the three months ended September 30, 2025, as compared to the three months ended September 30, 2024:\n•\ntotal net revenues increased 100% to $1,274 million compared to $637 million; \n•\nnet income increased 271% to $556 million, compared to $150 million;\n•\ndiluted EPS increased 259% to $0.61 compared to $0.17;\n•\ntotal operating expenses increased 31% to $639 million compared to $486 million;\n◦\nSBC expense decreased 1% to\n \n$78 million compared to $79 million;\n•\nAdjusted EBITDA (non-GAAP) increased 177%\n to\n \n$742 million\n compared to \n$268 million\n;\n•\nFunded Customers increased by 2.5 million, or 10%, to 26.8 million compared to 24.3 million, and Investment Accounts increased by 2.8 million, or 11%, to 27.9 million compared to 25.1 million;\n•\nTotal Platform Assets\n \nincreased 119% to $332.7 billion compared to $152.2 billion, driven by continued Net Deposits, higher equity and cryptocurrency valuations, and acquired assets;\n•\nNet Deposits were $20.4 billion, which translates to an annualized growth rate of 29% relative to Total Platform Assets at the end of the second quarter of 2025, compared to $10.0 billion, which translates to an annualized growth rate of 29% relative to Total Platform Assets at the end of the second quarter of 2024. Over the past twelve months, Net Deposits were $68.3 billion, a growth rate of 45% relative to Total Platform Assets at the end of the third quarter of 2024;\n•\nARPU increased 82% to $191 compared to $105; and\n•\nRobinhood Gold Subscribers increased 1.69 million, or 77%, to 3.88 million compared to 2.19 million.\nAdjusted EBITDA is a non-GAAP financial measure. For more information about Adjusted EBITDA, including the definition and limitations of such measure, and a reconciliation of net income to Adjusted EBITDA, please see “—Non-GAAP Financial Measures” below.\nKey Performance Metrics\nKey performance metrics for the relevant periods were as follows: \nThree Months Ended\nSeptember 30,\n2024\n2025\n% Change\nFunded Customers\n(1) \n(in millions)\n24.3\n26.8\n10 \n%\nTotal Platform Assets\n(2)\n \n(in billions)\n \n$\n152.2\n$\n332.7\n119 \n%\nNet Deposits\n (in billions)\n$\n10.0\n$\n20.4\nNM\nAnnualized Growth Rate with respect to Net Deposits\n29%\n29%\nNM\nARPU \n(in dollars)\n$\n105\n$\n191\n82 \n%\nRobinhood Gold Subscribers\n (in millions)\n2.19\n3.88\n77 \n%\n43\nTable of Contents\n________________\n(1)\nThe following table describes the annual changes within Funded Customers:\nThree Months Ended\nSeptember 30,\n(in millions)\n2024\n2025\n% Change\nBeginning Funded Customers\n24.2 \n26.5 \n10 \n%\nNew Funded Customers\n0.4 \n0.7 \n75 \n%\nResurrected Customers\n0.1 \n0.1 \n— \n%\nChurned Customers\n(0.4)\n(0.5)\n25 \n%\nEnding Funded Customers\n24.3 \n26.8 \n10 \n%\n(2)\nThe following table sets out the components of Total Platform Assets by type of asset:\nThree Months Ended\nSeptember 30,\n(in billions)\n2024\n2025\n% Change\nEquities\n$\n106.4 \n$\n203.0 \n91 \n%\nCryptocurrencies\n19.5 \n51.1 \n162 \n%\nOptions and futures\n1.2 \n3.9 \n225 \n%\nRIA assets\n— \n42.2 \nNM\nCash held by Customers\n30.6 \n46.3 \n51 \n%\nReceivables from Customers (primarily margin balances)\n(5.5)\n(13.8)\n151 \n%\nTotal Platform Assets\n$\n152.2 \n$\n332.7 \n119 \n%\nThe following table describes the changes within Total Platform Assets:\nThree Months Ended\nSeptember 30,\n(in billions)\n2024\n2025\n% Change\nBeginning Total Platform Assets\n$\n139.7 \n$\n278.6 \n99 \n%\nNet Deposits\n10.0 \n20.4 \nNM\nNet market gains\n2.5 \n33.7 \nNM\nEnding Total Platform Assets\n$\n152.2 \n$\n332.7 \n119 \n%\nNon-GAAP Financial Measures\nAdjusted EBITDA\nWe collect and analyze operating and financial data to evaluate the health of our business, allocate our resources and assess our performance. In addition to total net revenues, net income, and other results under GAAP, we utilize non-GAAP calculations of adjusted earnings before interest, taxes, depreciation, and amortization (“Adjusted EBITDA”). Adjusted EBITDA is defined as net income, excluding (i) interest expenses related to credit facilities, (ii) provision for (benefit from) income taxes, (iii) depreciation and amortization, (iv) SBC, (v) significant legal and tax settlements and reserves, and (vi) other significant gains, losses, and expenses (such as impairments, restructuring charges, and business acquisition- or disposition-related expenses) that we believe are not indicative of our ongoing results. This non-GAAP financial information is presented for supplemental informational purposes only, should not be considered in isolation or as a substitute for, or superior to, financial information presented in accordance with GAAP, and may be different from similarly titled non-GAAP measures used by other companies.\nThe above items are excluded from our Adjusted EBITDA measure because these items are non-cash in nature, or because the amount and timing of these items are unpredictable, are not driven by core results of operations, and render comparisons with prior periods and competitors less meaningful. We believe Adjusted EBITDA provides useful information to investors and others in understanding and evaluating our results of operations, as well as providing a useful measure for period-to-period \n44\nTable of Contents\ncomparisons of our business performance. Moreover, Adjusted EBITDA is a key measurement used by our management internally to make operating decisions, including those related to operating expenses, evaluate performance, and perform strategic planning and annual budgeting. \nThe following table presents a reconciliation of Adjusted EBITDA to the most directly comparable GAAP measure, net income:\nThree Months Ended\n September 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2024\n2025\n2024\n2025\nNet income\n$\n150 \n$\n556 \n$\n495 \n$\n1,278 \nAdd:\nInterest expenses related to credit facilities \n6 \n8 \n18 \n22 \nProvision for income taxes\n3 \n78 \n11 \n169 \nDepreciation and amortization\n20 \n22 \n55 \n63 \nEBITDA (non-GAAP)\n179 \n664 \n579 \n1,532 \nAdd:\nSBC\n79 \n78 \n227 \n229 \nSignificant legal and tax settlements and reserves\n10 \n— \n10 \n— \nAdjusted EBITDA (non-GAAP)\n$\n268 \n$\n742 \n$\n816 \n$\n1,761 \n45\nTable of Contents\nResults of Operations \nThe following table summarizes our unaudited condensed consolidated statements of operations data:\n(in millions)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2024\n2025\n2024\n2025\nRevenues:\nTransaction-based revenues\n$\n319 \n$\n730 \n$\n975 \n$\n1,852 \nNet interest revenues\n274 \n456 \n813 \n1,103 \nOther revenues\n44 \n88 \n149 \n235 \nTotal net revenues\n637 \n1,274 \n1,937 \n3,190 \nOperating expenses\n(1)\n:\nBrokerage and transaction \n39 \n56 \n114 \n154 \nTechnology and development\n205 \n237 \n610 \n665 \nOperations\n27 \n33 \n83 \n93 \nProvision for credit losses\n23 \n26 \n57 \n78 \nMarketing\n59 \n102 \n190 \n306 \nGeneral and administrative\n133 \n185 \n385 \n450 \nTotal operating expenses\n486 \n639 \n1,439 \n1,746 \nOther income (loss), net\n2 \n(1)\n8 \n3 \nIncome before income taxes\n153 \n634 \n506 \n1,447 \nProvision for income taxes\n3 \n78 \n11 \n169 \nNet income\n$\n150 \n$\n556 \n$\n495 \n$\n1,278 \n_______________\n(1)\nIncludes SBC expense as follows:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2024\n2025\n2024\n2025\nBrokerage and transaction \n$\n2 \n$\n2 \n$\n7 \n$\n7 \nTechnology and development\n48\n40 \n144\n123 \nOperations\n1 \n1 \n5 \n4 \nMarketing\n3 \n2 \n6 \n6 \nGeneral and administrative\n25 \n33 \n65 \n89 \nTotal SBC expense\n$\n79 \n$\n78 \n$\n227 \n$\n229 \n46\nTable of Contents\nComparison of the Three and Nine Months Ended September 30, 2024 and 2025\nRevenues\nTransaction-Based Revenues\nThree Months Ended\n September 30,\nNine Months Ended\nSeptember 30,\n(in millions, except for percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nTransaction-based revenues:\nOptions\n$\n202\n$\n304\n50 \n%\n$\n538\n$\n809\n50 \n%\nCryptocurrencies\n61\n268\n339 \n%\n268\n680\n154 \n%\nEquities\n37\n86\n132 \n%\n116\n208\n79 \n%\nOther\n19\n72\n279 \n%\n53\n155\n192 \n%\nTotal transaction-based revenues\n$\n319\n$\n730\n129 \n%\n$\n975\n$\n1,852\n90 \n%\nTransaction-based revenues as a % of total net revenues:\nOptions\n32%\n23%\n28%\n25%\nCryptocurrencies\n9%\n21%\n14%\n21%\nEquities\n6%\n7%\n6%\n7%\nOther\n3%\n6%\n2%\n5%\nTotal transaction-based revenues\n50%\n57%\n50%\n58%\nTransaction-based revenues increased by $411 million and $877 million for the three and nine months ended September 30, 2025, primarily driven by increases of $207 million and $412 million in cryptocurrencies, $102 million and $271 million in options, and $49 million and $92 million in equities. In addition, other transaction-based revenues increased by $53 million and $102 million primarily driven by increased user activities in prediction markets and instant withdrawals.\nCryptocurrencies revenues increased primarily driven by a 92% and 45% increase in the number of users placing cryptocurrency trades and a  36% and 2% increase in the average Notional Trading Volume traded per trader. Additionally, cryptocurrencies revenues increased as a result of a higher rebate rate from crypto market makers. Cryptocurrencies revenues was partially offset by $9 million and $29 million of certain incentives paid to our customers.\nOptions revenues increased primarily driven by a 27% and 21% increase in the number of users placing option trades and a 6% and 9% increase in Options Contracts Traded per trader. In addition, we experienced higher option rebate rates due to the mix of ticker symbols traded as different ticker symbols pay different rebate rates. The increase was partially offset by $24 million and $72 million of certain incentives paid to our customers.\nEquities revenues increased primarily driven by a 78% and 73% increase in the average Notional Trading Volume traded per trader and a 24% and 18% increase in the number of users placing equity trades. For the nine months ended September 30, 2025, the increase was partially offset by lower equity rebate rates due to the mix of ticker symbols traded as different ticker symbols pay different rebate rates.\n47\nTable of Contents\nNet Interest Revenues\nThree Months Ended\n September 30,\nNine Months Ended\nSeptember 30,\n(in millions, except for percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nNet interest revenues:\nMargin interest\n$\n83 \n$\n153 \n84 \n%\n$\n228 \n$\n377 \n65 \n%\nInterest on segregated cash, cash equivalents, securities, and deposits\n61 \n103 \n69 \n%\n187 \n236 \n26 \n%\nCash Sweep\n46 \n64 \n39 \n%\n129 \n172 \n33 \n%\nSecurities lending, net\n19 \n87 \n358 \n%\n68 \n164 \n141 \n%\nInterest on corporate cash and investments \n67 \n39 \n(42)\n%\n203 \n134 \n(34)\n%\nCredit card, net\n4 \n17 \n325 \n%\n16 \n40 \n150 \n%\nInterest expenses related to credit facilities\n(6)\n(8)\n33 \n%\n(18)\n(22)\n22 \n%\nOther \n— \n1 \nNM\n— \n2 \nNM\nTotal net interest revenues\n$\n274 \n$\n456 \n66 \n%\n$\n813 \n$\n1,103 \n36 \n%\nNet interest revenues as a % of total net revenues:\nMargin interest\n13 \n%\n12 \n%\n12 \n%\n12 \n%\nInterest on segregated cash, cash equivalents, securities, and deposits\n10 \n%\n9 \n%\n10 \n%\n8 \n%\nCash Sweep\n7 \n%\n5 \n%\n7 \n%\n6 \n%\nSecurities lending, net\n3 \n%\n7 \n%\n4 \n%\n5 \n%\nInterest on corporate cash and investments \n10 \n%\n3 \n%\n9 \n%\n4 \n%\nCredit card, net\n1 \n%\n1 \n%\n1 \n%\n1 \n%\nInterest expenses related to credit facilities\n(1)\n%\n(1)\n%\n(1)\n%\n(1)\n%\nOther\n— \n%\n— \n%\n— \n%\n— \n%\nTotal net interest revenues\n43 \n%\n36 \n%\n42 \n%\n35 \n%\nNet interest revenues increased by $182 million and $290 million for the three and nine months ended September 30, 2025, primarily driven by growth in our interest-earning asset balances and securities lending activities. The increase was partially offset by a decrease in interest revenue on corporate cash and investments driven by lower cash and cash equivalents balances and a lower short-term interest rate environment. We anticipate any potential future rate cuts by the Federal Reserve will negatively impact our net interest revenues and adversely affect our customers’ returns on cash deposits.\n48\nTable of Contents\nThe following table summarizes interest-earning assets, the revenue generated by these assets, and their respective annualized yields:\n(in millions, except for annualized yield)\nMargin Book\nCash and deposits\n(1)\nCash Sweep \n(off-balance sheet)\nCredit card, net\n(2)\nTotal interest-earning assets\nSecurities lending, net\nInterest expenses related to credit facilities\n(5)\nOther\nTotal net interest revenues\nThree Months Ended September 30, 2025\nSeptember 30, 2025\n$\n13,938 \n$\n14,352 \n$\n35,370 \n$\n742 \n$\n64,402\n \nJune 30, 2025\n9,457 \n14,045 \n32,719 \n562 \n56,783\n \nAverage\n(3)\n11,812 \n14,340 \n33,947 \n667 \n60,766\n \nRevenue (expense)\n$\n153 \n$\n142 \n$\n64 \n$\n17 \n$\n376\n \n$\n87 \n$\n(8)\n$\n1 \n$\n456\n \nAnnualized yield\n(4)\n5.18%\n3.96%\n0.75%\n10.19 \n%\n2.48%\n3.00%\nThree Months Ended June 30, 2025\nJune 30, 2025\n$\n9,457 \n$\n14,045 \n$\n32,719 \n$\n562 \n$\n56,783\n \nMarch 31, 2025\n8,802 \n9,763 \n28,187 \n429 \n47,181\n \nAverage\n(3)\n8,912 \n11,815 \n30,148 \n513 \n51,388\n \nRevenue (expense)\n$\n114 \n$\n123 \n$\n60 \n$\n13 \n$\n310\n \n$\n54 \n$\n(8)\n$\n1 \n$\n357\n \nAnnualized yield\n(4)\n5.12%\n4.16%\n0.80%\n10.14 \n%\n2.41%\n2.78%\nThree Months Ended September 30, 2024\nSeptember 30, 2024\n$\n5,499 \n$\n11,149 \n$\n24,485 \n$\n309 \n$\n41,442\n \nJune 30, 2024\n4,956 \n10,164 \n20,858 \n212 \n36,190\n \nAverage\n(3)\n5,350 \n10,055 \n22,473 \n270 \n38,148\n \nRevenue (expense)\n$\n83 \n$\n128 \n$\n46 \n$\n4 \n$\n261\n \n$\n19 \n$\n(6)\n$\n— \n$\n274\n \nAnnualized yield\n(4)\n6.21%\n5.09%\n0.82%\n5.93%\n2.74%\n2.87%\nNine Months Ended September 30, 2025\nSeptember 30, 2025\n$\n13,938 \n$\n14,352 \n$\n35,370 \n$\n742 \n$\n64,402\n \nDecember 31, 2024\n7,909 \n9,943 \n26,064 \n391 \n44,307\n \nAverage\n(3)\n9,843 \n12,109 \n30,234 \n534 \n52,720\n \nRevenue (expense)\n$\n377 \n$\n370 \n$\n172 \n$\n40 \n$\n959\n \n$\n164 \n$\n(22)\n$\n2 \n$\n1,103\n \nAnnual yield\n(4)\n5.11%\n4.07%\n0.76%\n9.99%\n2.42%\n2.78%\nNine Months Ended September 30, 2024\nSeptember 30, 2024\n$\n5,499 \n$\n11,149 \n$\n24,485 \n$\n309 \n$\n41,442\n \nDecember 31, 2023\n3,458 \n10,107 \n16,352 \n205 \n30,122\n \nAverage\n(3)\n4,511 \n10,075 \n19,958 \n228 \n34,772\n \nRevenue (expense)\n$\n228 \n$\n390 \n$\n129 \n$\n16 \n$\n763\n \n$\n68 \n$\n(18)\n$\n— \n$\n813\n \nAnnual yield\n(4)\n6.74%\n5.16%\n0.86%\n9.36%\n2.93%\n3.12%\n__________\n(1) \nIncludes c\nash and cas\nh equivalents, restricted cash, segregated cash, cash equivalents, and securities under federal and other regulations, deposits with clearing organizations, and investments.\n(2) \nCredit card, net consists of i) an off-balance sheet amount representing customer principal amounts funded by Coastal Bank under the Program Agreement. Under the Program Agreement, Robinhood Credit collects interest from customers that carry a balance and pays interest on the amount funded by Coastal Bank, with the difference between those amounts resulting in net interest revenue and ii) an on-balance sheet amount representing purchased credit card receivables by the Credit Card Funding Trust. Robinhood Credit collects interest from customers that carry balances and pays interest on the amount funded through the Credit Card Funding Trust, with the difference in those amounts resulting in net interest revenues. As of \nSeptember 30, 2025\n, the off-balance sheet amount funded under the Program agreement was \n$207 million\n and the on-balance sheet amount was $535 million\n. Refer to \nNote 10 - Financing Activities and Off-Balance Sheet Risk to our unaudited condensed consolidated financial statements in this Quarterly Report for more information. \n(3)\n Average balance rows represent the simple average of month-end balances in a given period.\n(4)\n Annualized yield is calculated by annualizing revenue for the given period and dividing by the applicable average asset balance. \n(5) \nIncludes interest expenses related to our revolving credit facilities; interest expense related to the Credit Card Funding Trust is included in the credit card, net interest yield calculation. \nRefer to \nNote 10 - Financing Activities and Off-Balance Sheet Risk to our unaudited condensed consolidated financial statements in this Quarterly Report for more information. \n49\nTable of Contents\nOther Revenues\nThree Months Ended\n September 30,\nNine Months Ended\nSeptember 30,\n(in millions, except for percentages)\n2024\n2025\n% Change\n2024\n2025\n% Change\nOther revenues:\nRobinhood Gold subscription revenues\n$\n28\n$\n47\n68 \n%\n$\n77\n$\n129\n68 \n%\nProxy revenues\n8\n7\n(13)\n%\n53\n52\n(2)\n%\nOther\n8\n34\n325 \n%\n19\n54\n184 \n%\nTotal other revenues \n$\n44\n$\n88\n100 \n%\n$\n149\n$\n235\n58 \n%\nOther revenues as a % of total net revenues:\nRobinhood Gold subscription revenues\n5 \n%\n4 \n%\n4 \n%\n4 \n%\nProxy revenues\n1 \n%\n1 \n%\n3 \n%\n2 \n%\nOther\n1 \n%\n2 \n%\n1 \n%\n1 \n%\nOther revenues as a % of total net revenues\n7 \n%\n7 \n%\n8 \n%\n7 \n%\nOther revenues increased $44 million and $86 million for the three and nine months ended September 30, 2025 primarily driven by an increase in Robinhood Gold subscription revenues of $19 million and $52 million due to an increase in Robinhood Gold Subscribers. In addition, other revenues increased $26 million and $35 million primarily driven by higher revenues from increased IPO offerings and  acquisition related revenues. \nOperating Expenses\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions, except for percentages)\n2024\n2025\n% Change \n2024\n2025\n% Change\nOperating expenses:\nBrokerage and transaction \n$\n39\n$\n56\n44 \n%\n$\n114\n$\n154\n35 \n%\nTechnology and development\n205\n237\n16 \n%\n610\n665\n9 \n%\nOperations\n27\n33\n22 \n%\n83\n93\n12 \n%\nProvision for credit losses\n23\n26\n13 \n%\n57\n78\n37 \n%\nMarketing\n59\n102\n73 \n%\n190\n306\n61 \n%\nGeneral and administrative\n133\n185\n39 \n%\n385\n450\n17 \n%\nTotal operating expenses\n$\n486\n$\n639\n31 \n%\n$\n1,439\n$\n1,746\n21 \n%\nPercent of total net revenues:\nBrokerage and transaction \n6 \n%\n4 \n%\n6 \n%\n5 \n%\nTechnology and development\n32 \n%\n19 \n%\n31 \n%\n21 \n%\nOperations\n4 \n%\n3 \n%\n4 \n%\n3 \n%\nProvisions for credit losses \n4 \n%\n2 \n%\n3 \n%\n2 \n%\nMarketing\n9 \n%\n8 \n%\n10 \n%\n10 \n%\nGeneral and administrative\n21 \n%\n14 \n%\n20 \n%\n14 \n%\nTotal operating expenses\n76 \n%\n50 \n%\n74 \n%\n55 \n%\n50\nTable of Contents\nBrokerage and Transaction \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2024\n2025\n% Change \n2024\n2025\n% Change\nEmployee compensation, benefits, and overhead, excluding SBC\n$\n9\n$\n14\n56%\n$\n27 \n$\n36 \n33%\nMarket data expenses\n7\n9\n29%\n19 \n25 \n32%\nInstant withdrawals\n5\n9\n80%\n14 \n25 \n79%\nCustomer statements\n4\n4\n—%\n11 \n12 \n9%\nSBC\n2\n2\n—%\n7 \n7 \n—%\nOther \n12\n18\n50%\n36 \n49 \n36%\nTotal\n$\n39\n$\n56\n44%\n$\n114 \n$\n154 \n35%\nBrokerage and transaction costs increased by $17 million and $40 million for the three and nine months ended September 30, 2025. Brokerage and transaction costs included a $6 million and $13 million increase in other brokerage and transactions costs primarily related to credit card network and processing fees and a $5 million and $9 million increase in employee compensation, benefits, and overhead expenses due to increased average headcount to continue to support the growth and expansion of our business. Instant withdrawals expenses increased $4 million and $11 million as a result of higher customer activities. Additionally, market data expenses increased $2 million and $6 million primarily due to higher trading volumes. \nTechnology and Development\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2024\n2025\n% Change \n2024\n2025\n% Change\nEmployee compensation, benefits, and overhead, excluding SBC\n$\n67\n$\n90\n34 \n%\n$\n216\n$\n241\n12 \n%\nCloud infrastructure services\n49\n54\n10 \n%\n138\n156\n13 \n%\nSBC\n48\n40\n(17)\n%\n144\n123\n(15)\n%\nSoftware and tools\n32\n40\n25 \n%\n90\n113\n26 \n%\nOther \n9\n13\n44 \n%\n22\n32\n45 \n%\nTotal \n$\n205\n$\n237\n16 \n%\n$\n610\n$\n665\n9 \n%\nTechnology and development costs increased by $32 million and $55 million for the three and nine months ended September 30, 2025, primarily due to increases of $23 million and $25 million  in employee compensation, benefits, and overhead expenses due to increased average headcount to support the expansion into new products. Additionally, software and tool expenses increased by $8 million and $23 million, and cloud infrastructure services increased by $5 million and $18 million primarily to support integration from acquisitions and the continued growth of our business. These increases were partially offset by decreases in SBC of $8 million and $21 million attributed to higher values for stock awards issued in prior periods.\n51\nTable of Contents\nOperations\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2024\n2025\n% Change \n2024\n2025\n% Change\nEmployee compensation, benefits, and overhead, excluding SBC\n$\n18\n$\n21\n17%\n$\n54\n$\n57\n6%\nCustomer experience\n4\n5\n25%\n13\n16\n23%\nSBC\n1\n1\n—%\n5\n4\n(20)%\nOther \n4\n6\n50%\n11\n16\n45%\nTotal \n$\n27\n$\n33\n22%\n$\n83 \n$\n93 \n12%\nOperations costs increased by $6 million and $10 million for the three and nine months ended September 30, 2025, primarily due to increases in other operations expense primarily related to costs associated with customer onboarding and account verification due to the growth of our customer base. \nProvision for credit losses \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2024\n2025\n% Change \n2024\n2025\n% Change\nProvision for credit losses - credit card related\n$\n17\n$\n23\n35%\n$\n41\n$\n55\n34%\nProvision for credit losses - brokerage related\n6\n3\n(50)%\n16\n23\n44%\nTotal \n$\n23\n$\n26\n13%\n$\n57 \n$\n78\n37%\nProvision for credit losses costs increased by \n$3 million\n and \n$21 million\n for the three and nine months ended September 30, 2025, \nprimarily driven by an increase in credit card related provision for credit losses mainly due to higher balances in purchased credit card receivables.\nMarketing\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2024\n2025\n% Change \n2024\n2025\n% Change\nDigital marketing \n$\n26 \n$\n42 \n62 \n%\n$\n85 \n$\n136 \n60 \n%\nBrand marketing\n5 \n19 \n280 \n%\n32 \n64 \n100 \n%\nEmployee compensation, benefits, and overhead, excluding SBC\n9 \n11 \n22 \n%\n24 \n31 \n29 \n%\nMarketing incentives\n4 \n6 \n50 \n%\n10 \n14 \n40 \n%\nCreative services\n4 \n5 \n25 \n%\n9 \n12 \n33 \n%\nSBC\n3 \n2 \n(33)\n%\n6 \n6 \n— \n%\nOther\n8 \n17 \n113 \n%\n24 \n43 \n79 \n%\nTotal \n$\n59\n$\n102\n73 \n%\n$\n190 \n$\n306 \n61 \n%\nMarketing costs \nincreased\n by $43 million \nand \n$116 million \nfor the three and nine months ended September 30, 2025 primarily due to higher expenses in digital marketing of \n$16 million\n and \n$51 million\n and brand marketing of \n$14 million\n and \n$32 million\n, as we increased our investments in paid marketing channels and other marketing initiatives to promote our brand, products, and services. Other marketing \n52\nTable of Contents\ncosts increased \n$9 million \nand \n$19 million\n primarily due to expenses related to our Robinhood Gold card and keynote events.\nGeneral and Administrative\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2024\n2025\n% Change \n2024\n2025\n% Change\nEmployee compensation, benefits, and overhead, excluding SBC\n$\n57 \n$\n83 \n46 \n%\n$\n175 \n$\n209 \n19 \n%\nSBC\n25 \n33 \n32 \n%\n65 \n89 \n37 \n%\nLegal expenses\n13 \n25 \n92 \n%\n62 \n53 \n(15)\n%\nOther professional fees\n11 \n16 \n45 \n%\n34 \n48 \n41 \n%\nSettlements and penalties\n13 \n1 \n(92)\n%\n20 \n6 \n(70)\n%\nOther\n14 \n27 \n93 \n%\n29 \n45 \n55 \n%\nTotal\n$\n133 \n$\n185\n39 \n%\n$\n385 \n$\n450 \n17 \n%\nGeneral and administrative costs \nincreased\n by $52 million and\n \n$65 million\n for the three and nine months ended September 30, 2025 primarily due to increases of \n$26 million\n and \n$34 million\n in employee compensation, benefits, and overhead expenses driven by payroll taxes related to the vesting of Market-Based RSUs and increased average headcount. SBC expenses increased \n$8 million\n and \n$24 million\n primarily driven by expenses recognized for shares granted in connection with acquisitions. SBC expense for the nine months ended September 30, 2024 included an \n$11 million\n reversal of previously recognized expenses as a result of the resignation of our co-founder and former Chief Creative Officer. Other general and administrative expenses increased \n$13 million\n and \n$16 million\n primarily driven by expenses to support business expansion. Additionally, legal expenses increased \n$12 million\n for the three months ended September 30, 2025 in relation to new product offerings. These increases were partially offset by decreases of \n$12 million\n and \n$14 million\n in settlement and penalties associated with certain historical matters.\nProvision for Income Taxes \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2024\n2025\n% Change\n2024\n2025\n% Change\nProvision for income taxes\n$\n3 \n$\n78 \nNM\n$\n11 \n$\n169 \nNM\nProvision for income taxes increased by $75 million and $158 million for the three and nine months ended September 30, 2025 primarily due the valuation allowance release of the U.S. federal and certain state deferred tax assets in the fourth quarter of 2024 and the growth of the business.\nOn July 4, 2025, the President of the United States signed into law the One Big Beautiful Bill Act (“ OBBBA”). The OBBBA introduces broad changes to the U.S. tax code, including permitting the immediate deduction of domestic research and experimentation expenditures, allowing full expensing of acquired qualified property, and increasing the U.S. tax rate on intangible income derived from foreign sources. We believe the recent tax legislation changes provided under the OBBBA do not materially impact our income tax provision. \nLiquidity and Capital Resources\nSources and Uses of Funds \n53\nTable of Contents\n Our principal sources of liquidity are cash flows generated from operations and our cash, cash equivalents, and investments. Other sources of future funds may include potential borrowing under our revolving lines of credit and potential issuance of new debt or equity. Our liquidity needs are primarily to support and invest in our core business, including investing in new ways to serve our customers, potentially seeking strategic acquisitions to leverage existing capabilities and further build our business, and for general capital needs (including capital requirements imposed by regulators and SROs and cash deposit and collateral requirements under the rules of the Depository Trust Company (“DTC”), the NSCC, the Options Clearing Corporation (“OCC”), and the Commodity Futures Trading Commission (“CFTC”)). Based on our current level of operations, we believe our primary sources of liquidity will be adequate to meet our current liquidity needs for the next 12 months.\nLiquid Assets \nAs of September 30, 2025, we had cash and cash equivalents of $4.33 billion and held-to-maturity investments of $53 million. Refer to Note 7 - Investments and Fair Value Measurement, to our unaudited condensed consolidated financial statements in this Quarterly Report for further information. \nRevolving Credit Facilities and Credit Card Funding Trust \nAs of September 30, 2025, we had committed revolving credit facilities with a total borrowing capacity of up to $3.775 billion and a borrowing capacity for our Credit Card Funding Trust of up to $650 million. \nRefer to \nNote 10 - Financing Activities and Off-Balance Sheet Risk to our unaudited condensed consolidated financial statements in this Quarterly Report for further information. \nCommitments\nThe following table summarizes our short- and long-term material cash requirements for contractual obligations as of September 30, 2025:\nPayments Due by Period\n(in millions)\nTotal\nRemainder of 2025\n2026-2027\n2028-2029\nThereafter\nOperating lease commitments\n(1)\n$\n174 \n$\n8 \n$\n44 \n$\n53 \n$\n69 \nPurchase commitments\n(2)\n611 \n235 \n368 \n7 \n1 \nRobinhood match incentives commitments\n(3)\n57 \n15 \n42 \n— \n— \nCredit Card Funding Trust borrowing principal and interest\n378 \n378 \n— \n— \n— \nTotal\n$\n1,220 \n$\n636 \n$\n454 \n$\n60 \n$\n70 \n    \n_______________\n(1)\n Operating lease commitments include tenant improvement allowance incentives amortized over the lease terms from 2025 to 2026. \n(2)\n Purchase commitments are determined based on the non-cancelable quantities or termination amounts to which we are contractually obligated. These primarily relate to commitments for cloud infrastructure, data se\nrvices and business insurance. \n(3)\n Robinhood match incentives commitments represent non-cancelable future match payments on eligible cash deposits made by Robinhood Gold Subscribers\n. The future match payments are forfeited if deposits are not held on the platform during the specific earning period.\nIn addition to lease and purchase commitments, we have two committed financing agreements: one with a contractual term of 30 days and a daily minimum commitment of $25 million and another with a contractual term of 21 days with a daily minimum commitment of $35 million.\n54\nTable of Contents\nRegulatory Capital Requirements\nOur broker-dealer subsidiaries (RHS, RHF, and TradePMR) are subject to Rule 15c3-1 (the \n“\nSEC Uniform Net Capital Rule\n”\n) under the Exchange Act, administered by the SEC and FINRA, which requires the maintenance of minimum net capital, as defined. Net capital and the related net capital requirements may fluctuate on a daily basis. RHS and RHF compute net capital under the alternative method as permitted by the SEC Uniform Net Capital Rule. \nOur Futures Commission Merchant (“FCM”) subsidiary, RHD, is subject to CFTC Regulation 1.17, administered by the CFTC and the NFA, which requires the maintenance of minimum net capital, as defined by CFTC Regulation 1.17. Net capital and the related net capital requirements may fluctuate on a daily basis. \nThe table below summarizes the net capital, capital requirements, and excess net capital of RHS, RHF, RHD, and TradePMR as of periods presented:\nSeptember 30, 2025\n(in millions)\nNet Capital\nRequired Net Capital\nNet Capital in Excess of Required Net Capital\nRHS\n$\n3,232 \n$\n320 \n$\n2,912 \nRHF\n217 \n0.25 \n217 \nRHD\n75 \n9 \n66 \nTradePMR\n10 \n0.25 \n10 \nAs of September 30, 2025, these subsidiaries were in compliance with their respective regulatory capital requirements.\nCash Flows\nThe following table summarizes our cash flow activities:\nNine Months Ended\n September 30,\n(in millions)\n2024\n2025\nCash provided by (used in):\nOperating activities\n$\n1,243 \n$\n2,575 \nInvesting activities\n(182)\n699 \nFinancing activities\n(167)\n(708)\nOperating activities\nNet cash provided by operating activities increased $1.33 billion compared to the prior period primarily due to: \n•\nan increase of $783 million in net income;\n•\nan increase of $4.44 billion in securities loaned due to continuous growth of our securities lending program, as well as market conditions, variable lending and funding activities. \n•\nan increase of  $2.59 billion in payables to users due to increased customer activities; and\n55\nTable of Contents\n•\nan increase of $1.19 billion cash used to purchase U.S. treasury securities segregated under federal and other regulations; partially offset by a\n•\na increase of $3.84 billion in receivables from users, net due to higher customer margin balance, driven by increased customer activities; and\n•\na increase of $1.27 billion in securities borrowed due to increased customer activities.\nInvesting activities\nNet cash provided by investing activities increased $881 million compared to the prior period primarily due to: \n•\nan increase of $2.40 billion of cash provided by collections of purchased credit card receivables;\n•\nan increase of $1.19 billion of cash, cash equivalents, and segregated cash acquired in business acquisitions; \n•\nan increase of $469 million driven by no purchases of held-to-maturity investments during the period; \n•\na decrease of $2.68 billion due to cash used for purchases of credit card receivables; and \n•\na decrease of $393 million due to cash used for consideration transferred for business acquisitions. \nFinancing activities\nNet cash used in financing activities increased $541 million compared to the prior period primarily due to: \n•\nan increase of $456 million of cash used for share repurchases;  \n•\nan increase of $258 million of cash used for taxes related to net share settlement of equity awards; and\n•\nan increase of $150 million from borrowings by the Credit Card Funding Trust to purchase credit card receivables.\nCritical Accounting Estimates\nOur unaudited condensed consolidated financial statements are prepared in accordance with GAAP. The preparation of these unaudited condensed consolidated financial statements requires estimates and assumptions that affect the reported amounts of assets and liabilities, revenues and expenses, and related disclosures of contingent liabilities on our unaudited condensed consolidated financial statements and accompanying notes. The SEC has defined a company’s critical accounting policies as the ones that are most important to the portrayal of the company’s financial condition and results of operations, and which require the company to make its most difficult and subjective judgments, often as a result of the need to make estimates of matters that are inherently uncertain. We also have other key accounting policies, which involve the use of estimates, judgments, and assumptions that are significant to understanding our results. Although we believe that our estimates, assumptions, and judgments are reasonable, they are based upon information presently available. Actual results might differ significantly from these estimates under different assumptions, judgments, or conditions.\n56\nTable of Contents\nThere have been no material changes to our critical accounting estimates during the nine months ended September 30, 2025, as compared to those disclosed in “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Critical Accounting Estimates” in our 2024 Form 10-K.\nRecent Accounting Pronouncements\nSee Item 1 of Part I, “Unaudited Financial Statements — Note 2 - Recent Accounting Pronouncements.”"
}