{
  "source_file": "hpe-20250731.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations.\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nFor purposes of this Management's Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) section, we use the terms “Hewlett Packard Enterprise”, “HPE”, the “Company”, “we”, “us” and “our” to refer to Hewlett Packard Enterprise Company. \nWe intend the discussion of our financial condition and results of operations that follows to provide information that will assist the reader in understanding our Condensed Consolidated Financial Statements, changes in certain key items in these financial statements from period-to-period and the primary factors that accounted for these changes, as well as how certain accounting principles, policies, and estimates affect our Condensed Consolidated Financial Statements. This discussion should be read in conjunction with our Condensed Consolidated Financial Statements and the related notes that appear elsewhere in this document.\nThe financial discussion and analysis in the following MD&A compares the three and nine months ended July 31, 2025 to the comparable prior-year period and where appropriate, as of July 31, 2025, unless otherwise noted. \nThis MD&A is organized as follows:\n•\nTrends and Uncertainties. \nA discussion of material events and uncertainties known to management, such as the mixed macroeconomic environment and heightening global trade restrictions, uneven demand across our portfolio, increased demand for and adoption of new technologies, increased inventory levels, conservative customer spending environment (though recovering), persistent inflation, foreign exchange pressures, recent tax developments, and competitive pricing pressures.\n•\nExecutive Overview.\n A discussion of our business and a summary of our financial performance and other highlights, including non-GAAP financial measures, affecting the Company in order to provide context to the remainder of the MD&A. \n•\nResults of Operations. \nA discussion of the results of operations at the consolidated level is followed by a discussion of the results of operations at the segment level.\n•\nCritical Accounting Policies and Estimates.\n A discussion of accounting policies and estimates that we believe are important to understanding the assumptions and judgments incorporated in our reported financial results.\n•\nLiquidity and Capital Resources.\n An analysis of changes in our cash flows, financial condition, liquidity, and cash requirements and commitments. \n•\nGAAP to Non-GAAP Reconciliations\n. Each non-GAAP financial measure has been reconciled to the most directly comparable GAAP financial measure. This section also includes a discussion of the use, usefulness and economic substance of the non-GAAP financial measures, along with a discussion of material limitations, and compensation for those limitations, associated with the use of non-GAAP financial measures.\n45\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nTRENDS AND UNCERTAINTIES\nDuring the first nine months of fiscal 2025, the effects of the evolving macroeconomic environment on demand persisted and certain significant developments impacted our operations, as follows:\nTechnological Advancements: \nWe have observed market trends and demand (of customers of various segments and sizes) gravitating towards artificial intelligence (“AI”), hybrid cloud, edge computing, data security capabilities, and related offerings. The volume of data at the edge continues to grow, driven by the proliferation of more devices. The need for a unified cloud experience everywhere has grown, as well, in order to manage the growth of data at the edge. Increasing demand for AI is also contributing to changes in the competitive landscape. With the abundance of data, there are opportunities to develop AI tools with powerful computational abilities to extract insights and value from the captured data. Secure networking that is purpose-built for AI workloads is the foundation that enables users to seamlessly connect and apply AI learnings to such data that lives in various ecosystems. While we believe our recent acquisition of Juniper Networks, Inc. positions us to capitalize on the growing market opportunities across AI-accelerated computing, data, and networking, our major competitors and emerging competitors are expanding their product and service offerings with integrated products and solutions and exerting increased competitive pressure. We expect these market dynamics and trends to continue in the longer term.\nMacroeconomic Uncertainty: \nThe evolving macroeconomic environment has impacted industry-wide demand, as, until recently, customers took longer to work through prior orders and, to this day, have been adopting a more strategic approach to discretionary IT spending. While this dynamic has been easing, this has resulted in uneven demand across our portfolio and geographies, particularly for certain of our hardware offerings, as customers have focused investments on modernizing infrastructure, such as migrating to cloud-based offerings, including our own. Additionally, there continues to be significant uncertainty surrounding the tariff environment and import/export regulations due to numerous factors, including but not limited to tariff imposition delays, changes to tariff rates and policies, and enactment of reciprocally restrictive trade policies and measures. These have enhanced global trade uncertainty and contributed to higher prices of components and end products and services. While we have relied on our global supply chain and pricing measures in an attempt to mitigate adverse impacts, we expect such a mixed macroeconomic environment to largely continue and possibly limit revenue and margin growth in the near term.\nSupply Chain: \nWe experienced supply chain constraints for certain components, including graphics processing units, (“GPUs”) and accelerated processing units. Though they have since eased, in part due to increased availability of supply and lower material and logistics costs, the future remains uncertain due to continuous shifts in U.S. trade policy, which has thus far impacted our ability to import and export components and finished products and the costs of doing so. Additionally, logistics costs may rise with the aforementioned changes in trade policies. We have been experiencing higher-than-normal inventory levels, primarily due to frequent component part updates, customers transitioning to the next generation of GPUs, our securing supply ahead of demand, and longer customer acceptance timelines on AI-related orders. While we have been working to reduce inventory, any or all of the aforementioned factors could contribute to sustained higher-than-normal levels and further uncertainty. We have experienced, and expect to continue experiencing, rising input component costs due to the global trade uncertainties referenced above and a competitive pricing environment, all of which may impact our financial results. We plan to mitigate the impact of these dynamics through continued disciplined cost and pricing management and supply chain diversification.\nRecurring Revenue and Consumption Models: \nWe continue to strengthen our core server and storage-oriented offerings and expand our offerings on the HPE GreenLake cloud, to deliver our entire portfolio as-a-service (“aaS”) and become the edge-to-cloud company for our customers and partners. We expect that such flexible consumption model will continue to strengthen our customer relationships and contribute to growth in recurring revenue. \nForeign Currency Exposure\n: We have a large global presence, with more than half of our revenue generated outside of the U.S. As a result, our financial results can be, and particularly in recent periods have been, impacted by fluctuations in foreign currency exchange rates. We utilize a comprehensive hedging strategy intended to mitigate the impact of foreign currency volatility over time, and we adjust pricing when possible to further minimize foreign currency impacts.\nPublic Sector\n: We have a number of engagements with various public sector entities, including the U.S. federal government and its agencies, as direct or indirect customers of our IT services and hardware. Significant staffing and resource reductions at certain public sector entities create an uncertain environment and as a result, our financial results may be impacted in the near term.\n46\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nRecent Tax Developments: \nThe Organisation for Economic Co-operation and Development (“OECD”), an international association of 38 countries including the United States, has proposed changes to numerous long-standing tax principles, namely, its Pillar Two framework, which imposes a global minimum corporate tax rate of 15%. To date, 60 countries have enacted portions, or all, of the OECD proposal and a further 5 countries have drafted, or have announced an intent to draft, legislation enacting the proposed rules. Where enacted, the rules are effective for us in fiscal 2025. Under US GAAP, the OECD Pillar Two rules are considered an alternative minimum tax and therefore deferred taxes would not be recognized or adjusted for the estimated effects of the future minimum tax. The adoption and effective dates of these rules may vary by country and could increase tax complexity and uncertainty and may adversely affect our provision for income taxes. We do not expect a material impact to our fiscal 2025 results.\nThe Internal Revenue Service (“IRS”) is conducting audits of our fiscal 2020 through 2022 U.S. federal income tax returns. In the second quarter of fiscal 2025, the IRS issued a Revenue Agent Report regarding the audit of our fiscal 2017 through 2019 U.S. federal income tax returns with which we agreed. The audit cycle for fiscal 2017 through 2019 is now considered effectively settled, resulting in a reduction of existing unrecognized tax benefits of approximately $340 million, which did not result in a material impact to our Condensed Consolidated Statement of Earnings and our Condensed Consolidated Balance Sheet. The resolution of the audit resulted in the release of tax reserves that were predominantly related either to adjustments to foreign tax credits that carried a full valuation allowance or to the timing of intercompany royalty revenue recognition, neither of which affected our effective tax rate.\nOn July 4, 2025, the U.S. government enacted the One Big Beautiful Bill Act (“OB3”) into law. OB3 introduces several changes to tax regulations, including the permanent restoration of 100% depreciation and the permanent restoration of immediate deductibility of costs associated with research and development activities performed in the United States. We do not anticipate a material impact to our fiscal 2025 results but continue to evaluate the full impact of these changes on our future results.\nOther Trends and Uncertainties: \nThe impacts of \ngeopolitical volatility (including the ongoing conflict in the Middle East and in Ukraine and the relationship between China and the U.S.) may impact our operations, financial performance, and ability to conduct business in some non-U.S. markets. We have, in the past, entered into contracts for the sale of certain products and services that reflect heavier-than-normal discounting due to competitive pressures, which have resulted in lower margins than expected, and we expect will continue to negatively impact our margins in the near term. We have been monitoring and seeking to mitigate these risks with adjustments to our manufacturing, supply chain, and distribution networks, as well as our pricing and discounting practices. We remain focused on executing our key strategic priorities, building long-term value creation for our stakeholders, and addressing our customers’ needs while continuing to make prudent decisions in response to the environment.\nEXECUTIVE OVERVIEW\nWe are a global technology leader focused on developing intelligent solutions that allow customers to capture, analyze, and act upon data seamlessly from edge-to-cloud. We enable customers to accelerate business outcomes by driving new business models, creating new customer and employee experiences, and increasing operational efficiency today and into the future. Our customers range from small-and-medium size businesses to large global enterprises and governmental entities. Our legacy dates to a partnership founded in 1939 by William R. Hewlett and David Packard, and we strive every day to uphold and enhance that legacy through our dedication to providing innovative technological solutions to our customers.\nOur operations are organized into five reportable segments for financial reporting purposes: \nServer\n, \nHybrid Cloud, Networking, Financial Services (“FS”), \nand Corporate Investments and Other. During the third quarter of fiscal 2025, the Intelligent Edge segment was renamed to Networking. The segment name change did not result in any change to the composition of the Company’s segments and therefore no prior information was recast; further, the designation change did not impact the Company’s condensed consolidated financial statements. Effective at the beginning of the first quarter of fiscal 2025, in order to align its segment financial reporting more closely with its current business structure, HPE implemented an organizational change with the transfer of certain managed services, previously reported within the Server segment, to the Hybrid Cloud segment.\n47\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nAcquisition of Juniper Networks\nOn July 2, 2025, we completed the Juniper Networks, Inc. (“Juniper Networks”) merger (the “Merger”). Under the terms of the Merger Agreement, HPE agreed to pay $40.00 per share of Juniper Networks common stock, issued and outstanding as of July 2, 2025, representing a cash consideration of approximately $13.4 billion. The results of operations of Juniper Networks are included in the unaudited Condensed Consolidated Financial Statements commencing on July 2, 2025. See Note 8, “Acquisitions and Dispositions” to the Condensed Consolidated Financial Statements for additional information.  \nCost Reduction Program\nOn March 6, 2025, the Board of Directors approved a cost reduction program (the \"Program\") intended to reduce structural operating costs and continue advancing our ongoing commitment to profitable growth. The Program is expected to be implemented through fiscal year 2026 and deliver gross savings of approximately $350 million by fiscal year 2027 through reductions in our workforce. \nThe estimates of the duration of the Program, the charges and expenditures that we expect to incur in connection therewith, and the timing thereof are subject to a number of assumptions, including local law requirements in various jurisdictions, and actual amounts may differ materially from estimates. In addition, we may incur other charges or cash expenditures not currently contemplated due to unanticipated events that may occur, including in connection with the implementation of the Program. In connection with the Program, we incurred charges of $2 million and $148 million for the three and nine months ended July 31, 2025, respectively. \nThree months ended July 31, 2025 compared with three months ended July 31, 2024\nNet revenue of $9.1 billion represented an increase of 18.5% (increased 17.7% on a constant currency basis) primarily due to higher average unit prices (“AUPs”) in the Server segment, higher revenue from the Merger in the Networking segment, and higher unit volume in the Hybrid Cloud segment. The gross profit margin of 29.2% (or $2.7 billion), represents a decrease of 2.4 percentage points from the prior-year period primarily due to an increase in cost of sales in the Server, Networking and Hybrid Cloud segments. The operating profit margin of 2.7% represents a decrease of 4.4 percentage points from the prior-year period primarily due to the costs associated with the Merger.\nNine months ended July 31, 2025 compared with nine months ended July 31, 2024 \nNet revenue of $24.6 billion represented an increase of 13.6% (increased 14.0% on a constant currency basis) primarily due to higher AUPs in the Server segment, higher revenue from the Merger in the Networking segment, and higher unit volume in the Hybrid Cloud segment. The gross profit margin of 29.0% (or $7.1 billion), represents a decrease of 4.6 percentage points from the prior-year period, primarily due to an increase in cost of sales in the Server, Hybrid Cloud and Networking segments. The operating profit margin of (1.7)% represents a decrease of 8.6 percentage points from the prior-year period primarily due to the impairment of goodwill and costs associated with the Merger.\nFinancial Results\nThe following table summarizes our condensed consolidated GAAP financial results:\n48\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nFor the three months ended July 31,\nFor the nine months ended July 31,\n2025\n2024\nChange\n2025\n2024\nChange\nDollars in millions,  except per share amounts\nNet revenue\n$\n9,136 \n$\n7,710 \n18.5%\n$\n24,617 \n$\n21,669 \n13.6%\nGross profit\n$\n2,672 \n$\n2,439 \n9.6%\n$\n7,136 \n$\n7,272 \n(1.9)%\nGross profit margin\n29.2 \n%\n31.6 \n%\n(2.4)pts\n29.0 \n%\n33.6 \n%\n(4.6)pts\nEarnings (loss) from operations\n$\n247 \n$\n547 \n(54.8)%\n$\n(429)\n$\n1,497 \n(128.7)%\nOperating profit margin\n2.7 \n%\n7.1 \n%\n(4.4)pts\n(1.7)\n%\n6.9 \n%\n(8.6)pts\nNet earnings (loss) attributable to HPE\n$\n305 \n$\n512 \n(40.4)%\n$\n(118)\n$\n1,213 \n(109.7)%\nNet earnings (loss) attributable to common stockholders\n$\n276 \n$\n512 \n(46.1)%\n$\n(205)\n$\n1,213 \n(116.9)%\nDiluted net earnings (loss) per share attributable to common stockholders\n(1)\n \n$\n0.21 \n$\n0.38 \n$(0.17)\n$\n(0.16)\n$\n0.92 \n$(1.08)\nCash flow provided by operations\n$\n1,305 \n$\n1,154 \n$151\n$\n454 \n$\n2,311 \n$(1,857)\nThe following table summarizes our condensed consolidated non-GAAP financial results:\nFor the three months ended July 31,\nFor the nine months ended July 31,\n2025\n2024\nChange\n2025\n2024\nChange\nDollars in millions,  except per share amounts\nNet revenue in constant currency\n$\n9,075 \n$\n7,710 \n17.7%\n$\n24,708 \n$\n21,669 \n14.0%\nNon-GAAP gross profit\n$\n2,732 \n$\n2,450 \n11.5%\n$\n7,286 \n$\n7,281 \n0.1%\nNon-GAAP gross profit margin\n29.9 \n%\n31.8 \n%\n(1.9)pts\n29.6 \n%\n33.6 \n%\n(4.0)pts\nNon-GAAP earnings from operations\n$\n777 \n$\n771 \n0.8%\n$\n2,170 \n$\n2,230 \n(2.7)%\nNon-GAAP operating profit margin\n8.5 \n%\n10.0 \n%\n(1.5)pts\n8.8 \n%\n10.3 \n%\n(1.5)pts\nNon-GAAP net earnings attributable to HPE\n$\n631 \n$\n661 \n(4.5)%\n$\n1,860 \n$\n1,860 \n—%\nNon-GAAP net earnings attributable to common stockholders\n$\n602 \n$\n661 \n(8.9)%\n$\n1,773 \n$\n1,860 \n(4.7)%\nNon-GAAP diluted net earnings per share attributable to common stockholders\n(1)\n$\n0.44 \n$\n0.50 \n$(0.06)\n$\n1.32 \n$\n1.40 \n$(0.08)\nFree cash flow\n$\n790 \n$\n669 \n$121\n$\n(934)\n$\n797 \n$(1,731)\n(1)\nFor purposes of calculating diluted net earnings (loss) per share (“EPS”), the 7.625% Series C mandatory convertible preferred stock (“Preferred Stock”) dividends are added back to the net earnings (loss) attributable to common stockholders and the diluted weighted-average share calculation assumes the Preferred Stock was converted at issuance or as of the beginning of the reporting period. For GAAP diluted net EPS, the effect of employee stock plans and Preferred Stock is excluded when calculating diluted net loss per share as it would be anti-dilutive.\nEach non-GAAP financial measure has been reconciled to the most directly comparable GAAP financial measure herein. Please refer to the section “GAAP to non-GAAP Reconciliations” included in this MD&A for these reconciliations, a discussion of the use, usefulness and economic substance of the non-GAAP financial measures, along with a discussion of material limitations, and compensation for those limitations, associated with the use of non-GAAP financial measures.\nAnnualized Revenue Run-rate (“ARR”)\nARR represents the annualized revenue of all net HPE GreenLake cloud services revenue, related financial services revenue (which includes rental income from operating leases and interest income from finance leases), and software-as-a-service, software consumption revenue, and other aaS offerings, by taking such revenue recognized during a quarter and multiplying by four. To better align the calculation of ARR with Juniper Networks’ business and offerings, beginning with the quarter ended July 31, 2025, we also included revenue from software licenses support and maintenance in our ARR calculation, and will continue to do so going forward. The impact of this change was not material to the current and prior periods presented. We believe that ARR is a metric that allows management to better understand and highlight the potential future performance of \n49\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nour aaS business. We also believe ARR provides investors with greater transparency to our financial information and of the performance metric used in our financial and operational decision making and allows investors to see our results “through the eyes of management.” We use ARR as a performance metric. ARR should be viewed independently of net revenue and is not intended to be combined with it.\nARR does not have any standardized definition and is therefore unlikely to be comparable to similarly titled measures presented by other companies. ARR is not a forecast and the active contracts at the end of a reporting period used in calculating ARR may or may not be extended or renewed by our customers.\nThe following presents our ARR calculated as of July 31, 2025 and 2024:\nAs of July 31,\n2025\n2024\nDollars in millions\nARR\n(1)\n$\n3,053\n$\n1,723 \nYear-over-year growth rate\n77%\n35%\n(1)  The amount of \nannualized revenue\n attributable to Juniper Networks is approximately $590 million as of July 31, 2025. We calculated ARR attributable to Juniper Networks using one month of recurring revenue multiplied by 12, as we acquired Juniper Networks on July 2, 2025.\nThe 77% year-over year increase in ARR was primarily due to growth in the Networking segment due to the Merger and an expanding customer installed base. The Hybrid Cloud and Server segments increased due to an expanded range of HPE GreenLake Flex Solutions and Server aaS activity.\nDividends and Share Repurchase Program\nReturning capital to our stockholders remains an important part of our capital allocation framework, which also consists of strategic investments. \nThe holders of HPE common stock are entitled to receive dividends when and as declared by the Board of Directors. Our ability to pay dividends will depend on many factors, such as the Company’s financial condition, earnings, capital requirements, debt service obligations, restrictive covenants in its debt, industry practice, legal requirements, regulatory constraints, and other factors that the Board of Directors deems relevant. Furthermore, so long as any share of our Preferred Stock remains outstanding, no dividend on shares of common stock (or any other class of stock junior to the Preferred Stock) shall be declared or paid unless all accumulated and unpaid dividends for all preceding dividend periods for the Preferred Stock have been declared and paid in full in cash, shares of the Company’s common stock or a combination thereof, or a sufficient sum of cash or number of shares of its common stock has been set apart for the payment of such dividends, on all outstanding shares of the Preferred Stock. \nDuring the third quarter of fiscal 2025, we paid a quarterly dividend of $0.13 per share of common stock. On September 3, 2025, we declared a regular cash dividend of $0.13 per share of our common stock, payable on or about October 17, 2025, to our holders of record as of the close of business on September 18, 2025. We also declared a cash dividend of $0.953125 per share of our 7.625% Series C Mandatory Convertible Preferred Stock, which was paid on September 1, 2025, to holders of record as of the close of business on August 15, 2025.\nAs of July 31, 2025, we had a remaining authorization of approximately $0.7 billion for future share repurchases.\nRESULTS OF OPERATIONS\nRevenue from our international operations has historically represented, and we expect will continue to represent, a majority of our overall net revenue. As a result, our revenue growth has been impacted, and we expect will continue to be impacted, by fluctuations in foreign currency exchange rates. In order to provide a framework for assessing performance excluding the impact of foreign currency fluctuations, we present the year-over-year percentage change in revenue on a constant currency basis, which assumes no change in foreign currency exchange rates from the prior-year period and does not adjust for any repricing or demand impacts from changes in foreign currency exchange rates. This change in revenue on a constant currency basis is calculated as the quotient of (a) current year revenue converted to U.S. dollars using the prior-year period's foreign currency exchange rates divided by (b) the prior-year period revenue. This information is provided so that revenue can be viewed without the effect of fluctuations in foreign currency exchange rates, which is consistent with how management evaluates our revenue results and trends. This constant currency disclosure is provided in addition to, and not as a substitute for, the year-over-year percentage change in revenue on a GAAP basis. Other companies may calculate and define similarly labeled items differently, which may limit the usefulness of this measure for comparative purposes.\n50\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nResults of operations in dollars and as a percentage of net revenue were as follows:\n \nFor the three months ended July 31,\nFor the nine months ended July 31,\n \n2025\n2024\n2025\n2024\n \nDollars\n% of Revenue\nDollars\n% of Revenue\nDollars\n% of\nRevenue\nDollars\n% of\nRevenue\n \nDollars in millions\nNet revenue\n$\n9,136 \n100.0 \n%\n$\n7,710 \n100.0 \n%\n$\n24,617 \n100.0 \n%\n$\n21,669 \n100.0 \n%\nCost of sales (exclusive of amortization shown separately below)\n6,464 \n70.8 \n5,271 \n68.4 \n17,481 \n71.0 \n14,397 \n66.4 \nGross profit\n2,672 \n29.2 \n2,439 \n31.6 \n7,136 \n29.0 \n7,272 \n33.6 \nResearch and development\n622 \n6.8 \n547 \n7.1 \n1,637 \n6.6 \n1,719 \n7.9 \nSelling, general and administrative\n1,496 \n16.4 \n1,229 \n15.9 \n4,062 \n16.5 \n3,660 \n16.9 \nAmortization of intangible assets\n126 \n1.4 \n60 \n0.8 \n201 \n0.8 \n198 \n0.9 \nImpairment of goodwill\n— \n— \n— \n— \n1,361 \n5.5 \n— \n— \nTransformation costs\n— \n— \n14 \n0.2 \n2 \n— \n67 \n0.3 \nAcquisition, disposition and other charges\n181 \n2.0 \n42 \n0.5 \n302 \n1.2 \n131 \n0.6 \nEarnings (loss) from operations \n247 \n2.7 \n547 \n7.1 \n(429)\n(1.7)\n1,497 \n6.9 \nInterest and other, net\n8 \n0.1 \n(12)\n(0.2)\n86 \n0.3 \n(122)\n(0.6)\nGain on sale of a business\n1 \n— \n— \n— \n245 \n1.0 \n— \n— \nEarnings from equity interests\n32 \n0.4 \n73 \n0.9 \n74 \n0.3 \n161 \n0.7 \nEarnings (loss) before provision for taxes\n288 \n3.2 \n608 \n7.9 \n(24)\n(0.1)\n1,536 \n7.1 \nBenefit (provision) for taxes\n17 \n0.2 \n(96)\n(1.2)\n(94)\n(0.4)\n(323)\n(1.5)\nNet earnings (loss) attributable to HPE\n305 \n3.3 \n512 \n6.6 \n(118)\n(0.5)\n1,213 \n5.6 \nPreferred stock dividends\n(29)\n(0.3)\n— \n— \n(87)\n(0.4)\n— \n— \nNet earnings (loss) attributable to common stockholders\n$\n276 \n3.0 \n%\n$\n512 \n6.6 \n%\n$\n(205)\n(0.8)\n%\n$\n1,213 \n5.6 \n%\nThree and nine months ended July 31, 2025 compared with the three and nine months ended July 31, 2024\nNet revenue\nFor the three months ended July 31, 2025, total net revenue of $9.1 billion represented an increase of $1.4 billion, or 18.5% (increased 17.7% on a constant currency basis). U.S. net revenue increased by $1.4 billion, or 48.4%, to $4.3 billion, and net revenue from outside of the U.S. increased by $30 million, or 0.6%, to $4.8 billion.\nFor the nine months ended July 31, 2025, total net revenue of $24.6 billion represented an increase of $2.9 billion, or 13.6% (increased 14.0% on a constant currency basis). U.S. net revenue increased by $1.8 billion, or 22.9%, to $9.5 billion, and net revenue from outside of the U.S. increased by $1.1 billion, or 8.4%, to $15.1 billion.\n51\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nThe components of the weighted net revenue change by segment were as follows:\nFor the three months ended July 31, 2025\nFor the nine months ended July 31, 2025\nPercentage Points\nServer\n8.9 \n8.6 \nHybrid Cloud\n2.1 \n2.2 \nNetworking\n7.9 \n2.9 \nFinancial Services\n0.1 \n— \nCorporate Investments and Other\n(0.9)\n(0.8)\nTotal segment\n18.1 \n12.9 \nElimination of intersegment net revenue and other\n0.4 \n0.7 \nTotal HPE\n18.5 \n13.6 \nThree months ended July 31, 2025 compared with three months ended July 31, 2024\nFrom a segment perspective, the primary factors contributing to the change in total net revenue are summarized as follows:\n•\nServer net revenue increased $685 million, or 16.1%, primarily due to higher AUPs\n•\nHybrid Cloud net revenue increased $159 million, or 12.0%, primarily due to increase in unit volume \n•\nNetworking net revenue increased $609 million, or 54.3%, primarily due to the Merger\n•\nFinancial Services net revenue increased $7 million, or 0.8%, primarily due to favorable currency fluctuations \n•\nCorporate Investments and Other net revenue decreased $68 million, or 26.0%, primarily due to the divestiture of the Communications Technology Group\n \n(“CTG”) business\nNine months ended July 31, 2025 compared with nine months ended July 31, 2024\nFrom a segment perspective, the primary factors contributing to the change in total net revenue are summarized as follows:\n•\nServer net revenue increased $1,865 million, or 16.3%, primarily due to higher AUPs\n•\nHybrid Cloud net revenue increased $462 million, or 11.9%, primarily due to an increase in unit volume\n•\nNetworking net revenue increased $630 million, or 18.5%, primarily due to the Merger\n•\nFinancial Services net revenue decreased $4 million, or 0.2%, primarily due to unfavorable currency fluctuations\n•\nCorporate Investments and Other net revenue decreased $167 million, or 22.2%, primarily due to the divestiture of CTG\nPlease refer to the section “Segment Information” further below for a discussion of our results of operations for each reportable segment.\nGross profit\nFor the three and nine months ended July 31, 2025, the total gross profit margin of 29.2% and 29.0%, respectively, represents a decrease of 2.4 and 4.6 percentage points, respectively, as compared to the respective prior year periods. The decrease for the three and nine months ended July 31, 2025, was primarily due to an increase in cost of sales in the Server, Networking, and Hybrid Cloud segments. \n52\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nOperating expenses \nResearch and development (“R&D”)\nFor the \nthree months ended July 31, 2025, R&D expense increased by $75 million, or 13.7%, primarily due to operating expenses associated with Juniper Networks, which contributed 17.3 percentage points to the change, and higher employee costs, which contributed 6.2 percentage points. The increase was partially offset by lower operating expenses due to higher mix of capital versus expense investment, which contributed 8.9 percentage points to the change. \nFor the \nnine months ended July 31, 2025, R&D expense decreased by $82 million, or 4.8%, primarily due to higher mix of capital versus expense investment, which contributed 11.0 percentage points to the change. The decrease was partially offset by higher operating expenses associated with Juniper Networks, which contributed 5.5 percentage points to the change. \nSelling, general and administrative (“SG&A”)\nFor the three months ended July 31, 2025, SG&A expense increased by $267 million, or 21.7%, primarily due to higher employee costs and increased operating expenses associated with Juniper Networks, which contributed 21.9 percentage points to the change. \nFor the \nnine months ended July 31, 2025, SG&A expense increased by $402 million, or 11.0%, primarily due to higher employee costs and increased operating expenses associated with Juniper Networks, which contributed 7.8 percentage points to the change, and the expenses incurred related to the cost reduction program, which contributed 3.2 percentage points to the change. \nImpairment of goodwill\nImpairment of goodwill f\nor the \nnine months ended July 31, 2025 represents a partial goodwill impairment charge of $1.4 billion, as it was determined that the fair value of the Hybrid Cloud reporting unit was below the carrying value of its net assets. The decline in the fair value was primarily driven by an increase in the discount rate used in the discounted cash flows analysis, driven by heightened macroeconomic uncertainty. Refer to Note 9, “Goodwill” to the Condensed Consolidated Financial Statements in Item 1 of Part I for more information.\nAcquisition, disposition and other charges\nFor the three and nine months ended July 31, 2025, acquisition, disposition and other charges increased by $139 million or 331.0%, and $171 million, or 130.5%, respectively, primarily due to costs incurred in connection with the Merger.\nInterest and other, net\n \nFor the three months ended July 31, 2025, interest and other, net income increased by $20 million, or 166.7%, primarily due to a gain relating to a settlement to resolve claims solely against Sushovan Hussain, the former CFO of Autonomy, in the ongoing Autonomy litigation, partially offset by higher net interest expense.\nFor the nine months ended July 31, 2025, interest and other, net income increased by $208 million, or 170.5%, primarily due to an increase in the non-service net periodic benefit credit, the gain from the settlement to resolve claims solely against Sushovan Hussain in the ongoing Autonomy litigation, a gain on equity investments recognized in the current period compared to a loss on equity investments in the prior-year period, and increase in net interest income.\nGain on sale of a business\nOn December 1, 2024, we completed the disposition of CTG. We received net proceeds of $210 million and recognized a gain of $245 million.\nEarnings from equity interests\n \nFor the \nthree and nine months ended July 31, 2025, earnings from equity interests decreased $41 million, or 56.2%, and $87 million, or 54.0%, respectively, primarily due to lower earnings from our equity interest in H3C Technologies Co., Limited (“H3C”) as a result of the disposition of 30% of the total issued share capital of H3C.\n53\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nBenefit (provision) for taxes\nFor the three months ended July 31, 2025 and 2024, we recorded income tax benefit of $17 million and income tax expense of $96 million, respectively, which reflects an effective tax rate of (6.5)% and 15.8%, respectively. For the nine months ended July 31, 2025 and 2024, we recorded income tax expense of $94 million and $323 million, respectively, which reflects an effective tax rate of (359.9)% and 21.0%, respectively. For the three and nine months ended July 31, 2025 and the three months ended July 31, 2024, the effective tax rate generally differs from the U.S. federal statutory rate of 21% due to favorable tax rates associated with certain earnings from our operations in lower tax jurisdictions throughout the world but is also impacted by discrete tax adjustments during each fiscal period. The effective tax rate for the nine months ended July 31, 2025 also included the effects of the non-deductible goodwill impairment.\nFor further discussion, refer to Note 5, “Taxes on Earnings” to the Condensed Consolidated Financial Statements in Item 1 of Part I.\n  Segment Information\nHewlett Packard Enterprise's organizational structure is based on a number of factors that the Chief Operating Decision Maker, who is the Chief Executive Officer, uses to evaluate, view, and run our business operations, which include, but are not limited to, customer base and homogeneity of products and technology. The segments are based on this organizational structure and information reviewed by Hewlett Packard Enterprise's management to evaluate segment results.\nA description of the products and services for each segment, along with other pertinent information related to segments can be found in Note 2, “Segment Information” to the Condensed Consolidated Financial Statements in Item 1 of Part I. \nSegment Results\nThe following table and ensuing discussion provide an overview of our key financial metrics by segment for the three months ended July 31, 2025, as compared to the prior-year period:\nHPE Consolidated\nServer\nHybrid Cloud\nNetworking\nFinancial Services\nCorporate Investments and Other\nDollars in millions\nNet revenue\n(1)\n$\n9,136\n$\n4,940\n$\n1,484\n$\n1,730\n$\n886\n$\n194\nYear-over-year change %\n18.5 \n%\n16.1 \n%\n12.0 \n%\n54.3 \n%\n0.8 \n%\n(26.0)\n%\nEarnings (loss) from operations\n(2)\n$\n247 \n$\n317 \n$\n87 \n$\n360 \n$\n88 \n$\n(14)\nEarnings (loss) from operations as a % of net revenue\n2.7 \n%\n6.4 \n%\n5.9 \n%\n20.8 \n%\n9.9 \n%\n(7.2)\n%\nYear-over-year change percentage points\n(4.4)\npts\n(4.4)\npts\n0.7 \npts\n(1.6)\npts\n0.9 \npts\n(5.7)\npts\nThe following table and ensuing discussion provide an overview of our key financial metrics by segment for the nine months ended July 31, 2025, as compared to the prior-year period:\nHPE Consolidated\nServer\nHybrid Cloud\nNetworking\nFinancial Services\nCorporate Investments and Other\nDollars in millions\nNet revenue\n(1)\n$\n24,617\n$\n13,288\n$\n4,342\n$\n4,038\n$\n2,615\n$\n585\nYear-over-year change %\n13.6 \n%\n16.3 \n%\n11.9 \n%\n18.5 \n%\n(0.2)\n%\n(22.2)\n%\n(Loss) earnings from operations\n(2)\n$\n(429)\n$\n906 \n$\n264 \n$\n948 \n$\n259 \n$\n(26)\n(Loss) earnings from operations as a % of net revenue\n(1.7)\n%\n6.8 \n%\n6.1 \n%\n23.5 \n%\n9.9 \n%\n(4.4)\n%\nYear-over-year change percentage points\n(8.6)\npts\n(4.3)\npts\n2.7 \npts\n(1.2)\npts\n1.0 \npts\n(1.3)\npts\n(1)\nHPE consolidated net revenue excludes intersegment net revenue. Segment net revenues include intersegment net revenue.\n54\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\n(2)\nSegment earnings (loss) from operations exclude certain unallocated corporate costs and eliminations, stock-based compensation expense, amortization of intangible assets, transformation costs, H3C divestiture related severance costs, severance costs related to the cost reduction program, acquisition, disposition and other charges, and impairment of goodwill.\n Server\n \nFor the three months ended July 31,\nFor the nine months ended July 31,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\n \nDollars in millions\nNet revenue\n$\n4,940 \n$\n4,255 \n16.1 \n%\n$\n13,288 \n$\n11,423 \n16.3 \n%\nEarnings from operations\n$\n317 \n$\n461 \n(31.2)\n%\n$\n906 \n$\n1,263 \n(28.3)\n%\nEarnings from operations as a % of net revenue\n6.4 \n%\n10.8 \n%\n \n6.8 \n%\n11.1 \n%\nThree months ended July 31, 2025 compared with three months ended July 31, 2024\nServer segment net revenue increased\n by $685 million, or 16.1% (increased 15.7% on a constant currency basis), primarily due to a $698 million, or 20.5%, increase in product revenue. The increase in product revenue was primarily due to higher net AUPs of $750 million, or 22.0%, partially offset by a decrease in net unit volume of $50 million, or 1.5%.\nServer segment earnings from operations as a percentage of net revenue decreased 4.4 percentage points due to an increase in cost of products as a percentage of net revenue resulting from higher mix of lower margin products and input cost increases. Operating expenses as a percentage of net revenue remained relatively flat as compared to the prior-year period.\nNine months ended July 31, 2025 compared with nine months ended July 31, 2024\nServer segment net revenue increased\n by $1,865 million, or 16.3% (increased 16.8% on a constant currency basis), primarily due to a $1,878 million, or 21.1%, increase in product revenue. The increase in product revenue was primarily due to higher net AUPs of $2,357 million, or 26.5%, partially offset by a decrease in net unit volume of $427 million, or 4.8%, and unfavorable currency fluctuations of $52 million, or 0.6%.\nServer segment earnings from operations as a percentage of net revenue decreased 4.3 percentage points due to an increase in costs of products as a percentage of net revenue, moderated by a decrease in operating expenses as a percentage of net revenue. The increase in cost of products as a percentage of net revenue was primarily due to input cost increases, competitive pricing pressure, and higher mix of lower margin products. The decrease in operating expenses as a percentage of net revenue was primarily due to the scale of the net revenue increase, partially offset by higher SG&A expenses.\nHybrid Cloud\n \nFor the three months ended July 31,\nFor the nine months ended July 31,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\n \nDollars in millions\nNet revenue\n$\n1,484 \n$\n1,325 \n12.0 \n%\n$\n4,342 \n$\n3,880 \n11.9 \n%\nEarnings from operations\n$\n87 \n$\n69 \n26.1 \n%\n$\n264 \n$\n133 \n98.5 \n%\nEarnings from operations as a % of net revenue\n5.9 \n%\n5.2 \n%\n6.1 \n%\n3.4 \n%\nThree months ended July 31, 2025 compared with three months ended July 31, 2024\nHybrid Cloud segment net revenue increased by $159 million, or 12.0% (increased 10.9% on a constant currency basis), primarily due to an increase in unit volume, partially offset by a decrease in AUPs. Hybrid Cloud product revenue increased by $62 million, or 8.5%, primarily due to a unit volume increase of $260 million, or 35.5%, led by private cloud and storage products. This increase was partially offset by decrease in AUPs of $200 million, or 27.3%, led by private cloud and storage products. Hybrid Cloud services revenue increased by $97 million, or 16.3%, primarily driven by higher services contribution from private cloud solutions.\nHybrid Cloud segment earnings from operations as a percentage of net revenue increased 0.7 percentage points, due to a decrease in operating expenses as a percentage of net revenue, partially offset by an increase in cost of products and services as a percentage of net revenue. Operating expenses as a percentage of net revenue decreased due to the scale of net revenue growth. Cost of products and services as a percentage of net revenue increased due to a higher contribution from our products \n55\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nportfolio, as we transition to a more software-defined platform with HPE Alletra.\nNine months ended July 31, 2025 compared with nine months ended July 31, 2024\nHybrid Cloud segment net revenue increased by $462 million, or 11.9%, (increased 12.2% on a constant currency basis) primarily due to an increase in unit volume, partially offset by a decrease in AUPs. Hybrid Cloud product revenue increased by $221 million, or 10.6%, primarily due to a unit volume increase of $392 million, or 18.8%, led by private cloud and storage products. This increase was partially offset by a decrease in AUPs of $157 million, or 7.5%, led by private cloud products. Hybrid Cloud services revenue increased by $241 million, or 13.5%, primarily driven by higher services contribution from private cloud solutions.\nHybrid Cloud segment earnings from operations as a percentage of net revenue increased 2.7 percentage points, due to a decrease in operating expenses as a percentage of net revenue, primarily driven by capitalization of software costs and cost containment measures. Cost of products and services as a percentage of net revenue increased due to a higher contribution from our products portfolio, as we transition to a more software-defined platform with HPE Alletra.\nNetworking\n \nFor the three months ended July 31,\nFor the nine months ended July 31,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\n \nDollars in millions\nNet revenue\n$\n1,730 \n$\n1,121 \n54.3 \n%\n$\n4,038 \n$\n3,408 \n18.5 \n%\nEarnings from operations\n$\n360 \n$\n251 \n43.4 \n%\n$\n948 \n$\n841 \n12.7 \n%\nEarnings from operations as a % of net revenue\n20.8 \n%\n22.4 \n%\n \n23.5 \n%\n24.7 \n%\nThree months ended July 31, 2025 compared with three months ended July 31, 2024\nNetworking segment net revenue increased by $609 million, or 54.3% (increased 53.9% on a constant currency basis). Product revenue increased by $396 million, or 48.2%, primarily led by revenue attributable to Juniper Networks of $303 million, or 36.9%, higher volume and product mix effect of $58 million, or 7.0%, and higher AUPs of $34 million, or 4.1%. Services net revenue increased $213 million, or 71.2%, primarily led by revenue attributable to Juniper Networks of $177 million, or 59.2%, and increased services net revenue primarily from our aaS offerings of $36 million, or 12.0%.\nNetworking segment earnings from operations as a percentage of net revenue decreased 1.6 percentage points primarily due to an increase in cost of products and services as a percentage of net revenue, partially offset by a decrease in operating expenses as a percentage of net revenue. The increase in cost of product and services as a percentage of net revenue was primarily due to competitive pricing pressure. The decrease in operating expenses as a percentage of net revenue was primarily due to the scale of the net revenue increase, partially offset by higher operating expenses associated with Juniper Networks.\nNine months ended July 31, 2025 compared with nine months ended July 31, 2024\nNetworking segment net revenue increased by $630 million, or 18.5% (increased 18.8% on a constant currency basis). Product revenue increased by $344 million, or 13.6%, primarily led by revenue attributable to Juniper Networks of $303 million, or 11.9%, higher volume and product mix effect of $185 million, or 7.3%, partially offset by lower AUPs of $138 million, or 5.4%. Services net revenue increased $286 million, or 32.8%, primarily led by revenue attributable to Juniper Networks of $177 million, or 20.3%, and increased services net revenue primarily from our aaS offerings of $109 million, or 12.5%.  \nNetworking segment earnings from operations as a percentage of net revenue decreased 1.2 percentage points primarily due to an increase in cost of products and services as a percentage of net revenue, partially offset by a decrease in operating expenses as a percentage of net revenue. The increase in cost of product and services as a percentage of net revenue was primarily due to competitive pricing pressure. The decrease in operating expenses as a percentage of net revenue primarily due to the scale of the net revenue increase, partially offset by higher operating expenses associated with Juniper Networks.\n56\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nFinancial Services\nFor the three months ended July 31,\nFor the nine months ended July 31,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\n \nDollars in millions\nNet revenue\n$\n886 \n$\n879 \n0.8 \n%\n$\n2,615 \n$\n2,619 \n(0.2)\n%\nEarnings from operations\n$\n88 \n$\n79 \n11.4 \n%\n$\n259 \n$\n234 \n10.7 \n%\nEarnings from operations as a % of net revenue\n9.9 \n%\n9.0 \n%\n9.9 \n%\n8.9 \n%\n \nThree months ended July 31, 2025 compared with three months ended July 31, 2024\nFS segment net revenue increased by $7 million, or 0.8% (decreased 0.9% on a constant currency basis) primarily due to favorable currency fluctuations, higher finance income from higher average finance leases, and higher asset management remarketing revenue, partially offset by lower rental revenue on lower average operating leases.\nFS segment earnings from operations as a percentage of net revenue increased 0.9 percentage points due to a decrease in cost of services as a percentage of net revenue, while operating expenses as a percentage of net revenue were relatively flat. The decrease in cost of services as a percentage of net revenue resulted primarily from lower depreciation expense, partially offset by higher bad debt expense.\nNine months ended July 31, 2025 compared with nine months ended July 31, 2024\nFS segment net revenue decreased by $4 million, or 0.2% (increased 0.5% on a constant currency basis) primarily due to unfavorable currency fluctuations and lower rental revenue on lower average operating leases, partially offset by higher finance income from higher average finance leases, along with higher asset management remarketing revenue and asset recovery services revenue.\nFS segment earnings from operations as a percentage of net revenue increased 1.0 percentage points due to a decrease in cost of services as a percentage of net revenue, while operating expenses as a percentage of net revenue were flat. The decrease in cost of services as a percentage of net revenue resulted primarily from lower depreciation expense, partially offset by higher bad debt expense and higher borrowing costs.\nFinancing Volume\n \nFor the three months ended July 31,\nFor the nine months ended July 31,\n \n2025\n2024\n2025\n2024\n \nIn millions\nFinancing volume\n$\n1,513 \n$\n1,483 \n$\n3,974 \n$\n4,518 \nFinancing volume, which represents the amount of financing provided to customers for equipment and related software and services, including intercompany activity, increased 2.0% and decreased 12.0% for the three and nine months ended July 31, 2025, respectively, as compared to the prior-year period. The increase for the three months ended July 31, 2025 was primarily driven by higher financing of third-party product sales and services, partially offset by lower financing of HPE product sales and services. The decrease for the nine months ended July 31, 2025 was primarily driven by lower financing of both HPE and third-party product sales and services.\n57\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nPortfolio Assets and Ratios\nThe portfolio assets and ratios derived from the segment balance sheets for FS were as follows:\n \nAs of\n \nJuly 31, 2025\nOctober 31, 2024\n \nDollars in millions\nFinancing receivables, gross\n$\n9,628 \n$\n9,647 \nNet equipment under operating leases\n3,234 \n3,632 \nCapitalized profit on intercompany equipment transactions\n(1)\n491 \n396 \nIntercompany leases\n(1)\n130 \n119 \nGross portfolio assets\n13,483 \n13,794 \nAllowance for doubtful accounts\n(2)\n196 \n177 \nOperating lease equipment reserve\n48 \n30 \nTotal reserves\n244 \n207 \nNet portfolio assets\n$\n13,239 \n$\n13,587 \nReserve coverage\n1.8 \n%\n1.5 \n%\nDebt-to-equity ratio\n(3)\n7.0x\n7.0x\n \n(1)\nIntercompany activity is eliminated in consolidation.\n(2)\nAllowance for credit losses for financing receivables includes both the short- and long-term portions.\n(3)\nDebt benefiting the FS segment consists of intercompany equity that is treated as debt for segment reporting purposes, intercompany debt, and borrowing- and funding-related activity associated with the FS segment and its subsidiaries. Debt benefiting the FS segment totaled $11.4 billion and $11.8 billion as of July 31, 2025 and October 31, 2024, respectively, and was determined by applying an assumed debt-to-equity ratio, which management believes to be comparable to that of other similar financing companies. The FS segment equity was $1.6 billion and $1.7 billion as of July 31, 2025 and October 31, 2024, respectively.\nAs of July 31, 2025 and October 31, 2024, the FS segment net cash and cash equivalents balances were approximately $666 million and $533 million, respectively.\nNet portfolio assets as of July 31, 2025 decreased 2.6% from October 31, 2024. The decrease generally resulted from portfolio runoff exceeding new financing volume during the period, partially offset by favorable currency fluctuations.\nThe FS segment bad debt expense includes charges to general reserves, specific reserves, and write-offs for sales-type, direct-financing, and operating leases. For the three and nine months ended July 31, 2025, the FS segment recorded net bad debt expense of $27 million and $77 million, respectively. For the three and nine months ended July 31, 2024, the FS segment recorded net bad debt expense of $14 million and $36 million, respectively.\nCorporate Investments and Other\n \nFor the three months ended July 31,\nFor the nine months ended July 31,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\n \nDollars in millions\nNet revenue\n$\n194 \n$\n262 \n(26.0)\n%\n$\n585 \n$\n752 \n(22.2)\n%\nLoss from operations\n$\n(14)\n$\n(4)\n(250.0)\n%\n$\n(26)\n$\n(23)\n(13.0)\n%\nLoss from operations as a % of net revenue\n(7.2)\n%\n(1.5)\n%\n(4.4)\n%\n(3.1)\n%\nThree months ended July 31, 2025 compared with three months ended July 31, 2024\nCorporate Investments and Other segment net revenue decreased by $68 million, or 26.0% (decreased 29.4% on a constant currency basis), primarily due to the divestiture of the CTG business effective December 1, 2024.\nCorporate Investments and Other segment loss from operations as a percentage of net revenue increased by 5.7% percentage points primarily due to increases in cost of services and operating expenses as a percentage of net revenue due to the scale of the net revenue decline. \n58\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nNine months ended July 31, 2025 compared with nine months ended July 31, 2024\nCorporate Investments and Other segment net revenue decreased by $167 million, or 22.2% (decreased 22.3% on a constant currency basis), primarily due to the divestiture of the CTG business effective December 1, 2024.\nCorporate Investments and Other segment loss from operations remained relatively flat.  \nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur Condensed Consolidated Financial Statements are prepared in accordance with U.S. Generally Accepted Accounting Principles (“GAAP”), which requires us to make estimates, judgments, and assumptions that affect the reported amounts of assets, liabilities, net revenue, and expenses, and the disclosure of contingent liabilities. An accounting policy is deemed to be critical if the nature of the estimate or assumption it incorporates is subject to a material level of judgment related to matters that are highly uncertain, and changes in those estimates and assumptions are reasonably likely to materially impact our Condensed Consolidated Financial Statements.\nEstimates and judgments are based on historical experience, forecasted events, and various other assumptions that we believe to be reasonable under the circumstances. Estimates and judgments may vary under different assumptions or conditions. We evaluate our estimates and judgments on an ongoing basis. Accounting policies that are critical in the portrayal of our financial condition and results of operations and require management’s most difficult, subjective, or complex judgments include revenue recognition, taxes on earnings, impairment assessment of goodwill and intangible assets, and contingencies.\nAs of July 31, 2025, there have been no significant changes to our critical accounting estimates since our Annual Report on Form 10-K for the fiscal year ended October 31, 2024, except as set forth below.\nBusiness Combinations\nWe account for acquired businesses using the acquisition method of accounting, which requires that once control is obtained, all the assets acquired and liabilities assumed are recorded at their respective fair values at the date of acquisition. The determination of fair values of identifiable assets and liabilities requires estimates and the use of valuation techniques when fair value is not readily available and requires a significant amount of management judgment. For the valuation of intangible assets acquired in a business combination, we use an income approach. The income approach estimates fair value by discounting associated lifetime expected future cash flows to their present value and relies on significant assumptions regarding future expected cash flows, forecasted revenue, customer attrition rates, obsolescence rate and the discount rate. Although the Company believes its estimates of fair value are reasonable, actual financial results could differ from those estimates due to the inherent uncertainty involved in making such estimates. Changes in assumptions concerning future financial results or other underlying assumptions could have a significant impact on the determination of the fair value of the intangible assets acquired. Third-party valuation specialists are utilized for certain estimates.\nWe estimate the fair value of acquired inventory, including raw materials, finished goods and work in process, by determining the estimated selling price when completed, less an estimate of costs to be incurred to complete and sell the inventory, and an estimate of a reasonable profit allowance for those manufacturing and selling efforts. The fair value of inventory is recognized in our results of operations as the inventory is sold. Some of the more significant estimates and assumptions inherent in the estimate of the fair value of inventory include stage of completion, costs to complete, costs to dispose and selling price.\nWe estimate the fair value of acquired property, plant and equipment using a combination of the cost and market approaches. The market approach estimates fair value by analyzing recent actual market transactions for similar assets or liabilities. The cost approach estimates fair value based on the expected cost to replace or reproduce the asset or liability and relies on assumptions regarding the occurrence and extent of any physical, functional and/or economic obsolescence. Some of the more significant estimates and assumptions inherent in these approaches are the values of asset replacement costs, comparable assets and estimated remaining economic lives of the assets.\nThe excess of the purchase price over fair values of identifiable assets acquired and liabilities assumed is recorded as goodwill. During the measurement period, which is up to one year from the acquisition date, we may record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill due to the use of preliminary information in our initial estimates. Upon the conclusion of the measurement period, any subsequent adjustments are recorded to earnings.\n59\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nGoodwill\nWe review goodwill for impairment at the reporting unit level annually on the first day of the fourth quarter, or whenever events or circumstances indicate the carrying amount of goodwill may not be recoverable. We are permitted to conduct a qualitative assessment to determine whether it is necessary to perform a quantitative goodwill impairment test. We performed interim goodwill impairment tests as of November 1, 2024 and April 30, 2025.\nAs of July 31, 2025, our reporting units with goodwill are consistent with the reportable segments identified in Note 2, “Segment Information” to the Condensed Consolidated Financial Statements in Item 1 of Part I of this Quarterly Report, with the exception of Networking and Corporate Investments and Other segments. The Networking segment contains two reporting units: Intelligent Edge and Juniper Networks. The Corporate Investments and Other segment contains the A & PS reporting unit.\nWhen performing the goodwill impairment test, we compare the fair value of each reporting unit to its carrying amount. An impairment exists if the fair value of the reporting unit is less than its carrying amount. \nEstimating the fair value of a reporting unit is judgmental in nature and involves the use of significant estimates and assumptions. We estimate the fair value of our reporting units using a weighting of fair values derived mostly from the income approach and, to a lesser extent, the market approach. Under the income approach, the fair value of a reporting unit is based on discounted cash flow analysis of management's short-term and long-term forecast of operating performance. This analysis includes significant assumptions regarding revenue growth rates, expected operating margins, and timing of expected future cash flows based on market conditions and customer acceptances. The discount rate used is based on the weighted-average cost of capital of comparable public companies adjusted for the relevant risk associated with business specific characteristics and the uncertainty related to the reporting unit's ability to execute on the projected cash flows. Under the market approach, the fair value is based on market multiples of revenue and earnings derived from comparable publicly traded companies with operating and investment characteristics similar to the reporting unit. We weight the fair value derived from the market approach commensurate with the level of comparability of these publicly traded companies to the reporting unit. When market comparables are not meaningful or not available, we estimate the fair value of a reporting unit using the income approach. In addition, we make certain judgments and assumptions in allocating shared assets and liabilities to individual reporting units to determine the carrying amount of each reporting unit.\nNovember 1, 2024 Interim Impairment Test\nAn interim impairment test was performed as of November 1, 2024 based on organizational changes impacting the Hybrid Cloud and Server reporting units. The interim impairment test did not result in an impairment of goodwill. \nApril 30, 2025 Interim Impairment Test\nDuring the second quarter of fiscal 2025, the macroeconomic environment experienced a rapid deterioration, primarily driven by the announcement and subsequent modifications of international tariffs, an escalation in global trade tensions, and increasing geopolitical uncertainty. These events have contributed to significant movement in inputs used to determine the weighted-average cost of capital. As of April 30, 2025, we determined that an indicator of potential impairment existed to require an interim quantitative goodwill impairment test for its reporting units.\nBased on the results of the interim quantitative impairment test performed as of April 30, 2025, the fair value of the Hybrid Cloud reporting unit was below the carrying value assigned to Hybrid Cloud. The decline in the fair value of the Hybrid Cloud reporting unit was primarily driven by an increase in the discount rate used in the discounted cash flows analysis, which reflected heightened macroeconomic uncertainty and changes in market conditions. The fair value of the Hybrid Cloud reporting unit was based on a weighting of fair values derived most significantly from the income approach, and to a lesser extent, the market approach. Under the income approach, we estimate the fair value of a reporting unit based on the present value of estimated future cash flows which we consider to be a level 3 unobservable input in the fair value hierarchy.\nPrior to the quantitative goodwill impairment test, we tested the recoverability of long-lived assets and other assets of the Hybrid Cloud reporting unit and concluded that such assets were not impaired. The quantitative goodwill impairment test indicated that the carrying value of the Hybrid Cloud reporting unit exceeded its fair value by $1.4 billion. As a result, we recorded a goodwill impairment charge of $1.4 billion in the second quarter of fiscal 2025. \nSubsequent to the impairment of Hybrid Cloud reporting unit, the indicated fair values of the reporting units exceeded their respective carrying amounts by a range of 0% to 112%. In order to evaluate the sensitivity of the estimated fair value of \n60\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nour reporting units in the goodwill impairment test, we applied a hypothetical 10% decrease to the fair value of each reporting unit. Based on the results of this hypothetical 10% decrease all of the reporting units had an excess of fair value over carrying amount, except Server and Hybrid Cloud.\nThe Hybrid Cloud reporting unit has remaining goodwill of $3.5 billion as of July 31, 2025 and an excess of fair value over carrying value of net assets of 0% as of the interim test date. Hybrid Cloud business is transitioning to a more cloud-native, software-defined platform with HPE Alletra. Translating this growth to revenue and operating income will take time because a greater mix of high margin business, such as ratable software and services, are deferred and recognized in future periods.\nThe excess of fair value over carrying amount for the Server reporting unit was 3%. The fair value of the Server reporting unit was also impacted by an increase in the discount rate used in the discounted cash flow analysis, driven by heightened macroeconomic uncertainty. The Server reporting unit has a goodwill balance of $10.2 billion as of July 31, 2025. In the current macroeconomic and inflationary environment, customers have invested selectively, resulting in moderate unit growth and competitive pricing in the traditional servers business. While the AI servers business is growing at a faster pace, because graphics processing units represent a large portion of the solutions, the pricing is very competitive and margins are limited. The Server business continues to focus on capturing market share in both traditional and AI servers, while maintaining operating margin and leveraging its strong portfolio of products.\nIf the global macroeconomic or geopolitical conditions worsen, projected revenue growth rates or operating margins decline, weighted-average cost of capital increases, or if we have a significant or sustained decline in our stock price, it is possible the estimates about our Hybrid Cloud and Server reporting units’ ability to successfully address the current challenges may change, which could result in the carrying value of the Hybrid Cloud and Server reporting units exceeding their estimated fair value and potential impairment charges.\nLIQUIDITY AND CAPITAL RESOURCES\nCurrent Overview\nWe use cash generated by operations as our primary source of liquidity. We believe that internally generated cash flows will be generally sufficient to support our operating businesses, capital expenditures, product development initiatives, acquisitions and disposal activities including legal settlements, restructuring activities, transformation costs, indemnifications, maturing debt, interest payments, and income tax payments, in addition to any future investments, share repurchases, and stockholder dividend payments. We expect to supplement this short-term liquidity, if necessary, by accessing the capital markets, issuing commercial paper, and borrowing under credit facilities made available by various domestic and foreign financial institutions. However, our access to capital markets may be constrained and our cost of borrowing may increase under certain business, market and economic conditions. We anticipate that the funds made available, cash generated from our operations, along with our access to capital markets, will be sufficient to meet our liquidity requirements for at least the next twelve months and for the foreseeable future thereafter. Our liquidity is subject to various risks including the risks identified in the section entitled “Risk Factors” in Item 1A of Part I of the Annual Report on Form 10-K for the fiscal year ended October 31, 2024, as modified by the risk statements in the section titled “Risk Factors” in Item 1A of Part II subsequent Quarterly Reports, and market risks identified in the section entitled “Quantitative and Qualitative Disclosures about Market Risk” in Item 3 of Part I of this Quarterly Report.\nOur cash balances are held in numerous locations throughout the world, with a substantial amount held outside the U.S. as of July 31, 2025. We utilize a variety of planning and financing strategies in an effort to ensure that our worldwide cash is available when and where it is needed.\nAmounts held outside of the U.S. are generally utilized to support our non-U.S. liquidity needs. Repatriations of amounts held outside the U.S. generally will not be taxable from a U.S. federal tax perspective, but may be subject to state income or foreign withholding tax. Where local restrictions prevent an efficient intercompany transfer of funds, our intent is to keep cash balances outside of the U.S. and to meet liquidity needs through ongoing cash flows, external borrowings, or both. We do not expect restrictions or potential taxes incurred on repatriation of amounts held outside of the U.S. to have a material effect on our overall liquidity, financial condition, or results of operations.\nIn connection with the share repurchase program previously authorized by our Board of Directors, we repurchased and settled an aggregate amount of $102 million, during the first nine months of fiscal 2025. As of July 31, 2025, we had a remaining authorization of approximately $0.7 billion for future share repurchases. For more information on our share \n61\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nrepurchase program, refer to the section entitled “Unregistered Sales of Equity Securities and Use of Proceeds” in Item 2 of Part II.\nOn May 23, 2024, we announced plans to divest our CTG business to HCLTech. CTG was included in our Communications and Media Solutions business, which was reported in the Corporate Investments and Other segment. This divestiture includes the platform-based software solutions portions of the CTG portfolio, including systems integration, network applications, data intelligence, and the business support systems groups. On December 1, 2024, we completed the disposition of CTG. We received net proceeds of $210 million and recognized a gain of $245 million included in Gain on sale of a business in the Condensed Consolidated Statements of Earnings.\nHPE funded the aggregate consideration for the Merger through a combination of cash from its balance sheet, commercial paper issuances, and borrowings pursuant to the three-year delayed-draw term loan credit facility of $3.0 billion and the 364-day delayed-draw term loan credit facility of $1.0 billion entered into in September 2024.\nFor more information on the drawdown term loan facility, see Note 12 “Borrowings” in Item 1 of Part I.\nLiquidity\nOur cash, cash equivalents, restricted cash, total debt, and available borrowing resources were as follows:\nAs of \nJuly 31, 2025\nOctober 31, 2024\nIn millions\nCash, cash equivalents and restricted cash\n$\n4,697 \n$\n15,105 \nTotal debt\n23,653 \n18,246 \nAvailable borrowing resources\n(1)\n6,139 \n6,009 \nCommercial paper programs\n(2)\n5,125 \n5,101 \nUncommitted lines of credit\n(3)\n$\n1,014 \n$\n908 \n(1)    The prior period excludes the financing commitment for the Merger. The maximum aggregate commitment under those facilities is $4.0 billion, however, no balances were outstanding under these facilities as of the prior period. \n(2)     The maximum aggregate borrowing amount of the commercial paper programs and revolving credit facility is $5.75 billion as of July 31, 2025 and October 31, 2024, with an incremental $500 million accessible exclusively through the revolving credit facility as of July 31, 2025.\n(3)    The maximum aggregate capacity under the uncommitted lines of credit is $1.4 billion, of which $0.4 billion was primarily utilized towards issuances of bank guarantees.\nThe following tables represent the way in which management reviews cash flows:\nFor the nine months ended July 31,\n2025\n2024\nIn millions\nNet cash provided by operating activities\n$\n454 \n$\n2,311 \nNet cash used in investing activities\n(13,614)\n(1,580)\nNet cash provided by (used in) financing activities\n2,743 \n(1,372)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n9 \n(35)\nChange in cash, cash equivalents and restricted cash\n$\n(10,408)\n$\n(676)\nFree cash flow\n$\n(934)\n$\n797 \nOperating Activities\nFor the nine months ended July 31, 2025, net cash provided by operating activities decreased by $1.9 billion, as compared to the corresponding period in fiscal 2024. The decrease was primarily due to unfavorable working capital changes driven by the timing of payments, and unfavorable changes from other assets and liabilities. The decrease was moderated by an increase in collection from financing receivables, as compared to the prior-year period.\n62\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nOur working capital metrics and cash conversion impacts were as follows:\n \nAs of\nAs of\n \nJuly 31, 2025\nOctober 31, 2024\nChange\nJuly 31, 2024\nOctober 31, 2023\nChange\nY/Y Change\nDays of sales outstanding in accounts receivable (\"DSO\")\n56 \n38 \n18 \n45 \n43 \n2 \n11 \nDays of supply in inventory (\"DOS\")\n100 \n120 \n(20)\n131 \n87 \n44 \n(31)\nDays of purchases outstanding in accounts payable (\"DPO\")\n(121)\n(170)\n49 \n(172)\n(134)\n(38)\n51 \nCash conversion cycle\n35 \n(12)\n47 \n4 \n(4)\n8 \n31 \nThe cash conversion cycle is the sum of DSO and DOS less DPO. Items which may cause the cash conversion cycle in a particular period to differ include, but are not limited to, changes in business mix, changes in payment terms (including extended payment terms to customers or from suppliers), early or late invoice payments from customers or to suppliers, the extent of receivables factoring, seasonal trends, the timing of the revenue recognition and inventory purchases within the period, the impact of commodity costs, and acquisition activity. \nDSO measures the average number of days our receivables are outstanding. DSO is calculated by dividing ending accounts receivable, net of allowance for doubtful accounts, by a 90-day average of net revenue. Compared to the corresponding three-month period in fiscal 2024, the increase in DSO in the current period was primarily due to the impact of incremental receivables as a result of the Merger.\nDOS measures the average number of days from procurement to sale of our products. DOS is calculated by dividing ending inventory by a 90-day average of cost of goods sold. Compared to the corresponding three-month period in fiscal 2024, the decrease in DOS in the current period was primarily due to higher shipments for large deals and lower purchases, partially offset by the impact of incremental inventory as a result of the Merger.\nDPO measures the average number of days our accounts payable balances are outstanding. DPO is calculated by dividing ending accounts payable by a 90-day average of cost of goods sold. Compared to the corresponding three-month period in fiscal 2024, the decrease in DPO in the current period was primarily due to lower purchases.\nInvesting Activities\nFor the nine months ended July 31, 2025, net cash used in investing activities increased by $12.0 billion, as compared to the corresponding period in fiscal 2024. The increase was primarily due to a payment made for the Merger, net of cash acquired of $12.3 billion, partially offset by proceeds from the divestiture of our CTG business of $0.2 billion during the current period, as compared to the prior-year period.\nFinancing Activities\nFor the nine months ended July 31, 2025, net cash provided by financing activities increased by $4.1 billion, as compared to the corresponding period in fiscal 2024. This increase was primarily due to higher proceeds from debt, net of issuance costs of $3.2 billion, lower repayments of debt of $1.1 billion, partially offset by higher cash utilized for stock-based award activities of $0.2 billion, as compared to the prior-year period.\nFree Cash Flow\nFree cash flow (“FCF”) represents cash flow from operations less net capital expenditures (investments in property, plant and equipment (“PP&E”) and software assets less proceeds from the sale of PP&E), and adjusted for the effect of exchange rate fluctuations on cash, cash equivalents, and restricted cash. For the nine months ended July 31, 2025, FCF decreased by $1.7 billion, as compared to the corresponding period in fiscal 2024. This was primarily due to lower cash provided by operating activities, as compared to the prior-year period. For more information on our FCF, refer to the section entitled “GAAP to non-GAAP Reconciliations” included in this MD&A.\nFor more information on the impact of operating assets and liabilities to our cash flows, see Note 6, “Balance Sheet Details” to the Condensed Consolidated Financial Statements in Item 1 of Part I.\n63\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nCapital Resources\nWe maintain debt levels that we establish through consideration of several factors, including cash flow expectations, cash requirements for operations, investment plans (including acquisitions), share repurchase activities, our cost of capital, and targeted capital structure. We maintain a revolving credit facility and two commercial paper programs, “the Parent Programs,” and a wholly-owned subsidiary maintains a third program. In September 2024, we terminated our prior senior unsecured revolving credit facility that was entered into in December 2021, and entered into a new senior unsecured revolving credit facility with an aggregate lending commitment of $5.25 billion for a period of five years. The commitment initially comprised of (i) $4.75 billion of commitments available immediately and (ii) $500 million of commitments available from and subject to the closing of the Merger and refinancing of Juniper Networks’ credit agreement. With the completion of the Merger and the associated refinancing, the full $5.25 billion commitment under the new facility is now available to us. There have been no changes to our commercial paper programs since October 31, 2024.  \nIn December 2023, we filed a shelf registration statement with the Securities and Exchange Commission that allows us to sell, at any time and from time to time, in one or more offerings, debt securities, preferred stock, common stock, warrants, depository shares, purchase contracts, guarantees or units consisting of any of these securities.\nOn August 18, 2025, we elected to redeem the entire $2.5 billion aggregate principal amount of its outstanding 4.900% Notes due 2025, on September 17, 2025 (“Redemption Date”). The Notes will be redeemed at par, plus accrued and unpaid interest up to, but not including, the Redemption Date.\nSubsequent to the quarter end, we sold approximately $739 million of available-for-sale investments and recognized a realized gain of approximately $2 million.\nSignificant funding and liquidity activities for the nine months ended July 31, 2025 were as follows:\nDebt Issuances:\n•\nIn July 2025, we assumed fixed-rate Senior Notes of Juniper Networks with par value of $1.7 billion as a part of the Merger. For further information see Note 8, “Acquisitions and Dispositions” to the Condensed Consolidated Financial Statements in Item 1 of Part I.\n•\nIn July 2025, to support the funding of the Merger, we drew $3.0 billion under the three-year delayed-draw term loan credit facility and $1.0 billion under the 364-day delayed-draw term loan credit facility. The 364-day loan is scheduled for full repayment on July 1, 2026. The three-year loan is subject to quarterly amortization at 1.25%, with the remaining balance due at maturity on June 30, 2028.\n•\nIn July 2025, we issued $900 million of asset-backed debt securities in six tranches at a weighted-average interest rate of 4.673% and a final maturity date of March 2033.\nDebt Repayments:\n•\nDuring the nine months ended July 31, 2025, we repaid $1.1 billion of the outstanding asset-backed debt securities.\nCash Requirements and Commitments \nUnconditional purchase obligations\nIn connection with the Merger, our unconditional purchase obligations increased by $1.2 billion. As of July 31, 2025, unconditional purchase obligations totaled $3.0 billion, of which $463 million is due within fiscal 2025. Our unconditional purchase obligations are related principally to inventory purchases, software maintenance and support services and other items. Unconditional purchase obligations exclude agreements that are cancellable without penalty.\nRetirement Benefit Plan Funding\nFor the remainder of fiscal 2025, we anticipate making contributions of approximately $52 million to our non-U.S. pension plans. Our policy is to fund our pension plans so that we meet at least the minimum contribution requirements, as established by various authorities including local government and tax authorities.\n64\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nRestructuring Plans\nAs of July 31, 2025, we expect to make future cash payments of approximately $124 million in connection with our approved restructuring plans, which includes $21 million expected to be paid through the remainder of fiscal 2025 and $103 million expected to be paid thereafter. For more information on our restructuring activities, see Note 3, “Transformation Programs” to the Condensed Consolidated Financial Statements in Item 1 of Part I.\nCost Reduction Program\nThe Program is expected to be implemented through fiscal year 2026. The estimates of the duration of the Program, the charges and expenditures that we expect to incur in connection therewith, and the timing thereof are subject to a number of assumptions, including local law requirements in various jurisdictions, and actual amounts may differ materially from estimates. As of July 31, 2025, we expect to make future cash payments of approximately $327 million in connection with the Program, which includes $79 million expected to be paid through the remainder of fiscal 2025 and $248 million expected to be paid thereafter. \nUncertain Tax Positions \nAs of July 31, 2025, we had approximately $237 million of recorded liabilities and related interest and penalties pertaining to uncertain tax positions. These liabilities and related interest and penalties include $2 million expected to be paid within one year. For the remaining amount, we are unable to make a reasonable estimate as to when cash settlement with the tax authorities might occur due to the uncertainties related to these tax matters. Payments of these obligations would result from settlements with taxing authorities. For more information on our uncertain tax positions, see Note 5, “Taxes on Earnings” to the Condensed Consolidated Financial Statements in Item 1 of Part I.\nFor further information see “Cash Requirements and Commitments” in Item 7 of Part II of our Annual Report on Form 10-K for the fiscal year ended October 31, 2024.\nOff-Balance Sheet Arrangements\nAs part of our ongoing business, we have not participated in transactions that generate material relationships with unconsolidated entities or financial partnerships, such as entities often referred to as structured finance or special purpose entities, established for the purpose of facilitating off-balance sheet arrangements or other contractually narrow or limited purposes.\nWe have third-party revolving short-term financing arrangements intended to facilitate the working capital requirements of certain customers. For more information on our third-party revolving short-term financing arrangements, see Note 6, “Balance Sheet Details”, to the Condensed Consolidated Financial Statements in Item 1 of Part I.\n65\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nGAAP to non-GAAP Reconciliations\nThe following tables provide a reconciliation of each non-GAAP financial measure to the most directly comparable GAAP financial measure for the periods presented:\nReconciliation of GAAP gross profit and gross profit margin to non-GAAP gross profit and gross profit margin.\nFor the three months ended July 31,\nFor the nine months ended July 31,\n2025\n2024\n2025\n2024\nDollars\n% of\nRevenue\nDollars\n% of\nRevenue\nDollars\n% of\nRevenue\nDollars\n% of\nRevenue\nDollars in millions\nGAAP net revenue\n$\n9,136 \n100 \n%\n$\n7,710 \n100 \n%\n$\n24,617 \n100 \n%\n$\n21,669 \n100 \n%\nGAAP cost of sales\n6,464 \n70.8 \n%\n5,271 \n68.4 \n%\n17,481 \n71.0 \n%\n14,397 \n66.4 \n%\nGAAP gross profit\n2,672 \n29.2 \n%\n2,439 \n31.6 \n%\n$\n7,136 \n29.0 \n%\n7,272 \n33.6 \n%\nNon-GAAP adjustments\nStock-based compensation expense\n10 \n0.1 \n%\n9 \n0.1 \n%\n40 \n0.2 \n%\n39 \n0.2 \n%\nAcquisition, disposition and other charges\n(1)\n50 \n0.5 \n%\n2 \n— \n%\n47 \n0.2 \n%\n(30)\n(0.1)\n%\nCost reduction program\n— \n— \n%\n— \n— \n%\n46 \n0.2 \n%\n— \n— \n%\nH3C divestiture related severance costs \n— \n— \n%\n— \n— \n%\n17 \n0.1 \n%\n— \n— \n%\nNon-GAAP gross profit\n$\n2,732 \n29.9 \n%\n$\n2,450 \n31.8 \n%\n$\n7,286 \n29.6 \n%\n$\n7,281 \n33.6 \n%\n \n(1)     Includes disaster recovery and divestiture related exit costs. For the three and nine months ended July 31, 2025, Acquisition, disposition and other charges include non-cash amortization of fair value adjustment for inventory in connection with the Merger, which was recorded in cost of sales.\n66\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nReconciliation of GAAP earnings (loss) from operations and operating profit margin to non-GAAP earnings from operations and operating profit margin.\nFor the three months ended July 31,\nFor the nine months ended July 31,\n2025\n2024\n2025\n2024\nDollars\n% of\nRevenue\nDollars\n% of\nRevenue\nDollars\n% of\nRevenue\nDollars\n% of\nRevenue\nDollars in millions\nGAAP earnings (loss) from operations\n$\n247 \n2.7 \n%\n$\n547 \n7.1 \n%\n$\n(429)\n(1.7)\n%\n$\n1,497 \n6.9 \n%\nNon-GAAP Adjustments:\nAmortization of intangible assets\n126 \n1.4 \n%\n60 \n0.8 \n%\n201 \n0.8 \n%\n198 \n0.9 \n%\nImpairment of goodwill\n— \n— \n%\n— \n— \n%\n1,361 \n5.5 \n%\n— \n— \n%\nTransformation costs\n— \n— \n%\n14 \n0.2 \n%\n2 \n— \n%\n67 \n0.3 \n%\nStock-based compensation expense\n177 \n1.9 \n%\n80 \n1.0 \n%\n447 \n1.8 \n%\n341 \n1.6 \n%\nH3C divestiture related severance costs\n— \n— \n%\n— \n— \n%\n97 \n0.4 \n%\n— \n— \n%\nCost reduction program\n2 \n— \n%\n— \n— \n%\n148 \n0.6 \n%\n— \n— \n%\nAcquisition, disposition and other charges\n(1)\n225 \n2.5 \n%\n70 \n0.9 \n%\n343 \n1.4 \n%\n127 \n0.6 \n%\nNon-GAAP earnings from operations\n$\n777 \n8.5 \n%\n$\n771 \n10.0 \n%\n$\n2,170 \n8.8 \n%\n$\n2,230 \n10.3 \n%\n \n(1)     Includes disaster recovery and divestiture related exit costs. For the three and nine months ended July 31, 2025, Acquisition, disposition and other charges include non-cash amortization of fair value adjustment for inventory in connection with the Merger, which was recorded in cost of sales.\n67\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nReconciliation of GAAP net earnings (loss) and diluted net EPS to non-GAAP net earnings and diluted net EPS.\nFor the three months ended July 31,\nNine months ended July 31,\n2025\n2024\n2025\n2024\nDollars\nDiluted Net EPS\nDollars\nDiluted Net EPS\nDollars\nDiluted Net EPS\n(1)\nDollars\nDiluted Net EPS\nDollars in millions except per share amounts\nGAAP net earnings (loss)\n$\n305 \n$\n0.21 \n$\n512 \n$\n0.38 \n$\n(118)\n$\n(0.16)\n$\n1,213 \n$\n0.92 \nNon-GAAP Adjustments:\nAmortization of intangible assets\n126 \n0.09 \n60 \n0.05 \n201 \n0.15 \n198 \n0.15 \nImpairment of goodwill\n— \n— \n— \n— \n1,361 \n1.03 \n— \n— \nTransformation costs\n— \n— \n14 \n0.01 \n2 \n— \n67 \n0.05 \nStock-based compensation expense\n177 \n0.12 \n80 \n0.06 \n447 \n0.34 \n341 \n0.26 \nGain on sale of a business\n(1)\n— \n— \n— \n(245)\n(0.19)\n— \n— \nH3C divestiture related severance costs\n— \n— \n— \n— \n97 \n0.07 \n— \n— \nCost reduction program\n2 \n— \n— \n— \n148 \n0.11 \n— \n— \nAcquisition, disposition and other charges\n(2)\n225 \n0.17 \n70 \n0.05 \n343 \n0.26 \n127 \n0.10 \nAdjustments for equity interests\n— \n— \n(44)\n(0.04)\n— \n— \n(132)\n(0.10)\nLitigation judgment\n(52)\n(0.04)\n— \n— \n(52)\n(0.04)\n— \n— \nLoss (gain) on equity investments, net\n1 \n— \n(14)\n(0.01)\n(8)\n— \n47 \n0.03 \nOther adjustments\n(3)\n(24)\n(0.02)\n4 \n— \n(82)\n(0.06)\n5 \n— \nAdjustments for taxes\n(128)\n(0.09)\n(21)\n(0.01)\n(234)\n(0.19)\n(6)\n(0.01)\nNon-GAAP net earnings attributable to HPE\n(4)\n631 \n$\n0.44 \n661 \n$\n0.50 \n1,860 \n$\n1.32 \n1,860 \n$\n1.40 \nPreferred stock dividends\n(29)\n— \n(87)\n— \nNon-GAAP net earnings attributable to common stockholders\n$\n602 \n$\n661 \n$\n1,773 \n$\n1,860 \n \n(1)  Non-GAAP diluted net EPS reflects any dilutive effect of outstanding convertible Preferred Stock and employee stock plans, but that effect is excluded when calculating GAAP diluted net EPS as that would be anti-dilutive. See Note 14 “Net Earnings (Loss) Per Share”, to the Condensed Consolidated Financial Statements in Item 1 of Part I for further information.\n68\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\n(2)    Includes disaster recovery and divestiture related exit costs. For the three and nine months ended July 31, 2025, Acquisition, disposition and other charges include non-cash amortization of fair value adjustment for inventory in connection with the Merger, which was recorded in cost of sales.\n(3)    Other adjustments includes non-service net periodic benefit cost and tax indemnification and other adjustments.\n(4)    For purposes of calculating Non-GAAP diluted net EPS, the Preferred Stock dividends are added back to the Non-GAAP net earnings attributable to common stockholders, and the diluted weighted-average share calculation assumes the Preferred Stock was converted at issuance or as of the beginning of the reporting period. See the table below for the shares used to calculate Non-GAAP diluted net EPS.\nShares used to calculate Non-GAAP diluted net EPS.\nFor the three months ended July 31,\nFor the nine months ended July 31, 2025\n2025\n2024\n2025\n2024\nIn millions\nWeighted-average shares used to compute basic net EPS\n1,325 \n1,312 \n1,321 \n1,308 \nDilutive effect of employee stock plans\n16 \n20 \n14 \n17 \nDilutive effect of 7.625% Series C mandatory convertible preferred stock\n80 \n— \n78 \n— \nWeighted-average shares used to compute Non-GAAP diluted net EPS\n1,421 \n1,332 \n1,413 \n1,325 \nReconciliation of net cash provided by operating activities to free cash flow.\nFor the three months ended July 31,\nFor the nine months ended July 31, 2025\n2025\n2024\n2025\n2024\nIn millions\nNet cash provided by operating activities\n$\n1,305 \n$\n1,154 \n$\n454 \n$\n2,311 \nInvestment in property, plant and equipment and software assets\n(576)\n(543)\n(1,651)\n(1,759)\nProceeds from sale of property, plant and equipment\n90 \n62 \n254 \n280 \nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n(29)\n(4)\n9 \n(35)\nFree cash flow\n$\n790 \n$\n669 \n$\n(934)\n$\n797 \nUse of Non-GAAP Financial Measures\nThe non-GAAP financial measures presented are net revenue on a constant currency basis (including at the business segment level), non-GAAP gross profit, non-GAAP gross profit margin, non-GAAP earnings from operations, non-GAAP operating profit margin (non-GAAP earnings from operations as a percentage of net revenue), non-GAAP tax rate, non-GAAP net earnings attributable to HPE, non-GAAP net earnings attributable to common stockholders, non-GAAP diluted net earnings per share attributable to common stockholders, and FCF. These non-GAAP financial measures are not computed in accordance with, or as an alternative to, generally accepted accounting principles in the United States. The GAAP measure most directly comparable to net revenue on a constant currency basis is net revenue. The GAAP measure most directly comparable to non-GAAP gross profit is gross profit. The GAAP measure most directly comparable to non-GAAP gross profit margin is gross profit margin. The GAAP measure most directly comparable to non-GAAP earnings from operations is earnings from operations. The GAAP measure most directly comparable to non-GAAP operating profit margin (non-GAAP earnings from operations as a percentage of net revenue) is operating profit margin (earnings from operations as a percentage of net revenue). The GAAP measure most directly comparable to non-GAAP income tax rate is income tax rate. The GAAP measure most directly comparable to non-GAAP net earnings attributable to HPE and non-GAAP net earnings attributable to common stockholders is net earnings. The GAAP measure most directly comparable to non-GAAP diluted net earnings per share attributable to common stockholders is diluted net earnings per share attributable to common stockholders. The GAAP measure most directly comparable to FCF is cash flow from operations. \n69\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nWe believe that providing the non-GAAP measures stated above, in addition to the related GAAP measures provides greater transparency to the information used in our financial and operational decision making and allows the reader of our Condensed Consolidated Financial Statements to see our financial results “through the eyes” of management. We further believe that providing this information provides investors with a supplemental view to understand our historical and prospective operating performance and to evaluate the efficacy of the methodology and information used by management to evaluate and measure such performance. Disclosure of these non-GAAP financial measures also facilitates comparisons of our operating performance with the performance of other companies in the same industry that supplement their GAAP results with non-GAAP financial measures that may be calculated in a similar manner.\nEconomic Substance of non-GAAP Financial Measures \nNet revenue on a constant currency basis assumes no change to the foreign exchange rate utilized in the comparable prior-year period. This measure assists investors with evaluating our past and future performance, without the impact of foreign exchange rates, as more than half of our revenue is generated outside of the U.S.\nWe believe that excluding the items mentioned below from the non-GAAP financial measures provides a supplemental view to management and our investors of our consolidated financial performance and presents the financial results of the business without costs that we do not believe to be reflective of our ongoing operating results. Exclusion of these items can have a material impact on the equivalent GAAP measure and cash flows thus limiting the use of such non-GAAP financial measures as analytic tools. See “Compensation for Limitations With Use of Non-GAAP Financial Measures” section below for further information.\nNon-GAAP gross profit and non-GAAP gross profit margin are defined to exclude charges related to the stock-based compensation expense, acquisition, disposition and other charges, severance costs associated with the cost reduction program, and H3C divestiture related severance costs. See below for the reasons management excludes each item:\n•\nStock-based compensation expense consists of equity awards granted based on the estimated fair value of those awards at grant date. Although stock-based compensation is a key incentive offered to our employees, we exclude these charges for the purpose of calculating these non-GAAP measures, primarily because they are non-cash expenses and our internal benchmarking analyses evidence that many industry participants and peers present non-GAAP financial measures excluding stock-based compensation expense.\n•\nWe incur costs related to our acquisition, disposition and other charges. Charges include expenses associated with acquisitions, non-cash amortization of fair value adjustment for inventory in connection with the Merger, exit costs associated with disposal activities, and disaster (recovery) charges. We exclude these costs because we consider these charges to be discrete events and do not believe they are reflective of normal continuing business operations. For the three and nine months ended July 31, 2025, acquisition charges were driven by costs associated with the Merger and miscellaneous disposition related charges. For the three and nine months ended July 31, 2024, acquisition charges were driven by the Merger and prior acquisitions of Axis and Athonet.\n•\nWe incurred severance and other charges pursuant to cost management initiatives. We exclude these charges because we do not believe they are reflective of normal continuing business operations. We believe eliminating these adjustments for the purposes of calculating non-GAAP measures facilitates the evaluation of our current operating performance.\n•\nWe incurred H3C divestiture related severance costs in connection with the disposition of total issued share capital of H3C. On September 4, 2024, we divested 30% of the total issued share capital of H3C and received proceeds of $2.1 billion of pre-tax consideration ($2.0 billion post-tax). The divestiture resulted in decreased future investment earnings and cash dividend inflows resulting in a decision to implement offsetting cost savings measures. These measures include severance for certain of the Company’s employees. The non-GAAP adjustment represents our costs to execute these related exit actions to offset the loss in equity earnings and related cash flows. We expect future annualized cost savings of approximately $120 million following the completion of these actions.\nNon-GAAP earnings from operations and non-GAAP operating profit margin consist of earnings (loss) from operations or earnings (loss) from operations as a percentage of net revenue excluding the items mentioned above and charges relating to the amortization of intangible assets, impairment of goodwill, and transformation costs. In addition to the items previously explained above, management excludes these items for the following reasons:\n70\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\n•\nWe incur charges relating to the amortization of intangible assets and exclude these charges for purposes of calculating these non-GAAP measures. Such charges are significantly impacted by the timing and magnitude of our acquisitions. We exclude these charges for the purpose of calculating these non-GAAP measures, primarily because they are noncash expenses and our internal benchmarking analyses evidence that many industry participants and peers present non-GAAP financial measures excluding intangible asset amortization. Although this does not directly affect our cash position, the loss in value of intangible assets over time can have a material impact on the equivalent GAAP earnings measure. \n•\nIn the second quarter of fiscal 2025, we recorded a non-cash impairment charge for the goodwill associated with our Hybrid Cloud reporting unit. HPE believes that this non-cash charge does not reflect the Company’s operating results and is not indicative of the underlying performance of the business. HPE excludes these charges for purposes of calculating these non-GAAP measures to facilitate a more meaningful evaluation of HPE’s current operating performance and comparisons to HPE’s operating performance in other periods. Although this does not directly affect our cash position, the loss in value of goodwill over time can have a material impact on the equivalent GAAP earnings measure.\n•\nTransformation costs represent net costs related to the (i) HPE Next Plan and (ii) Cost Optimization and Prioritization Plan. We exclude these costs as they are discrete costs related to two specific transformation programs that were announced in 2017 and 2020, respectively, as multi-year programs necessary to transform the business and IT infrastructure. The primary elements of the HPE Next and the Cost Optimization and Prioritization Plan have been substantially completed by October 31, 2024. The exclusion of the transformation program costs from our non-GAAP financial measures as stated above is to provide a supplemental measure of our operating results that does not include material HPE Next Plan and Cost Optimization and Prioritization Plan costs as we do not believe such costs to be reflective of our ongoing operating cost structure.\nNon-GAAP net earnings attributable to HPE, non-GAAP net earnings attributable to common stockholders, and non-GAAP diluted net earnings per share attributable to common stockholders consist of net earnings (loss) or diluted net earnings (loss) per share excluding those same charges mentioned above, as well as other items such as gain on sale of a business, adjustments for equity interests, gain or loss on equity investments, other adjustments, and adjustments for taxes. Non-GAAP net earnings attributable to HPE and non-GAAP diluted net earnings per share attributable to common stockholders includes preferred stock dividends added back to non-GAAP net earnings attributable to HPE. The Adjustments for taxes line item includes certain income tax valuation allowances and separation taxes, the impact of tax reform, structural rate adjustment, excess tax benefit from stock-based compensation, and adjustments for additional taxes or tax benefits associated with each non-GAAP item. In addition to the items previously explained, management excludes these items for the following reasons:\n•\nGain on sale of a business represents the gain associated with certain disposal activities. On December 1, 2024, we completed the disposition of CTG which resulted in a gain of $245 million. We consider this divestiture to be a discrete event and believe eliminating this adjustment for the purposes of calculating non-GAAP measures facilitates the evaluation of our current operating performance.\n•\nDuring the six months ended April 30, 2024, we stopped reporting H3C earnings in our non-GAAP results due to the planned divestiture of the H3C investment. Per the terms of the original Put Share Purchase Agreement, we weren’t anticipating receiving dividends from this investment prospectively. However, on May 24, 2024, we entered into an Amended and Restated Put Share Purchase Agreement and an Agreement on Subsequent Arrangements, both with UNIS, which, taken together, revise the arrangements governing the aforementioned sale as previously set forth in the original Put Share Purchase Agreement. On September 4, 2024, we divested 30% of the total issued share capital of H3C. We continue to possess the option to sell the remaining 19% of the total issued share capital of H3C at a later date. We believe that eliminating these amounts for purposes of calculating non-GAAP financial measures facilitates the evaluation of our current operating performance.\n•\nIn the third quarter of fiscal 2025, Hewlett Packard Enterprise received $52 million from a settlement to resolve claims solely against Sushovan Hussain, in the ongoing Autonomy litigation. We exclude the litigation judgment for purposes of calculating non-GAAP measures to facilitate a more meaningful evaluation of our current operating performance and comparisons to our operating performance in other periods.\n•\nWe exclude gains and losses (including impairments) on our non-marketable equity investments because we do not believe they are reflective of normal continuing business operations. These adjustments are reflected in Interest and other, net in the Condensed Consolidated Statements of Earnings. We believe eliminating these adjustments for the purposes of calculating non-GAAP measures facilitates the evaluation of our current operating performance.\n71\nTable of Content\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\n•\nWe utilize a structural long-term projected non-GAAP income tax rate in order to provide consistency across the interim reporting periods and to eliminate the effects of items not directly related to our operating structure that can vary in size, frequency and timing. When projecting this long-term rate, we evaluated a three-year financial projection. The projected rate assumes no incremental acquisitions in the three-year projection period and considers other factors including our expected tax structure, our tax positions in various jurisdictions and current impacts from key legislation implemented in major jurisdictions where we operate. For fiscal 2025, we will use a projected non-GAAP income tax rate of 15%, which reflects currently available information as well as other factors and assumptions. The non-GAAP income tax rate could be subject to change for a variety of reasons, including the rapidly evolving global tax environment, significant changes in our geographic earnings mix including due to acquisition activity, or other changes to our strategy or business operations. We will re-evaluate its long-term rate as appropriate. For fiscal 2024, we had a non-GAAP tax rate of 15%. We believe that making these adjustments for purposes of calculating non-GAAP measures, facilitates a supplemental evaluation of our current operating performance and comparisons to past operating results.\nFCF is defined as cash flow from operations, less net capital expenditures (investments in PP&E and software assets less proceeds from the sale of PP&E), and adjusted for the effect of exchange rate fluctuations on cash, cash equivalents, and restricted cash. FCF does not represent the total increase or decrease in cash for the period. Our management and investors can use FCF for the purpose of determining the amount of cash available for investment in our businesses, repurchasing stock and other purposes as well as evaluating our historical and prospective liquidity. \nCompensation for Limitations With Use of Non-GAAP Financial Measures\nThese non-GAAP financial measures have limitations as analytical tools, and these measures should not be considered in isolation or as a substitute for analysis of our results as reported under GAAP. Some of the limitations in relying on these non-GAAP financial measures are that they can have a material impact on the equivalent GAAP earnings measures and cash flows, they may be calculated differently by other companies (limiting the usefulness of those measures for comparative purposes) and may not reflect the full economic effect of the loss in value of certain assets.  \nWe compensate for these limitations on the use of non-GAAP financial measures by relying primarily on our GAAP results and using non-GAAP financial measures only as a supplement. We also provide a reconciliation of each non-GAAP financial measure to its most directly comparable GAAP financial measure for this quarter and prior periods, and we encourage investors to review those reconciliations carefully.\n72\nTable of Contents"
}