{
  "item1": "Over last several years, new megatrends around edge, cloud, data, artificial intelligence (“AI”) emerged shape customer expectations enterprise technology. First, data edge increasing exponentially, driven proliferation devices require secure connectivity enable reliable digital experiences. Second, enterprises need cloud experience everywhere manage data workloads wherever they live across distributed enterprise. Third, data growth creating countless new opportunities generate meaningful business insights.",
  "item7": "Cost sales (exclusive amortization shown separately below) Research development Selling, general administrative Amortization intangible assets Impairment goodwill Transformation costs Acquisition, disposition other related charges Earnings operations Interest other, net Gain sale equity interest Earnings equity interests Earnings before provision taxes Net earnings attributable HPE Preferred stock dividends Net earnings attributable common stockholders Fiscal 2024 compared fiscal 2023 fiscal 2024, total net revenue $30.1 billion represented increase $992 million, 3.4% (increased 3.3% constant currency basis). U.S. net revenue increased $521 million, 5.0% $10.9 billion, net revenue outside U.S. increased $471 million, 2.5%, $19.2 billion.",
  "item2": "Item 2. Management's Discussion Analysis Financial Condition Results Operations. HEWLETT PACKARD ENTERPRISE COMPANY SUBSIDIARIES purposes Management's Discussion Analysis Financial Condition Results Operations (“MD&A”) section, use terms “Hewlett Packard Enterprise”, “HPE”, “Company”, “we”, “us” “our” refer Hewlett Packard Enterprise Company. intend discussion financial condition results operations follows provide information will assist reader understanding Condensed Consolidated Financial Statements, changes certain key items these financial statements period-to-period primary factors accounted these changes, well how certain accounting principles, policies, estimates affect Condensed Consolidated Financial Statements."
}