{
  "source_file": "hpq-20250731.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nHP INC.\nManagement’s Discussion and Analysis of\nFinancial Condition and Results of Operations\nThe discussion of financial condition and results of our operations that follows provides information that will assist the reader in understanding our Condensed Consolidated Financial Statements, the changes in certain key items in those financial statements from year to year, and the primary factors that accounted for those changes, as well as how certain accounting principles, policies and estimates affect our Condensed Consolidated Financial Statements. This discussion should be read in conjunction with our Condensed Consolidated Financial Statements and the related notes that appear elsewhere in this document.\nOVERVIEW\nHP delivers innovative and sustainable devices, services, and subscriptions for personal computing, printing, 3D printing, hybrid work, gaming and other related technologies. We have three reportable segments: Personal Systems, Printing, and Corporate Investments. The Personal Systems segment offers commercial and consumer desktops, notebooks and workstations (including HP’s portfolio of AI PCs and workstations), thin clients, retail POS systems, displays, hybrid systems, software, solutions including endpoint security, and services. The Printing segment provides consumer and commercial printer hardware, supplies, solutions and services. Corporate Investments include certain business incubation and investment projects.\n•\nIn Personal Systems, our long-term strategic focus is on:\n◦\nprofitable growth through innovation, market segmentation and simplification of our portfolio;\n◦\nenhanced innovation in multi-operating systems, multi-architecture, customer segments and other key attributes;\n◦\ninvesting in endpoint services and solutions. We are focused on services, including Device-as-a-Service, as the market shifts to subscription-based solutions, and accelerating in attractive adjacencies such as hybrid systems; and\n◦\ndriving innovation to enable productivity and collaboration, with AI PCs and workstations playing a critical role in the transformation of how people live and work.\n•\nIn Printing, our long-term strategic focus is on:\n◦\noffering innovative, intelligent printing experiences and subscription-based solutions designed to securely serve consumer and SMB customers through our Instant Ink Services and HP All-In Plan, as well as large enterprises through our Managed Print Services solutions;\n◦\nproviding digital printing solutions for industrial graphics segments and applications including commercial publishing, labels, packaging, and textiles; and\n37\nTable of Contents \n◦\nexpanding our footprint in 3D printing across digital manufacturing and strategic applications. \nWe are focused on growing our AI PC, advanced compute solutions, hybrid systems, workforce solutions, consumer subscriptions, industrial graphics and our 3D and personalization businesses collectively at a rate faster than our core business with accretive margins in the longer term. We believe our ability to innovate will help us gain momentum in growth areas like AI PC, advanced compute solutions and hybrid systems, and we see significant opportunities to drive greater recurring revenues across Personal Systems and Printing. Our Workforce Solutions organization drives integration across our commercial services, software and security portfolio. We continue to build on strong portfolios like Instant Ink to grow our Consumer Subscription business. In Industrial Graphics, we are driving the shift from analog to digital in segments like labels and packaging. In 3D and Personalization, we are creating end-to-end solutions that we believe can capture more value with our differentiated technology.\nWe believe we are well positioned to lead the future of work with our competitive product lineup and enhanced portfolio of hybrid systems, remote-computing solutions, and intelligent print solutions. We are driving innovation by accelerating the delivery of AI across our product portfolio and focusing on growth opportunities in commercial, solutions, and premium consumer and gaming markets. We are consolidating all our software resources under the Technology and Innovation Organization to evolve from a transactional hardware company to a more experience-led organization, further strengthening our ability to capture these opportunities.\nWe continue to experience challenges that are representative of the trends and uncertainties that may affect our industry, generally, and our business and financial results, specifically, and we expect these challenges to continue in the short-term. One set of challenges relates to the current macroeconomic environment and the adverse impact on demand for certain of our products. A second set of challenges relates to changes in the competitive landscape. Our primary competitors are exerting competitive pressure in targeted areas and are entering new markets, our emerging competitors are introducing new technologies and business models, and our alliance partners in some businesses are increasingly becoming our competitors in others. A third set of challenges relates to business model changes and our go-to-market execution in an evolving distribution and reseller landscape, with increasing online and omnichannel presence. Specific challenges we face at the segment level are set forth below.\n•\nIn Personal Systems, we face challenges with a competitive pricing environment, variability in commodity costs, and demand softness in certain geographic regions.\n•\nIn Printing, we face challenges from changing customer behaviors as well as competitors with a favorable foreign currency environment and non-original supplies (which includes imitation, refill, or remanufactured alternatives). We also obtain many Printing components from single source suppliers due to technology, availability, price, quality, or other considerations.\nTo address these challenges, we continue to pursue innovation with a view towards developing new products and services aligned with generating market demand and meeting the needs of our customers and partners. In addition, we continue to work on improving our operations and adapting our business models, with a particular focus on enhancing our end-to-end processes, analytics, efficiencies and simplification of our product portfolio. We also continue to work on optimizing our sales coverage models, aligning our sales incentives with our strategic goals, improving channel execution and inventory, production and backlog management, strengthening our capabilities in our areas of strategic focus, effective cost management, strengthening our pricing strategy, and developing and capitalizing on market opportunities.\nMacroeconomic Environment\nOur business and financial performance depend significantly on worldwide economic conditions. We face global macroeconomic challenges such as ongoing geopolitical conflicts (including the military conflict in Ukraine, continued instability in the Middle East, and tensions in the Taiwan Strait and South China Sea), uncertainty in the markets, volatility in exchange rates, inflationary trends and evolving dynamics in the global trade environment. We also experience seasonality in the sale of our products and services which may be affected by general economic conditions. \nSince April 2025, new, substantial tariffs have been imposed on imports to the United States. We continue to evaluate and implement further mitigating actions, including potential supply chain resiliency movements and cost and pricing measures, as the tariff environment evolves. During the nine months ended July 31, 2025, we experienced higher commodity and tariff costs, which were not fully mitigated by pricing and other actions enacted during the period. Should these or other proposed or incremental tariffs, including potential retaliatory actions imposed by other countries, be implemented and sustained for an \n38\nTable of Contents \nextended period of time, as proposed, enacted or otherwise, they may have a significant adverse impact to our results of operations and cash flows to the extent our efforts do not fully mitigate the effects of such tariffs.\nWe are also exposed to fluctuations in foreign currency exchange rates. We have a large global presence, with approximately 65% of our net revenue from outside the United States. As a result, our financial results can be, and particularly in recent periods have been, negatively impacted by fluctuations in foreign currency exchange rates. For a further discussion of trends, uncertainties and other factors that could impact our operating results, see the section entitled “Risk Factors” in Item 1A of Part I in our Annual Report on Form 10-K for the fiscal year ended October 31, 2024.\nTransformation Update  \n \nIn November 2022, we announced our Future Ready Plan (the “Fiscal 2023 Plan” or “Future Ready”) to become a more digitally enabled company, focus investments on key growth opportunities and simplify our operating model. The Fiscal 2023 Plan, as amended on February 27, 2025, is expected to run through the end of fiscal year 2025. The three key elements of our Fiscal 2023 Plan are digital transformation, portfolio optimization, and operational efficiency. We are on track to achieve our overall program savings.\nSince announcing our Fiscal 2023 Plan, we have enhanced our digital capabilities in Workforce Solutions and continued to leverage AI to positively impact our products, solutions and operations. Additionally, we are reducing portfolio complexity, improving continuity of supply, and increasing our forecast accuracy across our business to drive reduction in our cost of sales and operating expenses. We also continued to reduce our structural cost through headcount reductions and are on track to achieve our overall headcount reduction goal. We expect to continue to invest some of the savings into our growth areas and our people.\nSee “Risk Factors—Strategic and Operational Risks—We may not achieve some or all of the expected benefits of our restructuring plans and our restructuring may adversely affect our business” in Item 1A of Part I in our Annual Report on Form 10-K for the fiscal year ended October 31, 2024. For more information on our Fiscal 2023 Plan, see Note 3, “Restructuring and Other Charges,” to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference.\nCRITICAL ACCOUNTING ESTIMATES\nMD&A is based on our Condensed Consolidated Financial Statements, which have been prepared in accordance with U.S. GAAP. The preparation of these financial statements requires management to make estimates, judgments and assumptions that affect the reported amounts of assets, liabilities, net revenue and expenses, and the disclosure of contingent liabilities. Management believes that there have been no significant changes during the nine months ended July 31, 2025 to the items that we disclosed as our critical accounting estimates in MD&A in our Annual Report on Form 10-K for the fiscal year ended October 31, 2024.\nACCOUNTING PRONOUNCEMENTS\nFor a summary of recent accounting pronouncements applicable to our Condensed Consolidated Financial Statements see Note 1, “Basis of Presentation”, to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference.\n39\nTable of Contents \nRESULTS OF OPERATIONS\nRevenue from our international operations has historically represented, and we expect will continue to represent, a majority of our overall net revenue. As a result, our net revenue growth has been impacted, and we expect it will continue to be impacted, by fluctuations in foreign currency exchange rates. In order to provide a framework for assessing performance excluding the impact of foreign currency fluctuations, we supplement the year-over-year percentage change in net revenue with the year-over-year percentage change in net revenue on a constant currency basis, which excludes the effect of foreign currency exchange fluctuations calculated by translating current period revenues using monthly exchange rates from the comparative period and excluding any hedging impact recognized in the current period, and without adjusting for any repricing or demand impacts from changes in foreign currency exchange rates. This information is provided so that net revenue can be viewed with and without the effect of fluctuations in foreign currency exchange rates, which is consistent with how management evaluates our net revenue results and trends, as management does not believe that the excluded items are reflective of ongoing operating results. The constant currency measures are provided in addition to, and not as a substitute for, the year-over-year percentage change in net revenue on a GAAP basis. Other companies may calculate and define similarly labeled items differently, which may limit the usefulness of this measure for comparative purposes. \nResults of operations in dollars and as a percentage of net revenue were as follows:\n \nThree months ended July 31\nNine months ended July 31\n \n2025\n2024\n2025\n2024\n \nDollars\n% of Net Revenue\nDollars\n% of Net Revenue\nDollars\n% of Net Revenue\nDollars\n% of Net Revenue\n \nDollars in millions\nNet revenue:\nProducts\n$\n13,114 \n94.1 \n%\n$\n12,750 \n94.3 \n%\n$\n38,232 \n94.0 \n%\n$\n37,212 \n94.2 \n%\nServices\n818 \n5.9 \n%\n769 \n5.7 \n%\n2,424 \n6.0 \n%\n2,292 \n5.8 \n%\nTotal net revenue\n13,932 \n100.0 \n%\n13,519 \n100.0 \n%\n40,656 \n100.0 \n%\n39,504 \n100.0 \n%\nCost of net revenue:\nProducts\n(1)\n10,599 \n80.8 \n%\n10,164 \n79.7 \n%\n30,800 \n80.6 \n%\n29,359 \n78.9 \n%\nServices\n(2)\n482 \n58.9 \n%\n449 \n58.4 \n%\n1,426 \n58.8 \n%\n1,328 \n57.9 \n%\nTotal cost of net revenue\n11,081 \n79.5 \n%\n10,613 \n78.5 \n%\n32,226 \n79.3 \n%\n30,687 \n77.7 \n%\nGross Margin\n2,851 \n20.5 \n%\n2,906 \n21.5 \n%\n8,430 \n20.7 \n%\n8,817 \n22.3 \n%\nResearch and development\n406 \n2.9 \n%\n413 \n3.1 \n%\n1,204 \n3.0 \n%\n1,248 \n3.2 \n%\nSelling, general and administrative\n1,452 \n10.4 \n%\n1,404 \n10.3 \n%\n4,391 \n10.8 \n%\n4,249 \n10.7 \n%\nRestructuring and other charges\n110 \n0.9 \n%\n46 \n0.3 \n%\n302 \n0.7 \n%\n180 \n0.4 \n%\nAcquisition and divestiture charges\n8 \n0.1 \n%\n22 \n0.2 \n%\n31 \n0.1 \n%\n71 \n0.2 \n%\nAmortization of intangible assets\n159 \n1.1 \n%\n81 \n0.6 \n%\n287 \n0.7 \n%\n242 \n0.6 \n%\nTotal operating expenses\n2,135 \n15.4 \n%\n1,966 \n14.5 \n%\n6,215 \n15.3 \n%\n5,990 \n15.1 \n%\nEarnings from operations\n716 \n5.1 \n%\n940 \n7.0 \n%\n2,215 \n5.4 \n%\n2,827 \n7.2 \n%\nInterest and other, net\n(92)\n(0.6)\n%\n(113)\n(0.9)\n%\n(381)\n(0.9)\n%\n(410)\n(1.1)\n%\nEarnings before taxes\n624 \n4.5 \n%\n827 \n6.1 \n%\n1,834 \n4.5 \n%\n2,417 \n6.1 \n%\nBenefit from (provision for) taxes\n139 \n1.0 \n%\n(187)\n(1.4)\n%\n(100)\n(0.2)\n%\n(548)\n(1.4)\n%\nNet earnings\n$\n763 \n5.5 \n%\n$\n640 \n4.7 \n%\n$\n1,734 \n4.3 \n%\n$\n1,869 \n4.7 \n%\n(1)    \nProducts cost of net revenue as a percentage of net revenue is calculated as a percentage of product net revenue.\n(2)    \nServices cost of net revenue as a percentage of net revenue is calculated as a percentage of services net revenue.\n40\nTable of Contents \nNet Revenue\nProducts net revenue includes revenue from the sale of hardware, supplies, subscriptions and software licenses. Services net revenue includes revenue from our service offerings and support on hardware devices. \nFor the three months ended July 31, 2025, net revenue increased 3.1% (increased 3.3% on a constant currency basis) as compared to the prior-year period. U.S. net revenue increased 1.7% to $5.1 billion, and net revenue from international operations increased 3.8% to $8.9 billion. The increase in net revenue was primarily driven by products net revenue due to increased units in Personal Systems as well as an increase in services net revenue due to support services on hardware devices, partially offset by a decline in Printing net revenue and unfavorable currency impacts. \nFor the nine months ended July 31, 2025, total net revenue increased 2.9% (increased 3.7% on a constant currency basis) as compared to the prior-year period. U.S. net revenue increased 3.0% to $14.2 billion, and net revenue from international operations increased 2.9% to $26.5 billion. The increase in net revenue was primarily driven by products net revenue due to increased units in Commercial PS as well as an increase in services net revenue due to support services on hardware devices, partially offset by a decline in Printing net revenue and unfavorable currency impacts.\nA detailed discussion of the factors contributing to the changes in segment net revenue is included in “Segment Information” below.\nGross Margin\nFor the three months ended July 31, 2025, gross margin decreased by 1.0 percentage points primarily driven by products gross margin due to higher tariff costs, mix shifts towards Personal Systems and unfavorable currency impacts, partially offset by disciplined pricing actions. Services gross margin decreased due to unfavorable mix shifts.\nFor the nine months ended July 31, 2025, gross margin decreased 1.6 percentage points primarily driven by products gross margin due to higher commodity and tariff costs, mix shifts towards Personal Systems and unfavorable currency impacts, partially offset by disciplined pricing actions and cost savings including Future Ready transformation savings. Services gross margin decreased due to unfavorable mix shifts. \nA detailed discussion of the factors contributing to the changes in segment gross margins is included under “Segment Information” below.\nOperating Expenses\nResearch and Development (“R&D”)\nR&D expense remained flat for the three months ended July 31, 2025. R&D expense decreased 3.5% for the nine months ended July 31, 2025 primarily due to disciplined cost savings. \nSelling, General and Administrative (“SG&A”)\nSG&A expense increased 3.4% for the three months ended July 31, 2025 primarily due to higher variable compensation and go-to-market initiatives.\nSG&A expense increased 3.3% for the nine months ended July 31, 2025 primarily due to higher litigation costs, partially offset by lower variable compensation.\nRestructuring and Other Charges\nRestructuring and other charges increased $64 million and $122 million for the three and nine months ended July 31, 2025, respectively, due to the February 2025 amendment of the Fiscal 2023 Plan. For more information, see Note 3, “Restructuring and other charges”, to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference.\nAcquisition and Divestiture Charges\nAcquisition and divestiture charges primarily include direct third-party professional and legal fees, integration and divestiture-related costs, and non-cash adjustments to the fair value of certain acquired assets, such as inventory. Acquisition and divestiture charges for the three and nine months ended July 31, 2025 decreased by $14 million and $40 million, respectively, primarily due to reduced integration activities.\n41\nTable of Contents \nAmortization of Intangible Assets\nAmortization of intangible assets increased for the three and nine months ended July 31, 2025 primarily due to impairment charges of $65 million related to acquired customer contracts, customer lists and distribution agreements within the Print segment and $27 million of technology and patents within the Corporate Investments segment.\nInterest and Other, Net\nInterest and other, net expense decreased $21 million and $29 million for the three and nine months ended July 31, 2025, respectively, primarily due to a gain from a single litigation matter that does not relate to HP’s ongoing business operations, partially offset by unfavorable currency impacts.\nBenefit from (Provision for) Taxes\nOur effective tax rate was (22.3)% for the three months ended July 31, 2025 and 5.5% for the nine months ended July 31, 2025. \nThe difference between the U.S. federal statutory tax rate of 21% and our effective tax rate for the three and nine months ended July 31, 2025 was primarily due to decreases in unrecognized tax benefits.\nDuring the three and nine months ended July 31, 2025, we recorded $281 million and $315 million of net income tax benefits, respectively, related to discrete items in the provision for taxes. These amounts included income tax benefits of $243 million and $228 million related to changes in uncertain tax positions, $20 million and $58 million related to restructuring charges, and $15 million and $18 million related to the filing of tax returns in various jurisdictions for the three and nine months ended July 31, 2025, respectively. The three and nine months ended July 31, 2025 also included benefits of $55 million related to changes in valuation allowances and $22 million related to audit settlements in various jurisdictions. These benefits were partially offset by income tax charges of $80 million related to tax effects of internal reorganization for the three and nine months ended July 31, 2025.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the United States. This legislation introduces several measures, including the permanent extension of select provisions from the Tax Cuts and Jobs Act, revisions to the international tax framework, and the reinstatement of favorable tax treatment for certain business-related items. The OBBBA contains multiple effective dates, with key provisions beginning in our fiscal year 2026. Based on our assessment, we do not anticipate a material impact on our effective tax and cash tax rates.\nIn December 2021, the Organisation for Economic Co-operation and Development (“OECD”) introduced model rules for a global minimum tax framework, commonly referred to as BEPS Pillar Two. Numerous governments worldwide have enacted or are in the process of enacting legislation to implement this framework. Where applicable, we plan to treat the tax as a period cost. As of July 31, 2025, we do not anticipate a material impact on our effective tax rate or cash tax payments in these jurisdictions for fiscal year 2025. Our assessment for future fiscal years may be influenced by additional legislative guidance and the enactment of further provisions within the BEPS Pillar Two framework.\n42\nTable of Contents \nSegment Information\nA description of the products and services for each segment can be found in Note 2, “Segment Information” to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference. \nPersonal Systems\n \nThree months ended July 31\nNine months ended July 31\n \n2025\n2024\n% Change\n2025\n2024\n% Change\n \nDollars in millions\nNet revenue\n$\n9,931\n$\n9,369\n6.0 \n%\n$\n28,179\n$\n26,604\n5.9 \n%\nEarnings from operations\n$\n541\n$\n617\n(12.3)\n%\n$\n1,457\n$\n1,662\n(12.3)\n%\nEarnings from operations as a % of net revenue\n5.4 \n%\n6.6 \n%\n \n5.2 \n%\n6.2 \n%\n \nThe components of net revenue and the weighted net revenue change by business unit were as follows:\n \nThree months ended July 31\nNine months ended July 31\n \nNet Revenue\nWeighted Net Revenue Change\n(1)\nNet Revenue\nWeighted     Net Revenue Change\n(1)\n \n2025\n2024\n2025\n2024\n \nDollars in millions\nPercentage Points\nDollars in millions\nPercentage Points\nCommercial PS\n$\n7,036 \n$\n6,677 \n3.8 \n$\n20,467 \n$\n18,964 \n5.6 \nConsumer PS\n2,895 \n2,692 \n2.2 \n7,712 \n7,640 \n0.3 \nTotal Personal Systems\n$\n9,931 \n$\n9,369 \n6.0 \n$\n28,179 \n$\n26,604 \n5.9 \n(1)\nWeighted Net Revenue Change Percentage Points measures contribution of each business unit towards overall segment revenue growth. It is calculated by dividing the change in revenue of each business unit from the prior-year period by total segment revenue for the prior-year period.\nThree months ended July 31, 2025 compared with three months ended July 31, 2024\nPersonal Systems net revenue increased 6.0% (increased 6.2% on a constant currency basis) for the three months ended July 31, 2025. The net revenue increase was primarily due to a 4.9% increase in PCs unit volume driven by the Windows-based PC operating system refresh and a 2.5% increase in average selling price (“ASPs”). The increase in ASPs is primarily due to disciplined pricing actions, partially offset by unfavorable mix shift towards Consumer PS and currency impacts.\nCommercial PS net revenue increased 5.4% primarily due to a 2.9% increase in units and a 4.6% increase in ASPs. The increase in ASPs is primarily due to favorable mix shifts and disciplined pricing.\nConsumer PS net revenue increased 7.5% primarily due to an 8.4% increase in units, partially offset by a 0.9% decrease in ASPs. The decrease in ASPs was primarily due to unfavorable mix shifts and currency impacts, partially offset by disciplined pricing.\nPersonal Systems earnings from operations as a percentage of net revenue decreased by 1.2 percentage points driven by a decrease in gross margin and an increase in operating expenses as a percentage of revenue. Gross margin decreased primarily due to higher tariff costs as well as unfavorable currency impacts, partially offset by disciplined pricing actions. Operating expenses as a percentage of revenue increased primarily due to higher variable compensation and go-to-market initiatives.\n43\nTable of Contents \nNine months ended July 31, 2025 compared with nine months ended July 31, 2024\nPersonal Systems net revenue increased 5.9% (increased 6.5% on a constant currency basis) for the nine months ended July 31, 2025. The net revenue increase was primarily due to a 3.4% increase in ASPs and a 3.3% increase in PCs unit volume driven by Commercial PS. The increase in ASPs is primarily due to disciplined pricing actions and favorable mix shifts towards Commercial PS, partially offset by unfavorable currency impacts.\nCommercial PS net revenue increased 7.9% primarily due to a 6.3% increase in PC unit volume driven by market expansion and a 2.8% increase in ASPs. The increase in ASPs is primarily due to favorable mix shifts and disciplined pricing actions, partially offset by unfavorable currency impacts.\nConsumer PS net revenue increased 0.9% due to a 2.6% increase in ASPs, partially offset by 1.7% decrease in PC unit volume as a result of our strategy to rebalance our portfolio to a more profitable mix. The increase in ASPs is primarily driven by disciplined pricing actions.\nPersonal Systems earnings from operations as a percentage of net revenue decreased by 1.0 percentage points driven by a decrease in gross margin, partially offset by a decrease in operating expenses as a percentage of revenue. Gross margin decreased primarily due to higher commodity and tariff costs as well as unfavorable currency impacts, partially offset by disciplined pricing actions. Operating expenses as a percentage of revenue decreased primarily driven by lower go-to-market initiatives and variable compensation as well as cost savings including Future Ready transformation savings.\n44\nTable of Contents \nPrinting\n \nThree months ended July 31\nNine months ended July 31\n \n2025\n2024\n% Change\n2025\n2024\n% Change\n \nDollars in millions\nNet revenue\n$\n3,986\n$\n4,143\n(3.8)\n%\n$\n12,436\n$\n12,886\n(3.5)\n%\nEarnings from operations\n$\n689\n$\n715\n(3.6)\n%\n$\n2,313\n$\n2,416\n(4.3)\n%\nEarnings from operations as a % of net revenue\n17.3 \n%\n17.3 \n%\n \n18.6 \n%\n18.7 \n%\n \n    \nThe components of net revenue and the weighted net revenue change by business unit were as follows:\n \nThree months ended July 31\nNine months ended July 31\n \nNet Revenue\nWeighted Net Revenue Change\n(1)\nNet Revenue\nWeighted Net Revenue Change\n(1)\n \n2025\n2024\n2025\n2024\n \nDollars in millions\nPercentage Points\nDollars in millions\nPercentage Points\nSupplies\n$\n2,604 \n$\n2,703 \n(2.4)\n$\n8,155 \n$\n8,430 \n(2.1)\nCommercial Printing\n1,113 \n1,147 \n(0.8)\n3,424 \n3,579 \n(1.2)\nConsumer Printing\n269 \n293 \n(0.6)\n857 \n877 \n(0.2)\nTotal Printing\n$\n3,986 \n$\n4,143 \n(3.8)\n$\n12,436 \n$\n12,886 \n(3.5)\n(1)\nWeighted Net Revenue Change Percentage Points measures contribution of each business unit towards overall segment revenue growth. It is calculated by dividing the change in revenue of each business unit from the prior-year period by total segment revenue for the prior-year period.\nThree months ended July 31, 2025 compared with three months ended July 31, 2024\nPrinting net revenue decreased 3.8% (\ndecreased\n 3.4% on a constant currency basis) for the three months ended \nJuly 31, 2025\n. \nThe decrease in net revenue was driven by Supplies, Commercial Printing, and Consumer Printing as well as unfavorable currency impacts. Net revenue for Supplies decreased 3.7%, primarily due to decline in the installed base and usage as well as unfavorable currency impacts, partially offset by disciplined pricing actions. Printer units decreased by 9.5% primarily due to demand softness, while ASPs increased by 3.7% driven by Commercial Printing.\nNet revenue for Commercial Printing decreased 3.0%, primarily due to an 11.5% decrease in printer unit volume due to demand softness, partially offset by a 6.9% increase in ASPs. The increase in ASPs was primarily driven by favorable mix shifts towards industrial solutions.\nNet revenue for Consumer Printing decreased 8.2%, primarily due to an 8.3% decrease in printer unit volume due to demand softness while ASPs remained flat. \nPrinting earnings from operations as a percentage of net revenue remained flat for the period, including both gross margin and operating expenses as a percentage of revenue.\nNine months ended July 31, 2025 compared with nine months ended July 31, 2024\nPrinting net revenue decreased 3.5% (decreased 2.2% on a constant currency basis) for the nine months ended July 31, 2025. The decrease in net revenue was driven by Supplies and Commercial Printing as well as net unfavorable currency impacts. Net revenue for Supplies decreased 3.3%, primarily due to decline in the installed base and usage as well as unfavorable currency impacts, partially offset by disciplined pricing actions. Printer hardware ASPs decreased 3.9% and printer unit volume decreased 1.3% primarily driven by demand softness. The decrease in ASPs was primarily due to unfavorable mix shifts towards Consumer Printing, competitive pricing and currency impacts. \nNet revenue for Commercial Printing decreased by 4.3%, primarily due to a 4.1% decrease in printer unit volume and a 2.0% decrease in ASPs. The decrease in ASPs was primarily driven by competitive pricing, partially offset by favorable mix shifts.\n45\nTable of Contents \nNet revenue for Consumer Printing decreased 2.3%, primarily due to a 2.7% decrease in ASPs, while printer unit volume remained flat. The decrease in ASPs was primarily driven by unfavorable currency impacts, mix shifts, and competitive pricing.\nPrinting earnings from operations as a percentage of net revenue decreased 0.1 percentage points driven by a decrease in gross margin, partially offset by a decrease in operating expenses as a percentage of revenue. The decrease in gross margin is primarily due to unfavorable mix shifts and higher tariff costs, partially offset by cost savings including Future Ready transformation savings. Operating expenses as a percentage of revenue decreased primarily due to lower variable compensation and the receipt of a government grant in the current period.\nCorporate Investments\nThe loss from operations in Corporate Investments\n for the three and nine months ended July 31, 2025 was\n primarily due to expenses associated with our incubation projects and investments in digital enablement.\n46\nTable of Contents \nLIQUIDITY AND CAPITAL RESOURCES\nWe use cash generated by operations as our primary source of liquidity. We believe that current cash, cash flow from operating activities, new borrowings, available commercial paper authorization and the credit facility will be sufficient to meet HP’s operating cash requirements, planned capital expenditures, interest and principal payments on all borrowings, pension and post-retirement funding requirements, authorized share repurchases and annual dividend payments for the foreseeable future. Additionally, if suitable acquisition opportunities arise, the Company may obtain all or a portion of the required financing through additional borrowings. While our access to capital markets may be constrained and our cost of borrowing may increase under certain business, market and economic conditions, our access to a variety of funding sources to meet our liquidity needs is designed to facilitate continued access to capital resources under all such conditions. Our liquidity is subject to various risks including the risks identified in the section entitled “Risk Factors” in Item 1A of Part I in our Annual Report on Form 10-K for the fiscal year ended October 31, 2024 and the market risks identified in the section entitled “Quantitative and Qualitative Disclosures about Market Risk” in Item 3 of Part I of this report.\nAmounts held outside of the U.S. are generally utilized to support non-U.S. liquidity needs and may from time to time be distributed to the U.S. Repatriations of amounts held outside the U.S. generally will not be taxable from a U.S. federal tax perspective but may be subject to state income or foreign withholding tax upon repatriation. As we evaluate the future cash needs of our operations, we may revise the amount of foreign earnings considered to be permanently reinvested in our foreign subsidiaries and how to utilize such funds, including reducing our gross debt level, or other uses.\nLiquidity\nOur cash, cash equivalents and restricted cash and total debt were as follows: \n \nAs of\n \nJuly 31, 2025\nOctober 31, 2024\n \nIn millions\nCash and cash equivalents\n$\n2,871 \n$\n3,238 \nRestricted cash\n$\n3 \n$\n15 \nTotal debt\n$\n9,602 \n$\n9,669 \nOur key cash flow metrics were as follows:\n \nNine months ended July 31\n \n2025\n2024\n \nIn millions\nNet cash provided by operating activities\n$\n2,073 \n$\n2,126 \nNet cash used in investing activities\n(1,113)\n(514)\nNet cash used in financing activities\n(1,339)\n(1,966)\nNet decrease in cash, cash equivalents and restricted cash\n$\n(379)\n$\n(354)\nOperating Activities\nCompared to the corresponding period in fiscal year 2024, net cash provided by operating activities decreased $0.1 billion for the nine months ended July 31, 2025, primarily due to working capital impacts and lower net earnings, partially offset by changes in receivables from contract manufacturers.\n47\nTable of Contents \nKey Working Capital Metrics\nManagement utilizes current cash conversion cycle information to manage our working capital level. Our working capital metrics and cash conversion cycle impacts were as follows:\n \nAs of\nAs of\n \nJuly 31, 2025\nOctober 31, 2024\nChange\nJuly 31, 2024\nOctober 31, 2023\nChange\nY/Y Change\nDays of sales outstanding in accounts receivable (“DSO”)\n33 \n33 \n— \n31 \n28 \n3 \n2 \nDays of supply in inventory (“DOS”)\n68 \n63 \n5 \n67 \n57 \n10 \n1 \nDays of purchases outstanding in accounts payable (“DPO”)\n(138)\n(138)\n— \n(131)\n(117)\n(14)\n(7)\nCash conversion cycle\n(37)\n(42)\n5 \n(33)\n(32)\n(1)\n(4)\nJuly 31, 2025 as compared to July 31, 2024\nThe cash conversion cycle is the sum of DSO and DOS less DPO. Items which may cause the cash conversion cycle in a particular period to differ from historical trends include, but are not limited to, changes in business mix, changes in payment terms and timing, timing and extent of receivables factoring, seasonal trends and the timing of revenue recognition and inventory purchases within the period.\nDSO measures the average number of days our receivables are outstanding. DSO is calculated by dividing ending accounts receivable, net of allowance for credit losses, by a 90-day average net revenue. The increase in DSO was primarily due to lower factoring.\nDOS measures the average number of days from procurement to sale of our product. DOS is calculated by dividing ending inventory by a 90-day average cost of goods sold. The increase in DOS was primarily due to higher inventory in-transit and tariff mitigation actions.\nDPO measures the average number of days our accounts payable balances are outstanding. DPO is calculated by dividing ending accounts payable by a 90-day average cost of goods sold. The increase in DPO was primarily due to higher purchasing volumes.\nInvesting Activities\nCompared to the corresponding period in fiscal year 2024, net cash used in investing activities increased by $0.6 billion for the nine months ended July 31, 2025, primarily due to collateral posted for derivative instruments of $0.3 billion, higher investment in property, plant, equipment and purchased intangible of $0.3 billion, and payments made in connection with business acquisitions of $0.1 billion.\n48\nTable of Contents \nFinancing Activities\nCompared to the corresponding period in fiscal year 2024, net cash used in financing activities decreased by $0.6 billion for the nine months ended July 31, 2025, primarily due to a $0.9 billion decrease in share repurchases, partially offset by higher net debt repayments of $0.2 billion.\nShare Repurchases and Dividends\nDuring the nine months ended July 31, 2025, HP returned $1.2 billion to shareholders in the form of cash dividends of $0.8 billion and share repurchases of $0.4 billion. As of July 31, 2025, HP had approximately $8.9 billion remaining under the share repurchase authorization approved by HP’s Board of Directors.\nFor more information on our share repurchases, see Note 9, “Stockholders’ Deficit”, to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference.\nCapital Resources\nDebt Levels\n \nAs of\n \nJuly 31, 2025\nOctober 31, 2024\n \nDollars in millions\nShort-term debt\n$\n820 \n$\n1,406 \nLong-term debt\n$\n8,782 \n$\n8,263 \nWeighted-average interest rate\n4.6 \n%\n4.5 \n%\nWe maintain debt levels that we establish through consideration of a number of factors, including cash flow expectations, cash requirements for operations, investment plans (including acquisitions), share repurchase activities, our cost of capital and targeted capital structure.\nOur weighted-average interest rate reflects the effective rate on our borrowings prevailing during the period and reflects the effect of interest rate swaps. For more information on our interest rate swaps, see Note 7, “Financial Instruments”, to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference.\nAs of July 31, 2025, we maintained a $5.0 billion sustainability-linked senior unsecured committed revolving credit facility which will be available until August 1, 2029. Funds borrowed under the revolving credit facility may be used for general corporate purposes.\nAvailable Borrowing Resources\nAs of July 31, 2025, we had available borrowing resources of $1.1 billion from uncommitted lines of credit in addition to funds available under the revolving credit facility.\nFor more information on our borrowings, see Note 8, “Borrowings”, to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference.\nCredit Ratings\nOur credit risk is evaluated by major independent rating agencies based upon publicly available information as well as information they obtain during our ongoing discussions. While we currently do not have any rating downgrade triggers that would accelerate the maturity of a material amount of our debt, a downgrade from our current credit rating may increase the cost of borrowing under our credit facility, reduce market capacity for our commercial paper, require the posting of additional collateral under some of our derivative contracts and may have a negative impact on our liquidity and capital position and our contractual business going forward, depending on the extent of such downgrade. We can access alternative sources of funding, including drawdowns under our credit facility, if necessary, to offset potential reductions in the market capacity for our commercial paper.\n49\nTable of Contents \nCONTRACTUAL AND OTHER OBLIGATIONS\nRetirement and Post-Retirement Benefit Plan Contributions\nAs of July 31, 2025, we anticipate making contributions for the remainder of fiscal year 2025 of approximately $4.0 million\n \nto our non-U.S. pension plans and $10.0 million to cover benefit payments to U.S. non-qualified pension plan participants. Our policy is to fund our pension plans so that we meet the minimum contribution required by local government, funding and taxing authorities. For more information on our retirement and post-retirement benefit plans, see Note 4, “Retirement and Post-Retirement Benefit Plans”, to the Consolidated Financial Statements in our Annual Report on Form 10-K for the fiscal year ended October 31, 2024.\nCost Savings Plan\nAs a result of our approved restructuring plans, we expect to make future cash payments of approximately $0.2 billion. For more information on our restructuring activities that are part of our cost improvements, see Note 3, “Restructuring and Other Charges”, to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference.\nUncertain Tax Positions \nAs of July 31, 2025, we had approximately $837 million of recorded liabilities and related interest and penalties pertaining to uncertain tax positions. We are unable to make a reasonable estimate as to when cash settlement with the tax authorities might occur due to the uncertainties related to these tax matters. Payments of these liabilities would result from settlements with taxing authorities. For more information on our uncertain tax positions, see Note 4, “Taxes on Earnings”, to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference. \nOff-Balance Sheet Arrangements\nAs part of our ongoing business, we have not participated in transactions that generate material relationships with unconsolidated entities or financial partnerships, such as entities often referred to as structured finance or special purpose entities, which would have been established for the purpose of facilitating off-balance sheet arrangements or other contractually narrow or limited purposes.\nHP utilizes certain third-party arrangements in the normal course of business as part of HP’s cash and liquidity management and also to provide liquidity to certain partners to facilitate their working capital requirements. For more information on our third-party short-term financing arrangements, see Note 5, “Supplementary Financial Information”, to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference.\n50\nTable of Contents"
}