{
  "source_file": "hrl-20250727.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nRESULTS OF OPERATIONS\nOverview\nThe Company is a global manufacturer and marketer of branded food products. The Company’s three reportable segments, Retail, Foodservice, and International, are described in Note N - Segment Reporting in the Notes to the Consolidated Financial Statements in this Quarterly Report on Form 10-Q.\nThe Company discloses certain measures not defined by United States (U.S.) Generally Accepted Accounting Principles (GAAP), including organic volume, organic net sales, adjusted selling, general and administrative (SG&A) expenses, adjusted SG&A as a percent of net sales, adjusted earnings before income taxes, and adjusted diluted earnings per share. The Company utilizes these non-GAAP measures to understand and evaluate operating performance on a consistent basis. For additional information and reconciliations to the most closely comparable measures calculated in accordance with GAAP, see the \"Non-GAAP Measures\" section of this Item.\nDiluted earnings per share was $0.33 for the third quarter of fiscal 2025, up 3 percent compared to the same period last year. Adjusted diluted earnings per share for the third quarter of fiscal 2025 was $0.35, down 5 percent compared to the same period last year. Significant factors impacting the quarter are listed below. All comparisons are to the same period of the prior year unless otherwise noted.\n•\nNet sales for the third quarter of fiscal 2025 increased 5 percent compared to the prior year. Organic net sales increased 6 percent with growth in each segment. \n21\nTable of Contents\n•\nTotal segment profit for the third quarter of fiscal 2025 decreased 3 percent. Segment profit declined in each segment.\n•\nRetail segment profit declined in the third quarter of fiscal 2025, as robust net sales growth was more than offset by input cost pressures and higher SG&A expenses. \n•\nFoodservice segment profit decreased in the third quarter of fiscal 2025, as meaningful net sales growth was more than offset by the rise in commodity input costs and margin pressures primarily in non-core businesses.\n•\nInternational segment profit declined in the third quarter of fiscal 2025, as meaningful net sales growth was more than offset by competitive pressures in Brazil and lower pork offal margins.\n•\nEarnings before income taxes for the third quarter of fiscal 2025 increased 5 percent, as the benefits from higher net sales and higher interest and investment income were partially offset by higher input costs. Adjusted earnings before income taxes decreased 2 percent.\n•\nThe pre-tax impact of non-recurring expenses related to the Company’s Transform and Modernize (T&M) initiative in the third quarter of fiscal 2025 was $14.5 million, most of which was recorded in SG&A.\n•\nCash flow from operations was $522 million for the first nine months of fiscal 2025, a 39 percent decrease from the comparable period of the prior year. The decline in cash flow from operations was primarily due to a planned inventory build in the second and third quarters of fiscal 2025 and elevated commodity market prices. \nChanges in global trade policies, including recently announced tariffs and retaliatory tariffs, did not directly have a material impact on our results of operations during the third quarter or first nine months of fiscal 2025. The Company continues to monitor and evaluate the impact of proposed and enacted tariffs, including proposed and enacted retaliatory tariffs, and other trade restrictions, as well as our ability to mitigate their impacts.\nConsolidated Results\nVolume, Net Sales, Earnings, and Diluted Earnings Per Share\n \nQuarter Ended\nNine Months Ended\nIn thousands, except per share amounts\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nVolume (lbs.)\n1,046,590 \n1,018,690 \n2.7 \n3,101,288 \n3,180,087 \n(2.5)\nOrganic Volume (lbs.)\n1,046,590 \n1,002,183 \n4.4 \n3,101,288 \n3,131,065 \n(1.0)\nNet Sales\n$\n3,032,876 \n$\n2,898,443 \n4.6 \n$\n8,920,499 \n$\n8,782,706 \n1.6 \nOrganic Net Sales\n3,032,876 \n2,869,760 \n5.7 \n8,920,499 \n8,698,914 \n2.5 \nEarnings Before Income Taxes\n236,514 \n225,719 \n4.8 \n685,076 \n755,404 \n(9.3)\nNet Earnings Attributable to Hormel Foods Corporation\n183,742 \n176,701 \n4.0 \n534,334 \n584,842 \n(8.6)\nDiluted Earnings Per Share\n0.33 \n0.32 \n3.1 \n0.97 \n1.07 \n(9.3)\nAdjusted Diluted Earnings Per Share\n0.35 \n0.37 \n(5.4)\n1.05 \n1.16 \n(9.5)\nVolume and Net Sales\nVolume and net sales increased for the third quarter of fiscal 2025 while volume decreased and net sales increased for the first nine months of fiscal 2025 compared to the prior year.\nFor the third quarter of fiscal 2025, net sales increased in each segment. Net sales growth across the enterprise was driven primarily by the turkey portfolio, \nPlanters\n®\n \nsnack nuts, the \nSPAM\n®\n family of products, and the Foodservice customized solutions business.\nFor the first nine months of fiscal 2025, net sales increased in each segment. Net sales growth for the first nine months of fiscal 2025 was driven primarily by the turkey portfolio, the customized solutions business, the \nSPAM\n®\n family of products, the Mexican foods portfolio, and the bacon portfolio. \nFor the third quarter of fiscal 2025, volume grew in the Retail and International segments while organic volume grew in the Foodservice segment. For the first nine months of fiscal 2025, organic volume in the Foodservice segment increased compared to the prior year. Volume increased in the International segment and declined in the Retail segment for the first nine months of fiscal 2025.\nIn the fourth quarter of fiscal 2025, the Company expects net sales growth from each of its segments compared to the prior year.\n22\nTable of Contents\nCost of Products Sold\n \nQuarter Ended\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nCost of Products Sold\n$\n2,545,567 \n$\n2,410,075 \n5.6 \n$\n7,473,524 \n$\n7,281,798 \n2.6 \nCost of products sold for the third quarter of fiscal 2025 increased, primarily due to increased volume and higher commodity input costs, mainly for pork bellies, beef, and nuts. Cost of products sold for the first nine months of fiscal 2025 increased primarily due to higher commodity input costs, mainly for pork bellies, nuts, and beef.\nOn a per pound basis, cost of products sold for the third quarter and first nine months of fiscal 2025 increased compared to the prior year.\nGross Profit\n \nQuarter Ended\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nGross Profit\n$\n487,309 \n$\n488,369 \n(0.2)\n$\n1,446,975 \n$\n1,500,908 \n(3.6)\nPercent of Net Sales\n16.1 \n%\n16.8 \n%\n \n16.2 \n%\n17.1 \n%\n \nFor the third quarter and first nine months of fiscal 2025, gross profit as a percent of net sales declined. For the third quarter and first nine months of fiscal 2025, gross profit as a percent of net sales declined for each segment. All segments benefited from savings realized as part of the Company’s T&M initiative in the third quarter and first nine months of fiscal 2025.\nFor the fourth quarter of fiscal 2025, the Company expects gross profit as a percent of net sales to decrease compared to last year. The Company expects gross profit as a percent of net sales to be comparable for the Retail segment and to decrease for the Foodservice and International segments.\nSelling, General, and Administrative (SG&A)\n \nQuarter Ended\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nSG&A\n$\n258,713 \n$\n259,653 \n(0.4)\n$\n773,158 \n$\n766,707 \n0.8 \nPercent of Net Sales\n8.5 \n%\n9.0 \n%\n \n8.7 \n%\n8.7 \n%\n \nAdjusted SG&A\n$\n245,228 \n$\n230,373 \n6.4 \n$\n720,366 \n$\n706,941 \n1.9 \nAdjusted Percent of Net Sales\n8.1 \n%\n7.9 \n%\n8.1 \n%\n8.0 \n%\nFor the third quarter of fiscal 2025, SG&A and SG&A as a percent of net sales decreased, primarily due to the lapping of prior year legal expenses which were partially offset by higher employee-related expenses. \nFor the first nine months of fiscal 2025, SG&A increased and SG&A as a percent of net sales was comparable to the prior year. Higher employee-related expenses, increased expenses related to the T&M initiative, and the loss on the sale of a non-core sow operation were partially offset by the lapping of prior year legal expenses and lower advertising expense. \nAdvertising investments in the third quarter of fiscal 2025 were $41 million, an increase of 2 percent compared to the prior year. For the first nine months of fiscal 2025, advertising investments were $121 million, a decrease of 6 percent compared to last year. The Company expects advertising investments to decrease in the fourth quarter of fiscal 2025 compared to the prior year. \n23\nTable of Contents\nEquity in Earnings of Affiliates\n \nQuarter Ended\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nEquity in Earnings of Affiliates\n$\n11,153 \n$\n7,977 \n39.8 \n$\n42,614 \n$\n39,250 \n8.6 \nEquity in earnings of affiliates for the third quarter of fiscal 2025 increased due to favorable results for MegaMex Foods, LLC, and a modest benefit from international investments. For the first nine months of fiscal 2025, equity in earnings of affiliates increased, primarily due to favorable results for MegaMex Foods, LLC, which were partially offset by the results of international investments.\nInterest and Investment Income and Interest Expense\n \nQuarter Ended\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nInterest and Investment Income\n$\n16,227 \n$\n10,484 \n54.8 \n$\n27,084 \n$\n43,416 \n(37.6)\nInterest Expense\n19,461 \n21,459 \n(9.3)\n58,438 \n61,464 \n(4.9)\nInterest and investment income increased for the third quarter of fiscal 2025, primarily due to favorable rabbi trust performance. Interest and investment income decreased for the first nine months of fiscal 2025, primarily due to lower average monthly cash balances and performance from the rabbi trust. Interest expense decreased in the third quarter and first nine months of fiscal 2025, primarily due to the lapping of interest rate swap amortization.\nEffective Tax Rate\n \nQuarter Ended\nNine Months Ended\n \nJuly 27, 2025\nJuly 28, 2024\nJuly 27, 2025\nJuly 28, 2024\nEffective Tax Rate\n22.3 \n%\n21.7 \n%\n22.1 \n%\n22.6 \n%\nThe effective tax rate in the third quarter of fiscal 2025 was 22.3% compared to 21.7% for the prior year, primarily due to decreased benefits from the purchase of federal transferable energy credits. For the first nine months of fiscal 2025, the Company benefited from increased federal deductions compared to the prior year. For additional information, refer to Note L - Income Taxes of the Notes to the Consolidated Financial Statements.\nThe effective tax rate for fiscal 2025 is expected to be approximately 22.0%. \nSegment Results\nNet sales and segment profit for each of the Company’s reportable segments are set forth below. The Company does not allocate deferred compensation, non-recurring expenses associated with the T&M initiative, gains or losses on the sale of businesses, investment income, interest expense, or interest income to its segments when measuring performance. The Company also retains various other income and expenses at the corporate level. Equity in earnings of affiliates is included in segment profit; however, earnings attributable to the Company’s corporate venturing investments and noncontrolling interests are excluded. These items are included below as Net Unallocated Expense and Noncontrolling Interest when reconciling to Earnings Before Income Taxes.\n24\nTable of Contents\nThe Company is an integrated enterprise, characterized by substantial intersegment cooperation, cost allocations, and sharing of assets. Therefore, the Company does not represent that these segments, if operated independently, would report the profit and other financial information shown below. \n \nQuarter Ended\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\n% Change\nJuly 27, 2025\nJuly 28, 2024\n% Change\nNet Sales\n \n \n \n \n \n \nRetail\n$\n1,858,434 \n$\n1,767,251 \n5.2 \n$\n5,532,401 \n$\n5,467,078 \n1.2 \nFoodservice\n986,976 \n954,021 \n3.5 \n2,853,603 \n2,799,110 \n1.9 \nInternational\n187,466 \n177,171 \n5.8 \n534,495 \n516,517 \n3.5 \nTotal Net Sales\n$\n3,032,876 \n$\n2,898,443 \n4.6 \n$\n8,920,499 \n$\n8,782,706 \n1.6 \nSegment Profit\n \n \n \n \n \n \nRetail\n$\n122,566 \n$\n127,932 \n(4.2)\n$\n378,847 \n$\n409,836 \n(7.6)\nFoodservice\n140,711 \n142,487 \n(1.2)\n420,170 \n441,952 \n(4.9)\nInternational\n18,941 \n21,792 \n(13.1)\n58,193 \n65,026 \n(10.5)\nTotal Segment Profit\n282,218 \n292,211 \n(3.4)\n857,210 \n916,814 \n(6.5)\nNet Unallocated Expense\n45,658 \n66,526 \n(31.4)\n171,769 \n161,239 \n6.5 \nNoncontrolling Interest\n(46)\n34 \n(234.1)\n(366)\n(170)\n(114.7)\nEarnings Before Income Taxes\n$\n236,514 \n$\n225,719 \n4.8 \n$\n685,076 \n$\n755,404 \n(9.3)\nRetail\n \nQuarter Ended\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nVolume (lbs.)\n712,912 \n680,214 \n4.8 \n2,127,075 \n2,170,621 \n(2.0)\nNet Sales\n$\n1,858,434 \n$\n1,767,251 \n5.2 \n$\n5,532,401 \n$\n5,467,078 \n1.2 \nSegment Profit\n122,566 \n127,932 \n(4.2)\n378,847 \n409,836 \n(7.6)\nNet sales growth was wide ranging in the Retail segment in the third quarter of fiscal 2025. Meaningful volume and net sales contributions came from the turkey portfolio, \nPlanters\n®\n snack nuts, and the \nSPAM\n®\n family of products. Other brands which grew volume and net sales in the quarter include \nWholly\n®\n guacamole, \nHormel\n®\n Black Label\n®\n bacon, \nHormel\n®\n chili, and \nGatherings\n®\n party trays. For the first nine months of fiscal 2025, net sales growth for the Retail segment was led by the turkey portfolio, the \nSPAM\n®\n family of products, and the Mexican foods portfolio. \nRetail segment profit declined in the third quarter of fiscal 2025, as robust net sales growth was more than offset by input cost pressures and higher SG&A expenses. For the first nine months of fiscal 2025, segment profit decreased as net sales growth was more than offset by higher input costs.\nFor the fourth quarter of fiscal 2025, Retail segment profit is anticipated to be comparable to the prior year, as the benefit from net sales growth is expected to be offset by higher input costs.\n25\nTable of Contents\nFoodservice\n \nQuarter Ended\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nVolume (lbs.)\n248,540 \n259,947 \n(4.4)\n734,988 \n777,785 \n(5.5)\nOrganic Volume (lbs.)\n248,540 \n243,440 \n2.1 \n734,988 \n728,763 \n0.9 \nNet Sales\n$\n986,976 \n$\n954,021 \n3.5 \n$\n2,853,603 \n$\n2,799,110 \n1.9 \nOrganic Net Sales\n986,976 \n925,338 \n6.7 \n2,853,603 \n2,715,318 \n5.1 \nSegment Profit\n140,711 \n142,487 \n(1.2)\n420,170 \n441,952 \n(4.9)\nOrganic volume and organic net sales growth were broad-based in the Foodservice segment in the third quarter of fiscal 2025, with significant contributions from the customized solutions business, \nPlanters\n®\n \nsnack nuts and the \nJennie-O\n®\n turkey portfolio. Other branded products, such as \nHormel\n®\n pepperoni, \nHormel\n®\n Fire Braised™\n meats, and \nCafé H\n®\n globally inspired proteins, delivered strong volume and net sales growth. \nFor the first nine months of fiscal 2025, organic net sales growth in the Foodservice segment was led by the customized solutions business, the \nJennie-O\n®\n turkey portfolio, and premium prepared proteins. Organic volume\n \nincreased compared to the prior year period.\nSegment profit decreased for the third quarter of fiscal 2025 as meaningful net sales growth was more than offset by the rise in commodity input costs and margin pressures, primarily in non-core businesses. For the first nine months of fiscal 2025, segment profit declined, as net sales growth was more than offset by margin pressures, primarily in non-core businesses.\nThe Foodservice segment continued to benefit from an extensive range of solutions-based products, its direct-selling organization and a diverse channel presence during the third quarter and first nine months of fiscal 2025.\nFor the fourth quarter of fiscal 2025, the Company expects Foodservice segment profit to decrease compared to the prior year, as organic net sales growth is expected to be more than offset by margin pressures, primarily in non-core businesses.\nInternational\n \nQuarter Ended\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nJuly 27, 2025\nJuly 28, 2024\n%\nChange\nVolume (lbs.)\n85,138 \n78,529 \n8.4 \n239,225 \n231,681 \n3.3 \nNet Sales\n$\n187,466 \n$\n177,171 \n5.8 \n$\n534,495 \n$\n516,517 \n3.5 \nSegment Profit\n18,941 \n21,792 \n(13.1)\n58,193 \n65,026 \n(10.5)\nStrong volume and net sales performance in the International segment was driven by growth across the China market and robust exports of \nSPAM\n®\n luncheon meat in the third quarter and first nine months of fiscal 2025.\nInternational segment profit decreased in the third quarter of fiscal 2025 as meaningful net sales growth was more than offset by competitive pressures in Brazil and lower pork offal margins. For the first nine months of fiscal 2025, segment profit declined, as net sales growth was more than offset by softness in Brazil. \nIn the fourth quarter of fiscal 2025, the Company expects International segment profit to decrease compared to the prior year, primarily due to higher input costs and continued softness in Brazil. \n26\nTable of Contents\nUnallocated Income and Expense\n \nQuarter Ended\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\nJuly 27, 2025\nJuly 28, 2024\nNet Unallocated Expense\n$\n45,658 \n$\n66,526 \n$\n171,769 \n$\n161,239 \nNoncontrolling Interest\n(46)\n34 \n(366)\n(170)\nFor the third quarter of fiscal 2025, net unallocated expense decreased, primarily due to the lapping of prior year legal expenses. Net unallocated expense increased for the first nine months of fiscal 2025, primarily due to reduced interest income, the loss on the sale of a non-core sow operation, rabbi trust performance, and higher expenses related to the T&M initiative. These factors were partially offset by the lapping of prior year legal expenses.\nRelated Party Transactions\nThere has been no material change in the information regarding Related Party Transactions as disclosed in the Company’s Annual Report on Form 10-K for the fiscal year ended October 27, 2024.\nNon-GAAP Measures\nThis filing includes measures of financial performance that are not defined by GAAP. The Company utilizes these non-GAAP measures to understand and evaluate operating performance on a consistent basis. These measures may also be used when making decisions regarding resource allocation and in determining incentive compensation. The Company believes these non-GAAP measures provide useful information to investors because they aid analysis and understanding of the Company’s results and business trends relative to past performance and the Company’s competitors. Non-GAAP measures are not intended to be a substitute for GAAP measures in analyzing financial performance. These non-GAAP measures are not calculated in accordance with GAAP and may be different from non-GAAP measures used by other companies.\nTransform and Modernize (T&M) Initiative\nIn the fourth quarter of fiscal 2023, the Company announced a multi-year T&M initiative. In presenting non-GAAP measures, the Company adjusts for (i.e., excludes) expenses for this initiative that are non-recurring, which are primarily project-based external consulting fees and expenses related to supply chain and portfolio optimization (e.g., asset write-offs, severance, or relocation-related costs). The Company believes that non-recurring costs associated with the T&M initiative are not reflective of the Company’s ongoing operating cost structure; therefore, the Company is excluding these discrete costs. The Company does not adjust for (i.e., does not exclude) certain costs related to the T&M initiative that are expected to continue after the project ends, such as software license fees and internal employee expenses, because those costs are considered ongoing in nature as a component of normal operating costs. The Company also does not adjust for savings realized through the T&M initiative as these are considered ongoing in nature and reflective of expected future operating performance.\nLoss on Sale of Business\nIn the first quarter of fiscal 2025, the Company sold Mountain Prairie, LLC, a non-core sow operation, resulting in a loss on the sale. The Company believes the one-time detriment from the sale, including transaction costs, is not reflective of the Company’s ongoing operating cost structure, is not indicative of the Company’s core operating performance, and is not meaningful when comparing the Company’s operating performance against that of prior periods. Thus, the Company has adjusted for (i.e. excluded) the loss.\nLegal Matters\nFrom time to time, the Company incurs expenses related to discrete legal matters that the Company believes are not indicative of the Company’s core operating performance, do not reflect expected future operating costs, and are not meaningful when comparing the Company’s operating performance against that of prior periods. The Company adjusts for (i.e., excludes) these expenses.\nLitigation Settlements\nIn fiscal 2025 and 2024, the Company entered into settlement agreements with certain plaintiffs in its pending antitrust litigation. See Note J - Commitments and Contingencies of the Notes to the Consolidated Financial Statements for additional information.\n27\nTable of Contents\nOrganic Volume and Organic Net Sales\nThe non-GAAP measures of organic volume and organic net sales are presented to provide investors with additional information to facilitate the comparison of past and present operations. Organic volume and organic net sales exclude the impact of the sale of Hormel Health Labs, LLC in the Foodservice segment in the fourth quarter of fiscal 2024.\nThe tables below show the calculations to reconcile from the GAAP measures to the non-GAAP measures presented in this Quarterly Report on Form 10-Q. The tax impacts were calculated using the effective tax rate for the quarter in which the transactions occurred.\nQuarter Ended\nNine Months Ended\nIn thousands, except per share amounts\nJuly 27, 2025\nJuly 28, 2024\nJuly 27, 2025\nJuly 28, 2024\nCost of Products Sold (GAAP)\n$\n2,545,567 \n$\n2,410,075 \n$\n7,473,524 \n$\n7,281,798 \nTransform and Modernize Initiative\n(1)\n(1,010)\n(1,226)\n(3,973)\n(4,646)\nAdjusted Cost of Products Sold (Non-GAAP)\n$\n2,544,557 \n$\n2,408,848 \n$\n7,469,551 \n$\n7,277,152 \nSG&A (GAAP)\n$\n258,713 \n$\n259,653 \n$\n773,158 \n$\n766,707 \nTransform and Modernize Initiative\n(2)\n(13,485)\n(12,280)\n(41,228)\n(31,016)\nLoss on Sale of Business\n— \n— \n(11,324)\n— \nLitigation Settlements\n— \n(17,000)\n(240)\n(28,750)\nAdjusted SG&A (Non-GAAP)\n$\n245,228 \n$\n230,373 \n$\n720,366 \n$\n706,941 \nOperating Income (GAAP)\n$\n239,748 \n$\n236,693 \n$\n716,430 \n$\n773,452 \nTransform and Modernize Initiative\n(1)(2)\n14,496 \n13,506 \n45,202 \n35,663 \nLoss on Sale of Business\n— \n— \n11,324 \n— \nLitigation Settlements\n— \n17,000 \n240 \n28,750 \nAdjusted Operating Income (Non-GAAP)\n$\n254,244 \n$\n267,200 \n$\n773,196 \n$\n837,864 \nEarnings Before Income Taxes (GAAP)\n$\n236,514 \n$\n225,719 \n$\n685,076 \n$\n755,404 \nTransform and Modernize Initiative\n(1)(2)\n14,496 \n13,506 \n45,202 \n35,663 \nLoss on Sale of Business\n— \n— \n11,324 \n— \nLitigation Settlements\n— \n17,000 \n240 \n28,750 \nAdjusted Earnings Before Income Taxes (Non-GAAP)\n$\n251,010 \n$\n256,225 \n$\n741,842 \n$\n819,816 \nProvision for Income Taxes (GAAP)\n$\n52,818 \n$\n48,984 \n$\n151,107 \n$\n170,733 \nTransform and Modernize Initiative\n(1)(2)\n3,233 \n2,931 \n9,960 \n8,009 \nLoss on Sale of Business\n— \n— \n2,469 \n— \nLitigation Settlements\n— \n3,689 \n52 \n6,333 \nAdjusted Provision for Income Taxes (Non-GAAP)\n$\n56,051 \n$\n55,603 \n$\n163,588 \n$\n185,074 \nNet Earnings Attributable to Hormel Foods Corporation (GAAP)\n$\n183,742 \n$\n176,701 \n$\n534,334 \n$\n584,842 \nTransform and Modernize Initiative\n(1)(2)\n11,263 \n10,575 \n35,242 \n27,654 \nLoss on Sale of Business\n— \n— \n8,855 \n— \nLitigation Settlements\n— \n13,311 \n188 \n22,417 \nAdjusted Net Earnings Attributable to Hormel Foods Corporation (Non-GAAP)\n$\n195,005 \n$\n200,588 \n$\n578,620 \n$\n634,913 \nDiluted Earnings Per Share (GAAP)\n$\n0.33 \n$\n0.32 \n$\n0.97 \n$\n1.07 \nTransform and Modernize Initiative\n(1)(2)\n0.02 \n0.02 \n0.06 \n0.05 \nLoss on Sale of Business\n— \n— \n0.02 \n— \nLitigation Settlements\n— \n0.02 \n— \n0.04 \nAdjusted Diluted Earnings Per Share (Non-GAAP)\n$\n0.35 \n$\n0.37 \n$\n1.05 \n$\n1.16 \n28\nTable of Contents\nQuarter Ended\nNine Months Ended\nJuly 27, 2025\nJuly 28, 2024\nJuly 27, 2025\nJuly 28, 2024\nSG&A as a Percent of Net Sales (GAAP)\n8.5 \n%\n9.0 \n%\n8.7 \n%\n8.7 \n%\nTransform and Modernize Initiative\n(2)\n(0.4)\n(0.4)\n(0.5)\n(0.4)\nLoss on Sale of Business\n— \n— \n(0.1)\n— \nLitigation Settlements\n— \n(0.6)\n— \n(0.3)\nAdjusted SG&A as a Percent of Net Sales (Non-GAAP)\n8.1 \n%\n7.9 \n%\n8.1 \n%\n8.0 \n%\nOperating Margin (GAAP)\n7.9 \n%\n8.2 \n%\n8.0 \n%\n8.8 \n%\nTransform and Modernize Initiative\n(1)(2)\n0.5 \n0.5 \n0.5 \n0.4 \nLoss on Sale of Business\n— \n— \n0.1 \n— \nLitigation Settlements\n— \n0.6 \n— \n0.3 \nAdjusted Operating Margin (Non-GAAP)\n8.4 \n%\n9.2 \n%\n8.7 \n%\n9.5 \n%\n(1)    Comprised primarily of equipment relocation expenses, severance, and asset write-offs related to supply chain and portfolio optimization.\n(2)    Comprised primarily of project-based external consulting fees.\nORGANIC VOLUME AND ORGANIC NET SALES (NON-GAAP)\nQuarter Ended\nJuly 27, 2025\nJuly 28, 2024\nIn thousands\nGAAP\nGAAP\nDivestiture\nNon-GAAP Organic\nNon-GAAP\n% Change\nVolume (lbs.)\nRetail\n712,912 \n680,214 \n— \n680,214 \n4.8 \nFoodservice\n248,540 \n259,947 \n(16,507)\n243,440 \n2.1 \nInternational\n85,138 \n78,529 \n— \n78,529 \n8.4 \nTotal Volume (lbs.)\n1,046,590 \n1,018,690 \n(16,507)\n1,002,183 \n4.4 \nNet Sales\nRetail\n$\n1,858,434 \n$\n1,767,251 \n$\n— \n$\n1,767,251 \n5.2 \nFoodservice\n986,976 \n954,021 \n(28,683)\n925,338 \n6.7 \nInternational\n187,466 \n177,171 \n— \n177,171 \n5.8 \nTotal Net Sales\n$\n3,032,876 \n$\n2,898,443 \n$\n(28,683)\n$\n2,869,760 \n5.7 \nNine Months Ended\nJuly 27, 2025\nJuly 28, 2024\nIn thousands\nGAAP\nGAAP\nDivestiture\nNon-GAAP Organic\nNon-GAAP\n% Change\nVolume (lbs.)\nRetail\n2,127,075 \n2,170,621 \n— \n2,170,621 \n(2.0)\nFoodservice\n734,988 \n777,785 \n(49,023)\n728,763 \n0.9 \nInternational\n239,225 \n231,681 \n— \n231,681 \n3.3 \nTotal Volume (lbs.)\n3,101,288 \n3,180,087 \n(49,023)\n3,131,065 \n(1.0)\nNet Sales\nRetail\n$\n5,532,401 \n$\n5,467,078 \n$\n— \n$\n5,467,078 \n1.2 \nFoodservice\n2,853,603 \n2,799,110 \n(83,792)\n2,715,318 \n5.1 \nInternational\n534,495 \n516,517 \n— \n516,517 \n3.5 \nTotal Net Sales\n$\n8,920,499 \n$\n8,782,706 \n$\n(83,792)\n$\n8,698,914 \n2.5 \n29\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nWhen assessing its liquidity and capital resources, the Company evaluates cash and cash equivalents, short-term and long-term investments, income from operations, and borrowing capacity.\nCash Flow Highlights\nNine Months Ended\nIn thousands\nJuly 27, 2025\nJuly 28, 2024\nCash and Cash Equivalents at End of Period\n$\n599,189 \n$\n537,476 \nCash Provided by (Used in) Operating Activities\n522,345 \n858,117 \nCash Provided by (Used in) Investing Activities\n(204,991)\n(176,899)\nCash Provided by (Used in) Financing Activities\n(455,884)\n(879,823)\nIncrease (Decrease) in Cash and Cash Equivalents\n(142,692)\n(199,057)\nCash and cash equivalents decreased $143 million during the first nine months of fiscal 2025 as the Company utilized cash on hand to make additional purchases of inventory and capital assets as well as fund dividend payments. During the first nine months of fiscal 2024, cash and cash equivalents decreased $199 million primarily as a result of the Company repaying a portion of long-term debt by using existing cash on hand, partially offset by proceeds received from issuing debt. Cash provided by operating activities was sufficient to cover dividend payments and capital expenditures during the first nine months of fiscal 2024. Additional details related to significant drivers of cash flows are provided below.\nCash Provided by (Used in) Operating Activities\n•\nCash flows from operating activities were impacted by changes in operating assets and liabilities and lower net earnings.\n–\nInventory increased $247 million during the first nine months of fiscal 2025 compared to a decrease of $31 million in the comparable period of the prior year. The increase in inventory during fiscal 2025 was driven by intentional seasonal and promotional inventory build, recovery of snack nuts inventory levels following the production disruptions at the Suffolk, Virginia manufacturing facility, and increased raw material costs. The decrease in inventory during fiscal 2024 was due to benefits in supply chain processes associated with the Company's T&M initiative as well as the impact of production disruptions at the Suffolk, Virginia manufacturing facility. These reduced levels of inventory were partially offset by higher levels of turkey on hand in fiscal 2024.\n–\nAccounts payable and accrued expenses decreased $100 million and $95 million during the first nine months of fiscal 2025 and fiscal 2024, respectively. The decrease during fiscal 2025 was driven by the general timing of payments, annual incentive payments, and legal settlements. The decrease during fiscal 2024 was due to the general timing of payments, feed and livestock deferral payments, and annual incentive payments, which were partially offset by higher accruals for marketing and legal expenses.\n–\nAccounts receivable decreased $54 million and $89 million during the first nine months of fiscal 2025 and fiscal 2024, respectively, primarily due to lower sales compared to the fourth quarter of each respective prior year.\nCash Provided by (Used in) Investing Activities\n•\nCapital expenditures were $219 million and $173 million during the first nine months of fiscal 2025 and fiscal 2024, respectively. The largest project during both years was for the transition from harvest to value-added capacity for \nHormel\n®\n \nFire Braised\n®\n products and \nApplegate\n®\n products at the Company's facility in Barron, Wisconsin. Other significant projects included investments in data and technology during fiscal 2025 and investment in wastewater infrastructure to support operations in Austin, Minnesota during fiscal 2024.\n•\nProceeds from the sale of business were $13.1 million during the first nine months of fiscal 2025, primarily from the sale of the Company’s equity interest in Mountain Prairie, LLC.\nCash Provided by (Used in) Financing Activities\n•\nCash dividends paid to the Company’s shareholders totaled $474 million during the first nine months of fiscal 2025, compared to $460 million in the comparable period of fiscal 2024.\n•\nProceeds from the exercise of stock options were $24 million in the first nine months of fiscal 2025, compared to $34 million in the first nine months of fiscal 2024.\n•\nThe Company paid $950 million of its senior unsecured notes upon maturity on June 3, 2024.\n•\nProceeds from the issuance of long-term debt were $498 million in fiscal 2024, due to the Company's issuance of senior unsecured notes with an aggregate principal amount of $500 million.\nSources and Uses of Cash\nThe Company believes its balanced business model, with diversification across raw material inputs, channels, and categories, provides stability in ever-changing economic environments. The Company maintains a disciplined capital allocation strategy and uses a waterfall approach, which focuses first on core uses of cash, such as capital expenditures to maintain facilities, dividend \n30\nTable of Contents\nreturns to investors, mandatory debt repayments, and fulfillment of pension obligations. Next, the Company looks to strategic items in support of growth initiatives, such as other capital projects, acquisitions, additional dividend increases, and working capital investments. Finally, the Company evaluates opportunistic uses, including incremental debt repayment and share repurchases.\nThe Company believes its anticipated income from operations, cash on hand, borrowing capacity under the current unsecured revolving credit facility, and access to capital markets will be adequate to meet all short-term and long-term commitments. The Company continues to look for opportunities to make investments and acquisitions that align with its strategic priorities. The Company has multiple sources of liquidity to complete such investments and acquisitions. For example, the Company’s historic ability to leverage its balance sheet through the issuance of debt has provided the flexibility to pursue strategic opportunities.\nDividend Payments\nThe Company remains committed to providing returns to investors through cash dividends on its common stock. The Company has paid 388 consecutive quarterly dividends since becoming a public company in 1928. The Board of Directors approved an increased annual dividend rate for fiscal 2025, raising it to $1.16 per share from $1.13 per share, representing the 59th consecutive annual dividend increase.\nCapital Expenditures\nCapital expenditures are allocated to required maintenance and growth opportunities based on the needs of the business. Capital expenditures supporting growth opportunities in fiscal 2025 are expected to focus on projects related to value-added capacity, infrastructure, and new technology. Capital expenditures for fiscal 2025 are estimated to be approximately $300 million.\nDebt\nAs of July 27, 2025, the Company’s outstanding debt included $2.9 billion of fixed rate unsecured senior notes due in fiscal 2027, 2028, 2030, and 2051 with interest payable semi-annually. During the first nine months of fiscal 2025, the Company made $61 million of interest payments and the Company expects to make an additional $12 million of interest payments during fiscal 2025 on these notes. See Note K - Long-term Debt and Other Borrowing Arrangements of the Notes to the Consolidated Financial Statements for additional information.\nBorrowing Capacity\nAs a source of short-term financing, the Company maintains a $750 million unsecured revolving credit facility. The maximum commitment under this credit facility may be further increased by $375 million upon the satisfaction of certain conditions. Extensions of credit under the facility may be applied by the Company to refinance existing indebtedness and for working capital and other general corporate purposes, including acquisition funding, and may be made in the form of revolving loans, swing line loans, and letters of credit. The lending commitments under the facility are scheduled to expire on March 25, 2030, at which time the Company will be required to pay in full all obligations then outstanding. As of July 27, 2025, the Company had no outstanding borrowings from this facility.\nDebt Covenants\nThe Company’s debt agreements contain customary terms and conditions including representations, warranties, and covenants. These debt covenants limit the ability of the Company to, among other things, incur debt for borrowed money secured by certain liens, or engage in certain sale and leaseback transactions, and the covenants require the Company to maintain certain consolidated financial ratios. As of July 27, 2025, the Company was in compliance with all covenants in its debt agreements and expects to maintain compliance in the future.\nCash Held by International Subsidiaries\nAs of July 27, 2025, the Company’s international subsidiaries held $185 million of cash and cash equivalents. During the third quarter of fiscal 2025, the Company repatriated $44 million in cash from an international subsidiary and recognized foreign withholding taxes on the one-time distribution. The Company maintains all undistributed earnings as permanently reinvested. The Company evaluates the balance and uses of cash held internationally based on the needs of the business.\nShare Repurchases\nThe Company is authorized to repurchase 3,677,494 shares of common stock as part of an existing plan approved by the Company’s Board of Directors. Under the share repurchase authorization, the Company may repurchase shares periodically, depending on market conditions and other factors, and may do so in open market purchases or privately negotiated transactions. The share repurchase authorization has no expiration date. The Company did not repurchase any shares of stock during the first nine months of fiscal 2025. The Company continues to evaluate share repurchases as part of its capital allocation strategy.\nCommitments\nThere have been no material changes to the information regarding the Company’s future contractual financial obligations previously disclosed in the Company’s Annual Report on Form 10-K for the fiscal year ended October 27, 2024.\n31\nTable of Contents\nTRADEMARKS\nReferences to the Company’s brands or products in italics within this report represent valuable trademarks owned or licensed by Hormel Foods, LLC or other subsidiaries of Hormel Foods Corporation.\nCRITICAL ACCOUNTING ESTIMATES\nManagement’s discussion and analysis of financial condition and results of operations is based upon the Company’s consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of these financial statements requires the Company to make estimates, judgments, and assumptions that can have a meaningful effect on the reporting of consolidated financial statements. The significant accounting policies used in preparing these consolidated financial statements are consistent with those described in Note A - Summary of Significant Accounting Policies of the Notes to the Consolidated Financial Statements in the Form 10-K.\nCritical accounting estimates are defined as those reflective of significant judgments, estimates, and uncertainties, which may result in materially different results under different assumptions and conditions. There have been no material changes in the Company’s Critical Accounting Estimates as disclosed in its Annual Report on Form 10-K for the fiscal year ended October 27, 2024.\nFORWARD-LOOKING STATEMENTS\nThis report contains “forward-looking” information within the meaning of the federal securities laws. The “forward-looking” information may include statements concerning the Company’s outlook for the future as well as other statements of beliefs, future plans, strategies, or anticipated events and similar expressions concerning matters that are not historical facts.\nThe Private Securities Litigation Reform Act of 1995 (the Reform Act) provides a “safe harbor” for forward-looking statements to encourage companies to provide prospective information. The Company is filing this cautionary statement in connection with the Reform Act. When used in this Quarterly Report on Form 10-Q, the Company’s Annual Report to Stockholders, other filings by the Company with the Securities and Exchange Commission, the Company’s press releases, and oral statements made by the Company’s representatives, the words or phrases “should result,” “believe,” “intend,” “plan,” “are expected to,” “targeted,” “will continue,” “will approximate,” “is anticipated,” “estimate,” “project,” or similar expressions are intended to identify forward-looking statements within the meaning of the Reform Act. Such statements are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results and those anticipated or projected.\nIn connection with the “safe harbor” provisions of the Reform Act, the Company is identifying risk factors that could affect financial performance and cause the Company’s actual results to differ materially from opinions or statements expressed with respect to future periods. The discussion of risk factors in the Company’s most recent Annual Report on Form 10-K and in Part II, Item 1A of this Quarterly Report on Form 10-Q contains certain cautionary statements regarding the Company’s business, which should be considered by investors and others. Such risk factors should be considered in conjunction with any discussions of operations or results by the Company or its representatives, including any forward-looking discussion, as well as comments contained in press releases, presentations to securities analysts or investors, or other communications by the Company.\nThough the Company has attempted to list comprehensively these important cautionary risk factors, the Company cautions that other factors may in the future prove to be important in affecting the Company’s business or results of operations.\nThe Company cautions readers not to place undue reliance on forward-looking statements, which represent current views as of the date made. Forward-looking statements are inherently at risk to changes in the Company’s business as well as the national and worldwide economic environment. The risks and uncertainties that could cause actual results to differ from those anticipated or projected include, among other things, risks related to the deterioration of economic conditions; risks associated with acquisitions, joint ventures, equity investments, and divestitures; risks and uncertainties associated with intangible assets, including any future goodwill or intangible assets impairment charges; the risk of disruption of operations, including at owned facilities, co-manufacturers, suppliers, logistics providers, customers, or other third-party service providers; the risk that the Company may fail to realize anticipated cost savings or operating profit improvements associated with strategic initiatives, including the Transform and Modernize initiative; risk of loss of a significant contract or unfavorable changes in the Company’s relationships with significant customers; risk of the Company’s inability to protect information technology (IT) systems against, or effectively respond to, cyber attacks, security breaches or other IT interruptions, against or involving the Company’s IT systems or those of others with whom it does business; risk of the Company’s failure to timely replace legacy technologies; deterioration of labor relations or labor availability or increases to labor costs; general risks of the food industry, including those related to food safety, such as costs resulting from food contamination, product recalls, the remediation of food safety events at its facilities, \n32\nTable of Contents\nincluding the production disruption at the Suffolk, Virginia, facility, food-specific laws or regulations, or outbreaks of disease among livestock and poultry flocks; fluctuations in commodity prices and availability of raw materials and other inputs; fluctuations in market demand for the Company’s products, including due to private label products and lower-priced alternatives; risks related to the Company’s ability to respond to changing consumer preferences, diets and eating patterns, and the success of innovation and marketing investments; damage to the Company’s reputation or brand image; risks associated with climate change, or legal, regulatory, or market measures to address climate change; risks of litigation; potential sanctions and compliance costs arising from government regulation; compliance with stringent environmental regulations and potential environmental litigation; and risks arising from the fact that the Company operates globally, with product manufactured and sold in foreign markets and a variety of inputs sourced from around the world, these risks including geopolitical risk, exchange rate risk, legal, tax, and regulatory risk, and risks associated with trade policies, export and import controls, and tariffs."
}