{
  "item1": "own corporate brand consumable merchandise. Includes dental chairs, delivery units lights, digital dental laboratories, X-ray supplies equipment, equipment repair high-tech digital restoration equipment. Consists financial services non-recourse basis, continuing education services practitioners, consulting other services. Includes branded generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray products, equipment, PPE products vitamins.",
  "item7": "software increase revenue cycle management solutions analytical products. Gross profit gross margin percentages segment total follows: Increase / (Decrease) Global Distribution Value expenses; depreciation amortization; restructuring integration costs) segment follows: Increase / (Decrease) Global Distribution Value expenses; depreciation amortization, restructuring integration costs) segment follows: Increase / (Decrease) Global Distribution Value incident fourth quarter. Gross profit gross margin percentages reportable segment follows: Increase / (Decrease) Global Distribution Value Global Specialty Products Total operating expenses increase operating costs (excluding acquisitions) during year ended adjustments (current year vs. prior year) consist (i) acquisition intangible amortization ($184 million vs.",
  "item2": "risks, uncertainties other factors may cause actual results, performance achievements Risk factors uncertainties could cause actual results differ materially All forward-looking statements made us subject risks uncertainties Includes infection-control products, handpieces, preventatives, impression materials, composites, anesthetics, teeth, gypsum, acrylics, articulators, abrasives, PPE products own corporate brand consumable merchandise. Includes dental chairs, delivery units lights, digital dental laboratories, X-ray supplies equipment, equipment repair services high-tech digital restoration equipment. Consists financial services non-recourse basis, continuing education services practitioners, consulting other services. Includes branded generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray products, equipment, PPE products vitamins."
}