{
  "source_file": "hsic-20241228.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\n \nBusiness \nGeneral \nHenry Schein, Inc. is a solutions company for health care professionals powered\n \nby a network of people and \ntechnology.\n \nWe believe we are the world’s largest\n \nprovider of health care products and services primarily to\n \noffice-\nbased dental and medical practitioners, as well as alternate sites of care.\n \nOur philosophy is grounded in our \ncommitment to help customers operate a more efficient and successful business so\n \nthe practitioner can provide \nbetter clinical care. \nWith 93 years of experience distributing health care products, we have built a vast base of small, mid-sized\n \nand \nlarge customers in the dental and medical markets, serving more than one million\n \ncustomers worldwide across \ndental practices, laboratories,\n \nphysician practices, and ambulatory surgery centers, as well as government, \ninstitutional health care clinics and other alternate care clinics.\n \nWe are headquartered in Melville, New York\n \nand employ approximately 25,000 people.\n \nApproximately 49% of \nour workforce is based in the United States and 51% outside of the United States.\n \nOur operations or affiliates are \nlocated in 33 countries and territories.\n \nOur broad global footprint has evolved over time through\n \norganic growth as \nwell as through the contribution from our strategic acquisitions. \nWe stock a comprehensive selection of more than 300,000 branded products and Henry Schein corporate brand \nproducts through our main distribution centers.\n \nOur infrastructure, including over 5.4 million square feet of space \nin 36 strategically located distribution centers and 0.5 million square\n \nfeet of space in 15 manufacturing facilities \naround the world, enables us to historically provide rapid and accurate order\n \nfulfillment, better serve our customers \nand increase our operating efficiency.\n \nThis infrastructure, together with broad product and service offerings\n \nat \ncompetitive prices, and a strong commitment to customer service, enables\n \nus to be a single source of supply for our \ncustomers’ needs, which we believe is a competitive advantage. \nDuring the fourth quarter of our fiscal year ended December 28, 2024,\n \nwe revised our reportable segments to align \nwith how the Chairman and Chief Executive Officer manages the business, assesses\n \nperformance and allocates \nresources.\n \nOur revised reportable segments consist of: (i) Global Distribution\n \nand Value\n \n-Added Services; (ii) \nGlobal Specialty Products;\n \nand (iii) Global Technology. \nGlobal Distribution and Value-Added Services includes distribution to the global dental and medical markets of \nnational brand and corporate brand merchandise, as well as equipment and related\n \ntechnical services.\n \nThis segment \nalso includes value-added services such as financial services, continuing\n \neducation services, consulting and other \nservices.\n \nThis segment also markets and sells under our own corporate brand,\n \na portfolio of cost-effective, high-\nquality consumable merchandise.\n \nGlobal Specialty Products includes manufacturing, marketing\n \nand sales of dental \nimplant and biomaterial products; and endodontic, orthodontic and orthopedic\n \nproducts and other health care-\nrelated products and services.\n \nGlobal Technology includes development and distribution of practice management \nsoftware, e-services, and other products, which are distributed to health\n \ncare providers. \n \nRecent Developments \nSee “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Recent \nDevelopments” herein for a discussion related to recent Company developments. \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n4 \nIndustry \nThe distribution and value-added services industry, as it relates to office-based health care practitioners, is \nfragmented and diverse.\n \nThe industry ranges from sole practitioners working out\n \nof relatively small offices to mid-\nsized and large group practices ranging in size from a few practitioners to several\n \nhundred practices owned or \noperated by dental support organizations (“DSOs”), medical group purchasing organizations\n \n(“GPOs”), health \nmaintenance organizations (“HMOs”), hospital systems or integrated delivery networks (“IDNs”). \nDue in part to the limited capacity of office-based health care practitioners\n \nto store and manage large quantities of \nsupplies in their offices, the distribution of health care supplies and small equipment\n \nto office-based health care \npractitioners has been characterized by frequent, small quantity orders,\n \nand a need for rapid, reliable and \nsubstantially complete order fulfillment.\n \nThe purchasing decisions within an office-based health care practice\n \nare \ntypically made by the practitioner, hygienist or office manager.\n \nSupplies and small equipment are generally \npurchased from more than one distributor, with one generally serving as the primary supplier. \nThe distribution and value-added services industry should benefit from\n \nfavorable long-term macro trends that \nshould help stimulate patient traffic and demand for products and services.\n \nThis includes an aging population, \nincreased health care awareness and the importance of preventive care,\n \nan increasing understanding of the \nconnection between good oral health and overall health, improved access\n \nto care globally, the proliferation of \nmedical technology and testing, new pharmacology treatments and\n \nexpanded third-party insurance coverage, \npartially offset by the effects of unemployment on insurance coverage and technological\n \nimprovements, including \nthe advancement of software and services, prosthetic solutions and telemedicine.\n \nIn addition, the non-acute market \ncontinues to benefit from the shift of procedures and diagnostic\n \ntesting from acute care settings to alternate-care \nsites, particularly physicians’ offices and ambulatory surgery centers. \nWe believe that consolidation within the industry will continue to result in a number of distributors, particularly \nthose with limited financial, operating and marketing resources, seeking\n \nto combine with larger companies that can \nprovide growth opportunities.\n \nThis consolidation also may continue to result in distributors seeking\n \nto acquire \ncompanies that can enhance their current product and service offerings or provide\n \nopportunities to serve a broader \ncustomer base.\n \nIn addition, customer consolidation will likely lead to multiple locations\n \nunder common management and the \nmovement of more procedures from the hospital setting to the physician\n \nor alternate care setting, as the health care \nindustry is increasingly focused on efficiency and cost containment.\n \nThis trend has benefited distributors capable \nof providing a broad array of products and services at low prices.\n \nIt also has accelerated the growth of HMOs, \ngroup practices, other managed care accounts and collective buying\n \ngroups such as DSOs and GPOs, which, in \naddition to their emphasis on obtaining products at competitive prices,\n \ntend to favor distributors capable of \nproviding specialized management information support.\n \nWe believe that the trend towards cost containment has \nthe potential to favorably affect demand for technology solutions, including software,\n \nwhich can enhance the \nefficiency and facilitation of practice management. \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n5 \nCompetition\n \nThe distribution and manufacture of health care supplies and equipment is\n \nhighly competitive.\n \nMany of the health \ncare products we sell are available to our customers from a number of suppliers.\n \nIn addition, our competitors could \nobtain exclusive rights from manufacturers to market particular products.\n \nManufacturers also could seek to sell \ndirectly to end-users, and thereby eliminate or reduce our role and\n \nthat of other distributors.\n \nIn certain parts of the \ndental end market, such as those related to dental specialty products, and\n \nmedical end market manufacturers already \nsell directly to end customers. \nIn North America, we compete with other distributors, as well as several\n \nmanufacturers, of dental and medical \nproducts, primarily on the basis of price, breadth of product line, e-commerce\n \ncapabilities, customer service and \nvalue-added products and services.\n \nIn the dental distribution market, our primary competitors in the U.S. are\n \nthe \nPatterson Dental division of Patterson Companies, Inc. and Benco Dental Supply\n \nCompany.\n \nIn addition, we \ncompete against a number of other distributors that operate on a national,\n \nregional and local level.\n \nOur primary \ncompetitors in the U.S. medical distribution market, which accounts\n \nfor the large majority of our global medical \nsales, are McKesson Corporation and Medline Industries, Inc., which are national\n \ndistributors.\n \nWe also compete \nwith a number of regional and local medical distributors, as well as a number\n \nof manufacturers that sell directly to \nphysicians and patients in their homes. \nOutside of the U.S., we believe we are the only global distributor of supplies\n \nand equipment to dental practices and \nour competitors are primarily local and regional companies.\n \nWe also face significant competition internationally, \nwhere we compete on the basis of price and customer service against\n \nseveral large competitors, including the \nGACD Group, Proclinic SA, Lifco AB, Nuent Group AB, Planmeca Oy and Billericay\n \nDental Supply Co. Ltd., as \nwell as a large number of other dental and medical product distributors and\n \nmanufacturers in international countries \nand territories we serve. \nWithin Global Specialty Products,\n \nour primary competitors include Straumann, Envista, Zimvie,\n \nand Dentsply \nSirona. \nWith regard to our dental software, we compete against numerous companies, including the Eaglesoft\n \ndivision of \nPatterson Companies, Inc., Carestream Dental LLC, Centaur Software Development\n \nCo Pty Ltd. (d.b.a. \ndental4windows, dental4web), Open Dental Software, Inc., PlanetDDS\n \nLLC, Good Methods Global Inc. (d.b.a. \nCareStack), Curve Dental, LLC., the NextGen division of Quality Systems,\n \nInc., eClinicalWorks and Epic Systems \nCorporation. In other software end markets, including revenue cycle\n \nmanagement, patient relationship management \nand patient demand generation, we compete with companies such as Vyne Medical, Weave Communications, Inc., \nand Solutionreach, Inc.\n \nMany of these competitors connect to our software platforms\n \nthrough our API program. \nManufacturing and Raw Materials \nWe manufacture certain of our products for our specialty businesses (oral surgery solutions including dental \nimplants, endodontics, and orthopedics) at our 15 company manufacturing\n \nsites.\n \nWe also outsource certain \nmanufacturing to third parties.\n \nWe purchase our raw materials from various third-party suppliers.\n \nNo single \nsupplier is material; however, raw materials may be sourced from a single supplier or a limited number\n \nof suppliers \nfor reasons of quality assurance, regulatory requirements, cost, and availability. \nWe believe that we have a readily available supply of raw materials and components sourced from various \nsuppliers, for our significant products. \nWe may experience shortages of raw materials or purchased components.\n \nIn recent periods, we have experienced \nincreased costs and shortages of purchased components, which\n \nhad a negative impact on our profit margins and on \nour sales for certain product categories, due to our inability to fully satisfy\n \ndemand. \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n6 \nCompetitive Strengths \nWe have 93 years of experience in distributing products to health care practitioners resulting in strong awareness of \nthe Henry Schein\n®\n \nbrand.\n \nOur competitive strengths include: \nA focus on meeting our customers’ unique needs\n.\n \nWe are committed to providing customized solutions to our \ncustomers that are driven by our understanding of the end markets we\n \nserve and that reflect the technology-driven \nproducts and services best suited for their practice needs.\n \nWe are committed to continuing to enhance these \nofferings through organic investment in our products and our teams, as well as through the acquisition\n \nof new \nproducts and services that may help us better serve our customers. \nDirect sales and marketing expertise.\n \nOur sales and marketing efforts are designed to establish and solidify \ncustomer relationships through personal or virtual visits by field sales representatives,\n \nfrequent direct marketing and \ntelesales contact, emphasizing our broad product lines, including exclusive\n \ndistribution agreements, competitive \nprices and ease of order placement,\n \nparticularly through our e-commerce platforms.\n \nThe key elements of our direct \nsales and marketing efforts are: \n•\n \nField sales consultants.\n \nOur field sales consultants, including equipment sales specialists, covering\n \nmajor \nNorth American, European and other international markets.\n \nThese consultants complement our direct \nmarketing and telesales efforts and enable us to better market, service and support\n \nthe sale of more \nsophisticated products and equipment. \n•\n \nMarketing.\n \nWe market to existing and prospective office-based health care providers through a \ncombination of owned, earned and paid digital channels, tradeshows, as well\n \nas through catalogs, flyers, \ndirect mail and other promotional materials.\n \nOur strategies include an emphasis on educational content \nthrough webinars and content marketing initiatives.\n \nWe continue to enhance our marketing technology to \nimprove our targeting capability and the relevance of messaging and offers. \n•\n \nTelesales.\n \nWe support our direct marketing effort with inbound and outbound telesales representatives, \nwho facilitate order processing, generate new sales through direct and frequent\n \ncontact with customers and \nstay abreast of market developments and the hundreds of new products,\n \nservices and technologies \nintroduced each year to educate practice personnel. \n•\n \nElectronic commerce solutions.\n \nWe provide our customers and sales teams with innovative and \ncompetitive e-commerce solutions.\n \nWe continue to invest in our e-commerce platform to offer enhanced \ncontent management so customers can more easily find the products\n \nthey need and to enable an engaging \npurchase experience, supported by excellent customer service.\n \n•\n \nSocial media.\n \nOur operating entities and employees engage our customers and\n \nsupplier partners through \nvarious social media platforms, which are an important element of our\n \ncommunications and marketing \nefforts.\n \nWe continue to expand our social media presence to raise awareness about issues, engage \ncustomers beyond a sale and deliver services and solutions to specialized\n \naudiences. \nCost-effective purchasing\n.\n \nWe believe that cost-effective purchasing is a key element to maintaining and enhancing \nour position as a competitively priced provider of health care products.\n \nWe continuously evaluate our purchase \nrequirements and suppliers’ offerings and prices in order to obtain products at the\n \nlowest possible cost.\n \nIn 2024, \nour top 10 Global Distribution and Value-Added Services suppliers and our single largest supplier accounted for \napproximately 25% and 4%, respectively, of our aggregate purchases. \nEfficient distribution\n.\n \nWe distribute our products from our 36 strategically located distribution centers.\n \nWe strive \nto maintain optimal inventory levels in order to satisfy customer demand\n \nfor prompt delivery and complete order \nfulfillment.\n \nThese inventory levels are managed on a daily basis with\n \nthe aid of our management information \nsystems.\n \nOnce an order is entered, it is electronically transmitted to the distribution\n \ncenter nearest the customer’s \nlocation for order fulfillment. \n\n\n\n\n\n\n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n7 \nBroad product and service offerings at competitive prices.\n \nWe offer\n \na broad range of products and services to our \ncustomers, at competitive prices, in the following categories: \nGlobal Distribution and Value-Added Services \n•\n \nConsumable merchandise and equipment.\n \nWe distribute consumable products, small equipment, laboratory \nproducts, large equipment, equipment repair services, branded and generic pharmaceuticals,\n \nvaccines, \ndental specialty products, diagnostic tests, infection-control products and vitamins.\n \nWe stock a \ncomprehensive selection of more than 300,000 branded products and Henry\n \nSchein corporate brand \nproducts through our main distribution centers.\n \nWe also market and sell our own corporate brand portfolio \nof cost-effective, high-quality consumable merchandise products. \n•\n \nHome health business.\n \nWe distribute homecare medical products, including incontinence, urology, ostomy, \nenteral nutrition, advanced wound, and diabetes supplies, as well as\n \ncontinuous glucose monitoring devices.\n \nThese products are delivered directly to patients in their homes, providing\n \nconvenience and accessibility \nwhile supporting patient care and adherence to treatment plans. \n•\n \nValue\n \n-added products and services.\n \nWe offer a broad range of value-added solutions, including continuing \neducation programs for practitioners, and consulting services.\n \nOur suite of technology-driven tools and \nexpert advisory services helps health care professionals enhance practice efficiency and improve\n \npatient \noutcomes. \n•\n \nRepair services.\n \nWe have 129 equipment sales and service centers worldwide that provide a variety of \nrepair, installation and technical services for our health care customers.\n \nOur technicians provide \ninstallation and repair services for dental handpieces,\n \ndental and medical small equipment,\n \ntable-top \nsterilizers and large dental equipment. \n•\n \nFinancial service\ns.\n \nWe offer our customers solutions in operating their practices more efficiently by \nproviding access to a number of financial services and products\n \nprovided by third party suppliers (including \nnon-recourse financing for equipment, technology and software\n \nproducts, non-recourse practice financing \nfor leasehold improvements, business debt consolidation and commercial\n \nreal estate, non-recourse patient \nfinancing and credit card processing) at rates that we believe are generally\n \nlower than what our customers \nwould be able to secure independently.\n \nWe also provide staffing services, dental practice valuation and \nbrokerage services. \nGlobal Specialty Products \n•\n \nDental implants and digital solutions.\n \nWe develop, manufacture, market and distribute a broad portfolio of \ndental implants, prosthetic components, instruments and digital workflow\n \nsolutions for implant-based tooth \nrestorations.\n \nWith research and development and manufacturing facilities in the United States, \nSwitzerland, Germany, Brazil and France, we serve customers with various global and regional implant \nbrands across a wide range of price segments.\n \nSupported by our specialized sales force, we market our \nproducts and solutions in approximately 90 countries, directly to dental practices\n \nand surgical specialists \nvia our sales subsidiaries and our network of international third-party and\n \nHenry Schein distribution \npartners. \n•\n \nBiomaterials.\n \nWe market and distribute a broad portfolio of biomaterials for dental tissue \nregeneration.\n \nThe product portfolio primarily consists of a broad range of\n \nprivately branded allograft, \nxenograft, and synthetic biomaterials.\n \nOur dedicated biomaterial specialists support our direct implant \nsales force and Henry Schein oral surgery-focused distribution channels.\n \n•\n \nOrthodontics.\n \nWe develop, manufacture, and distribute a comprehensive range of orthodontic products, \nincluding brackets, braces, aligners, and accessories.\n \nIn collaboration with leading clinicians, our research \nand development teams drive innovation to enhance patient care.\n \nWith manufacturing facilities in the \n\n\n\n\n\n\n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n8 \nUnted States, Mexico, and France, we serve dental practices in over\n \n70 countries through our specialized \nsales force, international partners, and the Henry Schein distribution\n \nnetwork. \n•\n \nEndodontics\n.\n \nWe develop, manufacture, market and distribute a complete portfolio of endodontic products \nacross multiple brands catering to both endodontic specialists and general\n \npractitioners.\n \nThis includes \nstainless steel and NiTi shaping files, irrigation solutions, endodontic power equipment, sealers,\n \nand root \nrepair materials.\n \nLeveraging our research and development and manufacturing facilities\n \nin the United \nStates, Switzerland, and Brazil we focus on delivering meaningful\n \ninnovation to help advance endodontic \ncare, provide advanced training and education through a network of training\n \ncenters and digital services, \nand serve our customers through multiple brands and multiple channels\n \naddressing all segments of the \nmarket.\n \nBy investing in dedicated endo-specific competencies and resources\n \nto support our different sales \nchannels, we are successfully marketing our products and brands\n \nin over 90 countries. \n•\n \nOrthopedics\n.\n \nWe develop, manufacture and distribute innovative implants and instruments that are \ndesigned to treat injuries, diseases and disorders of the limbs, joints\n \nand related tissues in the upper and \nlower extremities.\n \nWe also provide surgical accessories, including blades, burs, drills, a variety of pins and \nwires to support orthopedic surgical procedures, and a portfolio of specialized instruments\n \ndesigned to \nsimplify implant removal and preserve patient bone-stock during\n \nrevision arthroplasty procedures.\n \nWe \nemploy an extensive global network of independent sales agencies\n \nand direct sales specialists, and we \npartner closely with IDNs and GPOs.\n \nThe majority of our revenue is generated in the United States market, \nwith the remaining revenue coming from Canada and countries in Latin America,\n \nEurope and Asia Pacific \nregion. \n•\n \nOther.\n \nWe also source or manufacture other medical and dental health care products and services that are \nsold to customers, including handpiece and small equipment, rotary, hand instruments, and repair services, \nrestoratives and preventives, as well as certain other health care-related\n \nconsumable merchandise products \nand services.\n \n \nGlobal Technology \n•\n \nWe sell practice management, business analytics, patient engagement and patient demand creation software \nsolutions to our dental customers.\n \nOur practice management solutions provide practitioners with electronic \nmedical records, patient treatment history, analytics, billing, accounts receivable analyses and management, \nappointment calendars, electronic claims processing and word processing\n \nprograms, network and hardware \nservices, e-commerce and electronic marketing services, e-Prescribe medications\n \nand prescription \nsolutions, sourcing third party patient payment plans, and transition services\n \nand training and education \nprograms for practitioners.\n \nWe have technical representatives supporting customers using our practice \nmanagement solutions and services.\n \nAs of December 28, 2024, we had an active user base of approximately 100,000\n \npractices and 321,000 \nconsumers, including users of AxiUm®, Dentally®, Dentrix Ascend®,\n \nDentalVision®, Dentrix® Dental \nSystems, EXACT®, Gesden®, Jarvis Analytics®, Julie® Software, Oasis,\n \nOfficite™, OrisLine®, PBS \nEndo®, Power Practice® Px and subscriptions for Demandforce®,\n \nSesame, and Lighthouse 360® for \ndental practices and DentalPlans.com® for dental patients. \nCommitment to superior customer service\n.\n \nWe maintain a strong commitment to providing superior customer \nservice.\n \nWe frequently monitor our customer service through customer surveys, focus groups and statistical \nreports.\n \nOur customer service policy primarily focuses on: \n•\n \nExceptional order fulfillment.\n \nWe ship an average of approximately 142,000 cartons daily. \n•\n \nComprehensive ordering process.\n \nCustomers may place orders 24 hours a day, 7 days a week via e-\ncommerce solutions, telephone, fax, e-mail and mail. \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n9 \nIntegrated management information systems\n.\n \nCertain of our information systems generally allow for centralized \nmanagement of key functions, including accounts receivable, inventory, accounts payable, payroll, purchasing, \nsales, order fulfillment and financial and operational reporting.\n \nThese systems allow us to manage our growth, \ndeliver superior customer service, properly target customers, manage financial\n \nperformance and monitor daily \noperational statistics. \nProducts and Services \nThe following table sets forth the percentage of consolidated net sales\n \nby principal categories of products and \nservices offered through our Global Distribution and Value-Added Services,\n \nGlobal Specialty Products, and Global \nTechnology reportable segments: \nDecember 28, \nDecember 30, \nDecember 31, \n2024 \n2023 \n2022 \nGlobal Distribution and Value\n \n-Added Services: \nDental merchandise \n(1)\n37.3 \n% \n38.8 \n% \n37.7 \n% \nDental equipment \n(2)\n13.6 \n13.5 \n13.5 \nValue\n \n-added services \n(3)\n1.8 \n1.6 \n1.2 \nTotal\n \nDental \n52.7 \n53.9 \n52.4 \nMedical \n(4)\n32.2 \n31.7 \n34.4 \nTotal\n \nGlobal Distribution and Value\n \n-Added Services: \n84.9 \n85.6 \n86.8 \nGlobal Specialty Products \n(5)\n11.4 \n10.8 \n10.1 \nGlobal Technology \n(6)\n5.0 \n4.9 \n4.3 \nEliminations \n(1.3) \n(1.3) \n(1.2) \nTotal \n100.0 \n% \n100.0 \n% \n100.0 \n% \n(1)\nIncludes infection-control products, handpieces, preventatives, impression materials, composites, anesthetics, teeth, dental \nimplants, gypsum, acrylics, articulators, abrasives, PPE products,\n \nand our own corporate brand of consumable merchandise. \n(2)\nIncludes dental chairs, delivery units and lights, digital dental laboratories, X-ray supplies and equipment, equipment repair and \nhigh-tech and digital restoration equipment. \n(3)\nConsists of financial services on a non-recourse basis, continuing education services for practitioners, consulting and other services. \n(4)\nIncludes branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray \nproducts, equipment, PPE products and vitamins. \n(5)\nIncludes manufacturing, marketing and sales of dental implant and biomaterial products; and endodontic, orthodontic and \northopedic products and other health care-related products and services. \n(6)\nConsists of practice management software, e-services, and other products, which are distributed to health care providers. \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n10 \nBusiness Strategy \nOur mission is to provide innovative, integrated health care products and\n \nservices; and to be trusted advisors and \nconsultants to our customers - enabling them to deliver the best quality patient\n \ncare and enhance their practice \nmanagement efficiency and profitability.\n \nOur BOLD+1 Strategic Plan consists of the following: \n•\n \nBuild (“B”)\n \nComplementary software, specialty, and services businesses for high growth \n•\n \nOperationalize (“O”)\n \nOne Distribution to deliver exceptional customer experience, increased\n \nefficiency, \nand growth \n•\n \nLeverage (“L”)\n \nOne Schein to broaden and deepen relationships with our customers \n•\n \nDrive (“D”)\n \nDigital transformation for our customers and for Henry Schein \n•\n \n+1\n \nCreate Value\n \nfor our stakeholders \nTo accomplish this, we apply our competitive strengths in executing the following strategies: \n•\n \nIncrease penetration of our existing customer base.\n \nWe have over one million customers worldwide and \nwe intend to increase sales to our existing customer base and enhance\n \nor secure our position as their \nprimary supplier.\n \nWe believe our offering of a broad range of products, services and support, including \nsoftware solutions that can help drive improved workflow efficiency and patient communications\n \nfor \npractices, coupled with our full-service value proposition, helps us to retain\n \nand grow our customer base. \n•\n \nIncrease the number of customers we serve.\n \nThis strategy includes increasing the productivity of our field \nsales consultants and telesales team, as well as using our customer\n \ndatabase to focus our marketing efforts \nin all of our operating segments.\n \nIn the dental business, we provide products and services to\n \nindependent \npractices, mid-market groups, and large DSOs as well as community health centers\n \nand government sites of \ncare.\n \nLeveraging our broad array of assets and capabilities, we offer solutions to address these\n \nnew \nmarkets.\n \nIn the medical business, we have expanded to serve customers\n \nlocated in settings outside of the \ntraditional office, such as urgent care clinics, retail, occupational health and home health settings.\n \nAs \nhealth care settings shift, we remain committed to serving these practitioners\n \nand providing them with the \nproducts and services they need. \n•\n \nLeverage our value-added products and services.\n \nWe continue to increase cross-selling efforts for key \nproduct lines utilizing a consultative selling process.\n \nWe have significant cross-selling opportunities \nbetween our dental software users and our dental customers, and opportunities\n \nto expand our vaccine, \ninjectables and other pharmaceuticals sales to health care practitioners, as\n \nwell as cross-selling EHR \nsystems and software when we sell our core products.\n \nOur strategy extends to providing health systems, \nintegrated delivery networks and other large group and multi-site health care organizations,\n \nincluding \nphysician clinics, these same value-added products and services.\n \nAs physicians and health systems closely \nalign, we have increased access to opportunities for cross-marketing\n \nand selling our product and service \nportfolios.\n \n•\n \nPursue strategic acquisitions and joint ventures.\n \nOur acquisition strategy is focused on investments in \ncompanies that add new customers and sales teams, increase our geographic\n \nfootprint (whether entering a \nnew country, such as emerging markets, or building scale where we have already invested in businesses), \nand finally, those that enable us to access new products and technologies. \nMarkets Served\n \nDemographic trends indicate that our markets are growing, as an\n \naging U.S. population is increasingly using health \ncare services.\n \nAccording to the U.S. Census Bureau’s International Database, between 2024 and 2034, the \npopulation of people aged 45 and older is expected to grow by approximately\n \n10%.\n \nBetween 2024 and 2044, this \nage group is expected to grow by approximately 18%.\n \nThis compares with expected total U.S. population growth \nrates of approximately 4% between 2024 and 2034 and approximately 6%\n \nbetween 2024 and 2044.\n \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n11 \nIn the dental industry, there is predicted to be a rise in oral health care expenditures as the 45-and-older segment of \nthe population increases.\n \nThere is increasing demand for new technologies that allow\n \ndentists to increase \nproductivity, and this is being driven in the U.S. by lower insurance reimbursement rates.\n \nAt the same time, there is \nan expected increase in dental insurance coverage. \nIn the medical market, there continues to be a migration of procedures from\n \nacute-care settings to physicians’ \noffices and home health settings, a trend that we believe provides additional opportunities\n \nfor us.\n \nThere also is the \ncontinuing use of vaccines, injectables and other pharmaceuticals in alternate-care\n \nsettings.\n \nWe believe we have \nestablished a leading position as a vaccine supplier to the office-based physician\n \npractitioner. \nWe support our dental and medical professionals through the many SKUs that we offer, as well as through \nimportant value-added services, including practice management software,\n \nelectronic claims processing, financial \nservices and continuing education, all designed to help maximize a practitioner’s\n \nefficiency.\n \nAdditionally, we seek to expand our dental full-service model and medical offerings in countries where \nopportunities exist.\n \nWe do this through both direct sales and by partnering with local distribution and \nmanufacturing companies. \nFor information on revenues and long-lived assets by geographic area, see \nNote 4 – Segment and Geographic Data\nof “Notes to Consolidated Financial Statements.”\n \nSeasonality and Other Factors Affecting Our Business and Quarterly Results \nWe experience fluctuations in quarterly earnings.\n \nAs a result, we may fail to meet or exceed the expectations of \nsecurities analysts and investors, which could cause our stock price\n \nto decline. \nOur business is subject to seasonal and other quarterly fluctuations.\n \nSales and profitability generally have been \nhigher in the third and fourth quarters due to the timing of sales of seasonal\n \nproducts (including influenza vaccine), \npurchasing patterns of office-based health care practitioners for certain products (including\n \nequipment and \nsoftware) and year-end promotions.\n \nSales and profitability may also be impacted by the timing of\n \ncertain annual \nand biennial dental tradeshows where equipment promotions are offered.\n \nIn addition, some dental practices delay \nequipment purchases in the U.S. until year-end due to tax incentives.\n \nWe expect our historical seasonality of sales \nto continue in the foreseeable future. \nGovernmental Regulations \n \nWe \nstrive to be compliant in all material respects with the applicable\n \nlaws, regulations and guidance described \nbelow, and believe we have effective compliance programs and other controls in place to ensure substantial \ncompliance.\n \nHowever, compliance is not guaranteed either now or in the future, as certain laws, regulations and \nguidance may be subject to varying and evolving interpretations that could\n \naffect our ability to comply, as well as \nfuture changes, additions and enforcement approaches, including political changes.\n \nWhen we discover situations of \nnon-compliance we seek to remedy them and bring the affected area back into compliance.\n \nChanges to applicable laws, regulations and guidance described below, as well as related administrative or judicial \ninterpretations, may require us to update or revise our operations, services,\n \nmarketing practices and compliance \nprograms and controls, and may impose additional and unforeseen costs\n \non us, pose new or previously immaterial \nrisks to us, or may otherwise have a material adverse effect on our business. \nGovernment \nCertain of our businesses involve the distribution, manufacturing, importation,\n \nexportation, marketing, sale and \npromotion of pharmaceuticals and/or medical devices, and in this regard, we\n \nare subject to extensive local, state, \nfederal and foreign governmental laws and regulations, including as applicable\n \nto our wholesale distribution of \npharmaceuticals and medical devices, manufacturing activities, and as part of\n \nour specialty home medical supplies \nbusinesses that distribute and sell medical equipment and supplies directly\n \nto patients.\n \nFederal, state and certain \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n12 \nforeign governments have also increased enforcement activity in the health care\n \nsector, particularly in areas of fraud \nand abuse, anti-bribery and anti-corruption, controlled substances handling,\n \nmedical device regulations and data \nprivacy and security standards. \nCertain of our businesses involve pharmaceuticals and/or medical devices,\n \nincluding orthopaedic, in vitro \ndiagnostic devices, software regulated as a medical device, and sales of\n \nmedical equipment and supplies directly to \npatients, that are paid for by third parties and/or patients and must operate in\n \ncompliance with a variety of \nburdensome and complex coding, billing and record-keeping requirements in\n \norder to substantiate claims for \npayment under federal, state and commercial health care reimbursement programs. \nGovernment and private insurance programs fund a large portion of the total cost of medical care,\n \nand there have \nbeen efforts to limit such private and government insurance programs, including efforts, thus far\n \nunsuccessful, to \nseek repeal of the entire United States Patient Protection and Affordable Care Act,\n \nas amended by the Health Care \nand Education Reconciliation Act, each enacted in March 2010 (as amended,\n \nthe “ACA”). \nCertain of our businesses are subject to various additional federal, state,\n \nlocal and foreign laws and regulations, \nincluding with respect to the sale, transportation, importation, storage, handling\n \nand disposal of hazardous or \npotentially hazardous substances; “forever chemicals” such as per-and\n \npolyfluoroalkyl substances; amalgam bans; \npricing disclosures; supply chain transparency around labor practices; and safe working\n \nconditions.\n \nIn addition, \nactivities to control medical costs, including laws and regulations lowering\n \nreimbursement rates for \npharmaceuticals, medical devices, medical supplies and/or medical treatments\n \nor services, are ongoing.\n \nFor \nexample, the Centers for Medicare & Medicaid Services’ (“CMS”) 2024 durable\n \nmedical equipment, prosthetics, \northotics and supplies (“DMEPOS”) reimbursement schedule, which was\n \neffective January 1, 2024, reduced the \nDMEPOS reimbursement rates for non-rural suppliers, such as us, by removing\n \nthe Coronavirus Aid, Relief, and \nEconomic Security (“CARES”) Act relief rates in effect during the COVID-19 pandemic.\n \nThese and other laws \nand regulations are subject to change and their evolving implementation\n \nmay impact our operations and our \nfinancial performance. \nCertain of our businesses also maintain contracts with governmental agencies\n \nand are subject to certain regulatory \nrequirements specific to government contractors. \nOur businesses are generally subject to numerous laws and regulations that could\n \nimpact our financial performance, \nand failure to comply with such laws or regulations could have a material adverse\n \neffect on our business. \nOperating, Security and Licensure Standards\nCertain of our businesses are subject to local, state and federal governmental\n \nlaws and regulations relating to the \nmanufacturing and/or distribution of pharmaceuticals and medical devices\n \nand supplies.\n \nAmong the United States \nfederal laws applicable to us are the Controlled Substances Act, the Federal Food,\n \nDrug, and Cosmetic Act, as \namended (“FDC Act”), Section 361 of the Public Health Service Act and Section\n \n401 of the Consolidated \nAppropriations Act of the Social Security Act, as well as laws regulating\n \nthe billing of and reimbursement from \ngovernment programs, such as Medicare and Medicaid, and from commercial payers.\n \nWe \nare also subject to \ncomparable foreign regulations. \nThe FDC Act, the Controlled Substances Act, their implementing regulations,\n \nand similar foreign laws generally \nregulate the introduction, manufacture, advertising, marketing and promotion,\n \nsampling, pricing and \nreimbursement, labeling, packaging, storage, handling, returning or recalling,\n \nreporting, and distribution of, and \nrecord keeping for, pharmaceuticals and medical devices shipped in interstate commerce or internationally, and \nstates may similarly regulate such activities within the state.\n \nFurthermore, Section 361 of the Public Health Service \nAct, which provides authority to prevent the introduction, transmission\n \nor spread of communicable diseases, serves \nas the legal basis for the United States Food and Drug Administration’s (“FDA”) regulation of human\n \ncells, tissues \nand cellular and tissue-based products, also known as “HCT/P products.” \nThe Federal Drug Quality and Security Act of 2013 regulates pharmaceutical\n \nsupply chain requirements and pre-\nempts certain state laws.\n \nTitle II of this measure, known as the Drug Supply Chain Security Act (“DSCSA”), \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n13 \nestablishes a national electronic, interoperable system to identify and trace\n \ncertain prescription drugs as they are \ndistributed in the United States that went into effect on November 27, 2023.\n \nThe law’s track and trace requirements \napplicable to manufacturers, wholesalers, third-party logistics providers (e.g.,\n \ntrading partners), repackagers and \ndispensers (e.g., pharmacies) of prescription drugs took effect in January 2015,\n \nand, as stated, continues to be \nimplemented.\n \nThe DSCSA product tracing requirements replace the former FDA\n \ndrug pedigree requirements and \npre-empt certain state requirements that are inconsistent with, more stringent\n \nthan, or in addition to, the DSCSA \nrequirements. \nThose DSCSA requirements that were scheduled to change on November\n \n27, 2023, and include requiring trading \npartners to provide, receive and maintain documentation about products and\n \nownership only “electronically” (and \nnot via paper), were subject to a one-year “stabilization period” announced by\n \nthe FDA through two guidance \ndocuments in late August 2023.\n \nThe FDA permitted the stabilization period to accommodate an additional\n \nyear, \nuntil November 27, 2024, to allow trading partners to implement, troubleshoot\n \nand mature their electronic (versus \npaper), interoperable systems, during which time the FDA did not intend to\n \ntake action to enforce the requirements \nfor the interoperable, electronic, package level product tracing.\n \nAdditionally, the FDA announced that it did not \nintend to take action to enforce the portion of the FDC Act with respect\n \nto drug product that was introduced in a \ntransaction into commerce by the product’s manufacturer or repackager before November 27, 2024, and for \nsubsequent transactions of such product through the product’s expiry.\n \nThe FDA stated this stabilization period was \nintended to avoid disruption to the supply chain and ensure continued patient\n \naccess to drug products as trading \npartners move towards full implementation of the DSCSA’s\n \nenhanced drug security requirements.\n \nThe FDA again \nextended the stabilization period in late 2024 as follows: (1) manufacturers and\n \nrepackagers: May 27, 2025; (2) \nwholesale distributors: August 27, 2025; (3) dispensers with 26 or more pharmacists\n \nand technicians: November 27, \n2025; and (4) small dispensers: November 27, 2026.\n \nThe FDA stated that these continued exemptions apply to any \nproduct transacted by eligible trading partners who have initiated their “systems\n \nand processes, as described in \nsection 582(g)(1) of the FD&C Act,” including electronic DSCSA data connections\n \nwith immediate trading \npartners by November 27, 2024.\n \nThe additional time extends to trading partners throughout the pharmaceutical \ndistribution supply chain who subsequently engage in a transaction including such\n \nproduct.\n \nThe FDA also stated \nthat, for the purposes of these exemptions, eligible trading partners are those\n \nwho have initiated their systems and \nprocesses by successfully completing data connections with their\n \nimmediate trading partners, and those trading \npartners who initiated processes including documentation of efforts to establish data\n \nconnections, but were not able \nto fully complete these processes.\n \nThe DSCSA also establishes certain requirements for the licensing and operation\n \nof prescription drug wholesalers \nand third-party logistics providers (“3PLs”) and includes the eventual\n \ncreation of national wholesaler and 3PL \nlicenses in cases where states do not license such entities.\n \nThe DSCSA requires that wholesalers and 3PLs \ndistribute drugs in accordance with certain standards regarding the recordkeeping,\n \nstorage and handling of \nprescription drugs.\n \nThe DSCSA requires wholesalers and 3PLs to submit annual reports\n \nto the FDA, which include \ninformation regarding each state where the wholesaler or 3PL is licensed, the name\n \nand address of each facility, and \ncontact information.\n \nAccording to FDA guidance, states are pre-empted from imposing\n \nany licensing requirements \nthat are inconsistent with, less stringent than, directly related to, or covered\n \nby the standards established by federal \nlaw in this area.\n \nCurrent state licensing requirements concerning wholesalers will\n \nremain in effect until the FDA \nissues new regulations as directed by the DSCSA.\n \nThe FDA issued a proposed rule establishing wholesaler and \n3PL national standards for licensing and other requirements in February 2022,\n \nbut that rule has not yet been \nfinalized.\n \nIn addition, with respect to our specialty home medical supplies business,\n \nwe are subject to certain state \nlicensure laws (including state pharmacy laws), and also certain accreditation standards,\n \nincluding to qualify for \nreimbursement from Medicare, Medicaid, and other third-party payers. \nThe Food and Drug Administration Amendments Act of 2007 and\n \nthe Food and Drug Administration Safety and \nInnovation Act of 2012 amended the FDC Act to require the FDA to promulgate\n \nregulations to implement a unique \ndevice identification (“UDI”) system for medical devices.\n \nThe UDI rule phased in the implementation of the UDI \nregulations, generally beginning with the highest-risk devices (i.e., Class\n \nIII medical devices) and ending with the \nlowest-risk devices.\n \nThe UDI regulations require “labelers” to include unique device identifiers\n \n(“UDIs”), with a \ncontent and format prescribed by the FDA and issued under a system operated\n \nby an FDA-accredited issuing \nagency, on the labels and packages of medical devices (including, but not limited to, certain software that qualifies \nas a medical device under FDA rules), and to directly mark certain devices\n \nwith UDIs.\n \nThe UDI regulations also \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n14 \nrequire labelers to submit certain information concerning UDI-labeled devices\n \nto the FDA, much of which \ninformation is publicly available on an FDA database, the Global Unique Device\n \nIdentification Database (GUDID).\n \nThe UDI regulations and subsequent FDA guidance regarding the UDI\n \nrequirements provide for certain exceptions, \nalternatives and time extensions.\n \nFor example, the UDI regulations include a general exception\n \nfor Class I devices \nexempt from the Quality System Regulation (other than record-keeping\n \nrequirements and complaint files).\n \nRegulated labelers include entities such as device manufacturers, repackagers,\n \nreprocessors and relabelers that \ncause a device’s label to be applied or modified, with the intent that the device will be commercially distributed \nwithout any subsequent replacement or modification of the label and include certain\n \nof our businesses.\n \nThe FDA \nalso released a final rule in February 2024 to amend, effective February 2026, certain device current\n \ngood \nmanufacturing practice requirements in 21 CFR Part 820 (Quality System Regulation)\n \nto align more closely with \nthe international consensus standard (ISO 13485) specific for device quality\n \nmanagement systems requirements \n(QMSR) used by other countries.\n \nAs a distributor of controlled substances, we are required, under\n \nthe Controlled Substances Act, to obtain and renew \nannually registrations for our facilities from the United States Drug Enforcement\n \nAdministration (“DEA”) \npermitting us to handle controlled substances.\n \nWe \nare also subject to other statutory and regulatory requirements \nrelating to the storage, sale, marketing, handling, reporting, record-keeping\n \nand distribution of such drugs, in \naccordance with the Controlled Substances Act and its implementing regulations,\n \nand these requirements have been \nsubject to heightened enforcement activity in recent times.\n \nWe \nare subject to inspection by the DEA.\n \nCertain of \nour businesses are also required to register for permits and/or licenses\n \nwith, and comply with operating and security \nstandards of, the DEA, the FDA, the United States Department of Health\n \nand Human Services (“HHS”), and \nvarious state boards of pharmacy, state health departments and/or comparable state agencies as well as comparable \nforeign agencies, and certain accrediting bodies, depending on the type of\n \noperations and location of product \ndistribution, manufacturing or sale.\n \nThese businesses include those that distribute, manufacture, relabel, and/or \nrepackage prescription pharmaceuticals and/or medical devices and/or HCT/P\n \nproducts, or own pharmacy \noperations, or install, maintain or repair equipment.\n \nIn addition, Section 301 of the National Organ Transplant Act, and a number of comparable state laws, impose civil \nand/or criminal penalties for the transfer of human organs, as defined in the regulations,\n \nfor valuable consideration, \nwhile generally permitting payments for the reasonable costs incurred\n \nin their procurement, processing, storage and \ndistribution.\n \nWe \nare also subject to foreign government regulation of such products.\n \nThe DEA, the FDA and state \nregulatory authorities have broad inspection and enforcement powers, including\n \nthe ability to suspend or limit the \ndistribution of products by our distribution centers, seize or order the\n \nrecall of products and impose significant \ncriminal, civil and administrative sanctions for violations of these laws and regulations.\n \nForeign regulations subject \nus to similar foreign enforcement powers. \nEU Regulation of Medicinal and Dental Products\n \nEuropean Union (“EU”) member states regulate their own health care systems,\n \nas does EU law.\n \nThe latter regulates \ncertain matters, most notably medicinal products and medical devices.\n \nMedicinal products are defined, broadly, as \nsubstances or combinations of substances having certain functionalities and\n \nmay not include medical devices.\n \nEU \n“regulations” apply in all member states, whereas “directives” are implemented\n \nby the individual laws of member \nstates.\n \nOn medicines for humans, we are regulated under Directive No. 2001/83/EC\n \nof 6 November 2001, as amended by \nDirective 2003/63/EC of 25 June 2003, and EU Regulation (EC) No. 726/2004\n \nof 31 March 2004.\n \nThese rules \nprovide for the authorization of products, and regulate their manufacture,\n \nimportation, marketing and distribution.\n \nIt implements requirements which may be implemented without warning, as\n \nwell as a national pharmacovigilance \nsystem under which marketing authorizations may be withdrawn, and includes\n \npotential sanctions for breaches of \nthe rules, and on other bases such as harmfulness or lack of efficacy.\n \nEU Regulation No. 1223/2009 of 30 November 2009 \non cosmetic products\n \nrequires that cosmetic products (which \nincludes dental products) be safe for human health when used under normal\n \nor reasonably foreseeable conditions of \nuse and comply with certain obligations which apply to manufacturers,\n \nimporters and distributors.\n \nIt includes \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n15 \nmarket surveillance, and non-compliance may result in the recall or withdrawal\n \nof products, along with other \nsanctions.\n \nIn the EU, the EU Medical Device Regulation No. 2017/745 of 5 April 2017\n \n(“EU MDR”) covers a wide scope of \nour activities, from dental material and medical devices to X-ray machines,\n \nand certain software.\n \nIt was meant to \nbecome applicable three years after publication (i.e., May 26, 2020).\n \nHowever, on April 23, 2020, to allow \nEuropean Economic Area (“EEA”) national authorities, notified bodies,\n \nmanufacturers and other actors to focus \nfully on urgent priorities related to the COVID-19 pandemic, the European Council\n \nand Parliament adopted \nRegulation 2020/561, postponing the date of application of the EU MDR by\n \none year (to May 26, 2021). \nThe EU MDR significantly modifies and intensifies the regulatory compliance\n \nrequirements for the medical device \nindustry as a whole.\n \nAmong other things, the EU MDR: \n•\n \nstrengthens the rules on placing devices on the market and reinforces surveillance\n \nonce they are available; \n•\n \nestablishes explicit provisions on manufacturers’ responsibilities\n \nfor the follow-up of the quality, \nperformance and safety of devices placed on the market; \n•\n \nimproves the traceability of medical devices throughout the supply chain to the\n \nend-user or patient through \na unique identification number; \n•\n \nsets up a central database to provide patients, health care professionals and\n \nthe public with comprehensive \ninformation on products available in the EU;\n \n•\n \nstrengthens rules for the assessment of certain high-risk devices, such\n \nas implants, which may have to \nundergo an additional check by experts before they are placed on the market; and \n•\n \nidentifies importers and distributors and medical device products through\n \nregistration in the EUDAMED \ndatabase,\n \nwhich comprises several modules that are not yet fully functional.\n \nIn order not to hinder the \nmandatory use of EUDAMED by the functional delay of a single module,\n \nthe new Regulation No. \n2024/1860 of 13 June 2024 has therefore amended Article 34 of the EU\n \nMDR to organize a gradual \ncommissioning of the various modules of EUDAMED, once they have been\n \nindependently audited and \ndeclared operational by means of a Commission notice published\n \nin the Official Journal of the European \nUnion. In this case, the obligations and requirements relating to the concerned\n \nelectronic modules of \nEUDAMED will apply six months after the date of publication of\n \nthe notice.\n \nThese changes came into \nforce on July 9, 2024; and \n•\n \nas amended by the above-mentioned Regulation No. 2024/1860,\n \ncontains specific provisions in the event of \ninterruption or discontinuation of supply of a device.\n \nIn particular, the EU MDR imposes strict requirements for the confirmation that a product meets\n \nthe regulatory \nrequirements, including regarding a product’s clinical evaluation and a company’s quality systems, and for the \ndistribution, marketing and sale of medical devices, including post-market\n \nsurveillance.\n \nRegulation 2023/607 of the European Parliament and of the Council of\n \nMarch 15, 2023 \namending Regulations (EU) \n2017/745 and (EU) 2017/746 as regards the transitional provisions for certain medical devices and in vitro \ndiagnostic medical devices\n \nhas, notably, extended the EU MDR transitional periods applicable to certain medical \ndevices that have been assessed and/or certified under the Directive No.\n \n93/42/EEC of 1993 \nconcerning medical \ndevices \n(“EU Medical Device Directive”).\n \nSubject to certain conditions, medical devices that (i) obtained a \ncertificate under the EU Medical Device Directive from May 25, 2017,\n \n(ii) which was still valid on May 26, 2021, \nand (iii) has not been subsequently withdrawn may, for the moment, continue to be placed on the market or put into \nservice until December 31, 2027 for higher risk devices or December 31, 2028\n \nfor medium and lower risk devices. \nNevertheless, EU MDR requirements regarding the distribution, marketing\n \nand sale including quality systems and \npost-market surveillance have to be observed by manufacturers, importers and\n \ndistributors as of the application date \n(i.e., since May 26, 2021). \nOther EU regulations that may apply under appropriate circumstances\n \ninclude EU Regulation No. 1907/2006 of 18 \nDecember 2006 \nconcerning the Registration, Evaluation, Authorisation and\n \nRestriction of Chemicals\n, which \nrequires importers to register substances or mixtures that they import\n \nin the EU beyond certain quantities, and the \nEU Regulation No. 1272/2008 of 16 December 2008 \non classification, labelling and packaging of substances and \nmixtures \n(recently amended by Regulation No. 2024/2865 of October 23,\n \n2024, whose provisions come into force \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n16 \non different dates), which sets various obligations with respect to the labelling and\n \npackaging of concerned \nsubstances and mixtures. \nFurthermore, compliance with legal requirements has required and may in the future\n \nrequire us to delay product \nrelease, sale or distribution, or institute voluntary recalls of, or other corrective\n \naction with respect to products we \nsell, each of which could result in regulatory and enforcement actions, financial\n \nlosses and potential reputational \nharm.\n \nOur customers are also subject to significant federal, state, local\n \nand foreign governmental regulations, \nwhich may affect our interactions with customers, including the design and functionality\n \nof our products. \nAntitrust and Consumer Protection \nThe federal government of the United States, most U.S. states and many\n \nforeign countries have antitrust laws that \nprohibit certain types of conduct deemed to be anti-competitive, as well as consumer\n \nprotection laws that seek to \nprotect consumers from improper business practices.\n \nAt the U.S. federal level, the Federal Trade Commission \noversees enforcement of these types of laws, and states have similar government\n \nagencies.\n \nViolations of antitrust \nor consumer protection laws may result in various sanctions, including criminal\n \nand civil penalties.\n \nPrivate \nplaintiffs may also bring civil lawsuits against us in the United States for alleged antitrust\n \nlaw violations, including \nclaims for treble damages.\n \nEU law also regulates competition and provides for detailed rules protecting\n \nconsumers.\n \nHealth Care Fraud \nCertain of our businesses are subject to federal and state (and similar\n \nforeign) health care fraud and abuse, referral \nand reimbursement laws and regulations with respect to their operations.\n \nSome of these laws, referred to as “false \nclaims laws,” prohibit the submission or causing the submission of false or fraudulent\n \nclaims for reimbursement to \nfederal, state and other health care payers and programs.\n \nOther laws, referred to as “anti-kickback laws,” prohibit \nsoliciting, offering, receiving or paying remuneration in order to induce the referral\n \nof a patient or ordering, \npurchasing, leasing or arranging for, or recommending, ordering, purchasing or leasing of, items or services\n \nthat are \npaid for by federal, state and other health care payers and programs.\n \nCertain additional state and federal laws, such \nas the federal Physician Self-Referral Law, commonly known as the “Stark Law,” prohibit physicians and other \nhealth care professionals from referring a patient to an entity with which\n \nthe physician (or family member) has a \nfinancial relationship, for the furnishing of certain designated health services\n \n(for example, durable medical \nequipment and medical supplies), unless an exception applies.\n \nViolations of the federal Anti-Kickback Statute or \nthe Stark Law may be enforced as violations of the federal False Claims\n \nAct. \nThe fraud and abuse laws and regulations have been subject to heightened\n \nenforcement activity over the past few \nyears, and significant enforcement activity has been the result of “relators” who\n \nserve as whistleblowers by filing \ncomplaints in the name of the United States (and if applicable, particular states)\n \nunder applicable false claims laws, \nand who may receive up to 30% of total government recoveries.\n \nPenalties under fraud and abuse laws may be \nsevere, including treble damages and substantial civil penalties under\n \nthe federal False Claims Act, as well as \npotential loss of licenses and the ability to participate in federal and state\n \nhealth care programs, criminal penalties, \nor imposition of a corporate integrity agreement or corporate compliance\n \nmonitoring which could have a material \nadverse effect on our business.\n \nAlso, these measures may be interpreted or applied by a prosecutorial,\n \nregulatory or \njudicial authority in a manner that could require us to make changes\n \nin our operations or incur substantial defense \nand settlement expenses.\n \nEven unsuccessful challenges by regulatory authorities or private\n \nrelators could result in \nreputational harm and the incurring of substantial costs.\n \nMost states have adopted similar state false claims laws, \nand these state laws have their own penalties, which may be in addition\n \nto federal False Claims Act penalties, as \nwell as other fraud and abuse laws.\n \nWith respect to measures of this type, the United States government (among others) has expressed concerns\n \nabout \nfinancial relationships between suppliers, manufacturers and distributors on\n \nthe one hand and physicians, dentists \nand other health care professionals on the other.\n \nAs a result, we regularly review and revise our marketing practices \nas necessary to facilitate compliance. \nWe \nalso are subject to certain United States and foreign laws and regulations\n \nconcerning the conduct of our foreign \noperations, including the U.S. Foreign Corrupt Practices Act, the U.K. Bribery\n \nAct, German anti-corruption laws \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n17 \nand other anti-bribery laws and laws pertaining to the accuracy of our internal\n \nbooks and records, which have been \nthe focus of increasing enforcement activity globally in recent years. \nWhile we believe that we are substantially compliant with applicable fraud and\n \nabuse laws and regulations, and \nhave adequate compliance programs and controls in place to ensure substantial\n \ncompliance, we cannot predict \nwhether changes in applicable law, or interpretation of laws, or changes in our services or marketing practices in \nresponse to changes in applicable law or interpretation of laws, or failure\n \nto comply with applicable law, could have \na material adverse effect on our business. \nAffordable Care Act (ACA) and Other Insurance Reform \nThe ACA increased federal oversight of private health insurance plans and\n \nincluded a number of provisions \ndesigned to reduce Medicare expenditures and the cost of health care generally, to reduce fraud and abuse, and to \nprovide access to increased health coverage.\n \nThe ACA also materially expanded the number of individuals\n \nin the \nUnited States with health insurance.\n \nThe ACA remains subject to ongoing legal and political challenges\n \nthat \ncontribute to create uncertainty, and any outcomes of those challenges could have a significant impact on the\n \nU.S. \nhealth care industry.\n \nThe federal Physician Payments Sunshine Act or Open Payments Program\n \n(the “Sunshine Act”) imposes annual \nreporting and disclosure requirements for drug and device manufacturers and\n \ndistributors with regard to payments \nor other transfers of value made to certain covered recipients (including physicians,\n \ndentists, teaching hospitals, \nphysician assistants, nurse practitioners, clinical nurse specialists, certified\n \nregistered nurse anesthetists, and \ncertified nurse midwives), and for such manufacturers and distributors\n \nand for group purchasing organizations, with \nregard to certain ownership interests held by covered recipients in\n \nthe reporting entity.\n \nCMS publishes information \nfrom these reports on a publicly available website, including amounts transferred\n \nand physician, dentist, teaching \nhospital, and non-physician practitioner identities.\n \nThe Sunshine Act pre-empts similar state reporting laws, \nalthough we or our subsidiaries may be required to report under certain\n \nstate transparency laws that address \ncircumstances not covered by the Sunshine Act, and some of these state laws,\n \nas well as the federal law, can be \nunclear.\n \nWe \nare also subject to foreign regulations requiring transparency of certain\n \ninteractions between suppliers \nand their customers.\n \nIn the United States, federal and state government actions to seek to increase\n \nhealth-related price transparency may \nalso affect our business.\n \nFor example, CMS requires hospitals to publish online a\n \nlist of their standard charges for \nall items and services, including discounted cash prices and payer-specific and de-identified negotiated\n \ncharges, in a \npublicly accessible online file, and payers to disclose in-network negotiated\n \nrates, including with device suppliers \nand manufacturers, and historical out-of-network allowed amounts for all\n \ncovered items and services, including \nprescription drugs. Hospitals are also required to publish a consumer-friendly\n \nlist of standard charges for certain \n“shoppable” services (i.e., services that can be scheduled by a patient in\n \nadvance) and associated ancillary services \nor, alternatively, maintain an online price estimator tool.\n \nThese requirements went into effect in three stages from \n2022 to 2024.\n \nCMS may impose civil monetary penalties for noncompliance with\n \nthese price transparency \nrequirements.\n \nIn addition to a variety of transparency measures being enacted\n \nat the state level, the federal No \nSurprises Act (“NSA”) imposes additional price transparency requirements.\n \nThe NSA is intended to reduce the \nnumber of “out-of-network” patients.\n \nThis will result in fewer out-of-network payments to physicians and\n \nother \nproviders, which may cause financial stress to those providers who\n \nare dependent on higher out-of-network fees.\n \nThe Medicare Access and CHIP Reauthorization Act of 2015 (“MACRA”),\n \nenacted on April 16, 2015, established \nthe Quality Payment Program, which modifies certain Medicare Part B payments\n \nto “eligible clinicians,” including \nphysicians, dentists and other practitioners.\n \nUnder MACRA, certain eligible clinicians are required to participate\n \nin \nMedicare through the Merit-Based Incentive Payment System (“MIPS”) or Advanced\n \nAlternative Payment Models, \nthrough which Medicare Part B is adjusted up or down based on reported\n \ndata related to quality, promoting \ninteroperability, cost and improvement activities.\n \nMIPS eligible clinicians must report performance year data by \nMarch 31 of the following calendar year.\n \nPayment adjustments, based on submitted data, are applied to Medicare \nPart B claims during the performance year following data submission.\n \nMACRA provides substantial financial \nincentives for physicians to participate in risk contracts, and to increase physician\n \ninformation technology and \nreporting obligations.\n \nMACRA continues to evolve and its implications depend on future regulatory\n \nactivity and \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n18 \nphysician activity in the marketplace.\n \nNew state-level payment and delivery system reform programs,\n \nincluding \nthose modeled after such federal programs, are also increasingly being rolled\n \nout through Medicaid administrators, \nas well as through the private sector, which may further alter the marketplace and impact our business.\n \nRecently, in addition to other government efforts to control health care costs, there has been increased scrutiny on \ndrug pricing and concurrent efforts to control or reduce drug costs by Congress, the\n \nPresident, executive branch \nagencies and various states.\n \nAt the state level, several states have adopted laws that require drug manufacturers \n(including relabelers and repackagers) to provide advance notice of certain\n \nprice increases and to report information \nrelating to those price increases, while others have taken legislative or administrative\n \naction to establish \nprescription drug affordability boards or multi-payer purchasing pools to reduce the cost of\n \nprescription drugs.\n \nAt \nthe federal level, section 1927 of the Social Security Act sets forth Average Sales Price (ASP) reporting \nrequirements for manufacturers (including repackagers and relabelers) and\n \nrequires that manufacturers provide \nCMS with pricing information for their Part B-covered drugs no later than\n \n30 days after the close of the previous \nquarter.\n \nAlso at the federal level, several related bills have been introduced and regulations\n \nproposed which, if \nenacted or finalized, respectively, would impact drug pricing and related costs.\n \nAlso, at the federal level, the \nInflation Reduction Act of 2022, among other things, requires drug manufacturers\n \nthat raise certain of their drug \nprices faster than the rate of inflation to pay rebates to Medicare, and over time will authorize\n \nthe federal \ngovernment to negotiate directly with drug manufacturers to lower the\n \nprices of certain brand-name drugs covered \nby Medicare.\n \nThese various evolving efforts create uncertainty and may adversely affect our business.\n \n \nAs a result of political, economic and regulatory influences, the health care distribution\n \nindustry in the United \nStates is under intense scrutiny and subject to fundamental changes.\n \nWe \ncannot predict what further reform \nproposals, if any, will be adopted, when they may be adopted, or what impact they may have on us. \nEU Directive on the pricing and reimbursement of medicinal products\n \nEU law provides for the regulation of the pricing of medicinal products which are\n \nimplemented by EU member \nstates (Directive No. 89/105/EC of 21 December 1988 \nrelating to the transparency of measures regulating the \npricing of medicinal products for human use and their inclusion in the scope of national health insurance\n \nsystems\n).\n \nMember states may, subject notably to transparency conditions and to the statement of reasons based upon \nobjective and verifiable criteria, regulate the price charged (or its increases) for authorized\n \nmedicines and their level \nof reimbursement, or they may freeze prices, place controls on the profitability\n \nof persons responsible for placing \nmedicinal products on the market, and include or exclude the medicine on\n \nthe list of products covered by national \nhealth insurance systems.\n \nEU law does not expressly include provisions like those of the Sunshine Act in\n \nthe United States, but a growing \nnumber of EU member states (such as France in 2011 and Italy in 2022) have enacted laws to increase\n \nthe \ntransparency of relationships in the health care sector.\n \nThe scope of these laws varies from one member state to \nanother and may, for example, include the relations between health care industry players and physicians or their \nassociations, students preparing for medical professions or their associations,\n \nteachers, health establishments or \npublishers of prescription and dispensing assistance software. \nRegulated Software; Electronic Health Records; Privacy \nThe FDA has become increasingly active in addressing the regulation of\n \ncomputer software and digital health \nproducts intended for use in health care settings, including, for\n \nexample, most recently, with respect to artificial \nintelligence and machine learning-enabled medical devices, and the\n \ncybersecurity of medical devices.\n \nCertain of \nour businesses involve the development and sale of software and related\n \nproducts, including to support physician \nand dental practice management, and it is possible that the FDA or foreign\n \ngovernment authorities could determine \nthat one or more of our products is a medical device, which could subject us\n \nor one or more of our businesses to \nsubstantial additional requirements with respect to these products. \nIn addition, our businesses that involve physician and dental practice management\n \nproducts, our specialty home \nmedical supplies business, and our self-insured health plans include electronic\n \ninformation technology systems that \nstore and process personal health, clinical, financial and other sensitive information\n \nof individuals.\n \nThese \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n19 \ninformation technology systems may be vulnerable to breakdown, wrongful\n \nintrusions, data breaches and malicious \nattack, which could require us to expend significant resources to eliminate\n \nthese problems and address related \nsecurity concerns and could involve claims against us by private parties and/or\n \ngovernmental agencies.\n \nFor \nexample, we are directly or indirectly subject to numerous and evolving\n \nfederal, state, local and foreign laws and \nregulations that protect the privacy and security of personal information,\n \nsuch as the federal Health Insurance \nPortability and Accountability Act of 1996, as amended, and implementing\n \nregulations (“HIPAA”) under which \nparts of our business are covered entities or business associates, the Controlling\n \nthe Assault of Non-Solicited \nPornography and Marketing Act (“CAN-SPAM”), the Telephone\n \nConsumer Protection Act of 1991 (“TCPA”), \nSection 5 of the Federal Trade Commission Act (“FTC Act”), the California Privacy Act (“CCPA”), various other \nstate comprehensive and health data-specific privacy laws that have or will soon\n \ncome into effect, and several \nprivacy bills have been proposed both at the federal and state level that may\n \nresult in additional legal requirements \nthat impact our business.\n \nLaws and regulations relating to privacy and data protection are\n \ncontinually evolving and \nsubject to potentially differing interpretations, including those relating to artificial\n \nintelligence, the proliferation of \nwhich may result in additional regulation.\n \nThese requirements may not be harmonized, may be interpreted and \napplied in a manner that is inconsistent from one jurisdiction to another or\n \nmay conflict with other rules or our \npractices.\n \nIn addition, cybersecurity laws such as the federal Cyber Incident\n \nReporting for Critical Infrastructure \nAct of 2022, proposed Federal Acquisition Regulations, and amendments\n \nto SEC reporting requirements may \nrequire us to provide notifications about cybersecurity incidents in limited\n \ntimeframes and before investigations are \ncomplete.\n \nOur businesses’ failure to comply with these laws and regulations could\n \nexpose us to breach of contract \nclaims, substantial fines, penalties and other liabilities and expenses, costs for\n \nremediation and harm to our \nreputation.\n \nAlso, evolving laws and regulations in this area could restrict the\n \nability of our customers to obtain, use \nor disseminate patient information, or could require us to incur significant\n \nadditional costs to re-design our products \nto reflect these legal requirements, which could have a material adverse effect on our\n \noperations.\n \nAlso, the European Parliament and the Council of the EU adopted the pan-European\n \nGeneral Data Protection \nRegulation (“GDPR”), effective from May 25, 2018, which increased privacy rights\n \nfor individuals (“Data \nSubjects”), including individuals who are our customers, suppliers and\n \nemployees.\n \nThe GDPR extended the scope \nof responsibilities for data controllers and data processors, and generally\n \nimposes increased requirements and \npotential penalties on companies, such as us, that are either established in\n \nthe EU and process personal data of Data \nSubjects (regardless the Data Subject location), or that are not established\n \nin the EU but that offer goods or services \nto Data Subjects in the EU or monitor their behavior in the EU. Noncompliance\n \ncan result in penalties of up to the \ngreater of EUR 20 million, or 4% of global company revenues (sanction\n \nthat may be public), and Data Subjects \nmay seek damages.\n \nMember states may individually impose additional requirements\n \nand penalties regarding \ncertain limited matters (for which the GDPR left some room of flexibility),\n \nsuch as employee personal data.\n \nWith \nrespect to the personal data it protects, the GDPR requires, among other things,\n \ncontroller accountability, consents \nfrom Data Subjects or another acceptable legal basis to process the personal\n \ndata, notification within 72 hours of a \npersonal data breach where required, data integrity and security, and fairness and transparency regarding the \nstorage, use or other processing of the personal data.\n \nThe GDPR also provides rights to Data Subjects relating \nnotably to information, access, rectification, erasure of the personal data and\n \nthe right to object to the processing.\n \nDespite the UK’s exit from the EU, the UK still also has laws equivalent to the GDPR/EU data protection laws (UK \nGDPR).\n \nUncertainty about compliance with the GDPR and EU data protection\n \nlaws remains, with the possibility \nthat data protection authorities located in different EU Member States may interpret GDPR\n \ndifferently, or \nrequirements of national laws may vary between the EU Member States, or guidance\n \non GDPR and compliance \npractices may be often updated or otherwise revised.\n \nAny of these events will increase the complexity and costs of \nprocessing personal data in the UK or European Economic Area or concerning\n \nindividuals located in the UK or \nEuropean Economic Area. \nOn August 20, 2021, China promulgated the PRC Personal Information Protection\n \nLaw (“PIPL”), which took effect \non November 1, 2021.\n \nThe PIPL imposes specific rules for processing personal information\n \nand it also specifies \nthat the law shall also apply to personal information activities carried out\n \noutside China but for the purpose of \nproviding products or services to PRC citizens.\n \nAny non-compliance with these laws and regulations may subject \nus to fines, orders to rectify or terminate any actions that are deemed\n \nillegal by regulatory authorities, other \npenalties, as well as reputational damage or legal proceedings against us, which\n \nmay affect our business, financial \ncondition or results of operations.\n \nThe PIPL carries maximum penalties of CNY50 million or 5% of\n \nthe annual \nrevenue of entities that process personal data.\n \nData protection laws in other countries outside of the United States \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n20 \nare also quickly evolving, with many countries having updated, or are in the\n \nprocess of updating, their laws to bring \nthem more in line with the model created by GDPR.\n \nIn the United States, the CCPA, which increases the privacy protections afforded California residents, became \neffective January 1, 2020.\n \nThe CCPA establishes a privacy framework for covered businesses such as ours by, \namong other things, creating an expanded definition of personal information,\n \nestablishing new data privacy rights \nfor California residents and creating a new and potentially severe statutory damages\n \nframework for violations of the \nCCPA, as well as potentially severe statutory damages and private a right of action against businesses that suffer a \ndata security breach due to their violation of a duty to implement reasonable\n \nsecurity procedures and practices. This \nprivate right of action may increase the likelihood of, and risks associated\n \nwith, data breach litigation.\n \nIn addition, \nin November 2020, California voters adopted the CPRA, which became effective\n \nJanuary 1, 2023 and enhances and \nstrengthens regulatory requirements and individual protections that currently\n \nexist under the CCPA. Other states \nhave enacted or are considering enacting similar privacy laws, which may subject\n \nus to additional requirements and \nrestrictions that could have an impact on our business.\n \nComprehensive privacy laws in Colorado, Connecticut, \nVirginia, Utah, Oregon, Delaware, Montana, Texas,\n \nIowa, Maryland, New Jersey, New Hampshire, and Nebraska \nare now in effect, and similarly enacted broad state laws relating to privacy, data protection, and information \nsecurity will come into effect later in 2025 and 2026, further complicating our privacy\n \ncompliance obligations \nthrough the introduction of increasingly disparate requirements across the\n \nvarious U.S. jurisdictions in which we \noperate. Additionally, Washington\n \nstate and Nevada have enacted specific health data privacy laws, and\n \nother states \nare considering similar legislation.\n \nAdditional states are expected to pass their own versions of data privacy\n \nlaws in \nthe future.\n \nCongress is considering legislation that may preempt some\n \nor all of such U.S. state privacy laws, but \nwhich may also provide a more expansive private right of action for privacy\n \nclaims than exists under current state \nlaws.\n \nThe evolving complexity of privacy and data security legislation in the United\n \nStates may complicate our \ncompliance efforts and further increase our risk of regulatory enforcement, penalties,\n \nand litigation.\n \nWhile we \nbelieve we have substantially compliant programs and controls in place to comply\n \nwith the US state and federal \nprivacy laws and applicable international privacy laws such as GDPR and PIPL,\n \nour compliance with data privacy \nand cybersecurity laws is likely to impose additional costs on us, and we\n \ncannot predict whether the interpretations \nof the requirements, or changes in our practices in response to new requirements\n \nor interpretations of the \nrequirements, could have a material adverse effect on our business. \nFurther, countries are applying their data and consumer protection laws to AI, particularly generative\n \nAI, and are \nconsidering and implementing specific legal frameworks with respect\n \nto AI, for example the EU AI Act 2024 \n(which as with the GDPR, will have extra-territorial effect).\n \nAny failure or perceived failure by us to comply with \nsuch requirements could have an adverse impact on our business.\n \nAnticipated further evolution of regulations and \nlegislation on this topic may substantially increase the penalties to which we\n \ncould be subject in the event of any \nnon-compliance.\n \nCompliance with these laws is challenging, constantly evolving,\n \nand time consuming and federal \nregulators, state attorneys general and plaintiff’s attorneys have been and will likely\n \ncontinue to be active in this \nspace.\n \nWe \nmay incur substantial expense in complying with legal obligations to\n \nbe imposed by new regulations \nand we may be required to make significant changes to our solutions and expanding\n \nbusiness operations, all of \nwhich may materially adversely affect our operations. \nWe \nalso sell products and services that health care providers, such as physicians\n \nand dentists, use to store and \nmanage patient medical or dental records.\n \nThese customers, and we, are subject to laws, regulations and industry \nstandards, such as HIPAA and the Payment Card Industry Data Security Standards, which require the protection of \nthe privacy and security of those records, and our products may also be\n \nused as part of these customers’ \ncomprehensive data security programs, including in connection with their efforts to comply with\n \napplicable privacy \nand security laws.\n \nPerceived or actual security vulnerabilities in our products or services,\n \nor the perceived or actual \nfailure by us or our customers who use our products or services to comply\n \nwith applicable legal or contractual data \nprivacy and security requirements, may not only cause us significant reputational\n \nharm, but may also lead to claims \nagainst us by our customers and/or governmental agencies and involve substantial\n \nfines, penalties and other \nliabilities and expenses and costs for remediation. \n\n\n\n\n\n\n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n21 \nVarious\n \nfederal initiatives involve the adoption and use by health care\n \nproviders of certain EHR systems and \nprocesses.\n \nThe initiatives include, among others, programs that incentivize\n \nphysicians and dentists, through MIPS, \nto use EHR technology in accordance with certain evolving requirements,\n \nincluding regarding quality, promoting \ninteroperability, cost and improvement activities.\n \nQualification for the MIPS incentive payments requires the use \nof EHRs that are certified as having certain capabilities designated\n \nin evolving standards adopted by CMS and the \nOffice of the National Coordinator for Health Information Technology of HHS (“ONC”).\n \nCertain of our businesses \ninvolve the manufacture and sale of such certified EHR systems and other products\n \nlinked to government supported \nincentive programs.\n \nIn order to maintain certification of our EHR products, we\n \nmust satisfy these changing \ngovernmental standards.\n \nIf any of our EHR systems do not meet these standards,\n \nyet have been relied upon by \nhealth care providers to receive federal incentive payments, we may be exposed\n \nto risk, such as under federal health \ncare fraud and abuse laws, including the False Claims Act.\n \nAdditionally, effective September 1, 2023, the Office of \nthe Inspector General (“OIG”) for HHS issued a final rule implementing\n \ncivil money penalties for information \nblocking as established by the Cures Act.\n \nOIG incorporated regulations published by ONC as the basis for \nenforcing information blocking penalties.\n \nEach information blocking violation carries up to a $1 million penalty. \nMoreover, in order to satisfy our customers, and comply with evolving legal requirements, our products may\n \nneed \nto incorporate increasingly complex functionality, such as with respect to reporting and information blocking.\n \nAlthough we believe we are positioned to accomplish this, the effort may involve\n \nincreased costs, and our failure to \nimplement product modifications, or otherwise satisfy applicable standards,\n \ncould have a material adverse effect on \nour business. \nOther health information standards, such as regulations under HIPAA, establish standards regarding electronic \nhealth data transmissions and transaction code set rules for specific electronic\n \ntransactions, such as transactions \ninvolving claims submissions to third party payers.\n \nFailure to abide by these and other electronic health data \ntransmission standards could expose us to breach of contract claims,\n \nsubstantial fines, penalties, and other liabilities \nand expenses, costs for remediation and harm to our reputation. \nAdditionally, as electronic medical devices are increasingly connected to each other and to other technology, the \nability of these connected systems to safely and effectively exchange and use exchanged\n \ninformation becomes \nincreasingly important.\n \nAs a medical device manufacturer, we must manage risks including those associated with \nan electronic interface that is incorporated into a medical device. \nThere may be additional legislative or regulatory initiatives in the future impacting\n \nhealth care. \nE-Commerce \nElectronic commerce solutions have become an integral part of traditional health\n \ncare supply and distribution \nrelationships.\n \nOur distribution business is characterized by rapid technological\n \ndevelopments and intense \ncompetition.\n \nThe continuing advancement of online commerce requires\n \nus to cost-effectively adapt to changing \ntechnologies, to enhance existing services and to develop and introduce a\n \nvariety of new services to address the \nchanging demands of consumers and our customers on a timely basis, particularly\n \nin response to competitive \nofferings. \n \nThrough our proprietary, technologically-based suite of products, we offer customers a variety of competitive \nalternatives.\n \nWe \nbelieve that our tradition of reliable service, our name recognition\n \nand large customer base built \non solid customer relationships, position us well to participate in\n \nthis significant aspect of the distribution business.\n \nWe \ncontinually explore ways and means to improve and expand our\n \nonline presence and capabilities, including in \nour online commerce offerings and our use of various social media outlets. \nInternational Transactions \nUnited States and foreign import and export laws and regulations require us to\n \nabide by certain standards relating to \nthe importation and exportation of products.\n \nWe \nalso are subject to certain laws and regulations concerning the \nconduct of our foreign operations, including the U.S. Foreign Corrupt Practices\n \nAct, the U.K. Bribery Act, German \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n22 \nanti-corruption laws and other anti-bribery laws and laws pertaining\n \nto the accuracy of our internal books and \nrecords, as well as other types of foreign requirements similar to those\n \nimposed in the United States. \nWhile we believe that we are substantially compliant with the foregoing laws\n \nand regulations promulgated \nthereunder and possess all material permits and licenses required for the conduct\n \nof our business, there can be no \nassurance that laws and regulations that impact our business or laws and\n \nregulations as they apply to our customers’ \npractices will not have a material adverse effect on our business.\n \nSee “",
  "item7": "ITEM 7.\n \nManagement’s Discussion and Analysis of Financial Condition and Results of\n \nOperations \nCautionary Note Regarding Forward-Looking Statements\n \nIn accordance with the “Safe Harbor” provisions of the Private Securities\n \nLitigation Reform Act of 1995, we \nprovide the following cautionary remarks regarding important factors\n \nthat, among others, could cause future results \nto differ materially from the forward-looking statements, expectations and assumptions\n \nexpressed or implied herein.\n \nAll forward-looking statements made by us are subject to risks and uncertainties\n \nand are not guarantees of future \nperformance.\n \nThese forward-looking statements involve known and unknown\n \nrisks, uncertainties and other factors \nthat may cause our actual results, performance and achievements\n \nor industry results to be materially different from \nany future results, performance or achievements expressed or implied\n \nby such forward-looking statements.\n \nThese \nstatements are generally identified by the use of such terms as “may,” “could,” “expect,” “intend,” “believe,” \n“plan,” “estimate,” “forecast,” “project,” “anticipate,” “to be,” “to\n \nmake” or other comparable terms. Factors that \ncould cause or contribute to such differences include, but are not limited to,\n \nthose discussed in this Annual Report \non Form 10-K, and in particular the risks discussed under the caption\n \n“Risk Factors” in Item 1A of this report and \nthose that may be discussed in other documents we file with\n \nthe Securities and Exchange Commission (“SEC”). \nRisk factors and uncertainties that could cause actual results to differ materially from current\n \nand historical results \ninclude, but are not limited to: our dependence on third parties for\n \nthe manufacture and supply of our products and \nwhere we manufacture products, our dependence on third parties\n \nfor raw materials or purchased components; risks \nrelating to the achievement of our strategic growth objectives; risks\n \nrelated to the recently signed Strategic \nPartnership Agreement; our ability to develop or acquire and maintain\n \nand protect new products (particularly \ntechnology products) and services and utilize new technologies\n \nthat achieve market acceptance with acceptable \nmargins; transitional challenges associated with acquisitions, dispositions and joint ventures,\n \nincluding the failure to \nachieve anticipated synergies/benefits, as well as significant demands on our operations,\n \ninformation systems, legal, \nregulatory, compliance, financial and human resources functions in connection with acquisitions, dispositions and \njoint ventures; certain provisions in our governing documents that may discourage\n \nthird-party acquisitions of us; \nadverse changes in supplier rebates or other purchasing incentives;\n \nrisks related to the sale of corporate brand \nproducts; risks related to activist investors; security risks associated with our\n \ninformation systems and technology \nproducts and services, such as cyberattacks or other privacy or data security\n \nbreaches (including the October 2023 \nincident); effects of a highly competitive (including, without limitation, competition\n \nfrom third-party online \ncommerce sites) and consolidating market; changes in the health care\n \nindustry; risks from expansion of customer \npurchasing power and multi-tiered costing structures; increases in shipping costs\n \nfor our products or other service \nissues with our third-party shippers, and increases in fuel and energy costs; changes\n \nin laws and policies governing \nmanufacturing, development and investment in territories and countries\n \nwhere we do business; general global and \ndomestic macro-economic and political conditions, including inflation,\n \ndeflation, recession, unemployment (and \ncorresponding increase in under-insured populations), consumer confidence,\n \nsovereign debt levels, ongoing wars, \nfluctuations in energy pricing and the value of the U.S. dollar as compared to\n \nforeign currencies, and changes to \nother economic indicators, international trade agreements; the threat\n \nor outbreak of war, terrorism or public unrest \n(including, without limitation, the war in Ukraine, the Israel-Gaza war and other\n \nunrest and threats in the Middle \nEast and the possibility of a wider European or global conflict); changes\n \nto laws and policies governing foreign \ntrade, tariffs and sanctions, or greater restrictions on imports and exports; supply\n \nchain disruption; geopolitical \nwars; failure to comply with existing and future regulatory requirements,\n \nincluding relating to health care; risks \nassociated with the EU Medical Device Regulation; failure to comply\n \nwith laws and regulations relating to health \ncare fraud or other laws and regulations; failure to comply with laws\n \nand regulations relating to the collection, \nstorage and processing of sensitive personal information or standards in electronic\n \nhealth records or transmissions; \nchanges in tax legislation, changes in tax rates and availability of certain tax\n \ndeductions; risks related to product \nliability, intellectual property and other claims; risks associated with customs policies or legislative import \nrestrictions; risks associated with disease outbreaks, epidemics, pandemics\n \n(such as the COVID-19 pandemic), or \nsimilar wide-spread public health concerns and other natural or\n \nman-made disasters; risks associated with our \nglobal operations; litigation risks; new or unanticipated litigation developments\n \nand the status of litigation matters; \nour dependence on our senior management, employee hiring and retention,\n \nincreases in labor costs or health care \ncosts, and our relationships with customers, suppliers and manufacturers;\n \nand disruptions in financial markets. The \norder in which these factors appear should not be construed to indicate their\n \nrelative importance or priority. \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n48 \nWe caution that these factors may not be exhaustive and that many of these factors are beyond our ability to control \nor predict.\n \nAccordingly, any forward-looking statements contained herein should not be relied upon as a prediction \nof actual results.\n \nWe undertake no duty and have no obligation to update forward-looking statements except as \nrequired by law. \nWhere You\n \nCan Find Important Information \nWe may disclose important information through one or more of the following channels: SEC filings, public \nconference calls and webcasts, press releases, the investor relations\n \npage of our website (www.henryschein.com) \nand the social media channels identified on the About Media Center page of\n \nour website. \nRecent Developments \nWhile the U.S. economy has experienced inflationary pressures and\n \nstrengthening of the U.S. dollar, their impacts \nhave not been material to our results of operations.\n \nThough inflation impacts both our revenues and costs, the depth \nand breadth of our product portfolio often allows us to offer lower-cost national brand solutions\n \nor corporate brand \nalternatives to our more price-sensitive customers who are unwilling to\n \nabsorb price increases, thus positioning us \nto protect our gross profit. \nSegment Reporting\nDuring the fourth quarter of our fiscal year ended December 28, 2024,\n \nwe revised our reportable segments to align \nwith how the Chairman and Chief Executive Officer manages the business, assesses\n \nperformance and allocates \nresources.\n \nOur revised reportable segments now consist of: (i) Global Distribution\n \nand Value\n \n-Added Services; (ii) \nGlobal Specialty Products; and (iii) Global Technology. \nGlobal Distribution and Value-Added Services includes distribution to the global dental and medical markets of \nnational brand and corporate brand merchandise, as well as equipment and related\n \ntechnical services.\n \nThis segment \nalso includes value-added services such as financial services, continuing\n \neducation services, consulting and other \nservices.\n \nThis segment also markets and sells under our own corporate brand,\n \na portfolio of cost-effective, high-\nquality consumable merchandise.\n \nGlobal Specialty Products includes manufacturing, marketing and sales\n \nof dental \nimplant and biomaterial products; and endodontic, orthodontic and orthopedic\n \nproducts and other health care-\nrelated products and services.\n \nGlobal Technology includes development and distribution of practice management \nsoftware, e-services, and other products, which are distributed to health\n \ncare providers. \nCyber Incident \nIn October 2023 Henry Schein experienced a cyber incident that primarily\n \naffected the operations of our North \nAmerican and European dental and medical distribution businesses.\n \nHenry Schein One, our practice management \nsoftware, revenue cycle management and patient relationship management\n \nsolutions business, was not affected, and \nour manufacturing businesses were mostly unaffected.\n \nOn November 22, 2023, we experienced a disruption of our \necommerce platform and related applications, which was remediated. \nDuring the year ended December 28, 2024, we had a sales decrease\n \nin our dental and medical distribution \nbusinesses, which we believe was primarily a result of lower sales to episodic\n \ncustomers following last year’s cyber \nincident.\n \nWe have a number of programs underway focused on re-establishing these customers. \nDuring the years ended December 28, 2024 and December 30, 2023, we\n \nincurred $9 million and $11 million of \nexpenses directly related to the cyber incident, mostly consisting of professional\n \nfees.\n \nWe maintain cyber \ninsurance, subject to certain retentions and policy limitations.\n \nWith respect to the October 2023 cyber incident, we \nhave a $60 million insurance policy, following a $5 million retention.\n \nDuring the year ended December 28, 2024, \nwe submitted a claim under this policy for $60 million and received\n \ninsurance proceeds of $40 million, with the \nremaining $20 million of the claim being under review by our insurance\n \nproviders.\n \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n49 \nExecutive-Level Overview\n \nHenry Schein, Inc. is a solutions company for health care professionals powered\n \nby a network of people and \ntechnology.\n \nWe \nbelieve we are the world’s largest provider of health care products and services primarily to office-\nbased dental and medical practitioners, as well as alternate sites of care.\n \nWe \nserve more than one million customers \nworldwide including dental practitioners, laboratories, physician practices and\n \nambulatory surgery centers, as well \nas government, institutional health care clinics and other alternate care clinics.\n \nWe \nbelieve that we have a strong \nbrand identity due to our more than 93 years of experience distributing health\n \ncare products. \nWe \nare headquartered in Melville, New York, employ approximately 25,000 people (of which approximately \n13,000 are based outside of the United States) and have operations or affiliates in 33 countries\n \nand territories.\n \nOur \nbroad global footprint has evolved over time through our organic growth as well\n \nas through contribution from \nstrategic acquisitions. \nWe \nhave established strategically located distribution centers around\n \nthe world to enable us to better serve our \ncustomers and increase our operating efficiency.\n \nThis infrastructure, together with broad product and service \nofferings at competitive prices, and a strong commitment to customer service, enables\n \nus to be a single source of \nsupply for our customers’ needs. \nWhile our primary go-to-market strategy is in our capacity as a distributor, we also market and sell our own \ncorporate brand portfolio of cost-effective, high-quality consumable merchandise products.\n \nWe \nalso manufacture, \nsource and sell a range of company-owned manufactured products, primarily implants,\n \nbiomaterial products, \nendodontics, handpiece and small equipment, hand instrument and repair, restoratives, orthodontics, wound\n \ncare, \northopedics and dental lab products.\n \nWe \nhave achieved scale in these global businesses primarily through \nacquisitions, as manufacturers of these products typically do not utilize\n \na distribution channel to serve customers. \nDuring the fourth quarter of our fiscal year ended December 28, 2024, we\n \nrevised our reportable segments to align \nwith how the Chairman and Chief Executive Officer manages the business, assesses performance\n \nand allocates \nresources.\n \nOur revised reportable segments now consist of: (i) Global Distribution\n \nand Value\n \n-Added Services; (ii) \nGlobal Specialty Products; and (iii) Global Technology. \nGlobal Distribution and Value-Added Services includes distribution to the global dental and medical markets of \nnational brand and corporate brand merchandise, as well as equipment and related\n \ntechnical services.\n \nThis segment \nalso includes value-added services such as financial services, continuing education\n \nservices, consulting and other \nservices.\n \nThis segment also markets and sells under our own corporate brand,\n \na portfolio of cost-effective, high-\nquality consumable merchandise.\n \nGlobal Specialty Products includes manufacturing, marketing and sales\n \nof dental \nimplant and biomaterial products; and endodontic, orthodontic and orthopedic\n \nproducts and other health care-\nrelated products and services.\n \nGlobal Technology includes development and distribution of practice management \nsoftware, e-services, and other products, which are distributed to health\n \ncare providers. \nA key element to grow closer to our customers is our One Schein initiative, which\n \nis a unified go-to-market \napproach that enables practitioners to work synergistically with our supply chain,\n \nequipment sales and service and \nother value-added services, allowing our customers to leverage the\n \ncombined value that we offer through a single \nprogram.\n \nSpecifically, One Schein provides customers with streamlined access to our comprehensive offering of \nnational brand products, our corporate brand products and proprietary specialty\n \nproducts and solutions (including \nimplant, orthodontic and endodontic products).\n \nIn addition, customers have access to a wide range of services, \nincluding software and other value-added services.\nIndustry Overview\nIn recent years, the health care industry has increasingly focused on cost containment.\n \nThis trend has benefited \ndistributors capable of providing a broad array of products and services at low\n \nprices.\n \nIt also has accelerated the \ngrowth of DSOs, GPOs, HMOs, group practices, other managed care\n \naccounts and collective buying groups, which, \nin addition to their emphasis on obtaining products at competitive prices,\n \ntend to favor distributors capable of \nproviding specialized management information support.\n \nWe \nbelieve that the trend towards cost containment has \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n50 \nthe potential to favorably affect demand for technology solutions, including software,\n \nwhich can enhance the \nefficiency and facilitation of practice management. \nOur operating results in recent years have been significantly affected by strategies\n \nand transactions that we \nundertook to expand our business, domestically and internationally, in part to address significant changes in the \nhealth care industry, including consolidation of health care distribution companies, health care reform, trends \ntoward managed care, cuts in Medicare and collective purchasing arrangements. \nIndustry Consolidation\nThe health care products distribution industry, as it relates to office-based health care practitioners, is fragmented \nand diverse.\n \nThe industry ranges from sole practitioners working out of\n \nrelatively small offices to group practices \nor service organizations ranging in size from a few practitioners to a large number of practitioners who have \ncombined or otherwise associated their practices. \nDue in part to the inability of office-based health care practitioners to store and manage\n \nlarge quantities of supplies \nin their offices, the distribution of health care supplies and small equipment to office-based health\n \ncare practitioners \nhas been characterized by frequent, small quantity orders, and a need for rapid,\n \nreliable and substantially complete \norder fulfillment.\n \nThe purchasing decisions within an office-based health care practice are typically\n \nmade by the \npractitioner or an administrative assistant.\n \nSupplies and small equipment are generally purchased from more\n \nthan \none distributor, with one generally serving as the primary supplier. \nThe trend of consolidation extends to our customer base.\n \nHealth care practitioners are increasingly seeking to \npartner, affiliate or combine with larger entities such as hospitals, health systems, group practices or physician \nhospital organizations.\n \nIn many cases, purchasing decisions for consolidated groups\n \nare made at a centralized or \nprofessional staff level; however, orders are delivered to the practitioners’ offices. \nWe \nbelieve that consolidation within the industry will continue to\n \nresult in a number of distributors, particularly \nthose with limited financial, operating and marketing resources, seeking to\n \ncombine with larger companies that can \nprovide growth opportunities.\n \nThis consolidation also may continue to result in distributors seeking\n \nto acquire \ncompanies that can enhance their current product and service offerings or provide\n \nopportunities to serve a broader \ncustomer base. \nOur approach to acquisitions and joint ventures has been to expand our role as\n \na provider of products and services \nto the health care industry.\n \nThis trend has resulted in our expansion into service areas that complement\n \nour existing \noperations and provide opportunities for us to develop synergies with, and thus strengthen, the acquired\n \nbusinesses. \nAs industry consolidation continues, we believe that we are positioned to\n \ncapitalize on this trend, as we believe we \nhave the ability to support increased sales through our existing infrastructure, although\n \nthere can be no assurances \nthat we will be able to successfully accomplish this.\n \nWe \nare focused on building relationships with decision makers \nwho do not reside in the office-based practitioner setting. \nAs the health care industry continues to change, we continually evaluate possible\n \ncandidates for joint venture or \nacquisition and intend to continue to seek opportunities to expand our\n \nrole as a provider of products and services to \nthe health care industry.\n \nThere can be no assurance that we will be able to successfully pursue\n \nany such \nopportunity or consummate any such transaction, if pursued.\n \nIf additional transactions are entered into or \nconsummated, we would incur merger and/or acquisition-related costs, and there\n \ncan be no assurance that the \nintegration efforts associated with any such transaction would be successful. \nAging Population and Other Market Influences\nThe health care products distribution industry continues to experience growth\n \ndue to the aging population, \nincreased health care awareness, the proliferation of medical technology\n \nand testing, new pharmacological \ntreatments, and expanded third-party insurance coverage, partially offset by the effects of unemployment\n \non \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n51 \ninsurance coverage.\n \nIn addition, the physician market continues to benefit from the\n \nshift of procedures and \ndiagnostic testing from acute care settings to alternate-care sites, particularly\n \nphysicians’ offices. \nAccording to the U.S. Census Bureau’s International Database, between 2024 and 2034, the 45 and older \npopulation is expected to grow by approximately 10%.\n \nBetween 2024 and 2044, this age group is expected to grow \nby approximately 18%.\n \nThis compares with expected total U.S. population growth\n \nrates of approximately 4% \nbetween 2024 and 2034 and approximately 6% between 2024 and 2044.\n \nAccording to the U.S. Census Bureau’s International Database, in 2024 there are approximately seven million \nAmericans aged 85 years or older, the segment of the population most in need of long-term care\n \nand elder-care \nservices.\n \nBy the year 2050, that number is projected to increase to approximately\n \n17 million.\n \nThe population aged \n65 to 84 years is projected to increase by approximately 18% during\n \nthe same period. \nAs a result of these market dynamics, annual expenditures for health care services\n \ncontinue to increase in the \nUnited States.\n \nWe \nbelieve that demand for our products and services will grow while\n \ncontinuing to be impacted by \ncurrent and future operating, economic, and industry conditions.\n \nThe Centers for Medicare and Medicaid Services \nor CMS published “National Health Expenditure Data” indicating that\n \ntotal national health care spending reached \napproximately $4.9 trillion in 2023, or 17.6% of the nation’s gross domestic product, the benchmark measure\n \nfor \nannual production of goods and services in the United States.\n \nHealth care spending is projected to reach \napproximately $7.7 trillion by 2032, or 19.7% of the nation’s projected gross domestic product. \nGovernment\n \nOur businesses are generally subject to numerous laws and regulations that could\n \nimpact our financial performance, \nand failure to comply with such laws or regulations could have a material adverse\n \neffect on our business.\n \nSee “\nItem \n1. Business – Governmental Regulations\n” for a discussion of laws, regulations and governmental activity\n \nthat may \naffect our results of operations and financial condition. \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n52 \nResults of Operations \nThe following tables summarize the significant components of our operating\n \nresults and cash flows for each of the \nthree years ended December 28, 2024, December 30, 2023, and December\n \n31, 2022 (in millions): \nYears\n \nEnded \nDecember 28, \nDecember 30, \nDecember 31, \n2024 \n2023 \n2022 \nOperating results: \nNet sales \n$ \n12,673 \n$ \n12,339 \n$ \n12,647 \nCost of sales \n8,657 \n8,479 \n8,816 \nGross profit\n \n4,016 \n3,860 \n3,831 \nOperating expenses: \nSelling, general and administrative\n \n3,034 \n2,956 \n2,771 \nDepreciation and amortization \n251 \n209 \n182 \nRestructuring and integration costs \n110 \n80 \n131 \nOperating income \n$ \n621 \n$ \n615 \n$ \n747 \nOther expense, net\n \n$ \n(108) \n$ \n(73) \n$ \n(26) \nIncome taxes \n(128) \n(120) \n(170) \nNet income \n398 \n436 \n566 \nNet income attributable to Henry Schein, Inc. \n390 \n416 \n538 \nYears\n \nEnded \nDecember 28, \nDecember 30, \nDecember 31, \n2024 \n2023 \n2022 \nCash flows:\n \nNet cash provided by operating activities \n$ \n848 \n$ \n500 \n$ \n602 \nNet cash used in investing activities \n(430) \n(1,135) \n(276) \nNet cash provided by (used in) financing activities \n(510) \n701 \n(315) \n\n\n\n\n\n\n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n53 \nPlans of Restructuring and Integration Costs\nOn August 6, 2024, we committed to a new restructuring plan (the “2024\n \nPlan”) to integrate recent acquisitions, \nright-size operations and further increase efficiencies.\n \nDuring the year ended December 28, 2024, we recorded \nrestructuring charges associated with the 2024 Plan of $73 million, which primarily\n \nrelated to severance and \nemployee-related costs, accelerated amortization of right-of-use\n \nlease assets and fixed assets, impairment of \nintangible assets related to the disposal of a portion of a business\n \nand other exit costs.\n \nWe expect to record \nrestructuring charges associated with the 2024 Plan in 2025; however an estimate\n \nof the amount of these charges \nhas not yet been determined. \nDuring the year ended December 28, 2024, in connection with the 2024 Plan,\n \nwe recorded an impairment of \ngoodwill and intangible assets of $13 million related to the disposal of a portion\n \nof a business.\n \nThis impairment is \nincluded in the $73 million of restructuring charges discussed above and related\n \nto the Global Specialty Products \nsegment. \nOn August 1, 2022, we committed to a restructuring plan (the “2022\n \nPlan”) focused on funding the priorities of the \nBOLD+1 strategic plan, streamlining operations and other initiatives to\n \nincrease efficiency.\n \nThe 2022 Plan has \nbeen completed as of July 31, 2024.\n \nDuring the years ended December 28, 2024, December\n \n30, 2023, and \nDecember 31, 2022, in connection with our 2022 Plan, we recorded restructuring\n \ncosts of $37 million, $80 million, \nand $128 million, respectively.\n \nThe restructuring costs for these periods primarily related to\n \nseverance and \nemployee-related costs, accelerated amortization of right-of-use\n \nlease assets and fixed assets, impairment of \nintangible assets related to disposal of a U.S. business,\n \nand other exit costs.\n \nDuring the year ended December 30, 2023, in connection with the 2022 Plan,\n \nwe recorded an impairment of an \nintangible asset of $12 million related to disposal of a U.S. business.\n \nThis impairment is included in the $80 \nmillion of restructuring costs discussed above and related to the Global Specialty\n \nProducts segment.\n \nThe disposal \nwas completed during the first quarter of 2024.\n \nDuring the year ended December 31, 2022, in connection with the 2022 Plan,\n \nwe vacated one of the buildings at our \ncorporate headquarters in Melville, New York, which resulted in an accelerated amortization of a right-of-use lease \nasset of $34 million.\n \nWe also initiated the disposal of a non-profitable U.S. business within the Global Specialty \nProducts segment and recorded related costs of $49 million, which primarily\n \nconsisted of impairment of intangible \nassets and goodwill, inventory impairment, and severance and employee-related\n \ncosts, which are included in the \nGlobal Specialty Products segment.\n \nThese costs are included in the $128 million of restructuring\n \ncharges discussed \nabove.\n \nThe disposal was completed during the first quarter of 2023.\n \nOn August 26, 2022, we acquired Midway Dental Supply.\n \nIn connection with this acquisition, during the year \nended December 31, 2022, we recorded integration costs of $3 million\n \nrelated to one-time employee and other \ncosts, as well as restructuring charges of $9 million, which are included in the\n \n$128 million of restructuring charges \ndiscussed above.\n \nThe integration and restructuring costs related to Midway Dental\n \nSupply are recorded in the \nGlobal Distribution and Value-Added Services segment. \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n54 \n2024 Compared to 2023 \nNote: Percentages for Net Sales; Gross Profit; Operating Expenses; Other\n \nExpense, Net; and Income Taxes are \nbased on actual values and may not recalculate due to rounding. \nDuring the fourth quarter of our fiscal year ended December 28, 2024,\n \nwe revised our reportable segments to align \nwith how the Chairman and Chief Executive Officer manages the business, assesses\n \nperformance and allocates \nresources.\n \nOur revised reportable segments now consist of: (i) Global Distribution\n \nand Value\n \n-Added Services; (ii) \nGlobal Specialty Products; and (iii) Global Technology.\n \nAll prior comparative segment information has been recast \nto reflect our new segment structure.\n \nNet Sales \nNet sales by reportable segment and by major product or service type were\n \nas follows: \n% of \n% of \nIncrease / (Decrease) \n2024 \nTotal \n2023 \nTotal \n$ \n% \nGlobal Distribution and Value\n \n-Added Services \nGlobal Dental merchandise \n(1)\n$ \n4,727 \n37.3 \n% \n$ \n4,787 \n38.8 \n% \n$ \n(60) \n(1.3) \n% \nGlobal Dental equipment \n(2)\n1,719 \n13.6 \n1,671 \n13.5 \n48 \n2.9 \nGlobal Value\n \n-added services \n(3)\n233 \n1.8 \n191 \n1.6 \n42 \n21.5 \nGlobal Dental \n6,679 \n52.7 \n6,649 \n53.9 \n30 \n0.4 \nGlobal Medical \n(4)\n4,081 \n32.2 \n3,912 \n31.7 \n169 \n4.3 \nTotal Global Distribution and Value\n \n-Added Services \n10,760 \n84.9 \n10,561 \n85.6 \n199 \n1.9 \nGlobal Specialty Products \n(5)\n1,446 \n11.4 \n1,331 \n10.8 \n115 \n8.7 \nGlobal Technology \n(6)\n630 \n5.0 \n602 \n4.9 \n28 \n4.7 \nEliminations \n(163) \n(1.3) \n(155) \n(1.3) \n(8) \nn/a \nTotal\n \n$ \n12,673 \n100.0 \n$ \n12,339 \n100.0 \n$ \n334 \n2.7 \n(1)\nIncludes infection-control products, handpieces, preventatives, impression materials, composites, anesthetics, teeth, dental \nimplants, gypsum, acrylics, articulators, abrasives, PPE products,\n \nand our own corporate brand of consumable merchandise. \n(2)\nIncludes dental chairs, delivery units and lights, digital dental laboratories, X-ray supplies and equipment, equipment repair and \nhigh-tech and digital restoration equipment. \n(3)\nConsists of financial services on a non-recourse basis, continuing education services for practitioners, consulting and other services. \n(4)\nIncludes branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray \nproducts, equipment, PPE products and vitamins. \n(5)\nIncludes manufacturing, marketing and sales of dental implant and biomaterial products; and endodontic, orthodontic and \northopedic products and other health care-related products and services. \n(6)\nConsists of practice management software, e-services, and other products, which are distributed to health care providers. \nThe components of our sales growth/(decline) were as follows: \nLocal Currency Growth/(Decline) \nTotal Local \nCurrency \nGrowth/(Decline) \nForeign \nExchange \nImpact \nTotal Sales \nGrowth/(Decline) \nLocal Internal \nGrowth \nAcquisition \nGrowth \nGlobal Distribution and Value\n \n-Added Services \nGlobal Dental Merchandise \n(1.2) \n% \n0.2 \n% \n(1.0) \n% \n(0.3) \n% \n(1.3) \n% \nGlobal Dental Equipment \n2.7 \n0.3 \n3.0 \n(0.1) \n2.9 \nGlobal Value\n \n-added services \n0.4 \n21.4 \n21.8 \n(0.3) \n21.5 \nGlobal Dental \n(0.2) \n0.9 \n0.7 \n(0.3) \n0.4 \nGlobal Medical \n(1.2) \n5.5 \n4.3 \n- \n4.3 \nTotal Global Distribution and Value\n \n-Added Services \n(0.6) \n2.6 \n2.0 \n(0.1) \n1.9 \nGlobal Specialty Products\n \n0.1 \n9.1 \n9.2 \n(0.5) \n8.7 \nGlobal Technology \n2.4 \n2.0 \n4.4 \n0.3 \n4.7 \nTotal \n(0.4) \n3.3 \n2.9 \n(0.2) \n2.7 \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n55 \nGlobal Sales \nGlobal net sales for the year ended December 28, 2024 increased 2.7%.\n \nThe components of sales growth are \npresented in the table above. \nThe 0.4% decrease in our internally generated local currency sales was primarily\n \nattributable to the migration to \nlower priced products and the challenging economic environment in\n \ncertain markets and lower sales of PPE \nproducts and COVID-19 test kits.\n \nFor the year ended December 28, 2024, the estimated increase in\n \ninternally \ngenerated local currency sales, excluding PPE products and COVID-19\n \ntest kits, was 0.3%. \nGlobal Distribution and Value-Added Services Sales \nGlobal Distribution and Value-Added Services net sales for the year ended December 28, 2024 increased 1.9%.\n \nThe components of our sales increase are presented in the table\n \nabove.\n \nThe 0.2% decrease in internally generated local currency dental sales was primarily\n \ndue to the migration to lower \npriced dental merchandise products and a challenging economic environment\n \nin certain markets, and lower sales of \nPPE products.\n \nThe decrease was partially offset by sales growth in traditional equipment and parts and\n \nservices in \nthe United States and sales growth in digital equipment in our international\n \nmarkets, partially offset by lower sales \nof digital equipment in the United States and declines in sales of\n \ntraditional equipment in certain international \nmarkets.\n \nThe growth in traditional equipment benefited from installation\n \ndelays during the fourth quarter of 2023 \nafter the cyber incident. \nThe 1.2% decrease in internally generated local currency medical sales reflects\n \nthe conversion of certain \npharmaceutical products to lower priced generics, and lower sales of PPE\n \nproducts,\n \nCOVID-19 test kits and \ninfluenza vaccines, partially offset by strong sales of point-of-care diagnostics including\n \nmulti-assay flu/COVID \ncombination test kits. \nThe acquisition growth in medical sales was attributable to our expansion\n \nin the Home Solutions market, including \nthe acquisition of Shield Healthcare during the year ended December\n \n30, 2023.\n \nThe acquisition growth in value-\nadded services within dental sales was attributable primarily to an acquisition\n \nof a practice transitions business in \n2023. \nWe estimate that sales of PPE products and COVID-19 test kits were approximately $622\n \nmillion for the year \nended December 28, 2024 as compared to $710 million for the year ended\n \nDecember 30, 2023 representing an \nestimated decrease of $88 million.\n \nThe estimated $88 million net decrease in sales of PPE products\n \nand COVID-19 \ntest kits represents 5.8% of Global Distribution and Value-Added Services\nnet sales for the year ended December \n28, 2024, and was primarily due to lower glove prices and reduced demand\n \nfollowing the cyber incident.\n \nThe \nestimated increase in the segment’s internally generated local currency sales, excluding PPE products and COVID-\n19 test kits, was 0.3%.\nGlobal Specialty Products\nGlobal Specialty Products net sales for the year ended December\n \n28, 2024 increased\n \n8.7%.\n \nThe components of our \nsales increase are presented in the table above. \nThe internally generated local currency sales were relatively flat due to implant\n \nsales growth in certain international \nmarkets and growth in endodontics sales in the United States and\n \ninternational markets, offset by a decline in \nimplant sales in the United States and lower orthodontic sales.\n \nThe increase in local currency Global Specialty \nProducts sales was attributable to the acquisitions of TriMed during the year ended December 28, 2024,\n \nand \nBiotech Dental and S.I.N. Implant System during the year ended December\n \n30, 2023. \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n56 \nGlobal Technology \nGlobal Technology net sales for the year ended December 28, 2024 increased 4.7%.\n \nThe components of sales \ngrowth are presented in the table above. \nThe internally generated local currency increase of 2.4% in Global Technology sales was primarily attributable to a \ncontinued increase in the number of cloud-based users of our practice management\n \nsoftware and an increase in \nrevenue cycle management solutions and our analytical products. \nGross Profit \nGross profit and gross margin percentages by segment and in total were as follows: \nGross \nGross \nIncrease / (Decrease) \n2024 \nMargin % \n2023 \nMargin % \n$ \n% \nGlobal Distribution and Value\n \n-Added Services \n$ \n2,776 \n25.8 \n% \n$ \n2,699 \n25.6 \n% \n$ \n77 \n3.2 \n% \nGlobal Specialty Products \n802 \n55.4 \n720 \n54.1 \n82 \n11.3 \nGlobal Technology \n424 \n67.4 \n417 \n69.2 \n7 \n1.9 \nCorporate \n14 \nn/a \n24 \nn/a \n(10) \n(41.4) \nTotal\n \n$ \n4,016 \n31.7 \n$ \n3,860 \n31.3 \n$ \n156 \n4.1 \nAs a result of different practices of categorizing costs associated with distribution networks\n \nthroughout our \nindustry, our gross margins may not necessarily be comparable to other distribution companies.\n \nGross margin \npercentages vary between our segments.\n \nWe realize substantially higher gross margin from sales of products that \nwe develop and manufacture within our Global Specialty Products segment\n \ncompared to gross margin from sales of \nproducts that we distribute within our Global Distribution and Value-Added Services segment.\n \nWithin our Global \nTechnology segment, higher gross margins result from us being both the developer and seller of software products \nand services.\n \nWithin our Global Distribution and Value\n \n-Added Services segment, gross profit margins may vary between the \nperiods as a result of the changes in the mix of products sold as well as\n \nchanges in our customer mix.\n \nWith respect \nto customer mix, sales to our large-group customers are typically completed at lower gross\n \nmargins due to the \nhigher volumes sold as opposed to the gross margin on sales to office-based practitioners, who normally\n \npurchase \nlower volumes.\n \nThe increase in Global Distribution and Value-Added Services gross profit for the year ended December 28, 2024 \ncompared to the prior-year-period is due to acquisitions and margin expansion providing a favorable impact\n \nof sales \nmix of higher-margin products. \nThe increase in Global Specialty Products gross profit reflects increased\n \nsales volume and higher gross profit from \ninternally generated sales and gross profit from acquisitions.\n \nThe increase in gross margin rates was due to product \nmix.\n \nThe increase in Global Technology gross profit is the result of a higher gross profit from internally generated sales \nand gross profit from acquisitions.\n \nThe decrease in gross margin rates was due to increased vendor costs and \nproduct mix. \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n57 \nOperating Expenses \nOperating expenses (consisting of selling, general and administrative\n \nexpenses; depreciation and amortization; and \nrestructuring and integration costs) by segment were as follows: \n% of \n% of \nRespective \nRespective \nIncrease / (Decrease) \n2024 \nNet Sales \n2023 \nNet Sales \n$ \n% \nGlobal Distribution and Value\n \n-Added Services \n$ \n2,080 \n19.3 \n% \n$ \n2,034 \n19.3 \n% \n$ \n46 \n2.3 \n% \nGlobal Specialty Products \n624 \n43.2 \n545 \n41.0 \n79 \n14.4 \nGlobal Technology \n272 \n43.2 \n275 \n45.6 \n(3) \n(0.8) \nCorporate \n91 \nn/a \n116 \nn/a \n(25) \n(22.1) \n3,067 \n24.2 \n2,970 \n24.1 \n97 \n3.3 \nAdjustments \n(1)\n328 \nn/a \n275 \nn/a \n53 \nn/a \nTotal operating expenses \n$ \n3,395 \n26.8 \n$ \n3,245 \n26.3 \n$ \n150 \n4.6 \n(1)\nAdjustments represent items excluded from segment operating income to enable comparison of financial results between periods.\n \nThese items may vary independently of business performance.\n \nPlease see \nNote 4 – Segment and Geographic Data\n.\n \nThese \nadjustments (current year vs. prior year) consist of (i) acquisition intangible amortization ($184 million vs. $150 million); (ii) \nrestructuring costs ($110 million vs. $80 million); (iii) changes in contingent consideration ($45 million vs. $0 million); (iv) cyber \nincident third-party advisory expenses, net of insurance proceeds ($31 million net proceeds vs. $11 million net expenses); (v) \nimpairment of capitalized assets ($12 million vs. $27 million); (vi) impairment of intangible assets ($0 million vs. $7 million); (vii) \nlitigation settlements ($6 million vs. $0 million); and (viii) costs associated with shareholder advisory matters ($2 million vs. $0 \nmillion).\n \nThe net increase in operating expenses is attributable to the following: \nOperating Costs \n(excluding \nacquisitions) \nAcquisitions \nAdjustments \nTotal \nGlobal Distribution and Value\n \n-Added Services \n$ \n(23) \n$ \n69 \n$ \n- \n$ \n46 \nGlobal Specialty Products \n9 \n70 \n- \n79 \nGlobal Technology \n(8) \n5 \n- \n(3) \nCorporate \n(25) \n- \n- \n(25) \n(47) \n144 \n- \n97 \nAdjustments \n- \n- \n53 \n53 \nTotal operating expenses \n$ \n(47) \n$ \n144 \n$ \n53 \n$ \n150 \nThe components of the net increase in total operating expenses are presented\n \nin the table above.\n \nThe decrease in \noperating costs (excluding acquisitions) during the year ended December 28,\n \n2024 included cost savings from our \nrestructuring activities and reflected a gain of $19 million related to the remeasurement\n \nto fair value of a previously \nheld equity investment within our Global Distribution and Value-Added Services segment. \nOther Expense, Net \nOther expense, net was as follows: \nVariance \n2024 \n2023 \n$ \n% \nInterest income\n \n$ \n24 \n$ \n17 \n$ \n7 \n39.8 \n% \nInterest expense\n \n(131) \n(87) \n(44) \n(51.7) \nOther, net\n \n(1) \n(3) \n2 \nn/a \nOther expense, net\n \n$ \n(108) \n$ \n(73) \n$ \n(35) \n(49.3) \nInterest income increased primarily due to increased interest rates.\n \nInterest expense increased primarily due to \nincreased borrowings and increased interest rates. \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n58 \nIncome Taxes\nOur effective tax rate was 24.9% for the year ended December 28, 2024, compared to 22.1%\n \nfor the prior year \nperiod.\n \nThe difference between our effective and federal statutory tax rates primarily relates to state\n \nand foreign \nincome taxes and interest expense. \nThe Organization of Economic Co-Operation and Development (OECD) issued\n \ntechnical and administrative \nguidance on Pillar Two rules in December 2021, which provides for a global minimum tax rate on the earnings of \nlarge multinational businesses on a country-by-country basis.\n \nEffective January 1, 2024, the minimum global tax \nrate is 15% for various jurisdictions pursuant to the Pillar Two rules.\n \nFuture tax reform resulting from these \ndevelopments may result in changes to long-standing tax principles, which\n \nmay adversely impact our effective tax \nrate going forward or result in higher cash tax liabilities.\n \nAs of December 28, 2024,\n \nthe impact of the Pillar Two \nrules to our financial statements was immaterial. \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n59 \n2023 Compared to 2022 \nDiscussion of the results of operations for the year ended December\n \n30, 2023 as compared to December 31, 2022 \nwas included in Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results\n \nof \nOperations” in the Company’s Form 10-K for the year ended December 30, 2023, as filed with the SEC on \nFebruary 28, 2024. During the fourth quarter of our fiscal year ended\n \nDecember 28, 2024, we revised our reportable \nsegments to align with how the Chairman and Chief Executive Officer manages\n \nthe business, assesses performance \nand allocates resources.\n \nA discussion of the results of operations for the year ended\n \nDecember 30, 2023 as \ncompared to December 31, 2022 for net sales and segment adjusted operating\n \nincome based on the realigned \nsegments is presented below. \nNote: Percentages for Net Sales; Gross Profit; Operating Expenses; Other\n \nExpense, Net; and Income Taxes are \nbased on actual values and may not recalculate due to rounding. \nNet Sales \nNet sales were as follows: \n% of \n% of \nIncrease / (Decrease) \n2023 \nTotal \n2022 \nTotal \n$ \n% \nGlobal Distribution and Value\n \n-Added Services \nGlobal Dental merchandise \n(1)\n$ \n4,787 \n38.8 \n% \n$ \n4,763 \n37.7 \n% \n$ \n24 \n0.5 \n% \nGlobal Dental equipment \n(2)\n1,671 \n13.5 \n1,715 \n13.5 \n(44) \n(2.6) \nGlobal Value\n \n-added services \n(3)\n191 \n1.6 \n151 \n1.2 \n40 \n27.1 \nGlobal Dental \n6,649 \n53.9 \n6,629 \n52.4 \n20 \n0.3 \nGlobal Medical \n(4)\n3,912 \n31.7 \n4,346 \n34.4 \n(434) \n(10.0) \nTotal Global Distribution and Value\n \n-Added Services \n10,561 \n85.6 \n10,975 \n86.8 \n(414) \n(3.8) \nGlobal Specialty Products \n(5)\n1,331 \n10.8 \n1,273 \n10.1 \n58 \n4.6 \nGlobal Technology \n(6)\n602 \n4.9 \n549 \n4.3 \n53 \n9.6 \nEliminations \n(155) \n(1.3) \n(150) \n(1.2) \n(5) \nn/a \nTotal\n \n$ \n12,339 \n100.0 \n$ \n12,647 \n100.0 \n$ \n(308) \n(2.4) \n(1)\nIncludes infection-control products, handpieces, preventatives, impression materials, composites, anesthetics, teeth, dental \nimplants, gypsum, acrylics, articulators, abrasives, PPE products,\n \nand our own corporate brand of consumable merchandise. \n(2)\nIncludes dental chairs, delivery units and lights, digital dental laboratories, X-ray supplies and equipment, equipment repair and \nhigh-tech and digital restoration equipment. \n(3)\nConsists of financial services on a non-recourse basis, continuing education services for practitioners, consulting and other services. \n(4)\nIncludes branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray \nproducts, equipment, PPE products and vitamins. \n(5)\nIncludes manufacturing, marketing and sales of dental implant and biomaterial products; and endodontic, orthodontic and \northopedic products and other health care-related products and services. \n(6)\nConsists of practice management software, e-services, and other products, which are distributed to health care providers. \nThe components of our sales growth/(decline) were as follows: \nLocal Currency Growth/(Decline) \nTotal Local \nCurrency \nGrowth/ \n(Decline) \nForeign \nExchange \nImpact \nTotal Sales \nGrowth/ \n(Decline) \nLocal \nInternal \nGrowth \nAcquisition \nGrowth \nExtra Week \nImpact \nGlobal Distribution and Value\n \n-Added Services \nGlobal Dental Merchandise \n(0.6) \n% \n2.2 \n% \n(1.0) \n% \n0.6 \n% \n(0.1) \n% \n0.5 \n% \nGlobal Dental Equipment \n(1.7) \n1.1 \n(2.1) \n(2.7) \n0.1 \n(2.6) \nGlobal Value\n \n-added services \n11.4 \n16.5 \n(0.7) \n27.2 \n(0.1) \n27.1 \nGlobal Dental \n(0.6) \n2.2 \n(1.3) \n0.3 \n- \n0.3 \nGlobal Medical \n(11.0) \n2.3 \n(1.3) \n(10.0) \n- \n(10.0) \nTotal Global Distribution and Value\n \n-Added Services \n(4.7) \n2.2 \n(1.3) \n(3.8) \n- \n(3.8) \nGlobal Specialty Products\n \n(4.0) \n8.7 \n(1.0) \n3.7 \n0.9 \n4.6 \nGlobal Technology \n8.3 \n2.1 \n(0.8) \n9.6 \n- \n9.6 \nTotal \n(4.2) \n2.9 \n(1.2) \n(2.5) \n0.1 \n(2.4) \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n60 \nGlobal Sales \nWe report our results of operations on a 52 or 53 weeks per fiscal year basis ending on the last Saturday of \nDecember.\n \nThe year ended December 30, 2023 consisted of 52 weeks, and\n \nthe year ended December 31, 2022 \nconsisted of 53 weeks,\n \nresulting in an extra week of sales. \nGlobal net sales for the year ended December 30, 2023 decreased 2.4%.\n \nThe components of our sales decline are \npresented in the table above.\n \nThe 4.2% decrease in our internally generated local currency sales was primarily\n \nattributable to a decrease in sales \nof PPE products and COVID-19 test kits.\n \nFor the nine months ended September 30, 2023, the estimated\n \nincrease in \ninternally generated local currency sales, excluding PPE products\n \nand COVID-19 test kits, was 3.5%.\n \nHowever, as \na result of the adverse impact of the 2023 cyber incident during the quarter ended\n \nDecember 30, 2023, our \ninternally generated local currency sales, excluding sales of PPE products\n \nand COVID-19 test kits, on a full year \nbasis were flat compared to the prior year. \nGlobal Distribution and Value-Added Services Sales \nGlobal Distribution and Value-Added Services net sales for the year ended December 30, 2023 decreased 3.8%.\n \nThe components of our sales decline are presented in the table above.\n \nThe 0.6% decrease in internally generated local currency dental sales was attributable\n \nto a decrease in sales of \ndental merchandise and dental equipment as a result of the adverse\n \nimpact of the 2023 cyber incident. \nThe 11.0% decrease in internally generated local currency medical sales is primarily attributable\n \nto the impact of \nthe 2023 cyber incident and to lower sales of PPE products and COVID-19\n \ntest kits and other point-of-care \ndiagnostic products. \nThe acquisition growth in medical sales was attributable to our expansion\n \nin the Home Solutions market, including \nthe acquisition of Shield Healthcare during the year ended December\n \n30, 2023.\n \nThe acquisition growth in value-\nadded services was attributable primarily to an acquisition of a practice\n \ntransitions business in 2023. \nThe increase in internally generated local currency value-added services\n \nsales is attributable to an increase in our \ndental billing solutions, partially offset by the expiration, during the year ended\n \nDecember 31, 2022, of a modestly \nprofitable government contract in one of our value-added services businesses.\n \nWe estimate that sales of PPE products and COVID-19 test kits were approximately $710\n \nmillion for the year \nended December 30, 2023\n \nas compared to $1,238 million for the year ended December 31, 2022\n \nrepresenting an \nestimated decrease of $528 million.\n \nThe estimated $528 million net decrease in sales of PPE products\n \nand COVID-\n19 test kits represents 5.0%\n \nof Global Distribution and Value-Added Services net sales for the year ended \nDecember 30, 2023 and was primarily due to lower market prices and loss of\n \ndemand during the 2023 cyber \nincident.\n \nExcluding PPE products and COVID-19 test kits, our internally\n \ngenerated local currency sales were flat. \nGlobal Specialty Products \nGlobal Specialty Products net sales for the year ended December 30, 2023\n \nincreased 4.6%.\n \nThe components of \nsales increase are presented in the table above. \nThe decrease in internally generated local currency sales was primarily\n \nattributable to lower sales in our \northodontics business,\n \npartially impacted by a patent expiration and the October 2023\n \ncyber incident and declines in \ncertain other health care related consumable merchandise products. \nThe acquisition growth in Global Specialty Products sales was attributable\n \nto the acquisitions of Biotech Dental and \nS.I.N. Implant system during the year ended December 30, 2023. \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n61 \nGlobal Technology \nGlobal Technology net sales for the year ended December 30, 2023 increased 9.6%.\n \nThe components of our sales \ngrowth are presented in the table above.\n \nDuring the year ended December 30, 2023, the trend for sales of practice \nmanagement software growth remained strong as we continued to\n \nincrease the number of cloud-based users.\n \nWe \nalso experienced increased demand for our revenue cycle management solutions\n \nand our analytical products.\n \nThis \nsegment of our business was not directly affected by the 2023 cyber\n \nincident in the fourth quarter. \nGross Profit \nGross profit and gross margin percentages by reportable segment were as follows: \nGross \nGross \nIncrease / (Decrease) \n2023 \nMargin % \n2022 \nMargin % \n$ \n% \nGlobal Distribution and Value\n \n-Added Services \n$ \n2,699 \n25.6 \n% \n$ \n2,769 \n25.2 \n% \n$ \n(70) \n(2.5) \n% \nGlobal Specialty Products \n720 \n54.1 \n678 \n53.3 \n42 \n6.3 \nGlobal Technology \n417 \n67.4 \n375 \n69.2 \n42 \n11.3 \nCorporate \n24 \nn/a \n9 \nn/a \n15 \n152.9 \nTotal\n \n$ \n3,860 \n31.7 \n$ \n3,831 \n31.3 \n$ \n29 \n0.8 \nAs a result of different practices of categorizing costs associated with distribution networks\n \nthroughout our \nindustry, our gross margins may not necessarily be comparable to other distribution companies.\n \nGross margin \npercentages vary between our segments.\n \nWe realize substantially higher gross margin from sales of products that \nwe develop and manufacture within our Global Specialty Products segment\n \ncompared to gross margin from sales of \nproducts that we distribute within our Global Distribution and Value-Added Services segment.\n \nWithin our Global \nTechnology segment, higher gross margins result from us being both the developer and seller of software products \nand services.\n \nWithin our Global Distribution and Value\n \n-Added Services segment, gross profit margins may vary between the \nperiods as a result of the changes in the mix of products sold as well as\n \nchanges in our customer mix.\n \nFor example, \nsales of our corporate brand and certain specialty products achieve\n \ngross profit margins that are higher than average \ntotal gross profit margins of all products.\n \nWith respect to customer mix, sales to our large-group customers are \ntypically completed at lower gross margins due to the higher volumes sold as opposed\n \nto the gross margin on sales \nto office-based practitioners, who normally purchase lower volumes.\n \nThe decrease in Global Distribution and Value-Added Services gross profit for the year ended December 30, 2023 \ncompared to the prior year was due to the 2023 cyber incident and a\n \nreduction in sales of PPE products and \nCOVID-19 test kits, partially offset by additional gross profit from acquisitions. \nThe increase in Global Specialty Products gross profit is primarily attributable\n \nto gross profit from our acquisitions \noffset by lower gross profit from our orthodontics business and certain other health\n \ncare related consumable \nmerchandise products.\n \nThe increase in gross margin rates was due to a favorable impact of sales mix. \nThe increase in Global Technology gross profit reflects increased local currency revenues and additional gross \nprofit from acquisitions. \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n62 \nOperating Expenses \nOperating expenses (consisting of selling, general and administrative\n \nexpenses; depreciation and amortization, \nrestructuring and integration costs) by segment were as follows: \n% of \n% of \nRespective \nRespective \nIncrease / (Decrease) \n2023 \nNet Sales \n2022 \nNet Sales \n$ \n% \nGlobal Distribution and Value\n \n-Added Services \n$ \n2,034 \n19.3 \n% \n$ \n1,936 \n17.6 \n% \n$ \n98 \n5.0 \n% \nGlobal Specialty Products \n545 \n41.0 \n486 \n38.2 \n59 \n12.3 \nGlobal Technology \n275 \n45.6 \n250 \n45.4 \n25 \n10.1 \nCorporate \n116 \nn/a \n121 \nn/a \n(5) \n(4.9) \n2,970 \n24.1 \n2,793 \n22.1 \n177 \n6.3 \nAdjustments \n(1)\n275 \nn/a \n291 \nn/a \n(16) \nn/a \nTotal operating expenses \n$ \n3,245 \n26.3 \n$ \n3,084 \n24.4 \n$ \n161 \n5.2 \n(1)\nAdjustments represent items excluded from segment operating income to enable comparison of financial results between periods.\n \nThese items may vary independently of business performance.\n \nPlease see \nNote 4 – Segment and Geographic Data\n.\n \nThese \nadjustments (current year vs. prior year) consist of (i) acquisition intangible amortization ($150 million vs. $126 million); (ii) \nrestructuring costs ($80 million vs. $131 million); (iii) cyber incident third-party advisory expenses ($11 million vs. $0 million); \n(iv) impairment of capitalized assets ($27 million vs. $0 million); and (v) impairment of intangible assets ($7 million vs. $34 \nmillion).\n \nThe net increase in operating expenses is attributable to the following: \nOperating Costs \n(excluding \nacquisitions) \nAcquisitions \nAdjustments \nTotal \nGlobal Distribution and Value\n \n-Added Services \n$ \n45 \n$ \n53 \n$ \n- \n$ \n98 \nGlobal Specialty Products \n(12) \n71 \n- \n59 \nGlobal Technology \n21 \n4 \n- \n25 \nCorporate \n(5) \n- \n- \n(5) \n49 \n128 \n- \n177 \nAdjustments \n- \n- \n(16) \n(16) \nTotal operating expenses \n$ \n49 \n$ \n128 \n$ \n(16) \n$ \n161 \nThe increase in operating costs (excluding acquisitions) during the year ended\n \nDecember 30, 2023 includes \nincreases in payroll and payroll related costs primarily in our Global\n \nDistribution and Value-Added Services \nsegment.\n \nDuring the year ended December 30, 2023, our operating expenses\n \nwere favorably impacted by the \nrecognition of a remeasurement gain of $18 million following an acquisition of\n \na controlling interest of a previously \nheld equity investment. \nOther Expense, Net \nOther expense, net was as follows: \nVariance \n2023 \n2022 \n$ \n% \nInterest income\n \n$ \n17 \n$ \n8 \n$ \n9 \n125.1 \n% \nInterest expense\n \n(87) \n(35) \n(52) \n(148.7) \nOther, net\n \n(3) \n1 \n(4) \nn/a \nOther expense, net\n \n$ \n(73) \n$ \n(26) \n$ \n(47) \n(172.9) \nInterest income increased primarily due to increased interest rates.\n \nInterest expense increased primarily due to \nincreased borrowings and increased interest rates. \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n63 \nIncome Taxes\nOur effective tax rate was 22.1% for the year ended December 30, 2023 compared to 23.5%\n \nfor the prior year.\n \nIn \neach year, the difference between our effective and federal statutory tax rates primarily relates to state and foreign \nincome taxes and interest expense. \nThe Organization of Economic Co-Operation and Development (OECD) issued\n \ntechnical and administrative \nguidance on Pillar Two rules in December 2021, which provides for a global minimum tax rate on the earnings of \nlarge multinational businesses on a country-by-country basis.\n \nEffective January 1, 2024, the minimum global tax \nrate is 15% for various jurisdictions pursuant to the Pillar Two rules.\n \nFuture tax reform resulting from these \ndevelopments may result in changes to long-standing tax principles, which\n \nmay adversely impact our effective tax \nrate going forward or result in higher cash tax liabilities.\n \nAs of December 30, 2023, the impact of the Pillar Two \nrules to our financial statements was immaterial. \n\n\n\n\n\n\n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n64 \nLiquidity and Capital Resources \nOur principal capital requirements have included funding of acquisitions, purchases\n \nof additional noncontrolling \ninterests, repayments of debt principal, the funding of working capital needs,\n \npurchases of fixed assets and \nrepurchases of common stock.\n \nWorking capital requirements generally result from increased sales, special \ninventory forward buy-in opportunities and payment terms for receivables\n \nand payables.\n \nHistorically, sales have \ntended to be stronger during the second half of the year and special inventory\n \nforward buy-in opportunities have \nbeen most prevalent just before the end of the year, and have caused our working capital requirements\n \nto be higher \nfrom the end of the third quarter to the end of the first quarter of\n \nthe following year. \nWe finance our business primarily through cash generated from our operations, revolving credit facilities and debt \nplacements.\n \nPlease see \nNote 14 – Debt\n \nfor further information.\n \nOur ability to generate sufficient cash flows from \noperations is dependent on the continued demand of our customers\n \nfor our products and services, and access to \nproducts and services from our suppliers. \nOur business requires a substantial investment in working capital, which\n \nis susceptible to fluctuations during the \nyear as a result of inventory purchase patterns and seasonal demands.\n \nInventory purchase activity is a function of \nsales activity, special inventory forward buy-in opportunities and our desired level of inventory. \nWe finance our business to provide adequate funding for at least 12 months.\n \nFunding requirements are based on \nforecasted profitability and working capital needs, which, on occasion, may\n \nchange.\n \nConsequently, we may change \nour funding structure to reflect any new requirements. \nWe believe that our cash and cash equivalents, our ability to access private debt markets and public equity markets, \nand our available funds under existing credit facilities provide us with\n \nsufficient liquidity to meet our currently \nforeseeable short-term and long-term capital needs. \nOur acquisition strategy is focused on investments in companies that\n \nadd new customers and sales teams, increase \nour geographic footprint (whether entering a new country, such as emerging markets, or building scale where we \nhave already invested in businesses), and finally, those that enable us to access new products and technologies. \nNet cash provided by operating activities was $848 million for the\n \nyear ended December 28, 2024, compared to net \ncash provided by operating activities of $500 million for the prior year.\n \nThe net change of $348 million was \nprimarily attributable to changes in working capital accounts (primarily accounts\n \nreceivable and inventory), and \nhigher cash net income.\n \nThe residual impacts of the 2023 cyber incident on our working\n \ncapital during the year \nended December 28, 2024 included an increase in operating cash flows from\n \naccounts receivable due to improved \ncollection levels and decreased cash flows from accounts payable and accrued\n \nexpenses resulting from previously \ndelayed payments. \nNet cash used in investing activities was $430 million for the year\n \nended December 28, 2024, compared to net cash \nused in investing activities of $1,135 million for the prior year.\n \nThe net change of $705 million was primarily \nattributable to decreased payments for equity investments and business\n \nacquisitions. \nNet cash used in financing activities was $510 million for the year\n \nended December 28, 2024, compared to net cash \nprovided by financing activities of $701 million for the prior year.\n \nThe net change of $1,211 million was primarily \ndue to decreased net borrowings from debt to finance our investments,\n \nincreased acquisitions of noncontrolling \ninterests in subsidiaries and increased repurchases of common stock. \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nTable of Contents\nIndex to Financial Statements\n65 \nThe following table summarizes selected measures of liquidity and capital\n \nresources: \nDecember 28, \nDecember 30, \n2024 \n2023 \nCash and cash equivalents\n \n$ \n122 \n$ \n171 \nWorking\n \ncapital \n(1)\n1,180 \n1,805 \nDebt: \nBank credit lines\n \n$ \n650 \n$ \n264 \nCurrent maturities of long-term debt\n \n56 \n150 \nLong-term debt\n \n1,830 \n1,937 \nTotal debt\n \n$ \n2,536 \n$ \n2,351 \nLeases: \nCurrent operating lease liabilities \n$ \n75 \n$ \n80 \nNon-current operating lease liabilities \n259 \n310 \n(1)\n \nIncludes $241 million and $284 million of certain accounts receivable which serve as security for U.S. trade accounts receivable \nsecuritization at December 28, 2024 and December 30, 2023, respectively. \nOur cash and cash equivalents consist of bank balances and investments\n \nin money market funds representing \novernight investments with a high degree of liquidity. \nAccounts receivable days sales outstanding and inventory turns \nOur accounts receivable days sales outstanding from operations\n \nincreased to 47.3 days as of December 28, 2024 \nfrom 46.2 days as of December 30, 2023.\n \nAdjusted for the impact of the cyber incident our days sales outstanding \ndecreased to 45.7 days as of December 28, 2024.\n \nDuring the years ended December 28, 2024 and December\n \n30, \n2023, we wrote off approximately $12 million and $16 million, respectively, of fully reserved accounts receivable \nagainst our trade receivable reserve.\n \nOur inventory turns from operations increased to 5.0 as of December\n \n28, 2024 \nfrom 4.5 as of December 30, 2023.\n \nOur working capital accounts may be impacted by current and\n \nfuture economic \nconditions. \nContractual obligations \nThe following table summarizes our contractual obligations related\n \nto fixed and variable rate long-term debt and \nfinance lease obligations, including interest (assuming a weighted\n \naverage interest rate of 4.88%), as well as \ninventory purchase commitments and operating lease obligations\n \nas of December 28, 2024: \nPayments due by period \n< 1 year \n2 - 3 years \n4 - 5 years \n> 5 years \nTotal \nContractual obligations: \nLong-term debt, including interest\n \n$ \n140 \n$ \n1,053 \n$ \n337 \n$ \n657 \n$ \n2,187 \nInventory purchase commitments\n \n9 \n5 \n- \n- \n14 \nOperating lease obligations\n \n87 \n130 \n80 \n81 \n378 \nTransition tax obligations\n \n24 \n- \n- \n- \n24 \nFinance lease obligations, including interest\n \n3 \n3 \n1 \n- \n7 \nTotal\n \n$ \n263 \n$ \n1,191 \n$ \n418 \n$ \n738 \n$ \n2,610 \nFor information relating to our debt please see \nNote 14 – Debt\n.\n \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n66 \nLeases \nWe have operating and finance leases for corporate offices, office space, distribution and other facilities, vehicles \nand certain equipment.\n \nOur leases have remaining terms of less than one year to approximately\n \n17 years, some of \nwhich may include options to extend the leases for up to 15 years.\n \nAs of December 28, 2024, our right-of-use \nassets related to operating leases were $293 million and our current and\n \nnon-current operating lease liabilities were \n$75 million and $259 million, respectively.\n \nPlease see \nNote 8 – Leases\n \nfor further information. \nStock Repurchases \nOn January 27, 2025, our Board authorized the repurchase of up\n \nto an additional $500 million in shares of our \ncommon stock. \nFrom March 3, 2003 through December 28, 2024, we repurchased $5.1\n \nbillion, or 95,814,454 shares, under our \ncommon stock repurchase programs, with $380 million available\n \nas of December 28, 2024 for future common stock \nshare repurchases.\n \nSubject to market conditions and other factors, we plan to continue\n \nto accelerate our share \nrepurchase activity. \nRedeemable Noncontrolling Interests \nSome minority stockholders in certain of our subsidiaries have the right,\n \nat certain times, to require us to acquire \ntheir ownership interest in those entities at fair value.\n \nAccounting Standards Codification Topic 480-10 is \napplicable for noncontrolling interests where we are or may be required\n \nto purchase all or a portion of the \noutstanding interest in a consolidated subsidiary from the noncontrolling\n \ninterest holder under the terms of a put \noption contained in contractual agreements.\n \nAs of December 28, 2024 and December 30, 2023, our balance\n \nfor \nredeemable noncontrolling interests was $806 million and $864 million,\n \nrespectively.\n \nPlease see \nNote 20 –\nRedeemable Noncontrolling Interests\n \nfor further information. \nUnrecognized tax benefits\n \nAs more fully disclosed in \nNote 15 – Income Taxes\n \nof “Notes to Consolidated Financial Statements,” we cannot \nreasonably estimate the timing of future cash flows related to our unrecognized\n \ntax benefits, including accrued \ninterest, of $108 million and $115 million as of December 28, 2024 and December 30, 2023, respectively.\n \nCritical Accounting Estimates\nOur accounting policies are described in \nNote 1 – Basis of Presentation and Significant Accounting Policies\n \nof the \nconsolidated financial statements.\n \nThe preparation of consolidated financial statements requires us\n \nto make \nestimates and judgments that affect the reported amounts of assets, liabilities, revenues\n \nand expenses and related \ndisclosures of contingent assets and liabilities.\n \nWe base our estimates on historical data, when available, \nexperience, industry and market trends, and on various other assumptions\n \nthat are believed to be reasonable under \nthe circumstances, the combined results of which form the basis for\n \nmaking judgments about the carrying values of \nassets and liabilities that are not readily apparent from other sources.\n \nWe believe that the estimates, judgments and \nassumptions upon which we rely are reasonable based upon information\n \navailable to us at the time that these \nestimates, judgments and assumptions are made.\n \nHowever, by their nature, estimates are subject to various \nassumptions and uncertainties.\n \nTherefore, reported results may differ from estimates and any such differences may \nbe material to our consolidated financial statements.\n \nWe believe that the following critical accounting estimates, which have been discussed with the Audit Committee \nof our Board, affect the significant estimates and judgments used in the preparation\n \nof our consolidated financial \nstatements: \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n67 \nInventories and Reserves\nInventories consist primarily of finished goods, raw materials and\n \nwork-in-process and are valued at the lower of \ncost or net realizable value.\n \nCost is determined by the weighted average method for merchandise and\n \nactual cost \nfor large equipment,\n \nhigh tech equipment and drop-shipments.\n \nWe include product costs, labor, and related fixed \nand variable overhead in the cost of inventory\n \nthat we manufacture.\n \nIn estimating carrying value of inventory, we \nconsider many factors including the condition and salability of the inventory\n \nby reviewing on-hand quantities, \nhistorical sales, forecasted sales and market and economic trends.\n \nBusiness Combinations \nThe estimated fair value of acquired identifiable intangible assets (i.e., customer\n \nrelationships and lists, trademarks \nand trade names, product development and non-compete agreements)\n \nis based on critical judgments and \nassumptions derived from analysis of market conditions, including discount\n \nrates, projected revenue growth rates \n(which are based on historical trends and assessment of financial projections),\n \nestimated customer attrition and \nprojected cash flows.\n \nThese assumptions are forward-looking and could be affected by future economic\n \nand market \nconditions.\n \nPlease see \nNote 5 – Business Acquisitions\n \nfor further discussion of our acquisitions. \nGoodwill \nGoodwill is subject to impairment analysis at least once annually as\n \nof the first day of our fourth quarter, or if an \nevent occurs or circumstances change that would more likely than\n \nnot reduce a reporting unit’s fair value below \ncarrying value.\n \nWe regard our reporting units to be our operating segments or one level below the operating \nsegments.\n \nGoodwill is allocated to such reporting units, for the purposes of\n \npreparing our impairment analyses, \nbased on a specific identification basis.\n \nApplication of the goodwill impairment test requires judgment, including\n \nthe identification of reporting units, \nassignment of assets and liabilities that are considered shared services\n \nto the reporting units, and ultimately the \ndetermination of the fair value of each reporting unit.\n \nThe fair value of each reporting unit is calculated by \napplying the discounted cash flow methodology and confirming with\n \na market approach.\n \nThere are inherent \nuncertainties, however, related to fair value models, the inputs and our judgments in applying them\n \nto this analysis.\n \nThe most significant inputs include estimation of detailed future cash flows based\n \non budget expectations, and \ndetermination of comparable companies to develop a weighted average\n \ncost of capital for each reporting unit.\n \nOn an annual basis, we prepare financial projections.\n \nThese projections are based on input from our leadership and \nare presented annually to our Board.\n \nInfluences on this year's forecasted financial information and\n \nthe fair value \nmodel include: the impact of planned strategic initiatives, the continued\n \nintegration of recent acquisitions and \noverall market conditions.\n \nThe estimates used to calculate the fair value of a reporting unit change\n \nfrom year to \nyear based on operating results, market conditions, and other factors.\nDuring the year ended December 28, 2024, we engaged third-party valuation\n \nspecialists to determine the relative \nfair value of our goodwill related to the revision of our reportable segments.\n \nOur management reviewed and \napproved this valuation. \nDuring the fourth quarter of our fiscal year ended December 28, 2024,\n \nwe revised our segment structure to align \nwith how our Chairman and Chief Executive Officer manages the business, assesses\n \nperformance and allocates \nresources.\n \nOur revised reportable segments now consist of: (i) Global Distribution\n \nand Value\n \n-Added Services; (ii) \nGlobal Specialty Products; and (iii) Global Technology.\n \nReporting units under the former structure were tested for \nimpairment, and no impairment was identified.\n \nAs a result of the realignment and the change in operating \nsegments, we reallocated goodwill to each of our new reporting units using\n \na relative fair value approach.\n \nBased on \nthe impairment test under the new structure, it was determined that the\n \nfair values of our reporting units more likely \nthan not exceeded their carrying values, resulting in no impairment.\n \nFor both the former and new structure \ngoodwill impairment tests as of September 30, 2024, the fair values of reporting\n \nunits were computed using the \nmethodology described above. \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n68 \nIn connection with our restructuring initiatives, during the year ended\n \nDecember 28, 2024, we recorded an $11 \nmillion impairment of goodwill in the Global Specialty Products segment,\n \nrelating to the disposal of a portion of a \nbusiness; such impairment was calculated based on the relative fair value of\n \ngoodwill.\n \nFor the year ended \nDecember 31, 2022, in connection with our restructuring activities, we\n \nrecorded a $20 million impairment of \ngoodwill, in the Global Specialty Products segment, relating to the disposal\n \nof an unprofitable business for which \nestimated fair value was lower than carrying value.\n \nApart from the above impairments identified in connection with\n \nour restructuring initiative, we did not record any \nadditional impairment during the years ended December 28, 2024, December\n \n30, 2023, and December 31, 2022.\n \nWe performed our annual quantitative testing for the remaining goodwill and the fair value of each of our reporting \nunits sufficiently exceeded the carrying values.\n \nDefinite-Lived Intangible Assets \nAnnually or if we identify an impairment indicator,\n \ndefinite-lived intangible assets such as non-compete \nagreements, trademarks, trade names, customer relationships and lists, and\n \nproduct development are reviewed for \nimpairment indicators.\n \nIf any impairment indicators exist, quantitative testing\n \nis performed on the asset. \nThe quantitative impairment model is a two-step test under which we\n \nfirst calculate the recoverability of the \ncarrying value by comparing the undiscounted projected cash flows associated\n \nwith the asset or asset group, \nincluding its estimated residual value, to the carrying amount.\n \nIf the cash flows associated with the asset or asset \ngroup are less than the carrying value, we perform a fair value assessment\n \nof the asset, or asset group.\n \nIf the \ncarrying amount is found to be greater than the fair value, we record an\n \nimpairment loss for the excess of book \nvalue over the fair value.\n \nIn addition, in all cases of an impairment review, we re-evaluate the remaining useful \nlives of the assets and modify them, as appropriate.\n \nAlthough we believe our judgments, estimates and/or \nassumptions used in estimating cash flows and determining fair value\n \nare reasonable, making material changes to \nsuch judgments, estimates and/or assumptions could materially affect such impairment\n \nanalyses and our financial \nresults.\n \nDuring the year ended December 28, 2024, we recorded $4 million of\n \nimpairment charges related to businesses in \nour Global Distribution and Value-Added Services segment.\n \nIt included $2 million of a trade name impairment, \ncalculated using the relative fair value, related to a disposal of a business,\n \nand $1 million related to trade name \nimpairment due to business integration in connection with our restructuring\n \ninitiatives.\n \nThe remaining $1 million \nimpairment charges related to trade names and non-compete agreements and were\n \ncalculated as the differences \nbetween the carrying values and the estimated fair values of the impaired\n \nintangible assets, using a discounted \nestimate of future cash flows. \n \nDuring the year ended December 30, 2023, we recorded $19 million of\n \nimpairment charges related to businesses in \nour Global Distribution and Value-Added Services segment, consisting of $7 million primarily related to customer \nlists and relationships attributable to lower than anticipated operating\n \nmargins in certain businesses, and a $12 \nmillion charge related to the planned exit of a business in connection with our restructuring\n \ninitiatives.\n \nThese \nimpairment charges were calculated as the differences between the carrying values and the\n \nestimated fair values of \nthe impaired intangible assets, using a discounted estimate of future\n \ncash flows. \nDuring the year ended December 31, 2022, we recorded $49 million of\n \nimpairment charges related to businesses in \nour Global Distribution and Value-Added Services segment, consisting of a $15 million charge related to the \ndisposal of an unprofitable business in connection with our restructuring\n \ninitiatives, and a $34 million charge \nrelated to customer lists and relationships attributable to customer attrition rates\n \nbeing higher than expected in \ncertain other Global Distribution and Value-Added Services businesses.\n \nThese impairment charges were calculated \nas the differences between the carrying values and the estimated fair values of\n \nthe impaired intangible assets, using \na discounted estimate of future cash flows. \nPlease see \nNote 16 – Plans of Restructuring and Integration Costs\n \nfor additional details. \n \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n69 \nRedeemable Noncontrolling Interests \nSome minority stockholders in certain of our consolidated subsidiaries have\n \nthe right, at certain times, to require us \nto acquire their ownership interest in those entities at fair value.\n \nThe redemption amounts have been estimated \nbased on recent transactions and/or implied multiples of earnings\n \nand, if such earnings and cash flows are not \nachieved, the value of the redeemable noncontrolling interests might be impacted.\n \nSee \nNote 1 – Basis of \nPresentation and Significant Accounting Policies\n \nand \nNote 20 – Redeemable Noncontrolling Interests\n \nfor additional \ninformation. \nIncome Tax \nWhen determining if the realization of a deferred tax asset is likely to assess\n \nthe need to record a valuation \nallowance, estimates and judgement are required.\n \nWe \nconsider all available evidence, both positive and negative, \nincluding estimated future taxable earnings, ongoing planning strategies,\n \nfuture reversals of existing temporary \ndifferences and historical operating results.\n \nAdditionally, changes to tax laws and statutory tax rates can have an \nimpact on our determination.\n \nWe \nevaluate the realizability of our deferred tax assets quarterly.\nAccounting Standards Codification Topic 740 prescribes the accounting for uncertainty in income taxes recognized \nin the financial statements in accordance with provisions contained within\n \nits guidance.\n \nThis topic prescribes a \nrecognition threshold and a measurement attribute for the financial statement\n \nrecognition and measurement of tax \npositions taken or expected to be taken in a tax return.\n \nFor those benefits to be recognized, a tax position must be \nmore likely than not to be sustained upon examination by the taxing authorities.\n \nThe amount recognized is \nmeasured as the largest amount of benefit that has a greater than 50% likelihood of being\n \nrealized upon ultimate \naudit settlement.\n \nIn the normal course of business, our tax returns are subject\n \nto examination by various taxing \nauthorities.\n \nSuch examinations may result in future tax and interest assessments\n \nby these taxing authorities for \nuncertain tax positions taken in respect of certain tax matters.\n \nPlease see \nNote 15 – Income Taxes\n \nfor further \ndiscussion. \nAccounting Standards Update\nFor a discussion of accounting standards updates that have been adopted\n \nor will be adopted in the future, please see \nNote 1 – Basis of Presentation and Significant Accounting Policies\n \nincluded under Item 8. \n\n\n\n\n\n\n\n\nTable of Contents\nIndex to Financial Statements\n70",
  "item2": null
}