{
  "source_file": "hst-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management’s Discussion and Analysis of Financial Condition and Results of Operations \nThe following discussion and analysis should be read in conjunction with the unaudited condensed consolidated financial statements and related notes included elsewhere in this report. Host Inc. operates as a self-managed and self-administered REIT. Host Inc. is the sole general partner of Host L.P. and holds approximately 99% of its partnership interests. Host L.P. is a limited partnership operating through an umbrella partnership structure. The remaining common OP units are owned by various unaffiliated limited partners. \nForward-Looking Statements \nIn this quarterly report on Form 10-Q, we make forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are identified by their use of terms and phrases such as “anticipate,” “believe,” “could,” “expect,” “may,” “intend,” “predict,” “project,” “plan,” “will,” “estimate” and other similar terms and phrases, including references to assumptions and forecasts of future results. Forward-looking statements are based on management’s current expectations and assumptions and are not guarantees of future performance. Forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause our actual results to differ materially from those anticipated at the time the forward-looking statements are made. \nThe following factors, among others, could cause actual results and future events to differ materially from those set forth or contemplated in the forward-looking statements: \n•\nthe effect on lodging demand of (i) changes in national and local economic and business conditions, including concerns about U.S. economic growth and the potential for an economic recession in the United States or globally, or as a result of recent economic uncertainty due to trade disputes, tariffs and other protection measures, the recent high level of inflation, elevated interest rates, global economic prospects, consumer confidence and the value of the U.S. dollar, and (ii) factors that may shape public perception of travel to a particular location, including natural disasters, such as the Maui wildfires in 2023 and Southern California wildfires in 2025, adverse weather events, such as Hurricane Ian in 2022 and Hurricanes Helene and Milton in 2024, or extreme precipitation, pandemics and other public health crises, such as the COVID-19 pandemic, and the occurrence or potential occurrence of terrorist attacks, all of which will affect occupancy rates at our hotels and the demand for hotel products and services; \n•\nrisks that U.S. immigration policies and border closings, visa processing times, travel restrictions or advisories, changes in energy prices or changes in foreign exchange rates will continue to suppress international travel to the United States generally or decrease the labor pool, and risks that the current travel imbalance (i.e., elevated international U.S. outbound travel combined with a decrease in inbound travel to the U.S.) may remain elevated relative to historic levels;\n•\nthe impact of geopolitical developments outside the U.S., such as large-scale wars or international conflicts, slowing global growth, or trade disputes, tariffs or other trade protection measures between the United States and its trading partners, all of which could cause economic volatility and affect global travel and lodging demand within the United States or result in supply chain disruptions; \n•\nvolatility in global financial and credit markets, which could materially adversely affect U.S. and global economic conditions, business activity, and lodging demand as well as negatively impact our ability to obtain financing and increase our borrowing costs; \n•\nfuture U.S. governmental action to address budget deficits through reductions in spending and similar austerity measures, as well as the impact of the U.S. government shutdown which began on October 1, 2025, all of which could materially adversely affect U.S. economic conditions, business activity, credit availability and borrowing costs (see also Part II, Item 1A. for further information on the risks relating to the U.S. federal government shutdown); \n•\noperating risks associated with the hotel business, including the effect of labor stoppages or strikes, increasing operating or labor costs, including increased labor costs in the recent inflationary environment, the ability of our managers to adequately staff our hotels as a result of shortages in labor, changes in immigration laws or their enforcement, and severance and furlough payments to hotel employees or changes in workplace rules that affect labor costs; \n•\nthe effect of rating agency downgrades of our debt securities or on the cost and availability of new debt financings; \n25\n•\nthe reduction in our operating flexibility and the limitation on our ability to incur debt, pay dividends and make distributions resulting from restrictive covenants in our debt agreements and other risks associated with the amount of our indebtedness or related to restrictive covenants in our debt agreements, including the risk that a default could occur; \n•\nour ability to maintain our hotels in a first-class manner, including meeting capital expenditures requirements, and the effect of renovations, including temporary closures, on our hotel occupancy and financial results; \n•\nthe ability of our hotels to compete effectively against other lodging businesses in the highly competitive markets in which we operate in areas such as access, location, quality of accommodations and room rate structures; \n•\nour ability to acquire or develop additional hotels and the risk that potential acquisitions or developments may not perform in accordance with our expectations; \n•\nthe ability to complete hotel renovations on schedule and on, or under, budget and the potential for increased costs and construction delays due to shortages of supplies as a result of supply chain disruptions; \n•\nrelationships with property managers and joint venture partners and our ability to realize the expected benefits of our joint ventures and other strategic relationships; \n•\nrisks associated with a single manager, Marriott International, managing a significant percentage of our hotels; \n•\nchanges in the desirability of the geographic regions of the hotels in our portfolio or in the travel patterns of hotel customers;\n•\ndecreases in the frequency of business travel that may result from hybrid or remote work environments and other changes to business operations, such as alternatives to in-person meetings, including virtual meetings hosted online or over private teleconferencing networks;\n•\nthe continued competition from third-party internet travel intermediaries in attracting and retaining customers, which compete with our hotels; \n•\nour ability to recover fully under our existing insurance policies for terrorist acts and natural disasters and our ability to maintain adequate or full replacement cost “all-risk” property insurance policies on our hotels on commercially reasonable terms; \n•\nthe effect of a data breach or significant disruption of hotel operator information technology networks as a result of cyber-attacks; \n•\nthe effects of tax legislative action and other changes in laws and regulations, or the interpretation thereof, including the need for compliance with new environmental and safety requirements; \n•\nchanges in taxes and government regulations that influence or set wages, hotel employee health care costs, prices, interest rates or construction and maintenance procedures and costs;\n•\nthe ability of Host Inc. and each of the REITs acquired, established or to be established by Host Inc. to continue to satisfy complex rules in order to qualify as REITs for U.S. federal income tax purposes and Host Inc.’s and Host L.P.’s ability and the ability of our subsidiaries, and similar entities to be acquired or established by us, to operate effectively within the limitations imposed by these rules; and\n•\nrisks associated with our ability to execute our dividend policy, including factors such as investment activity, operating results and the economic outlook, any or all of which may influence the decision of our board of directors as to whether to pay future dividends at levels previously disclosed or to use available cash to pay special dividends. \nWe undertake no obligation to publicly update forward-looking statements, whether as a result of new information, future events, or otherwise. Achievement of future results is subject to risks, uncertainties and potentially inaccurate assumptions, including those risk factors discussed in our Annual Report on Form 10-K for the year ended December 31, 2024 and in other filings with the Securities and Exchange Commission (“SEC”). We caution you not to place undue reliance on these forward-looking statements, which reflect our analysis only and speak as of the date of this report. Although we believe that the expectations reflected in such forward-looking statements are based upon reasonable assumptions, we can give no assurance that we will attain these expectations or that any deviations will not be material. \n26\nOperating Results and Outlook\n \nOperating Results\nThe following table reflects certain line items from our unaudited condensed consolidated statements of operations and significant operating statistics (in millions, except per share and hotel statistics): \nHistorical Income Statement Data:\nQuarter ended\nSeptember 30,\nYear-to-date ended\nSeptember 30,\n2025\n2024\nChange\n \n2025\n2024\nChange\n \nTotal revenues\n$\n1,331 \n$\n1,319 \n0.9\n%\n$\n4,511 \n$\n4,256 \n6.0\n%\nNet income\n163 \n84 \n94.0\n%\n639 \n598 \n6.9\n%\nOperating profit\n101 \n135 \n(25.2\n%)\n663 \n718 \n(7.7\n%)\nOperating profit margin under GAAP\n7.6\n%\n10.2\n%\n(260)\n bps\n14.7\n%\n16.9\n%\n(220)\n bps\nEBITDA\nre\n⁽¹⁾\n$\n314 \n$\n353 \n(11.0\n%)\n$\n1,313 \n$\n1,359 \n(3.4\n%)\nAdjusted EBITDA\nre\n⁽¹⁾\n319 \n330 \n(3.3\n%)\n1,329 \n1,300 \n2.2\n%\nDiluted earnings per common share\n0.23 \n0.12 \n91.7\n%\n0.91 \n0.84 \n8.3\n%\nNAREIT FFO per diluted share⁽¹⁾\n0.34 \n0.36 \n(5.6\n%)\n1.54 \n1.53 \n0.7\n%\nAdjusted FFO per diluted share⁽¹⁾\n0.35 \n0.36 \n(2.8\n%)\n1.56 \n1.55 \n0.6\n%\nComparable Hotel Data:\nQuarter ended\nSeptember 30,\nYear-to-date ended\nSeptember 30,\n2025\n2024\nChange\n \n2025\n2024\nChange\n \nComparable hotel revenues⁽¹⁾\n$\n1,293 \n$\n1,282 \n0.9\n%\n$\n4,388 \n$\n4,245 \n3.4\n%\nComparable hotel EBITDA⁽¹⁾\n309 \n313 \n(1.3\n%)\n1,283 \n1,258 \n2.0\n%\nComparable hotel EBITDA margin⁽¹⁾\n23.9\n%\n24.4\n%\n(50)\n bps\n29.2\n%\n29.6\n%\n(40)\n bps\nComparable hotel Total RevPAR⁽¹⁾\n$\n335.42 \n$\n332.67 \n0.8\n%\n$\n383.54 \n$\n369.71 \n3.7\n%\nComparable hotel RevPAR⁽¹⁾\n208.07 \n207.58 \n0.2\n%\n229.95 \n222.10 \n3.5\n%\n___________\n(1)\nEBITDA\nre,\n Adjusted EBITDA\nre\n, NAREIT FFO per diluted share and Adjusted FFO per diluted share and comparable hotel operating results (including hotel revenues and hotel EBITDA and margins) are non-GAAP financial measures within the meaning of the rules of the SEC. See “Non-GAAP Financial Measures” and \"Comparable Hotel Operating Statistics and Results\" for more information on these measures, including why we believe these supplemental measures are useful, reconciliations to the most directly comparable GAAP measure, and the limitations on the use of these supplemental measures. Additionally, comparable hotel results and statistics are based on 76 comparable hotels as of September 30, 2025 and include adjustments for non-comparable hotels, dispositions and acquisitions. See Comparable Hotel RevPAR Overview for results of the portfolio based on our ownership period, without these adjustments.\nRevenues\nTotal revenues increased $12 million, or 0.9%, and $255 million, or 6.0%, for the third quarter and year-to-date 2025, respectively, as compared to 2024. For the quarter, growth was moderate as continued strength in transient rates was mostly offset by weakness in group demand. Year-to-date, strong short-term transient demand has driven the RevPAR gains, while we continue to see increased out-of-room spend driving food and beverage and other revenues. The third quarter and year-to-date total revenues also benefited from the 2024 acquisitions of the 1 Hotel Nashville and Embassy Suites by Hilton Nashville Downtown, 1 Hotel Central Park and The Ritz-Carlton O'ahu, Turtle Bay (collectively, the \"2024 Acquisitions\"), partially offset by the 2025 dispositions of The Westin Cincinnati and Washington Marriott at Metro Center (collectively, the \"2025 Dispositions\"). Comparable hotel RevPAR increased 0.2% and 3.5% for the quarter and year-to-date 2025, respectively, primarily due to the increase in room rates and strong transient demand, along with the continuing recovery in Maui, which collectively offset a decline in group demand due to difficult comparisons to prior year due to the timing of holidays and planned renovation disruption.\n27\nComparable hotel Total RevPAR increased 0.8% and 3.7% for the third quarter and year-to-date of 2025, respectively, compared to 2024. For the quarter, the growth was led by our Atlanta, Maui and Oahu markets, with increases of 20.1%, 18.6% and 10.4%, respectively, compared to the third quarter of 2024. The outperformance in Atlanta compared to last year is primarily due to the completion of planned renovations that impacted the results in 2024, while Oahu saw increases in both rate and occupancy driven by strong group bookings, and Maui continued its recovery from the wildfires. These strong performances were partially offset by comparable hotel Total RevPAR declines in our Austin and New Orleans markets of 30.5% and 16.4%, respectively. Both markets were impacted by large-scale renovation projects at certain properties, while Austin was further impacted by the multi-year closure of the city's convention center that started earlier in 2025. At some of our larger markets, comparable hotel Total RevPAR increases in New York and San Francisco of 9.1% and 8.6%, respectively, due to strong citywides and transient demand, offset decreases in our Washington, D.C. and San Diego markets, of 12.9% and 9.9%, respectively, with both markets affected by large-scale renovation projects at certain properties.\nOperating profit\nFor the third quarter and year-to-date 2025, operating profit margin under GAAP was 7.6% and 14.7%, respectively, a decline of 260 basis points and 220 basis points compared to the same periods in 2024, primarily due to a $24 million and $92 million decrease in net gains on insurance settlements recognized during the quarter and year-to-date, respectively. Comparable hotel EBITDA margin was 23.9% and 29.2%, for the third quarter and year-to-date 2025, respectively, a decline of 50 basis points and 40 basis points. Both the third quarter and year-to-date 2025 were affected by an increase in wages expense. Year-to-date growth in room rates was able to offset those increases, but was further affected by a decrease in net gains on insurance settlements for comparable hotels of $21 million.\nNet income, Adjusted EBITDAre and Adjusted FFO per share\nNet income increased $79 million and $41 million for the quarter and year-to-date 2025, respectively, as recent acquisitions, improvements in operating results and a $122 million gain on asset sales in the third quarter offset the declines in net gains on insurance settlements noted above and increases in interest expense and income taxes. These changes led to an increase in diluted earnings per share of $0.11, or 91.7%, and $0.07, or 8.3%, for the quarter and year-to-date, respectively. Adjusted EBITDA\nre\n, which excludes gain on property insurance, gain on asset sale, depreciation, interest expense and taxes, decreased $11 million for the third quarter and increased $29 million year-to-date. For the quarter, improvements in revenues were offset by wage increases, while year-to-date exceeded 2024 as stronger improvements in room rates and earnings from the 2024 Acquisitions more than offset the decline in business interruption proceeds and wage increases. Adjusted FFO per diluted share decreased $0.01, or 2.8%, for the quarter and increased $0.01, or 0.6%, year-to-date, reflecting the changes in Adjusted EBITDA\nre, \nfurther reduced by increases in interest expense and income taxes, which are included in Adjusted FFO per diluted share but not Adjusted EBITDA\nre\n.\nOutlook\nDuring year-to-date 2025, strong leisure transient demand has led to year-over-year comparable hotel RevPAR improvement of 3.5%. Results reflect the improving leisure demand on Maui and an increase in transient revenue driven by higher average rates, particularly at our resorts. Overall, year-to-date results have not reflected material impacts from recent economic policy changes, including heightened tariffs; however, as anticipated, group demand declined in the third quarter primarily due to renovation disruption and a shift in the timing of holidays. \nFor the fourth quarter, we expect that demand will continue to be driven by transient business, as we anticipate continued softness in short-term group bookings due to persistent uncertainty surrounding trade and U.S. economic policy. Additionally, international inbound travel continues to face headwinds from shifting global travel patterns, as evolving trade and immigration policy tempers inbound demand, while outbound travel remains elevated. Broader risks to economic growth remain, including the economic effects of the ongoing government shutdown that began on October 1, 2025, high interest rates, geopolitical instability, and a labor market that, while not deteriorating sharply, appears increasingly stagnant as both labor participation and hiring momentum plateau. Despite these pressures, U.S. GDP growth consensus expectations for 2025 have been revised up to 1.9%, reflecting resilience in consumer spending and tech-driven investment. Nonetheless, this still represents a slowdown from 2.8% growth in 2024, and the outlook for the final quarter of 2025 remains cautious. \n28\nHotel supply growth expectations remain below the historical average, although we expect to see above-average growth in a few markets where our hotels are located. Supply chain challenges, which may be exacerbated by current tariffs and trade policies, have resulted in project delays across the U.S., and a prolonged tight lending environment has created construction financing challenges for future projects. We anticipate that the construction pipeline will remain modest until macroeconomic uncertainty moderates and interest rates decline further. \nBased on the trends noted, we expect comparable hotel RevPAR growth for the full year 2025 will be approximately 3.0%, reflecting modest growth in the fourth quarter and the assumption of limited impacts from the government shutdown, which are comparable to what was experienced in October. In addition, we continue to expect margins to decline in comparison to 2024, driven by higher wages and benefits, including increases driven by new union contracts in certain cities.\nAs discussed above, the current outlook for the lodging industry remains uncertain, reflecting varying analyst assumptions surrounding the impact of trade policy, financial market volatility, reductions in government employment and escalating geopolitical conflicts. Therefore, there can be no assurances as to lodging demand performance for any number of reasons, including, but not limited to, deteriorating macroeconomic conditions.\nStrategic Initiatives\nDispositions. \nDuring the\n \nthird quarter, we sold the Washington Marriott at Metro Center for $177 million, including $2 million of FF&E funds retained by us, and provided a $114 million loan to the buyer. We recorded a gain on sale of $122 million. \nIn September 2025, the Asia/Pacific joint venture, in which we own a 25% interest, sold its 36% share in two separate joint ventures in India to the existing shareholders thereof, representing our exit from our Asia investment. Our portion of the net proceeds to be received is approximately INR 1,550 million ($17 million).\nCapital Projects.\n Through the third quarter of 2025, we spent approximately $184 million on return on investment (\"ROI\") capital projects, $200 million on renewal and replacement projects, and $70 million on hurricane and other restoration work. This included our restoration efforts at The Don CeSar following Hurricanes Helene and Milton, for which we estimate the total property reconstruction and remediation costs, including resiliency enhancements, to be approximately $105 million, of which approximately 30% relates to remediation costs. The Don CeSar reopened to guests on March 26, 2025, as part of a phased reopening, with the final amenities reopened during the third quarter. As of September 30, 2025, we have received total insurance proceeds of $40 million related to our claims, of which $24 million has been recognized as business interruption proceeds, including $5 million in the third quarter of 2025. \nIn collaboration with Hyatt, we initiated a transformational capital program in 2023 on six properties in our portfolio. These investments are intended to position the targeted hotels to compete better in their respective markets while seeking to enhance long-term performance. We expect to invest approximately $125 million to $200 million per year on this program through 2027. Hyatt has agreed to provide additional priority returns on the agreed upon investments and operating profit guarantees totaling $40 million to offset expected business disruptions. Approximately 65% of the total estimated costs of the program have been spent as of September 30, 2025, and we spent approximately $104 million year-to-date 2025, which is included in ROI capital projects. During the third quarter of 2025, we substantially completed the transformational renovations at the Hyatt Regency Washington on Capitol Hill, including rooms, public space, and food and beverage outlets. \nWe reached an agreement with Marriott International to complete a second transformational capital program at four properties over a four-year period. These portfolio investments are designed to better position the assets to compete in their respective markets and enhance long-term performance. We expect to spend between $300 million and $350 million through 2029. In exchange, Marriott has provided enhanced owner priority returns on the agreed upon investments and operating profit guarantees of approximately $22 million, including $1 million in each of the third and fourth quarters of 2025, to offset expected business disruption.  \nFor full year 2025, we expect total capital expenditures of $605 million to $640 million, consisting of ROI projects of approximately $280 million to $295 million, renewal and replacement expenditures of $250 million to $265 million, and $75 million to $80 million for the restoration work from the damage caused by Hurricanes Helene and Milton. \n29\nThe full year ROI project spend includes approximately $190 million to $195 million for the Marriott and Hyatt transformational capital programs discussed above.\nConstruction continued on the development of 40 condominiums on a five-acre development parcel to be Four Seasons-branded and managed residences at the Four Seasons Resort Orlando at Walt Disney World\n®\n Resort. The mid-rise building is expected to be completed in the fourth quarter of 2025, and the villas are expected to be completed in the first half of 2026. Year-to-date 2025, we spent $67 million in development costs for this project and expect full year 2025 development costs for this project to be $80 million to $85 million.\nResults of Operations \nThe following table reflects certain line items from our unaudited condensed consolidated statements of operations (in millions, except percentages):  \nQuarter ended\nSeptember 30,\nYear-to-date ended\nSeptember 30,\n2025\n2024\nChange\n \n2025\n2024\nChange\n \nTotal revenues\n$\n1,331 \n$\n1,319 \n0.9\n%\n$\n4,511 \n$\n4,256 \n6.0\n%\nOperating costs and expenses:\nProperty-level costs ⁽¹⁾\n1,208 \n1,188 \n1.7 \n%\n3,789 \n3,573 \n6.0 \n%\nCorporate and other expenses\n27 \n25 \n8.0 \n%\n83 \n81 \n2.5 \n%\nNet gain on insurance settlements\n5 \n29 \n(82.8)\n%\n24 \n116 \n(79.3)\n%\nOperating profit\n101 \n135 \n(25.2)\n%\n663 \n718 \n(7.7)\n%\nInterest expense\n60 \n59 \n1.7 \n%\n175 \n156 \n12.2 \n%\nOther gains\n122 \n1 \nN/M\n148 \n1 \nN/M\nProvision for income taxes\n9 \n6 \n50.0 \n%\n35 \n20 \n75.0 \n%\nHost Inc.:\nNet income attributable to non-controlling interests\n2 \n2 \n— \n%\n9 \n9 \n— \n%\nNet income attributable to Host Inc.\n161 \n82 \n96.3 \n%\n630 \n589 \n7.0 \n%\nHost L.P.:\nNet income attributable to non-controlling interests\n1 \n1 \n— \n%\n1 \n1 \n— \n%\nNet income attributable to Host L.P.\n162 \n83 \n95.2 \n%\n638 \n597 \n6.9 \n%\n___________\n(1)\nAmounts represent total operating costs and expenses from our unaudited condensed consolidated statements of operations, less corporate and other expenses and net gain on insurance settlements. \nN/M = Not meaningful.\n30\nStatements of Operations Results and Trends \nHotel Sales Overview \nThe following table presents total revenues in accordance with GAAP and includes all consolidated hotels (in millions, except percentages): \nQuarter ended\nSeptember 30,\nYear-to-date ended\nSeptember 30,\n2025\n2024\nChange\n \n2025\n2024\nChange\n \nRevenues:\nRooms\n$\n826 \n$\n825 \n0.1\n%\n$\n2,713 \n$\n2,563 \n5.9\n%\nFood and beverage\n364 \n365 \n(0.3\n%)\n1,345 \n1,285 \n4.7 \n%\nOther\n141 \n129 \n9.3\n%\n453 \n408 \n11.0 \n%\nTotal revenues \n$\n1,331 \n$\n1,319 \n0.9\n%\n$\n4,511 \n$\n4,256 \n6.0 \n%\nTotal revenues for the third quarter and year-to-date increased 0.9% and 6.0%, respectively, compared to 2024, due to an increase in room rates driven by strong transient demand and continued strength in out-of-room spend, partially offset by a decline in group demand due to planned renovation disruption. Third quarter and year-to-date total revenues also benefited from the operations of our 2024 Acquisitions. These improvements more than offset the negative impact on revenues resulting from our 2025 Dispositions and the closure of The Don CeSar from September 2024 to March 2025 due to Hurricanes Helene and Milton.\nRooms\n. Total rooms revenues increased $1 million, or 0.1%, and $150 million, or 5.9%, for the third quarter and year-to-date, respectively, compared to 2024, reflecting the increase at our comparable hotels of $2 million, or 0.3%, and $81 million, or 3.2%, for the third quarter and year-to-date, respectively, due primarily to an increase in average room rate of 3.0% and 4.3%, respectively, driven by transient demand. For the third quarter, total rooms revenue was negatively impacted by the 2025 Dispositions (which occurred in June and August of 2025), while year-to-date benefitted from the 2024 Acquisitions. \nFood and beverage\n. Total food and beverage (\"F&B\") revenues decreased $1 million, or 0.3%, for the quarter and increased $60 million, or 4.7%, year-to-date, compared to 2024. The third quarter decline was due to a decrease in comparable F&B revenues of $1 million, or 0.3%, as an increase in F&B outlet revenue from strong transient demand was able to mostly offset the decline in banquet and AV revenues from lower group business. Year-to-date, F&B revenues reflect the results of the 2024 Acquisitions and an increase in comparable F&B revenues of $35 million, or 2.7%, driven by strong outlet revenues from our resorts, specifically our Maui resorts as the recovery continues, as well as the completion of ROI projects at several restaurant locations.\nOther revenues. \nTotal other revenues increased $12 million, or 9.3%, and $45 million, or 11.0%, for the quarter and year-to-date, respectively, compared to 2024, due to the results from the 2024 Acquisitions and the increase at our comparable hotels of $10 million, or 7.9%, and $27 million, or 6.5%, for the quarter and year-to-date, respectively. This growth was primarily due to an increase in spa, golf and other ancillary revenues, boosted by the continued recovery on Maui.\n31\nProperty-level Operating Expenses \nThe following table presents property-level operating expenses in accordance with GAAP and includes all consolidated hotels (in millions, except percentages): \nQuarter ended\nSeptember 30,\nYear-to-date ended\nSeptember 30,\n2025\n2024\nChange\n \n2025\n2024\nChange\n \nExpenses:\nRooms\n$\n222 \n$\n216 \n2.8\n%\n$\n680 \n$\n632 \n7.6\n%\nFood and beverage\n278 \n267 \n4.1 \n%\n914 \n848 \n7.8 \n%\nOther departmental and support expenses\n357 \n345 \n3.5 \n%\n1,096 \n1,022 \n7.2 \n%\nManagement fees\n52 \n55 \n(5.5)\n%\n191 \n193 \n(1.0)\n%\nOther property-level expenses\n103 \n108 \n(4.6)\n%\n321 \n313 \n2.6 \n%\nDepreciation and amortization\n196 \n197 \n(0.5)\n%\n587 \n565 \n3.9 \n%\nTotal property-level operating expenses\n$\n1,208 \n$\n1,188 \n1.7 \n%\n$\n3,789 \n$\n3,573 \n6.0 \n%\nOur operating costs and expenses, which consist of both fixed and variable components, are affected by several factors. Rooms expenses are affected mainly by occupancy, which drives costs related to items such as housekeeping, reservation systems, room supplies, laundry services and front desk costs. Food and beverage expenses correlate closely with food and beverage revenues and are affected by occupancy and the mix of business between banquet, audio-visual and outlet sales. However, the most significant expense for the rooms, food and beverage, and other departmental and support expenses is wages and employee benefits, which comprise approximately 58% of these expenses. These expenses increased approximately 4% and 5% on a per available room basis for the quarter and year-to-date, respectively, compared to 2024, primarily due to an overall increase in general wage rates and benefits. Wage and benefit rate inflation is expected to be approximately 6% in 2025.\nOther property-level expenses consist of property taxes, the amounts and structure of which are highly dependent on local jurisdiction taxing authorities, and property and general liability insurance, all of which do not necessarily increase or decrease based on similar changes in revenues at our hotels.\nThe increase in expenses for the third quarter and year-to-date 2025 compared to 2024 for rooms, food and beverage, and other departmental and support was generally due to the corresponding increases in revenues due to the 2024 Acquisitions, and also reflected increased expenses at our comparable hotels primarily due to increased wages and benefits, as described below:\nRooms.\n Rooms expenses increased $6 million, or 2.8%, and $48 million, or 7.6%, for the quarter and year-to-date, respectively. Our comparable hotels rooms expenses increased $6 million, or 2.8%, and $29 million, or 4.6%, for the quarter and year-to-date, respectively, driven by an overall increase in wage rates. \nFood and beverage\n. F&B expenses increased $11 million, or 4.1%, and $66 million, or 7.8%, for the quarter and year-to-date, respectively. For our comparable hotels, F&B expenses increased $8 million, or 3.1%, and $40 million, or 4.7%, for the quarter and year-to-date, respectively. Overall, F&B costs as a percentage of revenues increased year over year as a result of increased wages and benefits. \nOther departmental and support expenses\n. Other departmental and support expenses increased $12 million, or 3.5%, and $74 million, or 7.2%, for the quarter and year-to-date, respectively. On a comparable hotel basis, other departmental and support expenses increased $9 million, or 2.8%, and $35 million, or 3.4%, for the quarter and year-to-date, respectively. These increases were primarily due to higher wage expense. \nManagement fees\n. Total management fees decreased $3 million, or 5.5%, and $2 million, or 1.0%, for the quarter and year-to-date, respectively. Base management fees, which generally are calculated as a percentage of total revenues, decreased $1 million, or 2.7%, for the quarter and increased $4 million, or 3.3%, year-to-date. Incentive management fees, which generally are based on the amount of operating profit at each hotel after we receive a priority return on our \n32\ninvestment, decreased $2 million, or 11.1%, and $6 million, or 8.2%, for the quarter and year-to-date, respectively, due to disruption from planned renovations. \nOther property-level expenses. \nThese expenses generally do not vary significantly based on occupancy and include expenses such as property taxes and insurance. Other property-level expenses decreased $5 million, or 4.6%, for the quarter due to higher operating profit guarantees received from our hotel managers related to the transformational capital programs in 2025 as compared to 2024, reflecting the timing of projects included in the programs. Year-to-date, other property-level expenses increased $8 million, or 2.6%, primarily due to increases in property taxes and increases due to the 2024 Acquisitions. Other property-level expenses at our comparable hotels decreased $5 million, or 5.3%, and $3 million, or 1.0% for the quarter and year-to-date, respectively. \nOther Income and Expense \nCorporate and other expenses. \nThe following table details our corporate and other expenses for the quarter and year-to-date (in millions):\nQuarter ended September 30,\nYear-to-date ended September 30,\n2025\n2024\n2025\n2024\nGeneral and administrative costs\n$\n22 \n$\n19 \n$\n67 \n$\n64 \nNon-cash stock-based compensation expense\n5 \n6 \n16 \n17 \n       Total        \n$\n27 \n$\n25 \n$\n83 \n$\n81 \nNet gain on insurance settlements. \nThe following table details our gain on insurance settlements for property damage and business interruption, net of property damage and remediation losses, related to Hurricanes Ian, Helene and Milton, as well as the 2023 Maui wildfires, for the quarter and year-to-date (in millions): \nQuarter ended September 30,\nYear-to-date ended September 30,\n2025\n2024\n2025\n2024\nProperty damage\nHurricane Ian\n$\n— \n$\n25 \n$\n— \n$\n72 \nOther\n— \n4 \n— \n4 \nBusiness interruption\nHurricanes Helene/Milton\n5 \n— \n24 \n— \nHurricane Ian\n— \n— \n— \n19 \nMaui wildfires\n— \n— \n— \n21 \nNet gain on insurance settlements\n$\n5 \n$\n29 \n$\n24 \n$\n116 \nInterest expense.\n Interest expense increased for the quarter and year-to-date 2025, primarily due to higher outstanding debt balances during 2025 compared to 2024, as we refinanced $400 million of senior notes in 2024 and $500 million in 2025 through the issuances of $1.8 billion of senior notes at higher interest rates, and also used the proceeds to partially fund the 2024 Acquisitions. The following table details our interest expense for the quarter and year-to-date (in millions): \nQuarter ended September 30,\nYear-to-date ended September 30,\n2025\n2024\n2025\n2024\nCash interest expense ⁽¹⁾\n$\n56 \n$\n57 \n$\n166 \n$\n149 \nNon-cash interest expense\n4 \n2 \n9 \n7 \nTotal interest expense\n$\n60 \n$\n59 \n$\n175 \n$\n156 \n_________\n(1)\nIncluding the change in accrued interest, total cash interest paid was $51 million and $40 million for the quarters ended September 30, 2025 and 2024, respectively, and $170 million and $131 million year-to-date 2025 and 2024, respectively.\n33\nOther gains\n. Other gains include the $122 million gain on sale of the Washington Marriott at Metro Center during the third quarter of 2025 and the $21 million gain on sale of The Westin Cincinnati during the second quarter of 2025. \nProvision for income taxes.\n We lease substantially all our properties to consolidated subsidiaries designated as taxable REIT subsidiaries (“TRS”) for U.S. federal income tax purposes. Taxable income or loss generated/incurred by the TRS primarily represents hotel-level operations, net of the aggregate rent paid to Host L.P. by the TRS, on which we record an income tax provision or benefit. For the third quarter and year-to-date of 2025, we recorded a net income tax provision of $9 million and $35 million, respectively, primarily due to the profitability of hotel operations retained by the TRS. The increase for year-to-date, as compared to 2024, is also due to the recognition of federal income tax credits related to the installation of a co-generation plant at one of our properties in 2024.\nComparable Hotel RevPAR Overview\nWe discuss operating results for our hotels on a comparable hotel basis. Comparable hotels are those properties that we consolidate as of the reporting date. Comparable hotels do not include the results of hotels sold or classified as held-for-sale, hotels that have sustained substantial property damage or business interruption, or hotels that have undergone large-scale capital projects, in each case requiring closures lasting one month or longer during the reporting periods being compared. See “Comparable Hotel Operating Statistics and Results” below for more information on how we determine our comparable hotels. \nWe also include, following the comparable hotels results by geographic location, the same operating statistics presentation on an actual basis, which includes results for our portfolio for the time period of our ownership, including the results of non-comparable properties, dispositions through their date of disposal and acquisitions beginning as of the date of acquisition. Lastly, we discuss our hotel results by mix of business (i.e., transient, group, or contract). \nHotel Operating Data by Location \nThe following tables set forth performance information for our hotels by geographic location for the quarter and year-to-date ended September 30, 2025 and 2024, respectively, on a comparable hotel and actual basis:\n34\nComparable Hotel Results by Location\nAs of September 30, 2025\nQuarter ended September 30, 2025\nQuarter ended September 30, 2024\nLocation\nNo. of\nProperties\nNo. of\nRooms\nAverage\nRoom Rate\nAverage\nOccupancy\nPercentage\nRevPAR\nTotal RevPAR\nAverage\nRoom Rate\nAverage\nOccupancy\nPercentage\nRevPAR\nTotal RevPAR\nPercent\nChange in\nRevPAR\nPercent\nChange in\nTotal RevPAR\nMaui\n3 \n1,580 \n$\n611.54 \n69.9\n%\n$\n427.23 \n$\n675.34 \n$\n626.00 \n57.0\n%\n$\n356.87 \n$\n569.42 \n19.7\n%\n18.6\n%\nJacksonville\n1 \n446 \n516.44 \n72.4\n%\n374.11 \n826.86 \n500.84 \n71.6\n%\n358.59 \n805.21 \n4.3\n%\n2.7\n%\nOahu \n(1)\n2 \n876 \n481.95 \n83.8\n%\n403.71 \n620.81 \n458.26 \n81.6\n%\n373.80 \n562.08 \n8.0\n%\n10.4\n%\nMiami\n2 \n1,038 \n387.67 \n59.1\n%\n229.04 \n433.63 \n366.49 \n59.2\n%\n216.89 \n414.64 \n5.6\n%\n4.6\n%\nFlorida Gulf Coast\n4 \n1,529 \n375.39 \n42.7\n%\n160.16 \n350.93 \n321.25 \n55.6\n%\n178.55 \n382.02 \n(10.3\n%)\n(8.1\n%)\nNew York\n3 \n2,720 \n400.99 \n88.9\n%\n356.36 \n487.87 \n379.23 \n87.5\n%\n331.84 \n447.06 \n7.4\n%\n9.1\n%\nPhoenix\n3 \n1,545 \n262.62 \n61.9\n%\n162.56 \n410.51 \n269.17 \n54.5\n%\n146.75 \n374.60 \n10.8\n%\n9.6\n%\nNashville\n2 \n721 \n330.15 \n77.6\n%\n256.22 \n449.68 \n335.61 \n80.5\n%\n270.28 \n435.21 \n(5.2\n%)\n3.3\n%\nOrlando\n2 \n2,448 \n346.50 \n53.4\n%\n185.18 \n421.34 \n312.21 \n60.3\n%\n188.39 \n426.35 \n(1.7\n%)\n(1.2\n%)\nLos Angeles/Orange County\n3 \n1,067 \n308.01 \n76.7\n%\n236.26 \n354.62 \n303.51 \n81.9\n%\n248.54 \n369.47 \n(4.9\n%)\n(4.0\n%)\nSan Diego\n3 \n3,294 \n302.44 \n76.9\n%\n232.44 \n410.75 \n305.38 \n84.2\n%\n257.27 \n455.83 \n(9.7\n%)\n(9.9\n%)\nBoston\n2 \n1,496 \n297.49 \n79.6\n%\n236.86 \n303.04 \n301.09 \n84.4\n%\n253.98 \n316.86 \n(6.7\n%)\n(4.4\n%)\nWashington, D.C. (CBD)\n4 \n2,786 \n265.42 \n56.6\n%\n150.31 \n232.09 \n263.04 \n67.1\n%\n176.54 \n266.46 \n(14.9\n%)\n(12.9\n%)\nPhiladelphia\n2 \n810 \n231.56 \n83.9\n%\n194.39 \n301.51 \n236.34 \n83.7\n%\n197.75 \n298.37 \n(1.7\n%)\n1.1\n%\nNorthern Virginia\n2 \n916 \n254.61 \n72.4\n%\n184.39 \n268.82 \n246.97 \n74.3\n%\n183.58 \n272.79 \n0.4\n%\n(1.5\n%)\nChicago\n3 \n1,562 \n275.28 \n83.7\n%\n230.39 \n323.52 \n284.56 \n79.3\n%\n225.77 \n302.96 \n2.0\n%\n6.8\n%\nSeattle\n2 \n1,315 \n278.57 \n82.7\n%\n230.37 \n292.94 \n278.67 \n84.2\n%\n234.60 \n295.93 \n(1.8\n%)\n(1.0\n%)\nSan Francisco/San Jose\n6 \n4,162 \n228.63 \n74.7\n%\n170.68 \n243.57 \n221.47 \n71.4\n%\n158.03 \n224.25 \n8.0\n%\n8.6\n%\nAtlanta\n2 \n810 \n205.50 \n69.2\n%\n142.11 \n218.67 \n193.10 \n62.3\n%\n120.29 \n182.01 \n18.1\n%\n20.1\n%\nHouston\n4 \n1,710 \n195.20 \n61.2\n%\n119.37 \n163.15 \n195.95 \n69.7\n%\n136.51 \n186.16 \n(12.6\n%)\n(12.4\n%)\nSan Antonio\n2 \n1,512 \n207.97 \n58.2\n%\n121.08 \n186.09 \n201.02 \n56.3\n%\n113.14 \n179.56 \n7.0\n%\n3.6\n%\nDenver\n3 \n1,342 \n213.29 \n74.8\n%\n159.43 \n230.23 \n212.74 \n82.1\n%\n174.65 \n252.81 \n(8.7\n%)\n(8.9\n%)\nNew Orleans\n1 \n1,333 \n150.07 \n58.8\n%\n88.31 \n151.18 \n161.65 \n68.4\n%\n110.53 \n180.91 \n(20.1\n%)\n(16.4\n%)\nAustin\n2 \n769 \n205.41 \n41.4\n%\n85.07 \n157.45 \n206.04 \n60.4\n%\n124.50 \n226.42 \n(31.7\n%)\n(30.5\n%)\nOther\n8 \n2,551 \n301.73 \n70.5\n%\n212.81 \n327.45 \n301.01 \n68.5\n%\n206.27 \n323.59 \n3.2\n%\n1.2\n%\nDomestic\n71 \n40,338 \n302.35 \n69.5\n%\n210.04 \n340.12 \n293.19 \n71.7\n%\n210.08 \n338.13 \n—\n%\n0.6\n%\nInternational\n5 \n1,499 \n214.10 \n72.3\n%\n154.77 \n206.87 \n206.99 \n67.6\n%\n140.02 \n183.91 \n10.5\n%\n12.5\n%\nAll Locations\n76 \n41,837 \n$\n299.07 \n69.6\n%\n$\n208.07 \n$\n335.42 \n$\n290.27 \n71.5\n%\n$\n207.58 \n$\n332.67 \n0.2\n%\n0.8\n%\n___________\n(1)    Prior to our ownership of The Ritz Carlton O'ahu, Turtle Bay, golf revenues were recorded by the property based on gross sales. After our acquisition of the property in July 2024, the golf course operates under a lease agreement, under which we record rental income, resulting in lower total revenues when compared to the periods prior to our ownership.\n35\nComparable Hotel Results by Location\nAs of September 30, 2025\nYear-to-date ended September 30, 2025\nYear-to-date ended September 30, 2024\nLocation\nNo. of\nProperties\nNo. of\nRooms\nAverage\nRoom Rate\nAverage\nOccupancy\nPercentage\nRevPAR\nTotal RevPAR\nAverage\nRoom Rate\nAverage\nOccupancy\nPercentage\nRevPAR\nTotal RevPAR\nPercent\nChange in\nRevPAR\nPercent\nChange in\nTotal RevPAR\nMaui\n3 \n1,580 \n$\n641.29 \n71.8\n%\n$\n460.58 \n$\n728.70 \n$\n658.69 \n59.3\n%\n$\n390.76 \n$\n639.14 \n17.9\n%\n14.0\n%\nJacksonville\n1 \n446 \n546.80 \n74.6\n%\n407.90 \n918.63 \n527.92 \n74.2\n%\n391.58 \n876.65 \n4.2\n%\n4.8\n%\nOahu\n (1)\n2 \n876 \n482.90 \n83.5\n%\n403.43 \n618.34 \n454.33 \n82.5\n%\n374.93 \n589.86 \n7.6\n%\n4.8\n%\nMiami\n2 \n1,038 \n541.24 \n72.8\n%\n394.28 \n694.08 \n521.24 \n70.2\n%\n365.80 \n636.48 \n7.8\n%\n9.1\n%\nFlorida Gulf Coast\n4 \n1,529 \n518.80 \n65.0\n%\n337.19 \n734.07 \n480.88 \n68.8\n%\n330.77 \n699.62 \n1.9\n%\n4.9\n%\nNew York\n3 \n2,720 \n381.66 \n85.9\n%\n327.75 \n471.21 \n360.45 \n82.9\n%\n298.70 \n421.87 \n9.7\n%\n11.7\n%\nPhoenix\n3 \n1,545 \n389.03 \n71.5\n%\n278.30 \n651.58 \n393.86 \n69.8\n%\n275.08 \n632.88 \n1.2\n%\n3.0\n%\nNashville\n2 \n721 \n338.77 \n80.7\n%\n273.48 \n469.46 \n341.19 \n80.8\n%\n275.55 \n445.00 \n(0.8\n%)\n5.5\n%\nOrlando\n2 \n2,448 \n398.78 \n65.9\n%\n262.80 \n556.99 \n363.77 \n68.3\n%\n248.43 \n527.80 \n5.8\n%\n5.5\n%\nLos Angeles/Orange County\n3 \n1,067 \n306.41 \n78.2\n%\n239.47 \n361.29 \n297.47 \n79.1\n%\n235.16 \n350.72 \n1.8\n%\n3.0\n%\nSan Diego\n3 \n3,294 \n302.30 \n76.2\n%\n230.25 \n430.73 \n298.26 \n81.5\n%\n243.21 \n452.45 \n(5.3\n%)\n(4.8\n%)\nBoston\n2 \n1,496 \n291.42 \n75.7\n%\n220.46 \n287.97 \n280.49 \n79.8\n%\n223.91 \n292.37 \n(1.5\n%)\n(1.5\n%)\nWashington, D.C. (CBD)\n4 \n2,786 \n312.81 \n63.6\n%\n198.84 \n290.96 \n289.60 \n69.6\n%\n201.45 \n300.31 \n(1.3\n%)\n(3.1\n%)\nPhiladelphia\n2 \n810 \n235.96 \n82.1\n%\n193.71 \n295.87 \n233.93 \n80.5\n%\n188.37 \n286.45 \n2.8\n%\n3.3\n%\nNorthern Virginia\n2 \n916 \n268.51 \n68.6\n%\n184.16 \n284.99 \n255.73 \n73.0\n%\n186.80 \n287.34 \n(1.4\n%)\n(0.8\n%)\nChicago\n3 \n1,562 \n252.43 \n72.0\n%\n181.64 \n258.88 \n255.00 \n70.5\n%\n179.73 \n249.82 \n1.1\n%\n3.6\n%\nSeattle\n2 \n1,315 \n251.35 \n71.8\n%\n180.44 \n240.72 \n254.22 \n70.5\n%\n179.21 \n239.04 \n0.7\n%\n0.7\n%\nSan Francisco/San Jose\n6 \n4,162 \n255.37 \n70.3\n%\n179.44 \n265.08 \n245.14 \n68.2\n%\n167.30 \n244.90 \n7.3\n%\n8.2\n%\nAtlanta\n2 \n810 \n214.99 \n68.2\n%\n146.72 \n244.64 \n204.24 \n61.4\n%\n125.42 \n207.89 \n17.0\n%\n17.7\n%\nHouston\n4 \n1,710 \n209.62 \n68.2\n%\n142.92 \n198.42 \n203.11 \n73.9\n%\n150.03 \n205.12 \n(4.7\n%)\n(3.3\n%)\nSan Antonio\n2 \n1,512 \n223.44 \n61.8\n%\n138.18 \n219.96 \n216.80 \n61.4\n%\n133.13 \n214.38 \n3.8\n%\n2.6\n%\nDenver\n3 \n1,342 \n203.98 \n67.2\n%\n137.17 \n207.38 \n201.25 \n70.5\n%\n141.92 \n215.52 \n(3.3\n%)\n(3.8\n%)\nNew Orleans\n1 \n1,333 \n205.67 \n65.4\n%\n134.43 \n215.07 \n191.16 \n72.3\n%\n138.16 \n219.14 \n(2.7\n%)\n(1.9\n%)\nAustin\n2 \n769 \n238.80 \n52.4\n%\n125.10 \n231.79 \n247.35 \n66.2\n%\n163.68 \n292.67 \n(23.6\n%)\n(20.8\n%)\nOther\n8 \n2,551 \n309.70 \n68.5\n%\n212.05 \n328.96 \n304.18 \n65.2\n%\n198.32 \n311.62 \n6.9\n%\n5.6\n%\nDomestic\n71 \n40,338 \n328.28 \n71.1\n%\n233.53 \n390.93 \n314.22 \n71.8\n%\n225.74 \n376.74 \n3.4\n%\n3.8\n%\nInternational\n5 \n1,499 \n196.33 \n67.9\n%\n133.40 \n183.36 \n196.00 \n63.2\n%\n123.88 \n178.79 \n7.7\n%\n2.6\n%\nAll Locations\n76 \n41,837 \n$\n323.76 \n71.0\n%\n$\n229.95 \n$\n383.54 \n$\n310.48 \n71.5\n%\n$\n222.10 \n$\n369.71 \n3.5\n%\n3.7\n%\n___________\n(1)    Prior to our ownership of The Ritz Carlton O'ahu, Turtle Bay, golf revenues were recorded by the property based on gross sales. After our acquisition of the property in July 2024, the golf course operates under a lease agreement, under which we record rental income, resulting in lower total revenues when compared to the periods prior to our ownership.\n36\nResults by Location - actual, based on ownership period\n(1)\nAs of September 30,\n2025\n2024\nQuarter ended September 30, 2025\nQuarter ended September 30, 2024\nLocation\nNo. of\nProperties\nNo. of\nProperties\nAverage\nRoom Rate\nAverage\nOccupancy\nPercentage\nRevPAR\nTotal RevPAR\nAverage\nRoom Rate\nAverage\nOccupancy\nPercentage\nRevPAR\nTotal RevPAR\nPercent\nChange in\nRevPAR\nPercent\nChange in\nTotal RevPAR\nMaui\n3 \n3 \n$\n611.54 \n69.9\n%\n$\n427.23 \n$\n675.34 \n$\n626.00 \n57.0\n%\n$\n356.87 \n$\n569.42 \n19.7\n%\n18.6\n%\nJacksonville\n1 \n1 \n516.44 \n72.4\n%\n374.11 \n826.86 \n500.84 \n71.6\n%\n358.59 \n805.21 \n4.3\n%\n2.7\n%\nOahu\n2 \n2 \n481.95 \n83.8\n%\n403.71 \n620.81 \n386.23 \n82.6\n%\n318.97 \n462.52 \n26.6\n%\n34.2\n%\nMiami\n2 \n2 \n387.67 \n59.1\n%\n229.04 \n433.63 \n366.49 \n59.2\n%\n216.89 \n414.64 \n5.6\n%\n4.6\n%\nFlorida Gulf Coast\n5 \n5 \n372.69 \n46.3\n%\n172.40 \n369.38 \n332.00 \n57.0\n%\n189.13 \n403.96 \n(8.8\n%)\n(8.6\n%)\nNew York\n3 \n3 \n400.99 \n88.9\n%\n356.36 \n487.87 \n378.23 \n87.7\n%\n331.88 \n441.73 \n7.4\n%\n10.4\n%\nPhoenix\n3 \n3 \n262.62 \n61.9\n%\n162.56 \n410.51 \n269.17 \n54.5\n%\n146.75 \n374.60 \n10.8\n%\n9.6\n%\nNashville\n2 \n2 \n330.15 \n77.6\n%\n256.22 \n449.68 \n335.61 \n80.5\n%\n270.28 \n435.21 \n(5.2\n%)\n3.3\n%\nOrlando\n2 \n2 \n346.50 \n53.4\n%\n185.18 \n421.34 \n312.21 \n60.3\n%\n188.39 \n426.35 \n(1.7\n%)\n(1.2\n%)\nLos Angeles/Orange County\n3 \n3 \n308.01 \n76.7\n%\n236.26 \n354.62 \n303.51 \n81.9\n%\n248.54 \n369.47 \n(4.9\n%)\n(4.0\n%)\nSan Diego\n3 \n3 \n302.44 \n76.9\n%\n232.44 \n410.75 \n305.38 \n84.2\n%\n257.27 \n455.83 \n(9.7\n%)\n(9.9\n%)\nBoston\n2 \n2 \n297.49 \n79.6\n%\n236.86 \n303.04 \n301.09 \n84.4\n%\n253.98 \n316.86 \n(6.7\n%)\n(4.4\n%)\nWashington, D.C. (CBD)\n4 \n5 \n260.24 \n57.4\n%\n149.50 \n227.53 \n261.33 \n69.0\n%\n180.29 \n265.21 \n(17.1\n%)\n(14.2\n%)\nPhiladelphia\n2 \n2 \n231.56 \n83.9\n%\n194.39 \n301.51 \n236.34 \n83.7\n%\n197.75 \n298.37 \n(1.7\n%)\n1.1\n%\nNorthern Virginia\n2 \n2 \n254.61 \n72.4\n%\n184.39 \n268.82 \n246.97 \n74.3\n%\n183.58 \n272.79 \n0.4\n%\n(1.5\n%)\nChicago\n3 \n3 \n275.28 \n83.7\n%\n230.39 \n323.52 \n284.56 \n79.3\n%\n225.77 \n302.96 \n2.0\n%\n6.8\n%\nSeattle\n2 \n2 \n278.57 \n82.7\n%\n230.37 \n292.94 \n278.67 \n84.2\n%\n234.60 \n295.93 \n(1.8\n%)\n(1.0\n%)\nSan Francisco/San Jose\n6 \n6 \n228.63 \n74.7\n%\n170.68 \n243.57 \n221.47 \n71.4\n%\n158.03 \n224.25 \n8.0\n%\n8.6\n%\nAtlanta\n2 \n2 \n205.50 \n69.2\n%\n142.11 \n218.67 \n193.10 \n62.3\n%\n120.29 \n182.01 \n18.1\n%\n20.1\n%\nHouston\n5 \n5 \n204.97 \n58.2\n%\n119.28 \n164.24 \n207.33 \n66.6\n%\n138.07 \n189.00 \n(13.6\n%)\n(13.1\n%)\nSan Antonio\n2 \n2 \n207.97 \n58.2\n%\n121.08 \n186.09 \n201.02 \n56.3\n%\n113.14 \n179.56 \n7.0\n%\n3.6\n%\nDenver\n3 \n3 \n213.29 \n74.8\n%\n159.43 \n230.23 \n212.74 \n82.1\n%\n174.65 \n252.81 \n(8.7\n%)\n(8.9\n%)\nNew Orleans\n1 \n1 \n150.07 \n58.8\n%\n88.31 \n151.18 \n161.65 \n68.4\n%\n110.53 \n180.91 \n(20.1\n%)\n(16.4\n%)\nAustin\n2 \n2 \n205.41 \n41.4\n%\n85.07 \n157.45 \n206.04 \n60.4\n%\n124.50 \n226.42 \n(31.7\n%)\n(30.5\n%)\nOther\n9 \n10 \n353.05 \n67.2\n%\n237.21 \n361.71 \n325.57 \n69.7\n%\n226.89 \n348.53 \n4.5\n%\n3.8\n%\nDomestic\n74 \n76 \n305.68 \n69.0\n%\n210.84 \n341.26 \n293.06 \n71.6\n%\n209.71 \n336.55 \n0.5\n%\n1.4\n%\nInternational\n5 \n5 \n214.10 \n72.3\n%\n154.77 \n206.87 \n206.99 \n67.6\n%\n140.02 \n183.91 \n10.5\n%\n12.5\n%\nAll Locations\n79 \n81 \n$\n302.34 \n69.1\n%\n$\n208.89 \n$\n336.63 \n$\n290.24 \n71.4\n%\n$\n207.30 \n$\n331.32 \n0.8\n%\n1.6\n%\n37\nResults by Location - actual, based on ownership period\n(1)\nAs of September 30,\n2025\n2024\nYear-to-date ended September 30, 2025\nYear-to-date ended September 30, 2024\nLocation\nNo. of\nProperties\nNo. of\nProperties\nAverage\nRoom Rate\nAverage\nOccupancy\nPercentage\nRevPAR\nTotal RevPAR\nAverage\nRoom Rate\nAverage\nOccupancy\nPercentage\nRevPAR\nTotal RevPAR\nPercent\nChange in\nRevPAR\nPercent\nChange in\nTotal RevPAR\nMaui\n3 \n3 \n$\n641.29 \n71.8\n%\n$\n460.58 \n$\n728.70 \n$\n658.69 \n59.3\n%\n$\n390.76 \n$\n639.14 \n17.9\n%\n14.0\n%\nJacksonville\n1 \n1 \n546.80 \n74.6\n%\n407.90 \n918.63 \n527.92 \n74.2\n%\n391.58 \n876.65 \n4.2\n%\n4.8\n%\nOahu\n2 \n2 \n482.90 \n83.5\n%\n403.43 \n618.34 \n286.14 \n90.3\n%\n258.41 \n343.46 \n56.1\n%\n80.0\n%\nMiami\n2 \n2 \n541.24 \n72.8\n%\n394.28 \n694.08 \n521.24 \n70.2\n%\n365.80 \n636.48 \n7.8\n%\n9.1\n%\nFlorida Gulf Coast\n5 \n5 \n500.78 \n62.0\n%\n310.25 \n662.29 \n474.03 \n70.0\n%\n331.62 \n694.60 \n(6.4\n%)\n(4.7\n%)\nNew York\n3 \n3 \n381.66 \n85.9\n%\n327.75 \n471.21 \n347.40 \n83.0\n%\n288.45 \n406.46 \n13.6\n%\n15.9\n%\nPhoenix\n3 \n3 \n389.03 \n71.5\n%\n278.30 \n651.58 \n393.86 \n69.8\n%\n275.08 \n632.88 \n1.2\n%\n3.0\n%\nNashville\n2 \n2 \n338.77 \n80.7\n%\n273.48 \n469.46 \n355.57 \n84.0\n%\n298.70 \n474.17 \n(8.4\n%)\n(1.0\n%)\nOrlando\n2 \n2 \n398.78 \n65.9\n%\n262.80 \n556.99 \n363.77 \n68.3\n%\n248.43 \n527.80 \n5.8\n%\n5.5\n%\nLos Angeles/Orange County\n3 \n3 \n306.41 \n78.2\n%\n239.47 \n361.29 \n297.47 \n79.1\n%\n235.16 \n350.72 \n1.8\n%\n3.0\n%\nSan Diego\n3 \n3 \n302.30 \n76.2\n%\n230.25 \n430.73 \n298.26 \n81.5\n%\n243.21 \n452.45 \n(5.3\n%)\n(4.8\n%)\nBoston\n2 \n2 \n291.42 \n75.7\n%\n220.46 \n287.97 \n280.49 \n79.8\n%\n223.91 \n292.37 \n(1.5\n%)\n(1.5\n%)\nWashington, D.C. (CBD)\n4 \n5 \n309.88 \n65.0\n%\n201.57 \n290.56 \n289.07 \n71.0\n%\n205.24 \n298.07 \n(1.8\n%)\n(2.5\n%)\nPhiladelphia\n2 \n2 \n235.96 \n82.1\n%\n193.71 \n295.87 \n233.93 \n80.5\n%\n188.37 \n286.45 \n2.8\n%\n3.3\n%\nNorthern Virginia\n2 \n2 \n268.51 \n68.6\n%\n184.16 \n284.99 \n255.73 \n73.0\n%\n186.80 \n287.34 \n(1.4\n%)\n(0.8\n%)\nChicago\n3 \n3 \n252.43 \n72.0\n%\n181.64 \n258.88 \n255.00 \n70.5\n%\n179.73 \n249.82 \n1.1\n%\n3.6\n%\nSeattle\n2 \n2 \n251.35 \n71.8\n%\n180.44 \n240.72 \n254.22 \n70.5\n%\n179.21 \n239.04 \n0.7\n%\n0.7\n%\nSan Francisco/San Jose\n6 \n6 \n255.37 \n70.3\n%\n179.44 \n265.08 \n245.14 \n68.2\n%\n167.30 \n244.90 \n7.3\n%\n8.2\n%\nAtlanta\n2 \n2 \n214.99 \n68.2\n%\n146.72 \n244.64 \n204.24 \n61.4\n%\n125.42 \n207.89 \n17.0\n%\n17.7\n%\nHouston\n5 \n5 \n221.02 \n65.5\n%\n144.79 \n203.16 \n215.18 \n70.9\n%\n152.65 \n210.55 \n(5.1\n%)\n(3.5\n%)\nSan Antonio\n2 \n2 \n223.44 \n61.8\n%\n138.18 \n219.96 \n216.80 \n61.4\n%\n133.13 \n214.38 \n3.8\n%\n2.6\n%\nDenver\n3 \n3 \n203.98 \n67.2\n%\n137.17 \n207.38 \n201.25 \n70.5\n%\n141.92 \n215.52 \n(3.3\n%)\n(3.8\n%)\nNew Orleans\n1 \n1 \n205.67 \n65.4\n%\n134.43 \n215.07 \n191.16 \n72.3\n%\n138.16 \n219.14 \n(2.7\n%)\n(1.9\n%)\nAustin\n2 \n2 \n238.80 \n52.4\n%\n125.10 \n231.79 \n247.35 \n66.2\n%\n163.68 \n292.67 \n(23.6\n%)\n(20.8\n%)\nOther\n9 \n10 \n332.51 \n66.4\n%\n220.82 \n339.56 \n312.71 \n65.8\n%\n205.79 \n317.66 \n7.3\n%\n6.9\n%\nDomestic\n74 \n76 \n329.75 \n70.7\n%\n233.06 \n388.90 \n310.56 \n71.7\n%\n222.80 \n370.84 \n4.6\n%\n4.9\n%\nInternational\n5 \n5 \n196.33 \n67.9\n%\n133.40 \n183.36 \n196.00 \n63.2\n%\n123.88 \n178.79 \n7.7\n%\n2.6\n%\nAll Locations\n79 \n81 \n$\n325.30 \n70.6\n%\n$\n229.61 \n$\n381.82 \n$\n306.99 \n71.4\n%\n$\n219.32 \n$\n364.14 \n4.7\n%\n4.9\n%\n___________\n(1)\nRepresents the results of the portfolio for the time period of our ownership, including the results of non-comparable properties, dispositions through their date of disposal and acquisitions beginning as of the date of acquisition.\nHotel Business Mix \nOur customers fall into three broad categories: transient, group, and contract business, which accounted for approximately 60%, 36%, and 4%, respectively, of our full year 2024 room sales. The information below is derived from business mix results from the 76 comparable hotels owned as of September 30, 2025, which excludes one hotel that was held-for-sale. For additional detail on our business mix, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our most recent Annual Report on Form 10‑K.\nFor the third quarter and year-to-date 2025, transient revenue increased by 1.7% and 4.6%, respectively, reflecting an increase in average rates of 3.0% and 4.6% for the quarter and year-to-date, respectively, driven by strong transient demand and improving leisure demand on Maui. As anticipated, group revenue decreased by 4.7% and 0.9% for the third quarter and year-to-date, respectively, as a result of planned renovation disruption from the Hyatt Transformational Capital \n38\nProgram and business mix shifting from group to transient in Maui in the first half of the year. In addition, the decline for the third quarter was also affected by a shift in the timing of holidays.\nThe following are the results of our transient, group and contract business:\nQuarter ended September 30, 2025\nYear-to-date ended September 30, 2025\nTransient business\n \nGroup business\n \nContract business\n \nTransient business\n \nGroup business\n \nContract business\n \nRoom nights (in thousands)\n1,535 \n928 \n219 \n4,383 \n3,127 \n616 \nPercent change in room nights vs. same period in 2024\n(1.2\n%)\n(7.8\n%)\n11.6\n%\n—\n%\n(4.7\n%)\n12.5\n%\nRooms revenues (in millions)\n$\n507 \n$\n249 \n$\n46 \n$\n1,571 \n$\n926 \n$\n134 \nPercent change in revenues vs. same period in 2024\n1.7\n%\n(4.7\n%)\n14.5\n%\n4.6\n%\n(0.9\n%)\n18.8\n%\nLiquidity and Capital Resources\nLiquidity and Capital Resources of Host Inc. and Host L.P.\n The liquidity and capital resources of Host Inc. and Host L.P. are derived primarily from the activities of Host L.P., which generates the capital required by our business from hotel operations, the incurrence of debt, the issuance of OP units or the sale of hotels. Host Inc. is a REIT, and its only significant asset is the ownership of general and limited partner interests of Host L.P.; therefore, its financing and investing activities are conducted through Host L.P., except for the issuance of its common and preferred stock. Proceeds from common and preferred stock issuances by Host Inc. are contributed to Host L.P. in exchange for common and preferred OP units. Additionally, funds used by Host Inc. to pay dividends or to repurchase its stock are provided by Host L.P. Therefore, while we have noted those areas in which it is important to distinguish between Host Inc. and Host L.P., we have not included a separate discussion of liquidity and capital resources as the discussion below applies to both Host Inc. and Host L.P. \nOverview.\n We look to maintain a capital structure and liquidity profile with an appropriate balance of cash, debt, and equity to provide financial flexibility given the inherent volatility of the lodging industry. We believe this strategy has resulted in a better cost of debt capital, allowing us to complete opportunistic investments and acquisitions and positioning us to manage potential declines in operations throughout the lodging cycle. We have structured our debt profile to maintain a balanced maturity schedule and to minimize the number of assets that are encumbered by mortgage debt. Currently, only one of our consolidated hotels is encumbered by mortgage debt. We intend to use available cash in the near term predominantly to fund, and believe we have sufficient liquidity to fund, corporate expenses, capital expenditures, hotel acquisitions and dividends and remain well positioned to execute additional investment transactions to the extent opportunities arise. \nCash Requirements.\n We use cash for acquisitions, capital expenditures, debt payments, operating costs, and corporate and other expenses, as well as for dividends and distributions to stockholders and to OP unitholders, respectively, and stock and OP unit repurchases. As a REIT, Host Inc. is required to distribute to its stockholders at least 90% of its taxable income, excluding net capital gain, on an annual basis. Our next significant debt maturity is $400 million of senior notes due in February 2026. We believe we have sufficient liquidity to repay the senior notes at maturity.\nCapital Resources.\n As of September 30, 2025, we had $539 million of cash and cash equivalents, $205 million in our FF&E escrow reserves and $1.5 billion available under the revolver portion of our credit facility. We depend primarily on external sources of capital to finance future growth, including acquisitions. As a result, the liquidity and debt capacity provided by our credit facility and the ability to issue senior unsecured debt are key components of our capital structure. Our financial flexibility, including our ability to incur debt, pay dividends, make distributions and make investments, is contingent on our ability to maintain compliance with the financial covenants of our credit facility and senior notes indentures, which include, among other things, the allowable amounts of leverage, interest coverage and fixed charges. \nTwo programs are currently in place relating to potential purchases or sales of our common stock. Under our common stock repurchase program, common stock may be purchased from time to time depending upon market conditions and may be purchased in the open market or through private transactions or by other means, including principal \n39\ntransactions with various financial institutions, like accelerated share repurchases, forwards, options, and similar transactions and through one or more trading plans designed to comply with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended. The plan does not obligate us to repurchase any specific number or any specific dollar amount of shares and may be suspended at any time at our discretion. There were no share repurchases during the third quarter of 2025. At September 30, 2025, we had $480 million available for repurchase under our program. \nIn addition, on May 31, 2023, we entered into a distribution agreement with J.P. Morgan Securities LLC, BofA Securities, Inc., Goldman Sachs & Co. LLC, Jefferies LLC, Morgan Stanley & Co. LLC, Scotia Capital (USA) Inc., Truist Securities, Inc. and Wells Fargo Securities, LLC, as sales agents pursuant to which Host Inc. may offer and sell, from time to time, shares of Host Inc. common stock having an aggregate offering price of up to $600 million. The sales will be made in transactions that are deemed to be “at the market” offerings under the SEC rules. We may sell shares of Host Inc. common stock under this program from time to time based on market conditions, although we are not under an obligation to sell any shares. We may sell shares when we believe conditions are advantageous and there is a compelling use of proceeds, including to fund future potential acquisitions or other investment opportunities. The agreement also contemplates that, in addition to the offering and sale of shares to or through the sales agents, we may enter into separate forward sale agreements with each of the forward purchasers named in the agreement. No shares were issued during the third quarter of 2025. As of September 30, 2025, there was $600 million of remaining capacity under the agreement. \nGiven the total amount of our debt and our maturity schedule, we may continue to redeem or repurchase senior notes from time to time, taking advantage of favorable market conditions. In February 2023, Host Inc.’s Board of Directors authorized repurchases of up to $1.0 billion of senior notes other than in accordance with their respective terms, of which the entire amount remains available under this authority. We may purchase senior notes with cash through open market purchases, privately negotiated transactions, a tender offer, or, in some cases, through the early redemption of such securities pursuant to their terms. Repurchases of debt will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. Any retirement before the maturity date will affect earnings and NAREIT FFO per diluted share as a result of the payment of any applicable call premiums and the accelerated expensing of previously deferred and capitalized financing costs. Accordingly, considering our priorities in managing our capital structure and liquidity profile, and given prevailing conditions and relative pricing in the capital markets, we may, at any time, subject to applicable securities laws and the requirements of our credit facility and senior notes indentures, be considering, or be in discussions with respect to, the repurchase or issuance of exchangeable debentures and/or senior notes or the repurchase or sale of our common stock. Any such transactions may, subject to applicable securities laws, occur simultaneously. \nWe continue to explore potential acquisitions and dispositions. We anticipate that any such future acquisitions will be funded by cash, debt issuances by Host L.P., equity offerings of Host Inc., issuances of OP units by Host L.P., or proceeds from sales of hotels. Given the nature of these transactions, we can make no assurances that we will be successful in acquiring any one or more hotels that we may review, bid on or negotiate to purchase or that we will be successful in disposing of any one or more of our hotels. We may acquire additional hotels or dispose of hotels through various structures, including transactions involving single assets, portfolios, joint ventures, acquisitions of the securities or assets of other REITs or distributions of hotels to our stockholders.\nSources and Uses of Cash.\n Our sources of cash generally include cash from operations, proceeds from debt and equity issuances, and proceeds from hotel sales. Uses of cash include acquisitions, capital expenditures, operating costs, debt repayments, and repurchases of shares and distributions to equity holders. \nCash Provided by Operating Activities.\n Year-to-date in 2025, net cash provided by operating activities was $967 million compared to $1,167 million for year-to-date in 2024. The decrease was due to payments for condominium inventory and increased interest payments, which offset increases in cash from improved operations at our properties.\nCash Used in Investing Activities.\n Net cash used in investing activities was $300 million for year-to-date in 2025 compared to $1,851 million for year-to-date in 2024. Cash used in investing activities year-to-date in 2025 and 2024 included $454 million and $375 million of capital expenditures, respectively, as well as investments in our joint ventures, while 2024 also included the acquisition of four hotels for approximately $1.5 billion. Cash provided by investing activities in 2025 included proceeds from the sale of two hotels and the repayment of a note receivable. \n40\nThe following table summarizes significant dispositions that have been completed through November 5, 2025 (in millions):\nTransaction Date\nDescription of Transaction\nNet Proceeds⁽¹⁾\nSales Price\nDispositions/Return of Investments in Affiliates\nSeptember\n2025\nDisposition of Asia/Pacific joint venture's interest in the India JV⁽²⁾\n$\n17 \n$\n17 \nAugust\n2025\nDisposition of Washington Marriott at Metro Center⁽³⁾\n59 \n177 \nJune\n2025\nDisposition of The Westin Cincinnati\n58 \n60 \nFebruary\n2025\nReceipt of The Camby, Autograph Collection note receivable⁽⁴⁾\n79 \n— \n \nTotal\n$\n213 \n$\n254 \n___________\n(1)\nProceeds are net of transfer taxes, other sales costs, and FF&E replacement funds deposited directly to the property or hotel manager by the purchaser.\n(2)\nRepresents Host's portion to be received from the Asia/Pacific joint venture's sale of a 36% share in seven hotels and an office building in India for approximately INR 6.2 billion ($70 million).\n(3)\nIn connection with the sale of Washington Marriott at Metro Center, we issued a loan to the purchaser with a principal balance of $114 million. The disposition proceeds shown are net of the loan and $2 million of FF&E funds retained by us.\n(4)\nIn connection with the sale of The Camby, Autograph Collection, we issued a loan to the purchaser. The loan was repaid in February 2025.\nCash Provided by (Used in) Financing Activities.\n Year-to-date in 2025, net cash used in financing activities was $723 million compared to cash provided by financing activities of $129 million for year-to-date in 2024. Cash used in financing activities in both 2025 and 2024 primarily related to the payment of common stock dividends, common stock repurchases, and the repayment of senior notes. Cash provided by financing activities year-to-date in both 2025 and 2024 included the proceeds from the issuance of new senior notes.\nThe following table summarizes significant debt issuances, net of deferred financing costs and issuance discounts, that have been completed through November 5, 2025 (in millions):\nTransaction Date\nDescription of Transaction\nNet Proceeds\nDebt Issuances\nMay\n2025\nIssuance of $500 million 5.7% Series M senior notes\n$\n490 \n \nTotal issuances\n$\n490 \nThe following table summarizes significant debt repayments that have been completed through November 5, 2025 (in millions):\nTransaction Date\nDescription of Transaction\nTransaction Amount\nDebt Repayments\nMay\n2025\nRepayment of $500 million 4% Series E senior notes\n$\n(500)\n \nTotal cash repayments\n$\n(500)\nThe following table summarizes significant equity transactions that have been completed through November 5, 2025 (in millions):\nTransaction Date\nDescription of Transaction\nTransaction Amount\nEquity of Host Inc.\nJanuary - October\n2025\nDividend payment⁽¹⁾⁽²⁾\n$\n(623)\nJanuary - June\n2025\nRepurchase of 13.1 million shares of Host Inc. common stock\n(205)\n \nCash payments on equity transactions\n$\n(828)\n___________\n(1)\nIn connection with the dividend payments, Host L.P. made distributions of $631 million to its common OP unit holders.\n(2)\nIncludes the fourth quarter 2024 dividend that was paid in January 2025.\n41\nDebt \nAs of September 30, 2025, our total debt was $5.1 billion, with a weighted average interest rate of 4.9% and a weighted average maturity of 5.2 years. Additionally, 80% of our debt has a fixed rate of interest, and only one of our consolidated hotels is encumbered by mortgage debt.\nFinancial Covenants \nCredit Facility Covenants.\n Our credit facility contains certain important financial covenants concerning allowable leverage, unsecured interest coverage, and required fixed charge coverage. Total debt used in the calculation of our ratio of consolidated total debt to consolidated EBITDA (our “Leverage Ratio”) is based on a “net debt” concept, pursuant to which cash and cash equivalents in excess of $100 million are deducted from our total debt balance for purposes of measuring compliance. \nAt September 30, 2025, we were in compliance with all of our financial covenants under the credit facility. The following table summarizes the results of the financial tests required by the credit facility, which are calculated on a trailing twelve-month basis: \nActual Ratio\nCovenant Requirement\n for all years\nLeverage ratio\n2.8x\nMaximum ratio of 7.25x\nFixed charge coverage ratio\n5.3x\nMinimum ratio of 1.25x\nUnsecured interest coverage ratio ⁽¹⁾\n6.9x\nMinimum ratio of 1.75x\n___________\n(1)\nIf, at any time, our leverage ratio is above 7.0x, our minimum unsecured interest coverage ratio will decrease to 1.50x. \nSenior Notes Indenture Covenants \nThe following table summarizes the results of the financial tests required by the indentures for our senior notes and our actual credit ratios as of September 30, 2025: \nActual Ratio\nCovenant Requirement\nUnencumbered assets tests\n446\n%\nMinimum ratio of 150%\nTotal indebtedness to total assets\n22\n%\nMaximum ratio of 65%\nSecured indebtedness to total assets\n<1%\nMaximum ratio of 40%\nEBITDA-to-interest coverage ratio\n6.8x\nMinimum ratio of 1.5x\nFor additional details on our credit facility and senior notes, see our Annual Report on Form 10-K for the year ended December 31, 2024. \nDividend Policy\nHost Inc. is required to distribute at least 90% of its annual taxable income, excluding net capital gains, to its stockholders in order to maintain its qualification as a REIT. Funds used by Host Inc. to pay dividends on its common stock are provided by distributions from Host L.P. As of September 30, 2025, Host Inc. is the owner of approximately 99% of the Host L.P. common OP units. The remaining common OP units are owned by unaffiliated limited partners. Each Host L.P. common OP unit may be redeemed for cash or, at the election of Host Inc., Host Inc. common stock based on the conversion ratio. The current conversion ratio is 1.021494 shares of Host Inc. common stock for each Host L.P. common OP unit. \nInvestors should consider the non-controlling interests in the Host L.P. common OP units when analyzing dividend payments by Host Inc. to its stockholders, as these Host L.P. common OP unitholders share, on a pro rata basis, in amounts being distributed by Host L.P. to all of its common OP unitholders. For example, if Host Inc. paid a $1 per share \n42\ndividend on its common stock, it would be based on the payment of a $1.021494 per common OP unit distribution by Host L.P. to Host Inc., as well as to the other unaffiliated Host L.P. common OP unitholders. \nHost Inc.’s policy on common dividends generally is to distribute, over time, 100% of its taxable income, which primarily is dependent on Host Inc.’s results of operations, as well as tax gains and losses on hotel sales. On September 11, 2025, Host Inc.'s Board of Directors announced a regular quarterly cash dividend of $0.20 per share on Host Inc.'s common stock. The dividend was paid on October 15, 2025 to stockholders of record on September 30, 2025. All future dividends are subject to Board approval.\nCritical Accounting Estimates\nOur unaudited condensed consolidated financial statements have been prepared in conformity with GAAP, which requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of our financial statements and the reported amounts of revenues and expenses during the reporting period. While we do not believe that the reported amounts would be materially different, application of these policies involves the exercise of judgment and the use of assumptions as to future uncertainties and, as a result, actual results could differ from these estimates. We evaluate our estimates and judgments on an ongoing basis. We base our estimates on experience and on various other assumptions that we believe are reasonable under the circumstances. All of our significant accounting policies, including certain critical accounting policies, are disclosed in our Annual Report on Form 10-K for the year ended December 31, 2024. \nComparable Hotel Operating Statistics and Results\nTo facilitate a year-to-year comparison of our operations, we present certain operating statistics (i.e., Total RevPAR, RevPAR, average daily rate and average occupancy) and operating results (revenues, expenses, hotel EBITDA and associated margins) for the periods included in our reports on a comparable hotel basis in order to enable our investors to better evaluate our operating performance. We define our comparable hotels as those that: (i) are owned or leased by us as of the reporting date and are not classified as held-for-sale; and (ii) have not sustained substantial property damage or business interruption, or undergone large-scale capital projects, in each case requiring closures lasting one month or longer (as further defined below), during the reporting periods being compared.\nWe make adjustments to include recent acquisitions to include results for periods prior to our ownership. For these hotels, since the year-over-year comparison includes periods prior to our ownership, the changes will not necessarily correspond to changes in our actual results. Additionally, operating results of hotels that we sell are excluded from the comparable hotel set once the transaction has closed or the hotel is classified as held-for-sale.\nThe hotel business is capital-intensive, and renovations are a regular part of the business. Generally, hotels under renovation remain comparable hotels. A large-scale capital project would cause a hotel to be excluded from our comparable hotel set if it requires the entire property to be closed to hotel guests for one month or longer.\nSimilarly, hotels are excluded from our comparable hotel set from the date that they sustain substantial property damage or business interruption if it requires the property to be closed to hotel guests for one month or longer. In each case, these hotels are returned to the comparable hotel set when the operations of the hotel have been included in our consolidated results for one full calendar year after the hotel has reopened. Often, related to events that cause property damage and the closure of a hotel, we will collect business interruption insurance proceeds for the near-term loss of business. These proceeds are included in net gain on insurance settlements on our condensed consolidated statements of operations. Business interruption insurance gains covering lost revenues while the property was considered non-comparable also will be excluded from the comparable hotel results.\n43\nOf the 79 hotels that we owned as of September 30, 2025, 76 have been classified as comparable hotels. The operating results of the following properties that we owned, and that were not classified as held-for-sale, as of September 30, 2025 are excluded from comparable hotel results for these periods:\n•\nThe Don CeSar (business disruption due to Hurricane Helene resulting in closure of the hotel beginning at the end of September 2024, reopened in March 2025);\n•\nAlila Ventana Big Sur (business disruption due to the collapse of a portion of Highway 1, causing closure of the hotel beginning in March 2024, reopened in May 2024); and\n•\nOperations related to the development and sale of condominium units on a development parcel adjacent to Four Seasons Resort Orlando at Walt Disney World® Resort.\nAt September 30, 2025, The St. Regis Houston is classified as held-for-sale. Therefore, the results of this hotel are excluded from comparable hotel operating statistics and results.\nForeign Currency Translation\nOperating results denominated in foreign currencies are translated using the prevailing exchange rates on the date of the transaction, or monthly based on the weighted average exchange rate for the period. Therefore, hotel statistics and results for non-U.S. properties include the effect of currency fluctuations, consistent with our financial statement presentation.\nNon-GAAP Financial Measures \nWe use certain “non-GAAP financial measures,” which are measures of our historical financial performance that are not calculated and presented in accordance with GAAP, within the meaning of applicable SEC rules. These measures include the following: \n•\nEarnings Before Interest Expense, Income Taxes, Depreciation and Amortization (“EBITDA”), Earnings Before Interest Expense, Income Taxes, Depreciation and Amortization for real estate (“EBITDA\nre\n”)\n \nand Adjusted EBITDA\nre\n, as a measure of performance for Host Inc. and Host L.P., \n•\nFunds From Operations (“FFO”) and FFO per diluted share, both calculated in accordance with National Association of Real Estate Investment Trusts (“NAREIT”) guidelines and with certain adjustments from those guidelines, as a measure of performance for Host Inc., and\n•\nComparable hotel operating results, as a measure of performance for Host Inc. and Host L.P.\nThe discussion below defines these measures and presents why we believe they are useful supplemental measures of our performance. \nSet forth below for each such non-GAAP financial measure is a reconciliation of the measure with the financial measure calculated and presented in accordance with GAAP that we consider most directly comparable thereto. We also have included in “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Non-GAAP Financial Measures” in our Annual Report on Form 10-K for the year ended December 31, 2024 further explanations of the adjustments being made, a statement disclosing the reasons why we believe the presentation of each of the non-GAAP financial measures provide useful information to investors regarding our financial condition and results of operations, the additional purposes for which we use the non-GAAP financial measures and limitations on their use. \nEBITDA, EBITDAre and Adjusted EBITDAre \nEBITDA\nEBITDA is a commonly used measure of performance in many industries. Management believes EBITDA provides useful information to investors regarding our results of operations because it helps us and our investors evaluate the ongoing operating performance of our properties after removing the impact of our capital structure (primarily interest expense) and our asset base (primarily depreciation and amortization). Management also believes the use of EBITDA facilitates comparisons between us and other lodging REITs, hotel owners that are not REITs and other capital-intensive companies. Management uses EBITDA to evaluate property-level results and as one measure in determining the value of \n44\nacquisitions and dispositions and, like FFO and Adjusted FFO per diluted share, it is widely used by management in the annual budget process and for compensation programs. \nEBITDAre and Adjusted EBITDAre \nWe present EBITDA\nre\n in accordance with NAREIT guidelines, as defined in its September 2017 white paper “Earnings Before Interest, Taxes, Depreciation and Amortization for Real Estate,” to provide an additional performance measure to facilitate the evaluation and comparison of our results with other REITs. NAREIT defines EBITDA\nre\n as net income (calculated in accordance with GAAP) excluding interest expense, income tax, depreciation and amortization, gains or losses on disposition of depreciated property (including gains or losses on change of control), impairment expense for depreciated property and of investments in unconsolidated affiliates caused by a decrease in value of depreciated property in the affiliate, and adjustments to reflect the entity’s pro rata share of EBITDA\nre\n of unconsolidated affiliates. \nWe make additional adjustments to EBITDA\nre\n when evaluating our performance because we believe that the exclusion of certain additional items described below provides useful supplemental information to investors regarding our ongoing operating performance. We believe that the presentation of Adjusted EBITDA\nre\n, when combined with the primary GAAP presentation of net income, is beneficial to an investor’s understanding of our operating performance. Adjusted EBITDA\nre\n also is similar to the measure used to calculate certain credit ratios for our credit facility and senior notes. We adjust EBITDA\nre\n for the following items, which may occur in any period, and refer to this measure as Adjusted EBITDA\nre\n: \n•\nProperty Insurance Gains and Property Damage Losses\n – We exclude the effect of property insurance gains reflected in our condensed consolidated statements of operations because we believe that including them in Adjusted EBITDA\nre\n is not consistent with reflecting the ongoing performance of our assets. In addition, property insurance gains could be less important to investors given that the depreciated asset book value written off in connection with the calculation of the property insurance gain often does not reflect the market value of real estate assets. Similarly, losses from property damage or remediation costs that are not covered through insurance are excluded.\n•\nAcquisition Costs\n – Under GAAP, costs associated with completed property acquisitions that are considered business combinations are expensed in the year incurred. We exclude the effect of these costs because we believe they are not reflective of the ongoing performance of the Company. \n•\nLitigation Gains and Losses\n – We exclude the effect of gains or losses associated with litigation recorded under GAAP that we consider to be outside the ordinary course of business. We believe that including these items is not consistent with our ongoing operating performance.\n•\nSeverance Expense \n– In certain circumstances, we will add back hotel-level severance expenses when we do not believe that such expenses are reflective of the ongoing operation of our properties. Situations that would result in a severance add-back include, but are not limited to: (i) costs incurred as part of a broad-based reconfiguration of the operating model with the specific hotel operator for a portfolio of hotels and (ii) costs incurred at a specific hotel due to a broad-based and significant reconfiguration of a hotel and/or its workforce. We do not add back corporate-level severance costs or severance costs at an individual hotel that we consider to be incurred in the normal course of business.\n•\nEffective January 1, 2025, we exclude the expense recorded for non-cash stock-based compensation, as it represents a non-cash transaction and the add back is consistent with the calculation of Adjusted EBITDA for our financial covenant ratios under our credit facility and senior notes indentures and consistent with the presentation of Adjusted EBITDA\nre\n for the majority of other lodging REIT filers. \nIn unusual circumstances, we also may adjust EBITDA\nre\n for gains or losses that management believes are not representative of the Company’s current operating performance. The last adjustment of this nature was a 2013 exclusion of a gain from an eminent domain claim. \nThe following table provides a reconciliation of EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n to net income, the financial measure calculated and presented in accordance with GAAP that we consider the most directly comparable: \n45\nReconciliation of Net Income to EBITDA, EBITDA\nre\n and Adjusted EBITDA\nre\n for Host Inc. and Host L.P. \n(in millions) \nQuarter ended September 30,\nYear-to-date ended September 30,\n2025\n2024\n2025\n2024\nNet income⁽¹⁾\n$\n163 \n$\n84 \n$\n639 \n$\n598 \nInterest expense\n60 \n59 \n175 \n156 \nDepreciation and amortization\n196 \n197 \n587 \n565 \nIncome taxes\n9 \n6 \n35 \n20 \nEBITDA⁽¹⁾\n428 \n346 \n1,436 \n1,339 \nGain on dispositions⁽²⁾\n(122)\n— \n(143)\n— \nEquity investment adjustments:\nEquity in earnings of affiliates\n(2)\n(2)\n(16)\n(12)\nPro rata EBITDAre of equity investments⁽³⁾\n10 \n9 \n36 \n32 \nEBITDAre⁽¹⁾\n314 \n353 \n1,313 \n1,359 \nAdjustments to EBITDAre:\nNet gain on property insurance settlements\n— \n(29)\n— \n(76)\nNon-cash stock-based compensation expense⁽⁴⁾\n5 \n6 \n16 \n17 \nAdjusted EBITDAre⁽¹⁾\n$\n319 \n$\n330 \n$\n1,329 \n$\n1,300 \n___________\n(1)\nNet income, EBITDA, EBITDA\nre\n, Adjusted EBITDA\nre\n, NAREIT FFO and Adjusted FFO for the year-to-date ended September 30, 2025 include a gain of $4 million from the sale of land adjacent to The Phoenician hotel.\n(2)\nReflects the sale of two hotels in 2025, and the sale of the Asia/Pacific joint venture's interest in two separate joint ventures in India in the third quarter of 2025, representing our exit from our Asia investment.\n(3)\nUnrealized gains of our unconsolidated investments are not recognized in our EBITDA\nre\n, Adjusted EBITDA\nre\n, NAREIT FFO or Adjusted FFO until they have been realized by the unconsolidated partnership.\n(4)\nEffective January 1, 2025, we exclude the expense recorded for non-cash stock-based compensation, as it represents a non-cash transaction and the add back is consistent with the calculation of Adjusted EBITDA for our financial covenant ratios. Prior year results have been updated to conform with the current year presentation. \nFFO Measures \nWe present NAREIT FFO and NAREIT FFO per diluted share as non-GAAP measures of our performance in addition to our earnings per share (calculated in accordance with GAAP). We calculate NAREIT FFO per diluted share as our NAREIT FFO (defined as set forth below) for a given operating period, as adjusted for the effect of dilutive securities, divided by the number of fully diluted shares outstanding during such period, in accordance with NAREIT guidelines. As noted in NAREIT’s Funds From Operations White Paper – 2018 Restatement. NAREIT defines FFO as net income (calculated in accordance with GAAP) excluding depreciation and amortization related to certain real estate assets, gains and losses from the sale of certain real estate assets, gains and losses from change in control, impairment expense of certain real estate assets and investments and adjustments for consolidated partially owned entities and unconsolidated affiliates. Adjustments for consolidated partially owned entities and unconsolidated affiliates are calculated to reflect our pro rata share of the FFO of those entities on the same basis.\nWe also present Adjusted FFO per diluted share when evaluating our performance because management believes that the exclusion of certain additional items described below provides useful supplemental information to investors regarding our ongoing operating performance. Management historically has made the adjustments detailed below in evaluating our performance, in our annual budget process and for our compensation programs. We believe that the presentation of Adjusted FFO per diluted share, when combined with both the primary GAAP presentation of diluted earnings per share and FFO per diluted share as defined by NAREIT, provides useful supplemental information that is beneficial to an investor’s understanding of our operating performance. We adjust NAREIT FFO per diluted share for the following items, which may occur in any period, and refer to this measure as Adjusted FFO per diluted share: \n•\nGains and Losses on the Extinguishment of Debt\n – We exclude the effect of finance charges and premiums associated with the extinguishment of debt, including the acceleration of the write-off of deferred financing costs from the original issuance of the debt being redeemed or retired and incremental \n46\ninterest expense incurred during the refinancing period. We also exclude the gains on debt repurchases and the original issuance costs associated with the retirement of preferred stock. We believe that these items are not reflective of our ongoing finance costs. \n•\nAcquisition Costs\n – Under GAAP, costs associated with completed property acquisitions that are considered business combinations are expensed in the year incurred. We exclude the effect of these costs because we believe they are not reflective of the ongoing performance of the Company. \n•\nLitigation Gains and Losses\n – We exclude the effect of gains or losses associated with litigation recorded under GAAP that we consider to be outside the ordinary course of business. We believe that including these items is not consistent with our ongoing operating performance. \n•\nSeverance Expense –\n In certain circumstances, we will add back hotel-level severance expenses when we do not believe that such expenses are reflective of the ongoing operation of our properties. Situations that would result in a severance add-back include, but are not limited to, (i) costs incurred as part of a broad-based reconfiguration of the operating model with the specific hotel operator for a portfolio of hotels and (ii) costs incurred at a specific hotel due to a broad-based and significant reconfiguration of a hotel and/or its workforce. We do not add back corporate-level severance costs or severance costs at an individual hotel that we consider to be incurred in the normal course of business.\n•\nEffective January 1, 2025, we exclude the expense recorded for non-cash stock-based compensation, as it represents a non-cash transaction and the add back is consistent with the calculation of Adjusted EBITDA for our financial covenant ratios under our credit facility and senior notes indentures and consistent with the presentation of Adjusted FFO per diluted share for the majority of other lodging REIT filers.\nIn unusual circumstances, we also may adjust NAREIT FFO for gains or losses that management believes are not representative of our current operating performance. For example, in 2017, as a result of the reduction of the U.S. federal corporate income tax rate from 35% to 21% by the Tax Cuts and Jobs Act, we remeasured our domestic deferred tax assets as of December 31, 2017 and recorded a one-time adjustment to reduce our deferred tax assets and to increase the provision for income taxes by approximately $11 million. We do not consider this adjustment to be reflective of our ongoing operating performance and, therefore, we excluded this item from Adjusted FFO.\nThe following table provides a reconciliation of the differences between our non-GAAP financial measures, NAREIT FFO and Adjusted FFO (separately and on a per diluted share basis), and net income, the financial measure calculated and presented in accordance with GAAP that we consider most directly comparable: \n47\nHost Inc. Reconciliation of Diluted Earnings per Common Share to \nNAREIT and Adjusted Funds From Operations per Diluted Share\n(in millions, except per share amount) \nQuarter ended September 30,\nYear-to-date ended September 30,\n2025\n2024\n2025\n2024\nNet income⁽¹⁾\n$\n163 \n$\n84 \n$\n639 \n$\n598 \nLess: Net income attributable to non-controlling interests\n(2)\n(2)\n(9)\n(9)\nNet income attributable to Host Inc.\n161 \n82 \n630 \n589 \nAdjustments:\nGain on dispositions⁽²⁾\n(122)\n— \n(143)\n— \nNet gain on property insurance settlements\n— \n(29)\n— \n(76)\nDepreciation and amortization\n196 \n197 \n586 \n564 \nEquity investment adjustments: \nEquity in earnings of affiliates\n(2)\n(2)\n(16)\n(12)\nPro rata FFO of equity investments⁽³⁾\n4 \n5 \n20 \n18 \nConsolidated partnership adjustments: \nFFO adjustments for non-controlling partnerships\n(1)\n(1)\n(1)\n(1)\nFFO adjustments for non-controlling interests of Host L.P.\n(1)\n(2)\n(6)\n(7)\nNAREIT FFO⁽¹⁾\n235 \n250 \n1,070 \n1,075 \nAdjustments to NAREIT FFO:\nNon-cash stock-based compensation expense⁽⁴⁾\n5 \n6 \n16 \n17 \nAdjusted FFO⁽¹⁾\n$\n240 \n$\n256 \n$\n1,086 \n$\n1,092 \nFor calculation on a per share basis:⁽\n5\n⁾\nDiluted weighted average shares outstanding - EPS, NAREIT FFO and Adjusted FFO\n689.5\n702.4\n694.5\n704.7\nDiluted earnings per common share\n$\n0.23 \n$\n0.12 \n$\n0.91 \n$\n0.84 \nNAREIT FFO per diluted share\n$\n0.34 \n$\n0.36 \n$\n1.54 \n$\n1.53 \nAdjusted FFO per diluted share\n$\n0.35 \n$\n0.36 \n$\n1.56 \n$\n1.55 \n___________\n(1-4)\nRefer to the corresponding footnote on the Reconciliation of Net Income to EBITDA, EBITDA\nre\n and Adjusted EBITDA\nre\n for Host Inc. and Host L.P.\n(5)\nDiluted earnings per common share, NAREIT FFO per diluted share and Adjusted FFO per diluted share are adjusted for the effects of dilutive securities. Dilutive securities may include shares granted under comprehensive stock plans, preferred OP units held by non-controlling limited partners and other non-controlling interests that have the option to convert their limited partner interests to common OP units. No effect is shown for securities if they are anti-dilutive.\nComparable Hotel Property-Level Operating Results\nWe present certain operating results for our hotels, such as hotel revenues, expenses, food and beverage profit, and EBITDA (and the related margins), on a comparable hotel, or \"same store,\" basis as supplemental information for our investors. Our comparable hotel results present operating results for our hotels without giving effect to dispositions or properties that experienced closures due to renovations or property damage, as discussed in “Comparable Hotel Operating Statistics and Results” above. We present comparable hotel EBITDA to help us and our investors evaluate the ongoing operating performance of our comparable hotels after removing the impact of our capital structure (primarily interest expense) and our asset base (primarily depreciation and amortization expense). Corporate-level costs and expenses also are \n48\nremoved to arrive at property-level results. We believe these property-level results provide investors with supplemental information about the ongoing operating performance of our comparable hotels. Comparable hotel results are presented both by location and for our properties in the aggregate. We eliminate from our comparable hotel level operating results severance costs related to broad-based and significant property-level reconfiguration that is not considered to be within the normal course of business, as we believe this elimination provides useful supplemental information that is beneficial to an investor’s understanding of our ongoing operating performance. We also eliminate depreciation and amortization expense because, even though depreciation and amortization expense are property-level expenses, these non-cash expenses, which are based on historical cost accounting for real estate assets, implicitly assume that the value of real estate assets diminishes predictably over time. As noted earlier, because real estate values historically have risen or fallen with market conditions, many real estate industry investors have considered presentation of historical cost accounting for operating results to be insufficient. \nBecause of the elimination of corporate-level costs and expenses, gains or losses on disposition, certain severance expenses and depreciation and amortization expense, the comparable hotel operating results we present do not represent our total revenues, expenses, operating profit or net income and should not be used to evaluate our performance as a whole. Management compensates for these limitations by separately considering the impact of these excluded items to the extent they are material to operating decisions or assessments of our operating performance. Our condensed consolidated statements of operations include such amounts, all of which should be considered by investors when evaluating our performance.\nWe present these hotel operating results on a comparable hotel basis because we believe that doing so provides investors and management with useful information for evaluating the period-to-period performance of our hotels and facilitates comparisons with other hotel REITs and hotel owners. In particular, these measures assist management and investors in distinguishing whether increases or decreases in revenues and/or expenses are due to growth or decline of operations at comparable hotels (which represent the vast majority of our portfolio) or from other factors. While management believes that presentation of comparable hotel results is a supplemental measure that provides useful information in evaluating our ongoing performance, this measure is not used to allocate resources or to assess the operating performance of each of our hotels, as these decisions are based on data for individual hotels and are not based on comparable hotel results in the aggregate. For these reasons, we believe comparable hotel operating results, when combined with the presentation of GAAP operating profit, revenues and expenses, provide useful information to investors and management. \nThe following tables present certain operating results and statistics for our hotels for the periods presented herein and a reconciliation of the differences between comparable Hotel EBITDA, a non-GAAP financial measure, and net income, the financial measure calculated and presented in accordance with GAAP that we consider most directly comparable. Similar reconciliations of the differences between (i) hotel revenues and (ii) our revenues as calculated and presented in accordance with GAAP (each of which is used in the applicable margin calculation), and between (iii) hotel expenses and (iv) operating costs and expenses as calculated and presented in accordance with GAAP, also are included in the reconciliation:\n49\nComparable Hotel Results for Host Inc. and Host L.P.\n(in millions, except hotel statistics) \n \nQuarter ended September 30,\nYear-to-date ended September 30,\n2025\n2024\n2025\n2024\nNumber of hotels\n76 \n76 \n76 \n76 \nNumber of rooms\n41,837 \n41,837 \n41,837 \n41,837 \nChange in comparable hotel Total RevPAR\n0.8\n%\n—\n3.7\n%\n—\nChange in comparable hotel RevPAR\n0.2\n%\n—\n3.5\n%\n—\nOperating profit margin⁽¹⁾\n7.6\n%\n10.2\n%\n14.7\n%\n16.9\n%\nComparable hotel EBITDA margin⁽¹⁾\n23.9\n%\n24.4\n%\n29.2\n%\n29.6\n%\nFood and beverage profit margin⁽¹⁾\n23.6\n%\n26.8\n%\n32.0\n%\n34.0\n%\nComparable hotel food and beverage profit margin⁽¹⁾\n24.1\n%\n26.6\n%\n32.4\n%\n33.7\n%\nNet income\n$\n163 \n$\n84 \n$\n639 \n$\n598 \nDepreciation and amortization\n196 \n197 \n587 \n565 \nInterest expense\n60 \n59 \n175 \n156 \nProvision for income taxes\n9 \n6 \n35 \n20 \nGain on sale of property and corporate level income/expense\n(104)\n(18)\n(103)\n(51)\nProperty transaction adjustments⁽²⁾\n— \n(3)\n(13)\n21 \nNon-comparable hotel results, net⁽³⁾\n(15)\n(12)\n(37)\n(51)\nComparable hotel EBITDA\n$\n309 \n$\n313 \n$\n1,283 \n$\n1,258 \n___________\n(1)\nProfit margins are calculated by dividing the applicable operating profit by the related revenue amount. GAAP profit margins are calculated using amounts presented in the unaudited condensed consolidated statements of operations. Comparable hotel margins are calculated using amounts presented in the following tables, which include reconciliations to the applicable GAAP results:\nQuarter ended September 30, 2025\nQuarter ended September 30, 2024\nAdjustments\n \nAdjustments\n \nGAAP Results\n \nProperty transaction\nadjustments⁽²⁾ \nNon-comparable hotel\nresults, net ⁽³⁾ \nDepreciation and corporate\nlevel items \nComparable hotel Results\n \nGAAP Results\n \nProperty transaction\nadjustments⁽²⁾ \nNon-comparable hotel\nresults, net ⁽³⁾ \nDepreciation and corporate\nlevel items \nComparable hotel Results\n \nRevenues\nRoom\n$\n826 \n$\n(6)\n$\n(18)\n$\n— \n$\n802 \n$\n825 \n$\n(8)\n$\n(17)\n$\n— \n$\n800 \nFood and beverage\n364 \n(2)\n(7)\n— \n355 \n365 \n— \n(9)\n— \n356 \nOther\n141 \n(1)\n(4)\n— \n136 \n129 \n2 \n(5)\n— \n126 \nTotal revenues\n1,331 \n(9)\n(29)\n— \n1,293 \n1,319 \n(6)\n(31)\n— \n1,282 \nExpenses\nRoom\n222 \n(2)\n(2)\n— \n218 \n216 \n(1)\n(3)\n— \n212 \nFood and beverage\n278 \n(2)\n(7)\n— \n269 \n267 \n1 \n(7)\n— \n261 \nOther\n512 \n(5)\n(10)\n— \n497 \n508 \n(3)\n(9)\n— \n496 \nDepreciation and amortization\n196 \n— \n— \n(196)\n— \n197 \n— \n— \n(197)\n— \nCorporate and other expenses\n27 \n— \n— \n(27)\n— \n25 \n— \n— \n(25)\n— \nNet gain on insurance settlements\n(5)\n— \n5 \n— \n— \n(29)\n— \n— \n29 \n— \nTotal expenses\n1,230 \n(9)\n(14)\n(223)\n984 \n1,184 \n(3)\n(19)\n(193)\n969 \nOperating Profit - Comparable hotel EBITDA\n$\n101 \n$\n— \n$\n(15)\n$\n223 \n$\n309 \n$\n135 \n$\n(3)\n$\n(12)\n$\n193 \n$\n313 \n50\nYear-to-date ended September 30, 2025\nYear-to-date ended September 30, 2024\nAdjustments\n \nAdjustments\nGAAP Results\n \nProperty transaction\nadjustments⁽²⁾ \nNon-comparable hotel\nresults, net ⁽³⁾ \nDepreciation and corporate\nlevel items \nComparable hotel Results\n \nGAAP Results\n \nProperty transaction\nadjustments⁽²⁾ \nNon-comparable hotel\nresults, net ⁽³⁾ \nDepreciation and corporate\nlevel items \nComparable hotel Results\n \nRevenues\nRoom\n$\n2,713 \n$\n(41)\n$\n(41)\n$\n— \n$\n2,631 \n$\n2,563 \n$\n37 \n$\n(50)\n$\n— \n$\n2,550 \nFood and beverage\n1,345 \n(12)\n(17)\n— \n1,316 \n1,285 \n25 \n(29)\n— \n1,281 \nOther\n453 \n(4)\n(8)\n— \n441 \n408 \n20 \n(14)\n— \n414 \nTotal revenues\n4,511 \n(57)\n(66)\n— \n4,388 \n4,256 \n82 \n(93)\n— \n4,245 \nExpenses\nRoom\n680 \n(9)\n(8)\n— \n663 \n632 \n11 \n(9)\n— \n634 \nFood and beverage\n914 \n(9)\n(15)\n— \n890 \n848 \n21 \n(19)\n— \n850 \nOther\n1,608 \n(26)\n(30)\n— \n1,552 \n1,528 \n29 \n(33)\n— \n1,524 \nDepreciation and amortization\n587 \n— \n— \n(587)\n— \n565 \n— \n— \n(565)\n— \nCorporate and other expenses\n83 \n— \n— \n(83)\n— \n81 \n— \n— \n(81)\n— \nNet gain on insurance settlements\n(24)\n— \n24 \n— \n— \n(116)\n— \n19 \n76 \n(21)\nTotal expenses\n3,848 \n(44)\n(29)\n(670)\n3,105 \n3,538 \n61 \n(42)\n(570)\n2,987 \nOperating Profit - Comparable hotel EBITDA\n$\n663 \n$\n(13)\n$\n(37)\n$\n670 \n$\n1,283 \n$\n718 \n$\n21 \n$\n(51)\n$\n570 \n$\n1,258 \n(2)\nProperty transaction adjustments represent the following items: (i) the elimination of results of operations of hotels sold or held-for-sale as of September 30, 2025, which operations are included in our unaudited condensed consolidated statements of operations as continuing operations, and (ii) the addition of results for periods prior to our ownership for hotels acquired as of September 30, 2025. \n(3)\nNon-comparable hotel results, net, includes the following items: (i) the results of operations of our non-comparable hotels, which operations are included in our condensed consolidated statements of operations as continuing operations, and (ii) gains on business interruption proceeds covering lost revenues while the property was considered non-comparable."
}