{
  "source_file": "hsy-20250928.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nThis Management’s Discussion and Analysis (“MD&A”) is intended to provide an understanding of Hershey’s financial condition, results of operations and cash flows by focusing on changes in certain key measures from year to year.  This MD&A should be read in conjunction with our Unaudited Consolidated Financial Statements and accompanying notes included in this Quarterly Report on Form 10-Q for the quarterly period ended September 28, 2025 (“this Quarterly Report on Form 10-Q”).  This discussion contains a number of forward-looking statements, all of which are based on current expectations.  Actual results may differ materially.  Refer to the Safe Harbor Statement below as well as the Risk Factors and other information contained in our 2024 Annual Report on Form 10-K for information concerning the key risks to achieving future performance goals.\nThe MD&A is organized in the following sections:\n•\nOverview\n•\nTrends Affecting Our Business\n•\nConsolidated Results of Operations\n•\nSegment Results\n•\nLiquidity and Capital Resources\n•\nSafe Harbor Statement\nOVERVIEW\nHershey is a global confectionery leader known for making more moments of goodness through chocolate, sweets, mints and other great tasting snacks.  We are the largest producer of quality chocolate in North America, a leading snack maker in the United States (“U.S.”) and a global leader in chocolate and non-chocolate confectionery.  We market, sell and distribute our products under more than 90 brand names in approximately 70 countries worldwide.\nOur principal product offerings include chocolate and non-chocolate confectionery products; gum and mint refreshment products and protein bars; pantry items, such as baking ingredients, toppings and beverages; and snack items such as spreads, bars, and snack bites and mixes, popcorn and pretzels.\nBusiness Acquisitions\nOn March 31, 2025, we entered into a Merger Agreement to acquire LesserEvil, LLC, a privately held company that produces and sells organic popcorn and puffed snack products to retailers and distributors in the United States and Canada, which complements Hershey’s existing product portfolio.  The Company expects the acquisition to close by the end of 2025, pending the expiration or termination of the applicable waiting period under the Hart-Scott-Rodino Antitrust Improvements Act of 1976 and satisfaction of other customary closing conditions.\nOn November 8, 2024, we completed the acquisition of the Sour Strips brand from Actual Candy, LLC.  Sour Strips is an emerging sour candy brand and is available in a wide range of food distribution channels in the United States.\nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 35\nTRENDS AFFECTING OUR BUSINESS\nThroughout the first\n nine months of 2025, we experienced net sales growth, positive changes in consumer behavior, and price inelasticity despite the persistent dynamic macroeconomic environment. However, increasing inflationary pressures, including ongoing price volatility for select commodities and higher manufacturing costs, continued to challenge the business and led to a decrease in net income.  Despite a strategic pricing action in the third quarter combined with other specific actions taken to mitigate the gross margin pressures, our direct product inputs continue to be the primary incremental cost to our business (see \nConsolidated Results of Operations\n included in this MD&A).  We utilize many exchange traded commodities for our business that are subject to price volatility, specifically cocoa products, which continued to experience elevated market prices compared to historical levels (see \nPart I, Item 3 - Quantitative and Qualitative Disclosures about Market Risk\n included in this Quarterly Report on Form 10-Q).  \nFurthermore, changes in global trade policies, including tariffs on U.S. imports, continue to increase global economic and political uncertainty.  We are continuing to monitor the ongoing negotiations related to tariffs, specifically, goods imported into the U.S. from Canada, Mexico and other countries, as well as export markets, in which we have significant business operations, all of which may result in material adverse effects on our results of operations.  The scope and length of tariffs, including their effects on the broader economy and our business, remain uncertain.  These outcomes may be influenced by factors such as continued U.S. negotiations with impacted countries, retaliatory measures from other nations, possible tariff exemptions, public sentiment toward U.S. products and companies, and the domestic availability of lower-cost alternatives.  We expect tariff expense to negatively impact our full year results.\nAdditionally, leadership changes at the U.S. Department of Health and Human Services and the U.S. Food and Drug Administration (“FDA”) earlier in 2025, as well as the Make America Healthy Again movement, subject the food industry to increasing laws and regulations, including nutrition, food date labeling and traceability recordkeeping requirements, as well as changes in consumer expectations and behavior. For example, in April 2025 the FDA announced that it would be phasing out the approved use of petroleum-based synthetic dyes in food products. Therefore, in an effort to be responsive to the evolving regulatory environment and to ensure consumers have options to fit their lifestyle while maintaining trust and confidence in our products, we announced our decision to remove all certified Food, Drug & Cosmetic colors from our great tasting snacks by the end of 2027.  The estimated costs associated with this removal are not expected to have a material impact on our financial position, results of operations or liquidity. \nAs of September 28, 2025, we believe we have sufficient liquidity to satisfy our key strategic initiatives and other material cash requirements in both the short-term and in the long-term; however, we continue to evaluate and take action, as necessary, to preserve adequate liquidity and ensure that our business can operate effectively during the current economic environment.  We continue to monitor our discretionary spending across the organization (see \nLiquidity and Capital Resources\n included in this MD&A).\nBased on the length and severity of the fluctuating macroeconomic environment, including price volatility for our commodities, the possibility of a recession, changes in consumer shopping and consumption behavior, and changes in geopolitical events, including the imposition of tariffs and retaliatory tariffs, we may continue to experience increasing supply chain costs, higher inflation and other impacts to our business.  We will continue to evaluate the nature and extent of these evolving impacts on our business, consolidated results of operations, segment results, liquidity and capital resources.\nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 36\nCONSOLIDATED RESULTS OF OPERATIONS\nThree Months Ended\nNine Months Ended\nSeptember 28, 2025\nSeptember 29, 2024\nPercent Change\nSeptember 28, 2025\nSeptember 29, 2024\nPercent Change\nIn millions of dollars except per share amounts\nNet sales\n$\n3,181.4\n$\n2,987.5\n6.5 \n%\n$\n8,601.6\n$\n8,314.7\n3.4 \n%\nCost of sales\n2,144.1\n1,754.8\n22.2 \n%\n5,823.7\n4,572.2\n27.4 \n%\nGross profit\n1,037.3\n1,232.7\n(15.8)\n%\n2,777.9\n3,742.5\n(25.8)\n%\nGross margin\n32.6 \n%\n41.3 \n%\n32.3 \n%\n45.0 \n%\nSelling, marketing & administrative (“SM&A”) expenses\n600.5\n591.9\n1.5 \n%\n1,762.4\n1,750.9\n0.7 \n%\nSM&A expense as a percent of net sales\n18.9 \n%\n19.8 \n%\n20.5 \n%\n21.1 \n%\nBusiness realignment activities\n2.2\n27.6\n(92.0)\n%\n18.8\n32.6\n(42.2)\n%\nOperating profit\n434.6\n613.2\n(29.1)\n%\n996.6\n1,959.0\n(49.1)\n%\nOperating profit margin\n13.7 \n%\n20.5 \n%\n11.6 \n%\n23.6 \n%\nInterest expense, net\n51.5\n44.3\n16.2 \n%\n142.1\n125.5\n13.2 \n%\nOther (income) expense, net\n11.2\n50.1\n(77.6)\n%\n9.8\n82.7\n(88.1)\n%\nProvision for income taxes\n95.6\n72.5\n31.9 \n%\n281.4\n326.2\n(13.7)\n%\nEffective income tax rate\n25.7%\n14.0%\n33.3%\n18.6%\nNet income\n$\n276.3\n$\n446.3\n(38.1)\n%\n$\n563.2\n$\n1,424.6\n(60.5)\n%\nNet income per share—diluted\n$\n1.36\n$\n2.20\n(38.2)\n%\n$\n2.77\n$\n7.00\n(60.4)\n%\nNOTE: Percentage changes may not compute directly as shown due to rounding of amounts presented above.\nNM = not meaningful\nResults of Operations - Third Quarter 2025 vs. Third Quarter 2024\nNet Sales \nNet sales were $3,181.4 million in the third quarter of 2025 compared to $2,987.5 million in the same period of 2024, an increase of $193.9 million, or 6.5%.  The net sales increase reflects a favorable price realization of approximately 6% primarily related to pricing actions within the North America Confectionery and International segments. Volume was slightly positive, driven by strong results in North America Salty Snacks and the timing of shipments in the International segment, partially offset by price elasticity impacts within the North America Confectionery segment.  Additionally, the 2024 acquisition of Sour Strips contributed a minimal benefit and there was no impact from foreign currency exchange rates.\nKey U.S. Marketplace Metrics\nThe U.S. candy, mint and gum (“CMG”) consumer takeaway and market share information reflects measured channels of distribution accounting for approximately 90% of our U.S. confectionery retail business.  These channels of distribution primarily include food, drug, mass merchandisers, and convenience store channels, plus Wal-Mart Stores, Inc., partial dollar, club and military channels.  These metrics are based on measured market scanned purchases as reported by Circana, the Company’s market insights and analytics provider, and provide a means to assess our retail takeaway and market position relative to the overall category.\nFor the third quarter of 2025, our total U.S. retail takeaway increased 6.3% in the expanded multi-outlet combined plus convenience store channels (Circana MULO + C-Stores), which includes candy, mint, gum, salty snacks and grocery items.  Our CMG consumer takeaway increased 5.4%, despite a CMG market share decrease of 4 basis points.  Our Salty consumer takeaway increased 14.2% in the third quarter of 2025 and experienced a Salty market share increase of 48 basis points.\nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 37\nCost of Sales and Gross Margin \nCost of sales were $2,144.1 million in the third quarter 2025 compared to $1,754.8 million in the same period of 2024, an increase of $389.3 million, or 22.2%.  The increase was driven by higher costs, primarily due to unfavorable commodity costs from cocoa and tariffs.  Mark-to-market activity on our commodity derivative instruments intended to economically hedge future years’ commodity purchases contributed a minimal impact (See \nPart I, Item 3 - Quantitative and Qualitative Disclosures About Market Risk\n included in this Quarterly Report on Form 10-Q for more information).    \nGross margin was 32.6% in the third quarter of 2025\n compared to 41.3% in the same period of 2024, a decrease of 870 basis points.  The decrease was driven by unfavorable commodity and tariff costs and unfavorable mix, partially offset by net price realization, supply chain productivity and \nnet savings related to our AAA Initiative\n.\nSM&A Expenses \nSM&A expenses were $600.5 million in the third quarter of 2025 compared to $591.9 million in the same period of 2024, an increase of $8.6 million, or 1.5%.  Total advertising and related consumer marketing expenses decreased 5.0%, driven primarily by efficiencies in the North America Confectionery segment.  SM&A expenses, excluding advertising and related consumer marketing, increased 5.0% in the third quarter of 2025, driven by higher compensation and consulting costs, partially offset by net savings related to our AAA Initiative. \nBusiness Realignment Activities\nWe periodically undertake business realignment activities designed to increase our efficiency and focus our business in support of our key growth strategies.  Excluding the portion recorded within Cost of Sales and SM&A expenses (as noted above), we recorded business realignment costs of $2.2 million during the third quarter of 2025 versus $27.6 million in the third quarter of 2024.  The costs related to the AAA Initiative, which commenced in 2024, focused on leveraging new technology to improve supply chain and manufacturing-related spend, and optimize selling, general and administrative expenses.  Costs associated with business realignment activities are classified in our Consolidated Statements of Income as described in \nNote 9\n to the Unaudited Consolidated Financial Statements. \nOperating Profit and Operating Profit Margin \nOperating profit was $434.6 million in the third quarter of 2025 compared to $613.2 million in the same period of 2024, a decrease of $178.6 million\n, or 29.1%.  The decrease was primarily due to lower gross profit and higher SM&A expenses, partially offset by lower business realignment expenses, as noted above.  Operating profit margin decreased to 13.7% in 2025 from 20.5% in 2024, driven by the same factors noted above that resulted in lower gross margin for the period.\nInterest Expense, Net\nNet interest expense was $51.5 million in the third quarter of 2025 compared to $44.3 million in the same period of 2024, an increase of $7.2 million, or 16.2%.  The increase was primarily due to higher long-term debt balances in 2025, driven by the February 2025 debt issuance, versus 2024.  \nOther (Income) Expense, Net \nOther (income) expense, net was $11.2 million in the third quarter of 2025 versus $50.1 million in the third quarter of 2024, a net decrease of $38.9 million, or 77.6%.  The decrease in net expense was predominantly driven by no write-downs on equity investments qualifying for tax credits in the third quarter of 2025 versus $49.6 million of write-downs on equity investments qualifying for tax credits in the third quarter of 2024, partially offset by an increase of $11.3 million of non-service cost components of net periodic benefit cost relating to pension and other post-retirement benefit plans.\nIncome Taxes and Effective Tax Rate \nThe effective income tax rate was 25.7% for the third quarter of 2025 compared with 14.0% for the third quarter of 2024.  Relative to the 21% statutory rate, the 2025 effective tax rate was primarily impacted by state taxes and tax reserves, partially offset by foreign rate differential. Relative to the 21% statutory rate, the 2024 effective tax rate was primarily impacted by investment tax credits, partially offset by state taxes. \nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 38\nNet Income and Earnings Per Share-diluted\nNet income was $276.3 million in the third quarter of 2025 compared to $446.3 million in the same period of 2024, a decrease of $170.0 million, or 38.1%.  EPS-diluted was $1.36 in the third quarter of 2025 compared to $2.20 in the third quarter of 2024, a decrease of $0.84, or 38.2%.  \nThe decrease in both net income and EPS-diluted was driven by lower gross profit, higher SM&A expenses, higher interest expense, and higher income taxes, partially offset by lower business realignment costs and lower other expenses.  \nResults of Operations - First Nine Months 2025 vs. First Nine Months 2024\nNet Sales \nNet sales were $8,601.6 million in the first nine months of 2025 compared to $8,314.7 million during the same period of 2024, an increase of $286.9 million, or 3.4%.  The net sales increase was driven by favorable price realization of approximately 4% across our reportable segments.  The net sales increase was partially offset by a volume decrease of approximately 1%, primarily driven by price elasticity impacts within the North America Confectionery segment, partially offset by strong results in North America Salty Snacks.  Additionally, the 2024 acquisition of Sour Strips contributed a minimal benefit and there was an unfavorable foreign currency exchange impact of less than 1%.\nKey U.S. Marketplace Metrics\nFor the first nine months of 2025, our total U.S. retail takeaway increased 4.9% in the expanded multi-outlet combined plus convenience store channels (IRI MULO + C-Stores), which includes candy, mint, gum, salty snacks and grocery items.  Our U.S. CMG consumer takeaway increased 4.4% and experienced a CMG market share decrease of 7 basis points.  Our Salty consumer takeaway increased 10.1% and experienced a Salty market share increase of 36 basis points.\nCost of Sales and Gross Margin \nCost of sales were $5,823.7 million in the first nine months of 2025 compared to $4,572.2 million in the same period of 2024, an increase of $1,251.5 million, or 27.4%.  The increase was driven by $1,309.7 million of higher costs, primarily related to $244.4 million of unfavorable mark-to-market activity on our commodity derivative instruments intended to economically hedge future years’ commodity purchases (See \nPart I, Item 3 - Quantitative and Qualitative Disclosures About Market Risk\n included in this Quarterly Report on Form 10-Q for more information) and unfavorable commodity costs from cocoa and tariffs.  The increase was partially offset by $58.2 million, primarily related to lower sales volume and lower business realignment costs.\nGross margin was 32.3% in the first nine months of 2025 compared to 45.0% in the same period of 2024, a decrease of 1,270 basis points.  The decrease was driven by higher commodity and tariff costs, unfavorable year-over-year mark-to-market impact from commodity derivative instruments, unfavorable product mix, and volume declines, partially offset by net price realization, supply chain productivity and net savings related to our AAA Initiative.\nSM&A Expenses\nSM&A expenses were $1,762.4 million in the first nine months of 2025 compared to $1,750.9 million in the same period of 2024, an increase of $11.5 million, or 0.7%.  Total advertising and related consumer marketing expenses increased 2.1%, driven by increased spending in the North America Confectionery and North America Salty Snacks segments.  SM&A expenses, excluding advertising and related consumer marketing, remained flat in the first nine months of 2025 as compared to the first nine months of 2024.\nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 39\nBusiness Realignment Activities\nWe periodically undertake business realignment activities designed to increase our efficiency and focus our business in support of our key growth strategies.  Excluding the portion recorded within Cost of Sales and SM&A expenses (as noted above), we recorded business realignment costs of $18.8 million during the first nine months of 2025 versus $32.6 million in the first nine months of 2024.  The costs related to the AAA Initiative, which commenced in 2024, focused on leveraging new technology to improve supply chain and manufacturing-related spend, and optimize selling, general and administrative expenses.  Costs associated with business realignment activities are classified in our Consolidated Statements of Income as described in \nNote 9\n to the Unaudited Consolidated Financial Statements.\nOperating Profit and Operating Profit Margin \nOperating profit was $996.6 million in the first nine months of 2025 compared to $1,959.0 million in the same period of 2024, a decrease of $962.4 million, or 49.1%.  The decrease\n was driven by lower gross profit and higher SM&A expenses, partially offset by lower business realignment activities as noted above.  Operating profit margin decreased to 11.6% in the first nine months of 2025 from 23.6% in the same period in 2024, driven by the same factors that resulted in lower gross margin for the period.\nInterest Expense, Net \nNet interest expense was $142.1 million in the first nine months of 2025 compared to $125.5 million in the same period of 2024, an increase of $16.6 million, or 13.2%.  The increase was primarily due to higher long-term debt balances in 2025 versus 2024, driven by the February 2025 debt issuance, partially offset by lower short-term debt balances in 2025 versus 2024.\nOther (Income) Expense, Net \nOther (income) expense, net was $9.8 million in the first \nnine\n months of 2025 versus $82.7 million in the first \nnine\n months of 2024, a net income decrease of $72.9 million, or 88.1%.  The change was predominantly driven by no write-downs on equity investments qualifying for tax credits in the first nine months of 2025 versus $81.0 million of write-downs on equity investments qualifying for tax credits in the first nine months of 2024.  This was partially offset by an increase of $12.7 million of non-service cost components of net periodic benefit costs relating to pension and other post-retirement benefit plans.\nIncome Taxes and Effective Tax Rate \nOur effective income tax rate was 33.3% for the first nine months of 2025 compared with 18.6% for the first nine months of 2024.  Relative to the 21% statutory rate, the 2025 effective tax rate was primarily impacted by tax reserves, foreign rate differential and state taxes.  Relative to the 21% statutory rate, the 2024 effective tax rate was impacted by investment tax credits partially offset by state taxes.\nNet Income and Earnings Per Share-diluted\nNet income was $563.2 million in the first nine months of 2025 compared to $1,424.6 million in the same period of 2024, a decrease of $861.4 million, or 60.5%.  EPS-diluted was $2.77 in the first nine months of 2025 compared to $7.00 in the same period of 2024, a decrease of $4.23, or 60.4%.  T\nhe decrease in both net income and EPS-diluted was driven by lower gross profit, higher interest expense, and higher taxes, partially offset by lower other expenses.\nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 40\nSEGMENT RESULTS \nThe summary that follows provides a discussion of the results of operations of our three segments: North America Confectionery, North America Salty Snacks and International.  For segment reporting purposes, we use “segment income” to evaluate segment performance and allocate resources.  Segment income excludes unallocated general corporate administrative expenses, unallocated mark-to-market gains and losses on commodity derivatives, business realignment and impairment charges, acquisition-related costs and other unusual gains or losses that are not part of our measurement of segment performance.  These items of our operating income are largely managed centrally at the corporate level and are excluded from the measure of segment income reviewed by our Chief Operating Decision Maker, Kirk Tanner, President and Chief Executive Officer, and used for resource allocation and internal management reporting and performance evaluation.  Segment income and segment income margin, which are presented in the segment discussion that follows, are non-GAAP measures and do not purport to be alternatives to operating income as a measure of operating performance.  We believe that these measures are useful to investors and other users of our financial information in evaluating ongoing operating profitability as well as in evaluating operating performance in relation to our competitors, as they exclude the activities that are not directly attributable to our ongoing segment operations. Refer to \nNote 13\n Segment Information in our audited consolidated financial statements for reconciliations of net sales for our reportable segments to consolidated total net sales and of segment operating income to consolidated income before taxes.\nOur segment results, including a reconciliation to our consolidated results, were as follows:\nThree Months Ended\nNine Months Ended\nSeptember 28, 2025\nSeptember 29, 2024\nSeptember 28, 2025\nSeptember 29, 2024\nIn millions of dollars\nNet Sales:\nNorth America Confectionery\n$\n2,615.6 \n$\n2,477.3 \n$\n7,001.2 \n$\n6,764.4 \nNorth America Salty Snacks\n321.0 \n291.8 \n914.3 \n856.8 \nInternational\n244.8 \n218.4 \n686.0 \n693.5 \nTotal\n$\n3,181.4 \n$\n2,987.5 \n$\n8,601.6 \n$\n8,314.7 \nSegment Income (Loss):\nNorth America Confectionery\n$\n571.5 \n$\n724.8 \n$\n1,771.8 \n$\n2,137.5 \nNorth America Salty Snacks\n57.7 \n54.0 \n166.1 \n144.9 \nInternational\n(13.6)\n14.2 \n34.9 \n82.0 \nTotal segment income\n615.6 \n793.0 \n1,972.8 \n2,364.4 \nUnallocated corporate expense (1)\n194.7 \n161.8 \n536.7 \n496.2 \nUnallocated mark-to-market (gains) losses on commodity derivatives (2)\n(24.3)\n(31.1)\n387.9 \n(195.7)\nCosts associated with business realignment activities\n10.6 \n49.1 \n51.6 \n104.8 \nOperating profit\n434.6 \n613.2 \n996.6 \n1,959.1 \nInterest expense, net\n51.5 \n44.3 \n142.1 \n125.5 \nOther (income) expense, net\n11.2 \n50.1 \n9.8 \n82.7 \nIncome before income taxes\n$\n371.9 \n$\n518.8 \n$\n844.7 \n$\n1,750.9 \n(1)\nIncludes centrally-managed (a) corporate functional costs relating to legal, treasury, finance and human resources, (b) expenses associated with the oversight and administration of our global operations, including warehousing, distribution and manufacturing, information systems and global shared services, (c) non-cash stock-based compensation expense, (d) acquisition and integration-related costs and (e) other gains or losses that are not integral to segment performance.\n(2)\nNet losses (gains) on mark-to-market valuation of commodity derivative positions recognized in unallocated derivative losses (gains).  See \nNote 13\n to the Unaudited Consolidated Financial Statements.\nNorth America Confectionery\nThe North America Confectionery segment is responsible for our chocolate and non-chocolate confectionery market position in the United States and Canada.  This includes developing and growing our business in chocolate and non-chocolate confectionery, gum and refreshment products, protein bars, spreads, snack bites and mixes, as well as pantry and food service lines.  While a less significant component, this segment also includes our retail operations, including Hershey’s Chocolate World stores in Hershey, Pennsylvania; New York, New York; Las Vegas, Nevada; Niagara Falls (Ontario) and Singapore, as well as operations associated with licensing the use of certain trademarks and products to third parties around the world.  North America Confectionery results, which accounted for 82.2% and 82.9% of our net sales for the three months ended September 28, 2025 and September 29, 2024, respectively, were as follows:\nThree Months Ended\nNine Months Ended\nSeptember 28, 2025\nSeptember 29, 2024\nPercent Change\nSeptember 28, 2025\nSeptember 29, 2024\nPercent Change\nIn millions of dollars\nNet sales\n$\n2,615.6 \n$\n2,477.3 \n5.6 \n%\n$\n7,001.2 \n$\n6,764.4 \n3.5 \n%\nSegment income\n571.5 \n724.8 \n(21.2)\n%\n1,771.8 \n2,137.5 \n(17.1)\n%\nSegment margin\n21.8 \n%\n29.3 \n%\n25.3 \n%\n31.6 \n%\nNOTE: Percentage changes may not compute directly as shown due to rounding of amounts presented above.\nResults of Operations - Third Quarter 2025 vs. Third Quarter 2024\nNet sales of our North America Confectionery segment were $2,615.6 million in the third quarter of 2025 compared to $2,477.3 million in the same period of 2024, an increase of $138.3 million, or 5.6%.  The increase was driven by favorable price realization of approximately 7%, primarily due to the pricing action announced in July.  Volume declined approximately 1%, driven by price elasticity impacts in everyday core U.S. confection. Additionally, the 2024 acquisition of Sour Strips contributed a minimal benefit and there was no impact from foreign currency exchange rates.\nOur North America Confectionery segment income was $571.5 million in the third quarter of 2025 compared to $724.8 million in the same period of 2024, a decrease of $153.3 million, or 21.2%.  The decrease was driven primarily by higher commodity and tariff costs and unfavorable mix, partially offset by net price realization, supply chain productivity, net savings related to our AAA Initiative and reduced advertising and related consumer marketing expenses.\nResults of Operations - First Nine Months 2025 vs. First Nine Months 2024\nNet sales of our North America Confectionery segment were $7,001.2 million in the first nine months of 2025 compared to $6,764.4 million in the same period of 2024, an increase of $236.8 million, or 3.5%.  The increase was driven by favorable price realization of approximately 5%, primarily due to the pricing action announced in July.  Volume declined approximately 2%, driven by price elasticity impacts in everyday core U.S. confection.  Additionally, the 2024 acquisition of Sour Strips contributed a benefit of less than 1% and the impact from unfavorable foreign currency exchange rates was immaterial. \nOur North America Confectionery segment income was $1,771.8 million in the first nine months of 2025 compared to $2,137.5 million the same period of 2024, a decrease of $365.7 million or 17.1%.  The decrease\n was \ndriven primarily by higher commodity and tariff costs and unfavorable mix, partially offset by net price realization, supply chain productivity and net savings related to our AAA Initiative.\nNorth America Salty Snacks\nThe North America Salty Snacks segment is responsible for our grocery and snacks market positions, including our salty snacking products.  North America Salty Snacks results, which accounted for 10.1% and 9.8% of our net sales for the three months ended September 28, 2025 and September 29, 2024, respectively, were as follows:\nThree Months Ended\nNine Months Ended\nSeptember 28, 2025\nSeptember 29, 2024\nPercent Change\nSeptember 28, 2025\nSeptember 29, 2024\nPercent Change\nIn millions of dollars\nNet sales\n$\n321.0 \n$\n291.8 \n10.0 \n%\n$\n914.3 \n$\n856.8 \n6.7 \n%\nSegment income\n57.7 \n54.0 \n6.9 \n%\n166.1 \n144.9 \n14.6 \n%\nSegment margin\n18.0 \n%\n18.5 \n%\n18.2 \n%\n16.9 \n%\nNOTE: Percentage changes may not compute directly as shown due to rounding of amounts presented above.\nResults of Operations - Third Quarter 2025 vs. Third Quarter 2024\nNet sales of our North America Salty Snacks segment were $321.0 million in the third quarter of 2025 compared to $291.8 million in the same period of 2024, an increase of $29.2 million, or 10.0%.  The increase was predominantly due to volume increases of approximately 11%, primarily driven by \nDot’s Homestyle Pretzels, SkinnyPop\n and \nPirates Booty\n.  The net sales increase was partially offset by unfavorable price realization of approximately 1% as a result of higher trade promotional activities.\nOur North America Salty Snacks segment income was $57.7 million in the third quarter of 2025\n compared to $54.0 million in the same period of 2024, an increase of $3.7 million, or 6.9%.  The increase was primarily due to volume increases, \nnet savings related to our AAA Initiative\n and lower commodity costs.\nResults of Operations - First Nine Months 2025 vs. First Nine Months 2024\nNet sales of our North America Salty Snacks segment were $914.3 million in the first nine months of 2025 compared to $856.8 million the same period of 2024, an increase of $57.5 million, or 6.7%.  The increase was driven by volume growth of approximately 6%, primarily related to \nDot’s Homestyle Pretzels\n and \nSkinnyPop\n. Price realization was flat in the first nine months of 2025 compared to the same period of 2024.\n \nOur North America Salty Snacks segment income was $166.1 million in the first nine months of 2025 compared to $144.9 million \nthe same period of 2024, an increase of $21.2 million, or 14.6%.  The increase was primarily due to volume increases and \nnet savings related to our AAA Initiative\n, partially offset by higher supply chain costs.\nInternational\nThe International segment includes all other countries where we currently manufacture, import, market, sell or distribute chocolate and non-chocolate confectionery and other products.  We currently have operations and manufacture product in Mexico, Brazil, India and Malaysia, primarily for consumers in these regions, and also distribute and sell confectionery products in export markets of Latin America, as well as Europe, Asia-Pacific (“APAC”), the Middle East and Africa (“MEA”) and other regions.  International results, which accounted for 7.7% and 7.3% of our net sales for the three months ended September 28, 2025 and September 29, 2024, respectively, were as follows:\nThree Months Ended\nNine Months Ended\nSeptember 28, 2025\nSeptember 29, 2024\nPercent Change\nSeptember 28, 2025\nSeptember 29, 2024\nPercent Change\nIn millions of dollars\nNet sales\n$\n244.8 \n$\n218.4 \n12.1 \n%\n$\n686.0 \n$\n693.5 \n(1.1)\n%\nSegment income\n(13.6)\n14.2 \n(195.8)\n%\n34.9 \n82.0 \n(57.4)\n%\nSegment margin\n(5.6)\n%\n6.5 \n%\n5.1 \n%\n11.8 \n%\nNOTE: Percentage changes may not compute directly as shown due to rounding of amounts presented above.\nResults of Operations - Third Quarter 2025 vs. Third Quarter 2024\nNet sales of our International segment were $244.8 million in the third quarter of 2025 compared to $218.4 million in the same period of 2024, an increase of $26.4 million, or 12.1%.  The increase was due to favorable price realization of approximately 7%, primarily due to strategic pricing actions across key markets.  Volume increased approximately 6%, primarily attributable to Brazil, Europe and Mexico, partially offset by price elasticity across markets. There was no impact from foreign currency exchanges rates.\nOur International segment generated a lo\nss of $13.6 million in the third quarter of 2025 compared to $14.2 million in income in the third quarter of 2024, a decrease of $27.8 million, or 195.8%, driven by higher commodity and manufacturing costs, which more than offset favorable price realization, supply chain productivity, and \nnet savings related to our AAA Initiative\n.\nResults of Operations - First Nine Months 2025 vs. First Nine Months 2024\nNet sales of our International segment were $686.0 million in the first nine months of 2025 compared to $693.5 million the same period of 2024, a decrease of $7.5 million, or 1.1%.  The decrease was due to an unfavorable impact from foreign currency exchange rates of approximately 5%\n, driven by Mexico and India.\n  The decrease was partially offset by a favorable price realization of approximately 3%, primarily due to strategic pricing actions across key markets.  Volume was flat in the first nine months of 2025 compared to the same period of 2024.\nOur International segment generated income of $34.9 million in the first nine months of 2025 compared to $82.0 million in the first nine months of 2024, a decrease of $47.1 million\n, or 57.4%, driven by higher commodity and manufacturing costs, which more than offset favorable price realization, supply chain productivity, and \nnet savings related to our AAA Initiative\n.\nUnallocated Corporate Expense\nUnallocated corporate expense includes centrally-managed (a) corporate functional costs relating to legal, treasury, finance and human resources, (b) expenses associated with the oversight and administration of our global operations, including warehousing, distribution and manufacturing, information systems and global shared services, (c) non-cash stock-based compensation expense, (d) acquisition and integration-related costs and (e) other gains or losses that are not integral to segment performance. \nIn the third quarter of 2025, unallocated corporate expense totaled $194.7 million, as compared to $161.8 million in the third quarter of 2024, an increase of $32.9 million, or 20.3%\n.  The increase was primarily driven by higher compensation and benefits costs and consulting fees.\nIn the first nine months of 2025, unallocated corporate expense totaled $536.7 million, as compared to $496.2 million in the first nine months of \n2024, an increase of $40.5 million, or 8.2%.  The increase was primarily driven by higher compensation and benefits costs and consulting fees, partially offset by lower investments in capabilities and technology, as a result of the completion of our ERP system upgrade in 2024, as well as lower acquisition and integration costs.\nLIQUIDITY AND CAPITAL RESOURCES\nHistorically, our primary source of liquidity has been cash generated from operations.  Domestic seasonal working capital needs, which typically peak during the summer months, are generally met by utilizing cash on hand, bank borrowings or the issuance of commercial paper.  Commercial paper may also be issued, from time to time, to finance ongoing business transactions, such as the repayment of long-term debt, business acquisitions and for other general corporate purposes.\nAt September 28, 2025, our cash and cash equivalents totaled $1.2 billion, an increase of $432.3 million compared to the 2024 year-end balance.  Additional detail regarding the net uses of cash are outlined in the following discussion. Additionally, at September 28, 2025, we had outstanding short- and long-term debt totaling $5.4 billion, of which $502.3 million was classified as the current portion of long-term debt.  Of the $502.3 million, $500 million of 2.300% Notes are due upon maturity on August 15, 2026.  We believe we can satisfy these debt obligations with cash generated from our operations, issuing new debt, and/or by borrowing on our unsecured credit facility. \nApproximately 50% of the balance of our cash and cash equivalents at September 28, 2025 was held by subsidiaries domiciled outside of the United States.  A majority of our cash and cash equivalents balance is distributable to the United States without material tax implications, such as withholding tax.  We intend to continue to reinvest the remainder of this balance outside of the United States for which there would be a material tax implication to distributing for the foreseeable future and, therefore, have not recognized additional tax expense on these earnings.  We believe that our existing sources of liquidity are adequate to meet anticipated funding needs at comparable risk-based interest rates for the foreseeable future.  Acquisition spending and/or share repurchases could potentially increase our debt.  Operating cash flow and access to capital markets are expected to satisfy our various short- and long-term cash flow requirements, including acquisitions and capital expenditures.\nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 41\nCash Flow Summary\nThe following table is derived from our Consolidated Statements of Cash Flows: \nNine Months Ended\nIn millions of dollars\nSeptember 28, 2025\nSeptember 29, 2024\nNet cash provided by (used in):\nOperating activities\n$\n1,350.8\n$\n1,590.0 \nInvesting activities\n(382.2)\n(549.3)\nFinancing activities\n(536.4)\n(847.0)\nEffect of exchange rate changes on cash and cash equivalents\n0.1 \n19.3 \nNet change in cash and cash equivalents\n$\n432.3 \n$\n213.0 \nOperating activities\nWe generated cash of $1,350.8 million from operating activities in the first nine months of 2025, a decrease of $239.2 million compared to $1,590.0 million in the same period of 2024.  This decrease in net cash provided by operating activities was mainly driven by the following factors:\n•\nOther assets and liabilities consumed cash of $287.1 million in 2025, compared to $51.8 million in 2024.  This $235.3 million fluctuation was primarily driven by the timing of certain prepaid expenses and other current assets.\n•\nIn the aggregate, select net working capital items, specifically, trade accounts receivable, inventory, accounts payable and accrued liabilities, consumed cash of $148.4 million in 2025, compared to $183.9 million in 2024.  This $35.5 million fluctuation was mainly driven by an increase in accounts payable and accrued liabilities due to the timing of vendor and supplier payments as well as an increase in accounts receivable, partially offset by higher inventory levels. \n•\nNet income adjusted for non-cash charges to operations (including depreciation, amortization, stock-based compensation, deferred income taxes, a write-down of equity investments, unrealized gains and losses on derivative contracts and other charges) resulted in $60.0 million of lower cash flow in 2025 relative to 2024.\n•\nThe decrease in cash provided by operating activities was partially offset by the following net cash inflows:\n◦\nTiming of income tax payments generated cash of $158.9 million in 2025, compared to $138.5 million in 2024.  This $20.4 million fluctuation was primarily due to the variance in actual tax expense for 2025 relative to the timing of quarterly estimated tax payments.  We paid cash of $110.6 million for income taxes during 2025 compared to $180.3 million in the same period of 2024.\nInvesting activities\nWe used cash of $382.2 million for investing activities in the first nine months of 2025, a decrease of $167.1 million compared to $549.3 million in the same period of 2024.  This decrease in net cash used in investing activities was mainly driven by the following factors:\n•\nCapital spending\n.  Capital expenditures, including capitalized software, primarily to support our ERP system implementation, capacity expansion, innovation and cost savings, were $316.5 million in the first nine months of 2025 compared to $471.4 million in the same period of 2024.  The decrease in our 2025 capital expenditures is largely driven by the wind down of our key strategic initiatives, including completion of the upgrade of a new ERP system across the enterprise in 2024.  We expect 2025 capital expenditures, including capitalized software, to be approximately $425 million, the lower end of our previously estimated range of $425 million to $450 million, as capital spending as a percentage of net sales is expected to return to historical levels.  We intend to use our existing cash and internally generated funds to meet our 2025 capital requirements.\n•\nInvestments in partnerships qualifying for tax credits\n.  We make investments in partnership entities that in turn make equity investments in projects eligible to receive federal historic and renewable energy tax credits.  We received payments of approximately $14.3 million in the first nine months of 2025, compared to investing $78.2 million in the same period of 2024.\nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 42\n•\nIntangible assets\n.  In the first nine months of 2025, we purchased the Fulfil brand in North America for $73.6 million.\n•\nOther investing activities\n.  In the first nine months of 2025 and 2024, our other investing activities were minimal.\nFinancing activities \nWe used cash of $536.4 million for financing activities in the first nine months of 2025, a decrease of $310.6 million compared to cash used of $847.0 million in the same period of 2024.  This decrease in net cash used in financing activities was mainly driven by the following factors:\n•\nShort-term borrowings, net.  \nIn addition to utilizing cash on hand, we use short-term borrowings (commercial paper and bank borrowings) to fund seasonal working capital requirements and ongoing business needs.  During the first nine months of 2025, we used cash of $1.1 billion to reduce short-term commercial paper borrowings and short-term foreign bank borrowings.  During the first nine months of 2024, we generated cash of $482.8 million predominately through the issuance of short-term commercial paper and an increase in short-term foreign bank borrowings.\n•\nLong-term debt borrowings and repayments\n.  During the first nine months of 2025, we issued $500 million of 4.550% Notes due in February 2028, $500 million of 4.750% Notes due in February 2030, $500 million of 4.950% Notes due in February 2032 and $500 million of 5.100% Notes due in February 2035 (together, the “2025 Notes”).  Proceeds from the issuance of the 2025 Notes, net of discounts and issuance costs, totaled $2.0 billion.  Additionally, we repaid $300 million of 0.900% Notes due upon maturity and $300 million of 3.200% Notes due upon maturity in June and August 2025, respectively.  During the first nine months of 2024, we had no long-term debt borrowings or repayments activity.\n•\nDividend payments\n.  Total dividend payments to holders of our Common Stock and Class B Common Stock were $814.0 million during the first nine months of 2025, a decrease of $0.4 million compared to $814.3 million in the same period of 2024.  Details regarding our 2025 cash dividends paid to stockholders are as follows:\nQuarter Ended\nIn millions of dollars except per share amounts\nMarch 30, 2025\nJune 29, 2025\nSeptember 28, 2025\nDividends paid per share – Common stock\n$\n1.370 \n$\n1.370 \n$\n1.370 \nDividends paid per share – Class B common stock\n$\n1.245 \n$\n1.245 \n$\n1.245 \nTotal cash dividends paid\n$\n271.6 \n$\n271.2 \n$\n271.2 \nDeclaration date\nFebruary 5, 2025\nApril 30, 2025\nJuly 29, 2025\nRecord date\nFebruary 17, 2025\nMay 16, 2025\nAugust 15, 2025\nPayment date\nMarch 14, 2025\nJune 16, 2025\nSeptember 15, 2025\n•\nShare repurchases\n.  We repurchase shares of Common Stock to offset the dilutive impact of treasury shares issued under our equity compensation plans.  The value of these share repurchases in a given period varies based on the volume of stock options exercised and our market price.  In addition, we periodically repurchase shares of Common Stock pursuant to Board-authorized programs intended to drive additional stockholder value.  Details regarding our share repurchases are as follows:\nNine Months Ended\nIn millions\nSeptember 28, 2025\nSeptember 29, 2024\nShares repurchased in the open market under pre-approved share repurchase programs (1)\n— \n400.0 \nShares repurchased in the open market to replace Treasury Stock issued for stock options and incentive compensation\n$\n— \n$\n94.2 \nCash used for total share repurchases (excluding excise tax)\n$\n— \n$\n494.2 \nTotal shares repurchased under pre-approved share repurchase programs\n— \n2.0 \nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 43\n(1) In May 2021, our Board of Directors approved a $500 million share repurchase authorization, which was completed as of March 31, 2024.  In December 2023, our Board of Directors approved an additional $500 million share repurchase authorization. This program commenced after the existing May 2021 authorization was completed and is to be utilized at management’s discretion.  As a result of the share repurchase authorization, approximately $470 million remains available for repurchases under our December 2023 share repurchase authorization.  We are authorized to purchase our outstanding shares in open market and privately negotiated transactions.  The program has no expiration date and acquired shares of Common Stock will be held as treasury shares.  Purchases under approved share repurchase authorizations are in addition to our practice of buying back shares sufficient to offset those issued under incentive compensation plans.\n•\nProceeds from exercised stock options and employee tax withholding.\n  During the first nine months of 2025, we received $17.3 million from employee exercises of stock options and paid $17.2 million of employee taxes withheld from share-based awards.  During the first nine months of 2024, we received $13.8 million from employee exercises of stock options and paid $30.5 million of employee taxes withheld from share-based awards.  Variances are driven primarily by the number of shares exercised and the share price at the date of grant.\nRecent Accounting Pronouncements\nInformation on recently adopted and issued accounting standards is included in \nNote 1\n to the Unaudited Consolidated Financial Statements.\nCritical Accounting Estimates\nFor information regarding the Company’s critical accounting estimates, refer to Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our 2024 Annual Report on Form 10-K.  There have been no material changes to the Company’s critical accounting estimates since December 31, 2024.\nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 44\nSafe Harbor Statement\nWe are subject to changing economic, competitive, regulatory and technological risks and uncertainties that could have a material impact on our business, financial condition or results of operations. In connection with the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995, we note the following factors that, among others, could cause future results to differ materially from the forward-looking statements, expectations and assumptions that we have discussed directly or implied in this Quarterly Report on Form 10-Q. Many of these forward-looking statements can be identified by the use of words such as “anticipate,” “assume,” “believe,” “continue,” “estimate,” “expect,” “forecast,” “future,” “intend,” “plan,” “potential,” “predict,” “project,” “strategy,” “target” and similar terms, and future or conditional tense verbs like “could,” “may,” “might,” “should,” “will” and “would,” among others. \nThe factors that could cause our actual results to differ materially from the results projected in our forward-looking statements include, but are not limited to the following:\n•\nOur Company’s reputation or brand image might be impacted as a result of issues, concerns or regulatory changes relating to the quality and safety of our products, ingredients or packaging, human and workplace rights, and other environmental, social or governance matters, which in turn could result in litigation or otherwise negatively impact our operating results;\n•\nDisruption to our manufacturing operations or supply chain could impair our ability to produce or deliver finished products, resulting in a negative impact on our operating results;\n•\nWe might not be able to hire, engage and retain the talented global human capital we need to drive our growth strategies;\n•\nRisks associated with climate change and other environmental impacts, and increased focus and evolving views of our customers, stockholders and other stakeholders on climate change issues, could negatively affect our business and operations;\n•\nIncreases in raw material and energy costs along with the availability of adequate supplies of raw materials could continue to affect future financial results;\n•\nPrice increases may not be sufficient to offset cost increases and maintain profitability or may result in sales volume declines associated with pricing elasticity;\n•\nMarket demand for new and existing products could decline;\n•\nIncreased marketplace competition could hurt our business;\n•\nOur financial results may be adversely impacted by the failure to successfully execute or integrate acquisitions, divestitures and joint ventures;\n•\nOur international operations may not achieve projected growth objectives, which could adversely impact our overall business and results of operations;\n•\nWe may not fully realize the expected cost savings and/or operating efficiencies associated with our strategic initiatives or restructuring programs, which may have an adverse impact on our business;\n•\nChanges in governmental laws, regulations and policies, including taxes and tariffs, could increase our costs and liabilities or impact demand for our products;\n•\nPolitical, economic and/or financial market conditions, including impacts on our business arising from the ongoing conflict between Russia and Ukraine, could negatively impact our financial results;\nTable of Contents\nThe Hershey Company  |  Q3 2025 Form 10-Q  |  Page 45\n•\nDisruptions, failures or security breaches of our information technology infrastructure could have a negative impact on our operations;\n•\nComplications with the design or implementation of our new enterprise resource planning system could adversely impact our business and operations; and\n•\nSuch other matters as discussed in our 2024 Annual Report on Form 10-K and our Quarterly Report on Form 10-Q for the quarter ending March 30, 2025 and June 29, 2025, and this Quarterly Report on Form 10-Q, including Part II, Item 1A, ”Risk Factors.”\nWe undertake no obligation to publicly update or revise any forward-looking statements to reflect actual results, changes in expectations or events or circumstances after the date this Quarterly Report on Form 10-Q is filed."
}