{
  "item1": "Utility Solutions Segment Hubbell Utility Solutions leading positions Front Meter Edge. Utility Solutions segment (64% consolidated revenues 2024, 61% 2023 58% 2022) consists businesses design, manufacture, sell wide variety electrical distribution, transmission, substation, telecommunications products, which support applications Front Meter. includes utility transmission & distribution (T&D) components such arresters, insulators, connectors, anchors, bushings, enclosures, cutouts switches. Utility Solutions segment also offers solutions serve Edge utility infrastructure, including smart meters, communications systems, protection control devices.",
  "item7": "Adjusted net income continuing operations attributable Hubbell Incorporated (non-GAAP measure) Less: Earnings allocated participating securities Adjusted net income continuing operations available common shareholders (non-GAAP measure) Average number diluted shares outstanding Adjusted diluted earnings per share continuing operations income tax effects calculated using statutory tax rate, taking into consideration nature item relevant taxing jurisdiction, unless otherwise noted. HUBBELL INCORPORATED following table reconciles Organic Net sales growth directly comparable GAAP financial measure (in millions percentage change): Year Ended December 31, Net sales growth (GAAP measure) Impact acquisitions Impact divestitures Foreign currency exchange Organic Net sales growth (non-GAAP measure) 2024 Compared 2023 Net sales $5,628.5 million 2024 increased $255.6 million, 4.7%, compared 2023. Organic net sales flat driven low single digit percentage increase price realization, partially offset low single digit percentage decrease unit volume. Acquisitions net divestitures contributed 4.8% net sales growth.",
  "item2": "Selling & administrative (“S&A”) expense Less: Net income attributable non-controlling interest Net income attributable Hubbell Incorporated Less: Earnings allocated participating securities Net income available common shareholders Average number diluted shares outstanding DILUTED EARNINGS PER SHARE following discussion results operations, refer “adjusted operating measures. believe those adjusted measures, which exclude impact certain costs, gains losses, may provide investors useful information regarding underlying performance period period allow investors understand results operations without regard items that, management's judgement, significantly affect comparability operating results, not considered components core operating performance. HUBBELL INCORPORATED Significant items impacting comparability comprise following: Transaction, integration separation costs effect acquisitions divestitures may results can fluctuate significantly based timing, size number transactions, therefore result significant volatility costs complete transactions integrate separate businesses. Transaction costs primarily professional services other fees incurred complete transactions."
}