{
  "source_file": "hubb-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n Executive Overview of the Business\n \nHubbell is a global manufacturer of quality electrical products and utility solutions for a broad range of customer and end market applications. We provide utility and electrical solutions that enable our customers to operate critical infrastructure reliably and efficiently, and we empower and energize communities through innovative solutions supporting energy infrastructure In Front of the Meter, on The Edge, and Behind the Meter. In Front of the Meter is where utilities transmit and distribute energy to their customers. The Edge connects utilities with owner and operators and allows energy and data to be distributed back and forth. Behind the Meter is where owners and operators of buildings and other critical infrastructure consume energy. Products are either sourced complete, manufactured or assembled by subsidiaries in the United States, Canada, Puerto Rico, Mexico, China, the UK, Brazil, Australia, Spain, Ireland and the Republic of the Philippines. The Company also participates in joint ventures in Hong Kong and the Republic of the Philippines, and maintains offices in Singapore, Italy, China, India, Mexico, South Korea, Chile, and countries in the Middle East. The Company employed approximately 17,600 individuals worldwide as of September 30, 2025.\nThe Company’s reporting segments consist of the Utility Solutions segment and Electrical Solutions segment.\nResults for the nine months ended September 30, 2025 by segment are included under “Segment Results” within this Management’s Discussion and Analysis.\nThe Company's long-term strategy is to serve its customers with reliable and innovative electrical and related infrastructure solutions with desired brands and high-quality service, delivered through a competitive cost structure; to complement organic revenue growth with acquisitions that enhance its product offerings; and to allocate capital effectively to create shareholder value. \n \nOur strategy to complement organic revenue growth with acquisitions is focused on acquiring assets that extend our capabilities, expand our product offerings, and present opportunities to compete in core, adjacent or complementary markets. Our acquisition strategy also provides the opportunity to advance our revenue growth objectives during periods of weakness or inconsistency in our end-markets.\nOur strategy to deliver products through a competitive cost structure has resulted in past and ongoing restructuring and related activities. Our restructuring and related efforts include the consolidation of manufacturing and distribution facilities, and workforce actions, as well as streamlining and consolidating our back-office functions. The primary objectives of our restructuring and related activities are to optimize our manufacturing footprint, cost structure, and the effectiveness and efficiency of our workforce.\nProductivity improvement also continues to be a key area of focus for the Company and efforts to drive productivity complement our restructuring and related activities to minimize the impact of rising material costs and other administrative cost inflation. Because material costs are approximately half of our cost of goods sold, continued volatility in this area could significantly impact profitability. Our goal is to have pricing and productivity programs that offset material and other inflationary cost increases as well as pay for investments in key growth areas.\nProductivity programs affect virtually all functional areas within the Company by reducing or eliminating waste and improving processes. We continue to expand our efforts related to global product and component sourcing, as well as supplier cost reduction programs. Value engineering efforts, product transfers and the use of lean process improvement techniques are expected to continue to increase manufacturing efficiency. In addition, we continue to build upon the benefits of our enterprise resource planning system across all functions.\nOur sales are also subject to market conditions that may cause customer demand for our products to be volatile. Product demand can be affected by fluctuations in domestic and international economic conditions, as well as currency fluctuations, commodity costs, and a variety of other factors. Since early 2021, we have experienced significant inflationary pressure across much of our business. As a result, we have taken various pricing actions to cover the higher costs and to protect our profitability. Although inflation has moderated since its high point in 2022, we expect inflation to remain a factor for the foreseeable future and we expect to continue to take these pricing actions subject to demand and market conditions. Accordingly, there can be no assurance that we will be able to maintain our margins in response to further changes in inflationary pressures. In addition, macroeconomic effects such as increases in interest rates and other measures taken by central banks and other policy makers could have a negative effect on overall economic activity which could reduce our customers’ demand for our products, and cause the continuation of relatively high market interest rates that increase our borrowing costs. \n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    35\nBack to Content\nAdditionally, international tensions, such as the conflicts in the Middle East and Ukraine, as well as trade and other tensions, including those with China, Mexico and Canada may affect demand for our products, as well as our production costs. In particular, recent tariff and other trade actions by the U.S. and other countries and the widespread uncertainty and international tensions resulting therefrom, including, without limitation, the effect on the value of the U.S. dollar relative to other currencies, may adversely affect demand for our products, disrupt our supply chains, increase manufacturing costs and adversely affect our revenues, cost of sales and production volumes, any of which could materially and adversely harm our business, financial condition and results of operations. Moreover, the unpredictability of changes in trade policy negatively affects our ability to respond to these actions and contributes to volatility in the securities markets that can materially affect the trading price of our securities. See also \nItem 1A Risk Factors in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024\n, and in this Quarterly Report on Form 10-Q for further information.\nIn the first quarter of 2025, the Company acquired all of the issued and outstanding equity of Alliance USAcqCo 2, Inc. (“Ventev”), a leading manufacturer and provider of a complete ecosystem of solutions to power, protect, and connect wireless networks. The Ventev business has been added to the Electrical Solutions segment.\nIn the third quarter of 2025, the Company acquired all of the issued and outstanding equity of Nicor, Inc., (\"Nicor\") for approximately $56 million, net of cash acquired, subject to customary purchase price adjustments. Nicor designs and manufactures water metering endpoint solutions to integrate and optimize advanced metering infrastructure (\"AMI\") networks. Such solutions include polymer meter box lids and covers. Nicor has been added to the Utility Solutions segment.\nOn October 1, 2025, the Company acquired all of the issued and outstanding equity of Power Rose Acquisition, Inc., (\"Power Rose\" and together with its subsidiaries, \"DMC Power\") for approximately $825 million, net of cash acquired, subject to customary purchase price adjustments. DMC Power is a provider of connectors and tooling for utility substation and transmission markets. DMC Power will be added to the Utility Solutions segment. \n \n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    36\nBack to Content\nResults of Operations – Third Quarter of 2025 compared to the Third Quarter of 2024 \nThe following is a discussion and analysis of our business, financial condition and results of operations as of and for the \nthree and nine months ended September 30, 2025\n and \n2024\n. This discussion and analysis should be read in conjunction with our Condensed Consolidated Financial Statements and notes thereto in Item 1 of this Quarterly Report on Form 10-Q (the \n“\nCondensed Financial Statements\n”\n), and the audited consolidated financial statements, accompanying notes and Management’s Discussion and Analysis of Financial Condition and Results of Operations contained in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. \nIn the second quarter of 2025, the Company elected to change its method of accounting for certain inventories in the U.S. from last in, first out (\"LIFO\") to first in, first out (\"FIFO\"). The change to FIFO is preferable because it conforms the Company's inventory to a single method of accounting and improves comparability with the Company's peers. The Company retrospectively applied this change in accounting principle to all prior periods. For further information regarding the change in accounting principle, see Note 1 Basis of Presentation within the condensed consolidated financial statements set forth above.\n \nOverview\nThird quarter 2025 Net sales were \n$1,502.4 million\n and increased by\n 4.1%, \ndriven by an increase in organic sales volume of \n3.2%\n, primarily due to favorable price realization and an increase from acquisitions of \n0.8%\n from the net sales contributed by Ventev and Nicor.\nOrganic net sales in the Electrical Solutions segment grew b\ny 8.3% in the third quarter of 2025 led by continued strength in the datacenter and industrial markets and higher price realization. In the Utility Solutions segment, organic net sales increased 0.5% on higher volume from Grid Infrastructure products along with higher price realization, partially offset by lower volumes from Grid Automation due to weak AMI and meter project activity.\nOperating margin in the third quarter of 2025 expanded by \n30\n basis points to \n22.0%. \nAdjusted operating margin, which excludes amortization of acquisition-related intangibles and transaction, integration and separation costs, was \n23.9%\n and \nincreased\n by \n10\n basis points. Margin expansion in the quarter was primarily driven by benefits from operational productivity and favorable price realization, partially offset by margin contraction driven by continued material and other cost inflation, including tariff expense. See further discussion within Segment Results below.\nSUMMARY OF CONDENSED CONSOLIDATED RESULTS (IN MILLIONS, EXCEPT PER SHARE DATA):\n \n \nThree Months Ended September 30,\n \n2025\n% of Net sales\n2024\n% of Net sales\nNet sales\n$\n1,502.4 \n \n$\n1,442.6 \n \nCost of goods sold\n958.1 \n63.8 \n%\n936.6 \n64.9 \n%\nGross profit\n544.3 \n36.2 \n%\n506.0 \n35.1 \n%\nSelling & administrative (“S&A”) expense\n213.7 \n14.2 \n%\n193.3 \n13.4 \n%\nOperating income\n330.6 \n22.0 \n%\n312.7 \n21.7 \n%\nNet income\n256.7 \n17.1 \n%\n227.8 \n15.8 \n%\nLess: Net income attributable to non-controlling interest\n(1.2)\n(0.1)\n%\n(1.6)\n(0.1)\n%\nNet income attributable to Hubbell Incorporated\n255.5 \n17.0 \n%\n226.2 \n15.7 \n%\nLess: Earnings allocated to participating securities\n(0.4)\n(0.4)\nNet income available to common shareholders\n$\n255.1 \n$\n225.8 \nAverage number of diluted shares outstanding\n53.4 \n54.0 \nDILUTED EARNINGS PER SHARE \n$\n4.77 \n$\n4.18 \nIn the following discussion of results of operations, we refer to “adjusted\n”\n operating measures. We believe those adjusted measures, which exclude the impact of certain costs, gains and losses, may provide investors with useful information regarding our underlying performance from period to period and allow investors to understand our results of operations without regard to items that, in management's judgement, significantly affect the comparability of operating results, or are not considered to be components of our core operating performance. \n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    37\nBack to Content\nSignificant items impacting comparability comprise the following:\nTransaction, integration and separation costs\nThe effect that acquisitions and divestitures may have on our results can fluctuate significantly based on the timing, size and number of transactions, and therefore result in significant volatility in the costs to complete transactions and to integrate or separate the businesses.\nTransaction costs are primarily professional services and other fees incurred to complete the transactions. Integration and separation costs are the internal and external incremental costs directly relating to these activities for the acquired or divested business.\nThe acquisition and integration of DMC Power will result in significant transaction and integration costs, and the acquisitions and dispositions completed by the company in the fourth quarter of 2023 resulted in a significant increase in transaction, integration and separation costs. As a result, we believe excluding such costs relating to these transactions provides useful and more comparable information for investors to better assess our operating performance from period to period.\nGains or losses on disposition of a business\nCertain of the Company's adjusted measures exclude these gains or losses because we believe they enhance management's and investors' ability to analyze underlying business performance and facilitate comparisons of our financial results over multiple periods. In the first quarter of 2024 the Company recognized a \n$5.3 million\n pre-tax loss on the disposition of the residential lighting business and also recognized $6.8 million of income tax expense relating to that transaction, primarily driven by differences between book and tax basis in goodwill. In the second quarter of 2025 the Company recognized a \n$0.4 million\n pre-tax loss on the disposition of a product line in the Electrical Solutions segment. Those losses and the related income tax expense are excluded from our adjusted operating measures.\nAmortization of intangible assets\nAdjusted operating measures exclude amortization of all intangible assets associated with our business acquisitions, including inventory step-up amortization associated with those acquisitions. The intangible assets associated with our business acquisitions arise from the allocation of the purchase price using the acquisition method of accounting in accordance with Accounting Standards Codification 805, “Business Combinations.” These assets consist primarily of customer relationships, developed technology, trademarks and tradenames, and patents, as reported in Note 7 – Goodwill and Other Intangible Assets, under the heading “Total Definite-Lived Intangibles,” within the Company’s audited consolidated financial statements set forth in its Annual Report on Form 10-K for the fiscal year ended December 31, 2024.  \nThe Company believes that the exclusion of these non-cash expenses (i) enhances management’s and investors’ ability to analyze underlying business performance, (ii) facilitates comparisons of our financial results over multiple periods, and (iii) provides more relevant comparisons of our results with the results of other companies as the amortization expense associated with these assets may fluctuate significantly from period to period based on the timing, size, nature, and number of acquisitions. Although we exclude amortization of these acquired intangible assets and inventory step-up from our non-GAAP results, we believe that it is important for investors to understand that revenue generated, in part, from such intangibles is included within revenue in determining adjusted net income attributable to Hubbell Incorporated. \nAdjusted results also excluded the income tax effects of the above adjustments which are calculated using the statutory tax rate, taking into consideration the nature of the item and the relevant taxing jurisdiction, unless otherwise noted. \nOrganic net sales (or organic net sales growth), a non-GAAP measure, represents Net sales according to U.S. GAAP, less Net sales from acquisitions and divestitures during the first twelve months of ownership or divestiture, respectively, less the effect of fluctuations in Net sales from foreign currency exchange. The period-over-period effect of fluctuations in Net sales from foreign currency exchange is calculated as the difference between local currency Net sales of the prior period translated at the current period exchange rate as compared to the same local currency Net sales translated at the prior period exchange rate. We believe this measure provides management and investors with a more complete understanding of the underlying operating results and trends of established, ongoing operations by excluding the effect of acquisitions, dispositions and foreign currency as these activities can obscure underlying trends. When comparing Net sales growth between periods, excluding the effects of acquisitions, business dispositions and currency exchange rates, those effects are different when comparing results for different periods. For example, because Net sales from acquisitions are considered inorganic from the date we complete an acquisition through the end of the first year following the acquisition, Net sales from such acquisitions are reflected as organic net sales thereafter.\n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    38\nBack to Content\nThere are limitations to the use of non-GAAP measures. Non-GAAP measures do not present complete financial results. We compensate for this limitation by providing a reconciliation between our non-GAAP financial measures and the respective most directly comparable financial measure calculated and presented in accordance with GAAP. Because non-GAAP financial measures are not standardized, it may not be possible to compare these financial measures with other companies’ non-GAAP financial measures having the same or similar names. These financial measures should not be considered in isolation from, as substitutes for, or alternative measures of, reported GAAP financial results, and should be viewed in conjunction with the most comparable GAAP financial measures and the provided reconciliations thereto. We believe, however, that these non-GAAP financial measures, when viewed together with our GAAP results and related reconciliations, provide a more complete understanding of our business. We strongly encourage investors to review our consolidated financial statements and publicly filed reports in their entirety and not rely on any single financial measure.\nThe following table reconciles Adjusted operating income, a non-GAAP measure, to Operating income, the directly comparable GAAP financial measure (in millions):\n \nThree Months Ended September 30,\n \n2025\n% of Net sales\n2024\n% of Net sales\nOperating income (GAAP measure)\n$\n330.6 \n22.0 \n%\n$\n312.7 \n21.7 \n%\nAmortization of acquisition-related intangible assets\n24.7 \n1.7 \n%\n28.1 \n1.9 \n%\nTransaction, integration and separation costs\n3.1 \n0.2 \n%\n2.9 \n0.2 \n%\nAdjusted operating income (non-GAAP measure)\n$\n358.4 \n23.9 \n%\n$\n343.7 \n23.8 \n%\nThe following table reconciles Adjusted net income attributable to Hubbell Incorporated, Adjusted net income available to common shareholders, and the diluted per share amounts thereof, each a non-GAAP measure, to the directly comparable GAAP financial measures (in millions, except per share data).\nThree Months Ended September 30,\n2025\nDiluted Per Share\n2024\nDiluted Per Share\nNet income attributable to Hubbell Incorporated (GAAP measure)\n$\n255.5 \n$\n4.77 \n$\n226.2 \n$\n4.18 \nAmortization of acquisition-related intangible assets\n24.7 \n0.47 \n28.1 \n0.52 \nTransaction, integration and separation costs\n3.1 \n0.06 \n2.9 \n0.05 \nLoss on disposition of business\n— \n— \n— \n— \n   Subtotal\n$\n283.3 \n$\n5.30 \n$\n257.2 \n$\n4.75 \nIncome tax effects\n(1)\n \n6.7 \n0.12 \n7.5 \n0.13 \nAdjusted net income attributable to Hubbell Incorporated (non-GAAP measure)\n$\n276.6 \n$\n5.18 \n$\n249.7 \n$\n4.62 \nLess: Earnings allocated to participating securities\n(0.4)\n(0.01)\n(0.4)\n(0.01)\nAdjusted net income available to common shareholders (non-GAAP measure)\n$\n276.2 \n$\n5.17 \n$\n249.3 \n$\n4.61 \n(1) \nThe income tax effects are calculated using the statutory tax rate, taking into consideration the nature of the item and the relevant taxing jurisdiction, unless otherwise noted.\nThe following table reconciles our organic net sales to the directly comparable GAAP financial measure (in millions and percentage change):\nThree Months Ended September 30,\n2025\nInc/(Dec) %\n2024\nInc/(Dec) %\nNet sales growth (GAAP measure)\n$\n59.8 \n4.1 \n$\n66.8 \n4.9 \nImpact of acquisitions\n11.5 \n0.8 \n128.6 \n9.4 \nImpact of divestitures\n— \n— \n(45.6)\n(3.3)\nForeign currency exchange\n1.6 \n0.1 \n(2.4)\n(0.2)\nOrganic net sales growth (non-GAAP measure)\n$\n46.7 \n3.2 \n$\n(13.8)\n(1.0)\n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    39\nBack to Content\nNet Sales\nNet sales of $1,502.4 million in the third quarter of 2025 increased by $59.8 million compared to the third quarter of 2024. \nOrganic net sales increased by 3.2% driven by a mid single digit percentage increase in price realization, while volumes were down low single digits. Acquisitions contributed an 0.8% increase to Net sales, while foreign exchange resulted in a 0.1% increase in Net sales. These changes are discussed in more detail in the Segment Results section below. \nCost of Goods Sold and Gross Profit\nAs a percentage of Net sales, cost of goods sold decreased by 110 basis points to 63.8% in the third quarter of 2025, resulting in gross profit margin expanding to 36.2%. \nApproximately five percentage points of gross profit margin expansion was driven by favorable price realization, improved operational productivity, and lower acquisition-related intangible asset amortization, partially offset by approximately four percentage points of gross profit margin contraction due to material and other cost inflation, including tariff expense.\nSelling & Administrative Expenses\nS&A expense in the third quarter of 2025 was $213.7 million and increased by $20.4 million or 10.6% compared to the prior year period. \nThis increase was primarily driven by higher acquisition-related intangible asset amortization, higher professional service costs and higher restructuring costs in the current year compared to the prior year. \nS&A expense as a percentage of Net sales was 14.2% in the\n \nthird\n \nquarter of 2025, compared to 13.4% in the third quarter of 2024. \nTotal Other Expense\n \nTotal other expense in the third quarter of 2025 was $19.5 million and decreased $4.8 million compared to the third quarter of 2024. The decrease was driven by a $5.1 million decrease in net interest expense due to a lower average balance of debt outstanding in the current quarter. \nIncome Taxes\n \nThe effective tax rate in the third quarter of 2025 decreased to 17.5% as compared to 21.0% in the third quarter of 2024, primarily due to a larger income tax benefit in the third quarter of 2025 from international restructurings, as compared to a smaller income tax benefit of international restructurings that were completed in the prior year period.\nNet Income Attributable to Hubbell Incorporated and Earnings Per Diluted Share \n \nNet income attributable to Hubbell Incorporated was $255.5 million in the third quarter of 2025 and increased by 13.0% as compared to the same period of the prior year, reflecting the factors described above. As a result, earnings per diluted share in the third quarter of 2025 increased by 14% as compared to the third quarter of 2024. Adjusted net income attributable to Hubbell Incorporated, which excludes amortization of acquisition-related intangible assets and transaction, integration and separation costs for both periods was $276.6 million in the third quarter of 2025 and increased by 10.8% as compared to the third quarter of 2024.  \n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    40\nBack to Content\nSegment Results\nUTILITY SOLUTIONS\nThe following table reconciles our Utility Solutions segment adjusted operating income and adjusted operating margin to the directly comparable GAAP financial measures (in millions and percentage change):\nThree Months Ended September 30,\n(In millions)\n2025\n2024\nNet sales\n$\n943.8 \n$\n933.1 \nOperating income (GAAP measure)\n219.3 \n219.2 \nAmortization of acquisition-related intangible assets\n19.9 \n24.1 \nTransaction, integration and separation costs\n3.1 \n1.4 \nAdjusted operating income (non-GAAP measure)\n$\n242.3 \n$\n244.7 \nOperating margin (GAAP measure)\n23.2 \n%\n23.5 \n%\nAdjusted operating margin (non-GAAP measure)\n25.7 \n%\n26.2 \n%\n \nThe following table reconciles our Utility Solutions segment organic net sales to the directly comparable GAAP financial measure (in millions and percentage change):\nThree Months Ended September 30,\nUtility Solutions\n2025\nInc/(Dec) %\n2024\nInc/(Dec) %\nNet sales growth (GAAP measure)\n$\n10.7 \n1.2 \n$\n95.2 \n11.3 \nImpact of acquisitions\n5.4 \n0.6 \n128.6 \n15.3 \nImpact of divestitures\n— \n— \n— \n— \nForeign currency exchange\n0.8 \n0.1 \n(1.4)\n(0.2)\nOrganic net sales growth (decline) (non-GAAP measure)\n$\n4.5 \n0.5 \n$\n(32.0)\n(3.8)\nNet sales in the Utility Solutions segment in the third quarter of 2025 were $943.8 million, and increased by $10.7 million, or 1.2%, as compared to the third quarter of 2024\n. That increase was driven by a 0.5% increase in organic net sale\ns, and a 0.6% increase due to acquisitions. The increase in organic net sales was driven by a low single digit increase in price realization, partially offset by a low single digit decrease due to volume. The decrease in volume reflects strength in transmission, distribution and sub station markets, which was more than offset by a decline in G\nrid Automation due to weak AMI and meter project activity.\nOperating income in the Utility Solutions segment for the third quarter of 2025 was $219.3 million, and was approximately flat compared to the third quarter of 2024. Operating margin decreased by 30 basis points to 23.2% in the third quarter of 2025, \nand includes the effect of changes in amortization of acquisition-related intangible assets and transaction, integration and separation costs, as shown in the table above.\n Excluding amortization of acquisition-related intangible assets and transaction, integration and separation costs, the adjusted operating margin decreased by 50 basis points to 25.7%. That decrease includes approximately four percentage points of margin expansion from favorable price realization and improved operational productivity. Those factors were more than offset by approximately four percentage points of margin contraction due to material and other cost inflation, including tariff expense, unfavorable business mix and higher restructuring investments.\n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    41\nBack to Content\nELECTRICAL SOLUTIONS\nThe following table reconciles our Electrical Solutions segment adjusted operating income and adjusted operating margin to the directly comparable GAAP financial measures (in millions and percentage change):\nThree Months Ended September 30,\n(In millions)\n2025\n2024\nNet sales\n$\n558.6 \n$\n509.5 \nOperating income (GAAP measure)\n111.3 \n93.5 \nAmortization of acquisition-related intangible assets\n4.8 \n4.0 \nTransaction, integration and separation costs\n— \n1.5 \nAdjusted operating income (non-GAAP measure)\n$\n116.1 \n$\n99.0 \nOperating margin (GAAP measure)\n19.9 \n%\n18.4 \n%\nAdjusted operating margin (non-GAAP measure)\n20.8 \n%\n19.4 \n%\n \nThe following table reconciles our Electrical Solutions segment organic net sales to the directly comparable GAAP financial measure (in millions and percentage change):\nThree Months Ended September 30,\nElectrical Solutions\n2025\nInc/(Dec) %\n2024\nInc/(Dec) %\nNet sales growth (decline) (GAAP measure)\n$\n49.1 \n9.6 \n$\n(28.4)\n(5.3)\nImpact of acquisitions\n6.1 \n1.1 \n— \n— \nImpact of divestitures\n— \n— \n(45.6)\n(8.5)\nForeign currency exchange\n0.8 \n0.2 \n(1.0)\n(0.2)\nOrganic net sales growth (non-GAAP measure)\n$\n42.2 \n8.3 \n$\n18.2 \n3.4 \nNet sales in the Electrical Solutions segment in the third quarter of 2025 were $558.6 million and increased by $49.1 million, or 9.6%, as compared to the third quarter of 2024. That increase includes 8.3% growth in organic net sales, and a 1.1% increase due to acquisitions. The increase in organic net sales was driven by a mid single digit percentage increase in price realization, and a low single digit increase in unit volumes. \nOperating income in the Electrical Solutions segment for the third quarter of 2025 was $111.3 million and increased by 19.0% compared to the third quarter of 2024, while operating margin in the third quarter of 2025 expanded by 150 basis points to 19.9%. Excluding amortization of acquisition-related intangibles in both 2025 and 2024 and transaction, integration and separation costs in 2024, the adjusted operating margin expanded by 140 basis points to 20.8%.\n The increase in operating margin was primarily due to approximately seven percentage points of margin expansion from favorable price realization, operational productivity and higher unit volumes. Those factors were partially offset by approximately five percentage points of margin contraction driven by higher material and other cost inflation, including tariff expense and higher restructuring investments.\n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    42\nBack to Content\nResults of Operations – Nine Months Ended September 30, 2025 compared to the Nine Months Ended September 30, 2024\nSUMMARY OF CONDENSED CONSOLIDATED RESULTS (IN MILLIONS, EXCEPT PER SHARE DATA):\n \n \nNine Months Ended September 30,\n \n2025\n% of Net sales\n2024\n% of Net sales\nNet sales\n$\n4,351.9 \n \n$\n4,294.2 \n \nCost of goods sold\n2,812.9 \n64.6 \n%\n2,840.8 \n66.2 \n%\nGross profit\n1,539.0 \n35.4 \n%\n1,453.4 \n33.8 \n%\nSelling & administrative (“S&A”) expense\n641.7 \n14.8 \n%\n620.0 \n14.4 \n%\nOperating income\n897.3 \n20.6 \n%\n833.4 \n19.4 \n%\nNet income\n666.7 \n15.3 \n%\n585.3 \n13.6 \n%\nLess: Net income attributable to non-controlling interest\n(3.8)\n(0.1)\n%\n(4.5)\n(0.1)\n%\nNet income attributable to Hubbell Incorporated\n662.9 \n15.2 \n%\n580.8 \n13.5 \n%\nLess: Earnings allocated to participating securities\n(1.1)\n(1.1)\nNet income available to common shareholders\n$\n661.8 \n$\n579.7 \nAverage number of diluted shares outstanding\n53.6 \n54.0 \nDILUTED EARNINGS PER SHARE \n$\n12.35 \n$\n10.73 \nThe following table reconciles Adjusted operating income, a non-GAAP measure, to Operating income, the directly comparable GAAP financial measure (in millions):\n \nNine Months Ended September 30,\n \n2025\n% of Net sales\n2024\n% of Net sales\nOperating income (GAAP measure)\n$\n897.3 \n20.6 \n%\n$\n833.4 \n19.4 \n%\nAmortization of acquisition-related intangible assets\n74.6 \n1.7 \n%\n96.0 \n2.2 \n%\nTransaction, integration and separation costs\n4.2 \n0.1 \n%\n11.9 \n0.3 \n%\nAdjusted operating income (non-GAAP measure)\n$\n976.1 \n22.4 \n%\n$\n941.3 \n21.9 \n%\nThe following table reconciles Adjusted net income attributable to Hubbell Incorporated, Adjusted net income available to common shareholders, and the diluted per share amounts thereof, each a non-GAAP measure, to the directly comparable GAAP financial measures (in millions, except per share data).\nNine Months Ended September 30,\n2025\nDiluted Per Share\n2024\nDiluted Per Share\nNet income attributable to Hubbell Incorporated (GAAP measure)\n$\n662.9 \n$\n12.35 \n$\n580.8 \n$\n10.73 \nAmortization of acquisition-related intangible assets\n74.6 \n1.39 \n96.0 \n1.78 \nTransaction, integration & separation costs\n4.2 \n0.08 \n11.9 \n0.22 \nLoss on disposition of business\n0.4 \n0.01 \n5.3 \n0.10 \n   Subtotal\n$\n742.1 \n$\n13.83 \n$\n694.0 \n$\n12.83 \nIncome tax effects\n(1)\n \n18.8 \n0.34 \n19.4 \n0.35 \nAdjusted net income attributable to Hubbell Incorporated (non-GAAP measure)\n$\n723.3 \n$\n13.49 \n$\n674.6 \n$\n12.48 \nLess: Earnings allocated to participating securities\n(1.2)\n(0.01)\n(1.3)\n(0.02)\nAdjusted net income available to common shareholders (non-GAAP measure)\n$\n722.1 \n$\n13.48 \n$\n673.3 \n$\n12.46 \n(1) \nThe income tax effects are calculated using the statutory tax rate, taking into consideration the nature of the item and the relevant taxing jurisdiction, unless otherwise noted.\n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    43\nBack to Content\nThe following table reconciles our organic net sales to the directly comparable GAAP financial measure (in millions and percentage change):\nNine Months Ended September 30,\n2025\nInc/(Dec) %\n2024\nInc/(Dec) %\nNet sales growth (GAAP measure)\n$\n57.7 \n1.3 \n$\n267.1 \n6.6 \nImpact of acquisitions\n20.9 \n0.5 \n345.9 \n8.6 \nImpact of divestitures\n(21.1)\n(0.5)\n(120.9)\n(3.0)\nForeign currency exchange\n(9.1)\n(0.3)\n(0.4)\n— \nOrganic net sales growth (non-GAAP measure)\n$\n67.0 \n1.6 \n$\n42.5 \n1.0 \nNet Sales\nNet sales of $4,351.9 million in the first nine months of 2025 increased by $57.7 million compared to the first nine months of 2024. \nOrganic Net sales increased by 1.6% driven by a low single digit increase in price realization, partially offset by a low single digit percentage decrease in volumes. Foreign currency exchange resulted in a 0.3% decrease in Net sales. These changes are discussed in more detail in the Segment Results section below. \nCost of Goods Sold and Gross Profit\nAs a percentage of Net sales, cost of goods sold decreased by 160 basis points to 64.6% in the first nine months of 2025, resulting in gross profit margin expanding to 35.4%. \nApproximately five percentage points of gross profit margin expansion was driven by improved operational productivity, favorable price and lower acquisition-related intangible asset amortization, partially offset by three percentage points of gross profit margin contraction due to material and other cost inflation, including tariff expense and lower volume.\nSelling & Administrative Expenses\nS&A expense in the first nine months of 2025 was $641.7 million and increased by $21.7 million or 3.5% compared to the prior year period. \nThis increase was primarily driven by higher intangible amortization expense, partially offset by lower transaction, integration and separation costs in the current year period compared to the prior year period. \nS&A expense as a percentage of Net sales was 14.8% in the first nine months of 2025, compared to 14.4% in the first nine months of 2024. \nTotal Other Expense\n \nTotal other expense decreased by $12.7 million in the first nine months of 2025 to $59.7 million, primarily due to lower net interest expense of $17.7 million, due to lower outstanding debt balances, along with a $4.9 million net decrease on the loss recognized on a business disposition, primarily due to the disposal of the residential lighting business in the first quarter of 2024. These decreases were partially offset by lower transaction service revenue and higher non-service pension costs in the first nine months of 2025 compared to the same period in 2024. \nIncome Taxes\n \nThe effective tax rate in the first nine months 2025 decreased to 20.4% as compared to 23.1% in the first nine months of 2024, primarily d\nue to an income tax benefit of third quarter of 2025 international restructuring compared to the income tax costs of the sale of our residential lighting business in the first quarter of 2024, and a smaller benefit of third quarter of 2024 international restructuring.  \nNet Income Attributable to Hubbell Incorporated and Earnings Per Diluted Share \n \nNet income attributable to Hubbell Incorporated was $662.9 million in the first nine months of 2025 and increased 14.1% as compared to the same period of the prior year, reflecting the factors described above. As a result, earnings per diluted share in the first nine months of 2025 increased by 15.1% as compared to the first nine months of 2024. Adjusted net income attributable to Hubbell Incorporated, which excludes amortization of acquisition-related intangible assets and transaction, integration and separation costs and the loss on disposition of a business, was $722.1 million in the first nine months of 2025 and increased by 7.2% as compared to the first nine months of 2024.  \n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    44\nBack to Content\nSegment Results\nUTILITY SOLUTIONS\nThe following table reconciles our Utility Solutions segment adjusted operating income and adjusted operating margin to the directly comparable GAAP financial measures (in millions and percentage change):\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nNet sales\n$\n2,736.4 \n$\n2,753.6 \nOperating income (GAAP measure)\n588.3 \n564.1 \nAmortization of acquisition-related intangible assets\n59.7 \n83.7 \nTransaction, integration and separation costs\n3.7 \n5.6 \nAdjusted operating income (non-GAAP measure)\n$\n651.7 \n$\n653.4 \nOperating margin (GAAP measure)\n21.5 \n%\n20.5 \n%\nAdjusted operating margin (non-GAAP measure)\n23.8 \n%\n23.7 \n%\n \nThe following table reconciles our Utility Solutions segment organic net sales to the directly comparable GAAP financial measure (in millions and percentage change):\nNine Months Ended September 30,\nUtility Solutions\n2025\nInc/(Dec) %\n2024\nInc/(Dec) %\nNet sales growth (decline) (GAAP measure)\n$\n(17.2)\n(0.6)\n$\n303.3 \n12.4 \nImpact of acquisitions\n5.4 \n0.2 \n345.9 \n14.1 \nImpact of divestitures\n— \n— \n— \n— \nForeign currency exchange\n(4.8)\n(0.2)\n(1.1)\n— \nOrganic net sales growth (decline) (non-GAAP measure)\n$\n(17.8)\n(0.6)\n$\n(41.5)\n(1.7)\nNet sales in the Utility Solutions segment in the first nine months of 2025 were $2,736.4 million, and decreased by $17.2 million, or \n0.6%\n, as compared to the first nine months of 2024\n. That decrease was driven by a 0.6% decrease in organic net sale\ns, and a \n0.2%\n decrease due to foreign currency exchange, partially offset by a 0.2% increase due to acquisitions. The decrease in organic net sales was driven by a low single digit percentage decrease in \nunit\n volume, partially offset by a low single digit increase in price realization. \nThe decrease in unit volume resulted largely from volume declines in Grid Automation due to weak AMI and meter project activity,\n partially offset by strength in substation and transmission markets.\nOperating income in the Utility Solutions segment for the first nine months of 2025 was $588.3 million, an increase of 4.3% compared to the first nine months of 2024. Operating margin increased by 100 basis points to 21.5% in the first nine months of 2025, \nand includes the effect of lower amortization of acqusition-related intangible assets and transaction, integration and separation costs.\n Excluding amortization of acquisition-related intangible assets and transaction, integration and separation costs, the adjusted operating margin increased by 10 basis points to 23.8%. That increase includes approximately four percentage points of margin expansion from favorable price realization, improved operational productivity, higher restructuring and related savings and beneficial business mix. Those factors were partially offset by slightly less than four percentage points of margin contraction due to material and other cost inflation, including tariff expense.\n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    45\nBack to Content\nELECTRICAL SOLUTIONS\nThe following table reconciles our Electrical Solutions segment adjusted operating income and adjusted operating margin to the directly comparable GAAP financial measures (in millions and percentage change):\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nNet sales\n$\n1,615.5 \n$\n1,540.6 \nOperating income (GAAP measure)\n309.0 \n269.3 \nAmortization of acquisition-related intangible assets\n14.9 \n12.3 \nTransaction, integration and separation costs\n0.5 \n6.3 \nAdjusted operating income (non-GAAP measure)\n$\n324.4 \n$\n287.9 \nOperating margin (GAAP measure)\n19.1 \n%\n17.5 \n%\nAdjusted operating margin (non-GAAP measure)\n20.1 \n%\n18.7 \n%\n \nThe following table reconciles our Electrical Solutions segment organic net sales to the directly comparable GAAP financial measure (in millions and percentage change):\nNine Months Ended September 30,\nElectrical Solutions\n2025\nInc/(Dec) %\n2024\nInc/(Dec) %\nNet sales growth (decline) (GAAP measure)\n$\n74.9 \n4.9 \n$\n(36.2)\n(2.3)\nImpact of acquisitions\n15.5 \n1.0 \n— \n— \nImpact of divestitures\n(21.1)\n(1.4)\n(120.9)\n(7.6)\nForeign currency exchange\n(4.3)\n(0.2)\n0.7 \n— \nOrganic net sales growth (non-GAAP measure)\n$\n84.8 \n5.5 \n$\n84.0 \n5.3 \nNet sales in the Electrical Solutions segment in the first nine months of 2025 were \n$1,615.5 million\n and increased by \n$74.9 million\n, or \n4.9%\n, as compared to the first nine months of 2024. That increase includes \n5.5%\n growth in organic net sales, which was partially offset by a 0.4% decline in net sales resulting from divestitures net of acquisitions and a \n0.2%\n decline due to foreign currency exchange. The increase in organic net sales was driven by a low single digit percentage increase in unit volumes and a low single digit percentage increase in price realization. Volume growth in the first nine months of 2025 was driven primarily by strength in the datacenter market, while\n broader industrial markets were steady and residential markets were softer.\n \nOperating income in the Electrical Solutions segment for the first nine months of 2025 was $309.0 million an increase of 14.7% compared to the first nine months of 2024, while operating margin in the first nine months of 2025 expanded by 160 basis points to 19.1%. Excluding amortization of acquisition-related intangibles and transaction, integration and separation costs, the adjusted operating margin expanded by 140 basis points to 20.1%.\n The increase in operating margin was primarily due to approximately five percentage points of margin expansion from favorable price realization, operational productivity,\n higher unit volumes and increased savings from restructuring and related projects.\n Those factors were partially offset by approximately four percentage points of margin contraction driven by higher material and other cost inflation, including tariff expense.\nFinancial Condition, Liquidity and Capital Resources\nCash Flow\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nNet cash provided by (used in):\n \n \nOperating activities\n$\n582.3 \n$\n558.8 \nInvesting activities \n(215.4)\n20.0 \nFinancing activities \n(42.6)\n(476.4)\nEffect of foreign currency exchange rate changes on cash and cash equivalents\n13.0 \n(3.2)\nNET CHANGE IN CASH AND CASH EQUIVALENTS\n$\n337.3\n \n$\n99.2\n \n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    46\nBack to Content\nCash provided by operating activities for the nine months ended September 30, 2025 was \n$582.3\n million\n compared to cash provided by operating activities of $558.8 million for the same period in 2024. The increase in cash provided by operations is due to higher net income and a lower use of cash for incentive payments in the first nine months of 2025 compared to the same period of the prior year. Those factors were partially offset by an increase in working capital, primarily within accounts receivable driven by higher sales volume, lower depreciation and amortization expense, and a $20.0 million contribution to our pension plan in 2025. \nCash used by investing activities was $215.4 million in the nine months ended September 30, 2025 compared to cash provided of $20.0 million during the comparable period in 2024. This change was driven by $129.1 million of cash used in 2025 to acquire Ventev and Nicor, and $122.9 million of cash proceeds in the first quarter of 2024 from the disposition of our residential lighting business.\n \nCash used by financing activities was $42.6 million in the nine months ended September 30, 2025 as compared to cash used of $476.4 million in the comparable period of 2024. The decrease in cash used by financing activities primarily reflects an increase in borrowings in 2025, including an approximately $225 million increase in a commercial paper borrowing in September 2025 to fund a portion of the DMC Power purchase price in the fourth quarter, as well as higher payments against term loan borrowings in 2024 and a $195.0 million increase in share repurchases in the first nine months of 2025 compared to the prior year period. \nThe favorable impact of foreign currency exchange rates on cash was $13.0 million for the nine months ended September 30, 2025 and the change compared to prior year is primarily related to the U.S. Dollar weakening against the Brazilian Real, British Pound, and  Mexican Peso.\n \nInvestments in the Business\n \nInvestments in our business include cash outlays for the acquisition of businesses, and investments in capacity and innovation, as well as for expenditures on productivity initiatives and to maintain the operation of our equipment and facilities and invest in restructuring activities. \nIn the first nine months of 2025, we completed two acquisitions. Ventev was acquired for approximately $73 million, expanding our portfolio of wireless network solutions within the Electrical Solutions segment and Nicor was acquired for approximately $56 million, expanding our portfolio of water metering endpoint solutions, including polymer meter box lids and covers within the Utility Solutions segment. \nOn October 1, 2025, the Company acquired DMC Power for approximately $825 million, net of cash acquired, subject to customary purchase price adjustments. DMC Power is a provider of connectors and tooling for utility substation and transmission markets. DMC Power will be added to the Utility Solutions segment. \nWe invested $96.4 million in capital expenditures on automation and productivity initiatives in the first nine months of 2025, and w\ne also continue to invest in restructuring and related programs to maintain a competitive cost structure, to drive operational efficiencies and to mitigate the impact of rising material costs and administrative cost inflation. We expect our investments in restructuring and related activities to continue through the remainder of 2025 as we continue to invest in previously initiated actions and initiate further footprint consolidation, and other cost reduction initiatives.\nIn connection with our restructuring and related actions, we have incurred restructuring costs as defined by U.S. GAAP, which are primarily severance and employee benefits, asset impairments, and accelerated depreciation, as well as facility closure, contract termination and certain pension costs that are directly related to restructuring actions. We also incurred restructuring-related costs, which are costs associated with our business transformation initiatives, including the consolidation of back-office functions and streamlining of our processes, and certain other costs and gains associated with restructuring actions. We refer to these costs on a combined basis as “restructuring and related costs”, which is a non-GAAP measure. We believe this non-GAAP measure provides investors with useful information regarding our underlying performance from period to period. Restructuring costs are predominantly settled in cash from our operating activities and are generally settled within one year, with the exception of asset impairments, which are non-cash.\n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    47\nBack to Content\nThe table below presents the restructuring and related costs incurred in the first nine months of 2025, additional expected costs, and the expected completion date of restructuring actions that have been initiated as of September 30, 2025 and in prior years (in millions):\nCosts incurred in the nine months ended September 30, 2025\nAdditional expected costs\nExpected completion date\n2025 Restructuring Actions\n$\n8.4 \n$\n3.0 \n2026\n2024 and Prior Restructuring Actions \n1.8 \n3.7 \n2026\nTotal Restructuring cost (GAAP measure)\n$\n10.2\n \n$\n6.7\n \nRestructuring-related costs\n3.3 \n0.6 \nRestructuring and related costs (Non-GAAP measure)\n$\n13.5\n \n$\n7.3\n \nStock Repurchase Program\nOn October 21, 2022, our Board of Directors approved a share repurchase program (the “2022 Program”) that authorized the repurchase of up to $300 million of common stock, which expired on October 21, 2025. At September 30, 2025, our remaining share repurchase authorization under the 2022 Program was $35.0 million. On February 12, 2025, our Board of Directors approved a new stock repurchase program (the “2025 Program”) that authorized the repurchase of up to $500.0 million of common stock and expires in February 2028.  When combined with the $35.0 million of remaining share repurchase authorization under the 2022 Program, we had a total outstanding share repurchase authorization of approximately $535.0 million at September 30, 2025. Subject to numerous factors, including market conditions and alternative uses of cash, we may conduct discretionary repurchases through open market or privately negotiated transactions, which may include repurchases under plans complying with Rules 10b5-1 and 10b-18 under the Securities Exchange Act of 1934, as amended. \nDebt to Capital\n \nAt September 30, 2025 and December 31, 2024, the Company had $1,044.8 million and $1,442.7 million, respectively, of long-term debt outstanding, net of the unamortized balance of capitalized debt issuance costs. At September 30, 2025, the Company also had $399.7 million of long-term debt maturing within the next 12 months relating to the 2026 Notes described below, which is classified within short-term debt in the Condensed Consolidated Balance Sheets. \n2025 Term Loan\nOn September 29, 2025, the Company entered into a Term Loan Agreement (the \"Term Loan Agreement\") with a syndicate of lenders and JPMorgan Chase Bank, N.A., as administrative agent. The Term Loan Agreement provides the Company, with the ability to borrow up to $600 million on an unsecured basis to finance the DMC Power acquisition, repay certain existing indebtedness of DMC Power and pay fees, costs and expenses in connection with the foregoing. \nOn October 1, 2025, the Company borrowed $600 million under the Term Loan Agreement (the \"Loans\") to pay a portion of the purchase price. The Loans were made in a single borrowing and will be due and payable on September 29, 2028. The Loans bear interest based on the Term SOFR Rate (as defined in the Term Loan Agreement), plus an applicable interest addition based on Hubbell's credit ratings. Hubbell also paid the lenders certain customary fees under the Term Loan Agreement. There were no amounts outstanding under the Term Loan as of September 30, 2025.\nThe Term Loan Agreement contains representations and warranties and affirmative and negative covenants customary for unsecured financing of this type, as well as a financial covenant requiring that, as of the last day of each fiscal quarter, the ratio of total indebtedness to total capitalization shall not be greater than 65%. The Company was in compliance with this covenant as of September 30, 2025. \n2025 Credit Facility\nOn March 25, 2025, the Company, as borrower, and each foreign subsidiary borrower from time to time party thereto (collectively, the “Foreign Subsidiary Borrowers”) entered into a five-year credit agreement with a syndicate of lenders and JPMorgan Chase Bank, N.A., as administrative agent, that provides for a $1.0 billion committed unsecured revolving credit facility (the “Revolving Credit Agreement”). The obligations of the Foreign Subsidiary Borrowers (if any) under the Revolving Credit Agreement are guaranteed by the Company. \n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    48\nBack to Content\nCommitments under the Revolving Credit Agreement may be conditionally increased to an aggregate amount not to exceed $1.5 billion. The Revolving Credit Agreement includes a $50.0 million sub-limit for the issuance of letters of credit. The sum of the dollar amount of loans and letters of credits to the Foreign Subsidiary Borrowers under the Revolving Credit Agreement may not exceed $100.0 million.\nThe interest rate applicable to borrowings under the Revolving Credit Agreement is either (i) the alternate base rate (as defined in the Revolving Credit Agreement) or (ii) the term SOFR rate (as defined in the Revolving Credit Agreement) plus an applicable margin based on the Company's credit ratings.\nAll revolving loans outstanding under the Revolving Credit Agreement will be due and payable on March 25, 2030. The Revolving Credit Agreement provides for up to two one-year maturity extensions. As of September 30, 2025, the credit facility was undrawn.\nThe Revolving Credit Agreement contains a sole financial covenant requiring that, as of the last day of each fiscal quarter, the ratio of total indebtedness to total capitalization shall not be greater than 65%. The Company was in compliance with this covenant as of September 30, 2025. \n2021 Credit Facility\nThe Company had a five-year credit agreement with a syndicate of lenders and JPMorgan Chase, N.A., as administrative agent, that provided a $750 million committed revolving credit facility, which was terminated in connection with entry into the Revolving Credit Agreement.\nUnsecured Senior Notes\nAt both September 30, 2025 and December 31, 2024, the Company had outstanding unsecured, senior notes (the “Notes”) in principal amounts of $400 million due in 2026 (the \"2026 Notes\"), $300 million due in 2027, $450 million due in 2028 and $300 million due in 2031. \nThe carrying value of the Notes, net of unamortized discount and the unamortized balance of capitalized debt issuance costs, including $399.7 million relating to the 2026 Notes classified as current, was $1,445.5 million and $1,442.7 million at September 30, 2025 and December 31, 2024, respectively.\nThe Notes are callable at any time at specified prices and are only subject to accelerated payment prior to maturity upon customary events of default, or upon a change in control triggering event as defined in the indenture governing the Notes, as supplemented. The Company was in compliance with all covenants (none of which are financial) as of September 30, 2025.\n \nShort-term Debt and Current Portion of Long-Term Debt\nThe Company had $951.5 million and $125.4 million of short-term debt and current portion of long-term debt outstanding at September 30, 2025 and December 31, 2024, respectively, composed of the following:\n•\n$399.7 million relating to the 2026 Notes due in March 2026 were classified as current at September 30, 2025. \n•\n$550.0 million of commercial paper borrowings outstanding at September 30, 2025, and $123.0 million of commercial paper borrowings outstanding at December 31, 2024. The increase in commercial paper during the first nine months of 2025 was used for the repurchase of $225.0 million of treasury stock and to partially fund the acquisition of Ventev, Nicor and DMC Power.\n•\n$1.8 million and $2.4 million of other short term debt outstanding at September 30, 2025 and December 31, 2024, respectively, which consisted of borrowings outstanding under our commercial card program. \nNet debt, defined as total debt less cash and investments, is a non-GAAP measure that may not be comparable to definitions used by other companies. We consider net debt to be a useful measure of our financial leverage for evaluating the Company’s ability to meet its funding needs.\n(In millions)\nSeptember 30, 2025\nDecember 31, 2024\nTotal Debt (GAAP measure)\n$\n1,996.3 \n$\n1,568.1 \nHubbell Incorporated Shareholders’ Equity\n3,681.3 \n3,396.2 \nTOTAL CAPITAL (GAAP measure)\n$\n5,677.6\n \n$\n4,964.3\n \nTotal Debt to Total Capital (GAAP measure)\n35 \n%\n32 \n%\nCash and Investments\n780.7 \n429.9 \nNet Debt (non-GAAP measure)\n$\n1,215.6\n \n$\n1,138.2\n \nNet Debt to Total Capital (non-GAAP measure)\n21 \n%\n23 \n%\n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    49\nBack to Content\nLiquidity\n \nWe measure liquidity on the basis of our ability to meet short-term and long-term operational funding needs, to fund additional investments in our business, including acquisitions, and to make dividend payments to shareholders. Significant factors affecting the management of liquidity are cash flows from operating activities, capital expenditures, cash dividend payments, stock repurchases, access to bank lines of credit and our ability to attract long-term capital with satisfactory terms. In the first nine months of 2025, we returned capital to our shareholders by paying $211.1 million of dividends on our common stock and using $225.0 million of cash for share repurchases. \nWe also require cash outlays to fund our operations, capital expenditures, and working capital requirements to accommodate anticipated levels of business activity, as well as our rate of cash dividends, and potential future acquisitions. We have contractual obligations for long-term debt, operating leases, purchase obligations, and certain other long-term liabilities that are summarized in the Financial Condition, Liquidity and Capital Resources section in our Annual Report on Form 10-K for the year ended December 31, 2024. \nOur sources of funds and available resources to meet our funding needs are as follows:\n◦\nCash flows from operating activities and existing cash resources: In addition to cash flows from operating activities, we also had $666.8 million of cash and cash equivalents at September 30, 2025, of which approximately 43\n% was held inside the United States and the remainder held internationally.     \n◦\nOur Revolving Credit Agreement provides a $1.0 billion committed revolving credit facility and commitments under the Revolving Credit Agreement may be increased (subject to certain conditions) to an aggregate amount not to exceed $1.5 billion. Annual commitment fees to support availability under the Revolving Credit Agreement are not material. Although not the principal source of liquidity, we believe our Revolving Credit Agreement is capable of providing significant financing flexibility at reasonable rates of interest and is an attractive alternative source of funding in the event that commercial paper markets experience disruption. However, an increase in usage of the Revolving Credit Agreement related to growth or a significant deterioration in the results of our operations or cash flows could cause our borrowing costs to increase and/or our ability to borrow could be restricted. We have not entered into any guarantees that could give rise to material unexpected cash requirements. The full $1.0 billion of borrowing capacity under the Revolving Credit Agreement was available to the Company at September 30, 2025.\n◦\nIn addition to our commercial paper program and existing revolving credit facility, we also have the ability to obtain additional financing through the issuance of long-term debt. Considering our current credit rating, historical earnings performance, and financial position, we believe that we would be able to obtain additional long-term debt financing on attractive terms. \n \nCritical Accounting Estimates\n \nA summary of our critical accounting estimates is included in Management’s Discussion and Analysis of Financial Condition and Results of Operations contained in our Annual Report on Form 10-K for the year ended December 31, 2024. We are required to make estimates and judgments in the preparation of our financial statements that affect the reported amounts of assets and liabilities, revenues and expenses and related disclosures. We continually review these estimates and their underlying assumptions to ensure they are appropriate for the circumstances. Changes in the estimates and assumptions we use could have a material impact on our financial results. \nIn the second quarter of 2025, the Company elected to change its method of accounting for certain inventory in the U.S. from LIFO to FIFO. The change to FIFO is preferable because it provides a better matching of costs and revenues, conforms the Company's inventory to a single method of accounting and improves comparability with the Company's peers. The Company retrospectively applied this change in accounting principle to all prior periods. Refer to Note 1 Basis of Presentation for further information. During the nine months ended September 30, 2025, there were no material changes in any other of our estimates and critical accounting policies.\n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    50\nBack to Content\nForward-Looking Statements\n \nSome of the information included in this Management’s Discussion and Analysis of Financial Condition and Results of Operations, and elsewhere in this Form 10-Q, contain “forward-looking statements” as defined by the Private Securities Litigation Reform Act of 1995. These statements generally relate to our expectations and beliefs regarding our financial results, condition and outlook, projections of future performance, anticipated growth and end markets, changes in operating results, market conditions and economic conditions, expected capital resources, liquidity, financial performance, pension funding, results of operations, plans, strategies, opportunities, developments and productivity initiatives, competitive positioning, and trends in particular markets or industries. In addition, all statements regarding the expected financial impact of the integration of acquisitions, adoption of updated accounting standards and any expected effects of such adoption, and intent to continue repurchasing shares of common stock, as well as other statements that are not strictly historic in nature, are forward-looking. Forward-looking statements may be identified by the use of words, such as “believe”, “expect”, “anticipate”, “intend”, “depend”, “should”, “plan”, “estimated”, “predict”, “could”, “may”, “subject to”, “continues”, “growing”, “prospective”, “forecast”, “projected”, “purport”, “might”, “if”, “contemplate”, “potential”, “pending,” “target”, “goals”, “scheduled”, “will”, “will likely be”, and similar words and phrases. Such forward-looking statements are based on our current expectations and involve numerous assumptions, known and unknown risks, uncertainties and other factors, which may cause actual and future performance or the Company's achievements to be materially different from any future results, performance, or achievements expressed or implied by such forward-looking statements. Such factors include, but are not limited to:\n \n•\nImpact of trade tariffs, import quotas or other trade actions, restrictions or measures taken by the United States, China, Mexico, the United Kingdom, member states of the European Union, and other countries, including the recent and ongoing potential changes in U.S. trade policies, that may be made by the current or a future presidential administration and changes in trade policies in other countries made in response to changes in the U.S. trade policies.  \n•\nThe general impact of inflation on our business, including the impact on raw materials costs, elevated interest rates and increased energy costs and our ability to implement and maintain pricing actions that we have taken to cover higher costs and protect our margin profile.\n•\nEconomic and business conditions in particular industries, markets or geographic regions, as well the potential macro-economic effects of the U.S. government federal deficit, and for continued inflation, a significant economic slowdown, stagflation or recession. \n•\nEffects of unfavorable foreign currency exchange rates and the potential use of hedging instruments to hedge the exposure to fluctuating rates of foreign currency exchange on inventory purchases.\n•\nSupply chain disruptions and availability, costs and quantity of raw materials, purchased components, energy and freight.\n•\nChanges in demand for our products, market conditions, product quality, or product availability adversely affecting sales levels.\n•\nAbility to effectively develop and introduce new products.\n•\nChanges in markets or competition adversely affecting realization of price increases.\n•\nContinued softness in the grid automation market of Utility Solutions and residential market of Electrical Solutions.\n•\nFailure to achieve projected levels of efficiencies, and maintain cost savings and cost reduction measures, including those expected as a result of our lean initiatives and strategic sourcing plans.\n•\nFailure to comply with import and export laws.\n•\nChanges relating to impairment of our goodwill and other intangible assets.\n•\nInability to access capital markets or failure to maintain our credit ratings.\n•\nChanges in expected or future levels of operating cash flow, indebtedness and capital spending.\n•\nRegulatory issues, changes in tax laws, and policies, including changes in current U.S. income tax rates, multijurisdictional implementation of the Organisation for Economic Co-operation and Development's comprehensive base erosion and profit shifting plan, or changes in geographic profit mix affecting tax rates and availability of tax incentives.\n•\nA major disruption in one or more of our manufacturing or distribution facilities or headquarters, including the impact of plant consolidations and relocations.\n•\nChanges in our relationships with, or the financial condition or performance of, key distributors and other customers, agents or business partners which could adversely affect our results of operations.\n•\nImpact of productivity improvements on lead times, quality and delivery of product.\n•\nAnticipated future contributions and assumptions including increases in interest rates and changes in plan assets with respect to pensions and other retirement benefits, as well as pension withdrawal liabilities.\n•\nAdjustments to product warranty accruals in response to claims incurred, historical experiences and known costs.\n•\nUnexpected costs or charges, certain of which might be outside of our control.\n•\nChanges in strategy due to economic conditions or other conditions outside of our control affecting anticipated future global product sourcing levels.\n•\nAbility to carry out future acquisitions and strategic investments in our core businesses as well as the acquisition-related costs.\n     HUBBELL INCORPORATED\n-\nForm 10-Q\n    51\nBack to Content\n•\nAbility to successfully manage and integrate acquired businesses, such as the acquisitions of Northern Star Holdings, Inc., Ventev, Nicor and DMC Power, as well as the failure to realize expected synergies and benefits anticipated when we make an acquisition due to potential adverse reactions or changes to business or employee relationships resulting from completion of the transaction, competitive responses to the transaction, the possibility that the anticipated benefits of the transaction are not realized when expected or at all, including as a result of the impact of, or problems arising from, the integration of the acquired business, diversion of management's attention from ongoing business operations and opportunities, and litigation relating to the transaction.\n•\nThe impact of certain divestitures, including the benefits and costs of the sale of the residential lighting business. \n•\nThe ability to effectively implement Enterprise Resource Planning systems without disrupting operational and financial processes.\n•\nThe ability of government customers to meet their financial obligations.\n•\nPolitical unrest and military actions in foreign countries, including trade tensions with China and the wars in Ukraine and the Middle East, as well as the impact on world markets and energy supplies and prices resulting therefrom. \n•\nThe impact of potential natural disasters or additional public health emergencies on our financial condition and results of operations.\n•\nFailure of information technology systems, cybersecurity breaches, cyber threats, malware, phishing attacks, break-ins and similar events resulting in unauthorized disclosure of confidential information or disruptions or damage to information technology systems that could cause interruptions to our operations or adversely affect our internal control over financial reporting.\n•\nIncurring significant and/or unexpected costs to avoid, manage, defend and litigate intellectual property matters.\n•\nFuture repurchases of common stock under our common stock repurchase program.\n•\nChanges in accounting principles, interpretations, or estimates.\n•\nFailure to comply with any laws and regulations, including those related to data privacy and information security, environmental and conflict-free minerals.\n•\nThe outcome of environmental, legal and tax contingencies or costs compared to amounts provided for such contingencies, including contingencies or costs with respect to pension withdrawal liabilities.  \n•\nImproper conduct by any of our employees, agents or business partners that damages our reputation or subjects us to civil or criminal liability.\n•\nOur ability to hire, retain and develop qualified personnel.\n•\nAdverse changes in foreign currency exchange rates and the potential use of hedging instruments to hedge the exposure to fluctuating rates of foreign currency exchange on inventory purchases.\n•\nOther factors described in our Securities and Exchange Commission filings, including in the “Business”, “Risk Factors”, “Management's Discussion and Analysis of Financial Condition and Results of Operations”, and “Quantitative and Qualitative Disclosures about Market Risk” sections in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 and in the Company's Quarterly Reports on Form 10-Q.\nAny such forward-looking statements are not guarantees of future performances and actual results, developments and business decisions may differ from those contemplated by such forward-looking statements. The Company disclaims any duty to update any forward-looking statement, all of which are expressly qualified by the foregoing, other than as required by law."
}