{
  "source_file": "hubb-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1    \nBusiness\n \nHubbell Incorporated (herein referred to as “Hubbell”, the “Company”, the “registrant”, “we”, “our” or “us”, which references shall include its divisions and subsidiaries as the context may require) was founded as a proprietorship in 1888, and was incorporated in Connecticut in 1905. Recognized for our innovation, quality, and deep commitment to serving our customers for over 135 years, Hubbell is a world-class manufacturer of electrical and utility solutions, with more than 75 brands used around the world. We provide utility and electrical solutions that enable our customers to operate critical infrastructure reliably and efficiently, and we empower and energize communities through innovative solutions supporting energy infrastructure In Front of the Meter, on The Edge, and Behind the Meter. In Front of the Meter is where utilities transmit and distribute energy to their customers. The Edge connects utilities with owners and operators and allows energy and data to be distributed back and forth. Behind the Meter is where owners and operators of building and other critical infrastructure consume energy. \nOur products are either sourced complete, manufactured or assembled by subsidiaries in the United States, Canada, Puerto Rico, Mexico, the People’s Republic of China (“China”), the United Kingdom (“UK”), Brazil, Australia, Spain, Ireland, and the Republic of the Philippines. Hubbell also participates in joint ventures in Hong Kong and the Republic of the Philippines, and maintains offices in Singapore, Italy, China, India, Mexico, South Korea, Chile, and countries in the Middle East.\nThe Company’s reporting segments consist of the Utility Solutions segment and the Electrical Solutions segment. \nThe Company’s annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all amendments to those reports are made available free of charge through the Investor Relations section of the Company’s website at \nhttp://www.hubbell.com\n as soon as practicable after such material is electronically filed with, or furnished to, the SEC. The information contained on the Company’s website or connected to our website is not incorporated by reference into this Annual Report on Form 10-K and should not be considered part of this report.\nHUBBELL INCORPORATED\n \n- Form 10-K\n3\nUtility Solutions Segment\nHubbell Utility Solutions has leading positions In Front of the Meter and on The Edge. The Utility Solutions segment (64% of consolidated revenues in 2024, 61% in 2023 and 58% in 2022) consists of businesses that design, manufacture, and sell a wide variety of electrical distribution, transmission, substation, and telecommunications products, which support applications In Front of the Meter. This includes utility transmission & distribution (T&D) components such as arresters, insulators, connectors, anchors, bushings, enclosures, cutouts and switches. The Utility Solutions segment also offers solutions that serve The Edge of the utility infrastructure, including smart meters, communications systems, and protection and control devices. Hubbell Utility Solutions supports the electrical distribution, electrical transmission, water, gas distribution, telecommunications, and solar and wind markets. While Hubbell believes its sales in this area are not materially dependent upon any customer or group of customers, a substantial variability in purchases by electrical utilities would affect this segment.\nProducts of the Utility Solutions segment are sold under various brands and/or trademarks into the electrical distribution, substation and transmission markets as well as, markets for grid protection and controls, utility meters and advanced metering infrastructure and telcom and gas distribution markets. The products are sold into these markets primarily through distributors, or directly to utilities. Brands and/or trademarks of products of the Utility Solutions segment include:\n•\nAclara®\n•\nChance®\n•\nAnderson®\n•\nPenCell®\n•\nFargo®\n•\nHubbell®\n•\nPolycast®\n•\nOpti-loop Design®\n•\nQuazite®\n•\nQuadri*sil®\n•\nTrinetics®\n•\nReuel®\n•\nElectro Composites®\n•\nUSCO™\n•\nCDR™\n•\nRFL Design®\n•\nHot Box®\n•\nPCORE®\n•\nDelmar™\n•\nTurner Electric®\n•\nEMC™\n•\nLongbow™\n•\nOhio Brass®\n•\nMeramec®\n•\nReliaguard®\n•\nGreenjacket®\n•\nArmorcast®\n•\nBeckwith Electric™\n•\nContinental®\n•\nR.W. Lyall™\n•\nGas Breaker®\n•\nAEC™\n•\nRipley®\n•\nElectro Industries / Gauge Tech™\n•\nBalestro™\n•\nSystems Control™\n4\nHUBBELL INCORPORATED\n - \nForm 10-K\nElectrical Solutions Segment\nHubbell Electrical Solutions is positioned Behind the Meter, providing key components to building operators and industrial customers that enable them to manage their energy and operate critical infrastructure more efficiently and effectively. The Electrical Solutions segment (36% of consolidated revenues in 2024, 39% in 2023 and 42% in 2022) comprises businesses that sell stock and custom products including standard and special application wiring device products, rough-in electrical products, and connector and grounding products, as well as other electrical equipment. \nProducts of the Electrical Solutions segment have applications in the light industrial, non-residential, wireless communications, transportation, data center, and heavy industrial markets. Electrical Solutions segment products are typically used in and around industrial, commercial and institutional facilities by electrical contractors, maintenance personnel, electricians, utilities, and telecommunications companies. In addition, certain of our businesses design and manufacture industrial controls and communication systems used in the non-residential and industrial markets. Many of these products are designed such that they can also be used in harsh and hazardous locations where a potential for fire and explosion exists due to the presence of flammable gasses and vapors. Harsh and hazardous products are primarily used in the oil and gas (onshore and offshore) and mining industries. We also offer a variety of wiring devices and electrical products that have residential and utility applications. \nIn December 2023, the Company entered into a definitive agreement to sell its residential lighting business for a cash purchase price of $131 million, subject to customary adjustments. The residential lighting business sells indoor and outdoor lighting solutions. The business generated $187.1 million in sales in 2023. The assets and liabilities of this business are recorded in assets and liabilities held for sale in the Consolidated Balance Sheet as of December 31, 2023. \nThe transaction closed in the first quarter of 2024 and the Company recorded a pre-tax loss on the sale of $5.3 million, which is recorded within Total other expense in the Company\n’\ns Consolidated Statement of Income. \n \nProducts of the Electrical Solutions segment are sold under various brands and/or trademarks and are primarily sold through electrical and industrial distributors, home centers, retail and hardware outlets, and residential product oriented internet sites. Special application products are primarily sold through wholesale distributors to contractors, industrial customers and original equipment manufacturers (“OEMs”). Brands and/or trademarks of products of the Electrical Solutions segment include:\n•\nHubbell®\n•\nBell®\n•\nRaco®\n•\nGleason Reel®\n•\nACME Electric®\n•\nKellems®\n•\nTayMac®\n•\nHipotronics®\n•\nPowerohm®\n•\nEC&M Design®\n•\nBryant®\n•\nWiegmann®\n•\nAccelTex Solutions™\n•\niDevices®\n•\nAustdac™\n•\nBurndy®\n•\nKillark®\n•\nGAI-Tronics®\n•\nConnector Products™\n•\nChalmit™\n•\nCMC®\n•\nHawke™\n•\nPCX™\nHUBBELL INCORPORATED\n \n- Form 10-K\n5\nInformation Applicable to Our Business\nInternational Operations\n \nThe Company has several operations located outside of the United States. These operations manufacture, assemble and/or procure and market Hubbell products and services for both the Utility Solutions and Electrical Solutions segments.\n \nSee Note 21 — Industry Segments and Geographic Area Information in the Notes to Consolidated Financial Statements and Item 1A. Risk Factors relating to manufacturing in and sourcing from foreign countries.\nCustomers\nWe have an extensive customer base of distributors, wholesalers, electric utilities, OEMs, electrical contractors, telecommunications companies and retail and hardware outlets. We are not dependent on a single customer, however, our top ten customers account for approximately 41% of our Net sales. \nRaw Materials\nRaw materials used in the manufacture of Hubbell products primarily include steel, aluminum, brass, copper, bronze, zinc, nickel, plastics, elastomers and petrochemicals. Hubbell also purchases certain electrical and electronic components, including solenoids, printed circuit boards, integrated circuit chips and cord sets, from a number of suppliers. Hubbell is not materially dependent upon any one supplier for raw materials used in the manufacture of its products and equipment however the cost and supply of these materials may be affected by disruptions in availability of raw materials, components or sourced finished goods. See also Item 7A. Quantitative and Qualitative Disclosures about Market Risk. \nPatents\n \nHubbell has approximately 3,100 active United States and foreign patents covering a portion of its products, which expire at various times. While Hubbell deems these patents to be of value, it does not consider its business to be dependent upon patent protection. Hubbell also licenses products under patents owned by others, as necessary, and grants licenses under certain of its patents. \nWorking Capital\n \nInventory, accounts receivable and accounts payable levels, payment terms and, where applicable, return policies are in accordance with the general practices of the electrical products industry and standard business procedures. Certain businesses require a portion of the transaction price to be paid in advance of transfer of control. These payments are treated as a contract liability and are classified in Other accrued liabilities in the Consolidated Balance Sheets. Contract assets primarily relate to performance obligations satisfied prior to payment that are recorded in Other current assets in the Consolidated Balance Sheets. See also Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. \n6\nHUBBELL INCORPORATED\n - \nForm 10-K\nBacklog\n \nSubstantially all of the backlog existing at December 31, 2024 in the Electrical Solutions segment is expected to be shipped to customers in 2025. In the Utility Solutions segment, substantially all of the backlog existing at December 31, 2024 is expected to be shipped during 2025, along with approximately \n$70 million\n of backlog of contracts that span multiple years, primarily related to long-term contracts within the Utility Solutions segment to deliver and install meters and grid monitoring sensor technology. The backlog of orders believed to be firm at December 31, 2024 was \n$1,898 million\n compared to \n$2,328 million\n at December 31, 2023. Although this backlog is important, the majority of Hubbell’s revenues result from sales of inventoried products or products that have short periods of manufacture. \nCompetition\n \nHubbell experiences substantial competition in all categories of its business, but does not compete with the same companies in all of its product categories. The number and size of competitors vary considerably depending on the product line. Hubbell cannot specify with precision the number of competitors in each product category or their relative market position. However, some of its competitors are larger companies with substantial financial and other resources. Hubbell considers product performance, reliability, quality and technological innovation to be important factors relevant to all areas of its business and considers its reputation as a manufacturer of quality products to be an important factor in its business. In addition, product price, service levels and other factors can affect Hubbell’s ability to compete.                                                                        \nHUBBELL INCORPORATED\n \n- Form 10-K\n7\nEnvironment\n \nThe Company is subject to various federal, state and local government requirements relating to the protection of employee health and safety and the environment. The Company believes that, as a general matter, its policies, practices and procedures are properly designed to prevent unreasonable risk of environmental damage and personal injury to its employees and its customers’ employees and that the handling, manufacture, use and disposal of hazardous or toxic substances are in accordance with environmental laws and regulations.\n \nLike other companies engaged in similar businesses, the Company has incurred or acquired through business combinations, remedial response and voluntary cleanup costs for site contamination, and is a party to product liability and other lawsuits and claims associated with environmental matters, including past production of products containing toxic substances. Additional lawsuits, claims and costs involving environmental matters are likely to continue to arise in the future. However, considering past experience and reserves, the Company does not anticipate that these matters will have a material adverse effect on earnings, capital expenditures, financial condition or competitive position. See also Item 1A. Risk Factors and Note 16 — Commitments and Contingencies in the Notes to Consolidated Financial Statements. \nHuman Capital\nOur commitment to developing our employees is one of four pillars that guide Hubbell as a company. We recruit, hire, and develop talent that meets and anticipates the ever-changing needs of our enterprise and our stakeholders. Hubbell provides market-competitive compensation, health and well-being programs, and retirement benefits based on the countries and markets in which we operate to motivate market-leading performance. \nAs of December 31, 2024, Hubbell had approximately 17,700 salaried and hourly employees of whom approximately 10,600, or 60% are located in the United States. Approximately 2,470 of these U.S. employees are represented by 8 labor unions. Hubbell considers its labor relations to be satisfactory and regularly engages with its labor unions.\nHubbell is committed to fostering an environment that respects and encourages individual differences, diversity of thought, and talent. We strive to create a workplace where employees feel that their contributions are welcomed and valued, allowing them to fully engage their talents and training in their work, while generating personal satisfaction in their role within Hubbell. \nAcross the enterprise, there are a variety of ways we invest in our people to learn - on the job, in the classroom, through self-directed learning, or through leadership programs. We have expanded our learning management system (known as Hubbell University) to make new content and training available to our employees. The Company has also expanded leadership development programs to provide career development to employees at all levels and continues to expand its Campus Programs to foster a pipeline of early career talent at Hubbell.\nThe Company also encourages its employees to give back to their communities. The Company supports employees’ spirit of volunteerism in their communities throughout the year with its Volunteer Paid Time Off policy, which provides all employees with up to 8 hours of paid time off a year to volunteer with an eligible 501(c)(3) charity of their choice. \nAs a manufacturing company, we focus on protecting the health and safety of our employees and educate employees on how to Think Safe, Work Safe and Go Home Safe. We dedicate resources to track and monitor safety and recordable incidents using an enterprise-wide data management system. Through the Company’s myLife program, the Company also provides comprehensive, competitive benefits that retain and support our employees’ health, wealth and peace of mind.  \nThe Elevate Employee Experience Survey (Elevate) is conducted annually across Hubbell. It is our employees’ opportunity to share perspectives on topics important to them. In 2024, the third year of the survey, Hubbell saw continued strong engagement with over 88% of Hubbell’s employees participating worldwide. The feedback provided through Elevate is then used to create action plans at all of Hubbell’s locations. In 2024, employees shared that they wanted to better understand Hubbell’s long term strategies and how their roles contribute. Hubbell launched “Align 2027” for all employees in mid-2024. This was an interactive learning experience where cross-functional teams locally or virtually worked through an exercise that brought to life Hubbell’s refreshed brand, Vision, Mission, Core Values, key markets, products, history and strategic objectives. Employees were afforded time to connect and better understand how each of their roles fit together to better help Hubbell achieve a common purpose. This experience was a demonstration of how Hubbell implements employee feedback from the Elevate survey into action. \n8\nHUBBELL INCORPORATED\n - \nForm 10-K\nInformation about our Executive Officers \nName \n(1)\nAge\nPresent Position\nBusiness Experience\nGerben W. Bakker\n60\nChairman of the Board, President and Chief Executive Officer\nPresent position since May 2021; previously President and Chief Executive Officer since October 2020; President and Chief Operating Officer June 2019 to October 2020; Group President, Power Systems February 2014 to June 2019; various other positions at Hubbell 1988 to 2014. \nWilliam R. Sperry\n62\nExecutive Vice President,\nChief Financial Officer\nPresent position since May 2020; previously, Executive Vice President, Chief Financial Officer and Treasurer June 2019 to May 2020; Senior Vice President and Chief Financial Officer 2012 to 2019; Vice President, Corporate Strategy and Development August 2008 to June 2012; also a member of the board of directors of MSA Safety Incorporated since February 2019.\nJonathan M.        Del Nero\n53\nVice President, Controller\nPresent position since January 2021; previously, Assistant Controller 2014 to January 2021.\nAlyssa R. Flynn \n53\nChief Human Resources Officer \nPresent position since February 2022; previously Vice President, Compensation, Benefits & HR Systems from 2014 to February 2022; Chief of Staff to the Chief Executive Officer from June 2021 to February 2022. \nGregory A. Gumbs\n55\nPresident, Utility Solutions Segment\nPresent position since July 2023; previously President and CEO, Bosch Rexroth, September 2020 to June 2023; Vice President & General Manager Electrical Energy Automation Solutions Business, Eaton Corporation 2015 to May 2020.\nKatherine A. Lane\n47\nSenior Vice President, General\nCounsel and Secretary\nPresent position since May 2021; previously Vice President, General Counsel and Secretary June 2019 to May 2021; Vice President, Acting General Counsel and Secretary March 2019 to June 2019; Vice President, Associate General Counsel 2017 to March 2019; various other positions at Hubbell 2010 to 2017. \nMark E. Mikes\n60\nPresident, Electrical Solutions Segment\nPresent position since July 2023; previously Division President, Hubbell Power Systems and Enterprise Operational Excellence from July 2022 to  June, 2023; Division President, Hubbell Power Systems, November, 2019 to July, 2022; various other position at Hubbell, 1989 - November, 2019.\n(1)\nAs of February 13, 2025, there are no family relationships among any of the above executive officers and any of our directors. For information related to our Board of Directors, refer to Item 10. Directors, Executive Officers and Corporate Governance. \nHUBBELL INCORPORATED\n \n- Form 10-K\n9",
  "item7": "ITEM 7    \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the consolidated financial statements and accompanying notes included in Part II, Item 8 of this Annual Report on Form 10-K. This section of this Form 10-K generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 are not included in this Form 10-K and can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form-10-K for the fiscal year ended December 31, 2023, filed with the Securities and Exchange Commission on February 8, 2024. \nExecutive Overview of the Business\n \nHubbell is a global manufacturer of quality electrical products and utility solutions for a broad range of customer and end market applications. We provide utility and electrical solutions that enable our customers to operate critical infrastructure reliably and efficiently, and we empower and energize communities through innovative solutions supporting energy infrastructure In Front of the Meter, on The Edge, and Behind the Meter. In Front of the Meter is where utilities transmit and distribute energy to their customers. The Edge connects utilities with owner/operators and allows energy and data to be distributed back and forth. Behind the Meter is where owners and operators of buildings, and other critical infrastructure consume energy. Products are either sourced complete, manufactured or assembled by subsidiaries in the United States, Canada, Puerto Rico, Mexico, China, the UK, Brazil, Australia, Spain, Ireland, and the Republic of the Philippines. The Company also participates in joint ventures in Hong Kong and the Republic of the Philippines, and maintains offices in Singapore, Italy, China, India, Mexico, South Korea, Chile, and countries in the Middle East. The Company employed approximately 17,700 individuals worldwide as of December 31, 2024.\nThe Company’s reporting segments consist of the Utility Solutions segment and Electrical Solutions segment. The Company’s long-term strategy is to: serve its customers with reliable and innovative electrical and related infrastructure solutions with desired brands and high-quality service, delivered through a competitive cost structure; to complement organic revenue growth with acquisitions that enhance its product offerings; and to allocate capital effectively to create shareholder value.\nOur strategy to complement organic revenue growth with acquisitions is focused on acquiring assets that extend our capabilities, expand our product offerings, and present opportunities to compete in core, adjacent or complementary markets. Our acquisition strategy also provides the opportunity to advance our revenue growth objectives during periods of weakness or inconsistency in our end-markets. \nOur strategy to deliver products through a competitive cost structure has resulted in past and ongoing restructuring and related activities. Our restructuring and related efforts include the consolidation of manufacturing and distribution facilities, and workforce actions, as well as streamlining and consolidating our back-office functions. The primary objectives of our restructuring and related activities are to optimize our manufacturing footprint, cost structure and effectiveness and the efficiency of our workforce.\nProductivity improvement also continues to be a key area of focus for the Company and efforts to drive productivity complement our restructuring and related activities to minimize the impact of rising material costs and other administrative cost inflation. Because material costs are approximately half of our cost of goods sold, volatility in this area can significantly impact profitability. Our goal is to have pricing and productivity programs that offset material and other inflationary cost increases as well as pay for investments in key growth areas.\nProductivity programs affect virtually all functional areas within the Company by reducing or eliminating waste and improving processes. We continue to expand our efforts related to global product and component sourcing and supplier cost reduction programs. Value engineering efforts, product transfers and the use of lean process improvement techniques are expected to continue to increase manufacturing efficiency. In addition, we continue to build upon the benefits of our enterprise resource planning system across all functions.\n22\nHUBBELL INCORPORATED\n - \nForm 10-K\nOur sales are also subject to market conditions that may cause customer demand for our products to be volatile. Product demand can be affected by fluctuations in domestic and international economic conditions, as well as currency fluctuations, commodity costs, and a variety of other factors. Since early 2021, we have experienced significant inflationary pressure across much of our business. As a result, we have taken various pricing actions to cover the higher costs and to protect our profitability. Although inflation has moderated considerably since its high point in 2022, we expect inflation to remain a factor for the foreseeable future and we expect to continue to take these pricing actions subject to demand and market conditions. Accordingly, there can be no assurance that we will be able to maintain our margins in response to further changes in inflationary pressures. In addition, macroeconomic effects such as increases in interest rates and other measures taken by central banks and other policy makers could have a negative effect on overall economic activity which could reduce our customers’ demand for our products, and cause the continuation of relatively high market interest rates that increase our borrowing costs. Additionally, international tensions, such as the conflicts in the Middle East and Ukraine, as well as trade and other tensions, including those with China, may affect demand for our products, as well as our production costs.\nDiscontinued Operations\nOn February 1, 2022, the Company completed the sale of the Commercial and Industrial Lighting business (the \n“\nC&I Lighting business\n”\n) to GE Current, a Daintree Company. The disposal of the C&I Lighting business met the criteria set forth in ASC 205-20 to be presented as a discontinued operation. The C&I Lighting businesses\n’\n results of operations and the related cash flows have been reclassified to income from discontinued operations in the Consolidated Statements of Income and cash flows from discontinued operations in the Consolidated Statement of Cash Flows, respectively, for all periods presented. For additional information regarding this transaction and its effect on our financial reporting, see Note 2 – Discontinued Operations, in the accompanying Consolidated Financial Statements, which note is incorporated herein by reference.\nHUBBELL INCORPORATED\n \n- Form 10-K\n23\nResults of Operations\nOur operations are classified into two reportable segments: Utility Solutions and Electrical Solutions. For a complete description of the Company’s segments, see Part I, Item 1 of this Annual Report on Form 10-K. Within these segments, Hubbell serves customers in several primary end markets: utility distribution, utility transmission and utility substation as well as industrial and non-residential. Unless specified otherwise, all comparisons of 2024 results are with 2023 results.\nIn 2024, Net sales increased by 4.7% or \n$256 million\n and organic Net sales\n(1) \nincreased by \n$2 million\n on favorable price realization partially offset by lower volumes, as further discussed in segment results below. Operating margin increased in 2024, by 10 basis points and adjusted operating margin\n(1)\n increased by 90 basis points, driven by favorable price realization, productivity and cost management. Those increases were partially offset by material and other cost inflation and lower unit volume. Net income from continuing operations attributable to Hubbell increased by 2.4% in 2024 compared to the prior year and diluted earnings per share from continuing operations increased by 2.3%. \nAdjusted net income from continuing operations attributable to Hubbell\n(1)\n increased by 8.1% in 2024 compared to the prior year and adjusted diluted earnings per share from continuing operations\n(1)\n increased by 8.1% in 2024.\nOperating cash flow was higher in \n2024\n at $991.2 million as compared to $880.8 million in the prior year. Free cash flow\n(2)\n was higher in 2024 at $810.8 million as compared to $715.1 million in the prior year. In \n2024\n we paid $267.3 million in shareholder dividends, an increase of 8.9% as compared to the prior year. We also invested $180.4 million of capital expenditures in footprint optimization, automation and productivity initiatives, and repurchased $40.0 million of shares in \n2024\n.\n(1) Organic Net sales, adjusted operating margin, adjusted net income from continuing operations attributable to Hubbell and adjusted diluted earnings per share from continuing operations are non-GAAP financial measures. See “Adjusted Operating Measures” below for a reconciliation to the comparable GAAP financial measures. \n(2) Free cash flow is a non-GAAP financial measure. See “Adjusted Operating Measures” and “Financial Condition, Liquidity and Capital Resources - Cash Flow” below for a reconciliation to the comparable GAAP financial measure. \nSUMMARY OF CONSOLIDATED RESULTS (IN MILLIONS, EXCEPT PER SHARE DATA)\n \n \nFor the Year Ending December 31,\n \n2024\n% of Net sales\n2023\n% of Net sales\nNet sales\n$\n5,628.5 \n \n$\n5,372.9 \n \nCost of goods sold\n3,724.4 \n66.2 \n%\n3,484.8 \n64.9 \n%\nGross profit\n1,904.1 \n33.8 \n%\n1,888.1 \n35.1 \n%\nSelling & administrative expenses\n812.5 \n14.4 \n%\n849.6 \n15.8 \n%\nOperating income\n1,091.6 \n19.4 \n%\n1,038.5 \n19.3 \n%\nNet income from continuing operations\n783.5 \n13.9 \n%\n766.0 \n14.2 \n%\nLess: Net income from continuing operations attributable to noncontrolling interest\n(5.7)\n(0.1)\n%\n(6.2)\n(0.1)\n%\nNet Income From Continuing Operations Attributable to Hubbell Incorporated\n777.8 \n13.8 \n%\n759.8 \n14.1 \n%\nIncome from discontinued operations, net of tax \n— \n— \n%\n— \n— \n%\nNet income attributable to Hubbell Incorporated\n777.8 \n13.8 \n%\n759.8 \n14.1 \n%\nLess: Earnings allocated to participating securities\n(1.5)\n(1.8)\nNet income available to common shareholders\n$\n776.3 \n$\n758.0 \nAverage number of diluted shares outstanding\n54.0 \n54.0 \nDILUTED EARNINGS PER SHARE - CONTINUING OPERATIONS\n$\n14.37\n \n \n$\n14.05\n \n \nDILUTED EARNINGS PER SHARE - DISCONTINUED OPERATIONS\n$\n—\n \n$\n—\n \n24\nHUBBELL INCORPORATED\n - \nForm 10-K\nAdjusted Operating Measures  \nIn the following discussion of results of operations, we refer to \n“\nadjusted\n”\n operating measures. We believe those adjusted measures, which exclude the impact of certain costs, gains and losses, may provide investors with useful information regarding our underlying performance from period to period and allow investors to understand our results of operations without regard to items that, in management\n’\ns judgment, significantly affect the comparability of operating results, or we do not consider a component of our core operating performance. \nSignificant items impacting comparability:\nTransaction, integration and separation costs\nThe effect that acquisitions and divestitures may have on our results can fluctuate significantly based on the timing, size and number of transactions, and therefore result in significant volatility in the costs to complete transactions and to integrate or separate the businesses. \nThe size of acquisition and divestiture actions taken by the Company in the fourth quarter of 2023 has resulted in a significant increase in these costs. As a result, we believe excluding costs relating to these fourth quarter transactions provides useful and more comparable information to investors to better assess our operating performance. \nTransaction costs are primarily professional services and other fees incurred to complete the transactions. Integration and separation costs are the internal and external incremental costs directly relating to these activities for the acquired or divested business.\nGains or losses on disposition of a business\nOur adjusted operating measures exclude these gains or losses because we believe excluding them enhances management’s and investors’ ability to analyze underlying business performance and facilitates comparisons of our financial results over multiple periods. In the first quarter of 2024 the Company recognized a $5.3 million pre-tax loss on the disposition of the residential lighting business and also recognized $6.8 million of income tax expense on the sale of the residential lighting business, primarily driven by differences between book and tax basis in goodwill. That loss and the related income tax expense are excluded from our adjusted operating measures.\nAmortization of intangible assets\nAdjusted operating measures also exclude non-cash amortization of all intangible assets associated with our business acquisitions, including inventory step-up amortization associated with those acquisitions. The intangible assets associated with our business acquisitions arise from the allocation of the purchase price using the acquisition method of accounting in accordance with Accounting Standards Codification 805, “Business Combinations.” These assets consist primarily of customer relationships, developed technology, trademarks and tradenames, and patents, as reported in Note 7 – Goodwill and Other Intangible Assets, under the heading “Total Definite-Lived Intangibles\n”\n within the Notes to Consolidated Financial Statements.\nThe Company believes that the exclusion of these non-cash expenses (i) enhances management’s and investors’ ability to analyze underlying business performance, (ii) facilitates comparisons of our financial results over multiple periods, and (iii) provides more relevant comparisons of our results with the results of other companies as the amortization expense associated with these assets may fluctuate significantly from period to period based on the timing, size, nature, and number of acquisitions. Although we exclude amortization of these acquired intangible assets and inventory step-up from our non-GAAP results, we believe that it is important for investors to understand that revenue generated, in part, from such intangibles is included within revenue in determining adjusted net income attributable to Hubbell Incorporated. \nAdjusted results also exclude the income tax effects of the above adjustments which are calculated using the statutory tax rate, taking into consideration the nature of the item and the relevant taxing jurisdiction, unless otherwise noted.\nThe Company excludes these non-core items because we believe it enhances management\n’\ns and investors\n’\n ability to analyze underlying business performance and facilitates comparisons of our financial results over multiple periods. Refer to the reconciliation of non-GAAP measures presented below, Note 4 – Business Acquisitions and Dispositions, for additional information. \nHUBBELL INCORPORATED\n \n- Form 10-K\n25\nOrganic Net sales (or organic net sales growth), a non-GAAP measure, represents Net sales according to U.S. GAAP, less Net sales from acquisitions and divestitures during the first twelve months of ownership or divestiture, respectively, less the effect of fluctuations in Net sales from foreign currency exchange. The period-over-period effect of fluctuations in Net sales from foreign currency exchange is calculated as the difference between local currency Net sales of the prior period translated at the current period exchange rate as compared to the same local currency Net sales translated at the prior period exchange rate. We believe this measure provides management and investors with a more complete understanding of the underlying operating results and trends of established, ongoing operations by excluding the effect of acquisitions, dispositions and foreign currency as these activities can obscure underlying trends. When comparing Net sales growth between periods excluding the effects of acquisitions, business dispositions and currency exchange rates, those effects are different when comparing results for different periods. For example, because Net sales from acquisitions are considered inorganic from the date we complete an acquisition through the end of the first year following the acquisition, Net sales from such acquisitions are reflected as organic Net sales thereafter.\nThere are limitations to the use of non-GAAP measures. Non-GAAP measures do not present complete financial results. We compensate for this limitation by providing a reconciliation between our non-GAAP financial measures and the respective most directly comparable financial measure calculated and presented in accordance with GAAP. Because non-GAAP financial measures are not standardized, it may not be possible to compare these financial measures with other companies’ non-GAAP financial measures having the same or similar names. These financial measures should not be considered in isolation from, as substitutes for, or alternative measures of, reported GAAP financial results, and should be viewed in conjunction with the most comparable GAAP financial measures and the provided reconciliations thereto. We believe, however, that these non-GAAP financial measures, when viewed together with our GAAP results and related reconciliations, provide a more complete understanding of our business. We strongly encourage investors to review our consolidated financial statements and publicly filed reports in their entirety and not rely on any single financial measure.\nThe following table reconciles Adjusted operating income, a non-GAAP measure, to Operating income, the directly comparable GAAP financial measure (in millions):\n \nFor the Year Ended December 31,\n \n2024\n% of Net sales\n2023\n% of Net sales\nOperating income (GAAP measure)\n$\n1,091.6\n19.4 \n%\n$\n1,038.5\n19.3 \n%\nAmortization of acquisition-related intangible assets\n127.3\n2.3 \n%\n76.8\n1.4 \n%\nTransaction, integration & separation costs\n13.8\n0.2 \n%\n13.5\n0.3 \n%\nAdjusted operating income (non-GAAP measure)\n$\n1,232.7\n21.9 \n%\n$\n1,128.8\n21.0 \n%\nThe following table reconciles Adjusted net income from continuing operations attributable to Hubbell Incorporated, Adjusted net income from continuing operations available to common shareholders, and the diluted per share amounts thereof, each a non-GAAP measure, to the directly comparable GAAP financial measures (in millions, except per share data).\n \nFor the Year Ended December 31,\n \n2024\nDiluted Per Share\n2023\nDiluted Per Share\nNet income from continuing operations attributable to Hubbell Incorporated (GAAP measure)\n$\n777.8 \n$\n14.37 \n$\n759.8 \n$\n14.05 \nAmortization of acquisition-related intangible assets\n127.3 \n2.37 \n76.8 \n1.42 \nTransaction, integration & separation costs\n13.8 \n0.26 \n13.5 \n0.25 \nLoss on disposition of business\n5.3 \n0.10 \n— \n— \n  Subtotal\n$\n924.2 \n$\n17.10 \n$\n850.1 \n$\n15.72 \nIncome tax effects\n(1)\n \n27.4 \n0.50 \n20.7 \n0.36 \nAdjusted net income from continuing operations attributable to Hubbell Incorporated (non-GAAP measure)\n$\n896.8 \n$\n16.60 \n$\n829.4 \n$\n15.36 \nLess: Earnings allocated to participating securities\n(1.7)\n(0.03)\n(1.9)\n(0.03)\nAdjusted net income from continuing operations available to common shareholders (non-GAAP measure)\n$\n895.1 \n$\n16.57 \n$\n827.5 \n$\n15.33 \nAverage number of diluted shares outstanding\n54.0 \n54.0 \nAdjusted diluted earnings per share from continuing operations\n$\n16.57 \n$\n15.33 \n(1) \nThe income tax effects are calculated using the statutory tax rate, taking into consideration the nature of the item and the relevant taxing jurisdiction, unless otherwise noted.\n26\nHUBBELL INCORPORATED\n - \nForm 10-K\nThe following table reconciles our Organic Net sales growth to the directly comparable GAAP financial measure (in millions and percentage change):\nFor the Year Ended December 31,\n2024\nInc/(Dec) %\n2023\nInc/(Dec) %\nNet sales growth (GAAP measure)\n$\n255.6 \n4.7 \n$\n425.0 \n8.6 \nImpact of acquisitions\n421.0 \n7.8 \n96.6 \n1.9 \nImpact of divestitures\n(163.0)\n(3.0)\n— \n— \nForeign currency exchange\n(4.4)\n(0.1)\n3.1 \n0.1 \nOrganic Net sales growth (non-GAAP measure)\n$\n2.0 \n— \n$\n325.3 \n6.6 \n2024 Compared to 2023 \nNet Sales\nNet sales of $5,628.5 million in 2024 increased by $255.6 million, or 4.7%, compared to 2023. Organic net sales were flat driven by a low single digit percentage increase in price realization, partially offset by a low single digit percentage decrease in unit volume. Acquisitions net of divestitures contributed 4.8% to net sales growth. These changes are discussed in more detail in the Segment Results section below. \nCost of Goods Sold and Gross Profit\nAs a percentage of net sales, cost of goods sold increased by 130 basis points to 66.2% and gross profit margin declined to 33.8% in 2024. The decline in gross profit margin includes approximately four percentage points of margin contraction due to higher intangible amortization expense, material and other cost inflation and lower volume, which was partially offset by approximately three percentage points of margin expansion driven by favorable price realization, productivity and cost management. \nSelling & Administrative Expenses\nS&A expense in 2024 was $812.5 million and decreased by $37.1 million compared to the prior year.  This decrease was driven by lower employee incentive costs and lower professional services in the current year, transaction costs in 2023 that did not repeat in 2024, partially offset by the addition of S&A expense including intangible amortization expense related to our 2023 acquisitions. S&A expense as a percentage of Net sales decreased by 140 basis points to 14.4% in 2024.\nTotal Other Expense\nTotal other expense increased by $31.1 million in 2024 to $86.3 million compared to the prior year, primarily due to a $37.1 million increase in net interest expense and a $5.3 million loss recognized on the disposition of the residential lighting business in 2024, partially offset by $7.2 million in 2024 of TSA income related to the disposal of the residential lighting business and lower non service pension cost. The increase in interest expense was primarily attributable to debt incurred in connection with the acquisition of Systems Control. \nIncome Taxes\nThe effective tax rate was 22.1% in both 2024 and 2023 as the income tax expense related to the sale of the residential lighting business in the first quarter of 2024, was largely offset by the tax benefit of an international restructuring completed in the third quarter of the year.\nNet Income Attributable to Hubbell Incorporated and Earnings Per Diluted Share\nNet income attributable to Hubbell Incorporated was $777.8 million in 2024 and increased 2.4% as compared to 2023\n. As a result, earnings per diluted share in 2024 increased 2.3% compared to 2023. Adjusted net income attributable to Hubbell Incorporated, which excluded amortization of acquisition-related intangibles and transaction, integration & separation costs in both periods, and a loss on disposition of a business in 2024 was $896.8 million in 2024 and increased 8.1% as compared to 2023.\nHUBBELL INCORPORATED\n \n- Form 10-K\n27\nSegment Results\n \nUtility Solutions\nThe following table reconciles our Utility Solutions segment adjusted operating income and adjusted operating margin to the directly comparable GAAP financial measure (in millions and percentage change):\nFor the Year Ended December 31,\n(in millions)\n2024\n2023\nNet sales\n$\n3,600.7 \n$\n3,261.7 \nOperating income (GAAP measure)\n$\n729.8 \n$\n706.6 \nAmortization of acquisition-related intangible assets\n111.2 \n58.3 \nTransaction, integration & separation costs\n6.5 \n13.2 \nAdjusted operating income\n$\n847.5 \n$\n778.1 \nOperating margin (GAAP measure)\n20.3 \n%\n21.7 \n%\nAdjusted operating margin\n23.5 \n%\n23.9 \n%\nThe following table reconciles our Utility Solutions segment Organic Net sales growth to the directly comparable GAAP financial measure (in millions and percentage change):\nFor the Year Ended December 31,\nUtility Solutions\n2024\nInc/(Dec) %\n2023\nInc/(Dec) %\nNet sales growth (GAAP measure)\n$\n339.0 \n10.4 \n$\n390.6 \n13.6 \nImpact of acquisitions\n421.0 \n12.9 \n52.7 \n1.8 \nImpact of divestitures\n— \n— \n— \n— \nForeign currency exchange\n(3.7)\n(0.1)\n1.6 \n0.1 \nOrganic Net sales (decline) growth (non-GAAP measure)\n$\n(78.3)\n(2.4)\n$\n336.3 \n11.7 \nNet sales in the Utility Solutions segment in 2024 were approximately $3.6 billion, an increase of 10.4% as compared to 2023. This increase was driven by a 12.9% increase in net sales from acquisitions, partially offset by a 2.4% decrease in organic net sales driven by a mid single digit percentage decrease in unit volumes partially offset by a low single digit increase in price realization. The decrease in unit volume resulted largely from volume declines in enclosures products primarily driven by weakness in the telcom market, as well as customer inventory management in distribution markets. These factors were partially offset by strong growth in transmission and substation markets and in grid automation projects.  \nOperating income in the Utility Solutions segment in 2024 was $729.8 million an increase of 3.3% compared to 2023. Operating margin declined by 140 basis points to 20.3% in 2024. Excluding amortization of acquisition-related intangibles and transaction, integration & separation costs, the adjusted operating margin declined by 40 basis points to 23.5% as compared to the prior year. The decrease in operating margin and adjusted operating margin includes approximately three percentage points of margin expansion from favorable price realization, improved productivity and cost management, but that expansion was more than offset by approximately three percentage points of margin contraction due to material and other cost inflation and lower unit volume. The impact of lower unit volume includes approximately 130 basis points from enclosures products, driven primarily by weakness in the telcom market.\n28\nHUBBELL INCORPORATED\n - \nForm 10-K\nElectrical Solutions\nThe following table reconciles our Electrical Solutions segment adjusted operating income and adjusted operating margin to the directly comparable GAAP measure (in million and percentage change):\nFor the Year Ended December 31,\n(in millions)\n2024\n2023\nNet sales\n$\n2,027.8 \n$\n2,111.2 \nOperating income (GAAP measure)\n$\n361.8 \n$\n331.9 \nAmortization of acquisition-related intangible assets\n16.1 \n18.5 \nTransaction, integration & separation costs\n7.3 \n0.3 \nAdjusted operating income\n$\n385.2 \n$\n350.7 \nOperating margin (GAAP measure)\n17.8 \n%\n15.7 \n%\nAdjusted operating margin\n19.0 \n%\n16.6 \n%\nThe following table reconciles our Electrical Solutions segment Organic Net sales growth to the directly comparable GAAP financial measure (in millions and percentage change):\nFor the Year Ended December 31,\nElectrical Solutions \n2024\nInc/(Dec) %\n2023\nInc/(Dec) %\nNet sales (decline) growth (GAAP measure)\n$\n(83.4)\n(3.9)\n$\n34.4 \n1.7 \nImpact of acquisitions\n— \n— \n43.9 \n2.1 \nImpact of divestitures\n(163.0)\n(7.7)\n— \n— \nForeign currency exchange\n(0.7)\n— \n1.5 \n0.1 \nOrganic Net sales growth (decline) (non-GAAP measure)\n$\n80.3 \n3.8 \n$\n(11.0)\n(0.5)\nNet sales of the Electrical Solutions segment in 2024 were approximately $2.0 billion, a decrease of $83.4 million, or 3.9% as compared to 2023. The decrease includes 3.8% growth in organic net sales, that was more than offset by a 7.7% decline in net sales resulting from the disposition of the residential lighting business during the first quarter of 2024. The increase in organic net sales was driven by a low single digit percentage increase in unit volumes and a low single digit percentage increase in price realization. Volume growth was driven primarily by strength in renewables markets and datacenter balance-of-system products, while industrial markets were solid and non residential markets were soft.\nOperating income of the Electrical Solutions segment in 2024 was $361.8 million and increased approximately 9.0% compared to 2023, while operating margin in 2024 increased by 210 basis points to 17.8%. Excluding amortization of acquisition-related intangibles and transaction, integration & separation costs, the adjusted operating margin increased by 240 basis points to 19.0% in 2024. The increase in the operating margin and adjusted operating margin in 2024 was primarily due to approximately five percentage points of margin expansion from favorable price realization, improved productivity and higher volume. The disposition of the residential lighting business also contributed to the expansion. Those factors were partially offset by approximately three percentage points of margin contraction driven by higher material and other cost inflation. \nHUBBELL INCORPORATED\n \n- Form 10-K\n29\nFinancial Condition, Liquidity and Capital Resources\nCash Flow \n \nFor the Year Ended December 31,\n(in millions)\n2024\n2023\nNet cash provided by (used in):\n \n \nOperating activities from continuing operations\n$\n991.2 \n$\n880.8 \nInvesting activities from continuing operations\n(59.1)\n(1,380.2)\nFinancing activities from continuing operations\n(923.4)\n388.5 \nEffect of foreign currency exchange rate changes on cash and cash equivalents\n(16.4)\n6.9 \nNET CHANGE IN CASH AND CASH EQUIVALENTS\n$\n(7.7)\n$\n(104.0)\nThe following table reconciles our cash flows from operating activities to free cash flows for 2024 and 2023:\n \nFor the Year Ended December 31,\n(in millions)\n2024\n2023\nNet cash provided by operating activities - Continuing Operations (GAAP measure)\n$\n991.2 \n$\n880.8 \nLess: Capital expenditures - Continuing Operations\n(180.4)\n(165.7)\nFree cash flow - Continuing Operations\n$\n810.8 \n$\n715.1 \nFree cash flow as a percent of net income - continuing operations attributable to Hubbell\n104.2 \n%\n94.1 \n%\nFree cash flow is a non-GAAP measure that we define as cash flow from operations less capital expenditures. Management believes that free cash flow provides useful information regarding Hubbell’s ability to generate cash without reliance on external financing. In addition, management uses free cash flow to evaluate the resources available for investments in the business, strategic acquisitions and further strengthening the balance sheet. \n2024 Compared to 2023 \n \nCash provided by operating activities from continuing operations was $991.2 million in 2024 compared to $880.8 million in 2023.  The increase was primarily due to higher net income, after adjusting for the effect of non-cash items, primarily depreciation and amortization expense, along with lower cash used for working capital in 2024.\nCash used in investing activities was $59.1 million in 2024 compared to cash used of $1,380.2 million in 2023.  That change was driven by $122.9 million of cash proceeds in 2024 from the disposition of our residential lighting business as compared to cash used for acquisitions of $1,211.7 million in 2023. \nCash used in financing activities was $923.4 million in 2024 as compared to $388.5 million of cash provided by financing activities in 2023. The change in cash flows reflects $600 million of cash provided in December 2023 from the Term Loan issued to partially fund the acquisition of Systems Control, as compared to cash used in 2024 to extinguish that loan, along with an increase in dividends paid and higher share repurchases in 2024 compared to 2023.  \nThe unfavorable impact of foreign currency exchange rates on cash was $16.4 million in 2024 as compared to a favorable effect of $6.9 million in 2023. The unfavorable impact in 2024 was primarily related to weakness in the Brazilian Real, Canadian Dollar and Mexican Peso compared to the U.S. Dollar.\n30\nHUBBELL INCORPORATED\n - \nForm 10-K\nInvestments in the Business\n \nInvestments in our business include cash outlays for the acquisitions of businesses as well as expenditures to maintain the operation of our equipment and facilities and invest in restructuring activities. \nFor more information related to acquisitions completed in 2023, refer to Note 4 - Business Acquisition in the Notes to Consolidated Financial Statements, which is incorporated herein by reference.\nDuring 2024, we invested $180.4 million in capital expenditures, an increase of $14.7 million as compared to 2023, as we continue to invest in footprint optimization, automation and productivity initiatives.\nWe continue to invest in restructuring and related programs to maintain a competitive cost structure, to drive operational efficiencies and to mitigate the impact of rising material costs and administrative cost inflation. We expect our investment in restructuring and related activities to continue in 2024 as we continue to invest in previously initiated actions and initiate further footprint consolidation and other cost reduction initiatives.\nIn connection with our restructuring and related actions, we have incurred restructuring costs as defined by U.S. GAAP, which are primarily severance and employee benefits, asset impairments, and accelerated depreciation, as well as facility closure, contract termination and certain pension costs that are directly related to restructuring actions. We also incurred restructuring-related costs, which are costs associated with our business transformation initiatives, including the consolidation of back-office functions and streamlining of our processes, and certain other costs and gains associated with restructuring actions. We refer to these costs on a combined basis as \n“\nrestructuring and related costs”, which is a non-GAAP measure. We believe this non-GAAP measure provides investors with useful information regarding our underlying performance from period to period. Restructuring costs are predominantly settled in cash from our operating activities and are generally settled within one year, with the exception of asset impairments, which are non-cash.\nThe table below presents the restructuring and related costs incurred in 2024, additional expected costs, and the expected completion date of restructuring actions that had been initiated as of December 31, 2024 and in prior years (in millions):\nCosts Incurred in 2024\nAdditional Expected Costs\nExpected Completion Date\n2024 Restructuring Actions\n$\n10.9 \n$\n1.6 \n2025\n2023 and Prior Restructuring Actions\n1.9 \n1.4 \n2025\nRestructuring cost (GAAP measure)\n$\n12.8\n \n$\n3.0\n \nRestructuring-related costs\n6.7 \n3.2 \nRestructuring and related costs (Non-GAAP measure)\n$\n19.5\n \n$\n6.2\n \n \nStock Repurchase Program\nOn October 21, 2022 the Board of Directors approved a share repurchase program that authorized the repurchase of up to $300 million of common stock, which expires in October 2025. At December 31, 2024 our remaining share repurchase authorization under this program was $260.0 million. On February 12, 2025 the Board of Directors approved a new stock repurchase program that authorized the repurchase of up to $500.0 million of common stock and expires in February 2028. This new program is in addition to the remaining share repurchase authorization of $260.0 million under the October 21, 2022 program. Subject to numerous factors, including market conditions and alternative uses of cash, we may conduct discretionary repurchases through open market or privately negotiated transactions, which may include repurchases under plans complying with Rules 10b5-1 and 10b-18 under the Securities Exchange Act of 1934, as amended.\nDebt to Capital\nAt December 31, 2024 and 2023, the Company had $1,442.7 million and $2,023.2 million, respectively, of long-term debt outstanding, net of unamortized discount and the unamortized balance of capitalized debt issuance costs. At December 31, 2023, the Company had $15.0 million of maturities due within the next 12 months related to the Term Loan Agreement which were classified within short term debt in the Consolidated Balance Sheet.\nHUBBELL INCORPORATED\n \n- Form 10-K\n31\nTerm Loan Agreement\nIn connection with the December 2023 acquisition of Systems Control, the Company entered into a Term Loan Agreement (the \n“\nTerm Loan Agreement”) with a syndicate of lenders under which the Company borrowed $600 million on an unsecured basis. Borrowings under the Term Loan Agreement bore interest generally at either the adjusted term SOFR rate plus an applicable margin (determined by a ratings based grid) or the alternative base rate. The outstanding principal amount under the Term Loan Agreement was due and payable in full at maturity in December 2026. During the fourth quarter of 2024, the Company repaid the remainder of the Term Loan and no balance was outstanding at December 31, 2024. \nBorrowings under Revolving Credit Facility\nThe Company, as borrower, and its subsidiaries Hubbell Power Holdings S.à r.l. and Harvey Hubbell Holdings S.à r.l., each as a subsidiary borrower (collectively, the “Subsidiary Borrowers”) are parties to a five-year credit agreement with a syndicate of lenders and JPMorgan Chase Bank, N.A., as administrative agent, that provides a $750 million committed revolving credit facility (the “2021 Credit Facility”), which matures on March 12, 2026. Commitments under the 2021 Credit Facility may be increased to an aggregate amount not to exceed $1.25 billion. The 2021 Credit Facility includes a $50 million sub-limit for the issuance of letters of credit. The sum of the dollar amount of loans and letters of credit to the Subsidiary Borrowers under the 2021 Credit Facility may not exceed $75 million. There were no borrowings outstanding under the 2021 Credit Facility at December 31, 2024 or December 31, 2023.\nThe interest rate applicable to borrowings under the 2021 Credit Facility is either (i) the alternate base rate (as defined in the 2021 Credit Facility) or (ii) the adjusted SOFR rate plus an applicable margin (determined by a ratings based grid).\nThe 2021 Credit Facility contains a sole financial covenant requiring that, as of the last day of each fiscal quarter, the ratio of total indebtedness to total capitalization shall not be greater than 65%. The Company was in compliance with this covenant as of December 31, 2024.\nUnsecured Senior Notes\nAt each of December 31, 2024 and 2023, the Company had outstanding unsecured, senior notes in principal amounts of $400 million due in 2026, $300 million due in 2027, $450 million due in 2028 and $300 million due in 2031 (the “Notes”). \nThe carrying value of the Notes, net of unamortized discount and the unamortized balance of capitalized debt issuance costs, was $1,442.7 million and $1,440.3 million at December 31, 2024 and December 31, 2023, respectively.\nThe Notes are callable at any time at specified prices and are only subject to accelerated payment prior to maturity upon customary events of default, or upon a change in control triggering event as defined in the indenture governing the Notes, as supplemented. The Company was in compliance with all covenants (none of which is financial) as of December 31, 2024.\nShort-term Debt and Current Portion of Long-Term Debt\nAt December 31, 2024 and 2023, the Company had $125.4 million and $117.4 million, respectively, of short-term debt and current portion of long-term debt outstanding composed of: \n◦\n$123.0 million of commercial paper borrowings outstanding at December 31, 2024, and $100.0 million of commercial paper borrowings outstanding at December 31, 2023, were used to fund the Systems Control acquisition.\n◦\nAt December 31, 2023 the Company had $15.0 million of long-term debt classified within current liabilities in the Consolidated Balance Sheets, reflecting maturities within the next 12 months related to borrowing under the Term Loan Agreement at December 31, 2023. \n◦\nThe Company had $2.4 million of short-term debt outstanding at December 31, 2024 and December 31, 2023, respectively, which consisted of borrowings to support our international operations in China and amounts outstanding under our commercial card program. \nNet debt, defined as total debt less cash and investments, is a non-GAAP measure that may not be comparable to definitions used by other companies. We consider net debt to be a useful measure of our financial leverage for evaluating the Company’s ability to meet its funding needs.\n32\nHUBBELL INCORPORATED\n - \nForm 10-K\nThe following table sets forth the reconciliation of net debt at December 31, 2024 and 2023:\n \nDecember 31,\n(in millions)\n2024\n2023\nTotal Debt (GAAP measure)\n$\n1,568.1 \n$\n2,140.6 \nTotal Hubbell Incorporated Shareholders’ Equity\n3,268.3 \n2,877.0 \nTOTAL CAPITAL (GAAP measure)\n$\n4,836.4\n \n$\n5,017.6\n \nTotal Debt to Total Capital (GAAP measure)\n32 \n%\n43 \n%\nCash and Investments\n$\n429.9 \n$\n424.5 \nNET DEBT (non-GAAP measure)\n$\n1,138.2\n \n$\n1,716.1\n \nNet Debt to Total Capital (non-GAAP measure)\n24 \n%\n34 \n%\nLiquidity\n \nWe measure liquidity on the basis of our ability to meet short-term and long-term operational funding needs, to fund additional investments, including acquisitions, and to make dividend payments to shareholders. Significant factors affecting the management of liquidity are cash flows from operating activities, capital expenditures, cash dividend payments, stock repurchases, access to bank lines of credit and our ability to attract long-term capital with satisfactory terms.\nIn 2024, we returned capital to our shareholders through dividends and share repurchases. These activities were funded primarily with cash flows from operations.\n◦\nIn 2024, cash used for share repurchases was $40.0 million.  \n◦\nDividends paid on our Common Stock in 2024 were $267.3 million. \nWe also require cash outlays to fund our operations, capital expenditures, and working capital requirements to accommodate anticipated levels of business activity, as well as our rate of cash dividends and potential future acquisitions. We have contractual obligations for long-term debt, operating leases, purchase obligations, and certain other long-term liabilities, including defined benefit retirement obligations and other benefits.  Refer to Note 13 - Debt and Note 24 - Leases in the Notes to the Consolidated Financial Statements for further details on anticipated cash outflows.  As a result of the Tax Cuts and Jobs Act (“TCJA”), we also have an obligation to fund, by annual installments through 2025, the Company’s liability for the transition tax on the deemed repatriation of foreign earnings. Contractual purchase obligations are\n approximately $370 million i\nn 2025. Contractual purchase obligations beyond 2025 are not significant. \nOur purchase obligations include amounts committed under legally enforceable contracts or purchase orders for goods and services with defined terms as to price, quantity, delivery and termination liability. These obligations primarily consist of inventory purchases made in the normal course of business to meet operational requirements and commitments for equipment purchases. As of December 31, 2024, we have\n $48.2 million \nof uncertain tax positions reflected in our Consolidated Balance Sheet. We are unable to make a reasonable estimate regarding the timing of settlement of these uncertain tax positions and, as a result, they have been excluded from the disclosure. See Note 14 — Income Taxes in the Notes to Consolidated Financial Statements.\nOur sources of funds and available resources to meet these funding needs are as follows:\n◦\nCash flows from operating activities and existing cash resources: In addition to our cash flows from operating activities, we also had $329.1 million of cash and cash equivalents at \nDecember 31, 2024\n, of which approximately 14% was held inside the United States and the remainder held internationally. \nHUBBELL INCORPORATED\n \n- Form 10-K\n33\n◦\nOur 2021 Credit Facility provides a $750.0 million committed revolving credit facility and commitments under the 2021 Credit Facility may be increased (subject to certain conditions) to an aggregate amount not to exceed $1.250 billion. Annual commitment fees to support availability under the 2021 Credit Facility are not material. Although not the principal source of liquidity, we believe our 2021 Credit Facility is capable of providing significant financing flexibility at reasonable rates of interest and is an attractive alternative source of funding in the event that commercial paper markets experience disruption. However, an increase in usage of the 2021 Credit Facility related to growth or a significant deterioration in the results of our operations or cash flows could cause our borrowing costs to increase and/or our ability to borrow could be restricted. We have not entered into any guarantees that could give rise to material unexpected cash requirements. The full $750.0 million of borrowing capacity under the 2021 Credit Facility was available to the Company at \nDecember 31, 2024\n.\n◦\nIn addition to our commercial paper program and existing revolving credit facility, we also have the ability to obtain additional financing through the issuance of long-term debt. Considering our current credit rating, historical earnings performance, and financial position, we believe that we would be able to obtain additional long-term debt financing on attractive terms.\n \n◦\nThe Company also maintains other lines of credit that are primarily used to support the issuance of letters of credit. Interest rates and other terms of borrowing under these lines of credit vary from country to country, depending on local market conditions. \nAt December 31, 2024 and 2023, total availability under these lines was $55.3 million and $55.9 million, respectively, of which $41.1 million and $23.4 million was utilized to support letters of credit and the remaining amount was unused. The annual commitment fees associated with these lines of credit are not material.\nPension Funding Status\nWe have a number of funded and unfunded non-contributory U.S. and foreign defined benefit pension plans. Benefits under these plans are generally provided based on either years of service and final average pay or a specified dollar amount per year of service. The funded status of our qualified, defined benefit pension plans is dependent upon many factors including future returns on invested pension assets, the level of market interest rates, employee earnings and employee demographics.\nChanges in the value of the defined benefit plan assets and liabilities will affect the amount of pension expense ultimately recognized. Although differences between actuarial assumptions and actual results are no longer deferred for balance sheet purposes, deferral is still permitted for pension expense purposes. Unrecognized gains and losses in excess of an annual calculated minimum amount (the greater of 10% of the projected benefit obligation or 10% of the market value of assets) have been amortized and recognized in net periodic pension cost. Effective January 1, 2020, the amortization of unrecognized gains and losses of all of the Company’s qualified defined benefit pension plans is recognized over the remaining life expectancy of participants, as all participants are considered inactive as a result of plan amendments. During 2024 and 2023, we recorded $9.9 million and $10.4 million, respectively, of pension expense related to the amortization of these unrecognized losses. \nIn 2024 and 2023, we contributed $1.3 million and $20.0 million, respectively, to our qualified foreign and domestic defined benefit pension plans. These contributions have improved the funded status of those plans. The Company has elected to make a voluntary contribution of $20.0 million to its qualified domestic defined benefit pension plan in 2025. The anticipated level of pension funding in 2025 is not expected to have a significant impact on our overall liquidity.\nAssumptions\n \nThe following assumptions were used to determine projected pension and other benefit obligations at the measurement date and the net periodic benefit costs for the year:\n \nPension Benefits\nOther Benefits\n \n2024\n2023\n2024\n2023\nWeighted-average assumptions used to determine benefit obligations at December 31,\n \n \n \n \nDiscount rate\n5.58 \n%\n5.16 \n%\n5.60 \n%\n5.20 \n%\nRate of compensation increase\n0.08 \n%\n0.08 \n%\n5.00 \n%\n5.00 \n%\nWeighted-average assumptions used to determine net periodic benefit cost for years ended December 31,\nDiscount rate\n5.16 \n%\n5.46 \n%\n5.20 \n%\n5.50 \n%\nExpected return on plan assets\n5.93 \n%\n5.68 \n%\nN/A\nN/A\nRate of compensation increase\n0.08 \n%\n0.08 \n%\n5.00 \n%\n3.93 \n%\n \n34\nHUBBELL INCORPORATED\n - \nForm 10-K\nAt the end of each year, we estimate the expected long-term rate of return on pension plan assets based on the strategic asset allocation for our plans. In making this determination, we utilize expected rates of return for each asset class based upon current market conditions and expected risk premiums for each asset cla\nss. A one percentage point change in the expected long-term rate of return on pension fund assets would have an impact of approximately $4.3 million on 2025 pretax pension expense\n. The expected long-term rate of return is applied to the fair market value of pension fund assets to produce the expected return on fund assets that is included in pension expense. \nThe difference between this expected return and the actual return on plan assets was recognized at December 31, 2024 for balance sheet purposes, but continues to be deferred for expense purposes. The net deferral of past asset gains (losses) ultimately affects future pension expense through the amortization of gains (losses) with an offsetting adjustment to Hubbell shareholders’ equity through Accumulated other comprehensive loss.\n \nAt the end of each year, we determine the discount rate to be used to calculate the present value of our pension plan liabilities. For our U.S. and Canadian pension plans, this discount rate is determined by matching the expected cash flows associated with our benefit obligations to the expected cash flows of a hypothetical portfolio of high quality, fixed income debt instruments with maturities that closely match the expected funding period of our pension liabilities. As of December 31, 2024, we used a discount rate of \n5.60%\n for our U.S. pension plans compared to a discount rate of 5.20% used in 2023. For our Canadian pension plan, we used a discount rate of 4.58% in 2024, compared to a 4.61% discount rate used in 2023.\n \nFor our UK pension plan the discount rate was derived using a full yield curve and uses plan specific cash flows. The derived discount rate is the single discount rate equivalent to discounting these liability cash flows at the term-dependent spot rates of AA corporate bonds. This methodology resulted in a December 31, 2024 discount rate for the UK pension plan of 5.60% as compared to a discount rate of 4.80% used in 2023. \nA decrease of one percentage point in the discount rate would increase our 2025 pretax pension expense by approximately $0.3 million. A discount rate increase of one percentage point would decrease our 2025 pretax pension expense by $0.4 million. \nIn 2024, and 2023 we used the Pri-2012 mortality table and the MP-2021 projection scale from 2012 to calculate the present value of our pension plan liabilities. In 2024, the Pri-2012 mortality table was adjusted to reflect plan specific geospatial characteristics as appropriate. The plan specific adjusted Pri-2012 mortality table with generational projection from 2012 using Scale MP-2021 was chosen as the best estimate based on the observed and anticipated experience of the plans after considering alternative tables.  \nOther Post-Employment Benefits (“OPEB”)\n \nThe Company also has a number of health care and life insurance benefit plans covering eligible employees who reached retirement age while working for the Company. These benefits have been discontinued for substantially all future retirees. These plans are not funded and, therefore, no assumed rate of return on assets is required. We use a similar methodology to derive the discount rate for our post employment benefit plan obligations that we use for our pension plans. As of December 31, 2024, the Company used a discount rate of 5.60% to determine the projected benefit obligation compared to a discount rate of 5.20%  used in 2023. \nIn accordance with the accounting guidance for retirement benefits, we recorded to Accumulated other comprehensive loss, within Hubbell shareholders’ equity, a benefit, net of tax, of $6.1 million in 2024 and $4.7 million in 2023, respectively, related to the annual remeasurement of the OPEB plans and the amortization of prior service credits and net actuarial gains. \nOff-Balance Sheet Arrangements\nOff-balance sheet arrangements are defined as any transaction, agreement or other contractual arrangement to which an entity that is not included in our consolidated results is a party, under which we, whether or not a party to the arrangement, have, or in the future may have: (1) an obligation under a direct or indirect guarantee or similar arrangement, (2) a retained or contingent interest in assets transferred to an unconsolidated entity or similar arrangement that serves as credit, liquidity or market risk support to such entity for such assets, (3) an obligation or liability, including a contingent obligation or liability, under a contract that would be accounted for as a derivative instrument, except that it is excluded from the scope of FASB ASC Topic 815, or (4)  an obligation, including a contingent obligation, arising out of a variable interest in an unconsolidated entity that is held by, and material to, the Company, where such entity provides financing, liquidity, market risk or credit risk support to, or engages in leasing, hedging or research and development services with, the Company.\nWe do not have any off-balance sheet arrangements as defined above which have or are likely to have a current or future material effect on our financial condition, results of operations, liquidity, capital expenditures, capital resources or cash flows. \nHUBBELL INCORPORATED\n \n- Form 10-K\n35\nCritical Accounting Estimates\n \nNote 1 — Significant Accounting Policies in the Notes to Consolidated Financial Statements describes the significant accounting policies used in the preparation of our financial statements.\n \nUse of Estimates\nWe are required to make assumptions and estimates and apply judgments in the preparation of our financial statements that affect the reported amounts of assets and liabilities, revenues and expenses and related disclosures. We base our assumptions, estimates and judgments on historical experience, current trends and other factors deemed relevant by management, such as projections of future performance. We continually review these estimates and their underlying assumptions to ensure they are appropriate for the circumstances. Changes in estimates and assumptions used by us could have a material impact on our financial results, and actual results could differ significantly from those estimates. We believe that the following estimates are among the most critical in fully understanding and evaluating our reported financial results. These items utilize assumptions and estimates about the effect of future events that are inherently uncertain and are based on our judgment.\nRevenue Recognition\nThe Company recognizes revenue when performance obligations identified under the terms of contracts with its customers are satisfied, which generally occurs, for products, upon the transfer of control in accordance with the contractual terms and conditions of the sale. The majority of the Company’s revenue associated with products is recognized at a point in time when the product is shipped to the customer, with a relatively small amount of transactions in the Utility Solutions segment recognized upon delivery of the product at the contractually specified destination. \nThe Company also has performance obligations, primarily within the Utility Solutions segment, that are recognized over-time due to the customized nature of the product and the Company’s enforceable right to receive payment for work performed to date in the event of a cancellation. The Company uses an input measure to determine the extent of progress towards completion of the performance obligation, which the Company believes best depicts the transfer of control to the customer. Under this method, revenue recognition is based upon the ratio of costs incurred to date compared with estimated total costs to complete. \nRevenue from service contracts and post-shipment performance obligations is approximately one percent of total annual consolidated net revenue and those service contracts and post-shipment obligations are primarily within the Utility Solutions segment. Revenue from service contracts and post-shipment performance obligations is recognized when or as those obligations are satisfied. The Company primarily offers assurance-type standard warranties that do not represent separate performance obligations and on occasion will separately offer and price extended warranties that are separate performance obligations for which the associated revenue is recognized over-time based on the extended warranty period. The Company records amounts billed to customers for reimbursement of shipping and handling costs within revenue. Shipping and handling costs associated with outbound freight after control over a product has transferred to a customer are accounted for as fulfillment costs and are included in cost of goods sold. Sales taxes and other usage-based taxes are excluded from revenue. \nCertain businesses require a portion of the transaction price to be paid in advance of transfer of control. Advance payments are not considered a significant financing component as they are received less than one year before the related performance obligations are satisfied. In addition, in the Utility Solutions segment, certain businesses offer annual maintenance service contracts that require payment at the beginning of the contract period. These payments are treated as a contract liability and are classified in Other accrued liabilities in the Consolidated Balance Sheet. Once control transfers to the customer and the Company meets the revenue recognition criteria, the deferred revenue is recognized in the Consolidated Statement of Income. The deferred revenue relating to the annual maintenance service contracts is recognized in the Consolidated Statement of Income on a straight line basis over the expected term of the contract.\nThe Company has certain arrangements that require us to estimate at the time of sale the amounts of variable consideration that should not be recorded as revenue as certain amounts are not expected to be collected from customers, as well as an estimate of the value of the product to be returned. The Company principally relies on historical experience, specific customer agreements and anticipated future trends to estimate these amounts at the time of shipment and to reduce the transaction price. These arrangements include sales discounts and allowances based on sales volumes, specific programs and special pricing allowances, and returned goods, as are customary in the electrical products industry. Customer returns have historically been approximately one percent of gross sales. \n36\nHUBBELL INCORPORATED\n - \nForm 10-K\nInventory Valuation\n \nInventories are stated at the lower of cost or market value. Approximately 45% of total net inventory value is determined utilizing the last-in, first-out (LIFO) method of inventory accounting. The cost of foreign inventories and certain domestic inventories is determined utilizing average cost or first-in, first-out (FIFO) methods of inventory accounting.\n We routinely evaluate the carrying value of our inventories to ensure they are carried at the lower of LIFO, FIFO or average cost or market value. Such evaluation is based on our judgment and use of estimates, including sales forecasts, gross margins for particular product groupings, planned dispositions of product lines, technological events and overall industry trends. In addition, the evaluation is based on changes in inventory management practices which may influence the timing of exiting products and method of\n disposing of excess inventory.\n \nExcess inventory is generally identified by comparing future expected inventory usage to actual on-hand quantities. Inventory values are reduced for on-hand inventory in excess of pre-defined usage forecasts. Forecast usage is primarily determined by projecting historical (actual) sales and inventory usage levels forward to future periods. Changes in these estimates may necessitate future adjustments to inventory values.\nEmployee Benefits Costs and Funding\n \nWe sponsor domestic and foreign defined benefit pension, defined contribution and other postretirement plans. Significant assumptions used in the accounting for these employee benefit plans include the discount rate, expected return on the pension fund assets, rate of increase in employee compensation levels and health care cost increase projections. These assumptions are determined based on Company data and appropriate market indicators, and are evaluated each year as of the plans’ measurement dates. Further discussion o\nf the assumptions used in 2024 and 2023 are included above under “Pension Funding Status” and in Note 12 — Retirement Benefits in the Notes to Consolidated Financial Statements.\nTaxes\n \nWe account for income taxes in accordance with the applicable accounting guidance which requires that deferred tax assets and liabilities be recognized using enacted tax rates for the effect of temporary differences between the book and tax basis of recorded assets and liabilities. Additionally, deferred tax assets are required to be reduced by a valuation allowance if it is more-likely-than-not that some portion or all of a deferred tax asset will not be realized. The factors used to assess the likelihood of realization of deferred tax assets are the forecast of future taxable income, available tax planning strategies that could be implemented to realize the net deferred tax assets, and future reversals of deferred tax liabilities. Failure to achieve forecasted taxable income can affect the ultimate realization of net deferred tax assets.\nWe operate within multiple taxing jurisdictions and are subject to audit in these jurisdictions. The Internal Revenue Service (“IRS”) and other tax authorities routinely review our tax returns. These audits can involve complex issues, which may require an extended period of time to resolve. The Company records uncertain tax positions when it has determined that it is more-likely-than-not that a tax position will not be sustained upon examination by taxing authorities based on the technical merits of the position. The Company uses the criteria established in the accounting guidance to determine whether an item meets the definition of more-likely-than-not. The Company’s policy is to recognize these uncertain tax positions when the more-likely-than-not threshold is met, when the statute of limitations has expired or upon settlement. In management’s opinion, adequate provision has been made for potential adjustments arising from any examinations. See \nNote 14 — Income Taxes in the Notes to Consolidated Financial Statements.\nValuation of Long-Lived Assets, Goodwill, and Indefinite-Lived Intangible Assets\n \nOur long-lived assets include land, buildings, equipment, molds and dies, software, goodwill and other intangible assets. Long-lived assets, other than land, goodwill and indefinite-lived intangibles, are depreciated over their estimated useful lives. The assets and liabilities of acquired businesses are recorded under the acquisition method of accounting at their estimated fair values at the dates of acquisition. Goodwill represents purchase price in excess of fair values assigned to the underlying identifiable net assets of acquired businesses. Intangible assets primarily consist of patents, tradenames, developed technology and customer related intangibles. \nGoodwill and indefinite-lived intangible assets are reviewed annually for impairment unless circumstances dictate the need for more frequent assessment. We perform our annual goodwill impairment testing as of April 1\nst\n of each year. The accounting guidance provides entities an option of performing a qualitative assessment (the “Step-zero\n”\n test) before performing a quantitative analysis. If the entity determines, on the basis of certain qualitative factors, that it is more-likely-than-not that the goodwill is not impaired, the entity would not need to proceed to the quantitative goodwill impairment testing process as prescribed in the guidance. If the Company does not elect to complete the qualitative assessment, the Company completes the quantitative assessment whereby the estimated fair value of each reporting unit is compared to its carrying value.  \nHUBBELL INCORPORATED\n \n- Form 10-K\n37\nThe Company completed its annual goodwill impairment test as of April 1, 2024. For each of the Company’s reporting units, the Company elected to utilize the quantitative goodwill impairment testing process, as permitted in the accounting guidance, by comparing the estimated fair value of the reporting units to their carrying values. As of April 1, 2024, the impairment testing resulted in implied fair values for each reporting unit that significantly exceeded such reporting unit’s carrying value, including goodwill. The Company did not have any reporting units with zero or negative carrying amounts. \nThe organizational changes described in Note 3 - Revenue resulted in a change in the Company’s reporting units within the Electrical Solutions segment. As a result of the change in reporting units, the Company performed an interim goodwill impairment assessment during the third quarter of 2024, for the reporting units within the Electrical Solutions segment. Because the changes did not affect the Utility Solutions segment, no interim goodwill impairment assessment was required for that segment. For this interim assessment, the Company elected to utilize the quantitative goodwill impairment testing process, as permitted in the accounting guidance, by comparing the estimated fair value of the reporting units to their carrying values. The interim impairment testing resulted in implied fair values for each reporting unit that significantly exceeded such reporting unit’s carrying value, including goodwill. The Company did not have any reporting units with zero or negative carrying amounts.\nThe goodwill impa\nirment test requires judgment, including the identification of reporting u\nnits, assigning assets and liabilities to reporting units, and determining the fair value of each reporting unit. Significant judgments required to estimate the fair value of reporting units include estimating future cash flows, determining appropriate discount rates and other assumptions, including assumptions about secular economic and market conditions. The Company uses internal discounted cash flow models to estimate fair value. These cash flow estimates are derived from historical experience, third-party end market data, and future long-term business plans and include assumptions of future sales growth, gross margin, operating margin, terminal growth rate, and the application of an appropriate discount rate. Significant changes in these estimates and assumptions could materially affect the determination of fair value and/or goodwill impairment for each reporting unit. We corroborate the values determined from our discounted cash flow models by reconciling the sum of the estimated fair values of each reporting unit to our market capitalization at the testing date, including consideration of a control premium. We have not recorded any goodwill impairments since the initial adoption of the accounting guidance in 2002.\n \nThe identification and measurement of impairment of indefinite-lived intangible assets involves either an assessment of qualitative factors to determine whether events or circumstances indicate that it is more-likely-than-not that an indefinite-lived intangible asset is impaired or a quantitative assessment whereby the estimated fair value of each indefinite-lived intangible asset is compared to its carrying value. If it is more-likely-than-not that the asset is impaired, the estimated fair value of the indefinite-lived intangibles will be determined using discounted cash flow estimates. If the carrying value of these assets exceeds the estimated fair value, the carrying value will be reduced to the estimated fair value. For the Company’s annual impairment test as of April 1, 2024, the Company elected to utilize the quantitative impairment testing process as permitted in the accounting guidance. The estimated fair value was determined utilizing an income approach (relief from royalty method). Significant judgment is required to estimate the fair value of the indefinite-lived intangible assets including assumptions for future revenues, discount rates, royalty rates, and other assumptions, including assumptions about secular economic and market conditions. Significant changes in these estimates and assumptions could affect the determination of fair value and/or impairment for each indefinite-lived intangible asset. As of April 1, 2024, the impairment testing resulted in estimated fair values for each indefinite-lived intangible asset that significantly exceeded the carrying values and there were no indefinite-lived intangible assets at risk of failing the quantitative impairment test. We did not record any impairments related to indefinite-lived intangible assets in 2024, 2023, or 2022.\n38\nHUBBELL INCORPORATED\n - \nForm 10-K\nForward-Looking Statements\n \nSome of the information included in this Management’s Discussion and Analysis of Financial Condition and Results of Operations, and elsewhere in this Form 10-K, contain “forward-looking statements” as defined by the Private Securities Litigation Reform Act of 1995. These statements generally relate to our expectations and beliefs regarding our financial results, condition and outlook, projections of future performance, anticipated growth and end markets, changes in operating results, market conditions and economic conditions, expected capital resources, liquidity, financial performance, pension funding and results of operations, plans, strategies, opportunities, developments and productivity initiatives, competitive positioning, and trends in particular markets or industries. In addition, all statements regarding the expected financial impact of the integration of acquisitions, adoption of updated accounting standards and any expected effects of such adoption, and intent to continue repurchasing shares of common stock, as well as other statements that are not strictly historic in nature, are forward-looking. Forward-looking statements may be identified by the use of words, such as “believe”, “expect”, “anticipate”, “intend”, “depend”, “should”, “plan”, “estimated”, “predict”, “could”, “may”, “subject to”, “continues”, “growing”, “prospective”, “forecast”, “projected”, “purport”, “might”, “if”, “contemplate”, “potential”, “pending,” “target”, “goals”, “scheduled”, “will”, “will likely be”, and similar words and phrases. Such forward-looking statements are based on our current expectations and involve numerous assumptions, known and unknown risks, uncertainties and other factors, which may cause actual and future performance or the Company’s achievements to be materially difference from any future results, performance, or achievements expressed or implied by such forward-looking statements. Such factors include, but are not limited to:\n•\nThe general impact of inflation on our business, including the impact on raw materials costs, elevated interest rates and increased energy costs and our ability to implement and maintain pricing actions that we have taken to cover higher costs and protect our margin profile.\n•\nEconomic and business conditions in particular industries, markets or geographic regions, as well the potential for macro-economic effects of the U.S. government federal deficit, and continued inflation, a significant economic slowdown, stagflation or recession.\n•\nEffects of unfavorable foreign currency exchange rates and the potential use of hedging instruments to hedge the exposure to fluctuating rates of foreign currency exchange on inventory purchases.\n•\nSupply chain disruptions and availability, costs\n and quantity of raw materials, purchased components, energy and freight. \n•\nChanges in demand for our products, market conditions, product quality, or product availability adversely affecting sales levels.\n•\nAbility to effectively develop and introduce new products.\n•\nChanges in markets or competition adversely affecting realization of price increases.\n•\nContinued softness in the telecommunication markets and residential market of Electrical Solutions.\n•\nContinued softness in the residential market.\n•\nFailure to achieve projected levels of efficiencies, and maintain cost savings and cost reduction measures, including those expected as a result of our lean initiatives and strategic sourcing plans.\n•\nImpacts of increased trade tariffs, import quotas or other trade restrictions or measures taken by the United States, United Kingdom and other countries, including the recent and potential changes in U.S. trade policies that may be made by the new presidential administration.\n•\nFailure to comply with import and export laws.\n•\nChanges relating to impairment of our goodwill and other intangible assets.\n•\nInability to access capital markets or failure to maintain our credit ratings.\n•\nChanges in expected or future levels of operating cash flow, indebtedness and capital spending.\n•\nRegulatory issues, changes in tax laws and policies, including changes in current U.S. income tax rates multijurisdictional implementation of the OECD’s comprehensive base erosion and profit shifting plan, or changes in geographic profit mix affecting tax rates and availability of tax incentives.\n•\nA major disruption in one or more of our manufacturing or distribution facilities or headquarters, including the impact of plant consolidations and relocations.\n•\nChanges in our relationships with, or the financial condition or performance of, key distributors and other customers, agents or business partners which could adversely affect our results of operations.\n•\nImpact of productivity improvements on lead times, quality and delivery of product.\n•\nAnticipated future contributions and assumptions including increases in interest rates and changes in plan assets with respect to pensions and other retirement benefits, as well as pension withdrawal liabilities.\n•\nAdjustments to product warranty accruals in response to claims incurred, historical experiences and known costs.\n•\nUnexpected costs or charges, certain of which might be outside of our control.\n•\nChanges in strategy due to economic conditions or other conditions outside of our control affecting anticipated future global product sourcing levels.\n•\nAbility to carry out future acquisitions and strategic investments in our core businesses as well as the acquisition related costs.\n•\nAbility to successfully manage and integrate an acquired business, such as the acquisitions of El Electronics LLC, Indústria Electromecânica Balestro Ltda., and the Systems Control business, as well as the failure to realize expected synergies and benefits anticipated when we make an acquisition due to potential adverse reactions or changes to business or employee relationships resulting from completion of the transaction, competitive responses to the transaction, the possibility that the anticipated benefits of the transaction are not realized when expected or at all, including as a result of the impact of, or problems arising from, the integration of an acquired business, diversion of management’s attention from ongoing business operations and opportunities, and litigation relating to the transaction. \nHUBBELL INCORPORATED\n \n- Form 10-K\n39\n•\nThe impact of certain divestitures, including the benefits and costs of the sale of the residential lighting business. \n•\nThe ability to effectively implement Enterprise Resource Planning systems without disrupting operational and financial processes.\n•\nThe ability of government customers to meet their financial obligations.\n•\nPolitical unrest and military actions in foreign countries, including the conflicts in Ukraine and the Middle East and trade tensions with China, as well as the impact on world markets and energy supplies and prices resulting therefrom.\n•\nThe impact of potential natural disasters or additional public health emergencies on our financial condition and results of operations.\n•\nFailure of information technology systems, cybersecurity breaches, cyber threats, malware, phishing attacks, break-ins and similar events resulting in unauthorized disclosure of confidential information or disruptions or damage to information technology systems that could cause interruptions to our operations or adversely affect our internal control over financial reporting. \n•\nIncurring significant and/or unexpected costs to avoid manage, defend and litigate intellectual property matters.\n•\nFuture repurchases of common stock under our common stock repurchase program.\n•\nChanges in accounting principles, interpretations, or estimates.\n•\nFailure to comply with any laws and regulations, including those related to data privacy and information security, environmental and conflict-free minerals. \n•\nThe outcome of environmental, legal and tax contingencies or costs compared to amounts provided for such contingencies, including contingencies or costs with respect to pension withdrawal liabilities. \n•\nImproper conduct by any of our employees, agents or business partners that damages our reputation or subjects us to civil or criminal liability. \n•\nOur ability to hire, retain and develop qualified personnel. \n•\nAdverse changes in foreign currency exchange rates and the potential use of hedging instruments to hedge the exposure to fluctuating rates of foreign currency exchange on inventory purchases.\n•\nOther factors described in our Securities and Exchange Commission filings, including the “Business”, “Risk Factors”, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and “Quantitative and Qualitative Disclosures about Market Risk” sections in this Annual Report on Form 10-K for the year ended December 31, 2024.\nAny such forward-looking statements are not guarantees of future performances and actual results, developments and business decisions may differ from those contemplated by such forward-looking statements. The Company disclaims any duty to update any forward-looking statement, all of which are expressly qualified by the foregoing, other than as required by law.",
  "item2": null
}