{
  "source_file": "hum-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS \n General\nHeadquartered in Louisville, Kentucky, Humana Inc. and its subsidiaries, referred to throughout this document as “we,” “us,” “our,” the “Company” or “Humana,” is committed to putting health first – for our teammates, our customers, and our company. Through our Humana insurance services, and our CenterWell health care services, we make it easier for the millions of people we serve to achieve their best health – delivering the care and service they need, when they need it. These efforts are leading to a better quality of life for people with Medicare, Medicaid, families, individuals, military service personnel, and communities at large. \n As of December 31, 2024, we had approximately 16 million members in our medical benefit plans, as well as approximately 5 million members in our specialty products. During 2024, 85% of our total premiums and services revenue were derived from contracts with the federal government, including 14% derived from our individual Medicare Advantage contracts in Florida with the Centers for Medicare and Medicaid Services, or CMS, under which we provide health insurance coverage to approximately 924,800 members as of December 31, 2024.\nHumana Inc. was organized as a Delaware corporation in 1964. Our principal executive offices are located at 500 West Main Street, Louisville, Kentucky 40202, the telephone number at that address is (502) 580-1000, and our website address is www.humana.com. We have made available free of charge through the Investor Relations section of our web site our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements, and, if applicable, amendments to those reports filed or furnished pursuant to Section 13(a) of the Exchange Act, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission.\nThis Annual Report on Form 10-K, or 2024 Form 10-K, contains both historical and forward-looking information. See Part I, Item 1A, \"Risk Factors\" of this Form 10-K for a description of a number of factors that may adversely affect our results or business.\nBusiness Segments\nOur two\n \nreportable segments, Insurance and CenterWell, are based on a combination of the type of health plan customer and adjacent businesses centered on well-being solutions for our health plans and other customers. Our Chief Executive Officer, the Chief Operating Decision Maker, utilizes these segment groupings and results of each segment, measured by income (loss) from operations, to assess performance and allocate resources primarily during our annual budget process and periodic forecast updates. For additional information on our business segments and \n4\nsegment financial information, refer to Note 18 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\n    \nOur Products\nOur medical and specialty insurance products allow members to access health care services primarily through our networks of health care providers with whom we have contracted. These products may vary in the degree to which members have coverage. Health maintenance organizations, or HMOs, include comprehensive managed care benefits generally through a participating network of physicians, hospitals, and other providers. Preferred provider organizations, or PPOs, provide members the freedom to choose any health care provider. However, PPOs generally require the member to pay a greater portion of the provider’s fee in the event the member chooses not to use a provider participating in the PPO’s network. Point of Service, or POS, plans combine the advantages of HMO plans with the flexibility of PPO plans. In general, POS plans allow members to choose, at the time medical services are needed, to seek care from a provider within the plan’s network or outside the network. In addition, we offer services to our health plan members as well as to third parties that promote health and wellness, including pharmacy solutions, primary care, and home solutions, as well as services and capabilities to advance population health. At the core of our strategy is our integrated care delivery model, which unites quality care, high member engagement, and sophisticated data analytics. Three core elements of the model are to improve the consumer experience by simplifying the interaction with us, engaging members in clinical programs, and offering assistance to providers in transitioning from a fee-for-service, or FFS, to a value-based arrangement. Our approach to primary, physician-directed care for our members aims to provide quality care that is consistent, integrated, cost-effective, and member-focused. The model is designed to improve health outcomes and affordability for individuals and for the health system as a whole, while offering our members a simple, seamless healthcare experience. The discussion that follows describes the products offered by each of our segments.\n5\nOur Insurance Segment Products\nThe Insurance segment is comprised of insurance products serving Medicare and state-based contract beneficiaries, as well as individuals and employers. The segment also includes our Pharmacy Benefit Manager, or PBM, business. These products are described in the discussion that follows. \nThe following table presents our premiums and services revenue for the Insurance segment by product for the year ended December 31, 2024:\nInsurance Segment\nPremiums and\nServices Revenue\nPercent of\nConsolidated\nPremiums and\nServices Revenue\n \n(dollars in millions)\nPremiums:\nIndividual Medicare Advantage\n$\n88,019 \n75.6 \n%\nGroup Medicare Advantage\n7,731 \n6.6 \n%\nMedicare stand-alone PDP\n3,137 \n2.7 \n%\nTotal Medicare\n98,887 \n84.9 \n%\nCommercial fully-insured\n501 \n0.4 \n%\nSpecialty benefits\n955 \n0.8 \n%\nMedicare Supplement\n846 \n0.7 \n%\nState-based contracts and other\n10,915 \n9.4 \n%\nTotal premiums revenue\n112,104 \n96.2 \n%\nServices:\nCommercial ASO\n50 \n— \n%\nMilitary services and other\n916 \n0.8 \n%\nServices revenue\n966 \n0.8 \n%\nTotal Insurance segment premiums and services revenue\n$\n113,070 \n97.0 \n%\nMedicare\nWe have participated in the Medicare program for private health plans for over 30 years and have established a national presence, offering at least one type of Medicare plan in all 50 states. We have a geographically diverse membership base that we believe provides us with greater ability to expand our network of PPO and HMO providers. We employ strategies including health assessments and clinical guidance programs such as lifestyle and fitness programs for seniors to guide Medicare beneficiaries in making cost-effective decisions with respect to their health care. We believe these strategies result in cost savings that occur from making positive behavior changes.\nMedicare is a federal program that provides persons age 65 and over and some disabled persons under the age of 65 certain hospital and medical insurance benefits. CMS, an agency of the United States Department of Health and Human Services, administers the Medicare program. Hospitalization benefits are provided under Part A, without the payment of any premium, for up to 90 days per incident of illness plus a lifetime reserve aggregating 60 days. Eligible beneficiaries are required to pay an annually adjusted premium to the federal government to be eligible for physician care and other services under Part B. Beneficiaries eligible for Part A and Part B coverage under traditional fee-for-service Medicare are still required to pay out-of-pocket deductibles and coinsurance. Throughout this document this program is referred to as Medicare FFS. As an alternative to Medicare FFS, in geographic areas where a managed care organization has contracted with CMS pursuant to the Medicare Advantage program, Medicare beneficiaries may choose to receive benefits from a Medicare Advantage organization under Medicare Part C. Pursuant to Medicare Part C, Medicare Advantage organizations contract with CMS to offer Medicare Advantage plans to provide benefits at least comparable to those offered under Medicare FFS. Our Medicare Advantage, or MA, plans are discussed in the following sections. Prescription drug benefits are provided under Part D.\n6\nIndividual Medicare Advantage Products\nWe contract with CMS under the Medicare Advantage program to provide a comprehensive array of health insurance benefits, including wellness programs, chronic care management, and care coordination, to Medicare eligible persons under HMO, PPO, Private Fee-For-Service, or PFFS, and Special Needs Plans, including Dual Eligible Special Needs, or D-SNP, plans in exchange for contractual payments received from CMS, usually a fixed payment per member per month. With each of these products, the beneficiary receives benefits in excess of Medicare FFS, typically including reduced cost sharing, enhanced prescription drug benefits, care coordination, data analysis techniques to help identify member needs, complex case management, tools to guide members in their health care decisions, care management programs, wellness and prevention programs and, in some instances, a reduced monthly Part B premium. Most Medicare Advantage plans offer the prescription drug benefit under Part D as part of the basic plan, subject to cost sharing and other limitations. Accordingly, all of the provisions of the Medicare Part D program described in connection with our stand-alone prescription drug plans in the following section also are applicable to most of our Medicare Advantage plans. Medicare Advantage plans may charge beneficiaries monthly premiums and other copayments for Medicare-covered services or for certain extra benefits. Generally, Medicare-eligible individuals enroll in one of our plan choices between October 15 and December 7 for coverage that begins on the following January 1.\nOur Medicare HMO and PPO plans, which cover Medicare-eligible individuals residing in certain counties, may eliminate or reduce coinsurance or the level of deductibles on many other medical services while seeking care from participating in-network providers or in emergency situations. Except in emergency situations or as specified by the plan, most HMO plans provide no out-of-network benefits. PPO plans carry an out-of network benefit that is subject to higher member cost-sharing. In some cases, these beneficiaries are required to pay a monthly premium to the HMO or PPO plan in addition to the monthly Part B premium they are required to pay the Medicare program.\nMost of our Medicare PFFS plans are network-based products with in and out of network benefits due to a requirement that Medicare Advantage organizations establish adequate provider networks, except in geographic areas that CMS determines have fewer than two network-based Medicare Advantage plans. In these areas, we offer Medicare PFFS plans that have no preferred network. Individuals in these plans pay us a monthly premium to receive typical Medicare Advantage benefits along with the freedom to choose any health care provider that accepts individuals at rates equivalent to Medicare FFS payment rates.\nCMS uses a risk-adjustment model which adjusts premiums paid to Medicare Advantage, or MA, plans according to health status of covered members. The risk-adjustment model, which CMS implemented pursuant to the Balanced Budget Act of 1997 (BBA) and the Benefits Improvement and Protection Act of 2000 (BIPA), generally pays more where a plan's membership has higher expected costs. Under this model, rates paid to MA plans are based on actuarially determined bids, which include a process whereby our prospective payments are based on our estimated cost of providing standard Medicare-covered benefits to an enrollee with a \"national average risk profile.\" That baseline payment amount is adjusted to account for certain demographic characteristics and health status of our enrolled members. Under the risk-adjustment methodology, all MA plans must collect from providers and submit the necessary diagnosis code information to CMS within prescribed deadlines. The CMS risk-adjustment model uses the diagnosis data, collected from providers, to calculate the health status-related risk-adjusted premium payment to MA plans, which CMS further adjusts for coding pattern differences between the health plans and the government fee-for-service (FFS) program. We generally rely on providers, including certain providers in our network who are our employees, to code their claim submissions with appropriate diagnoses, which we send to CMS as the basis for our health status-adjusted payment received from CMS under the actuarial risk-adjustment model. We also rely on these providers to document appropriately all medical data, including the diagnosis data submitted with claims. In addition, we conduct medical record reviews as part of our data and payment accuracy compliance efforts, to more accurately reflect diagnosis conditions under the risk adjustment model. For additional information, refer to Note 17 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" and Part I, Item 1A, \"Risk Factors\" of this Form 10-K.\nAt December 31, 2024, we provided health insurance coverage under CMS contracts to approximately 5,661,800 individual Medicare Advantage members, including approximately 924,800 members in Florida. These \n7\nFlorida contracts accounted for premiums revenue of approximately $16.4 billion, which represented approximately 19% of our individual Medicare Advantage premiums revenue, or 14% of our consolidated premiums and services revenue for the year ended December 31, 2024.\nOur individual Medicare Advantage products covered under Medicare Advantage contracts with CMS are renewed generally for a calendar year term unless CMS notifies us of its decision not to renew by May 1 of the calendar year in which the contract would end, or we notify CMS of our decision not to renew by the first Monday in June of the calendar year in which the contract would end. All material contracts between Humana and CMS relating to our Medicare Advantage products have been renewed for 2025, and all of our product offerings filed with CMS for 2025 have been approved.\nIndividual Medicare Stand-Alone Prescription Drug Products\nWe offer stand-alone prescription drug plans, or PDPs, under Medicare Part D, including a PDP offering co-branded with Walmart Inc., or the Humana-Walmart plan. Generally, Medicare-eligible individuals enroll in one of our plan choices between October 15 and December 7 for coverage that begins on the following January 1. Our stand-alone PDP offerings consist of plans offering basic coverage with benefits mandated by Congress, as well as plans providing enhanced coverage with varying degrees of out-of-pocket costs for premiums, deductibles, and co-insurance. Our revenues from CMS and the beneficiary are determined from our PDP bids submitted annually to CMS. These revenues also reflect the health status of the beneficiary and risk sharing provisions as more fully described in Note 2 to the audited Consolidated Financial Statements included in Item 8. – Financial Statements and Supplementary Data, titled “Receivables and Revenue Recognition.” Our stand-alone PDP contracts with CMS are renewed generally for a calendar year term unless CMS notifies us of its decision not to renew by May 1 of the calendar year in which the contract would end, or we notify CMS of our decision not to renew by the first Monday in June of the calendar year in which the contract would end. All material contracts between Humana and CMS relating to our Medicare stand-alone PDP products have been renewed for 2025, and all of our product offerings filed with CMS for 2025 have been approved.\nWe have administered CMS’s Limited Income Newly Eligible Transition, or LI-NET, prescription drug plan program since 2010. This program allows individuals who receive Medicare’s low-income subsidy to also receive immediate prescription drug coverage at the point of sale if they are not already enrolled in a Medicare Part D plan. CMS temporarily enrolls newly identified individuals with both Medicare and Medicaid into the LI-NET prescription drug plan program, and subsequently transitions each member into a Medicare Part D plan that may or may not be a Humana Medicare plan.\nGroup Medicare Advantage and Medicare Stand-Alone PDP\nWe offer products that enable employers that provide post-retirement health care benefits to replace Medicare wrap or Medicare supplement products with Medicare Advantage or stand-alone PDPs from Humana. These products are primarily offered as PPO plans on the same Medicare platform as individual Medicare Advantage plans. These plans offer the same types of benefits and services available to members in our individual Medicare plans discussed previously, however, group Medicare Advantage plans typically have richer benefit offerings than individual Medicare Advantage plans, including prescription drug coverage in the gap, for instance, due to the desire of many customers to closely match their pre-retirement benefit structure.\nMedicare Supplement\nWe also offer Medicare supplement products that help pay the medical expenses that Medicare FFS does not cover, such as copayments, coinsurance and deductibles.\n8\nState-based Contracts\n Through our state-based contracts, we serve members enrolled in Medicaid, a program funded by both the federal and state governments and administered by states to care for their most vulnerable populations. Within federal guidelines, states determine whom to cover, but general categories for traditional Medicaid programs include children and parents; Aged, Blind, and Disabled (ABD) individuals; and Medicaid Expansion adults. Through Medicaid Managed Long-Term Support Services (MLTSS) programs, states offer programs to deliver support services to people who receive home and community or institution-based services for long-term care. \nWe have contracts in multiple states to serve Medicaid-eligible members, including Florida, Kentucky, Illinois, Indiana, Louisiana, Ohio, Oklahoma, South Carolina and Wisconsin.\nWe also serve members who qualify for both Medicaid and Medicare, referred to as \"dual eligible\", through our Medicaid, Medicare Advantage, and stand-alone prescription drug plans. As the dual eligible population represents a disproportionate share of costs, Humana is participating in varied integration models designed to improve health outcomes and reduce avoidable costs. \nAs part of our individual Medicare Advantage products, we also offer Dual-Eligible Special Needs Plans (D-SNP). In connection with offering a D-SNP in a particular state, we are required to enter into a special coordinating contract with the applicable state Medicaid agency. To meet federal requirements that took effect in 2021, states have implemented new D-SNP requirements to strengthen Medicaid-Medicare integration requirements for D-SNPs. Some states are also moving to support the dual eligible population by linking D-SNP participation to enrollment in a plan that also participates in a state-based Medicaid program to coordinate and integrate both Medicare and Medicaid benefits.\nSpecialty\nWe sell specialty and ancillary insurance benefits consisting of dental, vision, life and disability to employer groups.  In addition, we sell dental and vision specialty insurance benefits to individuals.\nCommercial Fully-Insured and ASO\nIn February 2023, we announced our planned exit from the Employer Group Commercial Medical Products business, which includes all fully insured, self-funded and Federal Employee Health Benefit medical plans, as well as associated wellness and rewards programs. Following a strategic review, we determined the Employer Group Commercial Medical Products business was no longer positioned to sustainably meet the needs of commercial members over the long term or support our long-term strategic plans. We anticipate the exit of this line of business to be finalized in the first half of 2025.\nFor in-force group commercial medical customers and members, our commercial products included a broad spectrum of major medical benefits with multiple in-network coinsurance levels and annual deductible choices that employers of all sizes offered to their employees on either a fully-insured, through HMO, PPO, or POS plans, or self-funded basis. Our plans integrated clinical programs, plan designs, communication tools, and spending accounts. \nOur ASO products were offered to small group and large group employers who self-insured their employee health plans. We received fees to provide administrative services which generally included the processing of claims, offering access to our provider networks and clinical programs, and responding to customer service inquiries from members of self-funded employers. These products might have included all of the same benefit and product design characteristics of our fully-insured HMO, PPO, or POS products described previously. Under ASO contracts, self-funded employers generally retained the risk of financing the costs of health benefits, with large group customers retaining a greater share and small group customers a smaller share of the cost of health benefits. All small group ASO customers and many large group ASO customers purchased stop loss insurance coverage from us to cover catastrophic claims or to limit aggregate annual costs.\n9\nMilitary Services\nUnder our TRICARE contracts with the United States Department of Defense, or DoD, we provide administrative services to arrange health care services for active-duty and retired military personnel and their dependents. We have participated in the TRICARE program since 1996 under contracts with the DoD. Under our contracts, we provide administrative services while the federal government retains all of the risk of the cost of health benefits. Accordingly, we account for revenues under the current contract net of estimated health care costs similar to an administrative services fee only agreement. \nWe delivered services under the T2017 East Region contract from commencement on January 1, 2018 through expiration on December 31, 2024. The T2017 East Region contract comprised 32 states and approximately 6 million TRICARE beneficiaries. In December 2022, we were awarded the next generation of TRICARE Managed Care Support Contracts, or T-5, for the updated TRICARE East Region by the Defense Health Agency of the DoD. The T-5 East Region contract commenced on January 1, 2025 and comprises 24 states, and Washington D.C., and approximately 4.6 million beneficiaries. The transition period for the T-5 contract began in January 2024 and overlapped the final year of the T2017 contract. The length of the contract is one transition year followed by eight annual option periods, which, if all options are exercised, would result in a total contract length of nine years. \nOur CenterWell Segment Products\nThe products offered by our CenterWell segment are key to our integrated care delivery model. This segment includes our pharmacy solutions, primary care, and home solutions operations. The CenterWell segment also includes our strategic partnerships with Welsh, Carson, Anderson & Stowe, or WCAS, to develop and operate senior-focused, payor-agnostic, primary care centers, as well as our minority ownership interest in hospice operations. Services offered by this segment are designed to enhance the overall healthcare experience. These services may lead to lower utilization associated with improved member health and/or lower drug costs. For information on our intersegment revenues, refer to Note 18 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nThe following table presents our services revenue for the CenterWell segment by line of business for the year ended December 31, 2024:\nCenterWell\nSegment\nServices Revenue\nPercent of\nConsolidated\nPremiums and\nServices Revenue\n \n(dollars in millions)\nIntersegment revenues:\nHome solutions\n$\n2,050 \nn/a\nPharmacy solutions\n10,724 \nn/a\nPrimary care\n3,697 \nn/a\nTotal intersegment revenues\n$\n16,471 \nn/a\nExternal services revenue:\nHome solutions\n$\n1,313 \n1.1 \n%\nPharmacy solutions\n904 \n0.8 \n%\nPrimary care\n1,248 \n1.1 \n%\nTotal external services revenue\n$\n3,465 \n3.0 \n%\nn/a – not applicable\n10\nPharmacy Solutions\nOur pharmacy solutions business includes the operations of CenterWell Pharmacy (our mail-order pharmacy business), CenterWell Specialty Pharmacy, and other retail pharmacies located within CenterWell Primary Care clinics for brand, generic, specialty drugs, over the counter medications and supplies, as well as hospice pharmacy drugs. \nPrimary Care\nWe operate full-service, value-based senior focused primary care centers in a number of states, including Georgia, Florida, Indiana, Kansas, Kentucky, Louisiana, Mississippi, Missouri, Nevada, North Carolina, South Carolina, Tennessee, Texas, and Virginia staffed by primary care providers and medical specialists with a primary focus on the senior population under our Primary Care Organization, or PCO. PCO operates these clinics primarily under the Conviva Senior Primary Care and CenterWell Senior Primary Care brands. Our primary care subsidiaries operate our medical center business through both employed physicians and care providers, and through third-party management service organizations with whom we contract to arrange for and manage certain clinical services. PCO currently operates 344 primary care clinics and employs approximately 1,000 primary care providers. PCO serves approximately 390,500 patients, primarily under risk sharing arrangements with Humana Medicare Advantage health plans, third-party Medicare Advantage health plans and CMS administered risk sharing arrangements for Original Medicare.\n PCO also operates a Medical Services Organization, or MSO, through Conviva and CenterWell that coordinates medical care for Medicare Advantage beneficiaries across multiple states. This MSO provides resources in care coordination, financial risk management, clinical integration and patient engagement that help physicians improve the patient experience as well as care outcomes. PCO’s MSO collaborates with physicians, medical groups and integrated delivery systems to successfully transition to value-based care by engaging, partnering and offering practical services and solutions.\nIn 2020, our Primary Care Organization entered into a strategic partnership with Welsh, Carson, Anderson & Stowe, or WCAS, to accelerate the expansion of our primary care model. In May 2022, we established a second strategic partnership with WCAS to develop additional centers between 2023 and 2025. As of December 31, 2024, there were 133 primary care clinics operating under the partnership and we have capacity to open or acquire up to approximately 20 additional centers through the existing partnership agreements. For additional information, refer to Note 4 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nHome Solutions \nCenterWell Home Health\nWe operate CenterWell Home Health, one of the nation's largest home health providers, through which we are actively involved in the care management of our customers with the greatest needs via in-home care. CenterWell Home Health has locations in 40 states, providing extensive geographic coverage with approximately 65% overlap with our individual Medicare Advantage membership. Our home solutions geographic scale and clinical breadth provides the opportunity to offer care beyond our health plan members. Through the integration of these home health operations, we are focused on accelerating clinical innovation and the development and roll out of a value-based operating model at scale, more closely aligning incentives to focus on improving patient outcomes and reducing the total cost of care. This is critical to deploying a value-based, advanced home health model at scale that makes it easier for patients and providers to benefit from our full continuum of home-based capabilities, leveraging the best channel to deliver the right care needed at the right time.\n11\nOneHome\nOneHome serves as the convener for the value-based model meeting the needs of health plans by serving their members through a full-risk model for integrated home-based services. OneHome manages a full range of post-acute patient needs, integrating and coordinating with physicians, hospitals and health plans for the provision of home health and infusion services as well as the distribution of durable medical equipment, or DME, at patients’ homes.\nHospice\nOn August 11, 2022, we completed the sale of a 60% interest in Gentiva (formerly Kindred) Hospice, to Clayton, Dubilier & Rice, or CD&R. Upon closing, Gentiva Hospice was restructured into a new stand-alone company. We continue to own approximately 35% minority ownership in Gentiva Hospice operations. For additional information on the sale of Gentiva Hospice, refer to Note 3 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nInsurance Medical Membership\nThe following table summarizes total insurance medical membership (in thousands) at December 31, 2024, by market and product:\nInsurance Medical Membership\nIndividual\nMedicare\nAdvantage\nGroup\nMedicare\nAdvantage\nMedicare\nstand-\nalone PDP\nMedicare Supplement\nState-\nbased\ncontracts and other\nCommercial fully-insured\nCommercial ASO\nMilitary services\nTotal\nPercent\nof Total\nFlorida\n924.8 \n11.3 \n113.2 \n20.2 \n580.2 \n0.3 \n0.1 \n— \n1,650.1 \n10.10 \n%\nTexas\n470.6 \n5.0 \n145.8 \n44.8 \n— \n— \n— \n— \n666.2 \n4.10 \n%\nNorth Carolina\n321.8 \n174.3 \n78.6 \n6.1 \n— \n— \n— \n— \n580.8 \n3.60 \n%\nGeorgia\n338.7 \n2.9 \n67.4 \n14.2 \n— \n— \n— \n— \n423.2 \n2.60 \n%\nKentucky\n132.6 \n74.3 \n200.8 \n13.0 \n148.9 \n— \n3.1 \n— \n572.7 \n3.50 \n%\nOhio\n213.1 \n17.3 \n73.3 \n28.4 \n186.4 \n— \n— \n— \n518.5 \n3.20 \n%\nTennessee\n209.4 \n13.5 \n74.5 \n8.7 \n47.0 \n— \n— \n— \n353.1 \n2.20 \n%\nIllinois\n206.3 \n38.3 \n74.7 \n8.2 \n14.1 \n— \n— \n— \n341.6 \n2.10 \n%\nLouisiana\n212.4 \n10.5 \n41.2 \n3.8 \n148.7 \n— \n— \n— \n416.6 \n2.50 \n%\nCalifornia\n119.3 \n4.2 \n134.8 \n26.9 \n0.1 \n— \n— \n— \n285.3 \n1.70 \n%\nOklahoma\n77.4 \n3.4 \n47.4 \n5.7 \n186.1 \n— \n— \n— \n320.0 \n2.00 \n%\nIndiana\n158.9 \n20.8 \n55.7 \n12.6 \n35.0 \n— \n— \n— \n283.0 \n1.70 \n%\nSouth Carolina\n208.0 \n0.5 \n32.7 \n8.1 \n33.5 \n— \n— \n— \n282.8 \n1.70 \n%\nVirginia\n185.1 \n2.7 \n73.8 \n6.9 \n— \n— \n— \n— \n268.5 \n1.60 \n%\nNew York\n142.1 \n9.7 \n56.2 \n8.0 \n— \n— \n— \n— \n216.0 \n1.30 \n%\nMichigan\n174.5 \n30.2 \n53.0 \n7.2 \n— \n— \n1.6 \n— \n266.5 \n1.60 \n%\nWisconsin\n81.8 \n6.1 \n59.6 \n6.0 \n55.3 \n— \n— \n— \n208.8 \n1.30 \n%\nMississippi\n142.9 \n0.4 \n49.8 \n5.1 \n— \n— \n— \n— \n198.2 \n1.20 \n%\nPennsylvania\n99.0 \n9.7 \n74.3 \n10.2 \n14.2 \n— \n— \n— \n207.4 \n1.30 \n%\nArizona\n131.2 \n0.3 \n48.2 \n7.6 \n— \n— \n— \n— \n187.3 \n1.10 \n%\nTRICARE\n— \n— \n— \n— \n— \n— \n— \n6,009.1 \n6,009.1 \n36.80 \n%\nOthers\n1,111.9 \n110.3 \n733.2 \n125.6 \n10.4 \n— \n— \n— \n2,091.4 \n12.80 \n%\nTotals\n5,661.8 \n545.7 \n2,288.2 \n377.3 \n1,459.9 \n0.3 \n4.8 \n6,009.1 \n16,347.1 \n100.0 \n%\nProvider Arrangements\nWe provide our members with access to health care services through our networks of health care providers whom we employ or with whom we have contracted, including hospitals and other independent facilities such as outpatient surgery centers, primary care providers, specialist physicians, dentists, and providers of ancillary health care services and facilities. These ancillary services and facilities include laboratories, ambulance services, medical \n12\nequipment services, home health agencies, mental health providers, rehabilitation facilities, nursing homes, optical services, and pharmacies. Our membership base and the ability to influence where our members seek care generally enable us to obtain contractual discounts with providers.\nWe use a variety of techniques to provide access to effective and efficient use of health care services for our members. These techniques include the coordination of care for our members, product and benefit designs, hospital inpatient management systems, the use of sophisticated analytics, and enrolling members into various care management programs. The focal point for health care services in many of our HMO networks is the primary care provider who, under contract with us, provides services to our members, and may control utilization of appropriate services by directing or approving hospitalization and referrals to specialists and other providers. Some physicians may have arrangements under which they can earn bonuses when certain target goals relating to the provision of quality patient care are met. We have available care management programs related to complex chronic conditions such as congestive heart failure and coronary artery disease. We also have programs for prenatal and premature infant care, asthma related illness, end stage renal disease, diabetes, cancer, and certain other conditions.\nWe typically contract with hospitals on either (1) a per diem rate, which is an all-inclusive rate per day, (2) a case rate for diagnosis-related groups (DRG), which is an all-inclusive rate per admission, or (3) a discounted charge for inpatient hospital services. Outpatient hospital services generally are contracted at a flat rate by type of service, ambulatory payment classifications, or APCs, or at a discounted charge. APCs are similar to flat rates except multiple services and procedures may be aggregated into one fixed payment. These contracts are often multi-year agreements. Outpatient surgery centers and other ancillary providers typically are contracted at flat rates per service provided or are reimbursed based upon a nationally recognized fee schedule such as the Medicare allowable fee schedule.\nOur contracts with physicians typically are renewed automatically each year, unless either party gives written notice, generally ranging from 90 to 120 days, to the other party of its intent to terminate the arrangement. Most of the physicians in our PPO networks and some of our physicians in our HMO networks are reimbursed based upon a fixed fee schedule, which typically provides for reimbursement based upon a percentage of the standard Medicare allowable fee schedule.\nThe terms of our contracts with hospitals and physicians may also vary between Medicare and Medicaid business. A significant portion of our Medicare network contracts, including those with both hospitals and physicians, are tied to Medicare reimbursement levels and methodologies.\nCapitation\nWe offer providers a continuum of opportunities to increase the integration of care and offer assistance to providers in transitioning from a fee-for-service to a value-based arrangement. These include performance bonuses, shared savings and shared risk relationships. For some of our medical membership, we share risk with providers under capitation contracts where physicians and hospitals accept varying levels of financial risk for a defined set of membership. Under the typical capitation arrangement, we prepay these providers a monthly fixed-fee per member, known as a capitation (per capita) payment, to cover all or a defined portion of the benefits provided to the capitated member.\nWe believe these value-based arrangements represent a key element of our integrated care delivery model at the core of our strategy. Our health plan subsidiaries may enter into these value-based arrangements with third-party providers or our owned provider subsidiaries.\nAt December 31, 2024, approximately 2,361,500 members, or 14.4%, of our medical membership, were covered under shared risk value-based arrangements, which provide all member benefits, including 2,114,900 individual Medicare Advantage members, or 38.0%, of our total individual Medicare Advantage membership. \nPhysicians under capitation arrangements typically have stop loss coverage so that a physician’s financial risk for any single member is limited to a maximum amount on an annual basis. We typically process all claims and measure the financial performance of our capitated providers and require guarantees in certain instances. However, \n13\nwe delegated claim processing functions under capitation arrangements covering approximately 304,400 members, including 303,500 individual Medicare Advantage members, or 14.4%, of the 2,114,900 individual Medicare Advantage members covered under shared risk value-based contracts at December 31, 2024, with the provider assuming substantially all the risk of coordinating the members’ health care benefits. Capitation expense under delegated arrangements for which we have a limited view of the underlying claims experience was approximately $3.6 billion, or 3.6%, of total benefits expense, for the year ended December 31, 2024. We remain financially responsible for health care services to our members in the event our providers fail to provide such services.\nAccreditation Assessment\nOur accreditation assessment program consists of several internal programs, including those that credential providers and those designed to meet the audit standards of federal and state agencies as well as external accreditation standards. We also offer quality and outcome measurement and improvement programs such as the Health Care Effectiveness Data and Information Set, or HEDIS, which is used by employers, government purchasers and the National Committee for Quality Assurance (NCQA) to evaluate health plans based on various criteria, including effectiveness of care and member satisfaction.\nProviders participating in our networks must satisfy specific criteria, including licensing, patient access, office standards, after-hours coverage, and other factors. Most participating hospitals also meet accreditation criteria established by CMS and/or The Joint Commission.\nRecredentialing of participating providers occurs every three years, unless otherwise required by state or federal regulations. Recredentialing of participating providers includes verification of their medical licenses, review of their malpractice liability claims histories, review of their board certifications, if applicable, and review of applicable quality information. A committee composed of a peer group of providers reviews the applications of providers being considered for credentialing and recredentialing.\nWe maintain accreditation for certain of our health plans and/or departments from NCQA, the Accreditation Association for Ambulatory Health Care (AAAHC), and/or URAC.\nNCQA reviews our compliance based on standards for quality improvement, population health management, credentialing, utilization management, network management, and member experience. We have achieved and maintained NCQA health plan accreditation in many of our Medicare and Medicaid markets. Humana’s pharmacy organization is accredited by URAC.\nSales and Marketing\nWe use various methods to market our products, including television, radio, the Internet, telemarketing, wholesale distributors (general agencies)\n \nand direct mailings.\nAt December 31, 2024, we employed approximately 1,100 sales representatives, as well as approximately 2,700 telemarketing representatives who assisted in the marketing of Medicare products, including Medicare Advantage and PDP, and specialty products in our Insurance segment, including making appointments for sales representatives with prospective members. We have a marketing arrangement with Walmart Inc., or Walmart, for our individual Medicare stand-alone PDP offering. We also sell group Medicare Advantage products through large employers. In addition, we market our Medicare and individual specialty products through licensed independent brokers and agents. For our Medicare products, commissions paid to employed sales representatives and independent brokers and agents are based on a per unit commission structure, regulated in structure and amount by CMS. For our individual specialty products, we generally pay brokers a commission based on premiums, with commissions varying by market and premium volume. In addition to a commission based directly on premium volume for sales to particular customers, we also have programs that pay brokers and agents based on other metrics. These include commission bonuses based on sales that attain certain levels or involve particular products. We also pay additional commissions based on aggregate volumes of sales involving multiple customers.\n14\nIn our Insurance segment, we market our specialty products to individuals through their employers or other groups, which typically offer employees or members a selection of specialty products, pay for all or part of the premiums, and make payroll deductions for any premiums payable by the employees. We use licensed independent brokers, independent agents, digital insurance agencies, and employees to sell our specialty products. We pay brokers and agents using the same commission structure described above for our specialty products.\nUnderwriting\nSince 2014, the Patient Protection and Affordability Care Act and The Health Care and Education Reconciliation Act of 2010, which we collectively refer to as the Health Care Reform Law, requires certain group health plans to guarantee issuance and renew coverage without pre-existing condition exclusions or health-status rating adjustments. Accordingly, certain group health plans are not subject to underwriting. Further, underwriting techniques are not employed in connection with our individual Medicare, military services, or Medicaid products because government regulations require us to accept all eligible applicants regardless of their health or medical history.\nCompetition\nThe health benefits industry is highly competitive. Our competitors vary by local market and include other managed care companies, national insurance companies, and other HMOs and PPOs. Many of our competitors have a larger membership base and/or greater financial resources than our health plans in the markets in which we compete. Our ability to sell our products and to retain customers may be influenced by such factors as those described in Part I, Item 1A, \"Risk Factors\" of this Form 10-K.\nGovernment Regulation\nDiverse legislative and regulatory initiatives at both the federal and state levels continue to affect aspects of the nation’s health care system, including the Health Care Reform Law at the federal level and laws in certain states limiting the entry of new providers or services though a certificate of need, or CON, process. \nOur management works proactively to ensure compliance with all governmental laws and regulations affecting our business. We are unable to predict how existing federal or state laws and regulations may be changed or interpreted, what additional laws or regulations affecting our businesses may be enacted or proposed, when and which of the proposed laws will be adopted or what effect any such new laws and regulations will have on our results of operations, financial position, or cash flows.\nFor a description of certain material current activities in the federal and state legislative areas, see Part I, Item 1A, \"Risk Factors\" of this Form 10-K.\nCertain Other Services\nCaptive Insurance Company\nWe bear general business risks associated with operating our Company such as professional and general liability, employee workers’ compensation, cybersecurity, and officer and director errors and omissions risks. Professional and general liability risks may include, for example, medical malpractice claims and disputes with members regarding benefit coverage. We retain certain of these risks through our wholly-owned, captive insurance subsidiary. We reduce exposure to these risks by insuring levels of coverage for losses in excess of our retained limits with a number of third-party insurance companies. We remain liable in the event these insurance companies are unable to pay their portion of the losses.\nCentralized Intercompany Services\nWe provide centralized intercompany services to each of our health plans and to our business segments from our headquarters and service centers. These services include management information systems, product development \n15\nand administration, finance, human resources, accounting, law, public relations, marketing, insurance, purchasing, risk management, internal audit, actuarial, underwriting, claims processing, billing/enrollment, and customer service. Through intercompany service agreements approved, if required, by state regulatory authorities, Humana Inc., our parent company, charges a services fee for reimbursement of certain centralized services provided to its subsidiaries to the extent that Humana Inc. is the service provider.\nHuman Capital Management \nOur associates are essential to our success in delivering on our core strategy, and creating positive healthcare experiences for our members. We are committed to recruiting, developing, and retaining strong and diverse teams. As of December 31, 2024, we had approximately 65,680 associates.\n \nOur Culture, Engagement and Approach to Work \nWe believe that our members’ experience is linked to our associates’ experience and that engaged, productive associates are the key to building a healthy company and a caring environment where our associates go above and beyond for our members, driving innovation, and offering fulfilling experiences that incentivizes them to stay with us over the long-term. We provide opportunities for our associates to add to their personal well-being experiences that go beyond health to enhance their individual need for purpose, belonging and security. With an average tenure  of 7 years at our Company, our associates’ loyalty reflects our culture and commitment to growth. We believe that voluntary turnover rate (VTR) is an important indicator of workforce satisfaction as we strive for our associates to choose us over other opportunities. During 2024, our VTR was 14.4%, representing an increase from 13.4% in 2023. \nWe regularly measure our success and seek opportunities to advance engagement through an Annual Engagement Survey, or AES, and continuous listening campaigns. Continuous listening involves our proactive solicitation, analysis and response to associate feedback throughout the year by using pulse surveys. By regularly surveying samples of our workforce, we are able to continuously assess our effectiveness and act when needed, which in turn helps to strengthen our culture and support associate engagement. We aim to conduct a confidential, third-party administered AES on an annual basis and encourage all of our associates to participate. The AES is an in-depth survey covering eighteen dimensions that align to the Company’s strategy and employee engagement. We aggregate survey results, provide them to our entire associate population and encourage leaders to use the information to create open, honest action plans with their teams to build upon our collective engagement. \nPay and Benefits Philosophy, Compensation and Financial Security\nW\ne believe all of our associates have the right to receive a competitive wage and we are committed to maintaining a pay and benefits philosophy that is market-based and recognizes an associate’s contributions so that we can attract and retain an engaged, talented team. Further, we believe in fostering a fair and inclusive work environment, one where all associates receive equitable pay for their contributions. Each year, we conduct a comprehensive pay equity/gap analysis to identify and address potential pay disparities between associates performing similar work in similar capacities. Our pay and benefits structure is designed to motivate, incentivize and reward our associates, at all levels of the organization, for their skill development, demonstration of our values and performance. While our programs vary by location, associate type and business, they generally include: \n16\nFinancial\n•\nCompetitive base pay, with additional incentive, supplemental, and/or recognition pay\n•\nShort - and long-term disability insurance\n•\nTuition assistance program\n•\n401(k) retirement savings plans with Company match program\n•\nPaid internship \n•\nCharitable gift matching program \n•\nHealth savings account (HSA) and flexible savings account (FSA) contributions \n•\nComprehensive financial well-being programs and support, including an employer-sponsored personal emergency savings account with matching funds from the Company\n•\nLife insurance\nHealth\n•\nMedical, dental and vision benefits\n•\nOn-site health and fitness centers \n•\nSupplemental health benefits\n•\nOn-site health screenings and vaccinations\n•\nLong-term care insurance\n•\nWeekly paid well-being time\n•\nWhole-person well-being and rewards programs and platform \n•\nOn-demand fitness classes, nutritional education through teaching kitchens, and digital coaching apps\n•\nIncentives for engaging in well-being programs\nLife\n•\nPaid time off, paid holidays, paid volunteer time off and jury duty pay\n•\nMental health support, including our robust Employee Assistance Program and Work-Life Services\n•\nAdoption assistance\n•\nPaid parental leave program (6 weeks)\n•\nEmployee discount programs and services \n•\nPaid caregiver time off program (2 weeks)\n•\nHelping hands program\n•\nNursing moms program with on-site lactation rooms \n•\nTransit services\nLearning and Development\n•\nInternal and external learning events \n•\nAccess to degree and certification programs with tuition assistance \nTalent Development and Growth Opportunities\nWe are committed to promoting continuous learning and growth by offering employees a comprehensive range of resources to enhance their skills and advance their careers. Our professional development initiatives ensure employees have access to tools, mentorship and opportunities that enable them to succeed in their current roles and prepare for future growth opportunities, thereby strengthening our organization and driving innovation. We also offer our associates education and certification program assistance through partner organizations, and reduce or eliminate cost barriers to support achievement of their educational and career goals. \nAdditional information related to our human capital management can be found by referencing our Definitive Proxy Statement of the Annual Meeting of Stockholders scheduled to be held on April 17, 2025 appearing under the caption \"Human Capital Management.\" \n17\nInformation About Our Executive Officers\nSet forth below are names and ages of all of our current executive officers as of February 1, 2025, their positions, and the date first elected as an executive officer\n:\nName\nAge\nPosition\nFirst\nElected\nOfficer\n \nJames A. Rechtin\n54\nPresident and Chief Executive Officer, Director\n01/24\n(1)\nVishal Agrawal, M.D.\n50\nChief Strategy and Corporate Development Officer\n12/18\n(2)\nDavid E. Dintenfass\n54\nPresident, Enterprise Growth\n02/24\n(3)\nJohn-Paul W. Felter\n41\nSenior Vice President, Chief Accounting Officer and Controller\n08/22\n(4)\nJapan A. Mehta\n44\nChief Information Officer\n02/25\n(5)\nCeleste M. Mellet\n48\nChief Financial Officer\n01/25\n(6)\nMichelle A. O'Hara\n49\nChief Human Resources Officer\n01/25\n(7)\nGeorge Renaudin II\n56\nPresident, Insurance\n02/23\n(8)\nSanjay K. Shetty, M.D.\n51\nPresident, CenterWell\n04/23\n(9)\nJoseph C. Ventura \n48\nChief Legal Officer \n02/19\n(10)\n(1)\nMr. Rechtin currently serves as Director, President and Chief Executive Officer (Principal Executive Officer), having held these positions since July 1, 2024. Mr. Rechtin was elected President and Chief Operating Officer upon joining the Company in January 2024 and served in that capacity through June 2024. Prior to joining the Company, Mr. Rechtin served as President and CEO at Envision Healthcare, having held that position from 2020 to 2023. Previously, Mr. Rechtin was President of OptumCare in 2019 after serving in multiple senior-level roles at Davita Medical Group from 2014 to 2019. \n(2)\nDr. Agrawal currently serves as Chief Strategy and Corporate Development Officer, having joined the Company in December 2018.  Prior to joining the Company, Dr. Agrawal was Senior Advisor for The Carlyle Group L.P., having held that position from October 2017 to December 2018.  Previously, Dr. Agrawal was President and Chief Growth Officer of Ciox Health, the largest health information exchange and release of information services organization in the U.S. from December of 2015 to October 2018.  Prior to joining Ciox Health, Dr. Agrawal served as President of Harris Healthcare Solutions from January 2013 to December 2015.\n(3)\nMr. Dintenfass currently serves as President, Enterprise Growth, having joined the Company in February 2024. Prior to joining the Company, Mr. Dintenfass had a series of leadership roles at Fidelity Investments from 2015 to 2024 where he most recently served as Executive Vice President, Head of Product and Emerging Segments, leading a P&L portfolio across retail and workplace investing. Mr. Dintenfass also served as Fidelity’s Chief Marketing Officer and Head of Customer Experience Design. Before Fidelity, Mr. Dintenfass spent over five years at Bank of America in a variety of strategy and marketing roles across Consumer and Small Business banking and Merrill Lynch Wealth Management. Earlier in his career, Mr. Dintenfass spent 13 years at Procter & Gamble in global P&L and brand management roles of increasing responsibility. Mr. Dintenfass began his career as a consultant at McKinsey & Company.\n(4)\nMr. Felter currently serves as Senior Vice President, Chief Accounting Officer and Controller, having been elected to this position in August 2022. Before joining the Company, Mr. Felter served as Senior Director - Investment Finance for OneAmerica Financial Partners, Inc. in 2022.  Prior to OneAmerica, Mr. Felter spent nearly 11 years in multiple roles of increasing responsibility at Ernst & Young LLP where he oversaw large audit engagements for public and private entities with a concentration in the health insurance sector.  \n18\n(5)\nMr. Mehta currently serves as Chief Information Officer, having been elected to this position in February 2025. Prior to joining the Company, Mr. Mehta served as Chief Data Officer at Citigroup for six years from 2018 to 2025. Previously, he held the role of CIO for Citi Global Wealth across a mix of client segments. Additionally, he served in the CIO role for Global Consumer Technology in Asia Pacific and Europe. Prior to Citi, Mr. Mehta held technology and digital leadership roles at JPMorgan, Barclays and Verizon.\n(6)\nMs. Mellet currently serves as Chief Financial Officer, having been elected to this position in January 2025.  Prior to joining the Company, Ms. Mellet served as Partner and Chief Financial Officer of Global Infrastructure Partners (GIP) from February 2023 to January 2025.  Prior to GIP, Ms. Mellet served as Chief Financial Officer, Senior Managing Director and an Executive Vice President at Evercore from 2021 to 2023. Before joining Evercore, Ms. Mellet served as Executive Vice President and Chief Financial Officer from 2018 to 2021 and SVP and Deputy Chief Financial Officer from 2017 to 2018 at the Federal National Mortgage Association (Fannie Mae). Before her tenure at Fannie Mae, Ms. Mellet spent more than 18 years at Morgan Stanley, last serving as global treasurer. She was also the head of investor, creditor and counterparty relations.\n(7)\nMs. O’Hara currently serves as Chief Human Resources Officer, having been elected to this position in January 2025. Prior to joining the Company, Ms. O’Hara served as Executive Vice President and Chief Human Resources Officer from 2019 to 2025 at Science Applications International Corporation (SAIC).  Prior to becoming Chief Human Resources Officer in 2019, Ms. O’Hara held various roles of increasing responsibility at SAIC that included talent acquisition, integrated talent management, total rewards and human resources. \n(8)\nMr. Renaudin currently services as President, Insurance, having been elected to this position in October 2024 from his prior role as President, Medicare & Medicaid. Mr. Renaudin joined the Company in April 2004 and since then has held various leadership roles of increasing responsibility, including previously holding the position of President, Medicare.\n(9)\nDr. Shetty currently serves as President, CenterWell, having been elected to this position in April 2023.  Prior to joining the Company, Dr. Shetty worked in health care delivery for nearly 13 years at Steward Health Care System (Steward), most recently serving as President. During his tenure at Steward, Dr. Shetty held various roles of increasing responsibility, leading the large accountable care organization, a multispecialty group practice, and acute care hospitals. Prior to Steward, Dr. Shetty worked as a strategy consultant at Bain & Company, Inc., and practiced as a radiologist and a faculty member at Harvard Medical School.\n(10)\nMr. Ventura currently serves as Chief Legal Officer. He joined the Company in January 2009 and since then has held various positions of increasing responsibility in the Company's Law Department, including most recently, Senior Vice President, Associate General Counsel & Corporate Secretary from July 2017 until February 2019.\nExecutive officers are elected annually by our Board of Directors and serve until their successors are elected or until resignation or removal. There are no family relationships among any of our executive officers.\n19",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nFor discussion of 2022 items and year-over-year comparisons between 2023 and 2022 that are not included in this 2024 Form 10-K, refer to \"Item 7. – Management Discussion and Analysis of Financial Condition and Results of Operations\" found in our Form 10-K for the year ended December 31, 2023, that was filed with the Securities and Exchange Commission on February 15, 2024.\nExecutive Overview\nGeneral \nHumana Inc., headquartered in Louisville, Kentucky, is committed to putting health first – for our teammates, our customers, and our company. Through our Humana insurance services, and our CenterWell health care services, we make it easier for the millions of people we serve to achieve their best health – delivering the care and service they need, when they need it. These efforts are leading to a better quality of life for people with Medicare, Medicaid, families, individuals, military service personnel, and communities at large.\nOur industry relies on two key statistics to measure performance. The benefit ratio, which is computed by taking total benefits expense as a percentage of premiums revenue, represents a statistic used to measure underwriting profitability. The operating cost ratio, which is computed by taking total operating costs, excluding depreciation and amortization, as a percentage of total revenue less investment income, represents a statistic used to measure administrative spending efficiency.\nEmployer Group Commercial Medical Products Business Exit\nIn February 2023, we announced our planned exit from the Employer Group Commercial Medical Products business, which includes all fully insured, self-funded and Federal Employee Health Benefit medical plans, as well as associated wellness and rewards programs. No other Humana health plan offerings are materially affected. Following a strategic review, we determined the Employer Group Commercial Medical Products business was no longer positioned to sustainably meet the needs of commercial members over the long term or support our long-term strategic plans. We anticipate the exit of this line of business to be finalized in the first half of 2025. \nValue Creation Initiatives and Impairment Charges \nIn order to create capacity to fund growth and investment in our Medicare Advantage business and further expansion of our healthcare services capabilities beginning in 2022, we committed to drive additional value for the enterprise through cost saving, productivity initiatives, and value acceleration from previous investments. As a result of these initiatives, we recorded charges of $281 million and $436 million in 2024 and 2023, respectively, primarily within operating costs in the consolidated statements of income. \nThe value creation initiative charges primarily relate to $256 million and $237 million in asset impairments in 2024 and 2023, respectively, as well as $25 million and $199 million in severance charges in connection with workforce optimization in 2024 and 2023, respectively. \nIn addition, we recorded impairment charges of $200 million, relating to indefinite-lived intangible assets, in 2024 and $91 million, including $55 million relating to indefinite-lived intangible assets, in 2023. The indefinite-lived intangible asset impairment charges were included within operating costs in our consolidated statements of income with the remaining impairment charges included within investment income.\nFurther, we recorded severance charges of $70 million in 2023 within operating costs in our consolidated statement of income as a result of our exit from the Employer Group Commercial Medical Products business.\n41\nCOVID-19\nThe emergence and spread of the novel coronavirus, or COVID-19, beginning in the first quarter of 2020 has impacted our business. Initially during periods of increased incidences of COVID-19, a reduction in non-COVID-19 hospital admissions for non-emergent and elective medical care resulted in lower overall healthcare system utilization. At the same time, COVID-19 treatment and testing costs increased utilization. During 2022, we experienced lower overall utilization of the healthcare system than anticipated, as the reduction in COVID-19 utilization following the increased incidence associated with the Omicron variant outpaced the increase in non-COVID-19 utilization. \nThe COVID-19 National Emergency declared in 2020 was terminated on April 10, 2023 and the Public Health Emergency expired on May 11, 2023.\nBusiness Segments\nOur two\n \nreportable segments, Insurance and CenterWell, are based on a combination of the type of health plan customer and adjacent businesses centered on well-being solutions for our health plans and other customers, as described below. Our Chief Executive Officer, the Chief Operating Decision Maker, utilizes these segment groupings and results of each segment, measured by income (loss) from operations, to assess performance and allocate resources primarily during our annual budget process and periodic forecast updates.  For segment financial information, refer to Note 18 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nThe Insurance segment consists of Medicare benefits, marketed to individuals or directly via group Medicare accounts, as well as our contract with CMS to administer the Limited Income Newly Eligible Transition, or LI-NET, prescription drug plan program and contracts with various states to provide Medicaid, dual eligible demonstration, and Long-Term Support Services benefits, which we refer to collectively as our state-based contracts. This segment also includes products consisting of employer group commercial fully-insured medical and specialty health insurance benefits marketed to individuals and employer groups, including dental, vision, and other supplemental health benefits, as well as administrative services only, or ASO. In addition, our Insurance segment includes our Military services business, primarily our T-2017 East Region contract, as well as the operations of our PBM business. \nThe CenterWell segment includes our pharmacy, primary care, and home solutions operations. The segment also includes our strategic partnerships with WCAS to develop and operate senior-focused, payor-agnostic, primary care centers, as well as our minority ownership interest in hospice operations. Services offered by this segment are designed to enhance the overall healthcare experience. These services may lead to lower utilization associated with improved member health and/or lower drug costs. \n Transactions between reportable segments primarily consist of sales of products and services rendered by our CenterWell segment, primarily pharmacy, primary care, and home solutions, to our Insurance segment customers. Intersegment sales and expenses are recorded primarily at fair value and eliminated in consolidation. Members served by our segments often use the same provider networks, enabling us in some instances to obtain more favorable contract terms with providers. Our segments also share indirect costs and assets. As a result, the profitability of each segment is interdependent. We allocate most operating expenses to our segments. Assets and certain corporate income and expenses are not allocated to the segments, including the portion of investment income not supporting segment operations, interest expense on corporate debt, and certain other corporate expenses. These items are managed at a corporate level. These corporate amounts are reported separately from our reportable segments and are included with intersegment eliminations.\nSeasonality\nOne of the product offerings of our Insurance segment is Medicare stand-alone prescription drug plans, or PDP, under the Medicare Part D program. Our quarterly Insurance segment earnings and operating cash flows are impacted by the Medicare Part D benefit design and changes in the composition of our membership. The Medicare \n42\nPart D benefit design results in coverage that varies as a member’s cumulative out-of-pocket costs pass through successive stages of a member’s plan period, which begins annually on January 1 for renewals. These plan designs generally result in us sharing a greater portion of the responsibility for total prescription drug costs in the early stages and less in the latter stages. As a result, the PDP benefit ratio generally decreases as the year progresses. In addition, the number of low income senior members as well as year-over-year changes in the mix of membership in our stand-alone PDP products affects the quarterly benefit ratio pattern. Beginning in 2025, changes to Part D under the Inflation Reduction Act are expected to increase risk-adjusted direct subsidies and cap members' out-of-pocket costs and as a result significantly impact seasonality and cost trends.\nThe Insurance segment also experiences seasonality in the commercial fully-insured product offering. The effect on the Insurance segment benefit ratio is opposite of the Medicare stand-alone PDP impact, with the benefit ratio increasing as fully-insured members progress through their annual deductible and maximum out-of-pocket expenses. The Employer Group Commercial Fully-Insured business increased the Insurance segment benefit ratio by 10 basis points for the year ended December 31, 2024 and did not impact the Insurance segment benefit ratio for the year ended December 31, 2023.\nThe Insurance segment also experiences seasonality in the operating cost ratio as a result of costs incurred in the second half of the year associated with the Medicare marketing season. The Insurance segment may experience adverse impacts in the operating cost ratio as a result of our Employer Group Commercial Medical Products exit. The Employer Group Commercial Fully-Insured business did not impact the Insurance segment operating cost ratio for the year-ended December 31, 2024 and increased the Insurance segment operating cost ratio by 30 basis points for the year ended December 31, 2023.\nHighlights \n•\nOur strategy offers our members affordable health care combined with a positive consumer experience in growing markets. At the core of this strategy is our integrated care delivery model, which unites quality care, high member engagement, and sophisticated data analytics. Our approach to primary, physician-directed care for our members aims to provide quality care that is consistent, integrated, cost-effective, and member-focused, provided by both employed physicians and physicians with network contract arrangements. The model is designed to improve health outcomes and affordability for individuals and for the health system as a whole, while offering our members a simple, seamless healthcare experience. We believe this strategy is positioning us for long-term growth in both membership and earnings. We offer providers a continuum of opportunities to increase the integration of care and offer assistance to providers in transitioning from a fee-for-service to a value-based arrangement. These include performance bonuses, shared savings and shared risk relationships. At December 31, 2024, approximately 3,994,300 members, or 71%, of our individual Medicare Advantage members were in value-based relationships under our integrated care delivery model, as compared to 3,764,300 members, or 70%, at December 31, 2023.  \n•\nNet income attributable to Humana was $1.2 billion, or $9.98 per diluted common share, and $2.5 billion, or $20.00 per diluted common share, in  2024 and 2023, respectively. This comparison was significantly impacted by put/call valuation adjustments associated with non-consolidating minority interest investments, charges associated with value creation initiatives, transaction and integration costs, impairment charges and an accrual related to certain anticipated litigation expenses. The impact of these adjustments to our consolidated income before income taxes and equity in net earnings and diluted earnings per common share was as follows for the 2024 and 2023 periods:\n43\n2024\n2023\n(in millions)\nConsolidated income before income taxes and equity in net losses:\nPut/call valuation adjustments associated with our non-consolidating minority interest investments\n$\n296 \n$\n320 \nTransaction and integration costs\n— \n(48)\nAccrued charge related to certain anticipated litigation expenses\n— \n105 \nValue creation initiatives\n281 \n436 \nImpairment charges\n200 \n91 \nTotal\n$\n777 \n$\n904 \n2024\n2023\nDiluted earnings per common share:\nPut/call valuation adjustments associated with our non-consolidating minority interest investments\n$\n2.45 \n$\n2.57 \nTransaction and integration costs\n— \n(0.38)\nAccrued charge related to certain anticipated litigation expenses\n— \n0.84 \nValue creation initiatives\n2.33 \n3.50 \nImpairment charges\n1.65 \n0.73 \nNet tax impact of transactions\n(1.50)\n(1.67)\nTotal\n$\n4.93 \n$\n5.59 \n44\nRegulatory Environment\nWe are and will continue to be regularly subject to new laws and regulations, changes to existing laws and regulations, and judicial determinations that impact the interpretation and applicability of those laws and regulations. The Health Care Reform Law, the Families First Act, the CARES Act, and the Inflation Reduction Act, and related regulations, are examples of laws which have\n \nenacted significant reforms to various aspects of the U.S. health insurance industry, including, among others, mandated coverage requirements, mandated benefits and guarantee issuance associated with insurance products, rebates to policyholders based on minimum benefit ratios, adjustments to Medicare Advantage premiums, the establishment of federally facilitated or state-based exchanges coupled with programs designed to spread risk among insurers, and the introduction of plan designs based on set actuarial values, and changes to the Part D prescription drug benefit design\n.\nIt is reasonably possible that these laws and regulations, as well as other current or future legislative, judicial or regulatory changes including restrictions on our ability to manage our provider network, manage and sell our products, or otherwise operate our business, or restrictions on profitability, including reviews by regulatory bodies that may compare our Medicare Advantage profitability to our non-Medicare Advantage business profitability, or compare the profitability of various products within our Medicare Advantage business, and require that they remain within certain ranges of each other, increases in member benefits or changes to member eligibility criteria without corresponding increases in premium payments to us, further restrictions on service arrangements and fee payments between intercompany or vertically-integrated assets, increases in regulation of our prescription drug benefit businesses, or changes to the Part D prescription drug benefit design (and uncertainty arising from the implementation of these changes) in the aggregate may have a material adverse effect on our results of operations (including restricting revenue, enrollment and premium growth in certain products and market segments, restricting our ability to expand into new markets, increasing our medical and operating costs, further lowering our Medicare payment rates and increasing our expenses associated with assessments); our financial position (including our ability to maintain the value of our goodwill); and our cash flows.\nWe intend for the discussion of our financial condition and results of operations that follows to assist in the understanding of our financial statements and related changes in certain key items in those financial statements from year to year, including the primary factors that accounted for those changes. Transactions between reportable segments primarily consist of sales of products and services rendered by our CenterWell segment, primarily pharmacy, primary care, and home solutions, to our Insurance segment customers and are described in Note 18 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\n45\nComparison of Results of Operations for 2024 and 2023 \nThe following discussion primarily details our results of operations for the year ended December 31, 2024, or the 2024 period, and the year ended December 31, 2023, or the 2023 period.\nConsolidated\n \n \nChange\n \n2024\n2023\nDollars\nPercentage\n \n(dollars in millions, except per\ncommon share results)\n \nRevenues:\nInsurance premiums\n$\n112,104 \n$\n101,272 \n$\n10,832 \n10.7 \n%\nServices:\nInsurance\n966 \n1,000 \n(34)\n(3.4)\n%\nCenterWell\n3,465 \n3,033 \n432 \n14.2 \n%\nTotal services revenue\n4,431 \n4,033 \n398 \n9.9 \n%\nInvestment income\n1,226 \n1,069 \n157 \n14.7 \n%\nTotal revenues\n117,761 \n106,374 \n11,387 \n10.7 \n%\nOperating expenses:\nBenefits\n100,664 \n88,394 \n12,270 \n13.9 \n%\nOperating costs\n13,696 \n13,188 \n508 \n3.9 \n%\nDepreciation and amortization\n839 \n779 \n60 \n7.7 \n%\nTotal operating expenses\n115,199 \n102,361 \n12,838 \n12.5 \n%\nIncome from operations\n2,562 \n4,013 \n(1,451)\n(36.2)\n%\nInterest expense\n660 \n493 \n167 \n33.9 \n%\nOther expense, net\n181 \n137 \n44 \n32.1 \n%\nIncome before income taxes and equity in net losses\n1,721 \n3,383 \n(1,662)\n(49.1)\n%\nProvision for income taxes\n413 \n836 \n(423)\n(50.6)\n%\nEquity in net losses\n(94)\n(63)\n31 \n49.2 \n%\nNet income\n$\n1,214 \n$\n2,484 \n$\n(1,270)\n(51.1)\n%\nDiluted earnings per common share\n$\n9.98 \n$\n20.00 \n$\n(10.02)\n(50.1)\n%\nBenefit ratio (a)\n89.8 \n%\n87.3 \n%\n2.5 \n%\nOperating cost ratio (b)\n11.8 \n%\n12.5 \n%\n(0.7)\n%\nEffective tax rate\n25.5 \n%\n25.2 \n%\n0.3 \n%\n(a)\nRepresents total benefits expense as a percentage of premiums revenue.\n(b)\nRepresents total operating costs, excluding depreciation and amortization, as a percentage of total revenues less investment income.\n46\n \nPremiums Revenue\n    Consolidated premiums revenue increased $10.8 billion, or 10.7%, from $101.3 billion in the 2023 period to $112.1 billion in the 2024 period primarily due to higher per member Medicare premiums as well as Medicare Advantage and state-based contracts membership growth. These factors were partially offset by the continued decline in stand-alone PDP membership, as well as a decline in membership in our group commercial medical business as a result of our decision to exit the business.\nServices Revenue\nConsolidated services revenue increased $0.4 billion, or 9.9%, from $4.0 billion in the 2023 period to $4.4 billion in the 2024 period primarily due to higher revenues associated with growth in the primary care business, partially offset by the impact of the v28 risk model revision.\nInvestment Income\nInvestment income increased $0.16 billion, or 14.7%, from $1.07 billion in the 2023 period to $1.23 billion in the 2024 period primarily due to an increase in interest income on our debt securities.\nBenefits Expense\nConsolidated benefits expense increased $12.3 billion, or 13.9%, from $88.4 billion in the 2023 period to $100.7 billion in the 2024 period. The consolidated benefit ratio increased 250 basis points from 87.3% in the 2023 period to 89.8% in the 2024 period primarily due to the continued impact of elevated Medicare Advantage and state-based contracts medical cost trends in the 2024 period as well as lower favorable prior period medical claims reserve development. These factors were partially offset by the impact of the pricing and benefit design of our 2024 Medicare Advantage products, which included a reduction in member benefits in response to the net impact of the 2024 final rate notice and the initial emergence of increased medical cost trends in 2023. Further, the year-over-year comparison continues to reflect a shift in line of business mix, with growth in Medicare Advantage and state-based contracts and other membership, which can carry a higher benefit ratio.   \nConsolidated benefits expense included $701 million of favorable prior-period medical claims reserve development in the 2024 period and $872 million of favorable prior-period medical claims reserve development in the 2023 period. Prior-period medical claims reserve development decreased the consolidated benefit ratio by approximately 60 basis points in the 2024 period and decreased the consolidated benefit ratio by approximately 90 basis points in the 2023 period.\nOperating Costs\nOur segments incur both direct and shared indirect operating costs. We allocate the indirect costs shared by the segments primarily as a function of revenues. As a result, the profitability of each segment is interdependent.\nConsolidated operating costs increased $0.5 billion, or 3.9%, from $13.2 billion in the 2023 period to $13.7 billion in the 2024 period. The consolidated operating cost ratio decreased 70 basis points from 12.5% in the 2023 period to 11.8% in the 2024 period. The ratio decrease was primarily due to scale efficiencies associated with growth in individual Medicare Advantage membership, administrative cost efficiencies resulting from our value creation initiatives, a lesser impact of commission expense for brokers in the 2024 period compared to the 2023 period as a result of significant individual Medicare Advantage membership growth in 2023, a lesser impact from charges related to value creation initiatives in the 2024 period compared to the 2023 period, as well as the impact of the accrued charge related to certain anticipated litigation expenses in the 2023 period. These factors were partially offset by significantly reduced compensation accruals in the 2023 period related to the annual incentive plan offered to employees across all levels of the company as our 2023 performance was negatively impacted by higher-than-anticipated Medicare Advantage utilization trends, as well as higher impairment costs in the 2024 period.\n47\nDepreciation and Amortization\nDepreciation and amortization increased $60 million, or 7.7%, from $779 million in the 2023 period to $839 million in the 2024 period primarily due to capital expenditures.\nInterest Expense\nInterest expense increased $167 million, or 33.9%, from $493 million in the 2023 period to $660 million in the 2024 period primarily due to an increase in interest rates and higher average debt balances. \nIncome Taxes\nOur effective tax rate was 25.5% and 25.2% for the 2024 period and 2023 period, respectively. The year-over-year increase in the effective income tax rate is primarily due to a change in the mix of current year earnings between our Insurance segment and our CenterWell health services segment, as our CenterWell health services segment is subject to a higher effective tax rate than our Insurance segment. For a complete reconciliation of the federal statutory rate to the effective tax rate, refer to Note 12 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\n48\nInsurance Segment\n \nChange\n \n2024\n2023\nMembers\n%\nMembership:\nIndividual Medicare Advantage\n5,661,800 \n5,408,900 \n252,900 \n4.7 \n%\nGroup Medicare Advantage\n545,700 \n509,600 \n36,100 \n7.1 \n%\nMedicare stand-alone PDP\n2,288,200 \n2,849,100 \n(560,900)\n(19.7)\n%\nTotal Medicare\n8,495,700 \n8,767,600 \n(271,900)\n(3.1)\n%\nMedicare Supplement\n377,300 \n307,200 \n70,100 \n22.8 \n%\nCommercial fully-insured\n300 \n338,700 \n(338,400)\n(99.9)\n%\nState-based contracts and other\n1,459,900 \n1,228,800 \n231,100 \n18.8 \n%\nMilitary services\n6,009,100 \n5,960,200 \n48,900 \n0.8 \n%\nCommercial ASO\n4,800 \n255,300 \n(250,500)\n(98.1)\n%\nTotal Medical Membership\n16,347,100 \n16,857,800 \n(510,700)\n(3.0)\n%\nTotal Specialty Membership\n4,562,000 \n4,868,300 \n(306,300)\n(6.3)\n%\n \n \nChange\n \n2024\n2023\n$\n%\n \n(in millions)\nPremiums and Services Revenue:\nPremiums:\nIndividual Medicare Advantage\n$\n88,019 \n$\n78,837 \n$\n9,182 \n11.6 \n%\nGroup Medicare Advantage\n7,731 \n6,869 \n862 \n12.5 \n%\nMedicare stand-alone PDP\n3,137 \n2,189 \n948 \n43.3 \n%\nTotal Medicare\n98,887 \n87,895 \n10,992 \n12.5 \n%\nCommercial fully-insured\n501 \n3,527 \n(3,026)\n(85.8)\n%\nSpecialty benefits\n955 \n1,007 \n(52)\n(5.2)\n%\nMedicare Supplement\n846 \n735 \n111 \n15.1 \n%\nState-based contracts and other\n10,915 \n8,108 \n2,807 \n34.6 \n%\nPremiums revenue\n112,104 \n101,272 \n10,832 \n10.7 \n%\nCommercial ASO\n50 \n237 \n(187)\n(78.9)\n%\nMilitary services and other\n916 \n763 \n153 \n20.1 \n%\nServices revenue\n966 \n1,000 \n(34)\n(3.4)\n%\nTotal external revenues\n$\n113,070 \n$\n102,272 \n$\n10,798 \n10.6 \n%\nIncome from operations\n$\n1,289 \n$\n2,654 \n$\n(1,365)\n(51.4)\n%\nBenefit ratio\n90.4 \n%\n88.0 \n%\n2.4 \n%\nOperating cost ratio\n9.2 \n%\n10.2 \n%\n(1.0)\n%\nIncome from operations\nInsurance segment income from operations decreased $1.4 billion, or 51.4%, from $2.6 billion in the 2023 period to $1.3 billion in the 2024 period primarily due to the same factors impacting the segment's higher benefit ratio partially offset by the impact of  the lower operating cost ratio as more fully described below.\n49\nEnrollment\nIndividual Medicare Advantage membership increased \n252,900\n members, or 4.7%, from 5,408,900 members as of December 31, 2023 to 5,661,800 members as of December 31, 2024 primarily due to membership additions associated with the 2024 Annual Election Period, or AEP. \n I\nndividual Medicare Advantage membership includes 937,100 D-SNP members as of December 31, 2024, a net increase of 65,800 D-SNP members, or 7.6%, from 871,300 members as of December 31, 2023. For the full year 2025, we anticipate net membership decline in our individual Medicare Advantage offerings of approximately 550,000 members. \nGroup Medicare Advantage mem\nbership increased 36,100 members, or 7.1%, from 509,600 members as of December 31, 2023 to 545,700 members as of December 31, 2024 primarily due to growth in small and medium group accounts.\n \nFor the full year 2025, we anticipate net membership growth in our group Medicare Advantage offerings to be relatively flat.\nMedic\nare stand-alone PDP membership decreased 560,900 members, or \n19.7%\n, from 2,849,100 members as of \nDecember 31, 2023\n to 2,288,200 members as of \nDecember 31, 2024 primarily due to continued intensified competition for Medicare stand-alone PDP offerings. For the full year 2025, we anticipate net membership growth in our Medicare stand-alone PDP offerings of approximately 200,000 members. \nState-based contracts and other \nmembership increased 231,100 members, or 18.8%, from 1,228,800 members as of \nDecember 31, 2023\n to 1,459,900 members as of \nDecember 31, 2024 reflecting the impact of membership additions associated with the implementation of new contracts partially offset with membership loss as a result of the public health of emergency unwind. For the full year 2025, we anticipate net membership growth in our state-based contracts of approximately 175,000 to 250,000 members.\nSpecialty membership decreased 306,300 members, or 6.3%, from 4,868,300 members as of December 31, 2023 to 4,562,000 members as of December 31, 2024 primarily due to non-renewal of dental and vision plans as a result of exit from the Employer Group Commercial Medical Products business. \nThe decrease in commercial fully-insured and ASO membership as of December 31, 2024 compared to December 31, 2023 is due to our exit of the Employer Group Commercial Medical Products business.\nPremiums revenue\nInsurance segment premiums revenue increased $10.8 billion, or 10.7%, from $101.3 billion in the 2023 period to $112.1 billion in the 2024 period primarily due to higher per member Medicare premiums as well as Medicare Advantage and state-based contracts membership growth. These factors were partially offset by the continued decline in stand-alone PDP membership, as well as a decline in membership in our group commercial medical business as a result of our decision to exit the business.\nServices revenue\nInsurance segment services revenue decreased $34 million, or 3.4%, from $1.0 billion in the 2023 period to $966 million in the 2024 period.\nBenefits expense\nThe Insurance segment benefit ratio increased 240 basis points from 88.0% in the 2023 period to 90.4% in the 2024 period primarily due to the continued impact of elevated Medicare Advantage and state-based contracts medical cost trends in the 2024 period as well as lower favorable prior period medical claims reserve development. These factors were partially offset by the impact of the pricing and benefit design of our 2024 Medicare Advantage products, which included a reduction in member benefits in response to the net impact of the 2024 final rate notice and the initial emergence of increased medical cost trends in 2023. Further, the year-over-year comparison continues to reflect a shift in line of business mix, with growth in Medicare Advantage and state-based contracts and other membership, which can carry a higher benefit ratio. \n50\nThe Insurance segment benefits expense included $701 million of favorable prior-period medical claims reserve development in the 2024 period and $872 million of favorable prior-period medical claims reserve development in the 2023 period. Prior-period medical claims reserve development decreased the Insurance segment benefit ratio by approximately 60 basis points in the 2024 period and decreased the Insurance segment benefit ratio by approximately 90 basis points in the 2023 period.\nOperating costs\nThe Insurance segment operating cost ratio decreased 100 basis points from 10.2% in the 2023 period to 9.2% in the 2024 period primarily due to scale efficiencies associated with growth in individual Medicare Advantage membership, administrative cost efficiencies resulting from our value creation initiatives, a lesser impact of commission expense for brokers in the 2024 period compared to the 2023 period as a result of significant individual Medicare Advantage membership growth in 2023, as well as the impact of the accrued charge related to certain anticipated litigation expenses included in the 2023 period. These factors were partially offset by significantly reduced compensation accruals in the 2023 period.\n51\nCenterWell Segment\n \n \nChange\n \n2024\n2023\nDollars\nPercentage\n \n(in millions)\n \nRevenues:\nServices:\nHome solutions\n$\n1,313 \n$\n1,342 \n$\n(29)\n(2.2)\n%\nPharmacy solutions\n904 \n849 \n55 \n6.5 \n%\nPrimary care\n1,248 \n842 \n406 \n48.2 \n%\nTotal external revenues\n3,465 \n3,033 \n432 \n14.2 \n%\nIntersegment revenues:\nHome solutions\n2,050 \n1,589 \n461 \n29.0 \n%\nPharmacy solutions\n10,724 \n10,451 \n273 \n2.6 \n%\nPrimary care\n3,697 \n3,332 \n365 \n11.0 \n%\nIntersegment revenues\n16,471 \n15,372 \n1,099 \n7.1 \n%\nTotal revenues\n$\n19,936 \n18,405 \n1,531 \n8.3 \n%\nIncome from operations\n$\n1,329 \n$\n1,404 \n$\n(75)\n(5.3)\n%\nOperating cost ratio\n92.2 \n%\n91.2 \n%\n1.0 \n%\nIncome from operations\nCenterWell income from operations decreased $0.1 billion, or 5.3%, from $1.4 billion in the 2023 period to $1.3 billion in the 2024 period primarily due to the same factors impacting the segment's higher operating cost ratio as more fully described below.\nServices revenue\nCenterWell services revenue increased $0.4 billion, or 14.2%, from $3.0 billion in the 2023 period to $3.5 billion in the 2024 period primarily due to higher revenues associated with growth in the primary care business, partially offset by the impact of the v28 risk model revision.\nIntersegment revenues\nCenterWell intersegment revenues increased $1.1 billion, or 7.1%, from $15.4 billion in the 2023 period to $16.5 billion in the 2024 period primarily due to greater intersegment revenues associated with the home solutions business in the 2024 period as compared to the 2023 period as a result of the expansion of services to Humana members under value-based contracts, an increase in pharmacy solutions revenues resulting from growth in the specialty pharmacy business, driven by increased penetration of Humana health plan members, as well as payor agnostic consumers, and higher revenues associated with growth in the primary care business, partially offset by the impact of the v28 risk model revision.\nOperating costs\nThe CenterWell segment operating cost ratio increased 100 basis points from 91.2% in the 2023 period to 92.2% in the 2024 period primarily due to the unfavorable impact of the v28 risk model revision to the primary care business and the impact of significantly reduced compensation accruals in the 2023 period, partially offset by administrative cost efficiencies resulting from our value creation initiatives and positive prior-period medical claims reserve development within the Primary Care Organization.\n52\nLiquidity\nHistorically, our primary sources of cash have included receipts of premiums, services revenue, and investment and other income, as well as proceeds from the sale or maturity of our investment securities, and borrowings. Our primary uses of cash historically have included disbursements for claims payments, operating costs, interest on borrowings, taxes, purchases of investment securities, acquisitions, capital expenditures, repayments on borrowings, dividends, and share repurchases. As premiums generally are collected in advance of claim payments by a period of up to several months, our business normally should produce positive cash flows during periods of increasing premiums and enrollment. Conversely, cash flows would be negatively impacted during periods of decreasing premiums and enrollment. From period to period, our cash flows may also be affected by the timing of working capital items including premiums receivable, benefits payable, and other receivables and payables. Our cash flows are impacted by the timing of payments to and receipts from CMS associated with Medicare Part D subsidies for which we do not assume risk. The use of cash flows may be limited by regulatory requirements of state departments of insurance (or comparable state regulators) which require, among other items, that our regulated subsidiaries maintain minimum levels of capital and seek approval before paying dividends from the subsidiaries to the parent. Our use of cash flows derived from our non-insurance subsidiaries, such as in our CenterWell segment, is generally not restricted by state departments of insurance (or comparable state regulators).\nFor additional information on our liquidity risk, please refer to Part I, Item 1A, \"Risk Factors\" of this Form 10-K.\nCash and cash equivalents decreased to $2.2 billion at December 31, 2024 from $4.7 billion at December 31, 2023. The change in cash and cash equivalents for the years ended December 31, 2024, 2023 and 2022 is summarized as follows:\n2024\n2023\n2022\n \n(in millions)\nNet cash provided by operating activities\n$\n2,966 \n$\n3,981 \n$\n4,587 \nNet cash used in investing activities\n(2,952)\n(3,492)\n(1,006)\nNet cash used in financing activities\n(2,487)\n(856)\n(1,914)\n(Decrease) increase in cash and cash equivalents\n$\n(2,473)\n$\n(367)\n$\n1,667 \n53\nCash Flow from Operating Activities\nCash flows provided by operations of $3.0 billion in the 2024 period decreased $1.0 billion from cash flows provided by operations of $4.0 billion in the 2023 period primarily due to lower earnings in the 2024 period compared to the 2023 period, partially offset by the favorable impact of working capital changes.\nThe most significant drivers of changes in our working capital are typically the timing of payments of benefits expense and receipts for premiums. Benefits expense includes claim payments, capitation payments, pharmacy costs net of rebates, allocations of certain centralized expenses and various other costs incurred to provide health insurance coverage to members, as well as estimates of future payments to hospitals and others for medical care and other supplemental benefits provided on or prior to the balance sheet date. For additional information regarding our benefits payable and benefits expense recognition, refer to Note 2 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nThe detail of total net receivables was as follows at December 31, 2024, 2023 and 2022:\n \n \n \n \nChange\n \n2024\n2023\n2022\n2024\n2023\n \n(in millions)\nMedicare\n$\n1,745 \n$\n1,426 \n$\n1,260 \n$\n319 \n$\n166 \nState-based contracts\n614 \n215 \n65 \n399 \n150 \nMilitary services\n180 \n148 \n101 \n32 \n47 \nOther\n263 \n334 \n318 \n(71)\n16 \nAllowance for doubtful accounts\n(98)\n(88)\n(70)\n(10)\n(18)\nTotal net receivables\n$\n2,704 \n$\n2,035 \n$\n1,674 \n669 \n361 \nReconciliation to cash flow statement:\nReceivables acquired\n— \n(24)\nChange in receivables per cash flow statement\n$\n669 \n$\n337 \n The changes in Medicare receivables for both the 2024 period and the 2023 period reflect individual Medicare Advantage membership growth and the typical pattern caused by the timing of accruals and related collections associated with the CMS risk-adjustment model. The increase in State-based contracts receivables for the 2024 and 2023 periods is primarily related to expansion to various states.\nCash Flow from Investing Activities\nDuring the 2022 period, we completed the sale of a 60% interest of Gentiva Hospice to CD&R for cash proceeds of approximately \n$2.7 billion\n, net of cash disposed, including debt repayments from Gentiva Hospice to Humana of $1.9 billion. In connection with the sale we recognized a pre-tax gain, net of transaction costs, of \n$237 million\n \nwhich was reported as a gain on sale of Gentiva Hospice in the accompanying consolidated statement of income for the year ended December 31, 2022.\nDuring the 2024, 2023 and 2022 periods, we acquired various businesses for approximately $89 million,  $233 million and $337 million, respectively, net of cash and cash equivalents received.\nOur ongoing capital expenditures primarily relate to our information technology initiatives, support of services in our primary care operations including medical and administrative facility improvements necessary for activities such as the provision of care to members, claims processing, billing and collections, wellness solutions, care coordination, regulatory compliance and customer service. Total net capital expenditures, excluding acquisitions, were $568 million, $794 million and $1.1 billion in the 2024, 2023 and 2022 periods, respectively. \nNet purchases of investment securities were $2.2 billion, $2.5 billion and $2.3 billion in the 2024, 2023 and 2022 periods, respectively. \n54\nCash Flow from Financing Activities\nOur financing cash flows are significantly impacted by the timing of claims payments and the related receipts from CMS associated with Medicare Part D claim subsidies for which we do not assume risk. Monthly prospective payments from CMS for reinsurance and low-income cost subsidies are based on assumptions submitted with our annual bid. Settlement of the reinsurance and low-income cost subsidies is based on a reconciliation made approximately 9 months after the close of each calendar year. Claim payments were higher than receipts from CMS associated with Medicare Part D claim subsidies for which we do not assume risk by $1.8 billion in the 2024 period and receipts from CMS associated with Medicare Part D claim subsidies for which we do not assume risk were higher than claim payments by $0.8 billion and $2 billion in the 2023 and 2022 periods, respectively. Our net receivable from CMS for subsidies and brand name prescription drug discounts was $0.5 billion at December 31, 2024 compared to a net payable of $1.3 billion at December 31, 2023. \nUnder our administrative services only TRICARE contract, health care costs payments for which we do not assume risk exceeded reimbursements from the federal government by $92 million in the 2024 period and reimbursements from the federal government exceeded health care costs payments for which we do not assume risk by $57 million and $25 million in the 2023 and 2022 periods, respectively.\n In March 2024, we issued $1.3 billion of 5.375% unsecured senior notes due April 15, 2031 and $1.0 billion of 5.750% unsecured senior notes due April 15, 2054. Our net proceeds, reduced for the underwriters' discounts and commissions paid, were $2.2 billion. We used the net proceeds for general corporate purposes, which included the repayment of existing indebtedness, including borrowings under our commercial paper program.\nIn November 2023, we issued $500 million of 5.750% unsecured senior notes due December 1, 2028 and $850 million of 5.950% unsecured senior notes due March 15, 2034. Our net proceeds, reduced for the underwriters' discounts and commissions paid, were $1.3 billion. \nIn March 2023, we issued $500 million of 5.700% unsecured senior notes due March 13, 2026 and $750 million of 5.500% unsecured senior notes due March 15, 2053. Our net proceeds, reduced for the underwriters' discounts and commissions paid, were $1.2 billion. We used the net proceeds to repay outstanding amounts under our $500 million Delayed Draw Term Loan. The remaining net proceeds were used for general corporate purposes, which included the repayment of existing indebtedness, including borrowings under our commercial paper program.\nIn November 2022, we issued $500 million of 5.750% unsecured senior notes due March 1, 2028 and $750 million of 5.875% unsecured senior notes due March 1, 2033. Our net proceeds, reduced for the underwriters' discounts and commissions paid, were $1.2 billion. \nIn March 2022, we issued $750 million of 3.700% unsecured senior notes due March 23, 2029. Our net proceeds, reduced for the underwriters' discounts and commissions paid, were $744 million. \nWe repaid $600 million aggregate principal amount of our 3.150% senior notes due on their maturity date of December 1, 2022 and $400 million aggregate principal amount of our 2.900% senior notes due on their maturity date of December 15, 2022. \nIn 2024, we entered into a securities lending program where we loan certain investment securities for short periods of time in exchange for collateral. We also entered into an uncommitted receivables purchase facility under which certain pharmaceutical rebate receivables may be sold on a non-recourse basis to a financial institution. For the year ended December 31, 2024, the securities lending program and uncommitted receivables purchase facility  provided net proceeds of $418 million and $123 million, respectively. \nIn November 2024, we repaid our $500 million 5.700% unsecured senior notes due March 13, 2026.\nIn August 2023, we entered into a Rule 10b5-1 Repurchase Plan to repurchase a portion of our $750 million aggregate principal amount of 1.350% senior notes maturing in February 2027, our $600 million aggregate principal amount of 3.950% senior notes maturing in March 2027, our $750 million aggregate principal amount of 3.700% senior notes maturing in March 2029, and our $500 million aggregate principal amount of 3.125% senior notes \n55\nmaturing in August 2029 during the period beginning on August 7, 2023 and ending on November 15, 2023. For the year ended December 31, 2023, we repurchased $339 million principal amount of these senior notes for approximately $310 million cash.\nIn March 2023, we entered into a Rule 10b5-1 Repurchase Plan to repurchase a portion of our $1.5 billion aggregate principal amount of 0.650% senior notes maturing in August 2023 and our $600 million aggregate principal amount of 3.850% senior notes maturing in October 2024 during the period beginning on March 13, 2023 and ending on July 21, 2023. For the year ended December 31, 2023, we repurchased $361 million principal amount of these senior notes for approximately $358 million cash. We repaid the remaining $1.2 billion aggregate principal amount of our 0.650% senior notes due on their maturity date of August 3, 2023. We repaid the remaining $559 million aggregate principal amount of our 3.850% senior notes on their maturity date of October 1, 2024.\nWe entered into a commercial paper program in October 2014. Net repayments from issuance of commercial paper were $907 million in 2024 and the maximum principal amount outstanding at any one time during 2024 was $2.7 billion. Net proceeds from the issuance of commercial paper were $211 million in 2023 and the maximum principal amount outstanding at any one time during 2023 was $3.3 billion. Net repayments from issuance of commercial paper were $376 million in 2022 and the maximum principal amount outstanding at any one time during 2022 was $1.5 billion.\nWe received a short-term cash advance of $100 million from FHLB with certain of our marketable securities as collateral and subsequently repaid the outstanding balance in December 2023. \nIn August 2022, we repaid the $2.0 billion October 2021 Term Loan Agreement without a prepayment penalty due.\n We repurchased common shares for $0.8 billion, $1.6 billion and $2.1 billion in 2024, 2023 and 2022, respectively, under share repurchase plans authorized by the Board of Directors and in connection with employee stock plans. \nWe paid dividends to stockholders of $431 million in 2024, $431 million in 2023, and $392 million in 2022.\nFuture Sources and Uses of Liquidity\nDividends\nFor a detailed discussion of dividends to stockholders, please refer to Note 16 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nStock Repurchases\nFor a detailed discussion of stock repurchases, please refer to Note 16 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nDebt\nFor a detailed discussion of our debt, including our senior notes, term loans, revolving credit agreements, commercial paper program and other short-term borrowings, please refer to Note 13 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nAcquisitions & Divestitures\nFor a detailed discussion regarding acquisitions and divestitures, refer to Note 3 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\n56\nLiquidity Requirements\nWe believe our cash balances, investment securities, operating cash flows, and funds available under our credit agreement and our commercial paper program or from other public or private financing sources, taken together, provide adequate resources to fund ongoing operating and regulatory requirements, acquisitions, future expansion opportunities, and capital expenditures for at least the next twelve months, as well as to refinance or repay debt, and repurchase shares.\nAdverse changes in our credit rating may increase the rate of interest we pay and may impact the amount of credit available to us in the future. Our investment-grade credit rating at December 31, 2024 was BBB according to Standard & Poor’s Rating Services, or S&P, and Baa2 according to Moody’s Investors Services, Inc., or Moody’s. A downgrade by S&P to BB+ or by Moody’s to Ba1 triggers an interest rate increase of 25 basis points with respect to $250 million of our senior notes. Successive one notch downgrades increase the interest rate an additional 25 basis points, or annual interest expense by $1 million, up to a maximum 100 basis points, or annual interest expense by $3 million.\nIn addition, we operate as a holding company in a highly regulated industry. Humana Inc., our parent company, is dependent upon dividends and administrative expense reimbursements from our subsidiaries, most of which are subject to regulatory restrictions. We continue to maintain significant levels of aggregate excess statutory capital and surplus in our state-regulated operating subsidiaries. Cash, cash equivalents, and short-term investments at the parent company were $0.6 billion at December 31, 2024 compared to $0.5 billion at December 31, 2023. This increase primarily reflects working capital changes, net proceeds from the issuance of senior notes and commercial paper, proceeds from the sale and maturities of investment securities, dividends from insurance subsidiaries and cash from certain non-insurance subsidiaries within our CenterWell segment partially offset by common stock repurchases, repayment of maturing senior notes, repayment of borrowings under the commercial paper program, purchases of investment securities, capital expenditures, capital contributions to certain subsidiaries, cash dividends to shareholders and acquisitions. Our use of operating cash derived from our non-insurance subsidiaries, such as our CenterWell segment, is generally not restricted by departments of insurance (or comparable state regulators). Our regulated insurance subsidiaries paid dividends to our parent company of $1.5 billion in 2024, $1.8 billion in 2023, and $1.3 billion in 2022. Subsidiary capital requirements from significant premium growth may impact the amount of regulated subsidiary dividends. Refer to our parent company financial statements and accompanying notes in Schedule I - Parent Company Financial Information. \nThe amount of ordinary dividends that may be paid to our parent company in\n 2025 \nis approximately\n $1.3 billion, in the aggregate. Actual dividends paid may vary due to consideration of excess statutory capital and surplus and expected future surplus requirements related to, for example, premium volume and product mix.\nRegulatory Requirements\nFor a detailed discussion of our regulatory requirements, including aggregate statutory capital and surplus as well as dividends paid from the subsidiaries to our parent, please refer to Note 16 to the to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nOff-Balance Sheet Arrangements\nAs of December 31, 2024, we were not involved in any special purpose entity, or SPE, transactions. For a detailed discussion of off-balance sheet arrangements, please refer to Note 17 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nGuarantees and Indemnifications\nFor a detailed discussion of our guarantees and indemnifications, please refer to Note 17 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\n57\nGovernment Contracts\nFor a detailed discussion of our government contracts, including our Medicare, military services, and Medicaid and state-based contracts, please refer to Note 17  to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nCritical Accounting Policies and Estimates\nThe discussion and analysis of our financial condition and results of operations is based upon our consolidated financial statements and accompanying notes, which have been prepared in accordance with accounting principles generally accepted in the United States of America. The preparation of these financial statements and accompanying notes requires us to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. We continuously evaluate our estimates and those critical accounting policies primarily related to benefits expense and revenue recognition as well as accounting for impairments related to our investment securities, goodwill, indefinite-lived and long-lived assets. These estimates are based on knowledge of current events and anticipated future events and, accordingly, actual results ultimately may differ from those estimates. We believe the following critical accounting policies involve the most significant judgments and estimates used in the preparation of our consolidated financial statements.\nBenefits Expense Recognition\nBenefits expense is recognized in the period in which services are provided and includes an estimate of the cost of services which have been incurred but not yet reported, or IBNR. Our reserving practice is to consistently recognize the actuarial best point estimate within a level of confidence required by actuarial standards. For further discussion of our reserving methodology, including our use of completion and claims per member per month trend factors to estimate IBNR, refer to Note 2 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nThe completion and claims per member per month trend factors are the most significant factors impacting the IBNR estimate. The portion of IBNR estimated using completion factors for claims incurred prior to the most recent two months is generally less variable than the portion of IBNR estimated using trend factors. The following table illustrates the sensitivity of these factors assuming moderately adverse experience and the estimated potential impact on our operating results caused by reasonably likely changes in these factors based on December 31, 2024 data:\nCompletion Factor (a):\nClaims Trend Factor (b):\nFactor\nChange (c)\nDecrease in\nBenefits Payable\nFactor\nChange (c)\nDecrease in\nBenefits Payable\n(dollars in millions)\n0.90%\n$793\n4.00%\n$727\n0.80%\n$705\n4.75%\n$682\n0.70%\n$617\n3.50%\n$636\n0.60%\n$529\n3.25%\n$591\n0.50%\n$440\n3.00%\n$545\n0.40%\n$352\n2.75%\n$500\n0.30%\n$264\n2.50%\n$454\n0.20%\n$176\n2.25%\n$409\n0.10%\n$88\n2.00%\n$363\n0.05%\n$44\n1.75%\n$318\n0.03%\n$22\n1.50%\n$273\n(a)\nReflects estimated potential changes in benefits payable at December 31, 2024 caused by changes in completion factors for incurred months prior to the most recent two months.\n58\n(b)\nReflects estimated potential changes in benefits payable at December 31, 2024 caused by changes in annualized claims trend used for the estimation of per member per month incurred claims for the most recent two months.\n(c)\nThe factor change indicated represents the percentage point change.\nThe following table provides a historical perspective regarding the accrual and payment of our benefits payable. Components of the total incurred claims for each year include amounts accrued for current year estimated benefits expense as well as adjustments to prior year estimated accruals. Refer to Note 11 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K for information about incurred and paid claims development as of December 31, 2024 as well as cumulative claim frequency and the total of IBNR included within the net incurred claims amounts.\n2024\n2023\n2022\n \n(in millions)\nBalances at January 1\n$\n10,241 \n$\n9,264 \n$\n8,289 \nAcquisitions\n— \n62 \n— \nIncurred related to:\nCurrent year\n101,365 \n89,266 \n76,105 \nPrior years\n(701)\n(872)\n(415)\nTotal incurred\n100,664 \n88,394 \n75,690 \nPaid related to:\nCurrent year\n(91,281)\n(79,545)\n(67,287)\nPrior years\n(9,184)\n(7,934)\n(7,428)\nTotal paid\n(100,465)\n(87,479)\n(74,715)\nBalances at December 31\n$\n10,440 \n$\n10,241 \n$\n9,264 \nThe following table summarizes the changes in estimate for incurred claims related to prior years attributable to our key assumptions. As previously described, our key assumptions consist of trend and completion factors estimated using an assumption of moderately adverse conditions. The amounts below represent the difference between our original estimates and the actual benefits expense ultimately incurred as determined from subsequent claim payments.\n \nFavorable Development by Changes in Key Assumptions\n \n2024\n2023\n2022\n \nAmount\nFactor\nChange (a)\nAmount\nFactor\nChange (a)\nAmount\nFactor\nChange (a)\n \n(dollars in millions)\nTrend factors\n$\n(473)\n(2.6)\n%\n$\n(586)\n(3.5)\n%\n$\n(387)\n(2.8)\n%\nCompletion factors\n(228)\n(0.3)\n%\n(286)\n(0.4)\n%\n(28)\n— \n%\nTotal\n$\n(701)\n$\n(872)\n$\n(415)\n(a)\nThe factor change indicated represents the percentage point change.\nAs previously discussed, our reserving practice is to consistently recognize the actuarial best estimate of our ultimate liability for claims. Actuarial standards require the use of assumptions based on moderately adverse experience, which generally results in favorable reserve development, or reserves that are considered redundant. We experienced favorable medical claims reserve development related to prior fiscal years of $701 million in 2024, $872 million in 2023, and $415 million in 2022. \nThe favorable medical claims reserve development for 2024, 2023, and 2022 primarily reflects the consistent application of trend and completion factors estimated using an assumption of moderately adverse conditions. \n59\n Our favorable development for each of the years presented above is discussed further in Note 11 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K.\nWe continually adjust our historical trend and completion factor experience with our knowledge of recent events that may impact current trends and completion factors when establishing our reserves. Because our reserving practice is to consistently recognize the actuarial best point estimate using an assumption of moderately adverse conditions as required by actuarial standards, there is a reasonable possibility that variances between actual trend and completion factors and those assumed in our December 31, 2024 estimates would fall towards the middle of the ranges previously presented in our sensitivity table. \nRevenue Recognition\nWe generally establish one-year commercial membership contracts with employer groups, subject to cancellation by the employer group on 30-day written notice. Our Medicare contracts with CMS renew annually. Our military services contracts with the federal government and certain contracts with various state Medicaid programs generally are multi-year contracts subject to annual renewal provisions.\nWe receive monthly premiums from the federal government and various states according to government specified payment rates and various contractual terms. We bill and collect premiums from employer groups and members in our Medicare and other individual products monthly.  Changes in premium revenues resulting from the periodic changes in risk-adjustment scores derived from medical diagnoses for our membership are estimated by projecting the ultimate annual premium and recognized ratably during the year with adjustments each period to reflect changes in the ultimate premium. \nPremiums revenue is estimated by multiplying the membership covered under the various contracts by the contractual rates. Premiums revenue is recognized as income in the period members are entitled to receive services, and is net of estimated uncollectible amounts, retroactive membership adjustments, and adjustments to recognize rebates under the minimum benefit ratios required under the Health Care Reform Law. We estimate policyholder rebates by projecting calendar year minimum benefit ratios for the small group and large group markets, as defined by the Health Care Reform Law using a methodology prescribed by HHS, separately by state and legal entity. Medicare Advantage products are also subject to minimum benefit ratio requirements under the Health Care Reform Law. Estimated calendar year rebates recognized ratably during the year are revised each period to reflect current experience. Retroactive membership adjustments result from enrollment changes not yet processed, or not yet reported by an employer group or the government. We routinely monitor the collectability of specific accounts, the aging of receivables, historical retroactivity trends, estimated rebates, as well as prevailing and anticipated economic conditions, and reflect any required adjustments in current operations. Premiums received prior to the service period are recorded as unearned revenues.\n60\nMedicare Risk-Adjustment Provisions \nCMS uses a risk-adjustment model which adjusts premiums paid to Medicare Advantage, or MA, plans according to health status of covered members. The risk-adjustment model, which CMS implemented pursuant to the Balanced Budget Act of 1997 (BBA) and the Benefits Improvement and Protection Act of 2000 (BIPA), generally pays more where a plan's membership has higher expected costs. Under this model, rates paid to MA plans are based on actuarially determined bids, which include a process whereby our prospective payments are based on our estimated cost of providing standard Medicare-covered benefits to an enrollee with a \"national average risk profile.\" That baseline payment amount is adjusted to account for certain demographic characteristics and health status of our enrolled members. Under the risk-adjustment methodology, all MA plans must collect from providers and submit the necessary diagnosis code information to CMS within prescribed deadlines. The CMS risk-adjustment model uses the diagnosis data, collected from providers, to calculate the health status-related risk-adjusted premium payment to MA plans, which CMS further adjusts for coding pattern differences between the health plans and the government fee-for-service (FFS) program. We generally rely on providers, including certain providers in our network who are our employees, to code their claim submissions with appropriate diagnoses, which we send to CMS as the basis for our health status-adjusted payment received from CMS under the actuarial risk-adjustment model. We also rely on these providers to document appropriately all medical data, including the diagnosis data submitted with claims. In addition, we conduct medical record reviews as part of our data and payment accuracy compliance efforts, to more accurately reflect diagnosis conditions under the risk adjustment model. For additional information, refer to Note 17 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" and Part I, Item 1A, \"Risk Factors\" of this Form 10-K.\n \nInvestment Securities\nInvestment securities totaled $18.6 billion, or 40% of total assets at December 31, 2024, and $17.0 billion, or 36% of total assets at December 31, 2023. The investment portfolio was primarily comprised of debt securities, detailed below, at December 31, 2024 and December 31, 2023. The fair value of investment securities were as follows at December 31, 2024 and 2023:\n12/31/2024\nPercentage\nof Total\n12/31/2023\nPercentage\nof Total\n \n(dollars in millions)\nU.S. Treasury and other U.S. government \n    corporations and agencies:\nU.S. Treasury and agency obligations\n$\n3,227 \n17.3 \n%\n$\n2,667 \n15.7 \n%\nMortgage-backed securities\n3,995 \n21.4 \n%\n3,522 \n20.7 \n%\nTax-exempt municipal securities\n526 \n2.8 \n%\n858 \n5.0 \n%\nMortgage-backed securities:\nResidential\n522 \n2.8 \n%\n400 \n2.4 \n%\nCommercial\n1,206 \n6.5 \n%\n1,345 \n7.9 \n%\nAsset-backed securities\n1,403 \n7.5 \n%\n1,771 \n10.4 \n%\nCorporate debt securities\n7,756 \n41.7 \n%\n6,445 \n37.9 \n%\nTotal debt securities\n18,635 \n100.0 \n%\n17,008 \n100.0 \n%\nApproximately 97% of our debt securities were investment-grade quality, with a weighted average credit rating of AA- by S&P at December 31, 2024. Most of the debt securities that were below investment-grade were rated B+, the higher end of the below investment-grade rating scale. Tax-exempt municipal securities were diversified among general obligation bonds of states and local municipalities in the United States as well as special revenue bonds issued by municipalities to finance specific public works projects such as utilities, water and sewer, transportation, or education. Our general obligation bonds are diversified across the United States with no individual state exceeding approximately 1% of our total debt securities. Our investment policy limits investments in a single issuer and requires diversification among various asset types. \n61\nGross unrealized losses and fair values aggregated by investment category and length of time that individual securities have been in a continuous unrealized loss position were as follows at December 31, 2024:\n \nLess than 12 months\n12 months or more\nTotal\n \nFair\nValue\nGross\nUnrealized\nLosses\nFair\nValue\nGross\nUnrealized\nLosses\nFair\nValue\nGross\nUnrealized\nLosses\n \n(in millions)\nU.S. Treasury and other U.S. government \n    corporations and agencies:\nU.S. Treasury and agency obligations\n$\n2,343 \n$\n(68)\n$\n456 \n$\n(42)\n$\n2,799 \n$\n(110)\nMortgage-backed securities\n1,766 \n(50)\n2,203 \n(459)\n3,969 \n(509)\nTax-exempt municipal securities\n97 \n(1)\n405 \n(21)\n502 \n(22)\nMortgage-backed securities:\nResidential\n130 \n(2)\n343 \n(62)\n473 \n(64)\nCommercial\n58 \n(1)\n992 \n(84)\n1,050 \n(85)\nAsset-backed securities\n419 \n(5)\n436 \n(19)\n855 \n(24)\nCorporate debt securities\n2,385 \n(51)\n4,269 \n(544)\n6,654 \n(595)\nTotal debt securities\n$\n7,198 \n$\n(178)\n$\n9,104 \n$\n(1,231)\n$\n16,302 \n$\n(1,409)\nUnder the current expected credit losses model, or CECL, expected losses on available for sale debt securities are recognized through an allowance for credit losses rather than as reductions in the amortized cost of the securities. For debt securities whose fair value is less than their amortized cost which we do not intend to sell or are not required to sell, we evaluate the expected cash flows to be received as compared to amortized cost and determine if an expected credit loss has occurred. In the event of an expected credit loss, only the amount of the impairment associated with the expected credit loss is recognized in income with the remainder, if any, of the loss recognized in other comprehensive income.  To the extent we have the intent to sell the debt security or it is more likely than not we will be required to sell the debt security before recovery of our amortized cost basis, we recognize an impairment loss in income in an amount equal to the full difference between the amortized cost basis and the fair value.\nPotential expected credit loss impairment is considered using a variety of factors, including the extent to which the fair value has been less than cost; adverse conditions specifically related to the industry, geographic area or financial condition of the issuer or underlying collateral of a debt security; changes in the quality of the debt security's credit enhancement; payment structure of the debt security; changes in credit rating of the debt security by the rating agencies; failure of the issuer to make scheduled principal or interest payments on the debt security and changes in prepayment speeds. For debt securities, we take into account expectations of relevant market and economic data. For example, with respect to mortgage and asset-backed securities, such data includes underlying loan level data and structural features such as seniority and other forms of credit enhancements. We estimate the amount of the expected credit loss component of a debt security as the difference between the amortized cost and the present value of the expected cash flows of the security. The present value is determined using the best estimate of future cash flows discounted at the implicit interest rate at the date of purchase. The expected credit loss cannot exceed the full difference between the amortized cost basis and the fair value.\nWe participate in a securities lending program to optimize investment income. We loan certain investment securities for short periods of time in exchange for collateral initially equal to at least 102% of the fair value of the investment securities on loan. The fair value of the loaned investment securities is monitored on a daily basis, with additional collateral obtained or refunded as the fair value of the loaned investment securities fluctuates. The collateral, which may be in the form of cash or U.S. Government securities, is deposited by the borrower with an independent lending agent. Any cash collateral, which is reinvested by the lending agent primarily in short-term, highly liquid investments, is recorded as a securities lending collateral asset within other current assets on our \n62\nconsolidated balance sheet at the end of the reporting period. We record a corresponding liability to reflect our obligation to return the collateral within trade accounts payable and accrued expenses on our consolidated balance sheet at the end of the reporting period. Collateral received in the form of securities is not recorded in our consolidated balance sheets because, absent default by the borrower, we do not have the right to sell, pledge or otherwise reinvest securities collateral. Loaned securities continue to be carried as investment securities on the consolidated balance sheet at the end of the reporting period. Earnings on the invested cash collateral, net of expense, associated with the securities lending payable are recorded as investment income.\nThe risks inherent in assessing the impairment of an investment include the risk that market factors may differ from our expectations, facts and circumstances factored into our assessment may change with the passage of time, or we may decide to subsequently sell the investment. The determination of whether a decline in the value of an investment is related to a credit event requires us to exercise significant diligence and judgment. The discovery of new information and the passage of time can significantly change these judgments. The status of the general economic environment and significant changes in the national securities markets influence the determination of fair value and the assessment of investment impairment. There is a continuing risk that declines in fair value may occur and additional material realized losses from sales or expected credit loss impairments may be recorded in future periods.\nAll issuers of debt securities we own that were trading at an unrealized loss at December 31, 2024 remain current on all contractual payments. After taking into account these and other factors previously described, we believe these unrealized losses primarily were caused by an increase in market interest rates in the current markets since the time the debt securities were purchased. At December 31, 2024, we did not intend to sell any debt securities with an unrealized loss position in accumulated other comprehensive income, and it is not likely that we will be required to sell these debt securities before recovery of their amortized cost basis. Additionally, we did not record any material credit allowances for debt securities that were in an unrealized loss position at December 31, 2024,  2023 or 2022.\nGoodwill, Indefinite-lived and Long-lived Assets\nAt December 31, 2024, goodwill, indefinite-lived and other long-lived assets represented 29% of total assets and 83% of total stockholders’ equity, compared to 30% and 87%, respectively, at December 31, 2023. The decrease in goodwill, indefinite-lived and other long-lived assets as a percentage of total assets is primarily attributable to the increase in investment securities.\nFor goodwill, we are required to test at least annually for impairment at a level of reporting referred to as the reporting unit, and more frequently if adverse events or changes in circumstances indicate that the asset may be impaired. A reporting unit either is our operating segments or one level below the operating segments, referred to as a component, which comprise our reportable segments. A component is considered a reporting unit if the component constitutes a business for which discrete financial information is available that is regularly reviewed by management. We are required to aggregate the components of an operating segment into one reporting unit if they have similar economic characteristics. Goodwill is assigned to the reporting unit that is expected to benefit from a specific acquisition. \nWe perform a quantitative assessment to review goodwill for impairment to determine both the existence and amount of goodwill impairment, if any. Our strategy, long-range business plan, and annual planning process support our goodwill impairment tests. These tests are performed, at a minimum, annually in the fourth quarter, and are based on an evaluation of future discounted cash flows. We rely on this discounted cash flow analysis to determine fair value. However, outcomes from the discounted cash flow analysis are compared to other market approach valuation methodologies for reasonableness. We use discount rates that correspond to a market-based weighted-average cost of capital and terminal growth rates that correspond to long-term growth prospects, consistent with the long-term inflation rate. Key assumptions in our cash flow projections, including changes in membership, premium yields, medical and operating cost trends, and certain government contract extensions, are consistent with those utilized in our long-range business plan and annual planning process. If these assumptions differ from actual, including the impact of the Health Care Reform Law or changes in government reimbursement rates, the estimates underlying our goodwill impairment tests could be adversely affected. The fair value of our reporting units with \n63\nsignificant goodwill exceeded carrying amounts by a substantial margin. However, unfavorable changes in key assumptions or combinations of assumptions including a significant increase in the discount rate, decrease in the long-term growth rate or substantial reduction in our underlying cash flow assumptions, including revenue growth rates, operating cost trends, and projected operating income could have a significant negative impact on the estimated fair value of our home solutions reporting unit, which accounted for $4.4 billion of goodwill. Impairment tests completed for 2024, 2023, and 2022 did not result in an impairment loss.\nIndefinite-lived intangible assets relate to Certificate of Needs (CON) and Medicare licenses acquired in connection with our CenterWell Home Health (formerly Kindred at Home) acquisition with a carrying value of $1.2 billion at December 31, 2024. Like goodwill, we are required to test at least annually for impairment and more frequently if adverse events or changes in circumstances indicate that the asset may be impaired. These tests are performed, at a minimum, annually in the fourth quarter. If the carrying amount of an indefinite-lived intangible asset exceeds its fair value, an impairment loss is recognized. Fair values of indefinite-lived intangible assets are determined based on the income approach. For our CON intangible assets, unfavorable changes in key assumptions or combinations of assumptions, including a significant increase in the discount rate, decrease in the long-term growth rate or substantial reduction in the underlying cash flow assumptions, including revenue growth rates, operating cost trends, and projected operating income could have a significant negative impact on the estimated fair value of our CON intangible assets, which account for $910 million of our intangible assets. Impairment tests completed for 2024 and 2023 resulted in impairment charges of $200 million and $55 million, respectively. Impairment test completed for 2022 did not result in a material impairment charge. These charges reflect the amount by which the carrying value exceeded its estimated fair value. The fair values of the assets were measured using Level 3 inputs, such as projected revenues and operating cash flows. \nLong-lived assets consist of property and equipment and other definite-lived intangible assets. These assets are depreciated or amortized over their estimated useful life, and are subject to impairment reviews. We periodically review long-lived assets whenever adverse events or changes in circumstances indicate the carrying value of the asset may not be recoverable. In assessing recoverability, we must make assumptions regarding estimated future cash flows and other factors to determine if an impairment loss may exist, and, if so, estimate fair value. We also must estimate and make assumptions regarding the useful life we assign to our long-lived assets. If these estimates or their related assumptions change in the future, we may be required to record impairment losses or change the useful life, including accelerating depreciation or amortization for these assets. Other than the impairment charges as described in Footnote 2 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K, there were no other impairment losses in the last three years.",
  "item2": null
}