{
  "item1": "(dollars millions) Intersegment revenues: Total intersegment revenues External services revenue: Total external services revenue n/a – not applicable pharmacy solutions business includes operations CenterWell Pharmacy (our mail-order pharmacy business), CenterWell Specialty Pharmacy, other retail pharmacies located within CenterWell Primary Care clinics brand, generic, specialty drugs, over counter medications supplies, well hospice pharmacy drugs. operate full-service, value-based senior focused primary care centers number states, including Georgia, Florida, Indiana, Kansas, Kentucky, Louisiana, Mississippi, Missouri, Nevada, North Carolina, South Carolina, Tennessee, Texas, Virginia staffed primary care providers medical specialists primary focus senior population under Primary Care Organization, PCO. PCO operates these clinics primarily under Conviva Senior Primary Care CenterWell Senior Primary Care brands. primary care subsidiaries operate medical center business through both employed physicians care providers, through third-party management service organizations whom contract arrange manage certain clinical services.",
  "item7": "U.S. Treasury other U.S. government corporations agencies: U.S. Treasury agency obligations Mortgage-backed securities Tax-exempt municipal securities Mortgage-backed securities: Asset-backed securities Corporate debt securities Total debt securities Under current expected credit losses model, CECL, expected losses available sale debt securities recognized through allowance credit losses rather than reductions amortized cost securities.",
  "item2": "enacted significant reforms various aspects U.S. health insurance industry, including, among others, mandated coverage requirements, mandated benefits guarantee issuance associated insurance products, rebates policyholders based minimum benefit ratios, adjustments Medicare Advantage premiums, establishment federally facilitated state-based exchanges coupled programs designed spread risk among insurers, introduction plan designs based set actuarial values, changes Part D prescription drug benefit design reasonably possible these laws regulations, well other current future legislative, judicial regulatory changes including restrictions ability manage provider network, manage sell products, otherwise operate business, restrictions profitability, including reviews regulatory bodies may compare Medicare Advantage profitability non-Medicare Advantage business profitability, compare profitability various products within Medicare Advantage business, require they remain within certain ranges each other, increases member benefits changes member eligibility criteria without corresponding increases premium payments us, further restrictions service arrangements fee payments between intercompany vertically-integrated assets, increases regulation prescription drug benefit businesses, reductions reimbursement rates, changes Part D prescription drug benefit design (and uncertainty arising implementation these changes) aggregate may material adverse effect results operations (including restricting revenue, enrollment premium growth certain products market segments, restricting ability expand into new markets, increasing medical operating costs, further lowering Medicare payment rates increasing expenses associated assessments); financial position (including ability maintain value goodwill); cash flows. intend discussion financial condition results operations follows assist understanding financial statements related changes certain key items those financial statements year year, including primary factors accounted those changes. Transactions between reportable segments primarily consist sales products services rendered CenterWell segment, primarily pharmacy, primary care, home solutions, Insurance segment customers described Note 14 condensed consolidated financial statements included report."
}