{
  "source_file": "hum-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe condensed consolidated financial statements of Humana Inc. in this document present the Company’s financial position, results of operations and cash flows, and should be read in conjunction with the following discussion and analysis. References to “we,” “us,” “our,” “Company,” and “Humana” mean Humana Inc. and its subsidiaries. This discussion includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. When used in filings with the Securities and Exchange Commission, or SEC, in our press releases, investor presentations, and in oral statements made by or with the approval of one of our executive officers, the words or phrases like “believes,” “expects,” “anticipates,” “intends,” “likely will result,” “estimates,” “projects” or variations of such words and similar expressions are intended to identify such forward–looking statements. These forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties and assumptions, including, among other things, information set forth in Item 1A. – Risk Factors in our 2024 Form 10-K, as modified by any changes to those risk factors included in this document and in other reports we filed subsequent to February 20, 2025, in each case incorporated by reference herein. In making these statements, we are not undertaking to address or update such forward-looking statements in future filings or communications regarding our business or results. In light of these risks, uncertainties and assumptions, the forward–looking events discussed in this document might not occur. There may also be other risks that we are unable to predict at this time. Any of these risks and uncertainties may cause actual results to differ materially from the results discussed in the forward-looking statements.\nExecutive Overview\nGeneral    \nHumana Inc., headquartered in Louisville, Kentucky, is committed to putting health first – for our teammates, our customers, and our company. Through our Humana insurance services, and our CenterWell health care services, we make it easier for the millions of people we serve to achieve their best health – delivering the care and service they need, when they need it. These efforts are leading to a better quality of life for Medicare and Medicaid participants, families, individuals, military service personnel, and communities at large.\nOur industry relies on two key statistics to measure performance. The benefit ratio, which is computed by taking\ntotal benefits expense as a percentage of premiums revenue, represents a statistic used to measure underwriting profitability. The operating cost ratio, which is computed by taking total operating costs, excluding depreciation and amortization, as a percentage of total revenue less investment income, represents a statistic used to measure administrative spending efficiency.\nValue Creation Initiative\ns and Impairment Charges\nIn order to create capacity to fund growth and investment in our Medicare Advantage business and further expansion of our healthcare services capabilities, we have committed to driving additional value for the enterprise through cost saving, productivity initiatives, and value acceleration from previous investments. As a result of these initiatives, we recorded charges, primarily in severance charges in connection with workforce optimization and external consulting spend, of $267 million and $320 million for the three and nine months ended September 30, 2025, respectively. We recorded charges, primarily in asset impairments, of $55 million and $151 million for the three and nine months ended September 30, 2024, respectively. These charges were included within operating costs in the condensed consolidated statements of income. We expect to incur additional charges in 2025. \nIn addition, we recorded impairment charges of $32 million, relating to indefinite-lived intangible assets, for the nine months ended September 30, 2025 within operating costs in our condensed consolidated statements of income. There were no impairment charges relating to indefinite-lived intangible assets recorded during the three and nine months ended September 30, 2024. \n34\nTable of Contents\nBusiness Segments\nOur two reportable segments, Insurance and CenterWell, are based on a combination of the type of health plan customer and adjacent businesses centered on well-being solutions for our health plans and other customers, as described below. Our Chief Executive Officer, the Chief Operating Decision Maker, utilizes these segment groupings and results of each segment, measured by income (loss) from operations, to assess performance and allocate resources primarily during our annual budget process and periodic forecast updates.  \nThe Insurance segment consists of Medicare benefits, marketed to individuals or directly via group Medicare accounts, as well as our contract with CMS to administer the Limited Income Newly Eligible Transition, or LI-NET, prescription drug plan program and contracts with various states to provide Medicaid, dual eligible demonstration, and Long-Term Support Services benefits, which we refer to collectively as our state-based contracts. This segment also includes products consisting of specialty health insurance benefits marketed to individuals and employer groups, including dental, vision, and other supplemental health benefits. In addition, our Insurance segment includes our Military services business, primarily our T-5 East Region contract, as well as the operations of our PBM business.\nThe CenterWell segment includes our pharmacy, primary care, and home solutions operations. Services offered by this segment are designed to enhance the overall healthcare experience. These services may lead to lower utilization associated with improved member health and/or lower drug costs. \nTransactions between reportable segments primarily consist of sales of products and services rendered by our CenterWell segment, primarily pharmacy, primary care, and home solutions, to our Insurance segment customers. Intersegment sales and expenses are recorded primarily at fair value and eliminated in consolidation. Members served by our segments often use the same provider networks, enabling us in some instances to obtain more favorable contract terms with providers. Our segments also share indirect costs and assets. As a result, the profitability of each segment is interdependent. We allocate most operating expenses to our segments. Assets and certain corporate income and expenses are not allocated to the segments, including the portion of investment income not supporting segment operations, interest expense on corporate debt, and certain other corporate expenses. These items are managed at a corporate level. These corporate amounts are reported separately from our reportable segments and are included with intersegment eliminations.\nSeasonality\nOur quarterly Insurance segment earnings and operating cash flows are impacted by the Medicare Part D benefit design and changes in the composition of our stand-alone prescription drug plan, or PDP, membership. The Medicare Part D benefit design results in coverage that varies as a member’s cumulative out-of-pocket costs pass through successive stages of a member’s plan period, which begins annually on January 1 for renewals. Effective January 1, 2025, the Medicare Part D coverage gap was eliminated as mandated by the Inflation Reduction Act of 2022, or IRA. The standard Part D benefit now comprises three phases: the deductible phase, the initial coverage phase and the catastrophic coverage phase. Beneficiaries' out-of-pocket expenses for covered prescription drugs are capped at $2,000, after which they incur no additional cost sharing for the remainder of the year. In addition, the Coverage Gap Discount Program was replaced by the Manufacturer Discount Program, requiring pharmaceutical manufacturers to provide discounts on brand name drugs during both the initial coverage and catastrophic phases. These changes are anticipated to reduce out-of-pocket costs for beneficiaries and impact plan liabilities, accordingly. These benefit design changes will result in us sharing a greater portion of the responsibility and result in net prescription costs that are more level throughout the year as compared to the historical seasonal decline seen prior to the IRA. In addition, the number of low-income senior members, as well as year-over-year changes in the mix of membership in our stand-alone PDP products, affects the quarterly benefit ratio pattern. The Insurance segment also experiences seasonality in the operating cost ratio as a result of costs incurred in the second half of the year associated with the Medicare marketing season.\n35\nTable of Contents\n2025 Highlights \n•\nOur strategy is to offer our members affordable health care combined with a positive consumer experience in growing markets. At the core of this strategy is our integrated care delivery model, which unites quality care, high member engagement, and sophisticated data analytics. Our approach to primary, physician-directed care for our members aims to provide quality care that is consistent, integrated, cost-effective, and member-focused, provided by both employed physicians and physicians with network contract arrangements. The model is designed to improve health outcomes and affordability for individuals and for the health system as a whole, while offering our members a simple, seamless healthcare experience. We believe this strategy is positioning us for long-term growth in both membership and earnings. We offer providers a continuum of opportunities to increase the integration of care and offer assistance to providers in transitioning from a fee-for-service to a value-based arrangement. These include performance bonuses, shared savings and shared risk relationships. At September 30, 2025, approximately 3,553,000 members, or 68%, of our individual Medicare Advantage members were in value-based relationships under our integrated care delivery model, as compared to 3,984,900 members, or 70%, at September 30, 2024.\n•\nNet income attributable to Humana was $195 million, or $1.62 per diluted common share, and $480 million, or $3.98 per diluted common share, for the three months ended September 30, 2025 and 2024, respectively. \nNet income\n attributable to Humana was $2.0 billion, or $16.43 per diluted common share, and $1.9 billion, or $15.72 per diluted common share, for the nine months ended September 30, 2025 and 2024, respectively. These comparisons were significantly impacted by put/call valuation adjustments associated with non-consolidating minority interest investments, impairment charges, settlement of certain litigation expenses, loss on sale of business and charges associated with value creation initiatives. The impact of these adjustments to our consolidated income before income taxes and equity in net losses and diluted earnings per common share was as follows for the 2025\n \nand 2024 quarter and period:\nFor the three months ended September 30,\nFor the nine months ended September 30,\n2025\n2024\n2025\n2024\n(in millions)\nConsolidated income before income taxes and equity in net losses:\nPut/call valuation adjustments associated with our non consolidating minority interest investments\n$\n97 \n$\n(59)\n$\n460 \n$\n141 \nImpairment charges\n— \n— \n32 \n— \nSettlement of certain litigation expenses\n15 \n— \n15 \n— \nLoss on sale of business\n63 \n— \n63 \n— \nValue creation initiatives\n267 \n55 \n320 \n151 \nTotal\n$\n442 \n$\n(4)\n$\n890 \n$\n292 \nFor the three months ended September 30,\nFor the nine months ended September 30,\n2025\n2024\n2025\n2024\nDiluted earnings per common share:\nPut/call valuation adjustments associated with our non consolidating minority interest investments\n$\n0.80 \n$\n(0.49)\n$\n3.81 \n$\n1.17 \nImpairment charges\n— \n— \n0.27 \n— \nSettlement of certain litigation expenses\n0.13 \n— \n0.13 \n— \nLoss on sale of business\n0.52 \n— \n0.52 \n— \nValue creation initiatives\n2.21 \n0.45 \n2.65 \n1.25 \nCumulative net tax impact\n(1.72)\n0.01 \n(2.58)\n(0.56)\nTotal\n$\n1.94 \n$\n(0.03)\n$\n4.80 \n$\n1.86 \n36\nTable of Contents\nRegulatory Environment\nWe are and will continue to be regularly subject to new laws and regulations, changes to existing laws and regulations, and judicial determinations that impact the interpretation and applicability of those laws and regulations. The Health Care Reform Law, the Families First Act, the CARES Act, and the Inflation Reduction Act, and related regulations, are examples of laws which have\n \nenacted significant reforms to various aspects of the U.S. health insurance industry, including, among others, mandated coverage requirements, mandated benefits and guarantee issuance associated with insurance products, rebates to policyholders based on minimum benefit ratios, adjustments to Medicare Advantage premiums, the establishment of federally facilitated or state-based exchanges coupled with programs designed to spread risk among insurers, and the introduction of plan designs based on set actuarial values, and changes to the Part D prescription drug benefit design\n.\nIt is reasonably possible that these laws and regulations, as well as other current or future legislative, judicial or regulatory changes including restrictions on our ability to manage our provider network, manage and sell our products, or otherwise operate our business, or restrictions on profitability, including reviews by regulatory bodies that may compare our Medicare Advantage profitability to our non-Medicare Advantage business profitability, or compare the profitability of various products within our Medicare Advantage business, and require that they remain within certain ranges of each other, increases in member benefits or changes to member eligibility criteria without corresponding increases in premium payments to us, further restrictions on service arrangements and fee payments between intercompany or vertically-integrated assets, increases in regulation of our prescription drug benefit businesses, reductions in reimbursement rates, or changes to the Part D prescription drug benefit design (and uncertainty arising from the implementation of these changes) in the aggregate may have a material adverse effect on our results of operations (including restricting revenue, enrollment and premium growth in certain products and market segments, restricting our ability to expand into new markets, increasing our medical and operating costs, further lowering our Medicare payment rates and increasing our expenses associated with assessments); our financial position (including our ability to maintain the value of our goodwill); and our cash flows.\nWe intend for the discussion of our financial condition and results of operations that follows to assist in the understanding of our financial statements and related changes in certain key items in those financial statements from year to year, including the primary factors that accounted for those changes. Transactions between reportable segments primarily consist of sales of products and services rendered by our CenterWell segment, primarily pharmacy, primary care, and home solutions, to our Insurance segment customers and are described in Note 14 to the condensed consolidated financial statements included in this report.\n37\nTable of Contents\nComparison of Results of Operations for 2025 and 2024\nThe following discussion primarily deals with our results of operations for the three months ended September 30, 2025, or the 2025 quarter, the three months ended September 30, 2024, or the 2024 quarter, the nine months ended September 30, 2025, or the 2025 period, and the nine months ended September 30, 2024, or the 2024 period.\nChange\nThree months ended September 30,\nNine months ended September 30,\nThree months ended September 30, 2025 vs 2024\nNine months ended September 30, 2025 vs 2024\n2025\n2024\n2025\n2024\n$\n%\n$\n%\n($ in millions, except per common share results)\nRevenues:\nInsurance premiums\n$\n30,711\n$\n27,951\n$\n91,941\n$\n84,354\n$\n2,760\n9.9%\n$\n7,587\n9.0%\nServices:\nInsurance\n267\n226\n725\n715\n41\n18.1%\n10\n1.4%\nCenterWell\n1,333\n877\n3,609\n2,550\n456\n52.0%\n1,059\n41.5%\nTotal services revenue\n1,600\n1,103\n4,334\n3,265\n497\n45.1%\n1,069\n32.7%\nInvestment income\n338\n343\n874\n929\n(5)\n(1.5)%\n(55)\n(5.9)%\nTotal revenues\n32,649\n29,397\n97,149\n88,548\n3,252\n11.1%\n8,601\n9.7%\nOperating expenses:\nBenefits\n27,991\n25,120\n82,091\n75,283\n2,871\n11.4%\n6,808\n9.0%\nOperating costs\n4,085\n3,339\n11,012\n9,529\n746\n22.3%\n1,483\n15.6%\nDepreciation and amortization\n173\n210\n534\n631\n(37)\n(17.6)%\n(97)\n(15.4)%\nTotal operating expenses\n32,249\n28,669\n93,637\n85,443\n3,580\n12.5%\n8,194\n9.6%\nIncome from operations\n400\n728\n3,512\n3,105\n(328)\n(45.1)%\n407\n13.1%\nLoss on sale of business\n63\n—\n63\n—\n63\n100.0%\n63\n100.0%\nInterest expense\n168\n169\n485\n496\n(1)\n(0.6)%\n(11)\n(2.2)%\nOther expense (income), net\n35\n(92)\n398\n26\n127\n138.0%\n372\n1,430.8%\nIncome before income taxes and equity in net losses\n134\n651\n2,566\n2,583\n(517)\n(79.4)%\n(17)\n(0.7)%\n(Benefit) provision for income taxes\n(86)\n155\n499\n629\n241\n155.5%\n(130)\n(20.7)%\nEquity in net losses\n(26)\n(16)\n(88)\n(57)\n10\n62.5%\n31\n54.4%\nNet income\n$\n194\n$\n480\n$\n1,979\n$\n1,897\n$\n(286)\n(59.6)%\n$\n82\n4.3%\nDiluted earnings per common share\n$\n1.62\n$\n3.98\n$\n16.43\n$\n15.72\n$\n(2.36)\n(59.3)%\n$\n0.71\n4.5%\nBenefit ratio (a)\n91.1%\n89.9%\n89.3%\n89.2%\n1.2%\n0.1%\nOperating cost ratio (b)\n12.6%\n11.5%\n11.4%\n10.9%\n1.1%\n0.5%\nEffective tax rate\n(77.3)%\n24.4%\n20.1%\n24.9%\n(101.7)%\n(4.8)%\n(a)\nRepresents benefits expense as a percentage of premiums revenue.\n(b)\nRepresents operating costs, excluding depreciation and amortization, as a percentage of total revenues less investment income.\n38\nTable of Contents\nPremiums \nRevenue\nConsolidated premiums revenue increased $2.8 billion, or 9.9%, from $28.0 billion in the 2024 quarter to $30.7 billion in the 2025 quarter and increased $7.6 billion, or 9.0%, from $84.4 billion in the 2024 period to $91.9 billion in the 2025 period primarily due to higher per member Medicare premiums, largely driven by an increased direct subsidy due to the IRA, and higher per member state-based contracts premiums, as well as membership growth in the state-based contracts and stand-alone PDP businesses. These factors were partially offset by the membership decline within the individual Medicare Advantage business, inclusive of the decision to exit certain unprofitable plans and counties. \nServices Revenue\nConsolidated services revenue increased $0.5 billion, or 45.1%, from $1.1 billion in the 2024 quarter to $1.6 billion in the 2025 quarter and increased $1.1 billion, or 32.7%, from $3.3 billion in the 2024 period to $4.3 billion in the 2025 period primarily due to higher revenues associated with growth in the primary care and pharmacy solutions businesses, partially offset by the impact of the v28 risk model revision impacting the Primary Care business. \nInvestment Income\nInvestment income decreased $5 million, or 1.5%, from $343 million in the 2024 quarter to $338 million in the 2025 quarter and decreased $55 million, or 5.9%, from $929 million in the 2024 period to $874 million in the 2025 period primarily due to lower interest income on debt securities.\nBenefit Expense    \nConsolidated benefits expense increased $2.9 billion, or 11.4%, from $25.1 billion in the 2024 quarter to $28.0 billion in the 2025 quarter and increased $6.8 billion, or 9.0%, from $75.3 billion in the 2024 period to $82.1 billion in the 2025 period. The consolidated benefit ratio increased 120 basis points from 89.9% for the 2024 quarter to 91.1% for the 2025 quarter and increased 10 basis points from 89.2% for the 2024 period to 89.3% for the 2025 period primarily reflecting a shift in line of business mix resulting growth in the state-based contracts and stand-alone PDP businesses that carry a higher benefit ratio, combined with a reduction in individual Medicare Advantage membership, as well as incremental investments to improve member and patient outcomes and support operational excellence. These factors were partially offset by individual Medicare Advantage pricing inclusive of plan exits and benefit design changes that more than offset claims trend and the funding environment, as well as higher favorable prior-period medical claims development in the 2025 quarter and period. Further, the quarter comparison was negatively impacted in the 2025 quarter as a result of the change in Medicare Part D seasonality due to the IRA and the period comparison was affected by the favorable workday impact in the 2025 period combined with the favorability associated with the change in Medicare Part D seasonality due to the IRA.   \nConsolidated benefits expense included $275 million of favorable prior-period medical claims reserve development in the 2025 quarter and $24 million of favorable prior-period medical claims development in the 2024 quarter. Consolidated benefits expense included $913 million of favorable prior-period medical claims reserve development in the 2025 period and $693 million of favorable prior-period medical claims reserve development in the 2024 period. Prior-period medical claims reserve development decreased the consolidated benefit ratio by approximately 90 basis points in the 2025 quarter and decreased the consolidated benefit ratio by approximately 10 basis points in the 2024 quarter. Prior-period medical claims reserve development decreased the consolidated benefit ratio by approximately 100 basis points in the 2025 period and decreased the consolidated benefit ratio by approximately 80 basis points in the 2024 period.\nOperating Costs\nOur segments incur both direct and shared indirect operating costs. We allocate the indirect costs shared by the segments primarily as a function of revenues. As a result, the profitability of each segment is interdependent.\n39\nTable of Contents\nConsolidated operating costs increased $0.7 billion, or 22.3%, from $3.3 billion in the 2024 quarter to $4.1 billion in the 2025 quarter and increased $1.5 billion, or 15.6%, from $9.5 billion in the 2024 period to $11.0 billion in the 2025 period. The consolidated operating cost ratio increased 110 basis points from 11.5% for the 2024 quarter to 12.6% for the 2025 quarter\n \nand increased 50 basis points from 10.9% for the 2024 period to 11.4% for the 2025 period primarily due to business mix changes, including within the CenterWell segment that runs a significantly higher operating cost ratio than the Insurance segment, combined with the operating leverage impact of the loss of individual Medicare Advantage membership, as well as the impact of charges associated with the value creation initiatives, primarily related to severance in connection with workforce optimization and external consulting spend. The value creation initiative charges were recorded at the corporate level and not allocated to the segments. These factors were partially offset by administrative cost efficiencies resulting from the value creation initiatives and operating leverage associated with increased revenues from the impact of the IRA as previously described. \nDepreciation and Amortization\nDepreciation and amortization decreased $37 million, or 17.6%, from $210 million in the 2024 quarter to $173 million in the 2025 quarter and decreased $97 million, or 15.4%, from $631 million in the 2024 period to $534 million in the 2025 period primarily due to decreased capital spending.\nInterest Expense\nInterest expense remained relatively unchanged from the 2024 quarter and period to the 2025 quarter and period.\nIncome Taxes\nThe effective income tax rate was (77.3)% and 20.1% for the three and nine months ended September 30, 2025, respectively, and 24.4% and 24.9% for the three and nine months ended September 30, 2024, respectively. The 2025 quarter and period effective income tax rate reflect the impact of a tax loss on sale of business, which exceeded the book loss. The related tax benefit is realizable via capital loss carryback.\n40\nTable of Contents\nInsurance Segment\n \nSeptember 30,\nChange\n \n2025\n2024\nMembers\n%\nMembership:\nIndividual Medicare Advantage\n5,237,300 \n5,659,200 \n(421,900)\n(7.5)\n%\nGroup Medicare Advantage\n569,800 \n546,700 \n23,100 \n4.2 \n%\nMedicare stand-alone PDP\n2,446,200 \n2,315,700 \n130,500 \n5.6 \n%\nTotal Medicare\n8,253,300 \n8,521,600 \n(268,300)\n(3.1)\n%\nMedicare Supplement\n474,700 \n357,300 \n117,400 \n32.9 \n%\nState-based contracts and other\n1,658,800 \n1,446,100 \n212,700 \n14.7 \n%\nMilitary services \n4,605,400 \n5,984,800 \n(1,379,400)\n(23.0)\n%\nCommercial fully-insured \n— \n25,900 \n(25,900)\n(100.0)\n%\nCommercial ASO \n— \n22,400 \n(22,400)\n(100.0)\n%\nTotal Medical Membership\n14,992,200 \n16,358,100 \n(1,365,900)\n(8.3)\n%\nTotal Specialty Membership\n4,710,800 \n4,566,800 \n144,000 \n3.2 \n%\nMembers may not be unique to each product since members have the ability to enroll in more than one product. \nChange\nThree months ended September 30,\nNine months ended September 30,\nThree months ended September 30, 2025 vs 2024\nNine months ended September 30, 2025 vs 2024\n2025\n2024\n2025\n2024\n$\n%\n$\n%\n($ in millions)\nPremiums and Services Revenue:\nPremiums:\nIndividual Medicare Advantage\n$\n22,456\n$\n21,856\n$\n67,901\n$\n66,519\n$\n600\n2.7%\n$\n1,382\n2.1%\nGroup Medicare Advantage\n2,240\n1,913\n6,822\n5,840\n327\n17.1%\n982\n16.8%\nMedicare stand-alone PDP\n1,755\n721\n4,924\n2,409\n1,034\n143.4%\n2,515\n104.4%\nTotal Medicare\n26,451\n24,490\n79,647\n74,768\n1,961\n8.0%\n4,879\n6.5%\nSpecialty benefits\n248\n238\n738\n717\n10\n4.2%\n21\n2.9%\nMedicare Supplement\n283\n217\n799\n620\n66\n30.4%\n179\n28.9%\nState-based contracts and other\n3,729\n2,921\n10,757\n7,756\n808\n27.7%\n3,001\n38.7%\nCommercial fully-insured \n—\n85\n—\n493\n(85)\n(100.0)%\n(493)\n(100.0)%\nPremiums revenue\n30,711\n27,951\n91,941\n84,354\n2,760\n9.9%\n7,587\n9.0%\nServices:\nMilitary services and other\n267\n214\n725\n671\n53\n24.8%\n54\n8.0%\nCommercial ASO \n—\n12\n—\n44\n(12)\n(100.0)%\n(44)\n(100.0)%\nServices revenue\n267\n226\n725\n715\n41\n18.1%\n10\n1.4%\nTotal external revenues\n$\n30,978\n$\n28,177\n$\n92,666\n$\n85,069\n$\n2,801\n9.9%\n$\n7,597\n8.9%\nIncome from operations\n$\n251\n$\n274\n$\n2,591\n$\n1,935\n$\n(23)\n(8.4)%\n$\n656\n33.9%\nBenefit ratio\n91.1%\n90.6%\n89.5%\n89.8%\n0.5%\n(0.3)%\nOperating cost ratio\n9.1%\n9.2%\n8.5%\n8.6%\n(0.1)%\n(0.1)%\n41\nTable of Contents\nIncome from operations\nInsurance segment income from operations decreased $23 million, or 8.4%, from $274 million in the 2024 quarter to $251 million in the 2025 quarter and increased $0.7 billion, or 33.9%, from $1.9 billion in the 2024 period to $2.6 billion in the 2025 period primarily due to the same factors impacting the Insurance segment's benefit and operating cost ratios as more fully described below. \nEnrollment \nIndividual Medicare Advantage membership decreased 421,900 members, or 7.5%, from September 30, 2024 to September 30, 2025, inclusive of the decision to exit certain unprofitable plans and counties. Individual Medicare Advantage membership includes 765,800 D-SNP members as of September 30, 2025, a net decrease of 173,800 D-SNP members, or 18.5%, from 939,600 D-SNP members as of September 30, 2024.\nGroup Medicare Advantage membership increased 23,100 members, or 4.2%, from September 30, 2024 to September 30, 2025, consistent with expectations as we maintain pricing discipline in a competitive market.\nMedicare stand-alone PDP membership increased 130,500 members, or 5.6%, from September 30, 2024 to September 30, 2025, reflecting shifting competitive dynamics. \nState-based contracts and other membership increased 212,700 members, or 14.7%, from September 30, 2024 to September 30, 2025, reflecting allocation of additional membership in Kentucky and Ohio, as well as additional membership related to the Virginia contract implemented in the 2025 quarter.\nSpecialty membership remained largely unchanged from September 30, 2024 to September 30, 2025.\nPremiums Revenue\nInsurance segment premiums revenue increased $2.8 billion, or 9.9%, from $28.0 billion in the 2024 quarter to $30.7 billion in the 2025 quarter and increased $7.6 billion, or 9.0%, from $84.4 billion in the 2024 period to $91.9 billion in the 2025 period primarily due to higher per member Medicare premiums, largely driven by an increased direct subsidy due to the IRA, and higher per member state-based contracts premiums, as well as membership growth in the state-based contracts and stand-alone PDP businesses. These factors were partially offset by the membership decline within the individual Medicare Advantage business, inclusive of the decision to exit certain unprofitable plans and counties. \nServices \nRevenue\nInsurance segment services revenue increased $41 million, or 18.1%, from $226 million in the 2024 quarter to $267 million in the 2025 quarter and increased $10 million, or 1.4%, from $715 million in the 2024 period to $725 million in the 2025 period.\nBenefits Expense\nThe Insurance segment benefit ratio increased 50 basis points from 90.6% for the 2024 quarter to 91.1% for the 2025 quarter primarily reflecting a shift in line of business mix resulting growth in the state-based contracts and stand-alone PDP businesses that carry a higher benefit ratio, combined with a reduction in individual Medicare Advantage membership, as well as incremental investments to improve member and patient outcomes and support operational excellence. These factors were partially offset by individual Medicare Advantage pricing inclusive of plan exits and benefit design changes that more than offset claims trend and the funding environment, as well as higher favorable prior-period medical claims development in the 2025 quarter. Further, the quarter comparison was negatively impacted in the 2025 quarter as a result of the change in Medicare Part D seasonality due to the IRA. The Insurance segment benefit ratio decreased 30 basis points from 89.8% for the 2024 period to 89.5% for the 2025 period resulting from the net favorable impact of the factors impacting the quarterly comparison. The period comparison was further affected by the favorable workday impact in the 2025 period combined with the favorability associated with the change in Medicare Part D seasonality due to the IRA. \n42\nTable of Contents\nOperating Costs\nThe Insurance segment operating cost ratio decreased 10 basis points from 9.2% for the 2024 quarter to 9.1% for the 2025 quarter and decreased 10 basis points from 8.6% for the 2024 period to 8.5% for the 2025 period primarily due to administrative cost efficiencies resulting from the value creation initiatives and operating leverage associated with increased revenues from the impact of the IRA as previously described. These factors were partially offset by the operating leverage impact of the loss of individual Medicare Advantage membership.\nCenterWell Segment\nChange\nThree months ended September 30,\nNine months ended September 30,\nThree months ended September 30, 2025 vs 2024\nNine months ended September 30, 2025 vs 2024\n2025\n2024\n2025\n2024\n$\n%\n$\n%\n($ in millions)\nRevenues:\nServices:\nHome solutions\n$\n354\n$\n326\n$\n1,049\n$\n996\n$\n28\n8.6%\n$\n53\n5.3%\nPharmacy solutions\n352\n232\n951\n672\n120\n51.7%\n279\n41.5%\nPrimary care\n627\n319\n1,609\n882\n308\n96.6%\n727\n82.4%\nTotal external revenues\n1,333\n877\n3,609\n2,550\n456\n52.0%\n1,059\n41.5%\nIntersegment revenues:\nHome solutions\n531\n525\n1,591\n1,509\n6\n1.1%\n82\n5.4%\nPharmacy solutions\n3,078\n2,701\n8,458\n7,963\n377\n14.0%\n495\n6.2%\nPrimary care\n937\n938\n2,853\n2,784\n(1)\n(0.1)%\n69\n2.5%\nIntersegment revenues\n4,546\n4,164\n12,902\n12,256\n382\n9.2%\n646\n5.3%\nTotal revenues\n$\n5,879\n$\n5,041\n$\n16,511\n$\n14,806\n$\n838\n16.6%\n$\n1,705\n11.5%\nIncome from operations\n$\n305\n$\n382\n$\n1,041\n$\n1,002\n$\n(77)\n(20.2)%\n$\n39\n3.9%\nOperating cost ratio\n93.9%\n91.3%\n92.7%\n92.1%\n2.6%\n0.6%\nIncome from operations\nCenterWell income from operations decreased $77 million, or 20.2%, from $382 million in the 2024 quarter to $305 million in the 2025 quarter and increased $39 million, or 3.9%, from $1,002 million in the 2024 period to $1,041 million in the 2025 period primarily due to the same factors impacting the CenterWell segment's revenue and operating cost ratio as more fully described below. \nServices Revenue\nCenterWell external services revenue increased $0.5 billion, or 52.0%, from $0.9 billion in the 2024 quarter to $1.3 billion in the 2025 quarter and increased $1.1 billion, or 41.5%, from $2.6 billion in the 2024 period to $3.6 billion in the 2025 period primarily due to higher revenues associated with growth in the primary care and pharmacy solutions businesses, partially offset by the impact of the v28 risk model revision impacting the Primary Care business. \nIntersegment Revenue\nCenterWell intersegment revenues increased $0.4 billion, or 9.2%, from $4.2 billion in the 2024 quarter to $4.5 billion in the 2025 quarter and increased $0.6 billion, or 5.3%, from $12.3 billion in the 2024 period to $12.9 billion in the 2025 period primarily due to higher revenues associated with growth in the pharmacy solutions business.\n43\nTable of Contents\nOperating Costs\nThe CenterWell segment operating cost ratio increased 260 basis points from 91.3% for the 2024 quarter to 93.9% for the 2025 quarter and increased 60 basis points from 92.1% for the 2024 period to 92.7% for the 2025 period primarily resulting from the continued phase-in of the v28 risk model revision within the primary care business, as well as the uptick of volume within CenterWell Specialty Pharmacy, which carries a higher operating cost ratio than the traditional pharmacy business. These factors were partially offset by more favorable operating trends in the primary care business as a result of maturation of the v28 mitigation activities, as well as administrative cost efficiencies resulting from the value creation initiatives. \nLiquidity\nHistorically, our primary sources of cash have included receipts of premiums, services revenue, and investment and other income, as well as proceeds from the sale or maturity of our investment securities, and borrowings. Our primary uses of cash historically have included disbursements for claims payments, operating costs, interest on borrowings, taxes, purchases of investment securities, acquisitions, capital expenditures, repayments on borrowings, dividends, and share repurchases. As premiums generally are collected in advance of claim payments by a period of up to several months, our business normally should produce positive cash flows during periods of increasing premiums and enrollment. Conversely, cash flows would be negatively impacted during periods of decreasing premiums and enrollment. From period to period, our cash flows may also be affected by the timing of working capital items including premiums receivable, benefits payable, and other receivables and payables. Our cash flows are impacted by the timing of payments to and receipts from CMS associated with Medicare Part D subsidies for which we do not assume risk. The use of cash flows may be limited by regulatory requirements of state departments of insurance (or comparable state regulators) which require, among other items, that our regulated subsidiaries maintain minimum levels of capital and seek approval before paying dividends from the subsidiaries to the parent. Our use of cash flows derived from our non-insurance subsidiaries, such as in our CenterWell segment, is generally not restricted by state departments of insurance (or comparable state regulators).\nFor additional information regarding our liquidity risk, refer to Part I, Item 1A, \"Risk Factors\" in our 2024 Form 10-K and Part II, Item 1A, \"Risk Factors\" of this Form 10-Q.\nCash and cash equivalents increased to approximately $5.4 billion at September 30, 2025 from $2.2 billion at December 31, 2024. The change in cash and cash equivalents for the nine months ended September 30, 2025 and 2024 is summarized as follows:\nNine Months Ended\n2025\n2024\n \n(in millions)\nNet cash provided by operating activities\n$\n2,573 \n$\n3,494 \nNet cash provided by (used in) investing activities\n1,641 \n(2,889)\nNet cash used in financing activities\n(1,047)\n(183)\nIncrease in cash and cash equivalents\n$\n3,167 \n$\n422 \nCash Flow from Operating Activities \nCash flows provided by operations of $2.6 billion in the 2025 period decreased $0.9 billion from cash flows provided by operations of $3.5 billion in the 2024 period. The decrease in our operating cash flows primarily reflected the unfavorable impact of working capital items, partially offset by higher earnings in the 2025 period.  \nThe most significant drivers of changes in our working capital are typically the timing of payments of benefits expense and receipts for premiums. Benefits expense includes claim payments, capitation payments, pharmacy costs net of rebates, allocations of certain centralized expenses and various other costs incurred to provide health insurance coverage to members, as well as estimates of future payments to hospitals and others for medical care and other supplemental benefits provided on or prior to the balance sheet date. For additional information regarding our benefits payable and benefits expense recognition, refer to Note 2 to the audited Consolidated Financial Statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" in our 2023 Form 10-K. \n44\nTable of Contents\nThe detail of total net receivables at September 30, 2025 and December 31, 2024 and reconciliation to cash flow for the nine months ended September 30, 2025 and 2024 was as follows:\nSeptember 30, 2025\nDecember 31, 2024\n2025 Period Change\n2024 Period Change\n \n(in millions)\nMedicare\n$\n1,689 \n$\n1,745 \n$\n(56)\n$\n(137)\nState-based contracts\n669 \n614 \n55 \n202 \nMilitary services\n135 \n180 \n(45)\n47 \nOther\n315 \n263 \n52 \n2 \nAllowances\n(124)\n(98)\n(26)\n(5)\nTotal net receivables\n$\n2,684 \n$\n2,704 \n$\n(20)\n$\n109 \nReconciliation to cash flow statement:\nReceivables disposed\n4 \n— \nChange in receivables per cash flow statement \n$\n(16)\n$\n109 \n   The change in Medicare receivables for the 2025 period reflects lower individual Medicare Advantage membership partially offset by higher per member Medicare premiums, driven largely by an increased direct subsidy due to the IRA. The change in Medicare receivables for the 2024 period reflects individual Medicare Advantage membership growth. In addition, both periods further reflect the typical pattern caused by the timing of accruals and related collections associated with the CMS risk-adjustment model. Significant collections occur with the mid-year and final settlements with CMS in the second and third quarter. \nCash Flow from Investing Activities\nAcquisition and divestiture related activities did not have a material impact on our cash flows during the 2025 period and 2024 period.\nOur ongoing capital expenditures primarily relate to our information technology initiatives, support of services in our primary care operations including medical and administrative facility improvements necessary for activities such as the provision of care to members, claims processing, billing and collections, wellness solutions, care coordination, regulatory compliance and customer service. Total net capital expenditures, excluding acquisitions, were $344 million in the 2025 period and $421 million in the 2024 period.\nNet proceeds of investment securities were $1.9 billion in the 2025 period and net purchases of investment securities were $2.4 billion in the 2024 period.\nCash Flow from Financing Activities \nClaim payments were higher than receipts from CMS associated with Medicare Part D claim subsidies for which we do not assume risk by $1.2 billion and $0.6 billion in the 2025 and 2024 periods, respectively.\nUnder our administrative services only TRICARE contracts, health care costs payments for which we do not assume risk exceeded reimbursements from the federal government by $8 million and $75 million in the 2025 and 2024 periods, respectively.\nIn March 2025, we issued $750 million of 5.550% unsecured senior notes due May 1, 2035, $500 million of 6.000% unsecured senior notes due May 1, 2055, and an additional $250 million of our existing 5.375% unsecured senior notes due April 15, 2031. Our net proceeds, reduced for the underwriters' discounts and commissions paid, were $1.5 billion. We used the net proceeds of these offerings to repay the remaining $577 million aggregate principal amount of our 4.500% unsecured senior notes on their maturity date of April 1, 2025. The remaining net proceeds will be used for general corporate purposes, which may include the repayment of our existing indebtedness, including borrowings under our commercial paper program. \n45\nTable of Contents\nIn May 2025, we entered into a Rule 10b5-1 Repurchase Plan to repurchase a portion of our $750 million aggregate principal amount of 1.350% senior notes maturing in February 2027 and a portion of our $600 million aggregate principal amount of 3.950% senior notes maturing in March 2027 during the period beginning on May 1, 2025 and ending on August 29, 2025. For the period ended September 30, 2025, we repurchased $200 million principal amount of these senior notes for approximately $194 million cash.\n In March 2024, we issued $1.3 billion of 5.375% unsecured senior notes due April 15, 2031 and $1.0 billion of 5.750% unsecured senior notes due April 15, 2054. Our net proceeds, reduced for the underwriters' discounts and commissions paid, were $2.2 billion. We used the net proceeds for general corporate purposes, which included the repayment of existing indebtedness, including borrowings under our commercial paper program.\nIn 2024, we entered into a securities lending program where we loan certain investment securities for short periods of time in exchange for collateral. In 2024, we also entered into an uncommitted receivables purchase facility under which certain pharmaceutical rebate receivables may be sold on a non-recourse basis to a financial institution. In the 2025 period net proceeds from the securities lending program were $141 million and net repayments from the uncommitted receivables purchase facility were $123 million. In the 2024 period, net proceeds from the securities lending program were $361 million.\nNet repayments from the issuance of commercial paper were $5 million and $895 million in the 2025 period and 2024 period, respectively. The maximum principal amount outstanding at any one time during the 2025 period was $1.2 billion. \nWe repurchased common shares for $109 million and $768 million in the 2025 period and 2024 period, respectively, under share repurchase plans authorized by the Board of Directors and in connection with employee stock plans. \nWe paid dividends to stockholders of $321 million and $323 million during the 2025 period and 2024 period, respectively.\nFuture Sources and Uses of Liquidity\nDividends\nFor additional information regarding our dividends to stockholders, refer to Note 10 to the unaudited Consolidated Financial Statements included in Part I, Item 1, \"Financial Statements\" of this Form 10-Q.\nStock Repurchases\nFor additional information regarding stock repurchases, refer to Note 10 to the unaudited Consolidated Financial Statements included in Part I, Item 1, \"Financial Statements\" of this Form 10-Q.\nDebt\nFor additional information regarding debt, including our senior notes, term loans, revolving credit agreements, commercial paper program and other short-term borrowings, refer to Note 12 to the unaudited Consolidated Financial Statements included in Part I, Item 1, \"Financial Statements\" of this Form 10-Q.\nAcquisitions and Divestitures\n \nFor additional information regarding acquisitions and divestitures, refer to Note 3 to the unaudited Consolidated Financial Statements included in Part I, Item 1, \"Financial Statements\" of this Form 10-Q.\nLiquidity Requirements\nWe believe our cash balances, investment securities, operating cash flows, and funds available under our credit agreement and our commercial paper program or from other public or private financing sources, taken together, provide adequate resources to fund ongoing operating and regulatory requirements, acquisitions, future expansion \n46\nTable of Contents\nopportunities, and capital expenditures for at least the next twelve months, as well as to refinance or repay debt, and repurchase shares. \nAdverse changes in our credit rating may increase the rate of interest we pay and may impact the amount of credit available to us in the future. Our investment-grade credit rating at September 30, 2025 was BBB according to Standard & Poor’s Rating Services, or S&P, and Baa2 according to Moody’s Investors Services, Inc., or Moody’s. A downgrade by S&P to BB+ or by Moody’s to Ba1 triggers an interest rate increase of 25 basis points with respect to $250 million of our senior notes. Successive one notch downgrades increase the interest rate an additional 25 basis points, or annual interest expense by $1 million, up to a maximum 100 basis points, or annual interest expense by $3 million.\nIn addition, we operate as a holding company in a highly regulated industry. Humana Inc., our parent company, is dependent upon dividends and administrative expense reimbursements from our subsidiaries, most of which are subject to regulatory restrictions. We continue to maintain significant levels of aggregate excess statutory capital and surplus in our state-regulated operating subsidiaries. Cash, cash equivalents, and short-term investments at the parent company were $1.9 billion at September 30, 2025 compared to $562 million at December 31, 2024. This increase primarily reflects working capital changes, net proceeds from the issuance of senior notes, and proceeds from sale of business,\n \npartially offset by repayments of senior notes, capital contributions to certain subsidiaries, cash dividends to shareholders, capital expenditures, and common stock repurchases. Our use of operating cash derived from our non-insurance subsidiaries, such as our CenterWell segment, is generally not restricted by departments of insurance (or comparable state regulators).\nRegulatory Requirements\nCertain of our subsidiaries operate in states that regulate the payment of dividends, loans, or other cash transfers to Humana Inc., our parent company, and require minimum levels of equity as well as limit investments to approved securities. The amount of dividends that may be paid to Humana Inc. by these subsidiaries, without prior approval by state regulatory authorities, or ordinary dividends, is limited based on the entity’s level of statutory income and statutory capital and surplus. If the dividend, together with other dividends paid within the preceding twelve months, exceeds a specified statutory limit or is paid from sources other than earned surplus, it is generally considered an extraordinary dividend requiring prior regulatory approval. In most states, prior notification is provided before paying a dividend even if approval is not required.\nAlthough minimum required levels of equity are largely based on premium volume, product mix, and the quality of assets held, minimum requirements vary significantly at the state level. Based on the most recently filed statutory financial statements as of June 30, 2025, our state regulated subsidiaries had aggregate statutory capital and surplus of approximately $15.2 billion, which exceeded aggregate minimum regulatory requirements of $10.9 billion. The amount of ordinary dividends paid to our parent company was approximately $0.3 billion\n \nduring the nine months ended September 30, 2025 compared to $0.5 billion during the nine months ended September 30, 2024.  The amount, timing and mix of ordinary and extraordinary dividend payments will vary due to state regulatory requirements, the level of excess statutory capital and surplus and expected future surplus requirements related to, for example, premium volume and product mix.\n47\nTable of Contents"
}