{
  "source_file": "hwm-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\n(U.S. dollars in millions, except per share amounts)\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is intended to help the reader understand our results of operations and financial condition. The MD&A is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and notes thereto included in \nPart I, Item 1\n (Financial Statements and Supplementary Data) of this Form 10-Q.\nOverview\nHowmet is a global leader in lightweight metals engineering and manufacturing. Howmet’s innovative, multi-material products, which include nickel, titanium, aluminum, and cobalt, are used worldwide in the aerospace (commercial and defense), commercial transportation, and industrial and other markets.\nIn the nine months ended September 30, 2025, the Company derived approximately 69% of its revenue from products sold to the commercial and defense aerospace markets. Aircraft production in the aerospace industry continues to grow based on increases in demand for new aircraft and engine spares. Aircraft backlogs remain at record levels. We expect our aerospace demand to continue to grow, including engine spares. The Boeing Company (“Boeing”) has been gradually increasing its production rates over the past several months, and Airbus SE (“Airbus”) has also signaled that its production rates are increasing, particularly in narrow body aircraft. In October 2025, Boeing and the Federal Aviation Administration jointly agreed to production rate increases for the Boeing 737 MAX from 38 aircraft per month to 42 aircraft per month. Boeing and Airbus are the primary original equipment manufacturers (“OEMs”) of aircraft airframes, and these companies’ production levels have had and are expected to have a material impact on the financial performance of Howmet. The timing and level of future aircraft builds by OEMs are subject to changes and uncertainties, which may cause our future results to differ from prior periods due to changes in product mix in certain segments.\nRecent, ongoing changes in U.S. and international government policies, including executive orders on tariffs and retaliatory trade measures, are expected to impact the pricing of our products, disrupt supply chains, and increase our costs. The timing, extent, application, and level of tariffs by various governments and our ability to recover tariffs are subject to changes and uncertainties in all segments. While the tariff situation remains fluid, we expect to pass along the costs associated with tariffs to our customers in the form of a cost pass through mechanism. There may be a delay between an increase in our costs and our ability to recover the higher costs that could impact our margins.\nFor additional information regarding the ongoing risks related to our business, see section Part I, Item 1A, “Risk Factors” in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024.\nResults of Operations\nEarnings Summary:\nSales.\n Sales were $2,089 in the third quarter of 2025 compared to $1,835 in the third quarter of 2024, and $6,084 in the nine months ended September 30, 2025 compared to $5,539 in the nine months ended September 30, 2024. The increase of $254, or 14%, in the third quarter of 2025 and the increase of $545, or 10%, in the nine months ended September 30, 2025 was primarily due to growth in the commercial aerospace, defense aerospace, and industrial and other markets, including engine spares, favorable product pricing, and cost pass through, partially offset by lower volumes in the commercial transportation market. Product price increases are in excess of material and inflationary cost pass through to our customers.\nCost of goods sold (“COGS”).\n COGS as a percentage of Sales was 65.3% in the third quarter of 2025 compared to 68.3% in the third quarter of 2024 and 66.1% in the nine months ended September 30, 2025 compared to 69.1% in the nine months ended September 30, 2024. The decrease in the third quarter of 2025 was primarily due to higher volumes and favorable product pricing, partially offset by increased net headcount, primarily in the Engine Products segment, in support of expected revenue increases. The decrease in the nine months ended September 30, 2025 was primarily due to higher volumes, favorable product pricing, and productivity gains, partially offset by increased net headcount, primarily in the Engine Products segment, in support of expected revenue increases. The Company had no COGS net insurance reimbursements in the third quarter and nine months ended September 30, 2025, compared to $6 in the nine months ended September 30, 2024 due to the insurance claim related to substantial equipment damage at the Forged Wheels’ cast house in Barberton, Ohio from a mechanical failure (the “Barberton Cast House Incident”) that was settled in the second quarter of 2024.\nSelling, general administrative, and other expenses (“SG&A”). \nSG&A expenses were $100 in the third quarter of 2025 compared to $85 in the third quarter of 2024 and $274 in the nine months ended September 30, 2025 compared to $270 in the nine months ended September 30, 2024. The increase of $15, or 18%, in the third quarter of 2025 and $4, or 1%, in the nine months ended September 30, 2025 was primarily driven by higher employment costs and timing of other administrative expenses.\n26\nRestructuring and other charges (credits)\n. Restructuring and other credits were less than $1 in the third quarter of 2025 compared to Restructuring and other credits of $1 in the third quarter of 2024. Restructuring and other credits were $4 in the nine months ended September 30, 2025 compared to Restructuring and other charges of $21 in the nine months ended September 30, 2024. Restructuring and other credits for the third quarter of 2025 were primarily due to a gain related to post-closing adjustments from the May 2024 sale of a small U.K. manufacturing facility in Engineered Structures of $1 partially offset by exit related costs, including accelerated depreciation, of $1. Restructuring and other credits for the nine months ended September 30, 2025 were primarily due to a gain on the sale of assets at a small U.K. manufacturing facility in Engineered Structures of $3, a gain on the sale of assets at a previously closed facility in Forged Wheels of $2, a reversal of $2 for a layoff reserve related to a prior period, and a gain related to post-closing adjustments from the May 2024 sale of a small U.K. manufacturing facility in Engineered Structures of $1, partially offset by a charge for layoff costs of $3, and exit related costs, including accelerated depreciation, of $1. Restructuring and other credits for the third quarter of 2024 were primarily due to a $1 gain related to post-closing adjustments from the May 2024 sale of a small U.K. manufacturing facility in Engineered Structures. Restructuring and other charges for the nine months ended September 30, 2024 were primarily due to a net loss on the sale of a small U.K. manufacturing facility in Engineered Structures of $13 and layoff costs of $8.\nSee \nNote D\n to the Consolidated Financial Statements in \nPart I, Item 1\n of this Form 10-Q for additional detail.\nInterest expense, net\n. Interest expense, net was $37 in the third quarter of 2025 compared to $44 in the third quarter of 2024 and $114 in the nine months ended September 30, 2025 compared to $142 in the nine months ended September 30, 2024. The decrease of $7, or 16%, in the third quarter of 2025 and $28, or 20%, in the nine months ended September 30, 2025 was primarily due to the early redemptions of the \n6.875%\n Notes due May 2025 and the 5.125% Notes due October 2024 during various periods in 2024, and the early prepayment of its USD Term Loan Facility during various periods in 2025, partially offset by the August 2024 issuance of $500 aggregate principal amount of the 2031 Notes, net of the cross-currency swap that synthetically converted the 2031 Notes into a lower fixed-interest-rate Euro liability. On an annual basis, the debt reduction activities in 2025 will decrease Interest expense, net by approximately $8.\nSee \nNote N\n to the Consolidated Financial Statements in \nPart I, Item 1\n of this Form 10-Q for additional detail related to the Company’s debt.\nLoss on debt redemption. \nDebt redemption or tender premiums include the cost to redeem or repurchase certain of the Company’s notes at a price which may be equal to the greater of the principal amount or the sum of the present values of the remaining scheduled payments, discounted using a defined treasury rate plus a spread, or a price based on the market price of its notes. Loss on debt redemption was less than $1 in the third quarter of 2025 and in the nine months ended September 30, 2025 compared to $6 in the third quarter of 2024 and in the nine months ended  September 30, 2024. The decrease was primarily due to the debt redemption premiums paid in the third quarter of 2024 on the early redemption of the 2025 Notes.\nSee \nNote N\n to the Consolidated Financial Statements in \nPart I, Item I\n of this Form 10-Q for additional detail related to the Company’s debt.\nOther expense, net.\n Other expense, net was $10 in the third quarter of 2025 compared to $17 in the third quarter of 2024 and $33 in the nine months ended September 30, 2025 compared to $49 in the nine months ended September 30, 2024. The decrease in expense of $7 in the third quarter of 2025 was primarily due to an increase of foreign currency translation gains, net of $3, and a decrease in deferred compensation of $2. The decrease in expense of $16 in the nine months ended September 30, 2025 was primarily due to an increase of foreign currency translation gains, net of $13. Non-service related net periodic benefit costs related to defined benefit plans and other postretirement benefit plans is expected to be relatively flat for the full year 2025 versus 2024.\nSee \nNote F\n to the Consolidated Financial Statements in \nPart I, Item 1\n of this Form 10-Q for additional detail.\nProvision for income taxes. \nThe estimated annual effective tax rate, before discrete items, applied to ordinary income was 21.4% in both the third quarter and nine months ended September 30, 2025 compared to 20.9% in both the third quarter and nine months ended September 30, 2024. The tax rate including discrete items was 22.2% in the third quarter of 2025 compared to 6.2% in the third quarter of 2024. A discrete net tax benefit of $1 was recorded in the third quarter of 2025 compared to a discrete net tax benefit of $46 in the third quarter of 2024. The tax rate including discrete items was 19.4% in the nine months ended September 30, 2025 compared to 15.1% in the nine months ended September 30, 2024. A discrete net tax benefit of $27 was recorded in the nine months ended September 30, 2025 compared to a discrete net tax benefit of $58 recorded in the nine months ended September 30, 2024. The 2025 estimated annual effective tax rate was higher than the 2024 rate primarily due to higher state income taxes and non-deductible amounts in 2025 relative to increased profit before taxes. The One Big Beautiful Bill Act (“OBBB”) which was enacted on July 4, 2025, has not had a material impact on our estimated annual effective tax rate in 2025. Management continues to evaluate elections available under the OBBB which could impact the amount and timing of the Company’s U.S. tax deductions, as well as the recognition of its deferred tax assets and related valuation allowances. The Company expects a modest cash tax benefit in 2025. Howmet anticipates that the effective tax rate in 2025 before discrete items will be approximately 21.5%.\n27\nSee \nNote G\n to the Consolidated Financial Statements in \nPart I, Item 1\n of this Form 10-Q for additional detail.\nNet income.\n Net income was $385, or $0.95 per diluted share, in the third quarter of 2025 compared to $332, or $0.81 per diluted share, in the third quarter of 2024 and $1,136, or $2.79 per diluted share, in the nine months ended September 30, 2025 compared to $841, or $2.04 per diluted share, in the nine months ended September 30, 2024. The increase of $53 in the third quarter of 2025 and $295 in the nine months ended September 30, 2025 was primarily due to growth in the commercial aerospace, defense aerospace, and industrial and other markets, including engine spares, favorable product pricing, and a reduction in interest expense due to lower long-term debt levels, partially offset by lower volumes in the commercial transportation market.\nSegment Information\nThe Company’s operations consist of four worldwide reportable segments: Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels. Segment performance under Howmet’s management reporting system is evaluated based on Segment Adjusted EBITDA. The Company’s Chief Executive Officer, who has been determined to be our Chief Operating Decision Maker (“CODM”), believes that Segment Adjusted EBITDA provides information with respect to the Company’s operating performance and the Company’s ability to meet its financial obligations. Howmet’s definition of Segment Adjusted EBITDA (Earnings before interest, taxes, depreciation, and amortization) is net margin plus an add-back for depreciation and amortization. Net margin is equivalent to Sales minus the following items: Cost of goods sold; Selling, general administrative, and other expenses; Research and development expenses; and Provision for depreciation and amortization. Special items, including Restructuring and other charges (credits), are excluded from net margin and Segment Adjusted EBITDA. The Company’s CODM considers forecast-to-actual variances for Segment Adjusted EBITDA when allocating resources across the Company’s reportable segments. Segment Adjusted EBITDA may not be comparable to similarly titled measures of other companies. Differences between the total segment and consolidated totals are in Corporate. (See \nNote C\n to the Consolidated Financial Statements in \nPart I, Item 1\n of this Form 10-Q for a description of each segment).\nThe Company has aligned its operations consistent with how the Chief Executive Officer assesses operating performance and allocates capital.\nEngine Products\nThird quarter ended\nNine months ended\n \nSeptember 30,\nSeptember 30,\n \n2025\n2024\n2025\n2024\nThird-party sales\n$\n1,105 \n$\n945 \n$\n3,157 \n$\n2,763 \nSegment Adjusted EBITDA\n368 \n307 \n1,042 \n848 \nSegment Adjusted EBITDA Margin\n33.3 \n%\n32.5 \n%\n33.0 \n%\n30.7 \n%\nThird-party sales for the Engine Products segment increased $160, or 17%, in the third quarter of 2025 compared to the third quarter of 2024, primarily due to growth in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets, including engine spares growth.\nThird-party sales for the Engine Products segment increased $394, or 14%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to growth in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets, including engine spares growth.\nSegment Adjusted EBITDA for the Engine Products segment increased $61, or 20%, in the third quarter of 2025 compared to the third quarter of 2024, primarily due to growth in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets. The segment absorbed approximately 265 net headcount in the third quarter of 2025, in support of expected revenue increases.\nSegment Adjusted EBITDA for the Engine Products segment increased $194, or 23%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to growth in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets. The segment absorbed approximately 1,125 net headcount in the nine months ended September 30, 2025, in support of expected revenue increases.\nSegment Adjusted EBITDA Margin for the Engine Products segment increased approximately 80 basis points in the third quarter of 2025 compared to the third quarter of 2024, primarily due to growth in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets.\nSegment Adjusted EBITDA Margin for the Engine Products segment increased approximately 230 basis points in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to growth in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets.\n28\nIn 2025, as compared to 2024, demand in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets is expected to increase, including engine spares growth. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow. The timing, extent, application, and level of tariffs by various governments and our ability to recover tariffs are subject to changes and uncertainties.\nFastening Systems\nThird quarter ended\nNine months ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\nThird-party sales\n$\n448 \n$\n392 \n$\n1,291 \n$\n1,175 \nSegment Adjusted EBITDA\n138 \n102 \n391 \n295 \nSegment Adjusted EBITDA Margin\n30.8 \n%\n26.0 \n%\n30.3 \n%\n25.1 \n%\nThird-party sales for the Fastening Systems segment increased $56, or 14%, in the third quarter of 2025 compared to the third quarter of 2024, primarily due to growth in the commercial aerospace market, partially offset by lower volumes in the commercial transportation market.\nThird-party sales for the Fastening Systems segment increased $116, or 10%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to growth in the commercial and defense aerospace markets, partially offset by lower volumes in the commercial transportation market.\nSegment Adjusted EBITDA for the Fastening Systems segment increased $36, or 35%, in the third quarter of 2025 compared to the third quarter of 2024, primarily due to growth in the commercial aerospace market and productivity gains, partially offset by lower volumes in the commercial transportation market.\nSegment Adjusted EBITDA for the Fastening Systems segment increased $96, or 33%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to growth in the commercial and defense aerospace markets and productivity gains, partially offset by lower volumes in the commercial transportation market.\nSegment Adjusted EBITDA Margin for the Fastening Systems segment increased approximately 480 basis points in the third quarter of 2025 compared to the third quarter of 2024, primarily due to growth in the commercial aerospace market and productivity gains, partially offset by lower volumes in the commercial transportation market.\nSegment Adjusted EBITDA Margin for the Fastening Systems segment increased approximately 520 basis points in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to growth in the commercial and defense aerospace markets and productivity gains, partially offset by lower volumes in the commercial transportation market.\nIn 2025, as compared to 2024, demand in the commercial and defense aerospace markets is expected to increase, including potential new business resulting from a fire at a competitor’s facility. Demand in the commercial transportation market is not expected to recover in 2025, given tariff-related, economic, and regulatory uncertainty in North America. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow. The timing, extent, application, and level of tariffs by various governments and our ability to recover tariffs are subject to changes and uncertainties.\nEngineered Structures \nThird quarter ended\nNine months ended\n \nSeptember 30,\nSeptember 30,\n \n2025\n2024\n2025\n2024\nThird-party sales\n$\n289 \n$\n253 \n$\n861 \n$\n790 \nSegment Adjusted EBITDA\n58 \n38 \n180 \n115 \nSegment Adjusted EBITDA Margin\n20.1 \n%\n15.0 \n%\n20.9 \n%\n14.6 \n%\nThird-party sales for the Engineered Structures segment increased $36, or 14%, in the third quarter of 2025 compared to the third quarter of 2024, primarily due to growth in the defense and commercial aerospace markets.\n29\nThird-party sales for the Engineered Structures segment increased $71, or 9%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to growth in the defense aerospace market. The Engineered Structures segment is focusing on the optimization of its manufacturing footprint and rationalization of product mix in order to maximize profitability.\nSegment Adjusted EBITDA for the Engineered Structures segment increased $20, or 53%, in the third quarter of 2025 compared to the third quarter of 2024, primarily due to growth in the defense and commercial aerospace markets.\nSegment Adjusted EBITDA for the Engineered Structures segment increased $65, or 57% in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to growth in the defense aerospace market and productivity gains. The Engineered Structures segment is focusing on the optimization of its manufacturing footprint and rationalization of product mix in order to maximize profitability.\nSegment Adjusted EBITDA Margin for the Engineered Structures\n \nsegment increased approximately 510 basis points in the third quarter of 2025 compared to the third quarter of 2024, primarily due to growth in the defense and commercial aerospace markets.\nSegment Adjusted EBITDA Margin for the Engineered Structures\n \nsegment increased approximately 630 basis points in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to growth in the defense aerospace market and productivity gains.\nIn 2025, as compared to 2024, demand in the defense aerospace market is expected to increase with a balanced commercial aerospace demand as a result of rationalization of product mix. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow. The timing, extent, application, and level of tariffs by various governments and our ability to recover tariffs are subject to changes and uncertainties.\nForged Wheels\nThird quarter ended\nNine months ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\nThird-party sales\n$\n247 \n$\n245 \n$\n775 \n$\n811 \nSegment Adjusted EBITDA\n73 \n64 \n217 \n221 \nSegment Adjusted EBITDA Margin\n29.6 \n%\n26.1 \n%\n28.0 \n%\n27.3 \n%\nThird-party sales for the Forged Wheels segment increased $2, or 1%, in the third quarter of 2025 compared to the third quarter of 2024, with lower volumes in the commercial transportation market more than offset by an increase in aluminum cost pass through.\nThird-party sales for the Forged Wheels segment decreased $36, or 4%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to lower volumes in the commercial transportation market, partially offset by an increase in aluminum cost pass through.\nSegment Adjusted EBITDA for the Forged Wheels segment increased $9, or 14%, in the third quarter of 2025 compared to the third quarter of 2024, primarily due to cost reductions, including lower net headcount, in response to lower volumes in the commercial transportation market, as well as favorable foreign currency exchange rates.\nSegment Adjusted EBITDA for the Forged Wheels segment decreased $4, or 2%, in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to lower volumes in the commercial transportation market, partially offset by cost reductions, including lower net headcount, in response to lower volumes in the commercial transportation market, as well as favorable foreign currency exchange rates.\nSegment Adjusted EBITDA Margin for the Forged Wheels segment increased approximately 350 basis points in the third quarter of 2025 compared to the third quarter of 2024, primarily due to cost reductions, including lower net headcount, in response to lower volumes in the commercial transportation market, as well as favorable foreign currency exchange rates, partially offset by higher aluminum cost pass through.\nSegment Adjusted EBITDA Margin for the Forged Wheels segment increased approximately 70 basis points in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily due to cost reductions in response to lower volumes in the commercial transportation market, as well as favorable foreign currency exchange rates, partially offset by higher aluminum cost pass through.\n30\nIn 2025, as compared to 2024, demand in the commercial transportation markets served by Forged Wheels is expected to continue to decrease throughout the remainder of the year. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow. The timing, extent, application, and level of tariffs by various governments and our ability to recover tariffs are subject to changes and uncertainties.\nReconciliation of Total Segment Adjusted EBITDA to Income before income taxes\nThird quarter ended\nNine months ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\nIncome before income taxes\n$\n495 \n$\n354 \n$\n1,410 \n$\n991 \nLoss on debt redemption\n— \n6 \n— \n6 \nInterest expense, net\n37 \n44 \n114 \n142 \nOther expense, net\n10 \n17 \n33 \n49 \nOperating income\n$\n542 \n$\n421 \n$\n1,557 \n$\n1,188 \nSegment provision for depreciation and amortization\n70 \n66 \n205 \n198 \nUnallocated amounts:\nRestructuring and other (credits) charges\n— \n(1)\n(4)\n21 \nCorporate expense\n25 \n25 \n72 \n72 \nTotal Segment Adjusted EBITDA\n$\n637 \n$\n511 \n$\n1,830 \n$\n1,479 \nTotal Segment Adjusted EBITDA is a non-GAAP financial measure. Management believes that this measure is meaningful to investors because it provides additional information with respect to the Company’s operating performance and the Company’s ability to meet its financial obligations. Differences between the total segment and consolidated totals are in Corporate. \nSee Restructuring and other charges (credits), Interest expense, net, and Other expense, net discussions above, under “Results of Operations” for reference.\nCorporate expense remained flat in the third quarter of 2025 and in the nine months ended September 30, 2025 compared to the third quarter of 2024 and the nine months ended September 30, 2024 due to a decrease in plant fire reimbursements from the Barberton Cast House Incident of $6, offset by a decrease in loss on debt redemption of $6.\nEnvironmental Matters\nSee the Environmental Matters section of \nNote P\n to the Consolidated Financial Statements in \nPart I, Item 1\n of this Form 10-Q.\nSubsequent Events\nSee \nNote Q\n to the Consolidated Financial Statements in \nPart I, Item 1\n of this Form 10-Q for subsequent events. \nLiquidity and Capital Resources\nOperating Activities\nCash provided from operations was $1,230 in the nine months ended September 30, 2025 compared to $818 in the nine months ended September 30, 2024. The increase of $412, or 50%, was primarily due to higher operating results of $309, favorable changes in accounts payable of $84, inventories of $44, accrued expenses of $40, which includes compensation-related payments, and increased advanced payments within noncurrent liabilities of $33, partially offset by unfavorable changes in receivables of $83, and prepaid expenses and other current assets of $20.\nManagement expects Howmet’s estimated pension contributions and other postretirement benefit payments in 2025 to be approximately $65.\n31\nFinancing Activities\nCash used for financing activities was $820 in the nine months ended September 30, 2025 compared to $742 in the nine months ended September 30, 2024. The increase of $78, or 11%, was primarily due to decreased additions to debt of $500, increased common stock repurchases of $190, increased dividends paid to common stock shareholders of $55 due to a $0.04 increase in dividends per common share, from $0.08 to $0.12 per share from the third quarter of 2024 to the third quarter of 2025, and decreased proceeds from exercise of employee stock options of $6, partially offset by decreased payments on debt of $665, debt issuance costs of $5, premiums paid on an early redemption of debt of $5, and taxes paid for the net share settlement of equity awards of $3. On an annual basis, the current year debt actions are expected to reduce Interest expense, net by approximately $8.\nThe Board of Directors of Howmet Aerospace established a 2025 dividend policy to pay cash dividends on the Company’s common stock in 2025 at a rate of 15% plus or minus 5% of net income excluding special items. The declaration of future common stock dividends is subject to the discretion and approval of the Board of Directors of Howmet after the Board’s consideration of all factors it deems relevant and subject to applicable law. The Company may modify, suspend, or cancel the dividend policy in any manner and at any time that it may deem necessary or appropriate.\nThe Company maintains a credit facility (the “Credit Facility”) pursuant to its Five-Year Revolving Credit Agreement (the “Credit Agreement”) with a syndicate of lenders and issuers named therein (See \nNote N\n to the Consolidated Financial Statements in \nPart I, Item 1\n of this Form 10-Q for reference). \nThere were no amounts outstanding under the Credit Agreement as of September 30, 2025 or December 31, 2024, and no amounts were borrowed during 2025 or 2024 under the Credit Agreement. \nThe Company has a commercial paper program under which the Company may issue unsecured commercial paper from time to time up to a maximum aggregate face amount of \n$1,000\n. The Company’s commercial paper will be sold on customary terms in the U.S. commercial paper market on a private placement basis. The proceeds of the commercial paper will be used for general corporate purposes. In conjunction with the commercial paper program, the Company was assigned short-term credit ratings by Moody’s Investors Service, Inc., S&P Global Ratings, and Fitch Ratings, Inc.\nThe Company has an effective shelf registration statement on Form S-3, filed with the SEC, which allows for offerings of debt securities from time to time. The Company may opportunistically issue new debt securities in accordance with securities laws or utilize commercial paper in order to, but not limited to, refinance existing indebtedness. The Company continues to evaluate whether, when, and to what extent it may access capital markets, including any plans to refinance the\n JPY Term Loan Facility due November 2026 or the 5.900% Notes due February 2027\n. Our ability to refinance our indebtedness or enter into alternative financings in adequate amounts on commercially reasonable terms, or terms acceptable to us, may be affected by circumstances and economic events outside of our control. In the event that a refinancing does not occur before the November 2026 maturity date of the JPY Term Loan Facility, the Company believes that its projected cash on hand and availability under the Credit Facility and its commercial paper program will enable the Company to repay the JPY Term Loan Facility.\nIn the future, the Company may, from time to time, redeem portions of its debt securities or repurchase portions of its debt or equity securities, in either the open market or through privately negotiated transactions, in accordance with applicable SEC and other legal requirements. The timing, prices, and sizes of purchases depend upon prevailing trading prices, general economic and market conditions, and other factors, including applicable securities laws. Such purchases may be completed by means of trading plans established from time to time in accordance with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended, block trades, private transactions, open market repurchases, tender offers, and/or accelerated share repurchase agreements, or other derivative transactions. \nThe Company’s costs of borrowing and ability to access the capital markets are affected not only by market conditions but also by the short-term and long-term debt ratings assigned to the Company by the major credit rating agencies. The Company believes that its cash on hand, cash provided from operations and availability of its Credit Facility, its commercial paper program, and its accounts receivables securitization program will continue to be sufficient to fund our operating and capital allocation activities.\n32\nThe three major credit rating agencies have rated Howmet’s debt with investment grade ratings. The Company’s most recent short-term and long-term credit ratings, as well as the current outlook from the three major credit rating agencies are as follows:\n \nShort-Term\nLong-Term\nOutlook\nS&P Global Ratings (“S&P”)\nA-2\nBBB+\nStable\nMoody’s Investors Service, Inc. (“Moody’s”)\nP-2\nBaa1\nStable\nFitch Ratings, Inc. (“Fitch”)\nF1\nBBB+\nStable\nOn September 8, 2025, S&P upgraded Howmet’s long-term debt rating from BBB to BBB+, and affirmed the current short-term debt rating and outlook at A-2 and stable, respectively, citing strong demand for commercial aerospace components, margin gains, and debt reduction.\nOn March 31, 2025, Fitch upgraded Howmet’s short-term debt rating from F2 to F1 and long-term debt rating from BBB to BBB+, and updated the current outlook from positive to stable, citing deleveraging actions, conservative capital allocation and strong free cash flow generation.\nOn August 6, 2024, Moody’s upgraded Howmet’s short-term debt rating from P-3 to P-2, further upgraded Howmet’s long-term debt rating two notches from Baa3 to Baa1 citing demand in the markets served by Howmet along with the Company’s improved financial leverage, and updated the current outlook from positive to stable.\nInvesting Activities\nCash used for investing activities was $316 in the nine months ended September 30, 2025 compared to $209 in the nine months ended September 30, 2024. The increase of $107, or 51%, was primarily due to an increase in capital expenditures of $110 primarily related to capacity expansion projects in Engine Products in support of expected revenue increases backed by aerospace and industrial gas turbine customer contracts, and additions to investments of $9, partially offset by $13 in proceeds from sales and redemptions of investments.\nTotal capital expenditures are anticipated to be approximately 5% of sales in \n2025.\nRecently Adopted and Recently Issued Accounting Guidance\nSee \nNote B\n to the Consolidated Financial Statements in \nPart I, Item 1\n of this Form 10-Q.\n33\nForward-Looking Statements\nThis report contains (and oral communications made by Howmet may contain) statements that relate to future events and expectations and as such constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include those containing such words as “anticipates”, “believes”, “could”, “envisions”, “estimates”, “expects”, “forecasts”, “goal”, “guidance”, “intends”, “may”, “outlook”, “plans”, “projects”, “seeks”, “sees”, “should”, “targets”, “will”, “would”, or other words of similar meaning. All statements that reflect Howmet’s expectations, assumptions or projections about the future, other than statements of historical fact, are forward-looking statements, including, without limitation, statements, forecasts and outlook relating to the condition of markets; future financial results or operating performance; future strategic actions; Howmet’s strategies, outlook, and business and financial prospects; and any future dividends, debt issuances, debt reduction and repurchases of its common stock. These statements reflect beliefs and assumptions that are based on Howmet’s perception of historical trends, current conditions and expected future developments, as well as other factors Howmet believes are appropriate in the circumstances. Forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties, and changes in circumstances that are difficult to predict, which could cause actual results to differ materially from those indicated by these statements. Such risks and uncertainties include, but are not limited to: (a) deterioration in global economic and financial market conditions generally, or unfavorable changes in the markets served by Howmet, including due to escalating tariff and other trade policies and the resulting impacts on Howmet’s supply and distribution chains, as well as on market volatility and global trade generally; (b) the impact of potential cyber attacks and information technology or data security breaches; (c) the loss of significant customers or adverse changes in customers’ business or financial conditions; (d) manufacturing difficulties or other issues that impact product performance, quality or safety; (e) inability of suppliers to meet obligations due to supply chain disruptions or otherwise; (f) failure to attract and retain a qualified workforce and key personnel, labor disputes or other employee relations issues; (g) the inability to achieve improvement in or strengthening of financial performance, operations or competitiveness anticipated or targeted; (h) inability to meet increased demand, production targets or commitments; (i) competition from new product offerings, disruptive technologies or other developments; (j) geopolitical, economic, and regulatory risks relating to Howmet’s global operations, including geopolitical and diplomatic tensions, instabilities, conflicts and wars, as well as compliance with U.S. and foreign trade and tax laws, sanctions, embargoes and other regulations; (k) the outcome of contingencies, including legal proceedings, government or regulatory investigations, and environmental remediation; (l) failure to comply with government contracting regulations; (m) adverse changes in discount rates or investment returns on pension assets; and (n) the other risk factors summarized in Howmet’s Form 10-K for the year ended December 31, 2024 and other reports filed with the U.S. Securities and Exchange Commission. Market projections are subject to the risks discussed above and other risks in the market. Under its share repurchase program, the Company may repurchase shares from time to time, in amounts, at prices, and at such times as it deems appropriate, subject to market conditions, legal requirements and other considerations. The Company is not obligated to repurchase any specific number of shares or to do so at any particular time. The declaration of any future dividends is subject to the discretion and approval of the Board of Directors after the Board’s consideration of all factors it deems relevant and subject to applicable law. The Company may modify, suspend, or cancel its share repurchase program or its dividend policy in any manner and at any time that it may deem necessary or appropriate.\n \nCredit ratings are not a recommendation to buy or hold any Howmet Aerospace securities, and they may be revised or revoked at any time at the sole discretion of the credit rating organizations. The statements in this report are made as of the date of the filing of this report. Howmet disclaims any intention or obligation to update publicly any forward-looking statements, whether in response to new information, future events, or otherwise, except as required by applicable law."
}