{
  "item1": "Description Business Company produces products used primarily aerospace (commercial defense), commercial transportation, industrial other markets. Howmet seeks provide its customers innovative solutions through offering differentiated products such airfoils advanced cooling coatings extreme temperature applications; specially-designed fasteners lightweight composite airframe construction, reduced assembly costs, lightning strike protection; lightweight aluminum commercial wheels. Its products solutions include investment castings jet engines industrial gas turbines (nickel superalloys, titanium, aluminum), including airfoils structural parts; seamless rolled rings jet engines (mostly nickel superalloys); fastening systems aerospace, industrial commercial transportation applications (titanium, steel, nickel superalloys); forged jet engine components (e.g., jet engine disks); machined forged aircraft parts (titanium aluminum); forged aluminum commercial vehicle wheels, all which sold directly customers through distributors. Aerospace (Commercial Defense) Market.",
  "item7": "Total debt $3,315, net decrease $391 2023, reflecting repurchases redemption $600 aggregate principal amount 6.875% Notes due May 2025 (the “2025 Notes”), redemption $205 aggregate principal amount 5.125% Notes due October 2024 (the “ early partial prepayment $60 aggregate principal amount its USD term loan, partially offset issuance $500 aggregate principal amount 4.850% Notes due October 2031 (the “2031 Notes”), net cross-currency swap synthetically converted 2031 Notes into lower fixed-interest-rate Euro liability; Company’s common stock closing price $109.37 per share December 31, 2024, increase $96.17 per share, 729%, since Arconic Inc. Separation Transaction April 1, 2020, compared increase 138% S&P 500 Index 99% S&P 500 Aerospace & Defense Index over same period. See below Results Operations reconciliation Total Segment Adjusted EBITDA Income before income taxes. 2025, management projects sales increase expect solid growth commercial aerospace market, Company’s strong position market expected continue, including engines spares.",
  "item2": "Item 2. Management’s Discussion Analysis Financial Condition Results Operations. (U.S. dollars millions, except per share amounts) following Management’s Discussion Analysis Financial Condition Results Operations (“MD&A”) intended help reader understand results operations financial condition."
}