{
  "source_file": "hwm-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business.\nGeneral\nHowmet Aerospace Inc. is a Delaware corporation with its principal office in Pittsburgh, Pennsylvania. In this report, unless the context otherwise requires, “Howmet”, the “Company”, “we”, “us”, and “our” refer to Howmet Aerospace Inc. and its consolidated subsidiaries.\nThe Company’s Internet address is https://www.howmet.com. Howmet makes available free of charge on or through its website its annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as well as proxy statements, as soon as reasonably practicable after the Company electronically files such material with, or furnishes it to, the Securities and Exchange Commission (“SEC”). The Company’s website is included in this annual report on Form 10-K as an inactive textual reference only. The information on, or accessible through, the Company’s website is not a part of, or incorporated by reference in, this annual report on Form 10-K. The SEC maintains an Internet site that contains these reports at https://www.sec.gov.\nBackground\nAs described below, Howmet Aerospace Inc. was previously named Arconic Inc. and, prior to that, Alcoa Inc., a company formed in 1888.\nThe Arconic Inc. Separation Transaction. \nOn April 1, 2020, Arconic Inc. separated its businesses (the “Arconic Inc. Separation Transaction”) into two independent, publicly traded companies: Howmet Aerospace Inc. (the new name for Arconic Inc.) and Arconic Corporation. Following this separation, Howmet retained the Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels businesses; and its prior Rolled Products, Aluminum Extrusions, and Building and Construction Systems businesses were spun-off to Arconic Corporation. In connection with the Arconic Inc. Separation Transaction, Howmet and Arconic Corporation entered into several agreements that govern their post-separation relationship.\nThe 2017 Reincorporation in Delaware. \nOn December 31, 2017, Arconic Inc., then a Pennsylvania corporation, changed its jurisdiction of incorporation from Pennsylvania to Delaware. \nThe Alcoa Inc. Separation Transaction. \nOn November 1, 2016, Alcoa Inc. completed the separation of its businesses (the “Alcoa Inc. Separation Transaction”) into two independent, publicly traded companies: Arconic Inc. (the new name for Alcoa Inc., which, through the transactions described above, later became Howmet Aerospace Inc.) and Alcoa Corporation. Following this separation, the Company retained the Engineered Products and Solutions, Global Rolled Products, and Transportation and Construction Solutions businesses. In connection with the Alcoa Inc. Separation Transaction, the two companies entered into several agreements that govern their post-separation relationship.\nOverview\nHowmet is a leading global provider of advanced engineered solutions for the aerospace and transportation industries. The Company’s primary businesses focus on jet engine components, aerospace fastening systems, and airframe structural components necessary for mission-critical performance and efficiency in aerospace and defense applications, as well as forged aluminum wheels for commercial transportation. Howmet’s technological capabilities support the innovation and growth of next-generation aerospace programs. Its differentiated technologies enable lighter, more fuel-efficient aircraft and commercial trucks to operate with a lower carbon footprint and support more sustainable air and ground transportation.\nHowmet is a global company operating in 19 countries. Based upon the country where the point of shipment occurred, North America and Europe generated 71% and 23%, respectively, of Howmet’s sales in 2024. In addition to the United States, Canada, and Mexico in North America and France, United Kingdom, Hungary, and Germany in Europe, Howmet has operating activities in numerous other countries and regions, including Japan and China.\n1\nTable\n \nof\n Contents\nDescription of the Business\nThe Company produces products that are used primarily in the aerospace (commercial and defense), commercial transportation, and industrial and other markets. Howmet seeks to provide its customers with innovative solutions through offering differentiated products such as airfoils with advanced cooling and coatings for extreme temperature applications; specially-designed fasteners for lightweight composite airframe construction, reduced assembly costs, and lightning strike protection; and lightweight aluminum commercial wheels. Its products and solutions include investment castings for jet engines and industrial gas turbines (nickel superalloys, titanium, and aluminum), including airfoils and structural parts; seamless rolled rings for jet engines (mostly nickel superalloys); fastening systems for aerospace, industrial and commercial transportation applications (titanium, steel, and nickel superalloys); forged jet engine components (e.g., jet engine disks); machined and forged aircraft parts (titanium and aluminum); and forged aluminum commercial vehicle wheels, all of which are sold directly to customers or through distributors. \nAerospace (Commercial and Defense) Market. \nHowmet’s largest market is aerospace, which represented approximately 68% of the Company’s revenue in 2024. The Company produces a range of high performance multi-materials, highly engineered products, and vertically integrated machined solutions for aero engines and airframe structures, ranging from investment castings, advanced coatings, seamless rings, forgings, titanium extrusions, and titanium mill products, to fasteners that hold aircraft together. Wingtip to wingtip, nose to tail, Howmet can produce more than 90% of all structural and rotating aero engine components. Modernization of the commercial and defense platforms is driven by an array of challenging performance requirements. With its precision engineering, materials science expertise, and advanced manufacturing processes, Howmet aims to help its customers achieve greater fuel economies, reduced emissions, passenger comfort, and maintenance efficiencies.\nCommercial Transportation Market\n. The commercial transportation market represented approximately 17% of the Company’s revenue in 2024. The Company invented the forged aluminum truck wheel in 1948, and continues to advance technology to deliver breakthrough solutions that make trucks and buses lighter, more fuel efficient and sharper-looking. Howmet’s forged aluminum wheels are a leading choice for commercial trucks and mass transportation vehicles because they can reduce weight and save fuel. The strength of the Company’s rivets, bolts and fasteners offers another light-weighting solution that delivers performance.\nIndustrial and Other Markets. \nIndustrial and other markets include industrial gas turbines, oil and gas, and other industrials, which represented approximately 15% of the Company’s revenue in 2024. \nHowmet has four reportable segments, which are organized by product on a worldwide basis: Engine Products, Fastening Systems, Engineered Structures and Forged Wheels.\nEngine Products\nEngine Products utilizes advanced designs and techniques to support next-generation engine programs and produces components primarily for aircraft engines and industrial gas turbines, including airfoils and seamless rolled rings. Engine Products produces rotating parts as well as structural parts. Engine Products principally serves the commercial and defense aerospace, industrial gas turbine, and oil and gas markets.\nFastening Systems\nFastening Systems produces \naerospace and industrial fastening systems as well as commercial transportation fasteners and installation tools\n. In addition to highly engineered aerospace fasteners with a broad range of fastening systems, the segment also supplies the commercial transportation, renewable, and material handling industries. The business’s high-tech, multi-material fastening systems are found nose to tail on \ncommercial and military aircraft, as well as on jet engines, industrial gas turbines, commercial transportation vehicles, wind turbines, solar power systems, and construction and industrial equipment\n. \nEngineered Structures\nEngineered Structures produces titanium ingots and mill products for aerospace and defense applications and is vertically integrated to produce titanium forgings, titanium extrusions, and machining services for airframe, wing, aero-engine, and landing gear components. Engineered Structures also produces aluminum forgings, nickel forgings, and aluminum machined components, and assemblies for aerospace and defense applications. The principal markets served by Engineered Structures are commercial aerospace, defense aerospace, and land and sea defense.\n2\nTable\n \nof\n Contents\nForged Wheels\nForged Wheels manufactures lightweight, high-strength forged aluminum wheels for trucks, buses, and trailers, serving the global transportation market. The Company’s portfolio, sold under the Alcoa® Wheels brand, includes advanced wheel designs utilizing MagnaForce® alloy, offering superior durability and performance. Compared to standard steel wheel configurations, our aluminum wheels deliver up to 59% weight savings per tractor-trailer, enabling greater payload capacity. Our proprietary Dura-Bright® surface treatment resists corrosion and significantly reduces maintenance requirements, helping fleets maintain a professional appearance while lowering operational costs. \nFor additional discussion of each segment's business, see “Results of Operations—Segment Information” in \nPart II, Item 7\n (Management’s Discussion and Analysis of Financial Condition and Results of Operations) and \nNote C\n to the Consolidated Financial Statements in \nPart II, Item 8\n.\nSales by Market and Significant Customer Revenue\nSales by market for the years ended December 31, 2024, 2023, and 2022, were:\nFor the Year Ended\nDecember 31,\n \n2024\n2023\n2022\nAerospace - Commercial\n52 \n%\n49 \n%\n46 \n%\nAerospace - Defense\n16 \n%\n15 \n%\n16 \n%\nCommercial Transportation\n17 \n%\n21 \n%\n23 \n%\nIndustrial and Other\n(1)\n15 \n%\n15 \n%\n15 \n%\n(1)\n Industrial and Other comprise industrial gas turbine (approximately 45%), general industrial (approximately 30%), and oil and gas (approximately 25%).\nOn April 2, 2024, General Electric Company, one of our largest customers, completed the spin-off of its energy-focused business into GE Vernova, a new publicly traded company. Since then, General Electric Company operates as GE Aerospace. In 2024, RTX Corporation and GE Aerospace each represented approximately \n10% \nof the Company’s third-party sales. The loss of any such significant customer could have a material adverse effect on such businesses. See \nPart I, Item 1A\n (Risk Factors).\n3\nTable\n \nof\n Contents\nThe Company's Principal Facilities\n(1)\nCountry\nFacility Location\nSegment\nProducts\nAustralia\nOakleigh\nFastening Systems\nFasteners\nCanada\nGeorgetown, Ontario\n(2)\nEngine Products\nAerospace Castings\n \nLaval, Québec\nEngine Products; Engineered Structures\nAerospace Castings and Machining\nChina\nSuzhou\n(2)\nEngine Products; Fastening Systems; Forged Wheels\nFasteners, Rings and Wheels Machining \nFrance\nDives-sur-Mer\nEngine Products\nAerospace and Industrial Gas Turbine Castings\n \nEvron\nEngine Products\nAerospace and Specialty Castings\n \nGennevilliers\nEngine Products\nAerospace and Industrial Gas Turbine Castings\n \nSt. Cosme-en-Vairais\n(2)\nFastening Systems\nFasteners\n \nToulouse\nFastening Systems\nFasteners\n \nUs-par-Vigny\nFastening Systems\nFasteners\nGermany\nBestwig\nEngine Products\nAerospace Castings\n \nErwitte\nEngine Products\nMachining of Aerospace Castings\n \nHildesheim-Bavenstedt\n(2)\nFastening Systems\nFasteners\n \nKelkheim\n(2)\nFastening Systems\nFasteners\nHungary\nNemesvámos\nFastening Systems\nFasteners\n \nSzékesfehérvár\nEngine Products; Forged Wheels\nAerospace and Industrial Gas Turbine Castings and Forgings\nJapan\nJ\nÔ\netsu City\n(2)\nForged Wheels\nWheels Machining \nNomi\nEngine Products\nAerospace and Industrial Gas Turbine Castings\nMexico\nCiudad Acuña\n(2)\nEngine Products; Fastening Systems\nAerospace Castings/Rings and Fasteners\nMonterrey\nForged Wheels\nForgings\nMorocco\nCasablanca\n(2)\nFastening Systems\nFasteners\nUnited Kingdom\nEcclesfield\n(2)\nEngine Products\nMetal, Billets\n \nExeter\n(2)\nEngine Products\nAerospace and Industrial Gas Turbine Castings and Alloy\n \nGlossop\nEngine Products\nMetal, Billets\n \nIckles\nEngine Products\nMetal, Billets\n \nLeicester\n(2)\nFastening Systems\nFasteners\n \nRedditch\n(2)\nFastening Systems\nFasteners\n \nTelford\nFastening Systems\nFasteners\nWorcester\n(2)(3)\nEngine Products\nAerospace and Industrial Gas Turbine Castings Tooling\n4\nTable\n \nof\n Contents\nCountry\nFacility Location\nSegment\nProducts\nUnited States\nTucson, AZ\n(2)\nFastening Systems\nFasteners\n \nCarson, CA\n(2)\nFastening Systems\nFasteners\n \nCity of Industry, CA\n(2)\nFastening Systems\nFasteners\n \nFontana, CA\nEngine Products\nRings\n \nFullerton, CA\n(2)\nFastening Systems\nFasteners and Tooling\n \nRancho Cucamonga, CA\nEngine Products\nRings\n \nTorrance, CA\nFastening Systems\nFasteners\n \nBranford, CT\nEngine Products\nAerospace Coatings\n \nWinsted, CT\nEngine Products\nAerospace Machining\n \nSavannah, GA\nEngineered Structures\nForgings, Disks\n \nLa Porte, IN\nEngine Products\nAerospace and Industrial Gas Turbine Castings\n \nWhitehall, MI\nEngine Products\nAerospace and Industrial Gas Turbine Castings and Coatings, Titanium Alloy and Specialty Products\n \nWashington, MO\nEngineered Structures\nTitanium Mill Products\n \nBig Lake, MN\nEngineered Structures\nAerospace Machining\n \nNew Brighton, MN\nEngineered Structures\nAerospace Machining\n \nDover, NJ\nEngine Products\nAerospace and Industrial Gas Turbine Castings and Alloy\n \nKingston, NY\n(2)\nFastening Systems\nFasteners Tooling\n \nRochester, NY\nEngine Products\nRings\nBarberton, OH\nForged Wheels\nWheels Machining\n \nCanton, OH\n(2)\nEngineered Structures\nTitanium Mill Products\n \nCleveland, OH\nEngine Products; Engineered Structures; Forged Wheels\nForgings, Investment Casting Equipment, and Aerospace Components\n \nNiles, OH\nEngineered Structures\nTitanium Mill Products\n \nMorristown, TN\n(2)\nEngine Products\nAerospace and Industrial Gas Turbine Ceramic Products\n \nHouston, TX\n(2)\nEngineered Structures\nExtrusions\n \nWaco, TX\n(2)\nFastening Systems\nFasteners\n \nWichita Falls, TX\nEngine Products\nAerospace and Industrial Gas Turbine Castings\n \nHampton, VA\n(2)\nEngine Products\nAerospace and Industrial Gas Turbine Castings\n \nMartinsville, VA\nEngineered Structures\nTitanium Mill Products\n(1)\nPrincipal facilities are listed by location, with certain locations having more than one facility. The list in the above table does not include 17 locations that serve as sales and administrative offices, distribution centers or warehouses.\n(2)\nLeased property or partially leased property.\n(3)\nIn October 2024, Howmet acquired Camcraft LTD.\n5\nTable\n \nof\n Contents\nSources and Availability of Raw Materials\nImportant raw materials purchased in 2024 for each of the Company’s reportable segments are listed below.\nEngine Products\nFastening Systems\nEngineered Structures\nForged Wheels\nCeramics\nAluminum Alloys\nAluminum\nAluminum\nCobalt\nEnergy\nEnergy\nEnergy\nEnergy\nNickel Alloys and Stainless Steels\nNickel Alloys\nNickel\nSteels\nTitanium Scrap\nPlatinum\nTitanium Alloys\nTitanium Sponge\nSuperalloy materials\nVanadium Alloys\nTitanium\nGenerally, raw materials are purchased from third-party suppliers under competitively priced supply contracts or bidding arrangements. The Company believes that the raw materials necessary to its business are and will continue to be available.\nPatents, Trade Secrets, and Trademarks\nThe Company believes that its domestic and international patent, trade secret and trademark assets provide it with a significant competitive advantage. The Company’s rights under its patents, as well as the products made and sold under them, are important to the Company as a whole and, to varying degrees, important to each business segment. The patents owned by Howmet generally concern particular products, manufacturing equipment, or techniques. Howmet’s business as a whole is not, however, materially dependent on any single patent, trade secret, or trademark. As a result of product development and technological advancement, the Company continues to pursue patent protection in jurisdictions throughout the world. As of the end of 2024, the Company’s worldwide patent portfolio consisted of approximately 950 granted patents and 220 pending patent applications.\nThe Company also has a significant number of trade secrets, mostly regarding manufacturing processes and material compositions that give many of its businesses important advantages in their markets. The Company continues to strive to improve those processes and generate new material compositions that provide additional benefits. With respect to domestic and international registered trademarks, the Company has many that have significant recognition within the markets that are served. Examples include the name Howmet\n®\n metal castings, Huck\n®\n fasteners, and Dura-Bright\n®\n wheels with easy-clean surface treatments. As of the end of 2024, the Company’s worldwide trademark portfolio consisted of approximately 1,570 registered trademarks and 50 pending trademark applications. Following the Alcoa Inc. Separation Transaction, the Company retained the Alcoa Wheels® business and, pursuant to a Trademark License Agreement, is the exclusive licensee of the “Alcoa” name and logo for use with the wheels, hubs, and related products that we manufacture. The Company’s rights under its trademarks are important to the Company as a whole and, to varying degrees, important to each business segment.\nCompetitive Conditions\nThe Company’s segments - Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels - are subject to substantial and intense competition in the markets they serve. Although Howmet believes its advanced technology, manufacturing processes, and experience provide advantages to Howmet’s customers, such as high quality and superior mechanical properties that meet the Company’s customers’ most stringent requirements, many of the products Howmet makes can be produced by competitors using similar types of manufacturing processes as well as alternative forms of manufacturing. Despite intense competition, Howmet continues as a market leader in most of its principal markets. We believe that factors such as Howmet’s technological expertise, state-of-the-art capabilities, capacity, quality, engaged employees, and long-standing customer relationships enable the Company to maintain its competitive position.\nPrincipal competitors include Berkshire Hathaway Inc., through its 2016 acquisition of Precision Castparts Corporation and subsidiaries, for titanium and titanium-based alloys, precision forgings, seamless rolled rings, investment castings, including airfoils, and aerospace fasteners; VSMPO (Russia) for titanium and titanium-based alloys and precision forgings; Allegheny Technologies, Inc.’s High-Performance Materials & Components segment for titanium and titanium-based alloys and precision forgings; Lisi Aerospace (France) for aerospace fasteners; and Aubert & Duval (part of Eramet Group in France) for precision forgings. Other competitors include Doncasters Group Ltd. (U.K.) and Consolidated Precision Products Corp. (owned by Warburg Pincus and Berkshire Partners) for investment castings; Weber Metals (part of Otto Fuchs) for precision forgings; and Forgital and Frisa (Mexico) for seamless rings.\nForged Wheels competes against aluminum and steel wheel suppliers in the commercial transportation industry under the product brand name Alcoa\n®\n Wheels for the major regions that it serves (North America, Europe, Japan, China, South America, and Australia). Its larger aluminum wheel competitors are Accuride Corporation, Speedline (member of the Ronal Group), Nippon Steel Corporation, Dicastal, Alux, and Wheels India Limited. \n6\nTable\n \nof\n Contents\nIn recent years, Forged Wheels has seen an increase in the number of aluminum wheel suppliers (both forged and cast aluminum wheels) from China, Taiwan, India, and South Korea attempting to penetrate the global commercial transportation market.\nSeveral of Howmet’s largest customers have captive superalloy furnaces for producing airfoil investment castings for their own use. Many other companies around the world also produce superalloy investment castings, and some of these companies currently compete with Howmet in the aerospace and other markets, while others are capable of competing with the Company should they choose to do so.\nInternational competition in the investment castings,\n \nfasteners, rings and forgings markets may also increase in the future as a result of strategic alliances among engine original equipment manufacturers (“OEMs”), aero-structure prime contractors, and overseas companies, especially in developing markets, particularly where “offset” or “local content” requirements create purchase obligations with respect to products manufactured in or directed to a particular country.\nGovernment Regulations and Environmental Matters\nOur operations and activities are global and are subject to various federal, state, local, and foreign laws, rules and regulations, including those relating to the environment. In 2024, compliance with these laws, rules and regulations did not have a material effect on our capital expenditures, results of operations or competitive position. Additionally, we do not currently anticipate material capital expenditures for environmental control facilities in 2025. For a discussion of the risks associated with certain applicable laws and regulations, see “Risk Factors.” Information relating to environmental matters is included in \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n under the caption “Environmental Matters.” \nHuman Capital\nHowmet strives to attract, recruit, engage, develop and retain world-class talent. Our Code of Conduct describes how we lead with integrity and work with one another while supporting our stakeholders. The Company provides competitive wages, benefits and terms of employment. \nAttracting and recruiting candidates through workforce planning, increased hiring efficiency and effective onboarding have been a priority for the Company. New technology that increases the automation of job postings enables us to more widely disseminate our job vacancies to various partners and job boards, including our campus recruitment platform that enables us to proactively reach a broad talent network of students and schools across the United States. Additional technologies such as recruiting booster text capabilities facilitate communicating with candidates quickly and efficiently. To retain new talent, the Company offers an onboarding program to develop a sense of belonging, teamwork, and productivity. In addition to existing training development programs for salaried employees, we have been working to extend training access using technology to our hourly employees during 2024, piloting this technology at several locations. We believe providing employees with avenues to new skills contributes to increased motivation and engagement, resulting in higher employee retention.\nThe Company enables our employees to own their development and create rewarding careers that draw on their aptitudes and support their ambitions. Our development process framework provides tools and resources to identify career options, skills gaps and actions they can take to progress within the Company. Using a human capital management platform, employees can build a professional profile to share their career aspirations and learn new skills. This platform allows us to align employee goals and growth with the Company’s future business needs so that we can pinpoint potential successor candidates and build their readiness for their future roles. We use a data-driven approach to track how our employees are progressing through our organization. We seek to identify high performers and support their development into potential future leaders, focusing on providing opportunities to all individuals. A valuable component of development is Howmet’s mentoring program, which builds readiness for future leaders. Our talent review and succession planning process is an ongoing priority and is sponsored and led by our Chief Executive Officer with oversight by the Board of Directors.\nHowmet’s strong health and safety culture empowers our employees and contractors to take personal responsibility for their actions and the safety of their coworkers. This culture is supported by internal policies, standards, rules, and procedures that clearly articulate our stringent requirements for working safely in all of our worldwide facilities. The Company embeds annual health and safety goals and objectives into its operating plans to progress toward our ultimate goal of zero incidents. We use various risk identification, assessment, and control processes to reduce the likelihood of safety and health incidents in the workplace, with prioritization of the prevention of fatality and serious injury.\nEmployees\nTotal worldwide employment at the end of 2024 was approximately 23,930\n \nemployees in 22 countries. \n7\nTable\n \nof\n Contents\nApproximately 3,500 employees, or 25% of the U.S. workforce, are represented by labor unions in the United States. Within the United States, there are eight collective bargaining agreements with varying expiration dates between Howmet and various labor unions. Of these eight, the largest workforce covered under a collective bargaining agreement is between Howmet and the United Autoworkers (“UAW”) at our Engine Products facility in Whitehall, Michigan. The current agreement, which covers approximately 1,450 employees, expires on April 1, 2028. The second largest workforce of approximately 700 employees within our Engineered Structures and Forged Wheels segments is covered under a five-year collective bargaining agreement reached in March 2024 between Howmet and the UAW at our Cleveland, Ohio location, which expires in February 2029. The Company’s next significant plant collective bargaining agreement in the U.S. expires in 2027. On a regional basis, collective bargaining agreements with varying expiration dates cover employees in Europe, North America, South America, and Asia. The Company believes that it has positive relationships with its employees and any respective labor union representatives.\nExecutive Officers of the Registrant\nThe names, ages, positions, and areas of responsibility of the executive officers of the Company as of February 13, 2025 are listed below. The Company’s executive officers are annually appointed to serve until the next annual meeting of the Board of Directors (held in conjunction with the annual meeting of shareholders), except in the case of earlier death, retirement, resignation or removal.\nMichael N. Chanatry\n, 64, Vice President and Chief Commercial Officer. Mr. Chanatry was initially elected Vice President and Chief Commercial Officer of Howmet effective May 16, 2018. Prior to joining Howmet, from 2015 to April 2018, he was Vice President of Supply Chain for General Electric’s Power Division. Mr. Chanatry served as General Manager of Supply Chain for General Electric Appliances from 2013 to 2015; and General Electric Aviation Systems from 2009 to 2013. Prior to his leadership roles at General Electric Power, General Electric Appliances and General Electric Aviation Systems, Mr. Chanatry held numerous positions within the General Electric Aviation & Aerospace divisions, as well as at Lockheed Martin from 1983 to 2009.\nKen Giacobbe\n, 59, Executive Vice President and Chief Financial Officer. Mr. Giacobbe was initially elected Executive Vice President and Chief Financial Officer of Howmet effective November 1, 2016. Mr. Giacobbe joined Howmet in 2004 as Vice President of Finance for Global Extruded Products, part of Alcoa Forgings and Extrusions. He then served as Vice President of Finance for the Company’s Building and Construction Systems business from 2008 until 2011. In 2011, he assumed the role of Group Controller for the Engineered Products and Solutions segment. From January 2013 until October 2016, Mr. Giacobbe served as Chief Financial Officer of the Engineered Products and Solutions segment. Before joining Howmet, Mr. Giacobbe held senior finance roles at Avaya and Lucent Technologies.\nLola F. Lin\n, 50, Executive Vice President, Chief Legal and Compliance Officer and Secretary. Ms. Lin was initially elected Executive Vice President, Chief Legal Officer and Secretary of Howmet effective June 28, 2021. Prior to joining Howmet, she served as Senior Vice President and General Counsel of Airgas, Inc. from 2016 to May 2021. \nPrior to her time at Airgas, Ms. Lin \nheld various legal roles at Air Liquide USA LLC from 2007 to 2016, including as Vice President and Deputy General Counsel. Prior to her roles at Airgas Inc. and Air Liquide, Ms. Lin held roles at Dell Inc., Sutherland Asbill & Brennan LLP and Locke Liddell & Sapp LLP. \nNeil E. Marchuk\n, 67, Executive Vice President, Chief Human Resources Officer. Mr. Marchuk was initially elected Executive Vice President and Chief Human Resources Officer of Howmet effective March 1, 2019. He served as Interim President, Engineered Structures, from October 2023 to April 2024; and Interim President, Fastening Systems, from November 2022 to May 2023. Prior to joining Howmet, from January 2016 to February 2019, he was Executive Vice President and Chief Human Resources Officer at Adient, an automotive manufacturer. From July 2006 to May 2015, Mr. Marchuk was Executive Vice President of Human Resource at TRW Automotive, and served as TRW’s Vice President, Human Resources from September 2004 to July 2006. Prior to joining TRW, from December 2001 to August 2004, Mr. Marchuk was Director, Corporate Human Resources for E.I. Du Pont De Nemours and Company (“E.I. Du Pont”). From September 1999 to November 2001, Mr. Marchuk was Director, Global HR Delivery for E.I. Du Pont. From February 1999 to August 1999, Mr. Marchuk served E.I. Du Pont as its Global HR Director, Global Services Division.\nJohn C. Plant\n, 71, Executive Chairman and Chief Executive Officer. Mr. Plant was appointed Howmet’s Chief Executive Officer effective October 14, 2021, and was Co-Chief Executive Officer from April 2020 to October 2021. From February 2019 to April 2020, he was the Chief Executive Officer of Arconic Inc., as the Company was then known prior to its separation. He has served as chairman of Howmet's Board of Directors since October 2017 and as a member of the Board since February 2016. Mr. Plant previously served as Chairman of the Board, President and Chief Executive Officer of TRW Automotive from 2011 to 2015, and as its President and Chief Executive Officer from 2003 to 2011. TRW Automotive was acquired by ZF Friedrichshafen AG in May 2015. Mr. Plant was a co-member of the Chief Executive Office of TRW Inc. from 2001 to 2003 and an Executive Vice President of TRW from 1999 (when the company acquired Lucas Varity) to 2003. Prior to TRW, Mr. Plant was President of Lucas Varity Automotive and managing director of the Electrical and Electronics division from 1991 through 1997. \n8\nTable\n \nof\n Contents\nBarbara L. Shultz\n, 51, Vice President and Controller. Ms. Shultz was initially elected Vice President and Controller of Howmet effective May 25, 2021. Ms. Shultz joined Howmet in 2005 and served in numerous financial accounting positions until 2012 when she was appointed Director of Finance for the Company’s Alcoa Wheel and Transportation Products business. She then served as Director of Compliance for the Company’s then Structures business from July 2015 to February 2019, Director of Compliance from February 2019 to June 2020, and Assistant Controller from June 2020 to May 2021. Prior to joining Howmet, Ms. Shultz held several roles at PricewaterhouseCoopers LLP from 1995 to 2005. \n9\nTable\n \nof\n Contents",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\n(dollars in millions, except share and per-share amounts)\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is intended to help the reader understand our results of operations and financial condition. The MD&A is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and notes thereto included in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K.\nOverview\nOur Business\nHowmet is a global leader in lightweight metals engineering and manufacturing. Howmet’s innovative, multi-material products, which include nickel, titanium, aluminum, and cobalt, are used worldwide in the aerospace (commercial and defense), commercial transportation, and industrial and other markets. \nHowmet is a global company operating in 19 countries. Based upon the country where the point of shipment occurred, North America and Europe generated 71% and 23%, respectively, of Howmet’s sales in 2024. In addition to the United States, Canada, and Mexico in North America and France, United Kingdom, Hungary, and Germany in Europe, Howmet has operating activities in numerous other countries and regions, including Japan and China. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, affect the results of operations in countries with such activities.\nManagement Review of 2024 and Outlook\nThe Company derived approximately 52% of its revenue from products sold to the commercial aerospace market for the year ended December 31, 2024. Aircraft production in the commercial aerospace industry continues to grow based on increases in demand for narrow body and wide body aircraft. We expect our commercial aerospace wide body and narrow body demand, including engine spares, also to continue to grow. Quality control issues at The Boeing Company (“Boeing”) have had and are expected to continue to have a negative impact on narrow body and wide body production rates in the near term. For instance, the Federal Aviation Administration stated that it will not approve production rate increases above 38 aircraft per month or additional production lines for the Boeing 737 MAX until it is satisfied that Boeing is in full compliance with required quality control procedures. In addition, a labor union work stoppage and ensuing production restart at Boeing has negatively impacted results. Boeing production levels have had and are expected to have a material impact on the financial performance of Howmet. The timing and level of future aircraft builds by OEMs are subject to changes and uncertainties, which may cause our future results to differ from prior periods due to changes in product mix in certain segments.\nIn 2024, Sales increased 12% from 2023 primarily as a result of higher volumes in the commercial aerospace, defense aerospace, and industrial and other markets, and favorable product pricing, partially offset by lower volumes in the commercial transportation market. Product price increases are in excess of material and inflationary cost pass through to our customers.\nIncome before income taxes increased 42% from 2023. Total Segment Adjusted EBITDA\n(1)\n increased 27% from 2023 primarily due to favorable sales in the commercial aerospace, defense aerospace, and industrial and other markets as well as favorable product pricing.\nManagement continued its focus on liquidity and cash flows as well as improving its operating performance through profitable revenue, efficient operations, and margin enhancement. Management has also continued its intensified focus on capital efficiency. Management’s focus and the related results enabled Howmet to end 2024 with a solid financial position.\nThe following financial information reflects certain key highlights of Howmet’s 2024 results:\n•\nSales of $7,430, an increase of 12% from 2023, driven by higher sales in the commercial aerospace, defense aerospace, and industrial and other markets, partially offset by lower sales in the commercial transportation market; \n•\nNet income of $1,155, or $2.81 per diluted share;\n•\nIncome before income taxes of $1,383, an increase of $408, or 42%, from 2023;\n•\nTotal Segment Adjusted EBITDA\n(1)\n of $2,009, an increase of $422, or 27%, from 2023;\n•\nCash on hand and restricted cash at the end of the year of $565;\n•\nCash provided from operations of $1,298; cash used for financing activities of $1,026; and cash used for investing activities of $316;\n•\nRepurchased the Company’s common stock of approximately 6 million shares under the Share Repurchase Program for approximately $500;\n22\nTable\n \nof\n Contents\n•\nTotal debt of $3,315, a net decrease of $391 from 2023, reflecting repurchases and redemption of $600 aggregate principal amount of the 6.875% Notes due May 2025 (the “2025 Notes”), redemption of $205 aggregate principal amount of the 5.125% Notes due October 2024 (the “\n2024 Notes”)\n, \nearly partial prepayment of $60 aggregate principal amount of its USD term loan, partially offset by the \nissuance of $500 aggregate principal amount of the 4.850% Notes due October 2031 (the “2031 Notes”), net of the cross-currency swap that synthetically converted the 2031 Notes into a lower fixed-interest-rate Euro liability; and\n•\nThe Company’s common stock had a closing price of $109.37 per share as of December 31, 2024, an increase of $96.17 per share, or 729%, since the Arconic Inc. Separation Transaction on April 1, 2020, compared to an increase of 138% for the S&P 500\n®\n Index and 99% for the S&P 500\n®\n Aerospace & Defense Index over the same period.\n(1)\nSee below in Results of Operations for the reconciliation of Total Segment Adjusted EBITDA to Income before income taxes.\nIn 2025, management projects sales to increase as we expect solid growth in the commercial aerospace market, and the Company’s strong position in that market is expected to continue, including engines spares. Earnings per share is expected to grow as management continues to focus on revenue growth and operational performance. Cash provided from operations is expected to increase for the full year in 2025 compared with 2024, resulting from a continued focus on operating performance and on capital efficiency. Capital expenditures are expected to increase with additional investments in capacity expansions. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nResults of Operations\nEarnings Summary\nSales. \nSales for 2024 were $7,430 compared with $6,640 in 2023, an increase of $790, or 12%. The increase was primarily due to higher sales in the commercial aerospace, defense aerospace, and industrial and other markets, including engine spares, and favorable product pricing, partially offset by lower volumes in the commercial transportation market. Product price increases are in excess of inflationary cost pass through to our customers.\nSales for 2023 were $6,640 compared with $5,663 in 2022, an increase of $977, or 17%. The increase was primarily due to higher sales in the commercial aerospace, defense aerospace, commercial transportation, and industrial and other markets, favorable product pricing, and an increase in material cost pass through. Product price increases are in excess of inflationary pass through to our customers.\nCost of goods sold (“COGS”). \nCOGS as a percentage of Sales was 68.9% in 2024 compared with 71.9% in 2023. The decrease was primarily due to higher volumes and favorable product pricing, partially offset by increased net headcount, primarily in the Engine Products segment, in support of expected revenue increases. The Company had total COGS net reimbursements of $18 in 2024 due to the final settlement of the insurance claim related to a mechanical failure that occurred in 2022 resulting in substantial heat and fire-related damage to equipment at the Forged Wheels’ cast house in Barberton, Ohio (the “Barberton Cast House Incident”) in the second quarter of 2024 and the final settlement of the insurance claim related to the fires that occurred in 2019 at a Fastening Systems plant in France (the “France Plant Fire”) in the fourth quarter of 2024, compared to total COGS insurance claims reimbursements of $19 in 2023, partially offset by charges of $7 in 2023, related to the France Plant Fire and Barberton Cast House Incident. The insurance claims related to the Barberton Cast House Incident and the France Plant Fire have now been completed. All cash related to the insurance claims has been collected as of January 2025.\nCOGS as a percentage of Sales was 71.9% in 2023 compared with 72.5% in 2022. The decrease was primarily due to higher volumes, favorable product pricing, and lower costs related to three plant fires, partially offset by material cost pass through and increased net headcount, primarily in the Engine Products and Fastening Systems segments, in support of expected revenue increases. The Company had total COGS insurance claims reimbursements of $19 in 2023, partially offset by charges of $7, related the France Plant Fire and the Barberton Cast House Incident, compared to total COGS charges of $59 in 2022, offset by partial insurance claims reimbursements of $23, related to a fire at a Forged Wheels plant in Barberton, Ohio in mid-February 2020 (the “Barberton Plant Fire”) and the France Plant Fire. The insurance claims related to these three plant fires were in excess of the insurance deductible. During the fourth quarter of 2022, the Company settled the insurance claim related to the Barberton Plant Fire.\nSelling, general administrative, and other expenses (“SG&A”). \nSG&A expenses were $347, or 4.7% of Sales, in 2024 compared with $333, or 5.0% of Sales, in 2023. The increase in SG&A of $14, or 4%, was primarily due to higher employment costs.\nSG&A expenses were $333, or 5.0% of Sales, in 2023 compared with $288, or 5.1% of Sales, in 2022. The increase in SG&A of $45, or 16%, was primarily due to higher employment costs and legal fees.\n23\nTable\n \nof\n Contents\nResearch and development expenses (“R&D”). \nR&D expenses were $33 in 2024 compared with $36 in 2023. The decrease of $3, or 8%, was primarily due to the timing of spending on technology projects.\nR&D expenses were $36 in 2023 compared with $32 in 2022. The increase of $4, or 13%, was primarily due to higher spending on technology projects to support the aerospace business.\nProvision for depreciation and amortization (“D&A”). \nThe provision for D&A was $277 in 2024 compared with $272 in 2023. The increase of $5, or 2%, was primarily driven by the disposal of unused assets in the Engine Products segment.\nThe provision for D&A was $272 in 2023 compared with $265 in 2022. The increase of $7, or 3%, was primarily driven by higher depreciation in the Engine Products segment.\nRestructuring and other charges. \nRestructuring and other charges were $21 in 2024 compared with $23 in 2023 and $56 in 2022.\nRestructuring and other charges in 2024 consisted primarily of a $13 net loss on the sale of a small U.K. manufacturing facility in Engineered Structures and $10 charge for layoff costs.\nRestructuring and other charges in 2023 consisted primarily of a $12 charge for impairment of assets primarily related to decommissioned fixed assets in Engineered Structures, a $5 charge for U.S. and Canadian pension plans’ settlement accounting, a $3 charge for layoff costs, a $3 charge for various other exit related costs primarily for the closures of small manufacturing facilities, and a $2 charge for accelerated depreciation primarily related to the closure of a small Engineered Structures facility in the U.K. The Company has closed or sold some small manufacturing facilities including three in the U.K. and may, in the future, close additional small facilities in order to consolidate operations, reduce fixed costs, and exit less profitable businesses.\nRestructuring and other charges in 2022 consisted primarily of\n a $58 charge for U.K. and U.S. pension plans’ settlement accounting and a $6 charge for various other exit costs. These charges were partially offset by a gain of $8 on the sale of assets at a small U.S. manufacturing facility in Engine Products.\nSee \nNote D\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for additional detail.\nInterest expense, net. \nInterest expense, net was $182 in 2024 compared with $218 in 2023. The decrease of $36, or 17%, was primarily due to the early redemptions of the 6.875% Notes due May 2025 (the “2025 Notes”) during various periods in 2024, the early redemptions of the 5.125% Notes due October 2024 (the “\n2024 Notes\n”) during various periods during 2023 and 2024, and the \nearly partial prepayment of its USD term loan\n, partially offset by the August 2024 issuance of $500 aggregate principal amount of the 2031 Notes, net of the cross-currency swap that synthetically converted the 2031 Notes into a lower fixed-interest-rate Euro liability. Long-term debt, including long-term debt due within one year, has been reduced by $847 from December 31, 2022 to December 31, 2024. On an annual basis, the debt reduction and refinancing activities in 2024 will decrease Interest expense, net by approximately $37.\nInterest expense, net was $218 in 2023 compared with $229 in 2022. The decrease of $11, or 5%, was primarily due to a reduced average level of debt for the year ended December 31, 2023 compared to the year ended December 31, 2022.\nSee \nNote Q\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for additional detail related to the Company’s debt.\nLoss on debt redemption.\n \nDebt redemption or tender premiums include the cost to redeem or repurchase certain of the Company’s notes at a price which may be equal to the greater of the principal amount or the sum of the present values of the remaining scheduled payments, discounted using a defined treasury rate plus a spread, or a price based on the market price of its notes. \nLoss on debt redemption was $6 in 2024 compared with $2 in 2023. The increase of $4, or 200%, was primarily due to the debt premiums paid on the early redemption of the 2025 Notes in the third quarter of 2024.\nLoss on debt redemption was $2 in both 2023 and 2022 due to the debt premiums paid on the early redemption of the 2024 Notes. \nSee \nNote Q\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for additional detail related to the Company’s debt.\n24\nTable\n \nof\n Contents\nOther expense, net. \nOther expense, net was $62 in 2024 compared with $8 in 2023. The increase in expense of $54 was primarily due to the reversal in the second quarter ended June 30, 2023 of $25, net of legal fees of $1, of the $65 pre-tax charge taken in the third quarter of 2022 related to the Lehman Brothers International (Europe) (“LBIE”) legal proceeding as a result of the final settlement of such proceeding in June 2023 (See \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n) (Financial Statements and Supplementary Data), increases in foreign currency losses, net of $15, and an increase in the impacts of deferred compensation arrangements of $5. Non-service related net periodic benefit costs related to defined benefit plans and other postretirement benefit plans is expected to remain relatively flat from 2024 to 2025.\nOther expense, net was $8 in 2023 compared with $82 in 2022. The decrease in expense of $74 was primarily due to the reversal of $25 of the $65 pre-tax charge taken in the third quarter of 2022 related to the LBIE legal proceeding which was settled in the second quarter of 2023 (See \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n) (Financial Statements and Supplementary Data) and higher interest income of $17, partially offset by the impacts of deferred compensation arrangements of $18, higher non-service related net periodic benefit costs related to pension and other postretirement benefit plans in 2023 of $13, and an increase from net realized and unrealized losses of $4, primarily related to mark-to-market adjustments on exchange-traded fixed income securities and losses on sales of receivables.\nSee \nNote F\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for additional detail.\nIncome taxes. \nHowmet’s effective tax rate was 16.5% (provision on pre-tax income) in 2024 compared with the U.S. federal statutory rate of 21%. The effective tax rate differs from the U.S. federal statutory rate primarily due to the completion of an R&D study which resulted in a $44 net benefit related to prior years of U.S. federal and state R&D credits and related impacts, a $15 net benefit related to current year U.S. federal and state R&D credits and related impacts, a $25 benefit related to a U.S. deduction on Foreign Derived Intangible Income, an $11 net benefit related to various other credits, a $10 excess benefit for stock compensation, a $6 benefit to release a valuation allowance related to U.S. state tax losses and credits, and a $4 benefit to release a valuation allowance related to U.S. foreign tax credits, partially offset by $12 of U.S. tax on Global Intangible Low-Taxed Income (“GILTI”) and other foreign earnings, $15 of incremental state tax and foreign taxes on earnings also subject to U.S. federal income tax, $11 of charges related to nondeductible expenses, and $8 of net foreign tax cost related to foreign earnings subject to withholding tax and local tax in high tax rate jurisdictions. On October 8, 2021, the Organization for Economic Cooperation and Development (“OECD”) released the Pillar Two model rules introducing a 15% global minimum tax under the OECD/G20 Inclusive Framework on Base Erosion and Profit Shifting. The Pillar Two directive has been implemented, or is expected to be implemented, through domestic legislation in multiple countries where the Company operates. While the Company does not expect the adoption of the Pillar Two framework to have a material impact on its effective tax rate, we continue to monitor any additional guidance released by the OECD, along with the pending and adopted legislation in the countries where we operate. \nHowmet anticipates that the effective tax rate in 2025 will be between 20.5% and 21.5%. However, changes in the current economic environment, tax legislation or rate changes, currency fluctuations, ability to realize deferred tax assets, movements in stock price impacting tax benefits or deficiencies on stock-based payment awards, and the results of operations in certain taxing jurisdictions may cause this estimated rate to fluctuate.\nHowmet’s effective tax rate was 21.5% (provision on pre-tax income) in 2023 compared with the U.S. federal statutory rate of 21%. The effective tax rate differs from the U.S. federal statutory rate primarily as a result of a $21 charge for a tax reserve established in France, $10 of incremental state tax and foreign taxes on earnings also subject to U.S. federal income tax, and $8 of charges related to nondeductible expenses, partially offset by a $14 benefit to release a valuation allowance related to U.S. foreign tax credits, a $9 excess benefit for stock compensation, $7 of benefits related to tax credits, a $2 benefit to release a valuation allowance related to U.S. state tax losses and credits, and a $2 benefit to revalue deferred taxes for changes to apportioned U.S. state tax rates. \nHowmet’s effective tax rate was 22.6% (provision on pre-tax income) in 2022 compared with the U.S. federal statutory rate of 21%. The effective tax rate differs from the U.S. federal statutory rate primarily as a result of a $12 charge related to an increase in the valuation allowance on a foreign tax credit carryforward in the U.S., $8 of charges related to U.S. tax on GILTI and other foreign earnings, $8 of charges related to nondeductible expenses, and $5 of incremental state tax and foreign taxes on earnings also subject to U.S. federal income tax, partially offset by a $6 benefit for the release of a valuation allowance on interest deduction carryforwards in the U.K., a $5 benefit related to a tax accounting method change, a $5 excess benefit for stock compensation, and a $3 benefit related to a distribution of foreign earnings. The Inflation Reduction Act of 2022 (the “Act”) was signed into law on August 16, 2022. The Act includes various tax provisions, including a 1% excise tax on net stock repurchases, expanded tax credits for clean energy incentives, and a corporate alternative minimum tax that generally applies to U.S. corporations with average adjusted financial statement income over a three-year period in excess of $1,000. The Company does not expect the Act to materially impact its financial statements.\nSee \nNote H\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for additional detail.\n25\nTable\n \nof\n Contents\nNet income. \nNet income\n \nwas $1,155, or $2.81 per diluted share, for 2024 compared to $765, or $1.83 per diluted share, in 2023. The increase in results of $390, or 51%, was primarily due to higher volumes in the commercial aerospace, defense aerospace, and industrial and other markets, including engines spares, favorable product pricing, a reduction in interest expense due to lower long-term debt levels, and a lower tax rate due to the completion of an R&D study, partially offset by lower volumes in the commercial transportation market and net impacts of foreign currency.\nNet income was $765, or $1.83 per diluted share, for 2023 compared to $469, or $1.11 per diluted share, in 2022. The increase in results of $296, or 63%, was primarily due to higher sales in the commercial aerospace market, favorable product pricing, a change of $90 due to the reversal of $25 of the $65 pre-tax charge taken in the third quarter of 2022 related to the LBIE legal proceeding (See \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n), a decrease in Restructuring and other charges of $33, and a decrease in Interest expense, net of $11, partially offset by an increase in the Provision for income taxes primarily driven by an increase in income before income taxes.\nSegment Information\nThe Company’s operations consist of four worldwide reportable segments: Engine Products, Fastening Systems, Engineered Structures and Forged Wheels. Segment performance under Howmet’s management reporting system is evaluated based on Segment Adjusted EBITDA. The Company’s Chief Executive Officer, who has been determined to be our Chief Operating Decision Maker (“CODM”), believes that Segment Adjusted EBITDA provides information with respect to the Company’s operating performance and the Company’s ability to meet its financial obligations. Howmet’s definition of Segment Adjusted EBITDA (Earnings before interest, taxes, depreciation, and amortization) is net margin plus an add-back for depreciation and amortization. Net margin is equivalent to Sales minus the following items: Cost of goods sold; Selling, general administrative, and other expenses; Research and development (“R&D”) expenses; and Provision for depreciation and amortization. Special items, including Restructuring and other charges, are excluded from net margin and Segment Adjusted EBITDA. The Company’s CODM considers forecast-to-actual variances for Segment Adjusted EBITDA when allocating resources across the Company’s reportable segments. Segment Adjusted EBITDA may not be comparable to similarly titled measures of other companies. Differences between the total segment and consolidated totals are in Corporate. (See \nNote C\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K). \nThe Company has aligned its operations consistent with how the CEO assesses operating performance and allocates capital.\nIncome before income taxes totaled $1,383 in 2024, $975 in 2023, and $606 in 2022. Segment Adjusted EBITDA for all reportable segments totaled $2,009 in 2024, $1,587 in 2023, and $1,352 in 2022. See below for the reconciliation of Total Segment Adjusted EBITDA to Income before income taxes.\nThe following information provides Sales, Segment Adjusted EBITDA, and Segment Adjusted EBITDA Margin for each reportable segment for each of the three years in the period ended December 31, 2024.\nEngine Products \n2024\n2023\n2022\nThird-party sales\n$\n3,735 \n$\n3,266 \n$\n2,698 \nSegment Adjusted EBITDA\n1,150 \n887 \n729 \nSegment Adjusted EBITDA Margin\n30.8 \n%\n27.2 \n%\n27.0 \n%\nEngine Products produces investment castings, including airfoils, and seamless rolled rings primarily for aircraft engines (aerospace commercial and defense) and industrial gas turbine applications. Engine Products produces rotating parts as well as structural parts, which are sold directly to customers. Generally, the sales and costs and expenses of this segment are transacted in the local currency of the respective operations, which are mostly the U.S. dollar, British pound, euro, and Japanese yen.\nThird-party sales for the Engine Products segment increased $469, or 14%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace, defense aerospace, oil and gas, and industrial gas turbine markets, including spares growth.\nThird-party sales for the Engine Products segment increased $568, or 21%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets.\nSegment Adjusted EBITDA for the Engine Products segment increased $263, or 30%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace, defense aerospace, oil and gas, and industrial gas turbine markets. The segment absorbed approximately 1,205 net headcount since the end of 2023 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\n26\nTable\n \nof\n Contents\nSegment Adjusted EBITDA for the Engine Products segment increased $158, or 22%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets. The segment absorbed approximately 1,030 net headcount since the end of 2022 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\nSegment Adjusted EBITDA Margin for the Engine Products segment increased approximately 360 basis points in 2024 compared with 2023, primarily due to growth in the commercial aerospace, defense aerospace, oil and gas, and industrial gas turbine markets.\nSegment Adjusted EBITDA Margin for the Engine Products segment increased approximately 20 basis points in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets, partially offset by an increase in headcount and inflationary costs.\nIn 2025, as compared to 2024, demand in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets is expected to increase. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nFastening Systems\n2024\n2023\n2022\nThird-party sales\n$\n1,576 \n$\n1,349 \n$\n1,117 \nSegment Adjusted EBITDA\n406 \n278 \n234 \nSegment Adjusted EBITDA Margin\n25.8 \n%\n20.6 \n%\n20.9 \n%\nFastening Systems produces aerospace and industrial fastening systems, as well as commercial transportation fasteners. The business’s high-tech, multi-material fastening systems are found nose to tail on aircraft and aero engines. The business’s products are also critical components of commercial transportation vehicles and construction and industrial equipment. Fastening Systems are sold directly to customers and through distributors. Generally, the sales and costs and expenses of this segment are transacted in the local currency of the respective operations, which are mostly the U.S. dollar, British pound, and euro.\nThird-party sales for the Fastening Systems segment increased $227, or 17%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace market, including wide body recovery.\nThird-party sales for the Fastening Systems segment increased $232, or 21%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, including the emerging wide body recovery, commercial transportation, defense aerospace, and industrial markets.\nSegment Adjusted EBITDA for the Fastening Systems segment increased $128, or 46%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace market, productivity gains which included reduced net headcount of approximately 135, and impacts of foreign currency.\nSegment Adjusted EBITDA for the Fastening Systems segment increased $44, or 19%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, commercial transportation, defense aerospace, and industrial markets. The segment absorbed approximately 435 net headcount since the end of 2022 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\nSegment Adjusted EBITDA Margin for the Fastening Systems segment increased approximately 520 basis points in 2024 compared with 2023, primarily due to growth in the commercial aerospace market as well as productivity gains.\nSegment Adjusted EBITDA Margin for the Fastening Systems segment decreased approximately 30 basis points in 2023 compared with 2022, primarily due to an increase in headcount and inflationary costs, partially offset by higher volumes in the commercial aerospace, commercial transportation, defense aerospace, and industrial markets.\nIn 2025, as compared to 2024, demand in the commercial aerospace market is expected to increase. Demand in the commercial transportation market is not expected to recover before mid year of 2025 with some growth starting in the second half of 2025. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\n27\nTable\n \nof\n Contents\nEngineered Structures\n2024\n2023\n2022\nThird-party sales\n$\n1,065 \n$\n878 \n$\n790 \nSegment Adjusted EBITDA\n166 \n113 \n111 \nSegment Adjusted EBITDA Margin\n15.6 \n%\n12.9 \n%\n14.1 \n%\nEngineered Structures produces titanium ingots and mill products for aerospace and defense applications and is vertically integrated to produce titanium forgings, titanium extrusions, and machining services for airframe, wing, aero-engine, and landing gear components. Engineered Structures also produces aluminum forgings, nickel forgings, and aluminum machined components, and assemblies for aerospace and defense applications. The segment’s products are sold directly to customers and through distributors, and sales and costs and expenses of this segment are generally transacted in the local currency of the respective operations, which are mostly the U.S. dollar.\nThird-party sales for the Engineered Structures segment increased $187, or 21%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace and defense aerospace markets. The Engineered Structures segment is focusing on the optimization of its manufacturing footprint and rationalization of product mix in order to maximize profitability.\nThird-party sales for the Engineered Structures segment increased $88, or 11%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace market, including Russian titanium share gains and the emerging wide body recovery, partially offset by lower volumes in the defense aerospace market associated with legacy fighter programs.\nSegment Adjusted EBITDA for the Engineered Structures\n \nsegment increased $53, or 47%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace and defense aerospace markets. The Engineered Structures segment is focusing on the optimization of its manufacturing footprint and rationalization of product mix in order to maximize profitability.\nSegment Adjusted EBITDA for the Engineered Structures\n \nsegment increased $2, or 2%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace market, partially offset by lower volumes in the defense aerospace market and additional operating costs from production rate increases not realized due to production bottlenecks at a plant. The segment absorbed approximately 280 net headcount since the end of 2022 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\nSegment Adjusted EBITDA Margin for the Engineered Structures\n \nsegment increased approximately 270 basis points in 2024 compared with 2023, primarily due to growth in the commercial aerospace and defense aerospace markets. The Engineered Structures segment is focusing on the optimization of its manufacturing footprint and rationalization of product mix in order to maximize profitability. \nSegment Adjusted EBITDA Margin for the Engineered Structures\n \nsegment decreased approximately 120 basis points in 2023 compared with 2022, primarily due to lower volumes in the defense aerospace market, material and inflationary cost pass through, additional operating costs from production rate increases not realized due to production bottlenecks at a plant, and an increase in headcount, partially offset by higher volumes in the commercial aerospace market.\nIn 2025, as compared to 2024, demand in the defense aerospace and commercial aerospace markets is expected to increase. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nForged Wheels\n2024\n2023\n2022\nThird-party sales\n$\n1,054 \n$\n1,147 \n$\n1,058 \nSegment Adjusted EBITDA\n287 \n309 \n278 \nSegment Adjusted EBITDA Margin\n27.2 \n%\n26.9 \n%\n26.3 \n%\nForged Wheels produces forged aluminum wheels and related products globally for heavy-duty trucks, trailers, and buses. Forged Wheels’ products are sold directly to OEMs and through distributors. Generally, the sales and costs and expenses of this segment are transacted in the local currency of the respective operations, which are mostly the U.S. dollar and euro.\nThird-party sales for the Forged Wheels segment decreased $93, or 8%, in 2024 compared with 2023, primarily due to lower volumes in the commercial transportation market as well as a decrease in aluminum and other inflationary cost pass through.\nThird-party sales for the Forged Wheels segment increased $89, or 8%, in 2023 compared with 2022, primarily due to higher volumes in the commercial transportation market.\n28\nTable\n \nof\n Contents\nSegment Adjusted EBITDA for the Forged Wheels\n \nsegment decreased $22, or 7%, in 2024 compared with 2023, primarily due to lower volumes in the commercial transportation market. The segment reduced approximately 160 net headcount since the end of 2023 as a result of lower production.\nSegment Adjusted EBITDA for the Forged Wheels\n \nsegment increased $31, or 11%, in 2023 compared with 2022, primarily due to higher volumes in the commercial transportation market, partially offset by a supply chain disruption and unfavorable foreign currency movements.\nSegment Adjusted EBITDA Margin for the Forged Wheels\n \nsegment increased approximately 30 basis points in 2024 compared with 2023, primarily due to lower aluminum and other inflationary cost pass through, partially offset by lower volumes in the commercial transportation market.\nSegment Adjusted EBITDA Margin for the Forged Wheels\n \nsegment increased approximately 60 basis points in 2023 compared with 2022, primarily due to higher volumes, partially offset by a supply chain disruption and unfavorable foreign currency movements. The favorable impact of lower aluminum prices was partially offset by other inflationary cost pass through.\nIn 2025, as compared to 2024, demand in the commercial transportation markets served by Forged Wheels is not expected to recover before mid year of 2025 with some growth starting in the second half of 2025. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nReconciliation of Total Segment Adjusted EBITDA to Income before income taxes\n2024\n2023\n2022\nIncome before income taxes\n$\n1,383 \n$\n975 \n$\n606 \nLoss on debt redemption\n6 \n2 \n2 \nInterest expense, net\n182 \n218 \n229 \nOther expense, net\n(1)\n62 \n8 \n82 \nOperating income\n$\n1,633 \n$\n1,203 \n$\n919 \nSegment provision for depreciation and amortization\n270 \n262 \n258 \nUnallocated amounts:\nRestructuring and other charges\n21 \n23 \n56 \nCorporate expense\n85 \n99 \n119 \nTotal Segment Adjusted EBITDA\n$\n2,009 \n$\n1,587 \n$\n1,352 \n(1)\nSee \nNote F\n to the Consolidated Financial Statements in \nPart II, Item 8\n of this Form 10-K.\nTotal Segment Adjusted EBITDA is a non-GAAP financial measure. Management believes that this measure is meaningful to investors because it provides additional information with respect to the Company’s operating performance and the Company’s ability to meet its financial obligations. Differences between the total segment and consolidated totals are in Corporate. \nSee Restructuring and other charges, D&A, Loss on debt redemption, Interest expense, net, and Other expense, net discussions above under “Results of Operations” for reference.\nCorporate expense decreased $14, or 14%, in 2024 compared with 2023, primarily due to lower costs associated with closures, supply chain disruptions, and other items of $13, lower costs related to the collective bargaining agreement negotiations of $8, and higher net reimbursements related to the France Plant Fire and the Barberton Cast House Incident of $6, partially offset by higher employment costs in 2024.\nCorporate expense decreased $20, or 17%, in 2023 compared with 2022, primarily due to lower net costs related to the France Plant Fire, the Barberton Plant Fire, and the Barberton Cast House Incident of $48, partially offset by costs associated with closures, shutdowns, and other items of $10, costs related to collective bargaining agreement negotiations of $8, legal and other advisory reimbursements received in 2022 of $3 which did not recur in 2023, and higher employment costs in 2023.\nEnvironmental Matters\nSee the Environmental Matters section of \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n of this Form 10-K.\nLiquidity and Capital Resources\nHowmet maintains a disciplined approach to cash management and the strengthening of its balance sheet. Management continued to focus on actions to improve Howmet’s cost structure and liquidity, providing the Company with the ability to \n29\nTable\n \nof\n Contents\noperate effectively. Such actions included procurement efficiencies and overhead rationalization to reduce costs, working capital initiatives, and maintaining a sustainable level of capital expenditures.\nCash provided from operations and financing activities is expected to be adequate to cover Howmet’s operational and business needs over the next 12 months. For an analysis of long-term liquidity, see “Contractual Obligations and Off-Balance Sheet Arrangements” below.\nAs of December 31, 2024, cash and cash equivalents of Howmet were $564, of which $284 was held by Howmet’s non-U.S. subsidiaries. If the cash held by non-U.S. subsidiaries were to be repatriated to the U.S., the Company does not expect there to be material income tax consequences.\nOperating Activities\nCash provided from operations in 2024 was $1,298 compared with $901 in 2023 and $733 in 2022.\nThe increase in cash provided from operations of $397, or 44%, between 2024 and 2023 was due to higher operating results of $361 and lower working capital of $72, partially offset by higher pension contributions of $43. The components of the change in working capital included favorable changes in receivables of $107, inventories of $36, prepaid expenses and other current assets of $10, partially offset by accounts payable of $42, compensation related payments and other accrued expenses of $32, and taxes, including income taxes, of $7.\nThe increase in cash provided from operations of $168, or 23%, between 2023 and 2022 was due to higher operating results of $303, lower payments on noncurrent liabilities of $26, and lower pension contributions of $7, partially offset by higher working capital of $163. The components of the change in working capital included unfavorable changes in accounts payable of $253, prepaid expenses and other current assets of $18, and receivables of $3, including collections of employee retention credit receivables, partially offset by inventories of $92, accrued expenses of $14 and taxes, including income taxes, of $5.\nFinancing Activities\nCash used for financing activities was $1,026 in 2024 compared with $868 in 2023 and $526 in 2022.\nThe use of cash in 2024 was primarily related to the repayments on the aggregate outstanding principal amount of long-term debt of approximately $870, the repurchase of common stock of $500, dividends paid to shareholders of $109, taxes paid for net share settlement of equity awards of $49, and debt issuance costs for the 2031 Notes of $5, partially offset by proceeds from the 2031 Notes debt issuance of $500 and the exercise of employee stock options of $8. On an annual basis, the 2024 debt reduction and refinancing activities will decrease Interest expense, net by approximately $37.\nThe use of cash in 2023 was primarily related to the repayments on the aggregate outstanding principal amount of long-term debt of approximately $876, the repurchase of common stock of $250, taxes paid for net share settlement of equity awards of $77, and dividends paid to shareholders of $73. These items were partially offset by proceeds from term loan facilities of $400 and the exercise of employee stock options of $11.\nThe use of cash in 2022 was primarily related to the repurchase of common stock of $400, the repayments on the aggregate outstanding principal amount of long-term debt of approximately $69, and dividends paid to shareholders of $44. These items were partially offset by proceeds from the exercise of employee stock options of $16.\nFor further details regarding the Company’s debt reduction and refinancing activities and stock repurchases, see \nNote Q\n and \nNote I\n, respectively, to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K.\nOn July 30, 2024, the Board of Directors of Howmet Aerospace approved the establishment of a 2025 dividend policy to pay cash dividends on the Company’s common stock in 2025 at a rate of 15% plus or minus 5% of net income excluding special items. The declaration of future common stock dividends is subject to the discretion and approval of the Board of Directors of Howmet after the Board’s consideration of all factors it deems relevant and subject to applicable law. The Company may modify, suspend, or cancel the dividend policy in any manner and at any time that it may deem necessary or appropriate.\nThe Company maintains a credit facility (the “Credit Facility”) pursuant to its Five-Year Revolving Credit Agreement (the “Credit Agreement”) with a syndicate of lenders and issuers named therein (See \nNote Q\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for reference). \nThere were no amounts outstanding under the Credit Agreement as of December 31, 2024 or December 31, 2023, and no amounts were borrowed during 2024 or 2023 under the Credit Agreement. \nOn April 4, 2024, the Company established a commercial paper program under which the Company may issue unsecured commercial paper from time to time up to a maximum aggregate face amount of \n$1,000\n. The Company’s commercial paper will be sold on customary terms in the U.S. commercial paper market on a private placement basis. The proceeds of the commercial \n30\nTable\n \nof\n Contents\npaper will be used for general corporate purposes. In conjunction with the commercial paper program, the Company was assigned short-term credit ratings by Moody’s Investors Service, Inc., S&P Global Ratings, and Fitch Ratings, Inc.\nThe Company has an effective shelf registration statement on Form S-3, filed with the SEC, which allows for offerings of debt securities from time to time. The Company may opportunistically issue new debt securities in accordance with securities laws or utilize commercial paper in order to, but not limited to, refinance existing indebtedness.\nIn the future, the Company may, from time to time, redeem portions of its debt securities or repurchase portions of its debt or equity securities in either the open market or through privately negotiated transactions, in accordance with applicable SEC and other legal requirements. The timing, prices, and sizes of purchases depend upon prevailing trading prices, general economic and market conditions, and other factors, including applicable securities laws. Such purchases may be completed by means of trading plans established from time to time in accordance with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended, block trades, private transactions, open market repurchases, tender offers, and/or accelerated share repurchase agreements or other derivative transactions. \nThe Company’s costs of borrowing and ability to access the capital markets are affected not only by market conditions but also by the short-term and long-term debt ratings assigned to the Company by the major credit rating agencies. The Company believes that its cash on hand, cash provided from operations and availability of its Credit Facility, its commercial paper program, and its accounts receivables securitization program will continue to be sufficient to fund our operating and capital allocation activities.\nThe three major credit rating agencies have rated Howmet’s debt with investment grade ratings. The Company’s most recent short-term and long-term credit ratings, as well as the current outlook from the three major credit rating agencies are as follows: \n \nShort-Term\nLong-Term\nOutlook\nS&P Global Ratings (“S&P”)\nA-2\nBBB\nStable\nMoody’s Investors Service (“Moody’s”)\nP-2\nBaa1\nStable\nFitch Investors Service (“Fitch”)\nF2\nBBB\nPositive\nOn November 26, 2024, S&P upgraded Howmet’s short-term debt rating from A-3 to A-2 and long-term debt rating from BBB- to BBB, and affirmed the current outlook at stable, citing strong demand for commercial aerospace components and debt reduction.\nOn August 6, 2024, Moody’s upgraded Howmet’s short-term debt rating from P-3 to P-2 and further upgraded Howmet’s long-term debt rating two notches from Baa3 to Baa1, which was previously upgraded to Baa3 from Ba1 on February 29, 2024 citing demand in the markets served by Howmet along with the Company’s improved financial leverage and updated the current outlook from positive to stable. \nOn August 6, 2024, Fitch affirmed Howmet’s short-term debt rating at F2 and long-term debt rating at BBB and updated the current outlook from stable to positive.\nInvesting Activities\nCash used for investing activities was $316, $215, and $135 in 2024, 2023, and 2022, respectively.\nThe use of cash in 2024 was capital expenditures of $321 primarily related to Engine Products capacity expansion, various automation projects, and sustaining and return seeking capital projects across all segments and an acquisition in Engine Products, net of cash acquired of $5, partially offset by proceeds from the sale of assets in Engine Products and a business in Engineered Structures of $9.\nThe use of cash in 2023 was capital expenditures of $219 primarily related to various automation projects, information technology upgrades, and sustaining and return seeking capital projects across all segments, partially offset by proceeds from the sale of assets and investments of $4.    \nThe use of cash in 2022 was capital expenditures of $193 primarily related to various automation projects, information technology upgrades, and sustaining capital projects across all segments, partially offset by proceeds from the sale of assets of $58, which was primarily due to the sale of the corporate center and a manufacturing facility in Engine Products. In the second quarter of 2022, the Company sold the corporate headquarters in Pittsburgh, PA. The proceeds from the sale of the corporate headquarters were $44, excluding $3 of transaction costs, and a carrying value of $41. The Company entered into a 12-year lease with the purchaser for a portion of the property. Additionally, in the fourth quarter of 2022, the Company sold the property of a manufacturing facility in the Engine Products segment. The proceeds from the sale of this property were $15 and a carrying value of $7.\n31\nTable\n \nof\n Contents\nContractual Obligations and Off-Balance Sheet Arrangements\nContractual Obligations\nHowmet is required to make future payments under various contracts, including long-term purchase obligations, financing arrangements, and lease agreements. Howmet also has commitments to fund its pension plans, provide payments for other postretirement benefit plans, and fund capital projects. \nIn order to better understand Howmet’s outstanding contractual obligations, the table below represents a summary of these commitments as of December 31, 2024 (these contractual obligations are grouped in the same manner as they are classified in the Statement of Consolidated Cash Flows in order to provide a better understanding of the nature of the obligations and to provide a basis for comparison to historical information):\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nOperating activities:\nRaw material purchase obligations\n$\n379 \n$\n218 \n$\n82 \n$\n79 \n$\n— \nPurchase and other payment obligations\n30 \n19 \n11 \n— \n— \nOperating leases\n189 \n46 \n68 \n36 \n39 \nInterest related to total debt\n1,133 \n165 \n298 \n189 \n481 \nEstimated minimum required pension funding\n352 \n45 \n154 \n153 \n— \nOther postretirement benefit payments\n56 \n6 \n12 \n12 \n26 \nLayoff and other restructuring payments\n4 \n4 \n— \n— \n— \nUncertain tax positions\n6 \n— \n— \n— \n6 \nFinancing activities:\nTotal debt\n3,328 \n5 \n948 \n1,000 \n1,375 \n   Dividends to shareholders\n42 \n42 \n— \n— \n— \nInvesting activities:\nCapital projects\n417 \n270 \n147 \n— \n— \nTotals\n$\n5,936 \n$\n820 \n$\n1,720 \n$\n1,469 \n$\n1,927 \nObligations for Operating Activities\nRaw material purchase obligations consist mostly of aluminum, titanium, cobalt, nickel, and various other metals with expiration dates ranging from less than one year to five years. Many of these purchase obligations contain variable pricing components, and, as a result, actual cash payments may differ from the estimates provided in the preceding table. The Company generally passes through material costs in customer contracts with limited exceptions. \nIn connection with the \nArconic Inc. Separation Transaction\n, the Company entered into several agreements with Arconic Corporation that \ngovern the relationship \nbetween\n the Company and Arconic Corporation following the separation, including raw material supply agreements.\n \nPurchase and other payment obligations include public utility purchase obligations, and future payments of tax-related interest and penalties.\nOperating leases represent multi-year obligations for certain land and buildings, plant equipment, vehicles, and computer equipment.\nDeferred revenue was $60 as of December 31, 2024. Deferred revenue arrangements require Howmet to deliver product to certain customers over a specified contract period, which is expected to be within one year. While these obligations are not expected to result in cash payments and are not included in the table above, they represent contractual obligations for which the Company would be obligated if the specified product deliveries could not be made.\nInterest related to total debt with maturities that extend to 2042, including cross-currency and interest rate swaps, is based on fixed rates as of December 31, 2024.\nEstimated minimum required pension funding and other postretirement benefit payments are based on actuarial estimates using current assumptions for discount rates, long-term rate of return on plan assets, and health care cost trend rates, among others. It is Howmet’s policy to fund amounts for pension plans sufficient to meet the minimum requirements set forth in the benefits laws and tax laws of the applicable country. Periodically, Howmet contributes additional amounts as deemed appropriate. Howmet has determined that it is not practicable to present pension funding and other postretirement benefit payments beyond 2030 and 2034, respectively.\nLayoff and other restructuring payments to be paid within one year primarily relate to severance costs.\n32\nTable\n \nof\n Contents\nUncertain tax positions taken or expected to be taken on an income tax return may result in additional payments to tax authorities. The amounts in the preceding table include interest and penalties accrued related to such positions as of December 31, 2024. Amounts for uncertain tax positions in which the timing of future potential payments are not reasonably estimable are included in the “Thereafter” column. If a tax authority agrees with the tax position taken or expected to be taken or the applicable statute of limitations expires, then additional payments will not be necessary. Tax assessments received may also result in payments to be made in order to preserve our right to appeal any tax positions challenged by tax authorities for which we have concluded that we are more likely than not to prevail. See \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for further discussion on tax payments made.\nContingencies such as ongoing legal proceedings and environmental matters may also result in additional cash payments. The timing of these payments, if necessary, depends on several factors, including the timing of litigation and settlements of liability claims. Accordingly, amounts have not been included in the preceding table. Amounts for settled legal proceedings and other such payables are included within Purchase and other payment obligations in the preceding table. See \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for further discussion.\nObligations for Financing Activities\nHowmet has historically paid quarterly dividends on its preferred and common stock. The Company paid an aggregate of $109 in common stock and preferred stock dividends to shareholders during 2024. Because all dividends are subject to approval by Howmet’s Board of Directors, amounts are not included in the preceding table unless such authorization has occurred. As of December 31, 2024, there were 405,431,361 shares of outstanding common stock and 546,024 shares of outstanding Class A preferred stock. In 2024, the preferred stock dividend was $3.75 per share. A dividend of $0.26 per share on the Company’s common stock was paid in 2024 ($0.05 per share in each of the first and second quarters of 2024 and $0.08 in the third and fourth quarters of 2024). Fully diluted shares outstanding as of December 31, 2024 were 408 million.\nThe Company has a share repurchase program (the “Share Repurchase Program”) that, after giving effect to the additional $50 share repurchases made in January 2025 at an average price per share of $116.39, retiring approximately 0.4 million shares, has approximately $2,147 in Board authorization remaining available as of January 31, 2025. The current Share Repurchase Program was authorized by the Company’s Board of Directors on August 18, 2021 at $1,500, which was increased by the Board by $2,000 on July 30, 2024. There is no stated expiration for the Share Repurchase Program. Accordingly, amounts have not been included in the preceding table. See “Liquidity and Capital Resources” for additional information.\nObligations for Investing Activities\nCapital projects in the preceding table only include amounts approved by management as of December 31, 2024. Funding levels may vary in future years based on the anticipated construction schedules of the projects. It is expected that significant expansion projects will be funded through various sources, including cash provided from operations. Total capital expenditures are anticipated to be approximately 4% of sales in 2025 and include additional capital expenditures related to the Engine Products capacity expansions.\nOff-Balance Sheet Arrangements\nAs of December 31, 2024, Howmet had outstanding bank guarantees related to tax matters, customs duties, rental, plant expansion, and environmental obligations. The total amount committed under these guarantees, which expire at various dates between 2025 and 2027, was $6 as of December 31, 2024.\nPursuant to the Separation and Distribution Agreement, dated as of October 31, 2016, between Howmet and Alcoa Corporation, Howmet was required to provide certain guarantees for Alcoa Corporation, which were included in Other noncurrent liabilities and deferred credits in the Consolidated Balance Sheet. The remaining guarantee, which had a fair value of \n$6 as of both December 31, 2024 and 2023, \nrelates to a long-term energy supply agreement that expires in \n2047\n at an Alcoa Corporation f\nacility, for which the Company is secondarily liable in the event of a payment default by Alcoa Corporation. If the Company incurs any liability under this guarantee, Arconic Corporation is obligated to indemnify the Company for 50% of such liability\n. \nThe Company currently views the risk of an Alcoa Corporation payment default on its obligations under the contract to be remote. \nThe Company is required to provide a guarantee up to \nan estimated present value amount of approximately $1,121 and $1,131 as of December 31, 2024 and 2023, respectively, in the event of an Alcoa Corporation default. In December 2022, December 2023, and December 2024, a surety bond with a limit of $80 relating to this guarantee was obtained by Alcoa Corporation to protect Howmet's obligation. This surety bond will be renewed on an annual basis by Alcoa Corporation.\nThe Company has outstanding letters of credit, primarily related to workers’ compensation, environmental obligations, insurance obligations, and tax matters. The total amount committed under these letters of credit, which automatically renew or expire at various dates, primarily in 2025, was $90 as of \nDecember 31, 2024\n.\n33\nTable\n \nof\n Contents\nPursuant to the Separation and Distribution Agreements between the Company and Arconic Corporation and between the Company and Alcoa Corporation, the Company is required to retain letters of credit of $48 (which are included in the \n$90\n in the above paragraph) that had previously been provided related to the Company, Arconic Corporation, and Alcoa Corporation workers’ compensation claims that occurred prior to the respective separation transactions of April 1, 2020 and November 1, 2016. Arconic Corporation and Alcoa Corporation workers’ compensation and letters of credit fees paid by the Company are proportionally billed to, and are reimbursed by, Arconic Corporation and Alcoa Corporation, respectively. Also, the Company was required to provide letters of credit for certain Arconic Corporation and Alcoa Corporation environmental obligations and, as a result, the Company has $17 of outstanding letters of credit relating to such liabilities (which are also included in the \n$90\n in the above paragraph). Arconic Corporation is being billed for these letter of credit fees paid by the Company and will reimburse the Company for any payments made under these letters of credit.\nThe Company has outstanding surety bonds primarily related to customs duties, workers’ compensation, environmental-related matters, and contract performance. The total amount committed under these annual surety bonds, which automatically renew or expire at various dates, primarily in 2025 and 2026, was $44 as of December 31, 2024.\nPursuant to the Separation and Distribution Agreements between the Company and Arconic Corporation and between the Company and Alcoa Corporation, the Company is required to provide surety bonds of $21, which are included in the $44 in the above paragraph, that had previously been provided related to the Company, Arconic Corporation, and Alcoa Corporation workers’ compensation claims that occurred prior to the respective separation transactions of April 1, 2020 and November 1, 2016. Arconic Corporation and Alcoa Corporation workers’ compensation claims and surety bond fees paid by the Company are proportionately billed to, and are reimbursed by, Arconic Corporation and Alcoa Corporation, respectively.\nCritical Accounting Policies and Estimates\nThe preparation of the Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States of America requires management to make certain judgments, estimates, and assumptions regarding uncertainties that affect the amounts reported in the Consolidated Financial Statements and disclosed in the accompanying Notes. These estimates are based on historical experience and, in some cases, assumptions based on current and future market experience, including considerations relating to changes in the aerospace industry. Areas that require significant judgments, estimates, and assumptions include the testing of goodwill, properties, plants, and equipment, and other intangible assets for impairment; pension plans and other postretirement benefits obligations; income taxes; and litigation and contingent liabilities.\nManagement uses historical experience and all available information to make these judgments, estimates, and assumptions, and actual results may differ from those used to prepare the Company’s Consolidated Financial Statements at any given time. Despite these inherent limitations, management believes that Management’s Discussion and Analysis of Financial Condition and Results of Operations and the Consolidated Financial Statements and accompanying Notes provide a meaningful and fair perspective of the Company.\nA summary of the Company’s significant accounting policies is included in \nNote A\n to the Consolidated Financial Statements of this Form 10-K. Management believes that the application of these policies on a consistent basis enables the Company to provide the users of the Consolidated Financial Statements with useful and reliable information about the Company’s operating results and financial condition.\nGoodwill. \nHowmet reviews goodwill for impairment annually (in the fourth quarter) or more frequently if indicators of impairment exist or if a decision is made to sell or realign a business. The Company has the option to assess impairment through qualitative assessment, which includes factors such as general economic conditions, negative developments in equity and credit markets, adverse changes in the markets in which an entity operates, increases in input costs that have a negative effect on earnings and cash flows, or a trend of negative or declining cash flows over multiple periods, among others. Howmet can also assess goodwill impairment through a quantitative analysis, using a discounted cash flow (“DCF”) model to estimate a reporting unit’s fair value. Assumptions and estimates utilized in the DCF model include weighted average cost of capital (“WACC”) rates, revenue, future profitability, working capital, cash flows, and a number of other items. For more information on these matters, see \nNote A\n to the Consolidated Financial Statements of this Form 10-K. \nProperties, Plants, and Equipment and Other Intangible Assets. \nProperties, plants, and equipment and Other intangible assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of such assets (asset group) may not be recoverable. Recoverability of assets is determined by comparing the estimated undiscounted net cash flows of the operations related to the assets (asset group) to their carrying amount. An impairment loss would be recognized when the carrying amount of the assets (asset group) exceeds the estimated undiscounted net cash flows. The amount of the impairment loss to be recorded is measured as the excess of the carrying value of the assets (asset group) over their fair value, with fair value determined using the best information available, which generally is a DCF model. The determination of what constitutes an asset group, the associated estimated undiscounted net cash flows, and the estimated useful lives of the assets also require significant judgments.\n34\nTable\n \nof\n Contents\nPension and Other Postretirement Benefits.\n Liabilities and expenses for pension and other postretirement benefits are determined using actuarial methodologies and incorporate significant assumptions, including the interest rate used to discount the future estimated liability, the expected long-term rate of return on plan assets, and several assumptions relating to the employee workforce (health care cost trend rates, retirement age, and mortality). The pension and other postretirement benefits obligation was $1,556 and $1,695, with a funded status of $(670) and $(770) as of December 31, 2024 and 2023, respectively. The total benefit obligation reduction of $133 was primarily driven by benefit payments. The improvement in the funded status of $100 was primarily driven by contributions and changes in discount rates. Excluding settlements and curtailments, net periodic benefit cost of pension and other postretirement benefits is expected to be approximately $35 in 2025 compared to $33 in 2024 and 2023.\nEmployer contributions for pension benefits were \n$79 and $36\n for the years ended December 31, 2024 and 2023, respectively. Benefits paid for other postretirement benefits were $11 and $14 for the years ended December 31, 2024 and 2023, respectively. Total pension contributions and other postretirement benefits paid increased by $40, or 80%, in 2024 compared to 2023 primarily driven by additional discretionary contributions in addition to actual asset returns falling short of the plans’ estimated return on assets assumption. Cash pension contributions in 2025 are expected to be approximately $60. Howmet’s estimated funded status under the Employee Retirement Income Security Act was approximately 68% as of January 1, 2024.\nThe interest rate used to discount future estimated liabilities for the U.S. is determined using a Company-specific yield curve model (above-median) developed with the assistance of an external actuary, while both the U.K. and Canada utilize models developed by the respective actuary. The cash flows of the plans’ projected benefit obligations are discounted using a single equivalent rate derived from yields on high quality corporate bonds, which represent a broad diversification of issuers in various sectors, including finance and banking, industrials, transportation, and utilities, among others. The yield curve models parallel the plans’ projected cash flows, which have a global average duration of 9 years. The underlying cash flows of the \nbonds included in the models exceed the cash flows needed to satisfy the Company’s plans’ obligations multiple times. In 2024, 2023, and 2022, the discount rate used to determine benefit obligations for pension and other postretirement benefit plans was 5.60%, 5.10%, and 5.40%, respectively. \nThe impact on the liabilities of a change in the discount rate of 1/4 of 1% would be approximately $32 and either a charge or credit of less than $1 to earnings in the following year.\nThe expected long-term rate of return on plan assets is generally applied to a five-year market-related value of plan assets. The process used by management to develop this assumption is one that relies on a combination of historical asset return information and forward-looking returns by asset class. As it relates to historical asset return information, management focuses on various historical moving averages when developing this assumption. While consideration is given to recent performance and historical returns, the assumption represents a long-term, prospective return. Management also incorporates expected future returns on current and planned asset allocations using information from various external investment managers and consultants, as well as management’s own judgment.\nManagement used 6.70% for \n2024,\n \n2023, and\n \n2022\n as its weighted-average global expected long-term rate of return on plan assets, which was based on the prevailing and planned strategic asset allocations, as well as estimates of future returns by asset class for each plan. T\nhese rates were within the respective range of the 20-year moving average of actual performance and the expected future return developed by asset class for each plan. For 2025, management anticipates that the expected long-term rate of return for global plan assets will remain at approximately 7%.\n A change in the assumption for the expected long-term rate of return on plan assets of 1/4 of 1% would impact earnings by approximately $3 for \n2025\n.\nIn \n2024\n, net income of $17 (after-tax) was recorded in other comprehensive loss, primarily due to the increase in the discount rate, partially offset by plan asset returns that were less than expected. In \n2023\n, net loss of $36 (after-tax) was recorded in other comprehensive loss, primarily due to the decrease in the discount rate.\n \nIn \n2022\n, net income of $146 (after-tax) was recorded in other comprehensive loss, primarily due to the increase in the discount rate and amortization of actuarial losses, partially offset by plan asset returns that were less than expected.\nIncome Taxes.\n The provision (benefit) for income taxes is determined using the asset and liability approach of accounting for income taxes. Under this approach, the provision (benefit) for income taxes represents income taxes paid or payable (or received or receivable) based on current year pre-tax income plus the change in deferred taxes during the year. Deferred taxes represent the future tax consequences expected to occur when the reported amounts of assets and liabilities are recovered or paid, and result from differences between the financial and tax bases of Howmet’s assets and liabilities and are adjusted for changes in tax rates and tax laws when enacted.\nValuation allowances are recorded to reduce deferred tax assets when it is more likely than not that a tax benefit will not be realized. In evaluating the need for a valuation allowance, management considers all potential sources of taxable income, including income available in carry-back periods, future reversals of taxable temporary differences, projections of taxable income, and income from tax planning strategies, as well as all available positive and negative evidence. Positive evidence includes factors such as a history of profitable operations, projections of future profitability within the carryforward period, including from tax planning strategies, and Howmet’s experience with similar operations. Existing favorable contracts and the \n35\nTable\n \nof\n Contents\nability to sell products into established markets are additional positive evidence. Negative evidence includes items such as cumulative losses, projections of future losses, or carryforward periods that are not long enough to allow for the utilization of a deferred tax asset based on existing projections of income. Deferred tax assets for which no valuation allowance is recorded may not be realized upon changes in facts and circumstances, resulting in a future charge to establish a valuation allowance. Existing valuation allowances are re-examined under the same standards of positive and negative evidence. If it is determined that it is more likely than not that a deferred tax asset will be realized, the appropriate amount of the valuation allowance, if any, is released. Deferred tax assets and liabilities are also remeasured to reflect changes in underlying tax rates due to law changes and the granting and lapse of tax holidays.\nIt is Howmet’s policy to apply a tax law ordering approach when considering the need for a valuation allowance on net operating losses expected to offset GILTI inclusions. Under this approach, reductions in cash tax savings are not considered as part of the valuation allowance assessment. Instead, future GILTI inclusions are considered a source of taxable income that support the realizability of deferred tax assets.\nIt is Howmet’s policy to treat taxes due from future inclusions in U.S. taxable income related to GILTI as a current period expense when incurred.\nTax benefits related to uncertain tax positions taken or expected to be taken on a tax return are recorded when such benefits meet a more likely than not threshold. Otherwise, these tax benefits are recorded when a tax position has been effectively settled, which means that the statute of limitations has expired or the appropriate taxing authority has completed their examination even though the statute of limitations remains open. Interest and penalties related to uncertain tax positions are recognized as part of the provision for income taxes and are accrued beginning in the period that such interest and penalties would be applicable under relevant tax law until such time that the related tax benefits are recognized.\nLitigation and Contingent Liabilities.\n From time to time, we are involved in various lawsuits, claims, investigations, and proceedings. These matters may include speculative claims for substantial or indeterminate amounts of damages. Management determines the likelihood of an unfavorable outcome based on many factors, such as the nature of the matter, available defenses and case strategy, progress of the matter, views and opinions of legal counsel and other advisors, applicability and success of appeals processes, and the outcome of similar historical matters, among others. If an unfavorable outcome is deemed probable and the amount of the potential loss can be estimated, the most reasonable loss estimate is recorded. If an unfavorable outcome of a matter is deemed probable but the loss is not reasonably estimable, or if an unfavorable outcome is deemed reasonably possible, then the matter is disclosed but no liability is recorded. Legal matters are reviewed on a continuous basis to determine if there has been a change in management’s judgment regarding the likelihood of an unfavorable outcome or the estimate of a potential loss. For more information on these matters, see \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K.\nRecently Adopted and Recently Issued Accounting Guidance. \nSee the Recently Adopted and Recently Issued Accounting Guidance section of \nNote B\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K.",
  "item2": null
}