{
  "source_file": "idxx-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nThis Quarterly Report on Form 10-Q contains statements which, to the extent they are not statements of historical fact, constitute “forward-looking statements.” Such forward-looking statements about our business and expectations within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), include statements relating to, among other things, our expectations regarding revenue recognition timing and amounts; business trends, earnings, and other measures of financial performance; projected impact of foreign currency exchange rates and hedging activities; realizability of assets; future cash flow and uses of cash; future repurchases of common stock; future levels of indebtedness and capital spending; the working capital and liquidity outlook; critical accounting estimates; deductibility of goodwill; inflation; and projected impacts of tariff and trade policy changes and uncertainty. Forward-looking statements can be identified by the use of words such as “expects,” “may,” “anticipates,” “intends,” “would,” “will,” “plans,” “believes,” “estimates,” “should,” “project,” and similar words and expressions. These forward-looking statements are intended to provide our current expectations or forecasts of future events; are based on current estimates, projections, beliefs, and assumptions; and are not guarantees of future performance. Actual events or results may differ materially from those described in the forward-looking statements. These forward-looking statements involve a number of risks and uncertainties, including, among other things, the adverse impact, and the duration, of macroeconomic events, conditions, and uncertainties, such as geopolitical instability (including wars, terrorist attacks, and armed conflicts), general economic uncertainty, changes in U.S. and other countries’ tariff and trade policies, inflationary pressures, severe weather and other natural conditions, and supply chain challenges on our business, results of operations, liquidity, financial condition, and stock price, as well as the other matters described under the headings “Business,” “Risk Factors,” “Legal Proceedings,” “Management's Discussion and Analysis of Financial Condition and Results of Operations,” and “Quantitative and Qualitative Disclosure About Market Risk” in our 2024 Annual Report and in the corresponding sections of this Quarterly Report on Form 10-Q and our Quarterly Reports on Form 10-Q for the quarters ended March 31, 2025, and June 30, 2025, as well as those described from time to time in our other filings with the SEC.\nAny forward-looking statements represent our estimates only as of the day this Quarterly Report on Form 10-Q was filed with the SEC and should not be relied upon as representing our estimates as of any subsequent date. From time to time, oral or written forward-looking statements may also be included in other materials released to the public, and they are subject to the risks and uncertainties described or cross-referenced in this section. While we may elect to update forward-looking statements at some point in the future, we specifically disclaim any obligation to do so, even if our estimates or expectations change.\nYou should read the following discussion and analysis in conjunction with our 2024 Annual Report that includes additional information about us, our results of operations, our financial position, and our cash flows, and with our unaudited condensed consolidated financial statements and related notes included in “Part I. Item 1. Financial Statements” of this Quarterly Report on Form 10-Q.\nOur fiscal quarter ended on September 30. Unless otherwise stated, the analysis and discussion of our financial condition and results of operations below, including references to growth and organic growth and increases and decreases, are being compared to the equivalent prior-year periods.\nBusiness Overview \n \nWe develop, manufacture, and distribute products and provide services primarily for the companion animal veterinary, livestock, poultry and dairy, and water testing sectors. We also provide human medical point-of-care diagnostics. Our primary products and services are:\n•\nPoint-of-care veterinary diagnostic products, comprised of instruments, consumables, and rapid assay test kits;\n•\nVeterinary reference laboratory diagnostic and consulting services;\n•\nPractice management and diagnostic imaging systems and services used by veterinarians;\n•\nHealth monitoring, biological materials testing, laboratory diagnostic instruments, and services used by the biomedical research community;\n•\nDiagnostic and health-monitoring products for livestock, poultry, and dairy;\n•\nProducts that test water for certain microbiological contaminants; and\n•\nPoint-of-care electrolytes and blood gas analyzers for the human medical diagnostics sector.\n33\nDescription of Operating Segments\n. We operate primarily through three operating segments: diagnostic and information management-based products and services for the companion animal veterinary industry, which we refer to as the Companion Animal Group (“CAG”); water quality products (“Water”); and diagnostic tests, services, and related instrumentation that are used to manage the health status of livestock and poultry, to improve producer efficiency, and to ensure the quality and safety of milk, which we refer to as Livestock, Poultry and Dairy (“LPD”). Other information combines and presents our human medical diagnostic products business (“OPTI Medical”) with our out-licensing arrangements because they do not meet the quantitative or qualitative thresholds for reportable segments. Foreign currency transaction gains and losses for all operating segments are also reported within Other.\nCurrency Impact, Tariff and Trade Policies, U.S. Tax Law Changes, and Other Items\nCurrency Impact\n. Refer to “Part I, Item 3. Quantitative and Qualitative Disclosures about Market Risk” included in this Quarterly Report on Form 10-Q for additional information regarding the impact of foreign currency exchange rates.\nChanges in Tariff and Trade Policies\n. Although we manufacture many of our companion animal and water quality products, as well as certain of our LPD testing products, in the United States, we rely on third-party suppliers located in the United States and other regions (such as Europe and Asia Pacific) for certain components, raw materials, and consumables used in or with our products. In addition, as a global business, our products and services are sold in more than 175 countries. For the year ended December 31, 2024, approximately 35% of our overall revenues were attributable to sales of products and services to customers outside the United States, with less than 1% of our overall revenues attributable to sales of products and services to customers domiciled in China. Accordingly, changes in tariff and trade policies may adversely affect our business, financial condition, and operating results.\nThe U.S. government has periodically announced changes to its trade policy, including increasing tariffs on imports, in some cases significantly, and potentially renegotiating or terminating its existing trade agreements. Imposition of certain country-specific tariffs are uncertain and subject to negotiations, and these actions, as well as retaliatory tariffs imposed by other countries on U.S. exports and continuing uncertainty regarding tariff and trade policies have led to volatility and uncertainty in global markets. Continuing tariff and trade policy uncertainty may lead to sustained volatility and uncertainty in U.S. and global financial and economic conditions, increased inflation, diminished expectations for economic growth, and actual or perceived economic weakness, which could result in reduced demand for our products and services. \nWhile we are working to optimize operations and inventory management to the extent feasible, to help mitigate and reduce the potential impact from changes in tariff and trade policies, any imposed tariffs (including retaliatory tariffs) and our mitigation activities may cause our cost of goods to increase, our profit margins to decrease, or our products to become less competitive or less available in the applicable region. We are continuing to monitor the dynamic trade environment and evaluate these developments and our ability to offset some portion of these costs and otherwise mitigate the impact on our business, financial condition, and operating results.\nU.S. Tax Law Changes\n. On July 4, 2025, H.R. 1 of the 119th Congress, also referred to as the “One Big Beautiful Bill Act” (“OBBBA”), was signed into law. The OBBBA includes significant changes to federal tax law, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act of 2017, as well as modifications to the international tax framework and other regulatory provisions. The OBBBA also reinstates the ability to immediately expense domestic research and development costs for tax years beginning after December 31, 2024, and allows previously capitalized research and development costs not amortized to be deducted in the current period. During the third quarter we recognized the impact of accelerating the research and development deductions, and the resulting reduction of our Foreign-Derived Intangible Income benefit, which resulted in an increase to income tax expense. The acceleration of our research and development deductions is expected to reduce our projected taxes due for the current year by approximately $105 million.\nOther Items\n. Refer to “Part I, Item 1. Business - Patents and Licenses” and “Part II. Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in our 2024 Annual Report for additional information regarding trends in companion animal healthcare, distributor purchasing and inventories, economic conditions, geopolitical conflict effects and patent expiration.\n34\nCritical Accounting Estimates and Assumptions \nThe discussion and analysis of our financial condition and results of operations is based upon our unaudited condensed consolidated financial statements, which have been prepared in accordance with U.S. GAAP. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, and expenses, and related disclosure of contingent assets and liabilities. We evaluate our estimates on an ongoing basis. We base our estimates on historical experience and on various assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates. The critical accounting policies and the significant judgments and estimates used in the preparation of our unaudited condensed consolidated financial statements for the three and nine months ended September 30, 2025, are consistent with those discussed in our 2024 Annual Report in the section under the heading “Part II. Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations - Critical Accounting Estimates and Assumptions.”\nRecent Accounting Pronouncements\n \nFor more information regarding the impact that recent accounting standards and amendments will have on our consolidated financial statements, refer to Note 2 to the unaudited condensed consolidated financial statements in “Part I. Item 1. Financial Statements” of this Quarterly Report on Form 10-Q.\nNon-GAAP Financial Measures\nOrganic Revenue Growth\n. The following revenue analysis and discussion focuses on organic revenue growth, and references in this analysis and discussion to “revenue,” “revenues,” or “revenue growth” are references to “organic revenue growth.” Organic revenue growth is a non-GAAP financial measure and represents the percentage change in revenue during the three and nine months ended September 30, 2025, compared to the same period for the prior year, net of the effect of changes in foreign currency exchange rates, certain business acquisitions, and divestitures. Organic revenue growth should be considered in addition to, and not as a replacement for, or as a superior measure to, revenue growth reported in accordance with U.S. GAAP, and may not be comparable to similarly titled measures reported by other companies. Management believes that reporting organic revenue growth provides useful information to investors by facilitating easier comparisons of our revenue performance with prior and future periods and to the performance of our peers.\nWe exclude from organic revenue growth the effect of changes in foreign currency exchange rates because changes in foreign currency exchange rates are not under management’s control, are subject to volatility, and can obscure underlying business trends. We calculate the impact on revenue resulting from changes in foreign currency exchange rates by applying the difference between the weighted average exchange rates during the current-year period and the comparable prior-year period to foreign currency denominated revenues for the prior-year period. \nWe also exclude from organic revenue growth the effect of certain business acquisitions and divestitures because the nature, size, and number of these transactions can vary dramatically from period to period, and because they either require or generate cash as an inherent consequence of the transaction, and therefore can also obscure underlying business and operating trends. We consider acquisitions to be a business when all three elements of inputs, processes, and outputs are present, consistent with ASU 2017-01, “\nBusiness Combinations: (Topic 805) Clarifying the Definition of a Business\n.” If substantially all the fair value of the assets acquired is concentrated in a single identifiable asset or group of similar identifiable assets, we do not consider these assets to be a business. A typical acquisition that we do not consider a business is a customer relationships asset acquisition, which does not have all elements necessary to operate a business, such as employees or infrastructure. We believe the efforts required to convert and retain these acquired customers are similar in nature to our existing customer base and therefore are included in organic revenue growth. The percentage change in revenue resulting from business acquisitions represents revenues during the current-year period, limited to the initial twelve months from the date of the acquisition, that are directly attributable to business acquisitions.\n35\nSegment Income from Operations\n. We report segment income from operations in our discussion of the results of the operations of our segments below. Segment income from operations is a non-GAAP financial measure that adjusts for the impact of foreign currency transaction gains and losses and should be considered in addition to, and not as a replacement for, or superior measure to, income from operations. We exclude foreign currency transaction gains and losses for each reportable segment (CAG, Water, and LPD) from segment income from operations and report the full amount of foreign currency transaction gains and losses in Other. We believe that reporting segment income from operations provides supplemental analysis to help investors further evaluate each reportable segment’s business performance by excluding foreign currency transaction gains and losses, which are centrally managed by our corporate treasury function and which we do not consider relevant for assessing the results of each reportable segment’s operations. In addition, we believe that reporting segment income from operations provides information to investors regarding key metrics that are used by management, including our CODM, in evaluating the performance of each reportable segment.\nThe reconciliation of these non-GAAP financial measures is as follows:\n(dollars in thousands)\nFor the Three Months Ended September 30,\n2025\n2024\nIncome from Operations\nImpact from Foreign Currency\nSegment and Other Income from Operations\nIncome from Operations\nImpact from Foreign Currency\nSegment and Other Income from Operations\nCAG\n$\n327,095 \n$\n1,376 \n$\n328,471 \n$\n278,271 \n$\n(1,189)\n$\n277,082 \nWater\n26,311 \n104 \n26,415 \n23,704 \n(96)\n23,608 \nLPD\n364 \n107 \n471 \n985 \n(96)\n889 \nOther\n1,076 \n(1,587)\n(511)\n932 \n1,381 \n2,313 \nTotal\n$\n354,846 \n$\n— \n$\n354,846 \n$\n303,892 \n$\n— \n$\n303,892 \n(dollars in thousands)\nFor the Nine Months Ended September 30,\n2025\n2024\nIncome from Operations\nImpact from Foreign Currency\nSegment and Other Income from Operations\nIncome from Operations\nImpact from Foreign Currency\nSegment and Other Income from Operations\nCAG\n$\n969,649 \n$\n2,454 \n$\n972,103 \n$\n797,844 \n$\n484 \n$\n798,328 \nWater\n71,691 \n183 \n71,874 \n63,515 \n27 \n63,542 \nLPD\n(98)\n189 \n91 \n3,212 \n42 \n3,254 \nOther\n3,184 \n(2,826)\n358 \n2,080 \n(553)\n1,527 \nTotal\n$\n1,044,426 \n$\n— \n$\n1,044,426 \n$\n866,651 \n$\n— \n$\n866,651 \nOther Non-GAAP Financial Measures\n. We also use Adjusted EBITDA, gross debt, net debt, gross debt to Adjusted EBITDA ratio, and net debt to Adjusted EBITDA ratio, all of which are non-GAAP financial measures that should be considered in addition to, and not as a replacement for, or superior measure to, financial measures presented according to U.S. GAAP. Management believes that reporting these non-GAAP financial measures provides supplemental analysis to help investors further evaluate our business performance and available borrowing capacity under our Credit Facility.\n36\nResults of Operations\nThree Months Ended September 30, 2025, Compared to Three Months Ended September 30, 2024 \nTotal Company\n. The following table presents total Company revenue by operating segment:\nFor the Three Months Ended September 30,\nNet Revenue\n(dollars in thousands)\n2025\n2024\nDollar Change\nReported Revenue Growth \n(1)\nPercentage Change from Currency\nPercentage Change from Acquisitions\nOrganic Revenue Growth \n(1)\n \n \n \n \n \n \n \nCAG\n$\n1,012,534\n \n$\n891,990\n \n$\n120,544\n \n13.5\n%\n1.3\n%\n—\n \n12.2\n%\nUnited States\n668,418 \n604,170 \n64,248 \n10.6\n%\n—\n— \n10.6\n%\nInternational\n344,116 \n287,820 \n56,296 \n19.6\n%\n4.1\n%\n—\n15.4\n%\nWater\n$\n54,297\n \n$\n50,162\n \n$\n4,135\n \n8.2\n%\n1.2\n%\n—\n7.0\n%\nUnited States\n28,070 \n26,671 \n1,399 \n5.2\n%\n—\n—\n5.2\n%\nInternational\n26,227 \n23,491 \n2,736 \n11.6\n%\n2.7\n%\n—\n8.9\n%\nLPD\n$\n33,944\n \n$\n28,992\n \n$\n4,952\n \n17.1\n%\n2.9\n%\n—\n14.2\n%\nUnited States\n6,861 \n5,561 \n1,300 \n23.4\n%\n—\n—\n23.4\n%\nInternational\n27,083 \n23,431 \n3,652 \n15.6\n%\n3.5\n%\n—\n12.1\n%\nOther\n$\n4,464\n \n$\n4,399\n \n$\n65\n \n1.5\n%\n—\n—\n1.5\n%\nTotal Company\n$\n1,105,239\n \n$\n975,543\n \n$\n129,696\n \n13.3\n%\n1.3\n%\n—\n \n12.0\n%\nUnited States\n705,040 \n638,058 \n66,982 \n10.5\n%\n—\n— \n10.5\n%\nInternational\n400,199 \n337,485 \n62,714 \n18.6\n%\n3.9\n%\n—\n14.6\n%\n(1)\nReported revenue growth and organic revenue growth may not recalculate due to rounding.\nTotal Company Revenu\ne\n. T\nhe increase in revenue primarily reflected growth in CAG Diagnostics recurring revenue, including higher volumes and the benefit from higher realized prices. Volume growth was supported by new business gains, our expanded menu of available tests, and high customer retention rates, partially constrained by macroeconomic and sector headwinds. Instrument revenue gains were primarily due to placements of our new IDEXX inVue Dx\nTM\n Analyzer. Higher realized prices and volumes in recurring veterinary software subscriptions, services, and diagnostic imaging also contributed to revenue growth. Higher revenue in Water was primarily due to the benefit of higher realized prices and volumes. The increase in LPD revenue was primarily due to higher volumes and realized prices. The change in foreign currency exchange rates increased revenue growth by 1.3%.\n37\nThe following table presents total Company results of operations:\nFor the Three Months Ended September 30,\nChange\nTotal Company - Results of Operations\n(dollars in thousands)\n2025\nPercent of Revenue\n2024\nPercent of Revenue\nAmount\nPercentage\n \n \n \n \n \n \nRevenues\n$\n1,105,239 \n$\n975,543 \n$\n129,696 \n13.3\n%\nCost of revenue\n421,885 \n379,505 \n42,380 \n11.2\n%\nGross profit\n683,354 \n61.8\n%\n596,038 \n61.1\n%\n87,316 \n14.6\n%\nOperating expenses:\nSales and marketing\n159,157 \n14.4\n%\n146,281 \n15.0\n%\n12,876 \n8.8\n%\nGeneral and administrative\n105,936 \n9.6\n%\n91,887 \n9.4\n%\n14,049 \n15.3\n%\nResearch and development\n63,415 \n5.7\n%\n53,978 \n5.5\n%\n9,437 \n17.5\n%\nTotal operating expenses\n328,508 \n29.7\n%\n292,146 \n29.9\n%\n36,362 \n12.4\n%\nIncome from operations\n$\n354,846 \n32.1\n%\n$\n303,892 \n31.2\n%\n$\n50,954 \n16.8\n%\nGross Profit\n.\n Gross profit increased due to higher revenue and a 70 basis point increase in \nthe gross profit margin. The increase in the gross profit margin reflected benefits from recurring revenue growth in IDEXX VetLab\nTM\n consumable and Reference Lab volumes, along with operational productivity and pricing benefits, which offset inflationary cost effects. These increases in the gross profit margin were reduced by the business mix impact from higher instrument revenue. The change in foreign currency exchange rates on the gross profit margin was not significant, including \nthe impact of hedge losses during the current period compared to hedge gains in the prior period.\nOperating\n Expenses\n. \nSales and marketing expense increased primarily due to higher personnel-related costs. General and administrative expense increased primarily due to higher personnel-related and facility costs. Research and development expense increased primarily due to higher personnel-related and project costs. The change in foreign currency exchange rates increased operating expense growth by approximately 2%.\n38\n \nCompanion Animal Group\nThe following table presents revenue by product and service category for CAG: \nFor the Three Months Ended September 30,\nNet Revenue\n(dollars in thousands)\n2025\n2024\nDollar Change\nReported Revenue Growth \n(1)\nPercentage Change from Currency\nPercentage Change from Acquisitions\nOrganic Revenue Growth \n(1)\n \n \n \n \n \n \n \nCAG Diagnostics recurring revenue:\n$\n873,273\n \n$\n783,443\n \n$\n89,830\n \n11.5\n%\n1.3\n%\n—\n10.1\n%\nIDEXX VetLab consumables\n387,813 \n329,128 \n58,685 \n17.8\n%\n1.9\n%\n—\n15.9\n%\nRapid assay products\n88,638 \n92,774 \n(4,136)\n(4.5\n%)\n0.5\n%\n—\n(5.0\n%)\nReference laboratory diagnostic and consulting services\n362,725 \n328,383 \n34,342 \n10.5\n%\n1.1\n%\n—\n9.4\n%\nCAG diagnostics services and accessories\n34,097 \n33,158 \n939 \n2.8\n%\n1.5\n%\n—\n1.3\n%\nCAG Diagnostics capital - instruments\n$\n51,479\n \n$\n29,528\n \n$\n21,951\n \n74.3\n%\n3.6\n%\n—\n70.7\n%\nVeterinary software, services and diagnostic imaging systems\n$\n87,782\n \n$\n79,019\n \n$\n8,763\n \n11.1\n%\n0.1\n%\n—\n \n11.0\n%\nRecurring revenue\n70,988 \n64,644 \n6,344 \n9.8\n%\n0.1\n%\n—\n9.7\n%\nSystems and hardware\n16,794 \n14,375 \n2,419 \n16.8\n%\n(0.1)\n—\n16.9\n%\nNet CAG revenue\n$\n1,012,534\n \n$\n891,990\n \n$\n120,544\n \n13.5\n%\n1.3\n%\n—\n \n12.2\n%\n(1)\n Reported revenue growth and organic revenue growth may not recalculate due to rounding.\nCAG Diagnostics Recurring Revenue\n. The increase \nin CAG Diagnostics recurring revenue was primarily due to higher volumes in IDEXX \nVetLab consumables and reference laboratory testing partially offset by macroeconomic and sector headwinds, as well as benefits from higher realized prices. The change in foreign currency exchange rates increased revenue growth by 1.3%.\nThe increase in IDEXX VetLab consumables revenue was primarily due to higher test volumes and higher realized prices. Volume gains were supported by increases in testing across major regions, including the benefits from 10% growth in our active installed base of premium instruments, which reflected new customers and continued high customer retention rates, and our expanded menu of available tests. The change in foreign currency exchange rates increased revenue growth by 1.9%. \nThe decrease \nin \nrapid assay revenue resulted primarily from a shift of customers’ pancreatic lipase testing to our Catalyst instrument platform, partially offset by higher realized prices. The change in foreign currency exchange rates increased revenue growth by 0.5%. \nThe increase in reference laboratory diagnostic and consulting services revenue was due to higher testing volumes across regions and higher realized prices. The change in foreign currency exchange rates increased revenue growth by 1.1%.\nThe increase in CAG Diagnostics services and accessories revenue was primarily a result of the 10% growth in our installed base of premium instruments. The change in foreign currency exchange rates increased revenue growth by 1.5%.\n39\nCAG Diagnostics Capital – Instrument Revenue\n. The increase in instrument revenue was primarily due to placements of our new IDEXX inVue Dx Analyzer. The change in foreign currency exchange rates increased revenue growth by 3.6%.\nVeterinary Software, Services and Diagnostic Imaging Systems Revenue\n. The increase in recurring revenue was primarily due to higher realized prices and higher subscription and support services volume from our expanded SaaS installed base. The increase in our systems and hardware revenue was primarily due to higher diagnostic imaging system sales. \nThe following table presents the CAG segment results of operations:\nFor the Three Months Ended September 30,\nChange\nResults of Operations\n(dollars in thousands)\n2025\nPercent of Revenue\n2024\nPercent of Revenue\nAmount\nPercentage\nRevenues\n$\n1,012,534 \n$\n891,990 \n$\n120,544 \n13.5\n%\nCost of revenue\n385,078 \n347,529 \n37,549 \n10.8\n%\nGross profit\n627,456 \n62.0\n%\n544,461 \n61.0\n%\n82,995 \n15.2\n%\nSegment operating expenses:\nSales and marketing\n144,608 \n14.3\n%\n132,848 \n14.9\n%\n11,760 \n8.9\n%\nGeneral and administrative\n95,498 \n9.4\n%\n84,611 \n9.5\n%\n10,887 \n12.9\n%\nResearch and development\n58,879 \n5.8\n%\n49,920 \n5.6\n%\n8,959 \n17.9\n%\nTotal segment operating expenses\n298,985 \n29.5\n%\n267,379 \n30.0\n%\n31,606 \n11.8\n%\nSegment income from operations\n$\n328,471 \n32.4\n%\n$\n277,082 \n31.1\n%\n$\n51,389 \n18.5\n%\nGross Profit\n. Gross profit increased due to higher revenue and a 100 basis point increase in the gross profit margin. The increase in the gross profit margin reflected benefits from recurring revenue growth in IDEXX VetLab consumable and Reference Lab volumes, along with operational productivity and pricing benefits, which offset inflationary cost effects. These increases in the gross profit margin were reduced by the business mix impact from high instrument revenue. The change in foreign currency exchange rates on the gross profit margin was not significant, including \nthe impact of hedge losses during the current period compared to hedge gains in the prior period.\nSegment Operating Expenses\n. Sales and marketing expense increased primarily due to higher personnel-related costs. General and administrative expense increased primarily due to higher personnel-related and facility costs. Research and development expense increased primarily due to higher personnel-related and project costs. The change in foreign currency exchange rates increased operating expense growth by less than 1%. \n40\nWater\nThe following table presents the Water segment results of operations:\nFor the Three Months Ended September 30,\nChange\nResults of Operations\n(dollars in thousands)\n2025\nPercent of Revenue\n2024\nPercent of Revenue\nAmount\nPercentage\nRevenues\n$\n54,297 \n$\n50,162 \n$\n4,135 \n8.2\n%\nCost of revenue\n16,240 \n15,407 \n833 \n5.4\n%\nGross profit\n38,057 \n70.1\n%\n34,755 \n69.3\n%\n3,302 \n9.5\n%\nSegment operating expenses:\nSales and marketing\n6,431 \n11.8\n%\n5,936 \n11.8\n%\n495 \n8.3\n%\nGeneral and administrative\n3,841 \n7.1\n%\n3,903 \n7.8\n%\n(62)\n(1.6\n%)\nResearch and development\n1,370 \n2.5\n%\n1,308 \n2.6\n%\n62 \n4.7\n%\nTotal segment operating expenses\n11,642 \n21.4\n%\n11,147 \n22.2\n%\n495 \n4.4\n%\nSegment income from operations\n$\n26,415 \n48.6\n%\n$\n23,608 \n47.1\n%\n$\n2,807 \n11.9\n%\nRevenue\n.\n The increase in revenue\n was primarily due to higher realized prices and higher volumes. The increase in volumes was primarily due to placements of instruments and accessories, including the placements of our new UV Viewer Plus. \nThe change in \nforeign \ncurrency exchange rates increased revenue by approximately 1.2%.\nGross Profit\n.\n \nGross profit increased due to higher revenue, as well as an 80 basis point increase in the gross profit margin. The net increase in the gross profit margin was primarily due to higher realized prices, reduced by the impact of higher product costs and product mix. The change in foreign currency exchange rates decreased the gross profit margin by approximately 10\n basis points, including \nthe impact of higher hedge losses during the current period compared to the prior period.\nSegment Operating\n Expenses\n. Sales and marketing expense and r\nesearch and development expense \nincreased p\nrimarily due to higher personnel-related costs. General and administrative expense decreased primarily due to lower personnel-related costs. The change in foreign currency exchange rates increased operating expense growth by approximately 1%.\n41\nLivestock, Poultry and Dairy\n \nThe following table presents the LPD segment results of operations:\nFor the Three Months Ended September 30,\nChange\nResults of Operations\n(dollars in thousands)\n2025\nPercent of Revenue\n2024\nPercent of Revenue\nAmount\nPercentage\n \n \n \n \n \n \nRevenues\n$\n33,944 \n$\n28,992 \n$\n4,952 \n17.1\n%\nCost of revenue\n17,999 \n14,365 \n3,634 \n25.3\n%\nGross profit\n15,945 \n47.0\n%\n14,627 \n50.5\n%\n1,318 \n9.0\n%\nSegment operating expenses:\nSales and marketing\n7,898 \n23.3\n%\n7,210 \n24.9\n%\n688 \n9.5\n%\nGeneral and administrative\n4,481 \n13.2\n%\n3,933 \n13.6\n%\n548 \n13.9\n%\nResearch and development\n3,095 \n9.1\n%\n2,595 \n9.0\n%\n500 \n19.3\n%\nTotal segment operating expenses\n15,474 \n45.6\n%\n13,738 \n47.4\n%\n1,736 \n12.6\n%\nSegment income from operations\n$\n471 \n1.4\n%\n$\n889 \n3.1\n%\n$\n(418)\n(47.0\n%)\nRevenue\n. The increase in r\nevenue was primarily due to an increase in test volumes, primarily in North America, Europe, and Asia, and to a lesser extent, higher realized prices. The change in foreign currency exchange rates increased revenue growth by 2.9%.\nGross Profit\n. The\n increase in gross profit was primarily due to higher revenue, partially offset by a\n 350 basis point decrease in the gross profit margin. The net decrease in the gross profit margin was primarily due to higher product costs, partially offset by the impact from higher realized prices. \nThe change in foreign currency exchange rates decreased the gross profit margin by approximately 80 \nbasis points\n, \nincluding the impact of \nhedge losses\n during the current period compared to hedge gains in the prior period.\nSegment Operating Expenses\n. \nSales and marketing expense and r\nesearch and development expense\n \nincreased primarily due to higher personnel-related costs. G\neneral and administrative expense increased primarily due to higher bad debt expense and personnel-related costs. \nThe change in foreign currency exchange rates increased operating expense growth by approximately 2%.\n42\nOther\nOther information combines and presents our OPTI Medical with our out-licensing arrangements and consolidated foreign currency transaction gains and losses for all operating segments. The following table presents the Other results of operations:\nFor the Three Months Ended September 30,\nChange\nResults of Operations\n(dollars in thousands)\n2025\nPercent of Revenue\n2024\nPercent of Revenue\nAmount\nPercentage\n \n \n \n \n \n \nRevenues\n$\n4,464 \n$\n4,399 \n$\n65 \n1.5\n%\nCost of revenue\n2,568 \n2,204 \n364 \n16.5\n%\nGross profit\n1,896 \n42.5\n%\n2,195 \n49.9\n%\n(299)\n(13.6\n%)\nOther operating expenses:\nSales and marketing\n220 \n4.9\n%\n287 \n6.5\n%\n(67)\n(23.3\n%)\nGeneral and administrative\n2,116 \n47.4\n%\n(560)\n(12.7\n%)\n2,676 \n(477.9\n%)\nResearch and development\n71 \n1.6\n%\n155 \n3.5\n%\n(84)\n(54.2\n%)\nTotal Other operating expenses\n2,407 \n53.9\n%\n(118)\n(2.7\n%)\n2,525 \n(2,139.8\n%)\nOther income from operations\n$\n(511)\n(11.4\n%)\n$\n2,313 \n52.6\n%\n$\n(2,824)\n(122.1\n%)\nRevenue\n.\n Revenue increased from higher realized prices on OPTI medical instruments, largely offset by lower OPTI medical instrument volumes.\n \nGross Profit\n. Gross profit decreased primarily due to a 740 basis point decrease in the gross profit margin. The decrease in the gross profit margin was primarily due to higher product costs, partially offset by higher realized prices. The change in foreign currency exchange rates did not have a significant impact on the gross profit margin.\nOperating Expenses\n. Sales and marketing expense and research and development expense decreased due to lower personnel-related costs. General and administrative expense increased primarily due to foreign currency transaction losses during the current period, compared to gains in the prior period.\nNon-Operating Items\nInterest Expense and Income\n. Interest expense was $10.7 million for the three months ended September 30, 2025, as compared to $7.7 million for the same period during the prior year. The increase in interest expense was primarily due to higher average debt levels and higher interest rates. Interest income was $0.6 million for the three months ended September 30, 2025, compared to $2.7 million for the same period during the prior year, primarily due to a decrease in money market investments.\nProvision for Income Taxes\n. Our effective income tax rate was 20.4% for the three months ended September 30, 2025, compared to 22.1% for the three months ended September 30, 2024. The decrease in our effective tax rate was primarily due to an increase in tax benefits related to share-based compensation, partially offset by the impacts related to recent U.S. tax law changes.\n43\n Results of Operations\nNine Months Ended September 30, 2025, Compared to Nine Months Ended September 30, 2024 \nTotal Company\n. The following table presents total Company revenue by operating segment:\nFor the Nine Months Ended September 30,\nNet Revenue\n(dollars in thousands)\n2025\n2024\nDollar Change\nReported Revenue Growth \n(1)\nPercentage Change from Currency\nPercentage Change from Acquisitions\nOrganic Revenue Growth\n (1)\nCAG\n$\n2,954,813\n \n$\n2,703,573\n \n$\n251,240\n \n9.3\n%\n0.4\n%\n— \n8.8\n%\nUnited States\n1,976,804 \n1,835,049 \n141,755 \n7.7\n%\n—\n0.1\n%\n7.7\n%\nInternational\n978,009 \n868,524 \n109,485 \n12.6\n%\n1.4\n%\n—\n11.3\n%\nWater\n$\n150,619\n \n$\n139,959\n \n$\n10,660\n \n7.6\n%\n0.1\n%\n—\n7.6\n%\nUnited States\n77,663 \n73,331 \n4,332 \n5.9\n%\n—\n—\n5.9\n%\nInternational\n72,956 \n66,628 \n6,328 \n9.5\n%\n0.1\n%\n—\n9.4\n%\nLPD\n$\n94,302\n \n$\n87,503\n \n$\n6,799\n \n7.8\n%\n0.8\n%\n—\n7.0\n%\nUnited States\n18,416 \n15,840 \n2,576 \n16.3\n%\n—\n—\n16.3\n%\nInternational\n75,886 \n71,663 \n4,223 \n5.9\n%\n0.9\n%\n—\n5.0\n%\nOther\n$\n13,389\n \n$\n12,181\n \n$\n1,208\n \n9.9\n%\n—\n—\n9.9\n%\nTotal Company\n$\n3,213,123\n \n$\n2,943,216\n \n$\n269,907\n \n9.2\n%\n0.4\n%\n—\n \n8.7\n%\nUnited States\n2,077,770 \n1,929,213 \n148,557 \n7.7\n%\n— \n0.1\n%\n7.6\n%\nInternational\n1,135,353 \n1,014,003 \n121,350 \n12.0\n%\n1.2\n%\n—\n10.7\n%\n(1)\nReported revenue growth and organic revenue growth may not recalculate due to rounding.\nTotal Company Revenu\ne\n. T\nhe increase in revenue primarily reflected growth in CAG Diagnostics recurring revenue, including benefits from higher volumes and higher realized prices. Volume growth was supported by new business gains, our expanded menu of available tests, and high customer retention rates, partially offset by continued pressure of macroeconomic and sector headwinds. Instrument revenue gains were primarily due to the placements of our new IDEXX inVue Dx Analyzer. Higher price and volume gains in recurring veterinary software, services, and diagnostic imaging also contributed to revenue growth. Higher revenue in our Water business was primarily due to the benefits from higher realized prices and higher volumes. The increase in LPD revenue was primarily due to higher volumes and higher realized prices.\n44\nThe following table presents total Company results of operations:\nFor the Nine Months Ended September 30,\nChange\nTotal Company - Results of Operations\n(dollars in thousands)\n2025\nPercent of Revenue\n2024\nPercent of Revenue\nAmount\nPercentage\nRevenues\n$\n3,213,123 \n$\n2,943,216 \n$\n269,907 \n9.2\n%\nCost of revenue\n1,211,658 \n1,134,949 \n76,709 \n6.8\n%\nGross profit\n2,001,465 \n62.3\n%\n1,808,267 \n61.4\n%\n193,198 \n10.7\n%\nOperating expenses:\nSales and marketing\n476,487 \n14.8\n%\n438,399 \n14.9\n%\n38,088 \n8.7\n%\nGeneral and administrative\n296,178 \n9.2\n%\n341,154 \n11.6\n%\n(44,976)\n(13.2\n%)\nResearch and development\n184,374 \n5.7\n%\n162,063 \n5.5\n%\n22,311 \n13.8\n%\nTotal operating expenses\n957,039 \n29.8\n%\n941,616 \n32.0\n%\n15,423 \n1.6\n%\nIncome from operations\n$\n1,044,426 \n32.5\n%\n$\n866,651 \n29.4\n%\n$\n177,775 \n20.5\n%\nGross Profit\n. Gross profit increased due to higher revenue and a 90 basis point increase in the gross profit margin. The increases in the gross profit margin reflected benefits from recurring revenue growth in IDEXX VetLab consumable and Reference Lab volumes, along with operational productivity and pricing benefits, which offset inflationary cost effects. These increases in the gross profit margin were reduced by the business mix impact from higher instrument revenue. \nThe \nchange in foreign currency exchange rates\n decreased the gross profit margin by approximately 10 \nbasis points, including \nthe impact of lower hedge gains during the current period compared to the prior period.\nOperating Expenses\n. Sales and marketing expense increased primarily due to higher personnel-related and commercial expenses. General and administrative expense decreased primarily due to a $61.5 million expense in the prior year and a reduction in accrued expense of approximately $9 million in the first quarter of the current period related to a now-concluded litigation matter, partially offset by higher personnel-related, information technology, and facility costs. Research and development expense increased primarily due to higher personnel-related and project costs. The change in foreign currency exchange rates increased operating expense growth by less than 1%.\n45\nCompanion Animal Group\nThe following table presents revenue by product and service category for CAG: \nFor the Nine Months Ended September 30,\nNet Revenue\n(dollars in thousands)\n2025\n2024\nDollar Change\nReported Revenue Growth \n(1)\nPercentage Change from Currency\nPercentage Change from Acquisitions\nOrganic Revenue Growth \n(1)\nCAG Diagnostics recurring revenue:\n$\n2,557,535\n \n$\n2,372,041\n \n$\n185,494\n \n7.8\n%\n0.4\n%\n—\n7.4\n%\nIDEXX VetLab consumables\n1,107,704 \n971,405 \n136,299 \n14.0\n%\n0.6\n%\n—\n13.4\n%\nRapid assay products\n272,912 \n282,379 \n(9,467)\n(3.4\n%)\n0.1\n%\n—\n(3.5\n%)\nReference laboratory diagnostic and consulting services\n1,074,825 \n1,020,094 \n54,731 \n5.4\n%\n0.4\n%\n—\n5.0\n%\nCAG diagnostics services and accessories\n102,094 \n98,163 \n3,931 \n4.0\n%\n0.6\n%\n—\n3.4\n%\nCAG Diagnostics capital - instruments\n$\n142,073\n \n$\n98,912\n \n$\n43,161\n \n43.6\n%\n1.2\n%\n—\n42.4\n%\nVeterinary software, services and diagnostic imaging systems:\n$\n255,205\n \n$\n232,620\n \n$\n22,585\n \n9.7\n%\n(0.1\n%)\n0.6\n%\n9.2\n%\nRecurring revenue\n205,735 \n187,461 \n18,274 \n9.7\n%\n(0.1\n%)\n0.6\n%\n9.3\n%\nSystems and hardware\n49,470 \n45,159 \n4,311 \n9.5\n%\n(0.2\n%)\n0.6\n%\n9.2\n%\nNet CAG revenue\n$\n2,954,813\n \n$\n2,703,573\n \n$\n251,240\n \n9.3\n%\n0.4\n%\n—\n8.8\n%\n(1)\n Reported revenue growth and organic revenue growth may not recalculate due to rounding.\nCAG Diagnostics Recurring Revenue\n. The increase in CAG Diagnostics recurring revenue was primarily due to higher volumes in IDEXX \nVetLab consumables and reference laboratory testing partially offset by macroeconomic and sector headwinds, as well as benefits from higher realized prices. The change in foreign currency exchange rates increased revenue growth by 0.4%.\nThe increase in IDEXX VetLab consumables revenue was primarily due to higher volumes and higher realized prices. Volume gains were supported by increases in testing including the benefits from 10% growth in our active installed base of premium instruments, which reflected new customers and continued high customer retention rates, as well as our expanded menu of available tests. The change in foreign currency exchange rates increased revenue growth by 0.6%.\nThe decrease in \nrapid assay revenue resulted primarily from a shift of customers’ pancreatic lipase testing to our Catalyst instrument platform, partially offset by higher realized prices. \nThe increase in reference laboratory diagnostic and consulting services revenue was due to higher testing volumes in the U.S., Europe, and Asia Pacific, and higher realized prices. \nThe \nchange in foreign currency exchange rates in\ncreased revenue growth by 0.4%.\nThe increase in CAG Diagnostics services and accessories revenue was primarily a result of growth in our installed base of premium instruments. \nThe \nchange in foreign currency exchange rates in\ncreased revenue growth by \n0.6%\n.\n46\nCAG Diagnostics Capital – Instrument Revenue\n. The increase in instrument revenue was primarily due to placements of our new IDEXX inVue Dx Analyzer, partially offset by lower placements of other premium instruments. The change in foreign currency exchange rates increased revenue \ngrowth by 1.2%.\nVeterinary Software, Services and Diagnostic Imaging Systems Revenue\n. The increase in recurring revenue was primarily due to higher subscription and support services volume from our expanded SaaS installed base and from higher realized prices. The increase in our systems and hardware revenue was primarily due to higher diagnostic imaging system sales\n. Acquisitions increased revenue growth by \n0.6%.\nThe following table presents the CAG segment results of operations:\nFor the Nine Months Ended September 30,\nChange\nResults of Operations\n(dollars in thousands)\n2025\nPercent of Revenue\n2024\nPercent of Revenue\nAmount\nPercentage\nRevenues\n$\n2,954,813 \n$\n2,703,573 \n$\n251,240 \n9.3\n%\nCost of revenue\n1,110,432 \n1,043,805 \n66,627 \n6.4\n%\nGross profit\n1,844,381 \n62.4\n%\n1,659,768 \n61.4\n%\n184,613 \n11.1\n%\nSegment operating expenses:\nSales and marketing\n434,416 \n14.7\n%\n399,186 \n14.8\n%\n35,230 \n8.8\n%\nGeneral and administrative\n267,110 \n9.0\n%\n313,442 \n11.6\n%\n(46,332)\n(14.8\n%)\nResearch and development\n170,752 \n5.8\n%\n148,812 \n5.5\n%\n21,940 \n14.7\n%\nTotal segment operating expenses\n872,278 \n29.5\n%\n861,440 \n31.9\n%\n10,838 \n1.3\n%\nSegment income from operations\n$\n972,103 \n32.9\n%\n$\n798,328 \n29.5\n%\n$\n173,775 \n21.8\n%\nGross Profit\n. Gross profit increased due to higher revenue and a 100 basis point increase in the gross profit margin. The increases in the gross profit margin reflected benefits from recurring revenue growth in IDEXX VetLab consumable and Reference Lab volumes, along with operational productivity and pricing benefits, which offset inflationary cost effects. These increases in the gross profit margin were reduced by the business mix impact from higher instrument revenue. The change in foreign currency exchange rates on the gross profit margin was not significant, including \nthe impact of lower hedge gains during the current period compared to the prior period.\nSegment Operating Expenses\n. Sales and marketing expense increased primarily due to higher personnel-related and commercial costs. General and administrative expense decreased primarily due to a $61.5 million expense in the prior year and a reduction in accrued expense of approximately $9 million in the first quarter of the current period related to a now-concluded litigation matter, partially offset by higher personnel-related and information technology costs. Research and development expense increased primarily due to higher personnel-related costs, as well as higher project costs. The change in foreign currency exchange rates was not significant to operating expense growth. \n47\nWater\nThe following table presents the Water segment results of operations:\nFor the Nine Months Ended September 30,\nChange\nResults of Operations\n(dollars in thousands)\n2025\nPercent of Revenue\n2024\nPercent of Revenue\nAmount\nPercentage\nRevenues\n$\n150,619 \n$\n139,959 \n$\n10,660 \n7.6\n%\nCost of revenue\n44,978 \n42,633 \n2,345 \n5.5\n%\nGross profit\n105,641 \n70.1\n%\n97,326 \n69.5\n%\n8,315 \n8.5\n%\nSegment operating expenses:\nSales and marketing\n18,538 \n12.3\n%\n17,423 \n12.4\n%\n1,115 \n6.4\n%\nGeneral and administrative\n10,964 \n7.3\n%\n12,534 \n9.0\n%\n(1,570)\n(12.5\n%)\nResearch and development\n4,265 \n2.8\n%\n3,827 \n2.7\n%\n438 \n11.4\n%\nTotal segment operating expenses\n33,767 \n22.4\n%\n33,784 \n24.1\n%\n(17)\n(0.1\n%)\nSegment income from operations\n$\n71,874 \n47.7\n%\n$\n63,542 \n45.4\n%\n$\n8,332 \n13.1\n%\nRevenue\n. The increase in revenue\n was due to higher realized prices and higher volumes. The increase in volumes was due to higher testing volumes, primarily in Latin America and Europe, as well as placements of instruments and accessories. \nThe\n change in foreign currency exchange rates\n decreased revenue growth by 0.1%.\nGross Profit\n. Gross profit increased\n due to higher revenue \nas well as a \n60\n basis point increase in the gross profit margin.\n The net increase in the gross profit margin was due to\n higher realized prices, reduced by the impact of higher product and distribution costs. The \nchange in foreign currency exchange rates\n decreased the gross profit margin by approximately 10 \nbasis points, including \nthe impact of lower hedge gains during the current period compared to the prior period\n.\nSegment Operating \nExpenses\n. Sales and marketing expense increased p\nrimarily due to higher personnel-related and travel and meeting costs. General and administrative expense decreased primarily due to lower bad debt expense and lower personnel-related costs. Research and development expense increased primarily due to higher personnel-related costs. The change in foreign currency exchange rates was not significant to operating expense growth.\n48\nLivestock, Poultry and Dairy\n \nThe following table presents the LPD segment results of operations:\nFor the Nine Months Ended September 30,\nChange\nResults of Operations\n(dollars in thousands)\n2025\nPercent of Revenue\n2024\nPercent of Revenue\nAmount\nPercentage\nRevenues\n$\n94,302 \n$\n87,503 \n$\n6,799 \n7.8\n%\nCost of revenue\n49,063 \n42,084 \n6,979 \n16.6\n%\nGross profit\n45,239 \n48.0\n%\n45,419 \n51.9\n%\n(180)\n(0.4\n%)\nSegment operating expenses:\nSales and marketing\n22,756 \n24.1\n%\n20,937 \n23.9\n%\n1,819 \n8.7\n%\nGeneral and administrative\n13,410 \n14.2\n%\n12,420 \n14.2\n%\n990 \n8.0\n%\nResearch and development\n8,982 \n9.5\n%\n8,808 \n10.1\n%\n174 \n2.0\n%\nTotal segment operating expenses\n45,148 \n47.9\n%\n42,165 \n48.2\n%\n2,983 \n7.1\n%\nSegment income from operations\n$\n91 \n0.1\n%\n$\n3,254 \n3.7\n%\n$\n(3,163)\n(97.2\n%)\nReve\nnue\n. The increase in revenue was primarily due to higher test volumes in the Americas and Asia Pacific, and higher realized prices. The \nchange in foreign currency exchange rates\n decreased revenue growth by 0.8%. \nGross Profit\n. \nThe decrease in gross profit was primarily due to a 390 basis point decrease in the gross profit margin, partially offset by higher revenue. T\nhe\n net decrease in the gross profit margin was primarily due to higher product costs, reduced by the impact from higher realized prices. The \nchange in foreign currency exchange rates\n \ndecreased the gross profit margin by approximately 60 basis points, including the impact of lower hedge gains during the current period compared to the prior period. \nSegment Operating Expens\nes\n. Sales and marketing expense \nincreased primarily due to higher personnel-related and travel costs. General and administrative expense increased primarily due to higher personnel-related costs and bad debt expense.\n R\nesearch and development expense increased primarily due to higher personnel-related costs. The change in foreign currency exchange rates increased operating expense growth by approximately 1%.\n49\nOther\nOther information combines and presents our OPTI Medical with our out-licensing arrangements and consolidated foreign currency transaction gains and losses for all operating segments. The following table presents the Other results of operations:\nFor the Nine Months Ended September 30,\nChange\nResults of Operations\n(dollars in thousands)\n2025\nPercent of Revenue\n2024\nPercent of Revenue\nAmount\nPercentage\nRevenues\n$\n13,389 \n$\n12,181 \n$\n1,208 \n9.9\n%\nCost of revenue\n7,185 \n6,427 \n758 \n11.8\n%\nGross profit\n6,204 \n46.3\n%\n5,754 \n47.2\n%\n450 \n7.8\n%\nOther operating expenses:\nSales and marketing\n777 \n5.8\n%\n853 \n7.0\n%\n(76)\n(8.9\n%)\nGeneral and administrative\n4,694 \n35.1\n%\n2,758 \n22.6\n%\n1,936 \n70.2\n%\nResearch and development\n375 \n2.8\n%\n616 \n5.1\n%\n(241)\n(39.1\n%)\nTotal Other operating expenses\n5,846 \n43.7\n%\n4,227 \n34.7\n%\n1,619 \n38.3\n%\nOther income from operations\n$\n358 \n2.7\n%\n$\n1,527 \n12.5\n%\n$\n(1,169)\n(76.6\n%)\nRevenue\n.\n \nThe increase in revenue was primarily due to higher sales volumes of our OPTI Medical consumables and instruments.\nGross Profit\n. Gross profit increased due to higher revenues, partially offset by a 90 basis point decrease in the gross profit margin. The decrease in the gross profit margin was largely due to higher product costs, partially offset by higher realized prices. The change in foreign currency exchange rates did not have a significant impact on the gross profit margin.\nOperating Expenses\n. Sales and marketing expense decreased due to lower personnel-related costs. General and administrative expense increased primarily due to higher foreign currency transaction losses compared to the prior period. Research and development expense decreased due to lower activities that were not attributable to our three reportable segments.\nNon-Operating Items\nInterest Expense and Income\n. Interest expense was $29.6 million for the nine months ended September 30, 2025, compared to $23.7 million for the same period during the prior year. The increase in interest expense was primarily due to higher average debt levels and higher interest rates. Interest income was $2.4 million for the nine months ended September 30, 2025, compared to $10.5 million for the same period during the prior year, primarily due to a decrease in money market investments.\nProvision for Income Taxes\n. Our effective income tax rate was 20.2% for the nine months ended September 30, 2025, compared to 21.3% for the nine months ended September 30, 2024. The decrease in our effective tax rate was primarily driven by an increase in tax benefits related to share-based compensation and the resolution of international tax audits, partially offset by the impacts related to recent U.S. tax law changes.\n50\nLiquidity and Capital Resources\nWe fund the capital needs of our business through cash on hand, funds generated from operations, proceeds from long-term senior note financings, and amounts available under our Credit Facility. We generate cash primarily through the payments made by customers for our companion animal veterinary, livestock, poultry, dairy, and water products and services, consulting services, and other various systems and services. Our cash disbursements are primarily related to compensation and benefits for our employees, inventory and supplies, repurchases of our common stock, taxes, research and development, capital expenditures, rents, occupancy-related charges, interest expense, and business acquisitions. Working capital totaled $225.2 million as of September 30, 2025, compared to $332.0 million as of December 31, 2024. The change in working capital is primarily due to lower cash balances and higher borrowings outstanding on our Credit Facility in the current year. As of September 30, 2025, we had $208.2 million of cash and cash equivalents, compared to $288.3 million as of December 31, 2024. As of September 30, 2025, we had a remaining borrowing availability of $793.2 million under our $1.25 billion Credit Facility, with $455.0 million in outstanding borrowings under our Credit Facility. As of December 31, 2024, we had $250.0 million in outstanding borrowings under our Credit Facility. The general availability of funds under our Credit Facility is reduced by $1.8 million for outstanding letters of credit. We believe that, if necessary, we could obtain additional borrowings to fund our growth objectives. We further believe that current cash and cash equivalents, funds generated from operations, and committed borrowing availability will be sufficient to fund our operations, capital purchase requirements, and anticipated growth needs for the next twelve months. We believe that these resources, coupled with our ability, as needed, to obtain additional financing, will also be sufficient to fund our business as currently conducted for the foreseeable future. We may enter into new financing arrangements or refinance or retire existing debt in the future depending on market conditions. Should we require more capital in the U.S. than is generated by our operations, for example, to fund significant discretionary activities, we could elect to raise capital in the U.S. through the incurrence of debt or equity issuances, which we may not be able to complete on favorable terms or at all. In addition, these alternatives could result in increased interest expense or other dilution of our earnings. \nWe manage our worldwide cash requirements considering available funds among all of our subsidiaries. Our foreign cash and cash equivalents are generally available without restrictions to fund ordinary business operations outside the U.S. \nThe following table presents cash and cash equivalents held domestically and by our foreign subsidiaries:\nCash and cash equivalents\n(dollars in thousands)\nSeptember 30, 2025\nDecember 31, 2024\n \n \nU.S.\n$\n13,838 \n$\n145,118 \nForeign\n194,328 \n143,148 \nTotal\n$\n208,166 \n$\n288,266 \n \n \nTotal cash and cash equivalents held in U.S. dollars by our foreign subsidiaries\n$\n39,009 \n$\n10,623 \nAs of September 30, 2025, of the $208.2 million of cash and cash equivalents held, $202.7 million was held as bank deposits and $5.5 million was held in a U.S. government money market fund. As of December 31, 2024, of the $288.3 million of cash and cash equivalents held, $148.7 million was held as bank deposits and $139.6 million was held in a U.S. government money market fund. Our bank deposits are held at a diversified group of institutions, primarily systemically important banks. Cash and cash equivalents as of September 30, 2025, included approximately $1.0 million in cash denominated in a non-U.S. currency held in a country with currency control restrictions, which limits our ability to transfer funds outside of the country in which they are held without incurring costs. \n51\nThe following table presents additional key information concerning working capital:\nFor the Three Months Ended\nSeptember 30,\n2025\nJune 30,\n2025\nMarch 31,\n2025\nDecember 31,\n2024\nSeptember 30, 2024\nDays sales outstanding \n(1)\n46.5 \n44.7 \n45.7 \n47.1 \n48.9 \nInventory turns \n(2)\n1.5 \n1.5 \n1.3 \n1.3 \n1.3 \n(1)\n     \nDays sales outstanding represents the average of the accounts receivable balances at the beginning and end of each quarter divided by revenue for that quarter, the result of which is then multiplied by 91.25 days.\n(2)\n     \nInventory turns are calculated as the ratio of our inventory-related cost of revenue for the quarter multiplied by four, divided by the average inventory balances at the beginning and end of each quarter.\nSources and Uses of Cash \nThe following table presents cash provided (used):\nFor the Nine Months Ended September 30,\n(dollars in thousands)\n2025\n2024\nChange\n \n \n \nNet cash provided by operating activities\n$\n826,045 \n$\n666,976 \n$\n159,069 \nNet cash used by investing activities\n(108,109)\n(167,219)\n59,110 \nNet cash used by financing activities\n(809,262)\n(645,291)\n(163,971)\nNet effect of changes in exchange rates on cash\n11,226 \n238 \n10,988 \nNet change in cash and cash equivalents\n$\n(80,100)\n$\n(145,296)\n$\n65,196 \nOperating Activities\n. Cash provided by operating activities during the nine months ended September 30, 2025, was $826.0 million, which was a net increase in operating cash flows of $159.1 million, compared to the same period during the prior year. Cash was provided from net income of $811.3 million, adjusted for net non-cash items of $259.3 million, partially offset by a net decrease from changes in operating assets and liabilities of $244.5 million. The following table presents cash flow impacts from changes in operating assets and liabilities, excluding the effects of foreign exchange rate fluctuations: \nFor the Nine Months Ended September 30,\n(dollars in thousands)\n2025\n2024\nChange\n \n \n \nAccounts receivable\n$\n(82,586)\n$\n(56,087)\n$\n(26,499)\nInventories\n(2,202)\n(24,756)\n22,554 \nOther assets and liabilities\n(160,944)\n(45,272)\n(115,672)\nAccounts payable\n(4,977)\n2,347 \n(7,324)\nDeferred revenue\n6,216 \n(735)\n6,951 \nTotal change in cash due to changes in operating assets and liabilities\n$\n(244,493)\n$\n(124,503)\n$\n(119,990)\nCash used by changes in operating assets and liabilities during the nine months ended September 30, 2025, increased $120.0 million, compared to the same period during the prior year. During the current period, we paid approximately $80 million, which was accrued in prior years, to conclude a litigation matter and the payment is included within the cash flow impacts from changes in other assets and liabilities. The increase in contract assets arising from customer commitment arrangements, partially offset by lower tax payments and lower annual employee incentive program payments in the current period, also contributed to the increase in cash used for other assets and liabilities, compared to the same period in the prior year.\nWe have historically experienced proportionately lower net cash flows from operating activities during the first quarter and proportionately higher cash flows from operating activities for the remainder of the year driven primarily by payments related to annual employee incentive programs in the first quarter following the year for which the bonuses were earned. \nInvesting Activities\n. Cash used by investing activities was $108.1 million during the nine months ended September 30, 2025, compared to $167.2 million for the same period during the prior year. The decrease in cash used by investing activities was primarily due to the acquisition of a software business during the prior-year period, compared to smaller asset acquisitions in the current-year period.\n52\nOur total capital expenditure plan for 2025 is estimated to be approximately $140.0 million, which includes capital investments in manufacturing and operations facilities and technology infrastructure to support growth and efficiencies, as well as investments in customer-facing software development.\nFinancing Activities\n.\n \nCash used by financing activities was $809.3 million during the nine months ended September 30, 2025, compared to $645.3 million used for the same period during the prior year. The increase in cash used was primarily due to $979.2 million of repurchases of our common stock during the current year, compared to $591.0 million of repurchases during the prior year, as well as a payment upon the maturity of our 2025 Series C Notes equivalent to $103.4 million. This increase in cash used by financing activities was partially offset by $205.0 million in net borrowings under our Credit Facility during the current year, compared to no activity under our Credit Facility during the prior-year period. We also remitted approximately $8.4 million of excise tax related to the repurchase of our common stock on April 15, 2025, which is included in the repurchases of common stock on our cash flow statement.\nWe believe that the repurchase of our common stock is a favorable means of returning value to our stockholders, and we also repurchase our stock to offset the dilutive effect of our share-based compensation programs. Repurchases of our common stock may vary depending upon the level of other investing and deployment activities, as well as share price and prevailing interest rates, and are subject to market conditions. Refer to Note 12 to the unaudited condensed consolidated financial statements in “Part I. Item 1. Financial Statements” of this Quarterly Report on Form 10-Q for additional information about our share repurchases.\nAs of September 30, 2025, we had $455.0 million in outstanding borrowings under our Credit Facility, of which $250.0 million is outstanding borrowings under our term loan that matures on October 20, 2025. On October 20, 2025, we paid our $250.0 million term loan with a combination of borrowings under our revolving line of credit and available cash on hand. The obligations under our Credit Facility may be accelerated upon the occurrence of an event of default under our Credit Facility, which includes customary events of default including payment defaults, defaults in the performance of the affirmative, negative, and financial covenants, the inaccuracy of representations or warranties, bankruptcy and insolvency-related defaults, defaults relating to judgments, certain events related to employee pension benefit plans under the Employee Retirement Income Security Act of 1974 (“ERISA”), the failure to pay specified indebtedness, cross-acceleration to specified indebtedness, and a change of control default. Our Credit Facility contains affirmative, negative, and financial covenants customary for financings of this type. The negative covenants include restrictions on liens, indebtedness of subsidiaries of the Company, fundamental changes, investments, transactions with affiliates, certain restrictive agreements, and violations of sanctions laws and regulations. The sole financial covenant is a consolidated leverage ratio test as described below.\nThe aggregate principal amounts of our 2025 Series B Notes will become due and payable on December 11, 2025. We anticipate paying off our 2025 Series B Notes for $75.0 million when due in December 2025, with available cash on hand, borrowings under our Credit Facility, or proceeds from the issuance of new notes, or a combination thereof. \nThe aggregate principal amounts of our 2026 Series Notes will become due and payable on September 9, 2026. We anticipate paying off our 2026 Series Notes for $75.0 million when due in September 2026, with available cash on hand, borrowings under our Credit Facility, or proceeds from the issuance of new notes, or a combination thereof. \n Should we elect to prepay any of our senior notes, such aggregate prepayment will include the applicable make-whole amount(s), as defined within the applicable Senior Note Agreements. Additionally, in the event of a change in control of the Company or upon the disposition of certain assets of the Company, the proceeds of which are not reinvested (as defined in the Senior Note Agreements), we may be required to prepay all or a portion of the senior notes. The obligations under the senior notes may be accelerated upon the occurrence of an event of default under the applicable Senior Note Agreements, each of which includes customary events of default including payment defaults, defaults in the performance of the affirmative, negative, and financial covenants, the inaccuracy of representations or warranties, bankruptcy and insolvency-related defaults, defaults relating to judgments, certain events related to employee pension benefit plans under ERISA, the failure to pay specified indebtedness, cross-acceleration to specified indebtedness, and a change of control default. The Senior Note Agreements contain affirmative, negative, and financial covenants customary for agreements of this type. The negative covenants include restrictions on liens, indebtedness of our subsidiaries, priority indebtedness, fundamental changes, investments, transactions with affiliates, certain restrictive agreements, and violations of sanctions laws and regulations. The sole financial covenant is a consolidated leverage ratio test as described below.\nEffect of Currency Translation on Cash\n. The net effect of changes in foreign currency exchange rates is related to changes in exchange rates between the U.S. dollar and the functional currencies of our foreign subsidiaries. These changes will fluctuate for each period presented as the value of the U.S. dollar relative to the value of foreign currencies changes. A \n53\ncurrency’s value depends on many factors, including interest rates and the issuing governments’ debt levels and strength of economy.\nOff-Balance Sheet Arrangements\n. We have no off-balance sheet arrangements or variable interest entities, except for letters of credit and third-party guarantees.\nFinancial Covenant\n. The sole financial covenant of our Credit Facility and Senior Note Agreements is a consolidated leverage ratio test that requires our ratio of debt to earnings before interest, taxes, depreciation and amortization, non-recurring transaction expenses incurred in connection with acquisitions, share-based compensation expense, and certain other non-cash losses and charges (“Adjusted EBITDA”), as defined in the Senior Note Agreement and Credit Facility, not to exceed 3.5-to-1. As of September 30, 2025, we were in compliance with such covenant. The following details our consolidated leverage ratio calculation:\n(dollars in thousands)\nTwelve Months Ended\nTrailing 12 Months Adjusted EBITDA:\nSeptember 30, 2025\n \nNet income attributable to stockholders\n$\n1,027,425 \nInterest expense\n37,140 \nProvision for income taxes\n246,169 \nDepreciation and amortization\n140,168 \nAcquisition-related expense\n73 \nShare-based compensation expense\n58,160 \nExtraordinary and other non-recurring non-cash charges\n160 \nAdjusted EBITDA\n$\n1,509,295 \n \nDebt to Adjusted EBITDA Ratio:\nSeptember 30, 2025\n \nLine of Credit\n$\n455,000 \nCurrent and long-term portions of long-term debt\n524,822 \nTotal debt\n979,822 \nAcquisition-related contingent consideration payable\n4,087 \nDeferred financing costs\n178 \nGross debt\n$\n984,087 \nGross debt to Adjusted EBITDA ratio\n0.65 \nLess: Cash and cash equivalents\n$\n208,166 \nNet debt\n$\n775,921 \nNet debt to Adjusted EBITDA ratio\n0.51\nAdjusted EBITDA, gross debt, net debt, gross debt to Adjusted EBITDA ratio, and net debt to Adjusted EBITDA ratio are non-GAAP financial measures which should be considered in addition to, and not as a replacement for, financial measures presented according to U.S. GAAP. Management believes that reporting these non-GAAP financial measures provides supplemental analysis to help investors further evaluate our business performance and available borrowing capacity under our Credit Facility. \nOther Commitments, Contingencies and Guarantees \nSignificant commitments, contingencies, and guarantees as of September 30, 2025, are described in Note 16 to the unaudited condensed consolidated financial statements in “Part I. Item 1. Financial Statements” of this Quarterly Report on Form 10-Q.\n54"
}