{
  "source_file": "iex-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n    \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis should be read in conjunction with the Condensed Consolidated Financial Statements and related notes in this quarterly report. This discussion may contain forward-looking statements based upon current expectations that involve risks and uncertainties. The Company’s actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of several factors, including those set forth under Item 1A, “Risk Factors” in the Company’s most recent annual report on Form 10-K and under the heading “Cautionary Statement Under the Private Securities Litigation Reform Act” discussed elsewhere in this quarterly report.\nThis discussion includes certain non-GAAP financial measures that have been defined and reconciled to the most directly comparable financial measure prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”) under the headings “Non-GAAP Disclosures” and “Free Cash Flow.” This discussion also includes Operating working capital, which has been defined under the heading “Liquidity and Capital Resources.” The non-GAAP financial measures disclosed by the Company should not be considered a substitute for, or superior to, financial measures prepared in accordance with U.S. GAAP. The financial results prepared in accordance with U.S. GAAP and the reconciliations from these results should be carefully evaluated.\nOverview\nIDEX is an applied solutions provider specializing in the manufacturing of health and science technologies, fluid and metering technologies, and fire, safety and other diversified products built to customers’ specifications. IDEX’s products are sold in niche markets across a wide range of industries throughout the world. Accordingly, IDEX’s businesses are affected by levels of industrial activity and economic conditions in the U.S. and in other countries where it does business, as well as by the relationship of the U.S. dollar to other currencies. Levels of capacity utilization and capital spending in certain markets and overall industrial activity are important factors that influence the demand for IDEX’s products.\nHighlights\n(All comparisons are against the same period in 2024 unless otherwise noted)\nThree Months Ended September 30, 2025\n•\nRecord reported Net sales of $878.7 million increased 10% overall and increased 5% organically*\n•\nReported diluted earnings per common share (“EPS”) attributable to IDEX of $1.70 increased 8%\n•\nAdjusted diluted EPS attributable to IDEX* of $2.03 increased 7%\n*These are non-GAAP measures. See the definitions of these non-GAAP measures and reconciliations to their most directly comparable GAAP financial measures under the heading “Non-GAAP Disclosures.”\nDuring the third quarter of 2025, the Company delivered strong operating performance driven by strong price/cost execution and net productivity improvements, including platform optimization savings resulting from restructuring and other cost containment actions taken during 2025, despite challenging macroeconomic conditions. Operating results during the quarter also benefited from the acquisition of Mott Corporation and its subsidiaries (“Mott”). \nRegardless of the business environment, IDEX’s business model and 8020 discipline position the Company to quickly address challenges and pursue opportunities as they arise. Overall industrial order trends remain range-bound and the Company continues to see hesitation around larger order commitments from many customers. Given geopolitical, trade, and overall macroeconomic uncertainty, IDEX remains focused on what it can control and driving sustainable growth and value creation for all stakeholders. The Company continues to refine its capabilities through platform-building, capability-tuning, and integrated growth strategies that customers value. However, IDEX cannot be certain these strategies will entirely mitigate macroeconomic shifts, including if demand otherwise decreases. The Company remains focused on optimizing its business portfolio and expects its strong cash generation and balance sheet will continue to enable opportunistic capital deployment to generate shareholder value sustainably in the long run.\n28\nTable of Contents\n \nResults of Operations\nThe following is a discussion and analysis of the Company’s results of operations for the three and nine months ended September 30, 2025 compared with the three and nine months ended September 30, 2024. \nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\n(In millions, except per share amounts)\n2025\n2024\n$\n% / bps\n2025\n2024\n$\n% / bps\nDomestic sales\n$\n459.2\n$\n397.3\n$\n61.9 \n16\n%\n$\n1,314.4\n$\n1,202.4\n$\n112.0 \n9\n%\nInternational sales\n419.5\n400.9\n18.6 \n5\n%\n1,244.0\n1,203.5\n40.5 \n3\n%\nNet sales\n878.7\n798.2\n80.5\n \n10\n%\n2,558.4\n2,405.9\n152.5\n \n6\n%\nCost of sales\n488.1\n444.3\n43.8 \n10\n%\n1,406.7\n1,327.8\n78.9 \n6\n%\nGross profit\n390.6\n353.9\n36.7\n \n10\n%\n1,151.7\n1,078.1\n73.6\n \n7\n%\nGross margin\n44.5\n%\n44.3\n%\nn/a\n20 bps\n45.0\n%\n44.8\n%\nn/a\n20 bps\nSelling, general and administrative expenses\n204.7\n182.9\n21.8 \n12\n%\n617.7\n560.8\n56.9 \n10\n%\nRestructuring expenses and asset impairments\n0.1\n3.0\n(2.9)\n(97\n%)\n18.3\n5.4\n12.9 \nNM\nOperating income\n185.8\n168.0\n17.8\n \n11\n%\n515.7\n511.9\n3.8\n \n1\n%\nGain on sale of business\n—\n0.6\n(0.6)\n(100\n%)\n—\n(4.0)\n4.0 \n(100\n%)\nOther (income) expense – net\n(1.2)\n2.7\n(3.9)\nNM\n2.6\n—\n2.6 \nNM\nInterest expense – net\n16.5\n10.3\n6.2 \n60\n%\n48.2\n27.8\n20.4 \n73\n%\nIncome before income taxes\n170.5\n154.4\n16.1 \n10\n%\n464.9\n488.1\n(23.2)\n(5\n%)\nProvision for income taxes\n42.8\n35.5\n7.3 \n21\n%\n110.7\n106.7\n4.0 \n4\n%\nEffective tax rate\n25.1\n%\n22.9\n%\nn/a\n220 bps\n23.8\n%\n21.9\n%\nn/a\n190 bps\nNet income attributable to IDEX\n$\n127.8\n$\n119.1\n$\n8.7\n \n7\n%\n$\n354.9\n$\n381.8\n$\n(26.9)\n(7\n%)\nDiluted earnings per common share attributable to IDEX\n$\n1.70\n$\n1.57\n$\n0.13\n \n8\n%\n$\n4.70\n$\n5.02\n$\n(0.32)\n(6\n%)\nNM - Not Meaningful\nNet Sales\nNet sales for both the three and nine months ended September 30, 2025 increased as compared to the same prior year periods as a result of contributions from the acquisition of Mott. Organic sales for the same periods increased 5% and 1%, respectively driven by positive price across all segments. While higher volumes in our Health & Science Technologies and Fluid & Metering Technologies segments more than offset the lower volumes in our Fire & Safety/Diversified Products segment during the three months ended September 30, 2025, higher volumes in our Health & Science Technologies segment only partly mitigated lower volumes in our Fluid & Metering Technologies and Fire & Safety/Diversified Products segments during the nine months ended September 30, 2025.\nGross Profit and Gross Margin\nGross profit and Gross margin for both the three and nine months ended September 30, 2025 were positively impacted by operational productivity improvements and price cost but were negatively impacted by unfavorable mix. The nine months ended September 30, 2025 was also negatively impacted by volume deleverage. Gross profit for both the three and nine months ended September 30, 2025 was positively impacted by acquisitions, net of divestitures, while Gross margin for both the three and nine months ended September 30, 2025 was negatively impacted by acquisitions, net of divestitures. Platform optimization savings resulting from restructuring actions taken during 2025 mitigated increases in other employee-related costs during both the three and nine months ended September 30, 2025. \nSelling, General and Administrative Expenses\nSelling, general and administrative expenses for both the three and nine months ended September 30, 2025 increased by $14.2 million and $47.7 million from acquisitions, net of divestitures, including amortization, respectively, as well as increased professional services spending and slightly higher employee-related costs, driven by variable compensation, as compared to the same prior year periods. \n29\nTable of Contents\n \nRestructuring Expenses and Asset Impairments\nRestructuring expenses and asset impairments primarily relate to severance expense for restructuring actions taken during the respective periods presented. Severance costs during the nine months ended September 30, 2025 were incurred in conjunction with organizational changes, primarily designed to connect scalable groups of businesses, which resulted in a reduction of headcount. Additionally, the Company eliminated certain management layers in select areas. For additional information regarding restructuring expenses and asset impairments, refer to \nNote 10\n, “Restructuring Expenses and Asset Impairments,” in the Notes to Condensed Consolidated Financial Statements. \nGain on Sale of Business\nOn June 3, 2024, the Company completed the sale of Alfa Valvole, Srl (“Alfa Valvole”) for proceeds of $45.1 million, net of cash remitted, resulting in an initial gain on the sale of $4.6 million, net of a release of cumulative foreign currency translation losses of $5.5 million. During the three months ended September 30, 2024, the gain on the sale of Alfa Valvole was finalized, resulting in a downward adjustment to the gain on sale of $0.6 million for a final gain on sale of $4.0 million during the nine months ended September 30, 2025. For additional information regarding the divestiture of Alfa Valvole, refer to \nNote 2\n, “Acquisitions and Divestitures,” in the Notes to Condensed Consolidated Financial Statements.\nOther (Income) Expense – Net \nOther (income) expense – net during the three and nine months ended September 30, 2025 reflects the impact of foreign currency transactions.\nInterest Expense – Net\nInterest expense – net for the three and nine months ended September 30, 2025 increased primarily due to the impact of higher debt outstanding used to finance the acquisition of Mott as well as lower interest income earned as compared to the prior year periods.\nIncome Taxes\nThe effective tax rate was 25.1% and 23.8% for the three and nine months ended September 30, 2025, respectively, as compared to 22.9% and 21.9% during the same periods in 2024, respectively. The increase in the effective tax rate for the three and nine months ended September 30, 2025 reflects the impact of the current period enactment of the OBBBA. The enacted tax legislation had an unfavorable impact on the foreign derived intangible income deduction primarily due to the recovery of previously capitalized unamortized research expenditures. For additional information, refer to \nNote 16\n, “Income Taxes”, in the Notes to Condensed Consolidated Financial Statements. \nIn October 2021, members of the Organization for Economic Co-operation and Development (“OECD”) and G20 Inclusive Framework on Base Erosion and Profit Shifting agreed to a two-pillar solution to address the tax challenges associated with the digitalization of the economy. In December 2021, the OECD released the Pillar Two Model Rules (“Pillar Two”), which define the global minimum tax and call for the taxation of large corporations at a minimum rate of 15%. While it is uncertain whether the United States will enact legislation to adopt Pillar Two, certain countries in which we operate have enacted legislation, and other countries are in the process of introducing draft legislation to implement the minimum tax directive. Many aspects of Pillar Two became effective January 1, 2025; however, nearly all of the jurisdictions in which IDEX operates have an effective tax rate above the 15% threshold. Therefore, the Company does not expect a material impact from the Pillar Two income tax rules. We are continuing to monitor legislative developments and evaluate financial results for changes in the expected impact.\n30\nTable of Contents\n \nResults of Reportable Business Segments\nThe Company has three reportable segments: Health & Science Technologies (“HST”), Fluid & Metering Technologies (“FMT”) and Fire & Safety/Diversified Products (“FSDP”). For a detailed description of the operations within each segment, refer to Note 13, “Business Segments and Geographic Information,” \nin the Notes to Consolidated Financial Statements in the Company’s Annual Report on Form 10-K for the year ended \nDecember 31, 2024. Management’s measurements of segment performance are Net sales, adjusted earnings before interest, income taxes, depreciation and amortization (“Adjusted EBITDA”) and Adjusted EBITDA margin. \nThe table below illustrates\n the share of Net sales and Adjusted EBITDA contributed by each segment on the basis of total segments (not total Company) for the three and nine months ended September 30, 2025. \nThree Months Ended September 30, 2025\nNine Months Ended September 30, 2025\nHST\nFMT\nFSDP\nTotal\nHST\nFMT\nFSDP\nTotal\nNet sales as a percent of total\n43\n%\n36\n%\n21\n%\n100\n%\n42\n%\n36\n%\n22\n%\n100\n%\nAdjusted EBITDA\n(1)\n \n40\n%\n41\n%\n19\n%\n100\n%\n38\n%\n41\n%\n21\n%\n100\n%\n(1)\n \nSegment Adjusted EBITDA excludes the impact of unallocated corporate costs of $21.7 million and $73.5 million for the three and nine months ended September 30, 2025, respectively. \nHealth & Science Technologies Segment\nThree Months Ended September 30,\nComponents of Change\n(In millions)\n2025\n2024\nChange\nOrganic\nAcq/Div\n(1)\nForeign Currency\nTotal\nDomestic sales\n$\n184.1\n$\n139.9\n32%\nInternational sales\n196.9\n171.1\n15%\nNet sales\n$\n381.0\n$\n311.0\n22%\n10%\n11%\n1%\n22%\nAdjusted EBITDA\n105.4\n82.6\n28%\n21%\n2%\n5%\n28%\nAdjusted EBITDA margin\n27.7\n%\n26.5\n%\n120 bps\n260 bps\n(140) bps\n—\n120 bps\nNine Months Ended September 30,\nComponents of Change\n(In millions)\n2025\n2024\nChange\nOrganic\nAcq/Div\n(1)\nForeign Currency\nTotal\nDomestic sales\n$\n505.5\n$\n420.6\n20%\nInternational sales\n582.3\n504.3\n15%\nNet sales\n$\n1,087.8\n$\n924.9\n18%\n4%\n13%\n1%\n18%\nAdjusted EBITDA\n287.8\n248.2\n16%\n8%\n7%\n1%\n16%\nAdjusted EBITDA margin\n26.5\n%\n26.8\n%\n(30) bps\n100 bps\n(130) bps\n—\n(30) bps\n(1) \nAcquisitions include Mott, acquired in September 2024 and Micro-LAM, Inc. (“Micro-LAM”) acquired in July 2025. \n•\nOrganic sales for the three and nine months ended September 30, 2025 reflect positive price and favorable volumes driven by timing of progress made on large orders at Mott as well as higher volumes in the Company’s \nl\nife sciences, pharmaceutical, space and defense, data center and semiconductor consumables businesses, partially offset by lower volumes in our semiconductor lithography and industrial businesses.\n•\nAdjusted EBITDA margin for the three and nine months ended September 30, 2025 reflect volume leverage as well as net productivity improvements, including platform optimization savings and cost containment, and favorable price/cost. These improvements were partially and more than offset by acquisitions and unfavorable mix during three and nine months ended September 30, 2025, respectively.\n31\nTable of Contents\n \nFluid & Metering Technologies Segment\nThree Months Ended September 30,\nComponents of Change\n(In millions)\n2025\n2024\nChange\nOrganic\nAcq/Div\n(1)\nForeign Currency\nTotal\nDomestic sales\n$\n180.5\n$\n168.5\n7%\nInternational sales\n136.6\n132.3\n3%\nNet sales\n$\n317.1\n$\n300.8\n5%\n4%\n—\n1%\n5%\nAdjusted EBITDA\n106.8\n98.5\n8%\n7%\n—\n1%\n8%\nAdjusted EBITDA margin\n33.7\n%\n32.8\n%\n90 bps\n90 bps\n—\n—\n90 bps\nNine Months Ended September 30,\nComponents of Change\n(In millions)\n2025\n2024\nChange\nOrganic\nAcq/Div\n(1)\nForeign Currency\nTotal\nDomestic sales\n$\n525.0\n$\n522.3\n1%\nInternational sales\n393.5\n411.6\n(4%)\nNet sales\n$\n918.5\n$\n933.9\n(2%)\n(1%)\n(1%)\n—\n(2%)\nAdjusted EBITDA\n310.8\n311.6\n—%\n—\n—\n—\n—\nAdjusted EBITDA margin\n33.8\n%\n33.4\n%\n40 bps\n40 bps\n—\n—\n40 bps\n(1)\n Divestitures included Alfa Valvole sold in June 2024. \n•\nOrganic sales for the three months ended September 30, 2025 benefited from positive price and slightly higher volumes as compared to the prior year period. Organic sales for the nine months ended September 30, 2025 reflected unfavorable volumes in our chemical, energy, agriculture, and water businesses, partially offset by higher volume in the industrial businesses, which together more than offset the benefit of positive price across the segment.\n•\nAdjusted EBITDA margin for the three and nine months ended September 30, 2025 increased primarily due to positive price/cost as well as net productivity improvements, including platform optimization savings and cost containment. During the nine months ended September 30, 2025, these improvements were partially offset by volume deleverage.\n32\nTable of Contents\n \nFire & Safety/Diversified Products Segment\nThree Months Ended September 30,\nComponents of Change\n(In millions)\n2025\n2024\nChange\nOrganic\nAcq/Div\nForeign Currency\nTotal\nDomestic sales\n$\n94.6\n$\n88.9\n6%\nInternational sales\n87.3\n99.1\n(12%)\nNet sales\n$\n181.9\n$\n188.0\n(3%)\n(5%)\n—\n2%\n(3%)\nAdjusted EBITDA\n49.3\n54.7\n(10%)\n(11%)\n—\n1%\n(10%)\nAdjusted EBITDA margin\n27.1\n%\n29.1\n%\n(200) bps\n(200) bps\n—\n—\n(200) bps\nNine Months Ended September 30,\nComponents of Change\n(In millions)\n2025\n2024\nChange\nOrganic\nAcq/Div\nForeign Currency\nTotal\nDomestic sales\n$\n283.9\n$\n259.5\n9%\nInternational sales\n273.8\n291.9\n(6%)\nNet sales\n$\n557.7\n$\n551.4\n1%\n—\n—\n1%\n1%\nAdjusted EBITDA\n159.9\n159.9\n—%\n—\n—\n—\n—\nAdjusted EBITDA margin\n28.7\n%\n29.0\n%\n(30) bps\n(30) bps\n—\n—\n(30) bps\n•\nOrganic sales for the three months ended September 30, 2025 reflect lower volumes within our Fire and Safety business resulting from funding disruptions as well as lower volumes in our Dispensing business, partially offset by positive price. The nine months ended September 30, 2025 reflect positive price, mostly offset by lower volumes in our Dispensing business. Volumes in our Dispensing business were impacted during both the three and nine months ended September 30, 2025 by the timing of Dispensing projects in emerging markets and slower equipment replenishment. \n•\nAdjusted EBITDA margin decreased for the three months ended September 30, 2025 primarily due to volume deleverage, partially offset by price/cost. Operational productivity improvements, platform optimization savings and cost containment offset other higher employee-related costs during the three months ended September 30, 2025. The decrease in Adjusted EBITDA margin for the nine months ended September 30, 2025 reflects volume deleverage and unfavorable mix, mostly offset by price/cost. Operational productivity improvements, platform optimization savings and cost containment were offset by other higher employee-related costs during the nine months ended September 30, 2025. \n33\nTable of Contents\n \nLiquidity and Capital Resources\nLiquidity\nBased on management’s current expectations and currently available information, the Company believes current cash, cash from operations and cash available under the Revolving Facility will be sufficient to meet its cash requirements, including planned capital expenditures, interest and principal payments on all borrowings, pension and postretirement funding requirements, share repurchases and quarterly dividend payments to holders of the Company’s common stock for the foreseeable future. Additionally, in the event that suitable businesses are available for acquisition upon acceptable terms, the Company may obtain all or a portion of the financing for these acquisitions through the incurrence of additional borrowings. The Company believes that additional borrowings through various financing alternatives remain available, if required.\nSelect key liquidity metrics at September 30, 2025 are as follows:\n(In millions)\nSeptember 30, 2025\nWorking capital\n$\n1,090.9 \nCurrent ratio\n2.9 to 1\nCash and cash equivalents\n$\n593.8 \nCash held outside of the United States\n531.4 \nRevolving Facility capacity\n$\n800.0 \nBorrowings\n310.6 \nLetters of credit\n2.6 \nRevolving Facility availability\n$\n486.8 \nOperating Working Capital\nOperating working capital, calculated as Receivables – net plus Inventories – net minus Trade accounts payable, is used by management as a measurement of operational results as well as the short-term liquidity of the Company. The following table details Operating working capital as of September 30, 2025 and December 31, 2024:\n(In millions)\nSeptember 30, 2025\nDecember 31, 2024\nChange\nOrganic Change\nReceivables – net\n$\n500.2 \n$\n465.9 \n$\n34.3 \n$\n20.2 \nInventories – net\n495.1 \n429.7\n65.4\n49.4 \nLess: Trade accounts payable\n208.1 \n197.8 \n10.3 \n0.9 \nOperating working capital\n$\n787.2 \n$\n697.8 \n$\n89.4 \n$\n68.7 \nAcquisitions and foreign currency translation increased Operating working capital by $20.7 million during the nine months ended September 30, 2025. Apart from these items, the primary drivers of the change in operating working capital were inventories, which increased early in the year to support planned production, and receivables, which increased due to timing of shipments and price.\n34\nTable of Contents\n \nCash Flow Summary\nThe following table is derived from the Condensed Consolidated Statements of Cash Flows:\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nChange\nNet cash flows provided by (used in): \nOperating activities\n$\n470.9 \n$\n495.5 \n$\n(24.6)\nInvesting activities\n(120.0)\n(991.8)\n871.8 \nFinancing activities\n(424.9)\n606.7 \n(1,031.6)\nOperating Activities\nCash provided by operating activities decreased $24.6 million in the nine months ended September 30, 2025 as compared to the same prior year period primarily due to higher investments in operating working capital driven by higher inventory purchases early in the year to support planned production, higher severance payments made in conjunction with the organizational changes during 2025 and higher interest payments on the 4.950% Senior Notes borrowed during the third quarter of 2024 to fund the acquisition of Mott. The decreases were partly offset by higher sales and lower cash tax payments.\nInvesting Activities\nCash used in investing activities decreased $871.8 million in the nine months ended September 30, 2025 as compared to the prior year period driven by $908.0 million of lower net spending on business acquisitions in the current year period, primarily due to the acquisition of Mott during the prior year period. See further details on acquisition activity in \nNote \n2\n, “Acquisitions & Divestitures”, in the Notes to Condensed Consolidated Financial Statements. The nine months ended September 30, 2025 also reflected a $5.7 million reduction in capital expenditures. Partly offsetting these impacts, the prior year period included proceeds of $45.1 million received from the sale of Alfa Valvole in June 2024 which did not recur in the current period. \nFinancing Activities\nFinancing cash flows decreased $1,031.6 million during the nine months ended September 30, 2025 to $424.9 million of cash used in financing activities from $606.7 million of cash provided by financing activities. The prior year period included $774.8 million of net proceeds in connection with the financing of the Mott acquisition. The nine months ended September 30, 2025 included $175.0 million of share repurchases, $63.8 million of higher net payments on debt, lower proceeds from stock option exercises, net of shares withheld for taxes, which decreased $11.7 million, and $6.4 million of higher dividends paid to shareholders, as compared to the prior year period. \nFree Cash Flow\nThe Company believes free cash flow, a non-GAAP measure, is an important measure of performance because it provides a measurement of cash generated from operations that is available for payment obligations such as operating cash requirements, \nplanned capital expenditures, interest and principal payments on all borrowings, pension and postretirement funding requirements and quarterly dividend payments to holders of the Company’s common stock as well as\n for funding acquisitions and share repurchases. Free cash flow is calculated as cash flows provided by operating activities less capital expenditures.\n35\nTable of Contents\n \nThe following table reconciles cash flows provided by operating activities to free cash flow:\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nCash flows provided by operating activities\n$\n470.9 \n$\n495.5 \nLess: capital expenditures \n43.9 \n49.6 \nFree cash flow\n$\n427.0 \n$\n445.9 \nCash Requirements\nSubsequent Borrowings Activity\nDuring October 2025, the Company had net borrowings on the Revolving Facility of $18.4 million.\nCapital Expenditures\nCapital expenditures generally include machinery and equipment that support growth and improved productivity, tooling, business system technology, replacement of equipment and investments in new facilities. The Company believes it has s\nufficient operating cash flows to continue to meet current obligations and invest in planned capital expenditures. Cash flows from operations were more than adequate to fund capital expenditures of $43.9 million and $49.6 million in the first nine months of 2025 and 2024, respectively. \nShare Repurchases\nOn September 17, 2025, the Company’s Board of Directors authorized the repurchase of an additional $635.0 million of the Company’s common shares. This approval is in addition to the prior repurchase authorization of the Company’s Board of Directors of $500.0 million on March 17, 2020. These authorizations have no expiration date. During the nine months ended September 30, 2025, the Company repurchased a total of 1.0 million shares at a cost of $175.0 million (excluding excise taxes of $1.6 million, which will be paid in 2026). There were no share repurchases during the nine months ended September 30, 2024. As of September 30, 2025, the amount of share repurchase authorization remaining was $999.7 million, excluding fees, commissions, excise taxes and other expenses related to such common stock repurchases. For additional information regarding the Company’s share repurchase program, refer to \nNote 12\n, “Share Repurchases,” in the Notes to Condensed Con\nsolidated Financial Statements.\nDividends\nTotal dividend payments to common shareholders were $159.4 million during the nine months ended September 30, 2025 compared with $153.0 million during the nine months ended September 30, 2024.\nCovenants\nThe key financial covenants that the Company is required to maintain in connection with the Revolving Facility and the 5.13% Senior Notes, are a minimum interest coverage ratio of 3.0 to 1 and a maximum leverage ratio of 3.50 to 1. At September 30, 2025, the Company was in compliance with these financial covenants, as the Company’s interest coverage ratio was 12.73 to 1 for covenant calculation purposes and the leverage ratio was 2.08 to 1. There are no financial covenants relating to the 2.625% Senior Notes, the 3.00% Senior Notes or the 4.950% Senior Notes; however, all are subject to cross-acceleration provisions.\n36\nTable of Contents\n \nCredit Ratings\nThe Company’s credit ratings, which were independently developed by the following credit agencies, are detailed below:\n•\nS&P Global Ratings reaffirmed the Company’s corporate credit rating of BBB (stable outlook) in September 2024.\n•\nMoody’s Investors Service affirmed the Company’s corporate credit rating of Baa2 (stable outlook) in August 2024.\n•\nFitch Ratings reaffirmed the Company’s corporate credit rating of BBB+ (stable outlook) in September 2025.\nOff-Balance Sheet Arrangements\nThe Company had $19.2 million of letters of credit as of September 30, 2025, primarily issued as security for insurance and other performance obligations. Of the $19.2 million of letters of credit, only $2.6 million reduced the Company’s borrowing capacity under the Revolving Facility as of September 30, 2025. \nExcept as disclosed above, the Company has no off-balance sheet arrangements that currently have or are reasonably likely to have a material effect on the Company’s consolidated financial condition, changes in financial condition, results of operations, liquidity, capital expenditures or capital resources. \nCritical Accounting Estimates\nThere have been no changes to the Company’s critical accounting estimates described in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024.\n37\nTable of Contents\n \nNon-GAAP Disclosures\nSet forth below are reconciliations of Organic sales, Adjusted gross profit, Adjusted gross margin, Adjusted net income attributable to IDEX, Adjusted diluted EPS attributable to IDEX, Consolidated Adjusted earnings before interest, income taxes, depreciation and amortization (“Adjusted EBITDA”) and Consolidated Adjusted EBITDA margin to their respective most directly comparable U.S. GAAP measure. Management uses these metrics to measure performance of the Company since they exclude items that are not reflective of ongoing operations, as identified in the reconciliations below. Management also supplements its U.S. GAAP financial statements with adjusted information to provide investors with greater insight, transparency and a more comprehensive understanding of the information used by management in its financial and operational decision making. \nManagement uses Adjusted EBITDA as its measure of segment performance, and believes it is a useful indicator of the strength and performance of the Company and its segments’ ongoing business operations, as well as a way for investors to evaluate and compare operating performance and value companies within the Company’s industry. Management believes that Adjusted EBITDA margin is useful for the same reason as Adjusted EBITDA. The definition of Adjusted EBITDA used here may differ from that used by other companies.\nThis report also references free cash flow. This non-GAAP measure is discussed and reconciled to its most directly comparable GAAP measure in the section above titled “Free Cash Flow.”\nThe non-GAAP financial measures disclosed by the Company should not be considered a substitute for, or superior to, financial measures prepared in accordance with U.S. GAAP. Due to rounding, numbers presented throughout this and other documents may not add up or recalculate precisely. The financial results prepared in accordance with U.S. GAAP and the reconciliations from these results should be carefully evaluated.\n1. Reconciliations of the Change in Net Sales to Organic Sales\nHST\nFMT\nFSDP\nIDEX\nThree Months Ended September 30, 2025\nChange in net sales\n22\n%\n5\n%\n(3\n%)\n10\n%\nLess:\nNet impact from acquisitions/divestitures\n(1)\n11\n%\n—\n%\n—\n%\n4\n%\nImpact from foreign currency\n(2)\n1\n%\n1\n%\n2\n%\n1\n%\nChange in organic net sales\n10\n%\n4\n%\n(5\n%)\n5\n%\nNine Months Ended September 30, 2025\nChange in net sales\n18\n%\n(2\n%)\n1\n%\n6\n%\nLess:\nNet impact from acquisitions/divestitures\n(1)\n13\n%\n(1\n%)\n—\n%\n4\n%\nImpact from foreign currency\n(2)\n1\n%\n—\n%\n1\n%\n1\n%\nChange in organic sales\n4\n%\n(1\n%)\n—\n%\n1\n%\n(1)\n Represents the sales from acquired or divested businesses during the first 12 months of ownership or prior to divestiture.\n(2)\n The portion of sales attributable to foreign currency translation is calculated as the difference between (a) the period-to-period change in organic sales, and (b) the period-to-period change in organic sales after applying prior period foreign exchange rates to the current year period.\n38\nTable of Contents\n \n2. Reconciliations of Reported-to-Adjusted Gross Profit and Gross Margin \n(in millions)\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nGross profit\n$\n390.6\n$\n353.9\n$\n1,151.7\n$\n1,078.1\nFair value inventory step-up charges\n0.6\n2.1\n0.6\n4.6\nAdjusted gross profit\n$\n391.2\n$\n356.0\n$\n1,152.3\n$\n1,082.7\nNet sales\n$\n878.7\n$\n798.2\n$\n2,558.4\n$\n2,405.9\nGross margin\n44.5\n%\n44.3\n%\n45.0\n%\n44.8\n%\nAdjusted gross margin\n44.5\n%\n44.6\n%\n45.0\n%\n45.0\n%\n3. Reconciliations of Reported-to-Adjusted Net Income Attributable to IDEX and Diluted EPS Attributable to IDEX\n (in millions, except for per share amounts)\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nReported net income attributable to IDEX\n$\n127.8 \n$\n119.1 \n$\n354.9 \n$\n381.8 \nFair value inventory step-up charges\n0.6 \n2.1 \n0.6 \n4.6 \nTax impact on fair value inventory step-up charges\n(0.1)\n(0.5)\n(0.1)\n(1.0)\nRestructuring expenses and asset impairments\n(1)\n0.1 \n3.0 \n18.0 \n5.4 \nTax impact on restructuring expenses and asset impairments\n(0.1)\n(0.7)\n(4.4)\n(1.3)\nGain on sale of business\n— \n0.6 \n— \n(4.0)\nTax impact on gain of sale of business\n— \n— \n— \n— \nAcquisition-related intangible asset amortization\n33.0 \n26.5 \n96.5 \n75.0 \nTax impact on acquisition-related intangible asset amortization\n(8.5)\n(6.0)\n(23.2)\n(17.1)\nAdjusted net income attributable to IDEX\n$\n152.8 \n$\n144.1 \n$\n442.3 \n$\n443.4 \nReported diluted EPS attributable to IDEX\n$\n1.70 \n$\n1.57 \n$\n4.70 \n$\n5.02 \nFair value inventory step-up charges\n0.01 \n0.03 \n0.01 \n0.06 \nTax impact on fair value inventory step-up charges\n— \n— \n— \n(0.01)\nRestructuring expenses and asset impairments\n(1)\n— \n0.04 \n0.24 \n0.07 \nTax impact on restructuring expenses and asset impairments\n— \n(0.01)\n(0.06)\n(0.02)\nGain on sale of business\n— \n0.01 \n— \n(0.05)\nTax impact on gain of sale of business \n— \n— \n— \n— \nAcquisition-related intangible asset amortization\n0.43 \n0.35 \n1.27 \n0.99 \nTax impact on acquisition-related intangible asset amortization\n(0.11)\n(0.09)\n(0.31)\n(0.22)\nAdjusted diluted EPS attributable to IDEX\n$\n2.03 \n$\n1.90 \n$\n5.85 \n$\n5.84 \nDiluted weighted average shares outstanding\n75.2 \n75.9 \n75.5 \n75.9 \n(1) \nThis adjustment represents the amount of Restructuring expenses and asset impairments attributable to IDEX. Restructuring expenses and asset impairments of $18.3 million on the Condensed Consolidated Statements of Income during the nine months ended September 30, 2025 included charges of $0.6 million recognized by the Company’s joint venture, $0.3 million of which was attributable to noncontrolling interest.\n39\nTable of Contents\n \n4. Reconciliations of Net Income to Adjusted EBITDA (in millions)\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nReported net income\n$\n127.7\n$\n118.9\n$\n354.2\n$\n381.4\nProvision for income taxes\n42.8\n35.5\n110.7\n106.7\nInterest expense – net\n16.5\n10.3\n48.2\n27.8\nGain on sale of business\n—\n0.6\n—\n(4.0)\nDepreciation\n19.1\n17.4\n56.5\n49.9\nAmortization\n33.0\n26.5\n96.5\n75.0\nFair value inventory step-up charges\n0.6\n2.1\n0.6\n4.6\nRestructuring expenses and asset impairments\n0.1\n3.0\n18.3\n5.4\nAdjusted EBITDA\n$\n239.8\n$\n214.3\n$\n685.0\n$\n646.8\nAdjusted EBITDA Components\nHST\n$\n105.4\n$\n82.6\n$\n287.8\n$\n248.2\nFMT\n106.8\n98.5\n310.8\n311.6\nFSDP\n49.3\n54.7\n159.9\n159.9\nCorporate and other\n(21.7)\n(21.5)\n(73.5)\n(72.9)\nTotal Adjusted EBITDA\n$\n239.8\n$\n214.3\n$\n685.0\n$\n646.8\nNet sales\n$\n878.7\n$\n798.2\n$\n2,558.4\n$\n2,405.9\nNet income margin\n14.5\n%\n14.9\n%\n13.8\n%\n15.9\n%\nAdjusted EBITDA margin\n27.3\n%\n26.9\n%\n26.8\n%\n26.9\n%\n40\nTable of Contents"
}