{
  "source_file": "iex-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.        Business.\nOverview\nIDEX Corporation (“IDEX,” the “Company,” “we,” or “our”) is a global applied solutions provider serving niche markets with mission critical components for everyday life. Substantially all of the Company’s business activities are carried out through over 50 wholly-owned subsidiaries with shared values of Trust, Team and Excellence. IDEX’s diverse family of businesses is committed to making trusted solutions that improve lives and is innovative and inquisitive in its quest to solve customers’ most challenging applied technology problems. These businesses operate with a high degree of autonomy, yet are all united by employing The IDEX Difference, a philosophy of great teams who embrace the 80/20 principle while remaining hyper-focused on serving customers. IDEX was incorporated in Delaware on September 24, 1987.  \nEnd Markets and Products\nThe following table summarizes the percentage of total IDEX sales generated by each end market served:\nThe Company has three reportable segments: Fluid & Metering Technologies (“FMT”), Health & Science Technologies (“HST”) and Fire & Safety/Diversified Products (“FSDP”). The segments are structured around how to best serve customer needs, with each segment consisting of businesses that have product and end market similarities as well as common distribution methods and production processes. This structure enables management efficiency, aligns IDEX’s operations with its focus on organic growth, strategic acquisitions and capital allocation priorities and provides transparency about the Company’s performance to external stakeholders. \nThe table below illustrates the share of Net sales and Adjusted EBITDA contributed by each segment on the basis of total segments (not total Company) for the years ended December 31, 2024 and 2023. \nYear Ended December 31, 2024\nYear Ended December 31, 2023\nFMT\nHST\nFSDP\nFMT\nHST\nFSDP\nNet sales\n38%\n39%\n23%\n38%\n40%\n22%\nAdjusted EBITDA\n(1)\n42%\n36%\n22%\n42%\n37%\n21%\n3\n(1)\n Segment Adjusted EBITDA excludes the impact of unallocated corporate costs of $93.0 million and $84.6 million for the years ended December 31, 2024 and 2023, respectively. \nIDEX believes that each of its reporting units is a leader in its products and services. The Company also believes that its strong financial performance has been attributable to its ability to design and engineer specialized quality products coupled with its ability to successfully identify, acquire and integrate strategic acquisitions. The table below illustrates the three reportable segments and the reporting units within each segment.\nFMT\nHST\nFSDP\nPumps\nScientific Fluidics & Optics\nFire & Safety\nWater\nSealing Solutions\nDispensing\nEnergy\nPerformance Pneumatic Technologies\nBAND-IT\nValves\nMaterial Processing Technologies\nAgriculture\nFLUID & METERING TECHNOLOGIES SEGMENT\nThe FMT segment designs, produces and distributes positive displacement pumps, valves, small volume provers, flow meters, injectors and other fluid-handling pump modules and systems and provides flow monitoring and other services. \nThe following table summarizes the percentage of total FMT sales generated by each end market served:\nThe following discussion describes the reporting units included in the FMT segment:\nPumps.  \nPumps is a leading manufacturer of positive displacement pumps including rotary internal gear, external gear, vane and rotary lobe pumps, custom-engineered original equipment manufacturer pumps, strainers, gear reducers and engineered pump systems. Pumps primarily uses independent distributors to market and sell its products. Pumps is comprised of the following businesses:\n•\nViking Pump is a global leader in pumping solutions, with products including internal gear, external gear, vane, lobe and circumferential piston pumps, as well as parts, kits and accessories designed to support customers worldwide. \n4\nWith a focus on industrial applications like chemicals, polyurethane foam and asphalt; energy applications like oil transfer and glycol dehydration; and hygienic applications like biopharma, food and beverage, Viking Pump delivers proven liquid transfer pumping solutions for a wide variety of thin to viscous applications. Viking Pump maintains operations in Cedar Falls, Iowa, with locations in Windsor, Canada (Viking Pump Canada), Shannon, Ireland (IDEX Pump Technologies) and Eastbourne, England (Viking Pump Hygienic).\n•\nWarren Rupp manufactures air and electrically-operated double diaphragm pump products\n \n(which includes Sandpiper, Versamatic and Cognito products) used for abrasive and semisolid materials as well as for applications where product degradation is a concern. Warren Rupp products primarily serve the chemical, paint, food processing, electronics, construction, utilities, oil and gas, mining and industrial maintenance markets. Warren Rupp maintains primary operations in Mansfield, Ohio.\n•\nABEL designs and manufactures highly engineered reciprocating positive displacement pumps used for mine dewatering, back filling, transfer of mine tailings, municipal sledge and wastewater applications in a variety of end markets including mining, power, water and wastewater as well as other general industries. ABEL maintains operations in Büchen, Germany and Mansfield, Ohio and has facilities in Madrid, Spain and Mumbai, India.\nWater.  \nWater is a leading provider of metering technology, flow monitoring products and underground surveillance services for wastewater markets, as well as alloy and non-metallic gear pumps and peristaltic pumps. Water is comprised of the following businesses:\n•\nADS’ products and services provide comprehensive integrated solutions that enable industry, municipalities and government agencies to analyze and measure the capacity, quality and integrity of wastewater collection systems, including the maintenance and construction of such systems. ADS maintains operations in Huntsville, Alabama and various other locations in the United States, Canada and Australia.\n•\niPEK, Envirosight and WinCan combined are the leading providers of integrated solutions for managing the complete lifecycle of water infrastructure assets and process workflows. Their products and solutions include sewer crawlers, inspection and monitoring systems and software applications that allow teams to identify, anticipate and correct water system issues, automate and simplify inspection processes, improve infrastructure asset management and support distributed teams and cloud-based collaboration. MyTana and Pipeline Renewal Technologies design and build products used to clean and repair infrastructure in the sewer and drain industry. iPEK maintains operations in Hirschegg, Austria and Sulzberg, Germany. Envirosight and Pipeline Renewal Technologies maintain operations in Randolph, New Jersey and Callery, Pennsylvania. WinCan has development centers in Murten, Switzerland and Krakow, Poland. MyTana maintains operations in St. Paul, Minnesota. All entities have various sales and service outlets across the United States and Europe.\n•\nTrebor is a leader in high-purity fluid handling products, including air-operated diaphragm pumps and deionized water-heating systems. Trebor products are used in the manufacturing of semiconductors, disk drives and flat panel displays. Trebor maintains operations in West Jordan, Utah.\n•\nPulsafeeder products are used to introduce precise amounts of fluids into processes to manage water quality and chemical composition. Its markets include industrial and municipal water and wastewater treatment, oil and gas, power generation, chemical and hydrocarbon processing and swimming pools. Pulsafeeder serves these markets by producing hydraulic and mechanical diaphragm pumps, rotary pumps, peristaltic pumps and controllers. Pulsafeeder maintains operations in Rochester, New York and Punta Gorda, Florida.\nEnergy.  \nEnergy is a leading supplier of flow meters, small volume provers, electronic registration and control products, rotary vane and turbine pumps, reciprocating piston compressors and terminal automation control systems. Energy is comprised of the following businesses:\n•\nAdvanced Flow Solutions (“AFS”) consists of the Company’s Corken, Liquid Controls and SAMPI businesses. Corken products consist of positive displacement rotary vane pumps, single and multistage regenerative turbine pumps and small horsepower reciprocating piston compressors in the oil, gas and industrial markets. Products for Liquid Controls and SAMPI consist of positive displacement flow meters as well as electronic registration and control products, including mobile and stationary metering installations for wholesale and retail distribution of petroleum and liquefied petroleum gas, aviation refueling and industrial metering and dispensing of refined liquids and gases. AFS maintains operations in Oklahoma City, Oklahoma (Corken and Liquid Controls products) and Altopascio, Italy (SAMPI products). \n•\nToptech supplies terminal automation hardware and software to control and manage inventories as well as transactional data and invoicing to customers in the oil, gas and refined-fuels markets. Toptech maintains operations in Longwood, Florida and Zwijndrecht, Belgium.\n•\nFlow Management Devices (“Flow MD”) engineers and manufactures small volume provers that ensure custody transfer accuracy in the oil and gas market. Flow MD maintains operations in Phoenix, Arizona.\n5\nValves.  \nValves is a leader in the design, manufacture and sale of specialty valve products for use in the chemical, petro-chemical, energy and sanitary markets as well as a leading producer of fluoroplastic lined corrosion-resistant magnetic drive and mechanical seal pumps, shut-off, control and safety valves for corrosive, hazardous, contaminated, pure and high-purity fluids. Valves is comprised of the following businesses:\n•\nRichter and Aegis produce superior solutions for demanding and complex pump and valve applications in the process industry as well as specialty chemical processing valves for use in the chemical, petro-chemical, pharmaceutical, energy and battery industries. Richter and Aegis maintain operations in Kempen, Germany; Suzhou, China; Vadodara, India and Geismar, Louisiana.\nAgriculture. \n Agriculture is a leading supplier of pumps, valves, controllers, fittings and systems used in agricultural and industrial applications. Agriculture consists of the following businesses:\n•\nBanjo is a provider of special purpose, severe-duty pumps, valves, fittings and systems used in liquid handling. Its products are used in agricultural and industrial applications. Banjo maintains operations in Crawfordsville, Indiana and has distribution facilities in Didam, the Netherlands and Valinhos, Brazil. \n•\nKZValve is a leading manufacturer of electric valves and controllers used primarily in agricultural applications. KZValve maintains operations in Greenwood, Nebraska.\nHEALTH & SCIENCE TECHNOLOGIES SEGMENT\n \nThe HST segment designs, produces and distributes a wide range of precision fluidics, positive displacement pumps, powder and liquid processing technologies, drying systems, micro-precision components, pneumatic components and sealing solutions, high performance molded and extruded sealing components, custom mechanical and shaft seals, engineered hygienic mixers and valves, biocompatible medical devices and implantables, air compressors and blowers, optical components and coatings, laboratory and commercial equipment and precision photonic solutions, technical ceramics and hermetic sealing products and porous material structures and flow control solutions.\nThe following table summarizes the percentage of total HST sales generated by each end market served:\n6\nThe following discussion describes the reporting units included in the HST segment:\nScientific Fluidics & Optics.  \nScientific Fluidics & Optics is a global authority in life science fluidics, optics, microfluidics and photonics and the movement of liquids and gases in critical applications, offering a diverse set of technologies, expertise, capabilities and product solutions across numerous market segments. Scientific Fluidics & Optics is comprised of the following businesses:\n•\nIDEX Health & Science (“IH&S”) consists of IH&S Life Science Fluidics, IH&S Life Science Optics and IH&S Microfluidics. The IH&S Life Science Fluidics technology and product portfolio consists of column hardware, degassers, fluidic connections, fluidic manifolds, pumps and pump components, sensors, refractive index detectors, valves and fluidics sub-systems. The IH&S Life Science Optics technology and product portfolio consists of illumination light engines, optical filters, optical subsystems, sensors, cameras and camera imaging objectives. IH&S Microfluidics includes thinXXS Microtechnology, a global leader in developing and producing microfluidic systems, components and consumables serving the point of care diagnostic and digital polymerase chain reaction markets. IH&S serves the life science optics, chromatography, mass spectrometry, in-vitro diagnostics/biotech fluidics and fluidic connections markets. IH&S maintains operations in Bristol, Connecticut; Carlsbad, California; Middleboro, Massachusetts; Oak Harbor, Washington; Rochester, New York; Rohnert Park, California; Zweibrücken, Germany and Saitama, Japan.\n•\nIDEX Materials Science Solutions is comprised of the following:\n◦\nIDEX Optical Technologies consists of Advanced Thin Films, CVI Laser Optics, CVI Infrared Optics and Iridian Spectral Technologies. The technology and product portfolio consists of polarization optics, windows, optical filters, beamsplitters, lenses, waveplates, monolithic, optics, lens assemblies, imaging assemblies, shutters optical subsystems and detector integration. IDEX Optical Technologies specializes in complex coatings on a range of advanced substrates to serve the semiconductor metrology, satellite optical communications, defense, aerospace and remote sensing, additive manufacturing, laser material processing, laser communications, telecommunications and life science markets. The businesses maintain operations in Albuquerque, New Mexico; Longmont, Colorado; Didam, the Netherlands; Whetstone, England; and Ottawa, Canada.\n◦\nMuon Group manufactures highly precise flow paths in a variety of materials that enable the movement of various liquids and gases in critical applications within the medical, semiconductor, food processing, digital printing and filtration markets. The group includes LouwersHanique, Veco, Millux, Tecan and Atul, which have critical technical expertise in precision and tolerances for different materials, from metals and glass to plastics and ceramics. The business maintains operations in Hapert, the Netherlands; Eerbeek, the Netherlands; Wijchen, the Netherlands; Dorset, England; and Pune, India. \n◦\nSTC Material Solutions specializes in the design and manufacturing of technical ceramics and hermetic sealing products in mission critical applications within the semiconductor, aerospace and defense, industrial technology, medical technology and energy markets. The business maintains operations in St. Albans, Vermont, with additional operations in Santa Ana, California.\n•\nMott Corporation, acquired in September 2024, specializes in the design, customization and manufacturing of sintered porous metal components and engineered solutions used in fluidic applications within the medical, energy, industrial technology, semiconductor, water and aerospace/defense markets. The business maintains operations in Farmington, Connecticut, with additional operations in Plymouth, Michigan and Binasco, Italy.\nSealing Solutions. \n Sealing Solutions focuses on providing special seals and related products and solutions in diversified markets. Sealing Solutions is comprised of the following businesses:\n•\nPrecision Polymer Engineering is a provider of proprietary high performance seals and advanced sealing solutions for a diverse range of global industries and applications, including hazardous duty, analytical instrumentation, semiconductor, process technologies, oil and gas, pharmaceutical, electronics and food applications. Precision Polymer Engineering maintains operations in Blackburn, England and has an additional manufacturing facility in Brenham, Texas. Precision Polymer Engineering also entered into a joint venture with a third party to manufacture and sell high performance elastomer seals for the oil and gas industry to customers within the Kingdom of Saudi Arabia as well as export these high performance elastomer seals outside of the Kingdom of Saudi Arabia. The joint venture maintains operations in Dammam, Saudi Arabia.\n•\nFTL Seals Technology specializes in the design and application of high integrity rotary seals, specialty bearings and other custom products for the mining, power generation and marine markets. FTL Seals Technology maintains operations in Leeds, England.\n7\n•\nSFC Koenig is a producer of highly engineered expanders and check valves for critical applications across the transportation, hydraulic, aviation and medical markets. SFC Koenig maintains operations in Dietikon, Switzerland and has additional facilities in North Haven, Connecticut; Illerrieden, Germany and Suzhou, China.\n•\nThe Roplan businesses are global manufacturers of custom mechanical and shaft seals for a variety of end markets including food and beverage, marine, chemical, wastewater and water treatment. Roplan maintains operations in Sweden and also has operations in Ningbo, China; Berkshire, England and Madison, Wisconsin.\nPerformance Pneumatic Technologies. \n Performance Pneumatic Technologies provides specialized, high-performing air moving technologies across a wide array of industries. Performance Pneumatic Technologies is comprised of the following businesses: \n•\nGast is a leading manufacturer of air-moving products, with a core technology around fractional horsepower (under 1 hp) air compressors, vacuum pumps and air motors. Gast products are used in a variety of long-life applications requiring a quiet, clean source of moderate vacuum or pressure and primarily serve the medical equipment, environmental equipment, computers and electronics, printing machinery, paint mixing machinery, packaging machinery, graphic arts and industrial manufacturing markets. Gast maintains operations in Benton Harbor, Michigan and has a logistics and commercial center in Redditch, England.\n•\nAirtech designs and manufactures a wide range of highly engineered pressure technology products, with a core technology around high performance blowers (2 hp and above) and pneumatic valves for a variety of end markets, including alternative energy, food processing, medical, packaging and transportation. Airtech maintains operations in Rutherford, New Jersey and has other manufacturing operations in Linthicum Heights, Maryland; Wilmington, North Carolina; Werneck, Germany and Shenzhen, China. \nMaterial Processing Technologies.  \nMaterial Processing Technologies provides process equipment and global support service solutions that meet customer specific requirements with a focus in the pharmaceutical, food, battery and chemical markets. Material Processing Technologies is comprised of the following businesses:\n•\nIDEX MPT, Inc., which includes Quadro, Steridose, Fitzpatrick, Microfluidics, and Matcon, maintains operations in Waterloo, Canada; Westwood, Massachusetts; Delran, New Jersey; Evesham, England; Ahmedabad, India and Shanghai, China. \n◦\nQuadro is a leading provider of powder processing solutions for the pharmaceutical, food, personal care and chemical markets. Quadro’s core capabilities include fine milling, emulsification and special handling of liquid and solid particulates for laboratories, through the pilot phase to full scale up with production scale processing. \n◦\nSteridose is a leading designer and manufacturer of magnetic coupled mixers and diaphragm valves for the global biopharmaceutical industry.\n◦\nFitzpatrick is a global leader in the design and manufacture of process technologies for the pharmaceutical and chemical sectors. Fitzpatrick designs and manufactures customized size reduction and roll compaction systems to support their customers’ product development and manufacturing processes. \n◦\nMicrofluidics is a global leader in the design and manufacture of laboratory and production equipment used in the production of micro and nano scale materials for the pharmaceutical, biologics, personal care and chemical markets. Microfluidics is the exclusive producer of the Microfluidizer family of high shear fluid processors for uniform nano-emulsion formation, lipid nanoparticle creation, robust cell disruption and particle size reduction.\n◦\nMatcon is a global leader in creating flexible material processing solutions for high value powders used in the manufacture of foods, pharmaceuticals, batteries, plastics and fine chemicals. Matcon’s innovative products consist of the original cone valve powder discharge system and filling, mixing and packaging systems, all of which support its customers’ automation and process requirements. These products are critical to its customers’ need to maintain clean, reliable and repeatable formulations of prepackaged foods and pharmaceuticals while helping them achieve lean and agile manufacturing.\n8\nFIRE & SAFETY/DIVERSIFIED PRODUCTS SEGMENT\nThe FSDP segment designs, produces and distributes firefighting pumps, valves and controls, rescue tools, lifting bags and other components and systems; engineered stainless steel banding and clamping devices; and precision equipment for dispensing, metering and mixing colorants and paints. \nThe following table summarizes the percentage of total FSDP sales generated by each end market served:\nThe following discussion describes the reporting units included in the FSDP segment:\nFire & Safety.\n  Fire businesses produce truck-mounted and portable fire pumps, stainless steel and brass valves, monitors, nozzles, foam and compressed air foam systems, pump modules and pump kits, electronic controls and information systems, conventional and networked electrical systems and mechanical components for the fire and specialty vehicle markets. Safety businesses produce hydraulic, battery, gas and electric-operated rescue equipment, hydraulic re-railing equipment, hydraulic tools for industrial applications, recycling cutters, pneumatic lifting and sealing bags for vehicle and aircraft rescue, environmental protection and disaster control and jumping cushions for building rescue for the rescue market. Fire & Safety’s customers are original equipment manufacturers as well as public and private fire and rescue organizations. Fire & Safety maintains operations in Ocala, Florida (Class 1 and Hale products); Warwick, England (Godiva products); Wooster and Columbus, Ohio (Akron Brass and Weldon products); Ballendorf, Germany (AWG Fittings products); Shelby, North Carolina (Hurst Jaws of Life® products); Tianjin, China (Dinglee products); Erlangen, Germany (Lukas products) and Zülpich, Germany (Vetter products).\nDispensing.  \nDispensing businesses produce precision equipment for dispensing, metering and mixing colorants and paints used in a variety of retail and commercial businesses around the world. Dispensing is a global supplier of such equipment focused on the architectural paints segment used in retail and commercial stores, hardware stores, home centers and paint and specialized stores as well as in some industrial settings. Dispensing maintains operations in Sassenheim, the Netherlands; Wheeling, Illinois and Sandani, India as well as multiple sales offices around the world.\nBAND-IT.\n  BAND-IT is a leading producer of high-quality stainless steel banding, buckles and clamping systems. The BAND-IT brand is highly recognized worldwide. BAND-IT products are used for securing exhaust system heat and sound shields, airbags, industrial hose fittings, traffic signs and signals, electrical cable shielding, identification and bundling and in numerous other industrial and commercial applications. BAND-IT products primarily serve the automotive, aerospace, energy, \n9\nutility, municipal, cable management and general industrial markets. BAND-IT maintains operations in Denver, Colorado, with additional operations in Staveley, England and Suzhou, China.\nINFORMATION APPLICABLE TO THE COMPANY’S BUSINESS IN GENERAL AND ITS SEGMENTS\nCompetitors\nThe Company’s businesses participate in highly competitive markets. IDEX believes that the principal points of competition are product quality, design and engineering capabilities, product development, conformity to customer specifications, quality of post-sale support, timeliness of delivery and effectiveness of the Company’s distribution channels.\nPrincipal competitors of the FMT segment are the Pumps Group (Blackmer, Wilden and Ebsray products) of Dover Corporation (with respect to pumps and small horsepower compressors used in liquefied petroleum gas distribution facilities, rotary gear pumps and air-operated double-diaphragm pumps); and Ingersoll Rand’s Precision and Science Technologies (PST) division (with respect to metering, control, rotary gear pumps and air operated double-diaphragm pumps).\nPrincipal competitors of the HST segment are the Thomas division of Ingersoll Rand (with respect to vacuum pumps and compressors); Parker Hannifin (with respect to sealing devices); Valco Instruments Co., Inc. (with respect to connections, degassers and valves); Alluxa, Bekaert, Porvair PLC and the Pall division of Danaher Corporation (with respect to filters); Jenoptik (with respect to optical assemblies in life sciences); and Tecan Trading AG (with respect to the life science fluidics market).\nPrincipal competitors of the FSDP segment are Waterous Company, a unit of American Cast Iron Pipe Company (with respect to truck-mounted firefighting pumps); Holmatro, Inc. (with respect to rescue tools); Corob S.p.A., a unit of Graco Inc. (with respect to dispensing and mixing equipment for the paint industry); and Panduit Corporation and Oetiker Inc. (with respect to stainless steel bands, buckles and clamping systems).\nCustomers\nIn 2024, the Company did not have any customers that accounted for more than 3% of net sales. Since the Company serves a wide variety of markets, customer concentrations are not significant.\nInternational\n \nThe Company’s products and services are available worldwide, with manufacturing operations in more than 20 countries. The businesses located outside the U.S. are primarily based in Germany, India, the Netherlands, the United Kingdom, Italy, Switzerland, Canada and China. The Company’s geographic diversity allows it to draw on the skills of a global workforce, provides greater stability to its operations, allows the Company to drive economies of scale, provides revenue streams that may help offset economic trends that are specific to individual economies and offers the Company an opportunity to access new markets for products. \n10\nThe following table illustrates sales to customers within and outside the U.S. as a percentage of total sales for total IDEX as well as by segment and by reporting unit for the year ended December 31, 2024:\nDomestic\nInternational\nFMT\n56%\n44%\nPumps\n57%\n43%\nWater\n58%\n42%\nEnergy\n62%\n38%\nValves\n13%\n87%\nAgriculture\n77%\n23%\nHST\n44%\n56%\nScientific Fluidics & Optics\n42%\n58%\nSealing Solutions\n24%\n76%\nPerformance Pneumatic Technologies\n76%\n24%\nMaterial Processing Technologies\n34%\n66%\nFSDP\n48%\n52%\nFire & Safety\n54%\n46%\nDispensing\n25%\n75%\nBAND-IT\n54%\n46%\nIDEX\n50%\n50%\nShared Services\nThe Company has production facilities in Suzhou, China, Vadodara, India and Ahmedabad, India that support multiple business units. IDEX also has personnel in China, India, Dubai, Mexico, Latin America and Singapore that provide sales, marketing, product design, engineering and sourcing support to its business units in those regions, as well as personnel in various locations in South America, Southeast Asia, the Middle East, Korea and Japan to support sales and marketing efforts in those regions.\nRaw Materials\nThe Company uses a wide variety of raw materials, which are generally purchased from a large number of independent sources around the world. The Company believes it has an adequate supply of raw materials necessary to meet demand. The Company is exposed to fluctuations in commodity pricing and inflation and attempts to control these impacts through increased prices to customers and various other programs with its suppliers. \nSuppliers\nThe Company manufactures many of the parts and components used in its products. Substantially all materials, parts and components purchased by the Company are available from a large number of independent sources around the world. The Company believes it has a sufficient number of suppliers necessary to meet demand but continues to actively evaluate its current suppliers and identify alternative sources to manage supply chain constraints, if needed. \nInventory and Backlog\nThe Company is primarily a short cycle business and backlog is not generally considered a significant factor as relatively short delivery periods and rapid inventory turnover are characteristic of most of the Company’s products. Even still, the Company regularly and systematically adjusts production schedules and quantities based on the flow of incoming orders. While backlog was elevated in recent years due to global supply chain constraints, which extended lead times, shifted customer order patterns and resulted in increased inventory to support production, customer destocking efforts beginning in 2023 have resulted in orders stabilizing with backlog and lead times returning to more normalized levels in 2024. The Company remains focused on delivering products and services to customers and continues to actively manage inventory levels. Further, the Company has not historically experienced significant order cancellations and does not expect significant order cancellations in the future.\n11\nGovernment Regulations\nOur compliance with federal, state and local laws and regulations, including those related to environmental, international trade, labor and employment, human rights, tax, anti-bribery and competition matters, did not have a material effect upon our capital expenditures, earnings or competitive position during the fiscal year ended December 31, 2024.\nEmployees\nAt December 31, 2024, the Company had approximately 9,000 employees. Approximately 4% of its employees are covered by various collective bargaining agreements in the U.S. which will expire at various times between now and June 2028. There are no collective bargaining agreements in the U.S. that will expire in 2025. Management believes that the Company has a positive relationship with its employees. The Company historically has been able to renegotiate its collective bargaining agreements satisfactorily, with its last work stoppage occurring in March 1993. \nHuman\n \nCapital\n \nManagement\nThe Company attributes its success to the valuable contributions of its talented workforce and is committed to fostering a work environment where employees can thrive and grow. Our workplaces promote entrepreneurialism and autonomy while providing a strong safety net of benefits, training and personal development. Investments in attracting, retaining and developing great teams enables the Company to accomplish its goals and deliver innovative customer solutions. The Company’s corporate Human Capital strategy is overseen by its Chief Human Resource Officer (“CHRO”). Annually, the CHRO presents a talent review to the Company’s Board of Directors focused on senior leader team development, the human capital strategy action plan and succession planning for senior management. This ensures that the Board of Directors stays informed and aligned on human capital management strategies for business continuity and success.\nThe Company’s workforce advancement strategy is centered around investments in three pillars: enhancing skills across the entire workforce, leadership development aligned with the Company’s methodology and fostering a premier culture. The Company’s approach to performance management, talent development, talent management and employee engagement helps drive long-term value by providing employees with opportunities to do and be their best both individually and as teams.\nAs part of our Organizational Talent Cycle process, the Company regularly conducts in-depth talent reviews with business leaders, focusing on workforce teams and culture. We identify “stretch” opportunities to help team members grow within and across business units as opportunities and interest arise, and identify local human capital actions to drive our growth strategy. Employees and leaders engage in ongoing performance and development conversations throughout the year. These discussions cover business and development goals, review progress, recognize accomplishments, provide balanced feedback and identify opportunities for improvement. Open and honest dialogue about performance, development and career growth supports our values of trust, team and excellence, helping us achieve our purpose.\nThe Company offers agile development solutions to support unique needs, both locally and across the enterprise, driving long-term value. Employees have access to resources designed to build and enhance their skills for success in their current role or future positions, including personalized development plans and local training programs. Each year, the Company invests in a Global Leadership Conference for senior leaders to align on strategic priorities and strengthen core leadership skills. To support our growth strategy and culture, the Company also sponsors accelerated, on-the-job learning opportunities for key leaders through the IDEX Academy’s global leadership development programs. These programs allow emerging leaders from different geographies and business units to practice new leadership behaviors, share best practices, address business challenges and build strong support networks. The Company’s learning curriculum features a mix of instructor-led, self-paced and blended learning solutions, created internally or sourced from external partners, to develop future leaders in accordance with the IDEX leadership methodology. Additionally, in 2024, the Company supported over 150 senior leaders in inclusive change leadership sessions to accelerate the development of high-performing talent and promote a culture of growth.\nThe Company also enables employee development and growth by offering eligible U.S. employees the opportunity to participate in the Tuition Reimbursement program. Through the program, employees can have certain expenses from secondary educational institutions reimbursed up to $5,250 per year. \nThe Company prioritizes hiring team members who embrace its team-oriented culture and emphasizes leveraging internal talent, filling many leadership positions from within the Company’s talent pipeline. \nA key element of the IDEX Difference is building and engaging great teams. Employee engagement is essential for fostering a premiere culture where everyone can thrive and has an opportunity to do and be their best. We believe our \n12\nemployees are highly engaged, as evidenced by the Company’s annual employee engagement index, which remains above the manufacturing industry average at 81%, as measured by the Company’s employee engagement survey. Additionally, 94% of employees reported they have the knowledge and skills needed to perform their jobs effectively. Key initiatives like the Global Leadership Conference have enhanced senior leaders’ perceptions of learning and development, strengthened support for skill and career growth, and boosted their confidence in achieving their career goals at IDEX.\nDiversity, Equity & Inclusion\n \nThe Company has always recognized diversity as foundational to creativity and resilience; the three pillars of Innovation, Diversity and Excellence form the acronym that is the Company’s name, IDEX. \n \nIn 2024, we continued progress against the strategic roadmap tied to our human capital strategy: (1) completion of local Business Unit Inclusion Plans; (2) delivery of quarterly Inclusive Leadership Training and a two-day enterprise-wise Inclusion Summit to promote leadership skill building for all employees; (3) participation in the Company’s Employee Resource Groups (“ERGs”); and (4) participation in Talent Networks. All offerings, including membership in ERGs, are open to all employees, regardless of their specific background or identity.\nIDEX has built a reputation as a respected employer with a welcoming culture, where 78% of employees feel a strong sense of belonging, according to our 2024 employee engagement survey.\nEmployee Pay and Benefits\nAttracting and retaining top talent is critical to the success of the Company’s business. The Company offers a highly competitive pay and benefits package for employees in all the markets where it operates. The performance-based pay packages provide many employees with short-term performance incentives. The Company also provides equity-based, long-term incentives to its senior leaders. \nThe Company’s U.S. employees can participate in a 401(k) retirement plan and an Employee Stock Purchase Plan, which allows an employee to purchase IDEX stock through payroll deductions. \nFurther, the Company has conducted pay equity analyses for U.S. employees since 2018 to ensure that employees’ actual pay was substantially similar to their predicted pay. Where appropriate, the Company provided base pay adjustments for employees that were outliers from their predicted pay.\nWorkplace Health & Safety\nThe Company is committed to providing a workplace that is safe for all of our employees, contractors, business partners and visitors. The commitment to Environmental, Health, and Safety (“EH&S”) begins at the corporate and executive level. The program is overseen by the EH&S Senior Director and the Chief Sustainability Officer, both of whom are part of the Legal Department. Each of the Company’s businesses employ local EH&S specialists. These individuals and local safety committees, in conjunction with the corporate team, form the basis of the global EH&S program. The Company’s corporate EH&S policies are a key part of the global EH&S program. They apply to all of the Company’s businesses and each business is expected to comply with policies and all EH&S laws and regulations. In addition to the corporate policies, each business develops and implements its own health and safety policies tailored to the local business. \nThe Company also encourages employees enrolled in the U.S. Healthcare Benefit Plan to participate in the third-party operated Wellness Program which provides access to annual biometric screenings and health evaluations. We offer “wellness credits” that can be earned by employees as well as spouses and partners who take advantage of these early detection services offered or engage in healthy challenges and other activities each year. In addition, a number of the business units organize complementary wellness programs, including walking clubs, health fairs and “lunch and learns” with nutritionists for their employees. \nWorker Rights and Protection\nThe Company believes that a respectful workplace is free from unlawful discrimination and harassment, and this involves more than just compliance with the law. The Company strives to create a work environment that is free of inappropriate and unprofessional behavior and consistent with the Company’s values – a place where everyone is invited to do their best every day and feel free to report any concerns. The Company has policies, procedures and regular training in place to protect its workforce and prevent workplace harassment and discrimination. This includes a global Code of Business Conduct & Ethics \n13\npolicy where employees agree to follow and receive annual training. The Company also maintains a global hotline where employees are encouraged (and can choose to remain anonymous) to report any concerns or issues.\nInformation about Our Executive Officers \nSet forth below are the names of the executive officers of the Company, their ages, years of service, the positions held by them and their business experience.\nName\nAge\nYears of\nService\nPosition\nEric D. Ashleman\n57\n16\nChief Executive Officer and President\nAbhishek Khandelwal*\n48\n12\nSenior Vice President and Chief Financial Officer\nLisa M. Anderson\n48\n8\nSenior Vice President, General Counsel and Corporate Secretary\nMelissa S. Flores\n42\n14\nSenior Vice President and Chief Human Resources Officer\nRoopa Unnikrishnan\n53\n3\nSenior Vice President, Strategy and Corporate Development\n*\n \nMr. Khandelwal rejoined IDEX in November 2023 after previously serving in various roles from 2010 to 2020.\nMr. Ashleman has served as President and Chief Executive Officer since December 2020. Prior to that, Mr. Ashleman was Senior Vice President and Chief Operating Officer from July 2015 to December 2020, Vice President-Group Executive of the Company’s HST and FSDP segments from January 2014 through July 2015 and President-Group Executive of the Company’s FSDP segment from 2011 through January 2014. Mr. Ashleman joined IDEX in 2008 as the President of Gast Manufacturing.\nMr. Khandelwal has served as Senior Vice President and Chief Financial Officer since November 2023. Prior to rejoining IDEX, Mr. Khandelwal served as Chief Financial Officer of Multi-Color Corporation, a manufacturer of printed labels for consumer goods, from January 2022 through November 2023, and as Senior Vice President and Chief Financial Officer of CIRCOR International, a pump & valve systems and custom engineering & design company, from April 2020 through December 2021. From 2010 through March 2020, Mr. Khandelwal held a number of senior finance roles within IDEX, serving most recently as Vice President of Finance Operations, Treasury and Financial Planning & Analysis for the Company.\nMs. Anderson has served as Senior Vice President, General Counsel and Corporate Secretary since February 2022. Prior to that, Ms. Anderson served as Vice President, Associate General Counsel and Assistant Secretary from December 2017 through February 2022 after joining IDEX as Assistant General Counsel in October 2016. Prior to joining IDEX, Ms. Anderson served in various roles of increasing responsibility at SunCoke Energy, Inc., most recently as Senior Counsel and Deputy Chief Compliance Officer.\nMs. Flores has served as Senior Vice President and Chief Human Resources Officer since February 2021. Prior to that, Ms. Flores served as Global, Vice President Talent from May 2019 through February 2021. From February 2018 through May 2019, Ms. Flores was Group Vice President Human Resources. Prior to that she served as Vice President, Talent Management and Development from March 2017 to February 2018, after being promoted from Director, Talent Development, a position she served in from March 2015 to March 2017.\nMs. Unnikrishnan has served as Senior Vice President, Chief Strategy and Innovation Officer since March 2022. Prior to that, Ms. Unnikrishnan served as the Chief Strategy Officer of Vontier from October 2020 to July 2021. From September 2016 to October 2020, Ms. Unnikrishnan was Vice President of Strategy at Harman International. Prior to her time at Harman, Ms. Unnikrishnan led Center10 Consulting and served as Managing Director at Blackrock and Vice President of Corporate Strategy at Pfizer.\nPublic Filings\nCopies of the Company’s annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports are made available free of charge at www.idexcorp.com as soon as reasonably practicable after being filed electronically with the SEC. The Company’s reports are also available free of charge on the SEC’s website, www.sec.gov. Information on the Company’s website is not incorporated into this Form 10-K.\n14",
  "item7": "Item 7.\n  \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis should be read in conjunction with the Company’s Consolidated Financial Statements and related notes in this annual report. This discussion may contain forward-looking statements based upon current expectations that involve risks and uncertainties. The Company’s actual results and the timing of selected events could differ materially from those anticipated in these forward-looking statements as a result of several factors, including those set forth under \nItem 1A\n, “Risk Factors” and under the heading “Cautionary Statement Under the Private Securities Litigation Reform Act” discussed elsewhere in this annual report.\nThis discussion includes certain non-GAAP financial measures that have been defined and reconciled to their most directly comparable financial measure prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”) under the headings “Non-GAAP Disclosures” and “Free Cash Flow.” This discussion also includes Operating working capital which has been defined under the heading “Liquidity and Capital Resources.” The non-GAAP financial measures disclosed by the Company should not be considered a substitute for, or superior to, financial measures prepared in accordance with U.S. GAAP. The financial results prepared in accordance with U.S. GAAP and the reconciliations from these results should be carefully evaluated.\nOverview\nIDEX is an applied solutions provider specializing in the manufacturing of fluid and metering technologies, health and science technologies and fire, safety and other diversified products built to customers’ specifications. IDEX’s products are sold in niche markets across a wide range of industries throughout the world. Accordingly, IDEX’s businesses are affected by levels of industrial activity and economic conditions in the U.S. and in other countries where it does business, as well as by the relationship of the U.S. dollar to other currencies. Levels of capacity utilization and capital spending in certain markets and overall industrial activity are important factors that influence the demand for IDEX’s products.    \n2024 Highlights\n(All comparisons are against 2023 unless otherwise noted)\n•\nNet sales of $\n3,268.8\n million, flat overall and down 2% organically*\n•\nDiluted earnings per common share (“EPS”) attributable to IDEX of $6.64, down 15%\n•\nAdjusted diluted EPS attributable to IDEX* of $7.89, down 4%\n•\nOperating cash flow of $668.1 million, down 7%, was 132% of net income, up from 120%\n•\nFree cash flow* of $603.0 million, down 4%, was 101% of adjusted net income*, flat with prior year\n•\nCompleted acquisition of Mott Corporation and its subsidiaries (“Mott”) on September 5, 2024 for cash consideration of $\n986.2\n million, net of cash acquired, using a combination of $\n211.9\n million of cash on hand and $774.3 million of debt\n•\nCompleted a public offering of $500 million principal amount of 4.950% Senior Notes, due September 2029, as part of the funding for the acquisition of Mott\n*These are non-GAAP measures. See the definitions of these non-GAAP measures and reconciliations to their most directly comparable U.S. GAAP financial measures under the headings “Non-GAAP Disclosures” and “Free Cash Flow.”\nDuring 2024, the Company delivered solid execution amid uncertain macro conditions and continued to deploy capital focused on growth initiatives, including completing the acquisition of Mott, which is the Company’s largest acquisition to date. Net sales reflects the benefit of acquisitions, net of divestitures, and growth in our FSDP segment, which together mostly offset the impact of lower volumes from continued market softness in our HST segment; FMT segment net sales were flat organically. Despite market choppiness, our businesses achieved strong productivity through both net price capture and operational excellence and delivered reported and adjusted diluted earnings per share of $6.64 and $7.89, respectively. We delivered operating cash flow of $668.1 million, which was 132% of net income, and achieved free cash flow conversion of 101% of adjusted net income. \n2025 Outlook\nMoving into 2025, the majority of our end markets are stable. Our businesses are well-positioned to capitalize on secular growth trends that we expect will emerge following this current period of near-term uncertainty surrounding U.S. trade and economic policy and overall high levels of geopolitical tension.\n \n26\nWithin HST, we expect growth driven by demand for new disease therapies and nutrition, global communication satellite network expansion, and energy consumption tied to datacenters. We expect modest growth from key end markets in life science fluidics and optical filters while semiconductor will remain delayed until the second half of the year. Separately, our FMT segment expects its largest area of growth to come from its water businesses while core industrial markets are expected to remain stable. Contributions from these spaces are expected to be tempered by pressured demand in energy and agriculture markets, which are experiencing the most exposure to market cyclicality. Finally, we expect FSDP segment growth will continue to be driven by our fire and safety businesses as North America original equipment manufacturers continue to recover and our integrated systems offerings have increased our content per firetruck. \nResults of Operations\nThe following is a discussion and analysis of the Company’s results of operations for the year ended December 31, 2024 compared with the year ended December 31, 2023. For the discussion related to the consolidated results of operations for the year ended December 31, 2023 compared with the year ended December 31, 2022, refer to the Company’s Annual Report on Form 10-K for the year ended December 31, 2023, which was filed with the SEC on February 22, 2024. \nYear Ended December 31, \nChange\n(In millions, except per share amounts)\n2024\n2023\n$\n% / bps\nDomestic sales\n$\n1,618.1\n$\n1,638.7\n$\n(20.6)\n(1 \n%)\nInternational sales\n1,650.7\n1,635.2\n15.5 \n1 \n%\nNet sales\n3,268.8\n3,273.9\n(5.1)\n—\n \n%\nCost of sales\n1,823.6\n1,827.0\n(3.4)\n— \n%\nGross profit\n1,445.2\n1,446.9\n(1.7)\n—\n \n%\nGross margin\n44.2\n \n%\n44.2\n \n%\nn/a\n0 bps\nSelling, general and administrative expenses\n758.7\n703.5\n55.2 \n8 \n%\nRestructuring expenses and asset impairments\n9.3\n10.9\n(1.6)\n(15 \n%)\nOperating income\n677.2\n732.5\n(55.3)\n(8\n \n%)\nGain on sale of businesses - net\n(4.0)\n(84.7)\n80.7 \n(95 \n%)\nOther (income) expense – net\n(2.6)\n5.2\n(7.8)\n(150 \n%)\nInterest expense - net\n44.5\n51.7\n(7.2)\n(14 \n%)\nIncome before income taxes\n639.3\n760.3\n(121.0)\n(16 \n%)\nProvision for income taxes\n134.7\n164.7\n(30.0)\n(18 \n%)\nEffective tax rate\n21.1 \n%\n21.7 \n%\nn/a\n(60) bps\nNet income attributable to IDEX\n$\n505.0\n$\n596.1\n$\n(91.1)\n(15\n \n%)\nDiluted earnings per common share attributable to IDEX\n$\n6.64\n$\n7.85\n$\n(1.21)\n(15\n \n%)\nNet Sales\nNet sales were relatively flat compared to the prior year, reflecting a 2% increase in acquisitions, net of divestitures, offset by a 2% decrease in organic net sales. The decrease in organic net sales was driven by lower volumes as a result of unfavorable market conditions, primarily in the Health & Science Technologies segment, partially offset by price capture across all segments. \nGross Profit and Gross Margin\nGross profit and Gross margin were positively impacted by strong price/cost and were negatively impacted by higher employee-related costs and unfavorable mix. Additionally, Gross profit was positively impacted by the net accretive impact of acquisitions and divestitures, which was more than offset by lower volumes.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses increased primarily due to the $31.1 million impact from acquisitions, including amortization, net of divestitures, as well as higher employee-related costs and increased discretionary spending and transaction expenses.\n27\n \nRestructuring Expenses and Asset Impairments\nRestructuring\n expenses and asset impairments\n decreased primarily due to lower severance costs. Severance costs during both periods were incurred in conjunction with cost mitigation efforts as a result of market conditions.\nGain on Sale of Businesses - Net \nIn 2024, the Company completed the sale of Alfa Valvole, Srl (“Alfa Valvole”) for proceeds of $45.1 million, net of cash remitted, resulting in a gain on the sale of $4.0 million, net of a release of cumulative foreign currency translation losses of $5.5 million. In 2023, the Company completed the sale of Micropump, Inc. (“Micropump”) for proceeds of $110.3 million, net of cash remitted, which resulted in a pre-tax gain of $93.8 million, and the sale of Novotema, SpA (“Novotema”) for proceeds of $8.3 million, net of cash remitted, which resulted in a loss of $9.1 million. For additional information, refer to \nNote 2\n, “Acquisitions and Divestitures,” in the Notes to Consolidated Financial Statements.\nOther (Income) Expense – net\nOther (income) expense – net was $2.6 million of income in 2024 compared to $5.2 million of expense in 2023. The change was primarily due to the absence of a $7.7 million credit loss reserve on an investment with a collaborative partner (see \nNote 3\n, “Collaborative Investments,” in the Notes to Consolidated Financial Statements for further detail) in 2023 that did not reoccur in 2024. \nInterest Expense - Net\nInterest expense - net decreased primarily due to higher interest earned on cash balances in 2024, partially offset by incremental interest expense in 2024, including the impact of higher debt outstanding to finance the acquisition of Mott.\nIncome Taxes\nThe 2024 effective tax rate was 21.1% as compared with the 2023 effective tax rate of 21.7%. One-time discrete tax benefits lowered the effective tax rate in 2024 and 2023. For additional information, refer to \nNote 1\n2\n, “Income Taxes,” in the Notes to Consolidated Financial Statements.\nIn October 2021, members of the Organization for Economic Co-operation and Development (“OECD”) and G20 Inclusive Framework on Base Erosion and Profit Shifting agreed to a two-pillar solution to address the tax challenges associated with the digitalization of the economy. In December 2021, the OECD released the Pillar Two Model Rules (“Pillar Two”), which define the global minimum tax and call for the taxation of large corporations at a minimum rate of 15%. While it is uncertain whether the United States will enact legislation to adopt Pillar Two, certain countries in which we operate have enacted legislation, and other countries are in the process of introducing draft legislation to implement the minimum tax directive. Many aspects of Pillar Two became effective January 1, 2025; however, nearly all of the jurisdictions in which IDEX operates have an effective tax rate above the 15% threshold. The Company does not expect a material impact from the Pillar Two income tax rules. We are continuing to monitor legislative developments and evaluate financial results for changes in the expected impact.\nResults of Reportable Business Segments\nThe Company has three reportable segments: FMT, HST and FSDP. For a detailed description of the operations within each segment, please refer to Part I, \nItem 1\n, \n“\nBusiness\n” \nof this Annual Report on Form 10-K.  \nManagement’s measurements of segment performance are Net sales, adjusted earnings before interest, income taxes, depreciation and amortization (“Adjusted EBITDA”) and Adjusted EBITDA margin. \n28\nFluid & Metering Technologies Segment\nYear Ended December 31, \nComponents of Change\n(In millions)\n2024\n2023\nChange\nOrganic\nAcq/Div\n(1)\nForeign Currency\nTotal\nDomestic sales\n$\n693.1\n$\n695.7\n— \n%\nInternational sales\n540.1\n551.4\n(2 \n%)\nNet sales\n$\n1,233.2\n$\n1,247.1\n(1 \n%)\n— \n%\n(1 \n%)\n— \n%\n(1 \n%)\nAdjusted EBITDA\n406.3\n416.1\n(2 \n%)\n(1 \n%)\n(1 \n%)\n— \n%\n(2 \n%)\nAdjusted EBITDA margin\n32.9 \n%\n33.4 \n%\n(50) bps\n(40) bps\n— bps\n(10) bps\n(50) bps\n(1)\n \nDivestitures included Alfa Valvole, sold in June 2024. \n•\nOrganic net sales were positively impacted by price capture and targeted growth initiatives, which were offset by lower volumes, driven primarily by softness in agriculture and energy markets. Strength in municipal water markets was muted by softness in the semiconductor capital construction market within our water business.\n•\nAdjusted EBITDA margin decreased primarily due to higher employee-related costs, higher discretionary spending and unfavorable mix, partially offset by strong price/cost and favorable operational productivity, net of lower volume leverage. \nHealth & Science Technologies Segment\nYear Ended December 31,\nComponents of Change\n(In millions)\n2024\n2023\nChange\nOrganic\nAcq/Div\n(1)\nForeign Currency\nTotal\nDomestic sales\n$\n573.7\n$\n575.5\n— \n%\nInternational sales\n724.4\n740.9\n(2 \n%)\nNet sales\n$\n1,298.1\n$\n1,316.4\n(1 \n%)\n(7 \n%)\n6 \n%\n— \n%\n(1 \n%)\nAdjusted EBITDA\n346.8\n359.5\n(4 \n%)\n(10 \n%)\n6 \n%\n— \n%\n(4 \n%)\nAdjusted EBITDA margin\n26.7 \n%\n27.3 \n%\n(60) bps\n(70) bps\n10 bps\n— bps\n(60) bps\n(1) \nAcquisitions included Iridian Spectral Technologies acquired in May 2023, STC Material Solutions acquired in December 2023 and Mott acquired in September 2024. Divestitures included Micropump sold in August 2023 and Novotema sold in December 2023\n. \n•\nOrganic net sales were negatively impacted by cyclical market softness in the life sciences and semiconductor markets. This decrease was partially offset by price capture across the segment and targeted growth initiatives within the aerospace/defense market.\n•\nExcluding the net accretive impact of acquisitions and divestitures, Adjusted EBITDA margin decreased primarily due to higher employee-related costs and unfavorable mix, partially offset by price/cost, lower discretionary spending and favorable operational productivity, net of lower volume leverage. \nFire & Safety/Diversified Products Segment\nYear Ended December 31,\nComponents of Change\n(In millions)\n2024\n2023\nChange\nOrganic\nAcq/Div\nForeign Currency\nTotal\nDomestic sales\n$\n354.9\n$\n371.9\n(5 \n%)\nInternational sales\n389.4\n346.9\n12 \n%\nNet sales\n$\n744.3\n$\n718.8\n4 \n%\n4 \n%\n— \n%\n— \n%\n4 \n%\nAdjusted EBITDA\n214.2\n208.6\n3 \n%\n3 \n%\n— \n%\n— \n%\n3 \n%\nAdjusted EBITDA margin\n28.8 \n%\n29.0 \n%\n(20) bps\n(20) bps\n— bps\n— bps\n(20) bps\n•\nOrganic net sales were positively impacted by strong targeted growth initiatives, continued recovery in fire original equipment manufacturer markets and price capture. These increases were partially offset by unfavorable mix due to the \n29\ncyclical nature of project sales in our North American dispensing business and softer demand in automotive and industrial markets. \n•\nThe decrease in Adjusted EBITDA margin was primarily due to higher employee-related costs and unfavorable mix, partially offset by price/cost.\nLiquidity and Capital Resources\nLiquidity\nBased on management’s current expectations and currently available information, the Company believes current cash, cash from operations and cash available under the Revolving Facility will be sufficient to meet its operating\n cash requirements, planned capital expenditures, interest and principal payments on all borrowings, pension and postretirement funding requirements, share repurchases and quarterly dividend payments to holders of the Company’s common stock for the foreseeable future\n. Additionally, in the event that suitable businesses are available for acquisition upon acceptable terms, the Company may obtain all or a portion of the financing for these acquisitions through the incurrence of additional borrowings. The Company believes that additional borrowings through various financing alternatives remain available, if required.\nMott was acquired during the third quarter of 2024 for cash consideration of $986.2 million, net of cash acquired of $3.1 million. The acquisition was funded using a combination of cash on hand of $211.9 million, borrowings under the Company’s Revolving Facility of $279.3 million, and the net proceeds of $495.0 million from the issuance of the 4.950% Senior Notes. For additional information regarding the borrowings under the Company’s Revolving Facility and the 4.950% Senior Notes, refer to \nNote 7\n, “Borrowings,” in the Notes to Consolidated Financial Statements.\nSelect key liquidity metrics at December 31, 2024 are as follows:\n(In millions)\nDecember 31, 2024\nWorking capital\n$\n963.0 \nCurrent ratio\n2.5 to 1\nCash and cash equivalents\n$\n620.8 \nCash held outside of the United States\n462.7 \nRevolving Facility capacity\n$\n800.0 \nBorrowings\n269.8 \nLetters of credit\n2.8 \nRevolving Facility availability\n$\n527.4 \nOperating Working Capital\nOperating working capital, calculated as Receivables – net plus Inventories – net minus Trade accounts payable, is used by management as a measurement of operational results as well as the short-term liquidity of the Company. The following table details Operating working capital as of December 31, 2024 and 2023:\n(In millions)\nDecember 31, 2024\nDecember 31, 2023\nChange\nOrganic Change\nReceivables – net\n$\n465.9 \n$\n427.8 \n$\n38.1 \n$\n17.0 \nInventories – net\n429.7 \n420.8\n8.9 \n(17.7)\nLess: Trade accounts payable\n197.8 \n179.7 \n18.1 \n8.4 \nOperating working capital\n$\n697.8 \n$\n668.9 \n$\n28.9 \n$\n(9.1)\nOperating working capital increased $28.9 million to $697.8 million at December 31, 2024. Acquisitions, divestitures and foreign currency translation increased Operating working capital by $38.0 million during 2024. Apart from these items, receivables increased due to strong price capture, which more than offset the impact of lower volumes; inventories decreased with lower volumes and targeted actions to lower inventory levels; and accounts payable increased as a result of timing of payments for inventory purchases.\n30\nCash Flow Summary\nThe following table is derived from the Consolidated Statements of Cash Flows:\nYear Ended December 31, \n(In millions)\n2024\n2023\nChange\nNet cash flows provided by (used in): \nOperating activities\n$\n668.1 \n$\n716.7 \n$\n(48.6)\nInvesting activities\n(1,006.5)\n(283.8)\n(722.7)\nFinancing activities\n465.9 \n(344.7)\n810.6 \nOperating Activities\nCash flows provided by operating activities decreased $48.6 million to $668.1 million in 2024 primarily due to lower earnings and the timing of customer deposits and project deliveries as well as larger inventory reductions in the prior year period. Lower cash payments in 2024 compared to the prior year, including payments for taxes, variable compensation and interest, partially mitigated these items.\nInvesting Activities\nCash flows used in investing activities increased $722.7 million in 2024. The net impact of acquisitions and divestitures increased cash used in investing activities by $746.2 million during 2024 as compared to 2023, primarily related to the acquisition of Mott in 2024. This increase in cash outflows was partially offset by lower capital expenditures, which decreased cash used in investing activities by $24.8 million, as compared to 2023. For additional information on the Company’s acquisition and divestitures, refer to \nNote 2\n, “Acquisitions and Divestitures,” in the Notes to Consolidated Financial Statements.\nFinancing Activities\nCash flows provided by financing activities increased $810.6 million in 2024 primarily due to $774.3 million of net proceeds in connection with the financing of the acquisition of Mott in 2024, as compared with $100.0 million of net proceeds from borrowings in 2023. Additionally, repayments of long-term borrowings and revolving credit facilities were $130.9 million lower in 2024, and share repurchases were lower by $24.2 million in 2024, which were partly offset by higher dividends paid to shareholders, which increased $14.6 million in 2024.\nFree Cash Flow\nThe Company believes free cash flow, a non-GAAP measure, is an important measure of performance because it provides a measurement of cash generated from operations that is available for payment obligations such as operating cash requirements, \nplanned capital expenditures, interest and principal payments on all borrowings, pension and postretirement funding requirements and quarterly dividend payments to holders of the Company’s common stock as well as\n for funding acquisitions and share repurchases. Free cash flow is calculated as cash flows provided by operating activities less capital expenditures. Free cash flow conversion is calculated as free cash flow divided by adjusted net income attributable to IDEX.\nThe following table reconciles cash flows provided by operating activities to free cash flow:\nYear Ended December 31, \n(In millions)\n2024\n2023\nCash flows provided by operating activities\n$\n668.1\n$\n716.7\nLess: capital expenditures \n65.1\n89.9\nFree cash flow\n$\n603.0\n$\n626.8\nReported net income attributable to IDEX\n$\n505.0\n$\n596.1\nAdjusted net income attributable to IDEX\n598.5\n623.6\nOperating cash flow as a percent of net income\n132 \n%\n120 \n%\nFree cash flow conversion\n101 \n%\n101 \n%\n31\n \nCash Requirements\nContractu\nal Obligations\nThe Company’s cash requirements under contractual obligations include: \n•\nBorrowings and related interest - See \nNote 7\n, “Borrowings,” in the Notes to Consolidated Financial Statements for further detail of the Company’s debt and timing of expected future principal payments.\n•\nRental payments for leases - See \nNote 9\n, “Leases,” in the Notes to Consolidated Financial Statements for further detail of our obligations and the timing of expected future payments. \n•\nPurchase obligations - The Company enters into purchase orders with vendors and other parties in the ordinary course of business. As of December 31, 2024, the Company’s purchase obligations, consisting primarily of inventory commitments, totaled approximately $296.8 million, of which $271.1 million\n is expected to be settled during 2025 and the remainder thereafter.\n \n•\nPension and post-retirement medical benefit plans - See \nNote 17\n, “Retirement Benefits,” in the Notes to Consolidated Financial Statements for further detail of our obligations and the timing of expected future payments.  \nSubsequent Borrowings Activity\nDuring January 2025, the Company repaid $30.2 million of the $269.8 million outstanding under the Revolving Facility at December 31, 2024.\nCapital Expenditures\nCapital expenditures generally include machinery and equipment that support growth and improved productivity, tooling, business system technology, replacement of equipment and investments in new facilities. The Company believes it has sufficient operating cash flows to continue to meet current obligations and invest in planned capital expenditures. C\nash flows from operations were more than adequate to fund capital expenditures of $65.1 million and $89.9 million i\nn 2024 and 2023, \nrespectively. \nShare Repurchases\nThere were no share repurchases i\nn 2024. \nThe Company repurchased 124,600 shares at a cost of $24.2 million in 2023. As of December 31, 2024, the amount of share repurchase authorization remaining was $539.7 million. During February 2025, the Company repurchased a total of 256,159 shares at a cost of $50.0 million. For additional information regarding the Company’s share repurchase program, refer to \nNote 11\n, “Share Repurchases,” in the Notes to Consolidated Financial Statements.\nDividends \nThe Company increased its quarterly cash dividend by 8% from $0.64 per common share in 2023 to $0.69 per common share in 2024. Total dividend payments to common shareholders were $205.3 million in 2024 compared with $190.7 million in 2023.\nCovenants\nThe key financial covenants that the Company is required to maintain in connection with the Revolving Facility, the 3.37% Senior Notes and the 5.13% Senior Notes, are a minimum interest coverage ratio of 3.0 to 1 and a maximum leverage ratio of 3.50 to 1. At December 31, 2024, the Company was in compliance with both of these financial covenants, as the Company’s interest coverage ratio was 16.09 to 1 for covenant calculation purposes and the leverage ratio was 2.20 to 1. There are no financial covenants relating to the 2.625% Senior Notes, the 3.00% Senior Notes and the 4.950% Senior Notes (each defined in \nNote 7\n, “Borrowings”); however, all are subject to cross-acceleration provisions. For a discussion of the Company’s Revolving Facility, Term Facility and Senior Notes as well as the associated covenants, refer to \nNote 7\n, “Borrowings,” in the Notes to Consolidated Financial Statements.\nCredit Ratings\nThe Company’s credit ratings, which were independently developed by the following credit agencies, are detailed below:\n•\nS&P Global Ratings reaffirmed the Company’s corporate credit rating of BBB (stable outlook) in September 2024.\n•\nMoody’s Investors Service affirmed the Company’s corporate credit rating of Baa2 (stable outlook) in August 2024.\n32\n•\nFitch Ratings reaffirmed the Company’s corporate credit rating of BBB+ (stable outlook) in June 2024.\nOff-Balance Sheet Arrangements\nThe Company had $38.1 million of letters of credit as of December 31, 2024, primarily issued as security for insurance and other performance obligations. Of the $38.1 million of letters of credit, only $2.8 million reduced the Company’s borrowing capacity under the Revolving Facility as of December 31, 2024. The Company has restricted cash of $18.1 million as of December 31, 2024, which represents cash held as collateral for standby letters of credit issued by Mott and is required to keep the balance in a separate account for the duration of the letters of credit.\nExcept as disclosed above, the Company has no off-balance sheet arrangements that currently have or are reasonably likely to have a material effect on the Company’s consolidated financial condition, changes in financial condition, results of operations, liquidity, capital expenditures or capital resources. \nCritical Accounting Estimates\nThe Company believes that the application of the following accounting policy, which is important to its financial position and results of operations, requires significant judgments and estimates on the part of management. For a summary of the Company’s accounting policies, including the accounting policy discussed below, see \nNote 1\n, “Significant Accounting Policies,” in the Notes to Consolidated Financial Statements.\nGoodwill and indefinite-lived intangible assets\n — Goodwill and other intangible assets with indefinite lives, which consists solely of trade names, are not amortized; rather they are tested for impairment at least annually, or more frequently if events or circumstances indicate that the asset may be impaired. The Company follows the guidance prescribed in Accounting Standards Codification (“ASC”) 350, \nGoodwill and Other Intangible Assets\n, to test goodwill and indefinite-lived intangible assets for impairment. In assessing goodwill for impairment, the Company determines the fair value of each reporting unit utilizing an income approach (discounted cash flows) weighted 50% and a market approach (consisting of a comparable public company multiples methodology) weighted 50%. To determine the reasonableness of the calculated fair values, the Company reviews the assumptions to ensure that neither the income approach nor the market approach yielded significantly different valuations. Key assumptions and estimates used in the goodwill impairment assessment are described below. Based on the results of the Company’s annual impairment test at October 31, 2024, all reporting units had fair values substantially in excess of their carrying values. \nThe key assumptions are updated every year for each reporting unit for the income and market approaches used to determine the fair value. Various assumptions are utilized including forecasted operating results, annual operating plans, strategic plans, economic projections, anticipated future cash flows, the weighted average cost of capital, market data and market multiples. The assumptions that have the most significant effect on the fair value calculations are the weighted average cost of capital, market multiples, forecasted cash flows and terminal growth rates. The following assumption ranges were utilized by the Company in 2024 and 2023:\nAssumptions\n2024\nRange\n2023\nRange\nWeighted average cost of capital\n9.25% to 9.75%\n10.00% to 12.25%\nMarket multiples\n12.0x to 19.0x\n10.0x to 20.0x\nTerminal growth rates\n3.0% to 3.5%\n3.0% to 3.5%\nIn assessing trade names for impairment, the Company uses the relief-from-royalty method, a form of the income approach, to determine the fair value of its trade names. The relief-from-royalty method is dependent on a number of significant management assumptions, including estimates of revenues, royalty rates and discount rates. Based on the results of the Company’s annual impairment test at October 31, 2024, the trade names had fair values in excess of their carrying values.\nThe Company’s acquisitions have generally included significant goodwill components and the Company expects to continue to make acquisitions. At December 31, 2024, goodwill and other indefinite-lived intangible assets totaled $3,342.6 million, or 50%, of the Company’s total assets. \nSee \nNote 6\n, “Goodwill and Intangible Assets,” in the Notes to Consolidated Financial Statements for further discussion on goodwill and indefinite-lived intangible assets.\n33\nNon-GAAP Disclosures\nSet forth below are reconciliations of Organic net sales, Adjusted gross profit, Adjusted gross margin, Adjusted net income attributable to IDEX, Adjusted diluted EPS attributable to IDEX, Consolidated Adjusted earnings before interest, income taxes, depreciation and amortization (“Adjusted EBITDA”) and Consolidated Adjusted EBITDA margin to their respective most directly comparable U.S. GAAP measure. Management uses these metrics to measure performance of the Company since they exclude items that are not reflective of ongoing operations, as identified in the reconciliations below. Management also supplements its U.S. GAAP financial statements with adjusted information to provide investors with greater insight, transparency and a more comprehensive understanding of the information used by management in its financial and operational decision making. \nManagement uses Adjusted EBITDA as its measure of segment performance, and believes it is a useful indicator of the strength and performance of the Company and its segments’ ongoing business operations, as well as a way for investors to evaluate and compare operating performance and value companies within the Company’s industry. Management believes that Adjusted EBITDA margin is useful for the same reason as Adjusted EBITDA. The definition of Adjusted EBITDA used here may differ from that used by other companies.\nThis report also references free cash flow and free cash flow conversion. These non-GAAP measures are discussed and reconciled to their most directly comparable U.S. GAAP measure in the section above titled “Free Cash Flow.”\nThe non-GAAP financial measures disclosed by the Company should not be considered a substitute for, or superior to, financial measures prepared in accordance with U.S. GAAP. Due to rounding, numbers presented throughout this and other documents may not add up or recalculate precisely. The financial results prepared in accordance with U.S. GAAP and the reconciliations from these results should be carefully evaluated.\nAll table footnotes can be found at the end of this Non-GAAP Disclosures section.\n1. Reconciliations of the Change in Net Sales to Organic Net Sales\nFor the Years Ended December 31,\n2024\n2023\nFMT\nHST\nFSDP\nIDEX\nFMT\nHST\nFSDP\nIDEX\nChange in net sales\n(1 \n%)\n(1 \n%)\n4 \n%\n— \n%\n7 \n%\n(2 \n%)\n6 \n%\n3 \n%\nLess:\nNet impact from acquisitions/divestitures\n(1)\n(1 \n%)\n6 \n%\n— \n%\n2 \n%\n2 \n%\n9 \n%\n— \n%\n5 \n%\nImpact from foreign currency\n(2)\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\nImpact from the exit of a COVID-19 testing application\n(3)\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n(1 \n%)\n— \n%\n(1 \n%)\nChange in organic net sales\n— \n%\n(7 \n%)\n4 \n%\n(2 \n%)\n5 \n%\n(10 \n%)\n6 \n%\n(1 \n%)\n2. Reconciliations of Reported-to-Adjusted Gross Profit and Gross Margin \n(in millions)\nFor the Years Ended December 31,\n2024\n2023\nGross profit\n$\n1,445.2\n$\n1,446.9\nFair value inventory step-up charges\n9.6\n1.6\nAdjusted gross profit\n$\n1,454.8\n$\n1,448.5\nNet sales\n$\n3,268.8\n$\n3,273.9\nGross margin\n44.2 \n%\n44.2 \n%\nAdjusted gross margin\n44.5 \n%\n44.2 \n%\n3. Reconciliations of Reported-to-Adjusted Net Income Attributable to IDEX and Diluted EPS Attributable to IDEX \n(in millions, except per share amounts)\nFor the Years Ended December 31,\n2024\n2023\nReported net income attributable to IDEX\n$\n505.0 \n$\n596.1 \nFair value inventory step-up charges\n9.6 \n1.6 \nTax impact on fair value inventory step-up charges\n(2.0)\n(0.4)\nRestructuring expenses and asset impairments\n9.3 \n10.9 \nTax impact on restructuring expenses and asset impairments\n(2.2)\n(2.5)\nGain on sale of businesses - net\n(4.0)\n(84.7)\nTax impact on gain on sale of businesses - net\n— \n22.7 \nCredit loss on note receivable from collaborative partner\n(4)\n— \n7.7 \nTax impact on credit loss on note receivable from collaborative partner\n— \n(1.6)\nAcquisition-related intangible asset amortization\n107.1 \n94.9 \nTax impact on acquisition-related intangible asset amortization\n(24.3)\n(21.1)\nAdjusted net income attributable to IDEX\n$\n598.5 \n$\n623.6 \nReported diluted EPS attributable to IDEX\n$\n6.64 \n$\n7.85 \nFair value inventory step-up charges\n0.13 \n0.02 \nTax impact on fair value inventory step-up charges\n(0.02)\n— \nRestructuring expenses and asset impairments\n0.12 \n0.15 \nTax impact on restructuring expenses and asset impairments\n(0.03)\n(0.03)\nGain on sale of businesses - net\n(0.05)\n(1.12)\nTax impact on gain on sale of businesses - net\n— \n0.30 \nCredit loss on note receivable from collaborative partner\n(4)\n— \n0.10 \nTax impact on credit loss on note receivable from collaborative partner\n— \n(0.02)\nAcquisition-related intangible asset amortization\n1.41 \n1.25 \nTax impact on acquisition-related intangible asset amortization\n(0.31)\n(0.28)\nAdjusted diluted EPS attributable to IDEX\n$\n7.89 \n$\n8.22 \nDiluted weighted average shares outstanding\n75.9 \n75.9 \n4. Reconciliations of Net Income to Adjusted EBITDA \n(in millions)\nFor the Years Ended December 31,\n2024\n2023\nReported net income\n$\n504.6\n$\n595.6\nProvision for income taxes\n134.7\n164.7\nInterest expense – net\n44.5\n51.7\nGain on sale of businesses - net\n(4.0)\n(84.7)\nDepreciation\n68.5\n57.2\nAmortization\n107.1\n94.9\nFair value inventory step-up charges\n9.6\n1.6\nRestructuring expenses and asset impairments\n9.3\n10.9\nCredit loss on note receivable from collaborative partner\n(4)\n—\n7.7\nAdjusted EBITDA\n$\n874.3\n$\n899.6\nAdjusted EBITDA Components\nFMT\n$\n406.3\n$\n416.1\nHST\n346.8\n359.5\nFSDP\n214.2\n208.6\nCorporate and other\n(93.0)\n(84.6)\nTotal Adjusted EBITDA\n$\n874.3\n$\n899.6\nNet sales\n$\n3,268.8\n$\n3,273.9\nNet income margin\n15.4 \n%\n18.2 \n%\nAdjusted EBITDA margin\n26.7 \n%\n27.5 \n%\n(1)\n Represents the sales from acquired or divested businesses during the first 12 months of ownership or prior to divestiture.\n(2)\n The portion of sales attributable to foreign currency translation is calculated as the difference between (a) the period-to-period change in organic net sales, and (b) the period-to-period change in organic net sales after applying prior period foreign exchange rates to the current year period.\n(3)\n \nThe impact to Net sales represents the absence of the acceleration of previously deferred revenue of $17.9 million as a result of a customer’s decision to discontinue further investment in commercializing its COVID-19 testing application in 2022 that did not reoccur in 2023. See \nNote 14\n, “Restructuring Expenses and Asset Impairments,” in the Notes to Consolidated Financial Statements for further detail.\n(4)\n \nRepresents a reserve recorded on an investment with a collaborative partner. See \nNote 3\n, “Collaborative Investments,” in the Notes to Consolidated Financial Statements for further detail.",
  "item2": null
}