{
  "source_file": "iff-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\n(UNLESS INDICATED OTHERWISE, DOLLARS IN MILLIONS EXCEPT PER SHARE AMOUNTS)\nThe following management’s discussion and analysis should be read in conjunction with the management’s discussion and analysis of financial condition and results of operations, liquidity and capital resources included in our 2024 Annual Report on Form 10-K, filed on February 28, 2025 with the SEC (“2024 Form 10-K”).\nOVERVIEW\nCompany Background\nWe are a leading creator and manufacturer of products for application in food, beverage, health & biosciences, scent (and pharmaceuticals, until the recent sale of the Pharma Solutions disposal group), as well as complementary adjacent products, including natural health ingredients, all of which are used in a wide variety of consumer and end-use products. Our products are sold principally to manufacturers of dairy, meat, beverages, snacks, savory, sweet, baked goods, grain processors and other foods, personal care products, soaps and detergents, cleaning products, perfumes, dietary supplements, food protection, infant, elderly and animal nutrition, functional food, bio-fuel, pharmaceutical and oral care products. As a result, we hold global leadership positions in the Food & Beverage, Home & Personal Care and Health & Wellness markets, and across key Tastes, Textures, Scents, Nutrition, Enzymes, Cultures, Soy Proteins and Probiotics categories, among others.\nEffective January 1, 2025, the Company implemented a reorganization of its internal structure, which impacted the way the CODM, the Chief Executive Officer, allocates resources and assesses financial performance. As a result, the Company has updated its reportable segments beginning with the first quarter of 2025. Specifically, the former Nourish segment has been separated into two new reportable segments: Taste and Food Ingredients. The Taste segment (formerly the Flavors business within Nourish) includes flavor compounds and natural taste solutions used in food and beverage applications. The Food Ingredients segment (formerly the Ingredients business within Nourish) includes a broad portfolio of natural and plant-based specialty ingredients that provide texturizing and food protection capabilities, as well as soy and pea protein solutions, emulsifiers, and sweeteners. In addition, immaterial business transfers occurred between Food Ingredients and Pharma Solutions, and between Health & Biosciences and Taste. Thus, starting in the first quarter of 2025, we are organized into five reportable operating segments: Taste, Food Ingredients, Health & Biosciences, Scent and, until the completion of the divestitures of both the Pharma Solutions and Nitrocellulose disposal groups, Pharma Solutions.\nOur Taste segment consists of a range of flavor compounds and natural taste solutions that are ultimately used by our customers in savory products (soups, sauces, meat, fish, poultry, snacks, etc.), beverages (juice drinks, carbonated or flavored beverages, spirits, etc.), sweets (bakery products, candy, cereal, chewing gum, etc.), and dairy products (yogurt, ice cream, cheese, etc.). Flavors also include value-added spices and seasoning ingredients for meat, food service, convenience, alternative protein and culinary products. \nOur Food Ingredients segment consists of a diversified portfolio across natural and plant-based specialty food ingredients derived from herbs and plants that provide texturizing solutions used in the food industry, food protection solutions used in food and beverage products, as well as specialty soy and pea protein with value-added formulations, emulsifiers and sweeteners. Natural food protection ingredients consist of natural antioxidants and anti-microbials used for natural food preservation and shelf-life extension for beverages, cosmetic and healthcare products, pet food and feed additives. Food Ingredients also includes savory solutions (such as spices, marinades, mixtures) and inclusion products (such as products combining flavorings with fruit, vegetables and other natural ingredients).\nOur Health & Biosciences segment consists of the development and production of an advanced biotechnology-derived portfolio of enzymes, food cultures, probiotics and specialty ingredients for food and non-food applications. Among many other applications, this biotechnology-driven portfolio includes cultures for use in fermented foods such as yogurt, cheese and fermented beverages, probiotic strains, many with documented clinical health claims for use as dietary supplements and through industrial fermentation the production of enzymes and microorganisms that provide product and process performance benefits to household detergents, animal feed, ethanol production and brewing. Health & Biosciences is comprised of Health & Food Biosciences, Home & Personal Care, Animal Nutrition and Grain Processing.\nOur Scent segment creates fragrance compounds and fragrance ingredients that are integral elements in the world’s finest perfumes and best-known household and personal care products. Consumer insights, science and creativity are at the heart of our Scent business, and, along with our unique portfolio of natural and synthetic ingredients, global footprint, innovative technologies and know-how, and customer intimacy, we believe these make us a market leader in scent products. The Scent segment is comprised of Fragrance Compounds and Fragrance Ingredients. We completed the divestiture of our Cosmetic Ingredients business, previously within the Scent segment, on April 2, 2024.\n40\nTable of \nContents\nOur Pharma Solutions segment produced, among other things, a vast portfolio of cellulosics and seaweed-based pharmaceutical excipients, used to improve the functionality and delivery of active pharmaceutical ingredients, including controlled or modified drug release formulations, and enabling the development of more effective pharmaceutical finished dosage formulations. Our excipients are used in prescription and over-the-counter pharmaceuticals and dietary supplements. Our Pharma Solutions products also serve a variety of other specialty and industrial end-uses including coatings, inks, electronics, agriculture and consumer products. During March 2024, we announced the sale process and entered into an agreement to sell the Pharma Solutions business disposal group, that is primarily made up of most businesses within the Company’s existing Pharma Solutions reportable segment. The transaction closed on May 1, 2025. During October 2024, we entered into an agreement to sell the Nitrocellulose disposal group, which was within our existing Pharma Solutions reportable segment. The transaction closed on May 9, 2025. See Note 3 for additional information. As of May 9, 2025, there is no remaining business in the Pharma Solutions reportable segment.\nFinancial Performance Overview\nSales\nSales in the third quarter of 2025 decreased $231 million, or 8% on a reported basis, to $2.694 billion compared to $2.925 billion in the 2024 period. On a comparable currency neutral basis, sales in the third quarter of 2025 remained flat compared to the 2024 period primarily driven by favorable net pricing and volume increases driven by Scent and Taste. Exchange rate variations had a favorable impact. The effect of exchange rates can vary by business and region, depending upon the mix of sales priced in U.S. dollars as compared to other currencies. The divestiture impacts of approximately $282 million were  from the sale of the Pharma Solutions disposal group, Nitrocellulose disposal group, and Flavors & Essences UK (“F&E UK”) (“change in business portfolio mix due to divestitures”). \nGross Profit\nGross profit in the third quarter of 2025 decreased $69 million, or 7%, to $983 million (36.5% of sales) compared to $1.052 billion (36.0% of sales) in the 2024 period. The decrease in gross profit was primarily driven by the change in business portfolio mix due to divestitures of approximately $103 million, offset in part by favorable net pricing and productivity gains.\n41\nTable of \nContents\nRESULTS OF OPERATIONS\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\n \nSeptember 30,\n \n(DOLLARS IN MILLIONS EXCEPT PER SHARE AMOUNTS)\n2025\n2024\nChange\n2025\n2024\nChange\nNet sales\n$\n2,694 \n$\n2,925 \n(8)\n%\n$\n8,301 \n$\n8,713 \n(5)\n%\nCost of sales\n1,711 \n1,873 \n(9)\n%\n5,253 \n5,569 \n(6)\n%\nGross profit\n983 \n1,052 \n(7)\n%\n3,048 \n3,144 \n(3)\n%\nResearch and development (R&D) expenses\n174 \n162 \n7 \n%\n520 \n501 \n4 \n%\nSelling and administrative (S&A) expenses\n421 \n495 \n(15)\n%\n1,365 \n1,478 \n(8)\n%\nAmortization of acquisition-related intangibles\n146 \n146 \n— \n%\n434 \n467 \n(7)\n%\nImpairment of goodwill\n— \n— \n— \n%\n1,153 \n64 \nNMF\nRestructuring and other charges\n16 \n1 \nNMF\n54 \n6 \nNMF\nLosses (gains) on sale of assets \n— \n(1)\n(100)\n%\n1 \n(11)\n(109)\n%\nOperating profit (loss)\n226 \n249 \n(9)\n%\n(479)\n639 \n(175)\n%\nInterest expense\n48 \n74 \n(35)\n%\n180 \n236 \n(24)\n%\nGain on extinguishment of debt\n— \n— \n— \n%\n(488)\n— \nNMF\nLosses (gains) on business disposals\n— \n20 \n(100)\n%\n111 \n(348)\n(132)\n%\nLoss on assets classified as held for sale\n108 \n32 \n238 \n%\n108 \n284 \n(62)\n%\nOther expense, net\n14 \n28 \n(50)\n%\n44 \n44 \n— \n%\nIncome (loss) before income taxes\n56 \n95 \n(41)\n%\n(434)\n423 \n(203)\n%\nProvision (benefit) for income taxes\n15 \n36 \n(58)\n%\n(44)\n96 \n(146)\n%\nNet income (loss)\n$\n41 \n$\n59 \n(31)\n%\n$\n(390)\n$\n327 \n(219)\n%\nNet income attributable to non-controlling interests\n1 \n1 \n— \n%\n2 \n4 \n(50)\n%\nNet income (loss) attributable to IFF shareholders\n$\n40 \n$\n58 \n(31)\n%\n$\n(392)\n$\n323 \n(221)\n%\nNet income (loss) per share - diluted\n$\n0.16 \n$\n0.23 \n(30)\n%\n$\n(1.53)\n$\n1.27 \n(220)\n%\nGross margin\n36.5 \n%\n36.0 \n%\n50 \nbps\n36.7 \n%\n36.1 \n%\n60 \nbps\nR&D as a percentage of sales\n6.5 \n%\n5.5 \n%\n100 \nbps\n6.3 \n%\n5.8 \n%\n50 \nbps\nS&A as a percentage of sales\n15.6 \n%\n16.9 \n%\n(130)\nbps\n16.4 \n%\n17.0 \n%\n(60)\nbps\nOperating margin\n8.4 \n%\n8.5 \n%\n(10)\nbps\n(5.8)\n%\n7.3 \n%\nNMF\nEffective tax rate\n26.8 \n%\n37.9 \n%\nNMF\n10.1 \n%\n22.7 \n%\nNMF\nSegment net sales\nTaste\n$\n635 \n$\n623 \n2 \n%\n$\n1,893 \n$\n1,852 \n2 \n%\nFood Ingredients\n830 \n843 \n(2)\n%\n2,476 \n2,546 \n(3)\n%\nHealth & Biosciences\n577 \n568 \n2 \n%\n1,694 \n1,653 \n2 \n%\nScent\n652 \n613 \n6 \n%\n1,869 \n1,861 \n— \n%\nPharma Solutions\n— \n278 \n(100)\n%\n369 \n801 \n(54)\n%\nConsolidated\n$\n2,694 \n$\n2,925 \n$\n8,301 \n$\n8,713 \n_______________________ \nNMF: Not meaningful\nCost of sales includes the cost of materials and manufacturing expenses. R&D expenses include expenses related to the development of new and improved products and technical product support. S&A expenses include expenses necessary to support our commercial activities and administrative expenses supporting our overall operating activities including compliance with governmental regulations.\n42\nTable of \nContents\nTHIRD QUARTER 2025 IN COMPARISON TO THIRD QUARTER 2024\nSales performance by segment was as follows: \n% Change in Sales - Third Quarter 2025 vs. Third Quarter 2024\nReported\nCurrency Neutral\n(2)\nComparable Currency Neutral\n(1)(2)\nTaste\n2\n \n%\n1\n \n%\n2\n \n%\nFood Ingredients\n-2\n \n%\n-3\n \n%\n-3\n \n%\nHealth & Biosciences\n2\n \n%\n0\n \n%\n0\n \n%\nScent\n6\n \n%\n5\n \n%\n5\n \n%\nTotal\n-8\n \n%\n-9\n \n%\n0\n \n%\nComparable currency neutral reported performance by segment was as follows: \nThree Months Ended September 30,\n \n2025\n2024\nNet Sales\nTaste\n$\n630 \n$\n619 \nFood Ingredients\n817 \n843 \nHealth & Biosciences\n566 \n568 \nScent\n641 \n613 \nImpact of Business Divestitures\n(1)\n— \n282 \nImpact of Currency Fluctuation\n(2)\n40 \n— \nTotal\n$\n2,694 \n$\n2,925 \n_______________________ \n(1)\nComparable portfolio results for 2024 exclude the impact of divestitures. The impact includes the results of the F&E UK business that was divested on September 1, 2024 (for September 2024), and the Pharma Solutions disposal group and Nitrocellulose business that were divested on May 1, 2025 and May 9, 2025, respectively (for July 1, 2024 to September 30, 2024).\n(2)\nCurrency neutral sales are calculated by translating current year invoiced sale amounts at the exchange rates for the corresponding prior year period.\nTaste\nTaste sales in \n2025\n increase\nd $12 million, or 2% on a reported basis, to $635 million compared to $623 million in the prior year period. On a comparable currency neutral basis, Taste sales increased \n2%\n in 2025 compared to the prior year period, primarily driven by price increases. Exchange rate variations had a favorable impact and the impact of the divestiture of the F&E UK business had a sales impact of approximately $4 million.\nFood Ingredients\nFood Ingredients sales in \n2025\n decreased $13 million, or 2% on a reported basis, to $830 million compared to $843 million in the prior year period. On a comparable currency neutral basis, Food Ingredients sales decreased 3% in 2025 compared to the prior year period, primarily driven by volume decreases in Protein Solutions, Emulsifiers & Texturants and Cellulosics & Food Protection business units. Exchange rate variations had a favorable impact. \nHealth & Biosciences\nHealth & Biosciences sales in \n2025\n increased $9 million, or 2% on a reported basis, to $577 million compared to $568 million in the prior year period. On a comparable currency neutral basis, Health & Biosciences sales remained flat in \n2025\n compared to the prior year period, primarily driven by price and volume increases across various business units, offset by volume decreases in the Health business unit. Exchange rate variations had a favorable impact.\nScent\nScent sales in \n2025\n increased $39 million, or 6% on a reported basis, to $652 million compared to $613 million in the prior year period. On a comparable currency neutral basis, Scent sales increased 5% in \n2025\n compared to the prior year period, primarily driven by volume increases in Fine Fragrance. Exchange rate variations had a favorable impact.\n43\nTable of \nContents\nPharma Solutions\nThe Company completed the divestiture of its Pharma Solutions business on May 1, 2025, and its Nitrocellulose business on May 9, 2025. Accordingly, there are no Pharma Solutions segment results reported for the third quarter of 2025.\nCost of Sales\nCost of sales decreased $162 million to $1.711 billion (63.5% of sales) in the third quarter of 2025 compared to $1.873 billion (64.0% of sales) in the third quarter of 2024. The decrease in cost of sales was primarily driven by the change in business portfolio mix due to divestitures, with an impact of approximately $179 million and by lower input costs and manufacturing expenses, lower unfavorable manufacturing absorption compared to the prior year period, offset in part by volume increases in sales.\nResearch and Development (“R&D”) Expenses\nR&D expenses increased $12 million to $174 million (6.5% of sales) in the third quarter of 2025 compared to $162 million (5.5% of sales) in the third quarter of 2024. The increase in R&D expenses was primarily driven by an increase in employee related costs and operating expenses for R&D related activities, offset by the change in business portfolio mix due to divestitures, with an impact of approximately $2 million. \nSelling and Administrative (“S&A”) Expenses\nS&A expenses decreased $74 million to $421 million (15.6% of sales) in the third quarter of 2025 compared to $495 million (16.9% of sales) in the third quarter of 2024. The decrease in S&A expenses was primarily driven by a decrease in the incentive compensation expense and lower consulting fees incurred in relation to business divestitures.\nAmortization of Acquisition-Related Intangibles\nAmortization expenses remained flat at $146 million in the third quarter of 2025 and 2024. \nRestructuring and Other Charges\nRestructuring and other charges increased to $16 million in the third quarter of 2025 compared to $1 million in the third quarter of 2024. The increase was driven by higher severance costs incurred as part of the IFF Productivity Program. See Note 4 for additional information.\nInterest Expense\nInterest expense decreased to $48 million in the third quarter of 2025 compared to $74 million in the third quarter of 2024. The decrease in interest expense was due to lower debt outstanding. See Note 13 for additional information.\nLosses (Gains) on Business Disposals\nThere were no Losses (Gains) on business disposals in the third quarter of 2025 compared to $20 million in the third quarter of 2024. The loss recognized in 2024 related to the F&E UK divestiture. See Note 3 for additional information.\nLoss on Assets Classified as Held for Sale\nThere was a $108 million loss on assets classified as held for sale in the third quarter of 2025 compared to $32 million in the third quarter of 2024. The loss in 2025 related to assets classified as held for sale for the Soy Crush, Concentrates & Lecithin business. The loss in 2024 related to assets classified as held for sale for the Pharma Solutions disposal group and the portion of the Savory Solutions business in Turkey. See Note 3 for additional information.\nOther Expense, Net\nOther expense, net, decreased to $14 million in the third quarter of 2025 compared to $28 million in the third quarter of 2024. The decrease of $14 million was primarily due to lower foreign exchange losses. See Note 8 for additional information.\nIncome Taxes\nThe effective tax rate for the three months ended September 30, 2025 was 26.8% compared to 37.9% for the three months ended September 30, 2024. The decrease was primarily driven by the tax impacts resulting from the entity realignment project, business divestitures and changes in the mix of earnings following the divestitures.\n44\nTable of \nContents\nSegment Adjusted Operating EBITDA Results by Business Unit\nThe Company uses Segment Adjusted Operating EBITDA for internal reporting and performance measurement purposes. Segment Adjusted Operating EBITDA is defined as Income Before Taxes before depreciation and amortization expense, interest expense, restructuring and other charges and certain items that are not related to recurring operations. Our determination of reportable segments was made on the basis of our strategic priorities within each segment and corresponds to the manner in which our Chief Operating Decision Maker reviews and evaluates operating performance to make decisions about resources to be allocated to the segment. In addition to our strategic priorities, segment reporting is also based on differences in the products and services we provide.\nAdjusted Operating EBITDA performance by segment was as follows: \n% Change in Adjusted Operating EBITDA - Third Quarter 2025 vs. Third Quarter 2024\nReported\nComparable Currency Neutral Adjusted\n(1)(2)(3)\nTaste\n-1\n \n%\n2\n \n%\nFood Ingredients\n16\n \n%\n24\n \n%\nHealth & Biosciences\n-1\n \n%\n3\n \n%\nScent\n5\n \n%\n6\n \n%\nTotal\n-9\n \n%\n7\n \n%\n45\nTable of \nContents\nComparable Currency Neutral Adjusted Operating EBITDA by segment was as follows:\n \nThree Months Ended September 30,\n(DOLLARS IN MILLIONS)\n2025\n2024\nSegment Comparable Currency Neutral Adjusted Operating EBITDA\n(1)\n:\nTaste\n$\n127 \n$\n124 \nFood Ingredients\n109 \n88 \nHealth & Biosciences\n154 \n149 \nScent\n133 \n126 \nImpact of Business Divestitures\n(2)\n— \n81 \nImpact of Currency Fluctuation\n(3)\n(4)\n— \nTotal\n519 \n568 \nDepreciation & Amortization\n(247)\n(248)\nInterest Expense\n(48)\n(74)\nOther Expense, net\n(14)\n(28)\nRestructuring and Other Charges\n(16)\n(1)\nGains (Losses) on Business Disposals\n— \n(20)\nLoss on Assets Classified as Held for Sale\n(108)\n(32)\nDivestiture and Integration Costs\n(13)\n(55)\nStrategic Initiatives Costs\n(10)\n(6)\nRegulatory Costs\n(7)\n(10)\nEntity Realignment Costs \n(1)\n— \nOther\n1 \n1 \nIncome (Loss) Before Taxes\n$\n56 \n$\n95 \nSegment Comparable Currency Neutral Adjusted Operating EBITDA Margin:\nTaste\n20.2 \n%\n20.0 \n%\nFood Ingredients\n13.3 \n%\n10.4 \n%\nHealth & Biosciences\n27.2 \n%\n26.2 \n%\nScent\n20.7 \n%\n20.6 \n%\nConsolidated\n19.3 \n%\n19.4 \n%\n_____________________ \n(1)\nRefer to Note 6 for a reconciliation of Adjusted Operating EBITDA to Income (Loss) Before Taxes.\n(2)\nComparable portfolio results for 2024 exclude the impact of divestitures. Impact of business divestitures includes the results of the F&E UK business that was divested on September 1, 2024 (for September 2024), and the Pharma Solutions disposal group and Nitrocellulose business that were divested on May 1, 2025 and May 9, 2025, respectively (for July 1, 2024 to September 30, 2024).\n(3)\nCurrency neutral amounts are calculated by translating current year transaction amounts at the exchange rates for the corresponding prior year period.\nFollowing the completed divestitures of the Pharma Solutions disposal group on May 1, 2025 and the Nitrocellulose business on May 9, 2025, the Company reallocated certain corporate costs previously attributed to the Pharma Solutions segment. These costs have been redistributed across the Taste, Food Ingredients, Health & Biosciences, and Scent segments for comparability purposes.\n46\nTable of \nContents\nThree Months Ended September 30, 2024\nSelling & Administrative Expenses\nTotal EBITDA Impact\nTaste\n$\n2 \n$\n(2)\nFood Ingredients\n4 \n(4)\nHealth & Biosciences\n3 \n(3)\nScent\n2 \n(2)\nTotal\n$\n11 \n$\n(11)\nTaste Segment Adjusted Operating EBITDA \nTaste Segment Adjusted Operating EBITDA decreased $1 million, or 1% on a reported basis, to $128 million in the third quarter of 2025 (20.2% of segment sales) from $129 million (20.7% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Taste Segment Adjusted Operating EBITDA increased 2% in 2025 compared to the prior year period, which was primarily driven by favorable net pricing. The divestiture of the F&E UK business had an impact of approximately $5 million, offset by favorable impact of exchange rate variations.\nFood Ingredients Segment Adjusted Operating EBITDA\nFood Ingredients Segment Adjusted Operating EBITDA increased $15 million, or 16% on a reported basis, to $106 million in the third quarter of 2025 (12.8% of segment sales) from $91 million (10.8% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Food Ingredients Segment Adjusted Operating EBITDA increased 24% in 2025 compared to the prior year period, which was primarily driven by productivity gains and favorable net pricing. \nHealth & Biosciences Segment Adjusted Operating EBITDA\nHealth & Biosciences Segment Adjusted Operating EBITDA decreased $2 million, or 1% on a reported basis, to $150 million in the third quarter of 2025 (26.0% of segment sales) from $152 million in the comparable 2024 period (26.8% of segment sales). On a comparable currency neutral basis, Health & Biosciences Segment Adjusted Operating EBITDA increased 3% in 2025 compared to the prior year period, which was primarily driven by productivity gains.\nScent Segment Adjusted Operating EBITDA\nScent Segment Adjusted Operating EBITDA increased $7 million, or 5% on reported basis, to $135 million in the third quarter of 2025 (20.7% of segment sales) from $128 million (20.9% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Scent Segment Adjusted Operating EBITDA increased 6% in 2025 compared to the prior year period, which was primarily driven by volume increases.\nPharma Solutions Segment Adjusted Operating EBITDA\nThe Company completed the divestiture of its Pharma Solutions business on May 1, 2025, and its Nitrocellulose business on May 9, 2025. Accordingly, there are no Pharma Solutions segment results reported for the third quarter of 2025.\n47\nTable of \nContents\nFIRST NINE MONTHS 2025 IN COMPARISON TO FIRST NINE MONTHS 2024\nSales\nSales for the first nine months of 2025 decreased $412 million, or 5% on a reported basis, to $8.301 billion compared to $8.713 billion in the 2024 period. On a comparable currency neutral basis, sales for the first nine months of 2025 increased 2% compared to the 2024 period. Exchange rate variations had an unfavorable impact on net sales in the first nine months of 2025 of 1%. The effect of exchange rates can vary by business and region, depending upon the mix of sales priced in U.S. dollars as compared to other currencies. In addition, the decrease in sales was primarily driven by the change in business portfolio mix due to divestitures which was approximately $506 million, offset in part by volume increases across various business lines.\nSales Performance by Segment\n \n% Change in Sales - First Nine Months 2025 vs. First Nine Months 2024\nReported\nCurrency Neutral\n(2)\nComparable Currency Neutral\n(1)(2)\nTaste\n2\n \n%\n4\n \n%\n5\n \n%\nFood Ingredients\n-3\n \n%\n-2\n \n%\n-2\n \n%\nHealth & Biosciences\n2\n \n%\n3\n \n%\n3\n \n%\nScent\n0\n \n%\n2\n \n%\n3\n \n%\nPharma Solutions\n-54\n \n%\n-53\n \n%\n12\n \n%\nTotal\n-5\n \n%\n-4\n \n%\n2\n \n%\nComparable currency neutral reported performance by segment was as follows: \nNine Months Ended September 30,\n \n2025\n2024\nNet Sales\nTaste\n$\n1,922 \n$\n1,837 \nFood Ingredients\n2,490 \n2,546 \nHealth & Biosciences\n1,698 \n1,653 \nScent\n1,895 \n1,834 \nPharma Solutions\n376 \n337 \nImpact of Business Divestitures\n(1)\n— \n506 \nImpact of Currency Fluctuation\n(2)\n(80)\n— \nTotal\n$\n8,301 \n$\n8,713 \n_______________________\n(1)\nImpact of business divestitures includes the results of the F&E UK business that was divested on September 1, 2024 (for September 2024), the Cosmetic Ingredients business that was divested on April 2, 2024 (for April 2, 2024 to September 30, 2024), and the Pharma Solutions disposal group and Nitrocellulose business that were divested on May 1, 2025 and May 9, 2025, respectively (for July 1, 2024 to September 30, 2024).\n(2)\nCurrency neutral sales are calculated by translating current year invoiced sale amounts at the exchange rates for the corresponding prior year period.\nTaste\nTaste sales in 2025 increased $41 million, or 2% on a reported basis, to $1.893 billion compared to $1.852 billion in the prior year period. On a comparable currency neutral basis, Taste sales increased 5% in 2025 compared to the prior year period, driven by volume increases and favorable net pricing across all business units. Exchange rate variations had an unfavorable impact and the impact of the divestiture of the F&E UK business was approximately $15 million.\nFood Ingredients\nFood Ingredients sales in 2025 decreased $70 million, or 3% on a reported basis, to $2.476 billion compared to $2.546 billion in the prior year period. On a comparable currency neutral basis, Food Ingredients sales decreased 2% in 2025 compared to the prior year period, primarily driven by volume decreases and unfavorable net pricing. Exchange rates variations had an unfavorable impact.\n48\nTable of \nContents\nHealth & Biosciences\nHealth & Biosciences sales in 2025 increased $41 million, or 2% on a reported basis, to $1.694 billion compared to $1.653 billion in the prior year period. On a comparable currency neutral basis, Health & Biosciences sales increased 3% in 2025 compared to the prior year period, primarily driven by price and volume increases. Exchange rate variations had an unfavorable impact.\nScent\nScent sales in 2025 remained flat at $1.869 billion compared to $1.861 billion in the prior year period. On a comparable currency neutral basis, Scent sales increased 3% in 2025 compared to the prior year period, primarily driven by price and volume increases in the Fine Fragrances business unit. Exchange rate variations had an unfavorable impact and the divestiture of the Cosmetic Ingredients business had a sales impact of approximately $27 million.\nPharma Solutions\nPharma Solutions sales in 2025 decreased $432 million, or 54% on a reported basis, to $369 million compared to $801 million in the prior year period. On a comparable currency neutral basis, Pharma Solutions sales increased 12% in 2025 compared to the prior year period, driven by volume and price increases. The impact of exchange rate variations had an unfavorable impact and the divestitures of the Pharma Solutions disposal group and Nitrocellulose disposal group had a sales impact of approximately $464 million. This comparison reflects nine months of contributions from both businesses in 2024, whereas 2025 includes only four months of activity prior to the divestitures, contributing significantly to the year-over-year decline.\nCost of sales\nCost of sales decreased $316 million to $5.253 billion (63.3% of sales) in the first nine months of 2025 compared to $5.569 billion (63.9% of sales) in the 2024 period. The decrease in cost of sales was primarily driven by the change in business portfolio mix due to divestitures which was approximately $320 million.\nResearch and Development (“R&D”) Expenses\nR&D expenses increased $19 million to $520 million (6.3% of sales) in the first nine months of 2025 compared to $501 million (5.8% of sales) in the 2024 period. The increase in R&D expenses was primarily driven by an increase in employee related costs and operating expenses for R&D related activities, offset the change in business portfolio mix due to divestitures, with an impact of approximately $13 million.\nSelling and Administrative (“S&A”) Expenses\nS&A expenses decreased $113 million to $1,365 million (16.4% of sales) in the first nine months of 2025 compared to $1.478 billion (17.0% of sales) in the 2024 period. The decrease in S&A expenses was primarily driven by a decrease in incentive compensation expense, lower consulting fees and professional and legal fees incurred in relation to business divestitures.\nAmortization of Acquisition-Related Intangibles\nAmortization expenses decreased to $434 million in the first nine months of 2025 compared to $467 million in the 2024 period. The decrease in amortization expense was primarily driven by the intangible assets of the Pharma Solutions disposal group being classified as “held for sale,” and therefore no longer recognizing amortization expense on those intangible assets. See Note 3 for additional information.\nImpairment of Goodwill\nThe impairment of goodwill was $1.153 billion in the first nine months of 2025 compared to $64 million in the 2024 period. The 2025 impairment of goodwill was related to the Food Ingredients reporting unit, and the 2024 impairment of goodwill was related to the Pharma Solutions disposal group. See Note 3 for additional information.\nRestructuring and Other Charges\nRestructuring and other charges increased to $54 million in the first nine months of 2025 compared to $6 million in the 2024 period. The increase was driven by higher severance costs incurred as part of the IFF Productivity Program in 2025. See Note 4 for additional information.\nInterest Expense\nInterest expense decreased to $180 million in the first nine months of 2025 compared to $236 million in the 2024 period. The decrease in interest expense was due to lower debt outstanding. See Note 13 for additional information.\n49\nTable of \nContents\nGain on Extinguishment of Debt \nGain on extinguishment of debt was $488 million in the first nine months of 2025 due to the repurchase of approximately $2.5 billion of notes for approximately $2.0 billion in cash. See Note 13 for additional information.\nLosses (Gains) on Business Disposals\nLosses (gains) on business disposals was $111 million in the first nine months of 2025 compared to $(348) million in the 2024 period. The net loss in 2025 was primarily driven by the Pharma Solutions disposal group and Nitrocellulose business divestitures, while the gain recognized in 2024 related to the Cosmetic Ingredients business divestiture, offset in part by the loss recognized on the sale of the F&E UK business. See Note 3 for additional information.\nLoss on Assets Classified as Held for Sale\nThere was a $108 million loss on assets classified as held for sale in the first nine months of 2025 compared to $284 million in the nine months ended September 30, 2024. The loss in 2025 related to assets classified as held for sale for the Soy Crush, Concentrates & Lecithin business. The loss in 2024 related to assets classified as held for sale for the Pharma Solutions disposal group and the portion of the Savory Solutions business in Turkey. See Note 3 for additional information.\nOther Expense, Net\nOther expense, net, remained flat at $44 million in the first nine months of 2025 and in the 2024 period. See Note 8 for additional information.\nIncome Taxes\nThe effective tax rate for the nine months ended September 30, 2025 was 10.1% compared to 22.7% for the nine months ended September 30, 2024. The decrease was primarily driven by the tax impacts resulting from the entity realignment project, business divestitures and changes in the mix of earnings following the divestitures.\nSegment Adjusted Operating EBITDA Results by Business Unit\nThe Company uses Segment Adjusted Operating EBITDA for internal reporting and performance measurement purposes. Segment Adjusted Operating EBITDA is defined as Income Before Taxes before depreciation and amortization expense, interest expense, restructuring and other charges and certain items that are not related to recurring operations. Our determination of reportable segments was made on the basis of our strategic priorities within each segment and corresponds to the manner in which our Chief Operating Decision Maker reviews and evaluates operating performance to make decisions about resources to be allocated to the segment. In addition to our strategic priorities, segment reporting is also based on differences in the products and services we provide.\nAdjusted Operating EBITDA performance by segment was as follows: \n% Change in Adjusted Operating EBITDA - First Nine Months 2025 vs. First Nine Months 2024\nReported\nComparable Currency Neutral Adjusted\n(1)(2)(3)\nTaste\n3\n \n%\n8\n \n%\nFood Ingredients\n11\n \n%\n17\n \n%\nHealth & Biosciences\n—\n \n%\n3\n \n%\nScent\n-7\n \n%\n2\n \n%\nPharma Solutions\n-56\n \n%\n16\n \n%\nTotal\n-5\n \n%\n7\n \n%\n50\nTable of \nContents\nComparable Currency Neutral Adjusted Operating EBITDA by segments was as follows:\n \nNine Months Ended September 30,\n(DOLLARS IN MILLIONS)\n2025\n2024\nSegment Comparable Currency Neutral Adjusted Operating EBITDA\n(1)\n:\nTaste\n$\n394 \n$\n364 \nFood Ingredients\n353 \n302 \nHealth & Biosciences\n450 \n436 \nScent\n431 \n421 \nPharma Solutions\n79 \n68 \nImpact of Business Divestitures\n(2)\n— \n143 \nImpact of Currency Fluctuation\n(3)\n(58)\n— \nTotal\n1,649 \n1,734 \nDepreciation & Amortization\n(725)\n(772)\nInterest Expense\n(180)\n(236)\nOther Expense, net\n(44)\n(44)\nRestructuring and Other Charges\n(54)\n(6)\nImpairment of Goodwill\n(1,153)\n(64)\nGains (Losses) on Business Disposals\n(111)\n348 \nLoss on Assets Classified as Held for Sale\n(108)\n(284)\nDivestiture and Integration Costs\n(90)\n(172)\nStrategic Initiatives Costs\n(24)\n(22)\nGain on Debt Extinguishment \n488 \n— \nEntity Realignment Costs\n(5)\n(3)\nRegulatory Costs\n(71)\n(64)\nOther\n(6)\n8 \nIncome (Loss) Before Taxes\n$\n(434)\n$\n423 \nSegment Comparable Currency Neutral Adjusted Operating EBITDA Margin:\nTaste\n20.5 \n%\n19.8 \n%\nFood Ingredients\n14.2 \n%\n11.9 \n%\nHealth & Biosciences\n26.5 \n%\n26.4 \n%\nScent\n22.7 \n%\n23.0 \n%\nPharma Solutions\n21.0 \n%\n20.2 \n%\nConsolidated\n19.9 \n%\n19.9 \n%\n_____________________ \n(1)\nRefer to Note 6 for a reconciliation of Adjusted Operating EBITDA to Income (Loss) Before Taxes.\n(2)\nComparable portfolio results for 2024 exclude the impact of divestitures. Impact of business divestitures includes the results of the F&E UK business that was divested on September 1, 2024 (for September 2024), and the Pharma Solutions disposal group and Nitrocellulose business that were divested on May 1, 2025 and May 9, 2025, respectively (for May 1, 2024 to September 30, 2024 and May 9, 2024 to September 30, 2024, respectively).\n(3)\nCurrency neutral amounts are calculated by translating current year transaction amounts at the exchange rates for the corresponding prior year period.\nFollowing the completed divestitures of the Pharma Solutions disposal group on May 1, 2025 and the Nitrocellulose business on May 9, 2025, the Company reallocated certain corporate costs previously attributed to the Pharma Solutions segment. These costs have been redistributed across the Taste, Food Ingredients, Health & Biosciences, and Scent segments for comparability purposes.\n51\nTable of \nContents\nNine Months Ended September 30, 2024\nSelling & Administrative Expenses\nResearch & Development Expenses\nTotal EBITDA Impact\nTaste\n$\n4 \n$\n— \n$\n(4)\nFood Ingredients\n6 \n— \n(6)\nHealth & Biosciences\n4 \n1 \n(5)\nScent\n3 \n1 \n(4)\nTotal\n$\n17 \n$\n2 \n$\n(19)\nTaste Segment Adjusted Operating EBITDA\nTaste Segment Adjusted Operating EBITDA increased $11 million, or 3% on a reported basis, to $384 million in the first nine months of 2025 (20.3% of segment sales) from $373 million (20.1% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Taste Segment Adjusted Operating EBITDA increased 8% in 2025 compared to the prior year period, primarily driven by volume increases and favorable net pricing.\nFood Ingredients Segment Adjusted Operating EBITDA\nFood Ingredients Segment Adjusted Operating EBITDA increased $33 million, or 11% on a reported basis, to $341 million in the first nine months of 2025 (13.8% of segment sales) from $308 million (12.1% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Food Ingredients Segment Adjusted Operating EBITDA increased 17% in 2025 compared to the prior year period, primarily driven by productivity gains offset by unfavorable net pricing and volume decreases.\nHealth & Biosciences Segment Adjusted Operating EBITDA\nHealth & Biosciences Segment Adjusted Operating EBITDA remained flat on a reported basis, at $439 million in the first nine months of 2025 (25.9% of segment sales) and $441 million in the comparable 2024 period (26.7% of segment sales). On a comparable currency neutral basis, Health & Biosciences Segment Adjusted Operating EBITDA increased 3% in 2025 compared to the prior year period, primarily driven by productivity gains and volume increases.\nScent Segment Adjusted Operating EBITDA\nScent Segment Adjusted Operating EBITDA decreased $30 million, or 7% on a reported basis, to $409 million in the first nine months of 2025 (21.9% of segment sales) from $439 million (23.6% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Scent Segment Adjusted Operating EBITDA increased 2% in 2025 compared to the prior year period, primarily driven by strong performances in Fine Fragrances, partially offset by volume declines in Fragrance Ingredients. Comparable portfolio results exclude the impact of the divestiture of the Cosmetic Ingredients business with an Adjusted Operating EBITDA impact of approximately $14 million. \nPharma Solutions Segment Adjusted Operating EBITDA\nPharma Solutions Segment Adjusted Operating EBITDA decreased $97 million, or 56% on a reported basis, to $76 million in the first nine months of 2025 (20.6% of segment sales) from $173 million (21.6% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Pharma Solutions Segment Adjusted Operating EBITDA increased 16% in 2025 compared to the prior period. The divestitures of the Pharma Solutions disposal group and Nitrocellulose business had an impact on Adjusted Operating EBITDA of approximately $105 million. This comparison reflects three full quarters of contributions from both businesses in 2024, whereas 2025 includes only four months of activity prior to the divestitures, contributing significantly to the year-over-year decline.\nLiquidity\nCash and Cash Equivalents\nWe had cash and cash equivalents of $621 million on the Consolidated Balance Sheets at September 30, 2025 compared to \n$471 million\n, inclusive of $2 million in Assets held for sale on the Consolidated Balance Sheets, at December 31, 2024. A portion of this balance was held outside the United States. Cash balances held in foreign jurisdictions are, in most circumstances, available to be repatriated to the United States.\n52\nTable of \nContents\nEffective utilization of the cash generated by our international operations is a critical component of our strategy. We regularly repatriate cash from our non-U.S. subsidiaries to fund financial obligations in the U.S. As we repatriate these funds tothe U.S., there will be required income taxes payable in certain U.S. states and applicable foreign withholding taxes during the period when such repatriation occurs. Accordingly, as of September 30, 2025, we had a deferred tax liability of approximately $144 million for the effect of repatriating the funds to the U.S., attributable to various non-U.S. subsidiaries. There is no deferred tax liability associated with non-U.S. subsidiaries where we intend to indefinitely reinvest the earnings to fund local operations and/or capital projects.\nCash Flows Provided By Operating Activities\nCash flows provided by operating activities for the nine months ended September 30, 2025 were $532 million, or 6.4% of sales, compared to $681 million, or 7.8% of sales, for the nine months ended September 30, 2024. The decrease in cash flows from operating activities during 2025 was primarily driven by the increase in working capital, largely related to inventories, accruals for incentive compensation, offset in part by accounts receivables and accounts payable, excluding the impact of non-cash adjustments.\nCash Flows Provided By Investing Activities\nCash flows provided by investing activities for the nine months ended September 30, 2025 were $2.426 billion compared to $607 million in the prior year period. The increase in cash flows provided by investing activities during 2025 was primarily driven by higher net proceeds received from the divestitures of the Pharma Solutions disposal group, Nitrocellulose business and the Tobacco Flavoring business in North America, compared to the net proceeds received during 2024 primarily from the divestiture of the Cosmetic Ingredients business. This increase was offset in part by higher spending on property, plant and equipment during 2025 compared to 2024.\nWe expect that capital spending in 2025 will be approximately 5.5% of sales, up from approximately 4.0% in 2024.\nCash Flows Used In Financing Activities\nCash flows used in financing activities for the nine months ended September 30, 2025 were $2.891 billion compared to $1.444 billion in the prior year period. The increase in cash flows used in financing activities was primarily driven by Company’s purchase for cash of certain of its outstanding series of Senior Notes for an aggregate purchase price of $2.0 billion, excluding accrued and unpaid interest. The Company also repaid the remaining borrowings under both the 2026 Term Loan Facility and the 2025 Notes during the period. These outflows were partially offset by an increase in commercial paper borrowings during the nine months ended September 30, 2025.\nWe paid dividends totaling $306 million in the 2025 period. We declared a cash dividend per share of $0.40 in the third quarter of 2025 that was paid on October 10, 2025 to all shareholders of record as of September 29, 2025.\nOur capital allocation strategy seeks to maintain investment grade ratings while investing in the business, continuing to pay dividends, repurchasing shares outstanding and repaying debt. The Company does not have any rating downgrade triggers that would accelerate the maturity dates of its senior unsecured debt. However, any downgrade in our credit rating may, depending on the extent of such downgrade, negatively impact our ability to raise additional debt capital, our liquidity and capital position, and may increase our cost of borrowing for new capital raises. In addition, our existing Revolving Credit Facility has pricing grids that are based on credit rating, such that our cost of borrowing may increase as our credit rating decreases. We make capital investments in our businesses to support our operational needs and strategic long-term plans. We are committed to maintaining our history of paying a dividend to investors which is determined by our Board of Directors at its discretion based on various factors.\nCapital Resources\nOperating cash flow provides the primary source of funds for capital investment needs, dividends paid to shareholders and debt service repayments. We anticipate that cash flows from operations, cash proceeds generated from planned business divestitures and availability under our existing credit facilities will be sufficient to meet our investing and financing needs, including our debt service requirements for the foreseeable future. We regularly assess our capital structure, including both current and long-term debt instruments, as compared to our cash generation and investment needs in order to provide ample flexibility and to optimize our leverage ratios. See Note 13 for additional information.\n53\nTable of \nContents\nRevolving Credit Facility\nOur Revolving Credit Agreement contains various covenants, limitations and events of default customary for similar facilities for similarly rated borrowers, including the requirement for us to maintain, at the end of each fiscal quarter, a ratio of net debt to credit adjusted EBITDA in respect of the previous 12-month period. Borrowings under the Revolving Credit Facility are subject to interest at varying spreads above quoted market rates and a commitment fee is paid on the total unused borrowings. \nOn June 25, 2025, the Company, with its lenders, entered into the Fourth Amended and Restated Credit Agreement (“Revolving Credit Agreement”), which amended and restated the most recent Amendment No. 4 to the Third Amended and Restated Credit Agreement dated September 19, 2023. This amendment and restatement, among other things, extended the termination date to June 25, 2030, as well as removed the financial covenant relief period and associated restrictions. \nThe Revolving Credit Agreement states that from the effective date through September 30, 2025, our net debt to credit adjusted EBITDA ratio shall not exceed 4.00x, and shall not exceed 3.75x thereafter, with a temporary step-up to 4.25x permitted for three fiscal quarters following an acquisition exceeding $500 million in paid consideration.\nAs of September 30, 2025, we had no outstanding borrowings under our $2 billion Revolving Credit Facility. The amount that we are able to draw down under the Revolving Credit Facility is limited by financial covenants as described in more detail below. As of September 30, 2025, our available capacity was $2 billion under the Revolving Credit Facility.\nRefer to Note 13 of this Form 10-Q and Part IV, Item 15, “Exhibits and Financial Statement Schedules,” Note 14 of our 2024 Form 10-K for additional information.\nDebt Covenants\nAt September 30, 2025, the Company was in compliance with all financial and other covenants, including the net debt to credit adjusted EBITDA\n(1)\n ratio. At September 30, 2025, our net debt to credit adjusted EBITDA\n(1)\n ratio was 2.53 to 1.0 as defined by the credit facility agreements, which is below the relevant level provided by our financial covenants of existing outstanding debt.\n_______________________ \n(1)\nCredit adjusted EBITDA and net debt, which are non-GAAP measures used for these covenants, are calculated in accordance with the definition in the debt agreements. In this context, these measures are used solely to provide information on the extent to which we are in compliance with debt covenants and may not be comparable to credit adjusted EBITDA and net debt used by other companies. Reconciliations of credit adjusted EBITDA to net loss and net debt to total debt are as follows:\n(DOLLARS IN MILLIONS)\nTwelve Months Ended September 30, 2025\nNet loss\n$\n(450)\nInterest expense\n249 \nIncome taxes\n(99)\nDepreciation and amortization\n968 \nSpecified items\n(1)\n1,015 \nNon-cash items\n(2)\n472 \nCredit Adjusted EBITDA\n$\n2,155 \n_______________________ \n(1)\nSpecified items consisted of restructuring and other charges, impairment of goodwill, divestiture and integration costs, strategic initiatives costs, regulatory costs, gain on debt extinguishment, entity realignment costs and other costs that are not related to recurring operations.\n(2)\nNon-cash items consisted of losses on business disposals, loss on assets classified as held for sale, pension termination losses, and stock-based compensation.\n54\nTable of \nContents\n(DOLLARS IN MILLIONS)\nSeptember 30, 2025\nTotal debt\n(1)\n$\n6,081 \nAdjustments:\nCash and cash equivalents\n621 \nNet debt\n$\n5,460 \n_______________________\n(1)\nTotal debt used for the calculation of net debt consisted of short-term debt, long-term debt, short-term finance lease obligations and long-term finance lease obligations.\nSenior Notes\nAs of September 30, 2025, we had $5.636 billion aggregate principal amount outstanding in senior unsecured notes, with $939 million principal amount denominated in EUR and $4.697 billion principal amount denominated in USD. The notes bear effective interest rates ranging from 1.56% per year to 5.12% per year, with maturities from September 25, 2026 to December 1, 2050. See Note 13 for additional information.\nContractual Obligations\nWe expect to contribute a total of $5 million to our U.S. pension plans and a total of $22 million to our non-U.S. pension plans during 2025. During the nine months ended September 30, 2025, $17 million of contributions were made to the non-U.S. pension plans and $3 million of contributions were made with respect to the non-qualified U.S. pension plans. We also expect to contribute $4 million to our postretirement benefits other than pension plans during 2025. During the nine months ended September 30, 2025, $2 million of benefit payments were made to postretirement benefits other than pension plans.\nAs discussed in Note 17 to the Consolidated Financial Statements, at September 30, 2025, we had entered into various guarantees and had undrawn outstanding letters of credit from financial institutions. These arrangements reflect ongoing business operations, including commercial commitments, and governmental requirements associated with audits or litigation that are in process with various jurisdictions. Based on the current facts and circumstances, these arrangements are not reasonably likely to have a material impact on our consolidated financial condition, results of operations or cash flows.\nNew Accounting Standards\nRefer to Note 1 to the Consolidated Financial Statements for a discussion of recent accounting pronouncements.\nNon-GAAP Financial Measures\nWe use non-GAAP financial measures in this Form 10-Q, including: (i) comparable currency neutral metrics, (ii) adjusted operating EBITDA and comparable adjusted operating EBITDA, (iii) adjusted operating EBITDA margin, and (iv) net debt to credit adjusted EBITDA. We also provide the non-GAAP measure net debt solely for the purpose of providing information on the extent to which the Company is in compliance with debt covenants contained in its debt agreements. Our non-GAAP financial measures are defined below.\nThese non-GAAP financial measures are intended to provide additional information regarding our underlying operating results and comparable year-over-year performance. Such information is supplemental to information presented in accordance with GAAP and is not intended to represent a presentation in accordance with GAAP. In discussing our historical and expected future results and financial condition, we believe it is meaningful for investors to be made aware of and to be assisted in a better understanding of, on a period-to-period comparable basis, financial amounts both including and excluding these identified items, as well as the impact of exchange rate fluctuations. These non-GAAP measures should not be considered in isolation or as substitutes for analysis of the Company’s results under GAAP and may not be comparable to other companies’ calculation of such metrics.\nCurrency neutral metrics eliminate the effects that result from translating non-U.S. currencies to U.S. dollars. We calculate currency neutral numbers by translating current year invoiced sale amounts at the exchange rates used for the corresponding prior year period. We use currency neutral results in our analysis of segment performance. We also use currency neutral numbers when analyzing our performance against our competitors.\nComparable results for the three months and nine months ended September 30, 2024 exclude the impact of divestitures.\nAdjusted operating EBITDA and adjusted operating EBITDA margin exclude depreciation and amortization, interest expense, other expense, net, and certain non-recurring or unusual items that are not part of recurring operations such as, impairment of goodwill, restructuring and other charges, divestiture and integration related costs, strategic initiatives costs, regulatory costs, gain on debt extinguishment, entity realignment costs and other costs that are not related to recurring operations.\n55\nTable of \nContents\nNet debt to credit adjusted EBITDA is the leverage ratio used in our credit agreements and defined as net debt (which is debt less cash and cash equivalents) divided by the trailing 12-month credit adjusted EBITDA. Credit adjusted EBITDA is defined as income (loss) before interest expense, income taxes, depreciation and amortization, specified items and non-cash items.\nCautionary Statement Under the Private Securities Litigation Reform Act of 1995\nStatements in this Form 10-Q, which are not historical facts or information, are “forward-looking statements” within the meaning of The Private Securities Litigation Reform Act of 1995. Such forward-looking statements are based on management’s current assumptions, estimates and expectations, including those concerning (i) expected cash flow and availability of capital resources to fund our operations and meet our debt service requirements; (ii) our ability to execute on our strategic and financial transformation, including the progress and success of our portfolio optimization strategy, through non-core business divestitures and acquisitions, and expectations regarding the implementation of our refreshed growth-focused strategy and expectations around our business divestitures; (iii) our ability to continue to generate value for, and return cash to, our shareholders; (iv) expectations of the impact of inflationary pressures and the pricing actions to offset exposure to such impacts; (v) expectations regarding the impact of government actions including tariffs; (vi) the impact of high input costs, including commodities, raw materials, transportation and energy; (vii) the expected impact of global supply chain challenges; (viii) our ability to enhance our innovation efforts, drive cost efficiencies and execute on specific consumer trends and demands; (ix) the growth potential of the markets in which we operate, including the emerging markets; (x) expectations regarding sales and profit for the fiscal year 2025, including the impact of foreign exchange, pricing actions, raw materials, energy, and sourcing, logistics and manufacturing costs; (xi) the impact of global economic uncertainty and recessionary pressures on demand for consumer products; (xii) the success of our integration efforts, following acquisitions and ability to deliver on our synergy commitments as well as future opportunities for the combined company; (xiii) our strategic investments in capacity and increasing inventory to drive improved profitability; (xiv) our ability to drive cost discipline measures and the ability to recover margin to pre-inflation levels; (xv) expected capital expenditures in 2025; (xvi) statements regarding the anticipated amount, duration, methods, timing, term and other aspects of our repurchase programs and any anticipated benefits or value resulting from such programs; and (xvii) the expected costs and benefits of our ongoing optimization of our manufacturing operations, including the expected number of closings. These forward-looking statements should be evaluated with consideration given to the many risks and uncertainties inherent in our business that could cause actual results and events to differ materially from those in the forward-looking statements. Certain of such forward-looking information may be identified by such terms as “expect”, “anticipate”, “believe”, “intend”, “outlook”, “may”, “estimate”, “should”, “predict”, “plan”, “project”, “could”, and similar terms or variations thereof. Such forward-looking statements are based on a series of expectations, assumptions, estimates and projections about the Company, are not guarantees of future results or performance, and involve significant risks, uncertainties and other factors, including assumptions and projections, for all forward periods. Our actual results may differ materially from any future results expressed or implied by such forward-looking statements. Such risks, uncertainties and other factors include, among others, the following:\n•\nour substantial amount of indebtedness and its impact on our liquidity, credit rating and ability to return capital to its shareholders;\n•\nour ability to successfully execute our strategic transformation;\n•\nthe impact of regulatory, consumer, and economic trends for consumer products;\n•\nthe impact of the outcomes of legal claims, disputes, regulatory investigations and litigation;\n•\nsupply chain disruptions, geopolitical developments, climate change events, natural disasters, public health crises, tariffs and trade wars, and other events that may affect our suppliers, or procurement of raw materials, and our development, manufacturing, distribution or sale of our products, and thus may impact our productivity, business and financial results;\n•\ninflationary trends, including in the price of our input costs, such as raw materials, transportation and energy;\n•\nour ability to successfully manage our working capital and inventory balances;\n•\nour ability to attract and retain key employees, and manage turnover of top executives;\n•\nour ability to successfully market to our expanded and diverse customer base;\n•\nour ability to effectively compete in our market and develop and introduce new products that meet customers’ needs;\n•\nchanges in demand from large multi-national customers due to increased competition and our ability to maintain “core list” status with customers;\n•\nour ability to successfully develop innovative and cost-effective products that allow customers to achieve their own profitability expectations;\n•\nthe impact of a significant data breach or other disruption in our information technology systems;\n56\nTable of \nContents\n•\nour ability to benefit from our investments and expansion in emerging markets;\n•\nthe impact of currency fluctuations or devaluations in the principal foreign markets in which we operate;\n•\neconomic, regulatory and political risks associated with our international operations;\n•\nour ability to declare and pay dividends which is subject to certain considerations;\n•\nour ability to react in a timely and cost-effective manner to changes in consumer preferences and demands, including increased awareness of health and wellness;\n•\nour ability to meet increasing customer, consumer, shareholder and regulatory focus on sustainability;\n•\nany impairment on our tangible or intangible long-lived assets;\n•\nour ability to enter into or close strategic transactions or divestments, or successfully establish and manage acquisitions, collaborations, joint ventures or partnerships;\n•\nchanges in market conditions or governmental regulations relating to our pension and postretirement obligations;\n•\nour ability to comply with, and the costs associated with compliance with, regulatory requirements and industry standards, including regarding product safety, quality, efficacy and environment impact;\n•\ndefects, quality issues (including product recalls), inadequate disclosure or misuse with respect to the products and capabilities;\n•\nour ability to comply with, and the costs associated with compliance with, U.S. and foreign environmental protection laws;\n•\nthe impact of our or our counterparties’ failure to comply with the U.S. Foreign Corrupt Practices Act, similar U.S. or foreign anti-bribery and anti-corruption laws and regulations, applicable sanctions or competition laws and regulations in the jurisdictions in which we operate or ethical business practices and related laws and regulations;\n•\nour ability to protect our intellectual property rights;\n•\nchanges in business and operations related to the adoption of artificial intelligence;\n•\nthe impact of changes in federal, state, local and international tax legislation or policies and adverse results of tax audits, assessments, or disputes;\n•\nthe impact of any tax liability resulting from the N&B Transaction; and\n•\nour ability to comply with data protection laws in the U.S. and abroad.\nThe foregoing list of important factors does not include all such factors, nor necessarily present them in order of importance. In addition, you should consult other disclosures made by the Company (such as in our other filings with the SEC or in company press releases) for other factors that may cause actual results to differ materially from those projected by the Company. Please refer to Part I, Item 1A, “Risk Factors,” of our 2024 Form 10-K for additional information regarding factors that could affect our results of operations, financial condition and liquidity.\nWe intend our forward-looking statements to speak only as of the time of such statements and do not undertake or plan to update or revise them as more information becomes available or to reflect changes in expectations, assumptions or results, whether as a result of new information, future events or otherwise. We can give no assurance that such expectations or forward-looking statements will prove to be correct. An occurrence of, or any material adverse change in, one or more of the risk factors or risks and uncertainties referred to in this report or included in our other periodic reports filed with the SEC could materially and adversely impact our operations and our future financial results.\nAny public statements or disclosures made by us following this report that modify or impact any of the forward-looking statements contained in or accompanying this report will be deemed to modify or supersede such outlook or other forward-looking statements in or accompanying this report.\n57\nTable of \nContents"
}