{
  "item1": "— Risks Relating Commercialization Products — Competition products could harm business result decrease revenue.” respect proprietary information not patentable, inventions which patents difficult enforce, rely trade secret protection confidentiality agreements protect interests. While, general matter, seek protect interests entering into confidentiality agreements employees, consultants potential business partners, may not able adequately protect trade secrets other proprietary information. Others may independently develop substantially equivalent proprietary information techniques otherwise gain access trade secrets. drug discovery, development commercialization activities face, will continue face, intense competition organizations such pharmaceutical biotechnology companies, well academic research institutions government agencies.",
  "item7": "milestone contract revenues $43.0 million $7.0 million years ended December 31, 2024 2023, respectively. During year ended December 31, 2024, milestone contract revenues derived $25.0 million upfront payment received during first quarter 2024 upon transfer functional intellectual property China Medical Systems Holdings Limited, recognized $18.0 million upfront milestone payments two collaboration partners during third quarter 2024. During year ended December 31, 2023, milestone contract revenues primarily derived regulatory milestone under Novartis collaboration license agreement. Cost Product Revenues Year Ended December 31, Salary benefits related Amortization definite-lived intangible assets Total cost product revenues Cost product revenues includes all product related costs, reserves obsolescence, employee personnel costs, including stock compensation, those employees dedicated production commercial products, royalties owed under collaborative agreements amortization licensed intellectual property rights ICLUSIG amortization capitalized milestone payments.",
  "item2": "/ MINJUVI (tafasitamab), OPZELURA (ruxolitinib) cream, ZYNYZ (retifanlimab-dlwr) NIKTIMVO TM collaboration strategic relationship strategy, anticipated benefits disadvantages entering into collaboration agreements; licensing, investment commercialization strategies, including plans commercialize drug products drug candidates; regulatory approval process, including obtaining U.S. Food Drug Administration other international regulatory authorities’ approval products United States abroad; safety, effectiveness potential benefits indications drug candidates other compounds under development; timing, structure size clinical trials; compounds expected enter clinical trials; timing clinical trial results; ability manage expansion drug discovery development operations; future required expertise relating clinical trials, manufacturing, sales marketing; obtaining terminating licenses products, drug candidates technology, other intellectual property rights; receipt payments pursuant collaboration license agreements resulting milestones royalties; plans develop commercialize products own; plans manufacturing operations, including plans use third-party manufacturers; expected expenses expenditure levels; expected uses cash; expectations respect need ability raise additional capital; expected revenues sources revenues; expectations respect inventory; expectations respect reimbursement products; expected impact recent accounting pronouncements changes tax laws; expected losses; fluctuation losses; currency translation impact associated non-U.S. operations collaboration royalties; profitability; adequacy capital resources continue operations; costs other financial impacts associated resolving matters litigation governmental proceedings; expectations regarding competition; investments, including anticipated expenditures, losses expenses; patent prosecution maintenance efforts. These forward-looking statements reflect current views respect future events, based assumptions subject risks uncertainties."
}