{
  "source_file": "intu-20250731.htm",
  "form_type": "10-K",
  "item1": "ITEM 1 - BUSINESS\nBACKGROUND\nOverview and Mission\nIntuit is a global financial technology platform with a mission to power prosperity around the world. Serving approximately 100 million consumers, small and mid-market businesses, and accountants worldwide, Intuit’s platform brings the power of artificial intelligence (AI) and human intelligence together to fuel customers’ success. With TurboTax, Credit Karma, QuickBooks, Mailchimp, and Intuit Enterprise Suite, we help put more money in customers’ pockets, save them time by eliminating work, and help ensure that they have complete confidence in every financial decision they make. \nOur strategy is to be an AI-driven expert platform by connecting customers to a virtual team of AI agents and AI-enabled human tax and financial experts. We're creating done-for-you experiences by automating everyday tasks, managing complex workflows and processes, and solving challenges before they arise with predictive insights. We connect customers to AI-enabled human experts for that last mile of decisions or to complete the work for them.\nWe harness the power of data, data services, AI, and human intelligence that help customers reach their financial goals. Intuit's all-in-one business platform helps customers run and grow their businesses end-to-end, from lead to cash. This includes financial management - including payments and capital - compliance, human capital management, and marketing products and services. Intuit's consumer platform helps customers do their taxes with ease and confidence and improve their financial success, from credit building to wealth building, with tax and personal financial management products. For accounting professionals, we provide professional tax and financial management products and services.\nIntuit Inc. was incorporated in California in March 1984. We reincorporated in Delaware and completed our initial public offering in March 1993. Our principal executive offices are located at 2700 Coast Avenue, Mountain View, California, 94043, and our main telephone number is 650-944-6000. When we refer to “we,” “our,” or “Intuit” in this Annual Report on Form 10-K, we mean the current Delaware corporation (Intuit Inc.) and its California predecessor, as well as all of our consolidated subsidiaries.\nOur Business Portfolio\nWe organize our businesses into four reportable segments:\nGlobal Business Solutions\n(1)\n:\n \nThis segment serves small and mid-market businesses around the world, and the accounting professionals who assist and advise them. QuickBooks and Intuit Enterprise Suite are offerings powered by our all-in-one business platform which includes financial management services, human capital management solutions such as payroll and time tracking, money solutions, such as merchant payment processing, bill pay, checking accounts through an FDIC-member bank partner, and financing for small and mid-market businesses. Intuit Enterprise Suite provides mid-market businesses with a configurable, AI-powered solution that includes multi-entity and multi-dimensional financial management capabilities designed to seamlessly scale and enhance productivity and profitability for more complex businesses to streamline operations. Mailchimp offerings include marketing automation and customer relationship tools.\nConsumer\n: \nThis segment primarily serves consumers, helping customers get their taxes done with confidence—whether they do it themselves or with the help of an AI-enabled human expert. TurboTax delivers do-it-yourself and assisted income tax preparation products and services sold in the United States (U.S.) and Canada.\nCredit Karma\n:\n \nThis segment serves consumers with a personal finance offering that helps members find the right financial products and make smarter money decisions throughout the year to reach their financial goals. This includes personalized recommendations for credit card, home, auto, and personal loan, and insurance products; online savings and checking accounts through an FDIC-member bank partner; and access to their credit scores and reports, credit and identity monitoring, credit report dispute, credit building tools, and tools to help understand net worth and make financial progress. \nProTax\n:\n \nThis segment serves professional accountants in the U.S. and Canada, who are essential to both business success and tax preparation and filing. Our professional tax offerings include Lacerte, ProSeries, and ProConnect Tax Online in the U.S., and ProFile and ProTax Online in Canada.\n(1) \nOn August 1, 2024, we renamed our Small Business & Self-Employed segment as the Global Business Solutions segment. \n4\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nOur Business and Growth Strategy\nThe era of AI is igniting global innovations at an incredible pace and will fundamentally transform every part of our work and personal lives. We made an early bet on AI, declaring our AI-driven expert platform strategy in 2019. We have transformed the company from a tax and accounting platform to an AI-driven expert platform. We have a significant competitive advantage with our scale of data, data services, AI capabilities, ecosystem of applications, and our large network of AI-enabled human experts to become the all-in-one platform for consumers, businesses, and accountants. We're disrupting the categories we operate in to drive better money outcomes for our customers.  \nWe leverage AI and human intelligence to provide our customers with done-for-you experiences that automate tasks, identify actionable insights to drive important decisions, and manage end-to-end workflows or entire processes to eliminate work, while ensuring the customer remains in control. When customers need additional help or want help to complete the work on their behalf, we connect them with the best human expert from our network of thousands of AI-enabled financial, tax, and bookkeeping experts who can complete a specific task, address specialized questions, or manage the entire workload. Our strategy, combined with our Big Bets that focus on the largest customer problems and growth opportunities, positions us for durable growth. \nIn fiscal 2025, we launched a transformative set of AI agents that provide customers with a virtual team to complete jobs on their behalf, dramatically improving how businesses run and grow. Combined with our AI-enabled human experts, these agents are automating workflows and delivering real-time insights to drive growth and improve cash flow. Our redesigned user interface and new business feed highlights these real-time insights and recommendations and the tasks completed by agents on behalf of the customer. We also launched AI agents in Intuit Enterprise Suite, including accounting, payments, finance, and project management agents, transforming how our small and mid-market business customers manage their finances by automating a variety of day-to-day tasks, and increasing productivity.\nOur innovation has been possible with the investments in our proprietary Generative AI Operating System (GenOS), which have enabled us to fuel innovation with unparalleled speed for our customers. Built for our internal developers, GenOS not only keeps pace with rapid technological industry advances but is setting the pace—by melding the best of artificial intelligence and human intelligence on our platform. This enables us to rapidly deliver a new class of intelligent, autonomous financial solutions that will define the next decade of growth for our customers and for Intuit. Our AI-driven expert platform and products are built in keeping with the company’s commitment to data privacy, security, and responsible AI governance. We safeguard customer data and protect privacy using industry-leading technology and practices, and adhere to responsible AI principles that guide how we operate and scale our platform with our customers’ best interests in mind. \nAs we execute our global AI-driven expert platform strategy, we prioritize resources on our Big Bets across the company. We have driven significant momentum across the company over the past year. Looking ahead, we are doubling down on the areas that drove strong results this year where the combination of AI and human intelligence delivers done-for-you experiences, helps customers put more money in their pockets, and builds our mid-market business.\nAs the external environment evolves, we continue to innovate and adapt our strategy and anticipate our customers’ needs. For more than 40 years, we have been dedicated to developing innovative solutions that are designed to solve our customers' most important financial problems. At Intuit, we believe that everyone should have the opportunity to prosper, and we never stop working to find new, innovative ways to make that possible.\nPRODUCTS AND SERVICES\nDuring fiscal 2025, we offered our products and services in the four segments described in \n“Our Business Portfolio”\n above. The following table shows the percentage of total revenue contributed by each of these segments over the last three fiscal years. \nFiscal 2025\nFiscal 2024\nFiscal 2023\nGlobal Business Solutions\n59 \n%\n59 \n%\n56 \n%\nConsumer\n26 \n%\n27 \n%\n29 \n%\nCredit Karma\n12 \n%\n10 \n%\n11 \n%\nProTax\n3 \n%\n4 \n%\n4 \n%\nTotal international net revenue was approximately 8% of consolidated total net revenue in each of the twelve months ended July 31, 2025, 2024, and 2023.\nFor financial information about our reportable segments, see \n“Management’s Discussion and Analysis of Financial Condition and Results of Operations”\n in Item 7 and Note 14 to the consolidated financial statements in Item 8 of this Annual Report.\n Intuit\n Fiscal 2025 Form 10-K\n5\nTable\n of Contents\nGlobal Business Solutions\nOur Global Business Solutions segment serves small and mid-market businesses around the world, and the accounting professionals who assist and advise them. Our vision is to be the connected all-in-one platform with a virtual team of AI agents and AI-enabled human experts that small and mid-market businesses rely on every day to run and grow their businesses.\nSmall and mid-market business owners are constantly faced with challenges and barriers in their journey to success. Universally, businesses at every stage of growth struggle to get customers, pay and get paid, get capital, manage their workforce, get access to advice, and stay compliant. Our all-in-one platform features AI agents, providing actionable, AI-driven insights and automation to help our customers grow and run their businesses with confidence. These AI agents are also able to work alongside our large network of AI-enabled human experts to provide businesses with additional expertise and support.\nGet Customers \nMailchimp\n.\n Mailchimp offers email and other marketing solutions that enable small and mid-market businesses to digitally promote themselves across email, social media, short message service (SMS), landing pages, ads, websites, and more, all from one place.\nPay and Get Paid\nPayment Processing Solutions\n.\n Our full range of merchant services for small and mid-market businesses includes credit card, debit card, Apple Pay, and ACH payment services for in-person and card-not-present payments. We offer instant deposit and payment dispute protection options for eligible customers. Through seamless onboarding and automated transaction reconciliation, our payment processing solutions are deeply integrated into our QuickBooks Online, Desktop, and Intuit Enterprise Suite offerings.\nQuickBooks Checking\n.\n The QuickBooks Checking business bank account comes with a physical and virtual debit card for more spending power, fast payments with no-fee Instant Deposit, and powerful cash flow management with envelopes for partitioning funds for future expenses, all with no fees.\nBill Pay\n.\n Our QuickBooks Online offerings and Intuit Enterprise Suite allow small and mid-market businesses to organize bills and make payments online. Small and mid-market businesses can connect with vendors and automatically import bills through our network, resulting in easier and faster payments.\nGet Capital\nCapital\n.\n \nWe offer financing options for small and mid-market businesses to help them get the capital they need to succeed. The financing process provides customers with the ability to use their QuickBooks data to qualify to borrow capital, whether from Intuit via our originating bank partner or from partners on our QuickBooks Capital Marketplace. Additionally, QuickBooks Line of Credit provides flexible access to capital through pre-approved credit limits. Qualified small and mid-market businesses can choose to borrow funds through a series of term loans within a maximum approved credit limit.\nManage Their Workforce\nWorkforce Solutions\n.\n Our payroll solutions, available as online or desktop solutions, are sold on a subscription basis and integrate with our QuickBooks Online and Desktop offerings and Intuit Enterprise Suite, or may be purchased standalone. Our online payroll offerings include automated tax payments and filings, as well as access to human resources solutions and employee benefits offerings such as health insurance and 401(k) plans. We also offer time tracking solutions, which seamlessly integrate with our online payroll offerings to help businesses easily and accurately track time for their mobile workforce, including tools for project planning, job costing, and tracking billable hours per client.\nAccess Advice\nQuickBooks Live\n.\n \nBusinesses can get support through Expert Assisted and Full-Service Bookkeeping. With QuickBooks Live Expert Assisted, businesses have on-demand access to expert bookkeepers who can provide guidance and support on managing their books and making smart business decisions. With QuickBooks Live Full-Service Bookkeeping, businesses get one-on-one support from our team of expert bookkeepers to manage and maintain books with guaranteed accuracy. Our experienced bookkeepers are certified QuickBooks ProAdvisors, and many are Certified Public Accountants.\nQuickBooks ProAdvisor\n.\n \nAccounting professionals can assist with bookkeeping, taxes, payroll, and more. Our free Find a ProAdvisor service helps customers find a QuickBooks Certified accountant or bookkeeper who knows their niche, speaks their language, or is nearby. To enable our network of hundreds of thousands of accountants, we offer memberships to the QuickBooks ProAdvisor program, which provides accountants access to QuickBooks Online Accountant, technical support, training, product certification, marketing tools, and discounts on Intuit products and services purchased on behalf of clients.\n6\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nBe Compliant\nQuickBooks Online\n.\n \nDesigned for all kinds of businesses, QuickBooks Online helps simplify accounting and tax compliance. Users can track income and expenses, create and send invoices and estimates, manage and pay bills, and review a variety of financial reports. QuickBooks Online also has powerful industry-specific capabilities such as features for product-based businesses. QuickBooks Online is an open platform, enabling third-party developers to create online and mobile applications that integrate with our offering. \nWe offer different QuickBooks Online solutions depending on the size and complexity of the business, including Simple Start, Essentials, and Plus. QuickBooks Online Advanced is designed for mid-market businesses with more complex needs. QuickBooks Solopreneur and QuickBooks Self-Employed are designed for independent contractors and solo entrepreneurs.\nIntuit Enterprise Suite\n.\n \nDesigned for complex mid-market companies seeking to streamline operations, enhance productivity, and support growth, this solution builds upon the familiar QuickBooks Online interface. It integrates advanced financial management solutions, such as multi-entity accounting and multi-dimensional reporting, along with human resource and marketing tools in a unified solution.\nQuickBooks Desktop Software\n.\n Our QuickBooks financial management solutions are also available as desktop versions for businesses on a subscription basis. QuickBooks Desktop Plus is designed for small businesses. QuickBooks Enterprise is designed for mid-market businesses with more complex needs and is available for download or as a hosted solution. This offering provides industry-specific reports and features for a range of industries, including Contractor, Manufacturing, Wholesale and Distribution, Retail, Nonprofit, Professional Services, and Accountants.\nFinancial Supplies\n.\n We offer a range of financial supplies designed for individuals and businesses that use our QuickBooks offerings. These include standard paper checks, Secure Plus checks with CheckLock fraud protection features, a variety of stationery, tax forms, and related supplies.\nConsumer\nOur Consumer segment includes our TurboTax products and services that are designed to enable consumers and businesses to prepare and file their federal and state income tax returns quickly and accurately. These offerings are available either online or as desktop versions in the U.S. and Canada. They are designed to be easy to use yet sophisticated enough for complex tax returns, serving the varied needs of our customers, from those who file simple returns to those who itemize deductions, own investments or rental property, and manage small and mid-market businesses. \nOur do-it-yourself tax products and services are designed for customers who choose to independently prepare and file their tax returns. Our assisted tax products and services, such as TurboTax Live and TurboTax Live Full Service, are designed for customers who seek professional tax advice or who want their returns prepared by an expert. We also offer complementary services, including electronic filing of federal and state income tax returns, faster access to tax refunds, audit defense, and audit support.\nOur online tax preparation, filing, and other services are offered through the websites and mobile apps of thousands of financial institutions, electronic retailers, and other online merchants. Financial institutions can offer our online tax preparation and filing services to their customers through a link to TurboTax Online. \nCredit Karma\nOur Credit Karma segment provides consumers with a financial platform that propels them forward wherever they are on their financial journey, enabling them to understand their financial picture, make smart financial decisions, and stick to their financial plan. The platform offers a number of services to our members: access to their credit scores and reports, credit and identity monitoring, credit building, credit report dispute, tools to help understand net worth and make financial progress, personalized recommendations of credit card, loan, and insurance products, and access to our TurboTax offerings, including tax preparation software and early tax refunds. Credit Karma Money offers members online savings and checking accounts through an FDIC-member bank partner. To provide services to our members, Credit Karma works with a variety of partners, including credit bureaus, banks, credit card issuers, insurance carriers, and other financial institutions and lending partners. Additionally, Credit Karma leverages Lightbox, a first-of-its-kind enterprise platform which allows lenders to leverage thousands of de-identified data points from Credit Karma members to help provide our members with greater certainty that they will be approved if they apply for a financial product. \nProTax\nOur ProTax segment includes our professional tax offerings and serves professional accountants in the U.S. and Canada, who are essential to both small business success and tax preparation and filing. Our professional tax offerings consist of Lacerte, ProSeries, and ProConnect Tax Online in the U.S., and ProFile and ProTax Online in Canada. These offerings enable accountants to accurately and efficiently complete and electronically file a full range of federal and state tax returns for individuals and businesses. Lacerte is designed for full-service, year-round accounting firms who handle more complex returns. ProSeries is designed for year-round tax practices handling moderately complex tax returns. ProConnect Tax Online is our \n Intuit\n Fiscal 2025 Form 10-K\n7\nTable\n of Contents\ncloud-based solution, designed for full-service, year-round practices that prepare all types of individual and business returns and integrates with our QuickBooks Online offerings. ProFile is our Canadian desktop tax offering, which serves year-round, full-service accounting firms for both individual and business tax returns. ProTax Online is our Canadian cloud-based tax solution, designed for full-service, year-round practices who prepare all forms of individual and business tax returns. It is integrated into QuickBooks Online Accountant to provide seamless integration of data across books and tax through our Workpapers solution. We also offer a variety of tax-related services that complement the tax return preparation process, including advisory services, year-round document storage, bank products, e-signature, and collaboration services, as well as additional capabilities such as desktop hosting, fixed asset management, and third-party solutions for practice management for some of our U.S. tax offerings.\nPRODUCT DEVELOPMENT\nThe markets for software and related services are characterized by rapid technological change, shifting customer needs, and frequent new product introductions and enhancements. To succeed in these markets, continuous investment is required to innovate, develop new products and services, and enhance existing offerings. Our product development efforts are more important than ever as we pursue our growth strategy.\nWe develop many of our products and services internally, and we have a number of U.S. and foreign patents and pending applications that relate to various aspects of our products and technology. We supplement our internal development efforts by acquiring businesses and technologies. We also purchase or license products and technology from third parties and establish other relationships that enable us to enhance or expand our offerings more rapidly. We expect to expand our third-party technology relationships as we continue to pursue our growth strategy.\nOur offerings have rapid development cycles. In addition, developing consumer and professional tax software and services presents unique challenges because of the demanding development cycle required to accurately incorporate federal and state tax law and tax form changes within a rigid timetable. The development timing for our small business payroll and merchant payment processing services offerings varies with business needs and regulatory requirements, and the length of the development cycle depends on the scope and complexity of each project.\nWe continue to make substantial investments in research and development. We expect to focus our future research and development efforts on enhancing existing products and services with done-for-you experiences, financial recommendations, personalization, and ease of use enabled by AI and other advanced technologies. We continue to focus on developing new products and services, including global offerings, and undertaking significant research and development for ongoing projects to update the technology platforms for several of our offerings.\nSEASONALITY\nOur Consumer and ProTax offerings have a significant and distinct seasonal pattern as sales and revenue from our income tax preparation products and services are typically heavily concentrated in the period from November through April. This seasonal pattern typically results in higher net revenues during our second and third quarters ending January 31 and April 30, respectively. \nWe expect the seasonality of our Consumer and ProTax businesses to continue to have a material impact on our quarterly financial results in the future.\nMARKETING, SALES, AND DISTRIBUTION CHANNELS\nMarkets \nOur primary customers are consumers and small and mid-market businesses. We also provide specialized tax and accounting products to professional accountants. We partner with financial institutions and other partners, who we connect with consumers on our platform. The markets in which we compete have always been characterized by rapid technological change, shifting customer needs, and frequent new product introductions and enhancements by competitors. The widespread usage of mobile devices and social media, along with the evolution of AI, has accelerated the pace of change and revolutionized how customers learn about, evaluate, and purchase products and services.\nReal-time, personalized online shopping experiences are the standard. In addition, many customers now begin shopping in one channel and ultimately purchase in another. This has created a need for integrated, multi-channel, shop-and-buy experiences. Market and industry changes quickly make existing products and services obsolete. Our success depends on our ability to respond rapidly to these changes with new business models, updated competitive strategies, new or enhanced products and services, and other changes in the way we do business.\nMarketing Programs\nWe use a variety of marketing programs to generate direct sales, develop leads, increase general awareness of the Intuit brand and our product portfolio, and drive sales in retail. These programs include offline marketing, such as TV and radio advertising; digital marketing, such as display and pay-per-click advertising, search and generative engine optimization, and social and affiliate marketing; email marketing; in-product marketing to drive awareness of related products and services; public relations; \n8\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nsponsorships; podcast marketing; mobile marketing; and retail marketing of our consumer tax offerings. Our campaigns are designed to attract new users, retain existing users, and cross-sell additional offerings.\nSales and Distribution Channels\nDirect Channel\n. We offer our products and services directly through our websites, apps, and call centers. Direct online offerings are an effective channel for customers who can make purchase and other decisions regarding our and our partners’ offerings based on content provided on our websites, or via other online content and word-of-mouth recommendations. For many of our products, assisted sales continues to be an effective channel for serving customers who want live help to select the products and services that are right for their needs. We also have a direct sales force that calls on accountants, bookkeepers, and marketing professionals, and seeks to increase their awareness, usage, and recommendation of our business and professional tax solutions. We market certain products directly to mid-market businesses through our direct sales force. \nMulti-Channel Shop-and-Buy Experiences\n.\n Our customers primarily research products and services online. Many customers buy and use our products and services entirely online. Some research online but make their purchase at a retail location. Because many customers shop across multiple channels, we continue to coordinate our online, offline, and retail presence and promotions to support an integrated, multi-channel shop-and-buy model. We also focus on cross-selling complementary Intuit and third-party offerings online and in-product.\nOnline App Stores\n.\n We distribute many of our offerings for mobile devices through proprietary online stores that provide applications for specific devices.\nPartner and Other Channels\n. We offer many of our products and services through partners and other channels, including value-added resellers, technology partners with complementary platforms, accountants, bookkeepers, marketing professionals, and professional service providers who help us reach new customers at the point of need and drive growth and market share by extending our online reach. These partners combine our products and services with marketing, sales, and technical expertise to deliver a complete solution at the local level. We also sell our TurboTax Desktop offerings at retail locations across the U.S. and Canada and on retailer websites. In Canada, we also rely on distributors who sell products into the retail channel.\nCOMPETITION\nWe face intense competition in all aspects of our businesses across all of our offerings. Competition is rapidly evolving, fragmented, and involves complex interdependencies with many businesses. Competitive pressures in many of the market segments we serve have grown markedly over the past few years, and the marketing and distribution channels continue to evolve. We expect these trends to continue. Our competitors may introduce superior products and services, successfully use and deploy new technologies such as AI that may reduce customer demand for our products or services, reduce prices, have greater technical, marketing, and other resources, have greater brand recognition, have larger installed bases of customers, have well-established relationships with our current and potential customers and partners, advertise aggressively, or beat us to market with new products and services.\nThe competitive landscape is constantly evolving. This occurs as we expand into new market segments and geographic regions and extend our capabilities, as well as when new companies emerge or existing companies extend their capabilities (either directly or through acquisitions or partnerships) to include the market segments and geographic regions in which we operate. Given the breadth of the products and services that we offer as a global financial technology company and the customer problems that we aim to solve, we compete with offerings from a variety of organizations across a range of industries, including large global companies, smaller geographically focused companies, startups, and professional services. Entities that offer or provide access to offerings that we may compete with include:\n•\nbusiness software providers, including industry-specific vertical software providers and embedded software providers, that offer solutions such as accounting, business management and financial software, marketing automation, customer relationship management, inventory management, payroll and workforce management;\n•\nprivate and publicly-funded tax preparation and filing service providers, including embedded software providers;\n•\naccounting, consulting, and tax firms; \n•\ncompanies and banks that provide money services, including merchant payment processing, bill pay, checking and savings accounts, financing and point of sale devices; \n•\ncompanies that provide personal finance management products and tools, including access to credit scores, credit and identity monitoring, credit-building tools, and tools to help understand net worth and make financial progress;\n•\ncompanies that provide a marketplace of consumer financial offerings;\n•\nfinancial institutions; \n•\ncredit bureaus; and\n•\nplatform companies that could develop competing technology solutions to any of the problems that our customers may face.\nWe believe our most important competitive factors are our innovation and technology capabilities, functionality, ease of use, and security of our offerings, the integration of our offerings with each other and third-party offerings, brand recognition and reputation, quality of support, and cost. We believe that we compete favorably based on these factors and our ability to remain competitive will largely depend on our ongoing performance. \n Intuit\n Fiscal 2025 Form 10-K\n9\nTable\n of Contents\nCUSTOMER SUCCESS\nFor many of our offerings, we provide support through multiple channels including telephone, email, online and video chat, text messaging, our customer support websites, self-help assets embedded in our products, and online communities where consumers can share knowledge and product advice with each other.\nWe also provide access to experts, through our TurboTax and QuickBooks Live offerings, who provide tax advice, tax preparation, and bookkeeping services.\nOur customer success staff predominantly consists of Intuit-employed and outsourced experts. We supplement with seasonal employees and additional outsourcing during periods of peak call volumes, such as during the tax return filing season or following a major product launch. We augment the services we provide with outsourced partnerships domestically and internationally. A majority of our outsourced customer success personnel are based domestically, with additional international teams located primarily in the Philippines and Canada.\nWe also source staff through our Prosperity Hub program, which is designed to spark economic prosperity in underserved communities. One part of this program is our socially responsible sourcing model, where we both directly and through customer success partner-employers, hire, train, and retain workers who deliver support and services for our customers.\nSelf-help information is offered for free in-product and on our support websites for many of our offerings. Support alternatives and fees vary by product. For example, some product subscriptions receive 24/7 support and additional contact channel options.\nMANUFACTURING AND DISTRIBUTION\nOnline Products and Services\nOur online offerings include QuickBooks Online, Intuit Enterprise Suite, online payroll services, merchant payment processing and bill pay services, Mailchimp’s marketing automation and customer relationship offerings, TurboTax Online, ProConnect Tax Online, consumer and professional electronic tax filing services, and Credit Karma offerings. We use public cloud providers, such as Amazon Web Services and Google Cloud Platform, for most of our systems, networks, and databases used to operate these online offerings.\nDesktop Software and Supplies\nOur desktop software customers generally electronically download software as demand for physical packaged products has declined. When supplies are ordered, we typically ship the physical product within a few days of receiving an order, and backlog is minimal.\nPRIVACY AND SECURITY\nWe host, collect, process, use, and retain large amounts of sensitive and personal data from our customers, users, workforce, and third-party partners. We are stewards of this data and have designed data stewardship principles to align our organization in collecting, using, and protecting such information. As we believe strongly in these principles, we operate our program to comply with laws and regulations that govern our use, sharing, and protection of personal information, including, for example, laws related to financial services and the handling of tax data. We have established guidelines and practices to help ensure members of our workforce are aware of our program and the role they play in protecting this data. Our privacy statements provide notice of our privacy practices, and provide the opportunity for impacted parties to exercise their rights with respect to their personal information. We participate in industry groups whose purpose is to develop or shape industry best practices, and to inform public policy for privacy and security. \nWe use security safeguards to help protect the systems and the information that is given to us from loss, misuse, and unauthorized alteration. We use technical and procedural measures designed to help detect and prevent fraud and misuse of data. Whenever sensitive information, such as credit card information or tax return data, is transmitted to us through one of our websites or products, we follow current industry standards to encrypt the data as it is transmitted to us, and when we store it at rest. We routinely patch our systems with security updates and work to protect our systems from unauthorized internal or external access using numerous commercially available computer security products, as well as internally developed technology, security procedures, and practices.\nGOVERNMENT REGULATION\nWe are subject to federal, state, local, and international laws and regulations that add compliance costs, affect how we operate, and may impact our ability to compete. For example, our Consumer and ProTax segments are subject to federal, state, and international government requirements, including regulations related to the electronic filing of tax returns, the provision of tax preparer assistance, and the use and disclosure of customer information. Our Global Business Solutions segment offers products and services to small and mid-market businesses and consumers, such as payroll, payments, financing for small and mid-market businesses, and other financial service offerings, which are also subject to certain regulatory \n10\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nrequirements. Our Credit Karma segment offers personal finance products and services to consumers, such as recommendations of credit card, loan, and insurance products and access to credit scores and reports, which are also subject to certain regulatory requirements. For additional information regarding the government regulations to which we are subject, see \n“Risk Factors”\n in Item 1A of Part I of this Annual Report, including without limitation the risks under “\nLegal and Compliance Risks\n.” \nINTELLECTUAL PROPERTY\nOur success depends on the proprietary technology integrated into our offerings. We protect this proprietary technology through a variety of intellectual property mechanisms, including copyright, patent, trade secret, and trademark laws, restrictions on disclosure and other methods. For example, we regularly file applications for patents, copyrights, and trademarks and service marks to protect intellectual property that we believe is important to our business. We hold a growing patent portfolio that we believe is important to Intuit’s overall competitive advantage, although we are not materially dependent on any one patent or particular group of patents in our portfolio at this time. We also have a number of registered trademarks that include Intuit, QuickBooks, Lacerte, TurboTax, QB, ProSeries, ProConnect, Credit Karma, and Mailchimp. We have registered these and other trademarks and service marks in the U.S. and, depending on the relevance of each brand to other markets, in many foreign countries. Most registrations can be renewed perpetually at 10-year intervals. We also license intellectual property from third parties for use in our products.\nWhile our portfolio of patents is growing, our issued patents could be determined to be invalid or unenforceable against competitive products in every jurisdiction. In addition, third parties have asserted and may continue to assert infringement claims against us and our customers. These claims and any litigation may result in invalidation of our proprietary rights or a finding of infringement along with an assessment of damages. Litigation, even if without merit, could result in substantial costs and divert resources and management attention. Additionally, third-party licenses may not continue to be available to us on commercially acceptable terms, or at all.\nHUMAN CAPITAL\nWe consider our employees to be one of our four key True North stakeholders because they are critical to delivering for our customers, our shareholders, and the communities we serve. As of July 31, 2025, we had approximately 18,200 employees in seven countries. During fiscal 2025, we employed on average approximately 12,300 seasonal employees from January to April primarily to support our Consumer segment customers during the peak of tax season. We believe our future success and growth will depend on our ability to attract and retain a qualified workforce in all areas of our business. \nIntuit’s Chief People & Places Officer, who reports directly to the Chief Executive Officer, manages our overall workforce policies and strategies, including employee recruitment, workplace environment and culture, engagement and retention, leadership development, succession planning, organization and talent assessment, fair pay, and executive compensation. The Compensation and Organizational Development Committee of the Board of Directors has oversight of these programs.\nCulture and Values\nTo deliver on our mission to power prosperity around the world, we are guided by our company values as we strive to create an inclusive, safe, and respectful workplace where employees can do the best work of their lives and be empowered to make an impact, learn and grow, and feel connected. Our values and culture are woven into our hiring and retention practices and are foundational to our ability to attract, retain, and advance top talent.\n•\nOur value of \nIntegrity Without Compromise\n \nmeans valuing trust above all else, speaking the truth, and doing the right thing even when no one is looking.\n•\nOur value of \nCourage\n means being bold and fearless in how we think and act, holding a high bar for performance, and valuing speed with a bias for learning and action. \n•\nOur value of \nCustomer Obsession\n means falling in love with our customers’ problems and delivering solutions that delight our customers.\n•\nOur value of \nStronger Together\n means we champion an inclusive and respectful workplace, and we thrive on diverse voices to challenge and inform decisions.\n•\nOur value of \nWe Care and Give Back\n means we strive to be stewards of the future, strengthen the communities around us, and give everyone the opportunity to prosper. We provide eligible full-time employees paid time off that can be used to do volunteer work during normal work hours for vetted non-profits and for donation matching up to an annual limit.\nTalent Acquisition\nWe have a robust talent acquisition process that begins with cross-functional talent planning to define hiring needs. Candidates are assessed against skills and values as defined by each hiring team. We are an equal opportunity employer and make employment decisions without regard to any basis protected by federal, state, or local law. We do not make \n Intuit\n Fiscal 2025 Form 10-K\n11\nTable\n of Contents\nemployment decisions based on an individual’s identity. To expand our reach for the best available talent, we have invested in external partnerships with organizations and universities. This includes active participation and having a significant presence at prominent industry conferences and events known for attracting global audiences with varied skills and experience.\nTalent Development and Retention \nWe strive to create an inclusive, safe, and respectful environment that enables our employees to do the best work of their lives. We provide resources that help them make a positive impact, continue to learn, grow professionally, and feel connected to our culture. We promote the development of all of our employees and provide them with access to learning and training based on their needs and interests and the resources they need to grow, thrive, and reinvent themselves over time. We offer learning programs throughout the employee lifecycle, beginning with onboarding and continuing with ongoing career growth programs. We focus on internal mobility, helping our people acquire new skills, take on new responsibilities, and gain new experiences. This approach contributes to our success in serving our customers while helping our employees achieve their individual professional development and other career goals.\nWe are also invested in growing the capabilities of our managers and developing the leadership skills of our executives. Our teams design programs and resources, such as the Intuit Leadership Playbook, focused on leading with a clear vision, building a high-performance culture, and driving winning results for all of our stakeholders.\nAll full-time employees have access to opportunities to develop and learn through company-sponsored learning paths and online courses on topics ranging from AI to accelerating velocity, in support of an employee’s ability to adapt to any work environment.\nEmployees set goals and measure progress through our goal setting tool and have opportunities to focus on growth both during performance assessment conversations and ongoing regular check-ins with their manager.\nEmployee Engagement and Listening\nListening and responding to our employees is at the core of our culture. We value employee feedback and leverage it to continuously improve the employee experience. We regularly collect, analyze, measure, and share insights about the sentiment of our workforce through multiple channels, including surveys, town halls with senior leadership, and other touchpoints, which help to guide the work we do to support our employees.\nTotal Rewards     \nOur compensation philosophy aims to attract and retain top talent for today and the future. Intuit’s total target compensation includes base pay, a range of incentive plans that vary based on role, and stock-based awards \n—\n all set at market-competitive levels. Incentive compensation plans are part of our pay-for-performance philosophy, including close alignment with Company performance that rewards top performers. Most employees are eligible for stock-based awards, allowing the majority of our employees to share in the Company’s success.\nWe also offer eligible employees a broad range of competitive benefit programs and services designed to address the physical and mental health, well-being, income protection, and family care needs of employees and their family members. These programs include health care, mental health coaching and counseling, programs to save for retirement, tuition assistance, financial counseling, life and family support programs, and paid time off, including annual paid recharge days and family and parental leave.\nWe have a strong culture of transparency, which includes our ongoing focus on fair pay. We are committed to providing fair pay to all of our employees. We regularly examine our performance evaluation practices, including improving practices to ensure equal opportunity for high-performing employees to be promoted.\nStronger Together\nAt the foundation of our culture is our Stronger Together value. It guides our behavior and interactions in everything we do and in how we treat one another. We serve diverse customers around the world. We believe we can solve their toughest problems and deliver unrivaled benefits when our workforce understands and reflects our customers. \nIntuit has established employee resource groups (ERGs) that provide a foundation for a culture of inclusion. These ERGs are employee-driven, volunteer-led, and open to all employees. ERGs offer a sense of community and give all employees the chance to learn from role models, peers, and experts, and to volunteer within their communities, all while aligning with our organization’s overall vision. \n12\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nThe following table shows Intuit’s executive officers and their areas of responsibility as of August 1, 2025. Their biographies follow the table.\nName\nAge\nPosition\nSasan K. Goodarzi\n57\nPresident, Chief Executive Officer, and Director\nSandeep S. Aujla\n49\nExecutive Vice President and Chief Financial Officer\nAnton Hanebrink\n49\nExecutive Vice President, Corporate Strategy\nCaryl Hilliard\n59\nExecutive Vice President, Chief People & Places Officer\nKerry J. McLean\n61\nExecutive Vice President, General Counsel and Corporate Secretary\nLauren D. Hotz\n50\nSenior Vice President and Chief Accounting Officer\nMr. Goodarzi has been President and Chief Executive Officer and a member of the Board of Directors since January 2019 and previously served as Executive Vice President and General Manager of Intuit’s Small Business Group since May 2016. He previously was Executive Vice President and General Manager of Intuit’s Consumer Tax Group from August 2015 through April 2016 and from August 2013 to July 2015 served as Senior Vice President and General Manager of the Consumer Tax Group. He served as Intuit’s Senior Vice President and Chief Information Officer from August 2011 to July 2013, having rejoined Intuit after serving as CEO of Nexant Inc., a privately held provider of intelligent grid software and clean energy solutions, beginning in November 2010. During his previous tenure at Intuit from 2004 to 2010, Mr. Goodarzi led several business units, including Intuit Financial Services and the professional tax division. Prior to joining Intuit, Mr. Goodarzi worked for Invensys, a global provider of industrial automation, transportation, and controls technology, serving as global president of the products group. He also held a number of senior leadership roles in the automation control division at Honeywell Inc. He serves on the board of Atlassian Corporation Plc and chairs the Compensation and Leadership Development Committee. Mr. Goodarzi holds a Bachelor’s degree in Electrical Engineering from the University of Central Florida and a Master’s degree in Business Administration from the Kellogg School of Management at Northwestern University.\nMr. Aujla has been Executive Vice President and Chief Financial Officer since August 2023. He served as Intuit’s Senior Vice President of Finance, Small Business & Self-Employed Group and Technology Organization, from January 2019 to July 2023, and Vice President, Finance, Small Business & Self-Employed Group, from June 2015 to January 2019. Prior to joining Intuit, Mr. Aujla held various finance leadership roles at Visa, and investment banking roles at Goldman Sachs and Morgan Stanley. Mr. Aujla holds a Bachelor’s degree in Economics from San Francisco State University and a Master’s degree in Business Administration from the University of Virginia Darden School of Business.\nMr. Hanebrink has been Executive Vice President and Chief Corporate Strategy & Development Officer since 2019. He served as Intuit’s Senior Vice President of Corporate Strategy & Development from November 2016 through January 2019. Prior to rejoining Intuit in November 2016, Mr. Hanebrink served in leadership roles at Block (formerly known as Square) from October 2014 to October 2016. He initially joined Intuit as a Director of Corporate Strategy & Development in January 2011 and subsequently served as Vice President of Corporate Strategy & Development until October 2014. Before joining Intuit, he worked in a variety of venture capital, corporate development, and strategy roles at Opus Capital, Hewlett-Packard, and The Boston Consulting Group. Mr. Hanebrink serves on the board of directors of PubMatic. Mr. Hanebrink holds a Bachelor’s degree in Finance and Marketing from Washington University in St. Louis and a Master’s degree in Business Administration from The Wharton School at the University of Pennsylvania.\nMs. Hilliard has been Executive Vice President and Chief People & Places Officer since August 2025. Prior to that, Ms. Hilliard spent 27 years working in Intuit’s People & Places Organization across all of Intuit’s businesses and functions, including driving critical business outcomes and accelerating growth in both the Consumer and the Global Business Solutions segments. Ms. Hilliard holds a Bachelor’s degree in Business Administration and Management from the University of Redlands.\nMs. McLean has been Executive Vice President, General Counsel and Corporate Secretary since August 2020. Prior to that, she served as Senior Vice President, General Counsel and Corporate Secretary from August 2018 to July 2020 and Vice President, Deputy General Counsel from August 2010 to July 2018. She joined Intuit in 2006 as Director, Deputy General Counsel. Prior to joining Intuit, Ms. McLean spent over six years at Wind River Systems, Inc\n.\n, most recently as the Director of Legal. Prior to joining Wind River, she was an associate at Howard, Rice, Nemerovski, Canady, Falk & Rabkin PC\n \n(now Arnold & Porter Kaye Scholer LLP). Ms. McLean serves on the board of directors of the California Minority Counsel Program. Ms. McLean holds a Bachelor’s degree in International Relations from University of California, Davis and a Juris Doctor from University of California, Hastings College of Law (now University of California College of the Law, San Francisco).\nMs. Hotz has been Senior Vice President and Chief Accounting Officer since August 2022, and previously held roles as Vice President and Chief Accounting Officer from February 2022 to July 2022 and Vice President and Corporate Controller from August 2020 to January 2022. She previously served as the Director, Corporate Accounting from January 2014 to July 2020. Since joining Intuit in 2004, Ms. Hotz has held a variety of accounting leadership roles at the Company. From 2001 to 2004, Ms. Hotz served in corporate controller and finance functions at other public companies. She began her career in public accounting at Coopers & Lybrand LLP (now PricewaterhouseCoopers LLP) from 1996 to 1998, and RSM McGladrey & Pullen \n Intuit\n Fiscal 2025 Form 10-K\n13\nTable\n of Contents\nLLP (now RSM US LLP) from 1998 to 2001. Ms. Hotz is a California Certified Public Accountant (inactive) and holds a Bachelor of Science degree in Accounting from Washington University in St. Louis.\nAVAILABLE INFORMATION\nOur corporate website,\n www.intuit.com\n, provides materials for investors and information relating to Intuit’s corporate governance. The content on any website referred to in this filing is not incorporated by reference into this filing unless expressly noted otherwise. \nWe file reports required of public companies with the Securities and Exchange Commission (SEC). These include annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements, and other reports, and amendments to these reports. The SEC maintains a website at \nwww.sec.gov\n that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. We make available free of charge on the Investor Relations section of our corporate website all of the reports we file with or furnish to the SEC as soon as reasonably practicable after the reports are filed or furnished. Copies of this Annual Report on Form 10-K may also be obtained without charge by contacting Investor Relations, Intuit Inc., P.O. Box 7850, Mountain View, California 94039-7850, by calling 650-944-6000, or by emailing investor_relations@intuit.com.\n14\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents",
  "item7": "ITEM 7 - MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL \n              CONDITION AND RESULTS OF OPERATIONS\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to provide readers of our consolidated financial statements with the perspectives of management. This should allow the readers of this report to obtain a comprehensive understanding of our businesses, strategies, current trends, and future prospects. Our MD&A includes the following sections:\n•\n \nExecutive Overview\n:\n \nHigh-level discussion of our operating results and some of the trends that affect our business.\n•\n \nCritical Accounting Estimates\n:\n Policies and estimates that we believe are important to understanding the assumptions and judgments underlying our financial statements.\n•\n \nResults of Operations\n:\n A more detailed discussion of our revenue and expenses.\n•\n \nLiquidity and Capital Resources\n:\n Discussion of key aspects of our consolidated statements of cash flows, changes in our consolidated balance sheets, and our financial commitments.\nYou should note that this MD&A contains forward-looking statements that involve risks and uncertainties. Please see the section entitled \n“Forward-Looking Statements”\n immediately preceding Part I of this Annual Report for important information to consider when evaluating such statements.\nYou should read this MD&A in conjunction with the consolidated financial statements and related notes in Item 8 of this Annual Report.\nIn the Results of Operations sections of this MD&A, where we describe two or more factors that contributed to changes in revenue and operating income, we have, where possible, quantified the impact of those factors. Where a change is the result of multiple factors that are interrelated and cannot be separately quantified, we have identified the interrelated factors without quantifying them.\nIn July 2024, our management approved, committed to, and initiated a plan of reorganization (the Plan) focused on reallocating resources to our key growth areas. The Plan included the exit of employees and the closing of real estate sites in certain markets to support growing technology teams and capabilities in strategic locations. The actions associated with the Plan were substantially complete in the first quarter of fiscal 2025. Total restructuring costs associated with the Plan were $238 million. During the twelve months ended July 31, 2025 and 2024, we recorded charges in connection with the Plan of $15 million and $223 million, respectively. These charges are primarily related to severance and employee benefits and are recorded to restructuring in our consolidated statements of operations. See Note 15 to the consolidated financial statements in Item 8 of this Annual Report for more information.\nOn August 1, 2024, we renamed our Small Business & Self-Employed segment as the Global Business Solutions segment. This new name better aligns with the global reach of the Mailchimp and QuickBooks platform, our focus on serving both small and mid-market businesses, and our vision to become the all-in-one platform that customers use to grow and run their business.\nOn August 1, 2024, we reorganized certain technology and customer success functions in our Global Business Solutions, Consumer, and ProTax segments that support and benefit our overall platform and are managed at the corporate level rather than at the segment level. As a result of these reorganizations, costs associated with these functions are no longer included in segment operating income and are now included in other corporate expenses. For the twelve months ended July 31, 2024 and 2023, we reclassified $1.4 billion and $1.3 billion from Global Business Solutions, $573 million and $475 million from Consumer, and $33 million and $34 million from ProTax to other corporate expenses, respectively, to conform to the current presentation. See Note 14 to the consolidated financial statements in Item 8 of this Annual Report for more information.\nConsistent with our vision to deliver one consumer platform, effective August 1, 2025, we combined the Consumer, Credit Karma, and ProTax businesses into a single Consumer business. We will reflect this new organization in our fiscal 2026 segment reporting.\nEXECUTIVE OVERVIEW\nThis overview provides a high-level discussion of our operating results and some of the trends that affect our business. We believe that an understanding of these trends is important in order to understand our financial results for fiscal 2025, as well as our future prospects. This summary is not intended to be exhaustive, nor is it a substitute for the detailed discussion and analysis provided elsewhere in this Annual Report on Form 10-K.\n Intuit\n Fiscal 2025 Form 10-K\n33\nTable\n of Contents\nIndustry Trends and Seasonality\nIndustry Trends\nAI, including GenAI, predictive AI, and agentic AI, is transforming multiple industries, in particular financial technology. Disruptive start-ups, emerging ecosystems, and mega-platforms are harnessing new technology to create personalized experiences, deliver data-driven insights, and increase speed of service. These shifts are creating a more dynamic and highly competitive environment where customer expectations are shifting around the world as more services become digitized and the array of choices continues to increase.\nSeasonality\nOur Consumer and ProTax offerings have a significant and distinct seasonal pattern as sales and revenue from our income tax preparation products and services are typically heavily concentrated in the period from November through April. This seasonal pattern typically results in higher net revenues during our second and third quarters ending January 31 and April 30, respectively. \nWe expect the seasonality of our Consumer and ProTax businesses to continue to have a material impact on our quarterly financial results in the future.\nKey Challenges and Risks\nOur growth strategy depends upon our ability to innovate, develop, and introduce emerging technologies, including AI and GenAI, to drive broad adoption of our products and services and enter new markets. Our future growth also increasingly depends on the strength of our third-party business relationships and our ability to continue to develop, maintain, and strengthen new and existing relationships. To remain competitive and continue to grow, we are investing significant resources in our product development, marketing, and sales capabilities, and we expect to continue to do so in the future. Much of our future success also depends on our ability to continue to attract, retain, and develop highly skilled employees, including those in technical and leadership roles who are critical to our strategic growth, in a highly competitive talent environment.\nAs we offer more online services, the ongoing operation and availability of our platforms and systems and those of our external service providers is becoming increasingly important. Because we help customers manage their financial lives, we face risks associated with the hosting, collection, use, and retention of personal customer information and data. We are investing significant management attention and resources in our information technology infrastructure and in our privacy and security capabilities, and we expect to continue to do so in the future.\nWe operate in industries that are experiencing an increasing amount of fraudulent activities by malicious third parties, and those fraudulent activities are becoming increasingly sophisticated, including through the use of AI. We implement additional security measures, and we continue to work with state and federal governments to implement industry-wide security and anti-fraud measures, including sharing information regarding suspicious activity. We continue to invest in security measures and to work with the broader industry and government to protect our customers against this type of fraud.\nOur operations are impacted by a rapidly-evolving regulatory environment and face increasingly heightened scrutiny. We are subject to numerous federal, state, and local, as well as foreign laws and regulations covering a broad and increasing range of subjects, both in the United States (U.S.) and internationally. \nFor a complete discussion of the most significant risks and uncertainties affecting our business, please see \n“Forward-Looking Statements” \nimmediately preceding Part I and\n “Risk Factors”\n in Item 1A of Part I of this Annual Report.\n34\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nOverview of Financial Results\nThe most important financial indicators that we use to assess our business are revenue growth for the company as a whole and for each reportable segment; operating income growth for the company as a whole; earnings per share; and cash flow from operations. We also track certain non-financial drivers of revenue growth and, when material, identify them in the applicable discussions of segment results below. Service offerings are a significant part of our business. Our total service revenue was $16.4 billion, or 87% of our total revenue in fiscal 2025, and we expect our total service revenue as a percentage of our total revenue to grow over the long term.\nKey highlights for fiscal 2025 include the following:\nRevenue of\nGlobal Business Solutions revenue of\nConsumer revenue of\n$18.8 B\n$11.1 B\n$4.9 B\nup 16% from fiscal 2024\nup 16% from fiscal 2024\nup 10% from fiscal 2024\nCredit Karma revenue of \nProTax revenue of\nOperating income of\n$2.3 B\n$621 M\n$4.9 B\nup 32% from fiscal 2024\nup 4% from fiscal 2024\nup 36% from fiscal 2024\nNet income of\nDiluted net income per share of\nCash flow from operations of\n$3.9 B\n$13.67\n$6.2 B\nup 31% from fiscal 2024\nup 31% from fiscal 2024\nup 27% from fiscal 2024\nCRITICAL ACCOUNTING ESTIMATES\nIn preparing our consolidated financial statements in accordance with U.S. generally accepted accounting principles (GAAP), we are required to make estimates, assumptions, and judgments that can have a material impact on our net revenue, operating income or loss, and net income or loss, as well as on the value of certain assets and liabilities on our consolidated balance sheets. Actual results could differ materially from our estimates. Critical accounting estimates are those estimates that involve a significant level of estimations and uncertainty and have had, or are reasonably likely to have, a material impact on our financial condition or results of operations. We believe that the estimates, assumptions, and judgments involved in the following accounting policies have the greatest potential impact on our consolidated financial statements, so we consider these to be our critical accounting estimates: \n•\nRevenue Recognition\n•\nGoodwill, Acquired Intangible Assets, and Other Long-Lived Assets – Impairment Assessments\n•\nLegal Contingencies\n•\nAccounting for Income Taxes\n \n– Estimates of Deferred Taxes, Valuation Allowances, and Uncertain Tax Positions\nOur senior management has reviewed the development and selection of these critical accounting estimates and their disclosure in this Annual Report on Form 10-K with the Audit and Risk Committee of our Board of Directors. For further information on all of our significant accounting policies, see Note 1, “\nDescription of Business and Summary of Significant Accounting Policies\n” to the consolidated financial statements in Item 8 of this Annual Report.\n Intuit\n Fiscal 2025 Form 10-K\n35\nTable\n of Contents\nRevenue Recognition\nWe derive our revenue primarily from the sale of online services such as tax, accounting, payroll, merchant payment processing services, delivery of qualified links, marketing automation, live expert advice, financing for small and mid-market businesses, and desktop software products, desktop software subscriptions, and financial supplies. Our contracts with customers often include promises to transfer multiple products and services, which are primarily recognized ratably over the relevant period or when the customer consumes the related service. In determining how revenue should be recognized, a five-step process is used, which requires judgment and estimates within the revenue recognition process. The primary judgments include identifying the performance obligations in the contract and determining whether the performance obligations are distinct. If any of these judgments were to change, it could cause a material increase or decrease in the amount of revenue we report in a particular period. For additional information, see \n“Description of Business and Summary of Significant Accounting Policies – Revenue Recognition”\n in Note 1 to the consolidated financial statements in Item 8 of this Annual Report.\nGoodwill, Acquired Intangible Assets, and Other Long-Lived Assets – Impairment Assessments\nWe estimate the fair value of acquired intangible assets and other long-lived assets that have finite useful lives whenever an event or change in circumstances indicates that the carrying value of the asset may not be recoverable. We test for potential impairment of goodwill annually in our fourth fiscal quarter or whenever indicators of impairment arise. The timing of the annual test may result in charges to our consolidated statements of operations in our fourth fiscal quarter that could not have been reasonably foreseen in prior periods.\nAs described in \n“Description of Business and Summary of Significant Accounting Policies – Goodwill, Acquired Intangible Assets and Other Long-Lived Assets”\n in Note 1 to the consolidated financial statements in Item 8 of this Annual Report, in order to estimate the fair value of goodwill, we use a weighted combination of a discounted cash flow model (known as the income approach) and comparisons to publicly traded companies engaged in similar businesses (known as the market approach). The income approach requires us to use a number of assumptions, including market factors specific to the business, the amount and timing of estimated future cash flows to be generated by the business over an extended period of time, long-term growth rates for the business, and a rate of return that considers the relative risk of achieving the cash flows and the time value of money. We evaluate cash flows at the reporting unit level. Although the assumptions we use in our discounted cash flow model are consistent with the assumptions we use to generate our internal strategic plans and forecasts, significant judgment is required to estimate the amount and timing of future cash flows from each reporting unit and the relative risk of achieving those cash flows. When using the market approach, we make judgments about the comparability of publicly traded companies engaged in similar businesses. We base our judgments on factors such as size, growth rates, profitability, risk, and return on investment. We also make judgments when adjusting market multiples of revenue, operating income, and earnings for these companies to reflect their relative similarity to our own businesses. See Note 6 to the consolidated financial statements in Item 8 of this Annual Report for a summary of goodwill by reportable segment.\nWe estimate the recoverability of acquired intangible assets and other long-lived assets that have finite useful lives by comparing the carrying amount of the asset to the future undiscounted cash flows that we expect the asset to generate. In order to estimate the fair value of those assets, we estimate the present value of future cash flows from those assets. The key assumptions that we use in our discounted cash flow model are the amount and timing of estimated future cash flows to be generated by the asset over an extended period of time and a rate of return that considers the relative risk of achieving the cash flows and the time value of money. Significant judgment is required to estimate the amount and timing of future cash flows and the relative risk of achieving those cash flows. We also make judgments about the remaining useful lives of acquired intangible assets and other long-lived assets that have finite lives. See Note 6 to the consolidated financial statements in Item 8 of this Annual Report for a summary of cost, accumulated amortization, and weighted-average life in years for our acquired intangible assets.\nAssumptions and estimates about future values and remaining useful lives are complex and often subjective. They can be affected by a variety of factors, including external factors such as industry and economic trends, and internal factors such as changes in our business strategy and our internal forecasts. For example, if our future operating results do not meet current forecasts or if we experience a sustained decline in our market capitalization that is determined to be indicative of a reduction in fair value of one or more of our reporting units, we may be required to record future impairment charges for goodwill and acquired intangible assets. Impairment charges could materially decrease our future net income and result in lower asset values on our consolidated balance sheets.\nDuring the fourth quarters of fiscal 2025, fiscal 2024, and fiscal 2023, we performed our annual goodwill impairment tests. Using the methodology described in \n“Description of Business and Summary of Significant Accounting Policies – Goodwill, Acquired Intangible Assets and Other Long-Lived Assets,”\n in Note 1 to the consolidated financial statements in Item 8 of this Annual Report, we determined that the estimated fair values of all of our reporting units substantially exceeded their carrying values and that they were not impaired.\nLegal Contingencies\nWe are subject to certain legal proceedings, as well as demands, claims, and threatened litigation that arise in the normal course of our business. We review the status of each significant matter quarterly and assess our potential financial exposure. If the potential loss from any claim or legal proceeding is considered probable and the amount can be reasonably estimated, we \n36\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nrecord a liability and an expense for the estimated loss. If we determine that a loss is reasonably possible and the range of the loss can be reasonably determined, then we disclose the range of the possible loss. Significant judgment is required in the determination of whether a potential loss is probable, reasonably possible, or remote, as well as in the determination of whether a potential exposure is reasonably estimable. Our accruals are based on the best information available at the time. As additional information becomes available, we reassess the potential liability related to our pending claims and legal proceedings and may revise our estimates. Potential legal liabilities and the revision of estimates of potential legal liabilities could have a material impact on our financial position and results of operations. See Note 13 to the consolidated financial statements in Item 8 of this Annual Report for more information.\nAccounting for Income Taxes – Estimates of Deferred Taxes, Valuation Allowances, and Uncertain Tax Positions\nWe estimate our income taxes based on the various jurisdictions where we conduct business. Significant judgment is required in determining our worldwide income tax provision. The calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax rules and the potential for future adjustment of our uncertain tax positions by the U.S. Internal Revenue Service or other taxing jurisdictions. We estimate our current tax liability and assess temporary differences that result from differing treatments of certain items for tax and accounting purposes. These differences result in deferred tax assets and liabilities, which we show on our consolidated balance sheets. We must then assess the likelihood that our deferred tax assets will be realized. To the extent we believe that realization is not likely, we establish a valuation allowance. When we establish a valuation allowance or increase this allowance in an accounting period, we record a corresponding tax expense in our consolidated statements of operations.\nWe record a valuation allowance to reflect uncertainties about whether we will be able to utilize our deferred tax assets before they expire. We assess the need for an adjustment to the valuation allowance on a quarterly basis. The assessment is based on our estimates of future sources of taxable income in the jurisdictions in which we operate and the periods over which our deferred tax assets will be realizable. While we have considered future taxable income in assessing the need for a valuation allowance for the periods presented, we could in the future be required to increase the valuation allowance to take into account additional deferred tax assets that we may be unable to realize. An increase in the valuation allowance could have an adverse impact on our income tax provision and net income in the period in which we record the change.\nWe recognize and measure benefits for uncertain tax positions using a two-step approach. The first step is to evaluate the tax position taken or expected to be taken in a tax return by determining if the weight of available evidence indicates that it is more likely than not that the tax position will be sustained upon audit, including resolution of any related appeals or litigation processes. For tax positions that are more likely than not of being sustained upon audit, the second step is to measure the tax benefit as the largest amount that is more than 50% likely of being realized upon settlement. Significant judgment is required to evaluate uncertain tax positions. We evaluate our uncertain tax positions on a quarterly basis. Our evaluations are based upon a number of factors, including changes in facts or circumstances, changes in tax law, correspondence with tax authorities during the course of audits, and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in material increases or decreases in our income tax expense in the period in which we make the change, which could have a material impact on our effective tax rate and operating results. See Note 10 to the consolidated financial statements in Item 8 of this Annual Report for more information.\n Intuit\n Fiscal 2025 Form 10-K\n37\nTable\n of Contents\nRESULTS OF OPERATIONS\nA discussion regarding our financial condition and results of operations for fiscal 2025 compared to fiscal 2024 is presented below. A discussion regarding our financial condition and results of operations for fiscal 2024 compared to fiscal 2023 can be found under Item 7 of Part II in our Annual Report on Form 10-K for the fiscal year ended July 31, 2024, filed with the SEC on September 4, 2024, which is available free of charge on the SEC’s website at \nwww.sec.gov\n and on the Investor Relations section of our corporate website at \ninvestors.intuit.com\n.\nFinancial Overview\n(Dollars in millions, except per share amounts)\nFiscal \n2025\nFiscal \n2024\nFiscal \n2023\n2025-2024\n% Change\n2024-2023\n% Change\nTotal net revenue\n$18,831 \n$16,285 \n$14,368 \n16\n%\n13\n%\nOperating income\n4,923 \n3,630 \n3,141 \n36\n%\n16\n%\nNet income\n3,869 \n2,963 \n2,384 \n31\n%\n24\n%\nDiluted net income per share\n$13.67 \n$10.43 \n$8.42 \n31\n%\n24\n%\nTotal net revenue increased $2.5 billion, or 16%, in fiscal 2025 compared with fiscal 2024. Global Business Solutions segment revenue increased 16% due to growth in our Online Ecosystem revenue. Credit Karma revenue increased 32% due to strength in our personal loan, credit card, and auto insurance verticals. Consumer segment revenue increased 10% due to growth in our higher-priced and additional service offerings, such as TurboTax Live and our early tax refund offerings. See \n“Segment Results”\n later in this Item 7 for more information.\nOperating income increased $1.3 billion, or 36%, in fiscal 2025 compared with fiscal 2024. The increase in operating income was due to the increase in revenue described above partially offset by an increase in expenses. Expenses increased due to increases in marketing, staffing, outside services, and sales-related expenses partially offset by a decrease in restructuring expenses. See \n“Operating Expenses”\n later in this Item 7 for more information. See Note 15 to the consolidated financial statements in Item 8 of this Annual Report for more information on our restructuring charges.\nNet income increased $906 million, or 31%, in fiscal 2025 compared with fiscal 2024. The increase in net income was due to the increase in operating income described above, partially offset by an increase in income tax expense. The increase in income tax expense is due to the increase in operating income described above and a decrease in excess tax benefits related to share-based compensation. Diluted net income per share increased 31% to $13.67 for fiscal 2025, in line with the increase in net income.\nSegment Results\nThe information below is organized in accordance with our four reportable segments. All of our segments operate and sell to customers primarily in the U.S. Total international net revenue was approximately 8% of consolidated total net revenue in each of the twelve months ended July 31, 2025, 2024, and 2023.\nOn August 1, 2024, we renamed our Small Business & Self-Employed segment as the Global Business Solutions segment. This new name better aligns with the global reach of the Mailchimp and QuickBooks platform, our focus on serving both small and mid-market businesses, and our vision to become the all-in-one platform that customers use to grow and run their business. \nOn August 1, 2024, we reorganized certain technology and customer success functions in our Global Business Solutions, Consumer, and ProTax segments that support and benefit our overall platform and are managed at the corporate level rather than at the segment level. As a result of these reorganizations, costs associated with these functions are no longer included in segment operating income and are now included in other corporate expenses. For the twelve months ended July 31, 2024 and 2023, we reclassified $1.4 billion and $1.3 billion from Global Business Solutions, $573 million and $475 million from Consumer, and $33 million and $34 million from ProTax to other corporate expenses, respectively, to conform to the current presentation.\nSegment operating income is segment net revenue less segment cost of revenue and operating expenses. We include expenses such as corporate selling and marketing, general and administrative, and non-employment related legal and litigation settlement costs, which are not allocated to specific segments, in unallocated corporate items as part of other corporate expenses. As part of our platform strategy, we also include customer success and product development for our Global Business Solutions, Consumer, and ProTax segments in unallocated corporate items as we do not allocate these expenses to the segments because they are managed at the platform level. Customer success includes the costs of tax and bookkeeping experts that support our TurboTax Live and QuickBooks Live offerings. For our Credit Karma reportable segment, segment expenses include certain direct expenses related to selling and marketing, product development, and general and administrative. Unallocated corporate items for all segments include share-based compensation, amortization of acquired technology, amortization of other acquired intangible assets, goodwill and intangible asset impairment charges, professional fees and transaction charges related to business combinations, and restructuring charges. These unallocated \n38\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\ncorporate costs for all segments totaled $8.7 billion in fiscal 2025, $8.0 billion in fiscal 2024, and $7.0 billion in fiscal 2023. Unallocated corporate items increased in fiscal 2025 compared with fiscal 2024 due to increases in cost of service revenue, research and development expense, and general and administrative expense, partially offset by a decrease in restructuring costs. See Note 14 to the consolidated financial statements in Item 8 of this Annual Report for reconciliations of total segment operating income to consolidated operating income for each fiscal year presented.\n Intuit\n Fiscal 2025 Form 10-K\n39\nTable\n of Contents\n Global Business Solutions\nGlobal Business Solutions segment revenue includes both Online Ecosystem and Desktop Ecosystem revenue.\nOur Online Ecosystem includes revenue from:\n•\nQuickBooks Online and Intuit Enterprise Suite financial and business management offerings;\n•\nQuickBooks Live;\n•\nWorkforce solutions, including QuickBooks Online Payroll and QuickBooks Time;\n•\nMoney offerings for businesses that use online offerings, which include merchant payment processing and bill pay services, and financing for small and mid-market businesses (QuickBooks Capital);\n•\nMailchimp’s marketing automation offerings; and\n•\nQuickBooks Checking. \nOur Desktop Ecosystem includes revenue from:\n•\nQuickBooks Desktop software subscriptions (QuickBooks Desktop Plus, QuickBooks Enterprise, and ProAdvisor Program memberships for the accounting professionals who serve small businesses);\n•\nDesktop workforce solutions, including payroll products);\n•\nMoney offerings for businesses that use desktop offerings, which include merchant payment processing services and financing for small and mid-market businesses (QuickBooks Capital); and\n•\nFinancial supplies.\nSegment service revenue is primarily derived from our Online Ecosystem revenue and revenue from the services, support, and when-and-if-available product upgrades and enhancements that are provided as part of our QuickBooks Desktop subscriptions; services and support for our desktop payroll offerings, and merchant payment processing services. Segment product and other revenue is primarily derived from revenue related to delivery of software licenses, version protection updates, and payroll software updates for our QuickBooks Desktop subscriptions and desktop payroll offerings, which are part of our Desktop Ecosystem. \n(Dollars in millions)\nFiscal \n2025\nFiscal \n2024\nFiscal \n2023\n2025-2024\n% Change\n2024-2023\n% Change\nService revenue\n$\n9,325 \n$\n7,792 \n$\n6,641 \n \n \nProduct and other revenue\n1,752 \n1,741 \n1,397 \n \n \nTotal segment revenue\n$\n11,077 \n$\n9,533 \n$\n8,038 \n16\n%\n19\n%\n% of total revenue\n59\n%\n59\n%\n56\n%\nSegment operating income\n$\n8,467 \n$\n7,157 \n$\n5,900 \n18\n%\n21\n%\n% of related revenue\n76\n%\n75\n%\n73\n%\n \n \n40\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nRevenue classified by significant service and product offerings was as follows:\n(Dollars in millions)\nFiscal \n2025\nFiscal \n2024\nFiscal \n2023\n2025-2024\n% Change\n2024-2023\n% Change\nNet revenue:\n \n \nQuickBooks Online Accounting\n$\n4,120 \n$\n3,379 \n$\n2,849 \n22\n%\n19\n%\nOnline Services\n4,182 \n3,513 \n2,910 \n19\n%\n21\n%\nTotal Online Ecosystem\n8,302 \n6,892 \n5,759 \n20\n%\n20\n%\nQuickBooks Desktop Accounting\n1,672 \n1,575 \n1,211 \n6\n%\n30\n%\nDesktop Services and Supplies\n1,103 \n1,066 \n1,068 \n3\n%\n—\n%\nTotal Desktop Ecosystem\n2,775 \n2,641 \n2,279 \n5\n%\n16\n%\nTotal Global Business Solutions\n$\n11,077 \n$\n9,533 \n$\n8,038 \n16\n%\n19\n%\nRevenue for our Global Business Solutions segment increased $1.5 billion, or 16%, in fiscal 2025 compared with fiscal 2024. The increase was due to growth in Online Ecosystem revenue, which contributed to $1.4 billion of the increase for fiscal 2025.\nOnline Ecosystem\nOnline Ecosystem revenue increased $1.4 billion, or 20%, in fiscal 2025 compared with fiscal 2024. QuickBooks Online Accounting revenue increased $741 million, or 22%, in fiscal 2025 compared with fiscal 2024 due to the interrelated factors of higher effective prices, customer growth, and mix-shift. Online Services revenue increased $669 million, or 19%, in fiscal 2025 compared with fiscal 2024 due to increases in revenue from our money offerings of $379 million, our payroll offerings of $279 million, and Mailchimp of $20 million. Revenue increases were due to the interrelated factors described below. Money revenue increased $379 million due to a $242 million increase in payments revenue from payments customer growth, an increase in total payment volume per customer, and higher effective payments prices, and due to a $137 million increase from QuickBooks Capital. Online payroll revenue increased due to customer growth, mix-shift, and higher effective prices. Mailchimp revenue increased due to higher effective prices.\nOnline Ecosystem average revenue per customer, which we define as total online ecosystem revenue divided by the average number of online paying customers, increased 14% for fiscal 2025 compared with fiscal 2024. Online ecosystem paying customers, which we define as the sum of all QuickBooks Online customers, QuickBooks Time customers, Mailchimp paying customers, and customers who subscribe to standalone services outside of QuickBooks Online, increased 5% as of July 31, 2025 compared with July 31, 2024.\nDesktop Ecosystem\nDesktop Ecosystem revenue increased $134 million, or 5%, in fiscal 2025 compared with fiscal 2024. The increase was due to higher effective prices and changes we made to our QuickBooks desktop offerings beginning in early fiscal 2024 to complete the transition to a recurring subscription model, which more closely aligns our Desktop license and related product updates to our Desktop subscription billing model.\nGlobal Business Solutions segment operating income increased $1.3 billion, or 18%, in fiscal 2025 compared with fiscal 2024 due to the increase in revenue described above, partially offset by increases in staffing expenses of $59 million, marketing expenses of $45 million, QuickBooks Capital cost of revenue of $42 million due to increased loan volume, online payments cost of revenue of $41 million due to an increase in payments volume, and sales-related expenses of $22 million.\nIn August 2024, we reorganized certain technology and customer success functions that support and benefit the overall platform and are managed at the corporate level rather than at the segment level. As a result, these costs are no longer included in segment operating income and are now included in other corporate expenses. For the twelve months ended July 31, 2024 and 2023, we reclassified $1.4 billion and $1.3 billion, respectively, from Global Business Solutions to other corporate expenses to conform to the current presentation.\n Intuit\n Fiscal 2025 Form 10-K\n41\nTable\n of Contents\n Consumer \nConsumer segment service revenue is derived primarily from TurboTax Online and TurboTax Live offerings, electronic tax filing services, and connected services.\nConsumer segment product and other revenue is derived primarily from TurboTax desktop tax return preparation software and related form updates.\n(Dollars in millions)\nFiscal \n2025\nFiscal \n2024\nFiscal \n2023\n2025-2024\n% Change\n2024-2023\n% Change\nService revenue\n$\n4,649 \n$\n4,214 \n$\n3,915 \n \n \nProduct and other revenue\n221 \n231 \n220 \n \n \nTotal segment revenue\n$\n4,870 \n$\n4,445 \n$\n4,135 \n10\n%\n7\n%\n% of total revenue\n26 \n%\n27 \n%\n29 \n%\nSegment operating income\n$\n3,786 \n$\n3,493 \n$\n3,350 \n8\n%\n4\n%\n% of related revenue\n78 \n%\n79 \n%\n81 \n%\n \n \nRevenue for our Consumer segment increased $425 million, or 10%, in fiscal 2025 compared with fiscal 2024 due to growth in our higher-priced and additional service offerings, such as TurboTax Live and our early tax refund offerings.\nConsumer segment operating income increased $293 million, or 8%, in fiscal 2025 compared with fiscal 2024 due to the increase in revenue described above, partially offset by an increase in marketing expenses of $132 million.\nIn August 2024, we reorganized certain technology and customer success functions that support and benefit the overall platform and are managed at the corporate level rather than at the segment level. As a result, these costs are no longer included in segment operating income and are now included in other corporate expenses. For the twelve months ended July 31, 2024 and 2023, we reclassified $573 million and $475 million, respectively, from Consumer to other corporate expenses to conform to the current presentation.\n42\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\n Credit Karma\nCredit Karma segment revenue is primarily derived from cost-per-action transactions, which include the delivery of qualified links that result in completed actions such as credit card issuances and personal loan funding; cost-per-click and cost-per-lead transactions, which include user clicks on advertisements or advertisements that allow for the generation of leads, and primarily relate to mortgage and insurance businesses; and Credit Karma Money.\n(Dollars in millions)\nFiscal \n2025\nFiscal \n2024\nFiscal \n2023\n2025-2024\n% Change\n2024-2023\n% Change\nService revenue\n$\n2,263 \n$\n1,708 \n$\n1,634 \n \n \nProduct and other revenue\n— \n— \n— \nTotal segment revenue\n$\n2,263 \n$\n1,708 \n$\n1,634 \n32\n%\n5\n%\n% of total revenue\n12 \n%\n10 \n%\n11 \n%\nSegment operating income\n$\n835 \n$\n414 \n$\n428 \n102\n%\n(3\n%)\n% of related revenue\n37 \n%\n24 \n%\n26 \n%\n \n \nRevenue for our Credit Karma segment increased $555 million, or 32%, in fiscal 2025 compared with fiscal 2024 due to increases in revenue from our personal loan vertical of $221 million, our credit card vertical of $213 million, and our auto insurance vertical of $99 million.\nCredit Karma segment operating income increased $421 million, or 102%, in fiscal 2025 compared with fiscal 2024 due to the increase in revenue described above, partially offset by an increase in marketing expenses of $120 million.\n Intuit\n Fiscal 2025 Form 10-K\n43\nTable\n of Contents\n ProTax\nProTax segment service revenue is derived primarily from ProConnect Tax Online tax products, electronic tax filing services, connected services, and bank products.\nProTax segment product and other revenue is derived primarily from Lacerte, ProSeries, and ProFile desktop tax preparation software products, and related form updates.\n(Dollars in millions)\nFiscal \n2025\nFiscal \n2024\nFiscal \n2023\n2025-2024\n% Change\n2024-2023\n% Change\nService revenue\n$\n163 \n$\n147 \n$\n127 \n \n \nProduct and other revenue\n458 \n452 \n434 \nTotal segment revenue\n$\n621 \n$\n599 \n$\n561 \n4\n%\n7\n%\n% of total revenue\n3 \n%\n4 \n%\n4 \n%\nSegment operating income\n$\n533 \n$\n520 \n$\n489 \n3\n%\n6\n%\n% of related revenue\n86 \n%\n87 \n%\n87 \n%\n \n \nRevenue for our ProTax segment increased $22 million, or 4%, in fiscal 2025 compared with fiscal 2024 due to higher average revenue per customer.\nProTax segment operating income increased $13 million, or 3%, in fiscal 2025 compared with fiscal 2024 due to the increase in revenue described above, partially offset by an increase in marketing expenses of $6 million.\nIn August 2024, we reorganized certain technology and customer success functions that support and benefit the overall platform and are managed at the corporate level rather than at the segment level. As a result, these costs are no longer included in segment operating income and are now included in other corporate expenses. For the twelve months ended July 31, 2024 and 2023, we reclassified $33 million and $34 million, respectively, from ProTax to other corporate expenses to conform to the current presentation.\n44\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nCost of Revenue\n(Dollars in millions)\nFiscal \n2025\n% of \nRelated\nRevenue\nFiscal \n2024\n% of \nRelated\nRevenue\nFiscal \n2023\n% of \nRelated\nRevenue\nCost of service revenue\n$\n3,624 \n22\n%\n$\n3,250 \n23\n%\n$\n2,908 \n24\n%\nCost of product and other revenue\n68 \n3\n%\n69 \n3\n%\n72 \n4\n%\nAmortization of acquired technology\n156 \nN/A\n146 \nN/A\n163 \nN/A\nTotal cost of revenue\n$\n3,848 \n20\n%\n$\n3,465 \n21\n%\n$\n3,143 \n22\n%\nOur cost of revenue has three components: (1) cost of service revenue, which includes the direct costs associated with our online and service offerings, such as staffing costs for ongoing production support, customer support, and tax and bookkeeping experts that support our TurboTax Live and QuickBooks Live offerings, costs for data processing and storage capabilities from cloud providers, and costs related to credit score providers; (2) cost of product and other revenue, which includes the direct costs of manufacturing and shipping or electronically downloading our desktop software and financial supplies products; and (3) amortization of acquired technology, which represents the cost of amortizing developed technologies that we have obtained through acquisitions, over their useful lives.\nCost of service revenue as a percentage of service revenue was relatively consistent in fiscal 2025 compared to fiscal 2024.\nCost of product and other revenue as a percentage of product and other revenue was flat in fiscal 2025 compared with fiscal 2024. Costs of product and other revenue are expensed as incurred, and we do not defer any of these costs when product and other revenue is deferred.\nOperating Expenses\n(Dollars in millions)\nFiscal \n2025\n% of\nTotal\nNet \nRevenue\nFiscal \n2024\n% of\nTotal\nNet \nRevenue\nFiscal \n2023\n% of\nTotal\nNet \nRevenue\nSelling and marketing\n$\n5,035 \n27\n%\n$\n4,312 \n26\n%\n$\n3,762 \n26\n%\nResearch and development\n2,928 \n15\n%\n2,754 \n17\n%\n2,539 \n18\n%\nGeneral and administrative\n1,601 \n8\n%\n1,418 \n9\n%\n1,300 \n9\n%\nAmortization of other acquired intangible assets\n481 \n3\n%\n483 \n3\n%\n483 \n3\n%\nRestructuring\n15 \n—\n%\n223 \n1\n%\n— \n—\n%\nTotal operating expenses\n$\n10,060 \n53\n%\n$\n9,190 \n56\n%\n$\n8,084 \n56\n%\nTotal operating expenses as a percentage of total net revenue decreased in fiscal 2025 compared to fiscal 2024. Total net revenue increased $2.5 billion, or 16%, and total operating expenses increased $870 million, or 9%. The increase in total operating expenses was due to increases of $410 million for marketing expenses, $300 million for staffing expenses, $161 million for outside services, and $52 million for sales-related expenses, partially offset by a $208 million\n \ndecrease in restructuring charges. See Note 15 to the consolidated financial statements in Item 8 of this Annual Report for more information regarding restructuring charges.\nNon-Operating Income and Expenses\nInterest Expense\nInterest expense of $247 million in fiscal 2025 consisted of interest on our senior unsecured notes, unsecured revolving credit facility, and commercial paper program. Interest expense of $242 million in fiscal 2024 consisted of interest on our senior unsecured notes and unsecured term loan.\n Intuit\n Fiscal 2025 Form 10-K\n45\nTable\n of Contents\nInterest and Other Income, Net\n(In millions)\nFiscal 2025\nFiscal 2024\nFiscal 2023\nInterest income\n \n(1)\n$\n175 \n$\n147 \n$\n106 \nNet \ngain\n on executive deferred compensation plan assets\n \n(2)\n24 \n24 \n12 \nOther\n \n(3)\n(41)\n(9)\n(22)\nTotal interest and other income, net\n$\n158 \n$\n162 \n$\n96 \n(1) \nInterest income increased in fiscal 2025 compared to fiscal 2024 due to higher average investable balances.\n(2)\n In accordance with authoritative guidance, we record gains and losses associated with executive deferred compensation plan assets in interest and other income, and gains and losses associated with the related liabilities in operating expenses. The total amounts recorded in operating expenses for each period are approximately equal to the total amounts recorded in interest and other income in those periods.\n(3)\n During fiscal 2025, we recorded $51 million in net losses on long-term investments.\nIncome Taxes\nOur effective tax rate for fiscal 2025 was approximately 20%. Excluding certain tax benefits primarily related to share-based compensation, our effective tax rate was approximately 24%. This rate differed from the federal statutory rate of 21% primarily due to state income taxes and non-deductible share-based compensation, which were partially offset by the benefit we received from the federal research and experimentation credit. \nOur effective tax rate for fiscal 2024 was approximately 17%. Excluding certain tax benefits primarily related to share-based compensation, our effective tax rate was approximately 24%. This rate differed from the federal statutory rate of 21% primarily due to state income taxes and non-deductible share-based compensation, which were partially offset by the benefit we received from the federal research and experimentation credit. See Note 10 to the consolidated financial statements in Item 8 of this Annual Report for more information about our effective tax rates.\nAt July 31, 2025, we had net deferred tax assets of $1.2 billion, which included a valuation allowance for California net deferred tax assets primarily related to state research and experimentation tax credit carryforwards. We have also provided a valuation allowance on other non-California state operating loss and foreign operating loss carryforwards. See “Critical Accounting Estimates” earlier in this Item 7 and Note 10 to the consolidated financial statements in Item 8 of this Annual Report for more information. \nOn July 4, 2025, the U.S. federal government enacted the One Big Beautiful Bill Act (OBBBA), which includes significant tax changes, most notably the reinstatement of the immediate expensing of domestic research and developmental expenditures, effective in fiscal 2026. The deductibility of these expenditures is expected to significantly reduce our deferred tax assets and income tax payable for periods starting in fiscal 2026.\nThe OBBBA has multiple effective dates from fiscal 2025 through fiscal 2027. The provisions effective during fiscal 2025 did not have a significant impact on our fiscal 2025 consolidated financial statements. We are currently assessing all applicable provisions of the legislation and their impact on our consolidated financial statements for fiscal 2026 and beyond.\nIn 2021, the Organisation for Economic Co-operation and Development (OECD) announced Pillar Two Model Rules, which call for the taxation of large multinational corporations at a minimum rate of 15%. The currently enacted Pillar Two Model Rules did not have any impact on our provision for income taxes and are not expected to have any significant impact on future years’ provisions for income taxes. We continue to monitor developments and evaluate impacts, if any, of these provisions on our results of operations and cash flows for future years.\nIn the current global tax policy environment, the U.S. and other domestic and foreign governments continue to consider, and in some cases enact, changes in corporate tax laws. As changes occur, we account for finalized legislation in the period of enactment.\n46\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nOverview\nAt July 31, 2025, our cash, cash equivalents, and investments totaled $4.6 billion, an increase of $478 million from July 31, 2024, driven by cash from operations partially offset by cash used in financing and investing activities. See the discussion of all factors described in \n“Statements of Cash Flows”\n below. Our primary sources of liquidity have been cash from operations, which primarily includes the collection of accounts receivable for products and services, the issuance of senior unsecured notes and commercial paper, and borrowings under our credit facilities. Our primary uses of cash have been for research and development programs, selling and marketing activities, acquisitions of businesses, repurchases of our common stock under our stock repurchase programs, the payment of cash dividends, debt service costs and debt repayment, capital projects, and funding of our financing for small and mid-market businesses and early tax refund offerings. As discussed in \n“Executive Overview – Industry Trends and Seasonality”\n earlier in this Item 7, our business is subject to significant seasonality. The balance of our cash, cash equivalents, and investments generally fluctuates with that seasonal pattern. We believe the seasonality of our business is likely to continue in the future.\nThe following table summarizes selected measures of our liquidity and capital resources at the dates indicated:\n(Dollars in millions)\nJuly 31,\n2025\nJuly 31,\n2024\n$\nChange\n%\nChange\nCash, cash equivalents, and investments\n$\n4,552 \n$\n4,074 \n$\n478 \n12 \n%\nLong-term investments\n94 \n131 \n(37)\n(28)\n%\nShort-term debt\n— \n499 \n(499)\n(100)\n%\nLong-term debt\n5,973 \n5,539 \n434 \n8 \n%\nWorking capital\n3,737 \n2,187 \n1,550 \n71 \n%\nRatio of current assets to current liabilities\n1.4 : 1\n1.3 : 1\nWe have historically generated significant cash from operations, and we expect to continue to do so during fiscal 2026. Our cash, cash equivalents, and investments totaled $4.6 billion at July 31, 2025. None of those funds were restricted, and approximately 91% of those funds were located in the U.S.\nOur unsecured revolving credit facility and commercial paper program are available to us for general corporate purposes. At July 31, 2025, no amounts were outstanding under the unsecured revolving credit facility or the commercial paper program. See Note 7 to the consolidated financial statements in Item 8 of this Annual Report for more information.\nOur secured revolving credit facilities are available to fund the lending products and services we offer to qualified small and mid-market businesses. At July 31, 2025, $1.0 billion was outstanding under our secured revolving credit facilities.\nBased on past performance and current expectations, we believe that our cash and cash equivalents, investments, cash generated from operations, borrowing capacity under our credit facilities and commercial paper program, and access to external financing will be sufficient to meet anticipated seasonal working capital needs, capital expenditure requirements, contractual obligations, commitments, debt service requirements, and other liquidity requirements associated with our operations for the next 12 months and the foreseeable future.\nWe expect to return excess cash generated by operations to our stockholders through repurchases of our common stock and payment of cash dividends, after taking into account our operating and strategic cash needs. \nWe evaluate, on an ongoing basis, the merits of acquiring technology or businesses, or establishing strategic relationships with and investing in other companies. Our strong liquidity profile enables us to quickly respond to these types of opportunities.\n Intuit\n Fiscal 2025 Form 10-K\n47\nTable\n of Contents\nStatements of Cash Flows\nThe following table summarizes selected items from our consolidated statements of cash flows for fiscal 2025, fiscal 2024, and fiscal 2023. See the consolidated financial statements in Item 8 of this Annual Report for complete consolidated statements of cash flows for those periods.\nFiscal\nFiscal\nFiscal\n(In millions)\n2025\n2024\n2023\nNet cash provided by (used in):\n \n \n \nOperating activities\n$\n6,207 \n$\n4,884 \n$\n5,046 \nInvesting activities\n(2,318)\n(227)\n(922)\nFinancing activities\n(1,510)\n(397)\n(4,269)\nEffect of exchange rates on cash, cash equivalents, restricted cash, and restricted cash equivalents\n3 \n(13)\n— \nNet increase (decrease) in cash, cash equivalents, restricted cash, and restricted cash equivalents\n$\n2,382 \n$\n4,247 \n$\n(145)\nDuring fiscal 2025, we generated $6.2 billion in cash from operations. We also received $3.1 billion from the net increase in funds receivable and funds payable and amounts due to customers, $429 million from net borrowings under our secured credit facilities, and $398 million from the issuance of common stock under employee stock plans. During the same period, we used $2.8 billion for the repurchase of shares of our common stock under our stock repurchase programs, $1.2 billion for the payment of cash dividends, $1.2 billion for the net purchases of investments, $982 million for payments for employee taxes withheld upon vesting of restricted stock units, $724 million for net originations of notes receivable, $500 million for the repayment of debt, $184 million for a business acquisition, and $124 million for capital expenditures.\nDuring fiscal 2024, we generated $4.9 billion in cash from operations. We also received $4.0 billion from the issuance of unsecured senior notes, $3.4 billion from the net increase in funds receivable and funds payable and amounts due to customers, $422 million from the net sales and maturities of investments, $282 million from the issuance of common stock under employee stock plans, and $155 million from net borrowings under our secured credit facilities. During the same period, we used $4.2 billion for the repayment of debt, $2.0 billion for the repurchase of shares of our common stock under our stock repurchase programs, $1.0 billion for the payment of cash dividends, $1.0 billion for payments for employee taxes withheld upon vesting of restricted stock units, $250 million for capital expenditures, and $236 million for net originations of notes receivables. \nStock Repurchase Programs and Dividends on Common Stock\nAs described in Note 11 to the financial statements in Item 8 of this Annual Report, during fiscal 2025 and fiscal 2024, we continued to repurchase shares of our common stock under a series of repurchase programs that our Board of Directors has authorized. At July 31, 2025, we had authorization from our Board of Directors for up to $2.1 billion in stock repurchases. On August 19, 2025, our Board of Directors approved an increase in the authorization under the existing stock repurchase program under which we are authorized to repurchase up to an additional $3.2 billion of our common stock. We currently expect to continue repurchasing our common stock on a quarterly basis; however, future stock repurchases under the current program are at the discretion of management, and authorization of future stock repurchase programs is subject to the final determination of our Board of Directors.\nWe have continued to pay quarterly cash dividends on shares of our outstanding common stock. During fiscal 2025, we declared cash dividends that totaled $4.16 per share of outstanding common stock, or approximately $1.2 billion. In August 2025, our Board of Directors declared a quarterly cash dividend of $1.20 per share of outstanding common stock payable on October 17, 2025 to stockholders of record at the close of business on October 9, 2025. We currently expect to continue to pay comparable cash dividends on a quarterly basis; however, future declarations of dividends and the establishment of future record dates and payment dates are subject to the final determination of our Board of Directors.\nCommitments for Senior Unsecured Notes\nIn June 2020, we issued $2 billion of senior unsecured notes, of which $1.0 billion is outstanding as of July 31, 2025, and is comprised of the following:\n•\n$500 million of 1.350% notes due July 2027; and\n•\n$500 million of 1.650% notes due July 2030 (together, the 2020 Notes).\n48\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nInterest is payable semiannually on January 15 and July 15 of each year. At July 31, 2025, our maximum commitment for interest payments was $55 million for the remaining duration of the outstanding 2020 Notes.\nThe 2020 Notes are senior unsecured obligations of Intuit and rank equally with all existing and future unsecured and unsubordinated indebtedness of Intuit and are redeemable by us at any time, subject to a make-whole premium. Upon the occurrence of change of control transactions that are accompanied by certain downgrades in the credit ratings of the 2020 Notes, we will be required to repurchase the 2020 Notes at a repurchase price equal to 101% of the aggregate outstanding principal plus any accrued and unpaid interest to but not including the date of repurchase. The indenture governing the 2020 Notes requires us to comply with certain covenants. For example, the 2020 Notes limit our ability to create certain liens and enter into sale and leaseback transactions. As of July 31, 2025, we were compliant with all covenants governing the 2020 Notes. See Note 7 to the consolidated financial statements in Item 8 of this Annual Report for more information.\nIn September 2023, we issued $4 billion of senior unsecured notes comprised of the following:\n•\n$750 million of 5.250% notes due September 2026;\n•\n$750 million of 5.125% notes due September 2028;\n•\n$1,250 million of 5.200% notes due September 2033; and\n•\n$1,250 million of 5.500% notes due September 2053 (together, the 2023 Notes).\nInterest is payable semiannually on March 15 and September 15 of each year. At July 31, 2025, our maximum commitment for interest payments was $2.7 billion for the remaining duration of the outstanding 2023 Notes.\nThe 2023 Notes are senior unsecured obligations of Intuit and rank equally with all existing and future unsecured and unsubordinated indebtedness of Intuit and are redeemable by us at any time, subject to a make-whole premium. The indenture governing the 2023 Notes requires us to comply with certain covenants. For example, the 2023 Notes limit our ability to create certain liens and enter into sale and leaseback transactions. As of July 31, 2025, we were compliant with all covenants governing the 2023 Notes. See Note 7 to the consolidated financial statements in Item 8 of this Annual Report for more information.\nCredit Facilities\nUnsecured Revolving Credit Facilities\nOn February 5, 2024, we terminated our amended and restated credit agreement dated November 1, 2021 (2021 Credit Facility), and entered into a credit agreement with certain lenders providing for a $1.5 billion unsecured revolving credit facility that expires on February 5, 2029 (2024 Credit Facility).\nUnder the 2024 Credit Facility, we may, subject to certain customary conditions, including approval of relevant lenders, on one or more occasions, increase commitments under the 2024 Credit Facility by an amount not to exceed $1 billion in the aggregate, and, on one or more occasions, extend the maturity date of the 2024 Credit Facility by one year. The 2024 Credit Facility includes a $500 million sublimit for borrowing swingline loans and a $250 million sublimit for the issuance of letters of credit. Advances under the 2024 Credit Facility accrue interest at rates equal to (a) in the case of U.S. dollar borrowings, at our election, either (i) the alternate base rate plus a margin that ranges from 0.0% to 0.125%, or (ii) the adjusted term Secured Overnight Finance Rate (SOFR) plus a margin that ranges from 0.7% to 1.125%, or (b) in the case of foreign currency borrowings, the interest benchmark for the relevant currency specified in the credit agreement plus a margin that ranges from 0.7% to 1.125%. The facility fee ranges from 0.050% to 0.125% per annum. The actual interest margins and the facility fee are based on our senior debt credit ratings.\nThe 2024 Credit Facility includes customary affirmative and negative covenants, including a financial covenant that requires us to maintain a ratio of total gross debt to earnings before interest, taxes, depreciation, and amortization (EBITDA), as defined in the agreement, of not greater than 4.00 to 1.00 as measured on a rolling twelve month basis as of the last day of each fiscal quarter. As of July 31, 2025, we were compliant with all covenants governing the 2024 Credit Facility. At July 31, 2025, no amounts were outstanding under the 2024 Credit Facility.\nOn January 30, 2025, we entered into a credit agreement with certain lenders providing for a $4.5 billion unsecured short-term revolving credit facility (2025 Credit Facility) to fund a portion of our TurboTax early tax refund offering. We terminated the 2025 Credit Facility on March 3, 2025.\nAdvances under the 2025 Credit Facility accrued interest at rates equal to, at our election, either (i) the alternate base rate plus a margin of 0.125%, or (ii) the adjusted daily simple SOFR or term SOFR plus a margin of 1.125%. Unused portions of the commitment accrued a fee of 0.10% per annum. \nSecured Revolving Credit Facilities\nOn February 19, 2019, a subsidiary of Intuit entered into a secured revolving credit facility with a lender to fund the lending products and services we offer to qu\nalified small and mid-market businesses (the 2019 Secured Facility). The 2019 Secured Facility is non-recourse to Intuit Inc. and is secured by cash and receivables of the subsidiary, which are in excess of the amount outstanding under the 2019 Secured Facility\n as of July 31, 2025. \nWe have entered into several amendments to this facility. These amendments primarily increase the facility limit, extend the commitment term and final maturity date, and update the \n Intuit\n Fiscal 2025 Form 10-K\n49\nTable\n of Contents\nbenchmark interest rate. U\nnder the amended 2019 Secured Facility, the facility limit is \n$500 million, of which\n $300 million is committed and $200 million is uncommitted. Advances accrue interest at adjusted daily simple SOFR plus 1.25%. Unused portions of the committed credit facility accrue a fee at a rate ranging from 0.25% to 0.75%, depending on the total unused committed balance. The commitment term is through August 31, 2027, and the final maturity date is August 31, 2028. The agreement includes certain affirmative and negative covenants, including financial covenants, that require the subsidiary to maintain specified financial ratios. As of July 31, 2025, we were compliant with all covenants governing the 2019 Secured Facility. At July 31, 2025, $440 million was outstanding under the 2019 Secured Facility and the weighted-average interest rate was 5.74%. Interest on the 2019 Secured Facility is payable monthly. \nOn October 12, 2022, another subsidiary of Intuit entered into a secured revolving credit facility with a lender to fund the lending products and services we offer to qualified small and mid-market businesses (the 2022 Secured Facility). The 2022 Secured Facility is non-recourse to Intuit Inc. and is secured by cash and receivables of the subsidiary, which are in excess of the amount outstanding under the 2022 Secured Facility as of July 31, 2025. We have entered into several amendments to this facility. These amendments primarily extend the commitment term and final maturity date, increase the commitment amount, and reduce the interest rate. Under the amended 2022 Secured Facility, the facility limit is $500 million, of which $400 million is committed and $100 million is uncommitted. Advances accrue interest at SOFR plus 1.1%. Unused portions of the committed credit facility accrue a fee at a rate ranging from 0.2% to 0.4%, depending on the total unused committed balance. The commitment term is through April 30, 2027, and the final maturity date is May 1, 2028. The agreement includes certain affirmative and negative covenants, including financial covenants, that require the subsidiary to maintain specified financial ratios. As of July 31, 2025, we were compliant with all covenants governing the 2022 Secured Facility. At July 31, 2025, $300 million was outstanding under the 2022 Secured Facility and the weighted-average interest rate was 5.56%, which includes the fee on the unused committed portion. Interest on the 2022 Secured Facility is payable monthly.\nOn November 1, 2024, another subsidiary of Intuit entered into a secured revolving credit facility with a lender to fund the lending products and services we offer to qualified small and mid-market businesses (the 2024 Secured Facility). The 2024 Secured Facility is non-recourse to Intuit Inc. and is secured by cash and receivables of the subsidiary, which are in excess of the amount outstanding under the 2024 Secured Facility as of July 31, 2025. We have entered into several amendments to this facility. These amendments primarily increased the commitment amount. Under the amended 2024 Secured Facility, the facility limit is $300 million, all of which is committed. Advances accrue interest at SOFR plus 1.15%. Unused portions of the committed credit facility accrue a fee at a rate ranging from 0.2% to 0.4%, depending on the total unused committed balance. The commitment term is through November 1, 2027, and the final maturity date is November 1, 2028. The agreement includes certain affirmative and negative covenants, including financial covenants that require the subsidiary to maintain specified financial ratios. As of July 31, 2025, we were compliant with all covenants governing the 2024 Secured Facility. At July 31, 2025, $274 million was outstanding under the 2024 Secured Facility and the weighted-average interest rate was 5.56%, which includes the fee on the unused committed portion. Interest on the 2024 Secured Facility is payable monthly.\nWe monitor counterparty risk associated with the institutional lenders that are providing the secured credit facilities.\nCommercial Paper Program\nUnder our established commercial paper program, we may issue and sell unsecured short-term promissory notes (commercial paper) up to $1.5 billion. The maturities of the commercial paper may vary but will not exceed 397 days from the date of issuance. During the twelve months ended July 31, 2025, we temporarily increased the capacity of our commercial paper program from $1.5 billion to $2.0 billion to support our seasonal working capital needs. As of July 31, 2025, the capacity of the commercial paper program was $1.5 billion. At July 31, 2025 and July 31, 2024, no amounts were outstanding under this program.\nCash Held by Foreign Subsidiaries\nOur cash, cash equivalents, and investments totaled $4.6 billion at July 31, 2025. Approximately 9% of those funds were held by our foreign subsidiaries and subject to repatriation tax considerations. These foreign funds were located primarily in Canada, India, and the United Kingdom. We do not expect to pay incremental U.S. taxes on repatriation. We have recorded income tax expense for Canada, India, and Israel withholding taxes on earnings that are not permanently reinvested. In the event that funds from foreign operations are repatriated to the U.S., we would pay withholding taxes at that time. \n50\n Intuit\n Fiscal 2025 Form 10-K\nTable\n of Contents\nCONTRACTUAL OBLIGATIONS\nThe following table summarizes our known contractual obligations to make future payments at July 31, 2025. We generally expect to fund these short and long-term obligations with cash from operations, the issuance of senior unsecured notes, and borrowings under our credit facilities. \nPayments Due by Period\n \nLess than\n1-3\n3-5\nMore than\n \n(In millions)\n1 year\nyears\nyears\n5 years\nTotal\nAmounts due under executive deferred compensation plan\n$\n248 \n$\n— \n$\n— \n$\n— \n$\n248 \nSenior unsecured notes\n— \n1,250 \n1,250 \n2,500 \n5,000 \nSecured revolving credit facilities\n— \n300 \n714 \n— \n1,014 \nInterest and fees due on debt\n284 \n499 \n311 \n1,843 \n2,937 \nOperating leases\n (1)\n78 \n202 \n198 \n314 \n792 \nPurchase obligations \n(2)\n808 \n1,606 \n1,298 \n1,180 \n4,892 \nTotal contractual obligations \n(3)\n$\n1,418 \n$\n3,857 \n$\n3,771 \n$\n5,837 \n$\n14,883 \n(1)\nIncludes operating leases for facilities and equipment. Amounts do not include $23 million of future sublease income or $133 million in minimum lease payments for leases signed but not yet commenced as of July 31, 2025. See Note 9 to the consolidated financial statements in Item 8 of this Annual Report for more information.\n(2)\nRepresents agreements to purchase products and services that are enforceable, legally binding, and specify terms, including: fixed or minimum quantities to be purchased; fixed, minimum, or variable price provisions; and the approximate timing of the payments. At July 31, 2025, our purchase obligations primarily represent obligations under a cloud services agreement.\n(3)\nOther long-term obligations on our consolidated balance sheet at July 31, 2025, included long-term income tax liabilities of $238 million, which related primarily to unrecognized tax benefits. We have not included this amount in the table above because we cannot make a reasonably reliable estimate regarding the timing of settlements with taxing authorities, if any.\nRECENT ACCOUNTING PRONOUNCEMENTS\nFor a description of recent accounting pronouncements, if any, and the potential impact of these pronouncements on our consolidated financial statements, see Note 1 to the financial statements in Item 8 of this Annual Report.\n Intuit\n Fiscal 2025 Form 10-K\n51\nTable\n of Contents",
  "item2": null
}