{
  "source_file": "ip-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our unaudited condensed consolidated financial statements and related notes included in \"Financial Statements and Supplementary Data\" of this Quarterly Report on Form 10-Q (this \"Form 10-Q\") and the Company's Annual Report on Form 10-K for the year ended December 31, 2024 (our \"Annual Report\"). In addition to historical consolidated financial information, the following discussion contains forward-looking statements that reflect our plans, estimates, and beliefs that involve significant risks and uncertainties. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to those differences include those discussed below and in our Annual Report and subsequent quarterly reports, particularly under \"Risk Factors\" and \"Forward-Looking Statements\" of this Form 10-Q. Please see our \"Cautionary Statement Regarding Forward-Looking Statements\" below.\nEXECUTIVE SUMMARY\nEarnings (loss) from continuing operations were $(426) million ($(0.81) per diluted share) in the third quarter of 2025, compared with $75 million ($0.14 per diluted share) in the second quarter of 2025 and $111 million ($0.31 per diluted share) in the third quarter of 2024. The Company generated Adjusted operating earnings (loss) (a non-GAAP measure defined below) of $(224) million ($(0.43) per diluted share) in the third quarter of 2025, compared with $94 million ($0.18 per diluted share) in the second quarter of 2025 and $113 million ($0.33 per diluted share) in the third quarter of 2024.\nBeginning in the third quarter of 2025, management has elected to present guidance based on Adjusted EBITDA from continuing operations (non-GAAP) in addition to Adjusted operating earnings (loss). Adjusted EBITDA provides a more meaningful measure of operating performance, particularly in evaluating the Company’s results and future outlook during this period of transformation.\nDuring the third quarter, International Paper sequentially improved adjusted EBITDA from continuing operations driven by continued price realization, cost management and lower fiber costs. The third quarter represents another important step in our transformation journey, as we continue to execute the strategy launched last year. We committed to an ambitious transformation plan to reinforce our position as the leading global provider of sustainable packaging solutions through an advantaged cost position, high relative supply position in the most strategically attractive geographies, and delivering an unmatched customer experience.  \nThird quarter results include financial improvements related to both our commercial and cost out targets. On the commercial side, we are investing in a best-in-class experience for our customers. This resulted in key strategic wins across regional, national and local customers, as we continue to benefit from price realization from prior index moves. On the cost side, we continued our footprint optimization in North America and EMEA. We closed additional mills and box plants, sold or exited some of our non-strategic businesses, further simplified our overhead structure and rolled out our 80/20 lighthouse model to drive improved operational efficiency and service levels. \nEarnings (loss) from continuing operations before income taxes and equity earnings (loss) was ($675) million in the third quarter of 2025 and includes $675 million of accelerated depreciation associated with the closure of our mills in Savannah and Riceboro, Georgia and other packaging facilities. Adjusted EBITDA from continuing operations (non-GAAP) in the third quarter of 2025 was $859 million, representing a 28% sequential increase. The sequential improvement in adjusted EBITDA from continuing operations was driven by increased price in both PS NA and PS EMEA on prior index movements, along with favorable operations and costs in PS NA. The improved third quarter of 2025 results also reflect lower planned maintenance outage costs in PS NA as we adjusted our outage schedule to accelerate the mill footprint actions taken in the quarter. Input costs negatively impacted third quarter of 2025 results as higher energy costs in PS NA were partially offset by lower fiber costs in PS EMEA. Finally, during the third quarter of 2025, we entered into an agreement to divest the Global Cellulose Fibers business. In connection with the divestment, we recognized a $1.0 billion impairment to adjust the net assets of this business to fair value. We expect to close on the sale of the business by year-end 2025, subject to regulatory approvals. \nTurning to the fourth quarter of 2025 outlook, we expect lower adjusted EBITDA from continuing operations in PS NA. Volumes are anticipated to be lower as the commercial impact of the recent mill closures and three less shipping days are only partially offset by improvements tied to strategic wins and seasonality. We predict operations and costs to be sequentially lower primarily due to the favorable cost-out benefit from third quarter of 2025 mill closures, partially offset by seasonally higher labor costs, higher reliability spending and the non-repeat of benefits from strategic initiatives reported in third quarter. We expect heavier maintenance outage spending in fourth quarter of 2025 as planned. We foresee higher adjusted EBITDA from continuing operations in PS EMEA driven by continued realization of prior index movements, seasonally higher volumes and \n33\nTable of Contents\nlower fiber costs, partially offset by higher operations and costs due to increased costs tied to higher volumes and the non-repeat of favorable items from the third quarter of 2025. \nRecent Strategic Portfolio Actions\nDuring the third quarter of 2025, International Paper Company continued to execute strategic initiatives designed to optimize our portfolio and reinforce our position as a leading global provider of packaging solutions. As part of the Company's strategy, the Company intends to guide investments and align resources to win with our most strategic customers, while reducing complexity and cost across the Company.\nTo that end, during the third quarter we took actions to simplify our organizational structure by exiting select businesses and markets and initiating the outsourcing of a portion of our information technology services. By streamlining our portfolio, we believe the Company is better positioned to deliver innovative, fiber-based packaging solutions that meet the evolving needs of our customers.\nDivestiture of Global Cellulose Fibers Business: \nOn August 20, 2025, the Company entered into a definitive agreement to sell its Global Cellulose Fibers business to American Industrial Partners (“AIP”) for $1.5 billion, subject to customary closing adjustments. As part of the consideration, the Company will receive preferred stock in the acquiring entity with an initial liquidation preference of $190 million. In connection with our decision to divest the Global Cellulose Fibers business, we recorded an estimated impairment charge of $1.0 billion in the third quarter of 2025, which is included within discontinued operations, net of tax. The pre-tax charge was based on an estimate of expected proceeds and is subject to change with final proceeds and closing adjustments. We intend to allocate the proceeds from the divestiture toward strategic reinvestment in our packaging business, targeted debt reduction to support our credit profile and preserve financial flexibility and to maintain a strong investment-grade credit rating. \nThe consummation of the Transaction is subject to customary closing conditions, including, among others, the receipt of approvals or the expiration or termination of applicable waiting or review periods under applicable competition laws, including the expiration or termination of the applicable waiting period under the Hart-Scott-Rodino Antitrust Improvements Act of 1976 (the “HSR Act”), as amended. As previously reported, on September 24, 2025, the Federal Trade Commission granted early termination of the waiting period under the HSR Act.  \nIn October 2025, we sold our bag converting operations. \nThe announced Global Cellulose Fibers business divestiture and disposition of our bag business marks a significant milestone in our transformation, establishing International Paper as a single, focused company dedicated exclusively to sustainable packaging.\nMill Closures:\n We committed to permanently closing our mills in Riceboro, Georgia, Savannah, Georgia and Belisce, Croatia, reducing containerboard capacity by approximately 1.7 million tons. These actions resulted in combined pre-tax charges of approximately $840 million, including approximately $600 million of accelerated depreciation, and impacted approximately 1,200 employees. These closures support our goal to streamline operations and focus resources on strategic customers.\nOperational Efficiency:\n We also initiated a strategic transition to outsource a significant portion of our North American information technology services and support functions. The decision is aimed at enhancing scalability, improving cost efficiency and better positioning the business to deliver operational and customer excellence.\nMacroeconomic and Market Conditions \nIn the third quarter, the Company navigated a complex and evolving dynamic macroeconomic landscape, particularly in our EMEA markets. Subdued market conditions, persistent cost pressures and shifting consumer behavior were compounded by elevated interest rates, soft consumer sentiment and newly implemented tariffs that disrupted global trade flows. These factors, along with heightened geopolitical tensions, contributed to broader consumer uncertainty, impacting industrial production.\nWe continue to actively monitor evolving trade policy, including newly implemented tariffs affecting goods imported into the United States. During the third quarter, rising tariff rates contributed to economic uncertainty impacting industrial production and box demand across the manufacturing sector. The Company continues to assess the impact of the tariffs and actions that can be taken to moderate and/or minimize their effects on the Company.\n34\nTable of Contents\nThe enactment of the One Big Beautiful Bill Act (“OBBBA”) in July 2025 introduced a wide range of tax policy changes. Key provisions include the extension of select elements of the Tax Cuts and Jobs Act, updates to the international tax framework, and the reinstatement of favorable treatment for certain business-related deductions. With staggered effective dates beginning in 2025 and extending through 2027, the Company is actively evaluating the OBBBA’s potential implications on its consolidated financial statements. For the nine months ended September 30, 2025, the impacts do not have a material effect on the tax rate.\nReconciliation of Earnings (loss) from continuing operations to Adjusted operating earnings (loss) \nAdjusted Operating Earnings (Loss) and Adjusted Operating Earnings (Loss) Per Share are non-GAAP financial measures defined as earnings (loss) from continuing operations (a GAAP measure) excluding net special items and non-operating pension expense (income). Earnings (loss) from continuing operations and Diluted earnings (loss) from continuing operations per share are the most directly comparable GAAP measures. The Company calculates Adjusted Operating Earnings (Loss) by excluding the after-tax effect of non-operating pension expense (income) and net special items, as described in greater detail below, from earnings (loss) from continuing operations reported under GAAP. Adjusted Operating Earnings (Loss) Per Share is calculated by dividing Adjusted Operating Earnings (Loss) by diluted average shares of common stock outstanding. Management uses these non-GAAP measures to focus on ongoing operations and believes that such non-GAAP measures are useful to investors in assessing the operational performance of the Company and enabling investors to perform meaningful comparisons of past and present consolidated operating results from continuing operations. The Company believes that using these non-GAAP measures, along with the most directly comparable GAAP measures, provides for a more complete analysis of the Company's results of operations.\nNon-operating pension expense (income) represents amortization of prior service cost, amortization of actuarial gains/losses, expected return on assets and interest cost. The Company excludes these amounts from our Adjusted Operating Earnings (Loss) as the Company does not believe these items reflect ongoing operations. These particular pension cost elements are not directly attributable to current employee service. The Company includes service cost in our non-GAAP measure as it is directly attributable to employee service, and the corresponding employees’ other compensation elements, in connection with ongoing operations.\nThe following is a reconciliation of Earnings (loss) from continuing operations to Adjusted operating earnings (loss) on a total basis. Additional detail is provided below regarding the net special items expense (income) referenced in the charts below.\n \nThree Months Ended\nSeptember 30,\nThree Months Ended June 30,\nIn millions\n2025\n2024\n2025\nEarnings (loss) from continuing operations \n$\n(426)\n$\n111 \n$\n75 \nAdd back - Non-operating pension expense (income)\n(4)\n(12)\n(5)\nAdd back - Net special items expense (income)\n354\n \n113 \n20 \nIncome taxes - Non-operating pension and special items (a)\n(148)\n(99)\n4 \nAdjusted operating earnings (loss)\n$\n(224)\n$\n113 \n$\n94 \n(a)    For the three months ended September 30, 2025, this amount includes a tax benefit of $62 million related to capital losses associated with the announced agreement to sell our Global Cellulose Fibers business.  This amount also includes tax expense of $1 million on the non-operating pension income and a tax benefit of $87 million associated with special items. The three months ended September 30, 2024 include a tax benefit of $78 million related to internal legal entity restructuring. This amount also includes tax expense of $3 million on the non-operating pension income and a tax benefit of $24 million associated with special items. The three months ended June 30, 2025 includes tax expense of $1 million on the non-operating pension income and tax expense of $3 million associated with special items. \nReconciliation of Earnings (loss) from Continuing Operations to Adjusted EBITDA from Continuing Operations\nAdjusted EBITDA from continuing operations is a non-GAAP financial measure defined as earnings (loss) from continuing operations before income taxes and equity earnings (loss), interest expense, net, net special items, non-operating pension expense (income) and depreciation and amortization. Earnings (loss) from continuing operations before income taxes and equity earnings (loss) is the most directly comparable GAAP measure. Beginning with the third quarter of 2025, management is using this measure to focus on on-going operations and believes this measure is useful to investors. This change reflects investor feedback and management's view that Adjusted EBITDA provides a more meaningful measure of the operating performance of the Company and helps enable investors to perform meaningful comparisons of past and present consolidated operating results from continuing operations.\n35\nTable of Contents\nThe following is a reconciliation of Earnings (loss) from continuing operations before income taxes and equity earnings (loss) to Adjusted EBITDA from continuing operations on a total basis. Additional detail is provided below regarding the special items referenced in the charts below.\n \nThree Months Ended\nSeptember 30,\nThree Months Ended June 30,\nIn millions\n2025\n2024\n2025\nEarnings (Loss) from Continuing Operations Before Income Taxes and Equity Earnings (Loss)\n$\n(675)\n$\n5 \n$\n116 \nInterest expense, net\n85\n \n52 \n108 \nSpecial items\n354\n \n113 \n20 \nNon-operating pension expense (income)\n(4)\n(12)\n(5)\nDepreciation and amortization\n1,099\n \n208 \n431 \nAdjusted  EBITDA from Continuing Operations\n$\n859\n \n$\n366 \n$\n670 \nEffects of Net Special Items Expense (Income)\nDetails of net special items expense (income) included in continuing operations for the three months ended are as follows:\nThree Months Ended \nSeptember 30,\nJune 30,\n2025\n2024\n2025\nIn millions\nBefore Tax\nAfter Tax\nBefore Tax\nAfter Tax\nBefore Tax\nAfter Tax\nSeverance and other costs\n$\n342\n \n$\n257\n \n(a)\n$\n55 \n$\n41 \n(a)\n$\n39 \n$\n34 \n(a)\nDS Smith combination costs (benefits)\n(26)\n(18)\n(b)\n26 \n26 \n(b)\n32 \n29 \n(b)\nStrategic advisory fees\n—\n \n—\n \n25 \n19 \n(b)\n— \n— \nNet (gains) losses on sales and impairments of businesses\n16\n \n12\n \n(c)\n— \n— \n(51)\n(40)\n(c)\nNet (gains) losses on sales and impairments of assets\n15\n \n11\n \n(d)\n— \n— \n— \n— \nEnvironmental remediation adjustments\n7\n \n5\n \n(e)\n— \n— \n— \n— \nThird-party warehouse fire\n—\n \n—\n \n13 \n9 \n(f)\nItaly antitrust\n—\n \n—\n \n(6)\n(6)\n(g)\n— \n— \nTotal\n354\n \n267\n \n113 \n89 \n20 \n23 \nTax expense (benefit)\nTax benefit related to capital losses\n—\n \n(62)\n(h)\n— \n— \n— \n— \nTax benefit related to internal legal entity restructuring\n—\n \n—\n \n— \n(78)\n(i)\n— \n— \nTax Total\n— \n(62)\n— \n(78)\n— \n— \nTotal Net Special Items\n$\n354\n \n$\n205\n \n$\n113 \n$\n11 \n$\n20 \n$\n23 \n(a)\nSeverance and other costs associated with the Company's 80/20 strategic approach which includes the realignment of resources and mill strategic actions recorded in restructuring charges, net.\n(b)\nTransaction, integration and other costs/benefits that the Company believes are not reflective of the Company's underlying operations recorded in cost of products sold and selling and administrative expenses.\n(c)\nIncludes the impairment of the Company's kraft paper bag business in the third quarter of 2025 and the gain on the sale of five European box plants in Mortagne, Saint-Amand, and Cabourg (France), Ovar (Portugal) and Bilbao (Spain) to satisfy regulatory commitments in connection with the DS Smith combination in the second quarter of 2025. \n(d)\nIncludes the impairment of fixed assets associated with the Company's aircraft assets which are classified as held for sale.\n(e)\nEnvironmental remediation adjustments associated with remediation work at a waste pit site at a mill acquired but never operated by the Company, and last utilized by the predecessor owner of the mill recorded in cost of products sold. \n(f)\nThe Company's cost for third-party damages associated with a warehouse fire in Morocco recorded in cost of products sold.\n(g)\nSettlement of an Italian antitrust matter initially recorded as a special item in 2019 recorded in cost of products sold.\n(h)\nTax benefit related to capital losses associated with the announced agreement to sell our Global Cellulose Fibers business.\n(i)\nTax benefit related to internal legal entity restructuring. \n36\nTable of Contents\nThe following is a reconciliation of Diluted earnings (loss) per share from continuing operations to Adjusted operating earnings (loss) on a per share basis:\n \n \nThree Months Ended\nSeptember 30,\nThree Months Ended June 30,\n2025\n2024\n2025\nDiluted earnings (loss) per share from continuing operations\n$\n(0.81)\n$\n0.31 \n$\n0.14 \nAdd back - Non-operating pension expense (income) per share\n(0.01)\n(0.03)\n— \nAdd back - Net special items expense (income) per share\n0.67\n \n0.33 \n0.03 \nIncome taxes per share - Non-operating pension and special items\n(0.28)\n(0.28)\n0.01 \nAdjusted operating earnings (loss) per share \n$\n(0.43)\n$\n0.33 \n$\n0.18 \nCash provided by (used for) operations, including discontinued operations, totaled $793 million and $1.3 billion for the first nine months of 2025 and 2024, respectively. Free cash flow in the first nine months of 2025 and 2024 was $(414) million and $620 million, respectively. Free cash flow is a non-GAAP measure, which equals cash provided by operations less capital expenditures, and the most directly comparable GAAP measure is cash provided by (used for) operations. Management utilizes this measure in connection with managing our business and believes that free cash flow is useful to investors as a liquidity measure because it measures the amount of cash generated that is available, after reinvesting in the business, to maintain a strong balance sheet, pay dividends, repurchase stock, service debt and make investments for future growth. It should not be inferred that the entire free cash flow amount is available for discretionary expenditures. \nThe following is a reconciliation of cash provided by operations to free cash flow:\n \n \nNine Months Ended\nSeptember 30,\nIn millions\n2025\n2024\nCash provided by operations\n$\n793\n \n$\n1,281 \nAdjustments:\nCapital expenditures\n(1,207)\n(661)\nFree Cash Flow\n$\n(414)\n$\n620 \nThe non-GAAP financial measures presented in this Form 10-Q as referenced above have limitations as analytical tools and should not be considered in isolation or as a substitute for an analysis of our results calculated in accordance with GAAP. In addition, because not all companies utilize identical calculations, the Company's presentation of non-GAAP measures in this Form 10-Q may not be comparable to similarly titled measures disclosed by other companies, including companies in the same industry as the Company. Investors are cautioned not to place undue reliance on any non-GAAP financial measures used in this Form 10-Q.\nRESULTS OF OPERATIONS\nThe following summarizes our results of operations for third quarter of 2025 compared with the second quarter of 2025 and the third quarter of 2024:\n37\nTable of Contents\n \nThree Months Ended\nSeptember 30,\nThree Months Ended June 30,\nChange Compared to June 30, 2025\nChange Compared to September 30, 2024\nIn millions\n2025\n2024\n2025\n$\n%\n$\n%\nNet sales\n$\n6,222\n \n$\n3,979 \n$\n6,142 \n$\n80 \n1 \n%\n$\n2,243 \n56 \n%\nCost of products sold\n4,287\n \n2,880 \n4,422 \n(135)\n(3)\n%\n1,407 \n49 \n%\nSelling and administrative expenses\n493\n \n473 \n525 \n(32)\n(6)\n%\n20 \n4 \n%\nDepreciation and amortization\n1,099\n \n208 \n431 \n668 \n155 \n%\n891 \n428 \n%\nDistribution expenses\n524\n \n288 \n516 \n8 \n2 \n%\n236 \n82 \n%\nTaxes other than payroll and income taxes\n40\n \n30 \n41 \n(1)\n(2)\n%\n10 \n33 \n%\nRestructuring charges, net (a)\n342\n \n55 \n39 \nNet (gains) losses on sales and impairments of businesses (a)\n16\n \n— \n(51)\nNet (gains) losses on sales and impairments of assets (a)\n15\n \n— \n— \nInterest expense, net\n85\n \n52 \n108 \n(23)\n(21)\n%\n33 \n63 \n%\nNon-operating pension expense (income)\n(4)\n(12)\n(5)\nEarnings (loss) from continuing operations before income taxes and equity earnings (loss)\n(675)\n5 \n116 \nIncome tax provision (benefit)\n(250)\n(107)\n40 \nEquity earnings (loss), net of taxes\n(1)\n(1)\n(1)\nEarnings (loss) from continuing operations\n(426)\n111 \n$\n75 \nDiscontinued operations, net of tax\n(676)\n39 \n$\n— \nNet earnings (loss)\n$\n(1,102)\n$\n150 \n$\n75 \nDiluted earnings (loss) per share\n$\n(2.09)\n$\n0.42 \n$\n0.14 \n(a) Refer to special items discussion on page \n36\nThree Months Ended September 30, 2025 Compared to the Three Months Ended June 30, 2025 and the Three Months Ended September 30, 2024\nRefer to the Effects of Net Special Items Expense (Income) section on page \n36\n for details of net special items expense (income) discussed below.\nNet sales\nThe increase in the third quarter of 2025 compared to the second quarter of 2025 and the third quarter of 2024 was primarily driven by higher sales prices. DS Smith accounted for $2.2 billion of net sales in the third quarter of 2025. Additional details on net sales are provided in the \nBusiness Segment Operating Results\n section below.\nCost of products sold\nCost of products sold decreased by $135 million compared to the second quarter of 2025 and increased by $1.4 billion compared to the third quarter of 2024. The decrease compared to the second quarter of 2025 was driven by lower raw materials ($409 million) and maintenance/labor costs ($25 million), partially offset by increases in fuel and other expenses ($334 million). For IP legacy, cost of products sold was impacted by decreases in raw materials and operating materials ($194 million) and increases in maintenance and fuel expense ($11 million) compared to the third quarter of 2024. Net special items of $34 million were included in the third quarter of 2025 compared to $7 million in the third quarter of 2024 and DS Smith accounted for $1.6 billion of total cost of products sold in the third quarter of 2025. \nSelling and administrative expenses\nSelling and administrative expenses decreased by $32 million compared to the second quarter of 2025 and increased by $20 million compared to the third quarter of 2024. The decrease compared to the second quarter of 2025 was driven by lower incentive compensation and other costs ($20 million), partially offset by increased medical benefit costs ($11 million). For IP legacy, selling and administrative expenses were impacted by decreases in incentive compensation ($17 million) and increases in other costs ($12 million) compared to the third quarter of 2024. Net special items charges of $15 million, $51 million and $32 million in the third quarter of 2025 and 2024 and the second quarter of 2025, respectively, are included and DS Smith accounted for $119 million of total selling and administrative expenses in the third quarter of 2025.\n38\nTable of Contents\nDepreciation and amortization\nDepreciation and amortization increased by $668 million compared to the second quarter of 2025 and increased by $891 million compared to the third quarter of 2024. The increase compared to the second quarter of 2025 and the third quarter of 2024 was primarily due to $675 million of accelerated depreciation related to mill strategic actions in the third quarter of 2025. Additionally, for IP legacy, the increase in the third quarter of 2025 compared to the third quarter of 2024 includes higher depreciation recognized on the units of production method at mills with higher production. DS accounted for $540 million of depreciation and amortization in the third quarter of 2025.\nDistribution expenses\nDistribution expenses increased by $8 million compared to the second quarter of 2025 and increased by $236 million compared to the third quarter of 2024. The increase compared to the second quarter of 2025 was driven by higher warehousing expense. For IP legacy, distribution expenses were impacted by higher freight and warehousing expenses compared to the third quarter of 2024. DS accounted for $233 million of distribution expenses in the third quarter of 2025.\nTaxes other than payroll and income taxes\nTaxes other than payroll and income taxes decreased by $1 million compared to the second quarter of 2025 and increased by $10 million compared to the third quarter of 2024. DS accounted for $10 million of taxes other than payroll and income taxes in the third quarter of 2025.\nInterest expense, net\nInterest expense, net decreased by $23 million compared to the second quarter of 2025 and increased by $33 million compared to the third quarter of 2024. The decrease compared to the second quarter of 2025 was driven by higher interest income. DS accounted for $37 million of interest expense, net in the third quarter of 2025.\nIncome tax provision (benefit)\nAn income tax benefit of $250 million was recorded for the third quarter of 2025 and the reported effective income tax rate was 37%. Excluding a benefit of $149 million related to the tax effects of net special items and an expense of $1 million related to the tax effects of non-operating pension income, the operational effective income tax rate was 31% for the third quarter of 2025. \nAn income tax provision of $40 million was recorded for the second quarter of 2025 and the reported effective income tax rate was 34%. Excluding expense of $3 million related to the tax effects of net special items and expense of $1 million related to the tax effects of non-operating pension income, the operational effective income tax rate was 27% for the second quarter of 2025. \nAn income tax benefit of $107 million was recorded for the third quarter of 2024 and the reported effective income tax rate was (2,140)%. Excluding a benefit of $102 million related to the tax effects of net special items and expense of $3 million related to the tax effects of non-operating pension income, the operational effective income tax rate was (8)% for the third quarter of 2024. \nThe following is a reconciliation of the net income tax provision (benefit) to the operational income tax provision (a non-GAAP financial measure) and the reported effective income tax rate to the operational effective income tax rate (a non-GAAP financial measure): \nThree Months Ended\nSeptember 30,\nJune 30,\nIn millions (except rates)\n2025\n2024\n2025\nProvision (Benefit)\nRate\nProvision (Benefit)\nRate\nProvision (Benefit)\nRate\nIncome tax provision (benefit) and reported effective income tax rate\n$\n(250)\n37\n \n%\n$\n(107)\n(2140)\n%\n$\n40 \n34 \n%\nIncome tax effect - non-operating pension (income) expense and special items\n(148)\n(99)\n4 \nOperational tax provision (benefit) and operational effective tax rate\n$\n(102)\n31\n \n%\n$\n(8)\n(8)\n%\n$\n36 \n27 \n%\nThe operational income tax provision and operational effective income tax rate are non-GAAP financial measures and are calculated by adjusting the earnings (loss) from continuing operations before income taxes and equity earnings (loss), income tax provision (benefit) and rate to exclude net special items and non-operating pension expense (income). The most directly comparable GAAP measures are the reported income tax provision and effective income tax rate, respectively. Management \n39\nTable of Contents\nbelieves that this presentation provides useful information to investors by providing a meaningful comparison of the income tax rate between past and present periods.\nDiscontinued Operations, Net of Tax\nOn August 21, 2025, the Company announced that it had reached a definitive agreement with American Industrial Partners (\"AIP\") to sell its Global Cellulose Fibers business. All current and historical operating results of the Global Cellulose Fibers business are presented as Discontinued Operations, net of tax, in the condensed consolidated statement of operations. All current and historical assets and liabilities of the Global Cellulose Fibers business are classified as Assets held for sale and Long-Term Assets Held For Sale and Liabilities held for sale and Long-Term Liabilities Held For Sale in the accompanying condensed balance sheets. See \nNote 9 - Divestiture\n of \nCondensed Notes to Consolidated Financial Statements\n for further details.\nDiscontinued operations includes the operating earnings of the Global Cellulose Fibers business. Discontinued operations also includes net special items expense of $1.0 billion, $1 million and $15 million for the three months ended September 30, 2025 and 2024 and June 30, 2025, respectively.\nBUSINESS SEGMENT OPERATING RESULTS\nThe Company currently operates in two segments: Packaging Solutions North America (PS NA) and Packaging Solutions EMEA (PS EMEA). \nThe following tables present net sales and business segment operating profit (loss), which is the Company's measure of segment profitability. Business segment operating profit (loss) is a measure reported to our management for purposes of making decisions about allocating resources to our business segments and assessing the performance of our business segments and is presented in our financial statement footnotes in accordance with ASC 280 - \"Segment Reporting.\" For additional information regarding business segment operating profit (loss), including a description of the manner in which business segment operating profit (loss) is calculated, see \nNote 20 - Business Segment Information\n to the \nCondensed Notes to the Consolidated Financial Statements\n.\nPS NA\n2025\n2024\nIn millions\n3rd Quarter\n2nd Quarter\nNine Months\n3rd Quarter\n2nd Quarter\nNine Months\nSales\n$\n3,898\n \n$\n3,860 \n$\n11,460 \n$\n3,640 \n$\n3,628 \n$\n10,754 \nBusiness Segment Operating Profit (Loss)\n$\n(166)\n$\n277 \n$\n253 \n$\n190 \n$\n281 \n$\n663 \nPS NA \nsales were higher compared to the second quarter of 2025 driven by higher average sales prices and volumes for boxes, partially offset by lower containerboard volumes. Cost of products sold decreased by $113 million and was impacted by lower manufacturing costs, including planned maintenance downtime costs, partially offset by higher input costs. Depreciation and amortization expense increased by $595 million driven by $619 million of accelerated depreciation associated with the previously announced closures of our Red River containerboard mill in Campti, Louisiana and our Savannah and Riceboro containerboards mills in Georgia. Selling and administrative expenses were flat compared to the second quarter of 2025. \nPS NA results include sales of $168 million and business segment operating profit (loss) of $(276) million for the legacy DS Smith North America business in the third quarter of 2025. Compared with the third quarter of 2024, IP legacy PS NA sales in the third quarter of 2025 were higher driven by higher sales prices, partially offset by lower sales volumes including the impact of one less shipping day in the third quarter of 2025. Cost of products sold decreased by $157 million driven by lower manufacturing costs, including planned maintenance downtime costs and recovered fiber costs, partially offset by higher energy costs. Depreciation and amortization expense increased $351 million due to accelerated depreciation associated with the previously announced mill closures. Selling and administrative expenses decreased by $30 million reflecting lower overhead costs.\nEntering the fourth quarter of 2025, sales volumes are expected to be lower compared to the third quarter of 2025 and include the impact of three less shipping days in the fourth quarter of 2025. Sales are also expected to be impacted by the previously announced mill closures. Operating costs are expected to be lower. Planned maintenance downtime costs are expected to be higher in the fourth quarter of 2025 compared with the third quarter of 2025. Input costs are expected to be lower driven by fiber costs. \n40\nTable of Contents\nPS EMEA\n2025\n2024\nIn millions\n3rd Quarter\n2nd Quarter\nNine Months\n3rd Quarter\n2nd Quarter\nNine Months\nSales\n$\n2,310\n \n$\n2,291 \n$\n6,151 \n$\n322 \n$\n328 \n$\n998 \nBusiness Segment Operating Profit (Loss)\n$\n(58)\n$\n(1)\n$\n(13)\n$\n7 \n$\n10 \n$\n41 \nPS EMEA \nsales were higher driven by higher sales prices reflecting prior price increases, partially offset by lower volumes driven by a soft demand environment. Cost of products sold increased $22 million and was impacted by higher operating costs, including planned maintenance downtime costs, partially offset by lower fiber costs. Selling and administrative expenses decreased $20 million driven by lower overhead costs. Depreciation and amortization expense in the third quarter of 2025 increased $72 million due to $50 million of accelerated depreciation associated with Belisce, Croatia mill closure.\nPS EMEA results include sales of $2.0 billion and business segment operating profit (loss) of $(65) million for the legacy DS Smith EMEA business in the third quarter of 2025. Compared with the third quarter of 2024, legacy IP PS EMEA sales in the third quarter of 2025 were lower driven by lower sales prices for boxes and paper. Cost of products sold were lower, reflecting lower input costs. Selling and administrative expenses were lower compared to the third quarter of 2024 driven by lower overhead costs.\nLooking ahead to the fourth quarter of 2025, sales are expected to be higher. Operating costs are expected to be higher. Input costs are expected to be lower, driven by fiber costs. Planned maintenance downtime costs are expected to be lower in the fourth quarter of 2025. \nLIQUIDITY AND CAPITAL RESOURCES\nCash provided by (used for) operations, including discontinued operations, totaled $793 million and $1.3 billion for the first nine months of 2025 and 2024, respectively. Cash provided by (used for) working capital components (accounts receivable, contract assets and inventory less accounts payable and accrued liabilities, interest payable and other) totaled $(867) million for the nine months ended September 30, 2025 compared with cash provided by (used for) working capital components of $216 million for the nine months ended September 30, 2024. The change in cash provided by operations in the first nine months of 2025 compared to the comparable 2024 nine-month period was primarily due to significant payments made in the first quarter of 2025 that impacted operating cash flow by approximately $670 million, including $240 million of DS Smith transaction costs and $80 million of severance payments, as well as incentive compensation and other benefit payments. \nCash provided by (used for) investment activities, including discontinued operations, totaled $(478) million in the first nine months of 2025 compared with $(634) million in the first nine months of 2024. The increase in cash provided by investment activities is mainly due to proceeds from the sale of fixed assets of $103 million, proceeds from divestitures, net of transaction costs of $138 million, proceeds from insurance recoveries of $8 million and net cash acquired from acquisitions of $414 million, offset by higher capital expenditures of $546 million. \nCapital expenditures totaled $1.2 billion in the first nine months of 2025, compared to $661 million in the first nine months of 2024. Full-year 2025 capital expenditures are currently expected to be approximately $1.8 billion to $1.9 billion, or 71% to 75% of depreciation and amortization.\nFinancing activities for the first nine months of 2025 included a $229 million net increase in debt versus a $33 million net decrease in debt during the comparable 2024 nine-month period.\nDuring the third quarter of 2025, the Company had no borrowings outstanding under its commercial paper program and its USD denominated committed bank facility.  \nSee \nNote 16 - Debt\n to the \nCondensed Notes to the Consolidated Financial Statements\n for a discussion of various debt-related actions taken by the Company during the nine months ended September 30, 2025. \nMaintaining an investment-grade credit rating is an important element of International Paper’s financing strategy. At September 30, 2025, the Company held long-term credit ratings of BBB (stable outlook) and Baa2 (stable outlook) by S&P and Moody’s, respectively. In addition, the Company held short-term credit ratings of A2 and P2 by S&P and Moody's, respectively, for borrowings under the Company's commercial paper program.\n41\nTable of Contents\nAt September 30, 2025, International Paper’s USD denominated credit facilities totaled $1.9 billion, which is comprised of the $1.4 billion contractually committed bank credit agreement and up to $500 million under the receivables securitization program.  Management believes that the Company's credit agreements are adequate to cover expected operating cash flow variability during the current economic cycle. The credit agreements generally provide for interest rates at a floating rate index plus a pre-determined margin dependent upon International Paper’s credit rating. At September 30, 2025, the Company had no borrowings outstanding under the $1.4 billion credit agreement or the $500 million receivables securitization program. The Company’s credit agreements are not subject to any restrictive covenants other than the financial covenants as disclosed in \nNote 16 - Debt\n to the \nCondensed Notes to the Consolidated Financial Statements\n, and the borrowings under the receivables securitization program being limited by eligible receivables. The Company was in compliance with all its debt covenants at September 30, 2025, and was well below the thresholds stipulated under the covenants as defined in the credit agreements. The financial covenants do not restrict any borrowings under the credit agreements.\nIn addition to the $1.4 billion capacity under the Company's credit agreements, International Paper has a commercial paper program with a borrowing capacity of $1.0 billion supported by its $1.4 billion credit agreement. Under the terms of the program, individual maturities on borrowings may vary, but not exceed one year from the date of issue. Interest bearing notes may be issued either as fixed or floating rate notes. As of September 30, 2025, the Company had no borrowings outstanding under the commercial paper program. \nOn February 14, 2025, DS Smith, a wholly owned subsidiary of International Paper, announced separate invitations (each such invitation, a “Consent Solicitation”) to eligible holders of its outstanding (i) €600 million 0.875 percent Notes due September 12, 2026 (the “2026 Notes”); (ii) €850 million 4.375 percent Notes due July 27, 2027 (the “2027 Notes”); (iii) £250 million 2.875 percent Notes due July 26, 2029 (the “2029 Notes”); and (iv) €650 million 4.500 percent Notes due July 27, 2030 (the “2030 Notes”), in each case issued by DS Smith under its Euro-Medium Term Note Programme (each a “Series” and, together, the “Notes”) to consent to, amongst other things, certain modifications to the terms and conditions (the “Conditions”) of, and the trust deed (the “Trust Deed”) for, the relevant Series to provide for (i) the removal of the obligation for DS Smith to prepare audited and unaudited consolidated accounts; (ii) the amendment of certain events of default to align more closely with certain equivalent provisions included in the documentation relating to debt securities issued by International Paper and to allow additional flexibility for potential reorganization of DS Smith’s subsidiaries, if required, now that DS Smith and its subsidiaries are part of the International Paper group; and (iii) certain consequential modifications to the applicable Conditions and Trust Deed for the relevant Series in relation to items (i) and (ii) above (together, the “Proposed Amendments”). As consideration for the holders of the Notes consenting to the Proposed Amendments, it was proposed that DS Smith procure a guarantee from International Paper, to guarantee the payment obligations of DS Smith under the Notes. The full principal amount of each Series of Notes issued by DS Smith remains outstanding as of the date hereof. On March 10, 2025, DS Smith has executed and delivered a Supplemental Trust Deed in respect of each Series to implement the Proposed Amendments, and International Paper has executed and delivered a deed of guarantee in respect of each Series to guarantee the payment obligations of DS Smith under such Series.\nIn March 2025, the Company amended and restated its £1.25 billion credit facility agreement to, among other things (i) replace its obligation to prepare audited and unaudited consolidated accounts and instead provide International Paper’s account information, on the same terms as International Paper’s existing credit facilities,  (ii) amend the financial covenant in the credit facility agreement to align with financial covenants given by International Paper in its existing credit facilities, and (iii) amend certain events of default, and undertakings to align more closely with certain equivalent provisions included in the documentation relating to the existing financings of International Paper and to allow additional flexibility for potential reorganization of DS Smith’s subsidiaries, if required, now that DS Smith and its subsidiaries are part of the International Paper group. The multi-currency credit facility allows for GBP, EUR and USD borrowings and provides for interest rates at a floating rate index plus a pre-determined margin. Credit facility borrowings are denominated in the currency that aligns with the Company's cashflows. At September 30, 2025, the Company had approximately $1.2 billion (€1.035 billion) borrowings outstanding under the credit facility. The Company’s credit facility agreement is not subject to any restrictive covenants other than that International Paper must comply with the same negative covenants as per its existing credit facilities. IP was in compliance with all its debt covenants at September 30, 2025, and was well below the thresholds stipulated under the covenants as defined in the credit facility agreement. Further the financial covenants do not restrict any borrowings under the credit facility agreement.\nIn April 2025, the Company amended and restated its credit facility agreement to, among other things (i) replace its obligation to prepare audited and unaudited consolidated accounts and instead provide International Paper’s account information, on the same terms as International Paper’s existing credit facilities, (ii) amend the financial covenant in the credit facility agreement to align with financial covenants given by International Paper in its existing credit facilities, (iii) amend certain events of default, and undertakings to align more closely with certain equivalent provisions included in the documentation relating to the existing financings of International Paper and to allow additional flexibility for potential reorganization of DS Smith’s subsidiaries, if \n42\nTable of Contents\nrequired, now that DS Smith and its subsidiaries are part of the International Paper group. The credit facility agreement provides for interest rates at a fixed rate for each facility. At September 30, 2025, the Company had €175 million (approximately $205 million) borrowings outstanding under the €200 million credit facility agreement. The Company’s credit facility agreement is not subject to any restrictive covenants other than that International Paper must comply with the same negative covenants as per its existing credit facilities. IP was in compliance with all its debt covenants at September 30, 2025, and was well below the thresholds stipulated under the covenants as defined in the credit facility agreement. Further the financial covenants do not restrict any borrowings under the credit facility agreement.\nThe Company also has a €60 million committed bank facility that matures in December 2026. In April 2025, the Company amended and restated its credit facility agreement to, among other things (i) replace its obligation to prepare audited and unaudited consolidated accounts and instead provide International Paper’s account information, on the same terms as International Paper’s existing credit facilities,  (ii) amend the financial covenant in the credit facility agreement to align with financial covenants given by International Paper in its existing credit facilities, (iii) amend certain events of default, and undertakings to align more closely with certain equivalent provisions included in the documentation relating to the existing financings of International Paper and to allow additional flexibility for potential reorganization of DS Smith’s subsidiaries, if required, now that DS Smith and its subsidiaries are part of the International Paper group. The multi-currency credit facility allows for GBP, EUR and USD borrowings. At September 30, 2025, there were no borrowings outstanding under this agreement. The Company has a £50 million uncommitted bank facility. At September 30, 2025 the Company had €55 million (approximately $65 million) borrowings outstanding under this agreement. \nInternational Paper expects to meet projected capital expenditures, service existing debt, meet working capital and dividend payments and make common stock and/or debt repurchases for the next 12 months and for the foreseeable future thereafter with current cash balances and cash from operations, supplemented as required by its existing credit facilities. The Company will continue to rely on debt and capital markets for the majority of any necessary long-term funding not provided by operating cash flows. Funding decisions will be guided by our capital structure planning objectives. The primary goals of the Company’s capital structure planning are to maximize financial flexibility and maintain appropriate levels of liquidity to meet our needs while managing balance sheet debt and interest expense. We have repurchased, and may continue to repurchase, our common stock (under our existing share repurchase program) and debt (including in open market purchases) to the extent consistent with this capital structure planning, and subject to prevailing market conditions, our liquidity requirements, applicable securities laws requirements, and other factors. The majority of International Paper’s debt is accessed through global public capital markets where we have a wide base of investors. \nDuring the first nine months of 2025, International Paper used 3.6 million shares of treasury stock for various incentive plans. International Paper also acquired 1.1 million shares of treasury stock, related to restricted stock tax withholdings during the first nine months of 2025. Payments of restricted stock withholding taxes totaled $64 million during this period. Our current share repurchase program approved by our Board of Directors (\"Board\") on October 11, 2022, does not have an expiration date and has approximately $2.96 billion aggregate amount of shares of common stock remaining authorized for purchase as of September 30, 2025. During the nine months ended September 30, 2025, no shares of common stock were repurchased under our share repurchase program.\nDuring the first nine months of 2024, International Paper used approximately 2.0 million shares of treasury stock for various incentive plans. International Paper also acquired 0.6 million shares of treasury stock, related to restricted stock tax withholding during the first three months of 2024. Payments of restricted stock withholding taxes totaled $22 million. During the nine months ended September 30, 2024, no shares of common stock were repurchased under our share repurchase program.\nCash dividend payments related to common stock totaled $733 million and $482 million for the first nine months of 2025 and 2024, respectively. Dividends were $1.3875 per share for the first nine months of 2025 and 2024. \nOur U.S. and U.K. qualified pension plans are currently fully funded.\nCRITICAL ACCOUNTING POLICIES AND SIGNIFICANT ACCOUNTING ESTIMATES\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires International Paper to establish accounting policies and to make estimates that affect both the amounts and timing of the recording of assets, liabilities, revenues and expenses. Some of these estimates require judgments about matters that are inherently uncertain.\n43\nTable of Contents\nAccounting policies whose application may have a significant effect on the reported results of operations and financial position of International Paper, and that may require judgments by management that affect their application, include accounting for contingencies, impairment or disposal of long-lived assets, goodwill and other intangible assets, pensions and income taxes. \nThe Company has included in its Annual Report a discussion of these critical accounting policies, which are important to the portrayal of the Company’s financial condition and results of operations and may require management’s judgments. Except as described below, the Company has not made any changes in these critical accounting policies during the first nine months of 2025.\nBusiness Combinations\nThe Company’s acquisitions of businesses are accounted for in accordance with ASC 805, \"Business Combinations.\" We allocate the total purchase price of the assets acquired and liabilities assumed based on their estimated fair value as of the business combination date. In developing estimates of fair values for long-lived assets, including identifiable intangible assets, the Company utilizes a variety of inputs including forecasted cashflows, anticipated growth rates, discount rates, appraisals, market valuations, estimated replacement costs and depreciation, and obsolescence factors. Determining the fair value for specifically identified intangible assets such as customer relationships and lists and tradenames, patents, trademarks and developed technology involves judgment. We may refine our estimates and make adjustments to the assets acquired and liabilities assumed over a measurement period, not to exceed one year. Upon the conclusion of the measurement period or the final determination of the values of assets acquired and liabilities assumed, whichever comes first, any subsequent adjustments are charged to the consolidated statements of earnings. Subsequent actual results of the underlying business activity supporting the goodwill and specifically identified intangible assets could change, requiring us to record impairment charges or adjust their economic lives in future periods.\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS\nCertain statements in this Quarterly Report on Form 10-Q that are not historical in nature may be considered “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. Forward-looking statements can be identified by the use of forward-looking or conditional words such as “expects,” “anticipates,” “believes,” “estimates,” “could,” “should,” “can,” “forecast,” “outlook,” “intend,” “look,” “may,” “will,” “remain,” “confident,” “commit” and “plan” or similar expressions. These statements are not guarantees of future performance and reflect management’s current views and speak only as to the dates the statements are made and are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in these statements. All statements, other than statements of historical fact, are forward-looking statements, including, but not limited to, statements regarding anticipated financial results, economic conditions, industry trends, future prospects, and the anticipated benefits, execution and consummation of corporate transactions or contemplated acquisitions, including our completed business combination with DS Smith Limited (“DS Smith”) and divestiture of our Global Cellulose Fibers business to American Industrial Partners (“AIP”). Factors which could cause actual results to differ include but are not limited to: (i) our ability to consummate and achieve the benefits expected from, and other risks associated with, acquisitions, joint ventures, divestitures, spinoffs, capital investments and other corporate transactions, including, but not limited to, our business combination with DS Smith and the divestiture of our Global Cellulose Fibers business to AIP; (ii) our ability to integrate and implement our plans, forecasts, the internal control framework of DS Smith, including assessment of its internal control over financial reporting, and other expectations with respect to the combined Company, including in light of our increased scale and global presence; (iii) risks associated with our strategic business decisions including facility closures, business exits, operational changes, and portfolio rationalizations intended to support the Company’s 80/20 strategic approach for long-term growth; (iv) our failure to comply with the obligations associated with being a public company listed on the New York Stock Exchange and the London Stock Exchange and the costs associated therewith; (v) risks with respect to climate change and global, regional, and local weather conditions, as well as risks related to our targets and goals with respect to climate change and the emission of greenhouse gases and other environmental, social and governance matters, including our ability to meet such targets and goals; (vi) loss contingencies and pending, threatened or future litigation, including with respect to environmental and antitrust related matters; (vii) the level of our indebtedness, including our obligations related to becoming the guarantor of the Euro Medium Term Notes as a result of our acquisition of DS Smith, risks associated with our variable rate debt, and changes in interest rates (including the impact of current elevated interest rate levels); (viii) the impact of global and domestic economic conditions and industry conditions, including with respect to current challenging macroeconomic conditions, inflationary pressures and changes in the cost or availability of raw materials, energy sources and transportation sources, supply chain shortages and disruptions, competition we face, cyclicality and changes in consumer preferences, demand and pricing for our products, and conditions impacting the credit, capital and financial markets; (ix) risks arising from conducting business internationally, domestic and global geopolitical conditions, military conflict (including the Russia/Ukraine conflict, the conflict in the Middle East, the further expansion of such conflicts, and the geopolitical and economic consequences associated therewith), changes in currency exchange rates, including in light of our \n44\nTable of Contents\nincreased proportion of assets, liabilities and earnings denominated in foreign currencies as a result of our business combination with DS Smith, trade policies (including but not limited to protectionist measures and the imposition of new or increased tariffs as well as the potential impact of retaliatory tariffs and other penalties including retaliatory policies against the United States) and global trade tensions, downgrades in our credit ratings, and/or the credit ratings of banks issuing certain letters of credit, issued by recognized credit rating organizations; (x) the amount of our future pension funding obligations, and pension and healthcare costs; (xi) the costs of compliance, or the failure to comply with, existing, evolving or new environmental (including with respect to climate change and greenhouse gas emissions), tax, trade, labor and employment, privacy, anti-bribery and anti-corruption, and other U.S. and non-U.S. governmental laws, regulations and policies (including but not limited to those in the United Kingdom and European Union); (xii) any material disruption at any of our manufacturing facilities or other adverse impact on our operations due to severe weather, natural disasters, climate change or other causes; (xiii) our ability to realize expected benefits and cost savings associated with restructuring initiatives; (xiv) cybersecurity and information technology risks, including as a result of security breaches and cybersecurity incidents; (xv) our exposure to claims under our agreements with Sylvamo Corporation; (xvi) the qualification of the Sylvamo Corporation spin-off as a tax-free transaction for U.S. federal income tax purposes; (xvii) risks associated with the planned divestiture of our Global Cellulose Fibers business to AIP, including the costs and expenses related to the transaction, the diversion of management’s attention, our ability to obtain required regulatory approvals and satisfy closing conditions, uncertainty as to whether the transaction may be completed, if at all and asset impairment charges arising from or in connection with the transaction; (xviii) our ability to attract and retain qualified personnel and maintain good employee or labor relations; (xix) our ability to maintain effective internal control over financial reporting; and (xx) our ability to adequately secure and protect our intellectual property rights. These and other factors that could cause or contribute to actual results differing materially from such forward-looking statements can be found in our press releases and reports filed with the U.S. Securities and Exchange Commission. In addition, other risks and uncertainties not presently known to the Company or that we currently believe to be immaterial could affect the accuracy of any forward-looking statements. The Company undertakes no obligation to publicly update any forward-looking statements, whether as a result of new information, future events or otherwise."
}