{
  "source_file": "iri-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nIngersoll Rand Inc. is a diversified, global provider of mission-critical flow creation products, and industrial and life science solutions. The accompanying consolidated financial statements include the accounts of Ingersoll Rand Inc. and its majority-owned subsidiaries (collectively referred to herein as “Ingersoll Rand,” “Company,” “we,” “us,” “our,” or “ourselves”).\nOur Company\nWe are a global market leader with a broad flow creation and industrial product portfolio across air, gas, powder, and liquid handling applications, providing services and solutions to increase industrial and life science productivity, efficiency, and sustainability. We manufacture one of the broadest and most complete ranges of compressor, pump, vacuum and blower products in our markets, which, when combined with our global geographic footprint and application expertise, allows us to provide differentiated product and service offerings to our customers. Our products are sold under more than 80 market-leading brands, including Ingersoll Rand and Gardner Denver, which we believe are globally recognized in their respective end-markets and known for product quality, reliability, efficiency and superior customer service. We are driven by an entrepreneurial spirit and ownership mindset, dedicated to helping make life better for our employees, customers, the planet, and our shareholders.\nThese attributes, along with over 160 years of engineering heritage, generate strong brand loyalty for our products and foster long-standing customer relationships, resulting in leading market positions within each of our operating segments. We have sales in all major geographic markets and our diverse customer base utilizes our products across a wide array of end-markets, including life sciences, food and beverage production, clean energy, industrial manufacturing, infrastructure, water and wastewater treatment, and many others.\nOur products and services are critical to the processes and systems in which they are utilized, which are often complex and the cost of failure or downtime is high. However, our products typically represent only a small portion of the costs of the overall systems or functions that they support. As a result, our customers place a high value on our application expertise, product reliability and the responsiveness of our service. To support our customers and market presence, we maintain significant global scale with over 60 key manufacturing facilities, and over 40 complementary service and repair centers across six continents and over 21,000 employees worldwide as of December 31, 2024.\nThe process-critical nature of our product applications, coupled with the standard wear and tear replacement cycles associated with the usage of our products, generates opportunities to support customers with our broad portfolio of services, spare parts, and consumables. Customers place a high value on maximizing the time their operations are online, reducing their operating expenses, and improving the sustainability of their processes. As a result, the availability of replacement parts, consumables and our repair and support services are key components of our value proposition. Our large installed base of products provides a \n3\nTable of Contents\nrecurring revenue stream through our aftermarket parts, consumables and services offerings. As a result, our aftermarket revenue is significant, representing 36.4% of total Company revenue in 2024.\nOur Segments\nIndustrial Technologies and Services\nWe design, manufacture, market and service a broad range of air and gas compression, vacuum and blower products, fluid transfer equipment, loading systems, power tools and lifting equipment, including associated aftermarket parts, consumables and services. We primarily sell under the Ingersoll Rand, Gardner Denver, Nash, CompAir, Elmo Rietschle, and over 30 other brands. Our customers deploy our products across a wide array of applications in diverse end-markets. Compressors are used to increase the pressure of air or gas, vacuum products are used to remove air or gas in order to reduce the pressure below atmospheric levels, and blower products are used to produce a high volume of air or gas at low pressure. Almost every manufacturing and industrial facility, and many service and process industry applications, use air compression, vacuum and blower products in a variety of process-critical applications such as the operation of pneumatic tools, pumps and motion control components, air and gas separation, vacuum packaging of food products and aeration of waste water, among others. Our vacuum pumps and compressors are used in many power generation, mining, oil and gas refining and processing, chemical processing and general industrial applications including flare gas and vapor recovery, geothermal gas removal, vacuum deaeration, water extraction in mining and paper and chlorine compression in petrochemical operations. Our engineered loading systems and fluid transfer equipment ensure the safe handling and transfer of crude oil, liquefied natural gas, compressed natural gas, chemicals, and bulk materials. Our power tools and lifting equipment portfolio includes electric and cordless fastening systems, pneumatic bolting tools, drilling and material removal tools, hoists, winches and ergonomic handling devices. Typical applications for these products include the precision fastening of bolted joints in the production, assembly and servicing of industrial machinery, on-highway and off-highway vehicles, aircraft, electronics and other equipment.\nOur compression products cover the full range of technologies, including rotary screw, reciprocating piston, scroll, rotary vane and centrifugal compressors. Our vacuum products and blowers also cover the full technology spectrum; vacuum technologies include side channel, liquid ring, claw vacuum, screw, turbo and rotary vane vacuum pumps among others, while blower technologies include rotary lobe, screw, claw and vane, side channel and radial blowers.\nWe complement these products with a broad portfolio of service options tailored to customer needs and a complete range of aftermarket parts, air treatment equipment, controls and other accessories delivered through our global network of manufacturing and service locations and distributor partners. The breadth and depth of our product offering creates incremental business opportunities by allowing us to cross-sell our full product portfolio and uniquely address customers’ needs in one complete solution.\nWe sell our products through an integrated network of direct sales representatives and independent distributors, which is strategically tailored to meet the dynamics of each target geography or end-market. Our large installed base also provides for a significant stream of recurring aftermarket revenue. For example, the useful life of a compressor is, on average, between 10 and 12 years. However, a customer typically services the compressor at regular intervals, starting within the first two years of purchase and continuing throughout the life of the product. The cumulative aftermarket revenue generated by a compressor over the product’s life cycle will typically exceed its original sale price.\nPrecision and Science Technologies\nWe design, manufacture and market a broad range of highly-specialized equipment for both industrial and life sciences markets. Our products are used for precision dosing, liquid and solid transfer, dispensing, gas compression, gas sampling, pressure management, flow control, and powder handling, amongst other applications. Major categories of our portfolio are (a) pumps and liquid handling systems and (b) life science tools and systems. Within pumps and liquid handling systems, our offering covers a broad range of pump and flow control technology types. This includes diaphragm pumps, piston pumps, water-powered pumps, peristaltic pumps, gear pumps, vane pumps, progressive cavity pumps, syringe pumps, gas boosters, hydrogen compression systems, automated liquid handling systems, odorant injection systems, controls, software and other related components and accessories. These offerings are sold under brands that are highly recognized in their end markets including Air Dimensions, Albin, ARO, Dosatron, Haskel, Ingersoll Rand, LMI, Maximus, Milton Roy, MP, Oberdorfer, Seepex, Thomas, Welch, Williams, YZ and Zinsser Analytic. Within life science tools and systems, our primary offerings include single-use powder handling systems and isolators for disposable process and powder containment, and contract design and productions for services for silicone, thermoplastic, and specialty components and assemblies for medical devices. These offerings are sold primarily under the ILC Dover and Flexan brands. We also manufacture space suits, inflatable habitats, and lighter-than-air vehicles for human mobility and habitation and defense applications. Our customer base is composed of a wide range of end users in markets including life sciences, industrial manufacturing, water and waste water, chemical processing, \n4\nTable of Contents\nenergy, food and beverage, agriculture and others. Our sales are realized primarily through a combination of independent specialty and national distributors and relationships directly with original equipment manufacturers (“OEM”), Engineering, Procurement and Construction (“EPC”) companies and end users.\nRecent Developments\nRecent Acquisitions\nThe Company continued its focus on generating inorganic growth through acquisitions that strengthen our position in core product categories and broaden our exposure to high-growth, sustainable end markets. We completed or announced the acquisition of several businesses during 2024, including the following:\n•\nIn February 2024, the Company completed the acquisition of Friulair S.r.l. (“Friulair”) for initial cash consideration of $143.3 million and contingent consideration of up to approximately $11.0 million. The business is a manufacturer of dryers, filters, aftercoolers, and accessories for the treatment of compressed air and its chiller product line.\n•\nIn June 2024, the Company completed the acquisition of Astronaut Topco, LP and Astronaut Topco GP, LLC (collectively “ILC Dover”) for initial cash consideration of $2,349.7 million and contingent consideration of up to $75.0 million. ILC Dover’s offerings include solutions for biopharmaceutical, pharmaceutical, and medical device markets as well as products for the space industry.\n•\nIn October 2024, the Company completed the acquisition of Air Power Systems Co LLC (“APSCO”) for cash consideration of $113.2 million. The business is a provider of hydraulic and pneumatic products and engineered solutions serving diverse specialty work truck vehicles. APSCO’s offerings include hydraulic coolers, systems, and components in addition to pneumatic consoles, cylinders, valves, and switches.\nRefer to Note 4 “Acquisitions” to our audited consolidated financial statements included elsewhere in this Form 10-K for further discussion of our acquisitions.\nCapital Allocation\nShare Repurchases\nWe repurchased $260.7 million of our common stock during the year ended December 31, 2024, including $250.0 million of repurchases under our share repurchase program.\nDebt Borrowings\nDuring the year ended December 31, 2024, we had net borrowings on long-term debt of $2,054.2 million. The net borrowings included proceeds from the issuance of Senior Notes, partially offset by repayment of our Dollar Term Loan B and Dollar Term Loan.\nDividends on Common Stock\nThe Company paid cash dividends on our common stock of $32.3 million during the year ended December 31, 2024.\nOur Industries and Products\nIndustrial Technologies and Services\nOur Industrial Technologies and Services segment designs, manufactures, markets and services a broad range of air compression, vacuum and blower products across a wide array of technologies, as well as other specialized industrial products. Compression, vacuum and blower products are used in a wide spectrum of applications in nearly all manufacturing and industrial facilities and many service and process industries in a variety of end-markets, including clean energy, life sciences, food and beverage production, general manufacturing, infrastructure, and others.\nCompression Products\nSales to industrial end-markets include industrial air compression products, as well as associated aftermarket parts, consumables and services. Industrial air compressors compress air to create pressure to power machinery, industrial tools, material handling systems and automated equipment. Compressed air is also used in applications as diversified as snow making and fish farming, on high-speed trains and in hospitals. Compressors can be either stationary or portable, depending on the requirements of the application or customer.\n5\nTable of Contents\nWe focus on five basic types of air compression technologies: rotary screw, reciprocating piston, scroll, rotary vane and centrifugal compressors. Rotary screw compressors are a newer technology than reciprocating compressors and exhibit better suitability for continuous processes due to a more compact size, less maintenance and better noise profile. We believe our reciprocating piston compressors provide one of the broadest ranges of pressures in the market and are supported by increasing demand across wide-ranging attractive end-markets. Scroll compressors are most commonly seen where less oil-free air is needed, and is most commonly used in medical and food applications where the need for pure, clean and precise air is of great importance. Rotary vane compressors feature high efficiency, compact compression technology and can be found throughout all sectors of industry, including automotive, food and beverage, energy and manufacturing with specialized solutions within transit, gas and snow making. Centrifugal compressors are most effective when in applications that demand larger quantities of oil-free air and are utilized across a wide range of industries.\nVacuum Products\nIndustrial vacuum products are integral to manufacturing processes in applications for packaging, pneumatic conveying, drying, holding / lifting, distillation, evacuation, forming / pressing, removal and coating. Within each of these processes are a multitude of sub-applications. As an example of one such end-process, within packaging, a vacuum will be used on blister packaging, foil handling, labeling, carton erection, stacking and palletizing (placing, stacking or transporting goods on pallets), as well as central vacuum supply for entire packaging departments.\nWe focus on five basic types of vacuum technologies: side channel, liquid ring, claw vacuum, screw and rotary vane vacuum pumps. Side channel vacuum pumps are used for conveying gases and gas-air mixtures in a variety of applications, including laser printers, packaging, soil treatment, textiles and food and beverage products. Liquid ring vacuum pumps are used for extreme conditions, which prevail in humid and wet processes across ceramics, environmental, medical and plastics applications. Claw vacuum pumps efficiently and economically generate contact-free vacuum for chemical, environmental and packaging applications. Screw vacuum pumps are a dry running technology used to reduce the carbon footprint and life cycle costs in drying and packaging applications. Rotary vane vacuum pumps are used for vacuum and combined pressure and vacuum applications in the environmental, woodworking, packaging and food and beverage end-markets.\nBlower Products\nBlower products are used for conveying high volumes of air and gas at various flow rates and at low pressures, and are utilized in a broad range of industrial and environmental applications, including waste water aeration, biogas upgrading and conveying, pneumatic transport and dehydrating applications for food and beverage, cement, pharmaceutical, petrochemical and mobile industrial applications. In many cases, blowers are a core component for the operation of the entire end-users’ systems. Management believes that we hold a leading position in our addressable portion of the global blower products market.\nWe focus on several key technologies within blower products: rotary lobe, screw, claw and vane, turbo, side channel and radial blowers. Rotary lobe blowers, screw blowers and claw and vane blowers are positive displacement technologies that have the ability to consistently move the same volume of gas or air and vary the volume flow according to the speed of the machine itself enabling it to adapt the flow condition in a flexible manner despite pressure in the system. Turbo blowers and side channel and radial blowers are dynamic technologies that have the ability to accelerate gas or air through an impeller and transform their kinetic energy at the discharge with some limitation on flexibility.\nPrecision and Science Technologies\nThe Precision and Science Technologies segment designs, manufactures and markets a broad range of niche fluidics and powder handling solutions for the life sciences, food and beverage, water and wastewater, general manufacturing, chemical processing, clean energy, aerospace, and other end markets. Key technologies include positive displacement pumps, automated liquid handling systems, and single-use powder and liquid handling and containment systems.\nPositive Displacement (PD) Pumps\nPositive displacement pumps are essential to highly specialized flow applications across many industries. We are a market leader in positive displacement pumps, covering the main technology types including diaphragm, vane, piston, progressive cavity, peristaltic and gear. In the life sciences end-market, our gas and liquid pumps are used for a wide range of applications, such as aspirators, blood analyzers, compression therapy, dialysis machines, gas monitors, ventilators, and scientific instrumentation within in vitro diagnostics and R&D laboratories. In the water and environmental end-market, our pumps and related equipment are used for water treatment in municipal and industrial facilities such as in dosing and sludge transfer. In agriculture, our pumps are used for nutrient and medicine dosing to livestock, plants and medicinals. Finally in the general industrial end-market, our pumps and accessories serve a broad range of niche applications such as in the handling of abrasive or chemically active fluids. \n6\nTable of Contents\nControls and Software\nEquipment controls and software are of increasing importance in our flow control applications for both the optimization of current systems as well as to enable the Industrial Internet of Things (“IIoT”) evolution. In the agriculture market, we sell controllers and software that monitor and control the main functions within livestock and greenhouse facility operations with the benefit of reducing cost and improving yield. In natural gas pipelines and distribution, we sell monitoring devices connected to cloud-based software for real time monitoring of odor injection pumping systems, which enhances safety and reduces costs. Similarly, on our positive displacement progressive cavity sludge pumps, we sell monitoring devices and cloud-based software for real-time pump health and performance monitoring, which prevents costly downtime in water treatment plants as well as in industrial installations. \nRobotics\nOur automated liquid handling products, which includes syringe pumps and accessories, are integrated into large-scale, automated liquid handling systems used within clinical, pharmaceutical and environmental applications. These automated systems provide accurate and efficient dosing, sampling and handling of critical fluids at increasingly ultra-low flow levels, which are required in lab and life science applications.\nPowder and Liquid Handling and Containment Systems\nThe safe and efficient handling of high-value and high-potency powders and liquids is essential for the global production of biopharmaceutical and pharmaceutical products. We manufacture a leading range of single-use powder handling solutions, single-use liquid bags, isolators, and other related products for large and small molecule workflow applications from weigh and dispense to fill and finish.\nCompetition\nIndustrial Technologies and Services\nThe industrial end-markets we serve are competitive, with an increasing focus on product quality, performance, energy efficiency, customer service and local presence. Although there are several large manufacturers of compression, vacuum and blower products, the marketplace for these products remains highly fragmented due to the wide variety of product technologies, applications and selling channels. Our principal competitors in sales of compression, vacuum and blower products include Atlas Copco, Flowserve, IDEX Corporation and Kaeser Compressors.\nPrecision and Science Technologies\nCompetition in the markets served by our Precision and Science Technologies segment is primarily based on product quality and performance, as most products must be qualified by the customer for a particular use. Further, there is an increasing demand for more efficient healthcare solutions, which is driving the adoption of premium and high performance systems. Our primary competitors include Dover, Graco, IDEX Corporation, KNF Neuberger, Netzsch, NOV, Sartorius, SPX Flow, Thermo Fisher Scientific, and Watson-Marlow, as well as other regional and local manufacturers.\nCustomers and Customer Service\nWe consider superior customer service to be one of our primary pillars of future success and view it as being built upon a foundation of critical application expertise, an industry leading range of compressor, pump, vacuum and blower products, a global manufacturing and sales presence and a long-standing reputation for quality and reliability. Intense customer focus is at the center of our vision of becoming the industry’s first choice for innovative and application-critical flow creation equipment, services and solutions. We strive to collaborate with our customers and become an essential part of their engineering process by drawing on our deep industry and application engineering experience to develop best-in-class products that are critical to the processes and systems in which they operate.\nWe have established strong and long-standing customer relationships with numerous industry leaders. We sell our products directly to end-use customers and to certain OEMs, and indirectly through independent distributors and sales representatives.\nWe use a direct sales force to serve end-use customers and OEMs because these customers typically require higher levels of technical assistance, more coordinated shipment scheduling and more complex product service than customers that purchase through distributors. We have distribution centers and warehouses that stock parts, accessories and certain products to provide adequate and timely availability.\n7\nTable of Contents\nIn addition to our direct sales force, we are committed to developing and supporting our global network of distributors and representatives who provide a competitive advantage in the markets and industries we serve. These distributors maintain an inventory of complete units and parts and provide aftermarket services to end-users. While most distributors provide a broad range of products from different suppliers, we view our distributors as exclusive at the product category level (e.g. compressor, vacuum and blower). For example, a distributor may exclusively carry our compressor technologies, and also source additional components of the broader industrial system in which those products operate from other suppliers. Our service personnel and product engineers provide the distributors’ service representatives with technical assistance and field training, particularly with respect to installation and repair of equipment. We also provide our distributors with sales and product literature, advertising and sales promotions, order-entry and tracking systems and an annual restocking program. Furthermore, we participate in major trade shows and directly market our offerings to generate sales leads and support the distributors’ sales personnel.\nOur customer base is diverse, and we did not have any customer that individually provided more than 10% of 2024 consolidated revenues.\nPatents, Tradenames, and Other Intellectual Property\nWe rely on a combination of intellectual property rights, including patents, tradenames, copyrights, trade secrets and contractual provisions to protect our intellectual property. While in the aggregate our more than 2,000 patents and our tradenames are of considerable importance to the manufacture and marketing of many of our products, we believe that the success of our business depends more on the technical competence, creativity and marketing abilities of our employees than on any individual patent or tradename, and therefore we do not consider any single patent or tradename, group of patents or tradenames, copyright or trade secret to be material to our business as a whole, except for the \nIngersoll Rand\n and \nGardner Denver\n tradenames. We have registered our tradenames in the countries we deem necessary or in our best interest. We also rely upon trade secret protection for our confidential and proprietary information and techniques, and we routinely enter into confidentiality agreements with our employees as well as our suppliers and other third parties receiving such information.\nPursuant to tradename license agreements, Cooper Industries has exclusive rights to use the \nGardner Denver\n tradename for certain power tools and their components, meaning that we are prevented from using this mark in connection with those products.\nRaw Materials and Suppliers\nWe purchase a wide variety of raw materials to manufacture our products. Our most significant commodity exposures are to cast iron, aluminum and steel. Additionally, we purchase a large number of motors and, therefore, are also exposed to changes in the price of copper, which is a primary component of motors. Most of our raw materials are generally available from a number of suppliers. We have a limited number of long-term contracts with some suppliers of key components, but we believe that our sources of raw materials and components are reliable and adequate for our needs. In response to recent tightness in the supply chain and in order to improve continuity of supply, for select materials and components, we have expanded our supplier network in areas we have historically sole sourced. We continue to use single sources of supply for certain castings, motors and other select engineered components. A disruption in deliveries from a given supplier could therefore have an adverse effect on our ability to meet commitments to our customers. Nevertheless, we believe that we have appropriately balanced this risk against the cost of maintaining a greater number of suppliers. Moreover, we have sought, and will continue to seek, cost reductions in purchases of materials and supplies by consolidating purchases and pursuing alternate sources of supply.\nHuman Capital Management\nAt Ingersoll Rand, we recognize that what sets us apart is our talented employees combined with our ownership mindset that empowers and engages all employees. The passion, innovation and commitment of our team drives our incredible results, and we believe that our commitment to a safe, respectful, inclusive environment where all employees have the ability to be heard, impact change and develop and grow is what drives our employees. As of December 31, 2024, we had over 21,000 employees, with approximately 6,300 of them working in the United States. Works councils and collective bargaining units represent a significant number of employees outside the United States, while approximately 380 employees in the United States are represented by labor unions. We believe that we maintain satisfactory relations with our employees.\nTo ensure the effectiveness of our human capital management practices, we evaluate various metrics, including voluntary turnover and engagement. In 2024, the voluntary turnover rate was 8.5% and 7.4% for hourly and salaried employees, respectively. In 2023, the voluntary turnover rate was 12.2% and 8.7% for hourly and salaried employees, respectively.\nWe are committed to employee empowerment, engagement and development as a standard part of our employee experience. Annually, our functions and businesses complete a multi-year strategy and financial plan. We then conduct strategic talent reviews and succession planning in support of the strategic plan. From that strategy, company objectives are finalized and \n8\nTable of Contents\ncommunicated from the Chief Executive Officer to initiate yearly objectives and development plans for all salaried employees. Team-specific objectives are also cascaded during this time. Throughout the year, we assess our talent against their performance to stated objectives and the competencies and behaviors they exhibited while executing their goals. Our performance management and development planning processes ensure we execute high quality and thoughtful objectives, development plans, and mid-year and year-end reviews that reinforce the importance of continuous improvement over time. Throughout the year, we provide training resources and materials to support both employees and managers. We track the completion of each phase through our human resources system.\nCompetitive Pay, Benefits and Equity\nOur compensation and benefits philosophy is centered on two key fundamentals: (1) building long-term value for our stockholders, and (2) driving employee engagement and retention. We are committed to providing competitive pay, benefits, and equity that are valuable and meaningful to our employees. We provide a competitive total compensation package with a significant portion designed to foster a culture of ownership. We continue to offer our Ownership Works program to grant equity to all new and acquired employees regardless of level in the organization. It is our goal to foster an environment where employees can think and act like owners.\nBelonging and Engagement\nIngersoll Rand is committed to upholding an inclusive and engaging environment where all employees can succeed. Our values of “We foster inspired teams” and “We think and act like owners” drives us to maintain a culture that gives voice and opportunity to all employees and enhances a sense of belonging. We expect everyone to uphold these values with humility, integrity, and respect. We focus on attracting the best talent from all backgrounds, ensuring employees are engaged, have a strong sense of belonging, and have opportunities to develop and grow. \nWe understand that achieving our objectives requires a continuous focus on talent attraction, retention, engagement and development. By prioritizing these areas, we are confident in our ability to cultivate a workforce that is not only highly skilled but also reflects our global community.\nWe collaborate with universities, key industry, and professional organizations, such as Disability IN, the Society of Hispanic Professional Engineers, National Black MBA Association and Women in Manufacturing, to recruit early and mid-level talent. These partnerships help us build a top talent pipeline.\nTalent Development and Employee Engagement\nWe are dedicated to supporting our employees’ growth and development. We provide many development opportunities for early career employees, including global internships, engineering, marketing, and manufacturing career programs. In 2024, we won two Brandon Hall Group Excellence Awards. The Brandon Hall Group recognizes organizations that have successfully deployed programs, strategies, and tools that have achieved measurable results. We received a gold award in the Talent Management Category for “Think and Act Like an Owner at Ingersoll Rand.”\nWe continuously strive to enhance our workforce’s technical, professional, and leadership capabilities at every level. Our leadership development programs are designed to promote inclusion as a core development principle and a professional skill. We offer skill-based programs to upskill our manufacturing employees to meet the industry’s ever-changing demands. In addition, we successfully deliver an executive-level program called “Lead Like an Owner” to establish the standard of leadership and build succession at the top of the organization. To support the development of our employees, we have various resources and programs in place to facilitate their growth and progress. Our offerings align with our values and strategies, reflected in our competencies. We offer both instructor-led and online learning content globally.\nBy offering each and every employee opportunities to learn and grow and an ownership stake in the Company, we have built one of the most engaged workforces in our industry. In May 2024, our Connections Engagement survey achieved an 88% participation rate, resulting in an engagement score of 81. This places Ingersoll Rand again in the top 10% of manufacturing organizations surveyed. In addition, our survey questions scored above the manufacturing benchmark collected by our engagement survey partner, with our essential employee satisfaction measure ranking two points above the top 10% manufacturing average. \nOur continually strong employee engagement is also driven by our ownership mindset and our employees’ perspective that Ingersoll Rand is “my company.” We provide equity grants to all employees, whether they join as new hires or through acquisition, after one year of service. This, along with our solid strategy, strong values, and clear expectations, has given us strong engagement and a competitive edge. \n9\nTable of Contents\nBecause of the investments we have made in our employees, we continue to receive external recognition for being a great place to work. Accolades include winning Great Place to Work in the United States and in several Latin American countries.\nThrough our Human Capital Management activities, we reflect our value of “We foster inspired teams.” We nurture and celebrate a culture that embraces diverse points of view, backgrounds, and experiences and truly empower our employees as owners.\nEnvironmental Matters\nWe are subject to numerous federal, state, local and foreign laws and regulations relating to the storage, handling, emission and disposal of materials and discharge of materials into the environment. We believe our existing environmental control procedures are adequate and we have no current plans for substantial capital expenditures in this area. We have an environmental policy that confirms our commitment to a clean environment and compliance with environmental laws. We have an active environmental management program aimed at complying with existing environmental regulations and reducing the generation of pollutants in the manufacturing processes. We are also subject to laws concerning the cleanup of hazardous substances and wastes, such as the U.S. federal “Superfund” and similar state laws that impose liability for cleanup of certain waste sites and for related natural resource damages. We have been identified as a potentially responsible party with respect to several sites designated for cleanup under the “Superfund” or similar state laws. See “Item 3. Legal Proceedings.”\nWhere You Can Find More Information\nWe file annual, quarterly and current reports, proxy statements and other information with the Securities and Exchange Commission (“SEC”). Our SEC filings are available to the public over the internet at the SEC’s website at \nhttp://www.sec.gov\n. Our SEC filings are also available free of charge on our website at \nhttp://www.irco.com\n as soon as reasonably practicable after they are filed with or furnished to the SEC.\nWe maintain an internet site at \nhttp://www.irco.com\n. From time to time, we may use our website as a distribution channel of material company information. Financial and other important information regarding us is routinely accessible through and posted on our website at \nwww.investors.irco.com\n. In addition, you may automatically receive email alerts and other information about us when you enroll your email address by visiting the Email Alerts section at \nwww.investors.irco.com\n. Our website and the information contained on or connected to that site are not incorporated into this Annual Report on Form 10-K.",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion contains management’s discussion and analysis of our financial condition and results of operations and should be read together with our audited consolidated financial statements and related notes to our consolidated financial statements included elsewhere in this Form 10-K. This discussion contains forward-looking statements and involves numerous risks and uncertainties. Our actual results may differ materially from those anticipated in any forward-looking statements as a result of many factors, including those set forth under the “Special Note Regarding Forward-Looking Statements,” “Item 1A. Risk Factors” and elsewhere in this Form 10-K.\nExecutive Overview\nOur Company\nIngersoll Rand is a global market leader with a broad range of innovative and mission-critical air, fluid, clean energy and medical technologies, providing services and solutions to increase industrial productivity and efficiency. We manufacture one of the broadest and most complete ranges of compressor, pump, vacuum and blower products in our markets, which, when combined with our global geographic footprint and application expertise, allows us to provide differentiated product and service offerings to our customers. Our products are sold under a collection of premier, market-leading brands, including Ingersoll Rand, Gardner Denver, Nash, CompAir, Thomas, Milton Roy, Seepex, Elmo Rietschle, ARO, Robuschi, ILC Dover, Emco Wheaton \n21\nTable of Contents\nand Runtech Systems, which we believe are globally recognized in their respective end-markets and known for product quality, reliability, efficiency and superior customer service.\nThese attributes, along with over 160 years of engineering heritage, generate strong brand loyalty for our products and foster long-standing customer relationships, which we believe have resulted in leading market positions within each of our operating segments. We have sales in all major geographic markets and our diverse customer base utilizes our products across a wide array of end-markets that have favorable near- and long-term growth prospects, including industrial manufacturing, clean energy, transportation, medical and laboratory sciences, food and beverage packaging and chemical processing.\nOur products and services are critical to the processes and systems in which they are utilized, which are often complex and function in harsh conditions where the cost of failure or downtime is high. However, our products and services typically represent only a small portion of the costs of the overall systems or functions that they support. As a result, our customers place a high value on our application expertise, product reliability and the responsiveness of our service. To support our customers and market presence, we maintain significant global scale with over 60 key manufacturing facilities, and over 40 complementary service and repair centers across six continents and over 21,000 employees worldwide as of December 31, 2024.\nThe process-critical nature of our product applications, coupled with the standard wear and tear replacement cycles associated with the usage of our products, generates opportunities to support customers with our broad portfolio of aftermarket parts, consumables and services. Customers place a high value on minimizing any time their operations are offline. As a result, the availability of replacement parts, consumables and our repair and support services are key components of our value proposition. Our large installed base of products provides a recurring revenue stream through our aftermarket parts, consumables and services offerings. As a result, our aftermarket revenue is significant, representing 36.4% of total Company revenue in 2024.\nComponents of Our Revenue and Expenses\nRevenues\nWe generate revenue from sales of original equipment and associated aftermarket parts, consumables and services. We sell our products and deliver services both directly to end-users and through independent distribution channels, depending on the product line and geography. Revenue derived from short duration contracts is recognized at a single point in time when control is transferred to the customer, generally at shipment or when delivery has occurred or as services are performed. Certain contracts involve significant design engineering unique to customer specifications, and depending upon the contractual terms, revenue is recognized either over the duration of the contract or at contract completion when equipment is delivered to the customer. \nExpenses\nCost of Sales\nCost of sales includes the costs we incur, including purchased materials, labor and overhead related to manufactured products and aftermarket parts sold during a period. Depreciation related to manufacturing equipment and facilities is included in cost of sales. Purchased materials represent the majority of costs of sales, with steel, aluminum, copper and partially finished castings representing our most significant material inputs. Stock-based compensation expense for employees associated with the manufacture of products or delivery of services to customers is included in cost of sales. We have instituted a global sourcing strategy to take advantage of coordinated purchasing opportunities of key materials across our manufacturing plant locations.\nCost of sales for services includes the direct costs we incur, including direct labor, parts and other overhead costs including depreciation of equipment and facilities, to deliver repair, maintenance and other field services to our customers.\nSelling and Administrative Expenses\nSelling and administrative expenses consist of (i) salaries and other employee-related expenses for our selling and administrative functions and other activities not associated with the manufacture of products or delivery of services to customers; (ii) facility operating expenses for selling and administrative activities, including office rent, maintenance, depreciation and insurance; (iii) marketing and direct costs of selling products and services to customers including internal and external sales commissions; (iv) research and development expenditures; (v) professional and consultant fees; (vi) employee related stock-based compensation for our selling and administrative functions and (vii) other miscellaneous expenses. Certain corporate expenses, including those related to our shared service centers in the United States and Europe, that directly benefit our businesses are allocated to our business segments. Certain corporate administrative expenses, including corporate executive compensation, treasury, certain information technology, internal audit and tax compliance, are not allocated to the business segments.\n22\nTable of Contents\nAmortization of Intangible Assets\nAmortization of intangible assets includes the periodic amortization of intangible assets, including customer relationships, tradenames, developed technology, backlog and internal-use software.\nOther Operating Expense, Net\nOther operating expense, net includes foreign currency transaction gains and losses, net, restructuring charges, acquisition and other transaction related expenses and non-cash charges, losses and gains on asset disposals and other miscellaneous operating expenses.\nProvision (Benefit) for Income Taxes\nThe provision or benefit for income taxes includes U.S. federal, state and local income taxes and all non-U.S. income taxes. We are subject to income tax in 48 jurisdictions outside of the United States. Because we conduct operations on a global basis, our effective tax rate depends, and will continue to depend, on the geographic distribution of our pre-tax earnings among several different taxing jurisdictions. Our effective tax rate can also vary based on changes in the tax rates of the different jurisdictions, the availability of tax credits and non-deductible items.\nItems Affecting our Reported Results\nGeneral Economic Conditions and Capital Spending in the Industries We Serve\nOur financial results closely follow changes in the industries and end-markets we serve. Demand for most of our products depends on the level of new capital investment and planned and unplanned maintenance expenditures by our customers. The level of capital expenditures depends, in turn, on the general economic conditions as well as access to capital at reasonable cost. In particular, demand for our Industrial Technologies and Services products generally correlates with the rate of total industrial capacity utilization and the rate of change of industrial production. Capacity utilization rates above 80% have historically indicated a strong demand environment for industrial equipment. In our Industrial Technologies and Services segment, overall economic growth and industrial production, as well as secular trends, impact demand for our products. In certain businesses of our Precision and Science Technologies segment, we expect demand for our products to be driven by favorable trends, including the growth in healthcare spend and expansion of healthcare systems due to an aging population requiring medical care and increased investment in health solutions and safety infrastructures in emerging economies. Over longer time periods, we believe that demand for all of our products also tends to follow economic growth patterns indicated by the rates of change in the GDP around the world, as augmented by secular trends in each segment. Our ability to grow and our financial performance will also be affected by our ability to address a variety of challenges and opportunities that are a consequence of our global operations, including efficiently utilizing our global sales, manufacturing and distribution capabilities and engineering innovative new product applications for end-users in a variety of geographic markets.\nForeign Currency Fluctuations\nA significant portion of our revenues, 55% for the year ended December 31, 2024, was denominated in currencies other than the U.S. dollar. Because much of our manufacturing facilities and labor force costs are outside of the United States, a significant portion of our costs are also denominated in currencies other than the U.S. dollar. Changes in foreign exchange rates can therefore impact our results of operations and are quantified when significant to our discussion.\nFactors Affecting the Comparability of our Results of Operations\nCertain factors affecting the comparability of our current and historical results of operations are summarized below.\nAcquisitions\nPart of our strategy for growth is to acquire complementary businesses that provide access to new technologies or geographies or expand our offerings. While acquisitions, as discussed further in Note 4, are not individually significant or significant in the aggregate, they may be relevant when comparing our results from period to period.\nSee Note 4 “Acquisitions” to our audited consolidated financial statements included elsewhere in this Form 10-K for further discussion of these acquisitions.\n23\nTable of Contents\nHow We Assess the Performance of Our Business\nWe manage operations through the two business segments described above. In addition to our consolidated GAAP financial measures, we review various non-GAAP financial measures, including Adjusted EBITDA, Adjusted Net Income and Free Cash Flow.\nWe believe Adjusted EBITDA and Adjusted Net Income are helpful supplemental measures to assist us and investors in evaluating our operating results as they exclude certain items whose fluctuation from period to period do not necessarily correspond to changes in the operations of our business. Adjusted EBITDA represents net income (loss) before interest, taxes, depreciation, amortization and certain non-cash, non-recurring and other adjustment items. We believe that the adjustments applied in presenting Adjusted EBITDA are appropriate to provide additional information to investors about certain material non-cash items and about non-recurring items that we do not expect to continue at the same level in the future. Adjusted Net Income is defined as net income (loss) including interest, depreciation and amortization of non-acquisition related intangible assets and excluding other items used to calculate Adjusted EBITDA and further adjusted for the tax effect of these exclusions.\nWe use Free Cash Flow to review the liquidity of our operations. We measure Free Cash Flow as cash flows from operating activities less capital expenditures. We believe Free Cash Flow is a useful supplemental financial measure for us and investors in assessing our ability to pursue business opportunities and investments and to service our debt. Free Cash Flow is not a measure of our liquidity under GAAP and should not be considered as an alternative to cash flows from operating activities.\nManagement and our board of directors regularly use these measures as tools in evaluating our operating and financial performance and in establishing discretionary annual compensation. Such measures are provided in addition to, and should not be considered to be a substitute for, or superior to, the comparable measures under GAAP. In addition, we believe that Adjusted EBITDA, Adjusted Net Income and Free Cash Flow are frequently used by investors and other interested parties in the evaluation of issuers, many of which also present Adjusted EBITDA, Adjusted Net Income and Free Cash Flow when reporting their results in an effort to facilitate an understanding of their operating and financial results and liquidity.\nAdjusted EBITDA, Adjusted Net Income and Free Cash Flow should not be considered as alternatives to net income (loss) or any other performance measure derived in accordance with GAAP, or as alternatives to cash flow from operating activities as a measure of our liquidity. Adjusted EBITDA, Adjusted Net Income and Free Cash Flow have limitations as analytical tools, and you should not consider such measures either in isolation or as substitutes for analyzing our results as reported under GAAP.\nIncluded in our discussion of our consolidated and segment results below are changes in revenues and Adjusted EBITDA on a Constant Currency basis. Constant Currency information compares results between periods as if exchange rates had remained constant period over period. We define Constant Currency revenues and Adjusted EBITDA as total revenues and Adjusted EBITDA excluding the impact of foreign exchange rate movements and use it to determine the Constant Currency revenue and Adjusted EBITDA growth on a year-over-year basis. Constant Currency revenues and Adjusted EBITDA are calculated by translating current period revenues and Adjusted EBITDA using corresponding prior period exchange rates. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a Constant Currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP.\nFor further information regarding these measures, see “Non-GAAP Financial Measures” below.\nResults of Continuing Operations\nConsolidated results should be read in conjunction with segment results and the Segment Information notes to our audited consolidated financial statements included elsewhere in this Form 10-K, which provide more detailed discussions concerning certain components of our consolidated statements of operations. All intercompany accounts and transactions have been eliminated within the consolidated results.\nThis section discusses our results of continuing operations for the year ended December 31, 2024 as compared to the year ended December 31, 2023. For a discussion and analysis of the year ended December 31, 2023, compared to the same in 2022, please refer to the “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2023 filed with the SEC on February 23, 2024.\n24\nTable of Contents\nConsolidated Results of Operations for the Years Ended December 31, 2024 and 2023\nYear Ended December 31,\n2024\n2023\nConsolidated Statements of Operations\nRevenues\n$\n7,235.0 \n$\n6,876.1 \nCost of sales\n4,065.0 \n3,993.9 \nGross Profit\n3,170.0 \n2,882.2 \nSelling and administrative expenses\n1,344.4 \n1,272.7 \nAmortization of intangible assets\n373.0 \n367.5 \nImpairment of other intangible assets\n13.9 \n— \nOther operating expense, net\n138.6 \n77.7 \nOperating Income\n1,300.1 \n1,164.3 \nInterest expense\n213.2 \n156.7 \nLoss on extinguishment of debt\n3.0 \n13.5 \nOther income, net\n(48.9)\n(37.0)\nIncome Before Income Taxes\n1,132.8 \n1,031.1 \nProvision for income taxes\n262.5 \n240.0 \nLoss on equity method investments\n(24.0)\n(6.0)\nNet Income\n846.3 \n785.1 \nLess: Net income attributable to noncontrolling interests\n7.7 \n6.4 \nNet Income Attributable to Ingersoll Rand Inc.\n$\n838.6 \n$\n778.7 \nPercentage of Revenues\nGross Profit\n43.8 \n%\n41.9 \n%\nSelling and administrative expenses\n18.6 \n%\n18.5 \n%\nOperating Income\n18.0 \n%\n16.9 \n%\nNet Income\n11.7 \n%\n11.4 \n%\nAdjusted EBITDA\n(1)\n27.9 \n%\n26.0 \n%\nOther Financial Data\nAdjusted EBITDA\n(1)\n$\n2,018.1 \n$\n1,786.8 \nAdjusted net income\n(1)\n1,349.3 \n1,215.8 \nCash flows - operating activities\n1,396.7 \n1,377.4 \nCash flows - investing activities\n(3,107.7)\n(1,060.5)\nCash flows - financing activities\n1,707.5 \n(337.5)\nFree cash flow\n(1)\n1,247.6 \n1,272.0 \n(1)\nSee “Non-GAAP Financial Measures” below for a reconciliation to the most directly comparable GAAP measure.\nRevenues\nRevenues for 2024 were $7,235.0 million, an increase of $358.9 million, or 5.2%, compared to $6,876.1 million in 2023. The increase in revenues was primarily due to acquisitions of $471.2 million and higher pricing of $153.3 million, partially offset by lower organic volumes of $241.9 million and unfavorable impact of foreign currencies of $23.7 million. The percentage of consolidated revenues derived from aftermarket parts and services was 36.4% in 2024 compared to 35.8% in 2023.\nGross Profit\nGross profit in 2024 was $3,170.0 million, an increase of $287.8 million, or 10.0%, compared to $2,882.2 million in 2023, and as a percentage of revenues was 43.8% in 2024 and 41.9% in 2023. The increase in gross profit is primarily due to higher pricing and acquisitions discussed above. The increase in gross profit as a percentage of revenues is primarily due to increased price and input cost productivity improvements.\n25\nTable of Contents\nSelling and Administrative Expenses\nSelling and administrative expenses were $1,344.4 million in 2024, an increase of $71.7 million, or 5.6%, compared to $1,272.7 million in 2023. The increase in selling and administrative expenses was mainly from businesses acquired in the second half of 2023 and in 2024, partially offset by lower incentive compensation expense. Selling and administrative expenses as a percentage of revenues was 18.6% in 2024 and 18.5% in 2023.\nAmortization of Intangible Assets\nAmortization of intangible assets was $373.0 million in 2024, an increase of $5.5 million compared to $367.5 million in 2023. The increase was primarily attributable to amortization of intangible assets recognized for acquisitions completed in the second half of 2023 and in 2024, partially offset by certain intangible assets becoming fully amortized during the period.\nImpairment of Other Intangible Assets\nImpairment of other intangible assets was $13.9 million in 2024 due to the Company’s decision to rationalize a business within the Precision and Science Technologies segment. See Note 9 “Goodwill and Other Intangible Assets” to our audited consolidated financial statements included elsewhere in this Form 10-K for further details.\nOther Operating Expense, Net\nOther operating expense, net was $138.6 million in 2024, an increase of $60.9 million compared to $77.7 million in 2023. The increase was primarily due to the loss on asbestos sale of $58.8 million and higher restructuring charges of $11.3 million, partially offset by lower acquisition and other transaction related expenses of $5.1 million and lower foreign currency transaction losses, net of $1.9 million.\nInterest Expense\nInterest expense was $213.2 million in 2024, an increase of $56.5 million, compared to $156.7 million in 2023. The increase was primarily due to an increase in long term debt, partially offset by the interest rate derivative contracts discussed in Note 20 “\nHedging Activities, Derivative Instruments and Credit Risk\n” to our audited consolidated financial statements included elsewhere in this Form 10-K. The weighted average interest rate, including the impact of the interest rate derivative contracts, was approximately 5.2% in 2024 and 5.3% in 2023.\nLoss on Extinguishment of Debt\nLoss on extinguishment of debt was $3.0 million in 2024, which was related to the payoff of the Dollar Term Loan B and Dollar Term Loan. Loss on extinguishment of debt was $13.5 million in 2023, which was primarily related to the partial payoff of the Dollar Term Loan B. See Note 12 “Debt” to our audited consolidated financial statements included elsewhere in this Form 10-K for further details.\nOther Income, Net\nOther income, net, was $48.9 million in 2024, an increase of $11.9 million compared to $37.0 million in 2023. The increase was primarily due to an increase in interest income from holdings of cash and cash equivalents.\nProvision (Benefit) for Income Taxes\nThe provision for income taxes was $262.5 million resulting in a 23.2% effective tax rate in 2024 compared to a provision for income taxes of $240.0 million resulting in a 23.3% effective tax provision rate in 2023. The increase in the tax provision is primarily due to an increase in pre-tax book income. The effective tax rate in 2024 is consistent with the effective tax rate in 2023.\nNet Income\nNet income was $846.3 million in 2024, an increase of $61.2 million compared to $785.1 million in 2023, primarily due to the changes described above.\nAdjusted EBITDA\nAdjusted EBITDA increased $231.3 million to $2,018.1 million in 2024 compared to $1,786.8 million in 2023. Adjusted EBITDA as a percentage of revenues increased 190 basis points to 27.9% in 2024 from 26.0% in 2023. The increase in Adjusted EBITDA was primarily due to higher pricing of $153.3 million, acquisitions of $105.6 million, favorable cost productivity and \n26\nTable of Contents\nproduct mix of $60.4 million, and lower selling and administrative costs of $22.5 million, partially offset by lower organic sales volume of $104.5 million and the unfavorable impact of foreign currencies of $5.2 million. The increase in Adjusted EBITDA as a percentage of revenues is primarily attributable to higher pricing, input cost productivity improvements, and product mix.\nAdjusted Net Income\nAdjusted Net Income increased $133.5 million to $1,349.3 million in 2024 compared to $1,215.8 million in 2023. The increase was primarily due to increased Adjusted EBITDA, partially offset by higher interest expense and higher income tax provision, as adjusted.\nNon-GAAP Financial Measures\nSet forth below are reconciliations of Net Income to Adjusted EBITDA and Adjusted Net Income and Cash flows from operating activities to Free Cash Flow. For additional information regarding Adjusted EBITDA and Adjusted Net Income, see “How We Assess the Performance of Our Business” above.\nYear Ended December 31,\n2024\n2023\nNet Income\n$\n846.3 \n$\n785.1 \nPlus:\nInterest expense\n213.2 \n156.7 \nProvision for income taxes\n262.5 \n240.0 \nDepreciation expense\n(a)\n105.0 \n87.9 \nAmortization expense\n(b)\n373.0 \n367.5 \nImpairment of other intangible assets\n13.9 \n— \nRestructuring and related business transformation costs\n(c)\n32.3 \n22.9 \nAcquisition and other transaction related expenses and non-cash charges\n(d)\n59.8 \n63.9 \nStock-based compensation\n58.8 \n51.9 \nForeign currency transaction losses, net\n3.2 \n5.1 \nLoss on equity method investments\n24.0 \n6.0 \nLoss on extinguishment of debt\n3.0 \n13.5 \nAdjustments to LIFO inventories\n6.7 \n12.0 \nCybersecurity incident costs\n(e)\n0.5 \n2.3 \nLoss on asbestos sale\n58.8 \n— \nInterest income on cash and cash equivalents\n(43.3)\n(28.8)\nOther adjustments\n(f)\n0.4 \n0.8 \nAdjusted EBITDA\n$\n2,018.1 \n$\n1,786.8 \nMinus:\nInterest expense\n$\n213.2 \n$\n156.7 \nIncome tax provision, as adjusted\n(g)\n385.2 \n345.2 \nDepreciation expense\n105.0 \n87.9 \nAmortization of non-acquisition related intangible assets\n8.7 \n10.0 \nInterest income on cash and cash equivalents\n(43.3)\n(28.8)\nAdjusted Net Income\n$\n1,349.3 \n$\n1,215.8 \nFree Cash Flow from Continuing Operations:\nCash flows from operating activities from continuing operations\n$\n1,396.7 \n$\n1,377.4 \nMinus:\nCapital expenditures\n149.1 \n105.4 \nFree Cash Flow from Continuing Operations\n$\n1,247.6 \n$\n1,272.0 \n(a)\nDepreciation expense excludes $4.0 million and $3.7 million of depreciation of rental equipment for the years ended December 31, 2024 and 2023, respectively.\n27\nTable of Contents\n(b)\nRepresents $364.3 million and $357.5 million of amortization of intangible assets arising from acquisitions (customer relationships, technology, tradenames and backlog) and $8.7 million and $10.0 million of amortization of non-acquisition related intangible assets, in each case for the years ended December 31, 2024 and 2023, respectively.\n(c)\nRestructuring and related business transformation costs consisted of the following.\nYear Ended December 31,\n2024\n2023\nRestructuring charges\n$\n31.2 \n$\n19.9 \nFacility reorganization, relocation and other costs\n1.1 \n3.0 \nTotal restructuring and related business transformation costs\n$\n32.3 \n$\n22.9 \n(d)\nRepresents costs associated with successful and abandoned acquisitions, including third-party expenses, post-closure integration costs and non-cash charges and credits arising from fair value purchase accounting adjustments.\n(e)\nRepresents non-recoverable costs associated with a cybersecurity event.\n(f)\nIncludes (i) effects of the amortization of prior service costs and amortization of losses in pension and other postemployment (“OPEB”) expense and (ii) other miscellaneous adjustments.\n(g)\nRepresents our income tax provision adjusted for the tax effect of pre-tax items excluded from Adjusted Net Income and the removal of applicable discrete tax items. The tax effect of pre-tax items excluded from Adjusted Net Income is computed using the statutory tax rate related to the jurisdiction that was impacted by the adjustment after taking into account the impact of permanent differences and valuation allowances. Discrete tax items include changes in tax laws or rates, changes in uncertain tax positions relating to prior years and changes in valuation allowances.\nThe income tax provision, as adjusted for each of the periods presented below consists of the following.\nYear Ended December 31,\n2024\n2023\nProvision for income taxes\n$\n262.5 \n$\n240.0 \nTax impact of pre-tax income adjustments\n113.6 \n111.1 \nDiscrete tax items\n9.1 \n(5.9)\nIncome tax provision, as adjusted\n$\n385.2 \n$\n345.2 \nSegment Results\nWe report our business into two segments: Industrial Technologies and Services and Precision and Science Technologies. Our Corporate operations (as described below) are not discussed separately as any results that had a significant impact on operating results are included in the consolidated results discussion above.\nWe evaluate the performance of our segments based on Segment Revenues and Segment Adjusted EBITDA. Segment Adjusted EBITDA is indicative of operational performance and ongoing profitability. Our management closely monitors Segment Adjusted EBITDA to evaluate past performance and identify actions required to improve profitability.\nThe segment measurements provided to, and evaluated by, the Chief Operating Decision Maker (“CODM”) are described in Note 24 “Segment Information” to our audited consolidated financial statements included elsewhere in this Form 10-K.\nIncluded in our discussion of our segment results below are changes in Segment Revenues and Segment Adjusted EBITDA on a Constant Currency basis. Constant Currency information compares results between periods as if exchange rates had remained constant period over period. We define Constant Currency as changes in Segment Revenues and Segment Adjusted EBITDA excluding the impact of foreign exchange rate movements. We use these measures to determine the Constant Currency Segment Revenues and Segment Adjusted EBITDA growth on a year-on-year basis. Constant Currency Segment Revenues and Segment Adjusted EBITDA are calculated by translating current period Segment Revenues and Segment Adjusted EBITDA using prior period exchange rates. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP.\nSegment Results for Years Ended December 31, 2024 and 2023\nThe following tables display Segment Orders, Segment Revenues, Segment Adjusted EBITDA and Segment Adjusted EBITDA Margin (Segment Adjusted EBITDA as a percentage of Segment Revenues) for each of our Segments.\n28\nTable of Contents\nIndustrial Technologies and Services Segment Result\ns\nYears Ended December 31,\nPercent Change\n2024\n2023\n2024 vs. 2023\nSegment Orders\n$\n5,706.6 \n$\n5,618.9 \n1.6 \n%\nSegment Revenues\n$\n5,818.1 \n$\n5,632.8 \n3.3 \n%\nSegment Adjusted EBITDA\n$\n1,754.8 \n$\n1,587.3 \n10.6 \n%\nSegment Adjusted EBITDA Margin\n30.2 \n%\n28.2 \n%\n200 bps\n2024 vs. 2023\nSegment Orders for 2024\n \nwere $5,706.6 million, an increase of $87.7 million, or 1.6%, compared to $5,618.9 million in 2023. The increase in Segment Orders was primarily due to acquisitions of $253.7 million or 4.5%, partially offset by organic decline of $141.1 million or 2.5% and the unfavorable impact of foreign currencies of $24.9 million or 0.4%.\nSegment Revenues\n \nfor 2024\n \nwere $5,818.1 million, an increase of $185.3 million, or 3.3%, compared to $5,632.8 million in 2023. The increase in Segment Revenues was primarily due to acquisitions of $253.4 million or 4.5% and higher pricing of $125.3 million or 2.2%, partially offset by lower organic sales volumes of $169.7 million or 3.0% and the unfavorable impact of foreign currencies of $23.7 million or 0.4%. The percentage of Segment Revenues derived from aftermarket parts and service was 39.9% in 2024 compared to 39.2% in 2023.\nSegment Adjusted EBITDA in 2024 was $1,754.8 million, an increase of $167.5 million, or 10.6%, from $1,587.3 million in 2023. Segment Adjusted EBITDA Margin increased 200 bps to 30.2% from 28.2% in 2023. The increase in Segment Adjusted EBITDA was primarily due to higher pricing of $125.3 million or 7.9%, favorable cost productivity and product mix of $72.9 million or 4.6%, and acquisitions of $53.6 million or 3.4%, partially offset by lower organic sales volumes of $71.0 million or 4.5%, higher selling and administrative expenses of $9.2 million or 0.6%, and the unfavorable impact of foreign currencies of $5.6 million or 0.4%.\nPrecision and Science Technologies Segment Results\nYears Ended December 31,\nPercent Change\n2024\n2023\n2024 vs. 2023\nSegment Orders\n$\n1,398.9 \n$\n1,203.5 \n16.2 \n%\nSegment Revenues\n$\n1,416.9 \n$\n1,243.3 \n14.0 \n%\nSegment Adjusted EBITDA\n$\n418.8 \n$\n372.8 \n12.3 \n%\nSegment Adjusted EBITDA Margin\n29.6 \n%\n30.0 \n%\n(40) bps\n2024 vs. 2023\nSegment Orders for 2024\n \nwere $1,398.9 million, an increase of $195.4 million, or 16.2%, compared to $1,203.5 million in 2023. The increase in Segment Orders was primarily due to acquisitions of $190.5 million or 15.8% and higher organic orders of $5.5 million or 0.5%, partially offset by the unfavorable impact of foreign currencies of $0.6 million or 0.0%.\nSegment Revenues\n \nfor 2024\n \nwere $1,416.9 million, an increase of $173.6 million, or 14.0%, compared to $1,243.3 million in 2023. The increase in Segment Revenues was primarily due to acquisitions of $217.8 million or 17.5% and higher pricing of $28.0 million or 2.3%, partially offset by lower organic volumes of $72.2 million or 5.8%. The percentage of Segment Revenues derived from aftermarket parts and service was 21.6% in 2024 compared to 20.3% in 2023.\nSegment Adjusted EBITDA in 2024 was $418.8 million, an increase of $46.0 million, or 12.3%, from $372.8 million in 2023. Segment Adjusted EBITDA Margin decreased 40 bps to 29.6% from 30.0% in 2023. The increase in Segment Adjusted EBITDA was due primarily to acquisitions of $52.0 million or 13.9%, higher pricing of $28.0 million or 7.5%, and favorable cost productivity and product mix of $1.8 million or 0.5%, partially offset by lower organic sales volumes of $33.5 million or 9.0%, and higher selling and administrative expenses of $7.5 million or 2.0%.\nLiquidity and Capital Resources\nOur investment resources include cash on hand, cash generated from operations and borrowings under our New Revolving Credit Facility and Commercial Paper Program. We also have the ability to seek additional borrowings, subject to credit agreement restrictions.\n29\nTable of Contents\nFor a description of our material indebtedness, see Note 12 “Debt” to our audited consolidated financial statements included elsewhere in this Form 10-K.\nAs of December 31, 2024, we had $2,600.0 million of unused availability under both the New Revolving Credit Facility and Commercial Paper Program.\nAs of December 31, 2024, we were in compliance with all of our debt covenants and no event of default had occurred or was ongoing.\nLiquidity\nOur liquidity needs primarily arise from working capital needs for normal operating costs, servicing debt, funding acquisitions and capital expenditures.\nYear Ended December 31,\n2024\n2023\nCash and cash equivalents\n$\n1,541.2 \n$\n1,595.5 \nShort-term borrowings and current maturities of long-term debt\n$\n3.1 \n$\n30.6 \nLong-term debt\n4,754.4 \n2,693.0 \nTotal debt\n$\n4,757.5 \n$\n2,723.6 \nWe can increase the borrowing availability under the New Revolving Credit Facility by up to $1,000.0 million in the form of additional commitments on the terms set forth in the New Revolving Credit Facility. Our liquidity requirements are significant primarily due to debt service requirements. See Note 12 “Debt” to our audited consolidated financial statements included elsewhere in this Form 10-K for further details.\nOur principal sources of liquidity have been existing cash and cash equivalents, cash generated from operations and borrowings under the Senior Notes and former Senior Secured Credit Facilities. Our principal uses of cash will be to provide working capital; finance strategic plans, including possible acquisitions; meet debt service requirements; fund capital expenditures; and return capital to shareholders, through share repurchases and dividend payments. We may also seek to finance capital expenditures under capital leases or other debt arrangements that provide liquidity or favorable borrowing terms. We continue to consider acquisition opportunities, but the size and timing of any future acquisitions and the related potential capital requirements cannot be predicted. In the event that suitable businesses are available for acquisition upon acceptable terms, we may obtain all or a portion of the necessary financing through the incurrence of additional long-term borrowings. As market conditions warrant, we may from time to time, seek to repay loans that we have borrowed, including the borrowings under the Senior Notes. Based on our current level of operations and available cash, we believe our cash flow from operations, together with availability under the New Revolving Credit Facility and Commercial Paper Program, will provide sufficient liquidity to fund our current obligations, projected working capital requirements, debt service requirements and capital spending requirements for the foreseeable future. Our business may not generate sufficient cash flows from operations or future borrowings may not be available to us under our Revolving Credit Facility or Commercial Paper Program in an amount sufficient to enable us to pay our indebtedness, or to fund our other liquidity needs. Our ability to do so depends on, among other factors, prevailing economic conditions, many of which are beyond our control. In addition, upon the occurrence of certain events, such as a change in control, we could be required to repay or refinance our indebtedness. We may not be able to refinance any of our indebtedness, including the Senior Notes, on commercially reasonable terms or at all. Any future acquisitions, joint ventures, or other similar transactions may require additional capital and there can be no assurance that any such capital will be available to us on acceptable terms or at all.\nWe may from time to time repurchase shares of our common stock in the open market at prevailing market prices (including through Rule 10b5-1 plans), in privately negotiated transactions, a combination thereof or through other transactions. The actual timing, number, manner and value of any shares repurchased will depend on several factors, including the market price of our stock, general market and economic conditions, our liquidity requirements, applicable legal requirement and other business considerations.\nA substantial portion of our cash is in jurisdictions outside the United States. We do not assert ASC 740-30 (formerly APB 23) indefinite reinvestment of our historical non-U.S. earnings or future non-U.S. earnings. The Company records a deferred foreign tax liability to cover all estimated withholding, state income tax and foreign income tax associated with repatriating all non-U.S. earnings back to the United States. Our deferred income tax liability as of December 31, 2024 is $41.8 million which consists mainly of withholding taxes.\n30\nTable of Contents\nWorking Capital\n2024\n2023\nNet Working Capital\nCurrent assets\n$\n4,163.5 \n$\n4,050.4 \nLess: Current liabilities\n1,818.9 \n1,827.3 \nNet working capital\n$\n2,344.6 \n$\n2,223.1 \nOperating Working Capital\nAccounts receivable\n$\n1,335.4 \n$\n1,234.2 \nPlus: Inventories (excluding LIFO)\n1,134.2 \n1,073.6 \nPlus: Contract assets\n111.2 \n85.6 \nLess: Accounts payable\n843.6 \n801.2 \nLess: Contract liabilities\n318.6 \n331.2 \nOperating working capital\n$\n1,418.6 \n$\n1,261.0 \nNet working capital increased $121.5 million to $2,344.6 million as of December 31, 2024 from $2,223.1 million as of December 31, 2023. Operating working capital increased $157.6 million to $1,418.6 million as of December 31, 2024 from $1,261.0 million as of December 31, 2023. Operating working capital as of December 31, 2024 was 19.6% of 2024 revenues as compared to 18.3% as of December 31, 2023 as a percentage of 2023 revenues. The increase in operating working capital was primarily due to higher accounts receivable, higher inventories, higher contract assets, and lower contract liabilities, partially offset by higher accounts payable. The increase in accounts receivable was primarily due to the timing of revenues in the quarter and seasonal changes in collection timing and to acquisitions completed in 2024. The increase in contract assets was primarily due to the timing of revenue recognition on percentage of complete jobs in relation to contractual billing milestones and to acquisitions completed in 2024. The increase in inventory was primarily attributable to acquisitions completed in 2024. The increase in accounts payable was primarily due to the timing of vendor cash disbursements and acquisitions completed in 2024. The decrease in contract liabilities was primarily due to the timing of customer milestone payments for in-process engineered to order contracts, partially offset by acquisitions completed in 2024.\nCash Flows\nThe following table reflects the major categories of cash flows for the years ended December 31, 2024 and 2023, respectively.\n2024\n2023\nCash flows provided by (used in) continuing operations:\nCash flows provided by operating activities\n$\n1,396.7 \n$\n1,377.4 \nCash flows used in investing activities\n(3,107.7)\n(1,060.5)\nCash flows provided by (used in) financing activities\n1,707.5 \n(337.5)\nFree cash flow \n(1)\n1,247.6 \n1,272.0 \n(1)\nSee “Non-GAAP Financial Measures” for a reconciliation to the most directly comparable GAAP measure.\nOperating activities\nCash provided by operating activities increased $19.3 million to $1,396.7 million in 2024 from $1,377.4 million in 2023. This increase is primarily attributable to higher net income and a decrease in income tax payments in 2024 compared to 2023, partially offset by an increase in interest payments in 2024 for our Senior Notes, an increase in incentive compensation paid in 2024 and cash used in operating working capital in 2024, compared to cash generated in operating working capital in 2023.\nOperating working capital used cash of $23.5 million in 2024 compared to generating cash of $40.4 million in 2023. Changes in account receivables used cash of $45.1 million in 2024 compared to using cash of $48.6 million in 2023. Changes in contract assets used cash of $4.8 million in 2024 compared to using cash of $7.8 million in 2023. Changes in inventory generated cash of $39.8 million in 2024 compared to generating cash of $117.3 million in 2023. Changes in accounts payable generated cash of $13.3 million in 2024 compared to using cash of $23.9 million in 2023. Changes in contract liabilities used cash of $26.7 million in 2024 compared to generating cash of $3.4 million in 2023.\n31\nTable of Contents\nInvesting activities\nCash flows used in investing activities included capital expenditures of $149.1 million (2.1% of consolidated revenues) and $105.4 million (1.5% of consolidated revenues) in 2024 and 2023, respectively. We expect capital expenditures will be approximately 2% of consolidated revenues in 2025. Net cash paid in acquisitions was $2,958.7 million and $963.0 million in 2024 and 2023, respectively. Net proceeds from the disposal of property, plant and equipment were $6.1 million and $7.6 million in 2024 and 2023, respectively.\nFinancing activities\nCash provided by financing activities of $1,707.5 million in 2024 is primarily due to net borrowings of long-term debt of $2,054.2 million and proceeds from stock option exercises of $32.2 million, partially offset by purchases of treasury stock of $260.7 million, cash dividends on common stock of $32.3 million, payments of debt issuance costs of $32.3 million, and payments of deferred, contingent acquisition consideration of $23.4 million and payments to settle cross-currency swaps of $19.9 million.\nCash used in financing activities of $337.5 million in 2023 is primarily due to purchases of treasury stock of $263.0 million, cash dividends on common stock of $32.4 million, net repayments of long-term debt of $27.6 million, payments of debt issuance costs of $18.5 million, and payments of deferred and contingent acquisition consideration of $17.5 million, partially offset by proceeds from stock option exercises of $30.3 million.\nFree cash flow\nFree cash flow decreased $24.4 million to $1,247.6 million in 2024 from $1,272.0 million in 2023 primarily due to the increase in cash provided by operating activities of $19.3 million discussed above, being more than offset by the increase in capital expenditures of $43.7 million.\nPurchase Obligations\nPurchase obligations consist primarily of agreements to purchase inventory or services made in the normal course of business to meet operational requirements. As of December 31, 2024, the Company had purchase obligations of $802.8 million, with $733.4 million payable in the next 12 months. The purchase obligation amounts do not represent the entire anticipated purchases in the future, but represent only those items for which we are contractually obligated as of December 31, 2024. For this reason, these amounts will not provide a complete and reliable indicator of our expected future cash outflows.\nContingencies\nWe are a party to various legal proceedings, lawsuits and administrative actions, which are of an ordinary or routine nature for a company of our size and in our sector. We believe that such proceedings, lawsuits and administrative actions will not materially adversely affect our operations, financial condition, liquidity or competitive position. Liabilities on our consolidated balance sheet related to legal proceedings, lawsuits and administrative actions are not significant. A more detailed discussion of certain of these proceedings, lawsuits and administrative actions is set forth in “Item 3. Legal Proceedings.”\nCritical Accounting Estimates\nAccounting estimates discussed in this section are those that we consider to be the most critical to an understanding of our audited consolidated financial statements because they involve significant judgments and uncertainties. These estimates reflect our best judgment about current, and for some estimates, future economic and market conditions and their effect based on information available as of the date of these audited consolidated financial statements. If these conditions change from those expected, it is reasonably possible that the judgments and estimates described below could change, which may result in future impairments of goodwill, intangibles and long-lived assets, increases in reserves for contingencies, establishment of valuation allowances on deferred tax assets and increase in tax liabilities, among other effects. Also see Note 1 “Summary of Significant Accounting Policies” to our audited consolidated financial statements included elsewhere in this Form 10-K, which discusses the significant accounting policies that we have selected from acceptable alternatives.\nBusiness Combinations\nWe apply the acquisition method of accounting with respect to the identifiable assets and liabilities of a business combination and record the assets acquired and liabilities assumed at their estimated fair values as of the acquisition date. The excess of the cost of the acquired business and the fair value of the assets acquired and liabilities assumed is recognized as goodwill. Estimates of fair value represent management’s best estimate of assumptions and about future events and uncertainties, including \n32\nTable of Contents\nsignificant judgments related to future cash flows, discount rates, competitive trends, margin and revenue growth assumptions including royalty rates, customer attrition rates and others. Inputs used are generally obtained from historical data supplemented by current and anticipated market conditions and growth rates.\nSignificant judgment is required in estimating the fair value of identifiable intangible assets and in assigning their respective useful lives. The fair value estimates are based on historical information and on future expectations and assumptions deemed reasonable by management, but which are inherently uncertain. See Note 4 “Acquisitions” to our audited consolidated financial statements included elsewhere in this Form 10-K for further information regarding the fair value determination of each of the classes of identifiable intangible assets. Determining the useful life of an intangible asset also requires judgment. Certain intangibles are expected to have indefinite lives while certain other identifiable intangible assets have determinable lives. The useful lives of identifiable intangibles with determinable useful lives are based on a variety of factors, including but not limited to, the competitive environment, product cycles, order life cycles, historical customer attrition rates, market share, operating plans and the macroeconomic environment. The costs of determinable-lived intangible assets are amortized to expense over the estimated useful life.\nImpairment of Goodwill and Other Identified Intangible Assets\nWe test goodwill for impairment annually in the fourth quarter of each year using data as of October 1 of that year and whenever events or changes in circumstances indicate that the carrying value may not be recoverable. The impairment test consists of comparing the fair value of the reporting unit to the carrying value of the reporting unit. An impairment charge is recognized for the amount by which the carrying amount exceeds the reporting unit’s fair value; provided, the loss recognized cannot exceed the total amount of goodwill allocated to the reporting unit. If applicable, we consider income tax effects from any tax deductible goodwill on the carrying amount of the reporting unit when measuring the goodwill impairment loss. We determined fair values for all of the reporting units using a combination of the income and market multiples approaches which are weighted 75% and 25%, respectively.\nUnder the income approach, fair value is determined based on the present value of estimated future cash flows, discounted at an appropriate risk-adjusted rate. We use our internal forecasts to estimate future cash flows and include an estimate of long-term future growth rates based on our most recent views of the long-term outlook for each business. Actual results may differ from those assumed in our forecasts. We derive our discount rates using a capital asset pricing model and analyzing published rates for industries relevant to our reporting units to estimate the cost of equity financing. We use discount rates that are commensurate with the risks and uncertainty inherent in the respective businesses and in our internally developed forecasts. Discount rates used in our 2024 reporting unit valuations ranged from 7.5% to 14.5% and terminal growth rates ranged from 2.5% to 3.5%.\nUnder the market multiples approach, fair value is determined based on multiples derived from the stock prices of publicly traded guideline companies to develop a business enterprise value (“BEV”) for our reporting units. The application of the market multiples method entails the development of book value multiples based on the market value of the guideline companies. The multiples are developed by first calculating the market value of equity of the guideline companies and then adjusting these multiples for cash and debt to arrive at a BEV multiple. Identifying appropriate guideline companies and computing appropriate market multiples is subjective. We considered various public companies that had reasonably similar qualitative factors as our reporting units while also considering quantitative factors such as revenue growth, profitability and total assets.\nNo goodwill impairments were recorded in 2024 and the cushion of all reporting units was at least 60%, with the exception of two reporting units in our Precision and Science Technologies segment. These two reporting units have goodwill totaling approximately $1.1 billion and limited cushions ranging from 5% to 16%. The limited cushions are due to the fair values assigned from the recent ILC Dover acquisition. Changes in forecast estimates or the application of alternative assumptions could produce significantly different results. The discount rates (9.0% to 14.5%), terminal growth rates (2.5% to 3.0%), and EBITDA multiples are the most sensitive assumptions. A material non-cash impairment of goodwill could result from a number of circumstances, including different assumptions used in determining the fair value of these reporting units or changes to customer spending priorities. \nWe test intangible assets with indefinite lives for impairment annually utilizing a discounted cash flow valuation referred to as the relief from royalty method. We estimated forecasted revenues for a period of five years with discount rates ranging from 8.0% to 10.5%, terminal growth rates of 2.5% to 3.5%, and royalty rates ranging from 0.5% to 4.0%. There were no impairments identified or recognized during the year ended December 31, 2024. An indefinite lived intangible held in the Precision and Science Technologies segment and recently acquired in the ILC Dover acquisition, with a carrying value of approximately $208 million had a cushion of approximately 6%. Changes in forecasted revenues or any of the other assumptions mentioned above could result in a material non-cash impairment charge in a future period.\n33\nTable of Contents\nWe review identified intangible assets with defined useful lives and subject to amortization for impairment whenever events or changes in circumstances indicate that the related carrying amounts may not be recoverable. Determining whether an impairment loss occurred requires comparing the carrying amount to the sum of undiscounted cash flows expected to be generated by the asset.\nAlso see Note 9 “Goodwill and Other Intangible Assets” to our audited consolidated financial statements included elsewhere in this Form 10-K.\nIncome Taxes\nOur annual tax rate is based on our income, statutory tax rates and tax planning opportunities available to us in the various jurisdictions in which we operate. Tax laws are complex and subject to different interpretations by the taxpayer and respective governmental taxing authorities. Significant judgment is required in determining our tax expense and in evaluating our tax positions, including evaluating uncertainties. We review our tax positions quarterly and adjust the balances as new information becomes available.\nThe Tax Cuts and Jobs Act (“Tax Act”), enacted on December 22, 2017, created a new requirement that certain income (i.e., Global intangible low taxed income (“GILTI”)) earned by controlled foreign corporations (“CFC”) must be included currently in the gross income of the CFCs’ U.S. shareholder. GILTI is the excess of the shareholder’s “net CFC tested income” over the net deemed tangible income return, which is currently defined as the excess of (1) 10% of the aggregate of the U.S. shareholder’s pro rata share of the qualified business asset investment of each CFC with respect to which it is a U.S. shareholder over (2) the amount of certain interest expense taken into account in the determination of net CFC-tested income.\nUnder U.S. GAAP, the Company is allowed to make an accounting policy choice of either (1) treating taxes due on future U.S. inclusions in taxable income related to GILTI as a current-period expense when incurred (the “period cost method”) or (2) factoring such amounts into a company’s measurement of its deferred taxes (the “deferred method”). The Company has determined that it will follow the period cost method (option 1 above). The Company recorded a tax expense of $4.6 million in 2024 for the GILTI provisions of the Tax Act.\nDeferred income tax assets represent amounts available to reduce income taxes payable on taxable income in future years. Such assets arise because of temporary differences between the financial reporting and tax bases of assets and liabilities, as well as from net operating loss and tax credit carryforwards. We evaluate the recoverability of these future tax deductions and credits by assessing the adequacy of future expected taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings and available tax planning strategies. These sources of income rely heavily on estimates. To the extent we do not consider it more likely than not that a deferred tax asset will be recovered, a valuation allowance is established. Amounts recorded for deferred tax assets related to tax attribute carryforwards, net of valuation allowances, were $43.0 million and $27.8 million as of December 31, 2024 and 2023, respectively, with the increase due to the utilization of attributes in the current year.\nLoss Contingencies\nLoss contingencies are uncertain and unresolved matters that arise in the ordinary course of business and result from events or actions by others that have the potential to result in a future loss. Such contingencies include, but are not limited to environmental obligations and losses resulting from other events and developments.\nWhen a loss is considered probable and reasonably estimable, we record a liability in the amount of our best estimate for the ultimate loss. When there appears to be a range of possible costs with equal likelihood, liabilities are based on the low-end of such range. However, the likelihood of a loss with respect to a particular contingency is often difficult to predict and determining a meaningful estimate of the loss or a range of loss may not be practicable based on the information available and the potential effect of future events and decisions by third parties that will determine the ultimate resolution of the contingency. Moreover, it is not uncommon for such matters to be resolved over many years, during which time relevant developments and new information must be continuously evaluated to determine both the likelihood of potential loss and whether it is possible to reasonably estimate a range of possible loss. When a loss is probable but a reasonable estimate cannot be made, disclosure is provided.\nDisclosure also is provided when it is reasonably possible that a loss will be incurred or when it is reasonably possible that the amount of a loss will exceed the recorded provision. We regularly review all contingencies to determine whether the likelihood of loss has changed and to assess whether a reasonable estimate of the loss or range of loss can be made. As discussed above, development of a meaningful estimate of loss or a range of potential loss is complex when the outcome is directly dependent on negotiations with or decisions by third parties, such as regulatory agencies, the court system and other interested parties. Such factors bear directly on whether it is possible to reasonably estimate a range of potential loss and boundaries of high and low.\n34\nTable of Contents\nRecent Accounting Pronouncements\nSee Note 2 “New Accounting Standards” to our audited consolidated financial statements included elsewhere in this Form 10-K for a discussion of recent accounting standards.",
  "item2": null
}