{
  "item1": "ITEM 1. BUSINESS. BUSINESS OVERVIEW Iron Mountain Incorporated, Delaware corporation (\"IMI\"), founded underground facility near Hudson, New York 1951 where stored business records. Today, global leader information management services, trusted more than 240,000 customers 61 countries, including approximately 95% Fortune 1000, help unlock value intelligence assets through services transcend physical digital worlds.",
  "item7": "Other expense (income), net, excluding share losses (gains) unconsolidated joint ventures Stock-based compensation expense Non-cash amortization related derivative instruments Tax impact reconciling items discrete tax items Income (Loss) Attributable Noncontrolling Interests Adjusted EPS—Fully Diluted Net Income (Loss) Attributable Iron Mountain Incorporated Relates amortization excluded component cross-currency swap agreements, which recognized straight-line basis component Interest expense, net Consolidated Statements Operations. differences between effective tax rates structural tax rate (or adjusted effective tax rates) years ended December 31, 2024 2023 primarily due (i) reconciling items above, which impact reported net income (loss) before provision (benefit) income taxes but insignificant impact reported provision (benefit) income taxes (ii) other discrete tax items. structural tax rate purposes calculation Adjusted EPS years ended December 31, 2024 2023 15.6% 12.3%, respectively. Columns may not foot due rounding.",
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS FORWARD-LOOKING STATEMENTS made statements Quarterly Report constitute \"forward-looking statements\" term defined Private Securities Litigation Reform Act 1995 other securities laws. These forward-looking statements concern current expectations regarding future results operations, economic performance, financial condition, goals, strategies, investment objectives, plans achievements. These forward-looking statements subject various known unknown risks, uncertainties other factors, should not rely upon them except statements present intentions present expectations, which may may not occur."
}