{
  "source_file": "irm-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations for the three and nine months ended September 30, 2025 should be read in conjunction with our Condensed Consolidated Financial Statements and Notes thereto for the three and nine months ended September 30, 2025, included herein, and our Consolidated Financial Statements and Notes thereto for the year ended December 31, 2024, included in our Annual Report on Form 10-K filed with the United States Securities and Exchange Commission (\"SEC\") on February 14, 2025 (our \"Annual Report\").\nFORWARD-LOOKING STATEMENTS\nWe have made statements in this Quarterly Report that constitute \"forward-looking statements\" as that term is defined in the Private Securities Litigation Reform Act of 1995 and other securities laws. These forward-looking statements concern our current expectations regarding our future results from operations, economic performance, financial condition, goals, strategies, investment objectives, plans and achievements. These forward-looking statements are subject to various known and unknown risks, uncertainties and other factors, and you should not rely upon them except as statements of our present intentions and of our present expectations, which may or may not occur. When we use words such as \"believes\", \"expects\", \"anticipates\", \"estimates\", \"plans\", \"intends\", \"pursue\", \"commits\", \"will\" or similar expressions, we are making forward-looking statements. Although we believe that our forward-looking statements are based on reasonable assumptions, our expected results may not be achieved, and actual results may differ materially from our expectations. In addition, important factors that could cause actual results to differ from expectations include, among others:\n•\nour ability or inability to execute our strategic growth plan, including our ability to invest according to plan, grow our businesses (including through joint ventures or other co-investment vehicles), incorporate alternative technologies (including artificial intelligence) into our offerings, achieve satisfactory returns on new product offerings, continue our revenue management, expand and manage our global operations, complete acquisitions on satisfactory terms, integrate acquired companies efficiently and transition to more sustainable sources of energy;\n•\nchanges in customer preferences and demand for our storage and information management services, including as a result of the shift from paper and tape storage to alternative technologies that require less physical space or services activity;\n•\nthe costs of complying with and our ability to comply with laws, regulations and customer requirements, including those relating to data privacy and cybersecurity issues, as well as fire and safety and environmental standards;\n•\nthe impact of attacks on our internal information technology (\"IT\") systems, including the impact of such incidents on our reputation and ability to compete and any litigation or disputes that may arise in connection with such incidents;\n•\nour ability to fund capital expenditures;\n•\nthe impact of our distribution requirements on our ability to execute our business plan;\n•\nour ability to remain qualified for taxation as a real estate investment trust for United States federal income tax purposes (\"REIT\");\n•\nchanges in the political and economic environments in the countries in which we operate and changes in the global political climate;\n•\nour ability to raise debt or equity capital and changes in the cost of our debt;\n•\nour ability to comply with our existing debt obligations and restrictions in our debt instruments;\n•\nthe impact of service interruptions or equipment damage and the cost of power on our data center operations;\n•\nthe cost or potential liabilities associated with real estate necessary for our business;\n•\nunexpected events, including those resulting from climate change or geopolitical events, could disrupt our operations and adversely affect our reputation and results of operations;\n•\nfailures to implement and manage new IT systems;\n•\nother trends in competitive or economic conditions affecting our financial condition or results of operations not presently contemplated; and\n•\nthe other risks described in our periodic reports filed with the SEC, including under the caption \"Risk Factors\" in Part I, Item 1A of our Annual Report.\nExcept as required by law, we undertake no obligation to update any forward-looking statements appearing in this report. \nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n29\nTable of Contents\nPart I. Financial Information\nOVERVIEW\nThe following discussions set forth, for the periods indicated, management's discussion and analysis of financial condition and results of operations. Significant trends and changes are discussed for the three and nine months ended September 30, 2025 within each section. Trends and changes that are consistent for both the three and nine month periods are not repeated and are discussed on a year to date basis only. \nPROJECT MATTERHORN\nIn September 2022, we announced a global program designed to accelerate the growth of our business (\"Project Matterhorn\"). Project Matterhorn investments focus on transforming our operating model to a global operating model. Project Matterhorn focuses on the formation of a solution-based sales approach that is designed to allow us to optimize our shared services and best practices to better serve our customers' needs. We are investing to accelerate growth and to capture a greater share of the large, global addressable markets in which we operate. We expect Project Matterhorn to be completed by December 31, 2025. We have incurred approximately $530.9 million in Restructuring and other transformation costs from the inception of Project Matterhorn through September 30, 2025. Costs are comprised of (1) restructuring costs, which include (i) site consolidation and other related exit costs, (ii) employee severance costs and (iii) certain professional fees associated with these activities, and (2) other transformation costs, which include professional fees such as project management costs and costs for third party consultants who are assisting in the enablement of our growth initiatives. \nSee Note 10 to Notes to Condensed Consolidated Financial Statements included in this Quarterly Report for more information on Restructuring and other transformation costs.\nGENERAL\nRESULTS OF OPERATIONS—KEY TRENDS\n•\nOur organic storage rental revenue growth is primarily driven by revenue management in our Global RIM Business segment, where we expect volume to be relatively stable in the near term, as well as by growth in our Global Data Center Business segment, primarily driven by lease commencements.\n•\nOur organic service revenue growth is primarily due to increases in our service activity. We expect organic service revenue growth for the remainder of 2025 and into 2026 to benefit from our new and existing digital offerings and asset lifecycle management (\"ALM\") business, as well as our traditional services\n.\n•\nWe expect continued total revenue and Adjusted EBITDA (as defined below) growth for the remainder of 2025 and into 2026 as a result of our focus on new product and service offerings, innovation, customer solutions and market expansion in line with our Project Matterhorn objectives and growth strategies.\nCost of sales (excluding depreciation and amortization) and Selling, general and administrative expenses for the nine months ended September 30, 2025 consists of the following:\nCOST OF SALES\nSELLING, GENERAL AND ADMINISTRATIVE EXPENSES\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n30\nTable of Contents\nPart I. Financial Information\nNON-GAAP MEASURES\nADJUSTED EBITDA\nWe define Adjusted EBITDA as net income (loss) before interest expense, net, provision (benefit) for income taxes, depreciation and amortization (inclusive of our share of Adjusted EBITDA from our unconsolidated joint ventures), and excluding certain items we do not believe to be indicative of our core operating results, specifically: \nEXCLUDED\n•\nAcquisition and Integration Costs (as defined below)\n•\nRestructuring and other transformation\n•\nLoss (gain) on disposal/write-down of property, plant and equipment, net (including real estate)\n•\nOther (income) expense, net\n•\nStock-based compensation expense\n•\nIntangible impairments\nAdjusted EBITDA Margin is calculated by dividing Adjusted EBITDA by total revenues. We also show Adjusted EBITDA and Adjusted EBITDA Margin for each of our reportable segments under \"Results of Operations—Segment Analysis\" below. \nAdjusted EBITDA excludes both interest expense, net and the provision (benefit) for income taxes. These expenses are associated with our capitalization and tax structures, which we do not consider when evaluating the operating profitability of our core operations. Adjusted EBITDA does not include depreciation and amortization expenses, in order to eliminate the impact of capital investments, which we evaluate by comparing capital expenditures to incremental revenue generated and as a percentage of total revenues. Adjusted EBITDA and Adjusted EBITDA Margin should be considered in addition to, but not as a substitute for, other measures of financial performance reported in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"), such as operating income (loss), net income (loss) or cash flows from operating activities.\nRECONCILIATION OF NET INCOME (LOSS) TO ADJUSTED EBITDA (IN THOUSANDS):\nTHREE MONTHS ENDED SEPTEMBER 30,\nNINE MONTHS ENDED SEPTEMBER 30,\n2025\n2024\n2025\n2024\nNet Income (Loss)\n$\n86,241 \n$\n(33,665)\n$\n59,134 \n$\n77,981 \nAdd/(Deduct):\nInterest expense, net\n209,740 \n186,067 \n609,541 \n527,107 \nProvision (benefit) for income taxes\n16,594 \n12,400 \n47,725 \n42,328 \nDepreciation and amortization\n262,203 \n232,240 \n746,923 \n666,296 \nAcquisition and Integration Costs\n(1)\n5,402 \n11,262 \n16,040 \n28,573 \nRestructuring and other transformation\n47,346 \n37,282 \n152,432 \n124,562 \nLoss (gain) on disposal/write-down of property, plant and equipment, net (including real estate)\n3,366 \n5,091 \n7,975 \n8,270 \nOther (income) expense, net, excluding our share of losses (gains) from our unconsolidated joint ventures\n(5,329)\n85,532 \n102,751 \n76,954 \nStock-based compensation expense\n32,147 \n29,563 \n118,595 \n73,491 \nOur share of Adjusted EBITDA reconciling items from our unconsolidated joint ventures\n2,669 \n2,341 \n7,557 \n5,767 \nAdjusted EBITDA\n$\n660,379 \n$\n568,113 \n$\n1,868,673 \n$\n1,631,329 \n(1)\nRepresents operating expenditures directly associated with the closing and integration activities of our business acquisitions that have closed, or are highly probable of closing, and include (i) advisory, legal and professional fees to complete business acquisitions and (ii) costs to integrate acquired businesses into our existing operations, including move, severance and system integration costs (collectively, \"Acquisition and Integration Costs\").\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n31\nTable of Contents\nPart I. Financial Information\nADJUSTED EPS\nWe define Adjusted EPS as reported earnings per share fully diluted from net income (loss) attributable to Iron Mountain Incorporated (inclusive of our share of adjusted losses (gains) from our unconsolidated joint ventures) and excluding certain items, specifically: \nEXCLUDED\n•\nAcquisition and Integration Costs\n•\nRestructuring and other transformation\n•\nLoss (gain) on disposal/write-down of property, plant and equipment, net (including real estate)\n•\nOther (income) expense, net\n•\nStock-based compensation expense\n•\nNon-cash amortization related to derivative instruments\n•\nTax impact of reconciling items and discrete tax items\n•\nAmortization related to the write-off of certain customer relationship intangible assets\nWe do not believe these excluded items to be indicative of our ongoing operating results, and they are not considered when we are forecasting our future results. We believe Adjusted EPS is of value to our current and potential investors when comparing our results from past, present and future periods.\nRECONCILIATION OF REPORTED EPS—FULLY DILUTED FROM NET INCOME (LOSS) ATTRIBUTABLE TO IRON MOUNTAIN INCORPORATED TO ADJUSTED EPS—FULLY DILUTED FROM NET INCOME (LOSS) ATTRIBUTABLE TO IRON MOUNTAIN INCORPORATED:\nTHREE MONTHS ENDED SEPTEMBER 30,\nNINE MONTHS ENDED SEPTEMBER 30,\n2025\n2024\n2025\n2024\nReported EPS—Fully Diluted from Net Income (Loss) Attributable to Iron Mountain Incorporated\n$\n0.28 \n$\n(0.11)\n$\n0.19 \n$\n0.26 \nAdd/(Deduct):\nAcquisition and Integration Costs\n0.02 \n0.04 \n0.05 \n0.10 \nRestructuring and other transformation\n0.16 \n0.13 \n0.51 \n0.42 \nLoss (gain) on disposal/write-down of property, plant and equipment, net (including real estate)\n0.01 \n0.02 \n0.03 \n0.03 \nOther (income) expense, net, excluding our share of losses (gains) from our unconsolidated joint ventures\n(0.02)\n0.29 \n0.35 \n0.26 \nStock-based compensation expense\n0.11 \n0.10 \n0.40 \n0.25 \nNon-cash amortization related to derivative instruments\n0.01 \n0.01 \n0.04 \n0.04 \nTax impact of reconciling items and discrete tax items\n(1)\n(0.04)\n(0.04)\n(0.10)\n(0.08)\nIncome (Loss) Attributable to Noncontrolling Interests\n0.01 \n— \n0.01 \n0.01 \nAdjusted EPS—Fully Diluted from Net Income (Loss) Attributable to Iron Mountain Incorporated\n(2)\n$\n0.54 \n$\n0.44 \n$\n1.48 \n$\n1.28 \n(1)\nThe differences between our effective tax rates and our structural tax rate (or adjusted effective tax rates) for the three and nine months ended September 30, 2025 and 2024 are primarily due to (i) the reconciling items above, which impact our reported net income (loss) before provision (benefit) for income taxes but have an insignificant impact on our reported provision (benefit) for income taxes and (ii) other discrete tax items. Our structural tax rate for purposes of the calculation of Adjusted EPS for the three and nine months ended September 30, 2025 and 2024 was 14.8% and 15.1%, respectively. The tax impact of reconciling items and discrete tax items is calculated using the current quarter's estimate of the annual structural tax rate. This may result in the current period adjustment plus prior period reported quarterly adjustments not summing to the full year adjustment.\n(2)\nColumns may not foot due to rounding.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n32\nTable of Contents\nPart I. Financial Information\nFFO (NAREIT) AND FFO (NORMALIZED)\nFunds from operations (\"FFO\") is defined by the National Association of Real Estate Investment Trusts as net income (loss) excluding depreciation on real estate assets, losses and gains on sale of real estate, net of tax, and amortization of data center leased-based intangibles (\"FFO (Nareit)\"). We calculate our FFO measures, including FFO (Nareit), adjusting for our share of reconciling items from our unconsolidated joint ventures. FFO (Nareit) does not give effect to real estate depreciation because these amounts are computed, under GAAP, to allocate the cost of a property over its useful life. Because values for well-maintained real estate assets have historically increased or decreased based upon prevailing market conditions, we believe that FFO (Nareit) provides investors with a clearer view of our operating performance. Our most directly comparable GAAP measure to FFO (Nareit) is net income (loss).\nWe modify FFO (Nareit), as is common among REITs seeking to provide financial measures that most meaningfully reflect their particular business (\"FFO (Normalized)\"). Our definition of FFO (Normalized) excludes certain items included in FFO (Nareit) that we believe are not indicative of our core operating results, specifically:\nEXCLUDED\n•\nAcquisition and Integration Costs\n•\nRestructuring and other transformation\n•\nLoss (gain) on disposal/write-down of property, plant and equipment, net (excluding real estate)\n•\nOther (income) expense, net\n•\nStock-based compensation expense\n•\nNon-cash amortization related to derivative instruments\n•\nReal estate financing lease depreciation\n•\nTax impact of reconciling items and discrete tax items\n•\nIntangible impairments\n•\n(Income) loss from discontinued operations, net of tax\nRECONCILIATION OF NET INCOME (LOSS) TO FFO (NAREIT) AND FFO (NORMALIZED) (IN THOUSANDS):\nTHREE MONTHS ENDED SEPTEMBER 30,\nNINE MONTHS ENDED SEPTEMBER 30,\n2025\n2024\n2025\n2024\nNet Income (Loss)\n$\n86,241 \n$\n(33,665)\n$\n59,134 \n$\n77,981 \nAdd/(Deduct):\nReal estate depreciation\n108,405 \n93,864 \n309,738 \n275,208 \nLoss (gain) on sale of real estate, net of tax\n194 \n531 \n(4,475)\n(84)\nData center lease-based intangible assets amortization\n1,858 \n5,604 \n5,560 \n16,751 \nOur share of FFO (Nareit) reconciling items from our unconsolidated joint ventures\n1,612 \n1,422 \n4,675 \n2,975 \nFFO (Nareit)\n198,310 \n67,756 \n374,632 \n372,831 \nAdd/(Deduct):\nAcquisition and Integration Costs\n5,402 \n11,262 \n16,040 \n28,573 \nRestructuring and other transformation\n47,346 \n37,282 \n152,432 \n124,562 \nLoss (gain) on disposal/write-down of property, plant and equipment, net (excluding real estate)\n3,168 \n4,554 \n12,269 \n8,583 \nOther (income) expense, net, excluding our share of losses (gains) from our unconsolidated joint ventures\n(1)\n(5,329)\n85,532 \n102,751 \n76,954 \nStock-based compensation expense\n32,147 \n29,563 \n118,595 \n73,491 \nNon-cash amortization related to derivative instruments\n4,176 \n4,176 \n12,529 \n12,529 \nReal estate financing lease depreciation\n3,276 \n3,692 \n9,850 \n9,914 \nTax impact of reconciling items and discrete tax items\n(2)\n(11,547)\n(10,465)\n(28,719)\n(24,992)\nOur share of FFO (Normalized) reconciling items from our unconsolidated joint ventures\n(58)\n(83)\n(241)\n(92)\nFFO (Normalized)\n$\n276,891 \n$\n233,269 \n$\n770,138 \n$\n682,353 \n(1)\nIncludes foreign currency transaction losses (gains), net and other, net. See Note 2.k. to Notes to Condensed Consolidated Financial Statements included in this Quarterly Report for additional information regarding the components of Other (income) expense, net.\n(2)\nRepresents the tax impact of (i) the reconciling items above, which impact our reported net income (loss) before provision (benefit) for income taxes but have an insignificant impact on our reported provision (benefit) for income taxes and (ii) other discrete tax items. Discrete tax items resulted in a provision (benefit) for income taxes of ($1.6 million) and $1.0 million for the three and nine months ended September 30, 2025, respectively, and $0.4 million and ($0.1 million) for the three and nine months ended September 30, 2024, respectively.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n33\nTable of Contents\nPart I. Financial Information\nCRITICAL ACCOUNTING ESTIMATES\nOur discussion and analysis of our financial condition and results of operations are based upon our Condensed Consolidated Financial Statements, which have been prepared in accordance with GAAP. The preparation of these financial statements requires us to make estimates, judgments and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities at the date of the financial statements and for the period then ended. On an ongoing basis, we evaluate the estimates used. We base our estimates on historical experience, actuarial estimates, current conditions and various other assumptions that we believe to be reasonable under the circumstances. These estimates form the basis for making judgments about the carrying values of assets and liabilities and are not readily apparent from other sources. Actual results may differ from these estimates. Our critical accounting estimates include the following, which are listed in no particular order:\n•\nRevenue Recognition\n•\nAccounting for Acquisitions\n•\nImpairment of Tangible and Intangible Assets\n•\nIncome Taxes\nFurther detail regarding our critical accounting estimates can be found in \"Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report, and the Consolidated Financial Statements and the Notes included therein. We have determined that no material changes concerning our critical accounting estimates have occurred since December 31, 2024. \nRESULTS OF OPERATIONS\nCOMPARISON OF THE THREE AND NINE MONTHS ENDED SEPTEMBER 30, 2025 TO THE THREE AND NINE MONTHS ENDED SEPTEMBER 30, 2024 (IN THOUSANDS):\nTHREE MONTHS ENDED SEPTEMBER 30,\nDOLLAR\nCHANGE\nPERCENTAGE\nCHANGE\n2025\n2024\nRevenues\n$\n1,754,093\n$\n1,557,358\n$\n196,735 \n12.6 \n%\nOperating Expenses\n1,445,504\n1,306,194\n139,310 \n10.7 \n%\nOperating Income\n308,589\n251,164\n57,425 \n22.9 \n%\nOther Expenses, Net\n222,348\n284,829\n(62,481)\n(21.9)\n%\nNet Income (Loss)\n86,241\n(33,665)\n119,906 \n356.2 \n%\nNet Income (Loss) Attributable to Noncontrolling Interests\n1,951\n(45)\n1,996 \n4,435.6 \n%\nNet Income (Loss) Attributable to Iron Mountain Incorporated\n$\n84,290\n$\n(33,620)\n$\n117,910 \n350.7 \n%\nAdjusted EBITDA\n(1)\n$\n660,379\n$\n568,113\n$\n92,266 \n16.2 \n%\nAdjusted EBITDA Margin\n(1)\n37.6 \n%\n36.5 \n%\nNINE MONTHS ENDED SEPTEMBER 30,\nDOLLAR\nCHANGE\nPERCENTAGE\nCHANGE\n2025\n2024\nRevenues\n$\n5,058,570\n$\n4,568,630\n$\n489,940 \n10.7 \n%\nOperating Expenses\n4,235,791\n3,841,549\n394,242 \n10.3 \n%\nOperating Income\n822,779\n727,081\n95,698 \n13.2 \n%\nOther Expenses, Net\n763,645\n649,100\n114,545 \n17.6 \n%\nNet Income (Loss)\n59,134\n77,981\n(18,847)\n(24.2)\n%\nNet Income (Loss) Attributable to Noncontrolling Interests\n3,813\n1,757\n2,056 \n117.0 \n%\nNet Income (Loss) Attributable to Iron Mountain Incorporated\n$\n55,321\n$\n76,224\n$\n(20,903)\n(27.4)\n%\nAdjusted EBITDA\n(1)\n$\n1,868,673\n$\n1,631,329\n$\n237,344 \n14.5 \n%\nAdjusted EBITDA Margin\n(1)\n36.9 \n%\n35.7 \n%\n(1)\nSee \"Non-GAAP Measures—Adjusted EBITDA\" in this Quarterly Report for the definitions of Adjusted EBITDA and Adjusted EBITDA Margin, reconciliation of Net Income (Loss) to Adjusted EBITDA and a discussion of why we believe these non-GAAP measures provide relevant and useful information to our current and potential investors.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n34\nTable of Contents\nPart I. Financial Information\nREVENUES\nTotal revenues consist of the following (in thousands):\nTHREE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\n2025\n2024\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\n(1)\nORGANIC\nGROWTH\n(2)\nIMPACT OF\nACQUISITIONS\nStorage Rental\n$\n1,032,897 \n$\n935,701 \n$\n97,196 \n10.4 \n%\n9.5 \n%\n9.4 \n%\n0.1 \n%\nService \n721,196 \n621,657 \n99,539 \n16.0 \n%\n15.3 \n%\n9.8 \n%\n5.5 \n%\nTotal Revenues\n$\n1,754,093 \n$\n1,557,358 \n$\n196,735 \n12.6 \n%\n11.8 \n%\n9.6 \n%\n2.2 \n%\nNINE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\n2025\n2024\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\n(1)\nORGANIC\nGROWTH\n(2)\nIMPACT OF\nACQUISITIONS\nStorage Rental\n$\n2,991,262 \n$\n2,740,289 \n$\n250,973 \n9.2 \n%\n9.2 \n%\n9.1 \n%\n0.1 \n%\nService\n2,067,308 \n1,828,341 \n238,967 \n13.1 \n%\n13.2 \n%\n8.9 \n%\n4.3 \n%\nTotal Revenues\n$\n5,058,570 \n$\n4,568,630 \n$\n489,940 \n10.7 \n%\n10.8 \n%\n9.0 \n%\n1.8 \n%\n(1)\nConstant currency growth rate, which is a non-GAAP measure, is calculated by translating the 2024 results at the 2025 average exchange rates.\n(2)\nOur organic revenue growth rate, which is a non-GAAP measure, represents the year-over-year growth rate of our revenues excluding the impact of business acquisitions, divestitures and foreign currency exchange rate fluctuations. Our organic revenue growth rate includes the impact of acquisitions of customer relationships.\nTOTAL REVENUES\nPrimary factors influencing the change in reported storage rental revenue and reported service revenue for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 include the following:\nSTORAGE RENTAL REVENUE\n•\norganic storage rental revenue growth driven by revenue management in our Global RIM Business segment and lease commencements and improved pricing in our Global Data Center Business segment.\nSERVICE REVENUE\n•\norganic service revenue growth driven by increases in Global Digital Solutions and traditional service activity levels in our Global RIM Business segment and increased volume in our ALM business; and\n•\nan increase of $73.0 million due to recent acquisitions in our ALM business.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n35\nTable of Contents\nPart I. Financial Information\nOPERATING EXPENSES \nCOST OF SALES\nCost of sales (excluding depreciation and amortization) consists of the following expenses (in thousands):\nTHREE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\n% OF TOTAL REVENUES\nPERCENTAGE\nCHANGE\n(FAVORABLE)/\nUNFAVORABLE\n2025\n2024\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\n2025\n2024\nLabor\n$\n302,986 \n$\n264,499 \n$\n38,487 \n14.6 \n%\n13.4 \n%\n17.3 \n%\n17.0 \n%\n0.3 \n%\nFacilities\n298,811 \n279,043 \n19,768 \n7.1 \n%\n6.0 \n%\n17.0 \n%\n17.9 \n%\n(0.9)\n%\nTransportation\n41,473 \n44,236 \n(2,763)\n(6.2)\n%\n(7.1)\n%\n2.4 \n%\n2.8 \n%\n(0.4)\n%\nProduct Cost of Sales and Other\n148,669 \n90,612 \n58,057 \n64.1 \n%\n63.6 \n%\n8.5 \n%\n5.8 \n%\n2.7 \n%\nTotal Cost of sales\n$\n791,939 \n$\n678,390 \n$\n113,549 \n16.7 \n%\n15.7 \n%\n45.1 \n%\n43.6 \n%\n1.5 \n%\nNINE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\n% OF TOTAL REVENUES\nPERCENTAGE\nCHANGE\n(FAVORABLE)/\nUNFAVORABLE\n2025\n2024\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\n2025\n2024\nLabor\n$\n869,311 \n$\n779,998 \n$\n89,313 \n11.5 \n%\n11.4 \n%\n17.2 \n%\n17.1 \n%\n0.1 \n%\nFacilities\n879,751 \n832,187 \n47,564 \n5.7 \n%\n5.5 \n%\n17.4 \n%\n18.2 \n%\n(0.8)\n%\nTransportation\n130,548 \n134,539 \n(3,991)\n(3.0)\n%\n(3.1)\n%\n2.6 \n%\n2.9 \n%\n(0.3)\n%\nProduct Cost of Sales and Other\n377,370 \n260,892 \n116,478 \n44.6 \n%\n44.7 \n%\n7.5 \n%\n5.7 \n%\n1.8 \n%\nTotal Cost of sales\n$\n2,256,980 \n$\n2,007,616 \n$\n249,364 \n12.4 \n%\n12.3 \n%\n44.6 \n%\n43.9 \n%\n0.7 \n%\nPrimary factors influencing the change in reported Cost of sales for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 include the following:\n•\nan increase in labor costs driven by an increase in service activity, primarily within our Global RIM Business segment and ALM business, including the impact of recent acquisitions;\n•\nan increase in facilities expenses, primarily driven by higher real estate taxes in our Global Data Center Business segment, and increases in utilities and rent expense; and \n•\nan increase in product cost of sales and other in our ALM business as a result of higher product volumes.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n36\nTable of Contents\nPart I. Financial Information\nSELLING, GENERAL AND ADMINISTRATIVE EXPENSES\nSelling, general and administrative expenses consists of the following expenses (in thousands):\nTHREE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\n% OF TOTAL REVENUES\nPERCENTAGE\nCHANGE\n(FAVORABLE)/\nUNFAVORABLE\n2025\n2024\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\n2025\n2024\nGeneral, Administrative and Other\n$\n237,505 \n$\n252,463 \n$\n(14,958)\n(5.9)\n%\n(6.2)\n%\n13.5 \n%\n16.2 \n%\n(2.7)\n%\nSales, Marketing and Account Management\n97,743 \n89,466 \n8,277 \n9.3 \n%\n8.2 \n%\n5.6 \n%\n5.7 \n%\n(0.1)\n%\nTotal Selling, general and administrative expenses\n$\n335,248 \n$\n341,929 \n$\n(6,681)\n(2.0)\n%\n(2.4)\n%\n19.1 \n%\n22.0 \n%\n(2.9)\n%\nNINE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\n% OF TOTAL REVENUES\nPERCENTAGE\nCHANGE\n(FAVORABLE)/\nUNFAVORABLE\n2025\n2024\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\n2025\n2024\nGeneral, Administrative and Other\n$\n767,430 \n$\n738,075 \n$\n29,355 \n4.0 \n%\n4.1 \n%\n15.2 \n%\n16.2 \n%\n(1.0)\n%\nSales, Marketing and Account Management\n288,011 \n268,157 \n19,854 \n7.4 \n%\n7.3 \n%\n5.7 \n%\n5.9 \n%\n(0.2)\n%\nTotal Selling, general and administrative expenses\n$\n1,055,441 \n$\n1,006,232 \n$\n49,209 \n4.9 \n%\n5.0 \n%\n20.9 \n%\n22.0 \n%\n(1.1)\n%\nPrimary factors influencing the change in reported Selling, general and administrative expenses for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 include the following:\n•\nan increase in general, administrative and other expenses, primarily driven by higher compensation expense; and\n•\nan increase in sales, marketing and account management expenses, primarily driven by higher compensation expense and increased marketing costs.\nThe decrease in General, Administrative and Other for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 is primarily driven by lower compensation expense and professional fees.\nDEPRECIATION AND AMORTIZATION\nDepreciation expense increased by $65.6 million, or 14.0%, for the nine months ended September 30, 2025 compared to the prior year period. See Note 2.i. to Notes to Consolidated Financial Statements included in our Annual Report for additional information regarding the useful lives over which our property, plant and equipment is depreciated.\nAmortization expense increased by $15.1 million, or 7.6%, for the nine months ended September 30, 2025 compared to the prior year period.\nACQUISITION AND INTEGRATION COSTS\nAcquisition and Integration Costs for the nine months ended September 30, 2025 and 2024 were approximately $16.0 million and $28.6 million, respectively.\nRESTRUCTURING AND OTHER TRANSFORMATION\nRestructuring and other transformation costs for the nine months ended September 30, 2025 and 2024 were $152.4 million and $124.6 million, respectively, and related to operating expenses associated with the implementation of Project Matterhorn. \nLOSS (GAIN) ON DISPOSAL/WRITE-DOWN OF PROPERTY, PLANT AND EQUIPMENT, NET\nLoss (gain) on disposal/write-down of property, plant and equipment, net for the nine months ended September 30, 2025 and 2024 was approximately $8.0 million and $8.3 million, respectively.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n37\nTable of Contents\nPart I. Financial Information\nOTHER EXPENSES, NET\nINTEREST EXPENSE, NET\nInterest expense, net increased by $82.4 million to $609.5 million in the nine months ended September 30, 2025 from $527.1 million in the prior year period. The increase is primarily due to higher average debt outstanding during the nine months ended September 30, 2025 compared to the prior year period. Our weighted average interest rate, inclusive of the fees associated with our outstanding letters of credit, was 5.6% and 5.7% at September 30, 2025 and 2024, respectively. See Note 5 to Notes to Condensed Consolidated Financial Statements included in this Quarterly Report for additional information regarding our indebtedness.\nOTHER (INCOME) EXPENSE, NET\nOther (income) expense, net for the three and nine months ended September 30, 2025 and 2024 consists of the following (in thousands):\nTHREE MONTHS ENDED SEPTEMBER 30,\nDOLLAR\nCHANGE\nNINE MONTHS ENDED SEPTEMBER 30,\nDOLLAR\nCHANGE\nDESCRIPTION\n2025\n2024\n2025\n2024\nForeign currency transaction (gains) losses, net\n(1)\n$\n(7,203)\n$\n46,657 \n$\n(53,860)\n$\n109,615 \n$\n31,291 \n$\n78,324 \nDebt extinguishment expense\n— \n5,417 \n(5,417)\n— \n5,417 \n(5,417)\nOther, net\n3,217 \n34,288 \n(31,071)\n(3,236)\n42,957 \n(46,193)\nOther (Income) Expense, Net\n$\n(3,986)\n$\n86,362 \n$\n(90,348)\n$\n106,379 \n$\n79,665 \n$\n26,714 \n(1)\nThe losses for the nine months ended September 30, 2025 primarily consist of the impact of changes in the exchange rate of the British pound sterling and the Euro against the United States dollar on our intercompany balances with and between certain of our subsidiaries.\nPROVISION FOR INCOME TAXES\nWe provide for income taxes during interim periods based on our estimate of the effective tax rate for the year. Our effective tax rates for the three and nine months ended September 30, 2025 and 2024 are as follows:\n \nTHREE MONTHS ENDED SEPTEMBER 30,\nNINE MONTHS ENDED SEPTEMBER 30,\n2025\n2024\n2025\n2024\nEffective Tax Rate\n16.1 \n%\n58.3 \n%\n44.7 \n%\n35.2 \n%\nThe primary reconciling items between the federal statutory tax rate of 21.0% and our overall effective tax rate for the three months ended September 30, 2025 were the benefits derived from the dividends paid deduction, as well as the differences in the tax rates to which our foreign earnings are subject. The primary reconciling items between the federal statutory tax rate of 21.0% and our overall effective tax rate for the nine months ended September 30, 2025 were the (i) lack of tax benefits recognized for the foreign exchange losses we recorded in Other expense (income), net, during the period, (ii) lack of tax benefits recognized for the year to date ordinary losses of certain entities, (iii) disallowed interest expenses of certain entities and (iv) differences in the tax rates to which our foreign earnings are subject, partially offset by (v) benefits derived from the dividends paid deduction.\nOn July 4, 2025, President Trump signed into law the reconciliation bill, commonly referred to as the One Big Beautiful Bill Act (\"OBBBA\"). The OBBBA introduces several changes to U.S. federal income tax law, such as suspending the capitalization and amortization of domestic research and development expenditures and reinstating bonus depreciation. It also modifies the deductions available for global intangible low-taxed income from non-U.S. subsidiaries and changes the limitations on deductible interest. Under the current law, not more than 20% of the value of a REIT’s total assets at the end of any quarter could be represented by securities of one or more taxable REIT subsidiaries; the OBBBA increases this threshold to 25% effective January 1, 2026. The effective dates of the OBBBA provisions range from 2025 through 2027. We do not expect the OBBBA provisions to have a material impact on our consolidated financial statements.\nIn addition, in connection with the removal of the proposed section 899, \"Enforcement of Remedies Against Unfair Foreign Taxes,\" from the OBBBA, the U.S. Treasury Department reached an agreement with the six other G7 countries (Canada, France, Germany, Italy, Japan and the UK) under which U.S. companies will be excluded from the imposition of any Pillar Two Income Inclusion Rule or Undertaxed Profits Rule taxes. We will continue to monitor the global legislative actions as well as administrative guidance related to Pillar Two for potential impacts, which are not expected to have a material impact on our consolidated financial statements. \nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n38\nTable of Contents\nPart I. Financial Information\nNET INCOME (LOSS) AND ADJUSTED EBITDA\nThe following table reflects the effect of the foregoing factors on our net income (loss) and Adjusted EBITDA (in thousands):\nTHREE MONTHS ENDED SEPTEMBER 30,\nDOLLAR\nCHANGE\nPERCENTAGE CHANGE\n2025\n2024\nNet Income (Loss)\n$\n86,241 \n$\n(33,665)\n$\n119,906 \n356.2 \n%\nNet Income (Loss) as a percentage of Revenue\n4.9 \n%\n(2.2)\n%\nAdjusted EBITDA\n$\n660,379 \n$\n568,113 \n$\n92,266 \n16.2 \n%\nAdjusted EBITDA Margin\n37.6 \n%\n36.5 \n%\nNINE MONTHS ENDED SEPTEMBER 30,\nDOLLAR\nCHANGE\nPERCENTAGE CHANGE\n2025\n2024\nNet Income (Loss)\n$\n59,134 \n$\n77,981 \n$\n(18,847)\n(24.2)\n%\nNet Income (Loss) as a percentage of Revenue\n1.2 \n%\n1.7 \n%\nAdjusted EBITDA\n$\n1,868,673 \n$\n1,631,329 \n$\n237,344 \n14.5 \n%\nAdjusted EBITDA Margin\n36.9 \n%\n35.7 \n%\nAdjusted EBITDA Margin for the nine months ended September 30, 2025 increased 120 basis points from the same prior year period driven by favorable overhead management, offset by changes in our revenue mix.\n↑ INCREASED BY \n$237.3 MILLION OR 14.5%\nAdjusted EBITDA\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n39\nTable of Contents\nPart I. Financial Information\nSEGMENT ANALYSIS\nSee Note 8 to Notes to Condensed Consolidated Financial Statements included in this Quarterly Report for a description of our reportable segments.\nGLOBAL RIM BUSINESS (IN THOUSANDS)\nTHREE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\nORGANIC\nGROWTH\nIMPACT OF ACQUISITIONS\n2025\n2024\nStorage Rental\n$\n814,118\n$\n767,780\n$\n46,338 \n6.0 \n%\n5.3 \n%\n5.1 \n%\n0.2 \n%\nService \n524,682\n492,578\n32,104 \n6.5 \n%\n5.8 \n%\n4.7 \n%\n1.1 \n%\nSegment Revenue\n$\n1,338,800\n$\n1,260,358\n$\n78,442 \n6.2 \n%\n5.5 \n%\n5.0 \n%\n0.5 \n%\nSegment Adjusted EBITDA\n$\n598,467\n$\n568,994\n$\n29,473 \nSegment Adjusted EBITDA Margin \n44.7 \n%\n45.1 \n%\nNINE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\nORGANIC\nGROWTH\nIMPACT OF ACQUISITIONS\n2025\n2024\nStorage Rental\n$\n2,375,206\n$\n2,253,122\n$\n122,084 \n5.4 \n%\n5.6 \n%\n5.5 \n%\n0.1 \n%\nService\n1,543,334\n1,467,970\n75,364 \n5.1 \n%\n5.3 \n%\n4.9 \n%\n0.4 \n%\nSegment Revenue\n$\n3,918,540\n$\n3,721,092\n$\n197,448 \n5.3 \n%\n5.5 \n%\n5.3 \n%\n0.2 \n%\nSegment Adjusted EBITDA\n$\n1,741,084\n$\n1,644,004\n$\n97,080 \nSegment Adjusted EBITDA Margin\n44.4 \n%\n44.2 \n%\nNINE MONTHS ENDED YEAR OVER YEAR SEGMENT ANALYSIS: GLOBAL RIM BUSINESS (IN MILLIONS)\n \nStorage Rental \nRevenue\nService\nRevenue\nSegment \nRevenue\nSegment Adjusted \nEBITDA\nPrimary factors influencing the change in revenue and Adjusted EBITDA Margin in our Global RIM Business segment for the nine months ended September 30, 2025 compared to the prior year period include the following:\n•\norganic storage rental revenue growth driven by revenue management;\n•\norganic service revenue growth primarily driven by increases in our Global Digital Solutions business and growth in our traditional service activity levels; and\n•\na 20 basis point increase in Adjusted EBITDA Margin primarily driven by ongoing cost containment measures and revenue management.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n40\nTable of Contents\nPart I. Financial Information\nGLOBAL DATA CENTER BUSINESS (IN THOUSANDS)\nTHREE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\nORGANIC\nGROWTH\nIMPACT OF ACQUISITIONS\n2025\n2024\nStorage Rental\n$\n201,383\n$\n150,796\n$\n50,587 \n33.5 \n%\n32.1 \n%\n32.1 \n%\n— \n%\nService\n2,747\n2,410\n337 \n14.0 \n%\n10.9 \n%\n10.9 \n%\n— \n%\nSegment Revenue\n$\n204,130\n$\n153,206\n$\n50,924 \n33.2 \n%\n31.7 \n%\n31.7 \n%\n— \n%\nSegment Adjusted EBITDA\n$\n107,377\n$\n66,796\n$\n40,581 \nSegment Adjusted EBITDA Margin\n52.6 \n%\n43.6 \n%\nNINE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\nORGANIC\nGROWTH\nIMPACT OF ACQUISITIONS\n2025\n2024\nStorage Rental\n$\n562,607\n$\n438,221\n$\n124,386 \n28.4 \n%\n27.6 \n%\n27.6 \n%\n— \n%\nService\n4,121\n11,624\n(7,503)\n(64.5)\n%\n(65.3)\n%\n(65.3)\n%\n— \n%\nSegment Revenue\n$\n566,728\n$\n449,845\n$\n116,883 \n26.0 \n%\n25.2 \n%\n25.2 \n%\n— \n%\nSegment Adjusted EBITDA\n$\n294,459\n$\n194,381\n$\n100,078 \nSegment Adjusted EBITDA Margin\n52.0 \n%\n43.2 \n%\nNINE MONTHS ENDED YEAR OVER YEAR SEGMENT ANALYSIS: GLOBAL DATA CENTER BUSINESS (IN MILLIONS)\n \nStorage Rental \nRevenue\nService\nRevenue\nSegment \nRevenue\nSegment Adjusted \nEBITDA\nPrimary factors influencing the change in revenue and Adjusted EBITDA Margin in our Global Data Center Business segment for the nine months ended September 30, 2025 compared to the prior year period include the following: \n•\norganic storage rental revenue growth from leases that commenced during the first nine months of 2025 and in prior periods, improved pricing and increased usage of pass-through power;\n•\nincrease in Adjusted EBITDA primarily driven by organic storage rental revenue growth; and\n•\nan 880 basis point increase in Adjusted EBITDA Margin reflecting recent lease commencements, improved pricing and cost containment.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n41\nTable of Contents\nPart I. Financial Information\nCORPORATE AND OTHER (IN THOUSANDS)\nTHREE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\nORGANIC\nGROWTH\nIMPACT OF ACQUISITIONS\n2025\n2024\nStorage Rental\n$\n17,396\n$\n17,125\n$\n271 \n1.6 \n%\n0.9 \n%\n0.9 \n%\n— \n%\nService \n193,767\n126,669\n67,098 \n53.0 \n%\n52.7 \n%\n29.5 \n%\n23.2 \n%\nRevenue\n$\n211,163\n$\n143,794\n$\n67,369 \n46.9 \n%\n46.5 \n%\n26.1 \n%\n20.4 \n%\nAdjusted EBITDA\n$\n(45,465)\n$\n(67,677)\n$\n22,212 \n \nNINE MONTHS ENDED SEPTEMBER 30,\nPERCENTAGE CHANGE\nDOLLAR\nCHANGE\nACTUAL\nCONSTANT\nCURRENCY\nORGANIC\nGROWTH\nIMPACT OF ACQUISITIONS\n2025\n2024\nStorage Rental\n$\n53,449\n$\n48,946\n$\n4,503 \n9.2 \n%\n8.6 \n%\n8.6 \n%\n— \n%\nService\n519,853\n348,747\n171,106 \n49.1 \n%\n49.0 \n%\n28.1 \n%\n20.9 \n%\nRevenue\n$\n573,302\n$\n397,693\n$\n175,609 \n44.2 \n%\n44.0 \n%\n25.7 \n%\n18.3 \n%\nAdjusted EBITDA\n$\n(166,870)\n$\n(207,056)\n$\n40,186 \nPrimary factors influencing the change in revenue and Adjusted EBITDA in Corporate and Other (as defined in Note 8 to Notes to Condensed Consolidated Financial Statements included in this Quarterly Report) for the nine months ended September 30, 2025 compared to the prior year period include the following: \n•\nan increase in service revenue of $73.0 million due to recent acquisitions in our ALM business;\n•\norganic service revenue growth in our ALM business driven by increased volume and improved component pricing trends; and\n•\nan improvement in Adjusted EBITDA driven by service revenue improvement in our ALM business.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n42\nTable of Contents\nPart I. Financial Information\nLIQUIDITY AND CAPITAL RESOURCES\nGENERAL\nWe expect to meet our short-term and long-term cash flow requirements through cash generated from operations, cash on hand, borrowings under the Credit Agreement (as defined below), as well as other potential financings (such as the issuance of debt). Our cash flow requirements, both in the near and long term, include, but are not limited to, capital expenditures, the repayment of outstanding debt, shareholder dividends, potential business acquisitions and normal business operation needs. \nPROJECT MATTERHORN\nAs disclosed above, Project Matterhorn was announced in September 2022 and is expected to be completed by December 31, 2025. We have incurred approximately $530.9 million in Restructuring and other transformation costs from the inception of Project Matterhorn through September 30, 2025. During the nine months ended September 30, 2025 and 2024, we incurred approximately $152.4 million and $124.6 million, respectively, of Restructuring and other transformation costs related to Project Matterhorn, which are comprised of (1) restructuring costs, which include (i) site consolidation and other related exit costs, (ii) employee severance costs and (iii) certain professional fees associated with these activities, and (2) other transformation costs, which include professional fees such as project management costs and costs for third party consultants who are assisting in the enablement of our growth initiatives.\nCASH FLOWS\nThe following is a summary of our cash balances and cash flows (in thousands) as of and for the nine months ended September 30,\n2025\n2024\nCash Flows from Operating Activities \n$\n840,001 \n$\n765,128 \nCash Flows from Investing Activities \n(1,968,259)\n(1,441,829)\nCash Flows from Financing Activities \n1,201,195 \n639,201 \nCash and Cash Equivalents, End of Period\n195,210 \n168,515 \nA. CASH FLOWS FROM OPERATING ACTIVITIES\nFor the nine months ended September 30, 2025, net cash flows provided by operating activities increased by $74.9 million compared to the prior year period, primarily due to an increase in net income (excluding non-cash charges) of $53.0 million and an increase in cash from working capital of $21.9 million.\nB. CASH FLOWS FROM INVESTING ACTIVITIES\nOur significant investing activity during the nine months ended September 30, 2025 included cash paid for capital expenditures of $1,755.4 million. Additional details of our capital spending are included in the \"Capital Expenditures\" section below.\nC. CASH FLOWS FROM FINANCING ACTIVITIES\nOur significant financing activities during the nine months ended September 30, 2025 included: \n•\nNet proceeds of approximately $1,390.7 million associated with the issuance of the Euro Notes (as defined below).\n•\nNet proceeds of approximately $798.7 million primarily associated with borrowings under our data center credit facilities, which were used to partially finance the construction of our data centers, and the Revolving Credit Facility.\n•\nPayment of dividends in the amount of $687.2 million on our common stock.\n•\nPayment of deferred purchase obligations and other deferred payments of $240.2 million.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n43\nTable of Contents\nPart I. Financial Information\nCAPITAL EXPENDITURES\nThe following table presents our capital spend for the nine months ended September 30, 2025 and 2024, organized by the type of the spending as described in our Annual Report (in thousands):\n \nNINE MONTHS ENDED SEPTEMBER 30,\nNATURE OF CAPITAL SPEND\n2025\n2024\nGrowth Investment Capital Expenditures:\nData Center\n$\n1,329,821 \n$\n880,239 \nReal Estate\n108,083 \n130,829 \nInnovation and Other\n104,512 \n61,352 \nTotal Growth Investment Capital Expenditures\n1,542,416 \n1,072,420 \nRecurring Capital Expenditures:\nData Center\n$\n14,455 \n$\n13,242 \nReal Estate\n37,929 \n39,750 \nNon-Real Estate\n52,097 \n54,058 \nTotal Recurring Capital Expenditures\n104,481 \n107,050 \nTotal Capital Spend (on accrual basis)\n$\n1,646,897 \n$\n1,179,470 \nNet increase (decrease) in prepaid capital expenditures\n13,958 \n1,423 \nNet decrease (increase) in accrued capital expenditures\n94,528 \n(6,925)\nTotal Capital Spend (on cash basis)\n$\n1,755,383 \n$\n1,173,968 \n    \nExcluding capital expenditures associated with potential future acquisitions, we expect total capital expenditures of approximately $1,950.0 million for the year ending December 31, 2025. Of this, we expect capital expenditures for growth investment of approximately $1,800.0 million and recurring capital expenditures of approximately $150.0 million.\nDIVIDENDS\nSee Note 7 to Notes to Condensed Consolidated Financial Statements included in this Quarterly Report for a listing of dividends that we declared during the first nine months of 2025 and fiscal year 2024.\nOn \nNovember 5, 2025\n, we declared a dividend to our stockholders of record as of \nDecember 15, 2025\n of $0.864 per share, payable on \nJanuary 6, 2026.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n44\nTable of Contents\nPart I. Financial Information\nFINANCIAL INSTRUMENTS AND DEBT\nFinancial instruments that potentially subject us to credit risk consist principally of cash and cash equivalents (including money market funds and time deposits) and accounts receivable. The only significant concentrations of liquid investments as of September 30, 2025 are related to cash and cash equivalents held in money market funds. See Note 2.e. to Notes to Condensed Consolidated Financial Statements included in this Quarterly Report for information on our money market funds and time deposits.\nLong-term debt as of September 30, 2025 is as follows (in thousands):\n \nSEPTEMBER 30, 2025\n \nDEBT (INCLUSIVE OF DISCOUNT)\nUNAMORTIZED DEFERRED FINANCING COSTS\nCARRYING AMOUNT\nRevolving Credit Facility\n(1)\n$\n233,000 \n$\n(8,691)\n$\n224,309 \nTerm Loan A\n(1)\n493,750 \n— \n493,750 \nTerm Loan B\n(1)\n1,827,457 \n(12,864)\n1,814,593 \nVirginia 3 Term Loans\n(2)\n271,079 \n(1,634)\n269,445 \nVirginia 4/5 Term Loans\n(2)\n204,987 \n(277)\n204,710 \nVirginia 6 Term Loans\n(2)\n210,000 \n(3,126)\n206,874 \nVirginia 7 Term Loans\n(2)\n239,595 \n(5,167)\n234,428 \nAustralian Dollar Term Loan\n(2)\n260,778 \n(1,989)\n258,789 \nUK Revolving Credit Facility\n188,186 \n(2,458)\n185,728 \nGBP Notes\n(2)\n537,674 \n(85)\n537,589 \n4\n7\n/\n8\n% Notes due 2027\n(2)(3)\n1,000,000 \n(2,844)\n997,156 \n5\n1\n/\n4\n% Notes due 2028\n(2)(3)\n825,000 \n(2,952)\n822,048 \n5% Notes due 2028\n(2)(3)\n500,000 \n(2,050)\n497,950 \n7% Notes due 2029\n(2)(3)\n1,000,000 \n(7,091)\n992,909 \n4\n7\n/\n8\n% Notes due 2029\n(2)(3)\n1,000,000 \n(5,786)\n994,214 \n5\n1\n/\n4\n% Notes due 2030\n(2)(3)\n1,300,000 \n(7,270)\n1,292,730 \n4\n1\n/\n2\n% Notes\n(2)(3)\n1,100,000 \n(6,741)\n1,093,259 \n5% Notes due 2032\n(2)\n750,000 \n(8,921)\n741,079 \n5\n5\n/\n8\n% Notes\n(2)(3)\n600,000 \n(3,969)\n596,031 \n6\n1\n/\n4\n% Notes\n(2)(3)\n1,200,000 \n(13,202)\n1,186,798 \n4\n3\n/\n4\n% Euro Senior Notes due 2034 (the \"Euro Notes\")\n(3)\n1,408,423 \n(17,205)\n1,391,218 \nReal Estate Mortgages, Financing Lease Liabilities and Other\n760,040 \n(1,624)\n758,416 \nAccounts Receivable Securitization Program\n400,000 \n(467)\n399,533 \nTotal Long-term Debt\n16,309,969 \n(116,413)\n16,193,556 \nLess Current Portion\n(699,320)\n— \n(699,320)\nLong-term Debt, Net of Current Portion\n$\n15,610,649 \n$\n(116,413)\n$\n15,494,236 \n(1)\nCollectively, the \"Credit Agreement\". The Credit Agreement consists of a revolving credit facility (the \"Revolving Credit Facility\"), a term loan A facility (the \"Term Loan A\") and a term loan B facility (the \"Term Loan B\").\n(2)\nEach as defined in Note 7 to Notes to Consolidated Financial Statements included in our Annual Report.\n(3)\nCollectively, the \"Parent Notes\".\nSee Note 7 to Notes to Consolidated Financial Statements included in our Annual Report and Note 5 to Notes to Condensed Consolidated Financial Statements included in this Quarterly Report for additional information regarding our long-term debt.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n45\nTable of Contents\nPart I. Financial Information\nCREDIT AGREEMENT\nOn June 18, 2025, we amended the Credit Agreement, which resulted in an increase in the principal amount of the Term Loan A from $218.8 million to $500.0 million. Quarterly principal payments of approximately $6.3 million on the Term Loan A commenced in September 2025. All other material terms remain the same as disclosed in Note 7 to Notes to Consolidated Financial Statements included in our Annual Report.\nAUSTRALIAN DOLLAR TERM LOAN\nOn June 25, 2025, Iron Mountain Australia Group Pty, Ltd., a wholly owned subsidiary of Iron Mountain Incorporated (\"IMI\"), amended its AUD Term Loan, which resulted in: \n•\nan extension of the maturity date from September 30, 2026 to September 30, 2030, \n•\nan increase in the original principal amount from 350.0 million Australian dollars to 400.0 million Australian dollars and\n•\na decrease in the interest rate from BBSY (an Australian benchmark variable interest rate) plus 3.625% to BBSY plus 3.500%.\nThe amended loan was issued at 99.5% of par. Principal payments on the AUD Term Loan are to be paid in quarterly installments in an aggregate amount of 10.0 million Australian dollars per year, with the remaining balance due September 2030. As of September 30, 2025, we had 397.5 million Australian dollars (or $262.6 million, based upon the exchange rate between the United States dollar and the Australian dollar as of September 30, 2025) outstanding on the AUD Term Loan and the interest rate in effect under the AUD Term Loan was 7.2%.\nAll other material terms of the AUD Term Loan remain the same as disclosed in Note 7 to Notes to Consolidated Financial Statements included in our Annual Report.\nUK REVOLVING CREDIT FACILITY\nIron Mountain (UK) PLC and Iron Mountain (UK) Data Centre Limited, wholly owned subsidiaries of IMI (collectively, the \"UK Borrowers\"), have a British pounds sterling Revolving Credit Facility (the \"UK Revolving Credit Facility\"). The maximum amount permitted to be borrowed under the UK Revolving Credit Facility is 140.0 million British pounds sterling, which was fully drawn as of September 30, 2025. We have the option to request additional commitments of up to 125.0 million British pounds sterling, subject to conditions specified in the UK Revolving Credit Facility.\nOn July 11, 2025, the UK Borrowers amended the UK Revolving Credit Facility to extend the maturity date from September 24, 2026 to September 24, 2028. As of September 30, 2025, the interest rate in effect under the UK Revolving Credit Facility was 6.1%. All other material terms of the UK Revolving Credit Facility remain the same as disclosed in Note 7 to Notes to Consolidated Financial Statements included in our Annual Report.\nSEPTEMBER 2025 OFFERING\nOn September 10, 2025, IMI completed a private offering of (in thousands):\nSERIES OF NOTES\nAGGREGATE PRINCIPAL AMOUNT\nMATURITY DATE\nINTEREST PAYMENT DUE\nPAR CALL DATE\n(1)\nEuro Notes\n€\n1,200,000 \nJanuary 15, 2034\nJanuary 15 and July 15\nSeptember 10, 2028\n(1)\nWe may redeem the Euro Notes at any time, at our option, in whole or in part. Prior to the par call date, we may redeem the Euro Notes at the redemption price or make-whole premium specified in the indenture governing the Euro Notes, together with accrued and unpaid interest to, but excluding, the redemption date. On or after the par call date, we may redeem the Euro Notes at a price equal to 100% of the principal amount being redeemed, together with accrued and unpaid interest to, but excluding, the redemption date.\nThe Euro Notes were issued at par and have a contractual interest rate of 4.75%. The total net proceeds from the issuance, after deducting the initial purchasers' commissions, of approximately 1,188.0 million Euros (or $1,390.7 million, based upon the exchange rate between the Euro and the United States dollar on September 10, 2025 (the settlement date for the Euro Notes)), were used to repay a portion of the outstanding borrowings under the Revolving Credit Facility and will be used to repay the GBP Notes in the fourth quarter of 2025. As of September 30, 2025, we had 1,200.0 million Euros (or $1,408.4 million, based upon the exchange rate between the United States dollar and the Euro as of September 30, 2025) outstanding on the Euro Notes. \nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n46\nTable of Contents\nPart I. Financial Information\nDEBT COVENANTS\nThe Credit Agreement, our bond indentures and other agreements governing our indebtedness contain certain restrictive financial and operating covenants, including covenants that restrict our ability to complete acquisitions, pay cash dividends, incur indebtedness, make investments, sell assets and take other specified corporate actions. The covenants do not contain a rating trigger. Therefore, a change in our debt rating would not trigger a default under the Credit Agreement, our bond indentures or other agreements governing our indebtedness. The Credit Agreement requires that we satisfy a net total lease adjusted leverage ratio and a fixed charge coverage ratio on a quarterly basis, and our bond indentures require that, among other things, we satisfy a leverage ratio (not lease adjusted) or a fixed charge coverage ratio (not lease adjusted) as a condition to taking actions such as paying dividends and incurring indebtedness.\nThe Credit Agreement uses earnings before interest, taxes, depreciation and amortization and rent expense (\"EBITDAR\")-based calculations and the bond indentures use EBITDA-based calculations as the primary measures of financial performance for purposes of calculating leverage and fixed charge coverage ratios. The EBITDAR- and EBITDA-based leverage calculations include our consolidated subsidiaries, other than those we have designated as \"Unrestricted Subsidiaries\" as defined in the Credit Agreement and bond indentures. Generally, the Credit Agreement and the bond indentures use a trailing four fiscal quarter basis for purposes of the relevant calculations and require certain adjustments and exclusions for purposes of those calculations, which make the calculation of financial performance for purposes of those calculations under the Credit Agreement and bond indentures not directly comparable to Adjusted EBITDA as presented herein. These adjustments can be significant. For example, the calculation of financial performance under the Credit Agreement and certain of our bond indentures includes (subject to specified exceptions and caps) adjustments for non-cash charges and for expected benefits associated with (i) completed acquisitions, (ii) certain executed lease agreements associated with our data center business that have yet to commence, and (iii) restructuring and other strategic initiatives. The calculation of financial performance under our other bond indentures includes, for example, adjustments for non-cash charges and for expected benefits associated with (i) completed acquisitions and (ii) events that are extraordinary, unusual or non-recurring.\nOur leverage and fixed charge coverage ratios under the Credit Agreement as of September 30, 2025 are as follows:\n \nSEPTEMBER 30, 2025\nMAXIMUM/MINIMUM ALLOWABLE\nNet total lease adjusted leverage ratio\n5.0 \nMaximum allowable of 7.0\nFixed charge coverage ratio\n2.5 \nMinimum allowable of 1.5\nWe are in compliance with our leverage and fixed charge coverage ratios under the Credit Agreement, our bond indentures and other agreements governing our indebtedness as of September 30, 2025. Noncompliance with these leverage and fixed charge coverage ratios would have a material adverse effect on our financial condition and liquidity.\nOur ability to pay interest on or to refinance our indebtedness depends on our future performance, working capital levels and capital structure, which are subject to general economic, financial, competitive, legislative, regulatory and other factors which may be beyond our control. There can be no assurance that we will generate sufficient cash flow from our operations or that future financings will be available on acceptable terms or in amounts sufficient to enable us to service or refinance our indebtedness or to make necessary capital expenditures.\nDERIVATIVE INSTRUMENTS\nINTEREST RATE SWAP AGREEMENTS\nWe utilize interest rate swap agreements designated as cash flow hedges to limit our exposure to changes in interest rates on a portion of our floating rate indebtedness. Certain of our interest rate swap agreements have notional amounts that will increase with the underlying hedged transaction. Under our interest rate swap agreements, we receive variable rate interest payments associated with the notional amount of each interest rate swap, based upon the one-month Secured Overnight Financing Rate (\"SOFR\"), in exchange for the payment of fixed interest rates as specified in the interest rate swap agreements. Our interest rate swap agreements are marked to market at the end of each reporting period, representing the fair values of the interest rate swap agreements, and any changes in fair value are recognized as a component of Accumulated other comprehensive items, net. Unrealized gains are recognized as assets, while unrealized losses are recognized as liabilities.\nAs of September 30, 2025 and December 31, 2024, we have approximately $1,787.0 million and $1,482.0 million, respectively, in notional value outstanding on our interest rate swap agreements. As of September 30, 2025, our interest rate swap agreements have maturity dates ranging from October 2025 through May 2027.\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n47\nTable of Contents\nPart I. Financial Information\nCROSS-CURRENCY SWAP AGREEMENTS\nWe utilize cross-currency swaps to hedge the variability of exchange rate impacts between the United States dollar and certain of our foreign functional currencies, including the Euro and the Canadian dollar. As of September 30, 2025, our cross-currency swap agreements have maturity dates ranging from February 2026 through November 2026.\nThe notional values of our cross-currency swaps, by hedged currency, as of September 30, 2025 and December 31, 2024, are as follows (in thousands):\n \nSEPTEMBER 30, 2025\nDECEMBER 31, 2024\nEuro\n$\n509,187 \n$\n509,187 \nCanadian dollar\n350,000 \n350,000 \n$\n859,187 \n$\n859,187 \nWe have designated these cross-currency swap agreements as hedges of net investments in our Euro and Canadian dollar denominated subsidiaries, and they require an exchange of the notional amounts at maturity. These cross-currency swap agreements are marked to market at the end of each reporting period, representing the fair values of the cross-currency swap agreements, and any changes in fair value are recognized as a component of Accumulated other comprehensive items, net. Unrealized gains are recognized as assets, while unrealized losses are recognized as liabilities. The excluded component of our cross-currency swap agreements is recorded in Accumulated other comprehensive items, net and amortized to interest expense on a straight-line basis.\nINVESTMENTS\nOur joint venture with AGC Equity Partners (the \"Frankfurt JV\") is accounted for as an equity method investment and is presented as a component of Other within Other assets, net in our Condensed Consolidated Balance Sheets. The carrying value and equity interest in the unconsolidated Frankfurt JV as of September 30, 2025 and December 31, 2024 are as follows (in thousands):\nSEPTEMBER 30, 2025\nDECEMBER 31, 2024\nCARRYING VALUE\nEQUITY INTEREST\nCARRYING VALUE\nEQUITY INTEREST\nFrankfurt JV\n$\n86,093 \n20 \n%\n$\n61,075 \n20 \n%\nIRON MOUNTAIN SEPTEMBER 30, 2025 FORM 10-Q\n48\nTable of Contents\nPart I. Financial Information"
}