{
  "source_file": "isrg-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.     BUSINESS\nIn this report, “Intuitive Surgical,” “Intuitive,” the “Company,” “we,” “us,” and “our” refer to Intuitive Surgical, Inc. and its wholly and majority-owned subsidiaries. Intuitive\n®\n, Intuitive Surgical\n®\n, da Vinci\n®\n, da Vinci S\n®\n, da Vinci Si\n®\n, da Vinci X\n®\n, da Vinci Xi\n®\n, da Vinci 5\n™\n, da Vinci SP\n®\n,\n \nEndoWrist\n®\n, Firefly\n®\n, Flexision\n®\n, Intuitive 3D Models\n™\n, Intuitive Hub\n™\n, Ion\n®\n, My Intuitive\n™\n, OnSite\n®\n, SimNow\n®\n, SureForm\n®\n, and SynchroSeal\n®\n are trademarks or registered trademarks of the Company.\nCompany Background\nAs part of Intuitive’s mission, we believe that minimally invasive care is life-enhancing care. By combining ingenuity and intelligent technology, we expand the potential of physicians to heal without constraints. We envision a future of care that is less invasive and profoundly better, where diseases are identified early and treated quickly so patients can get back to what matters most.\nSince our founding 30 years ago, we have been delivering on this mission and vision by combining innovative technology with clinical expertise to advance minimally invasive care. We do so by providing a comprehensive ecosystem that includes robotic-assisted systems, instruments and accessories, customer learning, and support services all connected by a digital portfolio that enables actionable insights across the care continuum. Among other capabilities, these products and services can augment the skills and improve the efficiency of clinicians and care teams while providing decision support and learning that can help deliver differentiated clinical and economic value for patients, providers, and payers when compared to the next best available treatment options.\nTo assure continued alignment with the patients and healthcare community we serve, we have adopted the Quintuple Aim as our “north star.” Starting foremost with a focus on patients, we seek to demonstrate that our products can deliver better outcomes that are validated by rigorous peer-reviewed evidence. Second, we aim to work with clinicians and care teams to create better patient experiences that enable patients to more quickly get back to what matters most in their lives, with fewer complications, less pain and discomfort, and greater predictability. Third, we aim to enable the care teams who use our platforms and technology-enabled ecosystem to have better experiences that augment their skills while reducing fatigue and increasing efficiency and reliability. Fourth, we aim to help lower the total cost of care per patient episode when compared with existing treatment alternatives, providing a return on investment for hospitals and healthcare systems and value for payers. Lastly, we aim to expand access to high-quality minimally invasive care by partnering with hospitals, healthcare systems, and patient advocacy groups to address barriers to care.\nWhile surgery and acute interventions have improved significantly in the past few decades, there remains a significant need to improve across all aspects of the Quintuple Aim. Stakeholders continue to expect better clinical outcomes and decreased variability of outcomes across clinicians and care teams. Globally, healthcare systems continue to be stressed and lacking in critical resources, including the professionals who staff care teams. At the same time, healthcare providers, payers, and governments strain to cover the healthcare needs of their populations and demand lower total cost per patient to treat disease. In the face of these challenges, we continue to believe that we are well-positioned to synthesize scientific and technological advances in biology, computing, imaging, algorithms, and robotics to deliver meaningful and measurable value to all of our stakeholders.\nProducts\nSystems\nAdvanced robotic systems provide precise, powerful platforms with high-performance vision, extending the care team’s capabilities to enhance minimally invasive care. These systems include da Vinci surgical systems, which are designed to enable a wide range of surgical procedures using a minimally invasive approach, and the Ion endoluminal system, which extends our commercial offerings beyond surgery into diagnostic procedures, enabling minimally invasive biopsies in the lung.\nDa Vinci Surgical Systems\nBy striving to find less invasive ways to enter the body, provide clearer views of anatomy and more precise tissue interactions, and help hone surgical skills, Intuitive launched its first da Vinci surgical system in 1999. In 2000, the FDA cleared da Vinci for general laparoscopic surgery. Since then, we have received numerous additional indications within the U.S. as well as outside of the U.S. Refer to the section titled “Regulatory Activities” in our Management’s Discussion and Analysis of Financial Condition and Results of Operations for more recent regulatory clearances, approvals, and certification.\nThere are several models of the da Vinci surgical system currently used by our customers: our recently released fifth-generation da Vinci 5 surgical system, our fourth-generation da Vinci X, da Vinci Xi, and da Vinci SP surgical systems, our third-generation da Vinci\n \nSi surgical system, and our second-generation da Vinci\n \nS surgical system. The da Vinci surgical \n6\nTable\n of Contents\nsystems are designed to enable surgeons to perform a wide range of surgical procedures within our targeted general surgery, urologic, gynecologic, cardiothoracic, and head and neck specialties. Da Vinci systems offer surgeons three-dimensional, high definition (“3DHD”) vision, a magnified view, and robotic and computer assistance. They use specialized instrumentation, including a miniaturized surgical camera (endoscope) and wristed instruments (e.g., scissors, scalpels, and forceps) that are designed to help with precise dissection and reconstruction deep inside the body.\nOur da Vinci surgical systems are comprised of the following components:\nSurgeon Console\n.  The da Vinci surgical system allows surgeons to operate while comfortably seated at an ergonomic console viewing a 3DHD image of the surgical field. The surgeon’s fingers grasp instrument controls below the display with the surgeon’s hands naturally positioned relative to his or her eyes. Using electronic hardware, software, algorithms, and mechanics, our technology translates the surgeon’s hand movements into precise and corresponding real-time micro movements of the da Vinci instruments positioned inside the patient. On most of our current systems (da Vinci 5, da Vinci\n \nX\n, \nda Vinci\n \nXi, da Vinci SP, and da Vinci Si), a second surgeon console may be used in two ways: to provide assistance to the primary surgeon during surgery or to act as an active aid during surgeon-proctor training sessions. With the da Vinci 5, da Vinci\n \nX\n, \nda Vinci\n \nXi, da Vinci SP, and da Vinci Si, a surgeon sitting at a second console can view the same surgery as the primary surgeon and can be passed control of some or all of the da Vinci instruments during the surgery. In addition, surgeons can control 3D virtual pointers to augment the dual-surgeon experience. The da Vinci surgical system is designed to allow surgeons to operate while seated, which may be clinically advantageous because of reduced surgeon fatigue. The da Vinci surgical system’s design provides natural hand-eye alignment at the surgeon console. Because the da Vinci surgical system’s robotic arms hold the camera and instruments steady, there is less surgeon and assistant fatigue and enhanced control by the surgeon.\nPatient-Side Cart\n.  The patient-side cart holds electromechanical arms that manipulate the instruments inside the patient. For our da Vinci 5, da Vinci X, da Vinci\n \nXi, and da Vinci\n \nSi surgical systems, up to four arms attached to the cart can be positioned, as appropriate, and then locked into place. At least two arms hold surgical instruments, one representing the surgeon’s left hand and one representing the surgeon’s right hand. A third arm positions the endoscope, allowing the surgeon to easily move, zoom, and rotate the field of vision. A fourth instrument arm extends surgical capabilities by enabling the surgeon to add a third instrument to perform additional tasks. The fourth instrument arm is a standard, integrated feature on the da Vinci 5, da Vinci X, da Vinci Xi, and da Vinci Si surgical systems. Our da Vinci single-port (“SP”) surgical system includes a single arm with three multi-jointed, wristed instruments and the first da Vinci fully wristed, 3DHD camera. The instruments and the camera all emerge through a single cannula and are triangulated around the target anatomy to avoid external instrument collisions that can occur in narrow surgical workspaces.\n3DHD Vision System\n.  Our vision system includes a 3DHD endoscope with two independent vision channels linked to two separate color monitors through sophisticated image processing electronics and software. The resulting 3DHD image has high resolution, high contrast, low flicker, and low cross fading. A digital zoom feature in the 3DHD vision system allows surgeons to magnify the surgical field of view without adjusting the endoscope position and, thereby, reduces interference between the endoscope and instruments. The 3DHD vision system is a standard, integrated feature on the da Vinci 5, da Vinci\n \nX\n, \nda Vinci\n \nXi\n,\n da Vinci SP,\n \nda Vinci\n \nSi\n,\n and da Vinci S surgical systems.\nFirefly Fluorescence Imaging (“Firefly”)\n.  Firefly is a standard feature of the da Vinci 5, da Vinci X, da Vinci Xi, and da Vinci SP\n s\nurgical systems and is available as an upgrade on our da Vinci\n \nSi surgical system. This imaging capability combines an injectable fluorescent dye with a specialized da Vinci camera head, endoscope, and laser-based illuminator to allow surgeons to identify vasculature, tissue perfusion, or biliary ducts in three dimensions beneath tissue surfaces in real-time. The most common procedural categories for the use of Firefly are urology, gynecology, and general surgery.\nDa Vinci Integrated Table Motion\n.  Integrated Table Motion coordinates the movements of the da Vinci robotic arms with an advanced operating room (“OR”) table, the TS 7000dV OR Table sold by Hillrom (now a part of Baxter International Inc.), to enable managing the patient’s position in real-time while the da Vinci robotic arms remain docked. This gives OR teams the capability to improve the positioning of the operating table during da Vinci surgical system procedures. Integrated Table Motion enables the patient to be dynamically positioned during the procedure. It enables surgeons to extend reach, facilitate access, and choose the angle of approach to target anatomy, as well as reposition the table during the procedure to enhance anesthesiologists’ management of the patient. Integrated Table Motion is a standard feature for da Vinci 5 surgical systems and is available as an upgrade for da Vinci Xi surgical systems.\nIon Endoluminal System\nIn 2019, the FDA cleared our Ion endoluminal system, which is a flexible, robotic-assisted, catheter-based platform that utilizes instruments and accessories for which the first cleared indication is minimally invasive biopsies in the lung. Our Ion system extends our commercial offering beyond surgery into diagnostic, endoluminal procedures. The system features an ultra-thin, ultra-maneuverable catheter that can articulate 180 degrees in all directions and allows navigation far into the peripheral \n7\nTable\n of Contents\nlung and provides the stability necessary for precision in a biopsy. Many suspicious lesions found in the lung may be small and difficult to access, which can make diagnosis challenging, and Ion helps physicians obtain tissue samples from deep within the lung, which could help enable earlier diagnosis.\nInstruments and Accessories\nWe offer a comprehensive suite of stapling, energy, and core instrumentation for our multi-port da Vinci surgical systems. Our technology is designed to transform the surgeon’s natural hand movements outside of the body into corresponding micro-movements inside the patient’s body and suture with precision, just as they can in open surgery. With our technology, a surgeon can also use “motion scaling,” a feature that translates, for example, a three-millimeter hand movement outside the patient’s body into a one-millimeter instrument movement in the surgical field inside the patient’s body. Motion scaling is designed to allow precision and control for delicate tasks. In addition, our technology filters the tremor inherent in a surgeon’s hands.\nDa Vinci Instruments\n.  Most of the instruments that we manufacture incorporate wristed joints for natural dexterity and tips customized for various surgical procedures. Various da Vinci instrument tips include forceps, scissors, electrocautery tools, scalpels, and other surgical tools that are familiar to the surgeon from open surgery and conventional minimally invasive surgery (“MIS”). A variety of instruments may be selected and used interchangeably during a surgery. Most instruments are sterilizable at the hospital, while others are provided sterile, and most are reusable for a defined number of procedures. A programmed memory chip inside each instrument performs several functions that help determine how the da Vinci system and instruments work together. In addition, the chip generally will not allow the instrument to be used for more than the prescribed number of procedures to help ensure that its performance meets specifications during each procedure.\nDa Vinci Stapling\n.  The SureForm and EndoWrist staplers are wristed, stapling instruments intended for resection, transection, and creation of anastomoses. These instruments enable surgeons to precisely position and fire the stapler. We have various staplers that can be used with our da Vinci 5, da Vinci X, and da Vinci Xi surgical systems: the SureForm 30, 45, and 60 staplers, where the numeric designation indicates the length of the staple line. The SureForm 30, 45, and 60 staplers are single-use, fully wristed, stapling instruments intended\n \nto be used in general, thoracic, gynecologic, urologic, and pediatric surgical procedures. The SureForm 30 stapler may deliver particular utility in thoracic procedures. The SureForm 45 stapler may receive particular use in thoracic and colorectal procedures where maneuverability and visualization are limited. The SureForm 60 stapler is intended to deliver particular value in bariatric procedures. Outside of the U.S. (“OUS”), we also offer the EndoWrist 30 and 45 staplers that can be used with our da Vinci X and da Vinci Xi surgical systems. The EndoWrist 30 stapler is intended to deliver particular utility with fine tissue interaction in lobectomy and other thoracic procedures. The EndoWrist 45 stapler is used in general, gynecologic, thoracic, and urologic surgical procedures. We also have various clearances for five stapler reloads: gray (2.0 mm), white (2.5 mm), blue (3.5 mm), green (4.3 mm), and black (4.6 mm). Not all reloads are available for use on all staplers. Not all staplers or reloads are available in all countries.\nDa Vinci Energy\n.  Our first-generation E-100 generator is offered as an upgrade to power our da Vinci Vessel Sealer Extend and SynchroSeal instruments. Additionally, we recently introduced our second-generation E-200 generator, an advanced electrosurgical generator designed to provide high-frequency energy for cutting, coagulation, and vessel sealing of tissues. The E-200 generator is integrated with the da Vinci 5 surgical system, is compatible with our da Vinci X and Xi surgical systems, and can also function as a standalone electrosurgical generator.\nVessel Sealer Extend is a single-use, fully wristed, advanced bipolar instrument that is compatible with our da Vinci 5, da Vinci X, and da Vinci Xi surgical systems. It is intended for grasping and blunt dissection of tissue, bipolar coagulation, and mechanical transection of vessels up to 7 mm in diameter and tissue bundles that fit in the jaws of the instrument. This instrument enables surgeons to control vessel sealing, while providing the benefits of robotic-assisted surgery, and is designed to enhance surgical efficiency and autonomy in a variety of general and gynecologic surgical procedures.\nSynchroSeal enables a surgeon to perform rapid, one-step sealing and transection with a single pedal press. SynchroSeal uses advanced bipolar energy from its raised cut electrode to transect tissue and then cool down quickly.\nAccessory Products\n.  We sell various accessory products, which are used in conjunction with the da Vinci surgical systems as surgical procedures are performed. Accessory products include sterile drapes used to help ensure a sterile field during surgery, vision products, such as replacement 3D stereo endoscopes, camera heads, and light guides, and other items that facilitate the use of the da Vinci surgical systems.\nInstruments and accessories are also used with our Ion endoluminal system to perform lung biopsy procedures and for the operation and maintenance of the system.\nIon Instruments\n.  Instruments utilized with our Ion system include our fully articulating catheter, which is employed to navigate the intricate and narrow airways of the lungs, our peripheral vision probe, an endoscope that provides real-time \n8\nTable\n of Contents\nairway visualization for catheter navigation, and our Flexision biopsy needles, which are used to procure tissue samples from lung nodules.\nAccessory Products\n.  Accessory products that are used in conjunction with the Ion system include cleaning tools and other ancillary equipment essential for the operation and maintenance of the Ion system.\nLearning\nIntuitive provides a progressive learning journey to support the use of our technology. These training pathways leverage both learning engagements and learning technologies. Learning engagement touchpoints vary by specific pathway, skill level, and interest, while learning technologies enable and provide training directly to the customer. The portfolio of learning offerings includes role-specific training pathways, learning engagements, and learning technology.\nTraining Pathways.\n  Intuitive’s training pathways provide a systematic learning journey that helps customers build technical proficiency. There are pathways for surgeons and physicians, residents and fellows, OR care teams, patient side assists, and robotic coordinators, as well as recommendations for executives.\nLearning Engagements.\n  Intuitive learning engagements are touchpoints that support customers throughout their learning journeys. They vary by pathway, skill level, and focus area. Engagements include case observations, online education, in-service training, simulation/skills training, OR care team training, technology training, reprocessing training, proctoring, advanced training, and curriculum development support. Many of these programs take place at Intuitive training centers and are taught by experienced Intuitive staff, while our advanced courses are taught by surgeon and physician instructors.\nLearning Technology.\n  Learning technologies are designed to help customers access training. Enabling technology helps bring innovative offerings to the customer. Intuitive’s enabling technologies include Telepresence and the Advanced Insights Suite (which includes Case Insights and Insights Engine). Learning technology solutions include Intuitive Learning, SimNow, customized training models, remote case observations, and remote proctoring. Two of the technology solutions most often used by customers are Intuitive Learning and SimNow.\nIntuitive Learning.\n  Intuitive Learning enables customers to complete technology and procedure education, while also being able to view, assign, and track technology and simulation learning. Intuitive Learning’s user roles include surgeons/physicians, residents/fellows, care teams, patient side assists, robotic coordinators, and sterile reprocessing staff.\nSimNow. \n Our cloud-enabled SimNow simulation platform is a practice tool that gives a user the opportunity to practice their skills and gain familiarity with the surgeon console controls and supports the user’s progressive learning pathway. SimNow incorporates 3D, physics-based computer simulation technology to immerse the user within a virtual environment and provides training capabilities that have been used extensively by surgeons. The user navigates through the environment and completes exercises by controlling virtual instruments from the surgeon console. Upon completion of a skills exercise, the skills simulator provides a quantitative assessment of user performance based on a variety of task-specific metrics. The SimNow online connection drives real-time simulation performance tracking for surgeons and administrators through an online dashboard and supports remote updates of the VR content and 3DHD videos to drive a more interactive and engaging customer experience. SimNow is intended to augment, not replace, existing training programs for the da Vinci 5, da Vinci X, da Vinci Xi, and da Vinci SP surgical systems.\nServices\nWe have a network of field service engineers across the U.S., Canada, Europe, and Asia and maintain relationships with various distributors around the globe. This infrastructure of service and support specialists offers a full complement of services for our customers, including installation, repair, maintenance, 24/7 technical support, and proactive system health monitoring.\nOur comprehensive support and program assistance helps ensure customers and care teams maximize program performance and protect their investment. Services include readiness support, maintenance support, perioperative consulting, Custom Hospital Analytics, and market consulting optimization.\nReadiness and Maintenance Support.\n  Readiness support is operational support to ensure smooth onboarding and adoption of new systems and technology. Maintenance support helps to maximize operational efficiency and reduce unplanned equipment downtime. It includes service care plans, support teams, OnSite monitoring, software upgrades and updates, as well as a customer portal. The service plan portfolio offers flexible service plans to ensure reliability of the systems and instruments and help optimize the robotics program. The support team of expert field service, remote technical support, and customer care agents resolve and prevent technology issues that could inhibit optimal utilization. OnSite monitoring offers remote service in real-time for pre-operative and intraoperative troubleshooting, as well as proactive monitoring of system performance. Software upgrades and updates enable the latest product innovations, enhancements, and reliability improvements. The customer portal is an online tool that enables customers to access system utilization and program \n9\nTable\n of Contents\nanalytics, view orders and maintenance history, and initiate product returns and exchanges to help achieve the operational and financial goals of a robotics program.\nPerioperative Consulting.\n  Perioperative consulting is a suite of customized solutions to improve a hospital’s efficiency and performance with Intuitive technologies. New system integration support is available to streamline the start-up process and expedite increased procedure volumes. Overall program assessments help to support efficiency improvements, cost reductions, and system access optimization.\nProgram Analytics. \nOur Custom Hospital Analytics program enables the integration of data sources so that individual health institutions can analyze their data in their own environment. Using this data, executives, administrators, care teams, and surgeons can gain alignment around their programs based on their KPIs, determine best practices, assess gaps, and take actionable steps to address any gaps.\nDigital Solutions\nIntegrated digital capabilities provide connected offerings, streamlining performance for hospitals with program-enhancing insights. Secure-by-design, cloud-enabled products analyze and simplify essential data to continuously optimize the use of time, tools, and techniques.\nIntuitive Hosted & Managed Services.\n  The vast majority of our systems are network connected and directly communicate with Intuitive to enable proactive monitoring of product performance to provide high uptime reliability, as well as provide software updates and data insights to Intuitive customers.\n3D Modeling Services.\n  Intuitive 3D Models is our augmented reality imaging product for use in kidney, prostate, lung, and rectal procedures. The service extracts CT and MR scans, runs them through segmentation algorithms and, after technicians’ revision and radiologists’ review, returns a 3D segmented model of the organ for use in planning for a procedure, intraoperative visualization, and surgical education. The tool uses augmented reality to give surgeons an image with details of organ anatomy – blood vessels, tumor shape, and size – that they may not be able to see well with other two-dimensional imaging. Intuitive designed this to help with pre-operative planning and intraoperative guidance to let surgeons know where critical anatomy sits as they work through a procedure, as well as to be shared as a teaching tool for other physicians and patients. The product has recently been launched, and we are in the process of bringing the first sites onboard.\nMy Intuitive.\n  This mobile and web application was developed to be the single point for Intuitive customers to access individual or program-level data from Intuitive. The application also offers comparisons of those insights with anonymized national benchmarks to help drive operational efficiencies and decreased costs. It enables mobile access to Intuitive’s Learning platform, case reports generated automatically for the surgeon, and an ability for surgeons to publish their practice information online for patients seeking local physicians.\nIntuitive Hub\n.  Intuitive Hub is an OR informatics platform that integrates multiple applications and data sets to help orchestrate medical procedure workflows. For the care team, Intuitive Hub acts as a point-of-care device that automates tasks, such as video recording and bookmarking. The Intuitive Telepresence application on Hub can be used to facilitate peer-to-peer collaboration, learning, and support. Video captured during surgery and da Vinci system data are connected via Intuitive Hub for physicians to access after a surgical procedure, helping to facilitate personalized learning and increase efficiency.\nBusiness Strategy\nWe align our goals to those of our customers, often called the Quintuple Aim: enabling physicians and hospitals to improve outcomes for their patients, improve their patient’s experience, improve the care team’s experience, address barriers to expanding access to high quality minimally invasive care, and lower the total cost to treat per patient episode. Through the use of Intuitive’s smart, connected systems, robotic technologies, advanced imaging, and informatics, our objective is to create value for patients, physicians, and hospitals, as summarized below.\nPatient Value.\n  We believe that the value of a medical procedure to a patient can be defined: \nPatient Value = Procedure Efficacy / Invasiveness\n. We define \nprocedure efficacy\n as a measure of the success of the procedure in helping resolve the underlying disease, and \ninvasiveness\n as a measure of patient pain and disruption of regular activities. When the patient value of a procedure using an Intuitive product is greater than that of alternative intervention options, patients may benefit from seeking out physicians and hospitals that offer those products, which could potentially result in a local market share shift. Adoption of Intuitive technology occurs by procedure and by market and is driven by the relative patient value and the total intervention costs of da Vinci and Ion procedures as compared to alternative intervention options for the same disease state or condition. We believe that most patients will place a higher value on procedures that are not only more efficacious but also less invasive than alternative interventions. Our goal is to provide products to \n10\nTable\n of Contents\nphysicians who, in turn, provide patients with procedure options that are both highly effective and less invasive than others. Furthermore, we will work to increase access to minimally invasive care.\nPhysician Value.\n  We offer physicians and their operating room staff training on the technical use of our products. Our da Vinci surgical system provides an ergonomic platform for surgeons to perform their procedures. We seek to provide surgeons with reliable and easy-to-use products. For example, the change to cloud-based analytics and routine use of local analytics may help surgeons track their procedures and processes and, with a network-connected smartphone and the My Intuitive app, surgeons can access and explore their procedure data, such as console time and instrument usage, to gain insights into their program. Ion brings physicians an immersive bronchoscopy experience from visualizing the lung anatomy and planning each patient’s procedure to navigating and biopsying small nodules in the peripheral lung. Results from early studies have demonstrated relatively low occurrence of pneumothorax requiring intervention.\nHospital Value.\n  We help hospitals build value by increasing surgical revenue and reducing costs through lower complication rates and reduced lengths of patient stay. For example, we believe robotic-assisted surgery with the da Vinci surgical system is a cost-effective approach to many surgeries as compared to alternative treatment options, as recognized in many published studies. We also offer our Custom Hospital Analytics program, which enables the integration of data sources so that individual health institutions can analyze their data in their own environment. Using this data, administrators, chiefs of surgery, and surgeons can gain alignment around their programs based on their KPIs, determine best practices, assess gaps, and take actionable steps to address any gaps.\nClinical Applications\nWe are the beneficiaries of productive collaborations with leading surgeons in exploring and developing new techniques and applications for robotic-assisted surgery with the da Vinci surgical system and minimally invasive biopsies with the Ion endoluminal system—an important part of our creative process. We primarily focus our development efforts on those procedures in which we believe our products bring the highest patient value, surgeon value, and hospital value. We currently focus on five surgical specialties: general surgery, urologic surgery, gynecologic surgery, cardiothoracic surgery, and head and neck surgery. Key procedures that we are focused on include hernia repair, colon and rectal procedures, cholecystectomy, bariatric surgery, prostatectomy, partial nephrectomy, hysterectomy, sacrocolpopexy, lobectomy, and transoral robotic surgery. We also focus on minimally invasive biopsies in the lung. Representative surgical applications are described below.\nGeneral Surgery\nHernia Repair.\n  A hernia occurs when an organ or other tissue squeezes through a weak spot in a surrounding muscle or connective tissue. During a hernia repair surgery, the weakened tissue is secured, and defects are repaired. Common types of hernias are ventral and inguinal. Ventral, or abdominal hernia, may occur through a scar after surgery in the abdomen. Inguinal hernia is a bulge in the groin and is more common in men. Hernia repair can be performed using traditional open surgery or MIS. There is a wide range of complexity in hernia repair surgeries and varying surgeon opinions regarding optimal surgical approach. The benefits of minimally invasive and robotic-assisted hernia repair surgery vary by patient.\nColorectal Surgery.\n  These procedures typically involve benign or cancerous conditions of the lower digestive system, in particular the rectum or colon. Common procedures in this area include hemicolectomy, sigmoidectomy, low anterior resection, and abdominoperineal resection. Surgeons have reported that the use of robotic-assisted surgery with a da Vinci surgical system and our latest technologies, such as the SureForm stapler and da Vinci energy products, has enabled them to offer MIS approaches to a broader range of colorectal surgery patients.\nCholecystectomy.\n  Cholecystectomy, or the surgical removal of the gallbladder, is a commonly performed general surgery procedure. Cholecystectomy is the primary method for the treatment of gallstones and other gallbladder diseases. Most cholecystectomies are performed using multi-port MIS techniques, although some surgeons choose to perform cholecystectomy using manual single-port instrumentation. Firefly technology can be used to visualize biliary anatomy in three dimensions beneath the tissue surfaces during multi-port da Vinci cholecystectomies.\nBariatric Surgery\n.  A body of literature points to the benefit of surgery to treat patients with morbid obesity and its secondary effects, such as diabetes. Sleeve gastrectomy and Roux-en-Y gastric bypass (“RYGB”) are commonly performed surgical procedures for morbid obesity in the U.S. The body habitus of morbidly obese patients can make laparoscopic surgery physically challenging for the surgeon, and certain surgeons have found value in using the da Vinci surgical system to improve upon the ergonomics when performing MIS in morbidly obese patients. In addition, RYGB can be a technically challenging procedure due to the suturing, stapling, and tissue (bowel) manipulation that is required. Surgeons using the da Vinci surgical system have reported a reduction in a critical complication (anastomotic leaks) relative to laparoscopic RYGB. Also, we believe SureForm 60 may have particular utility in bariatric procedures.\n11\nTable\n of Contents\nUrologic Surgery\nProstatectomy\n.  Radical prostatectomy is the removal of the prostate gland in patients diagnosed with clinically localized prostate cancer. The standard approach to the removal of the prostate was via an open surgical procedure. The conventional laparoscopic approach is an option, but it is difficult and poses challenges to even the most skilled urologist. The da Vinci surgical system has enabled a large number of surgeons to convert from using an open surgical technique to a minimally invasive technique.\nPartial Nephrectomy.\n  Partial nephrectomy is the removal of a small portion of a kidney (typically, an area of the kidney containing a tumor). Partial nephrectomies are most commonly performed in patients diagnosed with clinically localized renal cancer. Excluding robotic-assisted surgery with a da Vinci surgical system, there are three common surgical approaches to performing partial nephrectomies: open surgical technique, laparoscopy, and hand-assisted laparoscopy, which is a hybrid of the open and laparoscopic techniques. Surgeons have reported that the da Vinci surgical system’s capabilities may enable a large number of these procedures to be performed through a minimally invasive technique, conferring the benefits of MIS to a broader range of partial nephrectomy patients. Treatment guidelines for patients with localized renal cancer recommend partial nephrectomy due to the benefits that nephron-sparing surgery has in long-term patient outcomes. Published clinical literature has shown that the presence of a da Vinci\n s\nurgical system is associated with a higher-proportion of patients receiving a guideline-recommended partial nephrectomy.\nGynecologic Surgery\nHysterectomy.\n  Removal of the uterus is one of the most commonly performed surgeries in gynecology and is performed for a variety of underlying benign and cancerous conditions. Hysterectomies can be performed using open surgery (laparotomy) or MIS techniques, which include vaginal, laparoscopic, and robotic-assisted approaches. Prior to the clearance of the da Vinci surgical system for use in gynecological procedures in 2005, the majority of hysterectomies performed were open surgeries. We believe that robotic-assisted surgery with the da Vinci surgical system provides patients the opportunity to receive a minimally invasive treatment as an alternative to an open hysterectomy.\nSacrocolpopexy.\n  The abdominal (open) sacrocolpopexy is one of the operations performed to treat vaginal vault prolapse. Sacrocolpopexy involves suturing a synthetic mesh that connects and supports the vagina to the sacrum (tailbone). A sacrocolpopexy can be performed using a conventional laparoscopic technique; however, it is generally described as difficult and cumbersome to perform. Surgeons have reported that the da Vinci surgical system’s capabilities may enable a larger number of these procedures to be performed through a minimally invasive technique, conferring the benefits of MIS to a broader range of sacrocolpopexy patients.\nCardiothoracic Surgery\nThoracic Surgery.\n  Conventional approaches to surgical procedures in the thorax include both open and video-assisted thoracoscopic approaches. Procedures performed via these methods include pulmonary wedge resection, pulmonary lobectomy, thymectomy, mediastinal mass excision, and esophagectomy. Many thoracic procedures remain open procedures. Surgeons have reported that the use of robotic-assisted surgery with a da Vinci surgical system in thoracic surgery has enabled them to offer MIS approaches to a broader range of thoracic surgery patients and improved clinical outcomes compared to open and video-assisted thoracic surgery in published single-center, multi-center, and national database clinical studies. Also, we believe the EndoWrist 30 stapler and the SureForm 30 stapler may have particular utility in thoracic procedures.\nHead and Neck Surgery\nTransoral Surgery.\n  Head and neck cancers are typically treated by either surgical resection or chemo-radiation, or a combination of both. Surgical resection performed by an open approach may require a “jaw-splitting” mandibulotomy. This procedure, while effective in treating cancer, is potentially traumatic and disfiguring to the patient. MIS approaches via the mouth (transoral surgery) are challenged by line-of-sight limitations dictated by conventional endoscopic tools. Chemo-radiation as a primary therapy does allow patients to avoid traumatic surgical incisions; however, the literature suggests that this modality diminishes patients’ ability to speak and swallow normally. Surgeons have reported that da Vinci transoral surgery allows them to operate on tumors occurring in the oropharynx (i.e., tonsil and base of tongue) and larynx via the mouth and to overcome some of the line-of-sight limitations of conventional transoral surgery.\nDa Vinci Procedure Mix\nOur da Vinci procedure business is broadly split into two categories: (1) cancer procedures and (2) procedures for benign conditions. Cancer and other highly complex procedures tend to be reimbursed at higher rates than less complex procedures for benign conditions. Thus, hospitals are more sensitive to the costs associated with treating less complex, benign conditions. Our strategy is to provide hospitals with attractive clinical and economical solutions across the spectrum of procedure complexity. Our fully featured da Vinci 5 and da Vinci\n \nXi\n \nsurgical systems with advanced instruments (including the da Vinci energy and \n12\nTable\n of Contents\nda Vinci stapler products) and our Integrated Table Motion product target the more complex procedure segment. Our da Vinci X surgical system is targeted toward price-sensitive markets and procedures. Our da Vinci SP surgical system complements our da Vinci 5, da Vinci X, and Xi surgical systems by enabling surgeons to access narrow workspaces.\nClinical Summary\nThere are over 70 representative clinical uses for da Vinci surgical systems. We believe that there are numerous additional applications that can be addressed with the da Vinci surgical system, and we work closely with our surgeon customers to refine and explore new techniques in which a da Vinci surgical system may bring value. As of December 31, 2024, we had an installed base of 9,902 da Vinci surgical systems, including 5,807 in the U.S., 1,867 in Europe, 1,745 in Asia, and 483 in the rest of the world. We estimate that surgeons using our technology completed approximately 2,683,000 surgical procedures of various types in hospitals throughout the world during the year ended December 31, 2024.\nAdditionally, over time, we believe that there are numerous additional applications that can be addressed with our Ion endoluminal system. As of December 31, 2024, we had an installed base of 805 Ion systems, 784 of which are located in the U.S. We plan to seek additional clearances, certifications, or approvals for Ion in OUS markets over time.\nSales and Customer Support\nSales Model\nWe provide our products through direct sales organizations in the U.S., Europe (excluding Spain, Portugal, Italy, Greece, and Eastern European countries), China, Japan, South Korea, India, Taiwan, and Canada. We provide products and services in China through our majority-owned joint venture (“Joint Venture”) with Shanghai Fosun Pharmaceutical (Group) Co., Ltd. (“Fosun Pharma”) and its affiliates. See “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” for further details on the Joint Venture. In the remainder of our markets outside of the U.S., we provide our products through distributors. During the years ended December 31, 2024, 2023, and 2022, domestic revenue accounted for 67%, 66%, and 67%, respectively, of total revenue, while revenue from our OUS markets accounted for 33%, 34%, and 33%, respectively, of total revenue.\nOur direct sales organization is composed of a capital sales team, responsible for selling systems, and a clinical sales team, responsible for supporting the systems used in procedures performed at our hospital accounts. Our hospital accounts include both individual hospitals and healthcare facilities as well as hospitals and healthcare facilities that are part of an integrated delivery network (“IDN groups”). The initial system sale into an account is a major capital equipment purchase by our customers and typically has a lengthy sales cycle that can be affected by macroeconomic factors, capital spending prioritization, the timing of budgeting cycles, and the evaluation of alternative products. Capital sales activities include educating surgeons or physicians and hospital staff across multiple specialties on the benefits of robotic-assisted surgery with a da Vinci surgical system or robotic-assisted bronchoscopy with an Ion endoluminal system, total treatment costs, and the clinical applications that our technology enables. We also train our sales organization to educate hospital management on the potential benefits of adopting our technology, including the clinical benefits of robotic-assisted surgery with a da Vinci surgical system or robotic-assisted bronchoscopy with an Ion endoluminal system, in support of their Quintuple Aim objectives.\nOur clinical sales team works on site at hospitals, interacting with surgeons or physicians, operating room staff, and hospital administrators to develop and sustain successful robotic-assisted surgery or bronchoscopy programs. They assist the hospital in identifying surgeons or physicians who have an interest in robotic-assisted surgery or bronchoscopy and the potential\n \nbenefits provided by the da Vinci surgical system and the Ion endoluminal system. Our clinical sales team provides current clinical information on robotic-assisted surgery or bronchoscopy practices and new product applications to the hospital teams. Our clinical sales team has grown with the expanded installed bases of da Vinci surgical systems and Ion endoluminal systems as well as the total number of procedures performed. We expect this organization to continue to grow as our business expands.\nOur customers place orders to replenish their supplies of instruments and accessories on a regular basis. Orders received are typically shipped within one business day. New direct customers who purchase a system typically place an initial stocking order of instruments and accessories soon after they receive their system.\nOur business is subject to seasonal fluctuations. Historically, placements of our da Vinci surgical systems have tended to be heavier in the fourth quarter and lighter in the first quarter, as hospital budgets are reset. In addition, we have historically experienced lower procedure volume in the first and third quarters and higher procedure volume in the second and fourth quarters. More than half of da Vinci procedures performed are for benign conditions. These benign procedures and other short-term elective procedures tend to be more seasonal than cancer procedures and surgeries for other life-threatening conditions. In the U.S., volumes for procedures associated with benign conditions are typically seasonally higher in the fourth quarter when more patients have met annual deductibles and lower in the first quarter when deductibles are reset. Seasonality outside of the U.S. varies and is more pronounced around local holidays and vacation periods, which have lower procedure volume. The \n13\nTable\n of Contents\ntiming of procedures and changes in procedure volume impact the timing of instruments and accessories and capital purchases. As a result of factors outlined in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—COVID-19 Pandemic” below, including the past and potential future recommendations of authorities to defer elective procedures, historical procedure patterns have been and may continue to be disrupted.\nCustomer Support\nWe have a network of field service and technical support engineers across the U.S., Canada, Europe, and Asia and maintain relationships with various distributors around the globe. This infrastructure of service and support specialists, along with advanced service tools and solutions, offers a full complement of services for our customers, including installation, repair, maintenance, 24/7 technical support, and proactive system health monitoring. We generate service revenue by providing these services to our customers through comprehensive service contracts and time and material programs.\nResearch and Development\nWe focus our research and development efforts on innovation and improvement for products and services that align with our mission: We believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we believe that we can expand the potential of physicians to heal without constraints. We employ engineering and research and development staff to focus on delivering future innovations and sustaining improvements that advance our mission. In certain instances, we complement our research and development effort through collaborations with other companies, such as our Integrated Table Motion product offering developed with Hillrom (now a part of Baxter International Inc.).\nManufacturing\nWe manufacture our systems at our facilities in Sunnyvale, California, and Peachtree Corners, Georgia, as well as at our Joint Venture’s facility in Shanghai, China. Our instruments and accessories are produced at our facilities in Sunnyvale, California, and Mexicali, Mexico. Additionally, we have Ion-related manufacturing in Blacksburg, Virginia, and Shanghai, China, and endoscope-related manufacturing at multiple sites in Germany. We are also planning to open a new manufacturing facility in Bulgaria.\nWe purchase both custom and off-the-shelf components from a large number of suppliers and subject them to stringent quality specifications and processes. Some of the components necessary for the assembly of our products are currently provided to us by sole-sourced suppliers (the only recognized supply source available to us) or single-sourced suppliers (the only approved supply source for us among other sources). We purchase the majority of our components and major assemblies through purchase orders rather than long-term supply agreements and generally do not maintain large volumes of finished goods relative to our anticipated demand.\nCompetition\nWe face competition in the forms of existing open surgery, conventional MIS, drug therapies, radiation treatment, and other emerging diagnostic and interventional surgical approaches. Some of these procedures are widely accepted in the medical community and, in many cases, have a long history of use. Our success depends on continued clinical and technical innovation, quality, and reliability, as well as educating hospitals, surgeons, and patients on the demonstrated results associated with robotic-assisted medical procedures using da Vinci surgical systems or Ion endoluminal systems and their value relative to other techniques. We also face competition from several companies that have introduced or are developing new approaches and products for the MIS market. We believe that the entrance or emergence of competition validates MIS and robotic-assisted surgery or robotic-assisted bronchoscopy.\nMoreover, as we add new robotically controlled products (e.g., da Vinci stapling and da Vinci energy products) that compete with product offerings traditionally within the domains of open surgery and/or conventional MIS, we face greater competition from larger and well-established companies, such as Johnson & Johnson and Medtronic plc.\nAdditionally, we currently face, or anticipate facing, competition from companies with products used in open or MIS surgeries, including laparoscopy and alternative multi-port, single-port, or endoluminal systems. We also compete with companies providing other therapeutic approaches for addressing target clinical conditions, as well as companies developing diagnostic solutions that could serve as alternatives to current or planned Intuitive offerings. Companies that have introduced products in the field of robotic-assisted medical procedures, or have made explicit statements about their efforts to enter the field, include, but are not limited to, the following: Beijing Surgerii Robotics Company Limited; CMR Surgical Ltd.; Distalmotion SA; Harbin Sizhe Rui Intelligent Medical Equipment Co., Ltd.; Johnson & Johnson; Karl Storz SE & Co. KG; Medicaroid Corporation; Medtronic plc; meerecompany Inc.; Noah Medical; Shandong Weigao Group Medical Polymer Company Ltd.; Shanghai Microport Medbot (Group) Co., Ltd.; Shenzhen Edge Medical Co., Ltd.; and SS Innovations International, Inc. Other companies with substantial experience in industrial robotics could potentially expand into the field of medical robotics and become a competitor. In addition, research efforts utilizing computers and robotics for medical procedures \n14\nTable\n of Contents\nare underway at various companies and research institutions. Our revenues may be adversely impacted as our competitors announce their intent to enter our markets and as our customers anticipate the availability of competing products. We may not be able to maintain or improve our competitive position against current or potential competitors, especially those with greater resources.\nIntellectual Property\nWe place considerable importance on obtaining and maintaining patent, copyright, trademark, and trade secret protection for significant new technologies, products, and processes.\nWe generally rely upon a combination of intellectual property laws, confidentiality procedures, and contractual provisions to protect our proprietary technology. For example, we have trademarks, both registered and unregistered, that provide distinctive identification of our products in the marketplace. We also have exclusive and non-exclusive patent licenses with various third parties to supplement our own robust patent portfolio.\nAs of December 31, 2024, we owned more than 5,300 patents granted and still in force and more than 2,400 patents pending worldwide. We intend to continue filing new patent applications in the U.S. and foreign jurisdictions to seek protection for our technology. Patents have finite terms. The expiration of a patent ends the exclusive rights accorded by the patent for the invention claimed.\nGovernment Regulation\nOur products and operations are subject to regulation in the U.S. by the FDA and the State of California as well as by other countries and regions in which we market and promote our products. In addition, our products must meet the requirements of a large and growing body of international regulations and standards, which govern the design, manufacture, materials content and sourcing, testing, certification, packaging, installation, use, and disposal of our products. We must continually keep abreast of these regulations, standards, and requirements and integrate our compliance into the development and regulatory documentation for our products. Failure to meet these requirements could limit our ability to market our products in those regions that require compliance with such regulations and standards. Examples of standards to which we are subject include electrical safety standards, such as those of the International Electrotechnical Commission (e.g., IEC 60601-ss series of standards), and composition regulations, such as the Reduction of Hazardous Substances (“RoHS”) and the Waste Electrical and Electronic Equipment (“WEEE”) Directives applicable in the European Union (“EU”).\nU.S. Regulation\nFDA\nOur products are subject to regulation as medical devices in the United States under the Federal Food, Drug, and Cosmetic Act (“FFDCA”), as implemented and enforced by the FDA. The FDA regulates the development, design, non-clinical and clinical research, manufacturing, safety, efficacy, labeling, packaging, storage, installation, recordkeeping, complaint and adverse event reporting, clearance, approval, certification, promotion, marketing, export, import distribution, and service of medical devices in the U.S. to ensure that medical devices distributed domestically are safe and effective for their intended uses.\nUnder the FFDCA, medical devices are classified into one of three classes—Class I, Class II, or Class III—depending on the degree of risk associated with each medical device and the extent of control needed to ensure safety and effectiveness. Our current products are Class II medical devices.\nClass II medical devices are those that are subject to general controls, and most require premarket demonstration of adherence to certain performance standards or other special controls, as specified by the FDA, and special controls as deemed necessary by the FDA to ensure the safety and effectiveness of the device. These special controls can include performance standards, post-market surveillance, patient registries, and FDA guidance documents.\nManufacturers of most Class II devices are required to submit to the FDA a premarket notification under Section 510(k) of the FFDCA requesting authorization to commercially distribute the device. The FDA’s authorization to commercially distribute a device subject to a 510(k) premarket notification is generally known as 510(k) clearance. Our current products are subject to premarket notification and clearance under section 510(k) of the FFDCA. To obtain 510(k) clearance, we must submit to the FDA a premarket notification submission demonstrating that the proposed device is “substantially equivalent” to a legally marketed predicate device.\nThe FDA may require additional information, including clinical data, to make a determination regarding substantial equivalence. In addition, the FDA collects user fees for certain medical device submissions and annual fees for medical device establishments.\nIf the FDA agrees that the device is substantially equivalent to a predicate device, it will grant clearance to commercially market the device in the U.S. The FDA has a statutory 90-day period to respond to a 510(k) submission; however, as a practical \n15\nTable\n of Contents\nmatter, clearance often takes longer. The FDA may require further information, including clinical data, to make a determination regarding substantial equivalence. If the FDA determines that the device, or its intended use, is not “substantially equivalent,” the device may be designated as a Class III device. The device sponsor must then fulfill more rigorous PMA requirements or can request a risk-based classification determination for the device in accordance with the \nde novo\n classification pathway, which is a route to market for novel medical devices that are low to moderate risk and are not substantially equivalent to a predicate device.\nThe PMA process is more demanding than the 510(k) premarket notification process. In a PMA application, the manufacturer must demonstrate that the device is safe and effective, and the PMA application must be supported by extensive data, including data from preclinical studies and human clinical trials. The FDA, by statute and regulation, has 180 days to review a PMA application, although the review more often occurs over a significantly longer period of time and can take up to several years. In approving a PMA application or clearing a 510(k) submission, the FDA may also require some additional manufacturing controls, design control activities and approvals, as well as specific post-market surveillance requirements when necessary to protect the public health or to provide additional safety and effectiveness data for the device. In such cases, the manufacturer might be required to follow certain patient groups for a number of years and make periodic reports to the FDA on the clinical status of those patients.\nClinical trials are almost always required to support a PMA or \nde novo\n request and are sometimes required to support a 510(k) submission. All clinical investigations designed to determine the safety and effectiveness of a medical device must be conducted in accordance with the FDA’s investigational device exemption (“IDE”) regulations, which govern investigational device labeling, prohibit the promotion of the investigational device, and specify an array of recordkeeping, reporting and monitoring responsibilities of study sponsors and study investigators. Regardless of the degree of risk presented by the medical device, clinical studies must be approved by, and conducted under the oversight of, an Institutional Review Board (“IRB”) for each clinical site. During a study, the sponsor is required to comply with the applicable FDA requirements, including, for example, trial monitoring, selecting clinical investigators and providing them with the investigational plan, ensuring IRB review, adverse event reporting, record keeping, and prohibitions on the promotion of investigational devices or on making safety or effectiveness claims for them. The clinical investigators in the clinical study are also subject to the FDA’s regulations and must obtain patient informed consent, rigorously follow the investigational plan and study protocol, control the disposition of the investigational device, and comply with all reporting and recordkeeping requirements. Additionally, after a trial begins, we, the FDA, or the IRB could suspend or terminate a clinical trial at any time for various reasons, including a belief that the risks to study subjects outweigh the anticipated benefits.\nAfter a device receives 510(k) clearance, any modification that could significantly affect its safety or effectiveness, or that would constitute a major change or modification in its intended use, will require a new 510(k) clearance or, depending on the modification, PMA approval or \nde novo\n classification. The FDA requires each manufacturer to determine whether a proposed change requires submission of a 510(k), \nde novo\n classification, or a PMA or PMA supplement in the first instance, but the FDA can review any such decision and disagree with a manufacturer’s determination. If the FDA disagrees with a manufacturer’s determination, the FDA can require the manufacturer to cease marketing and/or request the recall of the modified device until it receives the appropriate marketing authorization. Also, in these circumstances, the manufacturer may be subject to significant regulatory fines or penalties.\nIn addition, the FDA may place significant limitations upon the intended use of our products as a condition of granting marketing authorization. Moreover, after a device is placed on the market, numerous FDA and other regulatory requirements continue to apply. These requirements include establishment registration and device listing with the FDA; compliance with medical device reporting regulations, which require that manufacturers report to the FDA if their device caused or contributed, or may have caused or contributed, to a death or serious injury or malfunctioned in a way that would likely cause or contribute to a death or serious injury if it were to recur; compliance with corrections and removal reporting regulations, which require that manufacturers report to the FDA field corrections and product recalls or removals if undertaken to reduce a risk to health posed by the device or to remedy a violation of the FFDCA that may present a risk to health; the FDA’s recall authority, whereby the agency can order device manufacturers to recall from the market a product that is in violation of governing laws and regulations; and post-market surveillance activities and regulations, which apply when deemed by the FDA to be necessary to protect the public health or to provide additional safety and effectiveness data for the device. In addition, the FDA and the Federal Trade Commission also regulate the advertising and promotion of our products to ensure that the claims we make are consistent with our regulatory clearances, that there is scientific data to substantiate the claims, and that our advertising is neither false nor misleading. In general, we may not promote or advertise our products for uses not within the scope of our intended use statement in our clearances or make unsupported safety and effectiveness claims. \nOur manufacturing processes are required to comply with the Quality System Regulation (“QSR”). The QSR covers, among other things, the methods used in, and the facilities and controls used for, the design, testing, controlling, documenting, manufacture, packaging, labeling, storage, installation, and servicing of all medical devices intended for human use. The QSR also requires maintenance of extensive records, which demonstrate compliance with the FDA regulation, the manufacturer’s \n16\nTable\n of Contents\nown procedures, specifications, and testing, as well as distribution and post-market experience. Compliance with the QSR is necessary for a manufacturer to be able to continue to market cleared or approved product offerings in the U.S. A company’s facilities, records, and manufacturing processes are subject to periodic scheduled or unscheduled inspections by the FDA. Failure to maintain compliance with applicable QSR requirements could result in the shut-down of, or restrictions on, manufacturing operations and the recall or seizure of marketed products. If the FDA determines that a manufacturer has failed to comply with applicable regulatory requirements, it can take a variety of compliance or enforcement actions, which may result in any of the following sanctions:\n•\nwarning letters, untitled letters, fines, injunctions, consent decrees, administrative penalties, and civil or criminal penalties;\n•\nrecalls, withdrawals, or administrative detention or seizure of our products;\n•\noperating restrictions or partial suspension or total shutdown of production;\n•\nrefusing or delaying requests for 510(k) marketing clearance or PMA approvals of new products or modified products;\n•\nwithdrawing 510(k) clearances or PMA approvals that have already been granted;\n•\nrefusal to grant export approvals for our products; or\n•\ncriminal prosecution.\nIn addition, the discovery of previously unknown problems with any marketed products, including unanticipated adverse events or adverse events of increasing severity or frequency, whether resulting from the use of the device within the scope of its clearance or off-label by a physician in the practice of medicine, could result in restrictions on the device, including the removal of the product from the market or voluntary or mandatory device recalls.\nProducts manufactured outside of the U.S. by or for us are subject to U.S. Customs and FDA inspection upon entry into the U.S. We must demonstrate compliance of such products with U.S. regulations and carefully document the eventual distribution or re-exportation of such products. Failure to comply with all applicable regulations could prevent us from having access to products or components critical to the manufacture of finished products and lead to shortages and delays.\nOther Healthcare Regulatory Laws\nWe are subject to broadly applicable fraud and abuse and other healthcare laws and regulations that may constrain the business or financial arrangements and relationships through which we research, market, sell and distribute our products. Restrictions under applicable federal and state healthcare laws and regulations, include the following:\n•\nthe federal Anti-Kickback Statute, which prohibits, among other things, individuals and entities from knowingly and willfully soliciting, offering, receiving or providing remuneration, directly or indirectly, in cash or in kind, to induce or reward, or in return for, either the referral of an individual for, or the purchase, order or recommendation of, any good or service, for which payment may be made, in whole or in part, under a federal and state healthcare program such as Medicare and Medicaid. A person or entity does not need to have actual knowledge of the statute or specific intent to violate it in order to have committed a violation;\n•\nthe federal criminal and civil false claims laws, including the federal False Claims Act, which can be enforced through civil whistleblower or qui tam actions against individuals or entities, and the Federal Civil Monetary Penalties Laws, which prohibit, among other things, knowingly presenting, or causing to be presented, to the federal government, claims for payment that are false or fraudulent, knowingly making, using or causing to be made or used, a false record or statement material to a false or fraudulent claim, or from knowingly making a false statement to avoid, decrease or conceal an obligation to pay money to the federal government. In addition, certain marketing practices, including off-label promotion, may also violate false claims laws. Moreover, the government may assert that a claim including items and services resulting from a violation of the federal Anti-Kickback Statute constitutes a false or fraudulent claim for purposes of the federal False Claims Act;\n•\nthe Health Insurance Portability and Accountability Act (“HIPAA”), which imposes criminal and civil liability, prohibits, among other things, knowingly and willfully executing, or attempting to execute a scheme to defraud any healthcare benefit program, or knowingly and willfully falsifying, concealing or covering up a material fact or making any materially false statement in connection with the delivery of or payment for healthcare benefits, items or services; similar to the federal Anti-Kickback Statute, a person or entity does not need to have actual knowledge of the statute or specific intent to violate it in order to have committed a violation;\n17\nTable\n of Contents\n•\nthe Physician Payments Sunshine Act, which requires certain manufacturers of covered drugs, devices, biologics, and medical supplies that are reimbursable under Medicare, Medicaid, or the Children’s Health Insurance Program, with certain exceptions, to report annually to the Centers for Medicare & Medicaid Services (“CMS”) information on certain payments and other transfers of value to physicians (defined to include doctors, dentists, optometrists, podiatrists, and chiropractors), teaching hospitals, and certain other health care providers (such as physician assistants and nurse practitioners), as well as ownership and investment interests held by physicians and their immediate family members; \n•\nanalogous state and foreign laws and regulations, such as state anti-kickback and false claims laws, which may apply to sales or marketing arrangements and claims involving healthcare items or services reimbursed by non-governmental third-party payors, including private insurers; and\n•\ncertain state laws that require medical device manufacturers to comply with the industry’s voluntary compliance guidelines and the relevant compliance guidance promulgated by the federal government in addition to requiring such manufacturers to report information related to payments to clinicians and other healthcare providers or marketing expenditures.\nViolations of any of these laws may result in significant penalties, including but not limited to the following: civil, criminal, and administrative penalties; damages; fines; disgorgement; imprisonment; the curtailment or restructuring of operations; loss of eligibility to obtain approvals from the FDA; exclusion from participation in government contracting, healthcare reimbursement, or other government programs, including Medicare and Medicaid; integrity oversight and reporting obligations; or reputational harm.\nForeign Regulation\nIn order for us to market our products in countries outside the United States, we must obtain regulatory approvals or certifications and comply with extensive product quality system and composition regulations in other countries. These regulations, including the requirements for approvals, clearance, or certifications and the time required for regulatory review, vary from country to country. Some countries have regulatory review processes that are substantially longer than U.S. processes. Failure to obtain regulatory approval or certification in a timely manner and meet all of the local requirements, including language and specific safety standards, in any foreign country in which we plan to market our products could prevent us from marketing products in such countries or subject us to sanctions and fines.\nChina\nChina has its own regulatory agency, the National Medical Products Administration (“NMPA”). They require regulatory approvals and compliance with extensive safety and quality system regulations. Failure to obtain regulatory approval or failure to comply with any regulation may negatively impact our ability to generate revenue and harm our business. In addition to product registration approvals, our system sales into China are also dependent on obtaining importation authorizations and provincial approvals, as well as hospitals completing a tender and hospital listing process under the authorization. In June 2023, the China National Health Commission published the 14\nth\n five-year plan quota for major medical equipment to be sold in China on its official website (the “2023 Quota”). Under the 2023 Quota, the government will allow for the sale of 559 new surgical robots into China, which could include da Vinci surgical systems as well as surgical systems introduced by others. Sales of da Vinci surgical systems under the quota are uncertain, as they are dependent on hospitals completing a tender process and receiving associated approvals.\nJapan\nMost medical devices must undergo thorough safety examinations and demonstrate medical efficacy before they receive regulatory approval to be sold in Japan. We obtained approval from the Japanese Ministry of Health, Labor, and Welfare (“MHLW”) for our da Vinci Si surgical system in October 2012, for our da Vinci Xi surgical system in March 2015, and for our da Vinci X surgical system in April 2018. In September 2022, we received regulatory clearance for the da Vinci SP surgical system in Japan for the same set of procedures as can be performed on the da Vinci Xi surgical system in Japan. We have received national reimbursement status in Japan for a number of procedures since the approval of our first da Vinci surgical system in 2012. An additional eight da Vinci procedures were granted reimbursement in April 2022, including colon resection, and an additional five da Vinci procedures were granted reimbursement in April 2024, including lobectomy for benign conditions. In addition, we received higher reimbursement for da Vinci gastrectomy procedures, as compared to open and conventional laparoscopic procedure reimbursements, and higher reimbursement for certain da Vinci rectal resection procedures, as compared to open procedure reimbursements. The additional reimbursed procedures have varying levels of conventional laparoscopic penetration and will generally be reimbursed at rates equal to the conventional laparoscopic procedures. Given the reimbursement level and laparoscopic penetration for these additional procedures, there can be no assurance that the adoption pace for these procedures will be similar to prostatectomy or partial nephrectomy, given their higher reimbursement, or any other da Vinci procedure. If these procedures are not adopted and we are not successful in obtaining adequate procedure reimbursements for additional procedures, then the demand for our products in Japan could be limited. The \n18\nTable\n of Contents\nprocess of reimbursement for new da Vinci surgical procedures in Japan is led by the surgical societies. The societies submit for reimbursement or incremental reimbursement to the MHLW for their evaluation. The decision to reimburse requires in-country clinical data and is fixed in April of even-numbered years.\nEuropean Union\nThe EU has adopted specific directives and regulations regulating the design, manufacture, clinical investigation, conformity assessment, labeling, and adverse event reporting for medical devices. Until and including May 25, 2021, medical devices were regulated by Council Directive 93/42/EEC (the “EU Medical Devices Directive” or “MDD”), which has been repealed and replaced by Regulation (EU) No 2017/745 (the “EU Medical Devices Regulation” or “MDR”). Some of our current certificates have been granted under the MDD. However, as of May 26, 2021, some of the MDR requirements apply in place of the corresponding requirements of the MDD with regard to the registration of economic operators and of devices, post-market surveillance, and vigilance.\nMedical Devices Directive\nUnder the EU Medical Devices Directive, all medical devices placed on the market in the EU must meet the essential requirements laid down in Annex I to the EU Medical Devices Directive, including the requirement that a medical device must be designed and manufactured in such a way that it will not compromise the clinical condition or safety of patients or the safety and health of users and others. In addition, the device must achieve the performance intended by the manufacturer and be designed, manufactured, and packaged in a suitable manner. The European Commission has adopted various standards applicable to medical devices. These include standards governing common requirements, such as the sterilization and safety of medical electrical equipment and product standards for certain types of medical devices. There are also harmonized standards relating to design and manufacture. While not mandatory, compliance with these standards is viewed as the easiest way to satisfy the essential requirements as a practical matter, as it creates a rebuttable presumption that the device satisfies the essential requirements.\nExcept for low-risk medical devices (Class I non-sterile, non-measuring devices), where the manufacturer can self-assess the conformity of its products with the essential requirements (except for any parts that relate to sterility or metrology), a conformity assessment procedure requires the intervention of a notified body. Notified bodies are independent organizations designated by EU member states to assess the conformity of devices before being placed on the market. A notified body would typically audit and examine a product’s technical dossiers and the manufacturer’s quality system (the notified body must presume that quality systems that implement the relevant harmonized standards, which is ISO 13485:2016 for Medical Devices Quality Management Systems, conform to these requirements). If satisfied that the relevant product conforms to the relevant essential requirements, the notified body issues a certificate of conformity, which the manufacturer uses as a basis for its own declaration of conformity. The manufacturer may then apply the European Conformity mark (“CE mark”) to the device, which allows the device to be placed on the market throughout the EU.\nThroughout the term of the certificate of conformity, the manufacturer will be subject to periodic surveillance audits to verify continued compliance with the applicable requirements. In particular, there will be a new audit by the notified body before it will renew the relevant certificate(s).\nMedical Devices Regulation\nOn April 5, 2017, the MDR was adopted with the aim of ensuring better protection of public health and patient safety. The MDR establishes a uniform, transparent, predictable, and sustainable regulatory framework across the EU for medical devices and ensures a high level of safety and health while supporting innovation. Unlike directives, regulations are directly applicable in EU member states without the need for member states to implement into national law. This aims at increasing harmonization across the EU.\nThe MDR became effective on May 26, 2021. In accordance with its recently extended transitional provisions, both (i) devices lawfully placed on the market pursuant to the MDD prior to May 26, 2021, and (ii) legacy devices lawfully placed on the EU market from May 26, 2021, in accordance with the MDR transitional provisions may generally continue to be made available on the market or put into service, provided that the requirements of the transitional provisions are fulfilled. However, even in this case, manufacturers must comply with a number of new or reinforced requirements set forth in the MDR, in particular the obligations described below.\nThe MDR requires that, before placing a device on the market, other than a custom-made device, manufacturers (as well as other economic operators, such as authorized representatives and importers) must register by submitting identification information to the European database on medical devices (EUDAMED), unless they have already registered. The information to be submitted by manufacturers (and authorized representatives) also includes the name, address, and contact details of the person or persons responsible for regulatory compliance. The MDR also requires that, before placing a device on the market, other than a custom-made device, manufacturers must assign a unique identifier to the device and provide it along with other core data to the unique device identifier (“UDI”) database. These new requirements aim at ensuring better identification and \n19\nTable\n of Contents\ntraceability of the devices. Each device – and as applicable, each package – will have a UDI composed of two parts: a device identifier (“UDI-DI”), specific to a device, and a production identifier (“UDI-PI”) to identify the unit producing the device. Manufacturers are also notably responsible for entering the necessary data on EUDAMED, which includes the UDI database, and for keeping it up to date. The obligations for registration in EUDAMED are expected to become applicable in the first fiscal quarter of 2026 (as EUDAMED is not yet fully functional). Until EUDAMED is fully functional, the corresponding provisions of the MDD continue to apply for the purpose of meeting the obligations laid down in the provisions regarding exchange of information, including, and in particular, information regarding registration of devices and economic operators.\nAll manufacturers placing medical devices on the market in the EU must comply with the EU medical device vigilance system, which has been reinforced by the MDR. Under this system, serious incidents and Field Safety Corrective Actions (“FSCAs”) must be reported to the relevant authorities of the EU member states. These reports will have to be submitted through EUDAMED (once functional) and aim to ensure that, in addition to reporting to the relevant authorities of the EU member states, other actors, such as the economic operators in the supply chain, will also be informed. Until EUDAMED is fully functional, the corresponding provisions of the MDD continue to apply. Manufacturers are required to take FSCAs, which are defined as any corrective action for technical or medical reasons to prevent or reduce a risk of a serious incident associated with the use of a medical device that is made available on the market. A serious incident is any malfunction or deterioration in the characteristics or performance of a device on the market (e.g., inadequacy in the information supplied by the manufacturer, undesirable side-effect, etc.), which, directly or indirectly, might lead to either the death or serious deterioration of the health of a patient, user, or other persons, or to a serious public health threat.\nThe EU has multiple laws and regulations related to composition of materials, their procurement practices, manufacturing, and disposal, such as the RoHS and WEEE Directives. These laws and regulations broadly cover requirements and risk related to health, safety, and the environment. The laws and regulations can impose restrictions on the use of certain substances (such as, in totality or by composition, percentage weight limits or parts per million limits) and have required reporting to the respective EU authorities, requirements around importations into the EU, requirements around recovery and disposal, as well as disclosure requirements.\nThe advertising and promotion of medical devices are subject to some general principles set forth in EU legislation. According to the MDR, only devices that are CE marked may be marketed and advertised in the EU in accordance with their intended purpose. Directive 2006/114/EC concerning misleading and comparative advertising and Directive 2005/29/EC on unfair commercial practices, while not specific to the advertising of medical devices, also apply to the advertising thereof and contain general rules, for example, requiring that advertisements are evidenced, balanced, and not misleading. Specific requirements are defined at a national level. EU member states’ laws related to the advertising and promotion of medical devices, which vary between jurisdictions, may limit or restrict the advertising and promotion of products to the general public and may impose limitations on promotional activities with healthcare professionals.\nMany EU member states have adopted specific anti-gift statutes that further limit commercial practices for medical devices, in particular vis-à-vis healthcare professionals and organizations. Additionally, there has been a recent trend of increased regulation of payments and transfers of value provided to healthcare professionals or entities and many EU member states have adopted national “Sunshine Acts,” which impose reporting and transparency requirements (often on an annual basis), similar to the requirements in the United States, on medical device manufacturers. Certain countries also mandate implementation of commercial compliance programs.\nIn the EU, regulatory authorities have the power to carry out announced and, if necessary, unannounced inspections of companies, as well as suppliers and/or sub-contractors and, where necessary, the facilities of professional users. Failure to comply with regulatory requirements (as applicable) could require time and resources to respond to the regulatory authorities’ observations and to implement corrective and preventive actions, as appropriate. Regulatory authorities have broad compliance and enforcement powers and, if such issues cannot be resolved to their satisfaction, can take a variety of actions, including untitled or warning letters, fines, consent decrees, injunctions, or civil or criminal penalties.\nThe aforementioned EU rules are generally applicable in the EEA, which consists of the 27 EU Member States as well as Iceland, Liechtenstein, and Norway.\nBrexit and the UK Regulatory Framework\nSince January 1, 2021, the Medicines and Healthcare Products Regulatory Agency (“MHRA”) has been the sovereign regulatory authority responsible for the Great Britain (i.e., England, Wales, and Scotland) medical device market. Following the end of the Brexit transitional period on January 1, 2021, new regulations require all medical devices to be registered with the MHRA before being placed on the Great Britain market. From January 1, 2022, non-UK manufacturers were required to appoint a UK Responsible Person for the purposes of registering devices placed on the Great Britain market. Under the terms of the Protocol on Ireland/Northern Ireland, the MDR applies to medical devices placed on the Northern Ireland market in the same way as it applies to medical devices marketed in the EU. In addition, the Trade Deal between the UK and the EU generally provides for cooperation and exchange of information between the parties in the areas of product safety and \n20\nTable\n of Contents\ncompliance, including market surveillance, enforcement activities and measures, standardization-related activities, exchanges of officials, and coordinated product recalls. As such, processes for compliance and reporting should reflect requirements from regulatory authorities.\nOn June 26, 2022, the MHRA published its response to a 10-week consultation on the future regulation of medical devices in the UK, and the MHRA has stated that it remains its intention to implement the proposals from such consultation through secondary legislation. In addition, on November 14, 2024, the MHRA launched a new consultation on proposals to update the regulatory framework for medical devices in Great Britain, covering four topics, namely (1) a new international reliance scheme to enable swifter market access for certain devices that have already been approved in a comparable regulator country; (2) the new UK Conformity Assessed (“UKCA”) mark and, in particular, proposals to remove the requirement to place such UKCA marking on devices; (3) conformity assessment procedures for \nin vitro\n diagnostic devices; and (4) maintaining in UK law certain pieces of “assimilated” EU law, which are due to sunset in 2025. The MHRA consultation is open until January 5, 2025, and it is expected that secondary legislation implementing the proposals will be introduced later in 2025.\nOther countries\nRegulations in other countries, including the requirements for approvals, certification, or clearance and the time required for regulatory review, vary from country to country. Certain countries, such as South Korea, Brazil, Australia, India, and Canada, have their own regulatory agencies. These countries typically require regulatory approvals and compliance with extensive safety and quality system regulations included in the MDSAP (Medical Device Single Audit Program) that we comply with every year as part of our annual audit program. Failure to obtain regulatory approval in any foreign country in which we plan to market our products, or failure to comply with any regulation in any foreign country in which we market our products may negatively impact our ability to generate revenue and harm our business.\nIn addition, local regulations may apply, which govern the use of our products and which could have an adverse effect on our product utilization if they are unfavorable. All such regulations are revised from time to time and, in general, are increasing in complexity and in the scope and degree of documentation and testing required. There can be no assurance that the outcomes from such documentation and testing will be acceptable to any particular regulatory agency or will continue to be acceptable over time. There are further regulations governing the importation, marketing, sale, distribution, use, and service as well as the removal and disposal of medical devices in the regions in which we operate and market our products. Failure to comply with any of these regulations could result in sanctions or fines and could prevent us from marketing our products in these regions.\nData Privacy and Security Laws \nNumerous state, federal, and foreign laws, regulations, and standards govern the collection, use, access to, confidentiality, and security of health-related and other personal information and could apply now or in the future to our operations or the operations of our partners. In the U.S., numerous federal and state laws and regulations, including data breach notification laws, health information privacy and security laws, and consumer protection laws and regulations govern the collection, use, disclosure, and protection of health-related and other personal information. In addition, certain foreign laws govern the privacy and security of personal data, including health-related data. Privacy and security laws, regulations, and other obligations are constantly evolving, may conflict with each other to complicate compliance efforts, and can result in investigations, proceedings, or actions that lead to significant civil and/or criminal penalties and restrictions on data processing.\nWe collect, process, share, disclose, transfer, and otherwise use data, some of which contains personal information about identifiable individuals including, but not limited to, our employees, clinical trial participants, partners, and vendors. Therefore, we are subject to U.S. (federal, state, local) and international laws and regulations, including those in the European Economic Area (“EEA”) and the United Kingdom (“UK”) regarding data privacy and security and our use of such data.\nWe are subject to the European Union General Data Protection Regulation 2016/679 and applicable national supplementing laws (collectively, the “EU GDPR”) and to the United Kingdom General Data Protection Regulation and Data Protection Act 2018 (collectively, the “UK GDPR”) (the EU GDPR and UK GDPR together referred to as the “GDPR”). The GDPR imposes comprehensive data privacy compliance obligations in relation to our collection, processing, sharing, disclosure, transfer, and other use of data relating to an identifiable living individual or “personal data,” including a principle of accountability and the obligation to demonstrate compliance through policies, procedures, training, and audit.\nThe EU GDPR and UK GDPR also regulate cross-border transfers of personal data out of the EEA and the UK. Recent legal developments in Europe have created complexity and uncertainty regarding such transfers, in particular in relation to transfers to the United States.\n21\nTable\n of Contents\nThird-Party Coverage and Payment\nOur customers, including physicians, hospitals, and outpatient facilities, typically bill third-party payors for the costs and fees associated with the procedures in which our products are used. In the U.S., in order to receive payment for the procedures performed using our products, our customers must report codes that describe the services or products furnished and determine the medical necessity of the service or whether the service is included in the payors’ policy. In the U.S. and most markets globally where we sell our products, payment for medical services and surgical procedures to hospitals, outpatient facilities, and surgeons (collectively “providers”) is determined by the government, commercial payors (insurers), or both.\nIn the U.S., the CMS and its fiscal intermediaries (Medicare Administrative Contractors) and state Medicaid programs establish reimbursement policies for medical and surgical services at the state and federal level for the Medicare and Medicaid programs. Third-party payors often rely upon Medicare coverage policy and payment limitations in setting their own coverage and payment policies but also have their own methods and approval processes. Commercial payors in non-capitated contracts commonly establish payment to providers based on a percentage of the Medicare payment rate.\nPhysicians and outpatient facilities bill for medical and surgical services by reporting a combination of billing codes. Current Procedural Terminology (“CPT”) codes are created by the American Medical Association (“AMA”) with input from CMS and commercial payors to describe medical and surgical procedures. CPT codes currently exist for minimally invasive surgical procedures, which may involve the da Vinci surgical system, as well as for robotic-assisted bronchoscopy, which may involve the Ion endoluminal system. In general, the majority of payors, including Medicare, consider robotic assistance as a tool used to perform the procedure and do not pay providers more for a procedure that involves robotic assistance using the da Vinci, Ion, or any other robotic system. Because there is often no separate payment for the use of our products, the additional cost associated with the use of our products can affect the profit margin of the hospital or surgery center where the procedure is performed. If hospitals do not obtain sufficient payment from third-party payors for procedures performed with our products or if governmental and private payors’ policies do not cover surgical procedures performed using our products, hospital adoption or utilization of our products could be negatively impacted, and we may not be able to generate the revenue necessary to support our business.\nHospitals bill for inpatient services by reporting ICD-10-PCS codes. CMS is primarily responsible for overseeing changes and modifications to ICD-10-PCS codes. Medicare payments to hospitals for services provided during an inpatient stay are based on the Inpatient Prospective Payment System (“IPPS”). Under the IPPS, each patient discharge is categorized into a Medicare Severity Adjusted Diagnosis-Related Group (“MS-DRG” or “DRG”). Each DRG has an assigned payment weight based on the average resources used for Medicare patients in that DRG, taking into account the patient’s principal diagnosis, surgical procedures, age, discharge status, and additional or secondary diagnoses, among other things. The DRG is a single, bundled payment intended to cover all costs associated with the inpatient admission.\nThe use of robotic technology does not influence the MS-DRG assignment or payment for an inpatient admission related to a surgical procedure. CMS annually updates hospital inpatient and outpatient payments based on hospitals’ charge data. Hospital inpatient and outpatient payments are also adjusted based on whether the hospital is a teaching hospital, its geographic location, and any failures to meet certain quality metrics, among other factors.\nCommercial payors commonly establish inpatient facility payment for providers using published Medicare DRG rates as a benchmark. In some uncommon cases, commercial payors pay for inpatient hospital admissions on a per diem basis. Commercial payment to providers varies depending on the procedure performed, geographic location, contractual allowances, and other factors.\nMedicare and commercial payor payments to facilities for medical and surgical services may not always fully reimburse providers for all costs associated with furnishing these procedures. If payment is insufficient for procedures involving our technology, hospitals and physicians may decide not to use our products.\nIn countries outside of the U.S., payment for surgical services to physicians and facilities differs considerably and varies by country. In some markets, there is a single public payor who provides a global annual budget to hospitals to provide all care to the population served in a designated geographic area. In other markets, private insurance can be purchased or is provided by employers to supplement public health insurance. In some countries, patients may be permitted to pay directly for surgical services; however, such “co-pay” practices are not common (or allowed) in many countries. Further, in many global markets, access to procedures and technology is governed or heavily influenced by Health Technology Assessment (“HTA”) organizations, which conduct periodic and extensive evidence-based reviews of the clinical value and cost effectiveness of a new technology. To effectively conduct our business, we may need to seek OUS reimbursement approvals, and we do not know if these required approvals will be obtained in a timely manner or at all. In addition, in some markets, HTA organizations may publish reports with mixed conclusions about the clinical and economic value of our products to the population. Such reviews could negatively impact hospital adoption of our technology.\n22\nTable\n of Contents\nHealthcare Reform\nIn the U.S., there have been, and continue to be, legislative initiatives designed to contain healthcare costs. In March 2010, the Patient Protection and Affordable Care Act, as amended by the Health Care and Education Reconciliation Act (collectively, the “ACA”), was enacted. The ACA made changes that have significantly impacted healthcare providers, insurers, pharmaceutical companies, and medical device manufacturers. The ACA contained provisions designed to generate the revenues necessary to fund health insurance coverage expansion and appropriated funding to research the comparative effectiveness of healthcare treatments and strategies. To date, this research has had a negligible effect on Medicare coverage and reimbursement decisions as well as influence on other third-party payor coverage and reimbursement policies.\nSince its enactment, there have been judicial, executive, and Congressional challenges to certain aspects of the ACA. On June 17, 2021, the U.S. Supreme Court dismissed the most recent judicial challenge to the ACA brought by several states without specifically ruling on the constitutionality of the ACA. Thus, the ACA remained in effect in its current form.\nIn addition, other legislative changes have been proposed and adopted since the ACA became law. These changes included an aggregate reduction in Medicare payments, which went into effect on April 1, 2013, and will remain in effect through 2032, unless additional Congressional action is taken, with the exception of a temporary suspension due to the COVID-19 pandemic from May 1, 2020, through March 31, 2022. Individual states in the U.S. have also become increasingly aggressive in passing legislation and implementing regulations designed to control product pricing, including price or patient reimbursement constraints and discounts, and require marketing cost disclosure and transparency measures.\nIn the U.S. and abroad, reimbursement is dynamic and subject to change annually by public and private payors. Congress and government agencies may also intervene and pass legislation that is intended to reduce healthcare spending, which could impact market access. Such legislative interventions can vacillate significantly based on government leadership. Other federal or state healthcare reform measures that may be adopted in the future could have a material adverse effect on our business. Any regulatory or legislative developments in domestic or foreign markets that eliminate or reduce reimbursement rates for procedures performed with our products could harm our ability to sell our products or cause downward pressure on the prices of our products, either of which would adversely affect our business, financial condition, and results of business operations.\nSimilar reform measures may be adopted in foreign jurisdictions. For instance, on December 13, 2021, the EU Regulation No 2021/2282 on HTA, amending Directive 2011/24/EU, was adopted. While the Regulation entered into force in January 2022, it will only begin to apply from January 2025 onwards, with preparatory and implementation-related steps to take place in the interim. Once applicable, it will have a phased implementation depending on the concerned products. This Regulation intends to boost cooperation among EU member states in assessing health technologies, including certain high-risk medical devices, and provide the basis for cooperation at the EU level for joint clinical assessments in these areas. It will permit EU member states to use common HTA tools, methodologies, and procedures across the EU, working together in four main areas, including joint clinical assessment of the innovative health technologies with the highest potential impact for patients, joint scientific consultations whereby developers can seek advice from HTA authorities, identification of emerging health technologies to identify promising technologies early, and continuing voluntary cooperation in other areas. Individual EU member states will continue to be responsible for assessing non-clinical (e.g., economic, social, and ethical) aspects of health technology and making decisions on pricing and reimbursement.\nHuman Capital\nDelivering on our mission depends on our ability to attract, engage, retain, and further develop top talent around the globe. We strive to enable this by making Intuitive an inclusive, diverse, and safe workplace with opportunities for our employees to grow and develop in their careers. Intuitive provides competitive compensation, benefits, and programs that encourage employee health and wellness as well as foster connections between our employees, the communities, and the customers we serve.\nAs of December 31, 2024, we had approximately 15,638 full-time employees, with approximately 2,076 in research and development, 7,057 in manufacturing operations, 4,413 in commercial and service operations, and 2,092 in administrative activities. During 2024, the number of employees increased by approximately 1,962. Our employees are based in 29 different countries around the world. Our global workforce consists of a diverse range of highly skilled talent. During 2024, our turnover rate was approximately 8.9%.\nInclusion and Diversity\nIntuitive’s inclusion and diversity (“I&D”) mission is to work to build an environment where every individual can belong and flourish – in our company and the communities we serve.\nWe believe that everyone should feel included and fairly treated, and we embrace the unique qualities that make people who they are. This includes all genders and gender identities, races, ethnicities, ages, national origins, native languages, \n23\nTable\n of Contents\ndisabilities, sexual orientations, body sizes, military backgrounds, cognitive styles, socioeconomic backgrounds, religions, and family structures. We believe in seeking the difference to propel innovation and creativity forward.\nWe have a four-part strategy to guide our I&D efforts: ensuring an inclusive experience, where employees from all backgrounds feel welcome, supported, and valued; building a diverse workforce to fuel innovation and better mirror the customers and patients we serve; continuously investing in and enhancing the fairness of our people practices and sharing progress; and strengthening industry engagement through collaboration with our customers, the broader healthcare community, and shareholders. We aim to pursue this strategy through various initiatives, including assessing our efforts through a compliance lens; our policies prohibit unlawful discrimination against individuals on the basis of any protected characteristic.\nDetails of our employee workforce composition, including a link to our Employer Information Report (“EEO-1”) submission to the U.S. Equal Employment Opportunity Commission (“EEOC”), are available on our website. Although we reference the availability of our EEO-1 on our website in this Annual Report on Form 10-K, our EEO-1 and any other materials on our website are not incorporated by reference into this Annual Report on Form 10-K or any of our other filings under the Securities Act of 1933, as amended, or the Exchange Act. While matters discussed in such EEO-1 and other website materials may be significant, any significance should not be read as necessarily rising to the level of materiality used for the purposes of our compliance with the U.S. federal securities laws, even if we use the word “material” or “materiality” in such materials.\nFrom a governance perspective, maintaining a mix of backgrounds and experience in our Board composition is essential to being able to understand, represent, and reflect the needs of our diverse stakeholders. Currently, five of our 12 Board members (42%) are women, and five of our 12 board members (42%) self-identify as individuals from underrepresented communities (defined as an individual who self-identifies as Black, African American, Hispanic, Latino, Asian, Pacific Islander, Native American, Native Hawaiian, or Alaska Native, or LGBTQ+).\nHealth, Safety, and Wellness\nThe health, safety, and wellness of our employees is a priority in which we continue to invest and expand. We provide our employees and their families with access to a variety of innovative, flexible, and convenient health and wellness programs. Program benefits are intended to provide protection, peace of mind, and security, including workplace health and safety best practices integrated into everyday activities and programs that support employee time away from work, family care, mental health, or financial well-being.\nWe continue to evolve our programs in an effort to respond to the interests of our changing workforce, as well as the communities in which we operate, in compliance with government regulations. Each Intuitive location manages overall safety with guidance based on regional, country, and local regulations and best practices.\nCompensation and Benefits\nWe provide compensation and benefits programs to help meet the needs of our employees. In addition to base compensation, these programs, which vary by country and region, include short-term incentives in the form of annual bonuses and commissions, long-term incentives in the form of stock or cash-based awards, an Employee Stock Purchase Plan, retirement savings plans, healthcare, income protection benefits, paid time off, family leave, family care resources, and flexible work schedules, among many others.\nWe aim to support fair and equitable pay for our employees. Our executive team and Board strongly support this effort. We regularly review pay for internal equity, including with regard to race/ethnicity and gender, and to assess the appropriateness of our compensation structure. We also engage outside counsel to assess compliance with pay equity laws. When we identify potential differences in pay, we research those differences and take actions to resolve them if we deem appropriate.\nIn 2024, we conducted a full pay equity audit for our full-time U.S. workforce, adjusting for job role and location among other factors. Evaluating total target cash compensation, our audit found that our adjusted pay gap relative to self-identified gender was women earn 99.5% of men and our adjusted pay gap relative to U.S. self-identified race/ethnicity was employees of color earn 100.0% of white employees. We are proud to have strong pay practices and policies in place that have helped us to achieve this level of pay equity.\nEmployees are encouraged to share any pay equity concerns with management, Human Resources, or confidentially through our reporting hotline, including anonymously. Intuitive has a non-retaliation policy for raising any workplace concerns in good faith, including around pay.\nTalent Development\nAt Intuitive, we believe that all employees have the potential to grow. To support this growth, we offer a diverse range of development opportunities designed to help employees acquire and apply new technical, functional, and leadership skills.\n24\nTable\n of Contents\nEmployee development at Intuitive commences from the first day and includes comprehensive onboarding programs that teach about our business, our culture, and the skills needed to successfully perform at Intuitive. Subsequently, employees have access to a variety of online learning courses, as well as classroom and cohort-based programs.\nFor people leaders, we provide a 12-month, blended learning curriculum, called the Manager Acceleration Program (“MAP”). MAP is delivered globally and aims to teach our people leaders what it takes to successfully lead and manage at Intuitive. The program covers key leadership expectations as well as fundamental leadership skills. Additional virtual, instructor-led workshops provide timely classes aimed at assisting leaders with important employee processes, such as performance and compensation conversations.\nFurthermore, our talent development initiatives include various team effectiveness assessments and solutions tailored to meet the needs of our growing global teams. These solutions range from cross-cultural dexterity programs to assessing and leveraging individual and team strengths. We gather feedback from our teams annually through our Employee Experience survey, holding leaders accountable for taking action based on the feedback received. In 2024, Intuitive achieved a 92% employee engagement score, signaling a strong employee commitment to our mission and the work we do each day.\nCommunity Programs\nWe believe that building connections between our employees, their families, and our communities creates a more meaningful, fulfilling, and enjoyable workplace. Through our engagement programs, our employees can pursue their interests and hobbies, connect to volunteering and giving opportunities, and enjoy unique recreational experiences with family members.\nThe Intuitive Foundation is a nonprofit organization established in 2018 and funded by Intuitive. Since its founding, the Intuitive Foundation has been dedicated to promoting health, advancing education, and reducing human suffering. The Foundation supports outreach programs financially while we provide the volunteers and mentors from within our company. Since its inception, we have contributed $170 million to the Intuitive Foundation to fulfill its mission.\nWe encourage you to review our 2024 Environmental, Social, and Governance (“ESG”) Report (to be made available in the “About Us — Investors” section of our website at https://isrg.intuitive.com) for more detailed information regarding our Human Capital programs and initiatives. Although we reference our ESG Report in this report, the ESG report and any other materials on our corporate website are not incorporated by reference into this Annual Report or any other filing of the Company under the Securities Act of 1933, as amended, or the Exchange Act. While matters discussed in such ESG Report and website materials may be significant, any significance should not be read as necessarily rising to the level of materiality used for the purposes of our compliance with the U.S. federal securities laws, even if we use the word “material” or “materiality” in such materials.\nGeneral\nWe make our periodic and current reports, including our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to those reports, available free of charge on our website as soon as practicable after such material is electronically filed or furnished with the Securities and Exchange Commission (the “SEC”). Our website address is \nwww.intuitive.com\n, and the reports are filed under “SEC Filings” on the Company — Investor Relations portion of our website. Periodically, we webcast Company announcements, product launch events, and executive presentations, which can be viewed via our Investor Relations page on our website. In addition, we provide notifications of our material news, including SEC filings, investor events, and press releases as part of our Investor Relations page on our website. The contents of our website are not intended to be incorporated by reference into this report or in any other report or document we file, and any references to our website are intended to be inactive textual references only. The SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at \nwww.sec.gov\n. The contents of these websites are not incorporated into this filing. Further, references to the URLs for these websites are intended to be inactive textual references only.\nWe operate our business as one segment, as defined by U.S. generally accepted accounting principles. Our financial results for the years ended December 31, 2024, 2023, and 2022 are discussed in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Item 8. Financial Statements and Supplementary Data” of this Annual Report.\nIntuitive Surgical, Inc. was founded in 1995. We are a Delaware corporation with our principal executive offices located at 1020 Kifer Road, Sunnyvale, California 94086. Our telephone number is (408) 523-2100, and our website address is \nwww.intuitive.com\n.\n25\nTable\n of Contents",
  "item7": "ITEM 7.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nOpen surgery remains a prevalent form of surgery and is used in almost every area of the body. However, the large incisions required for open surgery create trauma to patients, typically resulting in longer hospitalization and recovery times, increased hospitalization costs, and additional pain and suffering relative to minimally invasive surgery, where MIS is available. For over four decades, MIS has reduced trauma to patients by allowing selected surgeries to be performed through small ports rather than large incisions. MIS has been widely adopted for certain surgical procedures.\nDa Vinci surgical systems enable surgeons to extend the benefits of MIS to many patients who would otherwise undergo a more invasive surgery by using computational, robotic, and imaging technologies to overcome many of the limitations of traditional open surgery or conventional MIS. Surgeons using a da Vinci surgical system operate while seated comfortably at a console viewing a 3D, high-definition image of the surgical field. This immersive console connects surgeons to the surgical field and their instruments. While seated at the console, the surgeon manipulates instrument controls in a natural manner, similar to open surgical technique. Our technology is designed to provide surgeons with a range of articulation of the surgical instruments used in the surgical field analogous to the motions of a human wrist, while filtering out the tremor inherent in a surgeon’s hand. In designing our products, we focus on making our technology easy and safe to use.\nOur da Vinci products fall into five broad categories: da Vinci surgical systems, da Vinci instruments and accessories, da Vinci stapling, da Vinci energy, and da Vinci vision, including Firefly fluorescence imaging systems and da Vinci endoscopes. We provide a comprehensive suite of systems, learning, and services offerings. Digitally enabled for nearly three decades, these three offerings aim to decrease variability by providing dependable, consistent functionality and an integrated user experience. Our systems category includes robotic platforms, software, vision, energy, and instruments and accessories. Our learning category includes learning and enabling technology, such as simulation and telepresence, as well as technical training programs and personalized peer-to-peer learning opportunities. We have a global network of field service engineers and distributors through which we deliver a suite of services, including installation, repair, maintenance, around-the-clock technical support, and system monitoring. We also offer customized analytics and consultation to hospitals for program optimization.\nWe have commercialized the following da Vinci surgical systems: the da Vinci standard surgical system in 1999, the da Vinci S surgical system in 2006, the da Vinci Si surgical system in 2009, the fourth-generation da Vinci Xi surgical system in 2014, and the fifth-generation da Vinci 5 surgical system in 2024. We extended our fourth-generation platform by adding the da Vinci X surgical system, commercialized in 2017, and the da Vinci SP surgical system, commercialized in 2018. The da Vinci SP surgical system accesses the body through a single incision, while the other da Vinci surgical systems access the body through multiple incisions. All da Vinci systems include a surgeon’s console (or consoles), imaging electronics, a patient-side cart, and computational hardware and software.\nWe are in the early stages of launching our da Vinci SP surgical system, and we have an installed base of 273 da Vinci SP surgical systems as of December 31, 2024. We have received FDA clearance for the da Vinci SP surgical system for urologic, colorectal, general thoracoscopic, and certain transoral procedures. Additionally, the da Vinci SP surgical system has received regulatory clearance in South Korea for a broad set of procedures. The da Vinci SP surgical system has also received regulatory clearance in Japan for the same set of procedures that are currently allowed with the da Vinci Xi surgical system in Japan. In January 2024, the da Vinci SP surgical system received European certification in accordance with Regulation (EU) 2017/745 of the European Parliament and of the Council of 5 April 2017 on medical devices (the “EU MDR”) for use in endoscopic abdominopelvic, thoracoscopic, transoral otolaryngology, transanal colorectal, and breast surgical procedures, and we are commercializing the da Vinci SP surgical system in select major European countries as part of a measured rollout strategy. In August 2024, we obtained regulatory clearance in Taiwan for our da Vinci SP surgical system for use in endoscopic abdominopelvic, thoracoscopic, transoral otolaryngology, transanal colorectal, transanal total mesorectal excision, and breast surgical procedures. We plan to seek FDA clearances for additional indications for the da Vinci SP surgical system and expand the system’s regulatory approvals (including for additional indications) in other OUS markets over time. The success of the da Vinci SP surgical system is dependent on positive experiences and improved clinical outcomes for the procedures for which it has been cleared as well as securing additional clinical clearances.\nIn March 2024, we obtained FDA clearance for our da Vinci 5 surgical system, our next-generation multi-port robotic system, for use in all surgical specialties and procedures indicated for da Vinci Xi, except for cardiac and pediatric indications. In October 2024, we obtained regulatory clearance in South Korea for the da Vinci 5 surgical system for use in urologic, general, gynecologic, thoracoscopic, thoracoscopically-assisted cardiotomy, and transoral otolaryngology surgical procedures. We are in the early stages of launching da Vinci 5, and we have an installed base of 362 da Vinci 5 surgical systems as of December 31, 2024. We are in the midst of a phased launch over several quarters, giving us time to mature our supply and manufacturing processes for the new system. Additionally, we are in the regulatory process in Japan and Europe for da Vinci 5.\n61\nTable\n of Contents\nWe offer approximately 70 different multi-port da Vinci instruments to provide surgeons with flexibility in choosing the types of tools needed to perform a particular surgery. These multi-port instruments are generally robotically controlled and provide end effectors (tips) that are similar to those used in either open or laparoscopic surgery. We offer advanced instrumentation for the da Vinci 5, da Vinci X, and da Vinci Xi surgical systems, including da Vinci energy and da Vinci stapler products, to provide surgeons with sophisticated, computer-aided tools to precisely and efficiently interact with tissue. The da Vinci 5, da Vinci X, and da Vinci Xi surgical systems generally share the same instruments, whereas the da Vinci Si surgical system uses instruments that are not compatible with the da Vinci 5, da Vinci X, and da Vinci Xi systems. Additionally, we have introduced a unique set of force feedback instruments that are only compatible with our da Vinci 5 surgical system. We also currently offer nine core instruments on our da Vinci SP surgical system. We plan to expand our da Vinci SP instrument offering over time.\nOur learning and enabling technology offerings facilitate access to education and training on our products. Our enabling technologies include telepresence and Advanced Insights Suite (which includes Case Insights and Insights Engine), and our learning technology solutions include Intuitive Learning, SimNow, customized training models, remote case observations, and remote proctoring.\nIn 2019, we commercialized our Ion endoluminal system, which is a flexible, robotic-assisted, catheter-based platform that utilizes instruments and accessories for which the first cleared indication is minimally invasive biopsies in the lung. Our Ion system extends our commercial offering beyond surgery into diagnostic, endoluminal procedures. The system features an ultra-thin, ultra-maneuverable catheter that can articulate 180 degrees in all directions and allows navigation far into the peripheral lung and provides the stability necessary for precision in a biopsy. Many suspicious lesions found in the lung may be small and difficult to access, which can make diagnosis challenging, and Ion helps physicians obtain tissue samples from deep within the lung, which could help enable earlier diagnosis. Our Ion endoluminal system has received FDA clearance, and OUS regulatory clearances include European certification in accordance with the EU MDR, regulatory clearance in South Korea, and NMPA regulatory clearance in China. We plan to seek additional clearances, approvals, and certifications for our Ion endoluminal system in OUS markets over time.\nThe success of new product introductions depends on a number of factors including, but not limited to, pricing, competition, geographic market and consumer acceptance, the effective forecasting and management of product demand, inventory levels, the management of manufacturing and supply costs, and the risk that new products may have quality or other defects in the early stages of introduction.\nMacroeconomic Environment\nOur future results of operations and liquidity could be materially adversely affected by uncertainty surrounding macroeconomic and geopolitical factors in the U.S. and globally characterized by the supply chain environment, inflationary pressure, elevated interest rates, disruptions in the commodities’ markets as a result of the conflict between Russia and Ukraine and conflicts in the Middle East, including Israel and Iran, and the introduction of or changes in tariffs or trade barriers.\nSupply chain constraints have generally improved to pre-COVID-19 pandemic levels, with some isolated residual stresses, particularly for engineered raw materials and at certain subcontract suppliers that are operationally challenged to meet our production requirements. These isolated instances did not have a material impact during 2024. Additionally, material and labor prices to produce some components remain elevated from historical levels due to market dynamics, demand mix, or general cost inflation within the supply chain. With elevated interest rates, access to credit is more difficult, and any insolvency of certain suppliers, including sole- and single-sourced suppliers, may have heightened continuity risks. Incidents of cybersecurity breaches, which have not significantly impacted our supply chain to date, also remain an active threat to sustained supply continuity. We are actively engaged in activities that seek to mitigate the impact of any supply chain risks and disruptions on our operations.\nSome hospitals continue to experience challenges with staffing and cost pressures that could affect their ability to provide patient care. Additionally, certain hospitals are facing significant financial pressure as supply chain constraints and inflation have driven up operating costs and elevated interest rates have made access to credit more expensive. Hospitals may also be adversely affected by the liquidity concerns as a result of the broader macroeconomic environment. Any or all of these factors could negatively impact the number of da Vinci procedures performed or surgical systems placed and have a material adverse effect on our business, financial condition, or results of operations.\nCOVID-19 Pandemic\nCOVID-19 has had a negative impact on our procedure volumes during periods with COVID-19 outbreaks due to patient delays in both the diagnosis and treatment of diseases. While such delays have negatively impacted our procedure volumes in periods with COVID-19 outbreaks, we believe that these delays have also resulted in increased procedure volumes during those periods following such outbreaks, due to the treatment of patients in backlogs that were created during the COVID-19 outbreak.\n62\nTable\n of Contents\nIn the first fiscal quarter of 2023, COVID-19 resurgences in China negatively impacted our procedure volumes in the region. However, as infections and hospitalization decreased, our procedure volumes recovered. We did not experience significant procedure volume disruptions due to COVID-19 outbreaks in any of our geographic markets during the remainder of 2023. Instead, throughout 2023, we saw a positive impact on procedure volumes and believe that such positive impacts were partially attributable to patients who had deferred treatment returning for diagnosis and treatment.\nDuring 2024, we did not experience noticeable procedure volume disruptions due to COVID-19. We also believe that a large portion of the patients in the backlog that required treatment during the COVID-19 pandemic have now been treated. Therefore, we believe that the impact of patient backlogs was less significant on procedure volumes in 2024 than what was experienced in 2023.\nBusiness Model\nOverview\nWe generate up-front revenue from the placement of da Vinci surgical systems through sales or sales-type lease arrangements and recurring revenue over time through fixed-payment or usage-based operating lease arrangements. We also earn recurring revenue from the sales of instruments, accessories, and services.\nThe da Vinci surgical system generally sells for between $0.7 million and $3.1 million, depending on the model, configuration, and geography, and represents a significant capital equipment investment for our customers when purchased. Our instruments and accessories have limited lives and will either expire or wear out as they are used in surgery, at which point they need to be replaced. We generally earn between $800 and $3,600 of instruments and accessories revenue per surgical procedure performed, depending on the type and complexity of the specific procedures performed and the number and type of instruments used. We typically enter into service contracts at the time systems are sold or leased at an annual fee between $100,000 and $225,000, depending on the configuration of the underlying system and the composition of the services offered under the contract. Our system sale arrangements generally include a five-year period of service, with the first year of service provided for free. These service contracts have generally been renewed at the end of the initial contractual service periods.\nWe generate revenue from our Ion endoluminal system in a business model consistent with the da Vinci surgical system model described above. We generate up-front revenue from the placement of Ion systems through sales or sales-type lease arrangements and recurring revenue over time through fixed-payment or usage-based operating lease arrangements. We also earn recurring revenue from the sales of instruments, accessories, and services. The Ion endoluminal system generally sells for between $500,000 and $815,000. Our instruments and accessories have limited lives and will either expire or wear out as they are used in procedures, at which point they need to be replaced. We typically enter into service contracts at the time systems are sold or leased at an annual fee between $55,000 and $80,000.\nAdditionally, as part of our ecosystem of products and services, we provide a portfolio of learning offerings and digital solutions. We do not currently generate material revenue from these offerings.\nRecurring Revenue\nRecurring revenue consists of instruments and accessories revenue, service revenue, and operating lease revenue. Recurring revenue increased to $7.04 billion, or 84% of total revenue in 2024, compared to $5.94 billion, or 83% of total revenue in 2023, and $4.92 billion, or 79% of total revenue in 2022.\nInstruments and accessories revenue has grown at a faster rate than systems revenue over time. Instruments and accessories revenue increased to $5.08 billion in 2024, compared to $4.28 billion in 2023 and $3.52 billion in 2022. The increase in instruments and accessories revenue largely reflects continued procedure adoption.\nService revenue was $1.31 billion in 2024, compared to $1.17 billion in 2023 and $1.02 billion in 2022. The increase in service revenue was primarily driven by the growth of the base of installed da Vinci surgical systems producing service revenue. The installed base of da Vinci surgical systems grew 15% to approximately 9,902 as of December 31, 2024; 14% to approximately 8,606 as of December 31, 2023; and 12% to approximately 7,544 as of December 31, 2022.\nWe use the installed base, number of placements, and utilization of systems as metrics for financial and operational decision-making and as a means to evaluate period-to-period comparisons. Management believes that the installed base, number of placements, and utilization of systems provide meaningful supplemental information regarding our performance, as management believes that the installed base, number of placements, and utilization of systems are indicators of the rate of adoption of our robotic-assisted medical procedures as well as an indicator of future recurring revenue. Management believes that both it and investors benefit from referring to the installed base, number of placements, and utilization of systems in assessing our performance and when planning, forecasting, and analyzing future periods. The installed base, number of placements, and utilization of systems also facilitate management’s internal comparisons of our historical performance. We believe that the installed base, number of placements, and utilization of systems are useful to investors as metrics, because (1) \n63\nTable\n of Contents\nthey allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making, and (2) they are used by institutional investors and the analyst community to help them analyze the performance of our business. The vast majority of our installed systems are connected via the internet. System logs can also be accessed by field engineers for systems that are not connected to the internet. We utilize this information as well as other information from agreements and discussions with our customers that involve estimates and judgments, which are, by their nature, subject to substantial uncertainties and assumptions. Estimates and judgments for determining the installed base, number of placements, and utilization of systems may be impacted over time by various factors, including system internet connectivity, hospital and distributor reporting behavior, and inherent complexities in new agreements. Such estimates and judgments are also susceptible to technical errors. In addition, the relationship between the installed base, number of placements, and utilization of systems and our revenues may fluctuate from period to period, and growth in the installed base, number of placements, and utilization of systems may not correspond to an increase in revenue. The installed base, number of placements, and utilization of systems are not intended to be considered in isolation or as a substitute for, or superior to, revenue or other financial information prepared and presented in accordance with U.S. generally accepted accounting principles (“GAAP”).\nIntuitive System Leasing\nSince 2013, we have entered into sales-type and fixed-payment operating lease arrangements directly with certain qualified customers as a way to offer customers flexibility in how they acquire systems and expand their robotic-assisted programs while leveraging our balance sheet. These leases generally have commercially competitive terms as compared to other third-party entities that offer equipment leasing. We also enter into usage-based operating lease arrangements with qualified customers that have committed da Vinci programs where we charge for the system and service as procedures are performed, offering greater predictability in costs for customers. We believe that all of these alternative financing structures have been effective and well-received, and we are willing to expand the proportion of any of these structures based on customer needs and demand.\nWe include systems placed under fixed-payment and usage-based operating lease arrangements, as well as sales-type lease arrangements, in our system placement and installed base disclosures. We exclude operating lease-related revenue, including usage-based revenue, and Ion system revenue from our da Vinci surgical system average selling price (“ASP”) computations.\nThe following table summarizes our system placements under leasing arrangements for the years ended December 31, 2024, 2023, and 2022:\nYear Ended December 31,\n2024\n2023\n2022\nDa Vinci System Placements Under Leasing Arrangements\nFixed-payment operating lease arrangements\n309 \n304 \n276 \nUsage-based operating lease arrangements\n467 \n355 \n216 \nTotal da Vinci system placements under operating lease arrangements\n776 \n659 \n492 \n% of Total da Vinci system placements\n51 \n%\n48 \n%\n39 \n%\nSales-type lease arrangements\n88 \n45 \n99 \nTotal da Vinci system placements under leasing arrangements\n864 \n704 \n591 \nIon System Placements Under Leasing Arrangements\nFixed-payment operating lease arrangements\n85 \n63 \n61 \nUsage-based operating lease arrangements\n68 \n54 \n40 \nTotal Ion system placements under operating lease arrangements\n153 \n117 \n101 \n% of Total Ion system placements\n56 \n%\n55 \n%\n53 \n%\nSales-type lease arrangements\n4 \n5 \n11 \nTotal Ion system placements under leasing arrangements\n157 \n122 \n112 \nVariable lease revenue recognized from usage-based operating lease arrangements has been included in our operating lease metrics herein. Operating lease revenue has grown at a faster rate than overall systems revenue and was $654 million, $501 million, and $377 million for the years ended December 31, 2024, 2023, and 2022, respectively, of which $338 million, $217 million, and $133 million, respectively, was variable lease revenue related to our usage-based operating lease arrangements.\nRevenue for systems sold or placed under a sales-type lease arrangement is recognized upfront whereas revenue for fixed-payment operating lease arrangements is recognized on a straight-line basis over time. Therefore, in a period when the number of operating lease placements increases as a proportion of total system placements, total systems revenue is reduced, which can create volatility in the systems revenue recognized in any given period. We generally set fixed-payment and usage-based \n64\nTable\n of Contents\noperating lease arrangements’ pricing at a modest premium relative to purchased systems reflecting the time value of money and, in the case of usage-based operating lease arrangements, the risk that system utilization may fall short of anticipated levels.\nRevenue for usage-based operating lease arrangements is recognized as the system is used to perform procedures. Variable usage-based arrangements create better matching of reimbursements and cost for our customers. They also reduce our customers’ overall risk and need for capital outlay. However, because the number of procedures performed in any given period can vary significantly for many reasons, including but not limited to healthcare emergencies, alternative treatment options, and patient preferences, revenue recognized from these arrangements can be highly volatile.\nCustomers generally do not have the right to exit or terminate a fixed-payment lease without incurring a penalty. Generally, lease transactions generate similar gross profit margins as our sale transactions. However, because of the variability in revenue recognized for usage-based lease arrangements, including our customers’ ability to exit or cancel those arrangements prior to the end of the lease term, there is no guarantee that we will recuperate the cost of the leased system, which, in turn, could adversely impact our gross profit margins if utilization of those systems are different than our expectations.\nThe following table summarizes our systems installed at customers under operating leasing arrangements for the years ended December 31, 2024, 2023, and 2022:\nYear Ended December 31,\n2024\n2023\n2022\nDa Vinci System Installed Base under Operating Leasing Arrangements\nFixed-payment operating lease arrangements\n1,307 \n1,204 \n1,018 \nUsage-based operating lease arrangements\n1,492 \n1,023 \n665 \nTotal da Vinci system installed base under operating lease arrangements\n2,799 \n2,227 \n1,683 \nIon System Installed Base under Operating Leasing Arrangements\nFixed-payment operating lease arrangements\n126 \n96 \n72 \nUsage-based operating lease arrangements\n193 \n118 \n60 \nTotal Ion system installed base under operating lease arrangements\n319 \n214 \n132 \nOur exposure to the credit risks relating to our lease financing arrangements may increase if our customers are adversely affected by economic pressures or uncertainty, changes in healthcare laws, coverage and reimbursement, or other customer-specific factors. As a result of these macroeconomic factors impacting our customers, we may be exposed to defaults under our lease financing arrangements. Moreover, usage-based operating lease arrangements generally contain no minimum payments; therefore, customers may exit such arrangements without paying a financial penalty to us.\nFor some operating lease arrangements, our customers are provided with the right to purchase the leased system at certain points during and/or at the end of the lease term. Revenue generated from customer purchases of systems under operating lease arrangements (“Lease Buyouts”) was $109 million, $74 million, and $72 million for the years ended December 31, 2024, 2023, and 2022, respectively. We expect that revenue recognized from customer exercises of buyout options will fluctuate based on the timing of when, and if, customers choose to exercise such buyout options.\nSystems Revenue\nSystem placements are driven by procedure growth in most geographic markets. In some markets, system placements are constrained by regulation. In geographies where da Vinci\n \nprocedure\n \nadoption is in an early stage or system placements are constrained by regulation, system sales will precede procedure growth. System placements also vary due to seasonality, largely aligned with hospital budgeting cycles. On an annual basis, we typically place a higher proportion of systems in the fourth quarter and a lower proportion in the first quarter as many customer budgets are reset. Systems revenue is also affected by the proportion of system placements under operating lease arrangements, recurring fixed-payment and usage-based operating lease revenue, Lease Buyouts, product mix, ASPs, trade-in activities, customer mix, and specified-price trade-in rights. We generally do not provide specified-price trade-in rights or upgrade rights at the time of a system purchase; however, we expect that the number of arrangements that may contain these specified-price trade-in rights will increase as we continue the phased launch of our next-generation multi-port platform, da Vinci 5. For trade-in activities involving operating lease upgrades, depending on the timing and terms of the upgrade transaction, the amount of revenue generated on the initial and new lease arrangements may not, in the aggregate, generate the same amount of revenue that a traditional sale and trade-in transaction would. Systems revenue increased 17% to $1.97 billion in 2024. Systems revenue remained flat at $1.68 billion in 2023. Systems revenue declined 1% to $1.68 billion in 2022.\n65\nTable\n of Contents\nProcedure Mix / Products\nOur da Vinci surgical systems are generally used for soft tissue surgery for areas of the body between the pelvis and the neck, primarily in general, gynecologic, urologic, cardiothoracic, and head and neck surgical procedures. Within these categories, procedures range in complexity from cancer and other highly complex procedures to less complex procedures for benign conditions. Cancer and other highly complex procedures tend to be reimbursed at higher rates than less complex procedures for benign conditions. Thus, hospitals are more sensitive to the costs associated with treating less complex, benign conditions. Our strategy is to provide hospitals with attractive clinical and economical solutions across the spectrum of procedure complexity. Our fully featured da Vinci 5 and da Vinci Xi surgical systems with advanced instruments (including da Vinci energy and da Vinci stapler products) and our Integrated Table Motion product target the more complex procedure segment. Our da Vinci X surgical system is targeted toward price-sensitive geographic markets and procedures. Our da Vinci SP surgical system complements the da Vinci 5, da Vinci X, and da Vinci Xi surgical systems by enabling surgeons to access narrow workspaces.\nProcedure and Placement Seasonality\nMore than half of the da Vinci procedures performed are for benign conditions, most notably hernia repairs, hysterectomies, and cholecystectomies. These benign procedures and other short-term elective procedures tend to be more seasonal than cancer operations and surgeries for other life-threatening conditions. Seasonality in the U.S. for procedures for benign conditions typically results in higher fourth quarter procedure volume when more patients have met annual deductibles and lower first quarter procedure volume when deductibles are reset. Seasonality outside of the U.S. varies and is more pronounced around local holidays and vacation periods, which have lower procedure volume.\nIn addition, historically, placements of our da Vinci surgical systems have tended to be heavier in the fourth quarter and lighter in the first quarter, as hospital budgets are reset.\nDistribution Channels\nWe provide our products through direct sales organizations in the U.S., Europe (excluding Italy, Spain, Portugal, Greece, and Eastern European countries), China (through our Intuitive-Fosun Pharma Joint Venture), Japan, South Korea, India, Taiwan, and Canada. In the remainder of our OUS markets, we provide our products through distributors.\nRegulatory Activities\nOverview\nOur products must meet the requirements of a large and growing body of international regulations and standards that govern the product safety, efficacy, advertising, labeling, safety reporting design, manufacture, materials content and sourcing, testing, certification, packaging, installation, use, and disposal of our products. Examples of such standards include electrical safety standards, such as those of the International Electrotechnical Commission, and composition standards, such as the Reduction of Hazardous Substances and the Waste Electrical and Electronic Equipment Directives in the EU. Failure to meet these standards could limit our ability to market our products in those regions that require compliance with such standards.\nOur products and operations are also subject to increasingly stringent medical device, privacy, and other regulations by regional, federal, state, and local authorities. After a device is placed on the market, numerous FDA and comparable foreign regulatory requirements continue to apply. These requirements include establishment registration and device listing with the FDA or other foreign regulatory authorities and compliance with medical device reporting regulations, which require that manufacturers report to the FDA or other foreign regulatory authorities if their device caused or contributed, or may have caused or contributed, to a death or serious injury or malfunctioned in a way that would likely cause or contribute to a death or serious injury if it were to recur.\nWe anticipate that timelines for the introduction of new products and/or indications may be extended relative to past experience as a result of these regulations. For example, we have seen elongated regulatory approval timelines in the U.S. and Europe.\nClearances, Approvals, and Certifications\nWe have generally obtained the regulatory clearances, approvals, and certifications required to market our products associated with our da Vinci multi-port surgical systems (da Vinci S, da Vinci Si, da Vinci Xi, and da Vinci X systems) for our targeted surgical specialties within the U.S., South Korea, Japan, and the European markets in which we operate. We have additionally obtained regulatory clearances, approvals, and certifications for the following products over the past several years:\n•\nIn December 2024, we obtained FDA clearance for the use of our da Vinci SP surgical system in colorectal surgical procedures. In July 2024, we obtained FDA clearance for the use of our da Vinci SP surgical system in general thoracoscopic surgical procedures. In April 2023, we obtained FDA clearance for the use of our da Vinci SP surgical \n66\nTable\n of Contents\nsystem in simple prostatectomy procedures. We also obtained FDA clearance for the use of our da Vinci SP surgical system in transvesical approaches to simple and radical prostatectomy.\n•\nIn December 2024, we obtained European certification in accordance with the EU MDR for our E-200 generator. In July 2023, we received regulatory clearance for our E-200 generator in Japan and South Korea. In November 2022, we obtained FDA clearance for our E-200 generator. The E-200 generator can be used in da Vinci robotic procedures, as well as non-robotic open and laparoscopic procedures, to deliver high-frequency energy for cutting, coagulation, and vessel sealing of tissues. The E-200 generator includes the same advanced energy capability as the E-100 generator and supports the same vessel sealing instruments.\n•\nIn October 2024, we obtained regulatory clearance in South Korea for our da Vinci 5 surgical system, our next-generation multi-port robotic system, for use in urologic, general, gynecologic, thoracoscopic, thoracoscopically-assisted cardiotomy, and transoral otolaryngology surgical procedures. In March 2024, we obtained FDA clearance for our da Vinci 5 surgical system for use in all surgical specialties and procedures indicated for da Vinci Xi, except for cardiac and pediatric indications as well as one contraindication related to the use of force feedback in hysterectomy and myomectomy surgical procedures. Da Vinci 5 was made available to customers in the U.S. who had collaborated with us during the development period and those with mature robotic surgery programs. We will continue working with surgeons to generate additional data on the system’s use and on expansion of our manufacturing and supply capacity before a wider commercial introduction.\n•\nIn September 2024, we obtained FDA clearance for our redesigned 8 mm SureForm 30 stapler and 8 mm SureForm 30 Curved-Tip stapler instruments and reloads for use in general, thoracic, gynecologic, urologic, and pediatric surgical procedures. In April 2024, we obtained European certification in accordance with the EU MDR for our redesigned 8 mm SureForm 30 stapler and 8 mm SureForm 30 Curved-Tip stapler instruments and reloads for use in general, thoracic, gynecologic, urologic, and pediatric surgical procedures.\n•\nIn August 2024, we obtained regulatory clearance in Taiwan for our da Vinci SP surgical system for use in endoscopic abdominopelvic, thoracoscopic, transoral otolaryngology, transanal colorectal, transanal total mesorectal excision, and breast surgical procedures. In January 2024, we obtained European certification in accordance with the EU MDR for our da Vinci SP surgical system for use in endoscopic abdominopelvic, thoracoscopic, transoral otolaryngology, transanal colorectal, and breast surgical procedures. We are commercializing the da Vinci SP surgical system in select major European countries as part of a measured rollout. In September 2022, we obtained regulatory clearance for our da Vinci SP surgical system in Japan for use in general, thoracic (excluding cardiac procedures and intercostal approaches), urologic, gynecologic, and transoral head and neck surgical procedures.\n•\nIn April 2024, we obtained FDA clearance to extend the number of uses of our catheter instrument used with our Ion endoluminal system from five to eight uses.\n•\nIn March 2024, we received NMPA regulatory clearance for our Ion endoluminal system in China. We placed our first Ion systems in China during the third quarter of 2024 and will continue our rollout of the Ion system in China in a measured fashion while we optimize training pathways and collect additional clinical data. In September 2023, we received regulatory clearance in South Korea for our Ion endoluminal system. We expect the introduction of the Ion system in South Korea to follow the refinement of our training pathways in the region and the gathering of local clinical and economic data. In March 2023, we obtained European certification in accordance with the EU MDR for our Ion endoluminal system. In Europe, we continued commercialization in the UK and are beginning to place Ion systems in continental Europe with a similar approach of initially focusing on the collection of clinical data in support of our European reimbursement strategy.\n•\nIn August 2023, following approval by China’s NMPA for a local version of our da Vinci Xi surgical system in June 2023, our Intuitive-Fosun Pharma Joint Venture received a manufacturing license that permits the Joint Venture to manufacture our da Vinci Xi surgical system for sale to customers in China.\n•\nIn March 2022, we received regulatory clearance in China to market our da Vinci Endoscope Plus. We have also received regulatory clearances in Japan and South Korea to market our da Vinci Endoscope Plus in May 2020 and December 2019, respectively. In July 2019, we obtained FDA clearance for our da Vinci Endoscope Plus, and in June 2019, we obtained European certification for our da Vinci Endoscope Plus for the da Vinci Xi and da Vinci X surgical systems.\n•\nIn February 2022, we received regulatory clearance in China to market both our 12 mm SureForm 45 stapler and SureForm 60 stapler and corresponding reloads.\n•\nIn January 2022, we received regulatory clearance in China to market our da Vinci Vessel Sealer Extend with up to 7 mm vascular indications.\nRefer to the descriptions of our new products that received regulatory clearances, approvals, or certifications in 2024, 2023, and 2022 in the Recent Product Introductions section below.\n67\nTable\n of Contents\nIn June 2023, the China National Health Commission published the 2023 Quota. Under the 2023 Quota, the government will allow for the sale of 559 new surgical robots into China, which could include da Vinci surgical systems as well as surgical systems introduced by others. As of December 31, 2024, including systems that were sold in prior quarters, we have placed 121 da Vinci surgical systems under the 2023 Quota. Future sales of da Vinci surgical systems under this and any previously published open quotas are uncertain, as they are open to other medical device companies that have introduced robotic-assisted surgical systems and are dependent on hospitals completing a tender process and receiving associated approvals. Our ability to track the number of systems that could be sold under these quotas in the future is limited by provincial and national agencies making such information publicly available.\nSince 2022, several provinces in China have implemented significant limits on what hospitals can charge patients for surgeries using robotic surgical technology, including soft tissue surgery. These limits have significantly impacted the number of procedures performed and have impacted our instruments and accessories revenue in those provinces. However, as of the date of this report, these limits have not had a material impact on our business, financial condition, or results of operations, as only a small portion of our installed base in China is currently located in the impacted provinces. Companies providing robotic surgical technology, including our Joint Venture in China, have been meeting with Chinese government healthcare agencies to discuss these developments and to provide feedback. We cannot assure you that additional provincial or national healthcare agencies and administrations will not impose similar limits, and we expect to continue to face increased pricing pressure, both of which could further impact the number of procedures performed and our instruments and accessories revenue in China.\nThe Japanese MHLW considers reimbursement for procedures in April of even-numbered years. The process for obtaining reimbursement requires Japanese university hospitals and surgical societies, with our support, to seek reimbursement. There are multiple pathways to obtain reimbursement for procedures, including those that require in-country clinical and economic data. An additional five da Vinci procedures were granted reimbursement in April 2024, including lobectomy for benign conditions. In addition, we received higher reimbursement for certain da Vinci rectal resection procedures, as compared to open procedure reimbursements. The additional reimbursed procedures have varying levels of conventional laparoscopic penetration and will generally be reimbursed at rates equal to the conventional laparoscopic procedures. Given the reimbursement level and laparoscopic penetration for these additional procedures, there can be no assurance that the adoption pace for these procedures will be similar to prostatectomy or partial nephrectomy, given their higher reimbursement, or any other da Vinci procedure.\nField Actions, Recalls, and Corrections\nMedical device companies have regulatory obligations to correct or remove medical devices in the field that could pose a risk to health. The definition of “recalls and corrections” is expansive and includes repair, replacement, inspections, relabeling, and issuance of new or additional instructions for use or reinforcement of existing instructions for use and training when such actions are taken for specific reasons of safety or compliance. These field actions require stringent documentation, reporting, and monitoring worldwide. There are other actions that a medical device manufacturer may take in the field without reporting including, but not limited to, routine servicing and stock rotations.\nAs we determine whether a field action is reportable in any regulatory jurisdiction, we prepare and submit notifications to the appropriate regulatory agency for the particular jurisdiction. Regulators can require the expansion, reclassification, or change in scope and language of the field action. In general, upon submitting required notifications to regulators regarding a field action that is a recall or correction, we will notify customers regarding the field action, provide any additional documentation required in their national language, and arrange, as required, the return or replacement of the affected product or a field service visit to perform the correction.\nField actions, as well as certain outcomes from regulatory activities, can result in adverse effects on our business, including damage to our reputation, delays by customers of purchase decisions, reduction or stoppage of the use of installed systems, and reduced revenue as well as increased expenses.\nProcedures\nWe model patient value as equal to \nprocedure efficacy / invasiveness\n. In this equation, \nprocedure efficacy\n is defined as a measure of the success of the procedure in resolving the underlying disease, and \ninvasiveness\n is defined as a measure of patient pain and disruption of regular activities. When the patient value of a robotic-assisted procedure is greater than that of alternative treatment options, patients may benefit from seeking out surgeons or physicians and hospitals that offer robotic-assisted medical procedures, which could potentially result in a local market share shift. Adoption of robotic-assisted procedures occurs by procedure and by market and is driven by the relative patient value and total treatment costs of robotic-assisted procedures as compared to alternative treatment options for the same disease state or condition.\nWe use the number and type of procedures as metrics for financial and operational decision-making and as a means to evaluate period-to-period comparisons. Management believes that the number and type of procedures provide meaningful supplemental information regarding our performance, as management believes procedure volume is an indicator of the rate of adoption of our robotic-assisted medical procedures as well as an indicator of future revenue (including revenue from usage-\n68\nTable\n of Contents\nbased operating lease arrangements). Management believes that both it and investors benefit from referring to the number and type of procedures in assessing our performance and when planning, forecasting, and analyzing future periods. The number and type of procedures also facilitate management’s internal comparisons of our historical performance. We believe that the number and type of procedures are useful to investors as metrics, because (1) they allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making, and (2) they are used by institutional investors and the analyst community to help them analyze the performance of our business. The vast majority of our installed systems are connected via the internet. System logs can also be accessed by field engineers for systems that are not connected to the internet. We utilize certain methods that rely on information collected from the installed systems for determining the number and type of procedures performed that involve estimates and judgments, which are, by their nature, subject to substantial uncertainties and assumptions. Estimates and judgments for determining the number and type of procedures may be impacted over time by various factors, including changes in treatment modalities, hospital and distributor reporting behavior, and system internet connectivity. Such estimates and judgments are also susceptible to algorithmic or other technical errors. In addition, the relationship between the number and type of procedures and our revenues may fluctuate from period to period, and procedure volume growth may not correspond to an increase in revenue. The number and type of procedures are not intended to be considered in isolation or as a substitute for, or superior to, revenue or other financial information prepared and presented in accordance with GAAP.\nDa Vinci Procedures\nThe adoption of robotic-assisted surgery using the da Vinci surgical system has the potential to grow for those procedures that offer greater patient value than to non-da Vinci alternatives and competitive total economics for healthcare providers. Our da Vinci surgical systems are used primarily in general, gynecologic, urologic, cardiothoracic, and head and neck surgical procedures. We focus our organization and investments on developing, marketing, and training products and services for procedures in which da Vinci can bring patient value relative to alternative treatment options and/or economic benefit to healthcare providers. Target procedures in general surgery include hernia repair (both ventral and inguinal), colorectal, cholecystectomy, and bariatric procedures. Target procedures in urology include prostatectomy and partial nephrectomy. Target procedures in gynecology include hysterectomy for both cancer and benign conditions and sacrocolpopexy. In cardiothoracic surgery, target procedures include lung resection. In head and neck surgery, target procedures include transoral surgery. Not all indications, procedures, or products described may be available in a given country or region or on all generations of da Vinci surgical systems. Surgeons and their patients need to consult the product labeling in their specific country and for each product in order to determine the cleared uses, as well as important limitations, restrictions, or contraindications.\nIn 2024, approximately 2,683,000 surgical procedures were performed with da Vinci surgical systems, compared to approximately 2,286,000 and 1,875,000 surgical procedures performed with da Vinci surgical systems in 2023 and 2022, respectively. The increase in our overall procedure volume in 2024 was largely attributable to growth in U.S. general surgery, OUS general surgery (particularly cancer), OUS urologic surgery, and U.S. gynecologic surgery procedures. The overall procedure volume in the 2022 comparative year reflects disruption caused by the COVID-19 pandemic.\nU.S. da Vinci Procedures\nOverall U.S. procedure volume with da Vinci surgical systems grew to approximately 1,757,000 in 2024, compared to approximately 1,532,000 in 2023 and approximately 1,282,000 in 2022. General surgery was our largest and fastest growing U.S. specialty in 2024 with procedure volume that grew to approximately 1,063,000 in 2024, compared to approximately 896,000 in 2023 and approximately 720,000 in 2022. Gynecology was our second largest U.S. surgical specialty in 2024 with procedure volume that grew to approximately 423,000 in 2024, compared to approximately 390,000 in 2023 and approximately 341,000 in 2022. Urology was our third largest U.S. surgical specialty in 2024 with procedure volume that grew to approximately 186,000 in 2024, compared to approximately 173,000 in 2023 and approximately 162,000 in 2022.\nOUS da Vinci Procedures\nOverall OUS procedure volume with da Vinci surgical systems grew to approximately 926,000 in 2024, compared to approximately 754,000 in 2023 and approximately 593,000 in 2022. Urology was our largest OUS surgical specialty in 2024 with procedure volume that grew to approximately 435,000 in 2024, compared to approximately 381,000 in 2023 and approximately 316,000 in 2022. General surgery was our second largest and fastest growing OUS specialty in 2024 with procedure volume that grew to approximately 254,000 in 2024, compared to approximately 188,000 in 2023 and approximately 133,000 in 2022. Gynecology was our third largest OUS surgical specialty in 2024 with procedure volume that grew to approximately 142,000 in 2024, compared to approximately 110,000 in 2023 and approximately 86,000 in 2022.\nIon Procedures\nThe adoption of robotic-assisted bronchoscopy using the Ion endoluminal system has the potential to grow if it can offer greater patient value than non-Ion alternatives and competitive total economics for healthcare providers.\n69\nTable\n of Contents\nIn 2024, approximately 95,500 biopsy procedures were performed with Ion systems, compared to approximately 53,800 in 2023 and approximately 23,500 in 2022. The increase in our overall procedure volume in 2024 reflects a larger installed base of approximately 805 systems, an increase of 51% compared to the installed base of approximately 534 systems as of 2023. Currently, the vast majority of Ion biopsy procedures are performed in the U.S.\n70\nTable\n of Contents\nRecent Business Events and Trends\nProcedures\nOverall.\n  Total da Vinci procedures performed by our customers grew approximately 17% in 2024, compared to approximately 22% in 2023. We believe that the growth in the comparative 2023 procedure results for both U.S. and OUS procedures partially reflected a benefit from procedures performed related to the backlog of patient treatments that resulted from COVID-19, as noted in the \nCOVID-19 Pandemic\n section above. The 2024 procedure growth was largely attributable to growth in U.S. general surgery, OUS general surgery (particularly cancer), OUS urologic surgery, and U.S. gynecologic surgery procedures.\nU.S. Procedures.\n  U.S. da Vinci procedures grew approximately 15% in 2024, compared to approximately 19% in 2023. The 2024 U.S. procedure growth was largely attributable to strong growth in general surgery procedures, most notably cholecystectomy, hernia repair, and colorectal procedures. The number of U.S. da Vinci bariatric procedures performed declined modestly in 2024 compared to 2023. It is unclear whether the overall decline in the U.S. for surgical bariatric procedures will continue as patients evaluate new drug therapies and, if the decline continues, it is unclear what the rate of decline will be.\nU.S. General Surgery.\n  General surgery procedures in the U.S. grew approximately 19% in 2024, compared to approximately 25% in 2023. Cholecystectomy, inguinal and ventral hernia repair, and colorectal procedures contributed the most incremental procedures in both 2024 and 2023.\nGiven the already very high level of laparoscopic techniques used in cholecystectomy, it remains unclear to what extent robotic-assisted surgery using da Vinci may continue to be adopted.\nWe believe that growth in hernia repair using da Vinci reflects improved clinical outcomes within certain patient populations, as well as potential cost benefits relative to certain alternative treatments. We believe that hernia repair procedures represent a significant opportunity with the potential to drive growth in future periods. However, given the differences in surgical complexity associated with the treatment of various hernia patient populations and varying surgeon opinions regarding optimal surgical technique, it is difficult to estimate the timing of and to what extent hernia repair procedure volume will grow in the future. We expect a large portion of hernia repairs will continue to be performed via different modalities of surgery.\nThe adoption of da Vinci for colorectal procedures, which includes several underlying procedures, such as low anterior resections for rectal cancers and certain colon procedures for benign and cancerous conditions, has been ongoing for several years and is supported by certain technologies, such as our da Vinci energy and da Vinci stapler products as well as our Integrated Table Motion product.\nU.S. Gynecology\n.  Gynecology procedures in the U.S. grew approximately 8% in 2024, compared to approximately 15% in 2023. Benign hysterectomy procedures contributed the most incremental procedures in 2024 and 2023. The growth in benign hysterectomy procedures has been largely driven by new surgeon training.\nOUS Procedures.\n  OUS da Vinci procedures grew approximately 23% in 2024, compared to approximately 27% in 2023. The 2024 OUS procedure growth was driven by growth in general surgery procedures, most notably colorectal and hernia repair procedures, urologic procedures, most notably prostatectomy and partial nephrectomy procedures, and gynecologic procedures. The 2024 OUS procedure growth rate reflects continued da Vinci adoption in European and Asian markets. We saw strong procedure growth in Germany, the UK, India, and Italy during 2024. We believe that growth in these global markets is being driven by increased acceptance among surgeons and health systems, supported by expanded global evidence validating the clinical and economic value of da Vinci procedures as well as increased surgeon training. In South Korea, we believe that the number of procedures performed were significantly negatively impacted by doctor strikes in the country during 2024. The extent of the continued impact of these strikes on procedures in South Korea remains uncertain.\nOUS General Surgery.\n  OUS general surgery procedures grew approximately 35% in 2024, compared to approximately 42% in 2023. Colorectal procedures contributed the most incremental procedures in 2024 and 2023, aided by improved clinical outcomes relative to open and laparoscopic techniques within certain patient populations, along with enabling technologies, such as our da Vinci energy and da Vinci stapler products as well as our Integrated Table Motion product.\nOUS Urology.\n  OUS urology procedures have been a consistent contributor to our overall procedure growth. OUS urology procedures grew approximately 14% in 2024, compared to approximately 21% in 2023. In the U.S., da Vinci is the standard of care for the surgical treatment of prostate cancer, and we believe that the growth is largely aligned with surgical volumes of prostate cancer. In OUS markets, prostatectomy is at varying states of adoption in different areas of the world but is the largest overall da Vinci procedure. In 2024, we saw more moderate growth in OUS prostatectomy procedures compared to higher growth in 2023, as we are further up the adoption curve.\n71\nTable\n of Contents\nKidney cancer procedures have also been a strong contributor to our recent global urology procedure growth. Clinical publications have demonstrated that the use of a\n \nda Vinci system increases the likelihood that a patient will receive nephron sparing surgery through a partial nephrectomy, which is typically the surgical society guideline recommended therapy.\nSystem Demand\nWe placed 1,526 da Vinci surgical systems in 2024, compared to 1,370 systems in 2023. The increase in system placements reflects incremental demand for our next-generation da Vinci 5 system and continued demand for additional capacity by our customers as a result of procedure growth, partially offset by a smaller number of third-generation da Vinci systems available for trade-in. During 2024, we placed 362 da Vinci 5 systems.\nWe continue to see some customers challenged by staffing shortages, decreased government funding in healthcare (particularly in Europe), and other financial pressures. As a result, we expect our customers to continue to be cautious in their overall capital spending. In addition, system demand in China has been impacted by increasing robotic-assisted surgical system competition from domestic companies as well as a broader central government focus on systematic governance. Targeting the healthcare sector, this campaign was initially launched by the Chinese government in July 2023 and has resulted in heightened scrutiny by medical institutions with respect to initiating tenders, with some tenders being canceled or delayed without a timeline. In 2024, the effects of this campaign, combined with the competitive dynamics in China, contributed to fewer systems being placed in China than we anticipated. Currently, the extent and impact of this campaign and the competitive dynamics in China on our business remains uncertain.\nWe expect that future placements of da Vinci surgical systems will be impacted by a number of factors: supply chain risks; economic and geopolitical factors; inflationary pressures; high interest rates; hospital staffing shortages; procedure growth rates; evolving system utilization and point-of-care dynamics; capital replacement trends, including a declining number of older generation systems available for trade-in transactions; additional reimbursements in various global markets, such as in Japan; the timing around governmental tenders and authorizations, as well as governmental actions impacting the tender process, such as the governance campaign in China; hospitals’ response to the evolving healthcare environment; the timing of when we receive regulatory clearance in our other OUS markets for our da Vinci 5, da Vinci X, da Vinci Xi, and da Vinci SP surgical systems and related instruments; and the market response.\nDemand may also be impacted by the competition we currently face, or expect to face, from companies offering products for open or MIS surgeries, companies providing other therapeutic approaches for target clinical conditions, and companies developing diagnostic solutions that could serve as alternatives to current or planned Intuitive offerings. Companies that have introduced products in the field of robotic-assisted medical procedures, or have made explicit statements about their efforts to enter the field, include, but are not limited to, the following: Beijing Surgerii Robotics Company Limited; CMR Surgical Ltd.; Distalmotion SA; Harbin Sizhe Rui Intelligent Medical Equipment Co., Ltd.; Johnson & Johnson; Karl Storz SE & Co. KG; Medicaroid Corporation; Medtronic plc; meerecompany Inc.; Noah Medical; Shandong Weigao Group Medical Polymer Company Ltd.; Shanghai Microport Medbot (Group) Co., Ltd.; Shenzhen Edge Medical Co., Ltd.; and SS Innovations International, Inc.\nMany of the above factors will also impact future demand for our Ion endoluminal system, as we extend our commercial offering into diagnostics, along with additional factors associated with a new product introduction, including, but not limited to, our ability to optimize manufacturing and our supply chain, competition, clinical data to demonstrate value, and market acceptance.\nRecent Product Introductions\nDa Vinci 5. \nDa Vinci 5 builds on da Vinci Xi’s highly functional design, featuring force feedback technology and instruments that enable surgeons to sense and measure the force exerted on tissue during surgery. It also includes new surgeon controllers, powerful vibration and tremor controls, a next-generation 3D display and image system, and throughput and workflow enhancements, such as an integrated electrosurgical unit and insufflation capabilities technology. Da Vinci 5 has more than 10,000 times the computing power of da Vinci Xi, allowing for innovative new system capabilities and advanced digital experiences, including integration with our My Intuitive app, SimNow (virtual reality simulator), Case Insights (computational observer), and Intuitive Hub (edge computing system). Additionally, the redesigned console provides greater surgeon comfort with customizable positioning, allowing surgeons to find their best fit for surgical viewing and comfort, including the ability to sit completely upright.\nE-200 Generator. \nThe E-200 generator is an advanced electrosurgical generator designed to provide high-frequency energy for cutting, coagulation, and vessel sealing of tissues. The E-200 generator is integrated with the da Vinci 5 surgical system, is compatible with the da Vinci X and Xi surgical systems, and can also function as a standalone electrosurgical generator. When connected to a da Vinci system, the E-200 delivers high-frequency energy to da Vinci instruments, with control and status messages communicated through an Ethernet cable. The E-200 generator is also compatible with third-party handheld monopolar and bipolar instruments, as well as fingerswitch-equipped instruments and Intuitive-provided auxiliary footswitches. \n72\nTable\n of Contents\nThe E-200 generator includes the same advanced energy capability as the E-100 generator and supports the same vessel sealing instruments.\nSureForm 30 Curved-Tip Stapler and Reloads.\n The 8 mm SureForm 30 Curved-Tip stapler and reloads (gray, white, and blue) was designed to help surgeons better visualize and reach anatomy through a combination of the 8 mm diameter instrument shaft and jaws, 120-degree cone of wristed articulation, and the curved tip. As it fits through the 8 mm da Vinci surgical system instrument cannula, the stapler allows different angles for surgeons to approach patient anatomy. Consistent with our other SureForm staplers, the 8 mm SureForm 30 Curved-Tip stapler integrates SmartFire technology, which makes automatic adjustments to the firing process as staples are formed and the transection is made. The technology makes more than 1,000 measurements per second, helping achieve a consistent staple line.\nIntuitive Ventures\nIn 2020, we launched Intuitive Ventures Fund I, an inaugural $100 million fund focused on investment opportunities in companies that share Intuitive’s commitment to advancing positive outcomes in healthcare. As of December 31, 2024, we have invested $63 million of the $100 million.\nIn late 2023, we launched Intuitive Ventures Fund II, a $150 million fund focused on investment opportunities in companies reimagining the future of minimally invasive care. As of December 31, 2024, we have invested $5 million of the $150 million.\n2024 Operational and Financial Highlights\n•\nTotal revenue increased by 17% to $8.4 billion for the year ended December 31, 2024, compared to $7.1 billion for the year ended December 31, 2023.\n•\nApproximately 2,683,000 da Vinci procedures were performed during the year ended December 31, 2024, an increase of 17% compared to approximately 2,286,000 da Vinci procedures for the year ended December 31, 2023.\n•\nApproximately 95,500 Ion procedures were performed during the year ended December 31, 2024, an increase of 78% compared to approximately 53,800 Ion procedures for the year ended December 31, 2023.\n•\nInstruments and accessories revenue increased by 19% to $5.08 billion for the year ended December 31, 2024, compared to $4.28 billion for the year ended December 31, 2023.\n•\nSystems revenue increased by 17% to $1.97 billion for the year ended December 31, 2024, compared to $1.68 billion for the year ended December 31, 2023.\n•\n1,526\n \nda Vinci surgical systems were placed during the year ended December 31, 2024, an increase of 11% compared to 1,370 systems during the year ended December 31, 2023.\n•\nAs of December 31, 2024, we had a da Vinci surgical system installed base of approximately 9,902 systems, an increase of 15% compared to the installed base of approximately 8,606 systems as of December 31, 2023.\n•\nUtilization of da Vinci surgical systems, measured in terms of procedures per system per year, increased 2% relative to 2023.\n•\n271 Ion systems were placed during the year ended December 31, 2024, an increase of 27% compared to 213 systems during the year ended December 31, 2023.\n•\nAs of December 31, 2024, we had an Ion system installed base of approximately 805 systems, an increase of 51% compared to the installed base of approximately 534 systems as of December 31, 2023.\n•\nGross profit as a percentage of revenue was 67.5% for the year ended December 31, 2024, compared to 66.4% for the year ended December 31, 2023.\n•\nOperating income increased by 33% to $2.35 billion for the year ended December 31, 2024, compared to $1.77 billion for the year ended December 31, 2023. Operating income included $688 million and $598 million of share-based compensation expense related to employee stock plans and $22.6 million and $31.2 million of intangible asset-related charges for the years ended December 31, 2024, and 2023, respectively.\n•\nAs of December 31, 2024, we had $8.83 billion in cash, cash equivalents, and investments. Cash, cash equivalents, and investments increased by $1.49 billion, compared to $7.34 billion as of December 31, 2023, primarily as a result of cash provided by operating activities and proceeds from stock option exercises and employee stock purchases, partially offset by cash used for capital expenditures and taxes paid related to net share settlements of equity awards.\n73\nTable\n of Contents\nResults of Operations\nThe following discussion should be read in conjunction with our Consolidated Financial Statements and Notes thereto. This section of the Annual Report on Form 10-K generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this report on Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023.\nThe following table sets forth, for the years indicated, certain Consolidated Statements of Income information (in millions, except percentages):\n \nYears Ended December 31,\n \n2024\n% of total Revenue\n2023\n% of total Revenue\n2022\n% of total Revenue\nRevenue:\nProduct\n$\n7,045.0 \n84 \n%\n$\n5,956.3 \n84 \n%\n$\n5,198.0 \n84 \n%\nService\n1,307.1 \n16 \n%\n1,167.8 \n16 \n%\n1,024.2 \n16 \n%\nTotal revenue\n8,352.1 \n100 \n%\n7,124.1 \n100 \n%\n6,222.2 \n100 \n%\nCost of revenue:\nProduct\n2,313.1 \n28 \n%\n2,041.8 \n29 \n%\n1,700.3 \n28 \n%\nService\n404.8 \n5 \n%\n352.8 \n5 \n%\n325.9 \n5 \n%\nTotal cost of revenue\n2,717.9 \n33 \n%\n2,394.6 \n34 \n%\n2,026.2 \n33 \n%\nProduct gross profit\n4,731.9 \n56 \n%\n3,914.5 \n55 \n%\n3,497.7 \n56 \n%\nService gross profit\n902.3 \n11 \n%\n815.0 \n11 \n%\n698.3 \n11 \n%\nGross profit\n5,634.2 \n67 \n%\n4,729.5 \n66 \n%\n4,196.0 \n67 \n%\nOperating expenses:\nSelling, general and administrative\n2,140.0 \n25 \n%\n1,963.9 \n27 \n%\n1,739.9 \n28 \n%\nResearch and development\n1,145.3 \n14 \n%\n998.8 \n14 \n%\n879.0 \n14 \n%\nTotal operating expenses\n3,285.3 \n39 \n%\n2,962.7 \n41 \n%\n2,618.9 \n42 \n%\nIncome from operations\n2,348.9 \n28 \n%\n1,766.8 \n25 \n%\n1,577.1 \n25 \n%\nInterest and other income, net\n324.9 \n4 \n%\n192.1 \n3 \n%\n29.7 \n1 \n%\nIncome before taxes\n2,673.8 \n32 \n%\n1,958.9 \n28 \n%\n1,606.8 \n26 \n%\nIncome tax expense\n336.3 \n4 \n%\n141.6 \n2 \n%\n262.4 \n4 \n%\nNet income\n2,337.5 \n28 \n%\n1,817.3 \n26 \n%\n1,344.4 \n22 \n%\nLess: net income attributable to noncontrolling interest in joint venture\n14.9 \n— \n%\n19.3 \n1 \n%\n22.1 \n1 \n%\nNet income attributable to Intuitive Surgical, Inc.\n$\n2,322.6 \n28 \n%\n$\n1,798.0 \n25 \n%\n$\n1,322.3 \n21 \n%\nTotal Revenue\nTotal revenue increased by 17% to $8.4 billion for the year ended December 31, 2024, compared to $7.1 billion for the year ended December 31, 2023. Total revenue for the year ended December 31, 2023, increased by 14% compared to $6.2 billion for the year ended December 31, 2022. The increase in total revenue for the year ended December 31, 2024, resulted from 19% higher instruments and accessories revenue, 17% higher systems revenue, and 12% higher service revenue.\nWe generally sell our products and services in local currencies where we have direct distribution channels. Revenue denominated in foreign currencies as a percentage of total revenue was approximately 24%, 25%, and 24% for the years ended December 31, 2024, 2023, and 2022, respectively. Fluctuations in foreign currency exchange rates had an unfavorable impact on OUS total revenue of $34 million for the year ended December 31, 2024, as compared to 2023. Fluctuations in foreign currency exchange rates had an unfavorable impact on OUS total revenue of $29 million for the year ended December 31, 2023, as compared to 2022. The impact of fluctuations in foreign currency exchange rates was determined by comparing current period revenue converted to USD using exchange rates that were effective in the comparable prior year period, net of the impacts from foreign currency hedging.\n74\nTable\n of Contents\nRevenue generated in the U.S. accounted for 67%, 66%, and 67% of total revenue for the years ended December 31, 2024, 2023, and 2022, respectively. We believe that U.S. revenue has accounted for the large majority of total revenue due to U.S. patients’ ability to choose their provider and method of treatment, reimbursement structures supportive of innovation and MIS, and our initial investments focused on U.S. infrastructure. We have been investing in our business in OUS markets, and our OUS procedures have grown faster in proportion to U.S. procedures. We expect that our OUS procedures and revenue will make up a greater portion of our business in the long term.\nThe following table summarizes our revenue and system unit placements for the years ended December 31, 2024, 2023, and 2022, respectively (in millions, except percentages and unit placements):\n \nYears Ended December 31,\n \n2024\n2023\n2022\nRevenue\nInstruments and accessories\n$\n5,079.0 \n$\n4,276.6 \n$\n3,517.9 \nSystems\n1,966.0 \n1,679.7 \n1,680.1 \nTotal product revenue\n7,045.0 \n5,956.3 \n5,198.0 \nServices\n1,307.1 \n1,167.8 \n1,024.2 \nTotal revenue\n$\n8,352.1 \n$\n7,124.1 \n$\n6,222.2 \nU.S.\n$\n5,589.4 \n$\n4,688.6 \n$\n4,157.6 \nOUS\n2,762.7 \n2,435.5 \n2,064.6 \nTotal revenue\n$\n8,352.1 \n$\n7,124.1 \n$\n6,222.2 \n% of Revenue — U.S.\n67%\n66%\n67%\n% of Revenue — OUS\n33%\n34%\n33%\nInstruments and accessories\n$\n5,079.0 \n$\n4,276.6 \n$\n3,517.9 \nServices\n1,307.1 \n1,167.8 \n1,024.2 \nOperating lease revenue\n654.2 \n500.5 \n376.5 \nTotal recurring revenue\n$\n7,040.3 \n$\n5,944.9 \n$\n4,918.6 \n% of Total revenue \n84%\n83%\n79%\nDa Vinci Surgical System Placements by Region\nU.S. unit placements\n800 \n666 \n692 \nOUS unit placements\n726 \n704 \n572 \nTotal unit placements*\n1,526 \n1,370 \n1,264 \n*Systems placed under fixed-payment operating lease arrangements (included in total unit placements)\n309 \n304 \n276 \n*Systems placed under usage-based operating lease arrangements (included in total unit placements)\n467 \n355 \n216 \nDa Vinci Surgical System Placements involving System Trade-ins\nUnit placements involving trade-ins\n150 \n240 \n345 \nUnit placements not involving trade-ins\n1,376 \n1,130 \n919 \nIon System Placements\n**\n271 \n213 \n192 \n**Systems placed under fixed-payment operating lease arrangements (included in total unit placements)\n85 \n63 \n61 \n**Systems placed under usage-based operating lease arrangements (included in total unit placements)\n68 \n54 \n40 \n75\nTable\n of Contents\nProduct Revenue\nProduct revenue increased by 18% to $7.05 billion for the year ended December 31, 2024, compared to $5.96 billion for the year ended December 31, 2023. Product revenue for the year ended December 31, 2023, increased by 15% compared to $5.20 billion for the year ended December 31, 2022.\nInstruments and accessories revenue increased by 19% to $5.08 billion for the year ended December 31, 2024, compared to $4.28 billion for the year ended December 31, 2023. The increase in instruments and accessories revenue was primarily driven by approximately 17% higher da Vinci procedure volume, approximately 78% higher Ion procedure volume, and higher pricing for da Vinci instruments and accessories, partially offset by customer buying patterns. The 2024 U.S. da Vinci procedure growth was approximately 15%, driven primarily by strong growth in general surgery procedures, most notably cholecystectomy, hernia repair, and colorectal procedures. The number of U.S. da Vinci bariatric procedures performed declined modestly in 2024 compared to 2023. It is unclear whether the overall decline in the U.S. for surgical bariatric procedures will continue as patients evaluate new drug therapies and, if the decline continues, it is unclear what the rate of decline will be. The 2024 OUS da Vinci procedure growth was approximately 23%, driven by growth in general surgery procedures, most notably colorectal and hernia repair procedures, urologic procedures, most notably prostatectomy and partial nephrectomy procedures, and gynecologic procedures. Geographically, the 2024 OUS da Vinci procedure growth was driven by several markets with particular strength in Germany, the UK, India, and Italy.\nSystems revenue increased by 17% to $1.97 billion for the year ended December 31, 2024, compared to $1.68 billion for the year ended December 31, 2023. The higher system revenue for the year ended December 31, 2024, was primarily driven by an increase in da Vinci system placements, higher operating lease revenue, higher ASPs, and higher lease buyout revenue, partially offset by a higher proportion of da Vinci system placements under operating leases.\nDuring 2024, 1,526 da Vinci surgical systems were placed compared to 1,370 systems during 2023. By geography, 800 systems were placed in the U.S., 309 in Europe, 321 in Asia, and 96 in other OUS markets during 2024, compared to 666 systems placed in the U.S., 308 in Europe, 305 in Asia, and 91 in other OUS markets during 2023. The increase in system placements was primarily driven by 362 da Vinci 5 system placements and continued demand for additional capacity by our customers as a result of procedure growth, partially offset by a smaller number of third-generation da Vinci systems available for trade-in. As of December 31, 2024, we had a da Vinci surgical system installed base of approximately 9,902 systems, compared to an installed base of approximately 8,606 systems as of December 31, 2023. The incremental system installed base reflects continued procedure growth and further customer validation that robotic-assisted surgery addresses their Quintuple Aim objectives.\nThe following table summarizes our da Vinci system placements and systems installed at customers under leasing arrangements for the years ended December 31, 2024, and 2023:\nYear Ended December 31,\n2024\n2023\nDa Vinci System Placements under Leasing Arrangements\nFixed-payment operating lease arrangements\n309 \n304 \nUsage-based operating lease arrangements\n467 \n355 \nTotal da Vinci system placements under operating lease arrangements\n776 \n659 \n% of Total da Vinci system placements\n51%\n48%\nSales-type lease arrangements\n88 \n45 \nTotal da Vinci system placements under leasing arrangements\n864 \n704 \nDa Vinci System Installed Base under Operating Leasing Arrangements\nFixed-payment operating lease arrangements\n1,307 \n1,204 \nUsage-based operating lease arrangements\n1,492 \n1,023 \nTotal da Vinci system installed base under operating leasing arrangements\n2,799 \n2,227 \nOperating lease revenue, including the contribution from Ion systems, was $654 million for the year ended December 31, 2024, of which $338 million was variable lease revenue related to usage-based arrangements, compared to $501 million for the year ended December 31, 2023, of which $217 million was variable lease revenue related to usage-based arrangements. Revenue from Lease Buyouts was \n$108.9 million fo\nr the year ended December 31, 2024, compared \nto $74.2 million f\nor the year ended December 31, 2023. We expect revenue from Lease Buyouts to fluctuate period to period depending on the timing of when, and if, customers choose to exercise buyout options embedded in their leases.\n76\nTable\n of Contents\nThe da Vinci surgical system ASP, excluding systems placed under fixed-payment or usage-based operating lease arrangements, Ion systems, and the impact of specified-price trade-in rights, was approximately $1.50 million for the year ended December 31, 2024, compared to approximately $1.42 million for the year ended December 31, 2023. The higher ASP for the year ended December 31, 2024, was largely driven by favorable product mix, including from da Vinci 5 sales, and fewer trade-ins, partially offset by higher pricing discounts. ASP fluctuates from period to period based on geographic and product mix, product pricing, systems placed involving trade-ins, and changes in foreign exchange rates.\nDuring 2024, 271 Ion systems were placed compared to 213 systems during 2023. By geography, 253 systems were placed in the U.S., 14 in Europe, and 4 in Asia during 2024, compared to 211 systems placed in the U.S. and 2 systems in Europe during 2023. The increase in system placements was primarily driven by the demand for additional capacity by our customers due to the procedure growth and OUS expansion. As of December 31, 2024, we had an Ion system installed base of approximately 805 systems, compared to an installed base of approximately 534 systems as of December 31, 2023.\nThe following table summarizes our Ion system placements and systems installed at customers under leasing arrangements for the years ended December 31, 2024, and 2023:\nYear Ended December 31,\n2024\n2023\nIon System Placements under Leasing Arrangements\nFixed-payment operating lease arrangements\n85 \n63 \nUsage-based operating lease arrangements\n68 \n54 \nTotal Ion system placements under operating lease arrangements\n153 \n117 \n% of Total Ion system placements\n56%\n55%\nSales-type lease arrangements\n4 \n5 \nTotal Ion system placements under leasing arrangements\n157 \n122 \nIon System Installed Base under Operating Leasing Arrangements\nFixed-payment operating lease arrangements\n126 \n96 \nUsage-based operating lease arrangements\n193 \n118 \nTotal Ion system installed base under operating leasing arrangements\n319 \n214 \nService Revenue\nService revenue increased by 12% to $1.31 billion for the year ended December 31, 2024, compared to $1.17 billion for the year ended December 31, 2023. The increase in service revenue for the year ended December 31, 2024, was primarily driven by a larger installed base of systems producing service revenue, partially offset by a higher proportion of early-stage usage-based operating lease arrangements where procedures are ramping up.\nGross Profit\nProduct\nProduct gross profit for the year ended December 31, 2024, increased by 21% to $4.73 billion, representing 67.2% of product revenue, compared to $3.91 billion, representing 65.7% of product revenue, for the year ended December 31, 2023. The higher product gross profit margin for the year ended December 31, 2024, was primarily driven by leverage on fixed overhead costs, lower logistics costs, and lower excess and obsolete inventory charges, partially offset by higher costs associated with our da Vinci 5 surgical system launch.\nProduct gross profit for the years ended December 31, 2024, and 2023, included share-based compensation expense of $98.5 million and $83.4 million, respectively, and intangible assets amortization expense of $11.5 million and $13.5 million, respectively.\nOur capital expenditures increased during 2024, as we continued to build the infrastructure needed to scale our business. As a result, beginning in 2025, we expect depreciation expense to increase, which may impact our future gross profit margin.\nIn 2025, the new U.S. presidential administration has proposed new and incremental tariffs on goods imported to the U.S. Specifically, tariffs of 25% could be imposed on imports from Mexico where a significant majority of our instruments and accessories are manufactured. In addition, we import raw materials and finished goods from sources outside of the U.S., which could also be subject to tariffs, such as our endoscopes, which are primarily manufactured in Germany. If the tariffs are implemented as proposed and noted above, we expect that the estimated decrease in our gross profit in 2025 could be material. \n77\nTable\n of Contents\nThe ultimate impact of any tariffs will depend on various factors, including if any tariffs are ultimately implemented, the timing of implementation, and the amount, scope, and nature of the tariffs.\nService\nService gross profit for the year ended December 31, 2024, increased by 11% to $0.90 billion, representing 69.0% of service revenue, compared to $0.82 billion, representing 69.8% of service revenue, for the year ended December 31, 2023. The higher service gross profit for the year ended December 31, 2024, was primarily driven by higher service revenue, reflecting a larger installed base of systems, and a lower service gross profit margin. The lower service gross profit margin for the year ended December 31, 2024, was primarily driven by an unfavorable repair mix and higher excess and obsolete inventory charges, partially offset by fixed cost leverage from higher repair volume.\nService gross profit for the years ended December 31, 2024, and 2023, included share-based compensation expense of $30.5 million and $28.2 million, respectively, and intangible assets amortization expense of $0.8 million and $0.9 million, respectively.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses include costs for sales, marketing, and administrative personnel, sales and marketing activities, trade show expenses, legal expenses, regulatory fees, and general corporate expenses.\nSelling, general and administrative expenses for the year ended December 31, 2024, increased by 9% to $2.14 billion, compared to $1.96 billion for the year ended December 31, 2023. The increase in selling, general and administrative expenses for the year ended December 31, 2024, was primarily driven by higher headcount and personnel-related expenses, including share-based compensation expense, higher litigation charges, and higher legal expenses. In 2024, we made a charitable contribution of $45 million to the Intuitive Foundation, a not-for-profit organization whose mission is to reduce the global burden of disease and suffering through research, education, and philanthropy aimed at better outcomes for patients around the globe. In 2023, we made a charitable contribution of $40 million to the Intuitive Foundation.\nSelling, general and administrative expenses for the years ended December 31, 2024, and 2023, included share-based compensation expense of $305 million and $275 million, respectively, and intangible assets amortization expense of $2.4 million and $3.3 million, respectively.\nResearch and Development Expenses\nResearch and development costs are expensed as incurred. Research and development expenses include costs associated with the design, development, testing, and significant enhancement of our products. Our main product development initiatives include multi-port, Ion, and SP platform investments and our digital products and services.\nResearch and development expenses for the year ended December 31, 2024, increased by 15% to $1.15 billion, compared to $1.00 billion for the year ended December 31, 2023. The increase in research and development expenses for the year ended December 31, 2024, was primarily driven by higher headcount and personnel-related expenses, including share-based compensation expense, and other project costs incurred to support a broader set of product development initiatives.\nResearch and development expenses for the years ended December 31, 2024, and 2023, included share-based compensation expense of $255 million and $212 million, respectively, and intangible asset-related charges of $7.8 million and $13.5 million, respectively.\nResearch and development expenses fluctuate with project timing. Based upon our broader set of product development initiatives and the stage of the underlying projects, we expect to continue to make substantial investments in research and development and anticipate that research and development expenses will continue to increase in the future.\nInterest and Other Income, Net\nInterest and other income, net, for the year ended December 31, 2024, increased by 69% to $325 million, compared to $192 million for the year ended December 31, 2023. Interest and other income, net increased by 547% for the year ended December 31, 2023, compared to $30 million for the year ended December 31, 2022. The increase in interest and other income, net, for the year ended December 31, 2024, was primarily driven by higher interest income earned (due to higher average interest rates and higher average cash and investment balances).\nWe held an equity investment in preferred shares of Broncus Holding Corporation (“Broncus”), which was reflected in our Consolidated Financial Statements on a cost basis. In September 2021, Broncus completed an initial public offering (“IPO”) of common shares on the Stock Exchange of Hong Kong. Upon completion of the IPO, the preferred shares were converted to common shares in Broncus. For the year ended December 31, 2022, we recognized a loss on this investment of approximately \n78\nTable\n of Contents\n$21 million. For the year ended December 31, 2023, we sold our shares in this investment, recognizing an additional nominal loss.\nIncome Tax Expense\nIncome tax expense was $336 million and $142 million for the years ended December 31, 2024, and 2023, respectively. Our effective tax rate for 2024 was approximately 12.6% compared to 7.2% for 2023.\nOur higher effective tax rate for the year ended December 31, 2024, compared to the year ended December 31, 2023, was primarily due to the fact that the year ended December 31, 2023, had a benefit for certain Swiss deferred tax assets, partially offset by higher excess tax benefits associated with employee equity plans in 2024 compared to 2023.\nOur provision for income taxes for 2023 reflected Swiss tax benefits of $92.3 million, net of a $67.3 million valuation allowance, related to certain tax assets recorded by our Swiss entity. In addition, a one-time net benefit of $67.1 million was recorded from the re-measurement of our Swiss deferred tax assets resulting from the Swiss cantonal tax rate increase enacted in December 2023 for years after 2024 as well as a Swiss cantonal tax rate increase from the discontinuation of our 2017 Swiss tax ruling, which was deemed effective as of January 1, 2023.\nOur provision for income taxes for 2024 and 2023 included excess tax benefits associated with employee equity plans of $223 million and $108 million, respectively, which reduced our effective tax rate by 8.4 and 5.5 percentage points, respectively. The amount of excess tax benefits or deficiencies will fluctuate from period to period based on the price of our stock, the volume of share-based awards settled or vested, and the value assigned to employee equity awards under GAAP, which results in increased income tax expense volatility.\nIn 2021, the OECD established an inclusive framework on base erosion and profit shifting and agreed on a two-pillar solution to global taxation, focusing on global profit allocation and a 15% global minimum effective tax rate (“Pillar Two”). The OECD issued Pillar Two model rules and continues to release guidance on these rules. Various countries, including Switzerland and EU member states, have enacted or have announced plans to enact new tax laws to implement the global minimum tax. We considered the applicable tax law changes on Pillar Two implementation in the relevant countries, and there is no material impact to our tax provision for the year ended December 31, 2024. We will continue to evaluate the impact of these tax law changes on future reporting periods.\nWe file federal, state, and foreign income tax returns in many jurisdictions in the U.S. and OUS. Years before 2017 are considered closed for significant jurisdictions. Certain of our unrecognized tax benefits could change due to activities of various tax authorities, including evolving interpretations of existing tax laws in the jurisdictions in which we operate, potential assessment of additional tax, possible settlement of audits, or through normal expiration of various statutes of limitations, which could affect our effective tax rate in the period in which they change.\nWe are subject to the examination of our income tax returns by the Internal Revenue Service and other tax authorities. The outcome of these audits cannot be predicted with certainty. Management regularly assesses the likelihood of adverse outcomes resulting from these examinations to determine the adequacy of our provision for income taxes. If any issues addressed in our tax audits are resolved in a manner not consistent with management’s expectations, we could be required to adjust our provision for income taxes in the period such resolution occurs.\nNet Income Attributable to Noncontrolling Interest in Joint Venture\nThe Company’s Joint Venture with Fosun Pharma was initially established to research, develop, manufacture, and sell robotic-assisted, catheter-based medical devices. The Joint Venture is owned 60% by us and 40% by Fosun Pharma and is located in China. In 2019, the Joint Venture acquired certain assets, including distribution rights, customer relationships, and certain personnel, from Chindex and its affiliates, a subsidiary of Fosun Pharma, and began direct operations for da Vinci products and services in China. Following approval in June 2023 by China’s NMPA for a local version of our da Vinci Xi surgical system, in August 2023, our Intuitive-Fosun Pharma Joint Venture received a manufacturing license that permits the Joint Venture to manufacture our da Vinci Xi surgical system for sale to customers in China.\nNet income attributable to noncontrolling interest in Joint Venture for the year ended December 31, 2024, was $14.9 million, compared to $19.3 million for the year ended December 31, 2023.\n79\nTable\n of Contents\nLiquidity and Capital Resources\nSources and Uses of Cash and Cash Equivalents\nOur principal source of liquidity is cash provided by our operations and by the issuance of common stock through the exercise of stock options and our employee stock purchase program. Cash and cash equivalents plus short- and long-term investments increased by $1.49 billion to $8.83 billion as of December 31, 2024, from $7.34 billion as of December 31, 2023, primarily as a result of cash provided by operating activities and proceeds from stock option exercises and employee stock purchases, partially offset by cash used for capital expenditures and taxes paid related to net share settlements of equity awards. \nOur cash requirements depend on numerous factors, including market acceptance of our products, the resources we devote to developing and supporting our products, and other factors. We expect to continue to devote substantial resources to expand procedure adoption and acceptance of our products. We have made substantial investments in our commercial operations, product development activities, facilities, and intellectual property. Based on our business model, we anticipate that we will continue to be able to fund future growth through cash provided by our operations. We believe that our current cash, cash equivalents, and investment balances, together with income to be derived from our business, will be sufficient to meet our liquidity requirements for the foreseeable future. However, we may experience reduced cash flow from operations as a result of macroeconomic and geopolitical headwinds.\nAs of December 31, 2024, $558 million of our cash, cash equivalents, and investments was held by foreign subsidiaries. We intend to repatriate earnings from our Swiss and Dutch subsidiaries and our joint venture in Hong Kong, as needed, since the U.S. and foreign tax implications of such repatriations are not expected to be significant. We will continue to indefinitely reinvest earnings from the rest of our foreign subsidiaries and do not expect the tax implications of repatriating these earnings to be significant.\nSee “Item 7A. Quantitative and Qualitative Disclosures About Market Risk” for discussion on the impact of interest rate risk and market risk on our investment portfolio.\nConsolidated Cash Flow Data\nThe following table summarizes our cash flows for the years ended December 31, 2024, 2023, and 2022 (in millions):\n \nYears Ended December 31,\n \n2024\n2023\n2022\nNet cash provided by (used in):\nOperating activities\n$\n2,415.0 \n$\n1,813.8 \n$\n1,490.8 \nInvesting activities\n(3,272.8)\n(360.1)\n1,370.8 \nFinancing activities\n150.9 \n(287.6)\n(2,572.3)\nEffect of exchange rates on cash, cash equivalents, and restricted cash\n(0.8)\n3.3 \n5.4 \nNet increase (decrease) in cash, cash equivalents, and restricted cash\n$\n(707.7)\n$\n1,169.4 \n$\n294.7 \nOperating Activities\nFor the year ended December 31, 2024, net cash provided by operating activities of $2.42 billion exceeded our net income of $2.34 billion, primarily due to the following factors:\n1.\nOur net income included non-cash charges of $997 million, consisting primarily of share-based compensation of $677 million, depreciation expense and losses on the disposal of property, plant, and equipment of $445 million, and  amortization of deferred commissions of $38 million, partially offset by deferred income tax benefits of $135 million and accretion of investment discounts, net of losses on investments of $43 million.\n2.\nThe non-cash charges outlined above were partially offset by changes in operating assets and liabilities that resulted in $919 million of cash used in operating activities during the year ended December 31, 2024. Inventory, including the transfer of equipment from inventory to property, plant, and equipment of $615 million, partially offset by the transfer of property, plant, and equipment to inventory of $44 million, increased by $830 million, primarily to address the growth in our business, expand our leasing business, and mitigate risks of disruption that could arise from global supply chain shortages and manufacturing line transfers. Refer to Note 4 to the Consolidated Financial Statements for further details regarding inventory in the supplemental cash flow information.\nCash used in operating activities was also driven by an increase in prepaid and other assets of $232 million, primarily driven by new and extended lessee operating lease arrangements and deferred commissions as a result of operating leasing arrangements with customers. Accounts receivable increased by $96 million, primarily due to increased sales, \n80\nTable\n of Contents\nas well as the timing of billings and collections. The unfavorable impact of these items on cash provided by operating activities was partially offset by an increase in other liabilities of $108 million, primarily driven by new and extended lessee operating lease arrangements. Also, accrued compensation and employee benefits increased by $99 million, primarily due to higher headcount and higher variable compensation.\nFor the year ended December 31, 2023, net cash provided by operating activities of $1.81 billion was less than our net income of $1.82 billion, primarily due to the following factors:\n1.\nOur net income included non-cash charges of $774 million, consisting primarily of share-based compensation of $593 million, depreciation expense and losses on the disposal of property, plant, and equipment of $402 million, deferred income tax benefits of $281 million, amortization of deferred commissions of $33 million; and intangible asset amortization of $20 million.\n2.\nThe non-cash charges outlined above were partially offset by changes in operating assets and liabilities that resulted in $778 million of cash used in operating activities during the year ended December 31, 2023. Inventory, including the transfer of equipment from inventory to property, plant, and equipment, increased by $713 million, primarily to address the growth in the business as well as to mitigate risks of disruption that could arise from supply or other matters. Refer to the supplemental cash flow information in Note 4 to the Consolidated Financial Statements for further details.\nCash used in operating activities was also driven by an increase in accounts receivable of \n$186 million\n, primarily due to the timing of billings and collections. Other accrued liabilities decreased\n by $33 million, primarily due to timing of income tax payments. The unfavorable impact of these items on cash provided by operating activities was partially offset by an increase in deferred revenue of $53 million, primarily due to collections of payments related to future services. Also, there was an increase in accounts payable by $42 million, primarily due to the timing of billing and payments, an increase in accrued compensation and employee benefits by $35 million, primarily due to higher headcount and higher variable compensation, and a decrease in prepaid expenses and other assets by $24 million, primarily due to a decrease in \nnet investments in sales-type leases\n.\nInvesting Activities\nNet cash used in investing activities for the year ended December 31, 2024, consisted primarily of purchases of investments, net of proceeds from maturities and sales, of $2.16 billion and $1.11 billion paid for the acquisition of property, plant, and equipment.\nNet cash used in investing activities for the year ended December 31, 2023, consisted primarily of $1.06 billion paid for the acquisition of property, plant, and equipment, partially offset by proceeds from maturities and sales of investments, net of purchases, of $0.71 billion.\nNet cash provided by investing activities for the year ended December 31, 2022, consisted primarily of proceeds from maturities and sales of investments, net of purchases, of $1.92 billion, partially offset by $532 million paid for the acquisition of property, plant, and equipment.\nWe invest predominantly in high quality, fixed income securities. Our investment portfolio may, at any time, contain investments in money market funds, U.S. treasury and U.S. government agency securities, high-quality corporate notes and bonds, commercial paper, non-U.S. government agency securities, and taxable and tax-exempt municipal notes.\nFinancing Activities\nNet cash provided by financing activities for the year ended December 31, 2024, consisted primarily of proceeds from stock option exercises and employee stock purchases of $429 million, partially offset by cash used for taxes paid on behalf of employees related to net share settlements of vested employee equity awards of $270 million.\nNet cash used in financing activities for the year ended December 31, 2023, consisted primarily of cash used in the repurchase of approximately 1.7 million shares of our common stock for $416 million and taxes paid on behalf of employees related to net share settlements of vested employee equity awards of $165 million, partially offset by proceeds from stock option exercises and employee stock purchases of $296 million.\nNet cash used in financing activities for the year ended December 31, 2022, consisted primarily of cash used in the repurchase of approximately 11.2 million shares of our common stock for $2.61 billion, 8.5 million shares of which related to accelerated share buyback programs executed and settled during 2022 and further described in Note 9 to the Consolidated Financial Statements, and taxes paid on behalf of employees related to net share settlements of vested employee equity awards of $194 million, partially offset by proceeds from stock option exercises and employee stock purchases of $234 million.\n81\nTable\n of Contents\nCapital Expenditures\nOur capital expenditures increased in 2024 as we continue to build the infrastructure needed to scale and supply our customers with highly differentiated products manufactured in highly automated factories to facilitate outstanding performance in product quality, availability, and cost. A significant portion of this investment involves the construction of facilities to expand our manufacturing and commercial capabilities. We have also been vertically integrating key technologies to develop a more robust supply chain and bring important products to market at attractive price points. These investments include increased ownership of our imaging pipelines, and investments in strategic instruments and accessories technologies that allow us to serve our customers better. We expect these capital investments to range between $650 million and $800 million in 2025, the majority of which will be facilities-related investments. We intend to fund these capital investments with cash generated from operations.\nContractual Obligations and Commercial Commitments\nOperating leases.\n  We lease spaces for our operations in the U.S. as well as in Japan, China, Israel, Mexico, Germany, South Korea, the United Kingdom, India, and other countries. We also lease automobiles for certain sales and field service employees. These leases have varying terms of up to 20 years. Operating lease amounts include future minimum lease payments under all of our non-cancellable operating leases with an initial term in excess of one year. Refer to Note 6 to the Consolidated Financial Statements included in Part II, Item 8 for further details.\nPurchase commitments and obligations.\n  Total purchase commitments and obligations as of December 31, 2024, are estimated to be approximately $2.12 billion, of which $1.78 billion is expected to be due within a year. These amounts include an estimate of all open purchase orders and contractual obligations in the ordinary course of business, including commitments with contract manufacturers and suppliers for which we have not received the goods or services, commitments for capital expenditures, including construction-related activities, for which we have not received the goods or services, and commitments for the acquisition and licensing of intellectual property. Approximately one third of our estimated purchase commitments and obligations are facilities-related. Although open purchase orders are considered enforceable and legally binding, the terms generally allow us the option to cancel, reschedule, or adjust our requirements based on our business needs prior to the delivery of goods or performance of services. In addition to the above, we have committed to making potential future milestone payments to third parties as part of licensing, collaboration, and development arrangements. Payments under these agreements generally become due and payable only upon achievement of certain developmental, regulatory, and/or commercial milestones. For instances in which the achievement of these milestones is neither probable nor reasonably estimable, such contingencies have not been recorded on our Consolidated Balance Sheets.\n2017 Tax Act deemed repatriation tax.\n  As of December 31, 2024, our obligation associated with the deemed repatriation tax is $67 million. The remaining balance is expected to be paid in 2025.\nWe estimate making payments of approximately $22 million relating to our unrecognized tax benefits in the next 12 months.\nOff-Balance Sheet Arrangements\nAs of December 31, 2024, we did not have any significant off-balance sheet arrangements, as defined in Item 303(a)(4)(ii) of Regulation S-K promulgated under the Exchange Act.\nCritical Accounting Estimates\nOur Consolidated Financial Statements are prepared in conformity with GAAP, which requires us to make judgments, estimates, and assumptions. See “Note 2. Summary of Significant Accounting Policies,” in Notes to the Consolidated Financial Statements, which is included in “Item 8. Financial Statements and Supplementary Data,” for a description of our significant accounting policies and methods used in the preparation of our Consolidated Financial Statements. The methods, estimates, and judgments that we use in applying our accounting policies require us to make difficult and subjective judgments, often as a result of the need to make estimates regarding matters that are inherently uncertain. Our most critical accounting estimates include:\n•\nStandalone selling prices used to allocate the contract consideration to the individual performance obligations, which impacts revenue recognition;\n•\nValuation and recognition of investments, which impacts our investment portfolio balance when we assess fair value and interest and other income, net, when we record impairments;\n•\nValuation of inventory, which impacts gross profit margins;\n•\nValuation of and assessment of the recoverability of intangible assets and goodwill and the estimated useful lives of intangible assets, which primarily impacts gross profit margin or operating expenses when we record asset impairments or accelerate their amortization;\n82\nTable\n of Contents\n•\nRecognition and measurement of current and deferred income taxes (including the measurement of uncertain tax positions), which impact our provision for taxes; and\n•\nEstimate of probable loss associated with legal contingencies, which impacts accrued liabilities and operating expenses.\nRevenue recognition.\n  Our system sale arrangements contain multiple products and services, including system(s), system components, system accessories, instruments, accessories, and services. Other than services, we generally deliver all of the products upfront. Each of these products and services is a distinct performance obligation. System accessories, instruments, accessories, and services are also sold on a standalone basis.\nFor multiple-element arrangements, revenue is allocated to each performance obligation based on its relative standalone selling price. Standalone selling prices are based on observable prices at which we separately sell the products or services. If a standalone selling price is not directly observable, then we estimate the standalone selling prices considering market conditions and entity-specific factors including, but not limited to, historical pricing data, features and functionality of the products and services, geographies, type of customer, and market conditions. We regularly review standalone selling prices and maintain internal controls over establishing and updating these estimates.\nOur system sales arrangements generally include a five-year period of service. The first year of service is generally free and included in the system sale arrangement, and the remaining four years are billed at a stated service price. Revenue that is allocated to the service obligation is deferred and recognized ratably over the service period.\nInvestments valuation.  \nOur investments may include, at any time, a diversified portfolio of money market funds, U.S. treasury and U.S. government agency securities, high-quality corporate notes and bonds, commercial paper, non-U.S. government agency securities, and taxable and tax-exempt municipal notes, as well as equity investments with and without readily determinable value. The assessment of the fair value of investments can be difficult and subjective. GAAP establishes three levels of inputs that may be used to measure fair value. Each level of input has different levels of subjectivity and difficulty involved in determining fair value. Valuation of Level 1 and 2 instruments generally do not require significant management judgment, and the estimation is not difficult. Level 3 instruments include unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities. The determination of fair value for Level 3 instruments requires the most management judgment and subjectivity. There were no Level 3 securities for the periods presented.\nAfter determining the fair value of our available-for-sale instruments, we identify instruments with an amortized cost basis in excess of their estimated fair value. Available-for-sale instruments in an unrealized loss position are written down to fair value through a charge to interest and other income, net in the Consolidated Statements of Income, if we intend to sell the security or it is more likely than not we will be required to sell the security before recovery of its amortized cost basis. For the remaining securities, we assess what amount of the excess, if any, is caused by expected credit losses. Factors considered in determining whether a credit-related loss exists include the financial condition and near-term prospects of the investee, the extent of the loss related to the credit of the issuer, and the expected cash flows from the security. These judgments could prove to be wrong, and companies with relatively high credit ratings and solid financial conditions may not be able to fulfill their obligations.\nNo significant impairment charges were recorded during the years ended December 31, 2024, 2023, and 2022. As of December 31, 2024, and 2023, net unrealized losses on investments of $14.6 million and $29.7 million, net of tax, respectively, were included in accumulated other comprehensive loss.\nInventory valuation.\n  Inventory is stated at the lower of cost or net realizable value on a first-in, first-out basis. The cost basis of our inventory is reduced for any products that are considered excess or obsolete based on assumptions about future demand and market conditions. If actual future demand or market conditions are less favorable than those projected by management, additional inventory write-downs may be required, which could have a material adverse effect on the results of our operations.\nValuation of intangible assets and goodwill.\n  We allocate the fair value of purchase consideration, including contingent consideration, to assets acquired and liabilities assumed in a business combination based on their estimated fair values at the acquisition date. The excess of the fair value of the purchase consideration over the fair value of assets acquired, liabilities assumed, and any noncontrolling interest is recorded as goodwill. When determining the fair value of assets acquired, liabilities assumed, and any noncontrolling interest, management is required to make certain estimates and assumptions, especially with respect to intangible assets. The estimates and assumptions used in valuing intangible assets include, but are not limited to, the amount and timing of projected future cash flows, the discount rate used to determine the present value of these cash flows, and the determination of the assets’ life cycle. These estimates are inherently uncertain and, therefore, actual results may differ from the estimates made.\n83\nTable\n of Contents\nOur intangible assets include identifiable intangible assets and goodwill. Identifiable intangible assets include developed technology, patents, distribution rights, customer relationships, licenses, and non-competition arrangements. Currently, all of our identifiable intangible assets have finite lives. Goodwill and intangible assets with indefinite lives are subject to an annual impairment review (or more frequent if impairment indicators arise) by applying a fair value-based test. There have been no such impairments.\nIdentifiable intangible assets with finite lives are subject to impairment testing and are reviewed for impairment when events or circumstances indicate that the carrying value of an asset is not recoverable and its carrying amount exceeds its fair value. We evaluate the recoverability of the carrying value of these identifiable intangible assets based on estimated undiscounted cash flows to be generated from such assets. If the cash flow estimates or the significant operating assumptions upon which they are based change in the future, we may be required to record additional impairment charges.\nThe valuation and classification of intangible assets and goodwill and the assignment of useful lives for purposes of amortization involves judgments and the use of estimates. The evaluation of these intangible assets and goodwill for impairment under established accounting principles is required on a recurring basis. Changes in business conditions could potentially require future adjustments to the assumptions made. When we determine that the useful lives of assets are shorter than we had originally estimated, we accelerate the rate of amortization over the assets’ new, shorter useful lives. No significant impairment charges or accelerated amortization were recorded for the years ended December 31, 2024, 2023, and 2022. A considerable amount of judgment is required in assessing impairment, which includes financial forecasts. If conditions are different from management’s current estimates, material write-downs of long-lived assets may be required, which would adversely affect our operating results.\nAccounting for income taxes.\n  Significant management judgment is required in determining our provision for income taxes, deferred tax assets and liabilities, and any valuation allowance recorded against net deferred tax assets in accordance with GAAP. These estimates and judgments occur in the calculation of tax credits, benefits, and deductions and in the calculation of certain tax assets and liabilities, which arise from differences in the timing of recognition of revenue and expense for tax and financial statement purposes, as well as the interest and penalties related to uncertain tax positions. Significant changes to these estimates may result in an increase or decrease in our tax provision in the current period or subsequent periods.\nAlso, we must assess the likelihood that we will be able to recover our deferred tax assets. In the event that all or part of our deferred tax assets are not recoverable in the future, we must increase our provision for taxes by recording a valuation allowance to reduce our deferred tax assets to the amount that is more likely than not to be recoverable. In order for our deferred tax assets to be recoverable, we must be able to generate sufficient taxable income in those jurisdictions where the deferred tax assets are located. We consider forecasted income, including income that may be generated as a result of certain tax planning strategies, together with future reversals of existing taxable temporary differences, in determining the need for a valuation allowance. As of December 31, 2024, we believe that it is more likely than not that our deferred tax assets will ultimately be recovered, with the exception primarily of our California deferred tax assets and a portion of our Swiss deferred tax assets. We believe that, due to the computation of California taxes under the single sales factor, it is more likely than not that our California deferred tax assets of $243.2 million will not be realized. Additionally, given certain limitations prescribed by the Swiss tax authority on the utilization of some of our Swiss deferred tax assets, we believe that it is more likely than not that $67.3 million of the Swiss deferred tax assets will not be realized based on the future forecasted income of our Swiss entity. Our ability to realize the deferred tax assets could be reduced in the future if our estimates of future forecasted income do not support the realization of our deferred tax assets. Should there be a change in our ability to realize our deferred tax assets, our tax provision would be affected in the period in which such change takes place.\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax regulations. We recognize liabilities for uncertain tax positions based on a two-step process. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. If we determine that a tax position will more likely than not be sustained on audit, then the second step requires us to estimate and measure the tax benefit as the largest amount that is more than 50% likely to be realized upon ultimate settlement. It is inherently difficult and subjective to estimate such amounts, as we have to determine the probability of various possible outcomes. We re-evaluate these uncertain tax positions on a quarterly basis. This evaluation is based on factors including, but not limited to, changes in facts or circumstances, changes in tax law, effective settlement of audit issues, and new audit activity. Such a change in the recognition or measurement would result in the recognition of a tax benefit or an additional charge to the tax provision.\nAccounting for legal contingencies\n.\n  \nFrom time to time, we are involved in a number of legal proceedings involving product liability, intellectual property, shareholder derivative actions, securities class actions, employment, and other matters. We record a liability and related charge to earnings in our Consolidated Financial Statements for legal contingencies when the loss is considered probable and the amount can be reasonably estimated. Our assessment is re-evaluated each period and is based on all available information, including discussion with any outside legal counsel that represents us. If a reasonable estimate of a known or probable loss cannot be made, but a range of probable losses can be estimated, the low-end of the range \n84\nTable\n of Contents\nof losses is recognized if no amount within the range is a better estimate than any other. If a material loss is reasonably possible, but not probable, and can be reasonably estimated, the estimated loss or range of loss is disclosed in the Notes to the Consolidated Financial Statements.\nWhen determining the estimated probable loss or range of losses, significant judgment is required to be exercised in order to estimate the amount and timing of the loss to be recorded. Estimates of probable losses resulting from litigation are inherently difficult to make, particularly when the matters are in early procedural stages with incomplete facts and information. The final outcome of legal proceedings is dependent on many variables and is difficult to predict and, therefore, the ultimate cost to entirely resolve such matters may be materially different than the amount of current estimates. Consequently, new information or changes in judgments and estimates could have a material adverse effect on our business, financial condition, and results of operations or cash flows.\nRECENT ACCOUNTING PRONOUNCEMENTS\nSee “Note 2. Summary of Significant Accounting Policies” of the Notes to Consolidated Financial Statements in “Item 8. Financial Statements and Supplementary Data” for additional information regarding recent accounting pronouncements, including the respective expected dates of adoption and estimated effects, if any, on our Consolidated Financial Statements.\n85\nTable\n of Contents",
  "item2": null
}