{
  "source_file": "it-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe purpose \nof this Management’s Discussion and Analysis (“MD&A”) is to facilitate an understanding of significant factors influencing the quarterly operating results, financial condition and cash flows of Gartner, Inc. Additionally, the MD&A conveys our expectations of the potential impact of known trends, events or uncertainties that may impact future results. You should read this discussion in conjunction with our Condensed Consolidated Financial Statements and related notes included in this Quarterly Report on Form 10-Q and our Annual Report on Form 10-K for the year ended December 31, 2024 (the “2024 Form 10-K”). Historical results and percentage relationships are not necessarily indicative of operating results for future periods. References to “Gartner,” the “Company,” “we,” “our” and “us” in this MD&A are to Gartner, Inc. and its consolidated subsidiaries.\nFORWARD-LOOKING STATEMENTS\nIn addition to historical inf\normation, this Quarterly Report on Form 10-Q contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements are any statements other than statements of historical fact, including statements regarding our expectations, beliefs, hopes, intentions, projections or strategies regarding the future. In some cases, forward-looking statements can be identified by the use of words such as “may,” “will,” “expect,” “should,” “could,” “believe,” “plan,” “anticipate,” “estimate,” “predict,” “potential,” “continue” or other words of similar meaning.\nWe operate i\nn a very competitive and rapidly changing environment that involves numerous known and unknown risks and uncertainties, some of which are beyond our control. Although we believe that the expectations reflected in any of our forward-looking statements are reasonable, actual results could differ materially from those projected or assumed in any of our forward-looking statements. Our future quarterly and annual revenues, operating income, results of operations and cash flows, as well as any forward-looking statement, are subject to change and to inherent risks and uncertainties, such as those disclosed or incorporated by reference in our filings with the Securities and Exchange Commission. Important factors that could cause our actual results, performance and achievements, or industry results to differ materially from estimates or projections contained in our forward-looking statements include, among others, the following: our ability to maintain and expand our products and services; our ability to keep pace with technological developments in artificial intelligence (“AI”) and comply with evolving AI regulations; our ability to achieve continued customer renewals and achieve new contract value, backlog and deferred revenue growth in light of competitive pressures; our ability to grow or sustain revenue from individual customers; our ability to expand or retain our customer base; our ability to carry out our strategic initiatives and manage associated costs; the timing of conferences and meetings, in particular our Gartner Symposium/Xpo series that normally occurs during the fourth quarter; our ability to achieve and effectively manage growth, including our ability to integrate our acquisitions and consummate and integrate future acquisitions; our ability to attract and retain a professional staff of analysts and consultants as well as experienced sales personnel upon whom we are dependent, especially in light of labor competition; our ability to successfully compete with existing competitors and potential new competitors; our ability to enforce and protect our intellectual property rights; the impact of cybersecurity incidents or other disruptions to our information systems; our ability to pay our debt obligations; the impact of global economic and geopolitical conditions, including inflation and recession; uncertain effects, both direct and indirect, of changes and volatility in tariffs and trade policies; risks associated with the creditworthiness, budget cuts, priorities and shutdown of governments and agencies; additional risks associated with international operations, including foreign currency fluctuations; the impact on our business resulting from changes in international conditions, including those resulting from the conflict in the Middle East, the war in Ukraine and current and future sanctions imposed by governments or other authorities; the impact of restructuring and other charges on our businesses and operations; our ability to meet sustainability commitments and comply with applicable regulatory requirements, as well as potential reactions by customers to these commitments; the impact of changes in tax policy (including global minimum tax legislation) and heightened scrutiny from various taxing authorities globally; changes to laws and regulations; and other risks and uncertainties. The potential fluctuations in our operating income could cause period-to-period comparisons of operating results not to be meaningful and could provide an unreliable indication of future operating results. A description of the risk factors associated with our business is included under “Risk Factors” in Item 1A. of the 2024 Form 10-K, which is incorporated herein by reference.\nForward-looking\n statements are subject to risks, estimates and uncertainties that could cause actual results to differ materially from those discussed in, or implied by, the forward-looking statements. Factors that might cause such a difference include, but are not limited to, those listed above or described under “Risk Factors” in Item 1A of the 2024 Form 10-K. Readers should not place undue reliance on these forward-looking statements, which reflect management’s opinion only as of the date on which they were made. Forward-looking statements in this Quarterly Report on Form 10-Q speak only as of the date hereof, and forward-looking statements in documents attached that are incorporated by reference speak only as of the date of those documents. Except as required by law, we disclaim any obligation to review or update these forward-looking statements to reflect events or circumstances as they occur.\n28\nBUSINESS OVERVIEW\nGartner, Inc. (NYSE: IT)\n delivers actionable, objective business and technology insights that drive smarter decisions and stronger performance on an organization’s mission-critical priorities. \nWe deliver our products and services globally through three reportable segments – Business and Technology Insights, Conferences and Consulting, as described below. In the second quarter of 2025, we renamed our segment previously referred to as Research to Business and Technology Insights (or “Insights”) to reflect the nature of the value we provide to clients. In the third quarter of 2025, we changed the structure of our internal organization and concluded that Gartner Digital Markets (\"Digital Markets\") was an operating segment but does not meet the criteria of a reportable segment. Accordingly, Digital Markets results are now included in \"Other\" where segment information is provided. Digital Markets was previously included in our Insights segment. Prior periods have been recast to conform to current period presentation. \n•\nInsights\n equips executives and their teams from every function and across all industries with actionable, objective business and technology insights, guidance and tools. Our experienced experts deliver all this value informed by an unmatched combination of practitioner-sourced and data-driven research to help our clients address their mission critical priorities.\n•\nConferences\n provides executives and teams across an organization the opportunity to learn, share and network. From our Gartner Symposium/Xpo series, to industry-leading conferences focused on specific business roles and topics, to peer-driven sessions, our offerings enable attendees to experience the best of Gartner insights and guidance.\n•\nConsulting\n serves senior executives leading technology-driven strategic initiatives leveraging the power of Gartner’s actionable, objective insights. Through custom analysis and on-the-ground support we enable optimized technology investments and stronger performance on our clients’ mission critical priorities.\nAs of September 30, 2025, we had 20,854 employees globally, a decrease of 0.6% from September 30, 2024.\nRecent Developments\nOur Insights contract value with the US federal government was approximately $165.0 million at September 30, 2025. Over 85% of our US federal contracts have transacted in the first three quarters of 2025, and slightly less than half of that contract value was retained. In addition to the non-renewals, we have received notices of termination-for-convenience from various US government agencies for approximately $8.0 million of contracts that are primarily scheduled to expire in the fourth quarter of 2025.\nAs the current geopolitical environment remains unpredictable, we continue to monitor and evaluate the impact, both direct and indirect, of government actions that could adversely impact our business operations and financial performance.\nOn July 4, 2025, the One Big Beautiful Bill Act (the “OBBBA”) was enacted in the U.S. The OBBBA includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework and the restoration of favorable tax treatment for certain business provisions. The legislation has multiple effective dates, with certain provisions effective in 2025 and others implemented through 2027. OBBBA did not have a material impact on our consolidated financial results in the current period. We are currently assessing and will continue to assess and reflect the impact of OBBBA on its future consolidated financial statements as appropriate.\nOur most recent annual impairment test of goodwill was a quantitative analysis conducted during the quarter ended September 30, 2025 that indicated an impairment of the Company's Digital Markets reporting unit. During the three months ended September 30, 2025, ongoing weakness in the market as well as changes in our internal organization structure prompted a revision to the long-term earnings forecast for the Digital Markets business. During the three months ended September 30, 2025, a goodwill impairment loss of $150.0 million was recognized in the Digital Markets reporting unit. The fair value of that reporting unit was estimated using a combination of the expected present value of future cash flows and market approach.\nBUSINESS MEASUREMENTS\nWe believe t\nhat the following business measurements are important performance indicators for our reportable business segments: \n29\nBUSINESS SEGMENT\nBUSINESS MEASUREMENT\nInsights\nContract value\n \nrepresents the dollar value attributable to all of our subscription-related contracts. It is calculated as the annualized value of all contracts in effect at a specific point in time, without regard to the duration of the contract. Contract value primarily includes Insights deliverables for which revenue is recognized on a ratable basis, as well as other deliverables (primarily Conferences tickets) for which revenue is recognized when the deliverable is utilized. Comparing contract value year-over-year not only measures the short-term growth of our business, but also signals the long-term health of our Insights subscription business since it measures revenue that is highly likely to recur over a multi-year period. Our contract value consists of \nGlobal Technology Sales\n contract value, which includes sales to users and providers of technology, and \nGlobal Business Sales\n contract value, which includes sales to all other functional leaders.\nClient retention rate\n \nrepresents a measure of client satisfaction and renewed business relationships at a specific point in time. Client retention is calculated on a percentage basis by dividing our current clients, who were also clients a year ago, by all clients from a year ago. Client retention is calculated at an enterprise level, which represents a single company or customer.\nWallet retention rate\n represents a measure of the amount of contract value we have retained with clients over a twelve-month period. Wallet retention is calculated on a percentage basis by dividing the contract value of our current clients, who were also clients a year ago, by the contract value from a year ago, excluding the impact of foreign currency exchange. When wallet retention exceeds client retention, it is an indication of retention of higher-spending clients, or increased spending by retained clients, or both. Wallet retention is calculated at an enterprise level, which represents a single company or customer.\nConferences\nNumber of destination conferences\n represents the total number of hosted in-person  conferences completed during the period. Single day, local meetings are excluded.\nNumber of destination conferences\n attendees\n represents the total number of people who attend in-person conferences. Single day, local meetings are excluded.\nConsulting\nConsulting backlog\n represents future revenue to be derived from in-process consulting and benchmark analytics engagements.\nUtilization rate\n represents a measure of productivity of our consultants. Utilization rates are calculated for billable headcount on a percentage basis by dividing total hours billed by total hours available to bill.\n30\nEXECUTIVE SUMMARY OF OPERATIONS AND FINANCIAL POSITION\nThe fundamentals of our strategy include a focus on creating actionable business and technology insights for executives and their teams, delivering innovative and highly differentiated product offerings, building a strong sales capability, providing world class client service with a focus on client engagement and retention, and continuously improving our operational effectiveness.\nWe had total revenues of $1.5 billion during the third quarter of 2025, an increase of 3% compared to the third quarter of 2024. During the third quarter of 2025, compared to the third quarter of 2024, revenues for Insights increased by 5%, Conferences revenue decreased by 2%, and Consulting revenue decreased by 3%. For a more complete discussion of our results by segment, see Segment Results below.\nFor the third quarter of 2025 and 2024, we had net income of $35.4 million and $415.0 million, respectively, and diluted net income per share of $0.47 and $5.32, respectively. The decrease in 2025 is primarily due to the goodwill impairment loss in 2025 and the gain on event cancellation insurance claims in 2024. Cash provided by operating activities was $1.0 billion and $1.1 billion during the nine months ended September 30, 2025 and 2024, respectively. As of September 30, 2025, we had $1.4 billion of cash and cash equivalents and approximately $0.7 billion of available borrowing capacity on our revolving credit facility. For a more complete discussion of our cash flows and financial position, see the Liquidity and Capital Resources section below.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nFor information regarding our critical accounting policies and estimates, please refer to Part II, Item 7, “Critical Accounting Policies and Estimates” contained in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. There have been no material changes to the critical accounting policies previously disclosed in that report. \nRECENTLY ISSUED ACCOUNTING STANDARDS\nThe FASB has issued accounting standards that have not yet become effective and that may impact the Company’s consolidated financial statements or its disclosures in future periods. Note 1 — Business and Basis of Presentation in the Notes to Condensed Consolidated Financial Statements provides information regarding those accounting standards.\n31\nRESULTS OF OPERATIONS\nConsolidated Results\nThe table below presents an analysis of selected line items and period-over-period changes in our interim Condensed Consolidated Statements of Operations for the periods indicated (in thousands).\nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\n Increase (Decrease)\nIncrease\n(Decrease)\n%\nRevenues:\nInsights\n$\n1,270,724 \n$\n1,209,524 \n$\n61,200 \n5 \n%\nConferences\n74,554 \n75,776 \n(1,222)\n(2)\nConsulting\n123,573 \n127,622 \n(4,049)\n(3)\nOther\n55,221 \n71,384 \n(16,163)\n(23)\nTotal revenues\n1,524,072 \n1,484,306 \n39,766 \n3 \nCosts and expenses:\n \n \n \n \nCost of services and product development\n474,218 \n475,342 \n(1,124)\n— \nSelling, general and administrative\n762,557 \n711,729 \n50,828 \n7 \nDepreciation\n30,733 \n29,082 \n1,651 \n6 \nAmortization of intangibles\n20,220 \n22,170 \n(1,950)\n(9)\nAcquisition and integration charges\n— \n159 \n(159)\nnm\nGoodwill impairment\n150,000 \n— \n150,000 \nnm\nOperating income\n86,344 \n245,824 \n(159,480)\n(65)\nInterest expense, net\n(16,279)\n(17,961)\n(1,682)\n(9)\nGain on event cancellation insurance claims\n— \n300,000 \n(300,000)\nnm\nOther (expense) income, net\n(583)\n(991)\n408 \n(41)\nLess: Provision for income taxes\n34,125 \n111,823 \n(77,698)\n(69)\nNet income\n$\n35,357 \n$\n415,049 \n$\n(379,692)\n(91)\n%\nnm = not meaningful\n32\n     \nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nIncrease (Decrease)\nIncrease\n(Decrease)\n%\nRevenues:\nInsights\n$\n3,789,798 \n$\n3,582,238 \n$\n207,560 \n6 \n%\nConferences\n358,558 \n331,929 \n26,629 \n8 \nConsulting\n418,873 \n405,291 \n13,582 \n3 \nOther\n177,427 \n232,834 \n(55,407)\n(24)\nTotal revenues\n4,744,656 \n4,552,292 \n192,364 \n4 \nCosts and expenses:\n \n \n \n \nCost of services and product development\n1,480,979 \n1,448,097 \n32,882 \n2 \nSelling, general and administrative\n2,269,753 \n2,113,633 \n156,120 \n7 \nDepreciation\n90,134 \n82,993 \n7,141 \n9 \nAmortization of intangibles\n62,318 \n68,100 \n(5,782)\n(8)\nAcquisition and integration charges\n— \n977 \n(977)\nnm\nGoodwill impairment\n150,000 \n— \n150,000 \nnm\nOperating income\n691,472 \n838,492 \n(147,020)\n(18)\nInterest expense, net\n(41,493)\n(57,170)\n(15,677)\n(27)\nGain on event cancellation insurance claims\n— \n300,000 \n(300,000)\nnm\nOther (expense) income, net\n4,304 \n4,404 \n(100)\n(2)\nLess: Provision for income taxes\n167,204 \n230,584 \n(63,380)\n(27)\nNet income\n$\n487,079 \n$\n855,142 \n$\n(368,063)\n(43)\n%\nnm = not meaningful\nIn addition to GAAP results, we provide foreign currency neutral dollar amounts and percentages for our revenues, certain expenses, contract values and other metrics. These foreign currency neutral dollar amounts and percentages eliminate the effects of exchange rate fluctuations and thus provide a more accurate and meaningful trend in the underlying business performance being measured. We calculate foreign currency neutral dollar amounts by converting the underlying amounts in local currency for different periods into U.S. dollars by applying the same foreign exchange rates to all periods presented.\nTotal revenues for the three months ended September 30, 2025 were $1.5 billion, an increase of $39.8 million, or 3% compared to the same period in 2024 on a reported basis and 1% excluding the foreign currency impact. Total revenues for the nine months ended September 30, 2025 were $4.7 billion, an increase of $0.2 billion, or 4% compared to the same period in 2024 on both a reported basis and excluding the foreign currency impact. Refer to the section of this MD&A below entitled “Segment Results” for a discussion of revenues and results by reportable segment.\nCost of services and product development was $474.2 million during the three months ended September 30, 2025, a decrease of $1.1 million compared to the same period in 2024, or nearly flat on a reported basis and a decrease of 1% excluding the foreign currency impact. The decrease in Cost of services and product development during the three months ended September 30, 2025 was primarily due to a $10.5 million decrease in product and content delivery expenses, partially offset by $10.0 million increase in personnel expenses associated with merit increases. Cost of services and product development as a percent of revenues was 31% and 32% for the three months ended September 30, 2025 and 2024, respectively. Cost of services and product development was $1.5 billion during the nine months ended September 30, 2025, an increase of $32.9 million compared to the same period in 2024, or 2% on both a reported basis and excluding the foreign currency impact. The increase in Cost of services and product development during the nine months ended September 30, 2025 was primarily due to a $43.6 million increase in personnel expenses associated with merit increases, partially offset by a $12.7 million decrease in product and content delivery expenses. Cost of services and product development as a percent of revenues was 31% and 32% for the nine months ended September 30, 2025 and 2024, respectively.\n33\nSelling, general and administrative (“SG&A”) expense was $762.6 million during the three months ended September 30, 2025, an increase of $50.8 million compared to the same period in 2024, or 7% and on a reported basis and 6% excluding the foreign currency impact. The increase in SG&A expense during the three months ended September 30, 2025 was primarily a result of a $33.3 million increase in personnel expenses, due to merit increases and increased headcount, as well as increased severance expenses. SG&A expense was $2.3 billion during the nine months ended September 30, 2025, an increase of $156.1 million compared to the same period in 2024, or 7% on both reported basis and excluding the foreign currency impact. The increase in SG&A expense during the nine months ended September 30, 2025 was primarily a result of an $114.9 million increase in personnel expenses, due to merit increases and increased headcount, as well as increased severance expenses. The number of quota-bearing sales associates in Global Technology Sales increased by 1% to 3,715 and in Global Business Sales, increased by 5% to 1,303 compared to September 30, 2024. On a combined basis, the total number of quota-bearing sales associates increased by 2% when compared to September 30, 2024. SG&A expense as a percent of revenues was 50% and 48% during the three months ended September 30, 2025 and 2024, respectively. SG&A expense as a percent of revenues was 48% and 46% during the nine months ended September 30, 2025 and 2024, respectively.\nDepreciation increased by 6% and 9% during the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024. The increase for the three and nine months ended September 30, 2025 was primarily due to increased software additions during the last twelve months.\nAmortization of intangibles decreased by 9% and 8% during the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, due to certain intangible assets becoming fully amortized in 2024.\nAcquisition and integration charges decreased by $0.2 million and $1.0 million during the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024.\nGoodwill impairment of $150.0 million during the three months ended September 30, 2025, reflected a goodwill impairment loss recognized in the Digital Markets reporting unit.\nOperating income was $86.3 million and $245.8 million during the three months ended September 30, 2025 and 2024, respectively. Operating income was $691.5 million and $838.5 million during the nine months ended September 30, 2025 and 2024, respectively. The decreases in operating income for the three and nine months ended September 30, 2025 as compared to the prior year periods were primarily due to the goodwill impairment loss of $150.0 million, as well as increases in selling, general and administrative expenses, partially offset by increased revenues. \nInterest expense, net decreased by $1.7 million and $15.7 million during the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024. The decrease for the three and nine months ended September 30, 2025 was due to increased interest income, primarily as a result of higher average cash balances than the prior year. \nGain on event cancellation insurance claims of $300.0 million during the three and nine months ended September 30, 2024 reflected proceeds from a settlement agreement to resolve litigation concerning the Company's event cancellation insurance for 2020 and 2021. The settlement resolved all remaining 2020 and 2021 event cancellation insurance claims.\nOther (expense) income, net for the periods presented herein included the net impact of foreign currency gains and losses from our hedging activities. Other (expense) income, net also included a loss of $2.9 million for the three months ended September 30, 2024 and a gain of $0.5 million and $2.2 million for the nine months ended September 30, 2025 and 2024, respectively, on de-designated interest rate swaps.\nThe provision for income taxes was $34.1 million and $111.8 million for the three months ended September 30, 2025 and 2024, respectively and $167.2 million and $230.6 million for the nine months ended September 30, 2025 and 2024, respectively. The effective income tax rate was 49.1% and 21.2% for the three months ended September 30, 2025 and 2024, respectively and 25.6% and 21.2% for the nine months ended September 30, 2025 and 2024, respectively. The increase in the effective income tax rate for both the three and nine months ended September 30, 2025 was primarily due to the impact of the goodwill impairment, which is not deductible for tax purposes.\nNet income\n for the three months ended September 30, 2025 and 2024 was $35.4 million and $415.0 million, respectively, while net income for the \nnine months ended \nSeptember 30, 2025 and 2024 was \n$487.1 million and $855.1 million\n, respectively. Our diluted net income per share during \nthe \nthree \nmonths ended September 30, 2025 decreased b\ny $4.85\n. The decreases in net income during the three and nine months ended September 30, 2025 were primarily due to the gain on event cancellation \n34\ninsurance claims in 2024, the goodwill impairment loss, and increases in operating expenses, partially offset by an increase in revenues and lower interest expense, net.\nSEGMENT RESULTS\nWe evaluate\n segment performance and allocate resources based on gross contribution margin. Gross contribution is defined as operating income or loss excluding certain Cost of services and product development expenses, SG&A expenses, Depreciation, Amortization of intangibles, Acquisition and integration charges and Goodwill impairment. Gross contribution margin is defined as gross contribution as a percent of revenues.\nReportable Segments\nThe sections below\n present the results of the Company’s three reportable business segments: Insights, Conferences and Consulting.\n35\nInsights\n \nAs Of And For The Three Months Ended September 30, 2025\nAs Of And For The Three Months Ended September 30, 2024\nIncrease\n(Decrease)\nPercentage\nIncrease\n(Decrease)\nAs Of And For The Nine Months Ended September 30, 2025\nAs Of And For The Nine Months Ended September 30, 2024\nIncrease\n(Decrease)\nPercentage\nIncrease\n(Decrease)\nFinancial Measurements:\n \n \n \n \nRevenues (1)\n$\n1,270,724\n$\n1,209,524\n$\n61,200 \n5 \n%\n$\n3,789,798 \n$\n3,582,238 \n$\n207,560 \n6 \n%\nGross contribution (1)\n$\n974,323\n$\n923,772\n$\n50,551 \n5 \n%\n$\n2,901,002 \n$\n2,742,711 \n$\n158,291 \n6 \n%\nGross contribution margin\n77 \n%\n76 \n%\n1 point\n— \n77 \n%\n77 \n%\n—\n— \nBusiness Measurements\n:\n \n \n \n \nContract Value (1), (3)\n$\n5,047,000\n$\n4,901,000\n$\n146,000 \n3 \n%\nGlobal Technology Sales (2): \nContract value (1), (3)\n$\n3,818,000\n$\n3,754,000\n$\n64,000 \n2 \n%\nClient retention \n84 \n%\n83 \n%\n1 point\n— \nWallet retention \n98 \n%\n101 \n%\n(3) points\n— \nGlobal Business Sales (2): \nContract value (1), (3)\n$\n1,229,000\n$\n1,147,000\n$\n82,000 \n7 \n%\nClient retention \n87 \n%\n87 \n%\n—\n— \nWallet retention \n102 \n%\n106 \n%\n(4) points\n— \n(1)\nDollars \nin thousands.\n(2)\nGlobal Technology Sales\n includes sales to users and providers of technology. Global Business Sales includes sales to all other functional leaders.\n(3)\nContract values \nare on a foreign currency neutral basis. Contract values as of September 30, 2024 have been calculated using the same foreign currency rates as 2025. \nInsights revenues i\nncreased by $61.2 million during the \nthree\n months ended September 30, 2025 compared to the same period in 2024, or 5% on a reported basis and 4% excluding the foreign currency impact. For the nine months ended September 30, 2025, Insights revenue increased by $207.6 million compared to the same period in 2024 or 6% on both a reported basis and excluding the foreign currency impact. The increase in revenues during 2025 was primarily due to Insights contract value growth in 2024. The segment gross contribution margin was 77% for both the three and nine months ended September 30, 2025 and 76% and 77% for the three and nine months ended September 30, \n2024, respectively.\nContract value increased to $5.0 billion at September 30, 2025, or 3% compared to September 30, 2024 excluding the foreign currency impact. The majority of industry sectors grew mid single-digit rates or faster. Growth was led by the energy, transportation and banking sectors, partially offset by a high single digit decrease in public sector, primarily related to the US federal government. Global Technology Sales (“GTS”) contract value increased by 2% at September 30, 2025 when compared to September 30, 2024. The increase in GTS contract value was primarily due to new business from existing clients. GTS contract value increased by mid single-digit rates or faster for all commercial enterprise sizes and nearly all industry sectors. Global Business Sales (“GBS”) contract value increased by 7% year-over-year, also primarily driven by new business from existing clients. The majority of our GBS practices, enterprise sizes and sectors grew high single-digits or faster year-over-year. Both GTS and GBS contract value growth were affected by decreases in contract value with the US federal government.\nGTS client retention was 84% and 83% as of September 30, 2025 and 2024, respectively, while wallet retention was 98% and 101% as of September 30, 2025 and 2024, respectively. GBS client retention was 87% as of both September 30, 2025 and 2024, while wallet retention was 102% and 106%, respectively. The decrease in GTS and GBS wallet retention was largely due to lower levels of spending by existing clients compared to the same period in 2024.\n36\nConferences \n \nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\nIncrease\n(Decrease)\nPercentage\nIncrease\n(Decrease)\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nIncrease\n(Decrease)\nPercentage\nIncrease\n(Decrease)\nFinancial Measurements:\n \n \n \n \nRevenues (1)\n$\n74,554 \n$\n75,776 \n$\n(1,222)\n(2)\n%\n$\n358,558 \n$\n331,929 \n$\n26,629 \n8 \n%\nGross contribution (1)\n$\n27,312 \n$\n30,489 \n$\n(3,177)\n(10)\n%\n$\n176,082 \n$\n161,856 \n$\n14,226 \n9 \n%\nGross contribution margin\n37 \n%\n40 \n%\n(3) points\n— \n49 \n%\n49 \n%\n—\n— \nBusiness Measurements:\n \n \n \n \nNumber of destination conferences (2)\n10 \n10 \n— \n— \n%\n39 \n38 \n1 \n3 \n%\nNumber of destination conferences attendees (2)\n11,454 \n12,208 \n(754)\n(6)\n%\n51,660 \n52,434 \n(774)\n(1)\n%\n(1)\nDollars in thousands.\n(2)\nSingle day, local meetings are excluded.\nConferences revenues decreased by $1.2 million during the three months ended September 30, 2025 compared to the same period in 2024, or 2% on a reported basis and 4% excluding the foreign currency impact. The decrease in revenues for the three months ended September 30, 2025 was primarily due to lower attendee revenue, as a result of two existing conferences being moved out and two new conferences being launched in the third quarter. We held 10 destination conferences during both the three months ended September 30, 2025 and 2024. Gross contribution decreased to $27.3 million during the three months ended September 30, 2025 compared to $30.5 million in the same period last year. The decrease in gross contribution during the three months ended September 30, 2025 was primarily the result of the decrease in revenues as well an increase in conference-related expenses as a result of higher headcount.\nFor the nine months ended September 30, 2025 Conferences revenues increased by $26.6 million compared to the same period in 2024, or 8% on a reported basis and 7% excluding the foreign currency impact. We held 39 and 38 destination conferences during the nine months ended September 30, 2025 and 2024, respectively. The increase in revenues for the nine months ended September 30, 2025 was primarily due to increased exhibitor revenue compared to the same period in 2024. Gross contribution increased to $176.1 million during the nine months ended September 30, 2025 compared to $161.9 million in the same period last year. The increase in gross contribution during the nine months ended September 30, 2025 was primarily the result of the increase in revenues, partially offset by an increase in conference-related expenses.\n37\nConsulting\n \nAs Of And For The Three Months Ended September 30, 2025\nAs Of And For The Three Months Ended September 30, 2024\nIncrease\n(Decrease)\nPercentage\nIncrease\n(Decrease)\nAs Of And For The Nine Months Ended September 30, 2025\nAs Of And For The Nine Months Ended September 30, 2024\nIncrease\n(Decrease)\nPercentage\nIncrease\n(Decrease)\nFinancial Measurements:\n \n \n \n \nRevenues (1) \n$\n123,573 \n$\n127,622 \n$\n(4,049)\n(3)\n%\n$\n418,873 \n$\n405,291 \n$\n13,582 \n3 \n%\nGross contribution (1) \n$\n35,222 \n$\n41,517 \n$\n(6,295)\n(15)\n%\n$\n150,169 \n$\n149,523 \n$\n646 \n— \n%\nGross contribution margin\n29 \n%\n33 \n%\n(4) points\n— \n36 \n%\n37 \n%\n(1) point\n— \nBusiness Measurements:\n \n \n \n \nBacklog (1), (2)\n$\n194,900 \n$\n213,800 \n$\n(18,900)\n(9)\n%\nBillable headcount\n924 \n960 \n(36)\n(4)\n%\nConsultant utilization\n60 \n%\n65 \n%\n(5) points\n— \n63 \n%\n66 \n%\n(3) points\n— \n(1)\nDollars in thousands.\n(2)\nBacklog is \non a foreign currency neutral basis. Backlog as of September 30, 2024 has been calculated using the same foreign currency rates as 2025.\nConsulting revenues\n decreased by 3% during the \nthree\n months ended September 30, 2025 compared to the same period in 2024 on a reported basis and 5% excluding the foreign currency impact, with a decrease in labor-based consulting revenue of 7% and an increase in contract optimization revenue of 12%, each on a reported basis. Contract optimization revenue may vary significantly and, as such, revenues for the third quarter of 2025 may not be indicative of results for the remainder of 2025 or beyond. The segment gross contribution margin was 29% and \n33%\n for the \nthree\n months ended September 30, 2025 and 2024, respectively. The decrease in gross contribution margin for the \nthree\n months ended September 30, 2025 was primarily due to the decrease in revenues.\nFor the nine months ended September 30, 2025, Consulting revenues increased 3% compared to the same period in 2024 on both a reported basis and excluding the foreign currency impact, with a decrease in labor-based consulting revenue of 3% and an increase in contract optimization revenue of 25%, each on a reported basis. The segment gross contribution margin was 36% and 37% for the nine months ended September 30, 2025 and 2024, respectively. \nBacklog\n decreased by $18.9 million, or 9%, from September 30, 2024 to September 30, 2025, excluding the foreign currency impact.\n38\nLIQUIDITY AND CAPITAL RESOURCES\nWe finance \nour operations through cash generated from our operating activities and, to a lesser extent, borrowings. Note 7 — Debt in the Notes to Condensed Consolidated Financial Statements provides additional information regarding the Company’s outstanding debt obligations. At September 30, 2025, we had $1.4 billion of cash and cash equivalents and approximately $0.7 billion of available borrowing capacity on the revolving credit facility under our 2024 Credit Agreement. We believe that the Company has adequate liquidity to meet its currently anticipated needs for both the next twelve months and the foreseeable future.\nWe have historically generated significant cash flows from our operating activities, benefiting from the favorable working capital dynamics of our subscription-based business model in our Insights segment, which is our largest business segment and historically has constituted a significant portion of our total revenues. The majority of our Insights customer contracts are paid in advance and, combined with a strong customer retention rate and high incremental margins, our subscription-based business model has resulted in continuously strong operating cash flow. Cash flow generation has also benefited from our ongoing efforts to improve the operating efficiencies of our businesses as well as a focus on the optimal management of our working capital as we increase sales.\nDuring the fourth quarter of 2024, we entered into an amended lease agreement to significantly reduce the square footage and reduce future lease payments at one of our leased locations. We made installment payments of $24.0 million during each of the fourth quarter of 2024 and the second quarter of 2025 in consideration for the lease amendment. \nOur cash and cash \nequivalents are held in numerous locations throughout the world with 69% held outside the U.S. at September 30, 2025. We intend to distribute a portion of the accumulated undistributed earnings of non-U.S. subsidiaries in conjunction with global restructuring activity and have recorded a modest tax expense for the anticipated impact of such distribution. We continue to assert our intention to reinvest substantially all remaining accumulated undistributed foreign earnings, except in instances where repatriation would result in minimal additional tax.\nThe table below\n summarizes the changes in our cash balances for the periods indicated (in thousands). \n \nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nIncrease\n(Decrease)\nCash provided by operating activities \n$\n995,821 \n$\n1,149,567 \n$\n(153,746)\nCash used in investing activities\n(91,310)\n(79,796)\n(11,514)\nCash used in financing activities\n(1,467,475)\n(615,557)\n(851,918)\nNet (decrease) increase in cash and cash equivalents and restricted cash\n(562,964)\n454,214 \n(1,017,178)\nEffects of exchange rates on cash and cash equivalents\n60,547 \n(5,521)\n66,068 \nBeginning cash and cash equivalents and restricted cash\n1,933,147 \n1,319,599 \n613,548 \nEnding cash and cash equivalents\n$\n1,430,730 \n$\n1,768,292 \n$\n(337,562)\nOperating\nCash provided by operating activities was $1.0 billion and $1.1 billion during the nine months ended September 30, 2025 and 2024, respectively. The year-over-year decrease was primarily due to $300.0 million of insurance proceeds received during 2024 partially offset by the improved timing of collections and lower income tax payments.\nInvesting\nCash used in investing activities was $91.3 million and $79.8 million during the nine months ended September 30, 2025 and 2024, respectively. The increase from 2024 to 2025 was primarily the result of higher leasehold improvements expenditures.\nFinancing\nCash used in financing activities was $1.5 billion and $615.6 million during the nine months ended September 30, 2025 and 2024, respectively. We used $1.5 billion and $633.4 million of cash for share repurchases during the nine months ended \n39\nSeptember 30, 2025 and 2024, respectively. In March 2024, the Company borrowed $274.4 million under the 2024 Credit Agreement. The initial borrowing was used to repay the outstanding amounts under the 2020 Credit Agreement. \nDebt \nAs of September 30, 2025, the Company had $2.5 billion of principal amount of debt outstanding. Note 7 — Debt in the Notes to Condensed Consolidated Financial Statements provides additional information regarding the Company’s outstanding debt obligations. From time to time, the Company may seek to retire or repurchase its outstanding debt through various methods including open market repurchases, negotiated block transactions, or otherwise, all or some of which may be effected through Rule 10b5-1 plans. Such transactions, if any, depend on prevailing market conditions, our liquidity and capital requirements, contractual restrictions, and other factors, and may involve material amounts.\nOFF BALANCE SHEET ARRANGEMENTS\nFrom January 1, 2025 through September 30, 2025, the Company has not entered into any material off-balance sheet arrangements or transactions with unconsolidated entities or other persons. \n40"
}