{
  "source_file": "itw-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\n Management's Discussion and Analysis of Financial Condition and Results of Operations\nINTRODUCTION\nIllinois Tool Works Inc. (the \"Company\" or \"ITW\") is a global manufacturer of a diversified range of industrial products and equipment. As of December 31, 2024, the Company had 86 divisions with approximately 44,000 people in 51 countries.\nThe Company's operations are organized and managed based on similar product offerings and end markets, and are reported to senior management as the following seven segments: Automotive OEM; Food Equipment; Test & Measurement and Electronics; Welding; Polymers & Fluids; Construction Products; and Specialty Products.\nDue to the large number of diverse businesses and the Company's decentralized operating structure, the Company does not require its businesses to provide detailed information on operating results. Instead, the Company's corporate management collects data on several key measurements: operating revenue, operating income, operating margin, variable cost of revenue, overhead expenses, number of months on hand in inventory, days sales outstanding in accounts receivable, past due receivables and return on invested capital. These key measures are monitored by management and significant changes in operating results versus current trends in end markets and variances from forecasts are discussed with operating unit management.\nTHE ITW BUSINESS MODEL\nThe powerful and highly differentiated ITW Business Model is the Company's core source of value creation. It is the Company's competitive advantage and defines how ITW creates value for its shareholders. The ITW Business Model is comprised of three unique elements:\n•\nITW's \n80/20 Front-to-Back\n process is the operating system that is applied in every ITW business. Initially introduced as a manufacturing efficiency tool in the 1980s, ITW has continually refined, improved and expanded 80/20 into a proprietary, holistic business management process that generates significant value for the Company and its customers. Through the application of data driven insights generated by 80/20 practice, ITW focuses on its largest and best opportunities (the \"80\") and eliminates cost, complexity and distractions associated with the less profitable opportunities (the \"20\"). 80/20 enables ITW businesses to consistently achieve world-class operational excellence in product availability, quality, and innovation, while generating superior financial performance;\n•\nCustomer-back Innovation\n has fueled decades of profitable growth at ITW. The Company's unique innovation approach is built on insight gathered from the 80/20 Front-to-Back process. Working from the customer back, ITW businesses position themselves as the go-to problem solver for their \"80\" customers. ITW's innovation efforts are focused on understanding customer needs, particularly those in \"80\" markets with solid long-term growth fundamentals, and creating unique solutions to address those needs. These customer insights and learnings drive innovation at ITW and have contributed to a portfolio of approximately 20,900 granted and pending patents;\n•\nITW's \nDecentralized, Entrepreneurial Culture\n enables ITW businesses to be fast, focused, and responsive. ITW businesses have significant flexibility within the framework of the ITW Business Model to customize their approach in order to best serve their specific customers' needs. ITW colleagues recognize their unique responsibilities to execute the Company's strategy and values. As a result, the Company maintains a focused and simple organizational structure that, combined with outstanding execution, delivers best-in-class services and solutions adapted to each business' customers and end markets.\nENTERPRISE STRATEGY: 2012 - 2023\nIn late 2012, ITW began its strategic framework transitioning the Company to fully leverage the unique and powerful set of capabilities and operating practices of the ITW Business Model. The Company undertook a complete review of its performance, focusing on its businesses delivering consistent above-market growth with best-in-class margins and returns, and developing a strategy to replicate that performance across its operations. ITW determined that solid and consistent above-market organic growth is the core growth engine to deliver world-class financial performance and compelling long-term returns for its shareholders.\nKey initiatives in the Company's enterprise strategy included portfolio management, business structure simplification, strategic sourcing and the diligent re-application of ITW's proprietary 80/20 Front-to-Back process.\n•\nAs part of the Portfolio Management initiative, ITW exited businesses that were operating in commoditized market spaces and prioritized sustainable differentiation as a must-have requirement for all ITW businesses. This process \n19\nincluded both divesting entire businesses and exiting commoditized product lines and customers inside otherwise highly differentiated ITW divisions.\n•\nBusiness Structure Simplification was implemented to simplify and scale up ITW's operating structure to support increased engineering, marketing, and sales resources, and improve global reach and competitiveness, all of which were critical to driving accelerated organic growth. ITW now has 86 scaled-up divisions with significantly enhanced focus on growth investments, core customers and products, and customer-back innovation.\n•\nThe Strategic Sourcing initiative established sourcing as a core strategic and operational capability at ITW, delivering an average of one percent reduction in spend each year since 2013 and continues to be a key contributor to the Company's ongoing enterprise strategy.\n•\nWith the initial portfolio realignment and scale-up work largely completed, the Company shifted its focus to preparing for and accelerating organic growth, reapplying the 80/20 Front-to-Back process to optimize its scaled-up divisions for growth, first, to build a foundation of operational excellence, and second, to identify the best opportunities to drive organic growth.\nSince implementing the Company's enterprise strategy in 2012, the Company has demonstrated the compelling performance potential of the ITW Business Model and superior 80/20 management, resulting in meaningful incremental improvement in margins and returns as evidenced by the Company's operating margin and after-tax return on invested capital. At the same time, these 80/20 initiatives may also result in restructuring initiatives that reduce costs and improve profitability and returns.\nOUR NEXT PHASE: 2024 - 2030\nIn the Next Phase of the Company’s evolution, the ITW Business Model and the Enterprise Strategy framework will be as formidable of a competitive advantage and performance differentiator as it has been over the last decade, if not more so. Volatility, risk and the pace of change in the global operating environment will continue to increase, and a decentralized entrepreneurial culture allows the Company to be a fast adaptor – to read, react, respond and evolve. The Company’s ability to consistently execute and invest through the ups and downs of the business cycle is now a defining competitive advantage.\nThroughout the Next Phase, the Company's focus is to build organic growth into a core ITW strength on par with the Company’s world-class financial performance and operational capabilities. Throughout this phase, the Company will sustain its foundational strengths built over the past decade, including the high-quality ITW Business Model practice. Customer-back Innovation (\"CBI\") is the most impactful driver to achieve high-quality organic growth through the cycle by establishing trusted problem solver relationships with key customers to effectively invent solutions that address customers' most critical pain points or tackle the biggest growth opportunities. CBI successes, coupled with underlying market growth and share gains, are how the Company intends to achieve its high-quality organic growth.\nITW will continue to drive 80/20 Front-to-Back practice excellence in every division in the Company, every day. Driving strong operational excellence in the quality of 80/20 Front-to-Back practice across the Company, division by division, will produce further customer-facing performance improvement in a number of divisions and additional structural margin expansion at the enterprise level.\nPortfolio Discipline\nThe Company only operates in industries where it can generate significant, long-term competitive advantage from the ITW Business Model. ITW businesses have the right \"raw material\" in terms of market and business attributes that best fit the ITW Business Model and have significant potential to drive above-market organic growth over the long-term.\nThe Company focuses on high-quality businesses, ensuring it operates in markets with positive long-term macro fundamentals and with customers that have critical needs and value ITW's differentiated products, services and solutions. ITW's portfolio operates in highly diverse end markets and geographies which makes the Company more resilient in the face of uncertain or volatile market environments.\nThe Company routinely evaluates its portfolio to ensure it delivers sustainable differentiation and drives consistent long-term performance. This includes both implementing portfolio refinements and assessing selective high-quality acquisitions to supplement ITW's long-term growth potential.\n20\nTERMS USED BY ITW\nManagement uses the following terms to describe the financial results of operations of the Company:\n•\nOrganic business\n - acquired businesses that have been included in the Company's results of operations for more than 12 months on a constant currency basis.\n•\nOperating leverage\n - the estimated effect of the organic revenue volume changes on organic operating income, assuming variable margins remain the same as the prior period.\n•\nPrice/cost \n-\n \nrepresents the estimated net impact of increases or decreases in the cost of materials used in the Company's products versus changes in the selling price to the Company's customers.\n•\nProduct line simplification (\"PLS\") \n- focuses businesses on eliminating the complexity and overhead costs associated with smaller product lines and customers, and focuses businesses on supporting and growing their largest customers and product lines. In the short-term, PLS may result in a decrease in revenue and overhead costs while improving operating margin. In the long-term, PLS is expected to result in growth in revenue, profitability, and returns.\nUnless otherwise stated, the changes in financial results in the consolidated results of operations and the results of operations by segment represent the current year period versus the comparable period in the prior year. The following discussion of operating results should be read in conjunction with Item 7 - Management's Discussion and Analysis of Financial Condition and Results of Operations in the Company's 2024 Annual Report on Form 10-K.\nCONSOLIDATED RESULTS OF OPERATIONS\nDuring the first quarter of 2022, Russian military forces invaded Ukraine. In response, the United States and several other countries imposed economic and other sanctions on Russia. The Company has four immaterial Russian subsidiaries with total assets of approximately $36 million as of September 30, 2025. The revenue for these four subsidiaries for the three and nine months ended September 30, 2025 was approximately $5 million and $17 million, respectively. These subsidiaries are not material to the Company’s results of operations or financial position.\nOn January 2, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $57 million, net of cash acquired. On April 1, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $59 million, net of cash acquired. The Company has completed the allocation of purchase price for both of these acquisitions. These acquisitions were not material, individually or in the aggregate, to the Company’s results of operations, financial position or cash flows. Refer to Note 2. Acquisitions in Item 1. Financial Statements for further information regarding these acquisitions.\nDuring the first quarter of 2024, the Company changed the method used to determine the cost of inventory at certain U.S. businesses from LIFO to the FIFO method, as the Company believes the FIFO method is preferable because it provides a more consistent method for valuing inventory across the Company’s operations, improves comparability with peers, and better reflects the current value of inventories at the balance sheet date. The LIFO provision for the year ended December 31, 2023 was $6 million of expense, and was not material to the Company’s results of operations, financial position or cash flows. \nTherefore, the Company recorded the pre-tax cumulative effect of this change in accounting method of $117 million as a reduction of Cost of revenue in the first quarter of 2024. \nRefer to Note 1. Significant Accounting Policies in Item 1. Financial Statements for additional information regarding this change in accounting method.\nOn April 2, 2025, the United States government announced additional tariffs on goods imported to the U.S. from numerous countries. In response, certain countries retaliated with additional counter-tariffs or are working to negotiate with the U.S government regarding tariffs. Tariffs on goods from many countries became effective on August 1, 2025. The Company believes it is well positioned to minimize the impact of these tariffs because its businesses generally manufacture products in the markets where they are sold and the Company expects to recover the increased cost of tariffs through price increases. However, current tariff policies have introduced additional uncertainty and may negatively impact overall demand from the Company's customers. The Company continues to assess the impact of the tariffs and actions that can be taken to moderate and/or minimize their effects on the Company.\nOn July 4, 2025, the One Big Beautiful Bill Act (the \"Act\") was enacted in the United States. The provisions of the Act extend and modify certain provisions of the 2017 Tax Cuts and Jobs Act. While the provisions of the Act are not expected to have a material impact on the Company's operating results, financial position or cash flows for the twelve months ending December 31, 2025, the Company is assessing the potential impact of the Act on future periods.\n21\nIn an uncertain external environment, the Company delivered solid financial results in the third quarter and year-to-date periods of 2025 primarily due to the continued successful execution of enterprise initiatives and continued focus on the highly differentiated ITW Business Model.\nOperating Revenue\nRefer to the \"Results of Operations for Total Company\" and the \"Results of Operations by Segment\" sections for discussion of changes in operating revenue for the third quarter and year-to-date periods of 2025 compared to 2024.\nOperating Expenses\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\nDollars in millions\n2025\n2024\n2025\n2024\nOperating Revenue\n$\n4,059 \n$\n3,966 \n$\n11,951 \n$\n11,966 \nCost of revenue\n$\n2,253 \n$\n2,230 \n$\n6,685 \n$\n6,637 \n Percent of operating revenue\n55.5 \n%\n56.2 \n%\n55.9 \n%\n55.5 \n%\nSelling, administrative, and research and development expenses\n$\n676 \n$\n658 \n$\n2,075 \n$\n2,020 \n Percent of operating revenue\n16.6 \n%\n16.6 \n%\n17.4 \n%\n16.9 \n%\nAmortization and impairment of intangible assets\n$\n18 \n$\n26 \n$\n60 \n$\n76 \n Percent of operating revenue\n0.5 \n%\n0.6 \n%\n0.5 \n%\n0.6 \n%\nCost of revenue was $2.25 billion and $2.23 billion in the third quarter of 2025 and 2024, respectively, an increase of 1.0%, primarily due to higher revenue. Cost of revenue as a percent of operating revenue was lower in the third quarter of 2025 compared to 2024 primarily due to benefits from the Company's enterprise initiatives, partially offset by higher employee-related expenses. In the year-to-date period, Cost of revenue was $6.69 billion and $6.64 billion in 2025 and 2024, respectively, an increase of 0.7%. Excluding the first quarter 2024 LIFO accounting method change of $117 million, Cost of revenue decreased 1.0% in 2025 compared to 2024 primarily due to lower revenue and the effect of foreign currency translation. Cost of revenue, excluding the first quarter 2024 LIFO accounting method change, as a percent of operating revenue was lower in the year-to-date period of 2025 compared to 2024 primarily due to benefits from the Company's enterprise initiatives, partially offset by higher employee-related expenses.\nSelling, administrative, and research and development expenses were $676 million and $658 million in the third quarter of 2025 and 2024, respectively, and $2.08 billion and $2.02 billion in the year-to-date period of 2025 and 2024, respectively. Selling, administrative, and research and development expenses as a percent of operating revenue were flat in the third quarter as benefits from the Company's enterprise initiatives were offset by higher employee-related expenses. Selling, administrative, and research and development expenses as a percent of operating revenue were higher in the year-to-date period of 2025 compared to 2024 primarily due to higher employee-related expenses, partially offset by benefits from the Company's enterprise initiatives.\nAmortization and impairment of intangible assets was lower in the third quarter and year-to-date periods of 2025 compared to 2024 primarily due to fully amortized intangible assets.\nRefer to the \"Results of Operations for Total Company\" and the \"Results of Operation by Segment\" sections for additional discussion of operating results for the third quarter and year-to-date periods of 2025 compared to 2024.\n22\nRESULTS OF OPERATIONS FOR TOTAL COMPANY\nThe Company's consolidated results of operations for the third quarter and year-to-date periods of 2025 and 2024 were as follows:\nThree Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign \nCurrency\nTotal\nOperating revenue\n$\n4,059 \n$\n3,966 \n2.3 \n%\n0.7 \n%\n— \n%\n— \n%\n1.6 \n%\n2.3 \n%\nOperating income\n$\n1,112 \n$\n1,052 \n5.7 \n%\n4.6 \n%\n— \n%\n(0.4)\n%\n1.5 \n%\n5.7 \n%\nOperating margin %\n27.4 \n%\n26.5 \n%\n90 bps\n100 bps\n— \n(10) bps\n— \n90 bps\nNine Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign \nCurrency\nTotal\nOperating revenue\n$\n11,951 \n$\n11,966 \n(0.1)\n%\n(0.4)\n%\n— \n%\n— \n%\n0.3 \n%\n(0.1)\n%\nOperating income\n$\n3,131 \n$\n3,233 \n(3.2)\n%\n(3.3)\n%\n(0.1)\n%\n— \n%\n0.2 \n%\n(3.2)\n%\nOperating margin %\n26.2 \n%\n27.0 \n%\n(80) bps\n(70) bps\n— \n— \n(10) bps\n(80) bps\n•\nOperating revenue increased in the third quarter due to the favorable effect of foreign currency translation and higher organic revenue. In the year-to-date period, operating revenue declined due to lower organic revenue, partially offset by the favorable effect of foreign currency translation.\n•\nOrganic revenue increased 0.7% in the third quarter as growth in the Automotive OEM, Welding, Specialty Products and Food Equipment segments was partially offset by a decline in the Polymers & Fluids, Construction Products and Test & Measurement and Electronics segments. In the year-to-date period, organic revenue declined 0.4% as a decrease in the Construction Products, Test & Measurement and Electronics and Polymers & Fluids segments was partially offset by growth in the Automotive OEM, Welding, Food Equipment and Specialty Products segments. Product line simplification activities reduced organic revenue by 70 basis points and 60 basis points in the third quarter and year-to-date periods, respectively.\n◦\nNorth American organic revenue was flat in the third quarter as an increase in the Welding, Automotive OEM and Food Equipment segments was offset by a decline in the Polymers & Fluids, Test & Measurement and Electronics, Construction Products and Specialty Products segments. In the year-to-date period, organic revenue declined 1.7% as a decrease in the Test & Measurement and Electronics, Construction Products, Automotive OEM and Polymers & Fluids segments was partially offset by growth in the Food Equipment, Specialty Products and Welding segments.\n◦\nEurope, Middle East and Africa organic revenue declined 1.2% in the third quarter as a decrease in Test & Measurement and Electronics, Polymers & Fluids, Construction Products and Food Equipment segments was partially offset by an increase in the Specialty Products, Automotive OEM and Welding segments. In the year-to-date period, organic revenue decreased 2.3% as a decline in five segments was partially offset by an increase in the Welding and Specialty Products segments.\n◦\nAsia Pacific organic revenue increased 6.7% in the third quarter and 7.5% in the year-to-date period primarily due to growth in the Automotive OEM segment. Organic revenue in China grew 10.1% in the third quarter and 12.2% in the year-to-date period as growth in the Automotive OEM, Test & Measurement and Electronics, Welding and Polymers and Fluids segments was partially offset by a decrease in the Food Equipment and Construction Products segments. Organic revenue for the Specialty Products segment decreased 1.8% in the third quarter and grew 4.5% in the year-to-date period.\n•\nOperating income of $1.1 billion increased 5.7% in the third quarter compared to the prior year. In the year-to-date period, operating income of $3.1 billion declined 3.2%, or increased 0.5% excluding the $117 million favorable impact of the first quarter 2024 LIFO accounting method change.\n•\nOperating margin was 27.4% in the third quarter. The increase of 90 basis points was primarily due to benefits from the Company's enterprise initiatives of 140 basis points, partially offset by higher employee-related expenses, including higher health and welfare expenses.\n•\nIn the year-to-date period, operating margin of 26.2% decreased 80 basis points. Excluding the 100 basis points of favorable impact from the first quarter 2024 LIFO accounting method change, operating margin increased 20 basis points compared to the prior year primarily driven by benefits from the Company's enterprise initiatives of 130 basis points, partially offset by higher employee-related expenses, including higher health and welfare expenses.\n23\n•\nThe Company's effective tax rate for the third quarter of 2025 and 2024 was 21.8% and 14.9%, respectively, and 22.7% and 20.4% for the year-to-date periods of 2025 and 2024, respectively. The effective tax rates for the third quarter and year-to-date periods of 2025 benefited from a discrete tax benefit of $43 million related to the estimated U.S. federal tax liability for 2024, partially offset by a $16 million discrete tax expense related primarily to the resolution of a foreign tax audit. Additionally, the effective tax rate for the year-to-date period of 2025 included a discrete tax benefit of $21 million in the first quarter of 2025 related to the reversal of a valuation allowance on net operating loss carryforwards. The effective tax rates for the third quarter and year-to-date periods of 2024 benefited from discrete income tax benefits in the third quarter of 2024 of $107 million related to the utilization of capital loss carryforwards upon the sale of Wilsonart and $87 million related to a reorganization of the Company's intellectual property, partially offset by a $73 million discrete tax expense related to the remeasurement of unrecognized tax benefits associated with various intercompany transactions. Refer to Note 3. Sale of Noncontrolling Interest in Wilsonart International Holdings LLC in Item 1. Financial Statements for more information regarding the Wilsonart transaction. Additionally, the effective tax rates for 2025 and 2024 included discrete tax benefits related to excess tax benefits from stock-based compensation of $2 million and $1 million for the third quarter of 2025 and 2024, respectively, and $7 million and $11 million for the year-to-date periods of 2025 and 2024, respectively.\n•\nDiluted earnings per share (EPS) of $2.81 for the third quarter of 2025 decreased 28.1%, or increased 6.0% excluding the favorable impact of $1.26 from the third quarter 2024 sale of the Company's noncontrolling interest in Wilsonart. In the year-to-date period, EPS of $7.77 decreased 15.3%, or increased 2.0% excluding the favorable effect of the first quarter 2024 LIFO accounting method change of $0.30 and the favorable impact of $1.25 from the third quarter 2024 Wilsonart transaction. Additionally, the third quarter and year-to-date periods of 2025 included $0.09 from the third quarter discrete tax benefit previously discussed.\n•\nThe Company repurchased approximately 1.5 million and 4.5 million shares of its common stock in the third quarter and year-to-date periods of 2025, respectively, for approximately $375 million and $1.1 billion, respectively.\nRESULTS OF OPERATIONS BY SEGMENT\nTotal operating revenue and operating income for the third quarter and year-to-date periods of 2025 and 2024 were as follows:\nThree Months Ended September 30,\nNine Months Ended September 30,\nDollars in millions\nOperating Revenue\nOperating Income\nOperating Revenue\nOperating Income\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nAutomotive OEM\n$\n830 \n$\n772 \n$\n182 \n$\n150 \n$\n2,461 \n$\n2,403 \n$\n513 \n$\n469 \nFood Equipment\n694 \n677 \n202 \n193 \n2,001 \n1,975 \n557 \n537 \nTest & Measurement and Electronics\n698 \n697 \n177 \n179 \n2,036 \n2,071 \n473 \n501 \nWelding\n477 \n462 \n156 \n149 \n1,428 \n1,404 \n468 \n458 \nPolymers & Fluids\n441 \n448 \n126 \n125 \n1,308 \n1,334 \n361 \n364 \nConstruction Products\n473 \n479 \n149 \n145 \n1,389 \n1,471 \n424 \n436 \nSpecialty Products\n452 \n438 \n146 \n136 \n1,342 \n1,327 \n429 \n410 \nTotal segments\n4,065 \n3,973 \n1,138 \n1,077 \n11,965 \n11,985 \n3,225 \n3,175 \nIntersegment revenue\n(6)\n(7)\n— \n— \n(14)\n(19)\n— \n— \nUnallocated\n— \n— \n(26)\n(25)\n— \n— \n(94)\n58 \nTotal\n$\n4,059 \n$\n3,966 \n$\n1,112 \n$\n1,052 \n$\n11,951 \n$\n11,966 \n$\n3,131 \n$\n3,233 \nSegments are allocated a fixed overhead charge based on the segment's revenue. Expenses not charged to the segments are reported separately as Unallocated. Because the Unallocated category includes a variety of items, it is subject to fluctuations on a quarterly and annual basis. Unallocated in the nine months ended September 30, 2025 included higher employee-related expenses, including higher health and welfare expenses, as compared to the prior year. Unallocated in the nine months ended September 30, 2024 included the favorable pre-tax cumulative effect of the LIFO accounting method change of $117 million in the first quarter of 2024. Refer to Note 1. Significant Accounting Policies in Item 1. Financial Statements for additional information regarding this change in accounting method.\n24\nAUTOMOTIVE OEM\nThis segment is a global, niche supplier to top tier OEMs, providing unique innovation to address pain points for sophisticated customers with complex problems. Businesses in this segment produce components and fasteners for automotive-related applications. This segment primarily serves the automotive original equipment manufacturers and tiers market. Products in this segment include:\n•\nplastic and metal components, fasteners and assemblies for automobiles, light trucks and other industrial uses.\nThe results of operations for the Automotive OEM segment for the third quarter and year-to-date periods of 2025 and 2024 were as follows:\nThree Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n830 \n$\n772 \n7.3 \n%\n5.0 \n%\n— \n%\n— \n%\n2.3 \n%\n7.3 \n%\nOperating income\n$\n182 \n$\n150 \n21.0 \n%\n19.0 \n%\n— \n%\n(0.5)\n%\n2.5 \n%\n21.0 \n%\nOperating margin %\n21.8 \n%\n19.4 \n%\n240 bps\n260 bps\n— \n(20) bps\n— \n240 bps\nNine Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n2,461 \n$\n2,403 \n2.4 \n%\n2.0 \n%\n— \n%\n— \n%\n0.4 \n%\n2.4 \n%\nOperating income\n$\n513 \n$\n469 \n9.2 \n%\n9.6 \n%\n— \n%\n(0.9)\n%\n0.5 \n%\n9.2 \n%\nOperating margin %\n20.8 \n%\n19.5 \n%\n130 bps\n150 bps\n— \n(20) bps\n— \n130 bps\n•\nOperating revenue increased in the third quarter and year-to-date periods due to higher organic revenue and the favorable effect of foreign currency translation.\n•\nOrganic revenue increased 5.0% in the third quarter and 2.0% in the year-to-date period compared to worldwide auto builds which grew 4% in the third quarter and year-to-date periods. Product line simplification activities reduced organic revenue by 140 basis points in the third quarter and 130 basis points in the year-to-date period.\n◦\nNorth American organic revenue increased 3.1% and declined 3.2% in the third quarter and year-to-date periods, respectively, compared to North American auto builds which increased 5% in the third quarter and declined 1% in the year-to-date period, primarily due to product line simplification activities.\n◦\nEuropean organic revenue grew 2.0% in the third quarter and decreased 1.4% in the year-to-date period compared to European auto builds which increased 1% in the third quarter and declined 2% in the year-to-date period. The business outperformed the market primarily due to market penetration gains.\n◦\nAsia Pacific organic revenue increased 10.7% and 13.2% in the third quarter and year-to-date periods, respectively. China organic revenue grew 10.1% and 15.1% in the third quarter and year-to-date periods, respectively, including growth in the electric vehicles market, versus China auto builds which grew 10% in the third quarter and increased 12% in the year-to-date period. Auto builds of foreign automotive manufacturers in China decreased 2% and 4% in the third quarter and year-to-date periods, respectively. The business outperformed the market primarily due to market penetration gains.\n•\nOperating margin was 21.8% in the third quarter. The increase of 240 basis points was primarily due to benefits from the Company's enterprise initiatives and favorable operating leverage of 90 basis points, partially offset by higher employee-related expenses, continued investment in the business and higher restructuring expenses of 20 basis points.\n•\nIn the year-to-date period, operating margin of 20.8% increased 130 basis points primarily driven by benefits from the Company's enterprise initiatives and favorable operating leverage of 40 basis points, partially offset by higher employee-related expenses, continued investment in the business and higher restructuring expenses of 20 basis points.\n25\nFOOD EQUIPMENT\nThis segment is a highly focused and branded industry leader in commercial food equipment differentiated by innovation and integrated service offerings. This segment primarily serves the food service, food retail and food institutional/restaurant markets. Products in this segment include:\n•\nwarewashing equipment;\n•\ncooking equipment, including ovens, ranges and broilers;\n•\nrefrigeration equipment, including refrigerators, freezers and prep tables;\n•\nfood processing equipment, including slicers, mixers and scales;\n•\nkitchen exhaust, ventilation and pollution control systems; and\n•\nfood equipment service, maintenance and repair.\nThe results of operations for the Food Equipment segment for the third quarter and year-to-date periods of 2025 and 2024 were as follows:\nThree Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n694 \n$\n677 \n2.5 \n%\n0.7 \n%\n— \n%\n— \n%\n1.8 \n%\n2.5 \n%\nOperating income\n$\n202 \n$\n193 \n5.1 \n%\n2.7 \n%\n— \n%\n0.7 \n%\n1.7 \n%\n5.1 \n%\nOperating margin %\n29.2 \n%\n28.4 \n%\n80 bps\n60 bps\n— \n20 bps\n— \n80 bps\nNine Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n2,001 \n$\n1,975 \n1.3 \n%\n0.9 \n%\n— \n%\n— \n%\n0.4 \n%\n1.3 \n%\nOperating income\n$\n557 \n$\n537 \n3.8 \n%\n2.9 \n%\n— \n%\n0.5 \n%\n0.4 \n%\n3.8 \n%\nOperating margin %\n27.8 \n%\n27.2 \n%\n60 bps\n50 bps\n— \n10 bps\n— \n60 bps\n•\nOperating revenue increased in the third quarter due to the favorable effect of foreign currency translation and higher organic revenue. In the year-to-date period, operating revenue grew due to higher organic revenue and the favorable effect of foreign currency translation. \n•\nOrganic revenue increased 0.7% in the third quarter as equipment organic revenue decreased 0.5% and service organic revenue grew 2.7%. In the year-to-date period, organic revenue grew 0.9% as equipment organic revenue declined 0.2% and service organic revenue increased 2.8%. \n◦\nNorth American organic revenue increased 1.9% in the third quarter. Equipment organic revenue increased 0.8% primarily due to higher demand in the institutional, independent restaurant and quick serve restaurant end markets, partially offset by lower demand in the food retail end market. Service organic revenue grew 3.5%. In the year-to-date period, North American organic revenue grew 2.4%. Equipment organic revenue grew 1.2% primarily due to higher demand in the institutional end market, partially offset by a decline in the full service and food retail end markets. Service organic revenue increased 4.3%.\n◦\nInternational organic revenue declined 1.2% in the third quarter. Equipment organic revenue decreased 2.3% primarily due to lower demand in the European cooking and refrigeration end markets and lower demand in Asia, partially offset by growth in the European warewash end market. Service organic revenue grew 1.2%. In the year-to-date period, international organic revenue decreased 1.5%. Equipment organic revenue declined 2.3% primarily driven by lower demand in the European cooking and refrigeration end markets and lower demand in Asia, partially offset by higher demand in the European warewash end market. Service organic revenue increased 0.2%.\n•\nOperating margin was 29.2% in the third quarter. The increase of 80 basis points was primarily due to benefits from the Company's enterprise initiatives and favorable operating leverage of 10 basis points, partially offset by higher employee-related expenses and additional investment in the business.\n•\nIn the year-to-date period, operating margin of 27.8% increased 60 basis points primarily driven by benefits from the Company's enterprise initiatives and favorable operating leverage of 20 basis points, partially offset by higher employee-related expenses and additional investment in the business.\n26\nTEST & MEASUREMENT AND ELECTRONICS\nThis segment is a branded and innovative producer of test and measurement and electronic manufacturing and maintenance, repair, and operations, or \"MRO\" solutions that improve efficiency and quality for customers in diverse end markets. Businesses in this segment produce equipment, consumables, and related software for testing and measuring of materials and structures, as well as equipment and consumables used in the production of electronic subassemblies and microelectronics. This segment primarily serves the electronics, general industrial, automotive original equipment manufacturers and tiers, energy, industrial capital goods and consumer durables markets. Products in this segment include:\n•\nequipment, consumables, and related software for testing and measuring of materials, structures, gases and fluids;\n•\nelectronic assembly equipment;\n•\nelectronic components and component packaging;\n•\nstatic control equipment and consumables used for contamination control in clean room environments; and\n•\npressure sensitive adhesives and components for electronics, medical, transportation and telecommunications applications.\nThe results of operations for the Test & Measurement and Electronics segment for the third quarter and year-to-date periods of 2025 and 2024 were as follows:\nThree Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n698 \n$\n697 \n0.3 \n%\n(1.4)\n%\n— \n%\n— \n%\n1.7 \n%\n0.3 \n%\nOperating income\n$\n177 \n$\n179 \n(0.7)\n%\n(0.1)\n%\n— \n%\n(1.9)\n%\n1.3 \n%\n(0.7)\n%\nOperating margin %\n25.4 \n%\n25.7 \n%\n(30) bps\n30 bps\n— \n(50) bps\n(10) bps\n(30) bps\nNine Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n2,036 \n$\n2,071 \n(1.6)\n%\n(2.5)\n%\n— \n%\n— \n%\n0.9 \n%\n(1.6)\n%\nOperating income\n$\n473 \n$\n501 \n(5.6)\n%\n(4.4)\n%\n(0.4)\n%\n(1.3)\n%\n0.5 \n%\n(5.6)\n%\nOperating margin %\n23.2 \n%\n24.2 \n%\n(100) bps\n(50) bps\n(10) bps\n(30) bps\n(10) bps\n(100) bps\n•\nOperating revenue increased in the third quarter due to the favorable effect of foreign currency translation, partially offset by lower organic revenue. In the year-to-date period, operating revenue declined due to lower organic revenue, partially offset by the favorable effect of foreign currency translation.\n•\nOn April 1, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $59 million, net of cash acquired. Refer to Note 2. Acquisitions in Item 1. Financial Statements for additional information regarding this acquisition.\n•\nOrganic revenue decreased 1.4% in the third quarter and 2.5% in the year-to-date period primarily due to lower demand in the MTS Test & Simulation business and in the general industrial end market, partially offset by higher demand in the semiconductor end market. \n◦\nOrganic revenue for the test and measurement businesses decreased 0.6% in the third quarter and declined 4.3% in the year-to-date period primarily driven by a decline in the MTS Test & Simulation business and in the general industrial end market, partially offset by higher demand in the semiconductor end market, primarily in Asia Pacific and North America. \n◦\nElectronics organic revenue decreased 1.9% in the third quarter with lower demand across all major regions primarily due to lower demand in the semiconductor end market. In the year-to-date period, organic revenue grew 1.5% primarily due to higher demand in Asia Pacific and Europe, primarily in the semiconductor end market, partially offset by lower demand in North America. The electronics assembly businesses declined 9.2% in the third quarter and decreased 3.7% in the year-to-date period primarily due to lower demand in North America. The other electronics businesses, which include the contamination control, static control and pressure sensitive adhesives businesses, grew 1.0% in the third quarter primarily due to higher demand in North America. In the year-to-date period, organic revenue increased 3.5% with growth across all major regions.\n•\nOperating margin was 25.4% in the third quarter. The decrease of 30 basis points was primarily due to higher restructuring expenses of 50 basis points, unfavorable operating leverage of 30 basis points, higher employee-related \n27\nexpenses and product mix, partially offset by benefits from the Company's enterprise initiatives and lower intangible asset amortization expense.\n•\nIn the year-to-date period, operating margin of 23.2% decreased 100 basis points primarily driven by unfavorable operating leverage of 80 basis points, higher employee-related expenses, higher restructuring expenses of 30 basis points and product mix, partially offset by benefits from the Company's enterprise initiatives and lower intangible asset amortization expense.\nWELDING\nThis segment is a branded value-added equipment and specialty consumable manufacturer with innovative and leading technology. Businesses in this segment produce arc welding equipment, consumables and accessories for a wide array of industrial and commercial applications. This segment primarily serves the general industrial market, which includes fabrication, shipbuilding and other general industrial markets, and construction, energy, MRO, industrial capital goods and automotive original equipment manufacturers and tiers markets. Products in this segment include:\n•\narc welding equipment; and\n•\nmetal arc welding consumables and related accessories.\nThe results of operations for the Welding segment for the third quarter and year-to-date periods of 2025 and 2024 were as follows:\nThree Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n477 \n$\n462 \n3.3 \n%\n2.8 \n%\n— \n%\n— \n%\n0.5 \n%\n3.3 \n%\nOperating income\n$\n156 \n$\n149 \n4.5 \n%\n4.9 \n%\n— \n%\n(0.7)\n%\n0.3 \n%\n4.5 \n%\nOperating margin %\n32.6 \n%\n32.3 \n%\n30 bps\n60 bps\n— \n(20) bps\n(10) bps\n30 bps\nNine Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,428 \n$\n1,404 \n1.7 \n%\n1.9 \n%\n— \n%\n— \n%\n(0.2)\n%\n1.7 \n%\nOperating income\n$\n468 \n$\n458 \n2.3 \n%\n2.3 \n%\n— \n%\n0.1 \n%\n(0.1)\n%\n2.3 \n%\nOperating margin %\n32.8 \n%\n32.6 \n%\n20 bps\n10 bps\n— \n10 bps\n— \n20 bps\n•\nOperating revenue grew in the third quarter due to higher organic revenue and the favorable effect of foreign currency translation. In the year-to-date period, operating revenue grew due to higher organic revenue, partially offset by the unfavorable effect of foreign currency translation.\n•\nOrganic revenue increased 2.8% in the third quarter as equipment grew 5.5% and consumables declined 1.7%. In the year-to-date period, organic revenue grew 1.9% as equipment increased 3.6% and consumables decreased 0.9%.\n◦\nNorth American organic revenue increased 2.5% in the third quarter as the industrial end market grew 3.1%, partially offset by a decline of 2.3% in the commercial end market. In the year-to-date period, organic revenue grew 0.4% as the industrial end market increased 1.3%, partially offset by a decrease of 2.9% in the commercial end market.\n◦\nInternational organic revenue grew 4.0% in the third quarter and 9.6% in the year-to-date period primarily due to higher demand in Asia Pacific and the Middle East.\n•\nOperating margin was 32.6% in the third quarter. The increase of 30 basis points was primarily due to benefits from the Company's enterprise initiatives, favorable operating leverage of 50 basis points and favorable price/cost of 20 basis points, partially offset by higher employee-related expenses and higher restructuring expenses of 20 basis points.\n•\nIn the year-to-date period, operating margin of 32.8% increased 20 basis points compared to the prior year primarily due to benefits from the Company's enterprise initiatives, favorable operating leverage of 30 basis points and favorable price/cost of 20 basis points, partially offset by higher employee-related expenses. \n28\nPOLYMERS & FLUIDS\nThis segment is a branded supplier to niche markets that require value-added, differentiated products. Businesses in this segment produce engineered adhesives, sealants, lubrication and cutting fluids, and fluids and polymers for auto aftermarket maintenance and appearance. This segment primarily serves the automotive aftermarket, general industrial and MRO markets. Products in this segment include:\n•\nadhesives for industrial, construction and consumer purposes;\n•\nchemical fluids which clean or add lubrication to machines;\n•\nepoxy and resin-based coating products for industrial applications;\n•\nhand wipes and cleaners for industrial applications;\n•\nfluids, polymers and other supplies for auto aftermarket maintenance and appearance;\n•\nfillers and putties for auto body repair; and\n•\npolyester coatings and patch and repair products for the marine industry.\nThe results of operations for the Polymers & Fluids segment for the third quarter and year-to-date periods of 2025 and 2024 were as follows:\nThree Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n441 \n$\n448 \n(1.8)\n%\n(3.1)\n%\n— \n%\n— \n%\n1.3 \n%\n(1.8)\n%\nOperating income\n$\n126 \n$\n125 \n0.3 \n%\n(1.0)\n%\n— \n%\n— \n%\n1.3 \n%\n0.3 \n%\nOperating margin %\n28.5 \n%\n27.9 \n%\n60 bps\n60 bps\n— \n— \n— \n60 bps\nNine Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,308 \n$\n1,334 \n(2.0)\n%\n(1.8)\n%\n— \n%\n— \n%\n(0.2)\n%\n(2.0)\n%\nOperating income\n$\n361 \n$\n364 \n(1.0)\n%\n(0.7)\n%\n— \n%\n0.2 \n%\n(0.5)\n%\n(1.0)\n%\nOperating margin %\n27.6 \n%\n27.3 \n%\n30 bps\n30 bps\n— \n— \n— \n30 bps\n•\nOperating revenue decreased in the third quarter due to lower organic revenue, partially offset by the favorable effect of foreign currency translation. In the year-to-date period, operating revenue declined due to lower organic revenue and the unfavorable effect of foreign currency translation.\n•\nOrganic revenue decreased 3.1% in the third quarter and 1.8% in the year-to-date period. Product line simplification activities reduced organic revenue by 70 basis points and 60 basis points in the third quarter and year-to-date periods, respectively.\n◦\nOrganic revenue for the polymers businesses decreased 4.9% in the third quarter due to lower demand in Europe and North America, partially offset by an increase in Asia Pacific. In the year-to-date period, organic revenue declined 1.7% as a decrease in North America and Europe was partially offset by an increase in South America and Asia Pacific.\n◦\nOrganic revenue for the fluids businesses declined 0.4% in the third quarter primarily driven by lower demand in North America, partially offset by growth in Europe, primarily due to higher demand in the hygiene end market. In the year-to-date period, organic revenue decreased 1.0% primarily due to lower demand in North America, partially offset by growth in Europe, primarily due to higher demand in the hygiene end market.\n◦\nOrganic revenue for the automotive aftermarket businesses decreased 3.3% in the third quarter and declined 2.1% in the year-to-date period primarily due to lower demand in the North American body, tire and engine repair businesses, partially offset by higher demand in the car care business in North America and the tire repair business in Europe.\n•\nOperating margin was 28.5% in the third quarter. The increase of 60 basis points was primarily due to benefits from the Company's enterprise initiatives, favorable price/cost of 50 basis points and product mix, partially offset by unfavorable operating leverage of 60 basis points and higher employee-related expenses.\n29\n•\nIn the year-to-date period, operating margin of 27.6% increased 30 basis points primarily driven by benefits from the Company's enterprise initiatives and product mix, partially offset by higher employee-related expenses and unfavorable operating leverage of 30 basis points.\nCONSTRUCTION PRODUCTS\nThis segment is a branded supplier of innovative engineered fastening systems and solutions. This segment primarily serves the residential construction, renovation/remodel and commercial construction markets. Products in this segment include:\n•\nfasteners and related fastening tools for wood and metal applications;\n•\nanchors, fasteners and related tools for concrete applications;\n•\nmetal plate truss components and related equipment and software; and\n•\npackaged hardware, fasteners, anchors and other products for retail.\nThe results of operations for the Construction Products segment for the third quarter and year-to-date periods of 2025 and 2024 were as follows:\nThree Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n473 \n$\n479 \n(1.4)\n%\n(2.3)\n%\n— \n%\n— \n%\n0.9 \n%\n(1.4)\n%\nOperating income\n$\n149 \n$\n145 \n3.1 \n%\n2.5 \n%\n— \n%\n(0.1)\n%\n0.7 \n%\n3.1 \n%\nOperating margin %\n31.6 \n%\n30.2 \n%\n140 bps\n150 bps\n— \n— \n(10) bps\n140 bps\nNine Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,389 \n$\n1,471 \n(5.6)\n%\n(5.6)\n%\n— \n%\n— \n%\n— \n%\n(5.6)\n%\nOperating income\n$\n424 \n$\n436 \n(2.7)\n%\n(4.0)\n%\n— \n%\n1.3 \n%\n— \n%\n(2.7)\n%\nOperating margin %\n30.6 \n%\n29.6 \n%\n100 bps\n50 bps\n— \n50 bps\n— \n100 bps\n•\nOperating revenue decreased in the third quarter due to lower organic revenue, partially offset by the favorable effect of foreign currency translation. In the year-to-date period, operating revenue declined due to lower organic revenue. \n•\nOrganic revenue decreased 2.3% in the third quarter and 5.6% in the year-to-date period due to lower demand across all major regions. Product line simplification activities reduced organic revenue by 130 basis points in the third quarter and 100 basis points in the year-to-date period.\n◦\nNorth American organic revenue decreased 1.1% in the third quarter and 5.8% in the year-to-date period primarily due to lower demand in the residential and commercial end markets. Organic revenue in the United States residential end market declined 0.2% and 6.8% in the third quarter and year-to-date periods, respectively. The commercial end market decreased 3.9% in the third quarter and 1.4% in the year-to-date period. Organic revenue in Canada declined 7.3% in the third quarter and 1.1% in the year-to-date period.\n◦\nInternational organic revenue decreased 3.6% in the third quarter and 5.3% in the year-to-date period. European organic revenue declined 3.4% in the third quarter and 3.5% in the year-to-date period primarily due to lower demand in the commercial and residential end markets. Asia Pacific organic revenue decreased 3.9% in the third quarter and 7.5% in the year-to-date period primarily due to lower demand in the Australia and New Zealand residential end markets.\n•\nOperating margin was 31.6% in the third quarter. The increase of 140 basis points was primarily due to benefits from the Company's enterprise initiatives, partially offset by unfavorable price/cost of 50 basis points, unfavorable operating leverage of 40 basis points and higher employee-related expenses.\n•\nIn the year-to-date period, operating margin of 30.6% increased 100 basis points primarily driven by benefits from the Company's enterprise initiatives and lower restructuring expenses of 50 basis points, partially offset by unfavorable operating leverage of 110 basis points, unfavorable price/cost of 40 basis points and higher employee-related expenses.\n30\nSPECIALTY PRODUCTS\nThis segment is focused on diversified niche market opportunities with substantial patent protection producing beverage packaging equipment and consumables, product coding and marking equipment and consumables, and appliance components and fasteners. This segment primarily serves the food and beverage, consumer durables, general industrial, airlines, industrial capital goods and printing and publishing markets. Products in this segment include:\n•\nconveyor systems and line automation for the food and beverage industries;\n•\nplastic consumables that multi-pack cans and bottles and related equipment;\n•\nfoil, film and related equipment used to decorate consumer products;\n•\nproduct coding and marking equipment and related consumables;\n•\nplastic and metal closures and components for appliances;\n•\nairport ground support equipment; and\n•\ncomponents for medical devices.\nThe results of operations for the Specialty Products segment for the third quarter and year-to-date periods of 2025 and 2024 were as follows:\nThree Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n452 \n$\n438 \n3.3 \n%\n1.6 \n%\n— \n%\n— \n%\n1.7 \n%\n3.3 \n%\nOperating income\n$\n146 \n$\n136 \n7.3 \n%\n5.5 \n%\n— \n%\n0.2 \n%\n1.6 \n%\n7.3 \n%\nOperating margin %\n32.3 \n%\n31.1 \n%\n120 bps\n120 bps\n— \n10 bps\n(10) bps\n120 bps\nNine Months Ended\nDollars in millions\nSeptember 30,\nComponents of Increase (Decrease)\n2025\n2024\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,342 \n$\n1,327 \n1.1 \n%\n0.9 \n%\n— \n%\n— \n%\n0.2 \n%\n1.1 \n%\nOperating income\n$\n429 \n$\n410 \n4.6 \n%\n4.4 \n%\n— \n%\n0.1 \n%\n0.1 \n%\n4.6 \n%\nOperating margin %\n32.0 \n%\n30.9 \n%\n110 bps\n110 bps\n— \n— \n— \n110 bps\n•\nOperating revenue increased in the third quarter and year-to-date periods due to higher organic revenue and the favorable effect of foreign currency translation.\n•\nOrganic revenue increased 1.6% in the third quarter as equipment sales grew 14.2% and consumables decreased 1.8%. In the year-to-date period, organic revenue grew 0.9% as equipment sales increased 5.8% and consumables declined 0.5%. Product line simplification activities reduced organic revenue by 90 basis points in the third quarter and 110 basis points in the year-to-date period.\n◦\nNorth American organic revenue decreased 0.9% in the third quarter primarily driven by a decline in the consumer packaging, strength films and appliance businesses, partially offset by growth in the filter medical and specialty films businesses. In the year-to-date period, organic revenue grew 0.8% primarily due to growth in the specialty films and ground support equipment businesses, partially offset by a decline in the graphics and strength films businesses.\n◦\nInternational organic revenue grew 6.5% in the third quarter primarily due to growth in the European ground support equipment, graphics, consumer packaging equipment and filter medical businesses, partially offset by a decline in the appliance business. In the year-to-date period, organic revenue increased 1.3% primarily driven by growth in the European ground support equipment and filter medical businesses and growth in Asia Pacific, partially offset by a decline in the European appliance business.\n•\nOperating margin was 32.3% in the third quarter. The increase of 120 basis points was primarily due to benefits from the Company's enterprise initiatives, favorable price/cost of 40 basis points and favorable operating leverage of 20 basis points, partially offset by higher employee-related expenses and product mix.\n•\nIn the year-to-date period, operating margin of 32.0% increased 110 basis points primarily driven by benefits from the Company's enterprise initiatives, favorable price/cost of 30 basis points and favorable operating leverage of 20 basis points, partially offset by higher employee-related expenses and product mix.\n31\nOTHER FINANCIAL HIGHLIGHTS\n•\nInterest expense was $75 million and $217 million in the third quarter and year-to-date periods of 2025, respectively, versus $69 million and $215 million in the third quarter and year-to-date periods of 2024, respectively. Refer to Note 10. Debt in Item 1. Financial Statements for further information regarding the Company's outstanding debt.\n•\nOther income (expense) was income of $12 million in the third quarter of 2025 versus $379 million in the prior year period, and $28 million in the year-to-date period of 2025 versus $421 million in the prior year period. On August 5, 2024, the Company entered into a purchase agreement with affiliates of CD&R for the sale of the Company's noncontrolling equity interest in Wilsonart. The transaction closed immediately after the execution of the purchase agreement. Proceeds from the transaction, net of transaction costs, were $395 million, resulting in a pre-tax gain of $363 million. Refer to Note 3. Sale of Noncontrolling Interest in Wilsonart International Holdings LLC in Item 1. Financial Statements for additional information regarding this transaction. Excluding the Wilsonart pre-tax gain, other income (expense) in the third quarter of 2025 decreased $4 million compared to the third quarter of 2024 and decreased $30 million in the year-to-date period primarily due to higher foreign currency transaction losses in 2025. \nNEW ACCOUNTING PRONOUNCEMENTS\nInformation regarding new accounting pronouncements is included in Note 1. Significant Accounting Policies in Item 1. Financial Statements.\nLIQUIDITY AND CAPITAL RESOURCES\nThe Company's primary sources of liquidity are free cash flow and short-term credit facilities. As of September 30, 2025, the Company had $924 million of cash and equivalents on hand and no outstanding borrowings under its $\n3.0 billion\n revolving credit facility. The Company also has maintained strong access to public debt markets. Management believes that these sources are sufficient to service debt and to finance the Company's capital allocation priorities, which include:\n•\ninternal investments to support organic growth and sustain core businesses;\n•\npayment of an attractive dividend to shareholders; and\n•\nexternal investments in selective strategic acquisitions that support the Company's organic growth focus and an active share repurchase program.\nThe Company believes that, based on its operating revenue, operating margin, free cash flow, and credit ratings, it could readily obtain additional financing, if necessary.\n32\nCash Flow\nThe Company uses free cash flow to measure cash flow generated by operations that is available for dividends, share repurchases, acquisitions and debt repayment. The Company believes this non-GAAP financial measure is useful to investors in evaluating the Company's financial performance and measures the Company's ability to generate cash internally to fund Company initiatives. Free cash flow represents net cash provided by operating activities less additions to plant and equipment. Free cash flow is a measurement that is not the same as net cash flow from operating activities per the statement of cash flows and may not be consistent with similarly titled measures used by other companies. Summarized cash flow information for the third quarter and year-to-date periods of 2025 and 2024 was as follows:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\nIn millions\n2025\n2024\n2025\n2024\nNet cash provided by operating activities\n$\n1,021 \n$\n891 \n$\n2,163 \n$\n2,167 \nAdditions to plant and equipment\n(117)\n(108)\n(314)\n(319)\nFree cash flow\n$\n904 \n$\n783 \n$\n1,849 \n$\n1,848 \nCash dividends paid\n$\n(438)\n$\n(415)\n$\n(1,318)\n$\n(1,252)\nRepurchases of common stock\n(375)\n(375)\n(1,125)\n(1,125)\nAcquisition of businesses (excluding cash and equivalents)\n— \n— \n1 \n(115)\nProceeds from sale of noncontrolling interest in Wilsonart International Holdings LLC\n— \n395 \n— \n395 \nNet proceeds from (repayments of) debt with original maturities of three months or less\n25 \n(333)\n489 \n(199)\nProceeds from debt with original maturities of more than three months\n— \n— \n— \n1,606 \nRepayments of debt with original maturities of more than three months\n— \n— \n— \n(1,295)\nOther, net\n14 \n9 \n41 \n31 \nEffect of exchange rate changes on cash and equivalents\n6 \n21 \n39 \n(12)\nNet increase (decrease) in cash and equivalents\n$\n136 \n$\n85 \n$\n(24)\n$\n(118)\nStock Repurchase Programs\nOn August 4, 2023, the Company announced a new stock repurchase program which provides for the repurchase of up to $5.0 billion of the Company's common stock over an open-ended period of time (the \"2023 Program\"). Under the 2023 Program, the Company repurchased approximately 38,000 shares of its common stock at an average price of $263.44 per share in the fourth quarter of 2023, approximately 1.4 million shares of its common stock at an average price of $259.07 per share in the first quarter of 2024, approximately 1.6 million shares of its common stock at an average price of $247.42 in the second quarter of 2024, approximately 1.5 million shares of its common stock at an average price of $244.88 in the third quarter of 2024, approximately 1.4 million shares of its common stock at an average price of $265.95 in the fourth quarter of 2024, approximately 1.5 million shares of its common stock at an average price of $257.14 in the first quarter of 2025, approximately 1.5 million shares of its common stock at an average price of $241.19 in the second quarter of 2025, and approximately 1.5 million shares of its common stock at an average price of $260.58 in the third quarter of 2025. As of September 30, 2025, there were approximately $2.4 billion of authorized repurchases remaining under the 2023 Program.\n33\nAfter-tax Return on Average Invested Capital\nThe Company uses after-tax return on average invested capital (\"After-tax ROIC\") to measure the effectiveness of its operations' use of invested capital to generate profits. After-tax ROIC is not defined under U.S. generally accepted accounting principles (\"GAAP\"). After-tax ROIC is a non-GAAP financial measure that the Company believes is a meaningful metric to investors in evaluating the Company's ability to generate returns from cash invested in its operations and may be different than the method used by other companies to calculate After-tax ROIC. The Company defines After-tax ROIC as operating income after taxes divided by average invested capital, which is annualized when presented in interim periods. Operating income after taxes is a non-GAAP measure consisting of net income before interest expense and other income (expense), on an after-tax basis, which are excluded as they do not represent returns generated by the Company's operations. For comparability, the Company also excluded the net discrete tax benefit of $27 million in the third quarter of 2025 from net income and the effective tax rate for the three and nine months ended September 30, 2025. Additionally, for comparability, the Company also excluded the discrete tax benefit of $21 million in the first quarter of 2025 from net income and the effective tax rate for the nine months ended September 30, 2025. Also, for comparability, the Company excluded the net discrete tax benefit of $121 million in the third quarter of 2024 from net income and the effective tax rate for the three and nine months ended September 30, 2024. Total invested capital represents the net assets of the Company, other than cash and equivalents and outstanding debt which do not represent capital investment in the Company's operations. The most comparable GAAP measure to operating income after taxes is net income. Net income to average invested capital and After-tax ROIC for the third quarter and year-to-date periods of 2025 and 2024 were as follows:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\nDollars in millions\n2025\n2024\n2025\n2024\nNumerator:\nNet Income\n$\n821 \n$\n1,160 \n$\n2,276 \n$\n2,738 \nNet discrete tax benefit related to the third quarter 2025\n(27)\n— \n(27)\n— \nDiscrete tax benefit related to the first quarter 2025\n— \n— \n(21)\n— \nNet discrete tax benefit related to the third quarter 2024\n— \n(121)\n— \n(121)\nInterest expense, net of tax\n (1)\n57 \n53 \n165 \n164 \nOther (income) expense, net of tax \n(1)\n(10)\n(288)\n(22)\n(320)\nOperating income after taxes\n$\n841 \n$\n804 \n$\n2,371 \n$\n2,461 \nDenominator:\nInvested capital:\nCash and equivalents\n$\n924 \n$\n947 \n$\n924 \n$\n947 \nTrade receivables\n3,255 \n3,226 \n3,255 \n3,226 \nInventories\n1,725 \n1,817 \n1,725 \n1,817 \nNet plant and equipment\n2,203 \n2,071 \n2,203 \n2,071 \nGoodwill and intangible assets\n5,568 \n5,597 \n5,568 \n5,597 \nAccounts payable and accrued expenses\n(2,175)\n(2,211)\n(2,175)\n(2,211)\nDebt\n(8,942)\n(8,346)\n(8,942)\n(8,346)\nOther, net\n651 \n291 \n651 \n291 \nTotal net assets (stockholders' equity)\n3,209 \n3,392 \n3,209 \n3,392 \nCash and equivalents\n(924)\n(947)\n(924)\n(947)\nDebt\n8,942 \n8,346 \n8,942 \n8,346 \nTotal invested capital\n$\n11,227 \n$\n10,791 \n$\n11,227 \n$\n10,791 \nAverage invested capital \n(2)\n$\n11,293 \n$\n10,682 \n$\n10,863 \n$\n10,466 \nNet income to average invested capital \n(3)\n29.1 \n%\n43.4 \n%\n27.9 \n%\n34.9 \n%\nAfter-tax return on average invested capital \n(3)\n29.8 \n%\n30.0 \n%\n29.1 \n%\n31.3 \n%\n34\n(1)    \nEffective tax rate used for interest expense and other (income) expense for the three months ended September 30, 2025 and 2024 was 24.3% and 23.7%, respectively. Effective tax rate used for interest expense and other (income) expense for the nine months ended September 30, 2025 and 2024 was 24.3% and 23.9%, respectively.\n(2)    \nAverage invested capital is calculated using the total invested capital balances at the start of the period and at the end of each quarter within each of the periods presented.\n(3)    \nReturns for the three months ended September 30, 2025 and 2024 were converted to an annual rate by multiplying the calculated return by 4. Returns for the nine months ended September 30, 2025 and 2024 were converted to an annual rate by dividing the calculated return by 3 and multiplying it by 4.\nA reconciliation of the tax rate for the three and nine month periods ended September 30, 2025, excluding the third quarter 2025 net discrete tax benefit of $27 million, which included a favorable discrete tax benefit of $43 million related to the estimated U.S. federal tax liability for 2024, partially offset by a $16 million discrete tax expense related primarily to the resolution of a foreign tax audit, and excluding the first quarter 2025 discrete tax benefit of $21 million related to the reversal of a valuation allowance on net operating loss carryforwards, is as follows:\nThree Months Ended\nNine Months Ended\nSeptember 30, 2025\nSeptember 30, 2025\nDollars in millions\nIncome Taxes\nTax Rate\nIncome Taxes\nTax Rate\nAs reported\n$\n228 \n21.8 \n%\n$\n666 \n22.7 \n%\nNet Discrete tax benefit related to the third quarter 2025\n27 \n2.5 \n%\n27 \n0.9 \n%\nDiscrete tax benefit related to the first quarter 2025\n— \n— \n%\n21 \n0.7 \n%\nAs adjusted\n$\n255 \n24.3 \n%\n$\n714 \n24.3 \n%\nAfter-tax ROIC for the nine months ended September 30, 2024 included 110 basis points of favorable impact related to the cumulative effect of the change from the LIFO method of accounting to the FIFO method for certain U.S. businesses ($117 million pre-tax, or $88 million after-tax) in the first quarter of 2024. Refer to Note 1. Significant Accounting Policies in Item 1. Financial Statements for additional information regarding this change in accounting method.\nA reconciliation of the tax rate for the three and nine month periods ended September 30, 2024, excluding the third quarter 2024 net discrete tax benefit of $121 million, which included favorable discrete tax benefits of $107 million related to the utilization of capital loss carryforwards upon the sale of Wilsonart and $87 million related to a reorganization of the Company's intellectual property, partially offset by a $73 million discrete tax expense related to the remeasurement of unrecognized tax benefits associated with various intercompany transactions, is as follows:\nThree Months Ended\nNine Months Ended\nSeptember 30, 2024\nSeptember 30, 2024\nDollars in millions\nIncome Taxes\nTax Rate\nIncome Taxes\nTax Rate\nAs reported\n$\n202 \n14.9 \n%\n$\n701 \n20.4 \n%\nNet discrete tax benefit related to the third quarter 2024\n121 \n8.8 \n%\n121 \n3.5 \n%\nAs adjusted\n$\n323 \n23.7 \n%\n$\n822 \n23.9 \n%\nRefer to Note 5. Income Taxes in Item 1. Financial Statements for additional information regarding the discrete tax benefit related to the first and third quarter 2025 and the third quarter 2024.\n35\nWorking Capital\nManagement uses working capital as a measurement of the short-term liquidity of the Company. Net working capital as of September 30, 2025 and December 31, 2024 is summarized as follows:\nIn millions\nSeptember 30, 2025\nDecember 31, 2024\nIncrease/\n(Decrease)\nCurrent assets:\nCash and equivalents\n$\n924 \n$\n948 \n$\n(24)\nTrade receivables\n3,255 \n2,991 \n264 \nInventories\n1,725 \n1,605 \n120 \nPrepaid expenses and other current assets\n416 \n312 \n104 \nTotal current assets\n6,320 \n5,856 \n464 \nCurrent liabilities:\nShort-term debt\n1,267 \n1,555 \n(288)\nAccounts payable and accrued expenses\n2,175 \n2,095 \n80 \nOther\n690 \n658 \n32 \nTotal current liabilities\n4,132 \n4,308 \n(176)\nNet working capital\n$\n2,188 \n$\n1,548 \n$\n640 \nAs of September 30, 2025, a significant portion of the Company's cash and equivalents was held by international subsidiaries. Cash and equivalents held internationally may be subject to foreign withholding taxes if repatriated to the U.S. Cash and equivalents held internationally are typically used for international operating needs or reinvested to fund expansion of existing international businesses. International funds may also be used to fund international acquisitions or, if not considered permanently invested, may be repatriated to the U.S. The Company has accrued for foreign withholding taxes related to foreign held cash and equivalents that are not permanently invested.\nIn the U.S., the Company utilizes cash flows from operations to fund domestic cash needs and the Company's capital allocation priorities. This includes operating needs of the U.S. businesses, dividend payments, share repurchases, acquisitions, servicing of domestic debt obligations, reinvesting to fund expansion of existing U.S. businesses and general corporate needs. The Company may also use its commercial paper program, which is supported by a long-term credit facility, for short-term liquidity needs. The Company believes cash generated by operations and liquidity provided by the Company's commercial paper program will continue to be sufficient to fund cash requirements in the U.S.\nDebt\nTotal debt as of September 30, 2025 and December 31, 2024 was as follows:\nIn millions\nSeptember 30, 2025\nDecember 31, 2024\nShort-term debt\n$\n1,267 \n$\n1,555 \nLong-term debt\n7,675 \n6,308 \nTotal debt\n$\n8,942 \n$\n7,863 \nShort-term debt included commercial paper of $1.3 billion and $778 million as of September 30, 2025 and December 31, 2024, respectively. The weighted-average interest rate on commercial paper as of September 30, 2025 and December 31, 2024 was 4.17% and 4.56%, respectively.\nAs of December 31, 2024, Short-term debt also included $777 million related to the Euro-denominated credit agreement entered into on May 5, 2023 (the \"Euro Credit Agreement\"). On February 24, 2025, the Company entered into an amendment to the Euro Credit Agreement to extend the termination date from April 30, 2025 to February 28, 2027, with an option to further extend the termination date to September 15, 2027. The amendment also decreased the interest rate spread applicable to the loans from 0.75% to 0.70% and removed the option for a one-month interest period. As of September 30, 2025, the Company had $880 million outstanding under the Euro Credit Agreement with an interest rate of 2.73%, which was included in Long-term debt.\n36\nOn May 17, 2024, the Company issued €650 million of 3.25% Euro notes due May 17, 2028 at 99.525% of face value and €850 million of 3.375% Euro notes due May 17, 2032 at 99.072% of face value. Proceeds from the issuance were used for general corporate purposes, including the repayment of a portion of the indebtedness under the commercial paper program and repayment of €550 million of the term loans under the Euro Credit Agreement.\nThe Company also has a $3.0 billion revolving credit facility with a termination date of October 21, 2027, which is available to provide additional liquidity, including to support the potential issuances of commercial paper. No amounts were outstanding under the revolving credit facility as of September 30, 2025 or December 31, 2024.\nTotal Debt to EBITDA\nThe Company uses the ratio of total debt to EBITDA as a measure of its ability to repay its outstanding debt obligations. EBITDA and the ratio of total debt to EBITDA are non-GAAP financial measures. The Company believes that total debt to EBITDA is a meaningful metric to investors in evaluating the Company's long term financial liquidity and may be different than the method used by other companies to calculate total debt to EBITDA. The ratio of total debt to EBITDA represents total debt divided by net income before interest expense, other income (expense), income taxes, depreciation, and amortization and impairment of intangible assets on a trailing twelve month basis. Total debt to EBITDA for the trailing twelve month periods ended September 30, 2025 and December 31, 2024 was as follows:\nDollars in millions\nSeptember 30, 2025\nDecember 31, 2024\nTotal debt\n$\n8,942 \n$\n7,863 \nNet income\n$\n3,026 \n$\n3,488 \nAdd:\nInterest expense\n285 \n283 \nOther (income) expense\n(48)\n(441)\nIncome taxes\n899 \n934 \nDepreciation\n311 \n301 \nAmortization and impairment of intangible assets\n85 \n101 \nEBITDA\n$\n4,558 \n$\n4,666 \nTotal debt to EBITDA ratio\n2.0 \n1.7 \nStockholders' Equity\nThe changes to stockholders' equity during the nine months ended 2025 were as follows:\nIn millions\nTotal stockholders' equity, December 31, 2024\n$\n3,317 \nNet income\n2,276 \nRepurchases of common stock\n(1,125)\nDividends declared\n(1,344)\nOther comprehensive income (loss)\n1 \nOther, net\n84 \nTotal stockholders' equity, September 30, 2025\n$\n3,209 \nFORWARD-LOOKING STATEMENTS\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as \"believe,\" \"expect,\" \"plans,\" \"intend,\" \"may,\" \"strategy,\" \"prospects,\" \"estimate,\" \"will,\" \"should,\" \"could,\" \"project,\" \"target,\" \"anticipate,\" \"guidance,\" \"forecast,\" and other similar words, and may include, without limitation, statements regarding the duration and potential effects of global supply chain challenges, the current and expected impact of U.S. trade policy, including tariffs and related retaliatory countermeasures, the expected impact of the One Big Beautiful Bill Act, future financial and operating performance, free cash flow, economic and regulatory conditions in various geographic regions, the impact of foreign currency \n37\nfluctuations, the timing and amount of benefits from the Company's enterprise strategy initiatives, the timing and amount of dividends and share repurchases, the protection of the Company's intellectual property, the likelihood of future goodwill or intangible asset impairment charges, the impact of adopting new accounting pronouncements, the adequacy of internally generated funds and credit facilities to service debt and finance the Company's capital allocation priorities, the sufficiency of U.S. generated cash to fund cash requirements in the U.S., the cost and availability of additional financing, the availability of raw materials and energy and the impact of raw material cost inflation, the Company's enterprise initiatives, the Company's portion of future benefit payments related to pension and postretirement benefits, the Company's information technology infrastructure, potential acquisitions and divestitures and the expected performance of acquired businesses and impact of divested businesses, the impact of U.S. and global tax legislation and the estimated timing and amount related to the resolution of tax matters, the cost of compliance with environmental regulations, the impact of interest rate changes, the impact of failure of the Company's employees to comply with applicable laws and regulations, and the outcome of outstanding legal proceedings. These statements are subject to certain risks, uncertainties, and other factors, which could cause actual results to differ materially from those anticipated. Important risks that may influence future results include (1) weaknesses or downturns in the markets served by the Company, (2) changes or deterioration in international and domestic political and economic conditions, such as the Russia and Ukraine conflict or U.S.-China trade relations and the impact of related economic and other sanctions, (3) the unfavorable impact of foreign currency fluctuations, (4) the Company's enterprise strategy initiatives may not have the desired impact on organic revenue growth, (5) market conditions and cost and availability of financing to fund the Company's share repurchases, (6) a delay or decrease in the introduction of new products into the Company's product lines, (7) any failure to protect the Company's intellectual property, (8) potential negative impact of impairments to goodwill and other intangible assets on the Company's return on invested capital, financial condition or results of operations, (9) raw material price increases and supply shortages or delays, (10) financial market risks to the Company's obligations under its defined benefit pension plans, (11) negative effects of service interruptions, data corruption, cyber-based attacks, security breaches of our technology networks and systems or those of our vendors and third-party service providers, or violations of data privacy laws, (12) the potential negative impact of acquisitions on the Company's profitability and returns, (13) potential negative effects of divestitures, including retained liabilities and unknown contingent liabilities, (14) impact of tax legislation and regulatory action and changing tax rates, (15) potential adverse outcomes in legal proceedings or enforcement actions, (16) uncertainties related to environmental regulation and the physical risks of climate change, (17) potential failure of the Company's employees, agents or business partners to comply with anti-bribery, competition, import/export, trade sanctions, data privacy, human rights and other laws, (18) public health crises and related government actions, and (19) increases in inflation or interest rates and the possibility of economic recession. A more detailed description of these risks is contained under the heading \"Risk Factors\" in the Company's Annual Report on Form 10-K for the year ended December 31, 2024. These risks are not all inclusive and given these and other possible risks and uncertainties, investors should not place undue reliance on forward-looking statements as a prediction of actual results.\nAny forward-looking statements made by ITW speak only as of the date on which they are made. ITW is under no obligation to, and expressly disclaims any obligation to, update or alter its forward-looking statements, whether as a result of new information, subsequent events or otherwise, except as required by law.\nITW practices fair disclosure for all interested parties. Investors should be aware that while ITW regularly communicates with securities analysts and other investment professionals, it is against ITW's policy to disclose to them any material non-public information or other confidential commercial information. Investors should not assume that ITW agrees with any statement or report issued by any analyst irrespective of the content of the statement or report."
}