{
  "source_file": "itw-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\n \nBusiness\nGeneral\nIllinois Tool Works Inc. (the \"Company\" or \"ITW\") was founded in 1912 and incorporated in 1915. The Company's ticker symbol is ITW. The Company is a global manufacturer of a diversified range of industrial products and equipment with 86 divisions in 51 countries. As of December 31, 2024, the Company employed approximately 44,000 people.\nThe Company's operations are organized and managed based on similar product offerings and end markets, and are reported to senior management as the following seven segments: Automotive OEM; Food Equipment; Test & Measurement and Electronics; Welding; Polymers & Fluids; Construction Products; and Specialty Products. The following is a description of the Company's seven segments:\nAutomotive OEM\n— This segment is a global, niche supplier to top tier OEMs, providing unique innovation to address pain points for sophisticated customers with complex problems. Businesses in this segment produce components and fasteners for automotive-related applications. This segment primarily serves the automotive original equipment manufacturers and tiers market. Products in this segment include:\n•\nplastic and metal components, fasteners and assemblies for automobiles, light trucks and other industrial uses.\nFood Equipment\n— This segment is a highly focused and branded industry leader in commercial food equipment differentiated by innovation and integrated service offerings. This segment primarily serves the food service, food retail and food institutional/restaurant markets. Products in this segment include:\n•\nwarewashing equipment;\n•\ncooking equipment, including ovens, ranges and broilers;\n•\nrefrigeration equipment, including refrigerators, freezers and prep tables;\n•\nfood processing equipment, including slicers, mixers and scales;\n•\nkitchen exhaust, ventilation and pollution control systems; and\n•\nfood equipment service, maintenance and repair.\nTest & Measurement and Electronics\n— This segment is a branded and innovative producer of test and measurement and electronic manufacturing and maintenance, repair, and operations, or \"MRO\" solutions that improve efficiency and quality for customers in diverse end markets. Businesses in this segment produce equipment, consumables, and related software for testing and measuring of materials and structures, as well as equipment and consumables used in the production of electronic subassemblies and microelectronics. This segment primarily serves the electronics, general industrial, automotive original equipment manufacturers and tiers, energy, industrial capital goods and consumer durables markets. Products in this segment include:\n•\nequipment, consumables, and related software for testing and measuring of materials, structures, gases and fluids;\n•\nelectronic assembly equipment;\n•\nelectronic components and component packaging;\n•\nstatic control equipment and consumables used for contamination control in clean room environments; and\n•\npressure sensitive adhesives and components for electronics, medical, transportation and telecommunications applications.\nWelding\n— This segment is a branded value-added equipment and specialty consumable manufacturer with innovative and leading technology. Businesses in this segment produce arc welding equipment, consumables and accessories for a wide array of industrial and commercial applications. This segment primarily serves the general industrial market, which includes fabrication, shipbuilding and other general industrial markets, and construction, energy, MRO, industrial capital goods and automotive original equipment manufacturers and tiers markets. Products in this segment include:\n•\narc welding equipment; and\n•\nmetal arc welding consumables and related accessories.\n3\nPolymers & Fluids\n— This segment is a branded supplier to niche markets that require value-added, differentiated products. Businesses in this segment produce engineered adhesives, sealants, lubrication and cutting fluids, and fluids and polymers for auto aftermarket maintenance and appearance. This segment primarily serves the automotive aftermarket, general industrial and MRO markets. Products in this segment include:\n•\nadhesives for industrial, construction and consumer purposes;\n•\nchemical fluids which clean or add lubrication to machines;\n•\nepoxy and resin-based coating products for industrial applications;\n•\nhand wipes and cleaners for industrial applications;\n•\nfluids, polymers and other supplies for auto aftermarket maintenance and appearance;\n•\nfillers and putties for auto body repair; and\n•\npolyester coatings and patch and repair products for the marine industry.\nConstruction Products\n— This segment is a branded supplier of innovative engineered fastening systems and solutions. This segment primarily serves the residential construction, renovation/remodel and commercial construction markets. Products in this segment include:\n•\nfasteners and related fastening tools for wood and metal applications;\n•\nanchors, fasteners and related tools for concrete applications;\n•\nmetal plate truss components and related equipment and software; and\n•\npackaged hardware, fasteners, anchors and other products for retail.\nSpecialty Products\n— This segment is focused on diversified niche market opportunities with substantial patent protection producing beverage packaging equipment and consumables, product coding and marking equipment and consumables, and appliance components and fasteners. This segment primarily serves the food and beverage, consumer durables, general industrial, airlines, industrial capital goods and printing and publishing markets. Products in this segment include:\n•\nconveyor systems and line automation for the food and beverage industries;\n•\nplastic consumables that multi-pack cans and bottles and related equipment;\n•\nfoil, film and related equipment used to decorate consumer products;\n•\nproduct coding and marking equipment and related consumables;\n•\nplastic and metal closures and components for appliances;\n•\nairport ground support equipment; and\n•\ncomponents for medical devices.\nThe information set forth below is applicable to all segments of the Company unless otherwise noted.\nThe ITW Business Model\nThe powerful and highly differentiated ITW Business Model is the Company's core source of value creation. It is the Company's competitive advantage and defines how ITW creates value for its shareholders. The ITW Business Model is comprised of three unique elements:\n•\nITW's \n80/20 Front-to-Back\n process is the operating system that is applied in every ITW business. Initially introduced as a manufacturing efficiency tool in the 1980s, ITW has continually refined, improved and expanded 80/20 into a proprietary, holistic business management process that generates significant value for the Company and its customers. Through the application of data driven insights generated by 80/20 practice, ITW focuses on its largest and best opportunities (the \"80\") and eliminates cost, complexity and distractions associated with the less profitable opportunities (the \"20\"). 80/20 enables ITW businesses to consistently achieve world-class operational excellence in product availability, quality, and innovation, while generating superior financial performance;\n•\nCustomer-back Innovation\n has fueled decades of profitable growth at ITW. The Company's unique innovation approach is built on insight gathered from the 80/20 Front-to-Back process. Working from the customer back, ITW businesses position themselves as the go-to problem solver for their \"80\" customers. ITW's innovation efforts are focused on understanding customer needs, particularly those in \"80\" markets with solid long-term growth fundamentals, and creating unique solutions to address those needs. These customer insights and learnings drive innovation at ITW and have contributed to a portfolio of approximately 20,900 granted and pending patents;\n4\n•\nITW's \nDecentralized, Entrepreneurial Culture\n enables ITW businesses to be fast, focused, and responsive. ITW businesses have significant flexibility within the framework of the ITW Business Model to customize their approach in order to best serve their specific customers' needs. ITW colleagues recognize their unique responsibilities to execute the Company's strategy and values. As a result, the Company maintains a focused and simple organizational structure that, combined with outstanding execution, delivers best-in-class services and solutions adapted to each business' customers and end markets.\nENTERPRISE STRATEGY: 2012 - 2023\nIn late 2012, ITW began its strategic framework transitioning the Company to fully leverage the unique and powerful set of capabilities and operating practices of the ITW Business Model. The Company undertook a complete review of its performance, focusing on its businesses delivering consistent above-market growth with best-in-class margins and returns, and developing a strategy to replicate that performance across its operations. ITW determined that solid and consistent above-market organic growth is the core growth engine to deliver world-class financial performance and compelling long-term returns for its shareholders.\nKey initiatives in the Company's enterprise strategy included portfolio management, business structure simplification, strategic sourcing and the diligent re-application of ITW's proprietary 80/20 Front-to-Back process.\n•\nAs part of the Portfolio Management initiative, ITW exited businesses that were operating in commoditized market spaces and prioritized sustainable differentiation as a must-have requirement for all ITW businesses. This process included both divesting entire businesses and exiting commoditized product lines and customers inside otherwise highly differentiated ITW divisions.\n•\nBusiness Structure Simplification was implemented to simplify and scale up ITW's operating structure to support increased engineering, marketing, and sales resources, and improve global reach and competitiveness, all of which were critical to driving accelerated organic growth. ITW now has 86 scaled-up divisions with significantly enhanced focus on growth investments, core customers and products, and customer-back innovation.\n•\nThe Strategic Sourcing initiative established sourcing as a core strategic and operational capability at ITW, delivering an average of one percent reduction in spend each year since 2013 and continues to be a key contributor to the Company's ongoing enterprise strategy.\n•\nWith the initial portfolio realignment and scale-up work largely completed, the Company shifted its focus to preparing for and accelerating organic growth, reapplying the 80/20 Front-to-Back process to optimize its scaled-up divisions for growth, first, to build a foundation of operational excellence, and second, to identify the best opportunities to drive organic growth.\nSince implementing the Company's enterprise strategy in 2012, the Company has demonstrated the compelling performance potential of the ITW Business Model and superior 80/20 management, resulting in meaningful incremental improvement in margins and returns as evidenced by the Company's operating margin and after-tax return on invested capital. At the same time, these 80/20 initiatives may also result in restructuring initiatives that reduce costs and improve profitability and returns.\nOUR NEXT PHASE: 2024 - 2030\nIn the Next Phase of the Company’s evolution, the ITW Business Model and the Enterprise Strategy framework will be as formidable of a competitive advantage and performance differentiator as it has been over the last decade, if not more so. Volatility, risk and the pace of change in the global operating environment will continue to increase, and a decentralized entrepreneurial culture allows the Company to be a fast adaptor – to read, react, respond and evolve. The Company’s ability to consistently execute and invest through the ups and downs of the business cycle is now a defining competitive advantage.\nThroughout the Next Phase, the Company's focus is to build organic growth into a core ITW strength on par with the Company’s world-class financial performance and operational capabilities. Throughout this phase, the Company will sustain its foundational strengths built over the past decade, including the high-quality ITW Business Model practice. Customer-back Innovation (\"CBI\") is the most impactful driver to achieve high-quality organic growth through the cycle by establishing trusted problem solver relationships with key customers to effectively invent solutions that address customers' most critical pain points or tackle the biggest growth opportunities. CBI successes, coupled with underlying market growth and share gains, are how the Company intends to achieve its high-quality organic growth\n.\n5\nPortfolio Discipline\nThe Company only operates in industries where it can generate significant, long-term competitive advantage from the ITW Business Model. ITW businesses have the right \"raw material\" in terms of market and business attributes that best fit the ITW Business Model and have significant potential to drive above-market organic growth over the long-term.\nThe Company focuses on high-quality businesses, ensuring it operates in markets with positive long-term macro fundamentals and with customers that have critical needs and value ITW's differentiated products, services and solutions. ITW's portfolio operates in highly diverse end markets and geographies which makes the Company more resilient in the face of uncertain or volatile market environments.\nThe Company routinely evaluates its portfolio to ensure it delivers sustainable differentiation and drives consistent long-term performance. This includes both implementing portfolio refinements and assessing selective high-quality acquisitions to supplement ITW's long-term growth potential.\nIn the second quarter of 2022, plans were approved to divest two businesses, including one business in the Polymers & Fluids segment and one business in the Food Equipment segment. In the fourth quarter of 2022, both of these businesses were divested. The business in the Polymers & Fluids segment was sold for $220 million, subject to certain closing adjustments, resulting in a pre-tax gain of $156 million. The business in the Food Equipment segment was sold for $59 million, subject to certain closing adjustments, resulting in a pre-tax gain of $41 million. Operating revenue related to these divested businesses that was included in the Company's results of operations for the twelve months ended December 31, 2022 was $106 million.\nIn the fourth quarter of 2022, plans were approved to divest one business in the Specialty Products segment. This business was presented as held for sale beginning in the fourth quarter of 2022. This business was sold on April 3, 2023, with no significant gain or loss upon sale. Operating revenue related to this business that was included in the Company's results of operations was $9 million and $37 million for the twelve months ended December 31, 2023 and 2022, respectively. Refer to Note 3. Divestitures in Item 8. Financial Statements and Supplementary Data for further information regarding the Company's divestitures.\nOn January 2, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $57 million, net of cash acquired. On April 1, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $59 million, net of cash acquired. The purchase price for both acquisitions was subject to certain closing adjustments. These acquisitions were not material, individually or in the aggregate, to the Company’s results of operations, financial position or cash flows. Refer to Note 2. Acquisitions in Item 8. Financial Statements and Supplementary Data for further information regarding the Company's acquisitions.\nOn August 5, 2024, the Company entered into a purchase agreement with affiliates of Clayton, Dubilier & Rice, LLC (\"CD&R\") for the sale of the Company’s noncontrolling equity interest in Wilsonart International Holdings LLC (\"Wilsonart\") for $398 million. The transaction closed immediately after the execution of the purchase agreement. Proceeds from the transaction, net of transaction costs, were $395 million, resulting in a pre-tax gain of $363 million which was included in Other income (expense) in the Statement of Income. Income taxes on the gain were more than offset by a discrete tax benefit of $107 million in the third quarter of 2024 related to the utilization of capital loss carryforwards upon the sale of Wilsonart. The sale of the Company’s equity interest in Wilsonart is not expected to have a material impact on the Company’s financial results in subsequent periods. Refer to Note 5. Other Income (Expense) and Note 6. Income Taxes in Item 8. Financial Statements and Supplementary Data for additional information regarding this transaction.\n80/20 Front-to-Back Practice Excellence\nITW will continue to drive 80/20 Front-to-Back practice excellence in every division in the Company, every day. Driving strong operational excellence in the quality of 80/20 Front-to-Back practice across the Company, division by division, will produce further customer-facing performance improvement in a number of divisions and additional structural margin expansion at the enterprise level.\nCurrent Year Developments\nRefer to Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations.\n6\nDistribution Methods\nThe Company's businesses primarily distribute their products directly to industrial manufacturers and through independent distributors.\nBacklog\nBacklog generally is not considered a significant factor in the Company's businesses as relatively short delivery periods and rapid inventory turnover are characteristic of most of their products.\nCompetition\nWith operations in 51 countries, the Company offers a wide range of products in a myriad of markets, many of which are fragmented, and the Company encounters a variety of competitors that vary by product line, end market and geographic area. The Company's competitors include many regional or specialized companies, as well as large U.S. and non-U.S. companies or divisions of large companies. Each of the Company's segments generally has several main competitors and numerous smaller ones in most of their end markets and geographic areas. In addition to numerous smaller regional competitors, the Welding segment competes globally with Lincoln Electric Holdings, Inc. and ESAB Corporation.\nIn virtually all segments, the Company differentiates its businesses from its competitors based on product innovation, product quality, brand preference and service delivery. Technical capability is also a competitive factor in most segments. The Company believes that each segment's primary competitive advantages derive from the ITW Business Model and decentralized operating structure, which creates a strong focus on end markets and customers at the local level, enabling its businesses to respond rapidly to market dynamics. This structure enables the Company's businesses to drive operational excellence utilizing the Company's 80/20 Front-to-Back process and leveraging its product innovation capabilities. The Company also believes that its global footprint is a competitive advantage in many of its markets, especially in its Automotive OEM segment.\nRaw Materials\nThe Company uses raw materials of various types, primarily steel, resins and chemicals, that are available from numerous commercial sources. The availability of materials and energy has not resulted in any significant business interruptions or other major problems, and no such problems are currently anticipated.\nIntellectual Property\nThe Company owns approximately 4,100 unexpired U.S. patents and 10,500 unexpired foreign patents covering articles, methods and machines. In addition, the Company has approximately 1,500 applications for patents pending in the U.S. Patent Office and 4,800 applications pending in foreign patent offices. There is no assurance that any of these patents will be issued. The Company maintains a patent group for the administration of patents and processing of patent applications.\nThe Company believes that many of its patents are valuable and important; however, the expiration of any one of the Company's patents would not have a material effect on the Company's results of operations or financial position. The Company also credits its success in the markets it serves to engineering capability; manufacturing techniques; skills and efficiency; marketing and sales promotion; and service and delivery of quality products to its customers.\nIn addition to patents, many of the Company's products and services are sold under various owned or licensed trademarks, which are important to the Company in the aggregate. Some of the Company's more significant trademarks include ITW, which is also used in conjunction with the trademarks of many of the Company's businesses; Deltar and Shakeproof in the Automotive OEM segment; Hobart in the Food Equipment segment; Instron and MTS in the Test & Measurement and Electronics segment; Miller in the Welding segment; Rain-X and Permatex in the Polymers & Fluids segment; Paslode in the Construction Products segment; and Hi-Cone in the Specialty Products segment.\n7\nGovernment Regulations\nThe Company believes that its businesses and operations, including its manufacturing plants and equipment, are in substantial compliance with all applicable government laws and regulations, including those related to environmental, consumer protection, international trade, labor and employment, human rights, tax, anti-bribery and competition matters. Any additional measures to maintain compliance are not expected to materially affect the Company's capital expenditures (including expenditures for environmental control facilities), competitive position, financial position or results of operations.\nVarious legislative and administrative regulations applicable to the Company in the matters noted above have become effective or are under consideration in many parts of the world. To date, such developments have not had a substantial adverse impact on the Company's revenues, earnings or cash flows. However, if new or amended laws or regulations impose significant operational restrictions and compliance requirements upon the Company or its products, the Company's business, capital expenditures, results of operations, financial condition and competitive position could be negatively impacted. Refer to Item 1A. Risk Factors for further information.\nHuman Capital Management\nAs of December 31, 2024, the Company employed approximately 44,000 people, with approximately 16,000 people located in the United States and the remainder in multiple other countries where the Company's businesses operate. The Company strives to be a great employer through its demonstrated commitment to employee safety, its workplace culture, talent development, the ITW employee experience, compensation and benefits.\nEmployee Safety\n. The safety and well-being of ITW's colleagues around the world is its top priority, in addition to being an essential component of our commitment to be a great employer. Guided by the Company's Enterprise Safety Strategy and the philosophy that every accident is preventable, ITW strives every day to foster a proactive safety culture. ITW's Enterprise Safety Strategy and Safety Policy are based on the following core principles: (i) a goal of zero accidents; (ii) shared ownership for safety (business and individual); (iii) proactive approach focused on accident prevention; (iv) continuous improvement philosophy; and (v) compliance with applicable national, regional, and local health and safety laws and regulations.\nWorkplace Culture\n. The Company's culture is deeply rooted in its core values: Integrity, Respect, Trust, Shared Risk and Simplicity. ITW colleagues are empowered to think and act like business owners within the Company's decentralized, entrepreneurial culture. Our decentralized structure allows each division to operate with autonomy and enables our people to embrace the personal impact they can make.\nTalent Development\n. The Company strives for all colleagues to \"own\" their careers and feel valued for the work they do. ITW colleagues are encouraged to learn new skills and capabilities primarily through on-the-job experience, hands-on coaching and feedback, in addition to formal training.\nThe Great ITW Leader Framework defines leadership capabilities and attributes to help colleagues to reach their full potential as leaders. Great ITW Leaders are expected to make great strategic choices to drive above-market organic growth, be an expert in the practice of customer-back innovation and the ITW Business Model, deliver great results, be great talent managers and lead through ITW's culture and values. Great ITW Leaders who have expertise in the ITW Business Model are the critical factor in translating the potential of the ITW Business Model into full performance. Because this expertise develops over time and through specific experiences, the Company focuses on developing and promoting its own talent to support the Company's sustained business success over the long term.\nThe ITW Employee Experience\n. ITW believes it is at its best when it brings together unique perspectives, experiences, and ideas. Rooted in ITW's core values of Respect and Integrity, the Company is committed to equal employment opportunity, fair treatment and creating inclusive workplaces where all ITW colleagues can perform to their full potential. Consistent with these values, ITW is also committed to attracting the best talent for its global leadership teams, valuing the perspectives of every ITW colleague, and reflecting the communities where we live and work. ITW drives progress through a comprehensive enterprise talent management strategy, which focuses on: (i) leadership commitment and accountability; (ii) attracting and retaining great ITW talent; (iii) creating inclusive workplaces; and (iv) striving to be a great employer.\nCompensation and Benefits\n. As a global employer, the Company is committed to providing market-competitive compensation and benefits that support physical, mental, and financial well-being to attract and retain great talent across its global divisions. Specific compensation and benefits vary worldwide and are based on regional practices. In the U.S., the Company focuses on providing a comprehensive, competitive benefits package that supports the health and wellness, educational endeavors, community involvement and financial stability of its colleagues.\n8\nLabor Relations\n. Less than three percent of the Company's U.S. employees are represented by a labor union. Outside the U.S., employees in certain countries are represented by an employee representative organization, such as a union, works council or employee association. The Company considers its employee relations to be excellent.\nInformation About Our Executive Officers\nThe executive officers of the Company serve at the discretion of the Board of Directors. Set forth below is information regarding the principal occupations and employment and business experience over the past five years for each executive officer. Unless otherwise stated, employment is by the Company.\nExecutive Officers of the Company as of February 14, 2025 were as follows:\nName\nAge\nPresent Position\nFirst Year in Present Position\nOther Positions Held During 2020-2024\nChristopher A. O'Herlihy\n61\nPresident & Chief Executive Officer\n2024\nVice Chairman 2015-2023.\nAxel R.J. Beck\n59\nExecutive Vice President\n2020\nGroup President, food equipment businesses, 2016-2020.\nT. Kenneth Escoe\n49\nExecutive Vice President\n2020\nJavier Gracia Carbonell\n52\nExecutive Vice President\n2022\nGroup President, construction businesses, 2020-2021.\nPatricia A. Hartzell\n48\nExecutive Vice President\n2022\nGroup President, test & measurement and electronics businesses, 2020-2021.\nMichael M. Larsen\n56\nSenior Vice President & Chief Financial Officer\n2013\nMary K. Lawler\n59\nSenior Vice President & Chief Human Resources Officer\n2014\nRandall J. Scheuneman\n57\nVice President & Chief Accounting Officer\n2009\nJennifer K. Schott\n51\nSenior Vice President, General Counsel & Secretary\n2021\nDeputy General Counsel & Assistant Secretary, Caterpillar, Inc., 2019-2021.\nGuilherme Silva \n49\nExecutive Vice President\n2024\nGroup President, polymers & fluids businesses, 2020-2021; Group President, test & measurement and electronics businesses, 2021-2023.\nSharon A. Szafranski\n58\nExecutive Vice President\n2020\nMark A. Thibeault\n41\nExecutive Vice President\n2025\nVice President/General Manager, test & measurement and electronics businesses, 2019-2022; Group President, test & measurement and electronics businesses, 2022-2024.\nAvailable Information\nCopies of the Company's Annual Report on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 are available free of charge through the Company's website (\nwww.itw.com\n), as soon as reasonably practicable after electronically filing with or otherwise furnishing such information to the Securities and Exchange Commission (the \"SEC\"). The Company's Code of Ethics for the CEO and key financial and accounting personnel is also posted on the Company's website.\n9",
  "item7": "ITEM 7.\n \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nINTRODUCTION\nIllinois Tool Works Inc. (the \"Company\" or \"ITW\") is a global manufacturer of a diversified range of industrial products and equipment with 86 divisions in 51 countries. As of December 31, 2024, the Company employed approximately 44,000 people.\nThe Company's operations are organized and managed based on similar product offerings and end markets, and are reported to senior management as the following seven segments: Automotive OEM; Food Equipment; Test & Measurement and Electronics; Welding; Polymers & Fluids; Construction Products; and Specialty Products.\nDue to the large number of diverse businesses and the Company's decentralized operating structure, the Company does not require its businesses to provide detailed information on operating results. Instead, the Company's corporate management collects data on several key measurements: operating revenue, operating income, operating margin, variable cost of revenue, overhead expenses, number of months on hand in inventory, days sales outstanding in accounts receivable, past due receivables and return on invested capital. These key measures are monitored by management and significant changes in operating results versus current trends in end markets and variances from forecasts are discussed with operating unit management.\nTHE ITW BUSINESS MODEL\nThe powerful and highly differentiated ITW Business Model is the Company's core source of value creation. It is the Company's competitive advantage and defines how ITW creates value for its shareholders. The ITW Business Model is comprised of three unique elements:\n•\nITW's \n80/20 Front-to-Back\n process is the operating system that is applied in every ITW business. Initially introduced as a manufacturing efficiency tool in the 1980s, ITW has continually refined, improved and expanded 80/20 into a proprietary, holistic business management process that generates significant value for the Company and its customers. Through the application of data driven insights generated by 80/20 practice, ITW focuses on its \n18\nlargest and best opportunities (the \"80\") and eliminates cost, complexity and distractions associated with the less profitable opportunities (the \"20\"). 80/20 enables ITW businesses to consistently achieve world-class operational excellence in product availability, quality, and innovation, while generating superior financial performance;\n•\nCustomer-back Innovation\n has fueled decades of profitable growth at ITW. The Company's unique innovation approach is built on insight gathered from the 80/20 Front-to-Back process. Working from the customer back, ITW businesses position themselves as the go-to problem solver for their \"80\" customers. ITW's innovation efforts are focused on understanding customer needs, particularly those in \"80\" markets with solid long-term growth fundamentals, and creating unique solutions to address those needs. These customer insights and learnings drive innovation at ITW and have contributed to a portfolio of approximately 20,900 granted and pending patents;\n•\nITW's \nDecentralized, Entrepreneurial Culture\n enables ITW businesses to be fast, focused, and responsive. ITW businesses have significant flexibility within the framework of the ITW Business Model to customize their approach in order to best serve their specific customers' needs. ITW colleagues recognize their unique responsibilities to execute the Company's strategy and values. As a result, the Company maintains a focused and simple organizational structure that, combined with outstanding execution, delivers best-in-class services and solutions adapted to each business' customers and end markets.\nENTERPRISE STRATEGY: 2012 - 2023\nIn late 2012, ITW began its strategic framework transitioning the Company to fully leverage the unique and powerful set of capabilities and operating practices of the ITW Business Model. The Company undertook a complete review of its performance, focusing on its businesses delivering consistent above-market growth with best-in-class margins and returns, and developing a strategy to replicate that performance across its operations. ITW determined that solid and consistent above-market organic growth is the core growth engine to deliver world-class financial performance and compelling long-term returns for its shareholders.\nKey initiatives in the Company's enterprise strategy included portfolio management, business structure simplification, strategic sourcing and the diligent re-application of ITW's proprietary 80/20 Front-to-Back process.\n•\nAs part of the Portfolio Management initiative, ITW exited businesses that were operating in commoditized market spaces and prioritized sustainable differentiation as a must-have requirement for all ITW businesses. This process included both divesting entire businesses and exiting commoditized product lines and customers inside otherwise highly differentiated ITW divisions.\n•\nBusiness Structure Simplification was implemented to simplify and scale up ITW's operating structure to support increased engineering, marketing, and sales resources, and improve global reach and competitiveness, all of which were critical to driving accelerated organic growth. ITW now has 86 scaled-up divisions with significantly enhanced focus on growth investments, core customers and products, and customer-back innovation.\n•\nThe Strategic Sourcing initiative established sourcing as a core strategic and operational capability at ITW, delivering an average of one percent reduction in spend each year since 2013 and continues to be a key contributor to the Company's ongoing enterprise strategy.\n•\nWith the initial portfolio realignment and scale-up work largely completed, the Company shifted its focus to preparing for and accelerating organic growth, reapplying the 80/20 Front-to-Back process to optimize its scaled-up divisions for growth, first, to build a foundation of operational excellence, and second, to identify the best opportunities to drive organic growth.\nSince implementing the Company's enterprise strategy in 2012, the Company has demonstrated the compelling performance potential of the ITW Business Model and superior 80/20 management, resulting in meaningful incremental improvement in margins and returns as evidenced by the Company's operating margin and after-tax return on invested capital. At the same time, these 80/20 initiatives may also result in restructuring initiatives that reduce costs and improve profitability and returns.\nOUR NEXT PHASE: 2024 - 2030\nIn the Next Phase of the Company’s evolution, the ITW Business Model and the Enterprise Strategy framework will be as formidable of a competitive advantage and performance differentiator as it has been over the last decade, if not more so. \n19\nVolatility, risk and the pace of change in the global operating environment will continue to increase, and a decentralized entrepreneurial culture allows the Company to be a fast adaptor – to read, react, respond and evolve. The Company’s ability to consistently execute and invest through the ups and downs of the business cycle is now a defining competitive advantage.\nThroughout the Next Phase, the Company's focus is to build organic growth into a core ITW strength on par with the Company’s world-class financial performance and operational capabilities. Throughout this phase, the Company will sustain its foundational strengths built over the past decade, including the high-quality ITW Business Model practice. Customer-back Innovation (\"CBI\") is the most impactful driver to achieve high-quality organic growth through the cycle by establishing trusted problem solver relationships with key customers to effectively invent solutions that address customers' most critical pain points or tackle the biggest growth opportunities. CBI successes, coupled with underlying market growth and share gains, are how the Company intends to achieve its high-quality organic growth\n.\nPortfolio Discipline\nThe Company only operates in industries where it can generate significant, long-term competitive advantage from the ITW Business Model. ITW businesses have the right \"raw material\" in terms of market and business attributes that best fit the ITW Business Model and have significant potential to drive above-market organic growth over the long-term.\nThe Company focuses on high-quality businesses, ensuring it operates in markets with positive long-term macro fundamentals and with customers that have critical needs and value ITW's differentiated products, services and solutions. ITW's portfolio operates in highly diverse end markets and geographies which makes the Company more resilient in the face of uncertain or volatile market environments.\nThe Company routinely evaluates its portfolio to ensure it delivers sustainable differentiation and drives consistent long-term performance. This includes both implementing portfolio refinements and assessing selective high-quality acquisitions to supplement ITW's long-term growth potential.\nIn the second quarter of 2022, plans were approved to divest two businesses, including one business in the Polymers & Fluids segment and one business in the Food Equipment segment. In the fourth quarter of 2022, both of these businesses were divested. The business in the Polymers & Fluids segment was sold for $220 million, subject to certain closing adjustments, resulting in a pre-tax gain of $156 million. The business in the Food Equipment segment was sold for $59 million, subject to certain closing adjustments, resulting in a pre-tax gain of $41 million. Operating revenue related to these divested businesses that was included in the Company's results of operations for the twelve months ended December 31, 2022 was $106 million.\nIn the fourth quarter of 2022, plans were approved to divest one business in the Specialty Products segment. This business was presented as held for sale beginning in the fourth quarter of 2022. This business was sold on April 3, 2023, with no significant gain or loss upon sale. Operating revenue related to this business that was included in the Company's results of operations was $9 million and $37 million for the twelve months ended December 31, 2023 and 2022, respectively. Refer to Note 3. Divestitures in Item 8. Financial Statements and Supplementary Data for further information regarding the Company's divestitures.\nOn January 2, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $57 million, net of cash acquired. On April 1, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $59 million, net of cash acquired. The purchase price for both acquisitions was subject to certain closing adjustments. These acquisitions were not material, individually or in the aggregate, to the Company’s results of operations, financial position or cash flows. Refer to Note 2. Acquisitions in Item 8. Financial Statements and Supplementary Data for further information regarding the Company's acquisitions.\nOn August 5, 2024, the Company entered into a purchase agreement with affiliates of Clayton, Dubilier & Rice, LLC (\"CD&R\") for the sale of the Company’s noncontrolling equity interest in Wilsonart International Holdings LLC (\"Wilsonart\") for $398 million. The transaction closed immediately after the execution of the purchase agreement. Proceeds from the transaction, net of transaction costs, were $395 million, resulting in a pre-tax gain of $363 million which was included in Other income (expense) in the Statement of Income. Income taxes on the gain were more than offset by a discrete tax benefit of $107 million in the third quarter of 2024 related to the utilization of capital loss carryforwards upon the sale of Wilsonart. The sale of the Company’s equity interest in Wilsonart is not expected to have a material impact on the Company’s financial results in subsequent periods. Refer to Note 5. Other Income (Expense) and Note 6. Income Taxes in Item 8. Financial Statements and Supplementary Data for additional information regarding this transaction.\n20\n80/20 Front-to-Back Practice Excellence\nITW will continue to drive 80/20 Front-to-Back practice excellence in every division in the Company, every day. Driving strong operational excellence in the quality of 80/20 Front-to-Back practice across the Company, division by division, will produce further customer-facing performance improvement in a number of divisions and additional structural margin expansion at the enterprise level.\nTERMS USED BY ITW\nManagement uses the following terms to describe the financial results of operations of the Company:\n•\nOrganic business\n - acquired businesses that have been included in the Company's results of operations for more than 12 months on a constant currency basis.\n•\nOperating leverage\n - the estimated effect of the organic revenue volume changes on organic operating income, assuming variable margins remain the same as the prior period.\n•\nPrice/cost \n-\n \nrepresents the estimated net impact of increases or decreases in the cost of materials used in the Company's products versus changes in the selling price to the Company's customers.\n•\nProduct line simplification (\"PLS\") \n- focuses businesses on eliminating the complexity and overhead costs associated with smaller product lines and customers, and focuses businesses on supporting and growing their largest customers and product lines. In the short-term, PLS may result in a decrease in revenue and overhead costs while improving operating margin. In the long-term, PLS is expected to result in growth in revenue, profitability, and returns.\nUnless otherwise stated, the changes in financial results in the consolidated results of operations and the results of operations by segment represent the current year period versus the comparable period in the prior year.\nCONSOLIDATED RESULTS OF OPERATIONS\nDuring the first quarter of 2022, Russian military forces invaded Ukraine. In response, the United States and several other countries imposed economic and other sanctions on Russia. The Company has four immaterial Russian subsidiaries with total assets of approximately $22 million as of December 31, 2024. The revenue for these four subsidiaries for the twelve months ended December 31, 2024 was approximately $24 million. These subsidiaries were not material to the Company's results of operations or financial position.\nIn the second quarter of 2022, plans were approved to divest two businesses, including one business in the Polymers & Fluids segment and one business in the Food Equipment segment. These two businesses were classified as held for sale beginning in the second quarter of 2022. In the fourth quarter of 2022, both of these businesses were divested. On October 3, 2022, the business in the Polymers & Fluids segment was sold for $220 million, subject to certain closing adjustments, resulting in a pre-tax gain of $156 million. On December 1, 2022, the business in the Food Equipment segment was sold for $59 million, subject to certain closing adjustments, resulting in a pre-tax gain of $41 million. The pre-tax gains were included in Other income (expense) in the Statement of Income. Income taxes on the gains were mostly offset by the utilization of capital loss carryforwards of $32 million. Operating revenue related to these divested businesses that was included in the Company's results of operations for the twelve months ended December 31, 2022 was $106 million.\nIn the fourth quarter of 2022, plans were approved to divest one business in the Specialty Products segment. This business was presented as held for sale beginning in the fourth quarter of 2022. This business was sold on April 3, 2023, with no significant gain or loss upon sale. Operating revenue related to this business that was included in the Company's results of operations for the twelve months ended December 31, 2023 and 2022 was $9 million and $37 million, respectively. Refer to Note 3. Divestitures in Item 8. Financial Statements and Supplementary Data for further information regarding the Company's divestitures.\nOn January 2, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $57 million, net of cash acquired. On April 1, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $59 million, net of cash acquired. The purchase price for both acquisitions was subject to certain closing adjustments. These acquisitions were not material, individually or in the aggregate, to the Company’s results of operations, financial position or cash flows. The allocation of purchase price for these acquisitions will be completed as soon as practicable, but no later than one year from the acquisition date. Refer to Note 2. \n21\nAcquisitions in Item 8. Financial Statements and Supplementary Data for further information regarding the Company's acquisitions.\nDuring the first quarter of 2024, the Company changed the method used to determine the cost of inventory at certain U.S. businesses from the last-in, first-out (\"LIFO\") method to the first-in, first-out (\"FIFO\") method, as the Company believes the FIFO method is preferable because it provides a more consistent method for valuing inventory across the Company’s operations, improves comparability with peers, and better reflects the current value of inventories at the balance sheet date. The LIFO provision for the years ended December 31, 2023 and 2022 was $6 million of expense and $7 million of income, respectively, and was not material to the Company’s results of operations, financial position or cash flows. Therefore, the Company recorded the pre-tax cumulative effect of this change in accounting method of $117 million as a reduction of Cost of revenue in the first quarter of 2024. Refer to Note 1. Description of Business and Summary of Significant Accounting Policies in Item 8. Financial Statements and Supplementary Data for additional information regarding this change in accounting method and the Company’s inventory balances.\nOn August 5, 2024, the Company entered into a purchase agreement with affiliates of CD&R for the sale of the Company’s noncontrolling equity interest in Wilsonart. The transaction closed immediately after the execution of the purchase agreement. Proceeds from the transaction, net of transaction costs, were $395 million, resulting in a pre-tax gain of $363 million which was included in Other income (expense) in the Statement of Income. Income taxes on the gain were more than offset by a discrete tax benefit of $107 million in the third quarter of 2024 related to the utilization of capital loss carryforwards upon the sale of Wilsonart. The sale of the Company’s equity interest in Wilsonart is not expected to have a material impact on the Company’s financial results in subsequent periods. Refer to Note 5. Other Income (Expense) and Note 6. Income Taxes in Item 8. Financial Statements and Supplementary Data for additional information regarding this transaction.\nIn a challenging and dynamic environment, the Company delivered solid financial results in 2024 primarily due to the continued successful execution of enterprise initiatives and continued focus on the highly differentiated ITW Business Model.\nOperating Revenue\nRefer to the \"Results of Operations for Total Company\" and the \"Results of Operations by Segment\" sections for discussion of changes in operating revenue for 2024 compared to 2023 and 2023 compared to 2022.\nOperating Expenses\nDollars in millions\n2024\n2023\n2022\nOperating Revenue\n$\n15,898 \n$\n16,107 \n$\n15,932 \nCost of revenue\n$\n8,858 \n$\n9,316 \n$\n9,429 \n Percent of operating revenue\n55.7 \n%\n57.8 \n%\n59.2 \n%\nSelling, administrative, and research and development expenses\n$\n2,675 \n$\n2,638 \n$\n2,579 \n Percent of operating revenue\n16.8 \n%\n16.4 \n%\n16.2 \n%\nAmortization and impairment of intangible assets\n$\n101 \n$\n113 \n$\n134 \n Percent of operating revenue\n0.6 \n%\n0.7 \n%\n0.8 \n%\nCost of revenue was $8.9 billion in 2024, $9.3 billion in 2023 and $9.4 billion in 2022. Cost of revenue was 4.9% lower in 2024 compared to 2023 primarily due to lower revenue and the first quarter 2024 LIFO accounting method change, which reduced cost of revenue by 3.1% and 1.3%, respectively. Cost of revenue as a percent of operating revenue improved in 2024 compared to 2023 primarily due to the LIFO accounting method change and benefits from the Company's enterprise initiatives, partially offset by higher employee-related expenses. Cost of revenue was 1.2% lower in 2023 compared to 2022 primarily due to the impact of divestiture activity in the second quarter of 2023 and the fourth quarter of 2022, which reduced cost of revenue by 1.0%. Cost of revenue as a percent of operating revenue improved in 2023 compared to 2022 primarily due to benefits from the Company's enterprise initiatives and positive operating leverage, partially offset by higher employee-related expenses. \n22\nSelling, administrative, and research and development expenses were $2.7 billion in 2024, $2.6 billion in 2023 and $2.6 billion in 2022. Expenses in 2024 increased 1.4% compared to 2023 primarily driven by higher employee-related expenses and the impact of acquisitions in 2024. Selling, administrative, and research and development expenses as a percent of operating revenue were higher in 2024 compared to 2023, as higher employee-related expenses and the unfavorable impact of acquisitions in the first and second quarters of 2024 were partially offset by benefits from the Company's enterprise initiatives. Expenses in 2023 increased 2.3% compared to 2022 driven by a 3.0% increase resulting from higher organic revenue, partially offset by the impact of divestiture activity which reduced expenses by 0.7%. Selling, administrative, and research and development expenses as a percent of operating revenue were slightly higher in 2023 compared to 2022 primarily due to higher employee-related expenses and research and development expenses, partially offset by positive operating leverage and benefits from the Company's enterprise initiatives.\nAmortization and impairment of intangible assets was $101 million in 2024, $113 million in 2023 and $134 million in 2022. The decreased expense in each respective period was primarily due to fully amortized intangible assets.\nRefer to the \"Results of Operations for Total Company\" and the \"Results of Operation by Segment\" sections for additional discussion of operating results for 2024 compared to 2023 and 2023 compared to 2022.\nRESULTS OF OPERATIONS FOR TOTAL COMPANY\nThe Company's consolidated results of operations for 2024, 2023 and 2022 were as follows:\n2024 compared to 2023\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2024\n2023\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n15,898 \n$\n16,107 \n(1.3)\n%\n(0.7)\n%\n0.1 \n%\n— \n%\n(0.7)\n%\n(1.3)\n%\nOperating income\n$\n4,264 \n$\n4,040 \n5.5 \n%\n6.2 \n%\n(0.2)\n%\n0.5 \n%\n(1.0)\n%\n5.5 \n%\nOperating margin %\n26.8 \n%\n25.1 \n%\n170 bps\n170 bps\n(10) bps\n10 bps\n— \n170 bps\n•\nOperating revenue decreased primarily due to lower organic revenue and the unfavorable effect of foreign currency translation.\n•\nOrganic revenue declined 0.7% as a decrease in the Construction Products, Welding, Test & Measurement and Electronics and Automotive OEM segments was partially offset by growth in the Specialty Products, Food Equipment and Polymers & Fluids segments. Product line simplification activities reduced organic revenue by 60 basis points.\n◦\nNorth American organic revenue decreased 2.4% as a decline in six segments was partially offset by growth in the Specialty Products segment.\n◦\nEurope, Middle East and Africa organic revenue declined 0.3% as a decrease in the Automotive OEM, Construction Products and Test & Measurement and Electronics segments was partially offset by growth in the Specialty Products, Food Equipment, Polymers & Fluids and Welding segments.\n◦\nAsia Pacific organic revenue grew 3.0% as growth in six segments was partially offset by a decline in the Construction Products segment. Organic revenue in China increased 6.9% as growth in five segments was partially offset by a decline in the Construction Products and Test & Measurement and Electronics segments.\n•\nOperating income of $4.3 billion grew 5.5%, or 2.6% excluding the $117 million favorable impact of the LIFO accounting method changed discussed previously. \n•\nOperating margin of 26.8% increased 170 basis points. Excluding the 70 basis points of favorable impact from the LIFO accounting method change in the first quarter of 2024, operating margin increased 100 basis points primarily driven by benefits from the Company's enterprise initiatives of 130 basis points and favorable price/cost of 40 basis points, partially offset by higher employee-related expenses.\n•\nThe Company's effective tax rate for 2024 and 2023 was 21.1% and 22.6%, respectively. The 2024 effective tax rate benefited from discrete income tax benefits during the third quarter of 2024 of $107 million related to the utilization of capital loss carryforwards upon the sale of Wilsonart and $87 million related to a reorganization of the Company's intellectual property, partially offset by a $73 million discrete tax expense related to the remeasurement of unrecognized tax benefits associated with various intercompany transactions. Refer to Note 5. Other Income \n23\n(Expense) and Note 6. Income Taxes in Item 8. Financial Statements and Supplementary Data for additional information regarding these transactions. The 2023 effective tax rate benefited from a discrete income tax benefit of $20 million in the second quarter of 2023 related to amended 2021 U.S. taxes. Additionally, the effective tax rates for 2024 and 2023 included discrete income tax benefits of $14 million and $20 million, respectively, related to excess tax benefits from stock-based compensation.\n•\nDiluted earnings per share (\"EPS\") of $11.71 in 2024 increased 20.2%, or 4.2% excluding the favorable impact from the first quarter 2024 LIFO accounting method change of $0.30 and the favorable impact of $1.26 from the third quarter 2024 Wilsonart transaction.\n•\nThe Company repurchased approximately 5.9 million shares of its common stock in 2024 for approximately $1.5 billion.\n•\nThe Company increased the quarterly dividend on common stock from $1.40 to $1.50 per share in 2024, or from $5.60 to $6.00 per share on an annualized basis. Total cash dividends of approximately $1.7 billion were paid in 2024.\n2023 compared to 2022\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2023\n2022\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n16,107 \n$\n15,932 \n1.1 \n%\n2.0 \n%\n(0.8)\n%\n— \n%\n(0.1)\n%\n1.1 \n%\nOperating income\n$\n4,040 \n$\n3,790 \n6.6 \n%\n7.6 \n%\n(0.5)\n%\n(0.2)\n%\n(0.3)\n%\n6.6 \n%\nOperating margin %\n25.1 \n%\n23.8 \n%\n130 bps\n130 bps\n10 bps\n(10) bps\n— \n130 bps\n•\nOperating revenue increased due to higher organic revenue, partially offset by the impact of divestiture activity in the second quarter of 2023 and the fourth quarter of 2022, and the unfavorable effect of foreign currency translation.\n•\nOrganic revenue increased 2.0% as growth in five segments was partially offset by a decline in the Specialty Products and Construction Products segments. Product line simplification activities reduced organic revenue by 50 basis points.\n◦\nNorth American organic revenue decreased 0.3% as a decline in the Test & Measurement and Electronics, Specialty Products, Automotive OEM, Welding and Construction Products segments was partially offset by growth in the Food Equipment and Polymers & Fluids segments.\n◦\nEurope, Middle East and Africa organic revenue increased 3.9% as growth in three segments was partially offset by a decline in the Construction Products, Polymers & Fluids, Specialty Products and Welding segments.\n◦\nAsia Pacific organic revenue increased 6.9% as growth in five segments was partially offset by a decline in the Specialty Products and Construction Products segments. Organic revenue in China increased 9.7% as growth in the Automotive OEM, Test & Measurement and Electronics, Welding, Construction Products and Polymers & Fluids segments was partially offset by a decline in the Specialty Products and Food Equipment segments.\n•\nOperating income of $4.0 billion increased 6.6% compared to the prior year primarily due to higher organic revenue, partially offset by the impact of divestiture activity, the unfavorable effect of foreign currency translation and higher restructuring expenses.\n•\nOperating margin of 25.1% increased 130 basis points primarily driven by favorable price/cost of 210 basis points, benefits from the Company's enterprise initiatives of 130 basis points and positive operating leverage of 40 basis points, partially offset by continued investments in the business and higher employee-related expenses.\n•\nThe Company's effective tax rate for 2023 and 2022 was 22.6% and 21.0%, respectively. The 2023 effective tax rate benefited from a discrete income tax benefit of $20 million in the second quarter of 2023 related to amended 2021 U.S. taxes. The 2022 effective tax rate benefited from discrete income tax benefits of $32 million in the fourth quarter of 2022 related to the utilization of capital loss carryforwards and $51 million in the second quarter of 2022 related to a decrease in unrecognized tax benefits resulting from the resolution of a U.S. tax audit. Additionally, the effective tax rates for 2023 and 2022 included discrete income tax benefits of $20 million and $12 million, respectively, related to excess tax benefits from stock-based compensation.\n•\nDiluted earnings per share (\"EPS\") of $9.74 in 2023 decreased 0.3%. Excluding the favorable impact of $0.60 per diluted share in 2022 related to the pre-tax divestiture gains of $197 million in the fourth quarter of 2022, or $188 million after-tax including the impact of the $32 million discrete tax benefit noted above, EPS increased 6.2%.\n24\n•\nThe Company repurchased approximately 6.4 million shares of its common stock in 2023 for approximately $1.5 billion.\n•\nThe Company increased the quarterly dividend on common stock from $1.31 to $1.40 per share in 2023, or from $5.24 to $5.60 per share on an annualized basis. Total cash dividends of approximately $1.6 billion were paid in 2023.\nRESULTS OF OPERATIONS BY SEGMENT\nThe reconciliation of segment operating revenue and operating income to total operating revenue and operating income is as follows:\nOperating Revenue\nIn millions\n2024\n2023\n2022\nAutomotive OEM\n$\n3,188 \n$\n3,235 \n$\n2,969 \nFood Equipment\n2,647 \n2,622 \n2,444 \nTest & Measurement and Electronics\n2,818 \n2,832 \n2,828 \nWelding\n1,851 \n1,902 \n1,894 \nPolymers & Fluids\n1,764 \n1,804 \n1,905 \nConstruction Products\n1,909 \n2,033 \n2,113 \nSpecialty Products\n1,743 \n1,697 \n1,799 \nTotal segments\n15,920 \n16,125 \n15,952 \nIntersegment revenue\n(22)\n(18)\n(20)\nTotal\n$\n15,898 \n$\n16,107 \n$\n15,932 \nOperating Income\nIn millions\n2024\n2023\n2022\nAutomotive OEM\n$\n625 \n$\n561 \n$\n499 \nFood Equipment\n719 \n713 \n618 \nTest & Measurement and Electronics\n703 \n686 \n684 \nWelding\n597 \n605 \n583 \nPolymers & Fluids\n484 \n482 \n479 \nConstruction Products\n559 \n578 \n548 \nSpecialty Products\n528 \n449 \n481 \nTotal segments\n4,215 \n4,074 \n3,892 \nUnallocated\n49 \n(34)\n(102)\nTotal\n$\n4,264 \n$\n4,040 \n$\n3,790 \nSegments are allocated a fixed overhead charge based on the segment's revenue. Expenses not charged to the segments are reported separately as Unallocated. Because the Unallocated category includes a variety of items, it is subject to fluctuations on a quarterly and annual basis. Unallocated expenses in 2024 included the favorable pre-tax cumulative effect of the LIFO accounting method change of $117 million in the first quarter of 2024. Refer to Note 1. Description of Business and Summary of Significant Accounting Policies in Item 8. Financial Statements and Supplementary Data for additional information regarding this change in accounting method and the Company’s inventory balances. Unallocated expenses in 2023 were lower as compared to 2022 primarily due to the impact of lower corporate expenses, including favorable health and welfare expenses, and an immaterial insurance recovery. \n25\nAUTOMOTIVE OEM\nThis segment is a global, niche supplier to top tier OEMs, providing unique innovation to address pain points for sophisticated customers with complex problems. Businesses in this segment produce components and fasteners for automotive-related applications. This segment primarily serves the automotive original equipment manufacturers and tiers market. Products in this segment include:\n•\nplastic and metal components, fasteners and assemblies for automobiles, light trucks and other industrial uses.\nThe results of operations for the Automotive OEM segment for 2024, 2023 and 2022 were as follows:\n2024 compared to 2023\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2024\n2023\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n3,188 \n$\n3,235 \n(1.5)\n%\n(0.4)\n%\n— \n%\n— \n%\n(1.1)\n%\n(1.5)\n%\nOperating income\n$\n625 \n$\n561 \n11.4 \n%\n9.6 \n%\n— \n%\n3.0 \n%\n(1.2)\n%\n11.4 \n%\nOperating margin %\n19.6 \n%\n17.3 \n%\n230 bps\n180 bps\n— \n50 bps\n— \n230 bps\n•\nOperating revenue decreased due to the unfavorable effect of foreign currency translation and lower organic revenue.\n•\nOrganic revenue declined 0.4% compared to worldwide auto builds which decreased 1%. Product line simplification activities reduced organic revenue by 70 basis points.\n◦\nNorth American revenue decreased 5.1% compared to North American auto builds which declined 1% primarily due to customer mix and product line simplification activities. Auto builds for the Detroit 3, where the Company has higher content, decreased 4%.\n◦\nEuropean organic revenue declined 3.4% compared to European auto builds which decreased 5% primarily due to market penetration gains.\n◦\nAsia Pacific organic revenue grew 9.7%. China organic revenue increased 8.1%, including growth in the electric vehicles market and market penetration gains with Chinese original equipment manufacturers, versus China auto builds which grew 4%. Auto builds of foreign automotive manufacturers in China, where the Company has higher content per vehicle, decreased 17%. \n•\nOperating margin of 19.6% increased 230 basis points primarily driven by benefits from the Company's enterprise initiatives, lower restructuring expenses and favorable price/cost of 20 basis points, partially offset by higher employee-related expenses and continued investment in the business.\n2023 compared to 2022\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2023\n2022\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n3,235 \n$\n2,969 \n9.0 \n%\n8.8 \n%\n— \n%\n— \n%\n0.2 \n%\n9.0 \n%\nOperating income\n$\n561 \n$\n499 \n12.4 \n%\n11.7 \n%\n— \n%\n1.1 \n%\n(0.4)\n%\n12.4 \n%\nOperating margin %\n17.3 \n%\n16.8 \n%\n50 bps\n40 bps\n— \n20 bps\n(10) bps\n50 bps\n•\nOperating revenue grew due to higher organic revenue and the favorable effect of foreign currency translation.\n•\nOrganic revenue increased 8.8% compared to worldwide auto builds which grew 9%. Product line simplification activities reduced organic revenue by 50 basis points primarily in North America. Additionally, automotive industry labor actions in North America negatively impacted operating results in the second half of 2023.\n◦\nNorth American organic revenue decreased 1.9% compared to North American auto builds which increased 9% primarily due to customer mix and product line simplification. Auto builds for the Detroit 3, where the Company has higher content, grew 1%.\n26\n◦\nEuropean organic revenue grew 12.5% compared to European auto builds which increased 13%.\n◦\nAsia Pacific organic revenue increased 21.4%. China organic revenue grew 21.9%, including growth in the electric vehicles market and higher content in the Chinese original equipment manufacturers, versus China auto builds which increased 9%.\n•\nOperating margin of 17.3% increased 50 basis points primarily driven by positive operating leverage of 160 basis points, favorable price/cost of 140 basis points and benefits from the Company's enterprise initiatives, partially offset by higher employee-related expenses and continued investments in the business, including the electric vehicles market, and product mix.\nFOOD EQUIPMENT\nThis segment is a highly focused and branded industry leader in commercial food equipment differentiated by innovation and integrated service offerings. This segment primarily serves the food service, food retail and food institutional/restaurant markets. Products in this segment include:\n•\nwarewashing equipment;\n•\ncooking equipment, including ovens, ranges and broilers;\n•\nrefrigeration equipment, including refrigerators, freezers and prep tables;\n•\nfood processing equipment, including slicers, mixers and scales;\n•\nkitchen exhaust, ventilation and pollution control systems; and\n•\nfood equipment service, maintenance and repair.\nThe results of operations for the Food Equipment segment for 2024, 2023 and 2022 were as follows:\n2024 compared to 2023\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2024\n2023\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n2,647 \n$\n2,622 \n1.0 \n%\n1.1 \n%\n— \n%\n— \n%\n(0.1)\n%\n1.0 \n%\nOperating income\n$\n719 \n$\n713 \n1.0 \n%\n1.4 \n%\n— \n%\n(0.3)\n%\n(0.1)\n%\n1.0 \n%\nOperating margin %\n27.2 \n%\n27.2 \n%\n— \n10 bps\n— \n(10) bps\n— \n— \n•\nOperating revenue increased primarily due to higher organic revenue.\n•\nOrganic revenue grew 1.1% as equipment declined 0.8% and service organic revenue increased 4.8%.\n◦\nNorth American organic revenue decreased 0.2%. Equipment organic revenue declined 2.4% primarily due to lower demand in the independent restaurant and food retail end markets, partially offset by growth in the institutional end market. Service organic revenue grew 3.9%.\n◦\nInternational organic revenue grew 3.0%. Equipment organic revenue increased 1.6% primarily due to higher demand in the European warewash and cooking end markets and growth in Asia Pacific, partially offset by lower demand in the European refrigeration end market. Service organic revenue grew 6.4%.\n•\nOperating margin of 27.2% was flat as benefits from the Company's enterprise initiatives, favorable price/cost of 30 basis points and positive operating leverage of 20 basis points were offset by higher operating expenses, including employee-related expenses and additional investment in the business.\n27\n2023 compared to 2022\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2023\n2022\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n2,622 \n$\n2,444 \n7.3 \n%\n7.8 \n%\n(1.2)\n%\n— \n%\n0.7 \n%\n7.3 \n%\nOperating income\n$\n713 \n$\n618 \n15.2 \n%\n15.4 \n%\n(0.7)\n%\n(0.3)\n%\n0.8 \n%\n15.2 \n%\nOperating margin %\n27.2 \n%\n25.3 \n%\n190 bps\n180 bps\n20 bps\n(10) bps\n— \n190 bps\n•\nOperating revenue grew due to higher organic revenue and the favorable effect of foreign currency translation, partially offset by the impact of a divestiture in the fourth quarter of 2022. On December 1, 2022, the Company completed the sale of a business. Operating revenue for this business that was included in the Company's results of operations for the year ended December 31, 2022 was $30 million. Refer to Note 3. Divestitures in Item 8. Financial Statements and Supplementary Data for further information.\n•\nOrganic revenue increased 7.8% as equipment and service organic revenue grew 5.8% and 12.5%, respectively.\n◦\nNorth American organic revenue increased 10.4% as equipment organic revenue grew 10.0% with growth in the institutional, food retail and restaurant end markets. Service organic revenue increased 12.0%.\n◦\nInternational organic revenue increased 3.8%. Equipment organic revenue was flat as higher demand in the European warewash and refrigeration end markets was offset by lower demand in the European cooking end market and in China. Service organic revenue increased 13.4%.\n•\nOperating margin of 27.2% increased 190 basis points primarily driven by favorable price/cost of 220 basis points, positive operating leverage of 150 basis points and benefits from the Company's enterprise initiatives, partially offset by higher operating expenses, including employee-related expenses.\nTEST & MEASUREMENT AND ELECTRONICS\nThis segment is a branded and innovative producer of test and measurement and electronic manufacturing and maintenance, repair, and operations, or \"MRO\" solutions that improve efficiency and quality for customers in diverse end markets. Businesses in this segment produce equipment, consumables, and related software for testing and measuring of materials and structures, as well as equipment and consumables used in the production of electronic subassemblies and microelectronics. This segment primarily serves the electronics, general industrial, automotive original equipment manufacturers and tiers, energy, industrial capital goods and consumer durables markets. Products in this segment include:\n•\nequipment, consumables, and related software for testing and measuring of materials, structures, gases and fluids;\n•\nelectronic assembly equipment;\n•\nelectronic components and component packaging;\n•\nstatic control equipment and consumables used for contamination control in clean room environments; and\n•\npressure sensitive adhesives and components for electronics, medical, transportation and telecommunications applications.\nThe results of operations for the Test & Measurement and Electronics segment for 2024, 2023 and 2022 were as follows:\n2024 compared to 2023\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2024\n2023\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n2,818 \n$\n2,832 \n(0.5)\n%\n(1.0)\n%\n0.9 \n%\n— \n%\n(0.4)\n%\n(0.5)\n%\nOperating income\n$\n703 \n$\n686 \n2.5 \n%\n4.0 \n%\n(1.0)\n%\n— \n%\n(0.5)\n%\n2.5 \n%\nOperating margin %\n24.9 \n%\n24.2 \n%\n70 bps\n130 bps\n(50) bps\n— \n(10) bps\n70 bps\n•\nOperating revenue decreased due to lower organic revenue and the unfavorable effect of foreign currency translation, partially offset by revenue from acquisitions.\n28\n•\nThe Company completed the acquisition of one business for $57 million, net of cash acquired, on January 2, 2024, and completed the acquisition of a second business for $59 million, net of cash acquired, on April 1, 2024. Refer to Note 2. Acquisitions in Item 8. Financial Statements and Supplementary Data for additional information regarding these acquisitions.\n•\nOrganic revenue decreased 1.0% primarily due to a decline in the semiconductor and electronics end markets, partially offset by growth in the MTS Test & Simulation business.\n◦\nOrganic revenue for the test and measurement businesses declined 1.0% primarily driven by lower demand in the semiconductor and general industrial end markets, primarily in North America and Asia Pacific, partially offset by growth in the MTS Test & Simulation business.\n◦\nElectronics organic revenue decreased 1.3% primarily due to a decline in the consumer electronics end market, partially offset by higher demand in the consumable semiconductor end market. The electronics assembly businesses declined 11.1% primarily due to lower demand in North America. The other electronics businesses, which include the contamination control, static control and pressure sensitive adhesives businesses, grew 3.1% primarily due to higher demand across all major regions.\n•\nOperating margin of 24.9% increased 70 basis points primarily driven by benefits from the Company's enterprise initiatives, favorable price/cost of 60 basis points and lower intangible asset amortization expense, partially offset by product mix, the dilutive impact of 50 basis points from acquisitions in 2024, higher employee-related expenses and unfavorable operating leverage of 20 basis points.\n2023 compared to 2022\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2023\n2022\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n2,832 \n$\n2,828 \n0.1 \n%\n0.3 \n%\n— \n%\n— \n%\n(0.2)\n%\n0.1 \n%\nOperating income\n$\n686 \n$\n684 \n0.3 \n%\n1.3 \n%\n— \n%\n(0.5)\n%\n(0.5)\n%\n0.3 \n%\nOperating margin %\n24.2 \n%\n24.2 \n%\n— \n20 bps\n— \n(10) bps\n(10) bps\n— \n•\nOperating revenue was essentially flat as higher organic revenue was offset by the unfavorable effect of foreign currency translation.\n•\nOrganic revenue increased 0.3% primarily due to growth in the general industrial end market, partially offset by a decline in the semiconductor end market.\n◦\nOrganic revenue for the test and measurement businesses increased 7.0% primarily driven by growth in the MTS Test & Simulation and Instron businesses and higher demand in the automotive, defense, and oil and gas end markets, partially offset by lower semiconductor demand in North America.\n◦\nElectronics organic revenue decreased 10.8% primarily due to a decline in the consumer electronics and semiconductor end markets. The electronics assembly businesses decreased 19.3% primarily due to lower demand in North America and Asia Pacific. The other electronics businesses, which include the contamination control, static control and pressure sensitive adhesives businesses, decreased 6.4% primarily due to lower demand in the semiconductor end market, partially offset by higher demand in the automotive end market.\n•\nOperating margin of 24.2% was flat compared to the prior year as favorable price/cost of 160 basis points, benefits from the Company's enterprise initiatives and lower intangible asset amortization expense were offset by higher employee-related expenses and product mix.\nWELDING\nThis segment is a branded value-added equipment and specialty consumable manufacturer with innovative and leading technology. Businesses in this segment produce arc welding equipment, consumables and accessories for a wide array of industrial and commercial applications. This segment primarily serves the general industrial market, which includes fabrication, shipbuilding and other general industrial markets, and construction, energy, MRO, industrial capital goods and automotive original equipment manufacturers and tiers markets. Products in this segment include:\n•\narc welding equipment; and\n•\nmetal arc welding consumables and related accessories.\n29\nThe results of operations for the Welding segment for 2024, 2023 and 2022 were as follows:\n2024 compared to 2023\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2024\n2023\nInc (Dec)\nOrganic\nAcquisition/\nDivestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,851 \n$\n1,902 \n(2.7)\n%\n(2.4)\n%\n— \n%\n— \n%\n(0.3)\n%\n(2.7)\n%\nOperating income\n$\n597 \n$\n605 \n(1.3)\n%\n(1.3)\n%\n— \n%\n0.2 \n%\n(0.2)\n%\n(1.3)\n%\nOperating margin %\n32.3 \n%\n31.8 \n%\n50 bps\n40 bps\n— \n10 bps\n— \n50 bps\n•\nOperating revenue decreased due to lower organic revenue and the unfavorable effect of foreign currency translation.\n•\nOrganic revenue declined 2.4% as equipment and consumables decreased 2.1% and 3.0%, respectively.\n◦\nNorth American organic revenue decreased 3.3% as the industrial and commercial end markets declined 2.3% and 6.0%, respectively.\n◦\nInternational organic revenue grew 2.2% primarily due to higher equipment demand in the general industrial and oil and gas end markets in Europe and Asia Pacific.\n•\nOperating margin of 32.3% increased 50 basis points primarily driven by benefits from the Company's enterprise initiatives and favorable price/cost of 50 basis points, partially offset by higher employee-related expenses and unfavorable operating leverage of 40 basis points.\n2023 compared to 2022\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2023\n2022\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,902 \n$\n1,894 \n0.4 \n%\n0.3 \n%\n— \n%\n— \n%\n0.1 \n%\n0.4 \n%\nOperating income\n$\n605 \n$\n583 \n3.7 \n%\n3.4 \n%\n— \n%\n(0.1)\n%\n0.4 \n%\n3.7 \n%\nOperating margin %\n31.8 \n%\n30.8 \n%\n100 bps\n100 bps\n— \n— \n— \n100 bps\n•\nOperating revenue grew due to higher organic revenue and the favorable effect of foreign currency translation.\n•\nOrganic revenue increased 0.3%, which had a challenging comparable in the prior year of 16.0% growth. Consumables grew 1.3% and equipment decreased 0.4%.\n◦\nNorth American organic revenue decreased 0.2% primarily due to a decline in the commercial end markets, partially offset by growth in the industrial and aerospace end markets.\n◦\nInternational organic revenue grew 2.7% primarily due to higher equipment demand in the general industrial and oil and gas end markets in Asia Pacific.\n•\nOperating margin of 31.8% increased 100 basis points primarily driven by favorable price/cost of 300 basis points and benefits from the Company's enterprise initiatives, partially offset by higher employee-related expenses and product mix.\nPOLYMERS & FLUIDS\nThis segment is a branded supplier to niche markets that require value-added, differentiated products. Businesses in this segment produce engineered adhesives, sealants, lubrication and cutting fluids, and fluids and polymers for auto aftermarket maintenance and appearance. This segment primarily serves the automotive aftermarket, general industrial and MRO markets. Products in this segment include:\n•\nadhesives for industrial, construction and consumer purposes;\n•\nchemical fluids which clean or add lubrication to machines;\n•\nepoxy and resin-based coating products for industrial applications;\n•\nhand wipes and cleaners for industrial applications;\n30\n•\nfluids, polymers and other supplies for auto aftermarket maintenance and appearance;\n•\nfillers and putties for auto body repair; and\n•\npolyester coatings and patch and repair products for the marine industry.\nThe results of operations for the Polymers & Fluids segment for 2024, 2023 and 2022 were as follows:\n2024 compared to 2023\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2024\n2023\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,764 \n$\n1,804 \n(2.2)\n%\n0.9 \n%\n— \n%\n— \n%\n(3.1)\n%\n(2.2)\n%\nOperating income\n$\n484 \n$\n482 \n0.4 \n%\n3.7 \n%\n— \n%\n0.9 \n%\n(4.2)\n%\n0.4 \n%\nOperating margin %\n27.4 \n%\n26.7 \n%\n70 bps\n80 bps\n— \n20 bps\n(30) bps\n70 bps\n•\nOperating revenue decreased due to the unfavorable effect of foreign currency translation, partially offset by higher organic revenue.\n•\nOrganic revenue grew 0.9% due to increases in South America, Europe and Asia Pacific, partially offset by a decrease in North America. Product line simplification activities reduced organic revenue by 30 basis points.\n◦\nOrganic revenue for the polymers businesses grew 6.3% due to increases in South America, Europe and Asia Pacific, partially offset by a decrease in North America.\n◦\nOrganic revenue for the fluids businesses increased 1.9% primarily driven by higher demand in Europe, primarily due to growth in the life sciences end market, partially offset by lower demand in the North American and European industrial maintenance, repair and operations and hygiene end markets.\n◦\nOrganic revenue for the automotive aftermarket businesses declined 2.2% primarily due to lower demand in the North American car care, body repair and tire repair businesses, partially offset by growth in the North American engine repair business and the European additives and tire repair businesses.\n•\nOperating margin of 27.4% increased 70 basis points primarily driven by benefits from the Company's enterprise initiatives, favorable price/cost of 30 basis points, positive operating leverage of 20 basis points, lower restructuring expenses and lower intangible asset amortization expense, partially offset by higher employee-related expenses.\n2023 compared to 2022\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2023\n2022\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,804 \n$\n1,905 \n(5.3)\n%\n0.3 \n%\n(4.0)\n%\n— \n%\n(1.6)\n%\n(5.3)\n%\nOperating income\n$\n482 \n$\n479 \n0.6 \n%\n7.6 \n%\n(3.3)\n%\n(0.8)\n%\n(2.9)\n%\n0.6 \n%\nOperating margin %\n26.7 \n%\n25.2 \n%\n150 bps\n180 bps\n30 bps\n(20) bps\n(40) bps\n150 bps\n•\nOperating revenue declined due to the impact of a divestiture in the fourth quarter of 2022 and the unfavorable effect of foreign currency translation, partially offset by higher organic revenue. On October 3, 2022, the Company completed the sale of a business. Operating revenue for this business that was included in the Company's results of operations for the year ended December 31, 2022 was $76 million. Refer to Note 3. Divestitures in Item 8. Financial Statements and Supplementary Data for further information.\n•\nOrganic revenue increased 0.3% as growth in North America was partially offset by a decline in Europe. Product line simplification activities reduced organic revenue by 70 basis points.\n◦\nOrganic revenue for the automotive aftermarket businesses increased 1.4% primarily due to an increase in the car care, tire repair and engine repair businesses in North America and growth in Europe, partially offset by a decline in the body repair business in North America.\n◦\nOrganic revenue for the polymers businesses increased 0.3% due to higher demand in North America, partially offset by a decline in Europe. Demand in Europe was negatively impacted by declines in the wind and industrial end markets.\n31\n◦\nOrganic revenue for the fluids businesses declined 2.7% driven by lower demand in the European life sciences end market, the North American industrial maintenance, repair and operations end market, and the transportation and health and hygiene end markets.\n•\nOperating margin of 26.7% increased 150 basis points primarily driven by favorable price/cost of 210 basis points, benefits from the Company's enterprise initiatives and lower intangible asset amortization expense, partially offset by higher employee-related expenses and product mix.\nCONSTRUCTION PRODUCTS\nThis segment is a branded supplier of innovative engineered fastening systems and solutions. This segment primarily serves the residential construction, renovation/remodel and commercial construction markets. Products in this segment include:\n•\nfasteners and related fastening tools for wood and metal applications;\n•\nanchors, fasteners and related tools for concrete applications;\n•\nmetal plate truss components and related equipment and software; and\n•\npackaged hardware, fasteners, anchors and other products for retail.\nThe results of operations for the Construction Products segment for 2024, 2023 and 2022 were as follows:\n2024 compared to 2023\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2024\n2023\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,909 \n$\n2,033 \n(6.1)\n%\n(6.1)\n%\n— \n%\n— \n%\n— \n%\n(6.1)\n%\nOperating income\n$\n559 \n$\n578 \n(3.4)\n%\n(2.5)\n%\n— \n%\n(0.8)\n%\n(0.1)\n%\n(3.4)\n%\nOperating margin %\n29.3 \n%\n28.4 \n%\n90 bps\n110 bps\n— \n(20) bps\n— \n90 bps\n•\nOperating revenue decreased due to lower organic revenue.\n•\nOrganic revenue declined 6.1% due to lower demand across all major regions. Product line simplification activities reduced organic revenue by 50 basis points.\n◦\nNorth American organic revenue decreased 4.6% primarily due to lower demand in the residential and commercial end markets. Organic revenue in the United States residential and commercial end markets declined 4.5% and 9.5%, respectively. Organic revenue in Canada increased 3.9%.\n◦\nInternational organic revenue declined 7.7%. European organic revenue decreased 6.3% primarily due to lower demand in the commercial and residential end markets. Asia Pacific organic revenue declined 9.2% primarily due to lower demand in the Australia and New Zealand residential end markets.\n•\nOperating margin of 29.3% increased 90 basis points primarily driven by benefits from the Company's enterprise initiatives and favorable price/cost of 10 basis points, partially offset by unfavorable operating leverage of 110 basis points, higher employee-related expenses and higher restructuring expenses.\n2023 compared to 2022\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2023\n2022\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n2,033 \n$\n2,113 \n(3.8)\n%\n(3.2)\n%\n— \n%\n— \n%\n(0.6)\n%\n(3.8)\n%\nOperating income\n$\n578 \n$\n548 \n5.5 \n%\n6.6 \n%\n— \n%\n(0.5)\n%\n(0.6)\n%\n5.5 \n%\nOperating margin %\n28.4 \n%\n25.9 \n%\n250 bps\n270 bps\n— \n(20) bps\n— \n250 bps\n•\nOperating revenue declined due to lower organic revenue and the unfavorable effect of foreign currency translation.\n•\nOrganic revenue declined 3.2%, which had a challenging comparable in the prior year period of 14.4% growth. Organic revenue declined primarily due to a decrease in Europe and Asia Pacific. Product line simplification activities reduced organic revenue by 50 basis points.\n32\n◦\nNorth American organic revenue decreased 0.2% primarily due to lower demand in the United States residential and commercial end markets of 0.2% and 0.1%, respectively. Organic revenue in Canada declined 2.7%.\n◦\nInternational organic revenue decreased 6.4%. European organic revenue declined 9.9% primarily due to lower demand in the commercial and residential end markets. Asia Pacific organic revenue declined 2.3% primarily due to lower demand in the Australia and New Zealand residential end markets.\n•\nOperating margin of 28.4% increased 250 basis points primarily driven by favorable price/cost of 350 basis points and benefits from the Company's enterprise initiatives, partially offset by higher employee-related expenses and unfavorable operating leverage of 60 basis points.\nSPECIALTY PRODUCTS\nThis segment is focused on diversified niche market opportunities with substantial patent protection producing beverage packaging equipment and consumables, product coding and marking equipment and consumables, and appliance components and fasteners. This segment primarily serves the food and beverage, consumer durables, general industrial, airlines, industrial capital goods and printing and publishing markets. Products in this segment include:\n•\nconveyor systems and line automation for the food and beverage industries;\n•\nplastic consumables that multi-pack cans and bottles and related equipment;\n•\nfoil, film and related equipment used to decorate consumer products;\n•\nproduct coding and marking equipment and related consumables;\n•\nplastic and metal closures and components for appliances;\n•\nairport ground support equipment; and\n•\ncomponents for medical devices.\nThe results of operations for the Specialty Products segment for 2024, 2023 and 2022 were as follows:\n2024 compared to 2023\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2024\n2023\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,743 \n$\n1,697 \n2.7 \n%\n3.5 \n%\n(0.6)\n%\n— \n%\n(0.2)\n%\n2.7 \n%\nOperating income\n$\n528 \n$\n449 \n17.6 \n%\n17.3 \n%\n(0.1)\n%\n0.7 \n%\n(0.3)\n%\n17.6 \n%\nOperating margin %\n30.3 \n%\n26.5 \n%\n380 bps\n350 bps\n10 bps\n20 bps\n— \n380 bps\n•\nOperating revenue increased due to higher organic revenue, partially offset by the impact of a divestiture in the second quarter of 2023 and the unfavorable effect of foreign currency translation.\n•\nThe Company divested a business on April 3, 2023. Operating revenue for this business in 2023 was $9 million.\n•\nOrganic revenue grew 3.5% as consumables increased 2.3% and equipment sales grew 8.2% due to higher demand across all major regions. Product line simplification activities reduced organic revenue by 270 basis points.\n◦\nNorth American organic revenue increased 1.8% primarily driven by growth in the ground support equipment, appliance, consumer packaging and strength films businesses, partially offset by a decline in the decorative and thermal foils businesses.\n◦\nInternational organic revenue grew 6.9% primarily due to an increase in Europe, primarily in the ground support equipment business, and growth in the appliance business in Asia Pacific, partially offset by a decline in the consumer packaging businesses.\n•\nOperating margin of 30.3% increased 380 basis points primarily driven by benefits from the Company's enterprise initiatives, positive operating leverage of 70 basis points, favorable price/cost of 70 basis points and lower restructuring expenses, partially offset by higher employee-related expenses and product mix.\n33\n2023 compared to 2022\nFor the Years Ended\nDollars in millions\nDecember 31,\nComponents of Increase (Decrease)\n2023\n2022\nInc (Dec)\nOrganic\nAcquisition/Divestiture\nRestructuring\nForeign Currency\nTotal\nOperating revenue\n$\n1,697 \n$\n1,799 \n(5.7)\n%\n(4.9)\n%\n(1.6)\n%\n— \n%\n0.8 \n%\n(5.7)\n%\nOperating income\n$\n449 \n$\n481 \n(6.5)\n%\n(7.2)\n%\n(0.1)\n%\n(0.3)\n%\n1.1 \n%\n(6.5)\n%\nOperating margin %\n26.5 \n%\n26.7 \n%\n(20) bps\n(60) bps\n40 bps\n(10) bps\n10 bps\n(20) bps\n•\nOperating revenue declined due to lower organic revenue and the impact of a divestiture in the second quarter of 2023, partially offset by the favorable effect of foreign currency translation. On April 3, 2023, the Company completed the sale of a business. Operating revenue for this business that was included in the Company's results of operations for the years ended December 31, 2023 and 2022 was $9 million and $37 million, respectively. Refer to Note 3. Divestitures in Item 8. Financial Statements and Supplementary Data for further information.\n•\nOrganic revenue decreased 4.9%. Consumable sales decreased 7.8% due to lower demand in all major regions, including plastic consumables that multi-pack cans and bottles. Equipment sales increased 7.9% primarily driven by higher demand in Europe and North America. Product line simplification activities reduced organic revenue by 150 basis points.\n◦\nNorth American organic revenue decreased 6.4% primarily driven by a decline in the consumer packaging, specialty films, strength films and decorating equipment businesses, partially offset by growth in the ground support equipment, appliance and filter medical businesses.\n◦\nInternational organic revenue declined 1.6% primarily due to a decrease in Asia Pacific in the strength films, graphics and decorating equipment businesses, partially offset by growth in the ground support equipment and consumer packaging businesses in Europe.\n•\nOperating margin of 26.5% decreased 20 basis points primarily driven by unfavorable operating leverage of 90 basis points, higher employee-related expenses and product mix, partially offset by favorable price/cost of 130 basis points, benefits from the Company's enterprise initiatives and the favorable impact of a divestiture in the second quarter of 2023.\nOTHER FINANCIAL HIGHLIGHTS\n•\nInterest expense was $283 million in 2024, $266 million in 2023 and $203 million in 2022. Interest expense in 2024 was higher than 2023 primarily due to the issuance of the Euro notes in May of 2024, partially offset by the repayment of the $700 million notes due March 1, 2024. Interest expense in 2023 was higher than 2022 primarily due to higher interest rates, partially offset by the repayment of notes due May 22, 2023. Refer to Note 10. Debt in Item 8. Financial Statements and Supplementary Data for further information regarding the Company's debt.\n•\nOther income (expense) was income of $441 million in 2024, $49 million in 2023 and $255 million in 2022. On August 5, 2024, the Company entered into a purchase agreement with affiliates of CD&R for the sale of the Company’s noncontrolling equity interest in Wilsonart. The transaction closed immediately after the execution of the purchase agreement. Proceeds from the transaction, net of transaction costs, were $395 million, resulting in a pre-tax gain of $363 million. The sale of the Company’s equity interest in Wilsonart is not expected to have a material impact on the Company’s financial results in subsequent periods. Other income was higher in 2022 as compared to 2023 primarily due to net pre-tax gains of $191 million related to the sale of businesses in 2022. Refer to Note 3. Divestitures and Note 5. Other Income (Expense) for additional information regarding these transactions. \n•\nThe Company's effective tax rate for 2024, 2023, and 2022 was 21.1%, 22.6% and 21.0%, respectively. The 2024 effective tax rate benefited from discrete income tax benefits during the third quarter of 2024 of $107 million related to the utilization of capital loss carryforwards upon the sale of Wilsonart and $87 million related to a reorganization of the Company's intellectual property, partially offset by a $73 million discrete tax expense related to the remeasurement of unrecognized tax benefits associated with various intercompany transactions. The 2023 effective tax rate benefited from a discrete income tax benefit of $20 million in the second quarter of 2023 related to amended 2021 U.S. taxes. The 2022 effective tax rate benefited from discrete income tax benefits of $32 million in the fourth quarter of 2022 related to the utilization of capital loss carryforwards and $51 million in the second quarter of 2022 related to a decrease in unrecognized tax benefits resulting from the resolution of a U.S. tax audit. Additionally, the effective tax rates for 2024, 2023 and 2022 included discrete income tax benefits of $14 million, $20 million and $12 million, respectively, related to excess tax benefits from stock-based compensation. Refer to Note 6. Income Taxes in Item 8. Financial Statements and Supplementary Data for further information.\n34\n•\nThe impact of foreign currencies against the U.S. Dollar in 2024 versus 2023 decreased operating revenue and income before taxes by approximately $115 million and $40 million, respectively. The impact of foreign currencies against the U.S. Dollar in 2023 versus 2022 decreased operating revenue and income before taxes by approximately $7 million and $15 million, respectively.\nNEW ACCOUNTING PRONOUNCEMENTS\nInformation regarding new accounting pronouncements is included in Note 1. Description of Business and Summary of Significant Accounting Policies in Item 8. Financial Statements and Supplementary Data.\nLIQUIDITY AND CAPITAL RESOURCES\nThe Company's primary sources of liquidity are free cash flow and short-term credit facilities. As of December 31, 2024, the Company had $948 million of cash and equivalents on hand and no outstanding borrowings under its $3.0 billion revolving credit facility. The Company also has maintained strong access to public debt markets. Management believes that these sources are sufficient to service debt and to finance the Company's capital allocation priorities, which include:\n•\ninternal investments to support organic growth and sustain core businesses;\n•\npayment of an attractive dividend to shareholders; and\n•\nexternal investments in selective strategic acquisitions that support the Company's organic growth focus and an active share repurchase program. \nThe Company believes that, based on its operating revenue, operating margin, free cash flow, and credit ratings, it could readily obtain additional financing, if necessary.\nThe Company has certain contractual obligations, primarily the current portion of noncurrent income taxes payable, operating leases and long-term debt. Refer to Note 6. Income Taxes, Note 9. Leases and Note 10. Debt in Item 8. Financial Statements and Supplementary Data for details related to the Company's contractual obligations. The Company did not have any significant off-balance sheet commitments as of December 31, 2024.\nCash Flow\nThe Company uses free cash flow to measure cash flow generated by operations that is available for dividends, share repurchases, acquisitions and debt repayment. The Company believes this non-GAAP financial measure is useful to investors in evaluating the Company's financial performance and measures the Company's ability to generate cash internally to fund Company initiatives. Free cash flow represents net cash provided by operating activities less additions to plant and equipment. Free cash flow is a measurement that is not the same as net cash flow from operating activities per the statement of cash flows and may not be consistent with similarly titled measures used by other companies. Summarized cash flow information for the years ended December 31, 2024, 2023 and 2022 was as follows:\nIn millions\n2024\n2023\n2022\nNet cash provided by operating activities\n$\n3,281 \n$\n3,539 \n$\n2,348 \nAdditions to plant and equipment\n(437)\n(455)\n(412)\nFree cash flow\n$\n2,844 \n$\n3,084 \n$\n1,936 \nCash dividends paid\n$\n(1,695)\n$\n(1,615)\n$\n(1,542)\nRepurchases of common stock\n(1,500)\n(1,500)\n(1,750)\nAcquisition of businesses (excluding cash and equivalents)\n(115)\n— \n(2)\nProceeds from sale of operations and affiliates\n— \n7 \n278 \nProceeds from sale of noncontrolling interest in Wilsonart International Holdings LLC\n395 \n— \n— \nNet proceeds from (repayments of) debt\n(8)\n294 \n276 \nOther\n27 \n84 \n42 \nEffect of exchange rate changes on cash and equivalents\n(65)\n3 \n(57)\nNet increase (decrease) in cash and equivalents\n$\n(117)\n$\n357 \n$\n(819)\n35\nNet cash provided by operating activities improved in 2023 compared to 2022 as supply chains began to normalize in 2023 and the Company reduced its investment in working capital.\nStock Repurchase Programs\nOn August 3, 2018, the Company announced a stock repurchase program which provided for the repurchase of up to $3.0 billion of the Company's common stock over an open-ended period of time (the \"2018 Program\"). Under the 2018 Program, the Company repurchased approximately 6.7 million shares of its common stock at an average price of $158.11 per share during 2019, approximately 4.2 million shares of its common stock at an average price of $167.69 per share during 2020, approximately 4.4 million shares of its common stock at an average price of $227.29 per share during 2021 and approximately 1.2 million shares of its common stock at an average price of $216.62 per share during 2022. The 2018 Program was completed in the first quarter of 2022.\nOn May 7, 2021, the Company announced a stock repurchase program which provided for the repurchase of up to an additional $3.0 billion of the Company's common stock over an open-ended period of time (the \"2021 Program\"). Under the 2021 Program, the Company repurchased approximately 7.1 million shares of its common stock at an average price of $210.46 per share during 2022 and approximately 6.3 million shares of its common stock at an average price of $235.35 per share during 2023. The 2021 Program was completed in the fourth quarter of 2023.\nOn August 4, 2023, the Company announced a stock repurchase program which provides for the repurchase of up to an additional $5.0 billion of the Company's common stock over an open-ended period of time (the \"2023 Program\"). Under the 2023 Program, the Company repurchased approximately 38,000 shares of its common stock at an average price of $263.44 per share during the fourth quarter of 2023 and approximately 5.9 million shares of its common stock at an average price of $254.04 per share during 2024. As of December 31, 2024, there were approximately $3.5 billion of authorized repurchases remaining under the 2023 Program.\n36\nAfter-tax Return on Average Invested Capital\nThe Company uses after-tax return on average invested capital (\"After-tax ROIC\") to measure the effectiveness of its operations' use of invested capital to generate profits. After-tax ROIC is not defined under U.S. generally accepted accounting principles (\"GAAP\"). After-tax ROIC is a non-GAAP financial measure that the Company believes is a meaningful metric to investors in evaluating the Company's ability to generate returns from cash invested in its operations and may be different than the method used by other companies to calculate After-tax ROIC. The Company defines After-tax ROIC as operating income after taxes divided by average invested capital, which is annualized when presented in interim periods. Operating income after taxes is a non-GAAP measure consisting of net income before interest expense and other income (expense), on an after-tax basis, which are excluded as they do not represent returns generated by the Company's operations. For comparability, the Company also excluded the net discrete tax benefit of $121 million in the third quarter of 2024 from net income and the effective tax rate for the year ended December 31, 2024. Additionally, for comparability, the Company also excluded the discrete tax benefit of $20 million in the second quarter of 2023 from net income and the effective tax rate for the year ended December 31, 2023. Also, for comparability, the Company excluded the discrete tax benefits of $32 million in the fourth quarter of 2022 and $51 million in the second quarter of 2022 from net income and the effective tax rate for the year ended December 31, 2022. Total invested capital represents the net assets of the Company, other than cash and equivalents and outstanding debt which do not represent capital investment in the Company's operations. The most comparable GAAP measure to operating income after taxes is net income. Net income to average invested capital and After-tax ROIC for the years ended December 31, 2024, 2023, and 2022 were as follows:\nDollars in millions\n2024\n2023\n2022\nNumerator:\nNet income\n$\n3,488 \n$\n2,957 \n$\n3,034 \nNet discrete tax benefit related to the third quarter 2024\n(121)\n— \n— \nDiscrete tax benefit related to the second quarter 2023\n— \n(20)\n— \nDiscrete tax benefit related to the fourth quarter 2022\n— \n— \n(32)\nDiscrete tax benefit related to the second quarter 2022\n— \n— \n(51)\nInterest expense, net of tax\n (1)\n215 \n204 \n156 \nOther (income) expense, net of tax \n(1)\n(336)\n(38)\n(196)\nOperating income after taxes\n$\n3,246 \n$\n3,103 \n$\n2,911 \nDenominator:\nInvested capital:\nCash and equivalents\n$\n948 \n$\n1,065 \n$\n708 \nTrade receivables\n2,991 \n3,123 \n3,171 \nInventories\n1,605 \n1,707 \n2,054 \nNet assets held for sale\n— \n— \n7 \nNet plant and equipment\n2,036 \n1,976 \n1,848 \nGoodwill and intangible assets\n5,431 \n5,566 \n5,632 \nAccounts payable and accrued expenses\n(2,095)\n(2,244)\n(2,322)\nDebt\n(7,863)\n(8,164)\n(7,763)\nOther, net\n264 \n(16)\n(246)\nTotal net assets (stockholders' equity)\n3,317 \n3,013 \n3,089 \nCash and equivalents\n(948)\n(1,065)\n(708)\nDebt\n7,863 \n8,164 \n7,763 \nTotal invested capital\n$\n10,232 \n$\n10,112 \n$\n10,144 \nAverage invested capital \n(2)\n$\n10,419 \n$\n10,214 \n$\n10,017 \nNet income to average invested capital\n33.5 \n%\n29.0 \n%\n30.3 \n%\nAfter-tax return on average invested capital\n31.2 \n%\n30.4 \n%\n29.1 \n%\n(1)    \nEffective tax rate used for interest expense and other (income) expense for the years ended December 31, 2024, 2023, and 2022 was 23.8 %, 23.2% and 23.2%, respectively.\n37\n(2)    \nAverage invested capital is calculated using the total invested capital balances at the start of the period and at the end of each quarter within each of the periods presented.\nAfter-tax ROIC increased 80 basis points for the twelve month period ended December 31, 2024 compared to the prior year period as a result of a 4.6% increase in after-tax operating income versus a 2.0% increase in average invested capital. \nAfter-tax ROIC for the year ended December 31, 2024 included 90 basis points of favorable impact related to the cumulative effect of the change from the LIFO method of accounting to the FIFO method for certain U.S. businesses ($117 million pre-tax, or $88 million after-tax) in the first quarter of 2024. Refer to Note 1. Description of Business and Summary of Significant Accounting Policies in Item 8. Financial Statements for additional information regarding this change in accounting method.\nAfter-tax ROIC increased 130 basis points for the twelve month period ended December 31, 2023 compared to the prior year period as a result of a 6.6% increase in after-tax operating income versus a 2.0% increase in average invested capital. \nA reconciliation of the 2024 effective tax rate excluding the third quarter 2024 net discrete tax benefit of $121 million, which included favorable discrete tax benefits of $107 million related to the utilization of capital loss carryforwards upon the sale of Wilsonart and $87 million related to a reorganization of the Company's intellectual property, partially offset by a $73 million discrete tax expense related to the remeasurement of unrecognized tax benefits associated with various intercompany transactions, is as follows:\nTwelve Months Ended\nDecember 31, 2024\nDollars in millions\nIncome Taxes\nTax Rate\nAs reported\n$\n934 \n21.1 \n%\nNet discrete tax benefit related to the third quarter 2024\n121 \n2.7 \n%\nAs adjusted\n$\n1,055 \n23.8 \n%\nA reconciliation of the 2023 effective tax rate excluding the second quarter 2023 discrete tax benefit of $20 million related to amended 2021 U.S. taxes is as follows:\nTwelve Months Ended\nDecember 31, 2023\nDollars in millions\nIncome Taxes\nTax Rate\nAs reported\n$\n866 \n22.6 \n%\nDiscrete tax benefit related to the second quarter 2023\n20 \n0.6 \n%\nAs adjusted\n$\n886 \n23.2 \n%\nA reconciliation of the 2022 effective tax rate excluding the fourth quarter 2022 discrete tax benefit of $32 million related to the utilization of capital loss carryforwards and the second quarter 2022 discrete tax benefit of $51 million related to the resolution of a U.S. tax audit is as follows:\nTwelve Months Ended\nDecember 31, 2022\nDollars in millions\nIncome Taxes\nTax Rate\nAs reported\n$\n808 \n21.0 \n%\nDiscrete tax benefit related to the fourth quarter 2022\n32 \n0.8 \n%\nDiscrete tax benefit related to the second quarter 2022\n51 \n1.4 \n%\nAs adjusted\n$\n891 \n23.2 \n%\nRefer to Note 6. Income Taxes in Item 8. Financial Statements and Supplementary Data for further information regarding the discrete tax items noted above.\n38\nWorking Capital\nManagement uses working capital as a measurement of the short-term liquidity of the Company. Net working capital as of December 31, 2024 and 2023 is summarized as follows:\nIn millions\n2024\n2023\nIncrease\n(Decrease)\nCurrent Assets:\nCash and equivalents\n$\n948 \n$\n1,065 \n$\n(117)\nTrade receivables\n2,991 \n3,123 \n(132)\nInventories\n1,605 \n1,707 \n(102)\nPrepaid expenses and other current assets\n312 \n340 \n(28)\nTotal current assets\n5,856 \n6,235 \n(379)\nCurrent Liabilities:\nShort-term debt\n1,555 \n1,825 \n(270)\nAccounts payable and accrued expenses\n2,095 \n2,244 \n(149)\nOther\n658 \n606 \n52 \nTotal current liabilities\n4,308 \n4,675 \n(367)\nNet Working Capital\n$\n1,548 \n$\n1,560 \n$\n(12)\nAs of December 31, 2024, a significant portion of the Company's cash and equivalents was held by international subsidiaries. Cash and equivalents held internationally may be subject to foreign withholding taxes if repatriated to the U.S. Cash and equivalents held internationally are typically used for international operating needs or reinvested to fund expansion of existing international businesses. International funds may also be used to fund international acquisitions or, if not considered permanently invested, may be repatriated to the U.S. The Company has accrued for foreign withholding taxes related to foreign held cash and equivalents that are not permanently invested.\nIn the U.S., the Company utilizes cash flows from operations to fund domestic cash needs and the Company's capital allocation priorities. This includes operating needs of the U.S. businesses, dividend payments, share repurchases, acquisitions, servicing of domestic debt obligations, reinvesting to fund expansion of existing U.S. businesses and general corporate needs. The Company may also use its commercial paper program, which is supported by a long-term credit facility, for short-term liquidity needs. The Company believes cash generated by operations and liquidity provided by the Company's commercial paper program will continue to be sufficient to fund cash requirements in the U.S.\nDebt\nTotal debt as of December 31, 2024 and 2023 was as follows:\nIn millions\n2024\n2023\nIncrease\n(Decrease)\nShort-term debt\n$\n1,555 \n$\n1,825 \n$\n(270)\nLong-term debt\n6,308 \n6,339 \n(31)\nTotal debt\n$\n7,863 \n$\n8,164 \n$\n(301)\nAs of December 31, 2024, short-term debt included $777 million related to the Euro-denominated credit agreement entered into on May 5, 2023 (the \"Euro Credit Agreement\"), which was reclassified to Short-term debt in the second quarter of 2024 since the debt, including the options to extend the termination date, is due in April 2025. As of December 31, 2023, Short-term debt included $700 million related to the 3.50% notes due March 1, 2024 and $661 million related to the 0.25% Euro notes due December 5, 2024, both of which were repaid on their respective due dates. Additionally, Short-term debt included $778 million and $464 million of commercial paper as of December 31, 2024 and 2023, respectively.\nAs of December 31, 2023, the Company had €1.3 billion outstanding under the Euro Credit Agreement with an interest rate of 4.59%, which was included in Long-term debt as the Company intended to exercise its options to extend the termination date. The first and second options to extend the termination date were both exercised in 2024. On May 22, 2024, the Company repaid €550 million of the term loans under the Euro Credit Agreement using a portion of the proceeds from the \n39\nEuro notes issued on May 17, 2024, as discussed below. As of December 31, 2024, the Company had €750 million outstanding under the Euro Credit Agreement with an interest rate of 3.61%, which was reclassified to Short-term debt in the second quarter of 2024 since the debt, including the options to extend the termination date, is due in April 2025.\nIn May 2024, the Company issued €650 million of 3.25% Euro notes due May 17, 2028 at 99.525% of face value and €850 million of 3.375% Euro notes due May 17, 2032 at 99.072% of face value. Proceeds from the issuance were used for general corporate purposes, including the repayment of a portion of the indebtedness under the commercial paper program and the Euro Credit Agreement.\nThe Company may issue commercial paper to fund general corporate needs, share repurchases, and small and medium-sized acquisitions. During the fourth quarter of 2022, the Company entered into a $3.0 billion, five-year revolving credit facility with a termination date of October 21, 2027, which is available to provide additional liquidity, including to support the potential issuances of commercial paper. No amounts were outstanding under the revolving credit facility as of December 31, 2024 or 2023. The maximum outstanding commercial paper balance during 2024 was $1.9 billion, while the average daily balance was $906 million.\nAs of December 31, 2024, the Company had unused capacity of approximately $170 million under international debt facilities. In the ordinary course of business, the Company also had approximately $250 million outstanding in guarantees, letters of credit and other similar arrangements with financial institutions as of December 31, 2024. Refer to Note 10. Debt in Item 8. Financial Statements and Supplementary Data for additional details regarding the Company's outstanding debt obligations.\nTotal Debt to EBITDA\nThe Company uses the ratio of total debt to EBITDA as a measure of its ability to repay its outstanding debt obligations. EBITDA and the ratio of total debt to EBITDA are non-GAAP financial measures. The Company believes that total debt to EBITDA is a meaningful metric to investors in evaluating the Company's long term financial liquidity and may be different than the method used by other companies to calculate total debt to EBITDA. The ratio of total debt to EBITDA represents total debt divided by net income before interest expense, other income (expense), income taxes, depreciation, and amortization and impairment of intangible assets on a trailing twelve month basis. Total debt to EBITDA for the years ended December 31, 2024, 2023 and 2022 was as follows:\nDollars in millions\n2024\n2023\n2022\nTotal debt\n$\n7,863 \n$\n8,164 \n$\n7,763 \nNet income\n$\n3,488 \n$\n2,957 \n$\n3,034 \nAdd:\nInterest expense\n283 \n266 \n203 \nOther (income) expense\n(441)\n(49)\n(255)\nIncome taxes\n934 \n866 \n808 \nDepreciation\n301 \n282 \n276 \nAmortization and impairment of intangible assets\n101 \n113 \n134 \nEBITDA\n$\n4,666 \n$\n4,435 \n$\n4,200 \nTotal debt to EBITDA ratio\n1.7\n1.8\n1.8\n40\nStockholders' Equity\nThe changes to stockholders' equity during 2024 and 2023 were as follows:\nIn millions\n2024\n2023\nBeginning balance\n$\n3,013 \n$\n3,089 \nNet income\n3,488 \n2,957 \nCash dividends declared\n(1,717)\n(1,634)\nRepurchases of common stock\n(1,500)\n(1,500)\nOther comprehensive income (loss)\n(43)\n7 \nOther\n76 \n94 \nEnding balance\n$\n3,317 \n$\n3,013 \nCRITICAL ACCOUNTING ESTIMATES\nThe Company has three accounting estimates that it believes are most important to the Company's financial condition and results of operations, and which require the Company to make judgments about matters that are inherently uncertain. Management bases its estimates on historical experience, and in some cases on observable market information. Various assumptions are also used that are believed to be reasonable under the circumstances and form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates.\nThe Company's critical accounting estimates are as follows:\nIncome Taxes\n— \nThe Company provides deferred income tax assets and liabilities based on the estimated future tax effects of differences between the financial and tax bases of assets and liabilities based on currently enacted tax laws. The Company's deferred and other tax balances are based on management's interpretation of the tax regulations and rulings in numerous taxing jurisdictions. Income tax expense, assets and liabilities recognized by the Company also reflect its best estimates and assumptions regarding, among other things, the level of future taxable income, the effect of the Company's various tax planning strategies and uncertain tax positions. Future tax authority rulings and changes in tax laws, changes in projected levels of taxable income and future tax planning strategies could affect the actual effective tax rate and tax balances recorded by the Company.\nGoodwill and Intangible Assets\n— \nThe Company's business acquisitions typically result in recording goodwill and other intangible assets, which are a significant portion of the Company's total assets and affect the amount of amortization expense and impairment charges that the Company could incur in future periods. The Company follows the guidance prescribed in the accounting standards to test goodwill and intangible assets for impairment. On an annual basis, or more frequently if triggering events occur, the Company compares the estimated fair value of its reporting units to the carrying value of each reporting unit to determine if a potential goodwill impairment exists. If the fair value of a reporting unit is less than its carrying value, a goodwill impairment loss is recorded for the difference. In calculating the fair value of the reporting units or specific intangible assets, management relies on a number of factors, including business plans, economic projections, anticipated future cash flows, comparable transactions and other market data. There are inherent uncertainties related to these factors and management's judgment in applying them in the impairment tests of goodwill and other intangible assets.\nAs of December 31, 2024, the Company had total goodwill and intangible assets of approximately $5.4 billion allocated to its reporting units. Although there can be no assurance that the Company will not incur additional impairment charges related to its goodwill and other intangible assets, the Company generally believes the risk of significant impairment charges is lessened by the number of diversified businesses and end markets represented by its reporting units that have goodwill and other intangible assets. In addition, the individual businesses in many of the reporting units have been acquired over a long period of time, and in many cases have been able to improve their performance, primarily as a result of the application of the Company's 80/20 Front-to-Back process. The amount of goodwill and other intangible assets allocated to individual reporting units ranges from approximately \n$232 million to $1.4 billion\n, with the average amount equal to\n $542 million\n. In all cases, the fair value of the individual reporting unit significantly exceeds its carrying value. Fair value determinations require considerable judgment and are sensitive to changes in the factors described above. Due to the inherent uncertainties associated with these factors and economic conditions in the Company's global end markets, impairment charges related to one or more reporting units could occur in future periods.\n41\nPension and Other Postretirement Benefits\n— \nThe Company has various company-sponsored defined benefit retirement plans covering a number of U.S. employees and many employees outside the U.S. Pension and other postretirement benefit expense and obligations are determined based on actuarial valuations. Pension benefit obligations are generally based on each participant's years of service, future compensation, and age at retirement or termination. Important assumptions in determining pension and postretirement expense and obligations are the discount rate, the expected long-term return on plan assets, life expectancy, and health care cost trend rates. Future changes in any of these assumptions could materially affect the amounts recorded related to the Company's pension and other postretirement benefit plans. See Note 11. Pension and Other Postretirement Benefits in Item 8. Financial Statements and Supplementary Data for additional discussion of actuarial assumptions used in determining pension and postretirement health care liabilities and expenses.\nThe Company determines the discount rate used to measure plan liabilities as of the year-end measurement date for the U.S. primary pension plan. The discount rate reflects the current rate at which the associated liabilities could theoretically be effectively settled at the end of the year. In estimating this rate, the Company looks at rates of return on high-quality fixed income investments, with similar duration to the liabilities in the plan. A 25 basis point decrease in the discount rate would increase the present value of the U.S. primary pension plan obligation by approximately \n$24 million\n. The Company estimates the service and interest cost components of net periodic benefit cost by applying specific spot rates along the yield curve to the projected cash flows rather than a single weighted-average rate. See Note 11. Pension and Other Postretirement Benefits in Item 8. Financial Statements and Supplementary Data for information on the Company's pension and other postretirement benefit plans and related assumptions.\nThe expected long-term return on plan assets is based on historical and expected long-term returns for similar investment allocations among asset classes. For the U.S. primary pension plan, a 25 basis point decrease in the expected return on plan assets would increase the annual pension expense by approximately\n $3 million\n.\n42",
  "item2": null
}