{
  "source_file": "jec-20250926.htm",
  "form_type": "10-K",
  "item1": "Item 1.     BUSINESS\nGuided by our values and our brand promise — Challenging today. Reinventing tomorrow – Jacobs delivers innovative solutions to address the world’s most complex challenges and create lasting value for clients, communities and society. \nWith a global team of approximately 43,000, we provide end-to-end capabilities across advanced manufacturing, cities & places, energy, environmental, life sciences, transportation and water. Our services span advisory and consulting, feasibility and planning, through to design, program delivery and lifecycle management — helping to create a more connected and sustainable world. \nFrom addressing water scarcity and aging infrastructure to access to life-saving therapies and cyber resilience, we combine creativity, agility and deep domain expertise to deliver outcomes that matter. Our integrated approach enables clients to meet urgent needs today while preparing for the opportunities of tomorrow.\nOver the past eight years, Jacobs has transformed into a science-based consulting and advisory leader, focused on delivering digitally enabled, resilient solutions to complex sustainability, critical infrastructure and advanced manufacturing challenges. Strategic acquisitions, including a 65% stake in PA Consulting Group Limited (\"PA Consulting\") in fiscal 2021, along with BlackLynx and StreetLight — have strengthened our capabilities in high-value technology-enabled solutions.\nChallenge accepted\nIn February 2025, we launched \nChallenge Accepted\n, our multi-year growth strategy designed to sharpen our focus and accelerate our performance. Aligned with our long-term financial framework, this strategy positions us to drive profitable growth and deliver scalable, full lifecycle solutions across water and environmental, life sciences and advanced manufacturing, and critical infrastructure.\nPage 4\nAs global challenges like urbanization, infrastructure modernization, digital evolution and environmental resilience intensify, our integrated delivery model unites the full breadth of our capabilities — from strategy through execution – across our end markets. This synergy enables us to deliver rapid, large-scale outcomes that anticipate evolving client needs and advance a more resilient, sustainable future where technology elevates human ingenuity and unlocks new possibilities for collaboration and problem-solving. \nWe harness our advanced data and digital capabilities, products and tools to\n \nhelp clients operate more efficiently, safely and intelligently. Through the expertise of our people and ongoing investment in artificial intelligence (AI) and next-generation digital solutions, we empower our clients' decision-making across the entire asset lifecycle – from capital planning and operations to cybersecurity and operational technology. Our capabilities in data analytics, digital architecture, advisory and transformation, software development and cybersecurity enable clients to unlock the full value of their data and digital infrastructure to improve performance, resilience and sustainability.\nThrough our strategic partnership with PA Consulting, we are expanding our high-end advisory services and deploying our collective strengths to help clients adapt, innovate and transform. Together, we deliver integrated support across the full project lifecycle — from early-stage strategy to implementation — enabling clients to tackle complex challenges, accelerate sustainable growth and shape a smarter, more resilient future.\nA streamlined, focused business\nPrior to the Separation Transaction, the Company's four operating segments were comprised of its two global lines of business (\"LOBs\"): Critical Mission Solutions (\"CMS\") and People Places and Solutions (\"P&PS\"), its business unit Divergent Solutions (\"DVS\") and its majority investment in PA Consulting. After the Separation in fiscal year 2024, we reorganized P&PS and our remaining DVS businesses into a more streamlined operating model, Infrastructure & Advanced Facilities (\"I&AF\"), which enables our collective business teams to collaborate more horizontally. Our CMS LOB and portions of DVS which were included in the Separation are now reported as discontinued operations.\nOur Values in Action\nJacobs' Ethics and Code of Conduct, rooted in our values, set clear standards and support to guide decision-making and ensure we conduct our business with integrity.\nAt Jacobs, sustainability means delivering thoughtful solutions that meet today’s needs while enabling economies, \ncommunities and the environment to thrive in the future. Our PlanBeyond® sustainable business approach aligns with our purpose to create a more connected, sustainable world. This approach has strengthened client relationships, aiming to create new opportunities and embed resilience into our global strategy. Building on this foundation, \nPlanBeyond 2025+\n focuses on transparency, measurable outcomes and trusted delivery, guiding our path forward with our stakeholders, including our clients, partners and people.\nDriving positive impact\nOperating in more than 40 countries, we view sustainability and resilience as key differentiators and drivers of impact. Demand for solutions that address complex, interconnected challenges continues to grow across infrastructure, energy, advanced manufacturing and health. By embedding sustainability into our solutions, we help clients’ businesses and assets remain resilient. In fiscal 2025, we launched our \nEvolve\n tool, which generates recommendations to integrate sustainability into our projects to enhance their positive impact and resilience. Complimentary tools like \nClimate Risk Manager\n, \nKaleidoscope and Intelligent O&M\n assess climate risks, carbon impacts and system vulnerabilities to inform critical project decisions.\nWe deliver cross-cutting solutions across seven interconnected capabilities: decarbonization & greenhouse gas management; adaptation & resilience; sustainable built environments; sustainable business; social value; nature positive; and energy transition. Together, these enable systems-level impact for clients and communities worldwide.\nPage 5\nTransparency and accountability\nWe are committed to leading by example in our own operations — advancing a suite of strategic actions to reduce our carbon footprint. Our current commitment, including sourcing 100% renewable electricity and our net-zero target validated by the Science Based Targets initiative, underscore our progress across our operations and supply chain.\nWe have invested in technology to enhance virtual collaboration and help mitigate business travel and employee commuting carbon emissions. We also invested in tools and technology to help our people consider when business travel is essential and make more sustainable choices when it is necessary. \nAs businesses worldwide experience increasing stakeholder expectations and sustainability regulatory requirements, corporate transparency and accountability remains central. We report on our sustainability performance and corporate responsibility initiatives in accordance with globally recognized frameworks when required by applicable regulations, or, in the absence of mandated standards, we follow widely accepted market practices.\nPositively impacting tomorrow’s communities\nWe work globally with our clients, partners and supply chains to deliver solutions that seek to improve how people live, move and thrive, aiming to foster health and well-being for all occupants, promoting a sustainable and thriving future.  \nWe invest in local communities globally, collaborating with charities and not-for-profit organizations to make a positive impact and live our values. Through Collectively℠, our global giving and volunteering program, we empower employees to support causes aligned to our values, through paid volunteer time, donation matching and grant nomination. In fiscal 2025, our employees mobilized support for communities, including those impacted by natural disasters, water insecurity and conflict. For example, in 2025 a team of 10 Jacobs volunteers partnered with non-profit Bridges to Prosperity to build a suspended bridge across Rwanda’s Gatongati River — our 17th bridge build — providing safe, year-round access to education, healthcare, markets and other essential services for more than 8,300 people.\nWe also invest in the next generation through our science, technology, engineering, arts and mathematics (STEAM) education and engagement programs promoting sustainability learning among young people and providing information to inspire future careers in STEAM.\nIn 2025, Jacobs sponsored the International Science and Engineering Fair — a premier global competition engaging students from more than 300 affiliated science fairs worldwide and advancing the future talent pipeline.\nIn fiscal 2025, we donated over $2.9 million to 2,300+ charities across 34 countries. Our employees tracked more than 7,000 volunteer hours including nearly 4,000 STEAM volunteer hours.\nSocial value advisory in our client solutions\nWe also deliver social value strategies and services that help clients realize social value opportunities through their projects and services by embedding and measuring social, economic and environmental benefit generation into project delivery. \nOur fully owned subsidiary, Simetrica-Jacobs, specializes in social value, wellbeing research and impact evaluation — measuring and quantifying social value and impacts to help directly inform investment decisions and delivery models. Simetrica-Jacobs deploys internationally endorsed methods set out by the Organisation for Economic Co-operation and Development and government-produced guidelines, including the U.K. Government’s HM Treasury Green Book. \nBy combining this expertise with our infrastructure delivery, we help clients understand how they can transform local decision-making, shape inclusive investments and create lasting social change.\nWe maintain agile and disciplined capital deployment\nM&A and Divestitures\nConsistent with our profitable growth strategy, Jacobs pursues acquisitions, divestitures, strategic investments and other transactions to maximize long-term value by continuing to reshape our portfolio to higher value solutions and accelerating profitable growth strategy. The Company has recently made the following acquisitions, strategic investments and divestitures:\nPage 6\n•\nOn September 27, 2024, Jacobs completed the Separation Transaction, pursuant to which it spun off its CMS and C&I businesses and then subsequently merged those businesses with Amentum Parent Holdings LLC. Amentum, the surviving entity of the Separation Transaction, is now an independent public company with common stock listed on the New York Stock Exchange under the symbol “AMTM”. For further information regarding separation activities that took place in fiscal 2025, see Note 14- \nDiscontinued Operations\n of the Notes to Consolidated Financial Statements beginning on page F-1 of this Annual Report on Form 10-K.\n•\nOn March 2, 2021, Jacobs completed the strategic investment of a 65% interest in PA Consulting, a U.K.-based leading innovation and transformation consulting firm.\nShare Repurchases\nDuring fiscal 2025, the Company repurcha\ns\ned $754.1 million in shar\nes.\nShareholder Dividends\nDuring fiscal 2025, the Com\npany paid dividends of $0.29 per share in the first quarter and $0.32 per share in the second, third and fourth quarters.\nPage 7\nOperating Segments\nThe services we provided to our end markets in fiscal 2025 fall into the following two operating segments: 1) Infrastructure & Advanced Facilities and 2) our majority investment in PA Consulting. \nFor additional information regarding our segments, including information about our financial results by segment and financial results by geography, see Note 19- \nSegment Information\n of Notes to Consolidated Financial Statements beginning on page F-1 of this Annual Report on Form 10-K. \nInfrastructure & Advanced Facilities (I&AF) \nIn fiscal 2025, Jacobs' Infrastructure & Advanced Facilities business provided end-to-end solutions for our clients’ most complex challenges related to energy security, environmental resilience, safe and reliable transportation, buildings and infrastructure, integrated water management and biopharmaceutical manufacturing. In doing so, we combine deep experience in the following end markets - Critical Infrastructure, Water & Environmental and Life Sciences & Advanced Manufacturing.\nOur core skills revolve around consulting, planning, architecture, design, engineering, infrastructure delivery services\n \nincluding project, program and construction management and long-term operation of facilities. Solutions are delivered as standalone professional service engagements, comprehensive program management partnerships, and selective progressive design-build and construction management at-risk delivery services. Increasingly, we use data science and technology-enabled expertise to deliver positive and enduring outcomes for our clients and communities.\nWe serve national, state and local government clients across multiple regions — including the U.S., Europe, U.K., Middle East, and Asia\n \nPacific — and multinational and local private sector organizations globally.\nPage 8\nPA Consulting (PA)\nPA Consulting, the global innovation and transformation consultancy, accelerates new growth ideas from concept, through design and development and to commercial success, and revitalizes organizations, building leadership, culture, systems and processes to make innovation a reality. PA Consulting's global team of about 4,000, which includes strategists, innovators, designers, consultants, digital experts, scientists, engineers and technologists work across seven sectors: consumer and manufacturing, defense and security, energy and utilities, financial services, government, health and life sciences, and transport to make a positive impact alongside the clients it supports, bringing ingenuity to life. \nPA Consulting has a diverse mix of private and public sector clients. Private sector clients include global household names like Diageo, Microsoft, Pret A Manger and Unilever, and start-ups like NTx, which is accelerating access to life-changing therapies. PA's work includes applying data and analytics to improve punctuality of flights at Heathrow Airport, accelerating the energy transition with Invenergy and energyRe, creating new digital platforms for the American College of Emergency Physicians, pioneering medtech with Hubly Surgical, accelerating clinical trials with AI for a global life sciences consortium, and enhancing resiliency in banking with Bankomat. Public sector clients include the U.K.'s Ministry of Defence, National Highways, The Norwegian Labour and Welfare Administration, The Danish Tax Agency and The Swedish Environmental Protection Agency.\nCollectively, we also deploy the combined strengths of Jacobs' technical expertise in infrastructure, advanced manufacturing and technology with PA Consulting's innovation and transformation expertise to unlock significant opportunities for our clients worldwide. In the U.S., we’re supporting the digital transformation of Dallas Fort Worth International Airport and contributing to the Frederick Douglass Tunnel program — one of the nation’s largest transportation infrastructure investments. In England, we provide engineering, technical advice and innovation services to National Highways. We’re building an AI blueprint for Hertfordshire County Council, one of England’s largest councils. We’ve been appointed to the U.K.’s largest government management consultancy framework providing public sector organizations with streamlined access to advisory services. We’re also delivering technical project management for the U.K. Department for Energy Security & Net Zero’s Carbon Capture, Usage and Storage program, a cornerstone of the U.K.’s net-zero ambitions.\nSeparation of Critical Mission Solutions (CMS) and Cyber & Intelligence (C&I)\nOn September 27, 2024, Jacobs Solutions Inc. (\"Jacobs\") completed the previously announced Reverse Morris Trust transaction pursuant to which (i) Jacobs first transferred its Critical Mission Solutions business (“CMS”) and portions of the Divergent Solutions (“DVS”) business (referred to herein as the Cyber & Intelligence business (“C&I”) and together with CMS referred to as the “SpinCo Business”), to Amazon Holdco Inc., a Delaware corporation, which has been renamed Amentum Holdings, Inc. (“SpinCo”) (the “Separation”), (ii) Jacobs then effectuated a spin-off of SpinCo by distributing 124,084,108 shares of SpinCo common stock, par value $0.01 per share (the “SpinCo Common Stock”), by way of a pro rata distribution to its shareholders such that each holder of shares of Jacobs common stock, par value $1.00 per share, (the “Jacobs Common Stock”) was entitled to receive one share of SpinCo Common Stock for each share of Jacobs common stock held as of the record date, September 23, 2024 (the “Distribution”), and (iii) finally, Amentum Parent Holdings LLC merged with and into SpinCo, with SpinCo surviving the merger (the “Merger” and together with the Separation and the Distribution, the “Separation Transaction”). The surviving entity of the Separation Transaction is now an independent public company with common stock listed on the New York Stock Exchange under the symbol “AMTM” (“Amentum”).\nAs a result of the Separation Transaction, substantially all SpinCo Business-related assets and liabilities have been separated and distributed (the \"Disposal Group\"). The Company determined that the Disposal Group should be reported as discontinued operations in accordance with ASC 205-20, Discontinued Operations because their disposal represents a strategic shift that had a major effect on operations and financial results. As such, the financial results of the SpinCo Business are reflected in our Consolidated Statements of Earnings as discontinued operations for all periods presented. Additionally, current and non-current assets and liabilities of the Disposal Group were reflected as held for spin in the Consolidated Balance Sheet as of September 29, 2023. Further, as the Separation Transaction closed on September 27, 2024, no amounts remained held for spin at the end of fiscal 2024.\nFor further information regarding separation activities that took place in fiscal 2025, see Note 14- \nDiscontinued Operations\n of the Notes to Consolidated Financial Statements beginning on page F-1 of this Annual Report on Form 10-K.\nPage 9\nPrior to the Separation Transaction, Jacobs’ Critical Mission Solutions business provided a full spectrum of solutions for clients to address evolving challenges like digital transformation and modernization, national security and defense, space exploration, digital asset management, the clean energy transition, and nuclear decommissioning and cleanup. Clients included government agencies, as well as private sector clients mainly in the aerospace, automotive,\n \nmotorsports, energy and telecom sectors. Prior to the Separation Transaction, the DVS business unit served as the core foundation for developing and delivering innovative, next-generation cloud, cyber, data and digital technologies. DVS clients included government agencies and commercial clients in the U.S. and international markets. Certain portions of the DVS business related to advising on digital strategy and transformation and developing digital solutions that facilitate capital, operational and cybersecurity decisions for our clients across our segments and their end markets were retained and are now part of I&AF.\nSignificant Customers\nThe following table sets forth the percentage of total revenues from continuing operations earned directly or indirectly from agencies of the U.S. federal government for each of the last three fiscal years:\n2025\n2024\n \n2023\n8%\n10%\n \n9%\nGiven the percentage of total revenue derived directly from the U.S. federal government, the loss of U.S. federal government agencies as customers could have a material adverse effect on the Company. In addition, any or all of our government contracts could be terminated, we could be suspended or debarred from all government contract work, or payment of our costs could be disallowed. For more information on risks relating to our government contracts, see Item 1A- \nRisk Factors.\nContracts\nWhile there is considerable variation in the pricing provisions of the contracts we undertake, our contracts generally fall into two broad categories: cost-reimbursable and fixed-price. The following table sets forth the percentages of total revenues from continuing operations represented by these types of contracts for each of the last three fiscal years:\n2025\n2024\n \n2023\nCost-reimbursable\n68%\n69%\n70%\nFixed-price, limited risk\n32%\n31%\n26%\nFixed-price, at risk\n—%\n—%\n4%\nIn accordance with industry practice, most of our contracts (including those with the U.S. federal government) are subject to termination at the discretion of the client, which is discussed in greater detail in Item 1A\n- Risk Factors\n. In such situations, our contracts typically provide for reimbursement of costs incurred and payment of fees earned through the date of termination.\nCost-Reimbursable Contracts\nCost-reimbursable contracts generally provide for reimbursement of costs incurred plus an amount of profit. The profit element may be in the form of a simple mark-up applied to the labor costs incurred or it may be in the form of a fee, or a combination of a mark-up and a fee. The fee element can also take several forms, including 1) a fixed amount, 2) an amount based on a percentage of the costs incurred or 3) an incentive fee based on targets, milestones, or performance factors defined in the contract. These contracts include a limited amount of guaranteed maximum price contracts.\nFixed-Price Contracts\nFixed-price contracts include both “lump sum bid” contracts and “negotiated fixed-price” contracts. Under lump sum bid contracts, we typically bid against competitors based on client-furnished specifications. This type of pricing presents certain inherent risks, including the possibility of ambiguities in the specifications received, problems with new technologies, and economic and other changes that may occur over the contract period. Additionally, it is not unusual for lump sum bid contracts to lead to an adversarial relationship with clients, which is contrary to our relationship-based business model. Accordingly, lump sum bid contracts are not our preferred form of contract. In contrast, under a negotiated fixed-price contract, we are selected as the contractor first and then we negotiate a price with our client and \nPage 10\nfrequently exists in single-responsibility arrangements where we perform some portion of the work before negotiating the total price of the project. Thus, although both types of contracts involve a firm price for the client, the lump sum bid contract provides the greater degree of risk to us in our services contracts as well as construction. However, because of economies that may be realized during the contract term, both negotiated fixed-price and lump sum bid contracts may offer greater profit potential than other types of contracts. The Company carefully manages the risk inherent in these types of contracts. In recent years, most of our fixed-price work has been either negotiated fixed-price contracts or lump sum bid contracts for design and/or project services, rather than turnkey construction contracts which are included in the at risk type in the table above.\nCompetition\nWe compete with many companies across the world including technology, consulting and engineering firms. Typically, no single company or companies dominate the markets in which we provide services, and often we partner with our competitors or other companies to jointly pursue projects. AECOM, Tetra Tech, WSP, Arcadis, Bechtel, Arup, Endava, Exponent, Mott MacDonald, Stantec, Parsons, Accenture, Mace, AtkinsRealis, Altair, Montrose, Capgemini, Fluor, Deloitte, KPMG, PwC, Bain & Company and McKinsey & Company are some of our competitors. We compete based on the following factors, among others: technical capabilities, reputation for quality, price of services, safety record, availability of qualified personnel, and ability to timely perform work and contract terms. \nOur People and Our Culture\nOur people and culture define Jacobs. Authentic leadership and a commitment to living our core values every day creates a culture of trust, respect and empowerment across our business — enabling us to deliver the best outcomes for all our stakeholders. Guided by our employee value statement, \"Jacobs. A world where you can.\", our strategy further connects our people to our purpose and helps us continuously evolve our culture to support, empower and enable our talent to thrive.\nAttracting and Growing our Talent\nJacobs’ success is dependent on our ability to hire, develop and retain exceptional talent across technical, professional, scientific and consulting disciplines.\nAs of September 26, 2025, we had a workforce of approximately 43,000 people worldwide, including a contingent workforce of approximately 1,800 people. Our voluntary employee turnover rate of 8.2% reflects a strong culture and the commitment of our people. The breakdown of our employees by region (excluding contingent workforce) is as follows:\nPage 11\nBy fostering learning and unlocking career growth for our people, we attract and retain top talent to deliver for our clients and drive long-term growth for Jacobs. Our employee programs, global learning resources and digital tools enable collaboration and professional development in a supportive, high-performing workplace. \nOur employee experience platform – e3: engage. excel. elevate. – enables our employees to develop through continuous feedback, priority alignment, experience profiling and career planning. \nIn fiscal 2025, we introduced several enterprise-wide initiatives to enhance talent mobility, foster leadership and support long-term, purpose-driven careers. These included responding to feedback from our employees regarding expanded learning opportunities, particularly in AI and digital skills, through the launch of Jacobs University—our global learning and development hub designed to make training more accessible and relevant across roles and regions. With four dedicated schools (and more planned) and access to nearly 30,000 training programs, the platform equips employees with future-ready skills and career development resources.\nTo expand career mobility, we also introduced the Internal Talent Marketplace, a digital platform connecting employees with opportunities, assignments and career pathways aligned to their goals and experience.\nAs we advance our digital and data solutions to help clients work more effectively and safer, we are also equipping our people with stronger digital skills and AI capabilities. In fiscal 2025, we launched Jacobs AI Assist, our proprietary AI tool that makes our authoritative knowledge more discoverable and usable for our employees in their daily work.\nIn fiscal 2025, more than 97% of employees completed all required modules in our annual “Living Our Values” training, which reinforces our core values.\n1\nOur global graduate development program and local apprenticeships continue to provide our early career professionals with foundational skills, networks and knowledge. In fiscal 2025, we welcomed more than 1,300 graduates, interns and apprentices to our global team. \nWe support agile, lifelong careers through continuous development, mentoring and diverse career paths. Employees can request mentors through our e3 mentor match program and our eight Jacobs Employee Networks (JENs), which are open to all of our employees around the world, also offer mentoring with leaders who support and reflect myriad perspectives, backgrounds and experiences.\nOur global Hybrid Work model strengthens team collaboration and client connection, while offering flexibility — reflecting our commitment to providing an adaptable, inclusive and empowering workplace. \nFostering Inclusion and Belonging\nWe continue to nurture our TogetherBeyond\n℠ \nculture, our approach to living inclusion every day and fostering belonging globally. We believe inclusive teams deliver stronger outcomes for clients, communities and one another. By embracing varied perspectives and lived experiences, we create conditions for greater creativity, faster decision-making, and deeper connection.\nIn fiscal 2025, we continued to invest in leadership training, our JENs, 240+ communities of practice, and global programs that promote accessibility and cultural awareness across project delivery, recruitment and community engagement. Open to all employees around the world, our JENs and communities of practice provide networking and development opportunities, and play a vital role in sustaining an inclusive culture.\nTraining and resources support our \"We live inclusion\" value and include topics such as inclusion and belonging and respect in the workplace, and our employee networks and communities of practice foster meaningful conversations and actions in support of workplace inclusion. Our people actively contribute to attracting new talent, shaping our recruitment strategies, and enhancing our STEAM programs and accessibility practices.\n1\n Completion rate reflects the four modules required for all employees. A fifth module, required only for people leaders, is excluded from this metric.\nPage 12\nOur employee networks:\nOur commitment to living inclusion begins at the top with leadership commitment and accountability driving culture at Jacobs.\nThrough our “Be Seen @ Jacobs” data disclosure campaign, we invite our employees globally to confidentially and voluntarily share their demographic information, where permitted, increasing transparency and helping us better shape the programs and benefits we offer our employees. \nPage 13\nAs of September 26, 2025, our U.S. employees reflected the following race and ethnicity demographics (self-reported data):\nAs of September 26, 2025, our global workforce gender demographics\n1\n (based on self-reported data) were:\n \nHealth, safety, security & environment\nSince its inception in 2007, our BeyondZero® program has helped protect our people and the environment through proactive programs shaping how we operate and how we care for one another. BeyondZero®, which began as a commitment to health and safety has evolved into a broader philosophy encompassing psychological wellbeing, security, environmental responsibility and business resilience — and has become a cornerstone of our Culture of Caring℠, our values and our identity.\nAmid growing global complexities that test our ability to operate safely, securely and sustainably, we remain committed to proactive risk management and to delivering high-value solutions for our people, clients and communities.\nIn fiscal 2025, we achieved another year of zero employee fatalities at work and a total recordable incident rate\n2\n of 0.11, compared to the North American Industry Classification System’s most recently reported\n3\n aggregate rate of 0.60. This reflects our continued focus on protecting our people and maintaining resilient project environments. External recognition included five Environmental Business Journal / Climate Change Business Journal® awards for advancing environmental and climate resilience, and the Royal Society for the Prevention of Accidents (RoSPA) Patron's Award for sustained health and safety excellence. \nPage 14\nWe also advanced our resilience program — enhancing emergency, crisis and continuity capabilities to support stability and performance during times of disruption. Our enhanced Global Travel Assistance program in partnership with our provider, International SOS, helps keep our employees safe and healthy while traveling or on assignment outside their home country.\nOur wellbeing programs address the full spectrum of employee health — from physical to emotional and social to financial. These include Origin which provides financial counseling, and Carrot, which offers free, inclusive fertility healthcare and family-forming benefits, and support for menopause, low testosterone and more. \nRethinkCare provides free parental support and neurodiversity training. In fiscal 2025, we expanded holistic wellbeing support, including our Dedicated Workplace Support service, which compliments existing support like our Emotional Wellbeing Solutions digital portal.\nOur global community of nearly 1,800 Positive Mental Health Champions — with 30% now serving as people leaders — continues to grow, providing peer-level support, guiding colleagues toward professional options, while helping to reduce stigma and foster inclusion. Our Jacobs-developed, free mental health check-in tool, One Million Lives, reached a significant milestone this year, with over 50,000 check-ins completed since launch.\nOur BeyondZero journey is not a destination, but a mindset — driving us to protect our people, expand our impact, and partner globally to shape a safer, more sustainable future. We remain disciplined in strengthening our collective HSSE capability, positioning Jacobs to anticipate dynamic market demands and deliver responsible growth and lasting impact.\n1Jacobs reports this data utilizing the male/female binary to enable consistent reporting over time. \n2 As of October 30, 2024 and recorded in accordance with OSHA record keeping requirements, but subject to change thereafter due to possible injury/illness classification changes. The TRIR calculation uses the US OSHA formula of ‘Number of Incidents x 200,000 / total number of hours worked in a year’. The 200,000 is the benchmark established by OSHA because it represents the total number of hours 100 employees would log in 50 weeks based on a 40-hour work week.\n3 Cited on September 26th, 2025 via U.S. Bureau of Labor Statistics - Incidence rates of non-fatal occupational injuries and illnesses by industry and case types, 2023 for NAICS code 54133\nInformation About Our Executive Officers\nThe information required by Paragraph (a), and Paragraphs (c) through (g) of Item 401 of Regulation S-K (except for information required by Paragraph (e) of that Item to the extent the required information pertains to our executive officers) and Item 405 of Regulation S-K is set forth under the caption “Members of the Board of Directors” in our definitive proxy statement to be filed with the SEC pursuant to Regulation 14A within 120 days after the close of our fiscal year and is incorporated herein by reference.\nThe following table presents the information required by Paragraph (b) of Item 401 of Regulation S-K.\n \nAge\n \nPosition with the Company\n \nYear Joined the Company\nRobert V. Pragada\n57 \nChair and Chief Executive Officer\n2016\nVenk Nathamuni\n \n59 \n \nChief Financial Officer\n \n2024\nJoanne E. Caruso\n65 \nChief Legal and Administrative Officer\n2012\nPatrick X. Hill\n52 \nPresident, Global Operations\n1998\nShannon Miller\n49 \nPresident, Strategy, Growth and Digital\n1998\nWilliam B. Allen, Jr. \n \n61 \n \nChief Accounting Officer\n \n2016\nAll of the officers listed in the preceding table serve in their respective capacities at the pleasure of the Board of Directors of the Company.\nMr. Pragada rejoined the Company in February 2016 after serving as President and Chief Executive Officer of The Brock Group since August 2014. From March 2006 to August 2014, Mr. Pragada served in executive and senior leadership capacities with the Company. Mr. Pragada served as President and Chief Operating Officer from November 2019 until he succeeded Steve Demetriou as Chief Executive Officer and was elected as a Director of the Company in January 2023. In September 2024, after completion of the Separation Transaction, Mr. Pragada assumed the additional position of Chair of the Jacobs Board of Directors.\nPage 15\nMr. Nathamuni joined the Company in June 2024 as Chief Financial Officer. Mr. Nathamuni served as Chief Financial Officer at Cirrus Logic Inc. from 2022 to 2024. Prior to that, he served as Head of Corporate Finance, M&A, investor relations and IT for Arista Networks. From 2012 to October 2021, Mr. Nathamuni served in several roles at Maxim Integrated Products, Inc. including as Vice President of M&A and corporate development and head of investor relations. He also held a variety of positions at J.P. Morgan, Synopsys, Synplicity and QuickLogic.\nMs. Caruso joined the Company in 2012. Prior to becoming Chief Legal and Administrative Officer, Ms. Caruso was Senior Vice President, Chief Administrative Officer, and previously held the positions of Senior Vice President, Global Human Resources and Vice President, Global Litigation. Prior to joining the Company, Ms. Caruso was a partner in two international law firms, Howrey LLP and Baker & Hostetler LLP.\nMr. Hill joined the Company through the SKM acquisition, where he started in 1998. Mr. Hill has served in several senior leadership positions crossing multiple sectors and operations throughout Australia, New Zealand, Asia, Europe, the Middle East and the United States. Prior to his appointment as President of the former People & Places Solutions operating segment, Mr. Hill jointly led People & Places Solutions with day-to-day responsibilities for Jacobs' Buildings and Infrastructure global operations outside of North America. In December 2023, Mr. Hill assumed the role of President, Global Operations.\nMs. Miller joined the Company in 1998. During her almost 25-year career at Jacobs, Ms. Miller has had a rich and varied global journey in operations, sales and functional roles leading cultural and digital transformation for both the Company and its markets, including technology, resources, infrastructure, pharmaceutical and consumer products. In December 2023, Ms. Miller assumed the role as President, Strategy, Growth & Digital. Prior to current role, Ms. Miller served as Executive Vice President and President of the former Divergent Solutions operating segment and, prior to that, she served as Jacobs’ Chief Growth Officer and lead for Enterprise Risk Management. \nMr. Allen joined the Company as Chief Accounting Officer in October 2016 after serving as Vice President, Finance and Principal Accounting Officer at LyondellBasell Industries, N.V. from 2013 to 2016. Prior to that, Mr. Allen was with Albemarle Corporation, where he served as Vice President, Corporate Controller and Chief Accounting Officer from 2009 to 2013 after serving in CFO roles for their Catalysts and Fine Chemistry businesses from 2005 to 2009.\nAdditional Information\nJacobs was founded in 1947 and incorporated as a Delaware corporation in 1987. We are headquartered in Dallas, Texas, USA. The SEC maintains a site on the Internet that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The SEC’s website is http://www.sec.gov. You may also read and download the various reports we file with, or furnish to, the SEC free of charge from our website at \nwww.jacobs.com\n.",
  "item7": "Item 7.    MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nPage 50\nCritical Accounting Policies and Estimates\nIn order to better understand the changes that occur to key elements of our financial condition, results of operations and cash flows, a reader of this Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) should be aware of the critical accounting policies we apply in preparing our consolidated financial statements.\nThe consolidated financial statements contained in this report were prepared in accordance with U.S. GAAP. The preparation of our consolidated financial statements and the financial statements of any business performing long-term professional services, engineering and construction-type contracts requires management to make certain estimates and judgments that affect both the entity’s results of operations and the carrying values of its assets and liabilities. Although our significant accounting policies are described in Note 2- \nSignificant Accounting Policies\n of Notes to Consolidated Financial Statements beginning on page F-1 of this Annual Report on Form 10-K, the following discussion is intended to highlight and describe those accounting policies that are especially critical to the preparation of our consolidated financial statements.\nRevenue Accounting for Contracts\nThe Company recognizes engineering, procurement, and construction contract revenue over time, as performance obligations are satisfied, due to the continuous transfer of control to the customer in accordance with ASC 606, \nRevenue from Contracts with Customers\n. Contracts that include engineering, procurement and construction services are generally accounted for as a single deliverable (a single performance obligation). In some instances, the Company’s services associated with a construction activity are limited only to specific tasks such as customer support, consulting or supervisory services. In these instances, the services are typically identified as separate performance obligations.\nThe Company recognizes revenue using the percentage-of-completion method, based primarily on contract costs incurred to date compared to total estimated contract costs. Estimated contract costs include the Company’s latest estimates using judgments with respect to labor hours and costs, materials, and subcontractor costs. The percentage-of-completion method (an input method) is the most representative depiction of the Company’s performance because it directly measures the value of the services transferred to the customer. Subcontractor materials, labor and equipment and, in certain cases, customer-furnished materials and labor and equipment are included in revenue and cost of revenue when management believes that the company is acting as a principal rather than as an agent (e.g., the Company integrates the materials, labor and equipment into the deliverables promised to the customer or is otherwise primarily responsible for fulfillment and acceptability of the materials, labor and/or equipment). Under the typical payment terms of our engineering, procurement and construction contracts, amounts are billed as work progresses in accordance with agreed-upon contractual terms at periodic intervals (e.g., biweekly or monthly) and customer payments are typically due within 30 to 60 days of billing, depending on the contract.\nFor service contracts, the Company recognizes revenue over time using the cost-to-cost percentage-of-completion method. In some instances where the Company is standing ready to provide services, the Company recognizes revenue ratably over the service period. When the Company has operations and maintenance or secondment contracts that do not contain variable consideration or have significant timing differences between cash payment and performance, the practical expedient method is applied for revenue recognition. Under the typical payment terms of our service contracts, amounts are billed as work progresses in accordance with agreed-upon contractual terms, and customer payments are typically due within 30 to 60 days of billing, depending on the contract.\nDirect cost of contracts include all costs incurred in connection with and directly for the benefit of client contracts, including depreciation and amortization relating to assets used in providing the services required by the related projects. The level of direct cost of contracts may fluctuate between reporting periods due to a variety of factors, including the amount of pass-through costs we incur during a period. On those projects where we are acting as principal for subcontract labor or third-party materials and equipment, we reflect the amounts of such items in both revenues and costs (and we refer to such costs as “pass-through costs”).\nPage 51\nAccounting for Pension Plans\nThe accounting for pension plans requires the use of assumptions and estimates in order to calculate periodic pension cost and the value of the plans’ assets and liabilities. These assumptions include discount rates, investment returns, and projected salary increases, among others. The actuarial assumptions used in determining the funded status of the respective plans are provided in Note 13-\n Pension and Other Post Retirement Benefit Plans \nof the Notes to Consolidated Financial Statements beginning on page F-1 of this Annual Report on Form 10-K.\nThe expected rates of return on plan assets ranged from \n4.6% to 7.8%\n for fiscal 2025 and range from \n4.0% to 8.2% f\nor fiscal 2026. We believe the range of rates selected for fiscal 2026 reflects the long-term returns expected on the plans’ assets, considering recent market conditions, projected rates of inflation, the diversification of the plans’ assets, and the expected real rates of market returns. The discount rates used to compute plan liabilities ranged from \n3.4% 7.0%\n in fiscal 2025 and range from\n 3.2% to 6.0% \nin fiscal 2026. These assumptions represent the Company’s best estimate of the rates at which its pension obligations could be effectively settled.\nChanges in the actuarial assumptions often have a material effect on the values assigned to plan assets and liabilities, and the associated pension expense. For example, if the discount rate used to value the net pension benefit obligation (“PBO”) at September 26, 2025 was lower or higher by 1.0%, the PBO would have been higher or lower, respectively, at that date by approximately \n$139.1 million\n for non-U.S. plans, and by approximatel\ny $19.5 million for U.S. plans. If the expected return on plan assets was lower or higher by 1.0%, the net periodic pension cost for fiscal 2025 would be higher or lower, respectively, by approximately $13.1 million for non-U.S. plans, and by approximately $2.7 million\n for U.S. plans. Differences between \nactuarial assumptions and actual performance (i.e., actuarial gains and losses) that are not recognized as a component of net periodic pension cost in the period in which such differences arise are recorded to accumulated other comprehensi\nve loss and are recognized as part of net periodic pension cost in future periods in accordance with U.S. GAAP. Management monitors trends in the marketplace within which our pension plans operate in an effort to assure the reasonableness of the actuarial assumptions used.\nRedeemable Noncontrolling Interests\nIn connection with the PA Consulting investment in March 2021, the Company recorded redeemable noncontrolling interests, representing the interest holders' initial 35% equity interest in the form of preferred and common shares of PA Consulting. The preferred shares are entitled to a cumulative annual compounding 12% dividend based on the outstanding preferred share subscription price. These noncontrolling interest holders have certain option rights to put the preferred and common share interests back to the Company at a value based on the fair value of PA Consulting (the redemption values). The primary inputs and assumptions impacting the fair value of PA Consulting include projections of revenue and earnings before interest, taxes, depreciation and amortization and discount rates applied thereto. Additionally, the Company has an option to call the interests for certain individual shareholders in certain circumstances. Because the interests are redeemable at the option of the holders and not solely within the control of the Company, the Company has classified the interests in redeemable noncontrolling interests in the mezzanine section of its Consolidated Balance Sheet at their redemption values. The optional redemption features may become exercisable no earlier than five years from the March 2, 2021 closing date, or upon the occurrence of certain other events.\nThe Company has deemed these interests probable of becoming redeemable in the future and requiring their measurement at the greater of (i) the redemption amount that would be paid if settlement occurred at the balance sheet date, or (ii) the historical value resulting from the original acquisition date fair value plus the impact of any earnings or loss attribution amounts, including dividends. \nThe fair value of the PA Consulting redeemable noncontrolling interest is determined using a combination of the income and market approaches. Under the income approach, fair value is determined by using the projected discounted cash flows of PA Consulting. Under the market approach, the fair value is determined by reference to guideline companies that are reasonably comparable to PA Consulting, with the fair value estimated based on those companies' valuation multiples of earnings before interest, taxes, depreciation and amortization.\nLitigation, Investigations, and Insurance\nIn the normal course of business, we make contractual commitments, and on occasion we are a party in litigation or arbitration proceedings. The litigation in which we are involved primarily includes personal injury claims, professional liability claims, and breach of contract claims. We are also routinely subject to investigations and audits. \nPage 52\nWe maintain insurance coverage for most insurable aspects of our business and operations. Our insurance programs have varying coverage limits depending upon the type of insurance and include certain conditions and exclusions which insurance companies may raise in response to any claim that the Company brings. We have also elected to retain a portion of certain losses, claims and liabilities that occur through the use of various deductibles, limits, and retentions under our insurance programs and utilize a number of internal financing mechanisms for these self-insurance arrangements including the operation of certain captive insurance entities. As a result, we may be subject to a future liability for which we are only partially insured or completely uninsured. We intend to mitigate any such future liability by continuing to exercise prudent business judgment in negotiating the terms and conditions of the contracts which the Company enters with its clients. Our insurers are also subject to business risk and, as a result, one or more of them may be unable to fulfill their insurance obligations due to insolvency or otherwise.\nOur Consolidated Balance Sheets include amounts representing our probable estimated liability relating to such claims, litigation, audits, and investigations. Our estimates of probable liabilities require us to make assumptions related to potential losses regarding our determination of amounts considered probable and estimable. \nThe Company believes, after consultation with counsel, that such litigation, U.S. government contract-related audits, investigations and claims, and income tax audits and investigations should not have a material adverse effect on our consolidated financial statements, beyond amounts currently accrued.\nPage 53\nJACOBS SOLUTIONS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EARNINGS\nFor the Fiscal Years Ended September 26, 2025, September 27, 2024 and September 29, 2023 \n(In thousands, except per share information)\nSeptember 26, 2025\nSeptember 27, 2024\nSeptember 29, 2023\nRevenues\n$\n12,029,783 \n$\n11,500,941 \n$\n10,851,420 \nDirect cost of contracts\n(9,044,849)\n(8,668,185)\n(8,140,560)\nGross profit\n2,984,934 \n2,832,756 \n2,710,860 \nSelling, general and administrative expenses\n(2,121,300)\n(2,140,320)\n(2,034,376)\nOperating Profit\n863,634 \n692,436 \n676,484 \nOther Income (Expense):\nInterest income\n35,804 \n34,454 \n24,975 \nInterest expense\n(145,788)\n(169,058)\n(168,085)\nLoss on extinguishment of debt\n(20,510)\n— \n— \nMiscellaneous (expense) income, net\n(189,663)\n219,454 \n(12,399)\nTotal other (expense) income, net \n(320,157)\n84,850 \n(155,509)\nEarnings from Continuing Operations Before Taxes\n543,477 \n777,286 \n520,975 \nIncome Tax Expense for Continuing Operations\n(215,555)\n(131,493)\n(101,336)\nNet Earnings of the Group from Continuing Operations\n327,922 \n645,793 \n419,639 \nNet (Loss) Earnings of the Group from Discontinued Operations, net of tax\n(23,966)\n206,850 \n300,017 \nNet Earnings of the Group\n303,956 \n852,643 \n719,656 \nNet Earnings Attributable to Noncontrolling Interests from Continuing Operations\n(3,443)\n(17,990)\n(18,900)\nNet Earnings Attributable to Redeemable Noncontrolling Interests\n(11,177)\n(14,999)\n(21,614)\nNet Earnings Attributable to Jacobs from Continuing Operations\n313,302 \n612,804 \n379,125 \nNet Earnings Attributable to Noncontrolling Interests from Discontinued Operations\n— \n(13,561)\n(13,365)\nNet (Loss) Earnings Attributable to Jacobs from Discontinued Operations\n(23,966)\n193,289 \n286,652 \nNet Earnings Attributable to Jacobs\n$\n289,336 \n$\n806,093 \n$\n665,777 \nNet Earnings Per Share:\nBasic Net Earnings from Continuing Operations Per Share\n$\n2.59 \n$\n4.81 \n$\n3.06 \nBasic Net (Loss) Earnings from Discontinued Operations Per Share\n$\n(0.20)\n$\n1.54 \n$\n2.26 \nBasic Earnings Per Share\n$\n2.39 \n$\n6.35 \n$\n5.32 \nDiluted Net Earnings from Continuing Operations Per Share\n$\n2.58 \n$\n4.79 \n$\n3.05 \nDiluted Net (Loss) Earnings from Discontinued Operations Per Share\n$\n(0.20)\n$\n1.54 \n$\n2.25 \nDiluted Earnings Per Share\n$\n2.38 \n$\n6.32 \n$\n5.30 \nNote: Earnings per share amounts may not add due to rounding.\nPage 54\n2025 Overview\nNet earnings attributable to the Company from continuing operations for fiscal 2025 were $313.3 million (or $2.58 per diluted share), a decrease of $299.5 million, or 48.9%, from $612.8 million (or $4.79 per diluted share) for the prior year. Our reported net earnings for the current year were favorably impacted by higher gross profit of $152.2 million compared to the prior year, primarily driven by stronger performance in our Infrastructure & Advanced Facilities (\"I&AF\") operating segment, specifically in the Advanced Facilities, Europe and Asia, Pacific and Middle East (\"APME\") businesses, as well as growth in our PA Consulting operating segment, as discussed below in the \nSegment Financial Information\n section. While current year results reflected higher year-over-year underlying gross profit, the Company’s results from continuing operations for fiscal 2025 were unfavorably impacted by an increase in miscellaneous expense of $409.1 million primarily as a result of $227.3 million in mark-to-market losses relating to our investment in Amentum stock in connection with the Separation Transaction compared to $186.9 million in gains relating to the same investment in the prior year. Fiscal 2025 comparative results were also unfavorably impacted by a prior year realized gain of $35.2 million from settlement of interest rate swaps in fiscal 2024 and $20.5 million in discounts and expenses recorded to Loss on extinguishment of debt associated with our Equity-for-Debt Transaction on March 13, 2025, where the Company exchanged shares of our investment in Amentum Holdings, Inc. for a principal amount of term loans under the 2021 Term Loan Facility, which term loans were immediately extinguished (see Note 9- \nBorrowings\n and Note 14- \nDiscontinued Operations\n). These unfavorable impacts were partly offset by an increase in TSA-related income and a decrease in interest expense included in miscellaneous expense as well as a decrease in pre-tax Restructuring and other charges and transaction costs of $104.6 million reported in Selling, general & administrative (\"SG&A\") expenses compared to the fiscal 2024 period, primarily associated with the Separation Transaction (mainly professional services and employee separation costs), which are discussed in Note 16- \nRestructuring and Other Charges\n.\nIncome taxes were higher in the current year by $84.1 million primarily due to $51.2 million in tax expense from higher year-over-year pre-tax book income after excluding the permanent book-tax difference for the mark-to-market and other related transactions associated with our investment in Amentum stock. Further, our income tax expense was unfavorably impacted by a prior year discrete income tax benefit of $61.6 million related to the election to treat an Australian subsidiary as a corporation versus a partnership for U.S. tax purposes, which resulted in the derecognition of a deferred tax liability in fiscal year 2024. The overall higher income tax expense was partially offset by a return-to-provision income tax benefit of $16.2 million mainly attributable to additional research and development credits claimed on the U.S. federal tax return.\nNet (loss) earnings attributable to Jacobs from discontinued operations for fiscal 2025 were $(24.0) million (or $(0.20) per diluted share), a decrease of $217.3 million, or 112.4%, from $193.3 million (or $1.54 per diluted share) compared to the prior year. The change year-over-year was primarily driven by prior year operating results of the SpinCo Business which were divested on September 27, 2024 and therefore are no longer in Company's financial results in fiscal year 2025. In addition, the Company has accrued approximately $(30.8) million during the year ended September 26, 2025 as an indemnity reserve in respect of an ongoing non-U.S. tax matter related to an entity that was part of the separated SpinCo Business as described in Note 14- \nDiscontinued Operations.\nBacklog at September 26, 2025 was $23.1 billion, up $1.2 billion, from $21.8 billion in the prior year. New prospects and new sales remain strong, and the Company continues to have a positive outlook for many of the industry groups and sectors in which our clients operate.\nResults of Operations\nFiscal 2025 Compared to Fiscal 2024\nRevenues for the year ended September 26, 2025 were $12.03 billion, an increase of $0.53 billion, or 4.6%, from $11.50 billion for the prior year. The increase in revenues was mainly driven by the Company's I&AF business, as well as year over year revenue growth in our PA Consulting business. The I&AF segment benefited primarily from stronger performance in its Advanced Facilities and APME business operations. Our revenues for fiscal 2025 were favorably impacted by foreign currency translation of $62.4 million in our international businesses, as compared to $77.0 million in the last fiscal year.\nPage 55\nGross profit for the year ended September 26, 2025 was $2.98 billion, an increase of $152.2 million, or 5.4%, from $2.83 billion for the prior year, with gross profit margins of 24.8% and 24.6% for the respective periods. The Company's increase in gross profit was mainly attributable to higher revenues as mentioned above, with favorable margin impacts from year over year project mix.\nSee \nSegment Financial Information\n discussion for further information on the Company’s results of operations at the operating segment level.\nSelling, general & administrative expenses for the year ended September 26, 2025 were $2.12 billion, a decrease of $19.0 million, or 0.9%, from $2.14 billion for the prior year. SG&A expenses were impacted by a decrease of $104.6 million in Restructuring and other charges associated with the Separation Transaction, mainly comprised of professional services, compared to the prior year. This was partially offset by an increase in incentives of $36.5 million, primarily related to PA consulting, expenses associated with the TSA with Amentum of $26.0 million, an increase of $9.9 million in expenses associated with IT related software licensing and other costs, as well as year-over-year increases in other personnel costs and other department spend for the fiscal year 2025. Lastly, SG&A expenses were impacted by unfavorable foreign exchange impacts of $10.8 million for the year ended September 26, 2025 as compared to $2.1 million in fiscal 2024.\nNet interest expense for the year ended September 26, 2025 was $110.0 million, a decrease of $24.6 million from $134.6 million for the prior year. The decrease in net interest expense for the fiscal year 2025 was primarily due to a decrease in interest expense driven by lower outstanding debt balances throughout the fiscal year, as proceeds associated with the Separation Transaction were used for the repayment of debt at the end fiscal 2024 as well as in the current year.\nLoss on extinguishment of debt was $20.5 million in fiscal 2025, which includes discounts and expenses associated with the Equity-for-Debt Transaction executed on March 13, 2025, where the Company exchanged shares of our investment in Amentum Holdings, Inc. for a principal amount of term loans under the 2021 Term Loan Facility, which term loans were immediately extinguished. See Note 9- \nBorrowings\n and Note 14- \nDiscontinued Operations\n.\nMiscellaneous (expense) income, net for the year ended September 26, 2025 was expense of $(189.7) million, an increase of $409.1 million compared to income of $219.5 million in the prior year. The increase in expense from fiscal 2024 was primarily due to $(227.3) million in mark-to-market losses associated with our investment in Amentum stock in connection with the Separation Transaction as compared to $186.9 million in gains relating to the same investment in the prior year and a prior year $35.2 million realized gain on interest rate swaps settled during the fourth quarter of fiscal 2024. These unfavorable items were partially offset by $40.5 million in TSA-related income associated with the Separation Transaction as discussed in Note 14- \nDiscontinued Operations\n.\nNet (loss) earnings attributable to Jacobs from discontinued operations for fiscal 2025 were $(24.0) million (or $(0.20) per diluted share), a decrease of $217.3 million, or 112.4%, from $193.3 million (or $1.54 per diluted share) in the prior year, primarily driven by prior year operating results of the SpinCo Business which were divested on September 27, 2024 and therefore are no longer in Company's financial results in fiscal year 2025. See Note 14- \nDiscontinued Operations\n.\nNet earnings attributable to noncontrolling interests from continuing operations for the year ended September 26, 2025 were $3.4 million, as compared to $18.0 million for the corresponding period last year. The change in noncontrolling interest for fiscal year 2025 primarily resulted from the impact of an unfavorable interim ruling against a consolidated joint venture in which the Company holds a 50% interest, in connection with a long running project, upon which the Company recorded a reserve against related accounts receivable (the “Consolidated JV Matter”) during the second fiscal quarter of 2025.\nNet earnings attributable to redeemable noncontrolling interests for the year ended September 26, 2025 were $11.2 million, compared to $15.0 million in the corresponding prior period. The year over year changes were primarily due to an increase in the Company's noncontrolling share of expense associated with equity-based incentive grants as discussed in Note 15- \nPA Consulting Redeemable Noncontrolling Interests,\n partly offset by favorable underlying net earnings results in our PA Consulting investment compared to the prior year period.\nPage 56\nFiscal 2024 Compared to Fiscal 2023\nRevenues for the year ended September 27, 2024 were $11.50 billion, an increase of $0.65 billion, or 6.0%, from $10.85 billion from fiscal 2023. The increase in revenues was due mainly to improved performance in our I&AF business, as well as higher revenues year over year in our PA Consulting business. The I&AF segment benefited primarily from stronger performance in its Advanced Facilities and international business operations. Our revenues for fiscal 2024 were favorably impacted by foreign currency translation of $77.0 million in our international businesses, as compared to an unfavorable impact of $175.3 million for the corresponding period last fiscal year.\nGross profit for the year ended September 27, 2024 was $2.83 billion, up $121.9 million, or 4.5%, from $2.71 billion for fiscal 2023. The Company's increase in gross profit was mainly attributable to higher revenues as mentioned above, with slight margin impacts from year over year mix and personnel cost impacts. Our gross profit margins were approximately 24.6% and 25.0% for the years ended September 27, 2024 and September 29, 2023, respectively. Overall project mix impacts in our portfolios, personnel costs and utilization trends primarily in PA Consulting had mostly offsetting impacts on our overall margin trends year over year.\nSee \nSegment Financial Information\n discussion for further information on the Company’s results of operations at the operating segment level.\nSelling, general & administrative expenses for the year ended September 27, 2024 were $2.14 billion, an increase of $105.9 million, or 5.2%, from $2.03 billion for fiscal 2023. Fiscal 2024 results were impacted by Restructuring and other charges of $163.4 million in separation activities (mainly professional services and employee separation costs) relating to the Separation Transaction in comparison to prior period costs of $61.1 million. Further our SG&A expenses were impacted by slight increases in other department spend and personnel costs. Lastly, SG&A expenses were impacted by unfavorable foreign exchange impacts of $2.1 million for the year ended September 27, 2024 as compared to favorable impacts of $58.9 million for fiscal 2023.\nNet interest expense for the year ended September 27, 2024 was $134.6 million, a decrease of $8.5 million from $143.1 million for fiscal 2023. The decrease in net interest expense for the fiscal year 2024 was due primarily to the Company's higher levels of cash and lower overall levels of outstanding debt compared to the last fiscal year.\nMiscellaneous income (expense), net for the year ended September 27, 2024 was income of $219.5 million, favorable by $231.9 million as compared to $(12.4) million for the prior period. The increase in income from fiscal 2023 was due primarily to $186.9 million in mark-to-market gains associated with our investment in Amentum stock in connection with the Separation Transaction and a $35.2 million realized gain on interest rate swaps settled during the fourth quarter of fiscal 2024.\nNet earnings attributable to Jacobs from discontinued operations for fiscal 2024 were $193.3 million (or $1.54 per diluted share), a decrease of $93.4 million, or 32.6%, from $286.7 million (or $2.25 per diluted share) for the corresponding prior year period. Included in the current year results from discontinued operations is $98.3 million in costs related to the Separation Transaction and approximately $18 million in pre-tax non-cash charges associated with one-time inventory write downs.\nNet earnings attributable to noncontrolling interests including redeemable noncontrolling interests for the year ended September 27, 2024 of $33.0 million and $40.5 million for the corresponding period last year. The year over year changes were primarily due to lower net earnings results in our PA Consulting investment compared to the prior year periods.\nPage 57\nThe following table reconciles total income tax expense on continuing operations using the statutory U.S. federal income tax rate to the consolidated income tax expense on continuing operations shown in the accompanying Consolidated Statements of Earnings for the years ended September 26, 2025, September 27, 2024 and September 29, 2023 (dollars in thousands):\n \nFor the Years Ended\n \nSeptember 26, 2025\n%\nSeptember 27, 2024\n%\nSeptember 29, 2023\n%\nStatutory amount\n$\n114,130 \n21.0 \n%\n$\n163,230 \n21.0 \n%\n$\n109,405 \n21.0 \n%\nState taxes, net of the federal benefit\n15,852\n2.9 \n%\n21,615 \n2.8 \n%\n13,938 \n2.7 \n%\nExclusion of tax on non-controlling interests\n(880)\n(0.2)\n%\n(5,230)\n(0.7)\n%\n(5,461)\n(1.0)\n%\nForeign:\n \n \nDifference in tax rates of foreign operations\n11,458\n2.1 \n%\n17,891 \n2.3 \n%\n4,583 \n0.9 \n%\nExpense/(Benefit) from foreign valuation allowance change\n415\n0.1 \n%\n(27,780)\n(3.6)\n%\n(1,305)\n(0.3)\n%\nU.S. tax cost of foreign operations\n76,014 \n14.0 \n%\n72,887 \n9.4 \n%\n68,662 \n13.2 \n%\nDerecognition of deferred tax liabilities related to investment in Australian partnership\n— \n— \n%\n(61,614)\n(7.9)\n%\n— \n— \n%\nOther Includable Income\n1,344\n0.2 \n%\n25,952 \n3.3 \n%\n— \n— \n%\nTax differential on foreign earnings\n89,231\n16.4 \n%\n27,336\n3.5 \n%\n71,940\n13.8 \n%\nForeign tax credits\n(48,885)\n(9.0)\n%\n(33,402)\n(4.3)\n%\n(36,180)\n(6.9)\n%\nTax Rate Change\n98 \n— \n%\n(147)\n— \n%\n(9,913)\n(1.9)\n%\nValuation allowance\n988\n0.2 \n%\n12,339 \n1.6 \n%\n(7,169)\n(1.4)\n%\nUncertain tax positions\n11,153\n2.1 \n%\n(1,153)\n(0.1)\n%\n(38,844)\n(7.5)\n%\nOther items:\nDisallowed officer compensation\n5,157\n0.9 \n%\n5,394 \n0.7 \n%\n7,081 \n1.4 \n%\nResearch and Development Credit\n(35,637)\n(6.6)\n%\n(17,110)\n(2.2)\n%\n(2,133)\n(0.4)\n%\nNon-Deductible Incentive Compensation\n18,376 \n3.4 \n%\n3,296 \n0.4 \n%\n162 \n— \n%\nTransaction Costs \n675\n0.1 \n%\n8,500 \n1.1 \n%\n4 \n— \n%\nNon-taxable mark-to-market Adjustment for Amentum investment\n51,989\n9.6 \n%\n(39,255)\n(5.1)\n%\n— \n— \n%\nOther items – net\n(6,692)\n(1.2)\n%\n(13,920)\n(1.8)\n%\n(1,494)\n(0.3)\n%\nTotal other items\n33,868\n6.2 \n%\n(53,095)\n(6.8)\n%\n3,620\n0.7 \n%\nIncome taxes from continuing operations\n$\n215,555 \n39.7 \n%\n$\n131,493 \n16.9 \n%\n$\n101,336 \n19.5 \n%\nNote: Certain amounts have been reclassified to conform to the current year presentation.\nRestructuring and Other Charges\nDuring fiscal 2023, the Company implemented restructuring initiatives relating to the Separation Transaction. The Company incurred approximately $28.2 million, $42.0 million and $17.5 million in the years ended September 26, 2025, September 27, 2024 and September 29, 2023, respectively, in pre-tax cash charges in connection with these initiatives. These actions, which are expected to be substantially completed before the end of calendar year 2025, are expected to result in estimated gross annualized pre-tax cash savings of approximately $165 million to $200 million. We will likely incur additional charges under this program through calendar year 2025, which are expected to result in additional savings in future periods.\nDuring third quarter fiscal 2023, the Company approved a plan to improve business processes and cost structures of our PA Consulting investment by reorganizing senior management and reducing headcount. In connection with these initiatives, which are substantially completed, the Company incurred approximately $1.9 million, $6.4\n \nmillion and $14.3\n \nmillion in the years ended September 26, 2025, September 27, 2024 and September 29, 2023, respectively, in pre-tax \nPage 58\ncash charges. These activities are expected to result in estimated gross annualized pre-tax cash savings of approximately $50 million to $65 million.\nRefer to Note 16– \nRestructuring and Other Charges\n for further information regarding restructuring and integration initiatives. \nPage 59\nSegment Financial Information\nThe following tables present total revenues, direct cost of contracts, selling, general and administrative expenses and segment operating profit from continuing operations for each reportable segment (in thousands) and includes a reconciliation of segment operating profit to total U.S. GAAP operating profit by including certain corporate-level expenses, Restructuring and other charges (as defined in Note 16\n- Restructuring and Other Charges\n) and transaction and integration costs (in thousands) for the years ended: \nSeptember 26, 2025\nInfrastructure & Advanced Facilities\nPA Consulting\nTotal \nRevenues from External Customers \n(1)\n$\n10,764,206 \n$\n1,265,577 \n$\n12,029,783 \nDirect cost of contracts\n(8,228,935)\n(815,914)\n(9,044,849)\nSelling, general and administrative expenses\n(1,631,723)\n(171,164)\n(1,802,887)\nSegment Operating Profit \n(1)\n$\n903,548 \n$\n278,499 \n$\n1,182,047 \nRestructuring, Transaction and Other Charges \n(2)\n(162,896)\nAmortization of Intangible Assets\n(155,517)\nTotal U.S. GAAP Operating Profit\n$\n863,634 \nTotal Other (Expense) Income, net \n(3)\n(320,157)\nEarnings from Continuing Operations Before Taxes\n$\n543,477 \n(1)\nI&AF revenue and operating profit for the year ended September 26, 2025 were impacted by a reserve in connection with an unfavorable interim ruling against a consolidated joint venture in which the Company holds a 50% interest (the \"Consolidated JV Matter\"), with the noncontrolling partner’s share included in noncontrolling interests in the Consolidated Statements of Earnings for the respective period.\n(2)\nThe year ended September 26, 2025 included $58.8 million in restructuring and other charges related to the Separation Transaction (primarily professional services and employee separation costs), as well as $75.3 million in charges for certain subsidiary level compensation based agreements. The year ended September 26, 2025 included approximately $26.0 million in charges associated with the Company's TSA with Amentum.\n(3)\nThe year ended September 26, 2025 included $227.3 million in mark-to-market losses and other related charges associated with our investment in Amentum stock in connection with the Separation Transaction, as well as $40.5 million in income associated with the Company's TSA with Amentum (see Note 14- \nDiscontinued Operations\n). The year ended September 26, 2025 included $20.5 million in discounts and expenses associated with the Equity-for-Debt Transaction (see Note 9- \nBorrowings \nand Note 14- \nDiscontinued Operations\n).\nSeptember 27, 2024\nInfrastructure & Advanced Facilities\nPA Consulting\nTotal \nRevenues from External Customers\n$\n10,323,255 \n$\n1,177,686 \n$\n11,500,941 \nDirect cost of contracts\n(7,915,256)\n(752,929)\n(8,668,185)\nSelling, general and administrative expenses\n(1,609,624)\n(185,507)\n(1,795,131)\nSegment Operating Profit \n$\n798,375 \n$\n239,250 \n$\n1,037,625 \nRestructuring, Transaction and Other Charges \n(1)\n(192,522)\nAmortization of Intangible Assets\n(152,667)\nTotal U.S. GAAP Operating Profit\n$\n692,436 \nTotal Other (Expense) Income, net \n(2)\n84,850 \nEarnings from Continuing Operations Before Taxes\n$\n777,286 \n(1)\nThe year ended September 27, 2024 included $163.4 million in restructuring and other charges related to the Separation Transaction (primarily professional services and employee separation costs) and $6.4 million in restructuring and other charges related to the Company's investment in PA Consulting (primarily employee separation costs), as well as certain subsidiary level compensation based agreements.\n(2)\nThe year ended September 27, 2024 included $186.9 million in mark-to-market gains associated with our investment in Amentum stock in connection with the Separation Transaction and a $35.2 million realized gain on interest rate swaps settled during the fourth quarter of fiscal 2024.\nPage 60\nSeptember 29, 2023\nInfrastructure & Advanced Facilities\nPA Consulting\nTotal \nRevenues from External Customers\n$\n9,693,276 \n$\n1,158,144 \n$\n10,851,420 \nDirect cost of contracts\n(7,395,838)\n(744,722)\n(8,140,560)\nSelling, general and administrative expenses \n(1)\n(1,563,836)\n(176,419)\n(1,740,255)\nSegment Operating Profit \n$\n733,602 \n$\n237,003 \n$\n970,605 \nRestructuring, Transaction and Other Charges \n(2)\n(146,891)\nAmortization of Intangible Assets\n(147,230)\nTotal U.S. GAAP Operating Profit\n$\n676,484 \nTotal Other (Expense) Income, net\n(155,509)\nEarnings from Continuing Operations Before Taxes\n$\n520,975 \n(1)\nIn fiscal 2023, I&AF SG&A included approximately $15.0 million in net favorable impacts from cost reductions compared to the prior year period, which were associated mainly with net favorable impacts during first quarter from changes in employee benefit programs of $41.0 million offset by approximately $26.0 million in higher spend in company technology platforms and other personnel and corporate cost increases.\n(2)\nThe year ended September 29, 2023 included $61.1 million in restructuring and other charges related to the Separation Transaction (primarily professional services and employee separation costs) and $14.3 million, in restructuring and other charges related to the Company's investment in PA Consulting (primarily employee separation costs), as well as certain subsidiary level compensation based agreements. Additionally, in fiscal year 2023, there were $46.7 million in charges associated mainly with real estate impairments.\nPage 61\nIn evaluating the Company’s performance by operating segment, the chief operating decision maker (\"CODM\") reviews various metrics and statistical data for Infrastructure & Advanced Facilities and PA Consulting. For more information, please refer to Note 19- \nSegment Information\n. In addition, the Company attributes each segment's specific incentive compensation plan costs to the segments. The methods for recognizing revenue, incentive fees, project losses and change orders are consistent among the segments.\nInfrastructure & Advanced Facilities\nFor the Years Ended\nSeptember 26, 2025\nSeptember 27, 2024\nSeptember 29, 2023\nRevenue\n$\n10,764,206 \n$\n10,323,255 \n$\n9,693,276 \nOperating Profit\n$\n903,548 \n$\n798,375 \n$\n733,602 \nFiscal 2025 vs. 2024\nRevenues for the Infrastructure & Advanced Facilities (\"I&AF\") segment for the year ended September 26, 2025 were $10.76 billion, up $0.44 billion, or 4.3%, from $10.32 billion for the prior year. The increase in revenues for the year ended September 26, 2025 was driven primarily from stronger performance in its Advanced Facilities and APME business operations. This was partly offset by a reserve recorded in second quarter fiscal 2025 associated with an unfavorable interim ruling against a consolidated joint venture in which the Company holds a 50% interest, with the noncontrolling partner’s share included in noncontrolling interests in the Company's Consolidated Statements of Earnings for the year ended September 26, 2025. Foreign currency translation had a favorable impact of $24.4 million on our international business for the year ended September 26, 2025, compared to $37.5 million in favorable impacts in the prior year. \nOperating profit for the I&AF segment for the year ended September 26, 2025 was $903.5 million, an increase of $105.2 million, or 13.2%, from $798.4 million for the comparative period in fiscal 2024. Higher operating profit for the year ended September 26, 2025\n \nwas a result of higher year over year segment revenues mentioned above, along with increased margin quality associated with favorable impacts from project mix. Higher operating profit for the year ended September 26, 2025 compared to prior year was partially offset by a reserve recorded in second quarter fiscal 2025 associated with an unfavorable interim ruling against a consolidated joint venture in which the Company holds a 50% interest, with the noncontrolling partner's share included in noncontrolling interests in the Company's Consolidated Statements of Earnings for the year ended September 26, 2025. Impacts on operating profit from favorable foreign currency translation were approximately $3.1 million for the year ended September 26, 2025, compared to $11.5 million in favorable impacts in the prior year. \nFiscal 2024 vs. 2023\nRevenues for the I&AF segment for the year ended September 27, 2024 were $10.32 billion, up $0.63 billion, or 6.5%, from $9.69 billion for the prior year. The increase in revenue was broad based across most I&AF businesses, particularly due to stronger performance in its Advanced Facilities and Europe business operations as compared to the prior year period. Foreign currency translation had a favorable impact of $37.5 million on our international business for the year ended September 27, 2024, compared to $124.2 million in unfavorable impacts in fiscal 2023. \nOperating profit for the I&AF segment for the year ended September 27, 2024 was $798.4 million, an increase of $64.8 million, or 8.8%, from $733.6 million for fiscal 2023. The year-over-year increase in operating profit was driven primarily by the revenue growth mentioned above with an unfavorable comparative impact of a one-time net favorable $41 million relating mainly to changes in employee benefits programs during first quarter 2023, partly offset by year over year favorable department spending. Impacts on operating profit from favorable foreign currency translation were approximately $11.5 million for the year ended September 27, 2024, compared to $4.3 million in unfavorable impacts in the prior year. \nPA Consulting\nFor the Years Ended\nSeptember 26, 2025\nSeptember 27, 2024\nSeptember 29, 2023\nRevenue\n$\n1,265,577 \n$\n1,177,686 \n$\n1,158,144 \nOperating Profit\n$\n278,499 \n$\n239,250 \n$\n237,003 \nPage 62\nFiscal 2025 vs. 2024\nRevenues for the PA Consulting segment for the year ended September 26, 2025 were $1.27 billion, up $87.9 million, or 7.5%, from $1.18 billion for the prior year. The increase in revenue was due primarily to growth in PA Consulting's public services businesses (through the defence and security, public services and health and life sciences sectors). Foreign currency translation had a $38.1 million favorable impact on revenues in our international businesses for the year ended September 26, 2025, compared to a favorable impact of $39.5 million for the prior year.\nOperating profit for the segment for the year ended September 26, 2025 was $278.5 million, an increase of $39.2 million, or 16.4%, from $239.3 million, for the prior year. The year over year increases were mainly attributable to improved revenues as mentioned above, combined with favorable impacts from reduced costs.\nFiscal 2024 vs. 2023\nRevenues for the PA Consulting segment for the year ended September 27, 2024 were $1.18 billion, up $19.5 million, or 1.7%, from $1.16 billion for fiscal 2023. The increase in revenue was due primarily to growth in PA Consulting's public services businesses. Foreign currency translation had a $39.5 million favorable impact on revenues in our international businesses for the year ended September 27, 2024, compared to an unfavorable impact of $51.1 million for fiscal 2023.\nOperating profit for the segment for the year ended September 27, 2024 was $239.3 million, an increase of $2.2 million, or 0.9%, from $237.0 million, for fiscal 2023. Operating profit trends showed consistent levels year over year overall.\nBacklog Information\nBacklog represents revenue we expect to realize in the future for work to be completed by our consolidated subsidiaries and our proportionate share of work to be performed by unconsolidated joint ventures. Because of variations in the nature, size, expected duration, funding commitments, and the scope of services required by our contracts, the amount and timing of when backlog will be recognized as revenues includes significant estimates and can vary greatly between individual contracts. \nConsistent with industry practice, substantially all of our contracts are subject to cancellation or termination at the option of the client, including our U.S. government work. While management uses all information available to determine backlog, at any given time our backlog is subject to changes in the scope of services to be provided as well as increases or decreases in costs relating to the contracts included therein. Backlog is not necessarily an indicator of future revenues.\nBecause certain contracts (e.g., contracts relating to large Engineering, Procurement & Construction projects as well as national government programs) can cause large increases to backlog in the fiscal period in which we recognize the award, and because many of our contracts require us to provide services that span over several fiscal quarters (and sometimes over fiscal years), we have presented our backlog on a year-over-year basis, rather than on a sequential, quarter-over-quarter basis.\nPlease refer to Item 1A- \nRisk Factors\n, above, for a discussion of other factors that may cause backlog to ultimately convert into revenues at different amounts.\nThe following table summarizes our backlog for the years ended September 26, 2025, September 27, 2024 and September 29, 2023 (in millions):\nSeptember 26, 2025\nSeptember 27, 2024\nSeptember 29, 2023\nInfrastructure & Advanced Facilities\n$\n22,649 \n$\n21,472 \n$\n17,526 \nPA Consulting\n415 \n378 \n311 \n            Total\n$\n23,064 \n$\n21,850 \n$\n17,837 \nPage 63\n               The increase in backlog in Infrastructure & Advanced Facilities in the year ended September 26, 2025 was predominantly driven by growth across Water, Environmental, Energy and Cities & Places end markets.\n               The increase in backlog in PA Consulting was primarily driven by organic year-over-year growth of the business including securing larger programs of work.\nBacklog relating to work to be performed either directly or indirectly for the U.S. federal government and its agencies totaled approximately $2.2 billion (or 9.5% of total backlog), $2.4 billion (or 11.1% of total backlog) and $2.6 billion (or 14.7% of total backlog) at September 26, 2025, September 27, 2024 and September 29, 2023, respectively. Most of our federal government contracts require that services be provided beyond one year. In general, these contracts must be funded annually (i.e., the amounts to be spent under the contract must be appropriated by the U.S. Congress to the procuring agency, and then the agency must allot these sums to the specific contracts).\nWe estimate that approximately $6.77 billion, or 29.3%, of total backlog at September 26, 2025 will be realized as revenues within the next fiscal year.\nConsolidated backlog differs from the Company’s remaining performance obligations as defined by ASC 606 primarily because of contract change orders or new wins not yet processed and our national government contracts where our policy is to generally include in backlog the contract award, whether funded or unfunded excluding certain option periods while our remaining performance obligations represent a measure of the total dollar value of work to be performed on contracts awarded and in progress. Additionally, the Company does not include our proportionate share of backlog related to unconsolidated joint ventures in our remaining performance obligations.\nLiquidity and Capital Resources\nAt September 26, 2025, our principal sources of liquidity consisted of $1.24 billion in cash and cash equivalents and $1.85 billion of available borrowing capacity under our $2.25 billion revolving credit agreement (the \"Revolving Credit Facility\"). See Note 9- \nBorrowings\n for more information. We finance much of our operations and growth through cash generated by our operations.\nCash and cash equivalents at September 26, 2025 were $1.24 billion, representing an increase of $90.7 million from $1.14 billion at September 27, 2024, the reasons for which are described below. The following table presents selected consolidated cash flow information of the Company for the respective periods shown (including discontinued operations of our separated SpinCo Business, see Note 14- \nDiscontinued Operations \nfor more information):\nPage 64\n(In thousands)\nSeptember 26, 2025\nSeptember 27, 2024\nNet cash provided by operating activities\n$\n686,704 \n$\n1,054,673 \nCash Flows from Investing Activities:\nAdditions to property and equipment\n(79,232)\n(121,114)\nDisposals of property and equipment and other assets\n2,332 \n6,187 \nCapital contributions to equity investees, net of return of capital distributions\n1,609 \n1,737 \nAcquisitions of businesses, net of cash acquired\n— \n(14,000)\nNet cash used for investing activities \n(75,291)\n(127,190)\nCash Flows from Financing Activities:\nProceeds from long-term borrowings\n2,458,201 \n4,606,697 \nRepayments of long-term borrowings\n(1,471,800)\n(3,370,355)\nProceeds from short-term borrowings\n— \n5,345 \nRepayments of short-term borrowings\n(656,981)\n(866,761)\nDebt issuance costs\n(92)\n(34,331)\nProceeds from issuances of common stock\n34,712 \n47,503 \nCommon stock repurchases\n(754,130)\n(402,668)\nTaxes paid on vested restricted stock\n(27,450)\n(41,720)\nCash dividends to shareholders\n(153,027)\n(142,779)\nNet dividends associated with noncontrolling interests\n(14,205)\n(21,678)\nRepurchase of redeemable noncontrolling interests\n(10,449)\n(55,344)\nProceeds from issuances of redeemable noncontrolling interests\n— \n19,761 \nCash impact from distribution of SpinCo Business\n70,000 \n(495,307)\nNet cash used for financing activities\n(525,221)\n(751,637)\nEffect of Exchange Rate Changes\n3,693 \n41,640 \nNet Increase (Decrease) in Cash and Cash Equivalents and Restricted Cash\n89,885 \n217,486 \nCash and Cash Equivalents, including Restricted Cash, at the Beginning of the Period\n1,146,931 \n929,445 \nCash and Cash Equivalents, including Restricted Cash, at the End of the Period\n$\n1,236,816 \n$\n1,146,931 \nOur net cash flow provided by operations of $686.7 million during fiscal 2025 was unfavorable by $368.0 million in comparison to the cash flow provided by operations of $1.05 billion for the corresponding prior year (which included discontinued operations of the separated SpinCo Business). On a continuing operations basis, our cash from operations was unfavorable by $139.0 million, with this decline largely due to higher uses of cash for net working capital, namely accounts receivables, as well as a year-over-year increase in cash income tax payments, offset by an improvement in accounts payable timing, lower year-over-year cash payments related to restructuring and other charges and a year-over-year improvement in net earnings from continuing operations after adjustments to reconcile net earnings from continuing operations to net cash flows provided by operations.\nOur net cash used for investing activities for fiscal 2025 was $75.3 million, compared to $127.2 million in the prior year, with this change due primarily to a decrease in property and equipment spend in the current year and no current year acquisitions.\nOur net cash used for financing activities for the fiscal year ended September 26, 2025 of $525.2 million resulted mainly from $754.1 million in share repurchases and $153.0 million in cash dividends to shareholders. This was offset by $329.4 million in net proceeds from borrowings, and the receipt of $70.0 million associated with the final settlement of the post-closing working capital adjustment from the distribution of the SpinCo Business; see Note 14-\n Discontinued Operations \nfor more details. Cash used for financing activities in the prior year was $751.6 million primarily due to a $495.3 million direct decrease in reported cash on hand as a result of our prior year SpinCo Business deconsolidation, $402.7 million of cash used for share repurchases and $142.8 million in dividends to shareholders. These uses of cash were offset by $374.9 million in net proceeds from borrowings.\nAt September 26, 2025, the Company had approximately $237.5 million in cash and cash equivalents held in the U.S. and $997.9 million held outside of the U.S. (primarily in the U.K., the Eurozone, Australia, India, Canada, and the Middle East region), which is used primarily for funding operations in those regions. Other than the tax cost of repatriating funds to the U.S. (see Note 7-\n Income Taxes \nof Notes to Consolidated Financial Statements beginning on page F-1 of this Annual Report on Form 10-K), there are no material impediments to repatriating these funds to the U.S. \nPage 65\nThe Company had $217.0 million in letters of credit outstanding at September 26, 2025. Of this amount, $0.3 million was issued under the Revolving Credit Facility and $216.7 million was issued under separate, committed and uncommitted letter-of-credit facilities.\nOn March 27, 2025, the Company, as guarantor, and JEGI, as borrower, entered into a term loan agreement (the “2025 Term Loan Facility”) with Bank of America, N.A., as administrative agent and sole lead arranger, and the lenders party thereto. Under the 2025 Term Loan Facility, JEGI borrowed a $200.0 million term loan and £410.0 million term loan for a term of two-years from the date of initial funding, maturing on March 26, 2027. The proceeds from the 2025 Term Loan Facility were used to repay the outstanding 2021 Term Loan Facility principal equal to $120.0 million and £410.2 million, or $531.6 million, and was otherwise used for general corporate purposes. See Note 9-\n Borrowings\n.\nLong-term debt as of September 26, 2025 increased by $887.9 million compared to September 27, 2024 primarily due to the Company entering into the 2025 Term Loan Facility for a combined amount of $750.3 million (see Note 9- \nBorrowings\n), and an increased draw on the revolving credit facility of $255.0 million to fund share buybacks and dividends, partly offset by the termination of the 2021 Term Loan - USD portion.\nShort-term debt as of September 26, 2025 decreased by $875.8 million compared to September 27, 2024 primarily due to the Equity-for-Debt Transaction, pursuant to which the company extinguished $311.5 million under the GBP 2021 Term Loan, in exchange for its approximately 19.5 million shares in Amentum, and the entry to the 2025 Term Loan Facility, the proceeds of which were used to extinguish the remaining $531.6 million under the GBP 2021 term loan contract. For more information please refer to Note- 9 \nBorrowings \nand Note 14- \nDiscontinued Operations \nfor additional details.\nIn connection with the Separation Transaction, during the fourth quarter of fiscal year 2024, Jacobs received a cash payment of approximately $911 million from SpinCo which was subsequently used for the repayment of debt, which was inclusive of the outstanding short term 2020 Term Loan Facility totaling $834.9 million.\nIn connection with the Post-Closing Additional Merger Consideration relating to the Separation Transaction, the Company became entitled to receive approximately 7.3 million Amentum shares from the 9.7 million shares held in escrow. On April 30, 2025, the Jacobs' Board of Directors determined to distribute the 7.3 million shares of Amentum's stock and declared an in kind dividend payable to Jacobs' shareholders of record as of May 16, 2025 which was distributed on a pro rata basis on May 30, 2025. Please refer to Note 14- \nDiscontinued Operations \nfor additional details.\nOn April 10, 2025, the Company collected $70.0 million in receivables related to the final settlement of the post-closing working capital adjustment from the distribution of the SpinCo Business. The cash was utilized to pay down amounts owed under the Company's Revolving Credit Facility on the same day. Please refer to Note 14- \nDiscontinued Operations \nfor additional details. \nOn February 6, 2023, the Company refinanced its Revolving Credit Facility, and on February 16, 2023, the Company issued \n$500 million\n in bonds. On August 18, 2023, the Company issued \n$600 million\n in bonds. See Note 9- \nBorrowings\n for further discussion relating to the terms of the 5.90% Bonds, the 6.35% Bonds, the Revolving Credit Facility following the issuances and refinancing.\nCertain employees and nonemployees of PA Consulting are eligible to receive equity-based incentive grants since the March 2, 2021 original investment date. As of September 26, 2025, there was approximately $142.1 million of total unrecognized compensation cost related to the remaining 60% of fair value of such grants anticipated to vest upon a liquidity event, as defined in the applicable agreements. This cost is expected to be recognized in Selling, general and administrative expenses when such a liquidity event is considered probable, which could occur in 2026. Please refer to Note 15- \nPA Consulting Redeemable Noncontrolling Interests\n for additional details. \nWe believe we have adequate liquidity and capital resources to fund our projected cash requirements for acquisitions, including any potential transaction relating to PA Consulting, and financing activities such as debt servicing, share buybacks and dividends for the next twelve months based on the liquidity provided by our cash and cash equivalents on hand, our borrowing capacity and our continuing cash from operations.\nWe were in compliance with all of our debt covenants at September 26, 2025.\nPage 66\nSupplemental Obligor Group Financial Information\nOn February 16, 2023, Jacobs Engineering Group Inc., a wholly-owned subsidiary of Jacobs Solutions Inc. (together, the \"Obligor Group\"), completed an offering of $500 million aggregate principal amount of 5.90% Bonds, due 2033 and on August 18, 2023, completed an offering of $600 million aggregate principal amount of 6.35% Bonds, due 2028 (the “Bonds”). The Bonds are fully and unconditionally guaranteed by the Company (the “Guarantees”). The Bonds and the Guarantees were offered pursuant to prospectus supplements, dated February 13, 2023 and August 15, 2023, respectively, to the prospectus dated February 6, 2023, that forms a part of the Company and JEGI’s automatic shelf registration statement on Form S-3ASR (File Nos. 333-269605 and 333-269605-01) previously filed with the SEC.\nIn accordance with SEC Regulation S-X Rule 13-01, set forth below is the summarized financial information for the Obligor Group on a combined basis after elimination of (i) intercompany transactions and balances between Jacobs and JEGI and (ii) equity in the earnings from and investments in all other subsidiaries of the Company that do not guarantee the registered securities of either Jacobs or JEG. This summarized financial information (in thousands) has been prepared and presented pursuant to Regulation S-X Rule 13-01, “Financial Disclosures about Guarantors and Issuers of Guaranteed Securities” and is not intended to present the financial position or results of operations of the Obligor Group in accordance with U.S. GAAP.\n(in thousands)\nSeptember 26, 2025\nSummarized Statement of Earnings Data\nRevenue\n$\n4,021,148 \nDirect cost of contracts\n$\n3,360,986 \nSelling, general and administrative expenses\n$\n355,186 \nNet loss attributable to Guarantor Subsidiaries from continuing operations\n$\n(41,288)\nNoncontrolling interests\n$\n(1,388)\n(in thousands)\nSeptember 26, 2025\nSummarized Balance Sheet Data\nCurrent assets, less receivables from Non-Guarantor Subsidiaries\n$\n938,319 \nCurrent receivables from Non-Guarantor Subsidiaries\n$\n749,475 \nNoncurrent assets, less noncurrent receivables from Non-Guarantor Subsidiaries\n$\n642,464 \nNoncurrent receivables from Non-Guarantor Subsidiaries\n$\n563,682 \nCurrent liabilities\n$\n1,006,916 \nCurrent liabilities to Non-Guarantor Subsidiaries\n$\n— \nLong-term Debt\n$\n2,236,456 \nOther Noncurrent liabilities, less amounts payable to Non-Guarantor Subsidiaries\n$\n250,106 \nNoncurrent liabilities to Non-Guarantor Subsidiaries\n$\n1,110,155 \nNoncontrolling interests\n$\n5 \nAccumulated deficit\n$\n(1,709,698)\nPage 67\nNew Accounting Pronouncements\nASU 2025-05, \nFinancial Instruments—Credit Losses,\n (Topic 326): Measurement of Credit Losses for Accounts Receivable and Contract Assets\n, provides all entities with a practical expedient option when estimating expected credit losses for current accounts receivable and current contract assets arising from transactions accounted for under Topic 606. The amendments in this update are effective for annual reporting periods beginning after December 15, 2025, including \ninterim periods within those annual periods, with early adoption permitted. ASU 2025-05 will be effective for the Company in first quarter of fiscal 2027. The Company is evaluating the impact of this guidance on its consolidated financial statements and related disclosures.\nASU 2025-03, \nBusiness Combinations, (Topic 805) and Consolidation (Topic 810): Determining the Accounting Acquirer in the Acquisition of a Variable Interest Entity\n, clarifies the guidance in determining the accounting acquirer in a business combination effected primarily by exchanging equity interests when the acquiree is a variable interest entity that meets the definition of a business. The standard is effective for fiscal years beginning after December 15, 2026, including interim periods within those fiscal years. Early adoption is permitted, and the standard is to be applied prospectively to acquisitions after the adoption date. ASU 2025-03 will be effective for the Company in the first quarter of fiscal 2028. The Company is evaluating the impact of this guidance on its consolidated financial statements and related disclosures.\nASU 2024-03,\n Income Statement, (Subtopic 220-40): Reporting Comprehensive Income - Disaggregation of Income Statement Expenses\n, requires disclosure, in the notes to financial statements, of specified information about certain costs and expenses. The amendments in this update also provide guidance on the disaggregation disclosure requirements for certain expense captions presented on the face of an entity’s income statement and provide guidance on the disclosure of selling expenses. The amendments in ASU 2024-03 are effective for annual reporting periods beginning after December 15, 2026, and interim reporting periods beginning after December 15, 2027, with early adoption permitted. The amendments should be applied prospectively; however, retrospective application is also permitted. ASU 2024-03 will be effective for the Company in the fourth quarter of fiscal 2027. The Company is evaluating the impact of this guidance on its consolidated financial statements and related disclosures.\nASU 2023-09, \nIncome Taxes\n,\n (Topic 740): Improvements to Income Tax Disclosures\n, provides qualitative and quantitative updates to the Company's effective income tax rate reconciliation and income taxes paid disclosures, among others, in order to enhance the transparency of income tax disclosures, including consistent categories and greater disaggregation of information in the rate reconciliation and disaggregation by jurisdiction of income taxes paid. The amendments in ASU 2023-09 are effective for fiscal years beginning after December 15, 2024, with early adoption permitted. The amendments should be applied prospectively; however, retrospective application is also permitted. ASU 2023-09 will be effective for the Company's\n \nannual fiscal 2026 period\n.\n \nThe Company is evaluating the impact of this guidance on its consolidated financial statements and related disclosures.\n \nASU 2023-07, \nSegment Reporting, (Topic 280): Improvements to Reportable Segment Disclosures\n, requires disclosure of significant segment expenses that are regularly provided to the chief operating decision maker (“CODM”) and included within each reported measure of segment profit or loss, an amount and description of its composition for other segment items to reconcile to segment profit or loss, and the title and position of the entity’s CODM. The amendments in this update also expand the interim segment disclosure requirements. ASU 2023-07 is effective for annual periods beginning after December 15, 2023 and interim periods within fiscal years beginning after December 15, 2024. Early adoption is permitted and the amendments in this update are required to be applied on a retrospective basis. ASU 2023-07 was effective for the Company's\n annual fiscal 2025 period. \nThe Company adopted this update effective for the fiscal year ended \nSeptember 26, 2025.\nASU 2023-06, \nDisclosure Improvements\n:\n Amendments - Codification Amendments in Response to the Disclosure Update and Simplification Initiative of the Securities and Exchange Commission (\"SEC\")\n. The Financial Accounting Standards Board issued the standard to introduce changes to US GAAP that originate in either SEC Regulation S-X or S-K, which are rules about the form and content of financial reports filed with the SEC. The provisions of the standard are contingent upon instances where the SEC removes the related disclosure provisions from Regulation S-X and S-K. ASU 2023-06 is effective for fiscal years beginning after December 15, 2024, with early adoption permitted. The amendments should be applied prospectively; however, retrospective application is also permitted. ASU 2023-06 will be effective for the company in the fourth quarter of Fiscal 2026. The Company does not expect that the application of this standard will have a material impact on our consolidated financial statements and related disclosures.\nPage 68",
  "item2": null
}