{
  "source_file": "jec-20250627.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.        Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nGeneral\nThe purpose of this Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is to provide a narrative analysis explaining the reasons for material changes in the Company’s (i) financial condition from the most recent fiscal year-end to June 27, 2025 and (ii) results of operations during the current fiscal period(s) as compared to the corresponding period(s) of the preceding fiscal year. In order to better understand such changes, readers of this MD&A should also read:\n•\nThe discussion of the critical and significant accounting policies used by the Company in preparing its consolidated financial statements. The most current discussion of our critical accounting policies appears in Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n of our 2024 Form 10-K, and the most current discussion of our significant accounting policies appears in Note 2- \nSignificant Accounting Polices\n in Notes to Consolidated Financial Statements of our 2024 Form 10-K;\n•\nThe Company’s fiscal 2024 audited consolidated financial statements and notes thereto included in our 2024 Form 10-K; and\n•\nItem 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n included in our 2024 Form 10-K.\nIn addition to historical information, this MD&A and other parts of this Quarterly Report on Form 10-Q contain forward-looking statements within the meaning of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements are statements that do not directly relate to any historical or current fact. When used herein, words such as “expects,” “anticipates,” “believes,” “seeks,” “estimates,” “plans,” “intends,” “future,” “will,” “would,” “could,” “can,” “may,” \"target,\" \"goal\" and similar words are intended to identify forward-looking statements. Examples of forward-looking statements include, but are not limited to, statements we make concerning the financial condition and results of operations and our expectations as to our future growth, prospects, financial outlook and business strategy and any assumptions underlying any of the foregoing. Although such statements are based on management’s current estimates and expectations, and/or currently available competitive, financial, and economic data, forward-looking statements are inherently uncertain, and you should not place undue reliance on such statements as actual results may differ materially. We caution the reader that there are a variety of risks, uncertainties and other factors that could cause actual results to differ materially from what is contained, projected or implied by our forward-looking statements. Such factors include but are not limited to: \n•\ngeneral economic conditions, including inflation and the actions taken by monetary authorities in response to inflation, changes in interest rates and foreign currency exchange rates, changes in capital markets and stock market volatility, instability in the banking industry, labor shortages, or the impact of a possible recession or economic downturn or changes to monetary or fiscal policies or priorities in the U.S. and the countries where we do business on our results, prospects and opportunities; \n•\ncompetition from existing and future competitors in our target markets, as well as the possible reduction in demand for certain of our product solutions and services, including delays in the timing of the award of projects or reduction in funding, or the abandonment of ongoing or anticipated projects due to the financial condition of our clients and suppliers or due to governmental budget constraints or changes to governmental budgetary priorities, or the inability of our clients to meet their payment obligations in a timely manner or at all;\n•\nour ability to fully execute on our corporate strategy, including the impact of acquisitions, strategic alliances, divestitures, and other strategic events resulting from evolving business strategies, including on our ability to maintain our culture and retain key personnel, customers or suppliers, or our ability to achieve the cost-savings and synergies contemplated by our recent acquisitions within the expected time frames or to achieve them fully and to successfully integrate acquired businesses while retaining key personnel, and our ability to invest in the tools needed to implement our strategy;\n•\nfinancial market risks that may affect us, including by affecting our access to capital, the cost of such capital and/or our funding obligations under defined benefit pension and post-retirement plans; \n•\nlegislative changes, including potential changes to the amounts provided for under the Infrastructure Investment and Jobs Act, as well as other legislation and executive orders related to governmental spending, including any directive to federal agencies to reduce federal spending or the size of the federal workforce, and changes in U.S. or foreign tax laws, including the OBBBA, statutes, rules, regulations or ordinances, including the impact of, and \nPage 32\nchanges to, tariffs and retaliatory tariffs or trade policies that may adversely impact our future financial position or results of operations; \n•\nincreased geopolitical uncertainty and risks, including policy risks and potential civil unrest, relating to the outcome of elections across our key markets and elevated geopolitical tension and conflicts, including the Russia-Ukraine and Israel-Hamas conflicts and the escalating tensions in the Middle East, among others; and\n•\nthe impact of any pandemic, and any resulting economic downturn on our results, prospects and opportunities, measures or restrictions imposed by governments and health officials in response to the pandemic, as well as the inability of governments in certain of the countries in which we operate to effectively mitigate the financial or other impacts of any future pandemics or infectious disease outbreaks on their economies and workforces and our operations therein.\nThe foregoing factors and potential future developments are inherently uncertain, unpredictable and, in many cases, beyond our control. For a description of these and additional factors that may occur that could cause actual results to differ from our forward-looking statements, see the Company’s filings with the U.S. Securities and Exchange Commission, including in particular the discussions contained in our fiscal 2024 Form 10-K under Item 1 - Business, Item 1A - Risk Factors, Item 3 - Legal Proceedings, and Item 7 - Management's Discussion and Analysis of Financial Condition and Results of Operations; and in this Quarterly Report on Form 10-Q under Part I, Item 2 - Management's Discussion and Analysis of Financial Condition and Results of Operations, and Part II, Item 1 - Legal Proceedings and Item 1A - Risk Factors. We undertake no obligation to release publicly any revisions or updates to any forward-looking statements. We encourage you to read carefully the risk factors, as well as the financial and business disclosures contained in this Quarterly Report on Form 10-Q and in other documents we file from time to time with the United States Securities and Exchange Commission (the \"SEC\").\nBusiness Overview\nAt Jacobs, our values and our brand promise — \nChallenging today\n. \nReinventing tomorrow\n — drive us to deliver innovative solutions and sustainable outcomes for the world’s most complex challenges. \nWith a global team of almost 45,000\n, \nwe provide end-to-end services across advanced manufacturing, cities & places, energy, environmental, life sciences, transportation and water markets. From advisory and consulting to feasibility, planning, design, program and lifecycle management, we help create a more connected and sustainable world.\nWe address critical global issues — from water scarcity and aging infrastructure to access to life-saving therapies and cyber resilience — by channeling our creativity, agility and domain expertise to deliver value for our clients and society.\nOver the past seven years, Jacobs has transformed into \na science-based consulting and advisory leader\n, focused on delivering resilient, digitally enabled solutions for some of the world’s most complex sustainability, critical infrastructure and advanced manufacturing challenges. Strategic acquisitions — including a 65% stake in PA Consulting Group Limited (\"PA Consulting\"), as well as BlackLynx and StreetLight — have strengthened our capabilities in high-value critical infrastructure and technology-enabled solutions.\nIn February 2025, we announced our multi-year growth strategy, Challenge Accepted, accelerating our evolution into a more focused, high-performing business. Aligned with our long-term financial framework, this strategy positions us to drive profitable growth and deliver scalable, end-to-end solutions across Water and Environmental, Life Sciences and Advanced Manufacturing, and Critical Infrastructure.\nAs global challenges like urbanization, infrastructure modernization, digital evolution and environmental resilience grow more complex, our integrated delivery model brings together the full strength of our capabilities across all our markets. This synergy enables us to deliver rapid, large-scale outcomes meeting evolving client needs and advancing our mission to build a more resilient, sustainable future.\nPage 33\nData and Digital Solutions\nWe harness our data and digital capabilities, products and tools to help clients operate more efficiently, safely and intelligently. We invest in cutting-edge digital, data and AI solutions that empower our clients' decision-making across the entire asset lifecycle — from capital planning and operations to cybersecurity and operational technology. Our solutions span data analytics and insights, digital architecture, advisory and transformation, software development, and cybersecurity and operational technology.\nThese capabilities drive greater efficiency, resilience and sustainability — enabling clients to unlock the value of their data and digital infrastructure.\nConsulting and Advisory\nThrough our strategic partnership with PA Consulting, we are expanding our position in high-end advisory services and deploying our collective strengths to create significant opportunities for our clients to adapt, innovate and transform. Together, we deliver end-to-end support across the full project lifecycle, from early-stage strategy to implementation. Our collaborative approach enables clients to tackle complex challenges, accelerate sustainable growth and shape a smarter, more resilient future.\nOperating Segments\nThe services we provide to our markets fall into the following two operating segments: 1) Infrastructure & Advanced Facilities and 2) our majority investment in PA Consulting. For additional information regarding our segments, including information about our financial results by segment and financial results by geography, see Note 19- \nSegment Information \nand Note 5- \nRevenue Accounting for Contracts\n of Notes to Consolidated Financial Statements.\nInfrastructure & Advanced Facilities (I&AF)\nJacobs' Infrastructure & Advanced Facilities line of business provides end-to-end solutions for our clients’ most complex challenges related to energy security, environmental resilience, safe and reliable transportation, buildings and infrastructure, integrated water management and biopharmaceutical manufacturing. In doing so, we combine deep experience in Water & Environmental, Life Sciences & Advanced Manufacturing and Critical Infrastructure. Our core skills revolve around consulting, planning, architecture, design, engineering, infrastructure delivery services including project, program and construction management and long-term operation of facilities. Solutions are delivered as standalone professional service engagements, comprehensive program management partnerships, and selective progressive design-build and construction management at-risk delivery services. Increasingly, we use data science and technology-enabled expertise to deliver positive and enduring outcomes for our clients and communities\n.\nWe serve national, state and local government clients across multiple regions — including the U.S., U.K., Europe, the Middle East and Asia Pacific — and multinational and local private sector organizations globally.\nPA Consulting\nJacobs invested in a 65% stake in PA Consulting, the global innovation and transformation consultancy. PA Consulting accelerates new growth ideas from concept, through design and development and to commercial success, and revitalizes organizations, building leadership, culture, systems and processes to make innovation a reality. PA Consulting's global team of about 4,000, which includes strategists, innovators, designers, consultants, digital experts, scientists, engineers and technologists, work across seven sectors: consumer and manufacturing, defense and security, energy and utilities, financial services, government, health and life sciences, and transport to make a positive impact alongside the clients it supports, bringing ingenuity to life. \nPage 34\nPA Consulting has a diverse mix of private and public sector clients. Private sector clients include global household names like Diageo, Microsoft, Pret A Manger and Unilever, and start-ups like NTx, which is accelerating access to life-changing therapies. PA's work includes applying data and analytics to improve punctuality of flights at Heathrow Airport, accelerating the energy transition with Invenergy and energyRe, creating new digital platforms for the American College of Emergency Physicians, pioneering medtech with Hubly Surgical, accelerating clinical trials with AI for a global life sciences consortium, and enhancing resiliency in banking with Bankomat. Public sector clients include the U.K.'s Ministry of Defence, National Highways, The Norwegian Labour and Welfare Administration, The Danish Tax Agency and The Swedish Environmental Protection Agency.\nCollectively, the Company also deploys the combined strengths of Jacobs and PA Consulting to unlock significant opportunities for our clients worldwide. In the U.S., we are working with Dallas Fort Worth International Airport to drive operational efficiencies through the use of AI as part of their digital transformation initiative. We're also contributing to the Frederick Douglass Tunnel program — one of the nation's largest transportation infrastructure investments. In England, we provide engineering, technical advice and innovation services to National Highways. We’re building an AI blueprint for Hertfordshire County Council, one of England’s largest councils. We're also delivering technical project management for the U.K. Department for Energy Security & Net Zero’s Carbon Capture, Usage and Storage program, a cornerstone of the U.K.’s net-zero ambitions.\nSeparation of Critical Mission Solutions (CMS) and Cyber & Intelligence (C&I)\nOn September 27, 2024, Jacobs Solutions Inc. (\"Jacobs\") completed the previously announced Reverse Morris Trust transaction pursuant to which (i) Jacobs first transferred its Critical Mission Solutions business (“CMS”) and portions of the Divergent Solutions (“DVS”) business (referred to herein as the Cyber & Intelligence business (“C&I”) and together with CMS referred to as the “SpinCo Business”), to Amazon Holdco Inc., a Delaware corporation, which has been renamed Amentum Holdings, Inc. (“SpinCo”) (the “Separation”), (ii) Jacobs then effectuated a spin-off of SpinCo by distributing 124,084,108 shares of SpinCo common stock, par value $0.01 per share (the “SpinCo Common Stock”), by way of a pro rata distribution to its shareholders such that each holder of shares of Jacobs common stock, par value $1.00 per share (the “Jacobs Common Stock”) was entitled to receive one share of SpinCo Common Stock for each share of Jacobs Common Stock held as of the record date, September 23, 2024 (the “Distribution”), and (iii) finally, Amentum Parent Holdings LLC merged with and into SpinCo, with SpinCo surviving the merger (the “Merger” and together with the Separation and the Distribution, the “Separation Transaction”). The surviving entity of the Separation Transaction is now an independent public company with common stock listed on the New York Stock Exchange under the symbol “AMTM” (“Amentum”). \nAs a result of the Separation Transaction, substantially all SpinCo Business-related assets and liabilities have been separated and distributed (the \"Disposal Group\"). The Company determined that the Disposal Group should be reported as discontinued operations in accordance with ASC 205-20, \nDiscontinued Operations\n because their disposal represents a strategic shift that had a major effect on operations and financial results. As such, the financial results of the SpinCo Business are reflected in our Consolidated Statements of Earnings as discontinued operations for all periods presented. No amounts remained held for spin at the end of fiscal 2024. See Note 15- \nDiscontinued Operations\n.\nPrior to the Separation Transaction, Jacobs’ Critical Mission Solutions line of business provided a full spectrum of solutions for clients to address evolving challenges like digital transformation and modernization, national security and defense, space exploration, digital asset management, the clean energy transition, and nuclear decommissioning and cleanup. Clients included government agencies, as well as private sector clients mainly in the aerospace, automotive,\n \nmotorsports, energy and telecom sectors. Prior to the Separation Transaction, the DVS business unit served as the core foundation for developing and delivering innovative, next-generation cloud, cyber, data and digital technologies. DVS clients included government agencies and commercial clients in the U.S. and international markets. Certain portions of the DVS business were retained and are now part of I&AF, which include advising digital strategy and transformation and developing digital solutions that facilitate capital, operational and cybersecurity decisions for our clients across our segments and their markets.\nPage 35\nResults of Operations for the three and nine months ended June 27, 2025 and June 28, 2024\n(in thousands, except per share information)\nFor the Three Months Ended\nFor the Nine Months Ended\nJune 27, 2025\nJune 28, 2024\nJune 27, 2025\nJune 28, 2024\nRevenues\n$\n3,031,768 \n$\n2,883,384 \n$\n8,875,139 \n$\n8,540,791 \nDirect cost of contracts\n(2,273,358)\n(2,162,442)\n(6,657,118)\n(6,443,156)\nGross profit\n758,410 \n720,942 \n2,218,021 \n2,097,635 \nSelling, general and administrative expenses\n(523,396)\n(549,956)\n(1,565,942)\n(1,601,404)\nOperating Profit \n235,014 \n170,986 \n652,079 \n496,231 \nOther Income (Expense):\nInterest income\n8,297 \n9,718 \n27,478 \n25,939 \nInterest expense\n(37,051)\n(45,789)\n(110,451)\n(133,372)\nLoss on extinguishment of debt\n— \n— \n(20,510)\n— \nMiscellaneous income (expense), net\n38,844 \n1,550 \n(194,523)\n(5,118)\nTotal other income (expense), net \n10,090 \n(34,521)\n(298,006)\n(112,551)\nEarnings from Continuing Operations Before Taxes\n245,104 \n136,465 \n354,073 \n383,680 \nIncome Tax Expense from Continuing Operations\n(53,752)\n(45,272)\n(161,477)\n(57,026)\nNet Earnings of the Group from Continuing Operations\n191,352 \n91,193 \n192,596 \n326,654 \nNet (Loss) Earnings of the Group from Discontinued Operations, net of tax\n(1,629)\n67,703 \n(8,180)\n187,232 \nNet Earnings of the Group\n189,723 \n158,896 \n184,416 \n513,886 \nNet (Earnings) Loss Attributable to Noncontrolling Interests from Continuing Operations\n(4,442)\n(4,858)\n1,209 \n(13,037)\nNet Earnings Attributable to Redeemable Noncontrolling Interests\n(5,676)\n(3,411)\n(18,539)\n(10,112)\nNet Earnings Attributable to Jacobs from Continuing Operations\n181,234 \n82,924 \n175,266 \n303,505 \nNet Earnings Attributable to Noncontrolling Interests from Discontinued Operations\n— \n(3,693)\n— \n(10,080)\nNet (Loss) Earnings Attributable to Jacobs from Discontinued Operations\n(1,629)\n64,010 \n(8,180)\n177,152 \nNet Earnings Attributable to Jacobs\n$\n179,605 \n$\n146,934 \n$\n167,086 \n$\n480,657 \nNet Earnings Per Share:\nBasic Net Earnings from Continuing Operations Per Share\n$\n1.56 \n$\n0.66 \n$\n1.54 \n$\n2.43 \nBasic Net (Loss) Earnings from Discontinued Operations Per Share\n$\n(0.01)\n$\n0.51 \n$\n(0.07)\n$\n1.41 \nBasic Earnings Per Share\n$\n1.55 \n$\n1.17 \n$\n1.47 \n$\n3.84 \nDiluted Net Earnings from Continuing Operations Per Share\n$\n1.56 \n$\n0.66 \n$\n1.53 \n$\n2.42 \nDiluted Net (Loss) Earnings from Discontinued Operations Per Share\n$\n(0.01)\n$\n0.51 \n$\n(0.07)\n$\n1.40 \nDiluted Earnings Per Share\n$\n1.55 \n$\n1.17 \n$\n1.46 \n$\n3.82 \nPage 36\nOverview – Three and Nine Month Periods Ended June 27, 2025\nNet earnings attributable to the Company from continuing operations for the third fiscal quarter of 2025 were $181.2 million (or $1.56 per diluted share), an increase of $98.3 million, from net earnings of $82.9 million (or $0.66 per diluted share) for the corresponding period last year. Gross profit increased by $37.5 million for the third fiscal quarter of 2025 compared to the fiscal 2024 period primarily driven by stronger performance in our I&AF operating segment, specifically in the Europe, Energy & Power and Americas businesses, as well as growth in our PA Consulting business. Reported net earnings for the third fiscal quarter of 2025 were also favorably impacted by a decrease in pre-tax Restructuring and other charges and transaction costs of $28.7 million reported in Selling, general & administrative (\"SG&A\") expenses compared to the fiscal 2024 period associated with expenses incurred relating to the Separation Transaction (mainly professional services and employee separation costs), as well as favorable comparative results in Other income (expense), net for the current quarter of $44.6 million, offset by higher income tax expense of $8.5 million year over year for the third fiscal quarter of 2025. Included in the Company’s Other income (expense), net for the third fiscal quarter of 2025 were $27.4 million in pre-tax fair value gains associated with our investment in Amentum stock after finalization of the Separation Transaction, as well as $9.8 million in income from the Transition Services Agreement (the \"TSA\") with Amentum associated with the Separation Transaction (see Note 15- \nDiscontinued Operations\n) and comparatively lower year over year net interest expense of $7.3 million.\nNet loss attributable to the Company from discontinued operations for the third fiscal quarter of 2025 was $(1.6) million (or $(0.01) per diluted share), a decrease of $65.6 million, from net earnings of $64.0 million (or $0.51 per diluted share) for the corresponding period last year. The change year-over-year was primarily driven by prior year operating results of the SpinCo Business which were divested on September 27, 2024 and therefore are no longer in Company's financial results in fiscal year 2025. See Note 15- \nDiscontinued Operations.\nFor the nine months ended June 27, 2025, net earnings attributable to the Company from continuing operations was $175.3 million (or $1.53 per diluted share), a decrease of $128.2 million, from net earnings of $303.5 million (or $2.42 per diluted share) for the corresponding period last year. Our reported net earnings for the nine months ended June 27, 2025 were favorably impacted by higher gross profit of $120.4 million year over year primarily driven by stronger performance in our I&AF operating segment, specifically in the Advanced Facilities, Europe and Asia, Pacific and Middle East (APME) businesses, as well as growth in our PA Consulting business and a decrease in pre-tax Restructuring and other charges and transaction costs of $73.1 million reported in SG&A expenses associated with expenses incurred relating to the Separation Transaction (mainly professional services and employee separation costs), which are discussed in Note 17- \nRestructuring and Other Charges, \noffset in part by $20.9 million in SG&A expenses associated with the TSA with Amentum and year over year increases in underlying personnel costs and other department spend. While current year results reflected higher year-over-year underlying operating profit, the Company’s results from continuing operations for the nine months ended June 27, 2025 were impacted by unfavorable reductions in Other income (expense), net of $185.5 million and higher income tax expense of $104.5 million, with the unfavorable impacts in Other income (expense), net due mainly to $227.3 million in pre-tax fair value losses and other related expenses relating to our investment in Amentum stock in connection with the Separation Transaction and $20.5 million in discounts and expenses recorded to loss on extinguishment of debt associated with our Equity-for-Debt Transaction on March 13, 2025 (see Note 12- \nBorrowings\n and Note 15- \nDiscontinued Operations)\n, offset in part by comparatively lower net interest expense of $24.5 million for the nine months ended June 27, 2025 and $31.5 million of TSA-related income.\nFor the nine months ended June 27, 2025, net loss attributable to the Company from discontinued operations was $(8.2) million (or $(0.07) per diluted share), a decrease of $185.3 million, from net earnings of $177.2 million (or $1.40 per diluted share) for the corresponding period last year. The change year-over-year was primarily driven by prior year operating results of the SpinCo Business which were divested and therefore are no longer in the Company's financial results in fiscal year 2025. See Note 15- \nDiscontinued Operations.\nConsolidated Results of Operations\nRevenues for the third fiscal quarter of 2025 were $3.03 billion, an increase of $148.4 million, or 5.1%, from $2.88 billion for the corresponding period last year. For the nine months ended June 27, 2025, revenues were $8.88 billion, an increase of $334.3 million, or 3.9%, from $8.54 billion for the corresponding period last year. Revenue increases for both the three and nine month periods year over year were mainly due to the Company's I&AF business, as well as revenue growth in our PA Consulting business. The I&AF business benefited primarily from stronger performance in its Advanced Facilities, APME and Americas business operations for both quarterly and year to date comparative periods presented. Our revenues were favorably impacted by foreign currency translation of $37.2 million and $34.8 million for \nPage 37\nthe three and nine months ended June 27, 2025, respectively, across our international businesses, as compared to an unfavorable impact of $0.8 million and favorable impact of $58.2 million for the three and nine months ended June 28, 2024, respectively.\nGross profit for the third fiscal quarter of 2025 was $758.4 million, an increase of $37.5 million, or 5.2%, from $720.9 million for the corresponding period last year, with gross profit margins of 25.0% for both periods. Gross profit for the nine months ended June 27, 2025 was $2,218.0 million, an increase of $120.4 million, or 5.7%, from $2,097.6 million for the corresponding period last year, with gross profit margins of 25.0% and 24.6% for the respective periods. The Company's increase in gross profit was mainly attributable to higher revenues as mentioned above, with favorable margin impacts from year over year project mix primarily in the nine month period.\nSee \nSegment Financial Information\n discussion for further information on the Company’s results of operations at the operating segment.\nSelling, general & administrative expenses for the three and nine months ended June 27, 2025 were $523.4 million and $1,565.9 million, respectively, as compared to $550.0 million and $1,601.4 million for the corresponding periods last year, representing a decrease of $26.6 million or 4.8% and $35.5 million or 2.2%, respectively. SG&A expenses for the three and nine months ended June 27, 2025 were impacted by decreases of $28.7 million and $73.1 million, respectively, in Restructuring and other charges costs associated with the Separation Transaction, mainly comprised of professional services, compared to the prior year. These favorable items were partially offset by expenses associated with the TSA with Amentum of $4.7 million and $20.9 million in the three and nine months ended June 27, 2025, respectively. SG&A expenses for the nine months ended June 27, 2025 were further unfavorably impacted by an increase of $7.8 million in expenses associated with IT related software licensing and other costs as well as year over year increases in underlying personnel costs and other department spend. Lastly, SG&A expenses included unfavorable foreign exchange impacts of $6.2 million and $4.5 million, respectively, for the three and nine months ended June 27, 2025, as compared to favorable impacts of $2.6 million and unfavorable impacts of $0.3 million, respectively, for the corresponding periods last year.\nNet interest expense for the three and nine months ended June 27, 2025 was $28.8 million and $83.0 million, respectively, a decrease of $7.3 million and $24.5 million from $36.1 million and $107.4 million, or 20.3% and 22.8%, respectively, for the corresponding periods last year. The decrease in net interest expense for the three and nine months ended June 27, 2025 was primarily due to a decrease in interest expense driven by lower outstanding debt balances, as proceeds associated with the Separation Transaction were used for the repayment of debt in both the fourth quarter of fiscal 2024 and in the current quarter.\nLoss on extinguishment of debt for the nine months ended June 27, 2025 was $20.5 million, which includes discounts and expenses associated with the Equity-for-Debt Transaction executed on March 13, 2025, where the Company exchanged shares of our investment in Amentum Holdings, Inc. for a principal amount of term loans under the 2021 Term Loan Facility, which term loans were immediately extinguished. See Note 12- \nBorrowings\n and Note 15- \nDiscontinued Operations.\nMiscellaneous income (expense) net for the three and nine months ended June 27, 2025 was $38.8 million and $(194.5) million, respectively, in comparison to $1.6 million and $(5.1) million for the corresponding periods last year. The increase of $37.3 million and decrease of $(189.4) million for the three and nine months ended June 27, 2025, respectively, were mainly due to $27.4 million and $(227.3) million in mark-to-market gains (losses) and other related expenses associated with our investment in Amentum stock in connection with the Separation Transaction. Miscellaneous income (expense) net was also favorably impacted by $9.8 million and $31.5 million in TSA-related income associated with the Separation Transaction as discussed in Note 15- \nDiscontinued Operations\n.\nThe Company’s effective tax rates from continuing operations for the three months ended June 27, 2025 and June 28, 2024 were 21.9% and 33.2%, respectively. Significant items contributing to differences between the statutory U.S. federal corporate tax rate of 21.0% and the Company's effective tax rate for the three-month period ended June 27, 2025 were U.S. state income tax expense and U.S. tax on foreign earnings. These expense items were offset by a return-to-provision income tax benefit, mainly attributable to additional research and development credits claimed on the U.S. federal tax return. The U.S state income tax and U.S. tax on foreign earnings are expected to have a continuing impact on the Company's effective tax rate for the remainder of the fiscal year.\nPage 38\nThe most significant items contributing to the difference between the statutory U.S. federal corporate tax rate of 21.0% and the Company's effective tax rate of 33.2% for the three-month period ended June 28, 2024 were related to U.S. state income tax expense, U.S. tax on foreign earnings and income tax expense related to foreign exchange gains associated with change in assertion on intercompany loans that were previously indefinitely reinvested. These expense items were partly offset by a return-to-provision income tax benefit, mainly attributable to additional research and development credits claimed on the U.S. federal tax return.\nThe Company’s effective tax rates from continuing operations for the \nnine months ended\n \nJune 27, 2025\n and \nJune 28, 2024\n were \n45.6%\n and \n14.9%\n, respectively. The most significant items contributing to the difference between the statutory U.S. federal corporate tax rate of \n21.0%\n and the Company's effective tax rate for the nine-month period ended \nJune 27, 2025\n were related to \n$63.1 million\n in unfavorable tax impacts associated with the non-deductibility of losses from the Company's investment in Amentum stock, as well as U.S. state income tax expense and U.S. tax on foreign earnings. These expense items were partly offset by a return-to-provision income tax benefit mainly attributable to additional research and development credits claimed on the U.S. federal tax return. The U.S state income tax and U.S. tax on foreign earnings are expected to have a continuing impact on the Company's effective tax rate for the remainder of the fiscal year.\nThe most significant item contributing to the difference between the statutory U.S. federal corporate tax rate of 21.0% and the Company's effective tax rate of 14.9% for the nine-month period ended June 28, 2024 were related to the election to treat an Australian subsidiary as a corporation versus a partnership for U.S. tax purposes, which resulted in the derecognition of a deferred tax liability and yielded a discrete income tax benefit of $61.6 million as the Company asserted that a component of the investment will be indefinitely reinvested. This benefit was partly offset by U.S. state income tax expense, U.S. tax on foreign earnings and income tax related to foreign exchange gains associated with change in assertion on intercompany loans that were previously indefinitely reinvested.\nNet (earnings) loss attributable to noncontrolling interests from continuing operations for the three and nine months ended June 27, 2025 were $(4.4) million and $1.2 million, respectively, as compared to $(4.9) million and $(13.0) million for the corresponding periods last year. The change in noncontrolling interests for the nine months ended June 27, 2025 primarily resulted from the impact of an unfavorable interim ruling against a consolidated joint venture in which the Company holds a 50% interest, in connection with a long running project, upon which the Company recorded a reserve against related accounts receivable (the “Consolidated JV Matter”) during the second fiscal quarter of 2025.\nNet earnings attributable to redeemable noncontrolling interests for the three and nine months ended June 27, 2025 were $(5.7) million and $(18.5) million, respectively, and $(3.4) million and $(10.1) million for the corresponding periods last year, with these comparative changes resulting from higher net earnings results in our PA Consulting investment compared to the prior year periods.\nRestructuring and Other Charges\nDuring fiscal 2023, the Company implemented restructuring initiatives relating to the Separation Transaction. The Company incurred approximately $20.5 million during the nine months ended June 27, 2025 and $42.0 million, and $17.5 million in fiscal 2024 and fiscal 2023, respectively, in pre-tax cash charges in connection with these initiatives. These actions, which are expected to be substantially completed by the end of calendar year 2025, are expected to result in estimated gross annualized pre-tax cash savings of approximately $155 million to $190 million. We will likely incur additional charges under this program through the end of calendar year 2025, which are expected to result in additional savings in future periods.\nDuring third quarter fiscal 2023, the Company approved a plan to improve business processes and cost structures of our PA Consulting investment by reorganizing senior management and reducing headcount. In connection with these initiatives, which are substantially completed, the Company incurred approximately $6.4 million and $14.3 million in fiscal 2024 and fiscal 2023, respectively, in pre-tax cash charges. These activities are expected to result in estimated gross annualized pre-tax cash savings of approximately $50 million to $65 million.\nRefer to Note 17– \nRestructuring and Other Charges\n for further information regarding restructuring and integration initiatives. \nPage 39\nSegment Financial Information\nThe following tables provide selected financial information for our operating segments and includes a reconciliation of segment operating profit to total U.S. GAAP operating profit from continuing operations by including certain corporate-level expenses, Restructuring and other charges and transaction and integration costs (in thousands).\nThree Months Ended\nNine Months Ended\nJune 27, 2025\nJune 28, 2024\nJune 27, 2025\nJune 28, 2024\nRevenues from External Customers:\nInfrastructure & Advanced Facilities (1)\n$\n2,699,062 \n$\n2,595,113 \n$\n7,928,023 \n$\n7,652,552 \nPA Consulting\n332,706 \n288,271 \n947,116 \n888,239 \nTotal\n$\n3,031,768 \n$\n2,883,384 \n$\n8,875,139 \n$\n8,540,791 \nThree Months Ended\nNine Months Ended\nJune 27, 2025\nJune 28, 2024\nJune 27, 2025\nJune 28, 2024\nSegment Operating Profit:\nInfrastructure & Advanced Facilities (1)\n$\n235,975 \n$\n208,171 \n$\n649,514 \n$\n579,659 \nPA Consulting\n72,418 \n62,889 \n206,502 \n177,513 \nTotal Segment Operating Profit\n308,393 \n271,060 \n856,016 \n757,172 \nRestructuring, Transaction and Other Charges (2)\n(34,134)\n(61,762)\n(87,991)\n(147,223)\nAmortization of Intangible Assets\n(39,245)\n(38,312)\n(115,946)\n(113,718)\nTotal U.S. GAAP Operating Profit \n235,014 \n170,986 \n652,079 \n496,231 \nTotal Other Income (Expense), net (3)\n10,090 \n(34,521)\n(298,006)\n(112,551)\nEarnings Before Taxes from Continuing Operations\n$\n245,104 \n$\n136,465 \n$\n354,073 \n$\n383,680 \n(1)\nThe nine months ended June 27, 2025 I&AF revenue and operating profit were impacted by a reserve in connection with an unfavorable interim ruling against a consolidated joint venture in which the Company holds a 50% interest (the \"Consolidated JV Matter\"), with the noncontrolling partner’s share included in noncontrolling interests in the Consolidated Statements of Earnings for the respective period.\n(2)\nThe three and nine months ended June 27, 2025 and June 28, 2024 included $22.0 million and $47.1 million, respectively, and $50.8 million and $120.3 million, respectively, in restructuring and other charges relating to the Separation Transaction (primarily professional services and employee separation costs), as well as certain subsidiary level compensation based agreements. The three and nine months ended June 27, 2025 included approximately $4.7 million and $20.9 million, respectively, in charges associated with the Company's TSA with Amentum.\n(3)\nThe three and nine months ended June 27, 2025 included gains of $27.4 million and losses of $227.3 million, respectively, mainly related to mark-to-market adjustments and other related charges associated with our investment in Amentum stock in connection with the Separation Transaction, as well as $9.8 million and $31.5 million, respectively, in income associated with the Company's TSA with Amentum (see Note 15- Discontinued Operations). The nine months ended June 27, 2025 included $20.5 million in discounts and expenses associated with the Equity-for-Debt Transaction (see Note 12- Borrowings and Note 15- Discontinued Operations).\nPage 40\nInfrastructure & Advanced Facilities\nThree Months Ended\nNine Months Ended\n(in thousands)\nJune 27, 2025\nJune 28, 2024\nJune 27, 2025\nJune 28, 2024\nRevenue\n$\n2,699,062 \n$\n2,595,113 \n$\n7,928,023 \n$\n7,652,552 \nOperating Profit\n$\n235,975 \n$\n208,171 \n$\n649,514 \n$\n579,659 \nRevenues for the I&AF segment for the three and nine months ended June 27, 2025 were $2.70 billion and $7.93 billion, respectively, an increase of $103.9 million and $275.5 million, or 4.0% and 3.6%, compared to $2.60 billion and $7.65 billion for the corresponding periods last year. The increase in revenues for the three and nine months ended June 27, 2025 was driven primarily from stronger performance in its Advanced Facilities, Americas and APME business operations. This was partly offset by a reserve recorded in second quarter fiscal 2025 associated with an unfavorable interim ruling against a consolidated joint venture in which the Company holds a 50% interest, with the noncontrolling partner’s share included in noncontrolling interests in the Company's Consolidated Statements of Earnings for the nine months ended June 27, 2025. Additionally, foreign currency translation had approximately $18.9 million and $8.3 million in favorable impacts on revenues for the three and nine months ended June 27, 2025, respectively, as compared to $3.1 million in unfavorable and $26.9 million in favorable impacts in the corresponding prior year periods.\nOperating profit for the I&AF segment for the three and nine months ended June 27, 2025 was $236.0 million and $649.5 million, respectively, an increase of $27.8 million and $69.9 million, or 13.4% and 12.1%, from $208.2 million and $579.7 million for the corresponding periods last year. The increase for the three and nine months ended June 27, 2025 was a result of higher year over year segment revenues mentioned above, along with increased margin quality associated with higher volume year over year as well as favorable impacts from project mix. Higher operating profit in the nine months ended June 27, 2025 compared to prior year was partially offset by a reserve recorded in second quarter fiscal 2025 associated with an unfavorable interim ruling against a consolidated joint venture in which the Company holds a 50% interest, with the noncontrolling partner's share included in noncontrolling interests in the Company's Consolidated Statements of Earnings for the nine months ended June 27, 2025. Foreign currency translation had approximately $2.7 million and $2.0 million in favorable impacts on operating profit for three and nine months ended June 27, 2025, respectively, as compared to $0.2 million and $9.5 million in favorable impacts in the corresponding prior year periods.\nPA Consulting\nThree Months Ended\nNine Months Ended\n(in thousands)\nJune 27, 2025\nJune 28, 2024\nJune 27, 2025\nJune 28, 2024\nRevenue\n$\n332,706 \n$\n288,271 \n$\n947,116 \n$\n888,239 \nOperating Profit\n$\n72,418 \n$\n62,889 \n$\n206,502 \n$\n177,513 \nRevenues for the PA Consulting segment for the three and nine months ended June 27, 2025 were $332.7 million and $947.1 million, respectively, reflecting an increase of $44.4 million and $58.9 million, or 15.4% and 6.6% from $288.3 million and $888.2 million in the corresponding period last year. The increase in revenue for the three months ended June 27, 2025 was primarily driven by improved performance in public sector work (through the defence and security and public services sectors), partly offset by reductions in consumer & manufacturing and financial services. The nine month increase was mainly due to improved performance in PA Consulting's health & life sciences business, partly offset by reductions in consumer & manufacturing and financial services businesses. Foreign currency translation had approximately $18.2 million and $26.6 million in favorable impacts on revenues for the three and nine months ended June 27, 2025, respectively, as compared to $2.3 million and $31.4 million in favorable impacts in the corresponding prior year period.\nOperating profit for the segment for the three and nine months ended was $72.4 million and $206.5 million, respectively, an increase of $9.5 million and $29.0 million, or 15.2% and 16.3% from $62.9 million and $177.5 million in the corresponding period last year. The year over year increases were mainly attributable to improved revenues as mentioned above, combined with favorable impacts from reduced costs.\n    \nPage 41\nBacklog Information\nBacklog represents revenue we expect to realize for work to be completed by our consolidated subsidiaries and our proportionate share of work to be performed by unconsolidated joint ventures. Because of variations in the nature, size, expected duration, funding commitments, and the scope of services required by our contracts, the amount and timing of when backlog will be recognized as revenues includes significant estimates and can vary greatly between individual contracts. \nConsistent with industry practice, substantially all of our contracts are subject to cancellation or termination at the option of the client, including our U.S. government work. While management uses all information available to determine backlog, at any given time our backlog is subject to changes in the scope of services to be provided as well as increases or decreases in costs relating to the contracts included therein. Backlog is not necessarily an indicator of future revenues.\nBecause certain contracts (e.g., contracts relating to large engineering, procurement & construction projects as well as national government programs) can cause large increases to backlog in the fiscal period in which we recognize the award, and because many of our contracts require us to provide services that span over several fiscal quarters (and sometimes over fiscal years), we have presented our backlog on a year-over-year basis, rather than on a sequential, quarter-over-quarter basis.\nThe following table summarizes our backlog at June 27, 2025 and June 28, 2024 (in millions):\nJune 27, 2025\nJune 28, 2024\nInfrastructure & Advanced Facilities\n$\n22,270 \n$\n19,489 \nPA Consulting\n420 \n369 \n            Total\n$\n22,690 \n$\n19,858 \nThe increase in backlog in I&AF from June 28, 2024 was predominantly driven by growth across Water, Advanced Manufacturing and Transportation markets.\nThe increase in backlog in PA Consulting from June 28, 2024 was primarily driven by organic year-over-year growth of the business including some material sales in the third fiscal quarter of 2025.\nConsolidated backlog differs from the Company’s remaining performance obligations as defined by ASC 606 primarily because of contract change orders or new wins not yet processed and our national government contracts where our policy is to generally include in backlog the contract award, whether funded or unfunded excluding certain option periods while our remaining performance obligations represent a measure of the total dollar value of work to be performed on contracts awarded and in progress. Additionally, the Company does not include our proportionate share of backlog related to unconsolidated joint ventures in our remaining performance obligations.\nLiquidity and Capital Resources\nAt June 27, 2025, our principal sources of liquidity consisted of $1.29 billion in cash and cash equivalents and $1.59 billion of available borrowing capacity under our $2.25 billion revolving credit agreement (the \"Revolving Credit Facility\"). See Note \n12 - Borrowings \nfor more information. We finance much of our operations and growth through cash generated by our operations.\nPage 42\nCash and cash equivalents at June 27, 2025 were $1.29 billion, representing an increase of $148.5 million from $1.14 billion at September 27, 2024, the reasons for which are described below. The following table presents selected consolidated cash flow information of the Company for the respective periods shown below (including discontinued operations of our separated SpinCo Business, see Note 15 - \nDiscontinued Operations \nfor more information):\nFor the Nine Months Ended\n(In thousands)\nJune 27, 2025\nJune 28, 2024\n          Net cash provided by operating activities\n$\n303,619 \n$\n858,141 \nCash Flows from Investing Activities:\nAdditions to property and equipment\n(49,655)\n(82,772)\nDisposals of property and equipment and other assets\n2,332 \n158 \nCapital contributions to equity investees, net of return of capital distributions\n932 \n1,660 \nAcquisitions of businesses, net of cash acquired\n— \n(14,000)\n          Net cash used for investing activities\n(46,391)\n(94,954)\nCash Flows from Financing Activities:\nProceeds from long-term borrowings\n2,173,201 \n2,224,577 \nRepayments of long-term borrowings\n(926,800)\n(2,194,423)\nProceeds from short-term borrowings\n— \n1,106 \nRepayments of short-term borrowings\n(656,981)\n(31,882)\nDebt issuance costs\n(92)\n(1,606)\nProceeds from issuances of common stock\n25,467 \n35,414 \nCommon stock repurchases\n(653,247)\n(346,382)\nTaxes paid on vested restricted stock\n(26,992)\n(33,389)\nCash dividends to shareholders\n(114,813)\n(106,439)\nNet dividends associated with noncontrolling interests\n(7,440)\n(17,516)\nRepurchase of redeemable noncontrolling interests\n(8,472)\n(41,788)\nProceeds from issuances of redeemable noncontrolling interests \n— \n19,761 \nCash Impact from Distribution of SpinCo Business\n70,000 \n— \n            Net cash used for financing activities\n(126,169)\n(492,567)\nEffect of Exchange Rate Changes\n17,990 \n12,215 \nNet Increase in Cash and Cash Equivalents and Restricted Cash\n149,049 \n282,835 \nCash and Cash Equivalents, including Restricted Cash, at the Beginning of the Period\n1,146,931 \n929,445 \nCash and Cash Equivalents, including Restricted Cash, at the End of the Period\n$\n1,295,980 \n$\n1,212,280 \nLess Cash and Cash Equivalents included in Assets held for spin\n$\n— \n$\n(195,915)\nCash and Cash Equivalents, including Restricted Cash of Continuing Operations at the End of the Period \n$\n1,295,980 \n$\n1,016,365 \nOur net cash flow provided by operations of $303.6 million during the nine months ended June 27, 2025 was unfavorable by $554.5 million in comparison to the cash flow provided by operations of $858.1 million in the corresponding prior year period (which included discontinued operations of the separated SpinCo Business). On a continuing operations basis, our cash from operations was unfavorable by $266.0 million compared to the prior year period. The decline on a continuing operations basis was largely due to higher uses of cash from net working capital, namely accounts receivables, as well as increases in cash income tax payments of $82.0 million within accrued liabilities, offset by a year-over-year improvement in net earnings from continuing operations after adjustments to reconcile net earnings from continuing operations to net cash flows provided by operations on a continuing operations basis.\nOur net cash used for investing activities during the nine months ended June 27, 2025 was $46.4 million, compared to cash used for investing activities of $95.0 million in the corresponding prior year period (which included $9.3 million associated with discontinued operations), due to lower levels of additions to plant, property and equipment in the current year and no current year acquisitions.\nOur net cash used for financing activities during the nine months ended June 27, 2025 was $126.2 million. This was driven by share repurchases of $653.2 million, $114.8 million in dividends to shareholders, and $27.0 million in taxes paid on vested restricted stock, which was offset by net proceeds from borrowings of $589.4 million due to lower repayments compared to the prior year period and the receipt of $70 million associated with the final settlement of the post-closing working capital adjustment from the distribution of the SpinCo Business. Please refer to Note 15 - \nDiscontinued Operations\n for additional details. Cash used for financing activities in the corresponding prior year period was \nPage 43\n$492.6 million, due primarily to share repurchases of $346.4 million, $106.4 million in dividends to shareholders, and $22.0 million in net redeemable noncontrolling interests purchase and issuance activity related to PA Consulting.\nAt June 27, 2025, the Company had approximately $223.9 million in cash and cash equivalents held in the U.S. and $1.1 billion held outside of the U.S. (primarily in the U.K., the Eurozone, Australia, India, Canada, and the Middle East region). Other than the tax cost of repatriating funds to the U.S., there are no material impediments to repatriating these funds to the U.S.\nThe Company had $229.8 million in letters of credit outstanding at June 27, 2025. Of this amount, $0.3 million was issued under the Revolving Credit Facility and $229.5 million was issued under separate, committed and uncommitted letter-of-credit facilities.\nOn March 27, 2025, the Company, as guarantor, and JEGI, as borrower, entered into a term loan agreement (the “2025 Term Loan Facility”) with Bank of America, N.A., as administrative agent and sole lead arranger, and the lenders party thereto. Under the 2025 Term Loan Facility, JEGI borrowed a $200.0 million term loan and £410.0 million term loan for a term of two-years from the date of initial funding, maturing on March 26, 2027. The proceeds from the 2025 Term Loan Facility were used to repay the outstanding 2021 Term Loan Facility principal equal to $120.0 million and £410.2 million, or $531.6 million, and was otherwise used for general corporate purposes. \nSee Note 12 - Borrowings.\nLong-term debt as of\n \nJune 27, 2025 increased by $1.2 billion compared to September 27, 2024 primarily due to the Company entering into the 2025 Term Loan Facility for a combined amount of $763.0 million (see Note 12 - \nBorrowings\n), and an increased draw on the revolving credit facility of $515.0 million to fund share buybacks, dividends and taxes paid on vested restricted stock, partly offset by the termination of the 2021 Term Loan - USD portion.\nShort-term debt as of June 27, 2025 decreased by $875.8 million compared to September 27, 2024 primarily due to the Equity-for-Debt Transaction, pursuant to which the Company extinguished $311.5 million under the GBP 2021 Term Loan, in exchange for its approximately 19.5 million shares in Amentum, and the entry to the 2025 Term Loan Facility, the proceeds of which were used to extinguish the remaining $531.6 million under the GBP 2021 term loan contract. For more information, please refer to Note - 12 \nBorrowings \nand Note 15 - \nDiscontinued Operations.\nIn connection with the Post-Closing Additional Merger Consideration relating to the Separation Transaction, the Company became entitled to receive approximately 7.3 million Amentum shares from the 9.7 million shares held in escrow. On April 30, 2025, the Jacobs Board of Directors determined to distribute the 7.3 million shares of Amentum's stock and declared an in kind dividend payable to Jacobs’ shareholders of record as of May 16, 2025 which was distributed on a pro rata basis on May 30, 2025. Please refer to Note 15 - \nDiscontinued Operations\n \nfor additional details.\nOn April 10, 2025, the Company collected $70 million in receivables related to final settlement of the post-closing working capital adjustment from the distribution of the SpinCo Business. The cash was utilized to pay down amounts owed under the Company’s Revolving Credit Facility on the same day. Please refer to Note 15 - \nDiscontinued Operations \nfor additional details.\nOn February 6, 2023 the Company refinanced its Revolving Credit Facility, and on February 16, 2023, the Company issued the 5.90% Bonds in the aggregate principal amount of $500.0 million. On August 18, 2023, the Company issued the 6.35% Bonds in the aggregate principal amount of $600.0 million. See Note 12 - \nBorrowings\n for further discussion relating to the terms of the 5.90% Bonds, the 6.35% Bonds, and the Revolving Credit Facility following the issuances and refinancing.\nWe believe we have adequate liquidity and capital resources to fund our projected cash requirements for acquisitions including any potential transaction relating to PA Consulting and financing activities such as debt servicing, share buybacks and dividends for the next twelve months based on the liquidity provided by our cash and cash equivalents on hand, our borrowing capacity and our continuing cash from operations.\nWe were in compliance with all of our debt covenants at June 27, 2025.\nPage 44\nSupplemental Obligor Group Financial Information\nOn February 16, 2023, Jacobs Engineering Group Inc., a wholly-owned subsidiary of Jacobs Solutions Inc. (together, the \"Obligor Group\"), completed an offering of $500.0 million aggregate principal amount of 5.90% Bonds, due 2033 and on August 18, 2023, completed an offering of $600.0 million aggregate principal amount of 6.35% Bonds, due 2028 (collectively the “Bonds”). The Bonds are fully and unconditionally guaranteed by the Company (the “Guarantees”). The Bonds and the respective Guarantees were offered pursuant to prospectus supplements, dated February 13, 2023 and August 15, 2023, respectively, to the prospectus dated February 6, 2023, that forms a part of the Company and JEGI’s automatic shelf registration statement on Form S-3ASR (File Nos. 333-269605 and 333-269605-01) previously filed with the SEC.\nIn accordance with SEC Regulation S-X Rule 13-01, set forth below is the summarized financial information for the Obligor Group on a combined basis after elimination of (i) intercompany transactions and balances between Jacobs and JEGI and (ii) equity in the earnings from and investments in all other subsidiaries of the Company that do not guarantee the registered securities of either Jacobs or JEG. This summarized financial information (in thousands) has been prepared and presented pursuant to Regulation S-X Rule 13-01, “Financial Disclosures about Guarantors and Issuers of Guaranteed Securities” and is not intended to present the financial position or results of operations of the Obligor Group in accordance with U.S. GAAP.\nNine Months Ended\n(in thousands)\nJune 27, 2025\nSummarized Statement of Earnings Data\nRevenue\n$\n3,023,299 \nDirect Costs\n$\n2,512,397 \nSelling, General and Administrative Expenses\n$\n354,112 \nNet loss attributable to Guarantor Subsidiaries from continuing operations\n$\n(154,888)\nNoncontrolling interests\n$\n(1,494)\n(in thousands)\nJune 27, 2025\nSeptember 27, 2024\nSummarized Balance Sheet Data\nCurrent assets, less receivables from Non-Guarantor Subsidiaries\n$\n1,080,478 \n$\n1,733,836 \nCurrent receivables from Non-Guarantor Subsidiaries\n$\n844,849 \n$\n573,631 \nNoncurrent assets, less noncurrent receivables from Non-Guarantor Subsidiaries\n$\n602,829 \n$\n503,444 \nNoncurrent receivables from Non-Guarantor Subsidiaries\n$\n576,702 \n$\n615,986 \nCurrent liabilities\n$\n1,058,092 \n$\n1,568,187 \nCurrent liabilities to Non-Guarantor Subsidiaries\n$\n— \n$\n— \nLong-term Debt\n$\n2,508,692 \n$\n1,348,594 \nOther Noncurrent liabilities, less amounts payable to Non-Guarantor Subsidiaries\n$\n243,813 \n$\n237,025 \nNoncurrent liabilities to Non-Guarantor Subsidiaries\n$\n980,169 \n$\n1,051,899 \nNoncontrolling interests\n$\n5 \n$\n937 \nAccumulated deficit\n$\n(1,685,913)\n$\n(779,745)\nPage 45"
}