{
  "source_file": "jbht20241231d_10k.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.   BUSINESS\n\n\nOVERVIEW\n\n\n \n\n\nWe are one of the largest surface transportation, delivery, and logistics companies in North America. J.B. Hunt Transport Services, Inc. is a publicly held holding company that, through our wholly owned subsidiaries, provides a wide range of reliable transportation, brokerage, and delivery services to a diverse group of customers and consumers throughout the continental United States, Canada, and Mexico. Unless otherwise indicated by the context, “we,” “us,” “our,” the “Company”, and “JBHT” refer to J.B. Hunt Transport Services, Inc. and its consolidated subsidiaries. We were incorporated in Arkansas on August 10, 1961, and have been a publicly held company since our initial public offering in 1983. Our service offerings include transportation of full-truckload containerized freight, which we directly transport utilizing our company-controlled revenue equipment and company drivers, independent contractors, or third-party carriers. We have arrangements with most of the major North American rail carriers to transport freight in containers or trailers, while we perform the majority of the pickup and delivery services. We also provide customized freight movement, revenue equipment, labor, systems, and delivery services that are tailored to meet individual customers’ requirements and typically involve long-term contracts. These arrangements are generally referred to as dedicated services and may include multiple pickups and drops, freight handling, specialized equipment, and freight network design. In addition, we provide or arrange for local and home delivery services, generally referred to as last-mile delivery services, to customers through a network of cross-dock and other delivery system locations throughout the continental United States. Utilizing thousands of reliable third-party carriers, we also provide comprehensive freight transportation brokerage and logistics services. In addition to dry-van, full-load operations, we also arrange for these unrelated outside carriers to provide flatbed, refrigerated, less-than-truckload (LTL), and other specialized equipment, drivers, and services. Also, we utilize contracted power units to provide traditional over-the-road full truckload delivery services. Our customers, who include many Fortune 500 companies, have extremely diverse businesses. Many of them are served by J.B. Hunt 360°®, an online platform that offers shippers and carriers greater access, visibility and transparency of the supply chain.\n\n\n \n\n\n\n\n\n\n\n\n2\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nWe believe our ability to offer multiple services, utilizing our existing lines of business and a full complement of logistics services through third parties, represents a competitive advantage. We report our operating results for these services using five reporting segments: Intermodal (JBI), Dedicated Contract Services® (DCS®), Integrated Capacity Solutions (ICS), Final Mile Services® (FMS) and Truckload (JBT). Our business usually involves slightly higher freight volumes in August through early November. Meanwhile, DCS and FMS are subject to less seasonal variation than our other segments.\n\n\n \n\n\nAdditional general information about us is available at jbhunt.com. We make a number of reports and other information available free of charge on our website, including our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports as soon as reasonably practicable after such material is electronically filed with or furnished to the SEC pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934. Our website also contains corporate governance guidelines, our code of ethics, our whistleblower policy, Board committee charters, and other corporate policies. The information on our website is not, and shall not be deemed to be, a part of this annual report on Form 10-K or incorporated into any other filings we make with the SEC.\n\n\n \n\n\nOUR VISION, MISSION AND STRATEGY\n\n\n \n\n\nOur Vision: To create the most efficient transportation network in North America.         \n\n\n \n\n\nOur Mission: Driving long-term value for our people, customers and shareholders.\n\n\n \n\n\nWe forge long-term relationships with key customers that include supply chain management as an integral part of their strategies. Working in concert, we strive to drive out excess cost, add value and function as an extension of their enterprises. Our strategy is based on utilizing an integrated, multimodal approach to provide capacity-oriented solutions centered on delivering customer value and industry-leading service. We believe our unique operating strategy can add value to customers and increase our profits and returns to shareholders.\n\n\n \n\n\nWe continually analyze opportunities for additional capital investment and where management’s resources should be focused to provide more benefits to our customers. These actions should, in turn, yield increasing returns to our shareholders.\n\n\n \n\n\nIncreasingly, our customers are seeking energy-efficient transportation solutions to reduce both cost and greenhouse-gas emissions. Our Company’s vision, to create the most efficient transportation network in North America, focuses on delivering both for our customers across all of our business segments. We seek to accomplish this by maintaining a modern fleet to maximize fuel efficiency, converting loads from truck to rail with our intermodal service, and introducing technologies to optimize freight flows in the supply chain by eliminating waste. Additionally, we continue to test and explore the usage of alternative fuel vehicles. Efforts to improve fleet fuel efficiency and reduce greenhouse gas emissions are ongoing. We are an Environmental Protection Agency (EPA) SmartWay® Transport Partner, and a proud thirteen-time recipient of the EPA’s SmartWay® Excellence Award (awarded consecutively through 2021 before the award program was paused in 2022 and 2023. In 2024 we were listed in Smartway's High Performer List which highlights companies who have achieved significant shipping and freight efficiencies that merit special attention.\n\n\n \n\n\nAs always, we continue to ingrain safety into our corporate culture and strive to conduct all of our operations as safely as possible.\n\n\n \n\n\n\n\n3\n\n\n\n\n \n\n\n\n\n \n\n\nOPERATING SEGMENTS\n\n\n \n\n\nSegment information is also included in Note 13 to our Consolidated Financial Statements.\n\n\n \n\n\nJBI Segment\n\n\n \n\n\nThe transportation service offerings of our JBI segment utilize arrangements with most major North American rail carriers to provide intermodal freight solutions for our customers throughout the continental United States, Canada, and Mexico. Our JBI segment began operations in 1989, forming a unique partnership with what is now the BNSF Railway Company (BNSF); this was a watershed event in the industry and the first agreement that linked major rail and truckload carriers in a joint service environment. Throughout the years that followed, JBI established multiple agreements with other Class I railroads. JBI draws on the intermodal services of these rail carriers for the underlying linehaul movement of its equipment between rail ramps. The origin and destination pickup and delivery services (drayage) are handled by our company-owned tractors for the majority of our intermodal loads, while third-party dray carriers are used where economical. By performing our own drayage services, we are able to provide a cost-competitive, seamless coordination of the combined rail and dray movements for our customers.\n\n\n \n\n\nJBI operates 122,272 pieces of company-owned trailing equipment systemwide. The fleet primarily consists of 53-foot, high-cube containers and is designed to take advantage of intermodal double-stack economics and superior ride quality.  We own and maintain our own chassis fleet, consisting of 103,850 units. The containers and chassis are uniquely designed so that they may only be paired together for optimal productivity, which we feel creates an operational competitive advantage.  JBI also manages a fleet of 6,153 company-owned tractors and contracts 349 independent contractor trucks.  At December 31, 2024, the total JBI employee count was 9,253, including 8,117 company drivers and 4 delivery and material assistants.  Revenue for the JBI segment in 2024 was $5.96 billion.\n\n\n \n\n\nDCS Segment\n\n\n \n\n\nDCS focuses on private fleet conversion and creation in replenishment and specialized equipment.  We specialize in the design, development, and execution of supply chain solutions that support a variety of transportation networks. Contracts with our customers are long-term, ranging from three to 10 years, with the average being approximately five years. Pricing of our contracts typically involves cost-plus arrangements, with our fixed costs being recovered regardless of equipment utilization, but is customized based on the amount of invested capital and the duration of the contract.\n\n\n \n\n\nAt December 31, 2024, this segment operated 12,048 company-owned trucks, 598 customer-owned trucks, and one independent contractor truck.  DCS also operates 27,149 owned pieces of trailing equipment and 4,897 customer-owned trailers. The DCS segment employed 15,521 people, including 13,173 drivers and 39 delivery and material assistants, at December 31, 2024.  DCS revenue for 2024 was $3.40 billion.\n\n\n \n\n\nICS Segment\n\n\n \n\n\nICS provides traditional freight brokerage and transportation logistics solutions to customers through relationships with thousands of third-party carriers and integration with our owned equipment within other segments. By leveraging the J.B. Hunt brand, systems, and network, we provide a broader service offering to customers by providing flatbed, refrigerated, and expedited, as well as a variety of dry-van and intermodal solutions. Furthermore, we offer an online multimodal marketplace via J.B. Hunt 360 that helps shippers and carriers match the right load with the right carrier. ICS also provides the majority of our single-source logistics management services for customers desiring to outsource their transportation functions and utilize our proven supply chain technology and design expertise to improve efficiency. ICS operates multiple remote sales offices or branches, as well as on-site logistics personnel working in direct contact with customers.\n\n\n \n\n\nAt December 31, 2024, the ICS segment employed 590 people, with approximately 110,000 available third-party carriers. ICS revenue for 2024 was $1.14 billion.\n\n\n \n\n\n\n\n4\n\n\n\n\n \n\n\n\n\n \n\n\nFMS Segment\n\n\n \n\n\nFMS provides last-mile delivery services to customers through a nationwide network of cross-dock and other delivery system network locations, with 98% of the continental U.S. population living within 150 miles of a network location. FMS provides both asset and non-asset (brokerage) big and bulky delivery and installation services, as well as fulfillment, retail-pooling distributions, and LTL services. FMS contracts with customers range from one to five years, with the average being approximately three years.\n\n\n \n\n\nAt December 31, 2024, this segment operated 1,123 company-owned trucks, 206 customer-owned trucks, and 36 independent contractor trucks. FMS also operates 1,137 owned pieces of trailing equipment and 104 customer-owned trailers. The FMS segment employed 2,587 people, including 1,280 drivers and 338 delivery and material assistants, at December 31, 2024. FMS revenue for 2024 was $910 million.\n\n\n \n\n\nJBT Segment\n\n\n \n\n\nThe service offering in this segment is full-load, dry-van freight, utilizing tractors and trailers operating over roads and highways. JBT offers these services through our J.B. Hunt 360box® program which utilizes our J.B. Hunt 360 platform to access capacity and offer efficient drop trailer solutions to our customers. We typically pick up freight at the dock or specified location of the shipper and transport the load directly to the location of the consignee.  We use independent contractors or third-party carriers who agree to transport freight in our trailers as well as available company-owned tractors and employee drivers.\n\n\n \n\n\nAt December 31, 2024, the JBT segment operated 12,895 company-owned trailers, two company-owned tractors, and employed 266 people, three of whom were drivers. At December 31, 2024, we had 1,917 independent contractors operating in the JBT segment.  JBT revenue for 2024 was $702 million.\n\n\n \n\n\nMarketing and Operations\n\n\n \n\n\nWe transport, or arrange for the transportation of, a wide range of freight, including general merchandise, specialty consumer items, appliances, forest and paper products, food and beverages, building materials, soaps and cosmetics, automotive parts, agricultural products, electronics, and chemicals. Our customer base includes a large number of Fortune 500 companies. We provide many transportation services that meet the supply chain logistics needs of shippers.\n\n\n \n\n\nWe generally market all of our service offerings through a nationwide sales and marketing network. We use specific sales forces in DCS and FMS due to the length, complexity, and specialization of the sales cycle. In addition to our sales teams, J.B. Hunt 360 offers instant access to a wide array of technology-driven solutions for customers and carriers. Through the platform, businesses of all sizes can quote and book shipments, view analytics, and gain visibility into freight movement. In accordance with our typical arrangements, we bill the customer for all services, and we, in turn, pay all third parties for their portion of transportation services provided.\n\n\n \n\n\nHuman Capital Resources\n\n\n \n\n\nGeneral\n\n\n \n\n\nDespite operating over 189,000 pieces of transportation equipment, our single greatest asset and one of the factors differentiating us from our competitors is our service-oriented people. We strive to provide a supportive and safe work environment for its employees, where diverse and innovative ideas can be fostered to solve problems and provide value-added services for our customers. We put forth our best effort to support initiatives that benefit our people and reflect our company values of integrity, respect, innovation, safety, and excellence.\n\n\n \n\n\nAs of December 31, 2024, we had 33,646 employees, which consisted of 22,573 company drivers, 9,266 office personnel, 1,426 maintenance technicians, and 381 delivery and material assistants.  We also had arrangements with 2,303 independent contractors to transport freight in our trailing equipment. None of our employees are represented by unions or covered by collective bargaining agreements.\n\n\n \n\n\n\n\n\n\n\n\n5\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nIn managing the Company’s business, our executive leadership focuses on various human capital measures and objectives designed to address the attraction, development, and retention of personnel across the dimensions of culture, career, and wellness. These include but are not limited to competitive compensation and benefits, paid time off, employee retirement plans, bonus and other incentive compensation plans, modern equipment and support, employee listening programs connecting feedback with business action, leadership development, recognition, and tuition assistance.\n\n\n \n\n\nCulture and Belonging\n\n\n \n\n\nWe work to foster a culture where all employees feel welcomed, valued, respected, safe, and heard, and where the actions of our people reflect our company values.\n\n\n \n\n\nWe measure ourselves through listening to our employees in surveys, focus groups, and town hall meetings with leadership. We use data and ideas from those activities to drive action in support of our leaders and teams. We also facilitate ideation from all employees through our process improvement platform, ELEVATION, where anyone can submit an idea to make the company better.\n\n\n \n\n\n \n\n\nIn addition, our Employee Resource Groups (ERGs), Inclusion Office, and Inclusion Council work together to further a culture of inclusivity. The Company’s seven ERGs are open to all of our employees and offer opportunities for professional development and networking.\n\n\n \n\n\nCareer and Opportunity\n\n\n \n\n\nProviding career opportunities for our people is an ongoing commitment. Thousands of employees have had the chance to move jobs or be promoted into new roles, and thousands more have participated in leadership training over their careers, including training opportunities for field and office positions. In addition to offering tuition assistance for degree programs or certifications to our employees, family members of employees are also eligible to apply for the J.B. Hunt Scholarship Program for Families, offering the opportunity to receive $2,500 each school year, and up to $10,000 over four years.\n\n\n \n\n\nWellness and Safety\n\n\n \n\n\nThe health and well-being of our workforce has always been a priority as safety is ingrained into our corporate culture and is a company value. We strive to conduct all of our operations as safely as possible. Many of our employees participate in regular job-specific safety training programs. In addition, our Million Mile Safe Driving and Recognition Awards Program has for more than 25 years recognized and rewarded our drivers who dedicate themselves to accident-free driving. Since its inception in 1996, the program has awarded more than $40 million in safe driving bonuses, and in 2024, surpassed 5,000 drivers who have achieved one million safe miles.\n\n\n \n\n\nWe believe that access to quality healthcare is also an important part of this priority, and we have programs in place that focus on improving the quality of care that our employees and their families receive. From new and expanded benefit programs to case management support to shortened eligibility waiting periods and more, we are continually assessing our offerings in a competitive and ever-changing healthcare landscape. Paid leave is another key component of this focus, and we offer benefit plans that comply with all applicable laws. Financial wellness is also included in our focus, and we provide seed funding for healthcare savings accounts and opportunities to participate in 401(k) retirement plans.\n\n\n \n\n\nWe are a company that prioritizes a supportive and safe work environment. We believe this is essential for our people to grow and thrive, and for innovative ideas to be fostered and problems to be solved. Throughout this approach, we fulfill our mission to provide long-term value for our people, customers, and shareholders.\n\n\n \n\n\nRevenue Equipment\n\n\n \n\n\nOur JBI segment utilizes uniquely designed high-cube containers and chassis, which can only be paired with each other and can be separated to allow the containers to be double-stacked on rail cars. The composition of our DCS trailing fleet varies with specific customer requirements and may include dry-vans, flatbeds, bulk, temperature-controlled, curtain-side vans, and dump trailers. We primarily utilize third-party carriers’ tractor and trailing equipment for our ICS segment. Our FMS segment primarily utilizes straight trucks or similar equipment through third-party carriers, while the JBT segment operates primarily 53-foot dry-van trailers.\n\n\n \n\n\n\n\n\n\n\n\n6\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nAs of December 31, 2024, our company-owned tractor and truck fleet consisted of 19,326 units. In addition, we had 2,303 independent contractors who operate their own tractors but transport freight in our trailing equipment. We operate with standardized tractors in as many fleets as possible, particularly in our JBI and JBT fleets. Due to our customers’ preferences and the actual business application, our DCS fleet is extremely diversified. We believe operating with relatively newer revenue equipment provides better customer service, attracts quality drivers, improves fuel efficiency and lowers maintenance expense. At December 31, 2024, the average age of our combined tractor fleet was 2.4 years, while our containers averaged 9.6 years of age and our trailers averaged 6.5 years. We perform routine servicing and preventive maintenance on our equipment at our regional terminal facilities.\n\n\n \n\n\nCompetition and the Industry\n\n\n \n\n\nThe freight transportation markets in which we operate are frequently referred to as highly fragmented and competitive. Our JBI segment competes with other intermodal marketing companies; other full-load carriers that utilize railroads for a portion of the transportation service; and, to a certain extent, some railroads directly. The diversified nature of the services provided by our DCS and FMS segments attracts competition from customers’ private fleets, other private fleet outsourcing companies, equipment leasing companies, local and regional delivery service providers, and some truckload carriers. Our ICS segment utilizes the fragmented nature of the truck industry and competes with other non-asset-based logistics companies and freight brokers, as well as full-load carriers. The full-load freight competition of our JBT segment includes thousands of carriers, many of which are very small. While we compete with a number of smaller carriers on a regional basis, only a limited number of companies represent competition in all markets across the country.\n\n\n \n\n\nWe compete with other transportation service companies primarily in terms of price, on-time pickup and delivery service, availability and type of equipment capacity, and availability of carriers for logistics services.\n\n\n \n\n\nRegulation\n\n\n \n\n\nOur operations as a for-hire motor carrier are subject to regulation by the U.S. Department of Transportation (DOT) and the Federal Motor Carrier Safety Administration (FMCSA), and certain business is also subject to state rules and regulations. The DOT periodically conducts reviews and audits to ensure our compliance with federal safety requirements, and we report certain accident and other information to the DOT. Our operations into and out of Canada and Mexico are subject to regulation by those countries as well as U.S. Customs and Boarder Protection with respect to cross-border trade and security compliance. We are also subject to a variety of requirements of national, state, and local governments, including the U.S. Environmental Protection Agency and the Occupational Safety and Health Administration.\n\n\n \n\n\nWe are subject to various environmental laws and regulations dealing with the handling of hazardous materials, underground fuel storage tanks, and discharge and retention of storm water. These laws and regulations have the effect of increasing the costs, risks and liabilities associated with our applicable operations. We are also subject to existing and potential future laws and regulations with regards to public policy on climate change. If current regulatory requirements become more stringent or new environmental laws and regulations regarding climate change are introduced, we could be required to make significant expenditures or abandon certain activities.\n\n\n \n\n\nWe continue to monitor the actions of the FMCSA and other regulatory agencies and evaluate all proposed rules to determine their impact on our operations.\n\n\n \n\n\n\n\n\n\n\n\n7",
  "item7": null,
  "item2": null
}