{
  "source_file": "jbl-20250531.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nWe are one of the leading providers of worldwide manufacturing services and solutions. We provide comprehensive electronics design, production, and product management services to companies in various industries and end markets. Our services enable our customers to reduce manufacturing costs, improve supply-chain management, reduce inventory obsolescence, lower transportation costs, and reduce product fulfillment time. Our manufacturing and supply chain management services and solutions include innovation, design, planning, fabrication and assembly, delivery, and managing the flow of resources and products. We derive substantially all of our revenue from production and product management services (collectively referred to as “manufacturing services”), which encompass the act of producing tangible components that are built to customer specifications and are then provided to the customer.\nWe serve our customers primarily through dedicated business units that combine highly automated, continuous flow manufacturing with advanced electronic design and design for manufacturability. We currently depend, and expect to continue to depend for the foreseeable future, upon a relatively small number of customers for a significant percentage of our net revenue, which in turn depends upon their growth, viability, and financial stability.\nWe conduct our operations in facilities that are located worldwide, including but not limited to, China, Mexico, Singapore, Malaysia, and the United States. We derived a substantial majority, 72.5% and 76.6% of net revenue, from our international operations for the three months and nine months ended May 31, 2025, respectively. Our global manufacturing production sites allow customers to manufacture products simultaneously in the optimal locations for their products. Our global presence is key to assessing and executing on our business opportunities.\nAs of September 1, 2024, we are reporting our business in the following three segments: Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce, which are also the Company’s reportable segments. Our Regulated Industries segment is focused on regulated markets and includes revenues from customers primarily in the automotive and transportation, healthcare and packaging, and renewable energy infrastructure industries. Our Intelligent Infrastructure segment is focused on the modern digital ecosystem including artificial intelligence (“AI”) infrastructure and includes revenues from customers primarily in the capital equipment, cloud and data center infrastructure, and networking and communications industries. Our Connected Living and Digital Commerce segment is focused on digitalization and automation, including warehouse automation and robotics, and includes revenues from customers primarily in the connected living and digital commerce industries.\nWe monitor the current economic environment and its potential impact on both the customers we serve as well as our end-markets and closely manage our costs and capital resources so that we can respond appropriately as circumstances change.\nBeginning in February 2025, the U.S. implemented tariffs on a variety of countries and commodities, including, among others, tariffs on aluminum and steel derivative products, imports of certain Canadian and Mexican goods, imports of Chinese goods, universal tariffs on imports from most countries, and reciprocal tariffs on select countries. In response, certain countries have imposed, or are considering, retaliatory tariffs on U.S. exports. The global tariff landscape continues to shift rapidly, with changes impacting businesses and markets around the world. While these increased tariffs have and may continue to impact end customer demand, we expect that we will recover the tariff costs by passing them on to our customers. If we are unable to fully pass on these costs, our operating results and cash flows could be adversely impacted.  For additional information, refer to Part I, “Item 1A. Risk Factors” of our Annual Report on Form 10-K for the fiscal year ended August 31, 2024. \nRefer to Item 7. “Management's Discussion and Analysis of Financial Condition and Results of Operations” section contained in our Annual Report on Form 10-K for the fiscal year ended August 31, 2024, for further discussion of the items disclosed in Item 2. “Management's Discussion and Analysis of Financial Condition and Results of Operations” section as of May 31, 2025, contained herein.\n27\nTable of Contents\n    \nSummary of Results\nThe following table sets forth, for the periods indicated, certain key operating results and other financial information (in millions, except per share data):\n \nThree months ended\nNine months ended\n \nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\nNet revenue\n$\n7,828 \n$\n6,765 \n$\n21,550 \n$\n21,919 \nGross profit\n$\n681 \n$\n608 \n$\n1,863 \n$\n2,013 \nOperating income\n$\n403 \n$\n261 \n$\n845 \n$\n1,695 \nNet income attributable to Jabil Inc.\n$\n222 \n$\n129 \n$\n439 \n$\n1,250 \nEarnings per share – basic\n$\n2.05 \n$\n1.08 \n$\n3.98 \n$\n10.01 \nEarnings per share – diluted\n$\n2.03 \n$\n1.06 \n$\n3.94 \n$\n9.86 \nKey Performance Indicators\nManagement regularly reviews financial and non-financial performance indicators to assess the Company’s operating results. Changes in our operating assets and liabilities are largely affected by our working capital requirements, which are dependent on the effective management of our sales cycle as well as timing of payments. Our sales cycle measures how quickly we can convert our manufacturing services into cash through sales. We believe the metrics set forth below are useful to investors in measuring our liquidity as future liquidity needs will depend on fluctuations in levels of inventory, accounts receivable, and accounts payable.\nThe following table sets forth, for the quarterly periods indicated, certain of management’s key financial performance indicators:\n \nThree months ended\nMay 31, 2025\nFebruary 28, 2025\nMay 31, 2024\nSales cycle\n(1)\n24 days\n33 days\n47 days\nInventory turns (annualized)\n(2)\n5 turns\n4 turns\n4 turns\nDays in accounts receivable\n(3)\n46 days\n50 days\n45 days\nDays in inventory\n(4)\n74 days\n80 days\n81 days\nDays in accounts payable\n(5)\n96 days\n97 days\n79 days\n(1)\nThe sales cycle is calculated as the sum of days in accounts receivable and days in inventory, less the days in accounts payable; accordingly, the variance in the sales cycle quarter over quarter was a direct result of changes in these indicators.\n(2)\nInventory turns (annualized) are calculated as 360 days divided by days in inventory. \n(3)\nDays in accounts receivable is calculated as accounts receivable, net, divided by net revenue multiplied by 90 days. During the three months ended May 31, 2025, the decrease in days in accounts receivable from the prior sequential quarter was primarily driven by timing of payments.\n(4)\nDays in inventory is calculated as inventories, net and contract assets divided by cost of revenue multiplied by 90 days. During the three months ended May 31, 2025, the decrease in days in inventory from the prior sequential quarter and the three months ended May 31, 2024, was primarily driven by higher consumption of inventory to support sales during the quarter and improved working capital management. \n(5)\nDays in accounts payable is calculated as accounts payable divided by cost of revenue multiplied by 90 days. During the three months ended May 31, 2025, the increase in days in accounts payable from the three months ended May 31, 2024, was primarily due to higher purchases of customer-controlled consignment components and timing of cash payments.\n28\nTable of Contents\n    \nCritical Accounting Policies and Estimates\nThe preparation of our Condensed Consolidated Financial Statements and related disclosures in conformity with U.S. generally accepted accounting principles (“U.S. GAAP”) requires management to make estimates and judgments that affect our reported amounts of assets and liabilities, revenues and expenses, and related disclosures of contingent assets and liabilities. On an ongoing basis, we evaluate our estimates and assumptions based upon historical experience and various other factors and circumstances. Management believes that our estimates and assumptions are reasonable under the circumstances; however, actual results may vary from these estimates and assumptions under different future circumstances. For further discussion of our significant accounting policies, refer to Note \n1 \n— “Description of Business and Summary of Significant Accounting Policies” to the Consolidated Financial Statements and “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Critical Accounting Policies and Estimates” in our Annual Report on Form 10-K for the fiscal year ended August 31, 2024.\nRecent Accounting Pronouncements\nSee Note 20 – “New Accounting Guidance” to the Condensed Consolidated Financial Statements for a discussion of recent accounting guidance.\nResults of Operations\nNet Revenue\nGenerally, we assess revenue on a global customer basis regardless of whether the growth is associated with organic growth or as a result of an acquisition. Accordingly, we do not differentiate or separately report revenue increases generated by acquisitions as opposed to existing business. In addition, the added cost structures associated with our acquisitions have historically been relatively insignificant when compared to our overall cost structure.\nThe distribution of revenue across our segments has fluctuated, and will continue to fluctuate, as a result of numerous factors, including the following: fluctuations in customer demand; efforts to diversify certain portions of our business; business growth from new and existing customers; specific product performance; and any potential termination, or substantial winding down, of significant customer relationships. \nAs discussed in the “Overview” section, as of September 1, 2024, we are reporting our business in the following three segments – Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce. In conjunction with this reorganization, there have been certain reclassifications made within the reported segments. \nThree months ended\nNine months ended\n(dollars in millions)\nMay 31, 2025\nMay 31, 2024\nChange\nMay 31, 2025\nMay 31, 2024\nChange\nNet revenue\n$\n7,828 \n$\n6,765 \n15.7 \n%\n$\n21,550 \n$\n21,919 \n(1.7)\n%\nNet revenue increased during the three months ended May 31, 2025, compared to the three months ended May 31, 2024. Specifically, the Intelligent Infrastructure segment net revenue increased 51% primarily due to: (i) a 40% increase in revenues from existing customers within our cloud and data center infrastructure business and (ii) a 13% increase in revenues from existing customers within our capital equipment business. The increase is partially offset by a 2% decrease in revenues from existing customers within our networking and communications business. The Connected Living and Digital Commerce segment net revenue decreased 7% due to a 7% decrease in revenues from existing customers within our connected living business. The Regulated Industries segment net revenue remained consistent primarily due to: (i) a 4% increase in revenues from existing customers within our renewable energy infrastructure business and (ii) a 4% decrease in revenues from existing customers within our automotive and transportation business.\n29\nTable of Contents\n    \nNet revenue decreased during the nine months ended May 31, 2025, compared to the nine months ended May 31, 2024. Specifically, the Connected Living and Digital Commerce segment net revenue decreased 27% due to a 30% decrease in revenues primarily driven by the divestiture of the Mobility Business within our connected living business. The decrease is partially offset by a 3% increase in revenues from existing customers within our digital commerce business. The Intelligent Infrastructure segment net revenue increased 24% primarily due to: (i) a 24% increase in revenues from existing customers within our cloud and data center infrastructure business and (ii) a 9% increase in revenues from existing customers within our capital equipment business. The increase is partially offset by a 9% decrease in revenues from existing customers within our networking and communications business. The Regulated Industries segment net revenue decreased 5% primarily due to: (i) a 3% decrease in revenues from existing customers within our automotive and transportation business, (ii) a 1% decrease in revenues from existing customers within our renewable energy infrastructure business, and (iii) a 1% decrease in revenues from existing customers within our healthcare and packaging business. \nThe following table sets forth, for the periods indicated, revenue by segment expressed as a percentage of net revenue:\n \nThree months ended\nNine months ended\n \nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\nRegulated Industries\n39 \n%\n45 \n%\n41 \n%\n42 \n%\nIntelligent Infrastructure\n44 \n%\n34 \n%\n40 \n%\n31 \n%\nConnected Living and Digital Commerce\n17 \n%\n21 \n%\n19 \n%\n27 \n%\nTotal\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nThe following table sets forth, for the periods indicated, foreign source revenue expressed as a percentage of net revenue:\nThree months ended\nNine months ended\nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\nForeign source revenue\n72.5 \n%\n80.5 \n%\n76.6 \n%\n83.4 \n%\nGross Profit\nThree months ended\nNine months ended\n(dollars in millions)\nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\nGross profit\n$\n681 \n$\n608 \n$\n1,863 \n$\n2,013 \nPercent of net revenue\n8.7 \n%\n9.0 \n%\n8.6 \n%\n9.2 \n%\nGross profit as a percentage of net revenue decreased for the three months and nine months ended May 31, 2025, compared to the three months and nine months ended May 31, 2024, primarily due to product mix in our Connected Living and Digital Commerce segment.\nSelling, General and Administrative\nThree months ended\nNine months ended\n(in millions)\nMay 31, 2025\nMay 31, 2024\nChange\nMay 31, 2025\nMay 31, 2024\nChange\nSelling, general and administrative\n$\n274 \n$\n268 \n$\n6 \n$\n835 \n$\n890 \n$\n(55)\nSelling, general and administrative expenses increased during the three months ended May 31, 2025, compared to the three months ended May 31, 2024, primarily due to an increase in stock-based compensation expense primarily driven by the reversal of stock-based compensation expense associated with forfeitures of time-based, performance-based and market-based restricted stock awards during the three months ended May 31, 2024.  The increase is partially offset by a decrease in business interruption and impairment charges, net and a decrease in salary and salary related expenses during the three months ended May 31, 2025.\nSelling, general and administrative expenses decreased during the nine months ended May 31, 2025, compared to the nine months ended May 31, 2024, primarily due to (i) a decrease in salary and salary related expenses, (ii) a decrease in office and support costs, and (ii) a decrease in business interruption and impairment charges, net.\n30\nTable of Contents\n    \nResearch and Development\nThree months ended\nNine months ended\n(dollars in millions)\nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\nResearch and development\n$\n7 \n$\n9 \n$\n22 \n$\n29 \nPercent of net revenue\n0.1 \n%\n0.1 \n%\n0.1 \n%\n0.1 \n%\nResearch and development expenses remained consistent as a percentage of net revenue during the three months and nine months ended May 31, 2025, compared to the three months and nine months ended May 31, 2024. \nAmortization of Intangibles \nThree months ended\nNine months ended\n(in millions)\nMay 31, 2025\nMay 31, 2024\nChange\nMay 31, 2025\nMay 31, 2024\nChange\nAmortization of intangibles\n$\n17 \n$\n12 \n$\n5 \n$\n45 \n$\n27 \n$\n18 \nAmortization of intangibles increased during the three months ended May 31, 2025, compared to the three months ended May 31, 2024, primarily due to additional amortization associated with intangible assets related to the acquisitions of Mikros Technologies LLC and Pharmaceutics International, Inc. that occurred during the first and second quarters of fiscal year 2025.\nAmortization of intangibles increased during the nine months ended May 31, 2025, compared to the nine months ended May 31, 2024, primarily due to (i) additional amortization associated with intangible assets related to the acquisitions of Mikros Technologies LLC and Pharmaceutics International, Inc. that occurred during the first and second quarters of fiscal year 2025 and (ii) amortization related to the Green Point trade name, which was reclassified to a definite-lived intangible asset during fiscal year 2024.\nRestructuring, Severance and Related Charges\nThree months ended\nNine months ended\n(in millions)\nMay 31, 2025\nMay 31, 2024\nChange\nMay 31, 2025\nMay 31, 2024\nChange\nRestructuring, severance and related charges\n$\n16 \n$\n55 \n$\n(39)\n$\n144 \n$\n252 \n$\n(108)\nRestructuring, severance, and related charges decreased during the three months and nine months ended May 31, 2025, compared to the three months and nine months ended May 31, 2024, primarily due to higher restructuring, severance and related charges, related to the 2024 Restructuring Plan, during the three months and nine months ended May 31, 2024. The decrease is partially offset by increased restructuring, severance and related charges, related to the 2025 Restructuring Plan, during the three months and nine months ended May 31, 2025.\n2025 Restructuring Plan\nOn September 24, 2024, our Board of Directors approved a restructuring plan to align our support infrastructure to further optimize organizational effectiveness. This action includes headcount reductions across our Selling, General and Administrative (“SG&A”) and manufacturing cost base and capacity realignment (the “2025 Restructuring Plan”). The 2025 Restructuring Plan reflects our intention only and restructuring decisions, including the timing of such decisions, at certain locations remain subject to consultation with the Company’s employees and their representatives.\nWe expect to recognize approximately $200 million in pre-tax restructuring and other related costs over the course of our 2025 fiscal year. The charges relating to the 2025 Restructuring Plan are currently expected to result in net cash expenditures of approximately $100 million to $130 million that will be payable over the course of the Company’s fiscal years 2025 and 2026. The restructuring and other related charges are expected to include $60 million to $70 million of employee severance and benefit costs; $65 million to $70 million of asset write-off costs; and $55 million to $65 million of contract termination costs and other related costs. The amount and timing of the actual charges may vary due to a variety of factors, including the finalization of timetables for the transition of functions, consultation with employees and their representatives, as well as the impact of jurisdictional statutory severance requirements. Our estimates for the charges discussed above exclude any potential income tax effects.\n31\nTable of Contents\n    \n2024 Restructuring Plan\nOn September 26, 2023, our Board of Directors approved a restructuring plan to (i) realign our cost base for stranded costs associated with the sale and realignment of the Mobility Business and (ii) optimize our global footprint. This action includes headcount reductions across our SG&A cost base and capacity realignment (the “2024 Restructuring Plan”). \nThe 2024 Restructuring Plan, totaling approximately $300 million in pre-tax restructuring and other related costs, was substantially complete as of August 31, 2024.\nSee Note 14 – “Restructuring, Severance and Related Charges” to the Condensed Consolidated Financial Statements for further discussion of restructuring, severance and related charges.\nGain from the Divestiture of Businesses\nThree months ended\nNine months ended\n(in millions)\nMay 31, 2025\nMay 31, 2024\nChange\nMay 31, 2025\nMay 31, 2024\nChange\nGain from the divestiture of businesses\n$\n(45)\n$\n— \n$\n(45)\n$\n(45)\n$\n(944)\n$\n899 \nIn the second quarter of fiscal year 2024, we completed the divestiture of the Mobility Business and recorded a pre-tax gain of $944 million. Certain post-closing adjustments were realized in March 2025, which resulted in the recognition of a $54 million pre-tax gain during the three months ended May 31, 2025.\nSee Note 17 – “Business Acquisitions and Divestitures” to the Condensed Consolidated Financial Statements for additional information. \nAcquisition and Divestiture Related Charges\nThree months ended\nNine months ended\n(in millions)\nMay 31, 2025\nMay 31, 2024\nChange\nMay 31, 2025\nMay 31, 2024\nChange\nAcquisition and divestiture related charges\n$\n9 \n$\n3 \n$\n6 \n$\n17 \n$\n64 \n$\n(47)\nAcquisition and divestiture related charges increased during the three months ended May 31, 2025, compared to the three months ended May 31, 2024, primarily due to transaction costs incurred in connection with pursuing acquisition opportunities.\nAcquisition and divestiture related charges decreased during the nine months ended May 31, 2025, compared to the nine months ended May 31, 2024, primarily due to transaction and disposal costs incurred in connection with the divestiture of the Mobility Business during fiscal year 2024.\nSee Note 17 – “Business Acquisitions and Divestitures” to the Condensed Consolidated Financial Statements for additional information. \nLoss on Securities\nThree months ended\nNine months ended\n(in millions)\nMay 31, 2025\nMay 31, 2024\nChange\nMay 31, 2025\nMay 31, 2024\nChange\nLoss on securities\n$\n46 \n$\n— \n$\n46 \n$\n46 \n$\n— \n$\n46 \nLoss on securities during the three months and nine months ended May 31, 2025, relates to an impairment of an investment in Preferred Stock. \nOther Expense\nThree months ended\nNine months ended\n(in millions)\nMay 31, 2025\nMay 31, 2024\nChange\nMay 31, 2025\nMay 31, 2024\nChange\nOther expense\n$\n30 \n$\n22 \n$\n8 \n$\n74 \n$\n65 \n$\n9 \n32\nTable of Contents\n    \nOther expense increased during the three months ended May 31, 2025, compared to the three months ended May 31, 2024, primarily due to (i) an increase in fees primarily due to higher utilization of our trade accounts receivable sales programs and global asset-backed securitization program and (ii) lower net periodic benefit costs.\nOther expense increased during the nine months ended May 31, 2025, compared to the nine months ended May 31, 2024, primarily related to lower net periodic benefit costs.\nInterest Expense, Net\nThree months ended\nNine months ended\n(in millions)\nMay 31, 2025\nMay 31, 2024\nChange\nMay 31, 2025\nMay 31, 2024\nChange\nInterest expense, net\n$\n37 \n$\n38 \n$\n(1)\n$\n112 \n$\n132 \n$\n(20)\nInterest expense, net remained relatively consistent during the three months ended May 31, 2025, compared to the three months ended May 31, 2024.\nInterest expense, net decreased during the nine months ended May 31, 2025, compared to the nine months ended May 31, 2024, due to lower interest rates and lower borrowings primarily on our credit facilities and commercial paper program.\nIncome Tax Expense\nThree months ended\nNine months ended\nMay 31, 2025\nMay 31, 2024\nChange\nMay 31, 2025\nMay 31, 2024\nChange\nEffective income tax rate\n23.7 \n%\n35.7 \n%\n(12.0)\n%\n28.5 \n%\n16.6 \n%\n11.9 \n%\nThe effective income tax rate differed for the three months and nine months ended May 31, 2025, compared to the three months and nine months ended May 31, 2024, primarily due to: (i) a change in the jurisdictional mix of earnings, (ii) an $18 million income tax benefit for the reversal of an unrecognized tax benefit due to a lapse of statute for the nine months ended May 31, 2025, and (iii) the gain from the divestiture of the Mobility Business, including post-closing adjustments recorded during the three months ended May 31, 2025, and corresponding $58 million of income tax expense during the nine months ended May 31, 2024.\nThe Organization for Economic Co-operation and Development (“OECD”) and participating countries continue to work toward the enactment of a 15% global minimum corporate tax rate. Many countries, including countries in which we have tax incentives, have enacted or are in the process of enacting laws based on the OECD’s proposals. We do not currently expect a material impact to our effective tax rate for the fiscal year ending August 31, 2025.\nNon-GAAP (Core) Financial Measures\nThe following discussion and analysis of our financial condition and results of operations include certain non-GAAP financial measures as identified in the reconciliations below. The non-GAAP financial measures disclosed herein do not have standard meaning and may vary from the non-GAAP financial measures used by other companies or how we may calculate those measures in other instances from time to time. Non-GAAP financial measures should not be considered a substitute for, or superior to, measures of financial performance prepared in accordance with U.S. GAAP. Among other uses, management uses non-GAAP “core” financial measures to make operating decisions, assess business performance, and as a factor in determining certain employee performance when evaluating incentive compensation. Also, our “core” financial measures should not be construed as an indication by us that our future results will be unaffected by those items that are excluded from our “core” financial measures.\nWe determine an annual normalized tax rate (“normalized core tax rate”) for the computation of the non-GAAP (core) income tax provision to provide better consistency across reporting periods. In estimating the normalized core tax rate annually, we utilize a full-year financial projection of core earnings that considers the mix of earnings across tax jurisdictions, existing tax positions, and other significant tax matters. We may adjust the normalized core tax rate during the year for material impacts from new tax legislation or material changes to our operations.\n33\nTable of Contents\n    \nIncluded in the tables below are reconciliations of the non-GAAP financial measures to the most directly comparable U.S. GAAP financial measures as provided in our Condensed Consolidated Financial Statements:\nReconciliation of U.S. GAAP Financial Results to Non-GAAP Measures\n \nThree months ended\nNine months ended\n(in millions, except for per share data)\nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\nOperating income (U.S. GAAP)\n$\n403 \n$\n261 \n$\n845 \n$\n1,695 \nAmortization of intangibles\n17 \n12 \n45 \n27 \nStock-based compensation expense and related charges\n19 \n3 \n84 \n72 \nRestructuring, severance and related charges\n(1)\n16 \n55 \n144 \n252 \nNet periodic benefit cost\n(2)\n— \n2 \n1 \n7 \nBusiness interruption and impairment charges, net\n(3)\n1 \n14 \n10 \n14 \nGain from the divestiture of businesses\n(4)\n(45)\n— \n(45)\n(944)\nAcquisition and divestiture related charges\n(4)\n9 \n3 \n17 \n64 \nAdjustments to operating income\n17 \n89 \n256 \n(508)\nCore operating income (Non-GAAP)\n$\n420 \n$\n350 \n$\n1,101 \n$\n1,187 \nNet income attributable to Jabil Inc. (U.S. GAAP)\n$\n222 \n$\n129 \n$\n439 \n$\n1,250 \nAdjustments to operating income\n17 \n89 \n256 \n(508)\nLoss on securities\n(5)\n46 \n— \n46 \n— \nNet periodic benefit cost\n(2)\n— \n(2)\n(1)\n(7)\nAdjustments for taxes\n(6)\n(6)\n14 \n(18)\n51 \nCore earnings (Non-GAAP)\n$\n279 \n$\n230 \n$\n722 \n$\n786 \nDiluted earnings per share (U.S. GAAP)\n$\n2.03 \n$\n1.06 \n$\n3.94 \n$\n9.86 \nDiluted core earnings per share (Non-GAAP)\n$\n2.55 \n$\n1.89 \n$\n6.48 \n$\n6.20 \nDiluted weighted average shares outstanding (U.S. GAAP and Non-GAAP)\n109.3 \n121.7 \n111.5 \n126.9 \n(1)\nCharges recorded during the three months and nine months ended May 31, 2025, and May 31, 2024, primarily related to the 2025 Restructuring Plan and 2024 Restructuring Plan, respectively.\n(2)\nWe are reclassifying the pension components in other expense to core operating income as we assess operating performance, inclusive of all components of net periodic benefit cost, with the related revenue. There is no impact to core earnings or diluted core earnings per share for this adjustment.\n(3)\nCharges recorded during the nine months ended May 31, 2025, relate primarily to costs associated with damage from Hurricanes Helene and Milton, which impacted our operations in St. Petersburg, Florida and Asheville and Hendersonville, North Carolina. Charges recorded during the three months and nine months ended May 31, 2024, related to costs associated with product quality liabilities. Charges recorded during the three months and nine months ended May 31, 2025, and May 31, 2024, are classified as a component of cost of revenue and selling, general and administrative expenses in the Condensed Consolidated Statements of Operations.\n(4)\nWe completed the divestiture of the Mobility Business and recorded a pre-tax gain of $944 million during the nine months ended May 31, 2024. Certain post-closing adjustments were realized in March 2025, which resulted in the recognition of a $54 million pre-tax gain during the three months ended May 31, 2025. We incurred transaction and disposal costs in connection with the sale of approximately $64 million during the nine months ended May 31, 2024. \n(5)\nCharges recorded during the three months and nine months ended May 31, 2025, relate to an impairment of an investment in Preferred Stock. \n(6)\nTax adjustments for the nine months ended May 31, 2024, were partially driven by an income tax expense associated with the divestiture of the Mobility Business.\n34\nTable of Contents\n    \nAdjusted Free Cash Flow\n \nNine months ended\n (in millions)\nMay 31, 2025\nMay 31, 2024\nNet cash provided by operating activities (U.S. GAAP)\n$\n1,052 \n$\n1,181 \nAcquisition of property, plant and equipment (“PP&E”)\n(1)\n(299)\n(660)\nProceeds and advances from sale of PP&E\n(1)\n60 \n115 \nAdjusted free cash flow (Non-GAAP)\n$\n813 \n$\n636 \n(1)\nCertain customers co-invest in PP&E with us. As we acquire PP&E, we recognize the cash payments in acquisition of PP&E. When our customers reimburse us and obtain control, we recognize the cash receipts in proceeds and advances from the sale of PP&E.\nAcquisitions and Divestitures\nAcquisitions\nFiscal Year 2025\nOn June 2, 2025, we signed a binding share purchase agreement related to the anticipated acquisition of Rebound Technologies Group Holdings Limited (“Rebound Technologies”). Rebound Technologies is a global supply chain service provider headquartered in the United Kingdom offering end-to-end solutions including global sourcing, data driven analytics, proactive shortage management and obsolescence strategies. Completion of this transaction is subject to regulatory clearance and customary closing conditions.\nOn February 3, 2025, we completed the acquisition of Pharmaceutics International, Inc. (“Pii”) for cash consideration transferred of $309 million. The final purchase price is subject to adjustment based on certain customary conditions as outlined in the purchase agreement. Pii is a contract development and manufacturing organization specializing in early stage, clinical, and commercial volume aseptic filling, lyophilization, and oral solid dose manufacturing. The acquisition will enhance our existing Regulated Industries service offerings, which includes the development and commercial production of auto-injectors, pen injectors, inhalers, and on-body pumps. \nThe acquisition of Pii was accounted for as a business combination using the acquisition method of accounting. Assets acquired of $351 million, including $149 million in intangible assets and $135 million in goodwill, and liabilities assumed of $42 million were recorded at their estimated fair values as of the acquisition date. The preliminary estimates and measurements are subject to change during the measurement period for assets acquired, liabilities assumed, and tax adjustments. The excess of the purchase price over the fair value of the acquired assets and assumed liabilities was recorded to goodwill and was fully allocated to the Regulated Industries segment. Goodwill is primarily attributable to expected synergies enabling comprehensive support for customers in drug development, clinical trials, and product commercialization at scale. The majority of the goodwill is currently not expected to be deductible for income tax purposes. The results of operations were included in our condensed consolidated financial results beginning on February 3, 2025. Pro forma information has not been provided as the acquisition of Pii is not deemed to be significant.\nOn October 1, 2024, we completed the acquisition of Mikros Technologies LLC (“Mikros Technologies”) for consideration transferred of $63 million. Mikros Technologies is a leader in the engineering and manufacturing of liquid cooling solutions for thermal management.\n \nThe final purchase price is subject to adjustment based on certain customary conditions as outlined in the purchase agreement.\nThe acquisition of Mikros Technologies was accounted for as a business combination using the acquisition method of accounting. Assets acquired of $63 million, including $40 million in intangible assets and $17 million in goodwill, were recorded at their estimated fair values as of the acquisition date. The preliminary estimates and measurements are subject to change during the measurement period for assets acquired, liabilities assumed and tax adjustments. The excess of the purchase price over the fair value of the acquired assets and assumed liabilities was recorded to goodwill and was fully allocated to the Intelligent Infrastructure segment. The majority of the goodwill is currently expected to be deductible for income tax purposes. The results of operations were included in our condensed consolidated financial results beginning on October 1, 2024. Pro forma information has not been provided as the acquisition of Mikros Technologies is not deemed to be significant.\n35\nTable of Contents\n    \nFiscal Year 2024\nOn November 1, 2023, we completed the acquisition of ProcureAbility Inc. (“ProcureAbility”) for approximately $60 million in cash. ProcureAbility is a procurement services provider specializing in technology-enabled advisory, managed services, digital, staffing, and recruiting solutions.\nThe acquisition of ProcureAbility was accounted for as a business combination using the acquisition method of accounting. Assets acquired of $87 million, including $40 million in intangible assets and $38 million in goodwill, and liabilities assumed of $26 million were recorded at their estimated fair values as of the acquisition date. The excess of the purchase price over the fair value of the acquired assets and assumed liabilities was recorded to goodwill and was fully allocated to the Regulated Industries segment. The majority of the goodwill is currently not expected to be deductible for income tax purposes. The results of operations were included in our condensed consolidated financial results beginning on November 1, 2023. Pro forma information has not been provided as the acquisition of ProcureAbility is not deemed to be significant.\nDivestitures\nFiscal Year 2024\nWe announced on September 26, 2023, that, through our indirect subsidiary, Jabil Circuit (Singapore) Pte. Ltd., a Singapore private limited company (“Singapore Seller”), we agreed to sell to an affiliate of BYD Electronic (International) Co. Ltd., a Hong Kong limited liability company (“Purchaser” or “BYDE”), its product manufacturing business in Chengdu, including its supporting component manufacturing in Wuxi, the Mobility Business, for cash consideration of approximately $2.2 billion, subject to certain customary purchase price adjustments.\nAs of August 31, 2023, we determined the Mobility Business met the criteria to be classified as held for sale. Assets and liabilities classified as held for sale had a carrying value less than the estimated fair value less cost to sell and, thus, no adjustment to the carrying value of the disposal group was necessary. Depreciation and amortization expense for long-lived assets was not recorded for the period in which these assets were classified as held for sale. The divestiture did not meet the criteria to be reported as discontinued operations, and we continued to report the operating results for the Mobility Business in our Condensed Consolidated Statements of Operations in the DMS segment until the Closing Date.\nOn December 29, 2023, the Closing Date, we completed the sale of the Mobility Business. As a result of the transaction, we derecognized net assets of approximately $1.2 billion, and recorded a pre-tax gain of $942 million in the fiscal year ended August 31, 2024. Certain post-closing adjustments were realized in March 2025, which resulted in the recognition of a $54 million pre-tax gain during the three months ended May 31, 2025. In addition, we agreed to indemnify BYDE from certain liabilities that may arise post-close that relate to periods prior to the Closing Date. We incurred transaction and disposal costs in connection with the sale of approximately $67 million during the fiscal year ended August 31, 2024, which are included in continuing operations in our Condensed Consolidated Statements of Operations.\nRefer to Note 17 – “Business Acquisitions and Divestitures” to the Condensed Consolidated Financial Statements for discussion.\nLiquidity and Capital Resources\nWe believe that our level of liquidity sources, which includes cash on hand, available borrowings under our revolving credit facilities or future facilities and commercial paper program, additional proceeds available under our global asset-backed securitization program and under our uncommitted trade accounts receivable sale programs, cash flows provided by operating activities and access to the capital markets, will be adequate to fund our capital expenditures, the payment of any declared quarterly dividends, any share repurchases under the approved programs, any potential acquisitions, our working capital requirements and our contractual obligations for the next 12 months and beyond. We continue to assess our capital structure and evaluate the merits of redeploying available cash.\nCash and Cash Equivalents\nAs of May 31, 2025, we had approximately $1.5 billion in cash and cash equivalents, of which a significant portion was held by our foreign subsidiaries. Most of our foreign cash and cash equivalents as of May 31, 2025, could be repatriated to the United States without potential tax expense.\n36\nTable of Contents\n    \nNotes Payable and Credit Facilities\nFollowing is a summary of principal debt payments and debt issuance for our notes payable and credit facilities:\n(in millions)\n3.950% Senior Notes\n3.600% Senior Notes\n3.000% Senior Notes\n1.700% Senior Notes\n4.250% Senior Notes\n5.450% Senior Notes\nBorrowings under revolving \ncredit facilities\n(1)(2)\nTotal notes payable\nand credit facilities\nBalance as of August 31, 2024\n$\n498 \n$\n497 \n$\n594 \n$\n499 \n$\n496 \n$\n296 \n$\n— \n$\n2,880 \nBorrowings\n— \n— \n— \n— \n— \n— \n1,604 \n1,604 \nPayments\n— \n— \n— \n— \n— \n— \n(1,604)\n(1,604)\nOther\n— \n1 \n1 \n— \n1 \n1 \n— \n4 \nBalance as of May 31, 2025\n$\n498 \n$\n498 \n$\n595 \n$\n499 \n$\n497 \n$\n297 \n$\n— \n$\n2,884 \nMaturity Date\nJan 12, 2028\nJan 15, 2030\nJan 15, 2031\nApr 15, 2026\nMay 15, 2027\nFeb 1, 2029\nJan 22, 2026 and Jan 22, 2028\n(2)\nOriginal Facility/ Maximum Capacity\n$500 million\n$500 million\n$600 million\n$500 million\n$500 million\n$300 million\n$4.0 billion\n(1)\n(1)\nAs of May 31, 2025, we had $4.0 billion in available unused borrowing capacity under our existing revolving credit facilities, of which $3.2 billion was available under the credit agreement dated January 22, 2020 (as amended, the “Existing Credit Facility”). The Existing Credit Facility acts as the back-up facility for commercial paper outstanding, if any. We have a borrowing capacity of up to $3.2 billion under our commercial paper program. Commercial paper borrowings with an original maturity of 90 days or less are recorded net within the Condensed Consolidated Statements of Cash Flows, and have been excluded from the table above.\n(2)\nOn June 18, 2025, we entered into a senior unsecured credit agreement (the “Agreement”). The Agreement provides for a five-year revolving credit facility in the initial amount of $3.2 billion (the “Revolving Credit Facility”), which may, subject to the lender’s discretion, potentially be increased by up to an aggregate amount of $1.0 billion. The Revolving Credit Facility expires on June 18, 2030, subject to unlimited successive one-year extension options (subject to the lenders’ discretion), provided that the tenor of the Revolving Credit Facility shall at no time exceed five years. Interest and fees on advances under the Revolving Credit Facility are based on our non-credit enhanced long-term senior unsecured debt rating as determined by S&P Global Ratings, Moody’s Ratings and Fitch Ratings. In connection with our entry into the Agreement, we terminated the Existing Credit Facility.\nInterest is charged at a rate equal to either 0.00% to 0.45% above the base rate or 0.90% to 1.45% above the benchmark rate, as applicable, based on our credit ratings. The base rate represents the greatest of: (i) Citibank, N.A.’s prime rate, (ii) 0.50% above the federal funds rate, and (iii) 1.0% above one-month Term SOFR, but not less than zero. The benchmark rate represents Term SOFR, EURIBOR, TIBOR or Daily Simple SOFR, as applicable, for the applicable interest period, but not less than zero. Fees include a facility fee based on the revolving credit commitments of the lenders and a letter of credit fee based on the amount of outstanding letters of credit.\nWe have a shelf registration statement with the SEC registering the potential sale of an indeterminate amount of debt and equity securities in the future to augment our liquidity and capital resources.\nOur Senior Notes and our credit facilities contain various financial and nonfinancial covenants. A violation of these covenants could negatively impact our liquidity by restricting our ability to borrow under the notes payable and credit facilities and potentially causing acceleration of amounts due under these notes payable and credit facilities. As of May 31, 2025, and August 31, 2024, we were in compliance with our debt covenants. Refer to Note 6 – “Notes Payable and Long-Term Debt” to the Condensed Consolidated Financial Statements for further details.\nGlobal Asset-Backed Securitization Program\nCertain Jabil entities participating in the global asset-backed securitization program continuously sell designated pools of trade accounts receivable to a special purpose entity, which in turn sells certain of the receivables at a discount to conduits administered by an unaffiliated financial institution on a monthly basis. In addition, a foreign entity participating in the global asset-backed securitization program sells certain receivables at a discount to conduits administered by an unaffiliated financial institution on a daily basis. As these accounts receivable are sold without recourse, we do not retain the associated risks following the transfer of such accounts receivable to the respective financial institutions. \n37\nTable of Contents\n    \nWe continue servicing the receivables sold and in exchange receive an immaterial servicing fee under the global asset-backed securitization program. We do not record a servicing asset or liability on the Condensed Consolidated Balance Sheets as we estimate that the fee we receive to service these receivables approximates the fair market compensation to provide the servicing activities.\nThe special purpose entity in the global asset-backed securitization program is a wholly owned subsidiary of the Company and is included in our Condensed Consolidated Financial Statements. Certain unsold receivables covering up to the maximum amount of net cash proceeds available under the domestic, or U.S., portion of the global asset-backed securitization program are pledged as collateral to the unaffiliated financial institution as of May 31, 2025.\nEffective January 23, 2025, the terms of the global asset-backed securitization program were amended to extend the termination date from January 2025 to January 2028. The maximum amount of net cash proceeds available at any one time is $700 million. \nIn conjunction with our global asset-backed securitization program, we are required to remit amounts collected as a servicer under the global asset-backed securitization program to a special purpose entity, which in turn sells certain receivables to unaffiliated financial institutions that purchased the receivables. The outstanding balance of receivables sold and not yet collected on accounts where we have continuing involvement was approximately $375 million and $338 million as of May 31, 2025, and August 31, 2024, respectively. During the three months and nine months ended May 31, 2025, we sold $1.2 billion and $3.3 billion, respectively, of trade accounts receivable, and we received cash proceeds of $1.2 billion and $3.2 billion, respectively. The receivables that were sold were removed from the Condensed Consolidated Balance Sheets and the cash received was included as cash provided by operating activities on the Condensed Consolidated Statements of Cash Flows.\nThe global asset-backed securitization program requires compliance with several covenants including compliance with the interest ratio and debt to EBITDA ratio of the Existing Credit Facility. As of May 31, 2025, and August 31, 2024, we were in compliance with all covenants under our global asset-backed securitization program. Refer to Note 7 – “Asset-Backed Securitization Program” to the Condensed Consolidated Financial Statements for further details on the program.\nTrade Accounts Receivable Sale Programs\nFollowing is a summary of the uncommitted trade accounts receivable sale programs with unaffiliated financial institutions. Under the programs we may elect to sell receivables, and the unaffiliated financial institutions may elect to purchase, at a discount, on an ongoing basis (in millions):\nProgram\n \nMaximum Amount\n(1)(2)\nA\n$\n250 \nB\n$\n100 \nC\n1,900 \nCNY\nD\n$\n230 \nE\n$\n170 \nF\n$\n75 \nG\n$\n100 \nH\n$\n2,000 \nI\n$\n250 \n(1)\nMaximum amount of trade accounts receivable that may be sold under a facility at any one time.\n(2)\nThe trade accounts receivable sale programs either expire on various dates through 2028 or do not have expiration dates and may be terminated upon election of the Company or the unaffiliated financial institutions.\nIn conjunction with our trade accounts receivable sale programs, we are required to remit amounts collected as a servicer under the trade accounts receivable sale programs to the unaffiliated financial institutions that purchased the receivables. The outstanding balance of receivables sold and not yet collected on accounts where we have continuing involvement was approximately $852 million and $367 million as of May 31, 2025, and August 31, 2024, respectively. During the three months and nine months ended May 31, 2025, we sold $3.6 billion and $7.4 billion, respectively, of trade accounts receivable under these programs and we received cash proceeds of $3.6 billion and $7.3 billion, respectively. The receivables that were sold were removed from the Condensed Consolidated Balance Sheets and the cash received was included as cash provided by operating activities on the Condensed Consolidated Statements of Cash Flows.\n38\nTable of Contents\n    \nCash Flows\nThe following table sets forth selected consolidated cash flow information (in millions):\n \nNine months ended\nMay 31, 2025\nMay 31, 2024\nNet cash provided by operating activities\n$\n1,052 \n$\n1,181 \nNet cash (used in) provided by investing activities\n(578)\n1,467 \nNet cash used in financing activities\n(1,165)\n(1,989)\nEffect of exchange rate changes on cash and cash equivalents\n13 \n(6)\nNet (decrease) increase in cash and cash equivalents\n$\n(678)\n$\n653 \nOperating Activities\nNet cash provided by operating activities during the nine months ended May 31, 2025, was primarily due to an increase in accounts payable, accrued expense and other liabilities and non-cash expenses and net income. Net cash provided by operating activities was partially offset by an increase in prepaid expenses and other current assets, an increase in inventories, an increase in accounts receivable and an increase in contract assets. The increase in accounts payable, accrued expenses and other liabilities is primarily due to the timing of purchases and cash payments. The increase in prepaid expenses and other current assets is primarily related to purchases made to procure components for customers whereby the associated revenue is expected to be accounted for on a net basis once transferred to the customer. The increase in inventories is primarily to support expected sales levels in the fourth quarter of fiscal year 2025. The increase in accounts receivable is primarily driven by the timing of collections. The increase in contract assets is primarily due to timing of revenue recognition for the over time customers.\nInvesting Activities\nNet cash used in investing activities during the nine months ended May 31, 2025, consisted primarily of the acquisition of Pharmaceutics International, Inc., Mikros Technologies LLC and certain other third-party assets and capital expenditures, principally to support ongoing business in the Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce segments, partially offset by proceeds and advances from the sale of property, plant and equipment and a working capital adjustment related to the divestiture of our Mobility Business. \nFinancing Activities\nNet cash used in financing activities during the nine months ended May 31, 2025, was primarily due to (i) payments for debt agreements, (ii) the repurchase of our common stock under our share repurchase authorization, (iii) treasury stock minimum tax withholding related to vesting of restricted stock, and (iv) dividend payments. Net cash used in financing activities was partially offset by (i) borrowings under debt agreements and (ii) net proceeds from exercise of stock options and issuance of common stock under employee stock purchase plan.\nCapital Expenditures\nFor Fiscal Year 2025, we anticipate our net capital expenditures to be in the range of 1.5% to 2.0% of net revenue. In general, our capital expenditures support ongoing maintenance in our Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce segments and investments in capabilities and targeted end markets. The amount of actual capital expenditures may be affected by general economic, financial, competitive, legislative, and regulatory factors, among other things.\nDividends and Share Repurchases\nWe currently expect to continue to declare and pay regular quarterly dividends of an amount similar to our past declarations. However, the declaration and payment of future dividends are discretionary and will be subject to determination by our Board of Directors each quarter following its review of our financial performance and global economic conditions.\n39\nTable of Contents\n    \nWe repurchase shares of our common stock under share repurchase programs authorized by our Board of Directors. The following Board approved share repurchase programs were executed through a combination of open market transactions and accelerated share repurchase (“ASR”) agreements (in millions):\nBoard Approval Date\nAmount Authorized\nShares Repurchased\nTotal Cash Utilized\nRemaining Authorization\nAuthorization Completion Date\n2022 Share Repurchase Program\nQ4 FY 2021\n$\n1,000 \n16.5\n$\n1,000 \n$\n— \nQ2 FY 2023\n2023 Share Repurchase Program\nQ1 FY 2023\n$\n1,000 \n2.7\n$\n224 \n(1)\nQ4 FY 2023\nAmended 2023 Share Repurchase Program\n(2)\nQ1 FY 2024\n$\n2,500 \n20.4\n$\n2,500 \n$\n— \nQ1 FY 2025\n2025 Share Repurchase Program\n(3)\nQ1 FY 2025\n$\n1,000 \n6.5\n$\n975 \n$\n25 \n(1)\nIn September 2023, the Board of Directors amended and increased the 2023 Share Repurchase Program to allow for the repurchase of up to $2.5 billion of our common stock. \n(2)\nIn September 2024, an ASR transaction was completed, and 1.0 million additional shares were delivered under the Q4 FY 2024 ASR agreements. As of November 30, 2024, no authorization remained under the amended 2023 Share Repurchase Program.\n(3)\nAs of May 31, 2025, 6.5 million shares had been repurchased for $975 million and $25 million remained available under the 2025 Share Repurchase Program.\nUnder ASR agreements, we make payments to the participating financial institutions and receive an initial delivery of shares of common stock. The final number of shares delivered upon settlement of the ASR agreements is determined based on a discount to the volume weighted average price of our common stock during the term of the agreements. At the time the shares are received by the Company, the initial delivery and the final receipt of shares upon settlement of the ASR agreements results in an immediate reduction of the outstanding shares used to calculate the weighted-average common shares outstanding for basic and diluted earnings per share.\nThe terms of ASR agreements, structured as outlined above, were as follows (in millions, except average price):\nAgreement Execution Date\nAgreement Settlement Date\nAgreement Amount\nInitial Shares Delivered\nAdditional Shares Delivered\nTotal Shares Delivered\nAverage Price Paid Per Share\nQ1 FY 2024\nQ1 FY 2024\n$\n500 \n3.3\n0.6\n3.9\n$\n128.61 \nQ4 FY 2024\nQ1 FY 2025\n$\n555 \n4.2\n1.0\n5.2\n$\n107.08 \nQ2 FY 2025\nQ3 FY 2025\n(1)\n$\n310 \n1.8\n0.2\n2.0\n$\n154.44 \nQ3 FY 2025\nQ4 FY 2025\n$\n309 \n1.8\n(2)\n(2)\n$\n135.99 \n(1)\nIn December 2024, as part of the 2025 Share Repurchase Program, we entered into ASR agreements to repurchase $310 million, excluding excise tax, of our common stock. Under the ASR agreements, we made payments of $310 million to participating financial institutions and received an initial delivery of shares of common stock. In March 2025, an ASR transaction was completed, and 0.2 million additional shares were delivered under the Q2 FY 2025 ASR agreements. \n(2)\nIn March 2025, as part of the 2025 Share Repurchase Program, we entered into ASR agreements to repurchase $309 million, excluding excise tax, of our common stock. Under the ASR agreements, we made payments of $309 million to participating financial institutions and received an initial delivery of shares of common stock. The delivery of any remaining shares will occur at the final settlement of the transactions under the ASR agreements.\nIn addition, we repurchased shares of its common stock through the open market as follows (in millions):\nThree months ended\nNine months ended\nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\nShares\nCost\nShares\nCost\nShares\nCost\nShares\nCost\nOpen market share repurchases\n0.2\n$\n30 \n3.8\n$\n499 \n2.7\n$\n356 \n10.3\n$\n1,324 \n40\nTable of Contents\n    \nWarrants\nOn December 27, 2024, we issued a warrant (the “Warrant”) to Amazon.com NV Investment Holdings LLC (“Warrantholder”) to acquire up to 1,158,539 of our ordinary shares (“Warrant Shares”) at an initial exercise price of $137.7671 per share, which is the preceding 30 trading day VWAP. The Warrant allows for cashless exercise and expires December 27, 2031. The Warrant Shares are subject to vesting for payments for purchased products and services over the seven-year Warrant term, with 59,582 of the Warrant Shares having vested upon issuance.\nUpon the consummation of an acquisition transaction (as defined in the Warrant), subject to certain exceptions, the unvested portion of the Warrant will vest in full. So long as the Warrant is unexercised, the Warrant does not entitle the Warrantholder to any voting rights or any other common stockholder rights. The exercise price and the number of Warrant Shares are subject to customary anti-dilution adjustments.\nWe account for the Warrant as an equity instrument within additional paid-in-capital on the Condensed Consolidated Balance Sheets, and the provision for the warrant is recorded as a reduction to revenue on the Condensed Consolidated Statements of Operations. To determine the fair value of the Warrant, we used the Black-Scholes option pricing model, which is based on assumptions that require management to use judgement. Based on the estimated fair value, we determined the amount of provision for common stock warrant, which is amortized ratably as a reduction to revenue based on our estimate of revenue over the Warrant term.\nThe fair value of the Warrant was determined as of the issuance date, using the Black-Scholes option pricing model. The following assumptions were used in the model: \nDecember 27, 2024\nStock price\n$\n145.92\nExercise price\n$\n137.77\nExpected life\n7.0 years\nExpected volatility\n(1)\n34.4 \n%\nRisk-free interest rate\n4.5 \n%\n(1)\nThe expected volatility was estimated using the historical volatility derived from our common stock.\nThe following table summarizes the Warrant activity for the nine months ended May 31, 2025:\nWarrant Shares\nOutstanding as of August 31, 2024\n— \nChanges during the period\nShares granted\n1,158,539 \nShares vested\n(59,582)\nOutstanding as of May 31, 2025\n1,098,957 \nExercisable as of May 31, 2025\n59,582 \nContractual Obligations\nAs of the date of this report, other than the new operating and finance leases, (see Note 4 – “Leases” to the Condensed Consolidated Financial Statements), there were no material changes outside the ordinary course of business, since August 31, 2024, to our contractual obligations and commitments and the related cash requirements."
}