{
  "source_file": "jbl-20250831.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nThe Company\nJabil is one of the leading providers of engineering, manufacturing, and supply chain solutions. We deliver comprehensive design, production, and product management services to companies across a diverse range of industries and end markets. Our capabilities span the entire product lifecycle—from innovation, design, and planning to fabrication, assembly, and delivery—enabling seamless management of resources and materials across global supply chains. Through these integrated services, we help our customers reduce manufacturing costs, enhance supply chain efficiency, minimize inventory risk, lower transportation expenses, and accelerate product fulfillment.\nWe serve our customers primarily through dedicated business units that combine highly automated, continuous flow manufacturing with advanced electronic design and design for manufacturability. Each business unit team serves as a single point of contact between a customer and Jabil. Business unit teams are supported by cross-functional teams, which leverage the power of our global expertise and capabilities to carry out work at the site level.\nWe conduct our operations in facilities that are located worldwide, including but not limited to China, Malaysia, Mexico, and the United States. Our global manufacturing production sites allow customers to manufacture products simultaneously in the optimal locations for their products. Our global presence is key to assessing and executing on our business opportunities. For the fiscal year ended August 31, 2025, we had net revenues of $29.8 billion and net income attributable to Jabil Inc. of $657 million.\nAs of September 1, 2024, we are reporting our business in the following three segments: Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce, which are also the Company’s reportable segments. Our Regulated Industries segment is focused on regulated markets and includes revenues from customers primarily in the automotive and transportation, healthcare and packaging, and renewables and energy infrastructure industries. Our Intelligent Infrastructure segment is focused on the modern digital ecosystem including artificial intelligence (“AI”) infrastructure and includes revenues from customers primarily in the capital equipment, cloud and data center infrastructure, and networking and communications industries. Our Connected Living and Digital Commerce segment is focused on digitalization and automation, including warehouse automation and robotics, and includes revenues from customers primarily in the connected living and digital commerce industries.\nAdditional financial information regarding our reportable operating segments is included in Item 7 of this report and Note 14 – “Concentration of Risk and Segment Data” to the Consolidated Financial Statements.\nIndustry Background\nOur industry was historically composed of companies that provide a range of design and manufacturing services to companies that utilize electronics components in their products. The industry subsequently expanded to include customers that require products and services beyond electronic components, including plastics and metal components, packaging, and injection molding.\nWe monitor the current economic environment and its potential impact on both the customers we serve as well as our end-markets; we closely manage our costs and capital resources so that we can respond appropriately as circumstances change. Over the long term we believe the factors driving our customers and potential customers to use our industry’s services include:\n•\nEfficient Manufacturing.\n Manufacturing solutions providers are often able to manufacture products at a reduced total cost to companies. These cost advantages result from higher utilization of capacity and efficiencies of scale because of diversified product demand and, generally, a greater focus on the components of manufacturing cost. Companies are increasingly seeking to reduce their investment in inventory, facilities, and equipment used in manufacturing and prioritizing capital investments in other activities, such as sales and marketing and research and development (“R&D”). This strategic shift in capital deployment has contributed to increased demand for and interest in outsourcing to external manufacturing service providers.\n2\nTable of Contents\n•\nAccelerated Product Time-to-Market and Time-to-Volume.\n Manufacturing solutions providers are often able to deliver accelerated production start-ups and achieve high efficiencies in bringing new products to production. Providers are also able to more rapidly scale production for changing markets and to position themselves in global locations that serve the leading world markets. With increasingly shorter product life cycles, these key services allow new products to be sold in the marketplace in an accelerated time frame.\n•\nAccess to Advanced Design and Manufacturing Technologies.\n By utilizing manufacturing solutions providers, customers gain access to additional advanced technologies in manufacturing processes, as well as to product and production design, which can offer customers significant improvements in the performance, quality, cost, time-to-market and manufacturability of their products.\n•\nImproved Inventory Management and Purchasing Power.\n Manufacturing solutions providers are often able to more efficiently manage both procurement and inventory. Providers have demonstrated proficiency in purchasing components at improved pricing due to the scale of their operations and continuous interaction with the materials marketplace.\n•\nGlobal Reach and Regional Manufacturing.\n Manufacturing solutions providers operate globally and are often able to more efficiently transition the location of manufacturing processes for products in response to changing macroeconomic and geopolitical environments relying on installed footprints, local teams, and consistent processes.\nOur Strategy\nOur vision is to be the world’s most technologically advanced and trusted manufacturing solutions provider. As we work to achieve our vision, we pursue the following strategies:\n•\nEstablish and Maintain Long-Term Customer Relationships. \nAn important element of our strategy is to develop and expand long-term relationships with leading companies in expanding industries that benefit from global, highly automated, continuous-flow manufacturing. We grow these partnerships across product lines and services to create deeper, more integrated value. In addition, we pursue relationships with new customers that meet our targeted profile: financially stable, technology-driven, growth-oriented, and committed to long-term collaboration.\n•\nProduct Diversification. \nWe focus on balancing our portfolio of products and product families toward higher-return and strategically important segments. This includes manufacturing, supply chain management services, comprehensive electronics design, production, and product management services for markets such as cloud and data infrastructure, healthcare, packaging, automotive and transportation, warehouse automation, networking and communications, and semi-capital equipment. We have made concentrated efforts to diversify our industry sectors and customer base. Because of these efforts, we have experienced business growth from both existing and new customers as well as from acquisitions. In addition, we continue to evaluate emerging end-markets and technologies to help ensure our portfolio remains balanced, resilient, and aligned with long-term customer demand.\n•\nUtilize Customer-Centric Business Units. \nMost of our business units serve a single customer, using dedicated production equipment, workers, supervisors, buyers, planners, and engineers to provide comprehensive, customized manufacturing solutions. We believe our customer-centric business units promote increased responsiveness, particularly for relationships that extend across multiple production locations.\n•\nLeverage Global Production. \nWe believe that global production reduces obsolescence risk, lowers landed costs, and promotes consistent quality worldwide. Consistent with this strategy, we have established or acquired operations in the Americas, Europe and Asia. Our extensive global footprint allows us to select production locations that best serve customer needs. We believe that our global footprint is strengthened by our centralized procurement process, which, when coupled with our single Enterprise Resource Planning system, provides our customers end-to-end supply chain visibility. Increasingly, our customers also prefer manufacturing to be located closer to their end markets. To meet this need, we invest in local-for-local and local-for-regional capabilities that improve resilience, reduce lead times, enhance sustainability, and enable us to support customers directly where they operate.\n•\nExpand Value-Added Services. \nOur systems assembly, direct-order fulfillment, and configure-to-order services allow customers to reduce product cost and obsolescence risk by lowering total work-in-process and finished goods inventory. These services are available at all of our manufacturing locations.\n•\nDeliver Design Expertise. \nWe offer a wide spectrum of value-add design services focused on improving performance, reducing costs, accelerating time-to-market, and enhancing manufacturability. Our design expertise also helps customers navigate technology transitions and regulatory requirements, creating end-to-end solutions that integrate seamlessly from concept through production.\n3\nTable of Contents\n•\nPursue Strategic Acquisitions. \nOur acquisition strategy complements current capabilities, diversifies us into new industry sectors and customers, and expands the scope of services we offer.\nOur Approach to Manufacturing\nTo achieve high levels of manufacturing performance, we have adopted the following approaches:\n•\nDecentralized Business Unit Model.\n Most of our business units serve a single customer and are empowered to tailor strategies to that customer’s needs. Our business units generally have dedicated production lines consisting of equipment, production workers, supervisors, buyers, planners, and engineers. Under certain circumstances, a production line may serve more than one business unit to maximize resource utilization. Business units have direct responsibility for manufacturing results and time-to-volume production, thereby promoting accountability and ownership. The business unit approach is modular and enables us to grow incrementally without disrupting the operations of other business units. Business unit management reviews customer-specific financial performance to assess whether the business units are meeting their designated responsibilities and to ensure that the daily execution of manufacturing activities remains on track. The business units aggregate into operating segments based on the end markets they serve.\n•\nAutomated Continuous Flow. \nWe use a highly automated, continuous flow approach to manufacturing, whereby different pieces of equipment are joined directly or by conveyor to create an in-line assembly process. This process contrasts with a batch approach, in which equipment operates as standalone work-centers. The elimination of waiting time prior to sequential operations results in faster manufacturing, improved efficiency, tighter quality control, and reduced work-in-process inventory. We believe continuous flow manufacturing provides cost reductions and quality improvement when applied to high volumes of product.\n•\nComputerized Control and Monitoring.\n We support all aspects of our manufacturing activities with advanced computerized control and monitoring systems. Component inspection and vendor quality are monitored electronically in real-time. Materials planning, purchasing, stockroom, and shop floor control systems run on a computerized manufacturing resource planning system.\n•\nElectronic Supply Chain Management. \nWe make available to our customers and suppliers an electronic commerce system/electronic data interchange and cloud-based tools to implement a variety of supply chain management programs. Our customers use these tools to share demand and product forecasts and deliver purchase orders, and we use these tools with our suppliers for just-in-time delivery, supplier-managed inventory, and consigned supplier-managed inventory. These capabilities include procurement intelligence platforms and AI-driven orchestration systems that deliver real-time data insights to support cost management, inventory optimization, and risk mitigation across global supply networks. These digital tools improve visibility, responsiveness, and collaboration across the supply chain.\nOur Design Services\nWe offer a wide spectrum of value-add design services to enhance our relationships with current customers and to build new customer relationships. Our teams are strategically staffed to support development projects of all sizes, from turnkey system design and joint development to industrialization and product optimization activities. Our design services support products across all markets we serve and include applications such as cloud data center server platforms; medical and consumer health devices; automotive assemblies for advanced architectures and enhanced functions; vision and safety systems; connected consumer products and appliances; digital commerce ecosystem products for retail environments; power and storage products supporting the energy infrastructure; and smart controls and security for digital building and utilities. These design services include:\n•\nElectronic Design.\n Our Electronic Design team provides electronic hardware and embedded software design services for analog, digital, radio frequency, power, sensor, and optical component applications. This ranges from initial concept and system architecture through design implementation and new product introduction to mass production.\n•\nExperience Design. \nOur Experience Design team works with product design teams to create product experiences that resonate with consumers through user research, industrial design, user interface design, and human factors. These capabilities help create, develop, and connect concepts and specifications that optimize the function, value, and appearance of products for both consumers and manufacturing partners.\n4\nTable of Contents\n•\nMechanical Design. \nOur Mechanical Design team specializes in the design of plastic and metal components, enclosures, sub-assemblies, and systems, with advanced modeling and analysis of electronic, electro-mechanical, and optical assemblies. This includes all aspects of product concept, detail design, wide-ranging environmental applications, thermal management, and tooling management.\n•\nOptical Design. \nOur Optical Design team applies advanced optics expertise to develop solutions for virtual and/or augmented reality, Light Detection and Ranging (“LiDAR”), 3D sensing, projection, and imaging. Throughout the design process, we develop the required processes, equipment, and testing specific to optics to help ensure seamless transition from design to precision mass production.\n•\nIndustrialization Engineering Services.\n Our engineering services combine multiple functions to work with design teams to optimize products for maximum performance, highest quality, and time to market while balancing cost and manufacturability. These functions include our computer-assisted design (“CAD”) team, delivering PCBA design with advanced CAD tools; our Value Analysis and Value Engineering team, improving value and reducing cost of both electrical and mechanical assemblies; and our Engineering Prototyping teams for all development stages. Efforts focus on optimizing designs, reducing material and component complexity, and identifying cost-effective sourcing options.\n•\nProduct Verification. \nOur Product Verification team provides complete product verification throughout the full design cycle and executes specific test services. This includes product verification to assess performance, reliability, and durability under simulated real-world conditions, failure analysis, regulatory compliance and safety, packaging, simulation, data analysis, and component analysis to identify and mitigate potential risks early in the development process.\n•\nManufacturing Test Solution Development.\n Our Manufacturing Test Solution Development team provides integral support to the design teams to embed testability in designs and enable efficient investment in manufacturing resources. The use of software-driven instrumentation and test process design and management reduces human-dependent test processes and promotes traceability and visibility throughout the manufacturing test process. Capabilities include development of test specifications, tester design, and execution of structural, functional, and environmental tests. Early integration of test planning supports defect reduction and consistent product quality. \nFabrication and Assembly\nWe offer systems assembly, test, direct-order fulfillment, and configure-to-order services to our customers. Our systems assembly services extend our range of assembly activities to include assembly of higher-level sub-systems and systems incorporating multiple PCBAs. In addition, based on quality assurance programs developed with our customers, we provide testing services for our PCBAs, sub-systems, and systems products. Our quality assurance programs include product testing under various environmental conditions to help ensure that our products meet or exceed required customer specifications. \nTechnology and Research and Development\nWe believe that our manufacturing and testing technologies are among the most advanced in our industry. To meet our customers’ increasingly sophisticated needs, we continuously engage in R&D activities designed to create new and improved products and manufacturing solutions for our customers. Through our R&D efforts, we intend to continue offering our customers efficient manufacturing processes with high quality and differentiating product solutions using the latest technologies. These technologies and R&D activities include:\n•\nAutomation for tooling, manufacturing, and end customer solutions\n•\nNext generation electronic interconnections\n•\nAdvanced electrical assembly & test processes\n•\nAdvanced polymer and metal material science\n•\nCeramic, metal and plastic single/multi-shot injection molding\n•\nIn-mold mechanical & electrical assembly solutions\n•\nAdvanced coating solutions for plastics, metals & lenses\n•\nThermal-plastic composite formation\n•\nAdvanced thermal management solutions\n•\nAdvanced sensor integration \n•\nOptical sensors across wavelengths\n•\nCo-packaged optics\n•\nSilicon photonics\n•\nSterilization, device filling & fluid management\n5\nTable of Contents\n•\nOutsourced semiconductor assembly and test (“OSAT”) capabilities\n•\nSustainable materials and design\n•\nArtificial intelligence and machine learning\nOur R&D efforts span the markets we serve to provide our customers leading edge technologies and solutions.\nCustomers and Marketing\nA key tenet of our strategy is to develop and expand long-term relationships with leading companies in high-growth industries that benefit from global, highly automated, continuous-flow manufacturing. A small number of customers and significant industry sectors have historically comprised a major portion of our net revenue. While this concentration reflects the depth of our customer relationships, we continue to diversify our customer base across industries and geographies to strengthen resilience. We also market our services and solutions through our website and social media platforms, as well as through direct engagement with prospective customers, industry events, and targeted outreach initiatives.\nIn fiscal year 2025, our five largest customers accounted for approximately 36% of our net revenue and 87 customers accounted for approximately 90% of our net revenue. The table below sets forth the respective portion of net revenue attributable to customers that accounted for a significant concentration of our net revenue during the periods indicated:\n \nPercentage of Net Revenue\nFiscal Year Ended August 31,\n \n2025\n2024\n2023\nCustomer A \n(1)\n16 \n%\n*\n*\nCustomer B \n(2)\n*\n11 \n%\n17 \n%\n*    Amount was less than 10% of total.\n(1)\nSales to this customer were reported primarily in the Intelligent Infrastructure segment.\n(2)\nSales to this customer were reported in the Connected Living and Digital Commerce segment. \nCompetition\nOur business is highly competitive. We compete against numerous domestic and foreign electronic manufacturing solutions providers, diversified manufacturing service providers, and design providers. We also face competition from the manufacturing operations of our current and potential customers, who are continually evaluating the merits of manufacturing products internally against the advantages of outsourcing.\nWe compete with different companies depending on the type of service we are providing and/or the geographic area in which an activity takes place. We believe that the principal competitive factors in the manufacturing services market are: cost; accelerated production time-to-market; higher efficiencies; global locations; rapid scaling of production; advanced technologies; quality; and improved pricing of components. We believe we are extremely competitive with regard to all of these factors.\nComponents Procurement\nWe procure components from a broad group of suppliers, determined on an assembly-by-assembly basis. Our global sourcing and purchasing locations are strategically placed in various countries throughout the world along with our global commodity management and supplier relationship teams. These locations manage our end-to-end procurement lifecycle. This regionalized expertise along with our supplier relationships provide efficient procurement operations.\nSome of the products we manufacture contain one or more components that are only available from a single source. Some of these components are allocated from time to time in response to supply shortages. In some cases, supply shortages will substantially curtail production of all assemblies using a particular component.\n6\nTable of Contents\nProprietary Rights\nWe regard certain aspects of our technology, design, production and product management, supply chain, and other services as proprietary intellectual property. We rely largely upon a combination of intellectual property laws, non-disclosure agreements with our customers, employees, and suppliers and our internal security systems, policies, and procedures. We currently have a relatively modest number of patents for various innovations. We believe that our intellectual property portfolio will continue to evolve as we expand our business activities. Other factors significant to our proprietary rights include the knowledge and experience of our management and workforce and our ability to develop, enhance, and market our technology and services.\nWe license some technology and intellectual property rights from third parties. Generally, the license agreements that govern such third-party technology and intellectual property rights grant us the right to use the subject technology anywhere in the world and terminate upon a material breach by us.\nHuman Capital Management\nAs of August 31, 2025, our workforce consists of talented and dedicated employees across approximately 100 locations in 30 countries. To maintain our competitiveness, we continually invest in our employees, so that they can take care of our customers and communities. Following is a summary of employees by region (in thousands):\nRegion\nNumber of Employees\nAsia\n71\nAmericas\n49\nEurope\n15\n   Total\n(1)\n135\n(1)\nTotal headcount includes permanent, temporary and contingent workers.\nNone of our U.S. employees are represented by a labor union. In certain international locations, our employees are represented by labor unions and by works councils. We promote positive employee relations globally and have not experienced a significant work stoppage or strike.\nSafety \n“Safety First. Always.” is a fundamental value that is ingrained in our culture. We are committed to safety standards in all of our facilities. We have implemented a continuous improvement-based Health and Safety Management System, including annual training assessments coupled with engaged leaders and employees who prioritize safety.\nHuman Rights\nWe believe that respect for fundamental human rights is an essential element of responsible corporate citizenship. We are a founding member of the Responsible Business Alliance (RBA), which is one of the world’s largest industry coalitions for corporate social responsibility in global supply chains. \nCulture & Belonging: Jabil’s Cultural Initiatives\nOur workforce provides us with the innovation and creativity that allows us to continue our success. Built on respect, our culture fosters an environment where employees feel welcomed, valued, and safe – both psychologically and physically. Welcoming a spectrum of backgrounds, experiences, viewpoints, and abilities, we collaborate to create an environment where employees can be their authentic self and contribute to Jabil’s success.\nIn alignment with our Code of Conduct, we are dedicated to establishing a discrimination-free and harassment-free workplace globally. This commitment is guided by our enterprise-wide priorities of mitigating biases, cultivating inclusive leadership, and developing diverse talent.\nOur global sites developed and implemented programs focused on supporting employment and retention of employees with disabilities, with physical and digital infrastructure and training programs to foster an inclusive environment for all. In collaboration with our operations team, we have also established a baseline for site accessibility.\n7\nTable of Contents\nOur culture empowers Jabil to make a positive impact on our people, customers, and communities. Our commitment to our employees’ safety and wellbeing goes beyond physical health to include mental health. At Jabil, we provide our full-time employees two days of paid time off for health and wellbeing and one day for community service in addition to standard paid time off and holidays.\nTo support our commitment to serve our communities where we live and operate, in 2024, Jabil employees completed over 580,000 volunteer hours. From January to August 2025, Jabil employees completed over 420,000 volunteer hours. This commitment remains for fiscal year 2026, with a continued focus in the areas of education, empowerment, and the environment. We believe that while our efforts are locally driven, the impact is global.\nJabil hosted its annual Deliver Best Practices Global Finals representing 20 locations from 13 countries. This continuous improvement program embodies the best of Jabil’s culture while focusing on our key business drivers (People, Process, Social & Environmental, and Technology & Innovation). \nRecognition plays an important role in appreciating others for going above and beyond their normal job duties and doing what’s right for our customers, people, and communities. Jabil acknowledges these well-deserved efforts through our Enterprise recognition program, Respect. Recognize. Reward., in addition to regional and site-based recognition efforts that celebrate our employees worldwide.\nCompensation and Benefits\nJabil’s compensation programs are designed to align the compensation of our employees with Jabil’s performance and to provide the proper incentives to attract, retain, and motivate employees to achieve superior results. Specifically:\n•\nWe seek to provide employee pay levels that are competitive and consistent with employee positions, skill levels, experience, knowledge, and geographic location.\n•\nSalary increases and incentive compensation are based on merit and performance.\n•\nAll full-time U.S. employees are eligible for health insurance, paid and unpaid leaves, a retirement plan, and life and disability/accident coverage. Benefits outside the U.S. are provided based upon country-specific practices and are intended to support the health and wellbeing of our employees and their families.\n•\nSupporting the mental health and emotional wellbeing of our employees and their families is a high priority at Jabil, and we have implemented several programs and benefits over the past several years to help de-stigmatize mental health issues and assist employees in finding and leveraging appropriate resources. These include a global employee assistance program (EAP), on-site behavioral health resources in some locations, and education for our leaders on ways to recognize and respond to signs of mental health and substance abuse issues. Additionally, our Health and Wellbeing programs help to strengthen mental health resilience.\n•\nThe majority of our employees around the world are eligible to participate in our Employee Stock Purchase Plan, allowing them to become owners of Jabil stock at a discount.\nCareer Growth and Development\nAt Jabil, we invest in the professional and personal growth and development of our employees at all levels of the organization. Our learning solutions are intended to empower employees to enhance their knowledge and skills, enabling them to work more effectively, develop stronger capabilities, and guide their teams to success and further reinforce the organization’s vision. Jabil offers learning programs and offerings for all level of employees (hourly, professional, management). \nAs part of our talent strategy, we continue to utilize the LinkedIn Learning platform to enhance employees' access to the tools, resources, and support needed to take charge of their career development. We provide free access to LinkedIn Learning to all professional, management, and executive leaders. Employees are encouraged to utilize LinkedIn Learning for both leadership and technical development, reinforcing our commitment to continuous learning and growth.  \nOur leaders are the cornerstone of Jabil’s success. They serve as a critical link between the strategic vision and the day-to-day execution of the work. One example of a program used to strengthen leadership skills is the Supervisory Basics Program – an internally developed program that seeks to equip supervisors with foundational knowledge that reinforces Jabil’s culture, establishes consistent standards for supervisor–employee interactions, and enhances understanding of key financial and legal principles.\n8\nTable of Contents\nEmployee Engagement\nIn May 2025, we conducted our global Your Voice Matters Survey, utilizing a third party to administer it. Action plans have been developed and are in the process of being executed at all sites to promote continued excellence in employee engagement at Jabil. This is a continuation of the Your Voice Matters Pulse Surveys conducted in 2024 to measure the impact of action plans developed from the 2023 global survey.\nEnvironmental Laws and Regulations\nWe are subject to a variety of federal, state, local, and foreign environmental, health and safety, product stewardship, and producer responsibility laws and regulations, including those relating to the use, storage, discharge, and disposal of hazardous chemicals used during our manufacturing process; those governing worker health and safety; those requiring design changes, supply chain investigation, or conformity assessments; or those relating to the recycling or reuse of products we manufacture.\nInformation about our Executive Officers\nExecutive officers are appointed by the Board of Directors and serve at the discretion of the Board. There are no family relationships among our executive officers and directors. There are no arrangements or understandings between any of our executive officers and any other persons pursuant to which any of such executive officers were selected. Below is a list of our executive officers:\nAdam E. Berry\n (age 48) was named Senior Vice President, Investor Relations & Corporate Affairs in June 2024.\n \nHe previously served as Vice President, Investor Relations from September 2018. Mr. Berry held other roles of increasing responsibility since joining Jabil in 2010 as Director of Investor Relations.\n \nMr. Berry holds a bachelor’s in Communications from Boston College and an MBA from Georgia Institute of Technology.\nSteven D. Borges\n (age 57) was named Executive Vice President, Global Business Units in May 2024. He previously served as Executive Vice President, Chief Executive Officer, Diversified Manufacturing Services from June 2022; Executive Vice President, Chief Executive Officer, Regulated Industries, from September 2020, with additional responsibility for additive Manufacturing; and as Executive Vice President, Chief Executive Officer, Healthcare from September 2016 through August 2020. Mr. Borges joined Jabil in 1993. He holds a bachelor’s in Business Administration and Management from Fitchburg State University. \nMatthew Crowley \n(age 50) was named Executive Vice President, Global Business Units in May 2024. He most recently served as Senior Vice President, Global Business Units from May 2022, and from March 2019 until April 2022, as Vice President, Global Business Units, and from February 2018 to February 2019 as Senior Director, Cloud. Before joining Jabil in 2018, Mr. Crowley held positions with Dell and Amazon Web Services.\nMichael Dastoor\n (age 59) was named Chief Executive Officer in May 2024. Over his 24-year tenure at Jabil, he has held multiple leadership roles across Jabil’s global markets, including serving as Executive Vice President, Chief Financial Officer from April 2018. Mr. Dastoor previously served as Senior Vice President, Controller from July 2010. Mr. Dastoor joined Jabil in 2000. He holds a degree in Finance and Accounting from the University of Bombay and is a Chartered Accountant from the Institute of Chartered Accountants in England and Wales.\nGregory B. Hebard\n (age 56) was named Chief Financial Officer in May 2024. He most recently served as Senior Vice President, Treasurer since 2021. Since joining Jabil in 2009, Mr. Hebard has held roles of increasing responsibility in finance, including Senior Vice President, CFO Green Point from 2017 to 2021 and Vice President, Financial Planning & Analysis from 2013 to 2017. He holds a master’s in Business from DePaul University and a bachelor’s in Finance from the University of Iowa.\nFrederic E. McCoy\n (age 56) was named Executive Vice President, Operations in May 2024. He most recently served as Executive Vice President, Global Business Units since August 2023; Executive Vice President & Chief Executive Officer, Electronics Manufacturing Services, from December 2021 and Senior Vice President, Global Business Units from October 2017. Mr. McCoy joined Jabil in 2001. He holds a master’s in International Affairs and Economics from the School of Advanced International Studies (SAIS) at Johns Hopkins University and a bachelor’s in Foreign Service from Georgetown University.\n9\nTable of Contents\nFrancis (“Frank”) G. McKay\n (age 55) was named Senior Vice President, Chief Supply Chain and Procurement Officer, in January 2019. Prior to his current role, he served as Vice President, Procurement & Purchasing Services from October 2014 and held a variety of management positions in Europe, Asia and the US since joining Jabil in 1997. Mr. McKay holds a bachelor’s from University of Strathclyde.\nKristine Melachrino\n (age 47) was named Executive Vice President, General Counsel, in March 2025. She most recently served as Senior Vice President, General Counsel since October 2022. She joined Jabil in 2007 holding various roles in the legal department supporting the functional and business teams globally. Prior to this role, Ms. Melachrino served as Vice President, Senior Deputy General Counsel for the global Commercial legal team, advising on complex legal and regulatory matters to facilitate business growth; and Assistant Corporate Secretary. She holds a Juris Doctor from Stetson University College of Law, and an MBA from Stetson University.\nMark T. Mondello\n (age 61) was named Chairman of Jabil’s Board of Directors effective November 2021 and has been a member of the Board since March 2013. Mr. Mondello served as our Chief Executive Officer until May 2023. Mr. Mondello has retained various executive responsibilities. Mr. Mondello joined Jabil in 1992. He holds a bachelor’s in Mechanical Engineering from the University of South Florida.\nAndrew D. Priestley\n (age 54) was named Executive Vice President, Global Business Units in May 2024. He most recently served as Senior Vice President, Global Business Units\n \nfrom April 2014. Since joining Jabil in 1996, he has held positions of increasing responsibility across the Company, including as Vice President, Global Business Units since 2012. Mr. Priestley holds an honors in Engineering with Management from the Edinburgh Napier University.\nGary K. Schick\n (age 55) was named Senior Vice President and Chief Human Resources Officer in October 2023.\n \nHe most recently served as Vice President, HR Operations from October 2022. Mr. Schick has held several other positions of increasing responsibility in human resources since joining Jabil in August 2018 as a Senior Director, Human Resources.\n \nMr. Schick holds a bachelor’s in Economics from Northwestern University and a Juris Doctor from the University of Pittsburgh School of Law.\nMay Y. Yap\n (age 55) was named Senior Vice President, Chief Information Officer in September 2020. She joined Jabil in 2014 as Vice President and CIO of Jabil Green Point. Ms. Yap holds an MBA and a master’s in Computer Science from University of Hull and a doctorate in business administration and management from New York University.\nAdditional Information\nOur principal executive offices are located at 10800 Roosevelt Boulevard North, St. Petersburg, Florida 33716, and our telephone number is (727) 577-9749. We were incorporated in Delaware in 1992. Our website is located at http://www.jabil.com. Through a link on the “Investors” section of our website, we make available our Annual Report on Form 10-K, our Quarterly Reports on Form 10-Q, our Current Reports on Form 8-K and any amendments to those reports, free of charge, as soon as reasonably practicable after they are electronically filed with, or furnished to, the SEC. The “Investors” section of our website contains a significant amount of information about our Company, including a Sustainability Report, financial and other information for investors. The information that we post on the “Investors” section of our website could be deemed to be material information. We encourage investors, the media and others interested in Jabil to visit our website. Information on our website, however, is not a part of this report.\n10\nTable of Contents",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nWe are one of the leading providers of worldwide manufacturing services and solutions. We provide comprehensive electronics design, production, and product management services to companies in various industries and end markets. We derive substantially all of our revenue from production and product management services (collectively referred to as “manufacturing services”), which encompass the act of producing tangible components that are built to customer specifications and are then provided to the customer.\nAt August 31, 2025, we have three reporting segments: Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce. Our Regulated Industries segment is focused on regulated markets and includes revenues from customers primarily in the automotive and transportation, healthcare and packaging, and renewable energy infrastructure industries. Our Intelligent Infrastructure segment is focused on the modern digital ecosystem including artificial intelligence (“AI”) infrastructure and includes revenues from customers primarily in the capital equipment, cloud and data center infrastructure, and networking and communications industries. Our Connected Living and Digital Commerce segment is focused on digitalization and automation, including warehouse automation and robotics, and includes revenues from customers primarily in the connected living and digital commerce industries.\nOur cost of revenue includes the cost of electronic components and other materials that comprise the products we manufacture; the cost of labor and manufacturing overhead; and adjustments for excess and obsolete inventory. As a provider of turnkey manufacturing services, we are responsible for procuring components and other materials. This requires us to commit significant working capital to our operations and to manage the purchasing, receiving, inspecting, and stocking of materials. At times, we collect deposits from our customers related to the purchase of inventory in order to effectively manage our working capital. Although we bear the risk of fluctuations in the cost of materials and excess scrap, our ability to purchase components and materials efficiently may contribute significantly to our operating results. While we periodically negotiate cost of materials adjustments with our customers, rising component and material prices may negatively affect our margins. Net revenue from each product that we manufacture consists of an element based on the costs of materials in that product and an element based on the labor and manufacturing overhead costs allocated to that product. Our gross margin for any product depends on the mix between the cost of materials in the product and the cost of labor and manufacturing overhead allocated to the product.\nOur operating results are impacted by the level of capacity utilization of manufacturing facilities; indirect labor costs; and selling, general, and administrative expenses. Operating income margins have generally improved during periods of high production volume and high capacity utilization. During periods of low production volume, we generally have reduced operating income margins.\nWe monitor the current economic environment and its potential impact on both the customers we serve as well as our end-markets and closely manage our costs and capital resources so that we can respond appropriately as circumstances change.\nBeginning in February 2025, the U.S. implemented tariffs on a variety of countries and commodities, including, among others, tariffs on aluminum and steel derivative products, imports of certain Canadian and Mexican goods, imports of Chinese goods, universal tariffs on imports from most countries, and reciprocal tariffs on select countries. In response, certain countries have imposed, or are considering, retaliatory tariffs on U.S. exports. The global tariff landscape continues to shift rapidly, with changes impacting businesses and markets around the world. While these increased tariffs have and may continue to impact end customer demand, we expect that we will recover the tariff costs by passing them on to our customers. If we are unable to fully pass on these costs, our operating results and cash flows could be adversely impacted. \nWe have consistently utilized advanced circuit design, production design and manufacturing technologies to meet the needs of our customers. To support this effort, our engineering staff focuses on developing and refining design and manufacturing technologies to meet specific needs of specific customers. Most of the expenses associated with these customer-specific efforts are reflected in our cost of revenue. In addition, our engineers engage in research and development (“R&D”) of new technologies that apply generally to our operations. The expenses of these R&D activities are reflected in the research and development line item within our Consolidated Statements of Operations.\nAn important element of our strategy is the expansion of our global production facilities. The majority of our revenue and materials costs worldwide are denominated in U.S. dollars, while our labor and utility costs in operations outside the U.S. are denominated in local currencies. We economically hedge certain of these local currency costs, based on our evaluation of the potential exposure as compared to the cost of the hedge, through the purchase of foreign currency exchange contracts. Changes \n30\nTable of Contents\nin the fair market value of such hedging instruments are reflected within the Consolidated Statements of Operations and the Consolidated Statements of Comprehensive Income.\nSee Note 14 – “Concentration of Risk and Segment Data” to the Consolidated Financial Statements.\nSummary of Results\nThe following table sets forth, for the periods indicated, certain key operating results and other financial information (in millions, except per share data):\n \nFiscal Year Ended August 31,\n \n2025\n2024\n2023\nNet revenue\n$\n29,802 \n$\n28,883 \n$\n34,702 \nGross profit\n$\n2,646 \n$\n2,676 \n$\n2,867 \nOperating income\n$\n1,182 \n$\n2,013 \n$\n1,537 \nNet income attributable to Jabil Inc.\n$\n657 \n$\n1,388 \n$\n818 \nEarnings per share – basic\n$\n6.00 \n$\n11.34 \n$\n6.15 \nEarnings per share – diluted\n$\n5.92 \n$\n11.17 \n$\n6.02 \nKey Performance Indicators\nManagement regularly reviews financial and non-financial performance indicators to assess the Company’s operating results. Changes in our operating assets and liabilities are largely affected by our working capital requirements, which are dependent on the effective management of our sales cycle as well as timing of payments. Our sales cycle measures how quickly we can convert our manufacturing services into cash through sales. We believe the metrics set forth below are useful to investors in measuring our liquidity, as future liquidity needs will depend on fluctuations in levels of inventory, accounts receivable, and accounts payable.\nThe following table sets forth, for the quarterly periods indicated, certain of management’s key financial performance indicators:\n \nThree Months Ended\nAugust 31, 2025\nMay 31, 2025\nAugust 31, 2024\nSales cycle\n(1)\n18 days\n24 days\n34 days\nInventory turns (annualized)\n(2)\n5 turns\n5 turns\n5 turns\nDays in accounts receivable\n(3)\n44 days\n46 days\n46 days\nDays in inventory\n(4)\n69 days\n74 days\n76 days\nDays in accounts payable\n(5)\n96 days\n96 days\n88 days\n(1)\nThe sales cycle is calculated as the sum of days in accounts receivable and days in inventory, less the days in accounts payable; accordingly, the variance in the sales cycle quarter over quarter is a direct result of changes in these indicators.\n(2)\nInventory turns (annualized) are calculated as 360 days divided by days in inventory.\n(3)\nDays in accounts receivable is calculated as accounts receivable, net, divided by net revenue multiplied by 90 days. During the three months ended August 31, 2025, the decrease in days in accounts receivable from the prior sequential quarter and the three months ended August 31, 2024, was primarily driven by an increase in net revenue and the timing of payments.\n(4)\nDays in inventory is calculated as inventory and contract assets divided by cost of revenue multiplied by 90 days. During the three months ended August 31, 2025, the decrease in days in inventory from the prior sequential quarter and the three months ended August 31, 2024, was primarily driven by higher consumption of inventory to support sales during the quarter and improved working capital management.\n(5)\nDays in accounts payable is calculated as accounts payable divided by cost of revenue multiplied by 90 days. During the three months ended August 31, 2025, the increase in days in accounts payable from the three months ended August 31, 2024, was primarily due to higher purchases of customer-controlled consignment components and the timing of cash payments.\n31\nTable of Contents\nCritical Accounting Policies and Estimates\nThe preparation of our Consolidated Financial Statements and related disclosures in conformity with U.S. generally accepted accounting principles (“U.S. GAAP”) requires management to make estimates and judgments that affect our reported amounts of assets and liabilities, revenues and expenses, and related disclosures of contingent assets and liabilities. On an on-going basis, we evaluate our estimates and assumptions based upon historical experience and various other factors and circumstances. Management believes that our estimates and assumptions are reasonable under the circumstances; however, actual results may vary from these estimates and assumptions under different future circumstances. We have identified the following critical accounting policies that affect the more significant judgments and estimates used in the preparation of our Consolidated Financial Statements. For further discussion of our significant accounting policies, refer\n to Note 1 – “Des\ncription of Business and Summary of Significant Accounting Policies” to the Consolidated Financial Statements.\nRevenue Recognition\nFor our over time customers, we believe the measure of progress which best depicts the transfer of control is based on costs incurred to date, relative to total estimated cost at completion (i.e., an input method). This method is a faithful depiction of the transfer of goods or services because it results in the recognition of revenue on the basis of our to-date efforts in the satisfaction of a performance obligation relative to the total expected efforts in the satisfaction of the performance obligation. We believe that the use of an input method best depicts the transfer of control to the customer, which occurs as we incur costs on our contracts. The transaction price of each performance obligation is generally based upon the contractual standalone selling price of the product or service. \nInventory Valuation\nWe purchase inventory based on forecasted demand and record inventory at the lower of cost and net realizable value. Management regularly assesses inventory valuation based on current and forecasted usage, customer inventory-related contractual obligations, and other lower of cost and net realizable value considerations. If actual market conditions or our customers’ product demands are less favorable than those projected, additional valuation adjustments may be necessary.\nLong-Lived Assets\nWe have recorded intangible assets, including goodwill, in connection with business acquisitions. Estimated useful lives of amortizable intangible assets are determined by management based on an assessment of the period over which the asset is expected to contribute to future cash flows. The fair value of acquired amortizable intangible assets impacts the amounts recorded as goodwill. We review amortizable intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. \nWe perform a goodwill impairment analysis on an annual basis and whenever events or changes in circumstances indicate that the carrying value may not be recoverable. We may elect to perform a qualitative assessment to determine whether it is more likely than not that a reporting unit is impaired. If the qualitative assessment is not performed or if we determine that it is not more likely than not that the fair value of the reporting unit exceeds the carrying value, the recoverability of goodwill is measured at the reporting unit level by comparing the reporting unit’s carrying amount, including goodwill, to the fair value of the reporting unit. If the carrying amount of the reporting unit exceeds its fair value, goodwill is considered impaired, and a loss is recognized in the amount equal to that excess.\nFor further discussion related to impairment analyses performed during fiscal year 2025, and performed as a result of the organizational realignment, refer\n to Note 6\n \n– “Goodwill and Other Intangible Assets” and Note \n14\n – “\nConcentration of Risk and Segment Data\n” to the Consolidated Financial Statements.\nIncome Taxes\nWe estimate our income tax provision in each of the jurisdictions in which we operate, a process that includes estimating exposures related to examinations by taxing authorities. We must also make judgments regarding the ability to realize deferred tax assets. The carrying value of our net deferred tax assets is based on our belief that it is more likely than not that we will generate sufficient future taxable income in certain jurisdictions to realize these deferred tax assets. A valuation allowance has been established for deferred tax assets that we do not believe meet the “more likely than not” criteria. We assess whether an uncertain tax position taken or expected to be taken in a tax return meets the threshold for recognition and measurement in the Consolidated Financial Statements. Our judgments regarding future taxable income as well as tax positions taken or expected to be taken in a tax return may change due to changes in market conditions, changes in tax laws or other factors. If our \n32\nTable of Contents\nassumptions and consequently our estimates change in the future, the valuation allowances and/or tax reserves established may be increased or decreased, resulting in a respective increase or decrease in income tax expense. For further discussion related to our income taxes, refer to Note 16 – “Income Taxes” to the Consolidated Financial Statements.\nRecent Accounting Pronouncements\nS\nee Note 20 – “New Accounting Guidance” to\n the Consolidated Financial Statements for a discussion of recent accounting guidance.\nResults of Operations\nRefer to Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" section contained in our Annual Report on Form 10-K for the fiscal year en\nded August 31, 2024, for the results of operations discussion for the fiscal year ended August 31, 2024, compared to the fiscal year ended August 31, 2023\n.\nNet Revenue\nGenerally, we assess revenue on a global customer basis regardless of whether the growth is associated with organic growth or as a result of an acquisition. Accordingly, we do not differentiate or separately report revenue increases generated by acquisitions as opposed to existing business. In addition, the added cost structures associated with our acquisitions have historically been relatively insignificant when compared to our overall cost structure.\nThe distribution of revenue across our segments has fluctuated, and will continue to fluctuate, as a result of numerous factors, including the following: fluctuations in customer demand; efforts to diversify certain portions of our business; business growth from new and existing customers; specific product performance; and any potential termination, or substantial winding down, of significant customer relationships.\nFiscal Year Ended August 31,\nChange\n(dollars in millions)\n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\nNet revenue\n$\n29,802 \n$\n28,883 \n$\n34,702 \n3.2 \n%\n(16.8)\n%\n2025 vs. 2024 \nNet revenue increased during the fiscal year ended August 31, 2025, compared to the fiscal year ended August 31, 2024. Specifically, the Intelligent Infrastructure segment net revenue increased 34% primarily due to: (i) a 30% increase in revenues from existing customers within our cloud and data center infrastructure business and (ii) a 10% increase in revenues from existing customers within our capital equipment business. The increase was partially offset by a 6% decrease in revenues from existing customers within our networking and communications business. The Connected Living and Digital Commerce segment net revenue decreased 25% due to a 27% decrease in revenues primarily driven by the divestiture of the Mobility Business within our connected living business. The decrease was partially offset by a 2% increase in revenues from existing customers within our digital commerce business. The Regulated Industries segment net revenue decreased 3% primarily due to: (i) a 2% decrease in revenues from existing customers within our automotive and transportation business, and (ii) a 1% decrease in revenues from existing customers within our healthcare and packaging business.  \nThe following table sets forth, for the periods indicated, revenue by segment expressed as a percentage of net revenue:\n \nFiscal Year Ended August 31,\n \n2025\n2024\n2023\nRegulated Industries\n40 \n%\n42 \n%\n38 \n%\nIntelligent Infrastructure\n41 \n%\n32 \n%\n32 \n%\nConnected Living and Digital Commerce\n19 \n%\n26 \n%\n30 \n%\nTotal\n100 \n%\n100 \n%\n100 \n%\n33\nTable of Contents\nThe following table sets forth, for the periods indicated, foreign source revenue expressed as a percentage of net revenue:\nFiscal Year Ended August 31,\n2025\n(1)\n2024\n2023\nForeign source revenue\n75.0 \n%\n82.5 \n%\n85.8 \n%\n(1)\nDecrease from prior periods was primarily driven by domestic revenue growth within our Intelligent Infrastructure segment during the fiscal year ended August 31, 2025 and the divestiture of the Mobility Business during the fiscal year ended August 31, 2024.\nGross Profit\nFiscal Year Ended August 31,\n(dollars in millions)\n2025\n2024\n2023\nGross profit\n$\n2,646 \n$\n2,676 \n$\n2,867 \nPercent of net revenue\n8.9 \n%\n9.3 \n%\n8.3 \n%\n2025 vs. 2024\n \nGross profit as a percentage of net revenue decreased for the fiscal year ended August 31, 2025, compared to the fiscal year ended August 31, 2024, primarily due to product mix in our Connected Living and Digital Commerce and Intelligent Infrastructure segments.\nSelling, General and Administrative\nFiscal Year Ended August 31,\nChange\n(in millions)\n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\nSelling, general and administrative\n$\n1,122 \n$\n1,160 \n$\n1,206 \n$\n(38)\n$\n(46)\n2025 vs. 2024\n \nSelling, general and administrative expenses decreased during the fiscal year ended August 31, 2025, compared to the fiscal year ended August 31, 2024. The decrease is primarily due to: (i) a $17 million decrease in other selling, general and administrative expenses primarily driven by the divestiture of the Mobility Business during the fiscal year ended August 31, 2024, (ii) a $10 million decrease in office and support costs, (iii) a $7 million decrease due to lower salary and salary related expenses, and (iv) a $4 million decrease in business interruption and impairment charges, net.\nResearch and Development\nFiscal Year Ended August 31,\n(dollars in millions)\n2025\n2024\n2023\nResearch and development\n$\n26 \n$\n39 \n$\n34 \nPercent of net revenue\n0.1 \n%\n0.1 \n%\n0.1 \n%\n2025 vs. 2024\n \nResearch and development expenses remained consistent as a percent of net revenue during the fiscal year ended August 31, 2025, compared to the fiscal year ended August 31, 2024.\nAmortization of Intangibles\nFiscal Year Ended August 31,\nChange\n(in millions)\n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\nAmortization of intangibles\n$\n62 \n$\n40 \n$\n33 \n$\n22 \n$\n7 \n34\nTable of Contents\n2025 vs. 2024\n \nAmortization of intangibles increased during the fiscal year ended August 31, 2025, compared to the fiscal year ended August 31, 2024, primarily due to (i) additional amortization associated with intangible assets related to the acquisitions of Mikros Technologies LLC and Pharmaceutics International, Inc. that occurred during the fiscal year ended August 31, 2025 and (ii) amortization related to the Green Point trade name, which was reclassified to a definite-lived intangible asset during the fiscal year ended August 31, 2024.\nRestructuring, Severance, and Related Charges\nFiscal Year Ended August 31,\nChange\n(in millions)\n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\nRestructuring, severance and related charges\n$\n181 \n$\n296 \n$\n57 \n$\n(115)\n$\n239 \n2025 vs. 2024\n \nRestructuring, severance and related charges decreased during the fiscal year ended August 31, 2025, compared to the fiscal year ended August 31, 2024, primarily due to higher restructuring, severance and related charges, related to the 2024 Restructuring Plan, during the fiscal year ended August 31, 2024. The decrease is partially offset by increased restructuring, severance and related charges, related to the 2025 Restructuring Plan, during the fiscal year ended August 31, 2025.\n2025 Restructuring Plan\nOn September 24, 2024, our Board of Directors approved a restructuring plan to align our support infrastructure to further optimize organizational effectiveness. This action includes headcount reductions across our Selling, General and Administrative (“SG&A”) and manufacturing cost base and capacity realignment (the “2025 Restructuring Plan”). The 2025 Restructuring Plan reflects our intention only and restructuring decisions, including the timing of such decisions, at certain locations remain subject to consultation with our employees and their representatives.\nWe expect to recognize approximately $200 million in pre-tax restructuring and other related costs related to the 2025 Restructuring Plan. The restructuring and other related charges are expected to include $60 million to $70 million of employee severance and benefit costs; $65 million to $70 million of asset write-off costs; and $55 million to $65 million of contract termination costs and other related costs. The amount and timing of the actual charges may vary due to a variety of factors, including the finalization of timetables for the transition of functions, consultation with employees and their representatives, as well as the impact of jurisdictional statutory severance requirements. Our estimates for the charges discussed above exclude any potential income tax effects.\n2024 Restructuring Plan\nOn September 26, 2023, our Board of Directors approved a restructuring plan to (i) realign our cost base for stranded costs associated with the sale and realignment of the Mobility Business and (ii) optimize our global footprint. This action includes headcount reductions across our SG&A cost base and capacity realignment (the “2024 Restructuring Plan”). \nThe 2024 Restructuring Plan, totaling approximately $300 million in pre-tax restructuring and other related costs, was substantially complete as of August 31, 2024.\nSee Note 15 – “Restructuring, Severance and Related Charges” to the Consolidated Financial Statements for further discussion of restructuring, severance and related charges.\nLoss (Gain) from the Divestiture of Businesses\nFiscal Year Ended August 31,\nChange\n(in millions)\n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\nLoss (gain) from the divestiture of businesses\n$\n53 \n$\n(942)\n$\n— \n$\n995 \n$\n(942)\n35\nTable of Contents\n2025 vs. 2024\nCharges recorded during the fiscal year ended August 31, 2025, relate primarily to a pre-tax loss of $97 million recognized for the divestiture of our operations in Italy. During the fiscal year ended August 31, 2024, we completed the divestiture of the Mobility Business and recorded a pre-tax gain of $942 million. Certain post-closing adjustments were realized in March 2025, which resulted in the recognition of a $54 million pre-tax gain during the fiscal year ended August 31, 2025.\nSee Note 17 – “Business Acquisitions and Divestitures” to the Consolidated Financial Statements for additional information. \nAcquisition and Divestiture Related Charges\nFiscal Year Ended August 31,\nChange\n(in millions)\n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\nAcquisition and divestiture related charges\n$\n20 \n$\n70 \n$\n— \n$\n(50)\n$\n70 \n2025 vs. 2024\nAcquisition and divestiture related charges decreased during the fiscal year ended August 31, 2025, compared to the fiscal year ended August 31, 2024, primarily due to transaction and disposal costs incurred in connection with the divestiture of the Mobility Business during the fiscal year ended August 31, 2024. The decrease is partially offset by transaction costs incurred in connection with pursuing acquisition opportunities during the fiscal year ended August 31, 2025.\nSee Note 17 – “Business Acquisitions and Divestitures” to the Consolidated Financial Statements for additional information. \nLoss on Securities\nFiscal Year Ended August 31,\nChange\n(in millions)\n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\nLoss on securities\n$\n46 \n$\n— \n$\n— \n$\n46 \n$\n— \n2025 vs. 2024\n \nLoss on securities during the fiscal year ended August 31, 2025, relates to an impairment of an investment in Preferred Stock.  \nOther Expense\nFiscal Year Ended August 31,\nChange\n(in millions)\n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\nOther expense\n$\n97 \n$\n89 \n$\n69 \n$\n8 \n$\n20 \n2025 vs. 2024\n \nOther expense increased during the fiscal year ended August 31, 2025, compared to the fiscal year ended August 31, 2024, primarily due to an increase in fees related to higher utilization on our trade accounts receivable sales programs and global asset-backed securitization program. The increase was partially offset by lower interest rates related to these programs.\nInterest Expense, net\nFiscal Year Ended August 31,\nChange\n(in millions)\n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\nInterest expense, net\n$\n147 \n$\n173 \n$\n206 \n$\n(26)\n$\n(33)\n36\nTable of Contents\n2025 vs. 2024\n \nInterest expense, net decreased during the fiscal year ended August 31, 2025, compared to the fiscal year ended August 31, 2024, due to lower interest rates and lower borrowings primarily on our credit facilities and commercial paper program.\nIncome Tax Expense\nFiscal Year Ended August 31,\nChange\n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\nEffective income tax rate\n26.4 \n%\n20.7 \n%\n35.2 \n%\n5.7 \n%\n(14.5)\n%\n2025 vs. 2024\n \nThe effective income tax rate differed for the fiscal year ended August 31, 2025, compared to the fiscal year ended August 31, 2024, primarily due to: (i) a change in the jurisdictional mix of earnings and (ii) the gain from the divestiture of the Mobility Business and corresponding $58 million of income tax expense during the fiscal year ended August 31, 2024.\nThe Organization for Economic Co-operation and Development (“OECD”) and participating countries continue to work toward the enactment of a 15% global minimum corporate tax rate. Many countries, including countries in which we have tax incentives, have enacted or are in the process of enacting laws based on the OECD’s proposals. These tax changes did not have a material impact to our effective income tax rate for the fiscal year ended August 31, 2025.\nOn July 4, 2025, the U.S. One Big Beautiful Bill Act (“OBBBA”) was enacted which includes permanent extensions of certain expiring provisions of the Tax Cuts and Jobs Act and makes significant modifications to the U.S. international tax framework.  The legislation has multiple effective dates, with certain provisions effective in fiscal year 2025 and others implemented through the fiscal year ended August 31, 2027. The OBBBA did not have a material impact to our consolidated financial statements for the fiscal year ended August 31, 2025; however, we will continue to monitor developments and evaluate any potential future impacts.\nNon-GAAP (Core) Financial Measures\nThe following discussion and analysis of our financial condition and results of operations include certain non-GAAP financial measures as identified in the reconciliation below. The non-GAAP financial measures disclosed herein do not have standard meaning and may vary from the non-GAAP financial measures used by other companies or how we may calculate those measures in other instances from time to time. Non-GAAP financial measures should not be considered a substitute for, or superior to, measures of financial performance prepared in accordance with U.S. GAAP. Also, our “core” financial measures should not be construed as an inference by us that our future results will be unaffected by those items that are excluded from our “core” financial measures.\nManagement believes that the non-GAAP “core” financial measures set forth below are useful to facilitate evaluating the past and future performance of our ongoing manufacturing operations over multiple periods on a comparable basis by excluding the effects of the amortization of intangibles, stock-based compensation expense and related charges, restructuring, severance and related charges, distressed customer charges, loss on disposal of subsidiaries, settlement of receivables and related charges, impairment of notes receivable and related charges, goodwill impairment charges, business interruption and impairment charges, net, (gain) loss from the divestiture of businesses, acquisition and divestiture related charges, loss on debt extinguishment, (gain) loss on securities, income (loss) from discontinued operations, gain (loss) on sale of discontinued operations and certain other expenses, net of tax and certain deferred tax valuation allowance charges. Among other uses, management uses non-GAAP “core” financial measures to make operating decisions, assess business performance and as a factor in determining certain employee performance when evaluating incentive compensation.\nIn fiscal year 2023, the Company adopted an annual normalized tax rate (“normalized core tax rate”) for the computation of the non-GAAP (core) income tax provision to provide better consistency across reporting periods. In estimating the normalized core tax rate annually, the Company utilizes a full-year financial projection of core earnings that considers the mix of earnings across tax jurisdictions, existing tax positions, and other significant tax matters. The Company may adjust the normalized core tax rate during the year for material impacts from new tax legislation or material changes to the Company’s operations.\n \nPrior to fiscal year 2023, the Company determined the tax effect of the items included and excluded from core earnings quarterly.\n37\nTable of Contents\nWe are reporting “core” operating income, “core” earnings and cash flows to provide investors with an additional method for assessing operating income and earnings, by presenting what we believe are our “core” manufacturing operations. A significant portion (based on the respective values) of the items that are excluded for purposes of calculating “core” operating income and “core” earnings also impacted certain balance sheet assets, resulting in a portion of an asset being written off without a corresponding recovery of cash we may have previously spent with respect to the asset. In the case of restructuring, severance and related charges, we may make associated cash payments in the future. In addition, although, for purposes of calculating “core” operating income and “core” earnings, we exclude stock-based compensation expense (which we anticipate continuing to incur in the future) because it is a non-cash expense, the associated stock issued may result in an increase in our outstanding shares of stock, which may result in the dilution of our stockholders’ ownership interest. We encourage you to consider these matters when evaluating the utility of these non-GAAP financial measures.\nAdjusted free cash flow is defined as net cash provided by (used in) operating activities less net capital expenditures (acquisition of property, plant and equipment less proceeds and advances from the sale of property, plant and equipment). We report adjusted free cash flow as we believe this non-GAAP financial measure is useful to investors in measuring our ability to generate cash internally and fund future growth and to provide a return to shareholders.\nIncluded in the tables below are a reconciliation of the non-GAAP financial measures to the most directly comparable U.S. GAAP financial measures as provided in our Consolidated Financial Statements:\nRefer to Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" section contained in our Annual Report on Form 10-K for the fiscal year ended August 31, 2024 for the non-GAAP financial measures discussion for the fiscal year ended August 31, 2024 compared to the fiscal year ended August 31, 2023.\nReconciliation of U.S. GAAP Financial Results to Non-GAAP Measures\n \nFiscal Year Ended August 31,\n(in millions, except for per share data)\n2025\n2024\n2023\nOperating income (U.S. GAAP)\n$\n1,182 \n$\n2,013 \n$\n1,537 \nAmortization of intangibles\n62 \n40 \n33 \nStock-based compensation expense and related charges\n107 \n89 \n95 \nRestructuring, severance and related charges\n(1)\n181 \n296 \n57 \nNet periodic benefit cost\n(2)\n7 \n6 \n11 \nBusiness interruption and impairment charges, net\n(3)\n8 \n16 \n— \nLoss (gain) from the divestiture of businesses\n(4)\n53 \n(942)\n— \nAcquisition and divestiture related charges\n20 \n70 \n— \nAdjustments to operating income\n438 \n(425)\n196 \nCore operating income (Non-GAAP)\n$\n1,620 \n$\n1,588 \n$\n1,733 \nNet income attributable to Jabil Inc. (U.S. GAAP)\n$\n657 \n$\n1,388 \n$\n818 \nAdjustments to operating income\n438 \n(425)\n196 \nLoss on securities\n(5)\n46 \n— \n— \nNet periodic benefit cost\n(2)\n(7)\n(6)\n(11)\nAdjustment for taxes\n(6)\n(52)\n99 \n169 \nCore earnings (Non-GAAP)\n$\n1,082 \n$\n1,056 \n$\n1,172 \nDiluted earnings per share (U.S. GAAP)\n$\n5.92 \n$\n11.17 \n$\n6.02 \nDiluted core earnings per share (Non-GAAP)\n$\n9.75 \n$\n8.49 \n$\n8.63 \nDiluted weighted average shares outstanding (U.S. GAAP and Non-GAAP)\n110.9 \n124.3 \n135.9 \n(1)\nCharges recorded during the fiscal year ended August 31, 2025 and 2024, primarily related to the 2025 Restructuring Plan and 2024 Restructuring Plan, respectively. Charges recorded during the fiscal year ended August 31, 2023, related to headcount reduction to further optimize our business activities.\n(2)\nPension service cost is recognized in cost of revenue and all other components of net periodic benefit cost, including return on plan assets, are presented in other expense. We are reclassifying the pension components in other expense to core operating income as we assess operating performance, inclusive of all components of net periodic benefit cost, with the related revenue. There is no impact to core earnings or diluted core earnings per share for this adjustment.\n38\nTable of Contents\n(3)\nCharges recorded during the fiscal year ended August 31, 2025, relate primarily to costs associated with damage from Hurricanes Helene and Milton, which impacted our operations in St. Petersburg, Florida and Asheville and Hendersonville, North Carolina. Charges recorded during the fiscal year ended August 31, 2024, related to costs associated with product quality liabilities. Charges recorded during the fiscal years ended August 31, 2025, and 2024, are classified as a component of cost of revenue and selling, general and administrative expenses in the Consolidated Statements of Operations.\n(4)\nCharges recorded during the fiscal year ended August 31, 2025, relate primarily to a pre-tax loss of $97 million recognized for the divestiture of our operations in Italy. We completed the divestiture of the Mobility Business and recorded a pre-tax gain of $942 million during the fiscal year ended August 31, 2024. Certain post-closing adjustments were realized in March 2025, which resulted in the recognition of a $54 million pre-tax gain during the fiscal year ended August 31, 2025. \n(5)\nCharges recorded during the fiscal year ended August 31, 2025, relate to an impairment of an investment in Preferred Stock.\n(6)\nTax adjustments for the fiscal year ended August 31, 2025, were partially driven by an income tax benefit associated with a reduction in unrecognized tax benefits from a lapse in statute of limitations. Tax adjustments for the fiscal year ended August 31, 2024, were partially driven by an income tax expense associated with the divestiture of the Mobility Business. The adjustment for taxes for the fiscal year ended August 31, 2023, primarily related to a change in the indefinite reinvestment assertion associated with operations that were classified as held for sale. \nAdjusted Free Cash Flow\n \nFiscal Year Ended August 31,\n (in millions)\n2025\n2024\n2023\nNet cash provided by operating activities (U.S. GAAP)\n$\n1,640 \n$\n1,716 \n$\n1,734 \nAcquisition of property, plant and equipment (“PP&E”)\n(1)\n(468)\n(784)\n(1,030)\nProceeds and advances from sale of PP&E\n(1)\n146 \n123 \n322 \nAdjusted free cash flow (Non-GAAP)\n$\n1,318 \n$\n1,055 \n$\n1,026 \n(1)\nCertain customers co-invest in PP&E with us. As we acquire PP&E, we recognize the cash payments in acquisition of PP&E. When our customers reimburse us and obtain control, we recognize the cash receipts in proceeds and advances from the sale of PP&E.\nQuarterly Results (Unaudited)\nThe following table sets forth certain unaudited quarterly financial information for the three months ended August 31, 2025, and 2024. In the opinion of management, this information has been presented on the same basis as the audited consolidated financial statements appearing elsewhere, and all necessary adjustments (consisting primarily of normal recurring accruals) have been included in the amounts stated below to present fairly the unaudited quarterly results when read in conjunction with the audited consolidated financial statements and related notes thereto. The operating results for any quarter are not necessarily indicative of results for any future period.\nThree Months Ended\n(in millions, except for per share data)\nAugust 31, 2025\nAugust 31, 2024\nNet revenue\n$\n8,252 \n$\n6,964 \nGross profit\n$\n783 \n$\n663 \nOperating income\n$\n337 \n$\n318 \nNet income attributable to Jabil Inc.\n$\n218 \n$\n138 \nEarnings per share – basic\n$\n2.03 \n$\n1.20 \nEarnings per share – diluted\n$\n1.99 \n$\n1.18 \n39\nTable of Contents\nAcquisitions and Divestitures\nAcquisitions\nFiscal Year 2026\nOn September 1, 2025, we completed the acquisition of Rebound Technologies Group Holdings Limited (“Rebound Technologies”) for cash consideration transferred of $134 million. Rebound Technologies is a global supply chain service provider headquartered in the United Kingdom offering end-to-end solutions including global sourcing, data driven analytics, proactive shortage management and obsolescence strategies. The final purchase price is subject to adjustment based on conditions within the purchase agreement. \nFiscal Year 2025\nOn February 3, 2025, we completed the acquisition of Pharmaceutics International, Inc. (“Pii”) for cash consideration transferred of $309 million. The final purchase price is subject to adjustment based on certain customary conditions as outlined in the purchase agreement. Pii is a contract development and manufacturing organization specializing in early stage, clinical, and commercial volume aseptic filling, lyophilization, and oral solid dose manufacturing. The acquisition is expected to enhance our existing Regulated Industries service offerings, which includes the development and commercial production of auto-injectors, pen injectors, inhalers, and on-body pumps. \nThe acquisition of Pii was accounted for as a business combination using the acquisition method of accounting. Assets acquired of $357 million, including $149 million in intangible assets and $142 million in goodwill, and liabilities assumed of $48 million were recorded at their estimated fair values as of the acquisition date. The preliminary estimates and measurements are subject to change during the measurement period for assets acquired, liabilities assumed, and tax adjustments. The excess of the purchase price over the fair value of the acquired assets and assumed liabilities was recorded to goodwill and was fully allocated to the Regulated Industries segment. Goodwill is primarily attributable to expected synergies enabling comprehensive support for customers in drug development, clinical trials, and product commercialization at scale. The majority of the goodwill is currently not expected to be deductible for income tax purposes. The results of operations were included in our consolidated financial results beginning on February 3, 2025. Pro forma information has not been provided as the acquisition of Pii is not deemed to be significant.\nOn October 1, 2024, we completed the acquisition of Mikros Technologies LLC (“Mikros Technologies”) for consideration transferred of $63 million. Mikros Technologies is a leader in the engineering and manufacturing of liquid cooling solutions for thermal management. The final purchase price is subject to adjustment based on certain customary conditions as outlined in the purchase agreement.\nThe acquisition of Mikros Technologies was accounted for as a business combination using the acquisition method of accounting. Assets acquired of $63 million, including $40 million in intangible assets and $17 million in goodwill, were recorded at their estimated fair values as of the acquisition date. The preliminary estimates and measurements are subject to change during the measurement period for assets acquired, liabilities assumed, and tax adjustments. The excess of the purchase price over the fair value of the acquired assets and assumed liabilities was recorded to goodwill and was fully allocated to the Intelligent Infrastructure segment. The majority of the goodwill is currently expected to be deductible for income tax purposes. The results of operations were included in our consolidated financial results beginning on October 1, 2024. Pro forma information has not been provided as the acquisition of Mikros Technologies is not deemed to be significant.\nFiscal Year 2024\nOn November 1, 2023, we completed the acquisition of ProcureAbility Inc. (“ProcureAbility”) for approximately $60 million in cash. ProcureAbility is a procurement services provider specializing in technology-enabled advisory, managed services, digital, staffing, and recruiting solutions.\nThe acquisition of ProcureAbility was accounted for as a business combination using the acquisition method of accounting. Assets acquired of $87 million, including $40 million in intangible assets and $38 million in goodwill, and liabilities assumed of $26 million were recorded at their estimated fair values as of the acquisition date. The excess of the purchase price over the fair value of the acquired assets and assumed liabilities was recorded to goodwill and was fully allocated to the Regulated Industries segment. The majority of the goodwill is currently not expected to be deductible for income tax purposes. The results of operations were included in our consolidated financial results beginning on November 1, 2023. Pro forma information has not been provided as the acquisition of ProcureAbility is not deemed to be significant.\n40\nTable of Contents\nDivestitures\nFiscal Year 2025\nOn August 1, 2025, through our indirect subsidiary, Jabil Circuit Italia S.r.l. (“JCI”), we divested our operations in Italy. As a result of the transaction, we derecognized net assets of approximately $36 million and recorded a pre-tax loss of $97 million during the fiscal year ended August 31, 2025, subject to post-closing adjustments that are still being finalized. As part of the terms of the agreement, we also paid cash consideration of $63 million to the buyer. The operating results of this business were immaterial to our consolidated results of operations.\nFiscal Year 2024\nWe announced on September 26, 2023, that, through our indirect subsidiary, Jabil Circuit (Singapore) Pte. Ltd., a Singapore private limited company (“Singapore Seller”), we agreed to sell to an affiliate of BYD Electronic (International) Co. Ltd., a Hong Kong limited liability company (“Purchaser” or “BYDE”), the Singapore Seller’s product manufacturing business in Chengdu, including its supporting component manufacturing in Wuxi, (the “Mobility Business”), for cash consideration of approximately $2.2 billion, subject to certain customary purchase price adjustments.\nAs of August 31, 2023, we determined the Mobility Business met the criteria to be classified as held for sale. Assets and liabilities classified as held for sale had a carrying value less than the estimated fair value less cost to sell and, thus, no adjustment to the carrying value of the disposal group was necessary. Depreciation and amortization expense for long-lived assets was not recorded for the period in which these assets were classified as held for sale. The divestiture did not meet the criteria to be reported as discontinued operations, and we continued to report the operating results for the Mobility Business in our Consolidated Statements of Operations in the DMS segment until December 29, 2023 (the “Closing Date”).\nOn the Closing Date, we completed the sale of the Mobility Business. As a result of the transaction, we derecognized net assets of approximately $1.2 billion and recorded a pre-tax gain of $942 million in the fiscal year ended August 31, 2024. Certain post-closing adjustments were realized in March 2025, which resulted in the recognition of a $54 million pre-tax gain during the fiscal year ended August 31, 2025. In addition, we agreed to indemnify BYDE from certain liabilities that may arise post-close that relate to periods prior to the Closing Date. We incurred transaction and disposal costs in connection with the sale of approximately $67 million during the fiscal year ended August 31, 2024, which are included in continuing operations in our Consolidated Statements of Operations.\nRefer to Note 17 – “Business Acquisitions and Divestitures” to the Consolidated Financial Statements for discussion.\nLiquidity and Capital Resources\nWe believe that our level of liquidity sources – which includes cash on hand, available borrowings under our revolving credit facilities and commercial paper program, additional proceeds available under our global asset-backed securitization program and under our uncommitted trade accounts receivable sale programs, and cash flows provided by operating activities – and our access to the capital markets will be adequate to fund our capital expenditures, the payment of any declared quarterly dividends, any share repurchases under the approved program, any potential acquisitions, our working capital requirements and our contractual obligations for the next 12 months and beyond. We continue to assess our capital structure and evaluate the merits of redeploying available cash.\nCash and Cash Equivalents\nAs of August 31, 2025, we had approximately $1.9 billion in cash and cash equivalents, of which a significant portion was held by our foreign subsidiaries. Most of our foreign cash and cash equivalents as of August 31, 2025, could be repatriated to the United States without potential tax expense.\n41\nTable of Contents\nNotes Payable and Credit Facilities\nFollowing is a summary of principal debt payments and debt issuance for our notes payable and credit facilities:\n(in millions)\n3.950%\nSenior\nNotes\n3.600%\nSenior\nNotes\n3.000%\nSenior\nNotes\n1.700% \nSenior \nNotes\n4.250% \nSenior \nNotes\n5.450% \nSenior \nNotes\nBorrowings under\nrevolving credit\nfacilities\n(1)(2)\nTotal notes\npayable and\ncredit facilities\nBalance as of August 31, 2023\n$\n497 \n$\n496 \n$\n593 \n$\n498 \n$\n495 \n$\n296 \n$\n— \n$\n2,875 \nBorrowings\n— \n— \n— \n— \n— \n— \n1,992 \n1,992 \nPayments\n— \n— \n— \n— \n— \n— \n(1,992)\n(1,992)\nOther\n1 \n1 \n1 \n1 \n1 \n— \n— \n5 \nBalance as of August 31, 2024\n498 \n497 \n594 \n499 \n496 \n296 \n— \n2,880 \nBorrowings\n— \n— \n— \n— \n— \n— \n1,844 \n1,844 \nPayments\n— \n— \n— \n— \n— \n— \n(1,844)\n(1,844)\nOther\n1 \n1 \n1 \n— \n1 \n1 \n— \n5 \nBalance as of August 31, 2025\n$\n499 \n$\n498 \n$\n595 \n$\n499 \n$\n497 \n$\n297 \n$\n— \n$\n2,885 \nMaturity Date\nJan 12, 2028\nJan 15, 2030\nJan 15, 2031\nApr 15, 2026\nMay 15, 2027\nFeb 1, 2029\nJun 18, 2030\nOriginal Facility/ Maximum Capacity\n$500 million\n$500 million\n$600 million\n$500 million\n$500 million\n$300 million\n$4.0 billion\n(2)\n(1)\nOn June 18, 2025, we entered into a senior unsecured credit agreement (the “Agreement”). The Agreement provides for a five-year revolving credit facility in the initial amount of $3.2 billion (the “Revolving Credit Facility”), which may, subject to the lender’s discretion, potentially be increased by up to an aggregate amount of $1.0 billion. The Revolving Credit Facility expires on June 18, 2030, subject to unlimited successive one-year extension options (subject to the lenders’ discretion), provided that the tenor of the Revolving Credit Facility shall at no time exceed five-years. Interest and fees on advances under the Revolving Credit Facility are based on our non-credit enhanced long-term senior unsecured debt rating as determined by S&P Global Ratings, Moody’s Ratings and Fitch Ratings. In connection with our entry into the Agreement, we terminated our $3.2 billion credit agreement dated January 22, 2020.\nInterest for borrowings under the Revolving Credit Facility is charged at a rate equal to either 0.00% to 0.45% above the base rate or 0.90% to 1.45% above the benchmark rate, as applicable, based on our credit ratings. The base rate represents the greatest of: (i) Citibank, N.A.’s prime rate, (ii) 0.50% above the federal funds rate, and (iii) 1.0% above one-month Term SOFR, but not less than zero. The benchmark rate represents Term SOFR, EURIBOR, TIBOR or Daily Simple SOFR, as applicable, for the applicable interest period, but not less than zero. Fees include a facility fee based on the revolving credit commitments of the lenders and a letter of credit fee based on the amount of outstanding letters of credit.\n(2)\nAs of August 31, 2025, we had $4.0 billion in available unused borrowing capacity under our existing revolving credit facilities, of which $3.2 billion was available under the Revolving Credit Facility. The Revolving Credit Facility acts as the back-up facility for commercial paper outstanding, if any. We have a borrowing capacity of up to $3.2 billion under our commercial paper program. Commercial paper borrowings with an original maturity of 90 days or less are recorded net within the Consolidated Statements of Cash Flows, and have been excluded from the table above.\nIn the ordinary course of business, we have letters of credit and surety bonds with banks and insurance companies outstanding of $92 million as of August 31, 2025. Unused letters of credit were $67 million as of August 31, 2025. Letters of credit and surety bonds are generally available for draw down in the event we do not perform.\nWe have a shelf registration statement with the SEC registering the potential sale of an indeterminate amount of debt and equity securities in the future to augment our liquidity and capital resources.\nOur Senior Notes and our credit facilities contain various financial and nonfinancial covenants. A violation of these covenants could negatively impact our liquidity by restricting our ability to borrow under the notes payable and credit facilities and potentially causing acceleration of amounts due under these notes payable and credit facilities. As of August 31, 2025, and 2024, we were in compliance with our debt covenants. Refer to Note 7 – “Notes Payable and Long-Term Debt” to the Consolidated Financial Statements for further details.\n42\nTable of Contents\nGlobal Asset-Backed Securitization Program\nCertain Jabil entities participating in the global asset-backed securitization program continuously sell designated pools of trade accounts receivable to a special purpose entity, which in turn sells certain of the receivables at a discount to conduits administered by an unaffiliated financial institution on a monthly basis. In addition, a foreign entity participating in the global asset-backed securitization program sells certain receivables at a discount to conduits administered by an unaffiliated financial institution on a daily basis. As these accounts receivable are sold without recourse, we do not retain the associated risks following the transfer of such accounts receivable to the respective financial institutions.\nWe continue servicing the receivables sold and in exchange receive an immaterial servicing fee under the global asset-backed securitization program. In conjunction with our global asset-backed securitization program, we are required to remit amounts collected as a servicer under the global asset-backed securitization program to a special purpose entity. We do not record a servicing asset or liability on the Consolidated Balance Sheets as we estimate that the fee we receive to service these receivables approximates the fair market compensation to provide the servicing activities.\nThe special purpose entity in the global asset-backed securitization program is a wholly owned subsidiary of the Company and is included in our Consolidated Financial Statements. Certain unsold receivables covering up to the maximum amount of net cash proceeds available under the domestic, or U.S., portion of the global asset-backed securitization program are pledged as collateral to the unaffiliated financial institution as of August 31, 2025.\nEffective January 23, 2025, the terms of the global asset-backed securitization program were amended to extend the termination date from January 2025 to January 2028. The maximum amount of net cash proceeds available at any one time is $700 million.\nThe outstanding balance of receivables sold and not yet collected on accounts where we have continuing involvement was approximately $372 million and $338 million as of August 31, 2025, and 2024, respectively. During the fiscal year ended August 31, 2025, we sold $4.2 billion of trade accounts receivable, and we received cash proceeds of $4.1 billion. The receivables that were sold were removed from the Consolidated Balance Sheets and the cash received was included as cash provided by operating activities on the Consolidated Statements of Cash Flows. \nThe global asset-backed securitization program requires compliance with several covenants including compliance with the interest ratio and debt to EBITDA ratio of the Revolving Credit Facility. As of August 31, 2025, we were in compliance with all covenants under our global asset-backed securitization program. Refer to Note 8 – “Asset-Backed Securitization Program” to the Consolidated Financial Statements for further details on the program.\nTrade Accounts Receivable Sale Programs\nFollowing is a summary of the uncommitted trade accounts receivable sale programs with unaffiliated financial institutions. Under the programs we may elect to sell receivables, and the unaffiliated financial institutions may elect to purchase, at a discount, on an ongoing basis (in millions):\nProgram\nMaximum\nAmount\n(1)(2)\nA\n$\n350 \nB\n$\n100 \nC\n1,900 \nCNY\nD\n$\n230 \nE\n$\n170 \nF\n$\n75 \nG\n$\n100 \nH\n$\n2,000 \nI\n$\n250 \nJ\n$\n250 \n(1)\nMaximum amount of trade accounts receivable that may be sold under a facility at any one time.\n(2)\nThe trade accounts receivable sale programs either expire on various dates through 2028 or do not have expiration dates and may be terminated upon election of the Company or the unaffiliated financial institutions.\n43\nTable of Contents\nIn conjunction with our trade accounts receivable sale programs, we are required to remit amounts collected as a servicer under the trade accounts receivable sale programs to the unaffiliated financial institutions that purchased the receivables. The outstanding balance of receivables sold and not yet collected on accounts where we have continuing involvement was approximately $927 million and $367 million as of August 31, 2025, and 2024, respectively. During the fiscal year ended August 31, 2025, we sold $11.4 billion of trade accounts receivable under these programs and we received cash proceeds of $11.3 billion. The receivables that were sold were removed from the Consolidated Balance Sheets and the cash received was included as cash provided by operating activities on the Consolidated Statements of Cash Flows.\nCash Flows\nThe following table sets forth selected consolidated cash flow information (in millions):\n \nFiscal Year Ended August 31,\n \n2025\n2024\n2023\nNet cash provided by operating activities\n$\n1,640 \n$\n1,716 \n$\n1,734 \nNet cash (used in) provided by investing activities\n(714)\n1,351 \n(723)\nNet cash used in financing activities\n(1,204)\n(2,668)\n(680)\nEffect of exchange rate changes on cash and cash equivalents\n10 \n(2)\n(5)\nNet (decrease) increase in cash and cash equivalents\n$\n(268)\n$\n397 \n$\n326 \nOperating Activities\nNet cash provided by operating activities during the fiscal year ended August 31, 2025, was primarily due to non-cash expenses and net income and an increase in accounts payable, accrued expenses and other liabilities. Net cash provided by operating activities was partially offset by an increase in accounts receivable, an increase in inventories, and an increase in prepaid expenses and other current assets. The increase in accounts payable, accrued expenses and other liabilities is primarily due to the timing of purchases and cash payments. The increase in accounts receivable is primarily driven by the timing of collections. The increase in inventories is primarily to support expected sales levels in the first quarter of fiscal year 2026. The increase in prepaid expenses and other current assets is primarily driven by the timing of purchases of customer-controlled consignment components.\nInvesting Activities\nNet cash used in investing activities during the fiscal year ended August 31, 2025, consisted primarily of the acquisition of Pharmaceutics International, Inc., Mikros Technologies, LLC and certain other third-party assets, capital expenditures principally to support ongoing business in the Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce segments and the disposition of the Italy operations, partially offset by proceeds and advances from the sale of property, plant and equipment and a working capital adjustment related to the divestiture of the Mobility Business.\nFinancing Activities\nNet cash used in financing activities during the fiscal year ended August 31, 2025, \nwas primarily due to: (i) \npayments for debt agreements, (ii) the repurchase of our common stock under our share repurchase authorization, (iii) treasury stock minimum tax withholding related to vesting of restricted stock\n, and (iv) dividend payments. \nNet cash used in financing activities\n was partially offset by: (i) borrowings under debt agreements and (ii) net proceeds from exercise of stock options and issuance of common stock under employee stock purchase plan.\nCapital Expenditures\nFor Fiscal Year 2026, we anticipate our net capital expenditures to be in the range of 1.5% to 2.0% of net revenue. In general, our capital expenditures support ongoing maintenance in our Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce segments and investments in capabilities and targeted end markets. The amount of actual capital expenditures may be affected by general economic, financial, competitive, legislative, and regulatory factors, among other things.\nDividends and Share Repurchases\nFollowing is a summary of the dividends and share repurchases for the fiscal years indicated below (in millions):\n44\nTable of Contents\nDividends Paid\n(1)\nShare Repurchases\n(2)\nTotal\nFiscal years 2016 – 2022\n$\n381 \n$\n2,592 \n$\n2,973 \nFiscal year 2023\n$\n45 \n$\n487 \n$\n532 \nFiscal year 2024\n$\n42 \n$\n2,500 \n$\n2,542 \nFiscal year 2025\n$\n36 \n$\n1,000 \n$\n1,036 \nTotal\n$\n504 \n$\n6,579 \n$\n7,083 \n(1)\nThe difference between dividends declared and dividends paid is due to dividend equivalents for unvested restricted stock units that are paid at the time the awards vest.\n(2)\nExcludes commissions and excise taxes.\nWe currently expect to continue to declare and pay regular quarterly dividends in amounts similar to our past declarations. However, the declaration and payment of future dividends are discretionary and will be subject to determination by our Board of Directors each quarter following its review of our financial performance and global economic conditions.\nWe repurchase shares of our common stock under share repurchase programs authorized by our Board of Directors. The following Board approved share repurchase programs were executed through a combination of open market transactions and accelerated share repurchase (“ASR”) agreements (in millions):\nBoard Approval Date\nAmount Authorized\nShares Repurchased\nTotal Cash Utilized\nRemaining Authorization\nAuthorization Completion Date\n2022 Share Repurchase Program\nQ4 FY 2021\n$\n1,000 \n16.5\n$\n1,000 \n$\n— \nQ2 FY 2023\n2023 Share Repurchase Program\nQ1 FY 2023\n$\n1,000 \n2.7\n$\n224 \n(1)\nQ4 FY 2023\nAmended 2023 Share Repurchase Program\nQ1 FY 2024\n$\n2,500 \n20.4\n$\n2,500 \n$\n— \nQ1 FY 2025\n2025 Share Repurchase Program\nQ1 FY 2025\n$\n1,000 \n6.6\n$\n1,000 \n$\n— \nQ4 FY 2025\n2026 Share Repurchase Program\n(2)\nQ4 FY 2025\n$\n1,000 \n0.6\n$\n135 \n$\n865 \n(1)\nIn September 2023, the Board of Directors amended and increased the 2023 Share Repurchase Program to allow for the repurchase of up to $2.5 billion of our common stock. \n(2)\nAs of October 10, 2025, 0.6 million shares had been repurchased for $135 million and $865 million remains available under the 2026 Share Repurchase Program.\nUnder ASR agreements, we make payments to the participating financial institutions and receive an initial delivery of shares of common stock. The final number of shares delivered upon settlement of the ASR agreements is determined based on a discount to the volume weighted average price of our common stock during the term of the agreements. At the time the shares are received by the Company, the initial delivery and the final receipt of shares upon settlement of the ASR agreements results in an immediate reduction of the outstanding shares used to calculate the weighted-average common shares outstanding for basic and diluted earnings per share.\nThe terms of ASR agreements, structured as outlined above, were as follows (in millions, except average price):\nAgreement Execution Date\nAgreement Settlement Date\nAgreement Amount\nInitial Shares Delivered\nAdditional Shares Delivered\nTotal Shares Delivered\nAverage Price Paid Per Share\nQ1 FY 2024\nQ1 FY 2024\n$\n500 \n3.3\n0.6\n3.9\n$\n128.61 \nQ4 FY 2024\nQ1 FY 2025\n(1)\n$\n555 \n4.2\n1.0\n5.2\n$\n107.08 \nQ2 FY 2025\nQ3 FY 2025\n(2)\n$\n310 \n1.8\n0.2\n2.0\n$\n154.44 \nQ3 FY 2025\nQ4 FY 2025\n(3)\n$\n309 \n1.8\n0.0\n1.8\n$\n171.91 \n(1)\nIn September 2024, as part of the amended 2023 Share Repurchase Program, an ASR transaction was completed, and 1.0 million additional shares were delivered under the Q4 FY 2024 ASR agreements. \n(2)\nIn December 2024, as part of the 2025 Share Repurchase Program, we entered into ASR agreements to repurchase $310 million, excluding excise tax, of our common stock. Under the ASR agreements, we made payments of $310 million to participating financial institutions and received an initial delivery of shares of common stock. In March 2025, the ASR transaction was completed, and 0.2 million additional shares were delivered under the Q2 FY 2025 ASR agreements.\n(3)\nIn March 2025, as part of the 2025 Share Repurchase Program, we entered into ASR agreements to repurchase $309 million, excluding excise tax, of our common stock. Under the ASR agreements, we made payments of $309 million to \n45\nTable of Contents\nparticipating financial institutions and received an initial delivery of shares of common stock. In July 2025, the ASR transaction was completed and no additional shares were delivered under the Q3 FY 2025 ASR agreements.\nIn addition, we repurchased shares of our common stock through the open market as follows (in millions):\nFiscal Year Ended August 31,\n2025\n2024\n2023\nShares\nCost\nShares\nCost\nShares\nCost\nOpen market share repurchases\n(1)\n2.8\n$\n377 \n11.3\n$\n1,445 \n6.7\n$\n487 \n(1)\nAs of October 10, 2025, 0.6 million shares had been repurchased for $135 million through open market transactions under the 2026 Share Repurchase Program. \nWarrants\nOn December 27, 2024, we issued a warrant (the “Warrant”) to Amazon.com NV Investment Holdings LLC (“Warrantholder”) to acquire up to 1,158,539 of our ordinary shares (“Warrant Shares”) at an initial exercise price of $137.7671 per share, which is the preceding 30 trading day VWAP. The Warrant allows for cashless exercise and expires December 27, 2031. The Warrant Shares are subject to vesting for payments for purchased products and services over the seven-year Warrant term, with 59,582 of the Warrant Shares having vested upon issuance.\nUpon the consummation of an acquisition transaction (as defined in the Warrant), subject to certain exceptions, the unvested portion of the Warrant will vest in full. So long as the Warrant is unexercised, the Warrant does not entitle the Warrantholder to any voting rights or any other common stockholder rights. The exercise price and the number of Warrant Shares are subject to customary anti-dilution adjustments.\nThe estimated fair value of the Warrant was determined as of the issuance date, using the Black-Scholes option pricing model. The following assumptions were used in the model: \nDecember 27, 2024\nStock price\n$\n145.92\nExercise price\n$\n137.77\nExpected life\n7.0 years\nExpected volatility\n(1)\n34.4 \n%\nRisk-free interest rate\n4.5 \n%\n(1)\nThe expected volatility was estimated using the historical volatility derived from the Company’s common stock.\nThe following table summarizes the Warrant activity for the fiscal year ended August 31, 2025:\nWarrant Shares\nOutstanding as of August 31, 2024\n— \nChanges during the period\nShares granted\n1,158,539 \nShares vested\n(59,582)\nOutstanding as of August 31, 2025\n1,098,957 \nExercisable as of August 31, 2025\n59,582 \nContractual Obligations\nOur contractual obligations as of August 31, 2025, are summarized below. As disclosed below, while we have certain non-cancelable purchase order obligations for property, plant and equipment, we generally do not enter into non-cancelable purchase orders for materials until we receive a corresponding purchase commitment from our customer. Non-cancelable purchase orders do not typically extend beyond the normal lead time of several weeks, at most. Purchase orders beyond this time frame are typically cancellable.\n46\nTable of Contents\n \nPayments due by period (in millions)\n \nTotal\nLess than 1\nyear\n1-3 years\n3-5 years\nAfter 5 years\nNotes payable and long-term debt\n$\n2,885 \n$\n499 \n$\n996 \n$\n795 \n$\n595 \nFuture interest on notes payable and long-term debt\n(1)\n322 \n99 \n148 \n68 \n7 \nOperating lease obligations\n(2)\n594 \n112 \n165 \n118 \n199 \nFinance lease obligations\n(2)(3)(4)\n422 \n208 \n65 \n30 \n119 \nNon-cancelable purchase order obligations\n(5)\n625 \n313 \n254 \n58 \n— \nPension and postretirement contributions and payments\n(6)\n68 \n32 \n6 \n7 \n23 \nTotal contractual obligations\n(7)\n$\n4,916 \n$\n1,263 \n$\n1,634 \n$\n1,076 \n$\n943 \n(1)\nConsists of interest on notes payable and long-term debt outstanding as of August 31, 2025. \n(2)\nExcludes $176 million of payments related to leases signed but not yet commenced. Additionally, certain leases signed but not yet commenced contain residual value guarantees and purchase options not deemed probable. \n(3)\nIncludes $144 million of payments related to a lease with a variable interest entity (“VIE”), for which the Company is not the primary beneficiary. This is also the Company’s maximum exposure to loss related to the VIE.\n(4)\nExcludes $280 million of residual value guarantees that could potentially come due in future periods. The Company does not believe it is probable that any amounts will be owed under these guarantees. Therefore, no amounts related to the residual value guarantees are included in the lease payments used to measure the right-of-use assets and lease liabilities.\n(5)\nConsists of purchase commitments entered into as of August 31, 2025, primarily for property, plant and equipment and software pursuant to legally enforceable and binding agreements.\n(6)\nIncludes the estimated company contributions to funded pension plans during fiscal year 2026 and the expected benefit payments for unfunded pension and postretirement plans from fiscal years 2026 through 2035. These future payments are not recorded on the Consolidated Balance Sheets but will be recorded as incurred.\n(7)\nAs of August 31, 2025, we have $109 million recorded as a long-term liability for uncertain tax positions. In addition, we agreed to indemnify BYDE from certain liabilities that may arise post-close that relate to periods prior to the Closing Date. We are not able to reasonably estimate the timing of payments, or the amount by which these liabilities will increase or decrease over time, and accordingly, they have been excluded from the above table.",
  "item2": null
}