{
  "source_file": "jci-20250930.htm",
  "form_type": "10-K",
  "item1": "ITEM 1\n    \nBUSINESS\nGeneral\nJohnson Controls International plc, headquartered in Cork, Ireland, is a global leader in smart, healthy and sustainable buildings, serving a wide range of customers around the globe. The Company’s products, services, systems and solutions advance the safety, comfort and intelligence of spaces to serve people, places and the planet. The Company is committed to helping its customers win and creating greater value for all of its stakeholders through its strategic focus on buildings.\nJohnson Controls was originally incorporated in the state of Wisconsin in 1885 as Johnson Electric Service Company to manufacture, install and service automatic temperature regulation systems for buildings and was renamed Johnson Controls, \n3\nInc. in 1974. In 2005, Johnson Controls acquired York International, a global supplier of heating, ventilating and air-conditioning (\"HVAC\") and refrigeration equipment and services. Following this acquisition, Johnson Controls continued to expand its portfolio of building-related product and service offerings. In 2016, Johnson Controls, Inc. and Tyco International plc (\"Tyco\") completed their combination (the \"Merger\"), combining Johnson Controls' portfolio of building efficiency solutions with Tyco’s portfolio of fire and security solutions. Following the Merger, Tyco changed its name to “Johnson Controls International plc.”\nOn July 31, 2025, the Company completed the divestiture of its Residential and Light Commercial (\"R&LC\") HVAC business to Robert Bosch GmbH (“Bosch”). The R&LC HVAC business included the Company's North America Ducted business and Johnson Controls-Hitachi Air Conditioning Holding (UK) Ltd., the Company’s global residential joint venture with Hitachi Global Life Solutions, Inc.\nThe Company is a global leader in engineering, manufacturing, commissioning and retrofitting building products and systems, including\n \ncommercial HVAC equipment, industrial refrigeration systems, controls, security systems, fire-detection systems and fire-suppression solutions. The Company further serves customers by providing technical services, including maintenance, management, repair, retrofit and replacement of equipment (in the HVAC, industrial refrigeration, security and fire-protection space), and energy-management consulting. The Company's OpenBlue digital software platform enables enterprises to better manage their physical spaces by combining the Company's building products and services with cutting-edge technology and digital capabilities to enable data-driven “smart building” services and solutions. The Company partners with customers by leveraging its broad product portfolio with digital capabilities, together with its direct channel service and solutions capabilities, to deliver solutions and services addressing distinct and diverse operating environments and regulatory requirements that address customers’ needs in their core missions.  \nBusiness Segments\nIn connection with the divestiture of the R&LC HVAC business, the Company realigned its organizational structure into three regional reporting segments (Americas, EMEA and APAC) from four reporting segments (Global Products, Building Solutions North America, Building Solutions EMEA/LA and Building Solutions APAC). The Company implemented this change effective April 1, 2025 as part of ongoing initiatives to drive simplification, accelerate growth, better reflect its organizational and operational structure and align with the manner in which the Company's chief operating decision maker assesses performance and makes decisions regarding the allocation of resources following portfolio simplification actions. As a result, the Company conducts its business through three operating segments, all of which are reportable segments: \n•\nAmericas,\n which designs, manufactures, sells, installs and services HVAC, controls, building management, refrigeration, integrated electronic security systems, integrated fire detection and suppression systems, and digital (software) solutions for commercial, industrial, data center, institutional and governmental customers in the Americas (United States, Canada, and Latin America – Central and South America). Americas also provides energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven \"smart building\" solutions, to the Americas marketplace.\n•\nEMEA,\n which designs, manufactures sells, installs and services HVAC, controls, building management, refrigeration, integrated electronic security systems, integrated fire detection and suppression systems, and digital (software) solutions for commercial, residential security (Subscriber business), industrial, data center, institutional, governmental, and marine customers and provides technical services, including data-driven “smart building” solutions, to markets in Europe, the Middle East and Africa.\n•\nAPAC, \nwhich designs, manufactures, sells, installs, and services HVAC, controls, building management, refrigeration, integrated electronic security systems, integrated fire detection and suppression systems, and digital (software) solutions for commercial, industrial, data center, institutional, and governmental customers and provides technical services, including data-driven “smart building” solutions, to the Asian and Pacific marketplaces.\nFor more information on the Company’s segments, refer to Note 18, \"Segment Information,\" of the notes to consolidated financial statements.\nProducts, Systems, Services and Solutions\nThe Company sells and installs its commercial HVAC equipment and systems, control systems, security systems, fire-detection and fire suppression systems, equipment and services primarily through its extensive direct channel, consisting of a global \n4\nnetwork of sales and service offices. Significant sales are also generated through global third-party channels, such as distributors of air-conditioning, controls, security and fire-detection and suppression products. The Company’s large base of current customers leads to significant repeat business for the maintenance, retrofit and replacement markets. The Company is also able to leverage its installed base to generate sales for its service business. Trusted building brands, such as YORK®,  Metasys®, Ansul®, Frick®, FM:Systems®, PENN®, Sabroe®, Silent-Aire®, Simplex® and Grinnell®, together with the breadth and depth of the products, systems and solutions offered by the Company, give it what it believes to be the most diverse portfolio in the building technology industry.\nThe Company has developed software platforms, including on-premises platforms and cloud-based software services, and integrated its products and services with digital capabilities to provide data-driven solutions to create smarter, safer and more sustainable buildings. The Company's OpenBlue platform combines the Company’s building expertise with cutting-edge technology, including artificial intelligence and machine learning-powered service solutions such as remote diagnostics, predictive maintenance, workplace management, compliance monitoring and advanced risk assessments. The Company leverages its product portfolio and service network, together with digital and data-driven technologies to offer integrated and customizable solutions focused on delivering outcomes to customers. These services are generally designed to generate recurring revenue for the Company as it supports its customers in achieving their desired outcomes. \nIn fiscal 2025, products and systems accounted for approximately 68% of sales from continuing operations and services accounted for 32% of sales from continuing operations.\nCompetition\nThe Company conducts its operations through a significant number of individual contracts that are either negotiated or awarded on a competitive basis. Key factors in the award of contracts include system and service performance, quality, price, design, reputation, technology, application engineering capability, availability of financing and construction or project management expertise. Competitors for HVAC equipment, security, fire detection, fire suppression and controls in the residential and non-residential marketplace include many local, regional, national and international providers. Larger competitors include Honeywell International, Inc.; Siemens Smart Infrastructure, an operating group of Siemens AG; Schneider Electric SA; Carrier Global Corporation; Trane Technologies plc; Vertiv Holdings Co., API Group and Daikin Industries, Ltd. In addition, the Company competes in a highly fragmented building services market. The Company also faces competition from a diverse range of established companies, start-ups and other emerging entrants to the buildings industry in the areas of digital services, software as a service and the Internet of Things. The loss of any individual contract or customer would not have a material adverse effect on the Company.\nBusiness Strategy\nThe Company’s business strategy is to sustain and expand its position as a leader in commercial building technology and solutions by developing and implementing solutions designed to address its customers’ vertical specific needs in their core missions. In 2024 and 2025, the Company acted to optimize its core commercial buildings portfolio with the divestitures of its Air Distribution Technologies and R&LC HVAC businesses. Following these portfolio optimization actions, the Company’s core strategy remains advancing smart, healthy and sustainable buildings to power its customers’ missions, enabled by a simpler, more focused company focused on driving growth, profit, and cash flow.\nThe Company has leading positions in attractive and growing end-markets across HVAC, controls, fire, security and services, enhanced by its comprehensive product portfolio, significant installed base and substantial field position. The Company believes that it is well positioned to capitalize on the emerging and prevalent trends in the commercial buildings industry, including data centers, sustainable buildings, smart buildings and mission-critical environments. To capitalize on these trends, the Company is focused on offering differentiated services and solutions designed to address its customers’ vertical specific needs in their core missions. In furtherance of these goals, the Company has four strategic priorities:\nCapitalize on Key Growth Vectors: \nData centers, decarbonization, sustainable buildings, smart buildings, energy efficiency and mission-critical environments represent key growth opportunities for the Company. The Company seeks to leverage its existing portfolio breadth and investments in product development, combined with the expansion of its digital products and capabilities powered by OpenBlue, to offer differentiated solutions and innovative deal structures to help customers achieve their objectives. The Company intends to expand its capabilities by investing in products and technologies, as well as expanding its partnerships, to power innovation that will allow it to provide differentiated services that are tailored to its customers’ desired outcomes. \n5\nBringing Value Across the Building Lifecycle\n: The Company provides system and service solutions that maximize the opportunities around the lifecycle of the building, delivering outcomes to the customer that save energy, reduce emissions, maintain uptime, and optimize building lifecycle costs while delivering mission-critical environments and improving the overall occupant experience. The Company’s ability to drive direct, integrated solutions within multiple domains enables opportunities for attachment, cross-selling, recurring revenue, and developing long-term relationships with customers from installation to service, retrofit, and replacement.\nAccelerate in High Growth Verticals\n: The Company is focused on driving growth and profit by developing and implementing solutions designed to address its customers’ vertical specific needs in their core missions, enabled by the Company’s installed base, domain expertise and global coverage. The Company further intends to expand its presence in high growth verticals within the markets it serves, including data centers, hospitals, university campuses, advanced manufacturing, class A offices, and airports. \nSustain a High-Performance, Customer-Centric Culture\n: The Company recognizes that developing talent and creating positive customer experiences is central to accomplishing its business strategies. The Company is investing in its talent to build a workforce that is digitally capable, solutions oriented and focused on continuous learning and growth. The Company aims to leverage its talent capabilities and training to create a customer-focused culture to drive customer loyalty and decisions.\nTo realize these priorities, the Company is leveraging its technology leadership, product portfolio, global presence, substantial installed base, sizable field position and strong channels to monetize the lifecycle opportunities of systems, service, retrofit and replacement. The Company is augmenting its strategic priorities with disciplined execution, productivity enhancements and sustainable cost management to create a path to realize expanded margins and enhanced profitability. \nBacklog and Orders\nBacklog and orders are additional metrics that are meant to provide management with a deeper level of insight into the progress of specific strategic and growth initiatives. Backlog is applicable to sales of both products and systems and services and totaled $16.6 billion at September 30, 2025. Orders provide management with a signal of customer demand for the Company's products and services, as well as an indication of future revenues and performance. However, the timing and conversion of backlog and orders are subject to numerous uncertainties and risks and are not necessarily indicative of the amount of revenue to be earned in the upcoming fiscal year. \nThe following table summarizes backlog and orders by segment for the Systems and Services based businesses: \n \nBacklog\nOrders\n(in billions)\nSeptember 30, 2025\nYear-over-Year Change \n(1)\nYear Ended September 30, 2025\nYear-over-Year Change \n(1)\nAmericas\n$\n10.6 \n13 \n%\n$\n13.7 \n8 \n%\nEMEA\n2.5 \n12 \n%\n4.4 \n6 \n%\nAPAC\n1.8 \n17 \n%\n2.6 \n3 \n%\n Total Building Solutions\n$\n14.9 \n13 \n%\n$\n20.7 \n7 \n%\n(1)\n Change is compared to September 30, 2024 (backlog) and the year ended September 30, 2024 (orders) and excludes the impact of acquisitions, dispositions and foreign currency.\nRemaining performance obligations were $22.7 billion at September 30, 2025. Differences between the Company’s remaining performance obligations and backlog are primarily due to:\n•\nRemaining performance obligations include large, multi-purpose contracts to construct hospitals, schools and other governmental buildings, which are services to be performed over the building's lifetime with average initial contract terms of 25 to 35 years for the entire term of the contract versus backlog which includes only the lifecycle period of these contracts which approximates five years;\n•\nRemaining performance obligations exclude service contracts with an original expected duration of one year or less and contracts that are cancellable without substantial penalty versus backlog which includes short-term and cancellable contracts; and\n•\nRemaining performance obligations include the full remaining term of service contracts with substantial termination penalties versus backlog which includes only one year for all outstanding service contracts. \n6\nThe Company reports backlog, which it believes is a useful measure of evaluating the Company's operational performance and relationship to total orders. \nRaw Materials\nRaw materials used by the Company’s businesses in connection with their operations include steel, aluminum, brass, copper, polypropylene and certain fluorochemicals used in fire suppression agents. The Company also uses semiconductors and other electronic components in the manufacture of its products. At times, the Company has experienced material cost increases due to global inflation, supply chain disruptions, labor shortages, increased demand and other regulatory and macroeconomic factors. Recently, the Company has experienced increased raw material costs due to tariffs and reciprocal tariffs imposed by the United States and other nations. Although the Company has been largely able to mitigate the impact of tariffs that have been enacted to date, if additional tariffs and reciprocal tariffs are implemented (whether as currently proposed or otherwise), such actions could negatively impact the Company's revenue growth and margins in future periods through decreased sales and increased cost of goods sold, as discussed in Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations. The Company could experience further disruptions, shortages, tariffs and price inflation in the future, the effect of which will depend on the Company’s ability to successfully mitigate and offset the impact of these events. In fiscal 2026, commodity prices and availability could fluctuate throughout the year and could significantly affect the Company’s results of operations. For a more detailed description of the risks related to the availability of raw materials, components and commodities, see Item 1A. Risk Factors.\nIntellectual Property\nGenerally, the Company seeks statutory protection for strategic or financially important intellectual property developed in connection with its business. The Company protects its intellectual property investments in a variety of ways. The Company works actively in the U.S. and internationally to ensure the enforcement of copyright, trademark, trade secret, and other protections that apply to the Company's products, services, software, solutions, and branding. Certain intellectual property, where appropriate, is protected by contracts, licenses, confidentiality or other agreements.\nThe Company owns numerous U.S. and non-U.S. patents (and their respective counterparts), the more important of which cover those technologies and inventions embodied in current products or which are used in the manufacture of those products. Internal development allows the Company to maintain competitive advantages that come from product differentiation and closer technical control over its products and services. While the Company believes patents are important to its business operations and in the aggregate constitute a valuable asset, no single patent, or group of patents, is critical to the success of the business. The Company, from time to time, grants licenses under its patents and technology and receives licenses under patents and technology of others.\nThe Company’s trademarks, certain of which are material to its business, are registered or otherwise legally protected in the U.S. and many non-U.S. countries where products and services of the Company are sold. The Company, from time to time, becomes involved in trademark licensing transactions.\nMost works of authorship produced for the Company, such as computer programs, catalogs and sales literature, carry appropriate notices indicating the Company’s claim to copyright protection under U.S. law and appropriate international treaties.\nEnvironmental, Health and Safety Matters\nLaws addressing the protection of the environment and workers’ safety and health govern the Company’s ongoing global operations. They generally provide for civil and criminal penalties, as well as injunctive and remedial relief, for noncompliance or require remediation of sites where Company-related materials have been released into the environment.\nA portion of the Company’s products consume energy and use refrigerants. Increased public awareness and concern regarding global climate change has resulted in more regulations designed to reduce greenhouse gas emissions. These regulations tend to be implemented under global, national and sub-national climate objectives or policies, and target the global warming potential (“GWP”) of refrigerants, equipment energy efficiency, and the combustion of fossil fuels as a heating source. The Company continues to invest in its product portfolio to meet or exceed emerging emissions regulations and standards.\nThe Company has expended substantial resources globally, both financial and managerial, to comply with environmental laws and worker safety laws and maintains procedures designed to foster and ensure compliance. Certain of the Company’s businesses are, or have been, engaged in the handling or use of substances that may impact workplace health and safety or the \n7\nenvironment. The Company is committed to protecting its workers and the environment against the risks associated with these substances.\nThe Company’s operations and facilities have been, and in the future may become, the subject of formal or informal enforcement actions or proceedings for noncompliance with environmental laws and worker safety laws or for the remediation of Company-related substances released into the environment. Such matters typically are resolved with regulatory authorities through commitments to compliance, abatement or remediation programs and, in some cases, payment of penalties. In addition, governments in the United States and internationally have increasingly been regulating perfluorooctane sulfonate (\"PFOS\"), perfluorooctanoic acid (\"PFOA\"), and/or other per- and poly-fluoroalkyl substances (\"PFAS\"), which were contained in certain of the Company's legacy firefighting foam products. These regulations include declining emission standards and limits set as to the presence of certain compounds. See Note 20, \"Commitments and Contingencies,\" of the notes to consolidated financial statements for further discussion of environmental matters.\nGovernment Regulation and Supervision\nThe Company's operations are subject to numerous federal, state and local laws and regulations, both within and outside the United States, in areas such as consumer protection, government contracts, international trade, environmental protection, labor and employment, tax, licensing and others. For example, most U.S. states and non-U.S. jurisdictions in which the Company operates have licensing laws directed specifically toward the alarm and fire suppression industries. The Company's security businesses currently rely extensively upon the use of wireline and wireless telephone service to communicate signals. Wireline and wireless telephone companies in the U.S. are regulated by the federal and state governments. In addition, government regulation of fire safety codes can impact the Company's fire businesses. The Company’s businesses may also be affected by changes in governmental regulation of refrigerants, PFAS, energy efficiency standards, noise regulation and product safety regulations, including changes related to hydro fluorocarbons/emissions reduction efforts, energy conservation standards and the regulation of fluorinated gases. These and other laws and regulations impact the manner in which the Company conducts its business, and changes in legislation or government policies can affect the Company's worldwide operations, both favorably and unfavorably. For a more detailed description of the various laws and regulations that affect the Company's business, see Item 1A. Risk Factors.\nRegulatory Capital Expenditures\nThe Company’s efforts to comply with numerous federal, state and local laws and regulations applicable to its business and products often results in capital expenditures. The Company makes capital expenditures to design and upgrade its fire and security products to comply with or exceed standards applicable to the alarm, fire suppression and security industries. The Company also makes capital expenditures to meet or exceed energy efficiency standards and comply with applicable regulations, including the regulation of refrigerants, hydro fluorocarbons/emissions reduction efforts and the regulation of fluorinated gasses, particularly with respect to its HVAC products and solutions. The Company’s ongoing environmental compliance program also results in capital expenditures. Regulatory and environmental considerations are a part of all significant capital expenditure decisions; however, expenditures in fiscal 2025 related solely to regulatory compliance were not material. It is management’s expectation that the amount of any future capital expenditures related to compliance with any individual regulation or grouping of related regulations will not have a material adverse effect on the Company’s financial results or competitive position in any one year. See Note 20, \"Commitments and Contingencies,\" of the notes to consolidated financial statements for further discussion of environmental matters.\nSeasonal Factors\nCertain of the Company's sales are seasonal as the demand for certain air conditioning equipment and services generally increases in the summer months. This seasonality is mitigated by the other products and services provided by the Company that have no material seasonal effect.\n8\nResearch and Development Expenditures\nRefer to Note 1, \"Summary of Significant Accounting Policies,\" of the notes to consolidated financial statements for research and development expenditures. The Company has committed to invest a substantial portion of its new product research and development in developing products and services supporting energy efficiency, decarbonization and mission-critical environments. The Company invests in enhancements to the capabilities of its product lines and services to support its strategy, meet consumer preferences and achieve regulatory compliance. This includes investments in the development of the Company’s OpenBlue platform and related service offerings, digital product capabilities, energy efficient products, and low GWP refrigerants and technology.\nHuman Capital Management\nOverview and Governance\nThe development of a High-Performance Culture enables the Company to achieve its purpose to build smarter, healthier, and more sustainable tomorrows.  As the Company enters its next 140 years of innovation leadership, people are at the center of how it delivers value to customers. The Company’s strategic drivers provide the direction that guides its workforce toward a culture of continuous improvement and innovation to exceed customers’ expectations and provide solutions for global challenges in the building systems industry.\nThe responsibility to develop and maintain a High-Performance Culture is owned, embedded and executed throughout the Company. The Chief Human Resources Officer (\"CHRO\") is responsible for establishing and driving the execution of the Company’s High-Performance Culture strategy, ensuring that the Company presents an employee value proposition that supports retention and the attraction of external talent. The Company’s Board of Directors provides oversight of the Company’s High-Performance Culture, with the Compensation and Talent Development Committee overseeing the Company’s High-Performance Culture strategy and the Governance and Sustainability Committee overseeing employee health and safety. The Chief Executive Officer (\"CEO\"), the CHRO, the General Counsel, the Vice President of Global Environment Health & Safety, the Vice President of Employee Engagement and Inclusion and other senior leaders within the Company are responsible for the execution of the High-Performance Culture strategy and engage with the Compensation and Talent Development Committee, the Governance and Sustainability Committee and the full Board of Directors on the critical components driving the Company’s High-Performance Culture, including discussions of future of work, human capital trends, processes and practices, engagement and inclusion, health and safety, talent development, company culture and succession planning. \nKey components driving the Company’s High-Performance Culture include:\nHealth and Safety\nHealth and Wellness, Safety and Environment are the three pillars of the Company’s Zero Harm vision. The Company’s health and safety programs are designed around global standards with appropriate variations addressing multiple jurisdictions and regulations, specific hazards and unique working environments of the Company’s manufacturing, service, systems, and headquarter operations.\nThe Company requires each of its locations to perform regular safety audits to ensure proper safety policies, program procedures, analyses and training are in place. In addition, the Company engages an independent third-party conformity assessment and certification vendor to audit selected operations for adherence to its global health and safety standards. Cultural and values-based safety initiatives have been deployed within the Company to sustain and further enhance performance.\nThe Company utilizes a mixture of leading and lagging indicators to assess the health and safety performance of its operations. Lagging indicators include the OSHA Total Recordable Incident Rate (\"TRIR\") and the Lost Time (or Lost Workday) Incident Rate (\"LTIR\") based upon the number of incidents per 100 employees (or per 200,000 work hours). In fiscal 2025, the Company had a TRIR of 0.34 and a LTIR of 0.15.\n Employee Engagement and Inclusion\nThe Company is dedicated to creating a workplace where uniqueness is celebrated and where every employee feels valued and included. The Company aims to foster a culture of engagement, innovation, collaboration, and respect that drives its success in the global marketplace. Employee engagement and inclusion (“EEI”) is a component of the Company’s strategy to drive a High-Performance Culture, recognized as adding value to the Company’s creation and delivery of innovative high performing \n9\nproducts and enabling solutions to its customers’ toughest problems. The Company empowers employees to take an active role in creating a culture that values uniqueness, celebrates creativity and drives innovation. \nThe Company encourages employees to enable an inclusive culture through active participation in Business Resource Groups (\"BRGs\") - employee-led voluntary organizations of people with similar interests, experiences, or personal characteristics, which supports the acquisition and development of high-performing talent both internally and externally.\nThe Company recognizes that fostering an engaged and inclusive environment requires ongoing commitment, accountability, and continuous improvement. The Company regularly assesses its progress, recognizes employee contributions, and holds leaders accountable for driving initiatives. The Company has created mechanisms for open dialogue and feedback from employees to ensure that everyone’s voices are heard.\nThe Company has implemented several measures that focus on ensuring accountabilities exist for fostering an engaged and inclusive environment.\n•\nOrganizational Engagement: \nThe Company measures the engagement of its employees using a quarterly pulse survey initially launched in fiscal 2023. The engagement survey provides managers with their own data dashboard to view their own engagement results and can be utilized by managers at all levels to understand how to improve the Company’s culture and employee engagement. Managers are provided with resources to interpret their results and plan their actions following each survey, ensuring that all managers are reinforcing a continuous improvement culture.\n•\nInclusion and Engagement Objectives: \nThe CEO and other senior leaders have inclusion and engagement objectives in their annual performance goals.\n•\nAttracting High-Performing Talent:\n The Company attracts high-performing talent by delivering a market and persona-based employee value proposition which incorporates the Company’s mission. BRGs support these efforts through external engagement and talent acquisition sourcing initiatives. \n•\nHonoring Employee Contributions: \nThe Company provides formal recognition and encouragement for workforce contributions to the Company’s EEI efforts. Awarded to eight employees three times per year, the nomination driven Inclusion Distinction Awards have become a highly regarded recognition of an employee’s contribution to creating an inclusive culture at the Company.\nTalent Development\nThe Company must ensure the continued development and advancement of its employees to maintain a High-Performance Culture. The Company has adopted a continuous improvement approach to talent development, working to support employees’ growth while defining the skills and capabilities the organization will need in future years. To assess current enterprise capabilities and define future needs, strategic talent reviews and succession planning occur on a planned cadence annually – globally and across all business areas. The Company continues to provide opportunities for its employees to grow their careers, with more than two-thirds of open management positions filled internally during fiscal 2025.\nThe Company believes that high performance is an outcome of an employee’s ability to change, adapt, and grow their capabilities throughout their career. This talent development approach includes self and multi-rater assessments, functional and leadership competency models, providing employees a personalized approach to their development planning and skill acquisition. The Company emphasizes real-life, real-time learning that enables each employee to meet the demands of challenging and changing work and focuses on reinforcing key principles that are designed to support an individual’s effectiveness in his or her current job and in their future development. The Company provides technical and leadership training to employees, customers and suppliers who work for or with the Company’s products and services.\nThe Company’s focus on employee development has been structured through programs designed to embed essential skills with employees and reinforce strategic goals aligning with the Company’s culture, including:\n•\nFront-Line Talent: \nIn support of the Company’s growth strategy, the Company is investing in developing front line talent to ensure a customer-ready workforce. This includes investment in key learning curriculum and building skill-based career pathing for all front-line staff.  Retention of program participants continues to increase year over year.\n10\n•\nLeadership Development:\n The Company has a strong leadership curriculum for first time managers, managers new to the Company, managers of managers and executive leaders. In 2025, the high potential courses had a greater than 75% application of content to the job and a net promoter score (\"NPS\") of greater than 70.\n•\nEngagement and Inclusion:\n The Company has developed BRG-sponsored development programs structured across the levels and stages of individuals' careers to develop and align employees with the Company’s High-Performance Culture.\nIn fiscal 2025, the Company offered a robust curriculum of almost 225,000 activities that were completed by employees, consisting of videos, courses, e-learning, documentation, articles and books, including over 4,000 active (in person or virtual) learning courses. In fiscal 2025, over 1.3 million learning activities were completed by over 75,000 employees (excluding non-wired). The total learning hours consumed by employees was 1.3 million hours, averaging over 17 hours per employee including time invested in formal learning and standard time invested in self-paced reading or video consumption.\nEmployee Population and Demographics \nAs of September 30, 2025, the Company employed approximately 87,000 people worldwide, of which approximately 31,000 were employed in the United States and approximately 56,000 were outside the United States. The Company’s workforce declined from 2024 primarily due to divestitures including the R&LC HVAC business.  Approximately 18,000 employees are covered by collective bargaining agreements or works councils, and the Company believes that its relations with its labor unions are generally positive. The Company’s EEO-1 Report published on our website outlines additional details on its U.S. workforce composition.\nAvailable Information\nThe Company’s filings with the U.S. Securities and Exchange Commission (\"SEC\"), including annual reports on Form 10-K, quarterly reports on Form 10-Q, definitive proxy statements on Schedule 14A, current reports on Form 8-K, and any amendments to those reports filed pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934, are made available free of charge through the Investor Relations section of the Company’s Internet website at http://www.johnsoncontrols.com as soon as reasonably practicable after the Company electronically files such material with, or furnishes it to, the SEC. Copies of any materials the Company files with the SEC can also be obtained free of charge through the SEC’s website at http://www.sec.gov. The Company also makes available, free of charge, its Code of Ethics, Corporate Governance Guidelines, Board of Directors committee charters and other information related to the Company on its Internet website or in printed form upon request. The Company is not including the information contained on its website as a part of, or incorporating it by reference into, this Annual Report on Form 10-K.",
  "item7": "ITEM 7\n    \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nGeneral\nJohnson Controls International plc, headquartered in Cork, Ireland, is a global leader in smart, healthy and sustainable buildings, serving a wide range of customers around the globe. The Company’s products and solutions advance the safety, comfort and intelligence of spaces to serve people, places and the planet. The Company is committed to helping its customers win and creating greater value for all of its stakeholders through its strategic focus on buildings.\nThe Company is a global leader in engineering, manufacturing, commissioning and retrofitting building products and systems, including commercial heating, ventilating, air-conditioning (\"HVAC\") equipment, industrial refrigeration systems, controls, security systems, fire-detection systems and fire-suppression solutions. The Company further serves customers by providing technical services, including maintenance, management, repair, retrofit and replacement of equipment (in the HVAC, industrial refrigeration, controls, security and fire-protection space) and energy-management consulting. The Company partners with customers by leveraging its broad product portfolio and digital capabilities, together with its direct channel service and solutions capabilities, to deliver solutions and services addressing distinct and diverse operating environments and regulatory requirements that address customers’ needs in their core missions.  On April 1, 2025, the Company, as part of ongoing initiatives to drive simplification, accelerate growth, better reflect its organizational and operational structure and align with the manner in which the Company's chief operating decision maker assesses performance and makes decisions regarding the allocation of resources following portfolio simplification actions, realigned into three reportable segments (Americas, EMEA and APAC) from four reportable segments (Global Products, Building Solutions North America, Building Solutions EMEA/LA and Building Solutions APAC). The Company began reporting under this segment structure on April 1, 2025.  \nThe Company's fiscal year ends on September 30. Unless otherwise stated, references to years in this report relate to fiscal years rather than calendar years. This discussion summarizes the significant factors affecting the consolidated operating results, \n31\nfinancial condition and liquidity of the Company on a continuing operations basis for the year ended September 30, 2025 and should be read in conjunction with Item 8, the consolidated financial statements and the notes to consolidated financial statements.\nMacroeconomic Trends\nMuch of the demand for the Company’s products and solutions is heavily dependent on general economic conditions, localized demand for real estate and the availability of credit, public funding or other financing sources. Positive or negative fluctuations in these dependencies could have a corresponding impact on the Company’s financial condition, results of operations and cash flows.\nThe Company maintains global operations. The United States has announced tariffs and reciprocal tariffs on a wide range of products manufactured or produced worldwide, including Canada, China, the European Union, Japan and Mexico, among others. Several countries have similarly announced reciprocal or other tariffs impacting products manufactured or produced in the United States. In addition, the United States and other nations have, and may in the future, pause, reimpose, decrease or increase tariffs. Although the Company has been largely able to mitigate the impact of tariffs that have been enacted to date, if additional tariffs and reciprocal tariffs are implemented (whether as currently proposed or otherwise), such actions could negatively impact the Company's revenue growth and margins in future periods through decreased sales and increased cost of goods sold. Further, the Company has experienced, and could again experience, increased material cost inflation and component shortages, as well as disruptions and delays in its supply chain, as a result of global macroeconomic trends including the imposition of tariffs and other restrictive trade measures, as well as geopolitical and economic tensions. The net effect of these events will continue to depend on the Company’s ability to successfully mitigate and offset their impact. \nThe Company is taking actions to mitigate the actual and anticipated impact of these events, including strengthening the Company's in region, for region manufacturing strategy, pivoting to local sourcing in its supply chain, accelerating pricing actions and asserting contractual rights through change orders. The Company has historically taken a variety of actions to mitigate trade restrictions, supply chain disruptions and inflation, including through expanding and redistributing its supplier network, supplier financing, accelerated purchasing and productivity improvements. These actions have largely been successful mitigating the impacts of the current macroeconomic environment, however, it is uncertain as to whether the actions taken or contemplated to be taken by the Company will be effective in continuing to mitigate the impact of current and future trade restrictions and their related impacts. The Company continues to actively monitor and evaluate the development and potential impacts of tariffs and other trade restrictions on its supply chain and results of operations.\nAs a result of the Company’s global presence, a significant portion of its revenues and expenses are denominated in currencies other than the U.S. dollar, which results in non-U.S. currency risks and exchange exposure. While the Company employs financial instruments to hedge some of its transactional foreign exchange exposure, these activities do not insulate it completely from those exposures. In addition, currency exposure from the translation of non-U.S. dollar functional currency subsidiaries cannot be hedged. Exchange rates can be volatile and a substantial weakening or strengthening of foreign currencies against the U.S. dollar could increase or reduce the Company’s profit margin, respectively, and impact the comparability of results from period to period.\nThe Company continues to observe trends demonstrating increased interest and demand for its products and services that enable smart, safe, efficient and sustainable buildings, which are driven in part by government tax incentives, building performance standards and other regulations designed to limit emissions and combat climate change. In particular, legislative and regulatory initiatives such as the EU Energy Efficiency Directive, EU Heat Transition, U.S. Inflation Reduction Act and EU Energy Performance of Buildings Directive include provisions designed to fund and encourage investment in decarbonization and digital technologies for buildings. This demand is supplemented by an increase in commitments in both the public and private sectors to reduce emissions and/or achieve net zero emissions. In addition, the increased maturity and adoption of AI and high-performance computing is currently impacting the microchip and data center industry and driving technology innovation, which has led to increased demand for hyperscale and data center cooling solutions that deliver heat management and energy efficiency. The Company seeks to capitalize on these trends to enable delivery of sustainable, high-efficiency products and tailored services to enable customers to achieve their sustainability, heat management and energy efficiency goals. The Company is leveraging its install base, together with data-driven products and services, to offer outcome-based solutions to customers with a focus on generating accelerated growth in services and recurring revenue.\nCertain of our customers, including governmental and institutional customers, have exhibited increased uncertainty regarding future spending decisions due to various political and economic factors, including budget reductions, reprioritization of spending, interest rate fluctuation and economic uncertainty. This uncertainty has and may in the future impact on the Company's ability to predict and forecast the revenue and backlog associated with these customers.\n32\nThe extent to which the Company’s results of operations and financial condition are impacted by these and other factors in the future will depend on developments that are highly uncertain and cannot be predicted. See Part I, Item 1A, of this Annual Report on Form 10-K for an additional discussion of risks.\nPortfolio Simplification Transactions\nThe Company continues to engage in an ongoing evaluation of its non-core product lines in connection with its objective to be a pure-play provider of comprehensive solutions for commercial buildings. On July 31, 2025, the Company completed the divestiture of its Residential and Light Commercial (\"R&LC\") HVAC business to Robert Bosch GmbH (“Bosch”) for net cash proceeds of approximately $5.6 billion after tax and transaction-related expenses. The R&LC HVAC business included the Company's North America Ducted business and Johnson Controls-Hitachi Air Conditioning Holding (UK) Ltd., the Company’s global residential joint venture with Hitachi Global Life Solutions, Inc.\nRestructuring and Cost Optimization Initiatives \nDuring the fourth quarter of fiscal 2024, the Company committed to a multi-year restructuring plan to address stranded costs and further right-size global operations as a result of previously announced portfolio simplification actions. It is expected that one-time restructuring costs, including severance and other employee termination benefits, contract termination costs, and certain other related cash and non-cash charges, of approximately $400 million will be incurred over the course of fiscal 2025, 2026 and 2027, resulting in expected annual cost savings of approximately $500 million upon full completion of the plan. Restructuring and transformation costs in fiscal 2025 have been material, resulting in savings in 2025 and additional expected savings in fiscal 2026 and 2027. Restructuring costs will be incurred across all segments and Corporate functions. Refer to Note 16, \"Restructuring and Related Costs,\" for an update on the restructuring plan.  \nFISCAL YEAR 2025 COMPARED TO FISCAL YEAR 2024\n \nNet Sales\nYear Ended September 30,\n(in millions)\n2025\n2024\nChange\nNet sales\n$\n23,596 \n$\n22,952 \n3 \n%\nThe increase in net sales was due to higher organic sales ($1,430 million), partially offset by the net impact of acquisitions and divestitures ($786 million). Excluding the impact of foreign currency translation and business acquisitions and divestitures, consolidated net sales increased 6% over the prior year, driven by growth in Services across all segments as well as growth in Products and Systems, led by the Americas. Refer to the \"Segment Analysis\" below within Item 7 for a discussion of net sales by segment. Refer to Note 4, \"Revenue Recognition,\" of the notes to consolidated financial statements for further disclosure related to the net sales allocation between products and systems versus services revenue. \nCost of Sales / Gross Profit\nYear Ended September 30,\n(in millions)\n2025\n2024\nChange\nCost of sales\n$\n15,004 \n$\n14,875 \n1 \n%\nGross profit\n8,592 \n8,077 \n6 \n%\n% of sales\n36.4\n%\n35.2\n%\nThe increase in gross profit was primarily due to margin improvements in Products and Systems and increased volumes for both Products and Systems and Services. Refer to the \"Segment Analysis\" below within Item 7 for a discussion of segment earnings.\n33\nSelling, General and Administrative Expenses\nYear Ended September 30,\n(in millions)\n2025\n2024\nChange\nSelling, general and administrative expenses\n$\n5,764 \n$\n5,661 \n2 \n%\n% of sales\n24.4\n%\n24.7\n%\nThe increase in selling, general and administrative expenses (\"SG&A\") was primarily due to higher costs to support operations ($277 million), higher transformation costs ($180 million), and the unfavorable impact of prior year earn-out adjustments ($68 million), partially offset by the net favorable impact of\n \nthe prior year water systems AFFF settlement and related insurance recoveries ($422 million). \nRefer to the \"Segment Analysis\" below within Item 7 for a discussion of segment earnings. Refer to Note 20, \"Commitments and Contingencies,\" of the notes to consolidated financial statements for further disclosure related to the water systems AFFF settlement.\nRestructuring and Impairment Costs\nYear Ended September 30,\n(in millions)\n2025\n2024\nGoodwill and other intangible asset impairments\n$\n206 \n$\n296 \nHeld for sale impairments\n— \n35 \nOther impairments\n176 \n36 \nRestructuring and related costs\n164 \n143 \nRestructuring and impairment costs\n$\n546 \n$\n510 \nRefer to Note 6, \"Property, Plant and Equipment,\" Note 7, \"Goodwill and Other Intangible Assets,\" and Note 16, \"Restructuring and Related Costs,\" of the notes to consolidated financial statements for further disclosure related to the Company's restructuring plans and impairment costs. \nNet Financing Charges\nYear Ended September 30,\n2025\n2024\nInterest expense, net of capitalized interest costs\n$\n227 \n$\n381 \nOther financing charges\n22 \n38 \nGain on debt extinguishment\n(2)\n(25)\nInterest income\n(19)\n(17)\nNet foreign exchange on financing activities\n91 \n(35)\nNet financing charges\n$\n319 \n$\n342 \nRefer to Note 9, \"Debt and Financing Arrangements,\" of the notes to consolidated financial statements for further disclosure related to the Company's debt.\n34\nIncome Tax Provision \nYear Ended September 30,\n(in millions)\n2025\n2024\nIncome tax provision\n$\n245 \n$\n111 \nEffective tax rate\n12 \n%\n7 \n%\nThe increase in the effective tax rate was primarily due to non-recurring tax benefits in 2024.  Refer to Note 17, \"Income Taxes,\" of the notes to consolidated financial statements for further details.\nIn October 2021, the Organization for Economic Co-operation and Development (\"OECD\")/G20 inclusive framework on Base Erosion and Profit Shifting (the Inclusive Framework) published a statement updating and finalizing the key components of a two-pillar plan on global tax reform which has now been agreed upon by the majority of OECD members. Pillar One allows countries to reallocate a portion of residual profits earned by multinational enterprises (\"MNE\"), with an annual global revenue exceeding €20 billion and a profit margin over 10%, to other market jurisdictions. The adoption of Pillar One and its potential effective date remain uncertain. Pillar Two requires MNEs with an annual global revenue exceeding €750 million to pay a global minimum tax of 15%. The OECD has since issued administrative guidance providing transition and safe harbor rules around the implementation of the Pillar Two Global Minimum Tax. A number of countries, including Ireland, have enacted legislation to implement the core elements of Pillar Two, which is applicable to the Company in fiscal 2025. The OECD and governments are continuing to evaluate and adjust the Global Minimum Tax rules through legislative updates, administrative guidance, and adoption by additional countries, which could result in an increase in our effective tax rate.\nIncome From Discontinued Operations, Net of Tax\nYear Ended September 30,\n(in millions)\n2025\n2024\nChange\nIncome from discontinued operations, net of tax\n$\n1,789 \n$\n489 \n266 \n%\nThe increase in income from discontinued operations, net of tax was primarily due to the gain on sale of the R&LC HVAC business. Refer to Note 2, \"Acquisitions and Divestitures,\" of the notes to consolidated financial statements for further information.\nSEGMENT ANALYSIS\nThe Chief Executive Officer, the Company’s CODM, evaluates the performance of its segments and allocates resources based on two profitability measures, Segment EBITA and Segment EBIT:\n•\nSegment earnings before interest, taxes, and amortization (“EBITA”) represents income from continuing operations, before income taxes and noncontrolling interests, excluding corporate expenses, restructuring and impairment costs, AFFF related settlement costs and insurance recoveries, gains or losses on divestitures, net mark-to-market gains and losses related to pension and post-retirement plans and restricted asbestos investments, net finance charges, and amortization.  Segment EBITA is used as a tool to allow the CODM to evaluate the recurring profitability of the segments, including revenues and expenses that are within the operational control of the segments, and excluding the impact of certain non-cash and non-recurring items. Segment EBITA also provides the CODM with performance comparability across periods and for more accurate benchmarking against peer companies that may not have similar historical acquisition activity, by holding constant the impact of significant acquisitions.\n•\nSegment earnings before interest and taxes (\"EBIT\") represents Segment EBITA, adding back the impact of amortization of intangible assets. Segment EBIT allows the CODM to review profitability, inclusive of the impact of significant acquisition activity, informing the CODM of how the business is integrating key strategic initiatives and generating synergies. \nBoth EBITA and EBIT are reviewed by the CODM and compared against the profit plan and forecast for the current and prior year. Segment EBITA and Segment EBIT are not defined under GAAP and may not be comparable to similarly titled measures used by other companies. Measures of total assets by reportable segment are not provided to the CODM. Therefore, asset information by segment is not disclosed. \n35\nFinancial information relating to the Company’s reportable segments is as follows (in millions):\n \nYear Ended September 30, 2025\n \nAmericas\nEMEA\nAPAC\nNet sales\n$\n15,831 \n$\n4,968 \n$\n2,797 \nCost of sales\n9,742\n3,228\n1,777\nSelling, general and administrative expenses\n3,206\n1,094\n548\nEquity income (loss)\n1\n(3)\n(4)\nSegment EBITA\n2,882\n649\n476\nAmortization of intangible assets\n356 \n68 \n15 \nSegment EBIT\n$\n2,526 \n$\n581 \n$\n461 \n \nYear Ended September 30, 2024\n \nAmericas\nEMEA\nAPAC\nNet sales\n$\n15,606 \n$\n4,620 \n$\n2,726 \nCost of sales\n9,922 \n3,024 \n1,692 \nSelling, general and administrative expenses\n3,003 \n996 \n558 \nEquity income (loss)\n2 \n39 \n(2)\nSegment EBITA \n2,679\n561\n478\nAmortization of intangible assets\n379 \n80 \n17 \nSegment EBIT\n$\n2,300 \n$\n481 \n$\n461 \n \nYear Ended September 30, 2023\n \nAmericas\nEMEA\nAPAC\nNet sales\n$\n14,529 \n$\n4,491 \n$\n3,311 \nCost of sales\n9,241 \n3,035 \n2,102 \nSelling, general and administrative expenses\n2,945 \n1,039 \n602 \nEquity income (loss)\n— \n(1)\n(2)\nSegment EBITA\n2,343 \n418 \n609 \nAmortization of intangible assets\n337 \n74 \n15 \nSegment EBIT\n$\n2,006 \n$\n344 \n$\n594 \nRefer to Note 18, \"Segment Information,\" for a reconciliation of Segment EBITA and Segment EBIT to Income from continuing operations before income taxes.\n36\nNet Sales\nNet Sales for the \nYear Ended September 30,\n(in millions)\n2025\n2024\nChange\nAmericas\n$\n15,831 \n$\n15,606 \n1 \n%\nEMEA\n4,968 \n4,620 \n8 \n%\nAPAC\n2,797 \n2,726 \n3 \n%\n$\n23,596 \n$\n22,952 \n3 \n%\n \n•\nThe increase in Americas was primarily due to organic growth ($1,058 million), partially offset by the impact of divestitures ($799 million) and the unfavorable impact of foreign currency translation ($34 million). Excluding the impact of divestitures and foreign currency translation, sales increased 7%, led by growth in Applied HVAC and Controls. \n•\nThe increase in EMEA was primarily due to organic growth ($295 million), favorable foreign currency translation ($40 million), and incremental sales related to the net impact of business acquisitions and divestitures ($13 million). Excluding the impact of business acquisitions, divestitures, and foreign currency translation, sales growth was led by 8% growth in Services.\n•\nThe increase in APAC was primarily due to organic growth ($77 million), partially offset by the unfavorable impact of foreign currency translation\n.\n Excluding the impact of foreign currency translation, sales growth was led by 12% growth in Services.\nSegment EBITA and Segment EBIT\nSegment EBITA\nfor the Year Ended\nSeptember 30,\nSegment EBIT\nfor the Year Ended\nSeptember 30\n(in millions)\n2025\n2024\nChange\n2025\n2024\nChange\nAmericas\n$\n2,882 \n$\n2,679 \n8 \n%\n$\n2,526 \n$\n2,300 \n10 \n%\nEMEA\n649 \n561 \n16 \n%\n581 \n481 \n21 \n%\nAPAC\n476 \n478 \n— \n%\n461 \n461 \n— \n%\n•\nThe increases for Americas were primarily due to higher margin backlog conversion and volumes, partially offset by the impact of prior year earn-out adjustments.\n•\nThe increases in EMEA were primarily driven by productivity improvements and positive mix from the growth in Services.\n•\nAPAC was consistent with the prior year as increases in volume were offset by pricing challenges. \n37\nNet Sales\nNet Sales\nfor the Year Ended\nSeptember 30,\n(in millions)\n2024\n2023\nChange\nAmericas\n$\n15,606 \n$\n14,529 \n7 \n%\nEMEA\n4,620 \n4,491 \n3 \n%\nAPAC\n2,726 \n3,311 \n(18)\n%\n$\n22,952 \n$\n22,331 \n3 \n%\n•\nThe increase in Americas was primarily due to organic growth. Excluding the impacts of foreign currency translation and business acquisitions and divestitures, sales growth was led by Commercial and Applied HVAC & Controls, partially \noffset by declines in Fire & Security and Industrial Refrigeration.\n•\nThe increase in EMEA was primarily due to organic growth, including higher prices, and the net impact of business acquisitions and divestitures, partially offset by the negative impact of foreign currency translation. Excluding the impact of foreign currency translation and business acquisitions and divestitures, sales growth was led by growth in Services.\n•\nThe decrease in APAC was primarily due to organic sales declines, the negative impact of foreign currency translation and the net impact of business acquisitions and divestitures. Excluding the impact of foreign currency translation and business acquisitions and divestitures, sales decreased as Services growth was more than offset by weakness in the China Systems business.\nSegment EBITA and Segment EBIT\nSegment EBITA\nfor the Year Ended\nSeptember 30,\nSegment EBIT\nfor the Year Ended\nSeptember 30\n(in millions)\n2024\n2023\nChange\n2024\n2023\nChange\nAmericas\n$\n2,679 \n$\n2,343 \n14 \n%\n$\n2,300 \n$\n2,006 \n15 \n%\nEMEA\n561 \n418 \n34 \n%\n481 \n344 \n40 \n%\nAPAC\n478 \n609 \n(22)\n%\n461 \n594 \n(22)\n%\n•\nThe increases for Americas were primarily due to higher margin backlog conversion, continued growth in Services and operational efficiencies leading to productivity improvements. A favorable earn-out liability adjustment also contributed to the increase in EBITA and EBIT.\n•\nThe increases in EMEA were primarily due to growth in higher margin Services and productivity improvements.\n•\nThe decreases for APAC were primarily due to continued weakness in the Systems business in China.\nLIQUIDITY AND CAPITAL RESOURCES\nWorking Capital\nSeptember 30,\n(in millions)\n2025\n2024\nChange\nCurrent assets\n$\n10,162 \n$\n11,179 \n(9)\n%\nCurrent liabilities\n(10,941)\n(11,955)\n(8)\n%\nWorking capital\n$\n(779)\n$\n(776)\n— \n%\nAccounts receivable - net\n$\n6,269 \n$\n6,051 \n4 \n%\nInventories\n1,820 \n1,774 \n3 \n%\nAccounts payable\n3,614 \n3,389 \n7 \n%\n38\nWorking capital at September 30, 2025 was consistent with September 30, 2024 as decreases in short-term debt and increases in accounts receivable and other current assets were offset by decreases in cash, working capital associated with dispositions and  various current liabilities.\nCash Flows\n \nYear Ended September 30,\n(in millions)\n2025\n2024\nContinuing operations\nCash provided by operating activities\n$\n2,554 \n$\n1,568 \nCash used by investing activities\n(412)\n(184)\nCash used by financing activities\n(6,784)\n(1,948)\nDiscontinued operations\nCash provided by discontinued operations\n$\n4,787 \n$\n361 \n•\nThe increase in cash provided by operating activities reflects higher net income and favorable changes in accounts receivable, partially offset by the timing of accrued income tax payments.\n•\nThe increase in cash used by investing activities was primarily due to proceeds from the ADTi divestiture in fiscal 2024, partially offset by the decrease in capital expenditures. \n•\nThe increase in cash used by financing activities was primarily due to the Accelerated Share Repurchase Transactions (\"ASR Transactions\").\n•\nThe increase in cash provided by discontinued operations was primarily due to the net proceeds from the sale of the R&LC HVAC business, partially offset by dividends paid.\nCapitalization\nSeptember 30,\n(in millions)\n2025\n2024\nShort-term debt\n$\n723 \n$\n953 \nCurrent portion of long-term debt\n566 \n536 \nLong-term debt\n8,591 \n8,004 \nTotal debt\n9,880 \n9,493 \nLess: Cash and cash equivalents\n379 \n606 \nNet debt\n$\n9,501 \n$\n8,887 \nShareholders’ equity attributable to Johnson Controls ordinary shareholders (\"Equity\")\n$\n12,927 \n$\n16,098 \nTotal capitalization (Total debt plus Equity)\n22,807 \n25,591 \nNet capitalization (Net debt plus Equity)\n22,428 \n24,985 \nTotal debt as a % of Total capitalization\n43.3\n%\n37.1\n%\nNet debt as a % of Net capitalization\n42.4\n%\n35.6\n%\n•\nNet debt and net debt as a percentage of net capitalization are non-GAAP financial measures. The Company believes the percentage of net debt to net capitalization is useful to understanding the Company’s financial condition as it provides a view of the extent to which the Company relies on external debt financing for its funding and is a measure of risk to its shareholders.\n•\nThe Company's material cash requirements primarily consist of working capital requirements, repayments of long-term debt and related interest, operating leases, dividends, capital expenditures, potential acquisitions and share repurchases.\n39\n•\nRefer to Note 9, \"Debt and Financing Arrangements,\" of the notes to consolidated financial statements for additional information on debt obligations and maturities. Interest payable on long-term debt outstanding as of September 30, 2025 is $326 million in the twelve months following September 30, 2025 and $3.3 billion thereafter. \n•\nRefer to Note 8, \"Leases,\" of the notes to consolidated financial statements for additional information on lease obligations and maturities. \n•\nThe Company received net cash proceeds related to the sale of its R&LC HVAC business of approximately $5.6 billion after tax and transaction-related expenses in connection with the close of the transaction on July 31, 2025. Consistent with its capital allocation policy and pursuant to its previously announced share repurchase authorization, the Company returned the net proceeds of the transaction to shareholders through the $5.0 billion ASR Transactions which were launched in August 2025 and are expected to be completed in the second quarter of fiscal 2026. The total number of the Company’s ordinary shares (the \"Shares\") to be repurchased under the ASR Transactions will be based on volume-weighted average prices of the Shares during the term of the ASR Transactions, less a discount and subject to customary adjustments.\n•\nAs of September 30, 2025, the Company had purchase obligations which were payable in the next twelve months of approximately $2 billion and payable thereafter of approximately $0.2 billion. These purchase obligations represent commitments under enforceable and legally binding agreements, and do not represent all future expected purchases.\n•\nAs of September 30, 2025, the Company expects to contribute $23 million and $162 million to the global pension and postretirement plans in the next twelve months and thereafter, respectively.\n•\nAs of September 30, 2025, approximately $4.8 billion remains available under the Company's share repurchase authorization, which does not have an expiration date and may be amended or terminated by the Board of Directors at any time without prior notice. The Company expects to repurchase outstanding shares from time to time depending on market conditions, alternate uses of capital, liquidity and economic environment.\n•\nThe Company declared dividends of $1.51 per share in fiscal 2025 and intends to continue paying quarterly dividends in fiscal 2026. The authority to declare and pay dividends is vested in the Board of Directors. The timing, declaration and payment of future dividends to holders of the Company's ordinary shares is determined by the Company's Board of Directors and depends upon many factors, including the Company's financial condition and results of operations, the capital requirements of the Company's businesses, industry practice and any other relevant factors. \n•\nThe Company believes its capital resources and liquidity position, including cash and cash equivalents of $379 million at September 30, 2025, are adequate to fund operations and meet its cash obligations for the foreseeable future.\n–\nThe Company manages its short-term debt position in the U.S. and euro commercial paper markets and bank loan markets. Commercial paper outstanding was $400 million as of September 30, 2025 and $350 million as of September 30, 2024.\n–\nThe Company maintains a shelf registration statement with the SEC under which it may issue additional debt securities, ordinary shares, preferred shares, depository shares, warrants, purchase contracts and units that may be offered in one or more offerings on terms to be determined at the time of the offering. The Company anticipates that the proceeds of any offering would be used for general corporate purposes, including repayment of indebtedness, acquisitions, additions to working capital, repurchases of ordinary shares, dividends, capital expenditures and investments in the Company's subsidiaries.\n–\nThe Company has the ability to draw on its syndicated $2.5 billion committed revolving credit facility, which is scheduled to expire in December 2028, and a syndicated $500 million committed revolving credit facility, which is scheduled to expire in December 2025. There were no draws on the facilities as of September 30, 2025.\n•\nThe Company's ability to access the global capital markets and the related cost of financing is dependent upon, among other factors, the Company's credit ratings. As of September 30, 2025, the Company's credit ratings and outlook were as follows:\n40\nRating Agency\nShort-Term Rating\nLong-Term Rating\nOutlook\nS&P\nA-2\nBBB+\nStable\nMoody's\nP-2\nBaa1\nStable\nThe security ratings set forth above are issued by unaffiliated third-party rating agencies and are not a recommendation to buy, sell or hold securities. The ratings may be subject to revision or withdrawal by the assigning rating organization at any time.\n•\nFinancial covenants in the Company's revolving credit facilities require a minimum consolidated shareholders’ equity attributable to Johnson Controls of at least $3.5 billion at all times. The revolving credit facility also limits the amount of debt secured by liens that may be incurred to a maximum aggregated amount of 10% of consolidated shareholders’ equity attributable to Johnson Controls for liens and pledges. For purposes of calculating these covenants, consolidated shareholders’ equity attributable to Johnson Controls is calculated without giving effect to (i) the application of ASC 715-60, \"Defined Benefit Plans - Other Postretirement,\" or (ii) the cumulative foreign currency translation adjustment. As of September 30, 2025, the Company was in compliance with all covenants and other requirements set forth in its credit agreements and the indentures governing its notes and expects to remain in compliance for the foreseeable future. None of the Company’s debt agreements limit access to stated borrowing levels or require accelerated repayment in the event of a decrease in the Company's credit rating.\n•\nThe Company earns a significant amount of its income outside of the parent company. Outside basis differences in these subsidiaries are deemed to be permanently reinvested except in limited circumstances. The Company currently does not intend nor foresee a need to repatriate undistributed earnings included in the outside basis differences other than in tax efficient manners. The Company's intent is to reduce basis differences only when it would be tax efficient. The Company expects existing U.S. cash and liquidity to continue to be sufficient to fund the Company’s U.S. operating activities and cash commitments for investing and financing activities for at least the next twelve months and thereafter for the foreseeable future. In the U.S., should the Company require more capital than is generated by its operations, the Company could elect to raise capital in the U.S. through debt or equity issuances. The Company has borrowed funds in the U.S. and continues to have the ability to borrow funds in the U.S. at reasonable interest rates. In addition, the Company expects existing non-U.S. cash, cash equivalents, short-term investments and cash flows from operations to continue to be sufficient to fund the Company’s non-U.S. operating activities and cash commitments for investing activities, such as material capital expenditures, for at least the next twelve months and thereafter for the foreseeable future. Should the Company require more capital at the Luxembourg and Ireland holding and financing entities, other than amounts that can be provided in tax efficient methods, the Company could also elect to raise capital through debt or equity issuances. These alternatives could result in increased interest expense or other dilution of the Company’s earnings.\n•\nThe Company may from time to time purchase its outstanding debt through open market purchases, privately negotiated transactions or otherwise. Purchases or retirement of debt, if any, will depend on prevailing market conditions, liquidity requirements, contractual restrictions and other factors. The amounts involved may be material. \nCo-Issued Securities: Summarized Financial Information\nThe following information is provided in compliance with Rule 13-01 of Regulation S-X under the Securities Exchange Act of 1934 with respect to the following unsecured, unsubordinated senior notes (collectively, the \"Notes\") which were issued by Johnson Controls International plc (\"Parent Company\") and Tyco Fire & Security Finance S.C.A. (“TFSCA”):\n•\n€500 million aggregate principal amount of 0.375% Senior Notes due September 2027\n•\n€600 million aggregate principal amount of 3.000% Senior Notes due September 2028\n•\n$700 million aggregate principal amount of 5.500% Senior Notes due April 2029\n•\n$625 million aggregate principal amount of 1.750% Senior Notes due September 2030\n•\n$500 million aggregate principal amount of 2.000% Sustainability-Linked Senior Notes due September 2031\n•\n€500 million aggregate principal amount of 1.000% Senior Notes due September 2032\n•\n$650 million aggregate principal amount of 4.900% Senior Notes due December 2032\n•\n€500 million aggregate principal amount of 3.125% Senior Notes due December 2033\n•\n€800 million aggregate principal amount of 4.250% Senior Notes due May 2035\nTFSCA is a corporate partnership limited by shares (\nsociété en commandite par actions\n) incorporated and organized under the laws of the Grand Duchy of Luxembourg (“Luxembourg”) and is a wholly-owned consolidated subsidiary of the Company that \n41\nis 99.924% owned directly by the Parent Company and 0.076% owned by TFSCA’s sole general partner and manager, Tyco Fire & Security S.à r.l., which is itself wholly-owned by the Company. The Parent Company is incorporated and organized under the laws of Ireland. TFSCA is incorporated and organized under the laws of Luxembourg. The bankruptcy, insolvency, administrative, debtor relief and other laws of Luxembourg or Ireland, as applicable, may be materially different from, or in conflict with, those of the United States, including in the areas of rights of creditors, priority of governmental and other creditors, ability to obtain post-petition interest and duration of the proceeding. The application of these laws, or any conflict among them, could adversely affect noteholders’ ability to enforce their rights under the Notes in those jurisdictions or limit any amounts that they may receive.\nThe following table presents the net loss attributable to the Parent Company and TFSCA (collectively, the \"Obligor Group\") and the net loss attributable to intercompany transactions between the Obligor Group and subsidiaries of the Parent Company other than TFSCA (collectively, the \"Non-Obligor Subsidiaries\") which are excluded from the Net loss attributable to the Obligor Group (in millions):\nYear Ended September 30, 2025\nNet loss attributable to the Obligor Group\n$\n844 \nNet loss attributable to intercompany transactions\n56 \nThe following table presents summarized balance sheet information as of September 30, 2025 (in millions):\nObligor\nGroup\nIntercompany Balances\nCurrent assets\n$\n2,748 \n$\n6,161 \nNoncurrent assets\n243 \n2,450 \nCurrent liabilities\n1,585 \n4,041 \nNoncurrent liabilities\n8,473 \n22,450 \n*\n*\nIncludes $17 billion of intercompany loans that were canceled as the result of a distribution by a non-obligor subsidiary in October 2025.\nThe same accounting policies as described in Note 1, \"Summary of Significant Accounting Policies,\" of the notes to consolidated financial statements are used by the Parent Company and each of its subsidiaries in connection with the summarized financial information presented above. \nCRITICAL ACCOUNTING ESTIMATES\nThe Company prepares its consolidated financial statements in conformity with accounting principles generally accepted in the United States of America (\"U.S. GAAP\"). This requires management to make estimates and assumptions that affect reported amounts and related disclosures. Actual results could differ from those estimates. The following estimates are considered by management to be the most critical to the understanding of the Company's consolidated financial statements as they require significant judgments that could materially impact the Company’s results of operations, financial position and cash flows.\nRevenue Recognition\nThe Company recognizes revenue from certain long-term contracts on an over-time basis, with progress towards completion measured using a cost-to-cost input method based on the relationship between actual costs incurred and total estimated costs at completion. Total estimated costs at completion are based primarily on estimated purchase contract terms, historical performance trends and other economic projections. Factors that may result in a change to these estimates include unforeseen engineering problems, construction delays, cost inflation, the performance of internal labor, subcontractors and major material suppliers, and weather conditions. As a result, changes to the original estimates may be required during the life of the contract. Such estimates are reviewed monthly and any adjustments to the measure of completion are recognized as adjustments to sales and gross profit using the cumulative catch-up method. Estimated losses are recorded when identified.\nFor agreements with multiple performance obligations, the Company allocates the transaction price of the contract to each performance obligation using the best estimate of the relative standalone selling price of each distinct good or service in the contract. In order to estimate relative standalone selling price, market data and transfer price studies are utilized. If the \n42\nstandalone selling price is not directly observable, the Company estimates the standalone selling price using an adjusted market assessment approach or expected cost plus margin approach.\nThe Company assesses variable consideration that may affect the total transaction price, including discounts, rebates, refunds, credits or other similar sources of variable consideration, when determining the transaction price of each contract. The Company includes variable consideration in the estimated transaction price when it is probable that significant reversal of revenue recognized would not occur when the uncertainty associated with variable consideration is subsequently resolved. These estimates are based on the amount of consideration that the Company expects to be entitled to. \nGoodwill and Indefinite-Lived Intangible Assets\nThe Company performs impairment reviews for its reporting units, which have been determined to be one level below the Company's operating segments, using a qualitative assessment or a quantitative test. A qualitative assessment is performed when prior quantitative assessments have resulted in significant excess of fair value over the carrying value of a reporting unit, and consideration of qualitative factors allow the Company to conclude it is more likely than not that the fair value of the reporting unit remains greater than its carrying value. When performing a quantitative goodwill impairment test, the fair value of a reporting unit refers to the price that would be received to sell the unit as a whole in an orderly transaction between market participants at the measurement date. To estimate the fair value, the Company uses a discounted cash flow model, the guideline company method under the market approach, or estimated sales price for reporting units held for sale. The assumptions included in the impairment tests require judgment, and changes to these inputs could impact the results of the calculations. The key assumptions used in the impairment tests were management's projections of future cash flows, earnings before interest, taxes, depreciation and amortization (“EBITDA”), weighted-average cost of capital, EBITDA multiples, and long-term growth rates. Although the Company's cash flow forecasts are based on assumptions that are considered reasonable by management and consistent with the plans and estimates management is using to operate the underlying business, there are significant judgments in determining the expected future cash flows attributable to a reporting unit. \nManagement completed its fiscal 2025 annual impairment test as of July 31, which included a qualitative assessment of all of its reporting units. The Company did not identify any qualitative factors that suggest that it is more likely than not that the fair value of its reporting units is less than their carrying amount, including goodwill, and as such, a quantitative impairment test was not necessary.\nIndefinite-lived intangible assets are also subject to at least annual impairment testing in the fourth fiscal quarter or as events occur or circumstances change that indicate the assets may be impaired. Indefinite-lived intangible assets primarily consist of trademarks and trade names and are tested for impairment using a relief-from-royalty method. A considerable amount of management judgment and assumptions are required in performing the impairment tests. The key assumptions used in the impairment tests were long-term revenue growth projections, weighted-average cost of capital, and the royalty rate. The assumptions included in the impairment tests require judgment, and changes to these inputs could impact the results of the calculations.\nThe Company continuously monitors for events and circumstances that could negatively impact the key assumptions in determining fair value. While the Company believes the judgments and assumptions used in the goodwill and indefinite-lived intangible impairment tests are reasonable, different assumptions or changes in general industry, market and macro-economic conditions could change the estimated fair values and, therefore, future impairment charges could be required, which could be material to the consolidated financial statements.\nRefer to Note 7, \"Goodwill and Other Intangible Assets,\" of the notes to consolidated financial statements for information regarding the results of goodwill and indefinite-lived intangible assets impairment testing performed in fiscal 2025, 2024, and 2023.\nPension Plans\nThe Company provides a range of benefits, including pensions, to eligible active and former employees. Pension plan assets and obligations are measured annually, or more frequently if there is a significant remeasurement event, using various actuarial assumptions such as discount rates, assumed rates of return and compensation increases as of that date. The Company reviews its actuarial assumptions on an annual basis and makes modifications to the assumptions based on current rates and trends when appropriate. \nThe Company considers expected benefit payments on a plan-by-plan basis when estimating discount rates. Different discount rates are used for each plan depending on the plan jurisdiction and the expected timing of benefit payments. The Company uses \n43\ncountry-specific discount rates determined by an independent third party which are based on government and high-quality corporate bond yields. \nIn estimating the expected return on plan assets, the Company considers historical returns on plan assets, adjusted for forward-looking considerations, inflation assumptions, asset mix and the impact of the active management of the plans’ invested assets. For fiscal 2026, the Company believes the long-term rate of return will approximate 6.65% for U.S. pension plans and 6.04% for non-U.S. pension plans. Any differences between actual investment results and the expected long-term asset returns will be reflected in net periodic benefit costs in the fourth quarter of each fiscal year or at the date of a significant remeasurement event. If actual returns on plan assets are less than the Company’s expectations, additional contributions may be required. \nBased on information provided by its independent actuaries and other relevant sources, the Company believes that the assumptions used are reasonable, however, changes in these assumptions could impact the Company’s financial position, results of operations or cash flows. The estimated changes in projected benefit obligation and future ongoing pension expense, excluding any potential mark-to-market adjustments, assuming an increase of 25 basis points in the key assumptions used for the Company's pension plans are immaterial.\nLoss Contingencies\nAccruals are recorded for various contingencies including legal proceedings, environmental matters, self-insurance and other claims that arise in the normal course of business when it is probable a liability has been incurred and the amount of the liability can be reasonably estimated. The accruals are based on judgment, the probability of losses and, where applicable, the consideration of opinions of internal and/or external legal counsel and actuarial determined estimates. Additionally, the Company records receivables from third party insurers when recovery has been determined to be probable.\nThe Company is subject to laws and regulations relating to protecting the environment. It is difficult to estimate the Company’s ultimate level of liability at many remediation sites due to the large number of other parties that may be involved, the complexity of determining the relative liability among those parties, the uncertainty as to the nature and scope of the investigations and remediation to be conducted, the uncertainty in the application of law and risk assessment, the various choices and costs associated with diverse technologies that may be used in corrective actions at the sites, and the often quite lengthy periods over which eventual remediation may occur. It is possible that technological, regulatory or enforcement developments, the results of additional environmental studies or other factors could change the Company's expectations with respect to future charges and cash outlays, and such changes could be material to the Company's future results of operations, financial condition or cash flows. Nevertheless, the Company does not currently believe that any claims, penalties or costs in addition to the amounts accrued will have a material adverse effect on the Company’s financial position, results of operations or cash flows. The Company provides for expenses associated with environmental remediation obligations when such amounts are probable and can be reasonably estimated. Refer to Note 20, \"Commitments and Contingencies,\" of the notes to consolidated financial statements.\nLiabilities and expenses for workers' compensation, product, general and auto liabilities are dependent on claims experience. For most of these liabilities, claims incurred but not yet reported are estimated by utilizing actuarial valuations based upon historical claims experience. The Company maintains captive insurance companies to manage its insurable liabilities \nAsbestos-Related Contingencies and Insurance Receivables\nThe Company and certain of its subsidiaries, along with numerous other companies, are named as defendants in personal injury lawsuits based on alleged exposure to asbestos-containing materials. The estimated liability and corresponding insurance recovery for pending and future claims and defense costs are based on the Company's historical claim experience, and estimates of the number and resolution cost of potential future claims that may be filed and is discounted to present values from the time that the costs are expected to be incurred which in some cases is not until 2068 (which is the Company's reasonable best estimate of the actuarial determined time period through which asbestos-related claims will be filed against its affiliates). Estimated asbestos-related defense costs are included in the asbestos liability. The Company's legal strategy for resolving claims also impacts these estimates. The Company considers various trends and developments in evaluating the period of time (the look-back period) over which historical claim and settlement experience is used to estimate and value claims reasonably projected to be made through 2068. At least annually, the Company assesses the sufficiency of its estimated liability for pending and future claims and defense costs by evaluating actual experience regarding claims filed, settled and dismissed, and amounts paid in settlements. In addition to claims and settlement experience, the Company considers additional quantitative and qualitative factors such as changes in legislation, the legal environment, and its defense strategy. The Company also evaluates \n44\nthe recoverability of its insurance receivable on an annual basis. The Company evaluates all of these factors and determines whether a change in the estimate of its liability for pending and future claims or insurance receivable is warranted.\nThe Company records asbestos-related insurance recoveries that are probable. Estimated asbestos-related insurance recoveries represent estimated amounts due to the Company for previously paid and settled claims and the probable reimbursements relating to its estimated liability for pending and future claims discounted to present value. In determining the amount of insurance recoverable, the Company considers available insurance, allocation methodologies, solvency and creditworthiness of the insurers. \nRefer to Note 20, \"Commitments and Contingencies,\" of the notes to consolidated financial statements for a discussion on management's judgments applied in the recognition and measurement of asbestos-related assets and liabilities.\nIncome Taxes\nDeferred tax assets and liabilities are recognized for the expected future tax consequences attributable to differences between financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and other loss carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The Company records a valuation allowance that primarily represents non-U.S. operating and other loss carryforwards for which realization is uncertain. Management judgment is required in determining the Company’s provision for income taxes, deferred tax assets and liabilities, and the valuation allowance recorded against the Company’s net deferred tax assets. \nThe Company reviews the realizability of its deferred tax assets and related valuation allowances on a quarterly basis, or whenever events or changes in circumstances indicate that a review is required. In determining the requirement for a valuation allowance, the historical and projected financial results of the legal entity or consolidated group recording the net deferred tax asset are considered, along with any other positive or negative evidence. Since future financial results may differ from previous estimates, periodic adjustments to the Company’s valuation allowances may be necessary. At September 30, 2025, the Company had a valuation allowance of $6.3 billion for continuing operations, of which $5.9 billion relates to net operating and capital loss carryforwards primarily in France, Ireland, Luxembourg, Mexico, and the United Kingdom for which sustainable taxable income has not been demonstrated; and $0.4 billion for other deferred tax assets.\nThe Company’s federal income tax returns and certain non-U.S. income tax returns for various fiscal years remain under various stages of audit by the IRS and respective non-U.S. tax authorities. Although the outcome of tax audits is always uncertain, management believes that it has appropriate support for the positions taken on its tax returns and that its annual tax provisions included amounts sufficient to pay assessments, if any, which may be proposed by the taxing authorities. At September 30, 2025, the Company had recorded a liability of $1.9 billion\n \nfor its best estimate of the probable loss on certain of its tax positions, the majority of which is included in other noncurrent liabilities in the consolidated statements of financial position. Nonetheless, the amounts ultimately paid, if any, upon resolution of the issues raised by the taxing authorities may differ materially from the amounts accrued for each year.\nThe Company does not generally provide additional U.S. or non-U.S. income taxes on outside basis differences of consolidated subsidiaries included in shareholders’ equity attributable to Johnson Controls International plc, except in limited circumstances including anticipated taxation on planned divestitures. The reduction of the outside basis differences via the sale or liquidation of these subsidiaries and/or distributions could create taxable income. The Company’s intent is to reduce the outside basis differences only when it would be tax efficient. Refer to \"Capitalization\" within the \"Liquidity and Capital Resources\" section for discussion of U.S. and non-U.S. cash projections.\nRefer to Note 17, \"Income Taxes,\" of the notes to consolidated financial statements for the Company's income tax disclosures.\nNEW ACCOUNTING PRONOUNCEMENTS\nRefer to the \"New Accounting Pronouncements\" section within Note 1, \"Summary of Significant Accounting Policies,\" of the notes to consolidated financial statements. \nRISK MANAGEMENT\nThe Company selectively uses derivative instruments to reduce market risk associated with changes in foreign currency, commodities, and interest rates. All hedging transactions are authorized and executed pursuant to clearly defined policies and procedures, which strictly prohibit the use of financial instruments for speculative purposes. At the inception of the hedge, the \n45\nCompany assesses the effectiveness of the hedge instrument and designates the hedge instrument as a hedge of either a forecasted transaction or of the variability of cash flows to be received or paid related to an unrecognized asset or liability (a cash flow hedge) or a net investment in a non-U.S. operation (a net investment hedge).\nThe Company performs hedge effectiveness testing on an ongoing basis depending on the type of hedging instrument used. All derivatives not designated as hedging instruments under ASC 815, \"Derivatives and Hedging,\" are revalued in the consolidated statements of income.\nFor all foreign currency derivative instruments designated as cash flow hedges, retrospective effectiveness is tested on a monthly basis using a cumulative dollar offset test. The fair value of the hedged exposures and the fair value of the hedge instruments are revalued, and the ratio of the cumulative sum of the periodic changes in the value of the hedge instruments to the cumulative sum of the periodic changes in the value of the hedge is calculated. The hedge is deemed as highly effective if the ratio is between 80% and 125%. For commodity derivative contracts designated as cash flow hedges, effectiveness is tested using a qualitative assessment of the critical terms of the hedging instrument and the hedged item. Ineffectiveness is minimal as the Company aligns most of the critical terms of its derivatives with the supply contracts.\nFor net investment hedges, the Company assesses its net investment positions in the non-U.S. operations and compares it with the outstanding net investment hedges on a quarterly basis. The hedge is deemed effective if the aggregate outstanding principal of the hedge instruments designated as the net investment hedge in a non-U.S. operation does not exceed the Company’s net investment positions in the respective non-U.S. operation.\nDerivative instruments not designated as hedging instruments under ASC 815 require no assessment of effectiveness.\nA discussion of the Company’s accounting policies for derivative financial instruments is included in Note 1, \"Summary of Significant Accounting Policies,\" of the notes to consolidated financial statements, and further disclosure relating to derivatives and hedging activities is included in Note 10, \"Derivative Instruments and Hedging Activities,\" and Note 11, \"Fair Value Measurements,\" of the notes to consolidated financial statements.\nForeign Exchange\nThe Company has manufacturing, sales and distribution facilities around the world and thus makes investments and enters into transactions denominated in various foreign currencies. In order to maintain strict control and achieve the benefits of the Company’s global diversification, foreign exchange exposures for each currency are netted internally so that only its net foreign exchange exposures are, as appropriate, hedged with financial instruments.\nThe Company hedges 70% to 90% of the nominal amount of each of its known foreign exchange transactional exposures. The Company primarily enters into foreign currency exchange contracts to reduce the earnings and cash flow impact of the variation of non-functional currency denominated receivables and payables. Gains and losses resulting from hedging instruments offset the foreign exchange gains or losses on the underlying assets and liabilities being hedged. The maturities of the forward exchange contracts generally coincide with the settlement dates of the related transactions. Realized and unrealized gains and losses on these contracts are recognized in the same period as gains and losses on the hedged items. The Company also selectively hedges anticipated transactions that are subject to foreign exchange exposure, primarily with foreign currency exchange contracts, which are designated as cash flow hedges in accordance with ASC 815.\nThe Company has entered into foreign currency denominated debt obligations to selectively hedge portions of its net investment in non-U.S. subsidiaries. The currency effects of debt obligations are reflected in the accumulated other comprehensive income (\"AOCI\") account within shareholders’\n equity attributable to Johnson Controls ordinary shareholders where they offset gains and losses recorded on the Company’s net investm\nents globally. \nAt September 30, 2025 and 2024, the Company estimates that an unfavorable 10% change in the exchange rates would have decreased net unrealized gains by approximately $214 million and $144 million, respectively.\nInterest Rates\nSubstantially all of the Company's outstanding debt has fixed interest rates, and, therefore, any fluctuation in market interest rates is not expected to have a material effect on the Company's results of operations. A 100 basis point increase/decrease in the average interest rate on the Company's variable rate debt would have an immaterial impact on interest expense. \n46\nCommodities\nThe Company uses commodity hedge contracts in the financial derivatives market in cases where commodity price risk cannot be naturally offset or hedged through supply base fixed price contracts. Commodity risks are systematically managed pursuant to policy guidelines. As a cash flow hedge, gains and losses resulting from the hedging instruments offset the gains or losses on purchases of the underlying commodities that will be used in the business. The maturities of the commodity hedge contracts coincide with the expected purchase of the commodities.\nENVIRONMENTAL, HEALTH AND SAFETY AND OTHER MATTERS\nThe Company’s global operations are governed by environmental laws and worker safety laws. Under various circumstances, these laws impose civil and criminal penalties and fines, as well as injunctive and remedial relief, for noncompliance and require remediation at sites where Company-related substances have been released into the environment.\nThe Company has expended substantial resources globally, both financial and managerial, to comply with applicable environmental laws and worker safety laws and to protect the environment and workers. The Company believes it is in substantial compliance with such laws and maintains procedures designed to foster and ensure compliance. However, the Company has been, and in the future may become, the subject of formal or informal enforcement actions or proceedings regarding noncompliance with such laws or the remediation of Company-related substances released into the environment. Such matters typically are resolved with regulatory authorities through commitments to compliance, abatement or remediation programs and in some cases payment of penalties. \nRefer to Note 20, \"Commitments and Contingencies,\" of the notes to consolidated financial statements for additional information.",
  "item2": null
}