{
  "item1": "commercial HVAC equipment, industrial refrigeration systems, controls, security systems, fire-detection systems fire-suppression solutions. Company further serves customers providing technical services, including maintenance, management, repair, retrofit replacement equipment (in HVAC, industrial refrigeration, security fire-protection space), energy-management consulting. Company's OpenBlue digital software platform enables enterprises better manage physical spaces combining Company's building products services cutting-edge technology digital capabilities enable data-driven “smart building” services solutions. Company partners customers leveraging its broad product portfolio digital capabilities, together its direct channel service solutions capabilities, deliver solutions services addressing distinct diverse operating environments regulatory requirements address customers’ needs core missions.",
  "item7": "MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS Johnson Controls International plc, headquartered Cork, Ireland, global leader smart, healthy sustainable buildings, serving wide range customers around globe. Company’s products solutions advance safety, comfort intelligence spaces serve people, places planet. Company committed helping its customers win creating greater value all its stakeholders through its strategic focus buildings. Company global leader engineering, manufacturing, commissioning retrofitting building products systems, including commercial heating, ventilating, air-conditioning (\"HVAC\") equipment, industrial refrigeration systems, controls, security systems, fire-detection systems fire-suppression solutions.",
  "item2": "Macroeconomic Trends Much demand Company’s products solutions heavily dependent general economic conditions, localized demand real estate availability credit, public funding other financing sources. Positive negative fluctuations these dependencies could corresponding impact Company’s financial condition, results operations cash flows. Company maintains global operations. United States announced tariffs reciprocal tariffs wide range products manufactured produced worldwide, including Canada, China, European Union, Japan Mexico, among others."
}