{
  "item1": "issued 2023 calendar year. Comparing calendar years 2024 2023, number transactions FDIC-insured banks acquiring merging other banks credit unions decreased 18%. ACU reports number credit unions declined 15% end calendar year 2019 end calendar year 2024. Although number credit unions declined 3% compound annual rate during period, aggregate assets increased compound annual rate 8% totaled $2.3 trillion December 31, 2024.",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS OVERVIEW Jack Henry & Associates, Inc. well-rounded financial technology company headquartered Monett, Missouri, employs approximately 7,240 full-time part-time associates nationwide, leading provider technology solutions payment processing services primarily community regional banks credit unions. solutions serve approximately 7,400 clients consist integrated data processing systems solutions banks ranging de novo multi-billion-dollar institutions assets up $55 billion, core data processing solutions credit unions all sizes, non-core highly specialized core-agnostic products services enable banks credit unions every asset size charter, diverse corporate entities outside financial services industry, mitigate control risks, optimize revenue growth opportunities, contain costs.",
  "item2": "Net income increased 20.8% $143,986, $1.97 per diluted share, first quarter fiscal 2026 compared $119,191, $1.63 per diluted share, same quarter fiscal 2025. total net income increase, quarter over quarter, lower when adjusted gain sale assets deconversion net income current fiscal quarter net income related contractual change deconversion net income prior fiscal year first quarter. increase excluding these one-time items primarily due net organic growth lines revenue first quarter fiscal 2026 partially offset commensurate higher operating expenses increased provision income taxes. REPORTABLE SEGMENT DISCUSSION Company well-rounded financial technology company leading provider technology solutions payment processing services primarily community regional banks credit unions."
}