{
  "source_file": "jkhy-20250630.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.  BUSINESS \nJack Henry & Associates, Inc.\n®\n is a well-rounded financial technology company that strengthens connections between financial institutions and the people and businesses they serve. For nearly 50 years, we have provided technology solutions to help banks and credit unions innovate faster, strategically differentiate, and successfully compete while serving the evolving needs of their accountholders. We empower approximately 7,400 financial institutions and diverse corporate entities with people-inspired innovation, personal service, and insight-driven solutions. \nMission Statement\nWe strengthen the connections between people and their financial institutions through technology and services that reduce the barriers to financial health.\nThis mission has always been part of the foundation on which Jack Henry was built. Our founders, Jack Henry and Jerry Hall, were committed to their community and believed they could help financial institutions better serve the needs of their accountholders by using more innovative technology and services. \nSince our founding in 1976, much has changed, but our commitment to supporting community and regional banks and credit unions remains unwavering. We continue to be guided by our founding philosophy: do the right thing, do whatever it takes, and have fun.\nWho We Serve\nWe provide products and services primarily to community and regional banks and credit unions (see \"Our Industry\" below):\n•\nCore bank integrated data processing systems are provided to over 950 banks. Our banking solutions support both on-premise and private cloud operating environments with functionality for core processing platforms and integrated complementary solutions.\n•\nCore credit union data processing solutions are provided to credit unions of all sizes, with a client base of approximately 715 credit unions. We offer a flagship core processing platform and integrated complementary solutions that support both on-premise and private cloud operating environments.\n•\nNon-core highly specialized core-agnostic products and services are also provided to banks and credit unions. We offer complementary solutions that include highly specialized financial performance, imaging and payment solutions, information security and risk management, retail delivery, and online and mobile functionality. These products and services enhance the performance of traditional banks and credit unions of all asset sizes and charters, and non-traditional diverse corporate entities. In total, we serve approximately 1,670 bank and credit union core clients and over 5,710 non-core clients.\nOur products and services provide our clients with solutions that can be tailored to support their unique growth, service, operational, and performance goals. Our well-rounded solutions also enable banks and credit unions to offer the high-demand products and services required by their accountholders to compete more successfully and to capitalize on evolving trends shaping the financial services industry.\nWe are committed to exceeding our clients’ expectations. We measure and monitor their satisfaction using a variety of surveys, such as an annual survey on the client's anniversary date and randomly-generated online surveys initiated each day by routine support requests to ensure feedback is received throughout the year. The survey results are analyzed and provided to operational areas to ensure our service consistently exceeds our clients’ expectations. We believe this process ensures we understand the Voice of the Customer which contributes to our excellent retention rates.\nWe are focused on establishing long-term client relationships, continually expanding and strengthening those relationships. We do so with cross sales of additional products and services that support our clients' strategy, earning new financial and non-financial clients, and ensuring our product offerings are highly competitive.\nThe majority of our support and services revenue is derived from our private and public cloud services for our hosted clients that are typically on a six-year contract, recurring electronic payment solutions that are generally on a contract term of six years, and our on-premise clients that are typically on a one-year contract. Less predictable software license fees, paid by clients implementing our software solutions on-premise, and hardware sales, including all non-software products that we re-market in order to support our software systems, complement our primary revenue sources. Information regarding the classification of our business into four separate segments is set forth in Note 14 to the consolidated financial statements (see Item 8).\n5\nWe recognize that our associates and their collective contributions are ultimately responsible for Jack Henry's past, present, and future success. Recruiting and retaining high-quality associates is essential to our ongoing growth and financial performance, and we believe we have established an organizational culture that sustains high levels of associate engagement. For further discussion of our human capital considerations, see \"Human Capital\" below.\nOur Industry \nOur core banking solutions generally serve commercial banks and savings institutions with up to $55 billion and above\n \nin assets and are designed to be capable of serving institutions with up to $150 billion in assets. We complete annual, third-party testing to validate this capability each August. According to the Federal Deposit Insurance Corporation (“FDIC”), there were approximately 4,440 commercial banks and savings institutions in the $55 billion and under asset range as of December 31, 2024, and we currently support over 950 of these banks with one of our three core information processing platforms and a significant number of complementary/payment products and services.  \nOur core credit union solutions serve credit unions of all asset sizes. According to America's Credit Unions (\"ACU\") (formerly Credit Union National Association), there were 4,550 domestic credit unions as of December 31, 2024, and we currently support approximately 715 of these credit unions with one flagship core information processing platform and a significant number of complementary/payment products and services.\nOur non-core solutions serve banks and credit unions of all asset sizes and charters and other diverse corporate entities. We support these organizations with specialized solutions for generating additional revenue and growth, increasing security, mitigating operational risks, and controlling operating costs.\nThe FDIC reports the number of commercial banks and savings institutions declined 13% from the end of calendar year 2019 to the end of calendar year 2024, due mainly to mergers and acquisitions. Although the number of banks continued to decline at a 3% compound annual rate during this period, aggregate assets increased at a compound annual rate of 5% and totaled $24.1 trillion as of December 31, 2024. There were six new bank charters issued in calendar year 2024 and six\n \nissued in the 2023 calendar year. Comparing calendar years 2024 to 2023, the number of transactions of FDIC-insured banks acquiring or merging with other banks or credit unions decreased 18%.\nACU reports the number of credit unions declined 15% from the end of calendar year 2019 to the end of calendar year 2024. Although the number of credit unions declined at a 3% compound annual rate during this period, aggregate assets increased at a compound annual rate of 8% and totaled $2.3 trillion as of December 31, 2024.\nDespite continued industry consolidation, Jack Henry net core footprints increased year-over-year from calendar year 2023 to calendar year 2024 in both bank and credit union client bases. Furthermore, the average assets under management for our banking core clients grew from $1.26 billion to $1.29 billion, and the average assets under management for our credit union core clients grew from $1.17 billion to $1.20 billion.\nCommunity and regional banks and credit unions are vitally important to the communities, consumers, and businesses they serve as well as to the local economies where they operate. Bank and credit union accountholders rely on these institutions to provide personalized, relationship-based service and competitive financial products and services available through the accountholders' delivery channel of choice. Institutions are recognizing that attracting and retaining accountholders in today’s highly competitive financial industry and realizing near-term and long-term performance goals are often technology dependent. Banks and credit unions must implement technological solutions that enable them to:\n•\nOffer digital strategies that provide the convenience-driven services required in today’s financial services industry.\n•\nMaximize performance with accessible, accurate, and timely business intelligence information.\n•\nProvide the high-demand products and services needed to successfully compete with traditional and non-traditional competitors created by convergence within the financial services industry.\n•\nFoster growth and efficiency through delivering accountholders exceptional user experiences.\n•\nExpand existing accountholder relationships and strengthen exit barriers by cross selling additional products and services.\n•\nCapitalize on new revenue, and deposit and loan portfolio growth opportunities.\n•\nIncrease operating efficiencies and reduce operating costs. \n•\nProtect mission-critical information assets and operational infrastructure.\n•\nProtect accountholders with various security tools from fraud and related financial losses.\n•\nMaximize the day-to-day use of technology and return on technology investments.\n•\nEnsure full regulatory compliance.\n6\nJack Henry’s extensive product and service offerings help diverse banks and credit unions meet business challenges and capitalize on opportunities. We strive to get to know our clients, understand their strategies and challenges, and provide innovative solutions that help them achieve short- and long-term success. \nBusiness Strategy \nOur fundamental business strategy is to generate organic revenue and earnings growth augmented by strategic acquisitions. Our strategy for the next three to five years is to enable banks and credit unions to win on exceptional user experience and trust through open, innovative technology, data-driven insights, and service, resulting in greater growth and efficiency. We intend to execute this strategy by:\n•\nProviding community and regional banks and credit unions with core processing systems that provide excellent functionality and support on-premise and private cloud delivery environments with identical functionality.\n•\nExpanding each core client relationship by cross-selling complementary/payment products and services that enhance the functionality provided by our core processing systems.\n•\nDelivering non-core highly specialized core-agnostic complementary/payment products and services to banks and credit unions, including institutions not utilizing one of our core processing systems, and diverse corporate entities.\n•\nDeveloping and deploying a long-term technology modernization strategy to provide public cloud-native solutions that provide clients with greater flexibility, optionality, open integration, speed to market, and other benefits.\n•\nUpholding a company-wide commitment to service that consistently exceeds our clients’ expectations and generates high levels of retention.\n•\nCarrying out a large client strategy that focuses on deep engagement with banks and credit unions to align objectives, optimize revenue streams, and foster collaborative growth and innovation through continuous engagement and commitment to excellence.\n•\nGrowing our market share of services to small and medium-sized businesses offering features through banks and credit unions.\n•\nBuilding, maintaining, and enhancing a protected environment and tools that help our clients and Jack Henry protect accountholder data, assets, and comply with regulations.\n•\nMaintaining a disciplined acquisition strategy.\nTechnology Modernization Strategy\nOur public cloud-native technology modernization strategy seeks to enable our bank and credit union clients to innovate faster, differentiate themselves in the markets they serve, and meet the evolving needs of their accountholders.\nThe Jack Henry Platform\nTM \nis the centerpiece of this strategy and operates as a single public cloud-native, API-first platform, which we are developing into a fully functional modern alternative for existing core functions. The platform includes services like wire transfers, a centralized data hub for reporting and analysis, exception item processing, general ledger, deposit servicing, and entitlements. These services can be combined with other Jack Henry public cloud-native solutions, such as digital banking, digital payments, and fraud detection, as well as third-party provider solutions on a single, unified platform.\nThe Jack Henry Platform leverages public cloud advantages, including high system availability, rapid processing, modern security standards, easily deployable upgrades, and scalability. \nAcquisition Strategy\nWe have a disciplined approach to acquisitions and have been successful in supplementing our organic growth with 35 strategic acquisitions since the end of fiscal year 1999. We continue to explore acquisitions that have the potential to: \n•\nExpand our suite of complementary/payment products and services.\n•\nProvide products and services that can be sold to both existing core and non-core clients as well as outside our core base to new clients.\n•\nAccelerate our internal development efforts for technology modernization.\n•\nProvide selective opportunities to sell outside our traditional markets in the financial services industry. \nAfter nearly 50 years in business, we have very few gaps in our product line, so it is increasingly difficult to find proven products or services that would enable our clients and prospects to better optimize their business opportunities or solve specific operational issues. In addition, we see few acquisition opportunities that would \n7\nexpand our market or enable our entry into adjacent markets within the financial services industry that are fairly priced or that we could assimilate into our Company without material distractions. \nWe have a solid track record of executing acquisitions from both a financial and operational standpoint, and we will continue to pursue acquisition opportunities that support our strategic direction, complement and accelerate our organic growth, and generate long-term profitable growth for our stockholders. While we seek to identify appropriate acquisition opportunities, we will continue to explore alternative ways to leverage our cash position and balance sheet to the benefit of our stockholders, such as continued investment in new products and services for our clients, repurchases of our stock, and continued payment of dividends.\nOur most recent acquisition was:\nFiscal Year\nCompany or Product Name\nProducts and Services\n2023\nPayrailz, LLC (\"Payrailz\")\nProvider of cloud-native modern digital payment capabilities leveraging AI and machine learning features for the financial services industry.\nSolutions\n•\nOur core banking solutions support commercial banks with information and transaction processing platforms that provide enterprise-wide automation. We have three functionally distinct core bank processing systems and many fully integrated complementary/payment solutions, including business intelligence and bank management, retail and business banking, digital and mobile internet banking and electronic payment solutions, fraud and risk management and protection, account origination, and item and document imaging solutions. Our core banking solutions have state-of-the-art functional capabilities, and we can re-market the hardware required by on-premise use of each software system. Our banking solutions can be delivered on-premise or through our private cloud delivery model and are backed by a company-wide commitment to provide exceptional client support. \n•\nOur core credit union solutions support credit unions of all sizes with an information and transaction processing platform that provides enterprise-wide automation. Our solution includes one flagship core processing system and many fully integrated complementary/payment solutions, including business intelligence and credit union management, accountholder and accountholder business services, digital and mobile internet banking and electronic payment solutions, fraud and risk management and protection, account origination, and item and document imaging solutions. Our credit union solution also has state-of-the-art functional capabilities. We also re-market the hardware required by on-premise use of the software system. Our credit union solution can be delivered on-premise, through our private cloud, or through our partner private cloud delivery models. Each is backed by our company-wide commitment to provide exceptional client support. \n•\nOur non-core solutions for banks, credit unions, and diverse corporate entities are specialized products and services assembled primarily through our focused diversification acquisition strategy. These core-agnostic solutions are compatible with a wide variety of information technology platforms and operating environments and offer a large number of complementary/payment solutions, including proven solutions for generating additional revenue and growth, increasing security and mitigating operational risks, and/or controlling operating costs. Our non-core products and services enhance the performance of banks and credit unions of all asset sizes and charters, and diverse corporate entities. These distinct products and services can be implemented individually or as solution suites to address specific business problems or needs and enable effective responses to dynamic industry trends.\nWe are committed to developing and maintaining modern and integrated solutions supported by high service levels. We continuously update and improve these solutions through an interactive client enhancement process, ensuring compliance with relevant regulations, and incorporating proven advances in technology. Our goal is to uphold our Company's reputation as a premium solution and service provider.\nCore Software Systems\nCore software systems primarily consist of the integrated applications required to process deposit, loan, and general ledger transactions, and to maintain centralized accountholder information.\nOur core banking solutions consist of three software systems marketed to banks, and our core credit union solution consists of one software system marketed to credit unions. These core systems are available for on-premise installation at client sites, or banks and credit unions can choose to leverage our private cloud environment for ongoing information processing.\n8\nCore banking platforms are:\n•\nSilverLake System\n®\n, \na robust system primarily designed for commercial-focused banks that currently serves banks with assets ranging from $1 billion to over $55 billion. Some progressive smaller banks and de novo (start-up) banks also select SilverLake. This system is in use by 520 banks, and now serves nearly 12% of the domestic banks in the $55 billion and under asset range.\n•\nCIF 20/20\n®\n, \na parameter-driven, easy-to-use system that now supports 260 banks ranging from de novo institutions to those with assets of $6 billion.\n•\nCore Director\n®\n, \na cost-efficient system with point-and-click operation that now supports over 170 banks ranging from de novo institutions to those with assets of $2 billion.\nCore credit union platform is:  \n•\nSymitar\n®\n (formerly known as Episys\n®\n),\n a robust system designed specifically for credit unions. It has been implemented by approximately 715 credit unions with assets ranging from $20 million to $33 billion, and according to National Credit Union Administration (\"NCUA\") data, is the system implemented by more credit unions with assets exceeding $25 million than any other credit union core system.\nClients electing to install our solutions on-premise license the proprietary software systems. The majority of these clients pay ongoing annual software maintenance fees. We re-market the hardware, hardware maintenance, and peripheral equipment that is required by on-premise use of our software solutions; and we perform software implementation, data conversion, training, ongoing support, and other related services. On-premise clients generally license our core software systems under a standard license agreement that provides a fully paid, nonexclusive, nontransferable right to use the software on a single computer at a single location.\nClients can eliminate the significant up-front capital expenditures required by on-premise installations and the responsibility for operating information and transaction processing infrastructures by leveraging our private cloud environment for those functions. Our core private cloud services are provided through a highly resilient data center configuration across multiple physical locations. We also provide image item processing services from two host/archive sites and several key entry and balancing locations throughout the country. We print and mail accountholder statements for banks and credit unions from three regional printing and rendering centers. Clients electing to outsource their core processing typically sign contracts for six years that include \"per account\" fees and minimum guaranteed payments during the contract period.\nWe are dedicated to meeting the evolving business needs of our core bank and credit union clients by continuously enhancing each core system, introducing new integrated complementary products regularly, integrating practical new technologies, and adhering to regulatory compliance initiatives. Additionally, we serve as a single point of contact for each core client for support and accountability. \nComplementary Products and Services  \nWe have a large number of complementary/payment products and services that are targeted to our core banks and  credit unions. Many of these are selectively sold to banks and credit unions that use other core processing systems.\nThese complementary/payment solutions enable core bank and credit union clients to respond to evolving accountholder demands, expedite speed-to-market with competitive offerings, increase efficiency, address specific operational needs, and generate new revenue streams. The highly specialized solutions enable diverse banks, credit unions, and corporate entities to generate additional revenue and growth opportunities, increase security, mitigate operational risks, and control operating costs.\nWe regularly introduce new products and services based on demand for integrated complementary/payment solutions from our existing core clients and based on the growing demand among banks, credit unions, and corporate entities for specialized solutions capable of increasing revenue and growth opportunities, mitigating and controlling operational risks, and/or containing costs. Our Industry Research department solicits client guidance on the business solutions they need, evaluates available solutions and competitive offerings, and manages the introduction of new product offerings. Our new complementary/payment products and services are developed internally, acquired, or provided through strategic alliances.\nImplementation and Training\nMost of our core bank and credit union clients contract with us for implementation and training services in connection with their systems and additional complementary products.\nA complete core system implementation typically includes detailed planning, project management, data conversion, and testing. Our experienced implementation teams travel to client facilities or work remotely with clients to help \n9\nmanage the implementation process and ensure that all data is transferred from the legacy system to the Jack Henry system. Our implementation fees are fixed or hourly based on the core system being installed.\nWe also provide extensive initial and ongoing education to our clients. We have a comprehensive training program that supports new clients with basic training and longtime clients with continuing education. The training enables banks and credit unions to maximize the use of our core and complementary solutions, learn about ongoing system enhancements, and understand evolving legislative and regulatory requirements. \nSupport and Services \nWe serve our core clients as a single point of contact and support for the solutions we provide. Our comprehensive support infrastructure incorporates:\n•\nHigh service standards.\n•\nTrained support staff available up to 24 hours a day, 365 days a year.\n•\nAssigned account team.\n•\nSophisticated support tools, resources, and technology.\n•\nBroad experience converting diverse banks and credit unions to our core platforms from competitive platforms. \n•\nHighly effective change management and control processes.\n•\nBest practices methodology developed and refined through the company-wide, day-to-day experience. \nMost on-premise clients contract for annual software support services, and this represents a significant source of recurring revenue for Jack Henry. These support services are typically priced at approximately 20% of the respective product’s software license fee. The subsequent years' service fees generally increase as client assets increase and as additional complementary products are purchased. Annual software support fees typically are billed during June and are paid in advance for the entire fiscal year, with proration for new product implementations that occur during the fiscal year. Hardware support fees also are usually paid in advance for entire contract periods which typically range from one to five years. Most support contracts automatically renew unless the client or Jack Henry gives notice of termination at least 30 days prior to contract expiration.\nHigh levels of support are provided to our private cloud clients by the same support infrastructure utilized for on-premise clients. However, these support fees are included as part of monthly private cloud fees.\nHardware Systems\nOur software systems operate on a variety of hardware platforms. We have established remarketing agreements with IBM Corporation, and many other hardware providers that allow Jack Henry to purchase hardware and related maintenance services at a discount and resell them directly to our clients. We currently sell IBM Power Systems™; Lenovo\n®\n, Dell, Hewlett Packard Enterprise, and Cisco servers and workstations; Canon\n®\n, Digital Check, Epson\n®\n, and Panini\n®\n check scanners; and other devices that complement our software solutions.\nDigital Products and Services\nJack Henry Digital provides a unified platform of digital products and services, anchored by the Banno Digital Platform™. This native and browser-based banking solution empowers community and regional banks and credit unions to strategically enhance their digital offerings and compete effectively with larger banks and tech companies. It's a comprehensive business and retail open platform delivering attractive, fast, cloud-native applications for accountholders and cloud-based, core-connected back-office tools for employees. Our treasury platform is a separate digital product that services the needs of banks' and credit unions' larger commercial customers. \nPayment Solutions\nElectronic payment solutions provide our clients with the tools necessary to be at the forefront of payment innovation with secure payment processing designed to simplify complex payment processing, attract profitable retail and commercial accounts, increase operating efficiencies, comply with regulatory mandates, and proactively mitigate and manage payment-related risk.\n•\nJHA Card Processing Solutions™ (\"CPS\")\n supports full-service and in-house debit and credit card programs, as well as an agent credit option, backed by a comprehensive suite of tools for 24/7 fraud mitigation, digital payments, full-service dispute management, plastics manufacturing and personalization, loyalty programs, data analytics, and ATM terminal driving. In addition, advisory services are offered to support a variety of needs including card portfolio growth, start-up program consultation, as well as customized fraud management; all tailored to individual bank and credit union goals and concerns. \n•\nEnterprise Payment Solutions (\"EPS\")\n is a comprehensive payments engine, offering an integrated suite of Automated Clearing House (\"ACH\"), instant payments, credit card, and remote deposit capture processing that \n10\nincludes supporting tools for accounts receivable posting, risk management, reporting, and application interfaces (\"APIs\") for banks, credit unions, businesses, and fintechs of all sizes. EPS helps clients succeed in today’s competitive market to increase revenue, improve efficiencies, better manage compliance, and enhance accountholder relationships. \n•\nPayrailz\nTM \nPayments Platform\n provides consumers and businesses with money movement options through their bank's or credit union's digital platforms. It supports our technology modernization strategy by providing next-generation, cloud-native digital payment capabilities to our payment ecosystem. This money movement payments platform incorporates artificial intelligence (\"AI\") to make predictive and proactive recommendations, a flexible modern user experience, a layered security model, an automated fraud feature powered by machine learning, and a contemporary, adaptable administrative portal. In addition to bill payment capabilities, we provide a 'pay a loan' feature, an 'open looped' real-time person-to-person (\"P2P\") solution, and account-to-account (\"A2A\") transfer features. The array of money movement options maintains consumer and business engagement with the bank or credit union.\n•\nJHA PayCenter\nTM\n provides banks and credit unions with a single entry point to both Zelle\n®\n and Real Time Payments (\"RTP\") networks, and the Federal Reserve's FedNow\n® \nnetwork. PayCenter manages the certification process and mandatory updates from the networks, simplifies integration with toolkits, and provides fraud monitoring. Banks and credit unions can send and receive transactions instantly 24 hours a day, 365 days a year, through our core and complementary solutions.\n•\nPayments as a Service (\"PaaS\")\n supports embedded payment capabilities and ties together and further enhances the complete array of electronic payments functionality with a front-end Payments Developers Experience Portal, APIs, and back-end data analytics.\nResearch and Development\nWe invest significant resources in ongoing research and development to build new software solutions and services and enhance existing solutions with additional functionality and features required to ensure regulatory compliance. We enhance our core and complementary systems a minimum of once each year. Product-specific enhancements are largely client-driven with recommended opportunities formally gathered through focus groups, change control boards, strategic initiatives meetings, annual user group meetings, and ongoing client contact. We also continually evaluate and implement process improvements that expedite the delivery of new products and enhancements to our clients and reduce related costs.\nResearch and development expenses (in thousands) for fiscal 2025, 2024, and 2023 were $162,771, $148,256, and $142,678, respectively. We recorded capitalized software (in thousands) in fiscal 2025, 2024, and 2023 of $172,445, $167,175, and $166,120, respectively. \nSales and Marketing\nWe serve established, well-defined markets that provide ongoing sales and cross-sell opportunities.\nThe marketing and sales initiatives within the core business lines are primarily focused on identifying banks and credit unions evaluating alternative core information and transaction processing solutions. Our non-core specialized core-agnostic niche solutions are sold to complement existing technology platforms to banks and credit unions of all asset sizes and charters.\nSales executives are responsible for the activities required to earn new clients in assigned territories, and regional account executives are responsible for nurturing client relationships and cross selling additional products and services. Our sales professionals receive base salaries and performance-based commission compensation. Sales support staff provide a variety of services, including product and service demonstrations, responses to prospect-issued requests-for-proposals, and proposal and contract generation. Our marketing department supports sales with lead generation and brand-building activities, including participation in state-specific, regional, and national trade shows; print and online advertising; client newsletters; ongoing promotional campaigns; and media relations. We also host an annual national education conference, which provides opportunities to network with existing clients and demonstrate new products and services.\nJack Henry has sold select products and services outside the United States, primarily in Latin America, the Caribbean and Canada. International sales accounted for less than 1% of Jack Henry’s total revenue in each of fiscal 2025, 2024, and 2023.\nCompetition\nThe market for companies providing technology solutions to financial services organizations is competitive, and we expect that competition from both existing competitors and companies entering our existing or future markets will remain strong. Some of our current competitors have longer operating histories, larger client bases, and greater \n11\nfinancial resources. The principal competitive factors affecting the market for technology solutions include culture, service, innovation, strategy, and execution, along with product/service functionality, price, operating flexibility, and ease-of-use. For more than a decade, there has been significant consolidation among providers of products and services designed for banks and credit unions, and this consolidation is expected to continue in the future.\nOur core solutions compete with large vendors that provide information and transaction processing solutions to banks and credit unions, including Fidelity National Information Services, Inc.; Fiserv, Inc.; Corelation, Inc.; and Finastra. Our non-core specialized solutions compete with an array of disparate vendors that provide niche solutions to financial services organizations and corporate entities.\nIntellectual Property, Patents, and Trademarks  \nAlthough we believe our success depends upon our technical expertise more than our proprietary rights, our future success and ability to compete depend in part upon our proprietary technology. We have registered or filed applications for our primary trademarks. Most of our technology is not patented. Instead, we rely on a combination of contractual rights, copyrights, trademarks, and trade secrets to establish and protect our proprietary technology. We generally enter into confidentiality agreements with our associates, consultants, resellers, clients, and  prospects. Access to and distribution of our Company’s source code is restricted, and the disclosure and use of other proprietary information is further limited. Despite our efforts to protect our proprietary rights, unauthorized parties can attempt to copy or otherwise obtain, or use our products or technology. \nRegulatory Compliance\nJack Henry maintains a corporate commitment to address compliance issues and implement requirements imposed by federal regulators prior to the effective date of such requirements when adequate prior notice is given. Our compliance program is coordinated by a team of qualified compliance professionals with extensive regulatory agency and financial institution experience, knowledge and understanding of Federal consumer protection regulations, and a thorough working knowledge of Jack Henry and our solutions. These compliance professionals leverage multiple channels to remain informed about potential and recently enacted regulatory requirements, including discussions on emerging topics with the Federal Banking Agencies (“FBA”), and training sessions sponsored by various professional associations.\nWe have processes in place to inform internal stakeholders of new and revised regulatory requirements. Upcoming regulatory changes also are presented to the Company’s development teams through periodic regulatory compliance meetings and the necessary product changes are included in the ongoing product development cycle. We publish newsletters to keep our clients informed of regulatory changes that could impact their operations. Periodically, client advisory groups are assembled to discuss significant regulatory changes.\nInternal audits of our systems, networks, operations, business recovery plans, and applications are conducted and specialized outside firms are periodically engaged to perform testing and validation of our systems, processes, plans, and security. The FBA conducts ongoing examinations of the Company and issues Reports of Examination. The Board of Directors provides oversight of these activities through the Risk and Compliance Committee and the Audit Committee.\nGovernment Regulation\nThe financial services industry is subject to extensive and complex federal and state regulation. All financial institutions are subject to substantial regulatory oversight and supervision. Our products and services must comply with the extensive and evolving regulatory requirements applicable to our clients, including but not limited to those mandated by federal truth-in-lending and truth-in-savings rules, the Privacy of Consumer Financial Information regulations, usury laws, the Equal Credit Opportunity Act, the Fair Housing Act, the Electronic Funds Transfer Act, the Fair Credit Reporting Act, the Bank Secrecy Act, the USA Patriot Act, the Gramm-Leach-Bliley Act, the Community Reinvestment Act and the Dodd-Frank Wall Street Reform and Consumer Protection Act. The compliance of Jack Henry’s products and services with these requirements depends on a variety of factors, including the parameters set through the interactive design, the classification of clients, and the manner in which the client utilizes the products and services. Our clients are contractually responsible for assessing and determining what is required of them under these regulations and then we provide solutions that assist them in meeting their regulatory needs through our products and services. We cannot predict the impact these regulations, any future amendments to these regulations or any newly implemented regulations will have on our business in the future.\nJack Henry is not chartered by the Office of the Comptroller of Currency (\"OCC\"), the Board of Governors of the Federal Reserve System, the FDIC, the NCUA or other federal or state agencies that regulate or supervise depository institutions. However, operating as a service provider to banks and credit unions, Jack Henry’s operations are governed by the same regulatory requirements as those imposed on financial institutions, and \n12\nsubject to periodic reviews by FBA regulators who have broad supervisory authority to remedy any shortcomings identified in such reviews. Jack Henry is also subject to periodic examinations by the Consumer Financial Protection Bureau (“CFPB”), which provides supervision and enforcement related to federal consumer financial laws applicable to some products and services offered by our clients.\nWe provide private cloud services through Jack Henry Processing Services™ for banks and EASE Processing Services™ for credit unions. We provide data centers and electronic transaction processing through JHA Card Processing Solutions™, internet banking through NetTeller\n®\n and Banno\nTM\n online solutions, bill payment through our Payrailz\nTM\n Payments Platform, network security monitoring and Hosted Network Solutions (\"HNS\") through our Gladiator\n®\n unit, cloud services through Hosted Partner Services and Enterprise Integration Services, and business recovery services through Centurion Disaster Recovery\n®\n.\nOur private cloud services are subject to examination by FBA regulators under the Bank Service Company Act. These examinations cover a wide variety of subjects, including system development, functionality, reliability, and security, as well as disaster preparedness and business recovery planning. Our private cloud services are also subject to examination by state banking authorities on occasion.\nHuman Capital\nOur Associates\nAs of June 30, 2025, Jack Henry had approximately 7,240 full-time and part-time associates. Our associates are not covered by a collective bargaining agreement and there have been no labor-related work stoppages.\nTalent Attraction and Engagement\nOur people and culture strategy is focused on attracting, engaging, and retaining associates that are qualified and innovative with future-ready technical skills. We are an equal opportunity employer and are committed to considering all qualified candidates for employment.\nWe seek non-traditional talent streams to help identify candidates from underrepresented groups. Our internship attracts college and university students, and our apprenticeship program offers paid training and work for candidates with little to no traditional experience, such as computer coding. Both programs can lead to full-time employment.\nWe are committed to fostering a respectful and inclusive workplace where all individuals are treated with respect and dignity, and we focus on ensuring all associates feel they belong at Jack Henry. \nBusiness Innovation Groups (\"BIGs\"), which are open to all associates, help us to foster a culture of inclusion and belonging. These groups provide input and suggestions to address business problems and offer education and training to foster inclusion and belonging. As of June 30, 2025, we had over 1,770 unique associates and nearly\n \n2,810 combined associates participating in six active BIGs. A significant portion of the Company’s associates work remotely on either a full-time or hybrid remote/office basis. The Company remains focused on equipping all associates with the tools necessary to effectively communicate, collaborate, and build connections in a remote environment, including ensuring leaders have the skills needed to effectively lead dispersed teams.\nWe seek to actively listen to our associates throughout the year using a defined and continuous listening strategy designed to gather regular feedback on well-being, engagement, leadership, ethics, culture and values, satisfaction, and sense of belonging, through channels such as our annual engagement survey, pulse surveys, skip-a-level interviews, and town halls. This comprehensive strategy allow us to respond to associate concerns, benefit from associate perspectives, and better design and develop processes to support our Company culture. Associates can learn about changes through our internal online news center, regular email communications, monthly Manager Forum events, quarterly associate update videos, or all-associate town hall meetings delivered by senior management.\nLearning and Development\nOur success depends not only on attracting and retaining talented associates, but also in developing our current associates and providing new opportunities for their growth. We offer our associates numerous live and on-demand courses, resources, and training programs to help them build knowledge, improve skills, and develop their career at Jack Henry. Learning opportunities include mandatory courses, as well as recommended content in areas such as leadership development, technical skills, business acumen, innovation, and change management. Jack Tracks, an annual, company-wide virtual learning event, offers associates a large selection of curated topics such as technical and operational readiness, technology trends, company solutions, and industry trends.\nRecognizing the importance of mentoring in career development, we host an internal mentorship marketplace, which allows prospective mentors and mentees to connect and self-initiate a mentoring relationship. Career mobility \n13\nand personal development resources are available to all associates through dedicated intranet sites including an internal career website where associates can explore new opportunities, register their skills, and view salary ranges. We continue to strengthen our leadership capacity by providing training on effective coaching practices to leaders of the Company.\nWe recognize and value the contribution of our associates who develop, improve, and support our technology solutions. Access to on-demand technical training libraries, customized learning plans, certification programs, and classes facilitated by external experts are available to advance their technical expertise. When there is a critical skill need or where the technology landscape is rapidly changing, we provide unique learning solutions to align associates' development with our strategic initiatives.\nWellness and Safety\nWe emphasize the safety and well-being of our associates as a top priority. We define wellness holistically and include mental, physical, emotional, financial, psychological, and environmental considerations. Our benefit plan offerings include supportive and dedicated campaigns that communicate directly to associates about financial wellness, mental health, healthful nutrition and exercise, and other wellness topics. Associate well-being is further supported through policies such as remote work, paid parental leave, military service leave, educational assistance, and bereavement leave policies, as well as paid time off, adoption assistance, an employee assistance program, wellness incentives, and paid community volunteer hours.\nAvailable Information\nJack Henry’s website is easily accessible to the public at \njackhenry.com\n. The “Investor Relations\" portion of the website provides key corporate governance documents, the code of conduct, an archive of press releases, and other relevant Company information. Our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and other filings and amendments thereto that are made with the SEC also are available free of charge on our website as soon as reasonably practical after these reports have been filed with or furnished to the SEC. The SEC also maintains a website that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at \nhttps://www.sec.gov\n.",
  "item7": "ITEM 7.   MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following section provides management's view of the Company's financial condition and results of operations and should be read in conjunction with the audited consolidated financial statements, and related notes included elsewhere in this report. All dollar and share amounts, except per share amounts, are in thousands and discussions compare fiscal 2025 to fiscal 2024. Discussions of fiscal 2023 items and comparisons between fiscal 2023 and fiscal 2024 that are not included in this Form 10-K can be found in Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the fiscal year ended June 30, 2024.\nOVERVIEW\nJack Henry & Associates, Inc. is a well-rounded financial technology company headquartered in Monett, Missouri, that employs approximately 7,240 full-time and part-time associates nationwide, and is a leading provider of technology solutions and payment processing services primarily to community and regional banks and credit unions. Our solutions serve approximately 7,400 clients and consist of integrated data processing systems solutions to banks ranging from de novo to multi-billion-dollar institutions with assets up to $55 billion, core data processing solutions for credit unions of all sizes, and non-core highly specialized core-agnostic products and services that enable banks and credit unions of every asset size and charter, and diverse corporate entities outside the financial services industry, to mitigate and control risks, optimize revenue and growth opportunities, and contain costs. Our integrated solutions are available for on-premise installation and delivery in our private and public cloud.\nEach of our solutions shares the fundamental commitment to provide high-quality business systems, service levels that consistently exceed client expectations, and integration of solutions and practical new technologies. The quality of our solutions, our high service standards, and the fundamental way we do business typically foster long-term client relationships, attract prospective clients, and have enabled us to capture substantial market share. \nThrough internal product development, disciplined acquisitions, and alliances with companies offering niche solutions that complement our proprietary solutions, we regularly introduce new products and services and generate new cross-sales opportunities. We provide compatible computer hardware for our on-premise installations and secure processing environments for our outsourced solutions in our private and public cloud. We perform data conversions, software implementations, initial and ongoing client training, and ongoing client support services. \nWe believe our primary competitive advantage is client service. Our support infrastructure and strict standards provide service levels that generate high levels of client satisfaction and retention. We consistently measure client satisfaction using a variety of surveys, such as an annual survey on the client's anniversary date and randomly-generated surveys initiated each day by routine support requests. Dedicated surveys are also used to grade specific aspects of our client experience, including product implementation, education, and consulting services.\nOur two primary revenue streams are \"services and support\" and \"processing.\" Services and support includes: \"private and public cloud\" revenues that predominantly have contract terms of six years at inception; \"product delivery and services\" revenues, which include revenues from the sales of licenses, implementation services, deconversions, consulting, and hardware; and \"on-premise support\" revenues, composed of maintenance fees that primarily contain annual contract terms. Processing includes: \"remittance\" revenues from payment processing, remote capture, and ACH transactions; \"card\" revenues, including card transaction processing and monthly fees; and \"transaction and digital\" revenues, which include transaction and mobile processing revenues. We continually seek opportunities to increase revenue while at the same time containing costs to expand margins.\nWe have four reportable segments: Core, Payments, Complementary, and Corporate and Other. The respective segments include all related revenues along with the related cost of revenue.\nA detailed discussion of the major components of the results of operations follows.\n25\nTable of Contents\nRESULTS OF OPERATIONS\nFISCAL 2025 COMPARED TO FISCAL 2024\nIn fiscal 2025, total revenue increased 7.2% or $159,745, compared to fiscal 2024. Reducing total revenue for deconversion revenue of $33,905 in the current fiscal year and $16,554 in the prior fiscal year, results in a 6.5% increase, or $142,394. This increase was mainly driven by growth in data processing and hosting within cloud revenue as new clients were added and volumes expanded, card processing revenue primarily from expanded fraud detection and prevention risk management services and monthly service fees, digital revenue as active monthly users and volumes increased, and payment processing revenue from expanding volumes and new client revenue.\nOperating expenses increased 4.7%, or $80,421, in fiscal 2025 compared to fiscal 2024. Reducing total operating expenses for deconversion costs of $6,242 in the current fiscal year and $3,408 in the prior fiscal year and for VEDIP related costs of $16,443 in the prior fiscal year, results in a 5.5% increase, or $94,031 (The VEDIP program was a Company voluntary separation program offered to certain eligible associates who chose to participate in the program from July through December 2023, including immaterial payments that continued into calendar 2024). The increase in operating expenses was primarily due to higher direct costs generally commensurate with increases in the related lines of revenue, higher personnel costs including increases in compensation costs during the trailing twelve months, and higher internal licenses and fees from price increases and more deployments in the current fiscal year.\nAs we move into fiscal 2026 – our 50\nth\n year in business – we are excited and confident about our future, and we remain well-positioned to deliver durable, consistent growth and attractive results for our shareholders. Technology spending by financial institutions remains strong, and there is clear demand for our differentiated and innovative technology solutions. We have a very healthy sales pipeline and a proven ability to attract and win deals, especially with larger financial institutions. Our unwavering focus on culture, service, innovation, strategy, and execution continues to set us apart in the market and will enable us to drive continued industry-leading revenue growth with strong margin expansion, benefiting our associates, clients, and shareholders.\nA detailed discussion of the major components of the results of operations for the fiscal year ended June 30, 2025 compared to the fiscal year ended June 30, 2024 follows.\nREVENUE\nServices and Support Revenue\nYear Ended June 30,\n% \nChange\n \n2025\n2024\nServices and support\n$\n1,361,737\n \n$\n1,275,954 \n6.7%\nPercentage of total revenue\n57%\n58%\n \nServices and support includes: \"private and public cloud\" fees, which predominantly have contract terms of six years at inception; \"product delivery and services\" revenue, which includes revenue from the sales of licenses, implementation services, deconversion fees, consulting, and hardware; and \"on-premise support\" revenue, which is composed primarily of maintenance fees with annual contract terms. \nIn the fiscal year ended June 30, 2025, services and support revenue increased 6.7% compared to the prior fiscal year. Reducing total services and support revenue by deconversion revenue for each year, which totaled $33,905 in fiscal 2025 and $16,554 in fiscal 2024, services and support revenue grew 5.4%. This increase was primarily driven by higher data processing and hosting within cloud revenue as new clients were added and volumes expanded and increased consulting, work order, and release revenues, partially offset by the decrease in license and hardware revenues, year over year.\nProcessing Revenue\nYear Ended June 30,\n%\nChange\n \n2025\n2024\nProcessing\n$\n1,013,551\n \n$\n939,589 \n7.9%\nPercentage of total revenue\n43%\n42%\n \nProcessing revenue includes: \"remittance\" revenue from payment processing, remote capture, and ACH transactions; \"card\" fees, including card transaction processing and monthly fees; and \"transaction and digital\" revenue, which includes transaction and mobile processing fees.\n26\nTable of Contents\nProcessing revenue increased 7.9% for the fiscal year ended June 30, 2025, compared to the fiscal year ended June 30, 2024. This increase was driven by growth in card from expanded fraud detection and prevention risk management services and monthly service fees, digital revenue as active monthly users and volumes increased, and payment processing revenue from expanding volumes and new client revenue.\nOPERATING EXPENSES\nCost of Revenue\nYear Ended June 30,\n%\nChange\n \n2025\n2024\nCost of revenue\n$\n1,360,747\n \n$\n1,299,477 \n4.7%\nPercentage of total revenue\n57%\n59%\n \nCost of revenue for fiscal 2025 increased 4.7% compared to fiscal 2024. Reducing total cost of revenue for deconversion costs of $3,517 in the current fiscal year and $2,231 in the prior fiscal year results in a 4.6% increase. This increase was driven by higher direct costs consistent with increases in the related revenue and higher personnel costs including increases in compensation costs during the trailing twelve months. Cost of revenue decreased 2% as a percentage of total revenue for fiscal 2025 compared to fiscal 2024.\nResearch and Development\nYear Ended June 30,\n%\nChange\n \n2025\n2024\nResearch and development\n$\n162,771\n \n$\n148,256 \n9.8%\nPercentage of total revenue\n7%\n7%\n \nWe devote significant effort and expense to develop new software and service products and continually upgrade and enhance our existing offerings. We believe our research and development efforts are highly efficient because of the extensive experience of our research and development staff and because our product development is highly client driven.\nResearch and development expenses for fiscal 2025 increased 9.8% compared to fiscal 2024. This increase was primarily due to higher personnel costs including increased compensation costs and employee headcount additions in the trailing twelve months and internal license and fees expenses from price increases and more deployments in the current fiscal year. The increase in this expense category for the current fiscal year reflects our continuing commitment to the development of strategic products. Research and development expense remained consistent as a percentage of total revenue for fiscal 2025 compared to fiscal 2024. \nSelling, General, and Administrative\nYear Ended June 30,\n%\nChange\n \n2025\n2024\nSelling, general, and administrative\n$\n283,055\n \n$\n278,419 \n1.7%\nPercentage of total revenue\n12%\n13%\n \nSelling, general, and administrative costs included all expenses related to sales efforts, commissions, finance, legal, and human resources, plus all administrative costs. \nSelling, general, and administrative expenses for fiscal 2025 increased 1.7% compared to fiscal 2024. Reducing total selling, general, and administrative expense for deconversion costs from each year, which totaled $2,725 in fiscal 2025 and $1,177 in fiscal 2024 and VEDIP program expenses of $16,443 in the prior fiscal year, results in a 7.5% increase. This increase was primarily due to higher personnel costs, excluding severance, including increased compensation and employee headcount additions in the trailing twelve months, increased travel expenses, and higher contract labor, partially offset by the gain on the sale of assets in the current fiscal year compared to the loss on the sale of assets last fiscal year. Selling, general, and administrative expenses decreased 1% as a percentage of total revenue for fiscal 2025 compared to fiscal 2024.\n27\nTable of Contents\nINTEREST INCOME AND EXPENSE\nYear Ended June 30,\n%\nChange\n \n2025\n2024\nInterest income\n$\n27,759\n \n$\n25,012 \n11.0%\nInterest expense\n$\n(10,438)\n$\n(16,384)\n(36.3)%\nInterest income increased over the prior fiscal year due to increased interest earned on balances fiscal year over fiscal year. Interest expense decreased in fiscal 2025 mainly due to the timing and amounts of borrowed and repaid balances ending the current fiscal year with no remaining debt outstanding.\nPROVISION FOR INCOME TAXES\nYear Ended June 30,\n%\nChange\n \n2025\n2024\nProvision for income taxes\n$\n130,288\n \n$\n116,203 \n12.1%\nEffective rate\n22.2%\n23.3%\nThe decrease in the Company's effective tax rate in fiscal 2025 compared to fiscal 2024 was the result of differences in the change in uncertain tax positions between the two periods as well as a favorable state law change in the current fiscal year.\nNET INCOME\nYear Ended June 30,\n%\nChange\n \n2025\n2024\nNet income\n$\n455,748\n \n$\n381,816 \n19.4%\nDiluted earnings per share\n$\n6.24\n \n$\n5.23 \n19.3%\nNet income grew 19.4% to $455,748, or $6.24 per diluted share, in fiscal 2025 from $381,816, or $5.23 per diluted share, in fiscal 2024. The diluted earnings per share increase fiscal year over fiscal year was 19.3%. This increase was primarily due to organic growth in our lines of revenue and the decrease in one-time severance expenses related to VEDIP fiscal year over fiscal year, partially offset by higher operating expenses in fiscal 2025 compared to fiscal 2024 .\nREPORTABLE SEGMENT DISCUSSION\nThe Company is a well-rounded financial technology company and is a leading provider of technology solutions and payment processing services primarily to community and regional banks and credit unions.  The Company’s operations are classified into four reportable segments: Core, Payments, Complementary, and Corporate and Other.  The Core segment provides core information processing platforms to banks and credit unions, which consist of integrated applications required to process deposit, loan, and general ledger transactions, and maintain centralized accountholder information. The Payments segment provides secure payment processing tools and services, including ATM, debit, and credit card processing services, online and mobile bill pay solutions, ACH origination and remote deposit capture processing, and risk management products and services. The Complementary segment provides additional software, hosted processing platforms, and services, including digital/mobile banking, treasury services, online account opening, fraud/anti-money laundering (\"AML\") and lending/deposit solutions that can be integrated with the Company's Core solutions, and many can be used independently. The Corporate and Other segment includes revenue and costs from hardware and other products not attributed to any of the other three segments, as well as operating expenses not directly attributable to the other three segments.\nThe Company evaluates the performance of its segments and allocates resources to them based on various factors, including performance against trend, budget, and forecast. Only revenue and costs of revenue are considered in the evaluation for each segment. \n28\nTable of Contents\nImmaterial adjustments between segments were made in fiscal 2025 to reclassify cost of revenue that was recognized in fiscal years 2024 and 2023. These reclasses were made to be consistent with the current allocation of cost of revenue by segment. Cost of revenue reclassed for the fiscal year ended June 30, 2024, from Complementary to Corporate and Other, was $4,922. Cost of revenue reclassed for the fiscal year ended June 30, 2023, from Core and Complementary to Corporate and Other, was $64 and $5,206, respectively.\nCore\n \n2025\n% Change\n2024\nRevenue\n$\n739,277\n \n7.0%\n$\n690,738 \nCost of Revenue\n$\n297,372\n \n3.5%\n$\n287,349 \nIn fiscal 2025, revenue in the Core segment increased 7.0% compared to fiscal 2024. Reducing total Core revenue by deconversion revenue from both fiscal years, which totaled $14,765 in fiscal 2025 and $7,292 in fiscal 2024, Core segment revenue increased 6.0%. This increase was primarily driven by organic increases in our data processing and hosting revenue within cloud. Cost of revenue in the Core segment increased 3.5% for fiscal 2025 compared to fiscal 2024. Reducing total Core cost of revenue by deconversion costs from both fiscal years, which totaled $2,096 in fiscal 2025 and $1,065 in fiscal 2024, Core segment cost of revenue increased 3.1%. This increase was primarily due to increased direct costs associated with the organic growth in cloud revenue. Core segment cost of revenue decreased 1% as a percentage of revenue for fiscal 2025 compared to fiscal 2024.\nPayments\n \n2025\n% Change\n2024\nRevenue\n$\n873,498\n \n6.8%\n$\n817,708 \nCost of Revenue\n$\n460,151\n \n4.1%\n$\n442,084 \nIn fiscal 2025, revenue in the Payments segment increased 6.8% compared to fiscal 2024. Reducing total Payments revenue by deconversion revenue from both fiscal years, which totaled $11,159 in fiscal 2025 and $5,836 in fiscal 2024, Payments segment revenue increased 6.2%. This increase was primarily driven by growth within card revenue and payment processing within remittance revenue. Cost of revenue in the Payments segment increased 4.1% for fiscal 2025 compared to fiscal 2024. This increase was primarily due to increased direct costs related to growth in the card and remittance revenue lines, increased personnel costs including higher compensation costs in the trailing twelve months, and increased internal licenses and fees expense from more deployments and pricing in the current fiscal year. Deconversion and/or severance costs did not significantly affect the Payments segment cost of revenue fiscal year over fiscal year. Payments segment cost of revenue decreased 1% as a percentage of revenue for fiscal 2025 compared to fiscal 2024.\nComplementary\n \n2025\n% Change\n2024\nRevenue\n$\n675,209\n \n9.2%\n$\n618,211 \nCost of Revenue\n$\n264,823\n \n5.5%\n$\n251,085 \nRevenue in the Complementary segment increased 9.2% for fiscal 2025 compared to fiscal 2024. Reducing total Complementary revenue by deconversion revenue from both fiscal years, which totaled $7,709 in fiscal 2025 and $3,217 in fiscal 2024, Complementary segment revenue increased 8.5%. This increase was primarily driven by organic increases in hosting and digital revenues within cloud and higher maintenance fee revenue. Cost of revenue in the Complementary segment increased 5.5% for fiscal 2025 compared to fiscal 2024. Reducing total Complementary cost of revenue by deconversion costs from both fiscal years, which totaled $1,119 in fiscal 2025 and $903 in fiscal 2024, Complementary segment cost of revenue increased 5.4%. This increase was primarily due to higher direct costs related to the organic growth in the digital and hosting within cloud revenue lines, increased personnel costs including higher compensation costs in the trailing twelve months, and higher amortization of capitalized software. Complementary segment cost of revenue decreased 1% as a percentage of revenue for fiscal 2025 compared to fiscal 2024.\n29\nTable of Contents\nCorporate and Other\n \n2025\n% Change\n2024\nRevenue\n$\n87,304\n \n(1.8)%\n$\n88,886 \nCost of Revenue\n$\n338,401\n \n6.1%\n$\n318,959 \nRevenue in the Corporate and Other segment decreased 1.8% for fiscal 2025 compared to fiscal 2024. Reducing total Corporate and Other revenue by deconversion revenue from both fiscal years, which totaled $272 in fiscal 2025 and $209 in fiscal 2024, Corporate and Other segment revenue decreased 1.9%. This decrease was mainly due to decreased hardware revenue, partially offset by increased processing fee revenue and software usage and subscription revenues within support.\nCost of revenue for the Corporate and Other segment includes operating expenses not directly attributable to any of the other three segments and increased 6.1% for fiscal 2025 compared to fiscal 2024. This increase was primarily related to higher direct costs, increased personnel costs including increased compensation costs and employee headcount additions in the trailing twelve months, and higher cloud consumption costs. Deconversion and/or severance costs did not significantly affect Corporate and Other cost of revenue fiscal year over fiscal year.\nLIQUIDITY AND CAPITAL RESOURCES\nThe Company's cash and cash equivalents increased to $101,953 at June 30, 2025, from $38,284 at June 30, 2024. The following table summarizes net cash from operating activities in the statement of cash flows:\nYear Ended\nJune 30,\n2025\n2024\nNet income\n$\n455,748\n \n$\n381,816 \nNon-cash expenses\n231,613\n \n231,709 \nChange in receivables\n15,056\n \n28,219 \nChange in deferred revenue\n(25,559)\n(10,797)\nChange in other assets and liabilities\n(35,354)\n(62,906)\nNet cash provided by operating activities\n$\n641,504\n \n$\n568,041 \nCash provided by operating activities for fiscal 2025 increased 12.9% compared to fiscal 2024, primarily due to the increase in Net income and the net changes in prepaid expenses, deferred costs and other and accrued expenses within Change in other assets and liabilities fiscal year over fiscal year. Cash from operations is primarily used to repay debt, pay dividends, repurchase stock, and for capital expenditures.\nCash used in investing activities for fiscal 2025 totaled $232,163 and included: $172,445 for the ongoing enhancements and development of existing and new product and service offerings; capital expenditures on facilities and equipment of $53,358, mainly for the purchase of computer equipment; $5,363 for the purchase and development of internal use software; and $2,000 for the purchase of investments. These expenditures were partially offset by proceeds from investments of $1,000 and $3 of proceeds from the sale of assets. \nCash used in investing activities for fiscal 2024 totaled $240,165 and included: $167,175 for the ongoing enhancements and development of existing and new product and service offerings; capital expenditures on facilities and equipment of $58,118, mainly for the purchase of computer equipment; $8,646 for the purchase of investments; and $7,130 for the purchase and development of internal use software. These expenditures were partially offset by $904 of proceeds from the sale of assets.\nFinancing activities used cash of $345,672 for fiscal 2025 and included: $164,644 for dividends paid to stockholders; borrowings and repayments on our credit facilities which netted to repayments of $150,000; and $35,051 for the purchase of treasury shares. These expenditures were partially offset by $4,023 of net cash inflow related to stock-based compensation.  \nFinancing activities used cash in fiscal 2024 of $301,835 and included $155,877 for dividends paid to stockholders; borrowings and repayments on our revolving credit facility which netted to repayments of $125,000; and $28,055 for the purchase of treasury shares. These expenditures were partially offset by $7,097 of net cash inflow related to stock-based compensation.\n30\nTable of Contents\nCapital Requirements and Resources\nThe Company generally uses existing resources and funds generated from operations to meet its capital requirements. Capital expenditures totaling $53,358 and $58,118 for fiscal years ended June 30, 2025, and June 30, 2024, respectively, were made primarily for additional equipment and the improvement of existing facilities. These additions were funded from cash generated by operations. At June 30, 2025, the Company had $58,182 of significant outstanding purchase commitments related to property and equipment. We assessed our liquidity needs throughout fiscal 2025, and determined we had adequate capital resources and sufficient access to external financing sources to satisfy our current and reasonably anticipated funding needs. We will continue to monitor and assess these needs going forward.\nAt June 30, 2025, the Company had contractual obligations of $1,700,611, including operating lease obligations, and $1,643,789 related to off-balance sheet contractual purchase obligations. Included in off-balance sheet contractual purchase obligations was the strategic services agreement that offers full-service debit and credit card processing on a single platform to our customers. This agreement was signed in fiscal 2017 and amended in May 2025 to add two additional service years and $213,053 to contractual obligations, bringing the total remaining purchase commitment at June 30, 2025 to $1,022,283 over the remaining term of the contract, which now extends to January 2038, subject to certain renewal terms. Contractual obligations exclude $22,649 of liabilities for uncertain tax positions as we are unable to reasonably estimate the ultimate amount or timing of settlement.\nOn July 4, 2025, the President of the United States signed into law legislation referred to as “One Big Beautiful Bill Act” (H.R. 1), which enacts substantial changes to the federal income tax law. The legislation includes several business-focused provisions, such as the restoration of immediate expensing for domestic research and development expenditures and the reinstatement of 100% bonus depreciation for qualified property placed in service after January 19, 2025. The Act also permanently extends key provisions from the Tax Cuts and Jobs Act (TCJA). As the legislation was enacted after the June 30, 2025, balance sheet date, the financial implications are not included in the current fiscal year's financial statements. The Company is in the process of assessing the impacts of the new law and plans to incorporate updates in the financial results next fiscal year beginning in the quarter ending September 30, 2025.\nThe Board of Directors has authorized the Company to repurchase shares of its common stock. Under this authorization, the Company may finance its share repurchases with available cash reserves or short-term borrowings on its existing credit facilities. The share repurchase program does not include specific price targets or timetables and may be suspended at any time. At June 30, 2025, there were 31,580 shares in treasury stock and the Company had the remaining authority to repurchase up to 3,411 additional shares. The total cost of treasury shares at June 30, 2025 was $1,895,224. During fiscal 2025, the Company repurchased 207 treasury shares for $35,051. At June 30, 2024, there were 31,373 shares in treasury stock and the Company had authority to repurchase up to 3,618 additional shares.\nCredit facilities\nOn August 31, 2022, the Company entered into a five-year senior, unsecured amended and restated credit agreement. The credit agreement allows for borrowings of up to $600,000, which may be increased to $1,000,000 by the Company at any time until maturity. The credit agreement bears interest at a variable rate equal to (a) a rate based on an adjusted Secured Overnight Financing Rate (\"SOFR\") term rate or (b) an alternate base rate (the highest  of (i) 0%, (ii) the Prime Rate for such day, (iii) the sum of the Federal Funds Effective Rate for such day \nplus \n0.50% per annum and (iv) the Adjusted Term SOFR Screen Rate (without giving effect to the Applicable Margin) for a one month Interest Period on such day for Dollars \nplus \n1.0%), plus an applicable percentage in each case determined by the Company's leverage ratio. The credit agreement is guaranteed by certain subsidiaries of the Company and is subject to various financial covenants that require the Company to maintain certain financial ratios as defined in the credit agreement. As of June 30, 2025, the Company was in compliance with all such covenants. The credit facility terminates August 31, 2027. There was $0 and $60,000 outstanding under the amended and restated credit facility at June 30, 2025, and June 30, 2024, respectively.\nTerm loan facility\nOn May 16, 2023, the Company entered into a term loan credit agreement with a syndicate of financial institutions, with an original principal balance of $180,000. Borrowings under the term loan facility bore interest at a variable rate equal to (a) a rate based on an adjusted SOFR term rate or (b) an alternate base rate (the highest of (i) 0%, (ii) the Prime Rate for such day, (iii) the sum of the Federal Funds Effective Rate for such day \nplus \n0.50% per annum and (iv) the Adjusted Term SOFR Screen Rate (without giving effect to the Applicable Margin) for a one month Interest Period on such day for Dollars \nplus \n0.75%), plus an applicable percentage in each case determined by the Company's leverage ratio. The term loan credit agreement was guaranteed by certain subsidiaries of the Company \n31\nTable of Contents\nand was subject to various financial covenants that required the Company to maintain certain financial ratios as defined in the term loan credit agreement. The term loan credit agreement matured on May 16, 2025, and at the maturity date the Company was in compliance with all such covenants. There was $0 and $90,000 outstanding under the term loan at June 30, 2025, and June 30, 2024, respectively.\nOther lines of credit\nThe Company had an unsecured bank credit line which provided for funding of up to $5,000 and bore interest at the prime rate \nless\n 1.0%. The credit line expired on April 30, 2025. There was no balance outstanding at June 30, 2025, or 2024. \nOn October 31, 2024, the Company entered into a discretionary line of credit demand note, which provides for funding of up to $50,000 and bears interest at the prime rate\n less\n 2.0%. The note does not constitute a committed line of credit. The line of credit expires on October 31, 2025. There was no balance outstanding at June 30, 2025.\nOn July 18, 2025, the Company entered into a new unsecured committed revolving line of credit facility with a commercial bank in the amount of $50,000, which bears interest at the prime rate \nless\n 1.0%. The line of credit expires on July 17, 2026.\nRECENT ACCOUNTING PRONOUNCEMENTS\nRecently Adopted Accounting Guidance\nIn November 2023, the FASB issued ASU No. 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures, which improves the disclosures about a public entity's reportable segments through enhanced disclosures about significant segment expenses that are regularly provided to the chief operating decision maker. The ASU is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, and should be applied retrospectively to all prior periods presented in the financial statements. The Company adopted this ASU effective for the fiscal year ended June 30, 2025, with retrospective application of the additional segment information for the fiscal years ended June 30, 2024, and 2023. Additional information regarding the Company's reportable segments is included in Note 14—Reportable Segment Information.\nNot Adopted at Fiscal Year End\nIn December 2023, the FASB issued ASU No. 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures, which enhances the transparency and decision usefulness of income tax disclosures. The ASU requires additional disclosure related to rate reconciliation, income taxes paid, and other disclosures to improve the effectiveness of income tax disclosures. The ASU is effective for annual periods beginning after December 15, 2024, and applied on a prospective basis. Early adoption and retrospective application is permitted. The Company is currently evaluating the impact of this ASU on its consolidated financial statements and related disclosures.\nIn November 2024, the FASB issued ASU No. 2024-03, Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses, which requires more detailed disclosures of certain categories of expenses such as employee compensation, depreciation, and intangible asset amortization that are components of existing expense captions presented on the face of the consolidated statements of income. The ASU is effective for annual reporting periods beginning after December 15, 2026, and interim reporting periods within annual reporting periods beginning after December 15, 2027. Early adoption is permitted. The Company is currently evaluating the impact of this ASU on its consolidated financial statements and related disclosures.\nCRITICAL ACCOUNTING ESTIMATES\nWe prepare our consolidated financial statements in accordance with U.S. GAAP. The significant accounting policies are discussed in Note 1 to the consolidated financial statements. The preparation of consolidated financial statements in accordance with U.S. GAAP requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue and expenses, as well as disclosure of contingent assets and liabilities. We base our estimates and judgments upon historical experience and other factors believed to be reasonable under the circumstances. Changes in estimates or assumptions could result in a material adjustment to the consolidated financial statements.\nWe have identified several critical accounting estimates. An accounting estimate is considered critical if both: (a) the nature of the estimates or assumptions is material due to the levels of subjectivity and judgment involved, and (b) \n32\nTable of Contents\nthe impact of changes in the estimates and assumptions would have a material effect on the consolidated financial statements.\nRevenue Recognition\nWe generate revenue from data processing, transaction processing, software licensing and related services, professional services, and hardware sales.\nIdentification of performance obligations\nWe enter into contracts with clients that may include multiple types of goods and services. At contract inception,  we assess the solutions and services promised in our contracts with clients and identify a performance obligation for each promise to transfer to the client a solution or service (or bundle of solutions or services) that is distinct — that is, if the solution or service is separately identifiable from other items in the arrangement and if the client can benefit from the solution or service on its own or together with other resources that are readily available. Judgment is used in the identification and accounting for all performance obligations. We recognize revenue when or as we satisfy each performance obligation by transferring control of a solution or service to the client.\nDetermination of transaction price\nThe amount of revenue recognized is based on the consideration we expect to receive in exchange for transferring goods and services to the client. Our contracts with our clients frequently contain some component of variable consideration. We estimate variable consideration in our contracts primarily using the expected value method, based on both historical and current information. Where appropriate, we may constrain the estimated variable consideration included in the transaction price in the event of a high degree of uncertainty as to the final consideration amount. Significant judgment is used in the estimate of variable consideration of client contracts that are long-term and include varying transactional volumes.\nAllocation of transaction price\nThe transaction price, once determined, is allocated between the various performance obligations in the contract based upon their relative standalone selling prices. The standalone selling prices are determined based on the prices at which we separately sell each good or service. For items that are not sold separately, we estimate the standalone selling prices using all information that is reasonably available, including reference to historical pricing data.\nContract costs\nWe incur incremental costs to obtain a contract as well as costs to fulfill contracts with clients that are expected to be recovered. These costs consist primarily of sales commissions, which are incurred only if a contract is obtained, and client conversion or implementation-related costs. \nCapitalized costs are amortized based on the transfer of goods or services to which the asset relates, in line with the percentage of revenue recognized for each performance obligation to which the costs are allocated.\nCapitalization of software development costs\nWe capitalize certain costs incurred for use in our cloud-based services and to develop commercial software products. For internal use software, capitalization begins at the beginning of application development. Costs incurred prior to this are expensed as incurred. Significant estimates and assumptions include determining the appropriate amortization period based on the estimated useful life and assessing the unamortized cost balances for impairment. Amortization begins on the date the software is placed in service and the amortization period is based on estimated useful life\nFor software that is to be sold, significant areas of judgment include: establishing when technological feasibility has been met and costs should be capitalized, determining the appropriate period over which to amortize the capitalized costs based on the estimated useful lives, estimating the marketability of the commercial software products and related future revenues, and assessing the unamortized cost balances for impairment. Costs incurred prior to establishing technological feasibility are expensed as incurred. Amortization begins on the date of general release and the appropriate amortization period is based on estimates of future revenues from sales of the products. We consider various factors to project marketability and future revenues, including an assessment of alternative solutions or products, current and historical demand for the product, and anticipated changes in technology that may make the product obsolete. \nA significant change in an estimate related to one or more software products could result in a material change to our results of operations.\n33\nTable of Contents\nPurchase accounting\nWe account for our acquisitions using the purchase method of accounting. This method requires estimates to determine the fair values of assets and liabilities acquired, including judgments to determine any acquired intangible assets such as computer software and client-related intangibles. Third-party valuation firms may be used to assist in the appraisal of certain assets and liabilities, but even those determinations would be based on significant estimates provided by us, such as forecast revenues or profits on contract-related intangibles. Numerous factors are typically considered in the purchase accounting assessments, which are conducted by Company professionals from legal, finance, human resources, information systems, program management and other disciplines. Changes in assumptions and estimates of the acquired assets and liabilities would result in changes to the fair values, resulting in an offsetting change to the goodwill balance associated with the business acquired.",
  "item2": null
}